{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ti6kJ80ZB8RZTiDIzPkhaCJMoqq.jpg",
                "genre_ids": [
                    35,
                    80
                ],
                "id": 115,
                "original_language": "en",
                "original_title": "The Big Lebowski",
                "overview": "Jeffrey 'The Dude' Lebowski, a Los Angeles slacker who only wants to bowl and drink White Russians, is mistaken for another Jeffrey Lebowski, a wheelchair-bound millionaire, and finds himself dragged into a strange series of events involving nihilists, adult film producers, ferrets, errant toes, and large sums of money.",
                "popularity": 8.7952,
                "poster_path": "/9mprbw31MGdd66LR0AQKoDMoFRv.jpg",
                "release_date": "1998-03-06",
                "title": "The Big Lebowski",
                "video": false,
                "vote_average": 7.84,
                "vote_count": 11679,
                "character": "Saddam",
                "credit_id": "568efd20c3a368590600400c",
                "order": 37
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Jerry Haleva (born May 26, 1946) is an American actor and political lobbyist. He gained fame as an actor as a doppelgänger of Saddam Hussein due to his physical resemblance to the late Iraqi leader, with all of his film roles having him portraying Hussein.\n\nJerry Haleva, a Sephardic Jew, is a member of the Republican Party and has worked as a lobbyist for the American Israel Public Affairs Committee, among others. In 1973, he was an adviser to a legislative committee investigating prison conditions in California. He served in the California Senate in 1977 as chief of staff for William Campbell.\n\nIn 1989, a colleague of Haleva distributed a photo of the then-Iraqi leader Saddam Hussein among his co-workers with the text \"Now we know what Haleva does on his weekends\". A few years later, Haleva contacted Ron Smith, who represented doppelgängers in the film industry, and Smith had a small role for Haleva in the feature film Hot Shots! (1991), followed by a more prominent role in its sequel, Hot Shots! Part Deux (1993). Haleva played Hussein in half a dozen films. Besides the Hot Shots! movies and The Big Lebowski, he appeared in a few other films and also appeared in commercials (including for Nintendo).\n\nIn the spring of 2003, when Iraq was invaded, he decided to stop working as Hussein's doppelgänger. In January 2004 he came back to this decision and said in an interview that he was interested in continuing his acting career.\n\nAs of 2016, he was a contract lobbyist (Sergeant Major Associates) and lived in Sacramento, California.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1000228,
        "imdb_id": "nm0355062",
        "known_for_department": "Acting",
        "name": "Jerry Haleva",
        "place_of_birth": null,
        "popularity": 0.1556,
        "profile_path": "/35qEndFolCdLDkAKIbXammIlLyt.jpg"
    }
}