{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4hfcpHmMEgmFTdnVx4XCtM6dgCG.jpg",
                "genre_ids": [
                    14,
                    12,
                    28,
                    10751,
                    10749
                ],
                "id": 102651,
                "original_language": "en",
                "original_title": "Maleficent",
                "overview": "A beautiful, pure-hearted young woman, Maleficent has an idyllic life growing up in a peaceable forest kingdom, until one day when an invading army threatens the harmony of the land. She rises to be the land's fiercest protector, but she ultimately suffers a ruthless betrayal – an act that begins to turn her heart into stone. Bent on revenge, Maleficent faces an epic battle with the invading King's successor and, as a result, places a curse upon his newborn infant Aurora. As the child grows, Maleficent realizes that Aurora holds the key to peace in the kingdom – and to Maleficent's true happiness as well.",
                "popularity": 10.0967,
                "poster_path": "/bDG3yei6AJlEAK3A5wN7RwFXQ7V.jpg",
                "release_date": "2014-05-28",
                "title": "Maleficent",
                "video": false,
                "vote_average": 7.089,
                "vote_count": 13415,
                "character": "Farmer",
                "credit_id": "55e41e5bc3a368418b0033ee",
                "order": 30
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Born and raised in Bridgend, Tim Treloar worked in the Civil Service for nearly a decade before training for 3 years at The London Academy Of Music And Dramatic Art (LAMDA). He is now well known as an accomplished and versatile actor.\n\nTim has performed on Broadway, at The Royal Shakespeare Company, Brooklyn Academy Of Music and Royal National Theatre. He is a veteran of stage, screen and audio, working as far afield as the Caribbean, Sydney, New York and LA.  Tim has played the audio Third Doctor Who to critical acclaim for several years and is a winner of the BBC Carleton Hobbs Award.  Tim has performed in Motion-Capture, narrated audiobooks and played an assassin for Norwegian TV. He has been a dialect coach for Robert Downey Jr and written an online comedy series which was featured in The British Comedy Guide.",
        "birthday": "1968-09-04",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.timtreloar.com/about",
        "id": 1001523,
        "imdb_id": "nm0871845",
        "known_for_department": "Acting",
        "name": "Tim Treloar",
        "place_of_birth": "Bridgend, Wales, UK",
        "popularity": 0.0585,
        "profile_path": "/bZrvMVInpWyLgkuortLrhyZUQA5.jpg"
    }
}