{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4zzWj2pVmkjN9yjsQesEEnNtlZ4.jpg",
                "genre_ids": [
                    28,
                    53,
                    80
                ],
                "id": 94329,
                "original_language": "id",
                "original_title": "Serbuan Maut",
                "overview": "Deep in the heart of Jakarta's slums lies an impenetrable safe house for the world's most dangerous killers and gangsters. Until now, the run-down apartment block has been considered untouchable to even the bravest of police. Cloaked under the cover of pre-dawn darkness and silence, an elite swat team is tasked with raiding the safe house in order to take down the notorious drug lord that runs it.  But when a chance encounter with a spotter blows their cover and news of their assault reaches the drug lord, the building's lights are cut and all the exits blocked. Stranded on the sixth floor with no way out, the unit must fight their way through the city's worst to survive their mission. Starring Indonesian martial arts sensation Iko Uwais.",
                "popularity": 4.3056,
                "poster_path": "/Abnm1Ws3JH0ReCfEhLMPwPcMcGO.jpg",
                "release_date": "2012-03-22",
                "title": "The Raid",
                "video": false,
                "vote_average": 7.405,
                "vote_count": 3643,
                "character": "Budi",
                "credit_id": "52fe49529251416c750c4473",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Zulverdi Amos Solaiman",
            "Verdi Solaeman",
            "Verdy Soelaeman",
            "Verdy Sulaiman",
            "Verdy Solaiman"
        ],
        "biography": "Zulverdi Amos Solaiman (born March 14, 1975, in Jakarta, Indonesia) is an Indonesian actor, educator, director, and producer of Chinese descent.\n\nAfter spending 10 years of both college and work, majoring in Advertising Design in Columbus, Ohio, Verdi Solaiman fell in love with acting when he came back to Indonesia in 2004 -- as he stumbled upon the acting school Sakti Aktor Studio.\n\nThere, he was involved in a lot of Off-Broadway theatre work, with the production of \"Mass Appeal\" by Bill C. Davis as his thesis play -- a two-hour play and acted in English, he acted alongside Arifin Putra. Verdi started his movie career after starring in his debut film Jakarta Undercover (2007). Aside from acting, Verdi has worked as a creative director for feature film promos since 2006.\n\n(Taken from Wikipedia)",
        "birthday": "1975-03-14",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1001667,
        "imdb_id": "nm2681362",
        "known_for_department": "Acting",
        "name": "Verdi Solaiman",
        "place_of_birth": "Jakarta, Indonesia",
        "popularity": 0.4606,
        "profile_path": "/7ENr0tx8T2ofSYAMTTWfGs8w6d5.jpg"
    }
}