{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uGXid3UHMzoL2hyNfWSPDWkqbKC.jpg",
                "genre_ids": [
                    27,
                    878
                ],
                "id": 10787,
                "original_language": "en",
                "original_title": "The Invisible Man",
                "overview": "After experimenting on himself and becoming invisible, scientist Jack Griffin, now aggressive due to the drug's effects, seeks a way to reverse the experiment at any cost.",
                "popularity": 2.034,
                "poster_path": "/ewfUA5pMEJrmQCdI4TsHmLlIUbf.jpg",
                "release_date": "1933-11-03",
                "title": "The Invisible Man",
                "video": false,
                "vote_average": 7.507,
                "vote_count": 893,
                "character": "Chief Detective",
                "credit_id": "52fe43b79251416c7501b5d3",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Dudley Diggs",
            "John Dudley Digges"
        ],
        "biography": "​From Wikipedia, the free encyclopedia\n\nDudley Digges (June 9, 1879 – October 24, 1947) was an Irish character actor on stage and in motion pictures.\n\nHe was born in Dublin. He went to America with a group of Irish players in 1904 and became successful both as an actor and producer. For a time he was stage manager to Charles Frohman and George Arliss. He went to Hollywood in 1930.\n\nOn stage, one of his famous roles was as Ficsur in the original 1921 Broadway production of Ferenc Molnár's Liliom, the play that Rodgers and Hammerstein later musicalized as Carousel. Ficsur was the criminal who talks Liliom into helping him commit a robbery; in Carousel, his name was changed to Jigger Craigin, but the character otherwise remained almost the same. He played the role of the Heavenly Examiner in both the original Broadway and the 1930 screen versions of Sutton Vane's hit play Outward Bound.\n\nDigges appeared in forty films between 1929 and 1946, including the original, nearly forgotten 1931 version of The Maltese Falcon, as Caspar Gutman, the character later made famous by Sydney Greenstreet in the 1941 Humphrey Bogart film version of the story. He also worked as a director on Broadway.\n\nIn 1924, Digges founded the Maverick Theater, in Woodstock, New York, with the assistance of Hervey White, the founder of the Maverick Arts Colony. Digges was artistic director of a company that included Helen Hayes and Edward G. Robinson.\n\nDescription above from the Wikipedia article Dudley Digges (actor), licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1879-06-08",
        "deathday": "1947-10-24",
        "gender": 2,
        "homepage": null,
        "id": 100243,
        "imdb_id": "nm0226502",
        "known_for_department": "Acting",
        "name": "Dudley Digges",
        "place_of_birth": "Dublin, Ireland, UK [now Republic of Ireland]",
        "popularity": 0.1176,
        "profile_path": "/1VCZYSSO7JTrwMLeI1NBp4d7o2x.jpg"
    }
}