{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sU3gFo7Gn67zjtKXIvzJ4omcUbH.jpg",
                "genre_ids": [
                    36,
                    18,
                    12
                ],
                "id": 665,
                "original_language": "en",
                "original_title": "Ben-Hur",
                "overview": "In 25 AD, Judah Ben-Hur, a Jew in ancient Judea, opposes the occupying Roman empire.  Falsely accused by a Roman childhood friend-turned-overlord of trying to kill the Roman governor, he is put into slavery and his mother and sister are taken away as prisoners.",
                "popularity": 5.7433,
                "poster_path": "/m4WQ1dBIrEIHZNCoAjdpxwSKWyH.jpg",
                "release_date": "1959-11-18",
                "title": "Ben-Hur",
                "video": false,
                "vote_average": 7.886,
                "vote_count": 2943,
                "character": "Balthasar",
                "credit_id": "52fe4266c3a36847f801ba37",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/qQGHkmLWPcMGkKws78pFh14SzUo.jpg",
                "genre_ids": [
                    18,
                    36,
                    10749
                ],
                "id": 8095,
                "original_language": "en",
                "original_title": "Cleopatra",
                "overview": "Determined to hold on to the throne, Cleopatra seduces the Roman emperor Julius Caesar. When Caesar is murdered, she redirects her attentions to his general, Marc Antony, who vows to take power—but Caesar’s successor has other plans.",
                "popularity": 6.4864,
                "poster_path": "/bj7rUGUewofA9cpHt1h36gvDFfy.jpg",
                "release_date": "1963-06-12",
                "title": "Cleopatra",
                "video": false,
                "vote_average": 7.04,
                "vote_count": 800,
                "character": "Titus",
                "credit_id": "5e1b156b6a300b00135c22f3",
                "order": 31
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "William Finlay Currie"
        ],
        "biography": "Finlay Jefferson Currie (20 January 1878 – 9 May 1968) was a Scottish actor of stage, screen and television.\n\nBorn in Edinburgh, Scotland, Currie's acting career began on the stage. He and his wife Maude Courtney (1884–1959) did a song and dance act in the US in the 1890s. He made his first film (The Old Man) in 1931. He appeared as a priest in the 1943 Ealing World War II movie Undercover. His most famous film role was as the convict Abel Magwitch in David Lean's Great Expectations (1946), based on the novel, 'Great Expectations' by Charles Dickens. He later began to appear in Hollywood film epics, including the 1951 Quo Vadis (as Saint Peter), the multi-Oscar winning 1959 Ben-Hur, as Balthazar, one of the Three Wise Men, and The Fall of the Roman Empire (1964) as an aged, wise senator; He appeared in People Will Talk with Cary Grant; and he also portrayed Robert Taylor's embittered father in MGM's Technicolor 1952 version of Ivanhoe. In 1962, he starred in an episode of The DuPont Show of the Week (NBC) entitled The Ordeal of Dr. Shannon, an adaptation of A. J. Cronin's novel, Shannon's Way. Currie's last role was as Mr. Lundie, the minister, in the 1966 television adaptation of the musical Brigadoon. In one of his very last performances, Currie plays a dying mafioso boss in the two part \"Vendetta For The Saint\" (1968) starring Roger Moore.\n\nLater in life he became a much respected antiques dealer, specialising in coins and precious metals. He had been a long time collector of the works of Robert Burns.\n\nDescription above from the Wikipedia article Finlay Currie, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1878-01-19",
        "deathday": "1968-05-09",
        "gender": 2,
        "homepage": null,
        "id": 10027,
        "imdb_id": "nm0192958",
        "known_for_department": "Acting",
        "name": "Finlay Currie",
        "place_of_birth": "Edinburgh, Scotland, UK",
        "popularity": 0.2182,
        "profile_path": "/okHKOxm5wmFu513NsK3JNI7fMkr.jpg"
    }
}