{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hgFyxEtHCMDJQc2TdXSl3FGIs2.jpg",
                "genre_ids": [
                    10752,
                    12,
                    53,
                    28
                ],
                "id": 10911,
                "original_language": "en",
                "original_title": "The Guns of Navarone",
                "overview": "A team of allied saboteurs are assigned an impossible mission: infiltrate an impregnable Nazi-held island and destroy the two enormous long-range field guns that prevent the rescue of 2,000 trapped British soldiers.",
                "popularity": 3.8447,
                "poster_path": "/j6VSFnm20GlkUi8yb7hM5Qfc1fA.jpg",
                "release_date": "1961-04-27",
                "title": "The Guns of Navarone",
                "video": false,
                "vote_average": 7.308,
                "vote_count": 822,
                "character": "Pvt. Spyros Pappadimos",
                "credit_id": "52fe43cf9251416c7501f065",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/josJUt5eVMANf06mxSKnJlwjELB.jpg",
                "genre_ids": [
                    18
                ],
                "id": 407449,
                "original_language": "en",
                "original_title": "Lucky",
                "overview": "Follows the journey of a 90-year-old atheist and the quirky characters that inhabit his off-the-map desert town. He finds himself at the precipice of life, thrust into a journey of self-exploration.",
                "popularity": 2.2827,
                "poster_path": "/fy2K8jqCV9rNC8fHx9muPJTNaqs.jpg",
                "release_date": "2017-09-29",
                "title": "Lucky",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 605,
                "character": "Paulie",
                "credit_id": "58c01059c3a368696700768a",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "James & Evy",
            "James & Gloria",
            "James William Ercolani"
        ],
        "biography": "​From Wikipedia, the free encyclopedia.  \n\nJames William Ercolani (June 8, 1936 - September 2, 2024), known by his stage name James Darren, was an American television and film actor, television director, and singer. He wanted to be an actor and studied in New York City with Stella Adler for a number of years. He would also occasionally sing although he later said \"I wasn't really a singer. I was a kid in Philly whose dad would take him to bars and nightclubs and I would get up and sing two songs.\"\n\nDarren was discovered by talent agent and casting director Joyce Selznick after he got some photographs taken by Maurice Seymour to show potential agents:  His secretary, a woman by the name of Yvonne Bouvier, asked me if I was interested in getting into film. I said yeah, I was. She said I know someone you should meet. She set up a meeting between me and Joyce Selznick, who worked for Screen Gems. Joyce brought me over to Columbia Pictures about a week later and got me a contract there.  Columbia signed Darren to a long term contract in July 1956. A few weeks later, he was filming his first film, Rumble on the Docks.  His appearance was well received and he got a lot of fan mail - second at the studio only to Kim Novak. Darren guest starred on an episode of TV's The Web (\"Kill and Run\") then Columbia gave him a support role in an \"A\" picture, the comedy Operation Mad Ball, starring Jack Lemmon.\n\nHe had support roles in two films directed by Phil Karlson: The Brothers Rico and Gunman's Walk. In between he was in The Tijuana Story, although his role was relatively small. Darren was third billed in the surf film, Gidget. He also sang the title track. The film was a hit with teen audiences and so was the song. Darren wound up recording a string of pop hits for Colpix Records, the biggest of which was \"Goodbye Cruel World\". It sold over one million copies, and was awarded a gold disc. Another sizeable hit was \"Her Royal Majesty\". He is also featured in one of the Scopitone series of pop music video jukebox films (\"Because You're Mine\").\n\nDarren was third billed in a series of films for Columbia: The Gene Krupa Story, All the Young Men,  and Let No Man Write My Epitaph. He had a cameo as himself in a teen film, Because They're Young, singing the title track. Darren had a supporting role in the World War II film The Guns of Navarone. Also popular was Gidget Goes Hawaiian, where Darren reprised his role as Moondoggie; he was given top billing.\n\nDarren also acted in Diamond Head as well as a third time in Gidget Goes to Rome, which he sang the title track for, Under the Yum Yum Tree. In 1963, Darren signed a seven picture deal with Universal, starting with The Lively Set. He was the singing voice of Yogi Bear in the animated film, Hey There, It's Yogi Bear!, on the song \"Ven-e, Ven-o, Ven-a\". He was the singing voice of his own character \"Jimmy Darrock\" on an episode of The Flintstones. However the character's dialogue was provided by voice actor Lennie Weinrib.  He subsequently launched a career as a director, notably of action-based series , including Hunter, The A-Team, Silk Stalkings, Renegade, and Nowhere Man, as well as dramas such as Beverly Hills, 90210 and Melrose Place.\n\nDescription above from the Wikipedia article James Darren, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1936-06-08",
        "deathday": "2024-09-02",
        "gender": 2,
        "homepage": null,
        "id": 100318,
        "imdb_id": "nm0201626",
        "known_for_department": "Acting",
        "name": "James Darren",
        "place_of_birth": "Philadelphia, Pennsylvania, USA",
        "popularity": 0.5223,
        "profile_path": "/finbHXyPodyPEb1j2ETRFpAl8ee.jpg"
    }
}