{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/nXvF27feIPaYMS8RGnLubeKcOjW.jpg",
                "genre_ids": [
                    35,
                    80
                ],
                "id": 5506,
                "original_language": "en",
                "original_title": "The Ladykillers",
                "overview": "Five oddball criminals planning a bank robbery rent rooms on a cul-de-sac from an octogenarian widow under the pretext that they are classical musicians.",
                "popularity": 2.3245,
                "poster_path": "/9LJ6ZV59Q92LAJAbmb7xm9dUBGU.jpg",
                "release_date": "1955-12-08",
                "title": "The Ladykillers",
                "video": false,
                "vote_average": 7.274,
                "vote_count": 504,
                "character": "The Superintendent",
                "credit_id": "52fe440ac3a36847f807ebf7",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Джек Уорнер",
            "Horace John Waters"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nJack Warner OBE (24 October 1895 – 24 May 1981) was an English film and television actor.\n\nHe was born in London, his real name being Horace John Waters. His sisters Elsie and Doris Waters were well-known comediennes under the names Gert and Daisy. Like them, Jack Warner made his name in music hall and radio, but he became known to cinema audiences as the patriarch in a trio of popular post-World War II family films beginning with Here Come the Huggetts. He also co-starred in the 1955 Hammer film version of The Quatermass Xperiment and as a police superintendent in the 1955 Ealing Studios black comedy The Ladykillers.\n\nWarner attended the Coopers' Company's Grammar School for Boys in Mile End, while his sisters both attended the nearby sister school, Coborn School for Girls in Bow. The three children were choristers at St. Leonard's Church, Bromley-by-Bow, and for a time, Warner was the choir's soloist.\n\nBy the early war years Warner was nationally known and starred in a BBC radio comedy show Garrison Theatre, invariably opening with, \"A Monologue Entitled...\".\n\nIt was in 1949 that Warner first played the role for which he would be remembered, PC George Dixon, in the film The Blue Lamp. One observer predicted, \"This film will make Jack the most famous policeman in Britain\". Although the police constable was shot dead in the film, the character was revived in 1955 for the BBC television series Dixon of Dock Green, which ran until 1976. In later years though, Warner and his long-past-retirement-age character were confined to a less prominent desk sergeant role. The series had a prime-time slot on Saturday evenings, and always opened with Dixon giving a little soliloquy to the camera, beginning with the words, \"Good evening, all\". According to Warner's autobiography, Jack of All Trades, Elizabeth II once visited the television studio where the series was made and told Warner \"that she thought Dixon of Dock Green had become part of the British way of life\".\n\nHe was appointed an Officer of the Order of the British Empire (OBE) in 1965. In 1973, he was made a Freeman of the City of London. Warner commented in his autobiography that the honour \"entitles me to a set of 18th century rules for the conduct of life urging me to be sober and temperate\". Warner added, \"Not too difficult with Dixon to keep an eye on me!\"\n\nThe characterisation by Warner of Dixon was held in such high regard that officers from Paddington Green Police Station bore the coffin at his funeral in 1981.\n\nWarner is buried in East London Cemetery.  Description above from the Wikipedia article Jack Warner (actor), licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1895-10-22",
        "deathday": "1981-05-24",
        "gender": 2,
        "homepage": null,
        "id": 100343,
        "imdb_id": "nm0912487",
        "known_for_department": "Acting",
        "name": "Jack Warner",
        "place_of_birth": "Bromley-by-Bow, London, England, UK",
        "popularity": 0.2382,
        "profile_path": "/4bW0BaqxwcZptpRVFF3AGTWmGTe.jpg"
    }
}