{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sv8nSUSXb7ldLOg4dm6KDIDdSEU.jpg",
                "genre_ids": [
                    35,
                    36
                ],
                "id": 14257,
                "original_language": "fr",
                "original_title": "La Folie des grandeurs",
                "overview": "Don Sallust is the minister of the King of Spain. Being disingenuous, hypocritical, greedy and collecting the taxes for himself, he is hated by the people he oppresses. Accused by The Queen, a beautiful princess Bavarian, of having an illegitimate child to one of her maids of honor, he was stripped of his duties and ordered to retire to a monastery.",
                "popularity": 1.9281,
                "poster_path": "/uJtEs9WRqyEREvdkS470n593z03.jpg",
                "release_date": "1971-12-08",
                "title": "Delusions of Grandeur",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 714,
                "character": "Cortega",
                "credit_id": "53ab2a1e0e0a26761c0003fa",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/klreYbgIdSROmfXd1SlCWMgMBn1.jpg",
                "genre_ids": [
                    28,
                    37
                ],
                "id": 10772,
                "original_language": "it",
                "original_title": "Django",
                "overview": "A coffin-dragging gunslinger and a prostitute become embroiled in a bitter feud between a merciless masked clan and a band of Mexican revolutionaries.",
                "popularity": 3.4341,
                "poster_path": "/vs4vieNstSEfbgLFEelXXOPvr6h.jpg",
                "release_date": "1966-04-06",
                "title": "Django",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 943,
                "character": "Major Jackson",
                "credit_id": "55a5812792514140be000172",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Edoardo Fajardo",
            "Edouardo Fajardo",
            "Edward Hamilton",
            "Eduardo Martínez Fajardo",
            "Эдуардо Фахардо"
        ],
        "biography": "Eduardo Martínez Fajardo (14 August 1924 – 4 July 2019) was a Spanish film actor born in Meis (Pontevedra), Spain. He appeared in 183 films, 75 plays and made 2,000 television appearances between 1947 and 2002.\n\nHe was born in Meis, Pontevedra on 14 August 1924, and he raised in Haro and Santander, where he studied Bachillerato. He began his career as a voice actor from 1942 to 1946, and in 1947 he made his film debut in Héroes del 95, directed by Raúl Alfonso. In the 1950s he moved to Mexico, and when he came back to Spain he appeared in spaghetti westerns such as Gli eroi di Fort Worth (1965) by Martin Herbert, and Django (1966) by Sergio Corbucci.\n\nIn 2002, he founded Teatro sin barreras in Almeria, in order to help people with disabilities. He started the Almeria Walk of Fame, where he received a star on 11 April 2012 due to his intervention in 7th Cavalry and Django.\n\nFajardo was married four times. In Mexico he married twice, one of her with the actress Carmelita González, with whom he bore a daughter, Paloma del Rocío. His others children are José Antonio, Corazón, Lucero, Dusko, Alma and Eduardo.\n\nFajardo died while vacationing with five of his seven children in Mexico on 4 July 2019 at the age of 94.\n\nHe was honoured by the Diputación de Pontevedra and had been named hijo predilecto del Concello de Meis. In January 2019 he was honoured by the Almería Western Museo del Cine.\n\nSource: Article \"Eduardo Fajardo\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1924-08-14",
        "deathday": "2019-07-04",
        "gender": 2,
        "homepage": null,
        "id": 100409,
        "imdb_id": "nm0265761",
        "known_for_department": "Acting",
        "name": "Eduardo Fajardo",
        "place_of_birth": "Meis, Galicia, Spain",
        "popularity": 0.4285,
        "profile_path": "/aBqPQPnfqbpUA6d32Q1VdXo9BrM.jpg"
    }
}