{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8n9dYsTbXTykzm2Nuy7R2ftapXQ.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749
                ],
                "id": 703,
                "original_language": "en",
                "original_title": "Annie Hall",
                "overview": "New York comedian Alvy Singer falls in love with the ditsy Annie Hall.",
                "popularity": 3.9434,
                "poster_path": "/dEtjPywhDbAXYjoFfhBC4U9unU7.jpg",
                "release_date": "1977-04-19",
                "title": "Annie Hall",
                "video": false,
                "vote_average": 7.736,
                "vote_count": 4045,
                "character": "Blonde Woman in Bookstore",
                "credit_id": "5e89ea8160b58d0018ecf6ec",
                "order": 82
            }
        ],
        "crew": []
    },
    "details": {
        "adult": true,
        "also_known_as": [
            "Bonnie King",
            "Laura MacKenzie",
            "Chris MacLeod",
            "Laura Mackenzie",
            "Chris McLeod",
            "Bonnie Schiffer",
            "Elisabetta Terribile"
        ],
        "biography": "Statuesque blonde Juliet Graham was born Bonnie Schiffer in Manhattan. Her father's family was Jewish while her mother's family were Episcopalians who where originally from England. Graham was raised in Fresh Meadows, Queens prior to moving with her family to Jamaica Estates. Juliet not only attended a Jewish school, but also went to an Episcopalian church. Graham was a nonconformist in high school and first started acting in high school plays. Moreover, Juliet was an avid reader of Ayn Rand in her teenage years. Following graduation from high school, Graham went on to attend Queens College as an English literature major with a minor in education. While in college Juliet made her own hippie jewelry and eventually got a job working in a head shop before going on to get another job applying fake tattoos and working at a costume store called Royal Rags. Graham also began experimenting with such drugs as LSD, heroin, cocaine, and mescaline around this time as well as attended summer school in London, England.\n\nAfter having some unpleasant experiences with a sleazy criminal in England, Juliet returned to New York and graduated from college in 1972. Graham worked a nine to five office job that she was eventually fired from and secured a subsequent job as an editorial assistant producing books for Time Life. Juliet got involved in the 1970's swinging scene, which was how she met and started a relationship with porn actor Ashley Moore. Moore invited Graham to a hardcore film shoot where she met Jamie Gillis, who she also wound up having a relationship with. Gillis convinced Juliet to perform in her first X-rated feature Oriental Blue (1975). In the wake of splitting up with Moore, Graham lived with Gillis for a few years and went on to appear in a handful of additional hardcore movies while still working at her office day job that she was once again eventually fired from. Undaunted, Juliet became a professional model, did some theater work, and even appeared as an extra in a slew of mainstream films. More recently Graham has been working on her memoirs.",
        "birthday": "1951-10-22",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 100435,
        "imdb_id": "nm0334152",
        "known_for_department": "Acting",
        "name": "Juliet Graham",
        "place_of_birth": "Manhattan, New York City, New York, USA",
        "popularity": 4.102,
        "profile_path": "/qLwD3bdNyQld6IPOkL5acjWpjdI.jpg"
    }
}