{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/g2SvOk7ZEgV1VyOfJB2CwFyqgmF.jpg",
                "genre_ids": [
                    80,
                    18,
                    10749
                ],
                "id": 232,
                "original_language": "en",
                "original_title": "Rumble Fish",
                "overview": "Rusty James, an absent-minded street thug, struggles to live up to his legendary older brother's reputation and longs for the days when gang warfare was going on.",
                "popularity": 1.7342,
                "poster_path": "/nwIUWs7cexC8Wk9c6ey8nFltAZd.jpg",
                "release_date": "1983-10-09",
                "title": "Rumble Fish",
                "video": false,
                "vote_average": 6.985,
                "vote_count": 716,
                "character": "Lake Girl",
                "credit_id": "58bbb545925141606b035f78",
                "order": 28
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Lovely, sexy, and spirited blonde sprite Kristi Somers was born on May 9, 1962 in Encino, California. Somers graduated from Fullerton Union High School in Fullerton, California and went on to attend Fullerton College. Kristi first began acting in movies in 1983. With her comely face, winning smile, firm, shapely figure, sardonic, yet sunny and upbeat personality, and extremely energetic and engaging screen presence, Somers greatly enlivened a handful of enjoyably lowbrow low-budget B-flicks made throughout the 1980's. Kristi was especially memorable and impressive as the sassy'n'spunky \"Michelle\" in the blithely crude and leering sex comedy cult favorite Hardbodies (1984). She was very funny as the brash \"Seville Ritz\" in the entertainingly silly Tomboy (1985) and amusingly snotty as the stuck-up \"Rikki\" in the delightful Girls Just Want to Have Fun (1985). Moreover, Somers made guest appearances on such TV shows as Charles in Charge (1984), Cheers (1982), Full House (1987) and My Two Dads (1987). After a regrettable thirteen-year hiatus from acting, Somers made a welcome comeback with a sizable supporting role in the indie drama, The Substance of Things Hoped For (2006).",
        "birthday": "1962-05-09",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 100462,
        "imdb_id": "nm0629278",
        "known_for_department": "Acting",
        "name": "Kristi Somers",
        "place_of_birth": "Encino, California, USA",
        "popularity": 0.092,
        "profile_path": "/hwAznDr412RnSFWeStLf4ijii37.jpg"
    }
}