{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/b2NxliGN77rdu78HQv5peZBmkw4.jpg",
                "genre_ids": [
                    28,
                    80,
                    18,
                    53
                ],
                "id": 8982,
                "original_language": "th",
                "original_title": "ต้มยำกุ้ง",
                "overview": "A young fighter named Kham must go to Australia to retrieve his stolen elephant. With the help of a Thai-born Australian detective, Kham must take on all comers, including a gang led by an evil woman and her two deadly bodyguards.",
                "popularity": 6.6363,
                "poster_path": "/uKE9BxgtT5g2pE3ZKC7MnzsAbTZ.jpg",
                "release_date": "2005-08-11",
                "title": "The Protector",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 886,
                "character": "Wushu Fighter",
                "credit_id": "52fe44cec3a36847f80ab103",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/ew5FcYiRhTYNJAkxoVPMNlCOdVn.jpg",
                "genre_ids": [
                    18,
                    80,
                    28
                ],
                "id": 272,
                "original_language": "en",
                "original_title": "Batman Begins",
                "overview": "Driven by tragedy, billionaire Bruce Wayne dedicates his life to uncovering and defeating the corruption that plagues his home, Gotham City.  Unable to work within the system, he instead creates a new identity, a symbol of fear for the criminal underworld - The Batman.",
                "popularity": 16.5995,
                "poster_path": "/sPX89Td70IDDjVr85jdSBb4rWGr.jpg",
                "release_date": "2005-06-10",
                "title": "Batman Begins",
                "video": false,
                "vote_average": 7.717,
                "vote_count": 21791,
                "character": "League of Shadows Warrior (uncredited)",
                "credit_id": "60e00f0255b0c0005c2911c9",
                "order": 104
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            " Jon Foo",
            "Jonathan Foo"
        ],
        "biography": "Jonathan Patrick Foo (was born in 30 October 1982) is an English actor, martial artist and stuntman of mixed Chinese and Irish descent\n\nHe was born in London to a Chinese father from Singapore, and an Irish mother from England, which is also where he grew up. His siblings include a little sister and two half-sisters from his father's side. His family constantly relocated as he grew up. His father practices karate and his mother practices judo. He started learning kung fu when he was eight years old but he began serious training for wushu when he was 15. He currently lives in Los Angeles Being a practitioner of Wushu, he has starred in Tom-Yum-Goong (US title: The Protector), Batman Begins, House of Fury, Left for Dead, and Life (Shi cha qi xiao shi). He also does stunts for other actors. He is best known for recently playing the role of Jin Kazama in the 2010 live action movie movie Tekken released in 2010. He also received a role as Ryu in the short film Street Fighter: Legacy. He also starred in Universal Soldier: Regeneration (2010) as one of the first generation soldiers. He is also set to appear in a Thai martial arts-basketball film Fireball Begins, which is a prequel to the first film, Fireball.",
        "birthday": "1982-10-30",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.jonfoo.co.uk/Movie.html",
        "id": 100586,
        "imdb_id": "nm1463426",
        "known_for_department": "Acting",
        "name": "Jonathan Patrick Foo",
        "place_of_birth": "London, England",
        "popularity": 1.6678,
        "profile_path": "/uC9O2dEIkf53aFWQ1p5gMKXIKFF.jpg"
    }
}