{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lrLIy9OFRQg4VkhrCyolfNXJEUH.jpg",
                "genre_ids": [
                    18
                ],
                "id": 666,
                "original_language": "pt",
                "original_title": "Central do Brasil",
                "overview": "An emotional journey of a former school teacher, who writes letters for illiterate people, and a young boy, whose mother has just died, as they search for the father he never knew.",
                "popularity": 1.9894,
                "poster_path": "/zJvp7XjQ2LhPbDVYhFXyucs40vR.jpg",
                "release_date": "1998-04-03",
                "title": "Central Station",
                "video": false,
                "vote_average": 8.145,
                "vote_count": 982,
                "character": "Josué Fontenele de Paiva",
                "credit_id": "52fe4267c3a36847f801bb49",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Vinícius de Oliveira (born July 18, 1985) is a Brazilian actor. He was born in Rio de Janeiro. He lived in Bonsucesso, Rio de Janeiro with his mother, who had to work hard to support him and his three siblings. To make ends meet, he even started working as a shoe shiner, always dreaming of becoming a professional football player. Nevertheless, his life radically changed when, while shining shoes, he was discovered by director Walter Salles and cast to play the role of Josué in the acclaimed film Central do Brasil. Thanks to Salles' support Vinícius was able to take both English and theater lessons. He is currently enrolled as a student at PUC-RIO, where he intends to graduate as a film director. In addition to his groundbreaking role, he has also participated in several other projects such as the soap opera Suave Veneno Rede Globo and the film \"Linha de Passe\" that has been awarded in Cannes Film Festival.",
        "birthday": "1985-07-18",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 10059,
        "imdb_id": "nm0646737",
        "known_for_department": "Acting",
        "name": "Vinícius de Oliveira",
        "place_of_birth": "Rio de Janeiro, Rio de Janeiro, Brazil",
        "popularity": 1.116,
        "profile_path": "/olMuhlR9hoGO35m6jnD7VvonSeO.jpg"
    }
}