{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/r18vpGFsNf6n984x4KdJmAAWKkP.jpg",
                "genre_ids": [
                    18,
                    27
                ],
                "id": 136,
                "original_language": "en",
                "original_title": "Freaks",
                "overview": "A circus' beautiful trapeze artist agrees to marry the leader of side-show performers, but his deformed friends discover she is only marrying him for his inheritance.",
                "popularity": 4.6606,
                "poster_path": "/fX2Wxd0W9E7eVClUd8kJTfennoV.jpg",
                "release_date": "1932-01-01",
                "title": "Freaks",
                "video": false,
                "vote_average": 7.795,
                "vote_count": 1237,
                "character": "Landowner (uncredited)",
                "credit_id": "5e61edde357c0000133378ed",
                "order": 32
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Albert De Conti Cadassamare"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nAlbert De Conti Cadassamare (29 January 1887 – 18 January 1967), professionally billed as Albert Conti, was an Austrian-Hungarian-born Italian-American film actor.\n\nBorn in the village Gorizia (now part of Italy), Conti achieved moderate fame as an actor in American films, but first he specialized in law (high school and law college in Graz) and natural science, and married Patricia Cross. When World War I began, he became an officer. His father was Albert, Ritter Conti v. Cedassamare and his mother was Marie Bernhardine Anna (Countess Caboga) a member of an old Ragusan/Dubrovnik noble family. After his discharge from the Austrian army at the close of World War I, he came to America like many other now-impoverished postwar Europeans from both sides of the conflict.\n\nConti emigrated to the United States via the Port of Philadelphia in 1919. After settling in the new country, Conti was obliged to take a series of manual labor jobs, his patrician background notwithstanding. While working in the California oil fields, he answered an open call placed by director Erich von Stroheim, who was in search of an Austrian military officer to act as technical advisor for his upcoming film Merry-Go-Round (1923).\n\nA better actor than most of his fellow Habsburg Empire expatriates, Conti was able to secure dignified character roles in several silent and sound films; his credits ranged from Josef von Sternberg's Morocco (1930) to the early Laurel and Hardy knockabout Slipping Wives (1927). He appeared in the 1928 silent film Dry Martini as a roué artist. Though he made his last film in 1942, Albert Conti remained in the industry as an employee of the MGM wardrobe department, where he worked until his retirement in 1962.",
        "birthday": "1887-01-28",
        "deathday": "1967-01-18",
        "gender": 2,
        "homepage": null,
        "id": 100595,
        "imdb_id": "nm0176302",
        "known_for_department": "Acting",
        "name": "Albert Conti",
        "place_of_birth": "Trieste, Austria-Hungary [now Trieste, Friuli-Venezia Giulia, Italy]",
        "popularity": 0.0902,
        "profile_path": "/sBvjKclAZPsCrPFyGzOawWMQjJG.jpg"
    }
}