{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3loY85G8vB0OcpleFFezf4kSDsy.jpg",
                "genre_ids": [
                    18
                ],
                "id": 37181,
                "original_language": "fa",
                "original_title": "درباره الی‎‎",
                "overview": "The mysterious disappearance of a kindergarten teacher during a picnic in the north of Iran is followed by a series of misadventures for her fellow travelers.",
                "popularity": 2.7129,
                "poster_path": "/ctLrMQrg3kss2JO7OIr7RVdN5an.jpg",
                "release_date": "2009-06-06",
                "title": "About Elly",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 516,
                "character": "Amir",
                "credit_id": "573709d49251410b2700355f",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Many Haghighi",
            "Mani Haghighi",
            "Mani Haqiqi",
            "مانی حقیقی"
        ],
        "biography": "Mani Haghighi (b.1969, Tehran) studied philosophy at McGill University, Montreal before returning to Iran to make films. His first feature, Abadan (2003) premiered at the Tribeca Film Festival. His screenplay for Asghar Farhadi’s Fireworks Wednesday (2006, co-written with the director) won the Special Jury Prize at the Three Continents Festival, Nantes. His second feature film, Men at Work (Berlinale, Forum 2006) won the Best Screenplay Prize at the 2007 Asian Film Awards (Hong Kong) and the Best Screenplay Prize in the international section of the Fajr Film Festival (Tehran). Canaan (2008), based on a short story by Alice Munro, was followed by two documentary films on the works of the acclaimed Iranian director, Dariush Mehrjui: Hamoon’s Fans (2007), about the curious lives of six Iranians who are devoted fans of Mehrjui’s 1989 film, “Hamoon”, and Dariush Mehrjui: The Forty Year Report (2012), a feature length documentary about Mehrjui’s life and works. His fourth feature film, Modest Reception (Berlinale, Forum 2012), received the NETPAC Award at the Berlin Film Festival, the Free Spirit Award at the Warsaw Film Festival, the Best Actor and Best Actress prizes at the OSIAN’s Cinefan Festival in New Delhi as well as a few other international prizes. Haghighi has also acted in several films, including Asghar Farhadi’s About Elly (Berlinale, competition 2009) and Nima Javidi’s Melbourne (2014), as well as his own film, Modest Reception.",
        "birthday": "1969-07-16",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1005696,
        "imdb_id": "nm2155679",
        "known_for_department": "Directing",
        "name": "Mani Haghighi",
        "place_of_birth": "Tehran, Iran",
        "popularity": 0.2057,
        "profile_path": "/unc3WBsCVZoy5aqaKYlbmkvbURw.jpg"
    }
}