{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fvCVwNHhF3nxnsEiXTl2npHaXIN.jpg",
                "genre_ids": [
                    18,
                    53
                ],
                "id": 451657,
                "original_language": "fr",
                "original_title": "Jusqu'à la garde",
                "overview": "Miriam and Antoine have recently separated. While she’s willing to permit their 17-year-old daughter Josephine to decide living arrangements for herself, Miriam is desperate to keep her youngest, 11-year-old Julien, away from his father. But the magistrate rules in favour of joint custody, and suddenly the boy is thrown directly into the middle of an escalating parental conflict, where it seems inevitable that sides must be chosen.",
                "popularity": 1.9792,
                "poster_path": "/h0c6zFIbYqn5H5mxVqQuI0PNY9D.jpg",
                "release_date": "2018-02-07",
                "title": "Custody",
                "video": false,
                "vote_average": 7.487,
                "vote_count": 696,
                "character": "Police officer BAC",
                "credit_id": "62af9a621bf26605924263c3",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Marius"
        ],
        "biography": "Alain Alivon, known under the pseudonym Marius (born 23 July 1965 in Marseille), is a French military and drill instructor member of the Commandos Marine unit and the French Navy. He is mostly known for featuring in the 2005 documentary L'École des bérets verts on France 2 in the program Envoyé spécial. He later appeared on film and television, and publishing his autobiography.\n\nAlain Alivon spent a difficult childhood at the public assistance of Marseille, and a delinquent teenager in the North Quarter of Marseille and Vitrolles. He studied law but gave up soon after and committed offences with bad frequentations of the period. After a tough custody at the police station, a police officer recommended him to start his military service, giving him a chance to go through (\"an intelligent person who knew how to talk to me respectfully, giving me the good tools\").\n\nHe went to Lorient in the department of Morbihan to join the Fusiliers Marins unit of the French Navy, which had completely changed his mentality. After having accomplished the training tests of the unit, he joined the French Navy and became a volunteer for an internship of commando marine. He finished major of his promotion (top of his graduating class) and obtained the green beret.\n\nAt the time spent in the unit, he participated in a number of operations, especially in Lebanon, Djibouti and Ivory Coast, and also in France. In his 22 years of military service, he became an emblematic figure of the Commandos Marine and the Commando of Montfort. One of his former instructors nicknamed him \"Marius\" because of his Marseille origins. He then became a drill instructor, testing the new recruits and volunteers to join the Special forces. He is shown during that function in 2005 in the documentary L'École des bérets verts broadcast on France 2 in the television program Envoyé spécial. He retired from service in 2006.\n\nThe same year, he joined the Marseille-Fos Port (GPMM) and became a safety and defence agent of the West port basins.\n\nIn 2016, he again became a drill instructor in the reality program Garde à vous broadcast on M6.\n\nSource: Article \"Alain Alivon\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1965-07-23",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1006842,
        "imdb_id": "nm4091690",
        "known_for_department": "Acting",
        "name": "Alain Alivon",
        "place_of_birth": "Gardanne, Bouches-du-Rhône, France",
        "popularity": 0.0997,
        "profile_path": "/3fKIjZvR8c5BnGkY3g0SfKzd1fH.jpg"
    }
}