{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wSJHuSD7ojzoXifWjOAjxV7UpEL.jpg",
                "genre_ids": [
                    10751,
                    16,
                    10402,
                    12
                ],
                "id": 354912,
                "original_language": "en",
                "original_title": "Coco",
                "overview": "Despite his family’s baffling generations-old ban on music, Miguel dreams of becoming an accomplished musician like his idol, Ernesto de la Cruz. Desperate to prove his talent, Miguel finds himself in the stunning and colorful Land of the Dead following a mysterious chain of events. Along the way, he meets charming trickster Hector, and together, they set off on an extraordinary journey to unlock the real story behind Miguel's family history.",
                "popularity": 21.5358,
                "poster_path": "/6Ryitt95xrO8KXuqRGm1fUuNwqF.jpg",
                "release_date": "2017-10-27",
                "title": "Coco",
                "video": false,
                "vote_average": 8.202,
                "vote_count": 20232,
                "character": "Mamá (voice)",
                "credit_id": "59392f58925141088900f4c3",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Sofia Espinosa Carrasco",
            "Sofia Carrasco"
        ],
        "biography": "Sofía Espinosa Carrasco (born September 22, 1989) is a Mexican actress, writer and director. She began her artistic preparation at the National Conservatory of Music, and followed with studies at Casazul in Mexico, Claudio Tolcachir's school in Argentina, the Stella Adler Studio in New York City, and the Royal Academy of Dramatic Art in London. She received recognition for her role of Mati in the Mexican film La Niña en la Piedra (Nadie Te Ve) (2006), for which she was nominated for an Ariel Award for Best Actress. She subsequently starred in the TV series Capadocia (2010) and Bienvenida Realidad (2011).\n\nEspinosa is also featured in several other films including Sea of Dreams (2006), La Vida Inmune (2006), El Brassier de Emma (2007), The Kid: Chamaco (2009), I Miss You (2010), Vete Más Lejos, Alicia (2010), and Asteroide (2014). She also co-produced, co-wrote and starred in Los Bañistas (2014). For her lead performance in the biopic Gloria, based on the life of Mexican singer-songwriter Gloria Trevi, she received the Diosa de Plata and the Ariel Award for Best Actress.",
        "birthday": "1989-09-22",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1007527,
        "imdb_id": "nm2016172",
        "known_for_department": "Acting",
        "name": "Sofía Espinosa",
        "place_of_birth": "Mexico City, Mexico",
        "popularity": 0.827,
        "profile_path": "/iOwPSogxUHNWh3B0aIR1DuEW921.jpg"
    }
}