{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/i8fiqKaQklF02VmQYhSxmwa8KOH.jpg",
                "genre_ids": [
                    9648,
                    10749,
                    53
                ],
                "id": 223,
                "original_language": "en",
                "original_title": "Rebecca",
                "overview": "Story of a young woman who marries a fascinating widower only to find out that she must live in the shadow of his former wife, Rebecca, who died mysteriously several years earlier. The young wife must come to grips with the terrible secret of her handsome, cold husband, Max De Winter. She must also deal with the jealous, obsessed Mrs. Danvers, the housekeeper, who will not accept her as the mistress of the house.",
                "popularity": 2.5313,
                "poster_path": "/1qz3qUOHnVy7dL7M7G8jSErxE4b.jpg",
                "release_date": "1940-03-23",
                "title": "Rebecca",
                "video": false,
                "vote_average": 7.899,
                "vote_count": 1869,
                "character": "Policeman (uncredited)",
                "credit_id": "52fe4228c3a36847f800891d",
                "order": 17
            },
            {
                "adult": false,
                "backdrop_path": "/fzJgCQh2NBnUYlms8EGyr4bPNz3.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 900,
                "original_language": "en",
                "original_title": "Bringing Up Baby",
                "overview": "David Huxley is waiting to get a bone he needs for his museum collection. Through a series of strange circumstances, he meets Susan Vance, and the duo have a series of misadventures which include a leopard called Baby.",
                "popularity": 4.4763,
                "poster_path": "/vTNNOtemaYmtx3k2NpsLMRJKEwZ.jpg",
                "release_date": "1938-02-18",
                "title": "Bringing Up Baby",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 1022,
                "character": "Joe (uncredited)",
                "credit_id": "52fe428ac3a36847f8026b81",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/oa6yoeeZtjxdgzAcZtbCSW3GEE9.jpg",
                "genre_ids": [
                    9648,
                    10749,
                    53
                ],
                "id": 11462,
                "original_language": "en",
                "original_title": "Suspicion",
                "overview": "A sheltered young heiress elopes with a handsome playboy. Gradually, she discovers his dishonest nature.",
                "popularity": 2.0342,
                "poster_path": "/clWNlzlbyaEoIK63lcFjqBmXoQz.jpg",
                "release_date": "1941-11-14",
                "title": "Suspicion",
                "video": false,
                "vote_average": 7.134,
                "vote_count": 853,
                "character": "Ticket Taker (uncredited)",
                "credit_id": "52fe44459251416c7502ec91",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "William Bevan",
            "Bill Bevans",
            " Billy Bevin",
            "Bill Bivin"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nBilly Bevan (born William Bevan Harris, 29 September 1887 – 26 November 1957) was an Australian-born vaudevillian, who became an American film actor. He appeared in 254 American films between 1916 and 1950.\n\nBevan was born in the country town of Orange, New South Wales, Australia. He went on the stage at an early age, traveled to Sydney and spent eight years in Australian light opera, performing as Willie Bevan. He sailed to America with the Pollard’s Lilliputian Opera Company in 1912 and later toured Canada. Bevan broke into films with the Sigmund Lubin studio in 1916. When the company disbanded, Bevan became a supporting actor in Mack Sennett movie comedies. An expressive pantomimist, Bevan's quiet scene-stealing attracted attention, and by 1922 Bevan was a Sennett star. He supplemented his income, however, by establishing a citrus and avocado farm at Escondido, California.\n\nUsually filmed wearing a derby hat and a drooping mustache, Bevan may not have possessed an indelible screen character like Charlie Chaplin but he had a friendly, funny presence in the frantic Sennett comedies. Much of the comedy depended on Bevan's skilled timing and reactions; the famous \"oyster\" routine performed on film by Curly Howard, Lou Costello, and Huntz Hall—in which a bowl of \"fresh oyster stew\" shows alarming signs of life and battles the guy trying to eat it—was originated on film decades earlier by Bevan in the short film Wandering Willies.\n\nBy the mid-1920s Bevan was often teamed with Andy Clyde; Clyde soon graduated to his own starring series. The late 1920s found Bevan playing in wild marital farces for Sennett.\n\nThe advent of talking pictures took their toll on the careers of many silent stars, including Billy Bevan. Bevan began a second career in \"talkies\" as a character actor and bit player in roles such as that of a bus driver in the 1929 film High Voltage, a hotel employee in the Mae Murray film Peacock Alley, and the supporting role of Second Lieutenant Trotter in Journey's End in 1930. His starring roles had come to an end, however, and for the next 20 years he often would play rowdy Cockneys (as in Pack Up Your Troubles with The Ritz Brothers), and affable Englishmen (as in Tin Pan Alley and Terror by Night). He played a friendly bus conductor opposite Greer Garson in one of the opening scenes of Mrs. Miniver.\n\nBevan died in 1957 in Escondido, California, just before new audiences discovered him in Robert Youngson's silent-comedy compilations. (The Youngson films mispronounce his name as \"Be-VAN\"; Bevan himself offered the proper pronunciation in a Voice of Hollywood reel in 1930.)",
        "birthday": "1887-09-29",
        "deathday": "1957-11-26",
        "gender": 2,
        "homepage": null,
        "id": 100763,
        "imdb_id": "nm0079645",
        "known_for_department": "Acting",
        "name": "Billy Bevan",
        "place_of_birth": "Orange, New South Wales, Australia",
        "popularity": 0.1791,
        "profile_path": "/5yAbj9GLj7RfcMEFo3A20eOAIGU.jpg"
    }
}