{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xFYpUmB01nswPgbzi8EOCT1ZYFu.jpg",
                "genre_ids": [
                    12,
                    28,
                    18
                ],
                "id": 980489,
                "original_language": "en",
                "original_title": "Gran Turismo",
                "overview": "The ultimate wish-fulfillment tale of a teenage Gran Turismo player whose gaming skills won him a series of Nissan competitions to become an actual professional racecar driver.",
                "popularity": 7.6753,
                "poster_path": "/51tqzRtKMMZEYUpSYkrUE7v9ehm.jpg",
                "release_date": "2023-08-09",
                "title": "Gran Turismo",
                "video": false,
                "vote_average": 7.746,
                "vote_count": 3102,
                "character": "Felix",
                "credit_id": "6492f709f9aa470144eb2a7d",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Richard Cambridge is a film actor and producer, known for feature film Gran Turismo, Golden Years (2016), Hollyoaks (1995 TV series) and The IT Crowd (2006).\n\nCambridge was born in Wiltshire UK. His parents divorced when he was young and he grew up with his father and two younger siblings. He was a company member of the Musical Youth Theatre Company with alumni including Andrew Lincoln, Indira Varma, Will Thorp, Jennifer Biddall, Adam Campbell, Tabitha Wady, Ella Smith, and Tom Payne.\n\nRichard's first leading role was in the feature film Distant Bridges, playing Arthur Fisher, a young boy sent to fight in the first world war.\n\nThis was followed by a leading role in a short film Fishmonger's Daughter which was official selection at the Sundance Film Festival).\n\nHe has appeared in many commercials including for Butterfinger candy bars and an agent for Zovirax. He has also appeared in music videos \"What Will You Do (When the Money Goes)?\".\n\nHe played the role of 'Felix' in Sony Pictures blockbuster Gran Turismo. Released in cinemas in summer 2023 the movie has grossed over $120 m \"Gran Turismo\". Box Office Mojo. IMDb. Retrieved 17 October 2024.\n\nAlongside being an actor, Richard is CTO of actors community WeAudition. Founded in 2015, Richard with actor partners Jessica Rose and Darren Darnborough founded Weaudition.com, a network for actors looking for scene readers, to help actors learn lines from a script.\n\nRichard is a keen supporter of mental health.",
        "birthday": "1977-07-27",
        "deathday": null,
        "gender": 0,
        "homepage": "https://www.richardcambridge.com/",
        "id": 100738,
        "imdb_id": "nm0131388",
        "known_for_department": "Acting",
        "name": "Richard Cambridge",
        "place_of_birth": "Wiltshire, England, UK",
        "popularity": 0.0694,
        "profile_path": null
    }
}