{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tlQtvjwwTAAbNbtZ7IIGPlY50Hx.jpg",
                "genre_ids": [
                    12,
                    14,
                    16,
                    18,
                    10751
                ],
                "id": 15370,
                "original_language": "ja",
                "original_title": "猫の恩返し",
                "overview": "Young Haru rescues a cat from being run over, but soon learns it's no ordinary feline; it happens to be the Prince of the Cats.",
                "popularity": 5.6883,
                "poster_path": "/pqyY7IEWkCWNZ7EuRStQaJITEta.jpg",
                "release_date": "2002-07-19",
                "title": "The Cat Returns",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 2331,
                "character": "Cat King (voice)",
                "credit_id": "52fe46519251416c75074953",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/nC3IjYhUgZWgfKfFX0ygMigFwgc.jpg",
                "genre_ids": [
                    28,
                    18,
                    36
                ],
                "id": 14537,
                "original_language": "ja",
                "original_title": "切腹",
                "overview": "Down-on-his-luck veteran Tsugumo Hanshirō enters the courtyard of the prosperous House of Iyi. Unemployed, and with no family, he hopes to find a place to commit seppuku—and a worthy second to deliver the coup de grâce in his suicide ritual. The senior counselor for the Iyi clan questions the ronin’s resolve and integrity, suspecting Hanshirō of seeking charity rather than an honorable end. What follows is a pair of interlocking stories which lay bare the difference between honor and respect, and promises to examine the legendary foundations of the Samurai code.",
                "popularity": 3.9948,
                "poster_path": "/5konZnIbcAxZjP616Cz5o9bKEfW.jpg",
                "release_date": "1962-09-15",
                "title": "Harakiri",
                "video": false,
                "vote_average": 8.433,
                "vote_count": 1114,
                "character": "Hikokuro Omodaka",
                "credit_id": "594776a49251413fb103ba42",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "丹波 哲郎",
            "Tetzuro Tamba",
            "Tetsurô Tanba ",
            "Tetsuro Tambo",
            "Tetsurô Tamba",
            "Tetsurou Tanba"
        ],
        "biography": "Tetsuro Tamba (July 17, 1922 – September 24, 2006) was a distinguished Japanese actor known for his versatile talent across five decades. Recognized globally for his portrayal of Tiger Tanaka in the iconic 1967 James Bond film \"You Only Live Twice,\" Tamba's cinematic journey was a remarkable blend of cultural bridges.\n\nBefore embarking on his acting career, Tamba worked as an interpreter for the Allied Powers' Supreme Commander. Graduating from Chuo University in 1948, he later joined Shintoho company, making his debut in the film Satsujin Yougishain in 1951.\n\nTamba's impact on Western audiences extended beyond Bond, with standout performances in films like Bridge to the Sun and The 7th Dawn. He earned acclaim in Japan as well, most notably as the lead in police dramas like Key Hunter and G-Men '75.\n\nHis talents weren't confined to the screen alone. Tamba lent his voice to characters like the Cat King in Studio Ghibli's The Cat Returns and graced historical roles in television dramas, leaving an indelible mark on period pieces.\n\nIn 2005, Tamba faced health challenges but continued to contribute until the end. Sadly, he passed away in Tokyo at 84 due to pneumonia on September 24, 2006. His legacy lives on through his son, actor Yoshitaka Tamba, while his last appearances in the 2005 Taiga drama Yoshitsune and the 2006 film Sinking of Japan remain a testament to his enduring impact on Japanese cinema and beyond.",
        "birthday": "1922-07-17",
        "deathday": "2006-09-24",
        "gender": 2,
        "homepage": null,
        "id": 10071,
        "imdb_id": "nm0848533",
        "known_for_department": "Acting",
        "name": "Tetsuro Tamba",
        "place_of_birth": "Tokyo, Japan",
        "popularity": 0.6745,
        "profile_path": "/hrjJ1JfkVxjAOQ6IaSM6wBsIaAO.jpg"
    }
}