{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bvkPno6U02lLyvPWCnmibq4eIaN.jpg",
                "genre_ids": [
                    27
                ],
                "id": 609,
                "original_language": "en",
                "original_title": "Poltergeist",
                "overview": "Upon realizing that something truly evil haunts his home, Steve Freeling calls in a team of parapsychologists to help before it's too late.",
                "popularity": 4.2879,
                "poster_path": "/4eMN3GANH5GG4kXdHkrTZEUuQ9M.jpg",
                "release_date": "1982-06-04",
                "title": "Poltergeist",
                "video": false,
                "vote_average": 7.151,
                "vote_count": 3154,
                "character": "Robbie Freeling",
                "credit_id": "52fe425dc3a36847f80189ed",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "​From Wikipedia, the free encyclopedia\n\nOliver Robins (born July 22, 1971) is an American former child actor who is now a writer and director. His first film roles were in the 1982 TV movie Million Dollar Infield, and in the 1982 ABC TV movie Don't Go to Sleep as Kevin. He is best known for his role as Robbie Freeling in the 1982 movie Poltergeist and in its 1986 sequel Poltergeist II: The Other Side. Oliver's other feature film role was in the 1982 comedy Airplane II: The Sequel. He has made only one guest appearance on television, in the 1986 Twilight Zone episode \"Monsters!\". Oliver left the acting business after 1986. As an adult, he returned to show business as a writer and director. In 2000, he wrote and directed his first film, Dumped, which was released directly to video, and also wrote and directed Roomies in 2004. He wrote the 1999 movie Eating L.A.. Robins is the only surviving Poltergeist child actor following the deaths of Dominique Dunne and Heather O'Rourke.\n\nDescription above from the Wikipedia article Oliver Robins, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1971-07-22",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 10085,
        "imdb_id": "nm0732319",
        "known_for_department": "Acting",
        "name": "Oliver Robins",
        "place_of_birth": null,
        "popularity": 1.788,
        "profile_path": "/12TMJff2kxPYQ0UBf4RPR3mt0DK.jpg"
    }
}