{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xHDynIimfsgj0ZOs0j5ma8v1vmM.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 120467,
                "original_language": "en",
                "original_title": "The Grand Budapest Hotel",
                "overview": "The Grand Budapest Hotel tells of a legendary concierge at a famous European hotel between the wars and his friendship with a young employee who becomes his trusted protégé. The story involves the theft and recovery of a priceless Renaissance painting, the battle for an enormous family fortune and the slow and then sudden upheavals that transformed Europe during the first half of the 20th century.",
                "popularity": 10.2456,
                "poster_path": "/eWdyYQreja6JGCzqHWXpWHDrrPo.jpg",
                "release_date": "2014-02-26",
                "title": "The Grand Budapest Hotel",
                "video": false,
                "vote_average": 8.036,
                "vote_count": 15411,
                "character": "Carolina",
                "credit_id": "568b1de89251412e5202ae8d",
                "order": 69
            },
            {
                "adult": false,
                "backdrop_path": "/waMGsUEoHfYj3A1uRMUUgpBa71d.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 8055,
                "original_language": "en",
                "original_title": "The Reader",
                "overview": "The story of Michael Berg, a German lawyer who, as a teenager in the late 1950s, had an affair with an older woman, Hanna, who then disappeared only to resurface years later as one of the defendants in a war crimes trial stemming from her actions as a concentration camp guard late in the war. He alone realizes that Hanna is illiterate and may be concealing that fact at the expense of her freedom.",
                "popularity": 5.454,
                "poster_path": "/r0WURbmnhgKeBpHcpDULBgRedQM.jpg",
                "release_date": "2008-12-10",
                "title": "The Reader",
                "video": false,
                "vote_average": 7.474,
                "vote_count": 3245,
                "character": "Prison Guard",
                "credit_id": "56a63278c3a368388e00aa04",
                "order": 24
            },
            {
                "adult": false,
                "backdrop_path": "/sFDntG0Z0Wjrsz26TVptfs5OSLT.jpg",
                "genre_ids": [
                    18,
                    878
                ],
                "id": 83542,
                "original_language": "en",
                "original_title": "Cloud Atlas",
                "overview": "A set of six nested stories spanning time between the 19th century and a distant post-apocalyptic future. Cloud Atlas explores how the actions and consequences of individual lives impact one another throughout the past, the present and the future. Action, mystery and romance weave through the story as one soul is shaped from a killer into a hero and a single act of kindness ripples across centuries to inspire a revolution in the distant future.  Based on the award winning novel by David Mitchell. Directed by Tom Tykwer and the Wachowskis.",
                "popularity": 7.2462,
                "poster_path": "/8naVv2Xu3rWI5JKHz0vCujx6GaJ.jpg",
                "release_date": "2012-10-26",
                "title": "Cloud Atlas",
                "video": false,
                "vote_average": 6.888,
                "vote_count": 7271,
                "character": "Ms. Judd Look-a-like",
                "credit_id": "5c1abb2b9251414b03531453",
                "order": 46
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Hanold-Lynch verließ mit 16 Jahren ihr Elternhaus und finanzierte sich selbst das Abitur. Ihr Germanistik- und Psychologiestudium an der Freien Universität Berlinbrach sie bald ab, um nach New York zu gehen. Dort besuchte sie die Neighborhood Playhouse School of Theatre von Sanford Meisner. Sie studierte gemeinsam mit Philip Seymour Hoffman mehrere Jahre bei dem Method-Lehrer Tony Greco. An der Columbia University, Graduate Film Division arbeitete sie mit Leonore de Koven in Directing Actors in Film, wirkte in Studentenfilmen mit, nahm weiteren Schauspielunterricht und stand als Gründungsmitglied einer Theatergruppe auf der Bühne, unter anderem in John Patrick Shanleys Stücken Danny and the Deep Blue Sea als Roberta und in Savage in Limbo in der Rolle der April White. Hanold-Lynch war verheiratet mit James E. Lynch, dessen Namen sie nach der Trennung behielt. 1994 kehrte sie nach Berlin zurück. Von 1999 bis 2010 arbeitete sie durchgängig als Schauspiel-Coach vorbereitend und am Set für unterschiedlichste Film- und Fernsehproduktionen, beginnend mit der Serie St. Angela. Als Dozentin konzipierte und präsentierte sie 2001 den Live-Workshop „Kamera läuft!“ im Rahmen des SAT.1 Actors’ Day auf dem Filmfest München, bei dem sie junge Leute aus dem Publikum live vor laufender Kamera coachte. 2009 entschied sie sich für einen künstlerischen Neuanfang als Schauspielerin. Parallel dazu systematisierte sie eigene Techniken der Rollenerarbeitung und ist seit 2010 als freier Coach und als Dozentin für Internationale Castings am iSFF (Institut für Schauspiel, Film- und Fernsehberufe Berlin) tätig. Stephen Daldry legte Hanold-Lynch beim Casting für Der Vorleser nahe, ihre eigene Schauspielkarriere voranzutreiben und Drehbuchautor David Hare schrieb ihr eine Rolle ins Drehbuch. Die Begegnung bewirkte, dass sich Hanold-Lynch beruflich neu ausrichtete. Seither hat sie Nebenrollen in weiteren großen internationalen Kinoproduktionen gespielt, u. a. an der Seite von Liam Neeson in Unknown Identity, an der Seite von Tom Hanks in Cloud Atlas, zuletzt als Tochter von Tilda Swinton und Schwester von Adrien Brody in Wes Andersons Grand Budapest Hotel. Auch in Deutschland stellt sie seit 2009 in Kino- und Fernsehproduktionen ihre Wandlungsfähigkeit unter Beweis. Franziska Augstein schrieb in der Süddeutschen Zeitung über ihre Figur der Else Weidt in Ein blinder Held – Die Liebe des Otto Weidt: „Dieser Film ist großes Kino (...) Großartig ist Heike Hanold-Lynch, die als Weidts verbittert-verbiesterte, eifersüchtige und nicht besonders attraktive Ehefrau auftritt.“ Neben Edgar Selge in der Titelrolle spielt sie in dem Film, welcher auf Erlebnissen Inge Deutschkrons während der Zeit des Nationalsozialismus basiert, eine unpolitische Frau, die die große Liebe ihres Mannes vor den Nazis versteckt. Neben anderen Filmprojekten besetzte Friedemann Fromm sie in der ersten Staffel der mit dem Deutschen Fernsehpreis ausgezeichneten ErfolgsserieWeissensee als Stasi-Mitarbeiterin Erika Bergner. Für Andres Veiel war sie als Mentorin Gudrun Ensslins in Wer wenn nicht wir zu sehen und für Marc-Andreas Bochert in einer Hauptrolle als Richterin an der Seite von Christoph Bach in Dyslexie. 2014 stand sie u. a. für Oskar Roehlers 80er-Jahre-Film Tod den Hippies, es lebe der Punk vor der Kamera. Heike Hanold-Lynch lebt in Berlin.",
        "birthday": "1962-07-11",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1008395,
        "imdb_id": "nm0360515",
        "known_for_department": "Acting",
        "name": "Heike Hanold-Lynch",
        "place_of_birth": "Berlin, Germany",
        "popularity": 0.1057,
        "profile_path": "/ejqUfDN5oIfOGEWWWotGz52Kxli.jpg"
    }
}