{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/AaABt75ZzfMGrscUR2seabz4PEX.jpg",
                "genre_ids": [
                    28,
                    12,
                    14
                ],
                "id": 297762,
                "original_language": "en",
                "original_title": "Wonder Woman",
                "overview": "An Amazon princess comes to the world of Man in the grips of the First World War to confront the forces of evil and bring an end to human conflict.",
                "popularity": 15.1484,
                "poster_path": "/v4ncgZjG2Zu8ZW5al1vIZTsSjqX.jpg",
                "release_date": "2017-05-30",
                "title": "Wonder Woman",
                "video": false,
                "vote_average": 7.214,
                "vote_count": 20441,
                "character": "Venelia",
                "credit_id": "58194d8192514133ae0029d4",
                "order": 46
            },
            {
                "adult": false,
                "backdrop_path": "/13Nz8EchKRdCgJcKdEoJAnpiVn2.jpg",
                "genre_ids": [
                    28,
                    12,
                    14
                ],
                "id": 791373,
                "original_language": "en",
                "original_title": "Zack Snyder's Justice League",
                "overview": "Determined to ensure Superman's ultimate sacrifice was not in vain, Bruce Wayne aligns forces with Diana Prince with plans to recruit a team of metahumans to protect the world from an approaching threat of catastrophic proportions.",
                "popularity": 13.7837,
                "poster_path": "/tnAuB8q5vv7Ax9UAEje5Xi4BXik.jpg",
                "release_date": "2021-03-18",
                "title": "Zack Snyder's Justice League",
                "video": false,
                "vote_average": 8.11,
                "vote_count": 10399,
                "character": "Venelia",
                "credit_id": "601b574baafebd003de2d7b1",
                "order": 46
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "杜晨·科洛斯",
            "داتزن کروس"
        ],
        "biography": "Doutzen Kroes (born 23 January 1985) is a Dutch Frisian model and actress. She began her modelling career in 2003 in the Netherlands and quickly was sent by her agency to New York where she was cast by lingerie giant Victoria’s Secret. She became a Victoria's Secret Angel for the brand in 2008. She has been a brand ambassador and spokesperson for L'Oréal Paris for over 5 years. Kroes has been in the top five of best-paid models, with an estimated income of more than five million per year since 2008. In 2014, she came in second on the Forbes top-earning models list, estimated to have earned $8 million in one year. She is considered one of the \"New Supers\" and described as \"Helen of Troy of advertising\" by Models.com.\n\nUnlike most fellow top models, Kroes got acquainted with the fashion world relatively late. She is one of few highly successful professional models who was not discovered by any scouting agency. She got accepted at Paparazzi Model Management in Amsterdam after sending some of her holiday pictures. Her first breakthrough was when she was featured on cover of Vogue Italia in 2005. Steven Meisel shot her pictures for the cover. Just as she started her career as model for Victoria's Secret, she was voted as \"Model of The Year\" on Vogue.com in the year 2005. The year 2013 was a significantly successful year for her modeling career. In September 2013, she appeared on covers of four international editions of Vogue, making her the first model/celebrity in the history. The September issues are generally regarded as the most important issue of the year for fashion magazines, especially Vogue. She had been featured on a total of 9 Vogue covers, a count more than any other model, just in the year 2013.\n\nHer first film debut was in Nova Zembla (2011). She is one of the active members to contribute to Dance4Life, a Dutch non-profit organization that uses song and dance to educate youth about HIV and AIDS prevention. She is also one of the supporters of Wildlife Conservation and World Wildlife Fund.",
        "birthday": "1985-01-23",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1009999,
        "imdb_id": "nm2143237",
        "known_for_department": "Acting",
        "name": "Doutzen Kroes",
        "place_of_birth": "Eastermar, Netherlands",
        "popularity": 0.5695,
        "profile_path": "/lUxvWe6Dd3DbugBa18N60rEizse.jpg"
    }
}