{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9vAoubhoZE8aSkUZoSfxs3UWZhO.jpg",
                "genre_ids": [
                    53,
                    28,
                    80
                ],
                "id": 156022,
                "original_language": "en",
                "original_title": "The Equalizer",
                "overview": "McCall believes he has put his mysterious past behind him and dedicated himself to beginning a new, quiet life. But when he meets Teri, a young girl under the control of ultra-violent Russian gangsters, he can’t stand idly by – he has to help her. Armed with hidden skills that allow him to serve vengeance against anyone who would brutalize the helpless, McCall comes out of his self-imposed retirement and finds his desire for justice reawakened. If someone has a problem, if the odds are stacked against them, if they have nowhere else to turn, McCall will help. He is The Equalizer.",
                "popularity": 14.0355,
                "poster_path": "/9u4yW7yPA0BQ2pv9XwiNzItwvp8.jpg",
                "release_date": "2014-09-24",
                "title": "The Equalizer",
                "video": false,
                "vote_average": 7.28,
                "vote_count": 9490,
                "character": "Marat",
                "credit_id": "54c766ad92514167910016d3",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Matt was born in Waco, Texas and raised in the Oklahoma City area. His reckless teen years culminated with him spending his twentieth birthday in state prison over a series of group brawls. Exactly a year after his release, at the end a long day of high rise window washing, he found himself involved in a road rage incident in which his coworker was murdered directly in front of him. Matt then made his way to Hollywood where he graduated from the American Academy of Dramatic Arts and went on to be a member of their theater company ('06).. He supported his early years bouncing and working as an autism behavioral therapist. Matt rowed a boat from Monterey, CA to Oahu, HI over the summer of 2014 in 57 days 5 hours 45 minutes. Matt shares the world record with his 3 crew mates for the first ever mixed sex team of 4 to row across the Pacific ocean unsupported.",
        "birthday": "1981-04-12",
        "deathday": null,
        "gender": 2,
        "homepage": "https://resumes.actorsaccess.com/mattlasky",
        "id": 101088,
        "imdb_id": "nm2359377",
        "known_for_department": "Acting",
        "name": "Matt Lasky",
        "place_of_birth": "Waco, Texas, USA",
        "popularity": 0.4137,
        "profile_path": "/gfEcNF5T1V8Mrpu6auGuLwiWrBz.jpg"
    }
}