{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/c6yfABGVKuB5cjoOwdX4AJMlzUz.jpg",
                "genre_ids": [
                    35,
                    14
                ],
                "id": 620,
                "original_language": "en",
                "original_title": "Ghostbusters",
                "overview": "After losing their academic posts at a prestigious university, a team of parapsychologists goes into business as proton-pack-toting \"ghostbusters\" who exterminate ghouls, hobgoblins and supernatural pests of all stripes. An ad campaign pays off when a knockout cellist hires the squad to purge her swanky digs of demons that appear to be living in her refrigerator.",
                "popularity": 7.2781,
                "poster_path": "/7E8nLijS9AwwUEPu2oFYOVKhdFA.jpg",
                "release_date": "1984-06-08",
                "title": "Ghostbusters",
                "video": false,
                "vote_average": 7.495,
                "vote_count": 9352,
                "character": "Student at Columbia University (uncredited)",
                "credit_id": "5f45d40afdc4fa0036bb28b6",
                "order": 60
            },
            {
                "adult": false,
                "backdrop_path": "/sgsW7aqUXg4jG2GcoLKotSvp807.jpg",
                "genre_ids": [
                    18
                ],
                "id": 24226,
                "original_language": "en",
                "original_title": "The Verdict",
                "overview": "Frank Galvin is a down-on-his-luck lawyer and reduced to drinking and ambulance chasing, when a former associate reminds him of his obligations in a medical malpractice suit by serving it to Galvin on a silver platter—all parties are willing to settle out of court. Blundering his way through the preliminaries, Galvin suddenly realizes that the case should actually go to court—to punish the guilty, to get a decent settlement for his clients... and to restore his standing as a lawyer.",
                "popularity": 4.3022,
                "poster_path": "/m3DdNJZfBcsTiFe0SwsLChWavrG.jpg",
                "release_date": "1982-12-08",
                "title": "The Verdict",
                "video": false,
                "vote_average": 7.446,
                "vote_count": 674,
                "character": "Minor Role (uncredited)",
                "credit_id": "67479db3f21daebead89d1b6",
                "order": 43
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Alison MacHale",
            "Debra MacHale",
            "威洛·黑尔"
        ],
        "biography": "Willow Hale is an American actress and director. After graduating from The University of Texas at Austin, she was invited to act in the Summer program at PCPA in Santa Maria, CA where she worked with a then unknown Robin Williams. She lived and acted in New York City from 1976 to 1989. Studying with Uta Hagen and Herbert Berghof at the H.B. Studios and acting in new plays there at the Foundation with Bill Hickey, Barbara Coggin, Wesley Addy and Celeste Holm among others. She acted in several Horton Foote plays there too where she met Robert Armin who then made a recording of her music in January 1979 which 25 years later became her first CD...A Simple String of Wonder. During her time in New York, she opened for Dave Van Ronk at The Other End (November 1980) and acted on Broadway at the Helen Hayes Theatre in Strider (also 1980) and acted in Ghostbusters right after running the 1983 NYC Marathon. She became a SAG actor in 1979 and after moving to Los Angeles acted in 30 something and studied with Milton Katselas. After a long time out from the movies and television, Willow started back in 2009 and has been working consistently in Two-Bit Waltz, Criminal Minds Suspect Behavior among many others and has also directed two short films.",
        "birthday": "1951-08-21",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 101054,
        "imdb_id": "nm0532531",
        "known_for_department": "Acting",
        "name": "Willow Hale",
        "place_of_birth": "Gulfport, Mississippi, USA",
        "popularity": 1.6199,
        "profile_path": "/7dB3ZX1cTJtd8blZTCn2vR28RnR.jpg"
    }
}