{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/61MrK5U4w4MVL1vfwoG12zYPJ8B.jpg",
                "genre_ids": [
                    28,
                    53
                ],
                "id": 615457,
                "original_language": "en",
                "original_title": "Nobody",
                "overview": "Hutch Mansell, a suburban dad, overlooked husband, nothing neighbor — a \"nobody.\" When two thieves break into his home one night, Hutch's unknown long-simmering rage is ignited and propels him on a brutal path that will uncover dark secrets he fought to leave behind.",
                "popularity": 37.4296,
                "poster_path": "/oBgWY00bEFeZ9N25wWVyuQddbAo.jpg",
                "release_date": "2021-03-18",
                "title": "Nobody",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 7700,
                "character": "Beta",
                "credit_id": "6205efd655937b001bef53f2",
                "order": 28
            },
            {
                "adult": false,
                "backdrop_path": "/vJbEUMeI2AxBUZKjP6ZVeVNNTLh.jpg",
                "genre_ids": [
                    28,
                    53,
                    35
                ],
                "id": 749170,
                "original_language": "en",
                "original_title": "Heads of State",
                "overview": "The UK Prime Minister and US President have a public rivalry that risks their countries' alliance. But when they become targets of a powerful enemy, they're forced to rely on each other as they go on a wild, multinational run. Allied with Noel, a brilliant MI6 agent, they must find a way to thwart a conspiracy that threatens the free world.",
                "popularity": 29.3877,
                "poster_path": "/lVgE5oLzf7ABmzyASEVcjYyHI41.jpg",
                "release_date": "2025-06-24",
                "title": "Heads of State",
                "video": false,
                "vote_average": 6.913,
                "vote_count": 726,
                "character": "Agent Peters",
                "credit_id": "6865983c49beabc3a67bf5da",
                "order": 23
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Darya Borisovna Charusha",
            "Dasha Charusha",
            "Darya Simanenko",
            "Darya Simonenko",
            "Даша Чаруша",
            "Daria Charusha",
            "Dar'ya Charusha",
            "Дарья Симоненко",
            "Дарья Симаненко",
            "Dasha Naishuller"
        ],
        "biography": "Dasha was born on 25th of August 1980 in Norilsk, Soviet Union. She grew up with the passion for music and theatre which she dedicated most of her early years to. She attended Moscow Conservatory at the age of 18 and studied as a composer. She began composing her own songs at a young age.  Charusha, having a passion for acting as well, enrolled to Moscow Art School GITIS where she graduated as a dramatic actress in June 2010. She acted in a handful of Russian movies and TV series while writing cinema scores and working on her own album. The first big success was her co-writing work with Andrey Karasev on the music for the motion picture Silent Souls which was release in October 2010, presented at Venice Film Festival and got very positive reviews.  In 2014, Dasha acted as the producer for the 'Cold Front' movie where she played one of the female lead roles and also wrote the score. The movie was shot in Normandy in December the same year. The international breakthrough came with the premier of 'Hardcore' in September 2015 at the Toronto Film Festival. The first action POV movie directed by Ilya Naishuller, where she took a part as an actress and also wrote the score, turned out to be worldwide phenomena.",
        "birthday": "1980-08-25",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1014980,
        "imdb_id": "nm1748780",
        "known_for_department": "Acting",
        "name": "Darya Charusha",
        "place_of_birth": "Noginsk, RSFSR, USSR",
        "popularity": 0.1703,
        "profile_path": "/8ApqL2R78NzT2OPfLwH57mHdFRg.jpg"
    }
}