{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/a3eYLIK5eYSHAJTtOy9PdciVjxx.jpg",
                "genre_ids": [
                    18
                ],
                "id": 28580,
                "original_language": "en",
                "original_title": "The Lost Weekend",
                "overview": "Don Birnam, a long-time alcoholic, has been sober for ten days and appears to be over the worst... but his craving has just become more insidious. Evading a country weekend planned by his brother and girlfriend, he begins a four-day bender that just might be his last - one way or another.",
                "popularity": 2.7569,
                "poster_path": "/8ggIOoCzt8xT2ePl8DdlRtXgcOh.jpg",
                "release_date": "1945-11-29",
                "title": "The Lost Weekend",
                "video": false,
                "vote_average": 7.628,
                "vote_count": 629,
                "character": "Wick Birnam",
                "credit_id": "52fe45a3c3a368484e066631",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Frederick Henry Kormann",
            "Philip Terry",
            "Phil Terry"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nPhillip Terry (born Frederick Henry Kormann, March 7, 1909 – February 23, 1993) was an American actor.\n\nTerry was born in San Francisco, California, the only child of German Americans, Frederick Andrew Kormann (1883–1948) and Ida Ruth Voll (1883–1954).  He attended Stanford University, where he became interested in theatre. After a brief stay in New York, he went to London, in 1933, where he attended the Royal Academy of Dramatic Art. Afterwards he toured British provinces for four years doing stock theater. Upon returning to Hollywood he took a job with CBS Radio, where he performed in a number of plays on the air, specializing in Shakespearean roles. After a screen test at MGM in 193y he was awarded a contract with the studio. Among his motion picture appearances, he had a bit part in the movie Mannequin starring Joan Crawford.\n\nPhillip Terry appeared in more than eighty movies over the span of his career. Many of the early roles were small and often uncredited. But in the 1940s, he received bigger and more numerous roles in some quality movies, such as The Lost Weekend (1945) starring Ray Milland, and To Each His Own (1946) starring Olivia de Havilland, who won one of her Oscars for her role in the film.\n\nHis career began to flag in the late 1940s. Through the 1950s and early 1970s, he took on occasional B movie roles including monster flick. In addition, he would accept television roles and was in episodes of The Name of the Game and Police Woman. He also made five guest appearances on Perry Mason.\n\nIn 1973, he retired and moved to Santa Barbara, California. He suffered the first of a series of strokes in 1978. Because of the strokes, he lost his mobility and communication and was an invalid for several years before his death at the age of 83. Terry died at his home in Santa Barbara. His ashes were scattered in the Pacific Ocean.",
        "birthday": "1909-03-07",
        "deathday": "1993-02-23",
        "gender": 2,
        "homepage": null,
        "id": 101490,
        "imdb_id": "nm0856062",
        "known_for_department": "Acting",
        "name": "Phillip Terry",
        "place_of_birth": "San Francisco, California, USA",
        "popularity": 0.2426,
        "profile_path": "/RhQPDgCLUilO8UAtVt62tjH0QY.jpg"
    }
}