{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9qGWOflC5WNhaKk2UPYu55SjjNj.jpg",
                "genre_ids": [
                    80,
                    53
                ],
                "id": 678,
                "original_language": "en",
                "original_title": "Out of the Past",
                "overview": "The peaceful life of a gas station owner is disrupted when a man from his past arrives in town and forces him to return to the dark world he had tried to escape.",
                "popularity": 2.2826,
                "poster_path": "/lnUK6Cg5ARM0qaq0B5SG20VAM0h.jpg",
                "release_date": "1947-11-25",
                "title": "Out of the Past",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 618,
                "character": "Kathie Moffat",
                "credit_id": "52fe4269c3a36847f801c8c7",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Bettejane Greer"
        ],
        "biography": "Jane Greer was a film and television actress who was perhaps best known for her role as femme fatale Kathie Moffat in the 1947 film noir Out of the Past.\n\nA beauty-contest winner and professional model from her teens, Greer began her show-business career as a big-band singer. She sang in Washington, DC, with the orchestra of Enric Madriguera. She \"sang phonetically in Spanish\" with the group.\n\nHoward Hughes spotted Greer modeling in the June 8, 1942 issue of Life, and sent her to Hollywood to become an actress. Hughes lent her to RKO to star in many films (another source says Greer's husband, Rudy Vallee, \"helped her get out of her contract with Hughes and secure another pact with RKO Studios\") including Dick Tracy, Out of the Past, They Won't Believe Me, and the comedy/suspense film The Big Steal, with Out of the Past co-star Robert Mitchum. Hughes refused to let her work for a time; when she finally began film acting, she appeared in You're in the Navy Now, The Prisoner of Zenda, Run for the Sun, and Man of a Thousand Faces. In 1984, she was cast in Against All Odds, a remake of Out of the Past, as the mother of the character she had played in 1947. In 1952, Greer obtained a release from her contract with Metro-Goldwyn-Mayer Studios. She said, \"When there is a good role at MGM, the producers want Lana or Ava. There is no chance for another actress to develop into important stardom at the studio\".\n\nGreer's noteworthy roles in television included guest appearances on episodes of numerous shows over the decades, such as Alfred Hitchcock Presents, Bonanza, Quincy, M.E., Murder, She Wrote, and a 1975 gig with Peter Falk and Robert Vaughn in an episode of Columbo titled Troubled Waters. She even got to make fun of Out of the Past in a parody with Robert Mitchum on TV's Saturday Night Live in 1987. Greer joined the casts of Falcon Crest in 1984 and Twin Peaks in 1990 in recurring roles until her retirement in 1996.\n\nGreer was honored with a star on the Hollywood Walk of Fame at 1634 Vine Street for her contributions to the motion picture industry. The star was dedicated on February 8, 1960. Greer died of cancer on August 24, 2001, at the age of 76, in Bel Air, Los Angeles. Her body was interred at Los Angeles' Westwood Village Memorial Park Cemetery.\n\nDescription above from the Wikipedia article Jane Greer, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1924-09-09",
        "deathday": "2001-08-24",
        "gender": 1,
        "homepage": null,
        "id": 10159,
        "imdb_id": "nm0339452",
        "known_for_department": "Acting",
        "name": "Jane Greer",
        "place_of_birth": "Washington, D.C., USA",
        "popularity": 0.2788,
        "profile_path": "/tPPR7Aeib4pEc0H4BVEYaDpVuu1.jpg"
    }
}