{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wRMUb4hrgD868hNiRjCkbPXqRv0.jpg",
                "genre_ids": [
                    80,
                    18,
                    53
                ],
                "id": 10363,
                "original_language": "fr",
                "original_title": "Plein soleil",
                "overview": "Tom Ripley is a talented mimic, moocher, forger and all-around criminal improviser; but there's more to Tom Ripley than even he can guess.",
                "popularity": 2.3457,
                "poster_path": "/xGVRU34izQwG8YQNfVOSfKPhD3S.jpg",
                "release_date": "1960-03-10",
                "title": "Purple Noon",
                "video": false,
                "vote_average": 7.58,
                "vote_count": 564,
                "character": "Blind Man (uncredited)",
                "credit_id": "52fe43619251416c7500e0a3",
                "order": 14
            },
            {
                "adult": false,
                "backdrop_path": "/9CkI4VsYF8qJWfZpPqwZnBctb3M.jpg",
                "genre_ids": [
                    18
                ],
                "id": 50270,
                "original_language": "it",
                "original_title": "Paprika",
                "overview": "Mimma starts working in Madame Colette’s brothel to help her boyfriend financially. There she is rechristened “Paprika,” and falls in love with her first client, naval officer Franco. Despite this attraction, she begins her climb through the sex trade, residing in Italy’s most illustrious brothels.",
                "popularity": 22.5905,
                "poster_path": "/A2VdIkrwBtfbZphrzxpIvEfetjl.jpg",
                "release_date": "1991-02-13",
                "title": "Paprika",
                "video": false,
                "vote_average": 7.144,
                "vote_count": 546,
                "character": "Milvio",
                "credit_id": "6164301c91745b0044192b58",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Paolo Muller",
            "Paul Muller",
            "Paul Konrad Müller"
        ],
        "biography": "Paul Konrad Müller (born 11 March 1923) is a Swiss former actor who has appeared mostly in Italian films. His motion picture acting career in Europe spanned a period of 51 years.\n\nIn 1941/1942 he studied acting at the “Conservatoire National Supérieur d`Art Dramatique” in Paris. Until 1944 he had different engagements at theatres in Paris, e. g. “Theatre Pigalle”, “Salle Pleyel”, “Theatre des Ambassadeurs”. From 1944 to 1946 he was called up for military service in the French Army in Indochina shortly before the First Indochina War took place there. He caught malaria during that time and, in consequence of the disease, was left hard of hearing. From 1947 to 1948 he had different engagements at theatres and touring companies not only in France, but also in the French part of Allied-occupied Germany and in Florence, e. g. “Tournée Spectacles Moyses”, Teatro della Pergola. He acted, inter alia, under the direction of Georges Douking. His first film role came at age 25 in Ruy Blas (1948).\n\nPaul Muller appeared in over 230 films since his first role in 1948. He spent most of his life by working in Italy, his main country of residence. He worked over more than 60 years with most of the well-known European actresses and actors of classic cinema and with some famous names of the Cinema of Italy like Roberto Rossellini, Carlo Ponti, Federico Fellini, Mario Bava, Sergio Corbucci, Michelangelo Antonioni. He also made his appearance in films under the direction of Veit Harlan, Artur Brauner, Jesús \"Jess\" Franco, René Clément, Michael Curtiz, Richard Fleischer, Jean-Pierre Mocky and many others. (Jesus Franco alone co-starred him in no less than 18 films).\n\nSource: Article \"Paul Muller (actor)\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1923-03-11",
        "deathday": "2016-09-02",
        "gender": 2,
        "homepage": null,
        "id": 101549,
        "imdb_id": "nm0612219",
        "known_for_department": "Acting",
        "name": "Paul Müller",
        "place_of_birth": "Neuchâtel, Switzerland",
        "popularity": 0.1785,
        "profile_path": "/sOtKH3ouYaWH6EzNdfxNqCT6zUY.jpg"
    }
}