{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rBqdcQeM1h05YjF9rFtPWnNaDO2.jpg",
                "genre_ids": [
                    18
                ],
                "id": 11051,
                "original_language": "en",
                "original_title": "The Last Temptation of Christ",
                "overview": "Jesus, a humble Judean carpenter beginning to see that he is the son of God, is drawn into revolutionary action against the Roman occupiers by Judas -- despite his protestations that love, not violence, is the path to salvation. The burden of being the savior of mankind torments Jesus throughout his life, leading him to doubt.",
                "popularity": 2.8568,
                "poster_path": "/7L4qwrC1mipZXJfU5oRgQWChLv1.jpg",
                "release_date": "1988-05-28",
                "title": "The Last Temptation of Christ",
                "video": false,
                "vote_average": 7.228,
                "vote_count": 1125,
                "character": "Crowd Member (voice)",
                "credit_id": "5a8c93f7c3a36862e1098e45",
                "order": 40
            },
            {
                "adult": false,
                "backdrop_path": "/4840rkbpsiuow5ew155oVKcqJwj.jpg",
                "genre_ids": [
                    18
                ],
                "id": 615,
                "original_language": "en",
                "original_title": "The Passion of the Christ",
                "overview": "A graphic portrayal of the last twelve hours of Jesus of Nazareth's life.",
                "popularity": 8.8822,
                "poster_path": "/v9f9MMrq2nGQrN7cHnQRmEq9lSE.jpg",
                "release_date": "2004-02-25",
                "title": "The Passion of the Christ",
                "video": false,
                "vote_average": 7.518,
                "vote_count": 4914,
                "character": "Elder",
                "credit_id": "5acaca270e0a2631cc007166",
                "order": 29
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Ted Rusoff was an extremely prolific dubbing editor, director, and voice actor. He started as an opera singer in Los Angeles in the early 1960's before landing ADR work with his uncle Samuel Z. Arkoff at American International Pictures. Arkoff sent Rusoff to Italy in the late 60's to help get their dubbing system set up to American standards but Rusoff ended up living in Rome for the rest of his life. Rusoff's voice can be heard in the English versions of over 250 Italian, Japanese, Russian, and various European films. He also lent his voice to several big budget American films including THE LAST TEMPTATION OF CHRIST. Beginning in the late 1970's, Rusoff tried his hand at acting in front of the camera too as it was relatively easy for native English speakers in Italy to find acting work at the time. He acted alongside greats including Bob Hoskins and Max von Sydow, and in the dubbing studio alongside such dubbing legends as Robert Rietty, Geoffrey Copleston, Nick Alexander, Lewis E. Cianelli, and Mickey Knox.\n\nCast mostly as monks, elders and religious figures due to his large beard, Rusoff appeared in such bible epics as THE DAY CHRIST DIED and THE NATIVITY STORY as well as monks in DOUBLE TEAM and CATACOMBS. His most prestigious role is perhaps as the chief elder in PASSION OF THE CHRIST who throws the bag of money at Judas. Rusoff, being fluent in several languages including traditional Hebrew and ancient Aramaic, worked as chief translator for the film as well.\n\nRusoff married fellow voice actor / dubber Carolyn De Fonseca but the two had an open marriage. Rusoff fathered 9 daughters to different mothers over a span of 40 years, including one who was still an infant at the time of his death in 2013.",
        "birthday": "1939-05-20",
        "deathday": "2013-09-28",
        "gender": 2,
        "homepage": null,
        "id": 1016074,
        "imdb_id": "nm0750871",
        "known_for_department": "Acting",
        "name": "Ted Rusoff",
        "place_of_birth": "Winnipeg, Manitoba, Canada",
        "popularity": 0.2044,
        "profile_path": "/xxYvCAmU0JI1yUJ7q8lbpYPjS6q.jpg"
    }
}