{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9qGWOflC5WNhaKk2UPYu55SjjNj.jpg",
                "genre_ids": [
                    80,
                    53
                ],
                "id": 678,
                "original_language": "en",
                "original_title": "Out of the Past",
                "overview": "The peaceful life of a gas station owner is disrupted when a man from his past arrives in town and forces him to return to the dark world he had tried to escape.",
                "popularity": 2.2826,
                "poster_path": "/lnUK6Cg5ARM0qaq0B5SG20VAM0h.jpg",
                "release_date": "1947-11-25",
                "title": "Out of the Past",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 618,
                "character": "Jack Fisher",
                "credit_id": "52fe4269c3a36847f801c8d7",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Steve Brody",
            "Steve Broide",
            "John Daugherty Stephens"
        ],
        "biography": "​From Wikipedia, the free encyclopedia\n\nSteve Brodie (November 21, 1919 — January 9, 1992) was an American movie and television actor.\n\nBorn as John Stevenson in El Dorado, Kansas, he reportedly selected his screen name in tribute to Steve Brodie, who jumped from the Brooklyn Bridge in 1886 and survived.\n\nMost of his acting work was from the mid 1940s to the early 1950s working at MGM, RKO and Republic Pictures appearing mostly in westerns and B-movies. He mainly played supporting roles in films such as the film noir classic Out of the Past (1947) and the classic crime film Armored Car Robbery (1950), although he did have the starring role in Desperate (1947). He later appeared with Elvis Presley in Blue Hawaii (1961) and Roustabout (1964).\n\nBeginning in the mid-1950s he appeared largely on television, including, for instance, The Public Defender, three episodes of Alfred Hitchcock Presents, and in the episode \"Vendetta\" of the syndicated western series Pony Express. He and Sterling Holloway appeared in the 1960 episode \"Love Me, Love My Dog\" of the syndicated crime drama The Brothers Brannagan.\n\nDescription above from the Wikipedia articleSteve Brodie (actor), licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1919-11-21",
        "deathday": "1992-01-09",
        "gender": 2,
        "homepage": null,
        "id": 10162,
        "imdb_id": "nm0110917",
        "known_for_department": "Acting",
        "name": "Steve Brodie",
        "place_of_birth": "El Dorado, Kansas, USA",
        "popularity": 0.2784,
        "profile_path": "/cC8nuduu7C9pOZdctq8RpDrd9oj.jpg"
    }
}