{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yjlg8Gq3TAWlFSUxh7Icey8uM4P.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 10653,
                "original_language": "en",
                "original_title": "The Seven Year Itch",
                "overview": "With his family away for their annual summer holiday, a publishing executive decides to live a bachelor's life. The beautiful but ditzy blonde from the apartment above catches his eye and they soon start spending time together—maybe a little too much time!",
                "popularity": 1.7389,
                "poster_path": "/4oLqx0QbjWFzWtkxRmDLGH47CUJ.jpg",
                "release_date": "1955-06-03",
                "title": "The Seven Year Itch",
                "video": false,
                "vote_average": 7.063,
                "vote_count": 934,
                "character": "Ricky Sherman (uncredited)",
                "credit_id": "57437d8192514157e9000025",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Bernard Girouard ",
            "Butch Bernard",
            "Tommy Nolan",
            "Maurice Joseph Girouard Jr."
        ],
        "biography": "Young Tommy Nolan was a familiar child star face on 50s and 60s TV and in a few films as well. The name may not be as familiar but his adorable, jug-eared presence was a well-known commodity throughout the Hollywood community at the time, and he was considered a reliable and talented tyke who could easily turn on the waterworks on command. He was French-Canadian, born in Montreal on January 15, 1948. His birth name was Bernard Girouard. His family relocated to Los Angeles where the boy started dance classes at age 3. He made a reputable debut on TV playing Prince Edward of Wales, the son of Henry VIII, on a \"Hallmark Hall of Fame\" presentation starring Sarah Churchill. As one who could easily tug at the heartstrings, he often played sympathetic young boys with afflictions, such as his crippled youngster on an episode of \"My Friend Flicka\" or his wealthy asthmatic on \"Medic\". Tommy hit his TV peak at age 10 after being cast as Jody in the gentle, non-violent TV western \n\nBuckskin (1958) opposite Sally Brophy, who played his widowed mom. Set in the frontier town of Buckskin, Montana, the show was seen from his young perspective, narrating each episode sitting on his corral fence and playing his harmonica. Although it only played for one full season, Tommy had comic books out with his character and his autograph was well in demand at parades, conventions and other public outings. \n\nAfter the series' demise, Tommy continued on other shows, many of them westerns such as \"Rawhide\", \"The Rifleman\", \"Gunsmoke\" and \"Wagon Train\", not to mention recurring roles on \"Lassie\". Unable to find another regular series that could maintain the momentum, he also was starting to move in his awkward teens stage and this pretty much signified that the end was not far away. After years of scattered parts here and there, including a role in the exploitation film Maryjane (1968), he ended his career with a small part in the movie The Moonshine War (1970). Later years were spent as a writer, penning articles for a number of publications including \"Playboy\", the \"Los Angeles Times\" and the \"Village Voice\". He returned to acting as a young adult (shortening his name to the grown-up-sounding Tom Nolan) with a small part in the Richard Gere\n\n film Yanks (1979) and has since given it the old college try, appearing as a minor player in such films as Fast Times at Ridgemont High (1982),Up the Creek (1984), School Spirit (1985), Pretty Woman (1990), The Thing Called Love(1993) and White Man's Burden (1995). His most recent credit was as a valet in Batman Begins (2005). On TV he has been glimpsed in everything from waiters to courtroom deputies. Now having entered his fifth decade of acting, Tom continues to live in the San Fernando Valley area. - IMDb Mini Biography By: Gary Brumburgh / gr-home@pacbell.net",
        "birthday": "1948-01-15",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 101658,
        "imdb_id": "nm0076162",
        "known_for_department": "Acting",
        "name": "Tom Nolan",
        "place_of_birth": "Montreal, Quebec, Canada",
        "popularity": 0.9533,
        "profile_path": "/54j3SEN3lVUbEAk0BedWABq1Kxo.jpg"
    }
}