{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/c6yfABGVKuB5cjoOwdX4AJMlzUz.jpg",
                "genre_ids": [
                    35,
                    14
                ],
                "id": 620,
                "original_language": "en",
                "original_title": "Ghostbusters",
                "overview": "After losing their academic posts at a prestigious university, a team of parapsychologists goes into business as proton-pack-toting \"ghostbusters\" who exterminate ghouls, hobgoblins and supernatural pests of all stripes. An ad campaign pays off when a knockout cellist hires the squad to purge her swanky digs of demons that appear to be living in her refrigerator.",
                "popularity": 7.2781,
                "poster_path": "/7E8nLijS9AwwUEPu2oFYOVKhdFA.jpg",
                "release_date": "1984-06-08",
                "title": "Ghostbusters",
                "video": false,
                "vote_average": 7.495,
                "vote_count": 9352,
                "character": "Female Student",
                "credit_id": "52fe425fc3a36847f80192bb",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jennifer Runyon Corman"
        ],
        "biography": "​She is known for guest appearances or secondary characters in various sitcoms and dramas, as well as a couple of made-for-TV movies. Among her roles are Sally Frame on Another World (1981–1983), Gwendolyn Pierce on Charles in Charge (1984–1985), and replacing Susan Olsen as Cindy Brady in A Very Brady Christmas (1988). Runyon also had a small part inGhostbusters (1984) alongside Bill Murray and she starred in Up the Creek that same year. She was a guest on Beverly Hills, 90210 in 1991. In 1988, Jennifer played the lead in The In Crowd and was in the pilot of the TV series Quantum Leap. She also starred in the comedy 18 Again!. In 1990 she played a supporting role in the World War II parody A Man Called Sarge, produced by the brother of Roger Corman, Gene Corman, father of her husband Todd Corman. Her last role was in the 1993 movie Carnosaur. Runyon was born in Chicago, Illinois, the daughter of DJ Jim Runyon. She is retired from acting and lives in San Clemente, California. Her husband Todd Corman was the head coach of the Concordia University (Irvine, California) women's basketball team from 2004 to March 2008 when he tendered his resignation.\n\nDescription above from the Wikipedia article Jennifer Runyon, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1960-04-01",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 101652,
        "imdb_id": "nm0001690",
        "known_for_department": "Acting",
        "name": "Jennifer Runyon",
        "place_of_birth": "Chicago, Illinois, USA",
        "popularity": 0.3578,
        "profile_path": "/1j0Vt7pUROiNvI4ga0KfsNQnlWc.jpg"
    }
}