{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2aGtsMLVOiBiAUwQmCqYgau5AJF.jpg",
                "genre_ids": [
                    27,
                    35
                ],
                "id": 10779,
                "original_language": "en",
                "original_title": "The Frighteners",
                "overview": "Once an architect, Frank Bannister now passes himself off as an exorcist of evil spirits. To bolster his facade, he claims his \"special\" gift is the result of a car accident that killed his wife. But what he does not count on is more people dying in the small town where he lives. As he tries to piece together the supernatural mystery of these killings, he falls in love with the wife of one of the victims and deals with a crazy FBI agent.",
                "popularity": 3.0131,
                "poster_path": "/zcJbCMwFLJdn5OLjhYwMVaSB32R.jpg",
                "release_date": "1996-07-18",
                "title": "The Frighteners",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 1618,
                "character": "Old Lady Bradley",
                "credit_id": "52fe43b59251416c7501b187",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/etiP3Mu3ze2j9m3FEAAyOKFYlH0.jpg",
                "genre_ids": [
                    12,
                    28,
                    53,
                    878
                ],
                "id": 563,
                "original_language": "en",
                "original_title": "Starship Troopers",
                "overview": "Set in the future, the story follows a young soldier named Johnny Rico and his exploits in the Mobile Infantry. Rico's military career progresses from recruit to non-commissioned officer and finally to officer against the backdrop of an interstellar war between mankind and an arachnoid species known as \"the Bugs.\"",
                "popularity": 13.557,
                "poster_path": "/cxCmv23O7p3hyHwqoktHYkZcGsY.jpg",
                "release_date": "1997-11-07",
                "title": "Starship Troopers",
                "video": false,
                "vote_average": 7.09,
                "vote_count": 5186,
                "character": "Expert",
                "credit_id": "54c91305c3a36870ba00218f",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Juliana McCarthy"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nJulianna McCarthy (born August 17, 1929) is an American actress. McCarthy was an original cast member of the soap opera The Young and the Restless, starring as matriarch Liz Foster from 1973 to 1982. She reprised the role in 1984,1985-86,1993, 2003-2004, and 2008. She returned for her final appearance in the role in June, 2010.\n\nMcCarthy has also appeared in motion pictures as diverse as The Last American Virgin, The Distinguished Gentleman, The Frighteners, Starship Troopers and Ted Bundy.\n\nShe had a recurring role as Mila in Star Trek: Deep Space Nine, appearing in the episodes \"Improbable Cause\", \"The Dogs of War\" and the final episode, \"What You Leave Behind\". McCarthy also had recurring roles in Paradise and Dark Shadows.\n\nMcCarthy was born in Erie, Pennsylvania. She married actor Michael Constantine in Erie, Pennsylvania on October 5, 1953. They had 2 children together: Thea Eileen and Brendan Neil. The marriage ended in divorce in 1969.\n\nDescription above from the Wikipedia article Julianna McCarthy, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1929-08-17",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 101777,
        "imdb_id": "nm0565197",
        "known_for_department": "Acting",
        "name": "Julianna McCarthy",
        "place_of_birth": "Erie, Pennsylvania, USA",
        "popularity": 0.263,
        "profile_path": "/vNQRuYWIde8vUgs66S6MD1Y8FJP.jpg"
    }
}