{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/15HEZcSKtLcl69avXfmjoIJBuay.jpg",
                "genre_ids": [
                    9648,
                    53
                ],
                "id": 940,
                "original_language": "en",
                "original_title": "The Lady Vanishes",
                "overview": "On a train headed for England a group of travelers is delayed by an avalanche. Holed up in a hotel in a fictional European country, young Iris befriends elderly Miss Froy. When the train resumes, Iris suffers a bout of unconsciousness and wakes to find the old woman has disappeared. The other passengers ominously deny Miss Froy ever existed, so Iris begins to investigate with another traveler and, as the pair sleuth, romantic sparks fly.",
                "popularity": 3.4055,
                "poster_path": "/c1t9LB76LvEARPanfEzXmkm7fwY.jpg",
                "release_date": "1938-10-07",
                "title": "The Lady Vanishes",
                "video": false,
                "vote_average": 7.44,
                "vote_count": 971,
                "character": "The Nun",
                "credit_id": "5869a29b9251414e7d01265d",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia\n\nCatherine Lacey (6 May 1904 – 23 September 1979) was an English actress of stage and screen.\n\nShe made her film debut in 1938 as the secretive nun who wears high heels in the Alfred Hitchcock film The Lady Vanishes, but was credited as Catherine Lacy. She was subsequently cast in major films like I Know Where I'm Going! (1945), The October Man (1947), Whisky Galore! (1949), The Servant (1963) and The Fighting Prince of Donegal (1966), in which she played Queen Elizabeth I. In 1966/67 she played in two notable horror films, as a malevolent fortune-teller in The Mummy's Shroud and as Boris Karloff's insane wife in Michael Reeves' The Sorcerers. For the latter she won a 'Silver Asteroid' award as Best Actress at the Trieste Science Fiction Film Festival in 1968.\n\nEight years earlier she received the Guild of TV Producers and Directors award as Actress of the Year. Her television debut, in 1938, was in a BBC production of The Duchess of Malfi; her last appearance, in 1973, was in the Play for Today instalment Mrs Palfrey at the Claremont.",
        "birthday": "1904-05-06",
        "deathday": "1979-09-23",
        "gender": 1,
        "homepage": null,
        "id": 101723,
        "imdb_id": "nm0479910",
        "known_for_department": "Acting",
        "name": "Catherine Lacey",
        "place_of_birth": "London, England, UK",
        "popularity": 0.0352,
        "profile_path": "/zBSTwNxjWUGKborTVkIhjoWoh1T.jpg"
    }
}