{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bfh9Z3Ghz4FOJAfLOAhmc3ccnHU.jpg",
                "genre_ids": [
                    12,
                    14
                ],
                "id": 671,
                "original_language": "en",
                "original_title": "Harry Potter and the Philosopher's Stone",
                "overview": "Harry Potter has lived under the stairs at his aunt and uncle's house his whole life. But on his 11th birthday, he learns he's a powerful wizard—with a place waiting for him at the Hogwarts School of Witchcraft and Wizardry. As he learns to harness his newfound powers with the help of the school's kindly headmaster, Harry uncovers the truth about his parents' deaths—and about the villain who's to blame.",
                "popularity": 35.6553,
                "poster_path": "/wuMc08IPKEatf9rnMNXvIDxqP4W.jpg",
                "release_date": "2001-11-16",
                "title": "Harry Potter and the Philosopher's Stone",
                "video": false,
                "vote_average": 7.901,
                "vote_count": 28610,
                "character": "Ravenclaw Student (uncredited)",
                "credit_id": "6014d33f1b70ae003d5dd693",
                "order": 56
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Derek Hough is an American professional Latin and ballroom dancer, choreographer, actor and singer.  From 2007 to 2016, Hough was a professional dancer on the ABC dance competition series Dancing with the Stars, winning the show a record-breaking six times with his celebrity partners. He later became a judge on the series beginning with its 29th season.\n\nHough has also appeared as an actor on stage, appearing at the West End premiere of Footloose: The Musical at the Novello Theatre and as well as the 2015 New York Spring Spectacular at Radio City Music Hall in New York City. In film and television, he has starred in the film Make Your Move and had a recurring role in the ABC musical-drama Nashville. In 2016, he appeared as Corny Collins in NBC's live musical TV-production of Hairspray Live! From 2017 to 2020, Hough served as a judge on the NBC dance competition series World of Dance. In 2024, Hough co-starred in Jennifer Lopez autobiographical musical comedy 'This Is Me... Now'.\n\nHough is a four-time Emmy winner for Outstanding Choreography and has earned fourteen Emmy Award nominations in total for his work on Dancing with the Stars.",
        "birthday": "1985-05-17",
        "deathday": null,
        "gender": 2,
        "homepage": "https://derekhough.com/",
        "id": 1019545,
        "imdb_id": "nm2625538",
        "known_for_department": "Acting",
        "name": "Derek Hough",
        "place_of_birth": "Salt Lake City, Utah, USA",
        "popularity": 0.3456,
        "profile_path": "/hqoaN7BCL2E5L0MFD8ooWrECwWW.jpg"
    }
}