{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jMBpJFRtrtIXymer93XLavPwI3P.jpg",
                "genre_ids": [
                    28,
                    53,
                    878
                ],
                "id": 679,
                "original_language": "en",
                "original_title": "Aliens",
                "overview": "Ripley, the sole survivor of the Nostromo's deadly encounter with the monstrous Alien, returns to Earth after drifting through space in hypersleep for 57 years. Although her story is initially met with skepticism, she agrees to accompany a team of Colonial Marines back to LV-426.",
                "popularity": 10.7593,
                "poster_path": "/r1x5JGpyqZU8PYhbs4UcrO1Xb6x.jpg",
                "release_date": "1986-07-18",
                "title": "Aliens",
                "video": false,
                "vote_average": 7.952,
                "vote_count": 10315,
                "character": "Private Frost",
                "credit_id": "52fe4269c3a36847f801c9f3",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/sra8XnL96OyLHENcglmZJg6HA8z.jpg",
                "genre_ids": [
                    12,
                    28,
                    53
                ],
                "id": 954,
                "original_language": "en",
                "original_title": "Mission: Impossible",
                "overview": "When Ethan Hunt, the leader of a crack espionage team whose perilous operation has gone awry with no explanation, discovers that a mole has penetrated the CIA, he's surprised to learn that he's the prime suspect. To clear his name, Hunt now must ferret out the real double agent and, in the process, even the score.",
                "popularity": 12.2448,
                "poster_path": "/l5uxY5m5OInWpcExIpKG6AR3rgL.jpg",
                "release_date": "1996-05-22",
                "title": "Mission: Impossible",
                "video": false,
                "vote_average": 7.011,
                "vote_count": 9530,
                "character": "Denied Area Security Guard",
                "credit_id": "57f3c65dc3a368333f00a5ba",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nRicco Ross (born April 16, 1960) is an American actor. Ricco was born in Chicago, Il. at Cook County Hospital, is the 5th of 8 children with three additional step sisters and another brother from his father and with his first wife. He begin acting in a local high school production. He continued with this development of a new career going to a local Community College where he majored in Theater, moving forward to Florida Atlantic University (FAU) where he received is BA in Theatre, earning a scholarship to UCLA where his career begain to develop. His first TV role was as an extra on the \"Young and the Restless\", then a small part on the hit series \"Hill Street Blues\" opening the door for more TV and Movie Roles. He played Private Frost in Aliens, and also appeared in the films Mission Impossible and Fierce Creatures. During the late 1980s and early 1990s, he lived and worked in the United Kingdom, leading to guest appearances on Doctor Who (\"The Greatest Show in the Galaxy\") and Jeeves and Wooster. Ross also co-starred as Nate in the film \"Nate and the Colonel\". He also played in Charles Bronsons \"Death Wish Three\", \"Spies Like Us\" with Dan Akroyd and Chevy Chase, the \"Dirty Dozen Next Mission\" with Lee Marvin. \"Displaced Person\" and many more films.\n\nRoss is appearing in various commercials, as well as television shows shown throughout the United States.\n\nDescription above from the Wikipedia article Ricco Ross, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1960-04-16",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 10212,
        "imdb_id": "nm0743768",
        "known_for_department": "Acting",
        "name": "Ricco Ross",
        "place_of_birth": "Chicago, Illinois, United States",
        "popularity": 1.9439,
        "profile_path": "/uXnxQldNApoiTJMecHA5xbi222S.jpg"
    }
}