{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jVzoKlWUpsKV3y5oLafLQhEvgX6.jpg",
                "genre_ids": [
                    14,
                    18,
                    9648
                ],
                "id": 5961,
                "original_language": "sv",
                "original_title": "Fanny och Alexander",
                "overview": "As children in the loving Ekdahl family, Fanny and Alexander enjoy a happy life with their parents, who run a theater company. After their father dies unexpectedly, however, the siblings end up in a joyless home when their mother, Emilie, marries a stern bishop. The bleak situation gradually grows worse as the bishop becomes more controlling, but dedicated relatives make a valiant attempt to aid Emilie, Fanny and Alexander.",
                "popularity": 2.0306,
                "poster_path": "/q8jlA3Wc1Z987hNKRFA44g5OugC.jpg",
                "release_date": "1982-12-17",
                "title": "Fanny and Alexander",
                "video": false,
                "vote_average": 7.8,
                "vote_count": 817,
                "character": "Gustav Adolf Ekdahl",
                "credit_id": "52fe4432c3a36847f8087f27",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ярл Кулле"
        ],
        "biography": "Jarl Lage Kulle was a Swedish stage and screen actor, director and singer. He graduated from the Royal Dramatic Theatre's acting school in 1949, was subsequently employed at the theatre and was a member of the ensemble till 1995. In total, Kulle played in 76 plays at the Royal dramatic Theatre in Stockholm. In 1959 he appeared as Henry Higgins in the musical \"My Fair Lady\" at Oscarsteatern, Stockholm. Thirteen years earlier, in 1946, Jarl Kulle made his film debut in a minor role. Ten years later he was offered major parts as first lover and prince charming. Internationally he's probably most known for his performances in Ingmar Bergman's \"Smiles of a Summer Night\" and \"Fanny and Alexander\".",
        "birthday": "1927-02-27",
        "deathday": "1997-10-03",
        "gender": 2,
        "homepage": null,
        "id": 1022633,
        "imdb_id": "nm0474649",
        "known_for_department": "Acting",
        "name": "Jarl Kulle",
        "place_of_birth": "Ekeby, Malmöhus län, Sweden",
        "popularity": 0.1204,
        "profile_path": "/9UJ3Msw0k0fkV5vQiRqG3j4Pfq9.jpg"
    }
}