{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bSvUW4JQ6g4QiKvwejcfcPRd4Ke.jpg",
                "genre_ids": [
                    12,
                    35,
                    10751,
                    14
                ],
                "id": 118,
                "original_language": "en",
                "original_title": "Charlie and the Chocolate Factory",
                "overview": "A young boy wins a tour through the most magnificent chocolate factory in the world, led by the world's most unusual candy maker.",
                "popularity": 14.4294,
                "poster_path": "/iKP6wg3c6COUe8gYutoGG7qcPnO.jpg",
                "release_date": "2005-07-13",
                "title": "Charlie and the Chocolate Factory",
                "video": false,
                "vote_average": 7.041,
                "vote_count": 15654,
                "character": "Narrator (voice)",
                "credit_id": "5916a313925141580d02bf39",
                "order": 39
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Джеффри Ламонт Холдер"
        ],
        "biography": "Born in Port of Spain, Trinidad of African descent, Holder was an actor known for his towering 200-centimeter (6'6\") height, heavily accented deep basso voice and hearty laugh. With that and his appearance in the 1970s 7 Up soft drink \"uncola\" advertising campaign, Holder's image quickly became recognizable. He was also in the 1967 movie Dr. Dolittle as William Shakespeare, \"Willy,\" and played Baron Samedi, one of the main villain's henchmen, in the 1973 James Bond film, Live and Let Die. Though the 7 Up advertising campaign lasted only a short while in the early 1970s, the company revived the campaign in the early 1980s after Holder achieved a spike in popularity in the 1982 movie version of the musical Annie, in which he played the role of Punjab. He was a prolific painter, ardent art collector, and performer who had also authored books and composed music. As a choreographer, he created dance pieces for many companies, including the Alvin Ailey American Dance Theater and The Dance Theatre of Harlem. Holder was married to dancer Carmen De Lavallade, whom he met when both were in the cast of Truman Capote's House of Flowers. .",
        "birthday": "1930-08-01",
        "deathday": "2014-10-05",
        "gender": 2,
        "homepage": null,
        "id": 10225,
        "imdb_id": "nm0390305",
        "known_for_department": "Acting",
        "name": "Geoffrey Holder",
        "place_of_birth": "Port-of-Spain, Trinidad",
        "popularity": 0.2084,
        "profile_path": "/ncS1CTgCKEChpu73VCNWrtYp7Xx.jpg"
    }
}