{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kGzFbGhp99zva6oZODW5atUtnqi.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 240,
                "original_language": "en",
                "original_title": "The Godfather Part II",
                "overview": "In the continuing saga of the Corleone crime family, a young Vito Corleone grows up in Sicily and in 1910s New York. In the 1950s, Michael Corleone attempts to expand the family business into Las Vegas, Hollywood and Cuba.",
                "popularity": 16.2247,
                "poster_path": "/hek3koDUyRQk7FIhPXsa6mT2Zc3.jpg",
                "release_date": "1974-12-20",
                "title": "The Godfather Part II",
                "video": false,
                "vote_average": 8.57,
                "vote_count": 13188,
                "character": "Senator #2",
                "credit_id": "52fe422bc3a36847f80095bb",
                "order": 59
            },
            {
                "adult": false,
                "backdrop_path": "/aYcnDyLMnpKce1FOYUpZrXtgUye.jpg",
                "genre_ids": [
                    80,
                    53,
                    18
                ],
                "id": 274,
                "original_language": "en",
                "original_title": "The Silence of the Lambs",
                "overview": "Clarice Starling is a top student at the FBI's training academy.  Jack Crawford wants Clarice to interview Dr. Hannibal Lecter, a brilliant psychiatrist who is also a violent psychopath, serving life behind bars for various acts of murder and cannibalism.  Crawford believes that Lecter may have insight into a case and that Starling, as an attractive young woman, may be just the bait to draw him out.",
                "popularity": 3.9428,
                "poster_path": "/uS9m8OBk1A8eM9I042bx8XXpqAq.jpg",
                "release_date": "1991-02-14",
                "title": "The Silence of the Lambs",
                "video": false,
                "vote_average": 8.347,
                "vote_count": 17103,
                "character": "FBI Director Hayden Burke",
                "credit_id": "52fe4230c3a36847f800adfb",
                "order": 16
            },
            {
                "adult": false,
                "backdrop_path": "/AfGp6Ev3BVdEd7L99kGQzOzsqRb.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 568,
                "original_language": "en",
                "original_title": "Apollo 13",
                "overview": "The true story of technical troubles that scuttle the Apollo 13 lunar mission in 1970, risking the lives of astronaut Jim Lovell and his crew, with the failed journey turning into a thrilling saga of heroism. Drifting more than 200,000 miles from Earth, the astronauts work furiously with the ground crew to avert tragedy.",
                "popularity": 8.5919,
                "poster_path": "/tVeKscCm2fY1xDXZk8PgnZ87h9S.jpg",
                "release_date": "1995-06-30",
                "title": "Apollo 13",
                "video": false,
                "vote_average": 7.451,
                "vote_count": 5604,
                "character": "Congressman",
                "credit_id": "52fe4254c3a36847f80159b9",
                "order": 63
            },
            {
                "adult": false,
                "backdrop_path": "/mE2TjYsnqdWxPt45kIElw3az4O9.jpg",
                "genre_ids": [
                    18
                ],
                "id": 9800,
                "original_language": "en",
                "original_title": "Philadelphia",
                "overview": "Two competing lawyers join forces to sue a prestigious law firm for AIDS discrimination. As their unlikely friendship develops their courage overcomes the prejudice and corruption of their powerful adversaries.",
                "popularity": 3.7367,
                "poster_path": "/tFe5Yoo5zT495okA49bq1vPPkiV.jpg",
                "release_date": "1993-12-22",
                "title": "Philadelphia",
                "video": false,
                "vote_average": 7.718,
                "vote_count": 4416,
                "character": "Mr. Laird",
                "credit_id": "5370efb50e0a26616200016e",
                "order": 13
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/fuKt9vmyN8cpZvPflfW9YGrFTuQ.jpg",
                "genre_ids": [
                    27,
                    35
                ],
                "id": 10776,
                "original_language": "en",
                "original_title": "Little Shop of Horrors",
                "overview": "Seymour Krelborn is a nerdy orphan working at Mushnik's; a flower shop in urban Skid Row. He harbors a crush on fellow co-worker, Audrey Fulquard, and is berated by Mr. Mushnik daily. One day, Seymour finds a very mysterious unidentified plant which he calls Audrey II. The plant seems to have a craving for blood and soon begins to sing for his supper.",
                "popularity": 2.4653,
                "poster_path": "/iKkbN17OmFosaW6asCNZTTsyvpu.jpg",
                "release_date": "1986-12-19",
                "title": "Little Shop of Horrors",
                "video": false,
                "vote_average": 6.954,
                "vote_count": 1526,
                "credit_id": "67761b2b185486515d12a7c3",
                "department": "Writing",
                "job": "Original Film Writer"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Roger William Corman",
            "The Pope of Pop Cinema",
            "راجر کورمن",
            "The King of The B’s"
        ],
        "biography": "Roger William Corman was an American film director, producer and actor. Known under various monikers such as \"The Pope of Pop Cinema\", “The King of The B’s”, \"The Spiritual Godfather of the New Hollywood\", and \"The King of Cult\", he was known as a trailblazer in the world of independent film.\n\nMany of the more than 500 features directed or produced by Corman were low-budget films that later attracted a cult following, such as The Little Shop of Horrors (1960), The Intruder (1962), X: The Man with the X-ray Eyes (1963), and the counterculture films, The Wild Angels (1966) and The Trip (1967). House of Usher (1960) became the first of eight films directed by Corman that were adapted from the tales of Edgar Allan Poe, and which collectively came to be known as the \"Poe Cycle\".\n\nIn 1964, Corman became the youngest filmmaker to have a retrospective at the Cinémathèque française, as well as in the British Film Institute and the Museum of Modern Art. He was the co-founder of New World Pictures, the founder of New Concorde and was a longtime member of the Academy of Motion Picture Arts and Sciences. In 2009, he was awarded an Academy Honorary Award \"for his rich engendering of films and filmmakers\".\n\nCorman was also famous for handling the U.S. distribution of many films by noted foreign directors, including Federico Fellini (Italy), Ingmar Bergman (Sweden), François Truffaut (France) and Akira Kurosawa (Japan). He mentored and gave a start to many young film directors such as Francis Ford Coppola, Ron Howard, Martin Scorsese, Jonathan Demme, Peter Bogdanovich, Joe Dante, John Sayles, and James Cameron, and was highly influential in the New Hollywood filmmaking movement of the 1960s and 1970s. He also helped to launch the careers of actors like Peter Fonda, Jack Nicholson, Dennis Hopper, Bruce Dern, Diane Ladd, and William Shatner.",
        "birthday": "1926-04-05",
        "deathday": "2024-05-09",
        "gender": 2,
        "homepage": null,
        "id": 102429,
        "imdb_id": "nm0000339",
        "known_for_department": "Production",
        "name": "Roger Corman",
        "place_of_birth": "Detroit, Michigan, USA",
        "popularity": 0.6447,
        "profile_path": "/6rFtY1r1SolTbdhqGj3ZuTcjg8U.jpg"
    }
}