{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/d84M69u6Q202dm6EvhVxbiqrK9f.jpg",
                "genre_ids": [
                    12,
                    18
                ],
                "id": 334533,
                "original_language": "en",
                "original_title": "Captain Fantastic",
                "overview": "Deep in the forests of the Pacific Northwest, a father devoted to raising his six kids with a rigorous physical and intellectual education is forced to leave his paradise and enter the world, beginning a journey that challenges his idea of what it means to be a parent.",
                "popularity": 5.3481,
                "poster_path": "/2sFME73GaD8UsUxPUKe60cPdLif.jpg",
                "release_date": "2016-07-08",
                "title": "Captain Fantastic",
                "video": false,
                "vote_average": 7.892,
                "vote_count": 6607,
                "character": "Vespyr Cash",
                "credit_id": "5521b4099251415c7c0040e8",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Annalise Nicole Basso",
            "آنالیس باسو"
        ],
        "biography": "Annalise Basso is an American film and television actress and model. She is the youngest child of Marcie Basso and has an older brother and sister named Gabriel and Alexandria. Most of her initial roles have been on television commercials or small one time roles on different shows. Her first role that caught the attention of people was her role as Eden Hamby on True Blood. In 2009, she played a main role in the TV movie Love Takes Wing from the Love Comes Softly series. When she was 10, she took part in the Are You Smarter Than a 5th Grader? where she played one of the students. Basso's first lead role in a feature film is in D.J. Caruso's Standing Up, a coming of age flick based on a book by Brock Cole called The Goats, which debuted at the 2012 Cannes Film Festival.",
        "birthday": "1998-12-02",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1024722,
        "imdb_id": "nm2399383",
        "known_for_department": "Acting",
        "name": "Annalise Basso",
        "place_of_birth": "St. Louis, Missouri, USA",
        "popularity": 0.7403,
        "profile_path": "/83ZIWVz4TxrCNgnUVayrMnv9UXA.jpg"
    }
}