{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/enNubozHn9pXi0ycTVYUWfpHZm.jpg",
                "genre_ids": [
                    18,
                    28,
                    80,
                    53
                ],
                "id": 155,
                "original_language": "en",
                "original_title": "The Dark Knight",
                "overview": "Batman raises the stakes in his war on crime. With the help of Lt. Jim Gordon and District Attorney Harvey Dent, Batman sets out to dismantle the remaining criminal organizations that plague the streets. The partnership proves to be effective, but they soon find themselves prey to a reign of chaos unleashed by a rising criminal mastermind known to the terrified citizens of Gotham as the Joker.",
                "popularity": 45.0503,
                "poster_path": "/qJ2tW6WMUDux911r6m7haRef0WH.jpg",
                "release_date": "2008-07-16",
                "title": "The Dark Knight",
                "video": false,
                "vote_average": 8.5,
                "vote_count": 34382,
                "character": "Man Trying to Reach Coleman Reese (uncredited)",
                "credit_id": "5a66699bc3a3685701004c82",
                "order": 97
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Alkaline Trio",
            "Blink-182"
        ],
        "biography": "Matthew Thomas \"Matt\" Skiba (born February 24, 1976) is an American musician, singer, and songwriter, known for his role as the founding lead vocalist and guitarist for Alkaline Trio and the guitarist and co-lead vocalist of the band Blink-182 (2015–2022). His lyrical content commonly involves dark romantic themes.\n\nAlkaline Trio was formed in 1996 with Skiba as the frontman. Since then, the band has released nine full-length albums over two decades. Skiba also recorded albums with side projects including Heavens and theHell, as well as two full-length solo albums with his backing band, the Sekrets.\n\nFollowing Tom DeLonge's second departure from Blink-182 in early 2015, Skiba began touring with the pop-punk trio, then joined the band permanently later that year; he has since recorded two albums with them.",
        "birthday": "1976-02-24",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1024279,
        "imdb_id": "nm1928349",
        "known_for_department": "Acting",
        "name": "Matt Skiba",
        "place_of_birth": "Chicago, Illinois, USA",
        "popularity": 0.1128,
        "profile_path": "/wQbOevWW1YQfzcVB18af6abh5hV.jpg"
    }
}