{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cnl95VtUon66J1PLRPpsgYgwHF7.jpg",
                "genre_ids": [
                    99,
                    36
                ],
                "id": 803,
                "original_language": "fr",
                "original_title": "Nuit et Brouillard",
                "overview": "Filmmaker Alain Resnais documents the atrocities behind the walls of Hitler's concentration camps.",
                "popularity": 2.4796,
                "poster_path": "/2iWYQia8enOai7QEO3TvenleD7r.jpg",
                "release_date": "1959-04-27",
                "title": "Night and Fog",
                "video": false,
                "vote_average": 8.243,
                "vote_count": 522,
                "character": "Self (archive footage) (uncredited)",
                "credit_id": "52fe4278c3a36847f8021479",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/y5ebTEBtpLn8PprGTWQhDfq33k8.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 42229,
                "original_language": "it",
                "original_title": "Una giornata particolare",
                "overview": "Two neighbours — a persecuted journalist and a resigned housewife — forge a strong bond on the day of Adolf Hitler's historic 1938 visit to Rome.",
                "popularity": 2.153,
                "poster_path": "/jzRn7N1mFowkQ5IkUkfWoxXJtYU.jpg",
                "release_date": "1977-08-11",
                "title": "A Special Day",
                "video": false,
                "vote_average": 8.056,
                "vote_count": 717,
                "character": "Self (archive footage) (uncredited)",
                "credit_id": "61d62e17700bf70065009915",
                "order": 12
            },
            {
                "adult": false,
                "backdrop_path": "/4MXAOW1hfTaz34KO65PRgaVo35z.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 1807,
                "original_language": "en",
                "original_title": "Elephant",
                "overview": "Several ordinary high school students go through their daily routine as two others prepare for something more malevolent.",
                "popularity": 3.8023,
                "poster_path": "/1a4VU9z2hxEvugHMK7VsobB9xTX.jpg",
                "release_date": "2003-09-20",
                "title": "Elephant",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 2004,
                "character": "Self (archive footage)(uncredited)",
                "credit_id": "6516ae86c50ad200eabd557e",
                "order": 51
            },
            {
                "adult": false,
                "backdrop_path": "/70uUnpfe7en9x011UjpZoub101l.jpg",
                "genre_ids": [
                    99,
                    18,
                    80
                ],
                "id": 1430,
                "original_language": "en",
                "original_title": "Bowling for Columbine",
                "overview": "This is not a film about gun control. It is a film about the fearful heart and soul of the United States, and the 280 million Americans lucky enough to have the right to a constitutionally protected Uzi. From a look at the Columbine High School security camera tapes to the home of Oscar-winning NRA President Charlton Heston, from a young man who makes homemade napalm with The Anarchist's Cookbook to the murder of a six-year-old girl by another six-year-old. Bowling for Columbine is a journey through the US, through our past, hoping to discover why our pursuit of happiness is so riddled with violence.",
                "popularity": 4.6426,
                "poster_path": "/5AlgeysilsfLdEwlTlYO7fqgsLn.jpg",
                "release_date": "2002-10-09",
                "title": "Bowling for Columbine",
                "video": false,
                "vote_average": 7.518,
                "vote_count": 1614,
                "character": "Self (archive footage)",
                "credit_id": "633b6f58cf48a1007dbc290a",
                "order": 24
            },
            {
                "adult": false,
                "backdrop_path": "/obyCUbpZvMTizOqYWHqkTFgfvnf.jpg",
                "genre_ids": [
                    10752,
                    10749,
                    36,
                    28
                ],
                "id": 676,
                "original_language": "en",
                "original_title": "Pearl Harbor",
                "overview": "The lifelong friendship between Rafe McCawley and Danny Walker is put to the ultimate test when the two ace fighter pilots become entangled in a love triangle with beautiful Naval nurse Evelyn Johnson. But the rivalry between the friends-turned-foes is immediately put on hold when they find themselves at the center of Japan's devastating attack on Pearl Harbor on Dec. 7, 1941.",
                "popularity": 9.0424,
                "poster_path": "/y8A0Cvp8WQmZ3bjbnsL53lY0dsC.jpg",
                "release_date": "2001-05-21",
                "title": "Pearl Harbor",
                "video": false,
                "vote_average": 6.942,
                "vote_count": 6742,
                "character": "Self (archive footage) (uncredited)",
                "credit_id": "5ffcf51247c9fb004179f4f7",
                "order": 106
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Adolf Hitler (April 20, 1889 – April 30, 1945) was an Austrian-born German politician and the leader of the National Socialist German Workers Party (German: Nationalsozialistische Deutsche Arbeiterpartei, abbreviated NSDAP), commonly known as the Nazi Party. He was Chancellor of Germany from 1933 to 1945, and served as head of state as Führer und Reichskanzler from 1934 to 1945. Hitler is most remembered for his central leadership role in the rise of fascism in Europe, World War II and the Holocaust. A decorated veteran of World War I, Hitler joined the precursor of the Nazi Party (DAP) in 1919, and became leader of NSDAP in 1921. He attempted a coup d'état known as the Beer Hall Putsch, which occurred at the Bürgerbräukeller beer hall in Munich on 8–9 November 1923. Hitler was imprisoned for one year due to the failed coup, and wrote his memoir, Mein Kampf (in English \"My Struggle\"), while imprisoned. After his release on 20 December 1924, he gained support by promoting Pan-Germanism, antisemitism and anti-communism with charismatic oratory and propaganda. He was appointed chancellor on 30 January 1933, and transformed the Weimar Republic into the Third Reich, a single-party dictatorship based on the totalitarian and autocratic ideology of Nazism. Nazi forces engaged in numerous violent acts during the war, including the systematic murder of as many as 17 million civilians, including an estimated six million Jews targeted in the Holocaust and between 500,000 and 1,500,000 Roma, added to the Poles, Soviet civilians, Soviet prisoners of war, people with disabilities, homosexuals, Jehovah's Witnesses, and other political and religious opponents. In the final days of the war, during the Battle of Berlin in 1945, Hitler married his long-time mistress Eva Braun. To avoid capture by Soviet forces, the two committed suicide less than two days later on 30 April 1945 and their corpses were burned.",
        "birthday": "1889-04-20",
        "deathday": "1945-04-30",
        "gender": 2,
        "homepage": null,
        "id": 10279,
        "imdb_id": "nm0386944",
        "known_for_department": "Acting",
        "name": "Adolf Hitler",
        "place_of_birth": "Braunau am Inn, Austria",
        "popularity": 0.4852,
        "profile_path": "/n6f81IUSes1a8jTzUIF7rJ5zZnP.jpg"
    }
}