{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fwo0IsHudrMVmASe107UciIOlmR.jpg",
                "genre_ids": [
                    12,
                    28,
                    35
                ],
                "id": 11616,
                "original_language": "it",
                "original_title": "Nati con la camicia",
                "overview": "After Doug picks up hitchhiking Rosco with his truck, they are mistaken for two bank robbers by the traffic police. They manage to escape  only to be confused for two secret agents while trying to take a flight at the airport.",
                "popularity": 2.1141,
                "poster_path": "/gfv6ctg1BTtpQeOkwThe4EzDSK9.jpg",
                "release_date": "1983-02-01",
                "title": "Go for It",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 520,
                "character": "Leonard (uncredited)",
                "credit_id": "5e46b5260c27100013866c23",
                "order": 23
            }
        ],
        "crew": []
    },
    "details": {
        "adult": true,
        "also_known_as": [
            "Joseph Nassi",
            "Joey Sivera",
            "Jo Civera",
            "Joseph Savera",
            " Joey Civera",
            "Joseph Land",
            "Rick Hassler",
            "Joseph Civera",
            "Mike Reed",
            "Joey Severa",
            "Tom Hofmann",
            "Giuseppe Nassivera",
            "Steve Stud",
            "Joe Maseria",
            "Neil Long"
        ],
        "biography": "Joey Silvera (born Joseph Nassivera on December 20, 1951) is an American pornographic actor and director.\n\nJoey Silvera has been involved in the American pornographic industry since the early 1970s. A native of upstate New York, he got his start performing in San Francisco in 1974, and went on to appear in more than 1,000 videos. He was often cast as the wacky sidekick to the lead actor, and was regarded as one of adult film's best actors.\n\nIn the early 1990s, Silvera went on to direct videos for his own company All Blew Shirts (later called Joey Silvera Video). His movies were first distributed by Devil's Film, and he later was invited to join John Stagliano's Evil Angel. Silvera is credited with bringing transsexual, or shemale, videos to the porno mainstream. His notable lines include Service Animals, Face Fucking, Inc. and the shemale series Rogue Adventures.\n\nHe appeared on American rap musician Necro's 2005 album, The Sexorcist, with a spoken word part on the song 'Whore' claiming Necro inspires his porn films. He is a member of the AVN, Legends of Erotica and XRCO Halls of Fame.\n\nDescription above from the Wikipedia article Joey Silvera, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1951-12-20",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 102881,
        "imdb_id": "nm0798827",
        "known_for_department": "Acting",
        "name": "Joey Silvera",
        "place_of_birth": "Rochester, New York, USA",
        "popularity": 7.306,
        "profile_path": "/oyF1IAuyRrSSPkXds6k74sPZuxI.jpg"
    }
}