{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lYfHa1AtkUMtplrKx7SRLHpwonW.jpg",
                "genre_ids": [
                    12,
                    14,
                    27
                ],
                "id": 244,
                "original_language": "en",
                "original_title": "King Kong",
                "overview": "Adventurous filmmaker Carl Denham sets out to produce a motion picture unlike anything the world has seen before. Alongside his leading lady Ann Darrow and his first mate Jack Driscoll, they arrive on an island and discover a legendary creature said to be neither beast nor man. Denham captures the monster to be displayed on Broadway as King Kong, the eighth wonder of the world.",
                "popularity": 3.0442,
                "poster_path": "/lHlnxKL5GbgRibyRFI7n1Ey850i.jpg",
                "release_date": "1933-03-15",
                "title": "King Kong",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 1544,
                "character": "Native Handmaiden (uncredited)",
                "credit_id": "66bec0932a9ea78b426109b7",
                "order": 38
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Nellie Wan",
            "Nellie Crawford",
            "Madame Sultewan",
            "Madame Wan",
            "Sul-Te-Wan"
        ],
        "biography": "From Wikipedia, the free encyclopedia.  Madame Sul-Te-Wan (born Nellie Crawford; March 7, 1873 – February 1, 1959) was the first African-American actress to sign a film contract and be a featured performer. She was an American stage, film and television actress for over 50 years. The daughter of former slaves, she began her career in entertainment touring the East Coast with various theatrical companies and moved to California to become a member of the fledgling film community. She became known as a character actress, appeared in high-profile films such as The Birth of a Nation (1915) and Intolerance (1916), and easily navigated the transition to the sound films.\n\nIn 1986, she was inducted into the Black Filmmakers Hall of Fame.",
        "birthday": "1873-03-07",
        "deathday": "1959-02-01",
        "gender": 1,
        "homepage": null,
        "id": 103017,
        "imdb_id": "nm0837801",
        "known_for_department": "Acting",
        "name": "Madame Sul-Te-Wan",
        "place_of_birth": "Louisville, Kentucky, USA",
        "popularity": 0.1188,
        "profile_path": "/rdXUDnRemlHbWUGIG4Yjs1hEkaA.jpg"
    }
}