{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zAL3LOswagN9onjN8DPcNFTqKuD.jpg",
                "genre_ids": [
                    18
                ],
                "id": 705,
                "original_language": "en",
                "original_title": "All About Eve",
                "overview": "From the moment she glimpses her idol at the stage door, Eve Harrington is determined to take the reins of power away from the great actress Margo Channing. Eve maneuvers her way into Margo's Broadway role, becomes a sensation and even causes turmoil in the lives of Margo's director boyfriend, her playwright and his wife. Only the cynical drama critic sees through Eve, admiring her audacity and perfect pattern of deceit.",
                "popularity": 2.0482,
                "poster_path": "/blBzZaatPWVuWpXEnPscMA4Xp6m.jpg",
                "release_date": "1950-11-09",
                "title": "All About Eve",
                "video": false,
                "vote_average": 8.076,
                "vote_count": 1604,
                "character": "Girl in a Lobby of the 21 Club (uncredited)",
                "credit_id": "636a4bc666565a007a460893",
                "order": 43
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia.\n\nAnn Robinson (born May 25, 1929) is an American actress.\n\nRobinson was born in Hollywood, California to a bank employee father. She began her professional life as a stunt woman. Paramount signed her as an actress in the 1950s, and her first leading role was as \"Sylvia Van Buren\" in that studio's 1953 film, The War of the Worlds, a role she reprised 35 years later in three episodes of the War of the Worlds television series. She also had a small role in the 2005 Steven Spielberg film, War of the Worlds.\n\nHer career as a leading woman was effectively ended when she eloped to Mexico to marry a matador, Jaime Bravo, with whom she had two sons, Jaime Jr. and Estefan. Since then she has played minor roles, mainly in science fiction films. The couple divorced in 1967. Bravo died in an automobile accident in 1970. She married real estate broker Joseph Valdez in 1987.\n\nRobinson makes guest appearances at autograph shows and science fiction conventions.\n\nDescription above from the Wikipedia article Ann Robinson, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1929-05-25",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 103079,
        "imdb_id": "nm0732378",
        "known_for_department": "Acting",
        "name": "Ann Robinson",
        "place_of_birth": "Hollywood, Los Angeles, California",
        "popularity": 0.2631,
        "profile_path": "/jFmvxs57XKtZiNDpGu4S9BGjIl5.jpg"
    }
}