{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4840rkbpsiuow5ew155oVKcqJwj.jpg",
                "genre_ids": [
                    18
                ],
                "id": 615,
                "original_language": "en",
                "original_title": "The Passion of the Christ",
                "overview": "A graphic portrayal of the last twelve hours of Jesus of Nazareth's life.",
                "popularity": 8.8822,
                "poster_path": "/v9f9MMrq2nGQrN7cHnQRmEq9lSE.jpg",
                "release_date": "2004-02-25",
                "title": "The Passion of the Christ",
                "video": false,
                "vote_average": 7.518,
                "vote_count": 4914,
                "character": "Baby",
                "credit_id": "5acad09f0e0a2631a3007a8d",
                "order": 59
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Davide Marotta was born on 20 November 1962 in Naples, Campania, Italy. He is an actor, known for A Midsummer Night's Dream (1999), The Passion of the Christ (2004) and Ammen (2020). Affected by dwarfism , Davide Marotta is 1.15 m tall. After some theatrical experiences, in 1985 he was chosen by Dario Argento to play the deformed son of Frau Brückner ( Daria Nicolodi ) in Phenomena . The following year he played a similar part in Demons 2 by Lamberto Bava. From 1987 to 1997 he was a testimonial for Kodak in famous commercials in which he played the alien Ciribiribì.\n\nAfter various television experiences and small parts in the cinema, in 2001 he obtained for the first time an important role in The Return of Cagliostro by Daniele Ciprì and Franco Maresco . In 2004 he played a small part in Mel Gibson 's Passion of the Christ , in the role of the Antichrist in the form of a child in the arms of Satan , played by Rosalinda Celentano .\n\nFrom 2008 to 2012 he played the part of a postman in the show Il miracolo di don Ciccillo by Carlo Buccirosso and, the following year, in Finché morte non vi separi , by the same author, in the role of a sacristan.\n\nIn 2015 he participated as a \"pizzino\" in the comedy program Il boss dei comici broadcast from 18 October 2015 on the television network LA7 . Also in 2015 he acted in Leonardo Pieraccioni's film Il professor Cenerentolo . In 2016 he participated in Made in Sud on Rai 2.\n\nIn 2019 he starred in Matteo Garrone 's Pinocchio and played a triple role: the Talking Cricket , the puppet Pantalone and one of the gravedigger rabbits.",
        "birthday": "1962-11-20",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 103063,
        "imdb_id": "nm0549591",
        "known_for_department": "Acting",
        "name": "Davide Marotta",
        "place_of_birth": "Naples, Italy",
        "popularity": 0.9947,
        "profile_path": "/uUZGOU77bw0KYbgHHVzJusMBmxM.jpg"
    }
}