{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gkXL5ka6ciU4A4KYSvLIAXtvh7k.jpg",
                "genre_ids": [
                    53,
                    18,
                    27
                ],
                "id": 10242,
                "original_language": "en",
                "original_title": "What Ever Happened to Baby Jane?",
                "overview": "A former child star torments her paraplegic sister in their decaying Hollywood mansion.",
                "popularity": 3.7595,
                "poster_path": "/msGYzyWwtjAaA3DScdgmvJ5MReG.jpg",
                "release_date": "1962-10-31",
                "title": "What Ever Happened to Baby Jane?",
                "video": false,
                "vote_average": 7.904,
                "vote_count": 1103,
                "character": "Elvira Stitt",
                "credit_id": "52fe43489251416c7500a671",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Mady Norman",
            "Madie Norman"
        ],
        "biography": "Maidie Norman was born Maidie Ruth Gamble on October 16, 1912, in Villa Rica, Georgia, to Louis and Lila Gamble. She received a B.A. from Bennett College in 1934 and a master's degree from Columbia University three years later. She also attended the Actors Lab in Hollywood from 1946 to 1949.\n\nNorman first appeared on film in The Peanut Man in 1947. Throughout the fifties-not a good time for film roles for black women-she appeared in a number of films, such as Bright Road with Dorothy Dandridge and Sidney Poitier and Torch Song, both in 1953; About Mrs. Leslie and Susan Slept Here in 1954; and 1956's Written on the Wind. These were often servant roles, with a special fifties blandness. Still, Norman was skillful and professional in her execution of them. In 1962, she got a chance to chew up the scenery with Bette Davis and Joan Crawford in What Ever Happened to Baby Jane?\n\nIn 1968-69, Norman was an artist-in-residence at Stanford University and, throughout the seventies, she was lecturer, director, and acting teacher at UCLA. At the same time, Norman was highly visible on television, appearing in Mannix, Adam 12, Streets of San Francisco, Kung Fu, The Jeffersons, and others. She was also part of the cast of Roots: The Next Generation in 1979.\n\nNorman was a founding member of the American Negro Theater West; in 1977, she was inducted into the Black Filmmakers Hall of Fame; and an award in her name is presented each year for outstanding research by an undergraduate in Black Theater at UCLA. She died on May 6, 1998.",
        "birthday": "1912-10-16",
        "deathday": "1998-05-02",
        "gender": 1,
        "homepage": null,
        "id": 103087,
        "imdb_id": "nm0635564",
        "known_for_department": "Acting",
        "name": "Maidie Norman",
        "place_of_birth": "Villa Rica, Georgia, USA",
        "popularity": 0.6429,
        "profile_path": "/jRJuM943e4dwyJli5yWiWNYr5w1.jpg"
    }
}