{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/b6usdEMEOX5pcVpXrS32z0NOwGc.jpg",
                "genre_ids": [
                    16,
                    12,
                    10749
                ],
                "id": 153158,
                "original_language": "es",
                "original_title": "Metegol",
                "overview": "All seems well for Amadeo, a shy but talented foosball player who's in love with the free-spirited Laura. Trouble strikes when Grosso, the world's best soccer player, returns home with plans to destroy the village and turn it into a new sports stadium. When Grosso kidnaps Laura, Amadeo receives the ultimate surprise when the figurines from his foosball table spring to life to help him save his beloved and reclaim the town.",
                "popularity": 4.1116,
                "poster_path": "/tJL0oyVmrwSpULCAGaTqs9VMTdM.jpg",
                "release_date": "2013-07-18",
                "title": "Underdogs",
                "video": false,
                "vote_average": 6.983,
                "vote_count": 529,
                "character": "Capitán Liso (voice)",
                "credit_id": "64da85edb77d4b11425d6927",
                "order": 22
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Miguel A. Rodríguez 'Chino'",
            "Miguel Ángel Rodríguez 'El Chino'",
            "Miguel Ángel 'El Chino'",
            "Miguel Angel Rodriguez El Judicial",
            "El Judicial",
            "Miguel Angel Rodriguez",
            "Miguel A. Rodríguez"
        ],
        "biography": "Miguel Ángel Rodríguez is a Mexican born actor and director with more than 200 credits. Among his work, he has acted in Rosalinda and Bad Cop with Damian Chapa.\n\nOne of his earliest roles was in the 1977 Rafael Villaseñor Kuri directed film, Mil caminos tiene la muerte. After that he acted with René Cardona and Roberto Cañedo in Cronica roja, released in 1978/1979. Also around the time, he appeared in Benjamín Argumedo el rebelde, which was directed by Mario Hernández. Around 1989/1990, he played the part of Det. Mike Silva in the Alfredo Zacarías directed Crime of Crimes, which also starred David Carradine. He played the part of Javier Pérez in the 1999 film Rosalinda.\n\nHe played a gangster in the Damian Chapa directed film Bad Cop, which was released in 2009. He recently appeared in the 2016 TV series Eva La Trailera.\n\n(Wikipedia)",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1031901,
        "imdb_id": "nm0736032",
        "known_for_department": "Acting",
        "name": "Miguel Ángel Rodríguez",
        "place_of_birth": "Los Reyes, Michoacan, Mexico",
        "popularity": 0.3995,
        "profile_path": "/fl0gC1xX5KVweIish9EcuVcYb1b.jpg"
    }
}