{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4Bb1kMIfrT2tYRZ9M6Jhqy6gkeF.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 76203,
                "original_language": "en",
                "original_title": "12 Years a Slave",
                "overview": "In the pre-Civil War United States, Solomon Northup, a free black man from upstate New York, is abducted and sold into slavery. Facing cruelty as well as unexpected kindnesses Solomon struggles not only to stay alive, but to retain his dignity. In the twelfth year of his unforgettable odyssey, Solomon’s chance meeting with a Canadian abolitionist will forever alter his life.",
                "popularity": 7.0513,
                "poster_path": "/xdANQijuNrJaw1HA61rDccME4Tm.jpg",
                "release_date": "2013-10-18",
                "title": "12 Years a Slave",
                "video": false,
                "vote_average": 7.938,
                "vote_count": 11592,
                "character": "Anna",
                "credit_id": "5318fff892514177c2001744",
                "order": 21
            },
            {
                "adult": false,
                "backdrop_path": "/am782sUaTOGcEPEdUUjybwUZP1f.jpg",
                "genre_ids": [
                    878,
                    53,
                    27
                ],
                "id": 520763,
                "original_language": "en",
                "original_title": "A Quiet Place Part II",
                "overview": "Following the events at home, the Abbott family now face the terrors of the outside world. Forced to venture into the unknown, they realize that the creatures that hunt by sound are not the only threats that lurk beyond the sand path.",
                "popularity": 9.483,
                "poster_path": "/4q2hz2m8hubgvijz8Ez0T2Os2Yv.jpg",
                "release_date": "2021-05-21",
                "title": "A Quiet Place Part II",
                "video": false,
                "vote_average": 7.458,
                "vote_count": 6965,
                "character": "Woman on Island",
                "credit_id": "5e0cd4d6a84ff70013352ffc",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Actress Ashley Dyke is best known for her roles as Anna in Steve McQueen's Academy Award winning film \"12 Years A Slave\", and as Stacey in John Krasinski's \"The Hollars\". Ashley was raised in Fairfax, Virginia. She is the daughter of two lawyers, Ellen Dyke and the Honorable James W. Dyke, Jr., the first African-American Secretary of Education for the Commonwealth of Virginia and immediate past Chairman of the Greater Washington Board of Trade. Her mother is Jewish of Hungarian and Polish decent and was born and raised in New York City. Her father is an African-American Christian and was raised in Maryland and Virginia. They met at Howard University School of Law from which they received their law degrees. Ashley is the third of four children\n\nShe went to Fairfax High School where she was highly involved in student government and was an All American Athlete. She went on to get her degree in theater from the prestigious University of Virginia, and also studied at the celebrated New York University Tisch School of the Arts, where she acquired her first taste of television as a series regular on a campus produced show called \"Stratagem.\" She also performed in several productions while in college including a lead role in \"The Vagina Monologues\".\n\nAshley moved to Los Angeles to further her career in film and television and hasn't looked back since. She continues to work in theater landing lead roles at theaters including, Second City, Acme Theater, and La Mirada Theater For the Performing Arts. Building a solid career in Hollywood in both comedy and drama. Ashley most recently guest starred on Robin Williams show on CBS \"The Crazy Ones\", the series finale of Stephen Merchant's HBO show \"Hello Ladies\", CBS's season finale of \"CSI: NY,\" NBC's \"The Cape\", and the CW's \"90210.\"\n\nAshley has successfully portrayed a wide range of characters, a young tormented slave in \"12 Years A Slave\", the wildly outrageous Gigi in \"Bud'z House\", a young girl struggling in a half-way house in the thriller \"New Hope Manor\"; on stage, as a young woman surviving a concentration camp in \"I Never Saw Another Butterfly.\", and as a young black woman living in the segregated 1940\"s Ohio, in the theater production of Toni Morrison's, \"The Bluest Eye\".",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1031785,
        "imdb_id": "nm1788122",
        "known_for_department": "Acting",
        "name": "Ashley Dyke",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.0857,
        "profile_path": "/sQlsPw96Odg2CUDgckjzAbv57KX.jpg"
    }
}