{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2lfDV3DCNumvNyEhgsIGsrB19fs.jpg",
                "genre_ids": [
                    37,
                    12
                ],
                "id": 995,
                "original_language": "en",
                "original_title": "Stagecoach",
                "overview": "A group of people traveling on a stagecoach find their journey complicated by the threat of Geronimo, and learn something about each other in the process.",
                "popularity": 3.4391,
                "poster_path": "/zgMnfnwWZ3nkx4t0bUDEKtW24O8.jpg",
                "release_date": "1939-03-02",
                "title": "Stagecoach",
                "video": false,
                "vote_average": 7.625,
                "vote_count": 1172,
                "character": "Nancy Whitney (uncredited)",
                "credit_id": "55515c2292514152eb000b99",
                "order": 40
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Florence Silverlake"
        ],
        "biography": "From Wikipedia\n\nFlorence Lake (born Florence Silverlake, November 27, 1904 – April 11, 1980) was an American actress best known as the leading lady in most of the Edgar Kennedy comedy shorts.\n\nFlorence was petite, with a high-pitched speaking voice. She perfected a comical singsong delivery that established her in \"dumb\" roles. She personified flightiness in the Kennedy shorts, as the scatterbrained Mrs. Kennedy. After the series ended upon Kennedy's death in 1948, she continued to play character roles in films and television. Her best-known TV role was Jenny, the Claverton telephone operator in Lassie. Lake played the role for the entire ten year \"farm seasons\" of the show (1954–1964), thus becoming the Lassie player with the longest tour of duty on the series.\n\nShe played the role of Mama Angel in a 1957 episode of the The Lone Ranger TV series entitled \"The Angel and the Outlaw\". She also appeared in the first color episode of the TV series Superman in 1957 as a cave woman.\n\nIn her later years, Lake appeared as Elvira Norton on an episode of Dragnet entitled \"Frauds\". She also played a blind date for the character Lou Grant on The Mary Tyler Moore Show episode, \"Lou's First Date\". Her last roles were in the TV series Emergency! and Baretta in 1976.",
        "birthday": "1904-11-27",
        "deathday": "1980-04-11",
        "gender": 1,
        "homepage": null,
        "id": 103232,
        "imdb_id": "nm0482142",
        "known_for_department": "Acting",
        "name": "Florence Lake",
        "place_of_birth": "Charleston, South Carolina, USA",
        "popularity": 0.1051,
        "profile_path": "/8gMkdeMDR0ZjhZavHLaQYsBm235.jpg"
    }
}