{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rjXK74vrvmFMN0vuFw3TViZ18Ha.jpg",
                "genre_ids": [
                    16,
                    10749,
                    12,
                    18,
                    14
                ],
                "id": 204436,
                "original_language": "fr",
                "original_title": "Jack et la mécanique du cœur",
                "overview": "In Scotland 1874, Jack is born on the coldest day ever. Because of the extreme cold, his heart stops beating. The responsible midwife in Edinburgh finds a way to save him by replacing his heart with a clock. So he lives and remains under the midwife's protective care. But he must not get angry or excited because that endangers his life by causing his clock to stop working. Worse than that, when he grows up, he has to face the fact he cannot fall in love because that too could stop his delicate heart.",
                "popularity": 2.3296,
                "poster_path": "/ZSrU2mvlzM5Jr30XtKCU1fziIj.jpg",
                "release_date": "2014-02-05",
                "title": "Jack and the Cuckoo-Clock Heart",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 738,
                "character": "Miss Acacia (voice)",
                "credit_id": "52fe4cf4c3a368484e1ced75",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Olivia Blanc"
        ],
        "biography": "Ruiz was born at Carcassonne, daughter of musician Didier Blanc though later taking her grandmother's maiden name Ruiz. In 2001, she was a prominent contestant in the first French edition of Star Academy, a popular TV reality-show and musical contest. She was defeated in the semi-final by eventual winner Jenifer Bartoli but according to an interview on Europe 1 she claimed that she never wanted to win and, following a post-series tour, worked to distance herself from the Star Ac image.\n\nFor her second studio album La Femme Chocolat, Olivia Ruiz was recognised by the Victoires de la Musique as the Female Artist of the Year in 2007. For the live performances accompanying the record, she also received the prize in the category of Musical Show, Tour or Concert of the Year. The album topped the French chart and was certified as a diamond record for selling more than 750,000 copies in France and made it to the top 50 of the Walloon and Swiss charts. Off the album, the music videos of the tracks \"J'traine des pieds\" and \"La femme chocolat\" were placed on rotation on the MCM French TV channel in 2006. The singles made it to the top 50 of the French and Walloon charts.\n\nOlivia Ruiz wrote all the lyrics for her third studio album Miss Météores, co-orchestrated the music and employed a crew of guest stars including the rapper Buck 65, the indie band Noisettes and the folk and dark cabaret project Lonely Drifter Karen and featured the styles of nouvelle chanson, punk, folk and Hispanic rock. The record topped the French and Walloon album charts in 2009. Off the album, the single \"Elle panique\", with the music written by Buck 65 peaked at #2 of the Walloon chart. The music video of the song was placed on rotation on the MCM in May 2009. Her partner is Mathias Malzieu, the lead singer of the band Dionysos.\n\nDescription above from the Wikipedia article Olivia Ruiz, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1980-01-01",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.olivia-ruiz.com/",
        "id": 1033011,
        "imdb_id": "nm1121600",
        "known_for_department": "Acting",
        "name": "Olivia Ruiz",
        "place_of_birth": "Carcassonne, Aude, France",
        "popularity": 0.1884,
        "profile_path": "/27acJQUGiErjL8HTioYm6aSjpCS.jpg"
    }
}