{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/pQQYGl6JzyUzzd6TxjkVah3H8wq.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 821881,
                "original_language": "en",
                "original_title": "The Swimmers",
                "overview": "From war-torn Syria to the 2016 Rio Olympics, two young sisters embark on a risky voyage, putting their hearts and their swimming skills to heroic use.",
                "popularity": 2.8932,
                "poster_path": "/u9MiJ6zLpDw4s3qZz93WDVwTUIo.jpg",
                "release_date": "2022-11-24",
                "title": "The Swimmers",
                "video": false,
                "vote_average": 7.438,
                "vote_count": 597,
                "character": "Mervat Mardini",
                "credit_id": "60821068a06645003f85a0b4",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "كنده علوش",
            "キンダ・アルーシュ",
            "كندة مازن علوش"
        ],
        "biography": "Kinda Alloush is a Cairo-based Syrian actress with an extensive repertoire of notable works in Syria, Egypt, and across the Arab world. After completing her studies in Theater Criticism at the Higher Institute for Dramatic Arts in Damascus, Kinda made a brief foray into the theatrical direction before she started acting in 2005. Her acting debut was in a TV drama called Ashwak Naaeima (2005). In the same year, she appeared in Ahkad Khafeya, alzzahir Bybrs and Nizar Qubani TV series, which all premiered with huge success. Her talent seemed to attract a large number of film auteurs across the Arab world immediately as she took part in several Arab films and TV dramas. Her first role on the silver screen was in the Jordanian film The Strangers (2009). In 2009, it seemed to be the year where Kinda held all the aces. She appeared in the Egyptian TV hit Hedou' Nesbi, starring along with a large number of Arab TV stars and appeared in the Egyptian blockbuster Welad El-Am opposite Egyptian superstars Mona Abdelaziz, Kareem Abdelaziz, and Mona Zaki, which catapulted her to fame in Egypt. This was followed by a string of notable works in Egyptian cinema and TV dramas across the Arab world. Her long list of notable TV works includes Ahl Cairo (2010), for which she won Murex D'Or Award for Best Actress in 2010, Niran Sadeeka (2013), for which she won Excellence Award at the Oscar ART in 2013, Al Ahd (El Kalam El Mobah) (2015). Her most remarkable films include Brtita (2012), Al-Maslaha (2012), Excuse My French (2014), and the highest-grossing romantic film in the history of Egyptian cinema Hepta: The Last Lecture (2016), to name a few. Kinda was also honored for her work, in which she was selected as a jury member of the Freedom Films competition at the Luxor African Film Festival, a Juror at the Tropfest Arabia Short Film Festival, and was honored at the Oscar ART in 2013. Kinda is starring in an upcoming TV Drama, Ilaa Ana, by director Mohamed Osama. The new TV series consists of six different stories with 10 episodes for each and Kinda is featured in a story titled \"Dai El Amar\".",
        "birthday": "1982-03-27",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1033788,
        "imdb_id": "nm4371761",
        "known_for_department": "Acting",
        "name": "Kinda Alloush",
        "place_of_birth": "Daraa, Syria",
        "popularity": 1.289,
        "profile_path": "/lhjTsn5rfL7yAs31PuWRMHrOytu.jpg"
    }
}