{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qszuXKhzYR24oRpsmh7eZaPbvL8.jpg",
                "genre_ids": [
                    18,
                    27,
                    53
                ],
                "id": 805,
                "original_language": "en",
                "original_title": "Rosemary's Baby",
                "overview": "A young couple, Rosemary and Guy, moves into an infamous New York apartment building, known by frightening legends and mysterious events, with the purpose of starting a family.",
                "popularity": 3.3933,
                "poster_path": "/uYgvlHceRFjAFbsNeMInYcLZLUb.jpg",
                "release_date": "1968-06-12",
                "title": "Rosemary's Baby",
                "video": false,
                "vote_average": 7.825,
                "vote_count": 4132,
                "character": "Rosemary's Girl Friend",
                "credit_id": "52fe4279c3a36847f80215ff",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia. Born to a U.S. Navy commander and swimming and diving coach father (John H. Wagner) and a mother (Rudy Arnold Wagner) who was a champion skier, Wagner grew up on Coronado Island in California and lived in nearly all the Continental United States with her family's various naval postings.[citation needed]\n\nWhile living in Coronado, California, with her family, Billy Wilder, then filming Some Like It Hot, saw Wagner swimming and offered her a screen test. Her parents forbade it until she completed her senior year at Coronado High School. Some Like It Hot was filmed at the Hotel del Coronado as well as on the Coronado beaches. After graduating, she visited Wilder and did a screen test, but turned down a role in The Apartment.\n\nWagner travelled the world as a fashion model, then made her television debut in an episode of Wagon Train in 1959. While living in the Bahamas she became an underwater stunt double in the series Sea Hunt and The Aquanauts.She also doubled for Joanne Dru in underwater sequences in the 1960 film September Storm. Wagner appeared on What's My Line in December 1960 as a \"Stunt skindiver for television films\". She married fellow underwater expert Courtney Brown whom she had met while working on the shows.\n\nIn addition to her scuba diving and swimming she was also a surfer.\n\nAfter having a daughter named Tiffany, she divorced Brown and became contracted to 20th Century Fox. Her film career included roles in Rio Conchos (1964), Out of Sight (1966), Destination Inner Space (1966), A Covenant with Death (1967), Rosemary's Baby (1968) and Guns of the Magnificent Seven (1969). She married and divorced actor James Mitchum. Wagner was also friends with Sharon Tate with the two sharing an apartment for a while.\n\nIn 1965, she appeared on Perry Mason as defendant Anona Gilbert in \"The Case of the Feather Cloak.\" Wagner also made guest appearances in other television shows including Flipper, Lassie, Mannix, and The Rookies. During 1966-67, she had a regular role as Lenore \"Casey\" Case, the secretary to Britt Reid on The Green Hornet.\n\nWagner lived in Malibu but lost her home and belongings in a fire. She was active with the Malibu Historical Society.",
        "birthday": "1941-12-06",
        "deathday": "1997-02-26",
        "gender": 1,
        "homepage": null,
        "id": 103457,
        "imdb_id": "nm0906147",
        "known_for_department": "Acting",
        "name": "Wende Wagner",
        "place_of_birth": "Connecticut, U.S.A.",
        "popularity": 0.1156,
        "profile_path": "/24prAHeRPePC9de9KMU2ItqNBj9.jpg"
    }
}