{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1nV6ZCqOFmwRaRKYcU5vHkmQkra.jpg",
                "genre_ids": [
                    18
                ],
                "id": 103731,
                "original_language": "en",
                "original_title": "Mud",
                "overview": "Two teenage boys find a fugitive hiding out on an island in the Mississippi River and help him reunite with his lover and escape an avenging family and their armed posse.",
                "popularity": 2.883,
                "poster_path": "/o2jT5jQdKh1HAF0fMKuGwBOwOYB.jpg",
                "release_date": "2013-04-26",
                "title": "Mud",
                "video": false,
                "vote_average": 7.064,
                "vote_count": 2921,
                "character": "Ellis",
                "credit_id": "52fe4a25c3a36847f81bc9d3",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/5a7lMDn3nAj2ByO0X1fg6BhUphR.jpg",
                "genre_ids": [
                    12,
                    28,
                    878
                ],
                "id": 333339,
                "original_language": "en",
                "original_title": "Ready Player One",
                "overview": "When the creator of a popular video game system dies, a virtual contest is created to compete for his fortune.",
                "popularity": 13.382,
                "poster_path": "/pU1ULUq8D3iRxl1fdX2lZIzdHuI.jpg",
                "release_date": "2018-03-28",
                "title": "Ready Player One",
                "video": false,
                "vote_average": 7.585,
                "vote_count": 16246,
                "character": "Parzival / Wade",
                "credit_id": "56cea5ffc3a3681e440016c2",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/5ZSwZPKgcTJJwhxjbOHeoBTVaKh.jpg",
                "genre_ids": [
                    35,
                    28,
                    12
                ],
                "id": 567604,
                "original_language": "en",
                "original_title": "Once Upon a Deadpool",
                "overview": "A kidnapped Fred Savage is forced to endure Deadpool's PG-13 rendition of Deadpool 2, as a Princess Bride-esque story that's full of magic, wonder, and zero Fs.",
                "popularity": 5.0225,
                "poster_path": "/w6Jk8BHohhoKBUcxGeSyDQGWGWc.jpg",
                "release_date": "2018-12-11",
                "title": "Once Upon a Deadpool",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 813,
                "character": "Scott Summers /  Cyclops (uncredited)",
                "credit_id": "5c22b11bc3a3681c34ede894",
                "order": 61
            },
            {
                "adult": false,
                "backdrop_path": "/sGtXDnT08Nkb5NQq2oGD3os1zg9.jpg",
                "genre_ids": [
                    28,
                    35,
                    12
                ],
                "id": 383498,
                "original_language": "en",
                "original_title": "Deadpool 2",
                "overview": "Wisecracking mercenary Deadpool battles the evil and powerful Cable and other bad guys to save a boy's life.",
                "popularity": 11.7309,
                "poster_path": "/to0spRl1CMDvyUbOnbb4fTk3VAd.jpg",
                "release_date": "2018-05-15",
                "title": "Deadpool 2",
                "video": false,
                "vote_average": 7.489,
                "vote_count": 18610,
                "character": "Cyclops (uncredited)",
                "credit_id": "5dff992bd236e600108f2545",
                "order": 66
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "泰尔 谢里丹",
            "타이 쉐리던",
            "Тай Шерідан",
            "Тай Шеридан",
            "泰·舒利頓",
            "تای شریدان",
            "تای شریدن"
        ],
        "biography": "Tye Sheridan (born November 11, 1996) is an American actor. His breakout role came in 2012 with his critically acclaimed performance in Jeff Nichols' \"Mud,\" where he starred alongside Matthew McConaughey and Reese Witherspoon. His portrayal earned him a Critics' Choice nomination for Best Young Actor and further solidified his reputation as a promising actor.\n\nIn 2013, Sheridan's talent was recognized on an international stage when he won the Marcello Mastroianni Award at the Venice Film Festival for his role in David Gordon Green's \"Joe.\" This accolade propelled him further into the spotlight and opened doors to a wider range of opportunities.\n\nSheridan's career continued to flourish with a series of diverse roles in both independent and mainstream films. He starred in the 2014 thriller \"The Forger,\" alongside John Travolta, and the 2015 Sundance Film Festival selections \"The Stanford Prison Experiment,\" \"Last Days in the Desert,\" and \"Entertainment.\" He also took on a leading role in the 2015 horror-comedy \"Scouts Guide to the Zombie Apocalypse\" and appeared in the mystery thriller \"Dark Places.\"\n\nIn 2016, Sheridan joined the X-Men franchise, portraying the young Cyclops/Scott Summers in \"X-Men: Apocalypse.\" He reprised this role in the 2019 sequel, \"X-Men: Dark Phoenix.\"\n\nSheridan's versatility as an actor is evident in his diverse filmography. In 2017, he starred in the historical drama \"The Yellow Birds,\" which premiered at the Sundance Film Festival. He then took on a leading role in the 2018 drama \"The Mountain,\" which premiered at the Venice Film Festival, and won the Golden Goblet Award at the Shanghai International Film Festival for his performance in the coming-of-age drama \"Age Out\" (2018).\n\nIn 2018, Sheridan starred in Steven Spielberg's science fiction adventure film \"Ready Player One,\" based on Ernest Cline's best-selling novel. His portrayal of Wade Watts, the film's protagonist, garnered widespread acclaim and further cemented his status as a leading actor.\n\nSheridan's most recent work includes the 2020 thriller \"The Night Clerk,\" where he starred alongside Ana de Armas, and \"Voyagers\" (2021), a science fiction thriller set in space. In 2022, he starred in the sci-fi drama \"The Tender Bar,\" directed by George Clooney, and co-starred in the horror film \"Significant Other.\"\n\nAs of 2024, Tye Sheridan has several projects in various stages of development. He is set to star in the upcoming drama film \"The Card Counter,\" directed by Paul Schrader, and is attached to star in and produce the science fiction thriller \"Black Flies,\" based on Shannon Burke's novel. Sheridan is also co-founder of Wonder Dynamics, an AI production company aimed at revolutionizing the film industry.\n\nWith his talent, dedication, and impressive body of work, Tye Sheridan is undoubtedly a force to be reckoned with in Hollywood. As he continues to take on diverse roles and explore new creative avenues, there's no doubt that his star will continue to rise in the years to come.\n\nIMDb mini bio by yusufpiskin",
        "birthday": "1996-11-11",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1034681,
        "imdb_id": "nm4446467",
        "known_for_department": "Acting",
        "name": "Tye Sheridan",
        "place_of_birth": "Elkhart, Texas, USA",
        "popularity": 1.0209,
        "profile_path": "/d5ZS2fjqC98cIGkhEGX0fRYhku4.jpg"
    }
}