{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/me67dwJnUBt3O9NqZaBdEQ6i4vM.jpg",
                "genre_ids": [
                    14,
                    16,
                    10749,
                    10751
                ],
                "id": 10882,
                "original_language": "en",
                "original_title": "Sleeping Beauty",
                "overview": "Cursed to die by the evil fairy Maleficent when she was a baby, Princess Aurora is sent into hiding under protection from three good fairies. As she grows up far away, Maleficent becomes increasingly determined to seal the princess's fate.",
                "popularity": 5.2054,
                "poster_path": "/dK4OZwFFxnfK7MvqfVqw94mavL7.jpg",
                "release_date": "1959-02-17",
                "title": "Sleeping Beauty",
                "video": false,
                "vote_average": 6.943,
                "vote_count": 5316,
                "character": "Fauna (voice)",
                "credit_id": "52fe43c99251416c7501e245",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/m1TOfgljbT3jOez3b4l1I1tm82W.jpg",
                "genre_ids": [
                    16,
                    10751,
                    14
                ],
                "id": 9078,
                "original_language": "en",
                "original_title": "The Sword in the Stone",
                "overview": "Wart is a young boy who aspires to be a knight's squire. On a hunting trip he falls in on Merlin, a powerful but amnesiac wizard who has plans for him beyond mere squiredom. He starts by trying to give him an education, believing that once one has an education, one can go anywhere. Needless to say, it doesn't quite work out that way.",
                "popularity": 7.2175,
                "poster_path": "/7lyeeuhGAJSNXYEW34S8mJ1bwI8.jpg",
                "release_date": "1963-12-25",
                "title": "The Sword in the Stone",
                "video": false,
                "vote_average": 7.228,
                "vote_count": 3963,
                "character": "Scullery Maid (voice) (uncredited)",
                "credit_id": "5aeaa04392514167c1000574",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Vera Vague",
            "Marian Barbara Henshall"
        ],
        "biography": "From Wikipedia\n\nBarbara Jo Allen (September 2, 1906 – September 14, 1974) was an actress also known as Vera Vague, the spinster character she created and portrayed on radio and in films during the 1940s and 1950s. She based the character on a woman she had seen delivering a PTA literature lecture in a confused manner. As Vague, she popularized the catch phrase \"You dear boy!\"\n\nAllen's acting ability first surfaced in school plays. Following her high school graduation, she went to Paris to study at the Sorbonne. Concentrating on language, she became proficient in French, Spanish, German and Italian. After the death of her parents, she moved to Los Angeles where she lived with her uncle.\n\nIn 1937, she debuted on network radio drama as Beth Holly on NBC's One Man's Family, followed by roles on Death Valley Days, I Love a Mystery and other radio series. According to Allen, her Vera Vague character was “sort of a frustrated female, dumb, always ambitious and overzealous… a spouting Bureau of Misinformation.” After Vera was introduced in 1939 on NBC Matinee, she became a regular with Bob Hope beginning in 1941.\n\nAllen appeared in at least 60 movies and TV series between 1938 and 1963, often credited as Vera Vague rather than her own name. The character she created was so popular that she eventually adopted the character name as her professional name. From 1943 to 1952, as Vera, she made more than a dozen comedy two-reel short subjects for Columbia Pictures.\n\nIn 1948, she did less acting and instead opened her own commercial orchid business, while also serving as the Honorary Mayor of Woodland Hills, California. In 1953, as Vera, she hosted her own television series, Follow the Leader, a CBS audience participation show. In 1958, she appeared as Mabel, the boss of the flight attendants, in Jeannie Carson's syndicated version of her situation comedy Hey, Jeannie! The program aired only six episodes in syndication.\n\nAllen's first marriage was to actor Barton Yarborough. They had one child together. In 1946, the couple co-starred in the two-reel comedy short, Hiss and Yell, nominated for an Academy Award as Best Short Subject. In 1931-32, Allen married Charles H. Crosby. In 1943, she married Bob Hope's producer, Norman Morrell. They had one child and were married for three decades, until her 1974 death in Santa Barbara, California.",
        "birthday": "1906-09-02",
        "deathday": "1974-09-14",
        "gender": 1,
        "homepage": null,
        "id": 103448,
        "imdb_id": "nm0020289",
        "known_for_department": "Acting",
        "name": "Barbara Jo Allen",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.0985,
        "profile_path": "/b7px76Cylc7quiIGfwamo3JvMBN.jpg"
    }
}