{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cBwvbNr6o3qaETtNG3pUoV0jGIg.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 103747,
                "original_language": "en",
                "original_title": "The Angels' Share",
                "overview": "Narrowly avoiding jail, new dad Robbie vows to turn over a new leaf. A visit to a whisky distillery inspires him and his mates to seek a way out of their hopeless lives.",
                "popularity": 1.9905,
                "poster_path": "/bt9kJ8gwTMaDcmL0INlJYIZ887t.jpg",
                "release_date": "2012-06-01",
                "title": "The Angels' Share",
                "video": false,
                "vote_average": 6.951,
                "vote_count": 591,
                "character": "Sniper's Pal 2",
                "credit_id": "52fe4a25c3a36847f81bcc03",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "대니얼 포트먼"
        ],
        "biography": "Daniel Porter (born February 13, 1992), known professionally as Daniel Portman, is a Scottish actor. He is best known for playing the role of Podrick Payne in the television series Game of Thrones (2012–2019). He has since appeared as Stuart in the Black Mirror episode \"Loch Henry\" (2023).\n\nPortman is the son of actor Ron Donachie and Fiona Biggar, and has a sister Naomi. He was born in Glasgow and grew up in Strathbungo on the city's Southside. He attended Shawlands Academy, where he played rugby and was named Head Boy. He then pursued a Higher National Certificate (HNC) in Acting at Reid Kerr College in Paisley.\n\nPortman has been acting since he was 16 years old. His first role was in 2010's Outcast, in which he starred as Paul. This was followed by a role in popular Scottish soap opera River City. His second film role was a small part in Scottish comedy The Angels' Share. It was announced on 24 August 2011 that he was cast as Podrick Payne in the award-winning HBO fantasy drama series Game of Thrones. He portrayed this role from the second season to the final season. He contributed vocals to a version of the track \"Jenny's Song\" that featured in the episode \"A Knight of the Seven Kingdoms\".",
        "birthday": "1992-02-13",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1034702,
        "imdb_id": "nm4535552",
        "known_for_department": "Acting",
        "name": "Daniel Portman",
        "place_of_birth": "Glasgow, Scotland, UK",
        "popularity": 0.9397,
        "profile_path": "/g44oKPICmujej0fNhP60B0Ujz5l.jpg"
    }
}