{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5ApVROxPul7vu9NiB2DJWqlA3kE.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 690,
                "original_language": "fr",
                "original_title": "Pickpocket",
                "overview": "Michel takes up pickpocketing on a lark and is arrested soon after. His mother dies shortly after his release, and despite the objections of his only friend, Jacques, and his mother's neighbor Jeanne, Michel teams up with a couple of petty thieves in order to improve his craft. With a police inspector keeping an eye on him, Michel also tries to get a straight job, but the temptation to steal is hard to resist.",
                "popularity": 1.1863,
                "poster_path": "/kxpvceDv9fhFc4OAs82fmdzu17Y.jpg",
                "release_date": "1959-12-16",
                "title": "Pickpocket",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 535,
                "character": "Lead Inspector",
                "credit_id": "52fe426bc3a36847f801d107",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jean Pelegri"
        ],
        "biography": "Jean Pélégri (June 20, 1920 – September 24, 2003) was a writer and professor of literature. Of French descent, he was born in Algeria, but left as part of the diaspora of French colonists referred to as pied-noirs following the Algerian War.\n\nHe was friends with many Algerian writers (such as Mohammed Dib and Kateb Yacine) and, like Jean Sénac, Pélégri considered himself to be one of them; he always saw himself as an \"Algerian at heart\". He supplemented his novels' prefaces with artwork from his painter friends Baya, Abdallah Benanteur, Mohammed Khadda and Jean de Maisonseul. Pélégri also assisted on the film adaptation of his novel Les Oliviers de la justice as screenwriter, dialogue writer and actor. The movie won the Cinema and Television Writers Award at the 1962 Cannes Film Festival.",
        "birthday": "1920-06-20",
        "deathday": "2003-09-24",
        "gender": 2,
        "homepage": null,
        "id": 10357,
        "imdb_id": "nm0701798",
        "known_for_department": "Acting",
        "name": "Jean Pélégri",
        "place_of_birth": "Rovigo, French Algeria",
        "popularity": 0.3328,
        "profile_path": null
    }
}