{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gpyu3jQeMQeUFAVjCSrVCrYYK3f.jpg",
                "genre_ids": [
                    99
                ],
                "id": 23128,
                "original_language": "en",
                "original_title": "The Cove",
                "overview": "The Cove tells the amazing true story of how an elite team of individuals, films makers and free divers embarked on a covert mission to penetrate the hidden cove in Japan, shining light on a dark and deadly secret. The shocking discoveries were only the tip of the iceberg.",
                "popularity": 1.937,
                "poster_path": "/miodcVtQv2YxpKjjHJWcV0EDfSP.jpg",
                "release_date": "2009-07-31",
                "title": "The Cove",
                "video": false,
                "vote_average": 7.936,
                "vote_count": 628,
                "character": "Self",
                "credit_id": "52fe4460c3a368484e01f603",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "ایزابل لوکاس"
        ],
        "biography": "Isabel Lucas, born on 29th January 1985, is an Australian actress perhaps best known for her role as Tasha Andrews on the Australian television soap opera Home and Away (2003–2006). Lucas won a Logie Award (for new popular talent) for her performance on the program. Lucas was born in Melbourne, Victoria, Australia. As a child, Lucas lived in Cairns, Queensland. She also lived in Switzerland, Kakadu, and Northern Territory. She has a Swiss mother and an Australian father and speaks German and French in addition to her native English. Lucas went to St. Monica's College in Cairns, Queensland, Australia. She moved to Los Angeles in early 2008 and has since been featured in film and television projects including Transformers: Revenge of the Fallen, The Pacific and Daybreakers. Lucas is a vegetarian. Lucas was nominated as one of Australia’s Sexiest Vegetarian Celebrities on PETA AsiaPacific.com for 2010.  Lucas enrolled in the Victorian College of Arts but had never pursued commercial roles until she was spotted at the Port Douglas market by Sharron Meissner, a Sydney theatrical agent. She auditioned for the role of Kit Hunter in Home and Away although the producer of the show, Julie McGauran, felt that role was not right for Isabel, she was sufficiently impressed to have a new character, Tasha Andrews, created for her. Playing Tasha Andrews on Home and Away was Lucas' first television role. She appeared in an American television commercial for Crest toothpaste. Lucas has been cast as Gwen in the Steven Spielberg World War II miniseries, The Pacific. She appeared in Transformers: Revenge of the Fallen as Alice. Reports suggested that although assigned to the William Morris Talent Agency in Los Angeles through the auspices of Meissner Management, Lucas obtained the role of Alice in her native Australia before moving permanently to America. It has been claimed that Lucas was handpicked by Steven Spielberg.",
        "birthday": "1985-01-29",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 103554,
        "imdb_id": "nm1456970",
        "known_for_department": "Acting",
        "name": "Isabel Lucas",
        "place_of_birth": "Melbourne, Australia",
        "popularity": 0.7817,
        "profile_path": "/dxIZvymamZaeJ46HDJ0ldaJmG2v.jpg"
    }
}