{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9wLetxZRpBtq3kyaNwBhWPAapUe.jpg",
                "genre_ids": [
                    18,
                    36,
                    10752
                ],
                "id": 10110,
                "original_language": "en",
                "original_title": "Empire of the Sun",
                "overview": "Jamie Graham, a privileged English boy, is living in Shanghai when the Japanese invade and force all foreigners into prison camps. Jamie is captured with an American sailor, who looks out for him while they are in the camp together. Even though he is separated from his parents and in a hostile environment, Jamie maintains his dignity and youthful spirit, providing a beacon of hope for the others held captive with him.",
                "popularity": 3.1973,
                "poster_path": "/gEaCzjwHoPgyQFcwHql7o5YLHAU.jpg",
                "release_date": "1987-12-09",
                "title": "Empire of the Sun",
                "video": false,
                "vote_average": 7.508,
                "vote_count": 2022,
                "character": "British Prisoner",
                "credit_id": "631765c45507e90082b379fc",
                "order": 25
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Eric Flynn was born on 13 December 1939 on Hainan Island, China, where his father was a customs officer for the Hong Kong government. After the outbreak of war and the Japanese invasion of China, his family spent several years interned in a Japanese prisoner of war camp (50 years later he would play a British prisoner in the film Empire of the Sun, set in a Japanese prison of war camp in China).\n\nHe returned to Britain at the age of 13, and was educated at Chatham House School in Ramsgate. He then gained a scholarship to Royal Academy of Dramatic Art (RADA), where he met his first wife Fern.\n\nFlynn's sons by his first marriage, Daniel and Jerome, are both actors. He also had a daughter, Kerry, by his first marriage. Flynn married his second wife Caroline, a South African, in 1981. His daughter from his second marriage, Lillie Flynn, finished a three-year acting degree at The Central School of Speech and Drama in 2007 and his son, Johnny, is also an actor and singer",
        "birthday": "1939-12-13",
        "deathday": "2002-03-04",
        "gender": 2,
        "homepage": null,
        "id": 1036403,
        "imdb_id": "nm0283446",
        "known_for_department": "Acting",
        "name": "Eric Flynn",
        "place_of_birth": "Hainan Island, China",
        "popularity": 0.1734,
        "profile_path": "/nd8iZxTBNZjTKX55dKGSSjN2JTe.jpg"
    }
}