{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dm1bqDSw3MJTjYCeuNUv122BXFp.jpg",
                "genre_ids": [
                    53,
                    28,
                    80
                ],
                "id": 17814,
                "original_language": "en",
                "original_title": "Assault on Precinct 13",
                "overview": "A highway patrol officer, two criminals, and a station secretary form an unlikely alliance to defend a defunct Los Angeles precinct against a siege by a bloodthirsty street gang.",
                "popularity": 5.2402,
                "poster_path": "/RtGDEmXbSxE8NThCCY1SXFXLLw.jpg",
                "release_date": "1976-10-08",
                "title": "Assault on Precinct 13",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1133,
                "character": "Ethan Bishop",
                "credit_id": "52fe474a9251416c75094201",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "​From Wikipedia, the free encyclopedia.\n\nAustin Stoker (October 7, 1930 – October 7, 2022) was a Trinidadian-American actor known for his role as Lt. Ethan Bishop, the police officer in charge of the besieged Precinct 9, Division 13, in John Carpenter's Howard Hawks-inspired 1976 film, Assault on Precinct 13. This was one of the few heroic starring roles for a black actor in an action film of the 1970s outside of the blaxploitation genre.\n\nStoker was born in Port of Spain, Trinidad and Tobago on October 7, 1930. He started his career on stage, including the 1954 Broadway production of Truman Capote's House of Flowers, where he met his future wife, Enid Mosier (acting name Vivian Bonnell). Prior to his role as Lt. Bishop, Stoker appeared in several blaxploitation films, often playing police detectives. Among these films were Abby (1974), Combat Cops (1974), and Sheba, Baby (1975), in which he played Pam Grier's love interest. Some of Stoker's other notable acting roles were in Battle for the Planet of the Apes (1973), Horror High (1974), Airport 1975 (1974), Victory at Entebbe (1976), and the 1977 television mini-series Roots.\n\nStoker is known to Mystery Science Theater 3000 fans for his role as Dr. Ken Melrose in the 1982 B-movie, Time Walker, in which he appeared with Darwin Joston, his co-star from Assault on Precinct 13.\n\nStoker died of renal failure at the Cedars-Sinai Medical Center in Los Angeles, California on October 7, 2022, his 92nd birthday.\n\nDescription above from the Wikipedia article Austin Stoker, licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": "1943-10-07",
        "deathday": "2022-10-07",
        "gender": 2,
        "homepage": null,
        "id": 103707,
        "imdb_id": "nm0831288",
        "known_for_department": "Acting",
        "name": "Austin Stoker",
        "place_of_birth": "Trinidad, West Indies",
        "popularity": 0.5592,
        "profile_path": "/l79ljSqio7NWR9t5MwyVzGtwqBn.jpg"
    }
}