{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sv8nSUSXb7ldLOg4dm6KDIDdSEU.jpg",
                "genre_ids": [
                    35,
                    36
                ],
                "id": 14257,
                "original_language": "fr",
                "original_title": "La Folie des grandeurs",
                "overview": "Don Sallust is the minister of the King of Spain. Being disingenuous, hypocritical, greedy and collecting the taxes for himself, he is hated by the people he oppresses. Accused by The Queen, a beautiful princess Bavarian, of having an illegitimate child to one of her maids of honor, he was stripped of his duties and ordered to retire to a monastery.",
                "popularity": 1.9281,
                "poster_path": "/uJtEs9WRqyEREvdkS470n593z03.jpg",
                "release_date": "1971-12-08",
                "title": "Delusions of Grandeur",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 714,
                "character": "Innkeeper (uncredited)",
                "credit_id": "5f1578fadb952d00376172b9",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Antonio Iranzo Escorihuela"
        ],
        "biography": "Antonio Iranzo (4 May 1930 – 7 July 2003) was a Spanish film actor in 77 feature films. He gained popularity for his acting in Island of the Damned and Cut - Throats Nine.\n\nIranzo began his artistic career in the theater, while working as a radio announcer. Later he joined the Nuria Espert Company and made his film debut in 1963 with La chica del auto-stop directed by Miguel Lluch.\n\nHis physique and hoarse voice helped him get the chance to play the supporting character in various films including Mario Camus's The Legend of Mayor of Zalamea (1973), Gonzalo Suárez's The Regent (1974), Narciso Ibáñez Serrador's Who Can Kill a Child? (1975), Hidden Pleasures (1977), The tobacconist of Vallecas (1986) (the latter two by Eloy de la Iglesia), the TV miniseries Riders of the Dawn (1990) and Vicente Aranda's Libertarias (1996).\n\nIranzo had a well known career on stage, which particularly excelled in his interpretations of classics from the Golden Age. Some of the works featuring him were Adolfo Marsillach and Molière's Tartuffe (1969), Felix Lope de Vega's The Star of Seville (1958), Max Frisch's Andorra (1971), Adolfo Marsillach's Flower of Holiness (1973), Arnold Wesker and Irene Gutiérrez Caba's Chicken Soup with Oats (1978), Martín Recuerda's The Arrecogías the Beguinage of St. Mary of Egypt (1977), José María Rodríguez Méndez's Weddings that were famous in the Rag and Fandanga (1978), Miguel de Cervantes's The Baths of Algiers (1979) and The Roll Lavapies (1979), Woody Allen's Aspirin for Two (1980), Santiago Moncada's Ears of the Wolf (1980), Martin Recuerda's The Deceiting (1981), Miguel Mihura's Peach in Syrup (1982), Ibsen's Mallard (1982), Euripides's Fedra (1984), Shakespeare's Julius Caesar (1988), Alejandro Casona's The Third Word (1992).\n\nIranzo also had a prolific career in television; he played several characters in dramas TVE as Study 1 or Novel, Time Eleven or Fictions.\n\nHis deep voice helped him in standing out as a voice actor, remembered for being among other characters as BA Baracus in the television series El equipo A.\n\nHe was the winner of the 1966's Silver Frames Award for Best Actor of Spanish cinema for the film Burnt Skin (La piel quemada). The film was directed by Josep Maria Forn and depicted the social problems of Spain during the decade. In the film Iranzo played the character of an Andalusian worker named Jose who works in Costa Brava and falls in love with a Belgian tourist while his family including wife and two children struggle to reach him.\n\nIn 2014 the film Who can Kill a Child? was shown at Denver Film Society's Stanley Film Festival.\n\nSource: Article \"Antonio Iranzo\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1930-05-04",
        "deathday": "2003-07-07",
        "gender": 2,
        "homepage": null,
        "id": 103987,
        "imdb_id": "nm0014763",
        "known_for_department": "Acting",
        "name": "Antonio Iranzo",
        "place_of_birth": "València, Comunitat Valenciana, Spain",
        "popularity": 0.6993,
        "profile_path": "/xIk5MvmEvvoYEOtmI4Fi9ym8Skn.jpg"
    }
}