{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mRVzzlXswVmXWqCPni9JIla5fmj.jpg",
                "genre_ids": [
                    18
                ],
                "id": 3116,
                "original_language": "en",
                "original_title": "Midnight Cowboy",
                "overview": "Joe Buck is a wide-eyed hustler from Texas hoping to score big with wealthy New York City women; he finds a companion in Enrico \"Ratso\" Rizzo, an ailing swindler with a bum leg and a quixotic fantasy of escaping to Florida.",
                "popularity": 4.8818,
                "poster_path": "/f7YLzOxwWzeEdo7RhAlPSBTYa8.jpg",
                "release_date": "1969-05-25",
                "title": "Midnight Cowboy",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 1512,
                "character": "Party Guest (uncredited)",
                "credit_id": "595aa1f3c3a368253c03cca1",
                "order": 51
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Pat Ast was an American actress and model. She was best known for starring in Andy Warhol films and being a Halston model and muse in the 1970s.  Ast enjoyed partying in her twenties on Fire Island, and her boisterous personality allowed her to meet and befriend influential people. She had aspirations to become an actress, singer and model despite her day job as a receptionist at a box factory. She made her screen debut after meeting director John Schlesinger on Fire Island, who cast her as a party guest in his film Midnight Cowboy (1969). Around that time, she caught the attention of fashion designer Halston, who gave her a job at his boutique and made her one of his models, despite her weighing 210 pounds, in a time when most models were extremely thin. In the early 1970s, with Pat Cleveland, Connie Cook, Alva Chinn, Anjelica Huston, Karen Bjornson, among others, Ast became one of Halston's favored troupe of models, nicknamed the Halstonettes. She also appeared in runway shows for Halston and Yves St. Laurent, closing the 1972 Coty Awards runway show for Halston by popping out of a giant cake. She later became associated with Andy Warhol, who gave her the role of landlady Lydia in his film Heat (1972) alongside Joe Dallesandro.\n\nIn 1975, Ast moved to Hollywood to pursue her acting career. She has appeared in films such as The Duchess and the Dirtwater Fox (1976), Foul Play (1978), The Incredible Shrinking Woman (1981), and Reform School Girls (1986).\n\nShe became resentful of Los Angeles as her film career stalled. She went to New York to do Nine, a Broadway musical based on Federico Fellini’s movie 8 1/2, but was dismissed after three months.",
        "birthday": "1941-10-21",
        "deathday": "2001-10-03",
        "gender": 1,
        "homepage": null,
        "id": 103962,
        "imdb_id": "nm0039924",
        "known_for_department": "Acting",
        "name": "Pat Ast",
        "place_of_birth": "Brooklyn, New York, USA",
        "popularity": 0.1288,
        "profile_path": "/nhZtS5APpcGYfMJrThbSCWGGTA8.jpg"
    }
}