{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5OFg2grrAMPo8OOKHQMCeuKU3js.jpg",
                "genre_ids": [
                    35,
                    10402
                ],
                "id": 11031,
                "original_language": "en",
                "original_title": "This Is Spinal Tap",
                "overview": "\"This Is Spinal Tap\" shines a light on the self-contained universe of a metal band struggling to get back on the charts, including everything from its complicated history of ups and downs, gold albums, name changes and undersold concert dates, along with the full host of requisite groupies, promoters, hangers-on and historians, sessions, release events and those special behind-the-scenes moments that keep it all real.",
                "popularity": 4.1471,
                "poster_path": "/z2LA8eBTSuuPC4NBhIZRNIwpimH.jpg",
                "release_date": "1984-03-02",
                "title": "This Is Spinal Tap",
                "video": false,
                "vote_average": 7.415,
                "vote_count": 1516,
                "character": "Ian Faith",
                "credit_id": "58134d159251414f9b023a2b",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Tony Hendra (10 July 1941 – 4 March 2021) was an English satirist, actor and writer who worked mostly in the United States. Educated at St Albans School (where he was a classmate of Stephen Hawking) and at St John's College, Cambridge, he was a member of the Cambridge University Footlights revue in 1962, alongside John Cleese, Graham Chapman and Tim Brooke-Taylor.\n\nHendra was probably best known for being the head writer and co-producer in 1984 of the first six shows of the long-running British satirical television series Spitting Image, and for starring in the film This Is Spinal Tap as the band's manager Ian Faith.\n\nHendra died on 4 March 2021 of amyotrophic lateral sclerosis.\n\nFrom Wikipedia, the free encyclopedia.",
        "birthday": "1941-07-10",
        "deathday": "2021-03-04",
        "gender": 2,
        "homepage": null,
        "id": 1040043,
        "imdb_id": "nm0376676",
        "known_for_department": "Acting",
        "name": "Tony Hendra",
        "place_of_birth": "Hertfordshire, England, UK",
        "popularity": 0.0885,
        "profile_path": "/clFWUwXg6cyvZndvJwJVptUTusJ.jpg"
    }
}