{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mmd1HnuvAzFc4iuVJcnBrhDNEKr.jpg",
                "genre_ids": [
                    27,
                    53
                ],
                "id": 694,
                "original_language": "en",
                "original_title": "The Shining",
                "overview": "Jack Torrance accepts a caretaker job at the Overlook Hotel, where he, along with his wife Wendy and their son Danny, must live isolated from the rest of the world for the winter. But they aren't prepared for the madness that lurks within.",
                "popularity": 9.1204,
                "poster_path": "/xazWoLealQwEgqZ89MLZklLZD3k.jpg",
                "release_date": "1980-05-23",
                "title": "The Shining",
                "video": false,
                "vote_average": 8.209,
                "vote_count": 18178,
                "character": "Wendy Torrance",
                "credit_id": "52fe426bc3a36847f801d403",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/8n9dYsTbXTykzm2Nuy7R2ftapXQ.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749
                ],
                "id": 703,
                "original_language": "en",
                "original_title": "Annie Hall",
                "overview": "New York comedian Alvy Singer falls in love with the ditsy Annie Hall.",
                "popularity": 4.3937,
                "poster_path": "/dEtjPywhDbAXYjoFfhBC4U9unU7.jpg",
                "release_date": "1977-04-19",
                "title": "Annie Hall",
                "video": false,
                "vote_average": 7.736,
                "vote_count": 4045,
                "character": "Pam",
                "credit_id": "52fe426dc3a36847f801dbf3",
                "order": 5
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/yfTZ2MSRWc06cBrFOsAF4Lebi4.jpg",
                "genre_ids": [
                    16,
                    35,
                    10751
                ],
                "id": 62214,
                "original_language": "en",
                "original_title": "Frankenweenie",
                "overview": "When a car hits young Victor's pet dog Sparky, Victor decides to bring him back to life the only way he knows how. But when the bolt-necked \"monster\" wreaks havoc and terror in the hearts of Victor's neighbors, he has to convince them that Sparky's still the good, loyal friend he was.",
                "popularity": 6.5974,
                "poster_path": "/yGjVbLVdZRBlZTTQVBsj2KUjL1s.jpg",
                "release_date": "2012-10-04",
                "title": "Frankenweenie",
                "video": false,
                "vote_average": 7.001,
                "vote_count": 3464,
                "credit_id": "58b5ce34c3a368530c0002fd",
                "department": "Crew",
                "job": "Thanks"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "The Texas Twiggy",
            "Manic Mouse",
            "Shelley Alexis Duvall"
        ],
        "biography": "Shelley Alexis Duvall was an American actress known for her portrayal of distinctive, often eccentric characters. She was the recipient of several accolades, including a Cannes Film Festival Award and a Peabody Award and nominations for a British Academy Film Award and two Primetime Emmy Awards.\n\nBorn in Texas, Duvall began acting after being discovered by director Robert Altman, who was impressed with her upbeat presence and cast her in the black comedy film Brewster McCloud (1970). Despite her hesitance towards becoming an actress, she continued to work with Altman, appearing in McCabe & Mrs. Miller (1971) and Thieves Like Us (1974). Her breakthrough came with Altman's cult film Nashville (1975), and she earned widespread acclaim with the drama 3 Women (1977), also directed by Altman, for which she won the Cannes Film Festival Award for Best Actress and earned a nomination for the British Academy Film Award for Best Actress in a Leading Role. That same year, she appeared in a supporting role (as a writer for Rolling Stone) in Woody Allen's satirical romantic comedy Annie Hall (1977) and hosted Saturday Night Live.\n\nIn the 1980s, Duvall became famous for her leading roles, which include Olive Oyl in Altman's live-action feature version of Popeye (1980) and Wendy Torrance in Stanley Kubrick's horror film The Shining (1980). She appeared in Terry Gilliam's fantasy film Time Bandits (1981), the short comedy horror film Frankenweenie (1984), and the comedy Roxanne (1987). She ventured into producing television programming aimed at children and youth in the latter half of the 1980s, notably creating and hosting the programs Faerie Tale Theatre (1982–1987), Tall Tales & Legends (1985–1987) (which earned her a Primetime Emmy Award nomination in 1988), and Nightmare Classics (1989).\n\nDuvall sporadically worked in acting throughout the 1990s, notably playing supporting roles in Steven Soderbergh's thriller The Underneath (1995) and the Henry James adaptation The Portrait of a Lady (1996), directed by Jane Campion. Her last performance was in Manna from Heaven (2002), after which she retired from acting. Duvall for many years kept out of the public media, keeping her personal life generally private; however, her health issues earned significant media coverage. After a 21-year hiatus from acting, Duvall returned to acting in the horror film The Forest Hills.",
        "birthday": "1949-07-07",
        "deathday": "2024-07-11",
        "gender": 1,
        "homepage": "http://faerietaletheatre.com",
        "id": 10409,
        "imdb_id": "nm0001167",
        "known_for_department": "Acting",
        "name": "Shelley Duvall",
        "place_of_birth": "Fort Worth, Texas, USA",
        "popularity": 0.7005,
        "profile_path": "/zwscEWl7QLiOsfsvzGXFjAQCVp3.jpg"
    }
}