{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9Ebn8atCcGk5OZrx4xmoTobAxoh.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 1581,
                "original_language": "en",
                "original_title": "The Holiday",
                "overview": "Two women, one American and one British, swap homes at Christmastime following bad breakups. Each woman finds romance with a local man but realizes that the imminent return home may end the relationship.",
                "popularity": 7.1835,
                "poster_path": "/h1ITOpvJN3Tw4Sy60w2QTfYMvdd.jpg",
                "release_date": "2006-12-05",
                "title": "The Holiday",
                "video": false,
                "vote_average": 7.091,
                "vote_count": 5347,
                "character": "Norman",
                "credit_id": "52fe4301c3a36847f8033281",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Sheldon Leonard Berman",
            "شلی برمن"
        ],
        "biography": "Shelley Berman (February 3, 1925 – September 1, 2017) was an American comedian, actor, writer, teacher, lecturer, and poet. Berman gained fame for his distinct style of comedic storytelling, often performing monologues that delved into relatable yet humorous observations about everyday life. His use of personal anecdotes and dry wit set a trend in stand-up comedy, influencing many comedians who followed.\n\nHe released several successful comedy albums, including \"Inside Shelley Berman\" (1959), which became the first comedy album to earn a gold record. His achievements also extended to television and film, with notable appearances in various shows and movies. Berman's impact on the comedy landscape, marked by his intelligent humour and storytelling abilities, solidified his legacy as a trailblazer in the world of stand-up comedy. He passed away in 2017, leaving behind a lasting imprint on the entertainment industry.",
        "birthday": "1925-02-03",
        "deathday": "2017-09-01",
        "gender": 2,
        "homepage": null,
        "id": 10403,
        "imdb_id": "nm0066098",
        "known_for_department": "Acting",
        "name": "Shelley Berman",
        "place_of_birth": "Chicago, Illinois, USA",
        "popularity": 0.2104,
        "profile_path": "/2BSAgiQ1vuD7I04mteW0BGw89ro.jpg"
    }
}