{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/A99WMiz0ASpH9coOFrxSEuwTWx0.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 840430,
                "original_language": "en",
                "original_title": "The Holdovers",
                "overview": "A curmudgeonly instructor at a New England prep school is forced to remain on campus during Christmas break to babysit the handful of students with nowhere to go. Eventually, he forms an unlikely bond with one of them — a damaged, brainy troublemaker — and with the school’s head cook, who has just lost a son in Vietnam.",
                "popularity": 3.7125,
                "poster_path": "/VHSzNBTwxV8vh7wylo7O9CLdac.jpg",
                "release_date": "2023-10-27",
                "title": "The Holdovers",
                "video": false,
                "vote_average": 7.666,
                "vote_count": 2128,
                "character": "Miss Crane's Boyfriend",
                "credit_id": "6503f542e0ca7f010deb9734",
                "order": 40
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "As a self described movie addict, Ian Lyons knew he had to work in showbiz. After a stint behind the scenes as a production assistant on several TV shows (\"Scrubs,\" \"Party Of Five,\" \"All That,\" \"The Amanda Show,\" \"Sabrina The Teenage Witch\"...), Ian soon realized (cause those hours sucked) that he was better suited for the other side of the camera.\n\nWith his priority always on love and life, Ian savors those moments between jobs with his lovely wife of over 27 years, his two amazing sons, and of course his 2 dogs and 2 cats. He's the luckiest dude in the world.\n\nAfter two open-heart surgeries, Ian's refurbished ticker is as passionate as ever and raring to go. He credits his most cherished on-set experiences to acting opposite David Hyde Pierce (as his twin) and Sarah Lancashire (as her bother-in-law) in HBO's sadly short-lived \"Julia,\" and to his exhilarating confrontation opposite Robert Downey Jr. in \"The Judge.\" He looks forward to the cherished on-set moments to come.\n\nKeep an eye out for Ian in these exciting upcoming projects - \"Shattered Ice,\" \"Imposters\" and \"TOX.\"",
        "birthday": "1972-09-11",
        "deathday": null,
        "gender": 2,
        "homepage": "https://resumes.actorsaccess.com/ianlyons",
        "id": 1040956,
        "imdb_id": "nm1796676",
        "known_for_department": "Acting",
        "name": "Ian Lyons",
        "place_of_birth": null,
        "popularity": 0.0631,
        "profile_path": "/pmX1Bqi2xCFvZGXBatkAjlIH8S5.jpg"
    }
}