{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/d5HjGve67GkNC9lWpzZVKSotLlT.jpg",
                "genre_ids": [
                    18,
                    9648
                ],
                "id": 1939,
                "original_language": "en",
                "original_title": "Laura",
                "overview": "A police detective falls in love with the woman whose murder he's investigating.",
                "popularity": 1.8758,
                "poster_path": "/j0zEiFFrdbZnMXqD3piOtZBJeNB.jpg",
                "release_date": "1944-11-26",
                "title": "Laura",
                "video": false,
                "vote_average": 7.634,
                "vote_count": 853,
                "character": "Woman (uncredited)",
                "credit_id": "56da3a4bc3a3680c93000795",
                "order": 33
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Aileen Bisbee"
        ],
        "biography": "Aileen Pringle's favorite film was a mid-1920s silent based on a book by Elinor Glyn: Three Weeks (1924), sort of a \"Lady Chatterly's Lover\". She recalled in a 1980 telephone conversation: \"The film was in good taste; some people thought the book was trashy\". Anita Loos wrote in \"A Girl Like I\", the first volume of her autobiography, vaudeville comic Joe Frisco telling Glynn: \"Leave me get this straight. You want to find some tramp that don't look like a tramp, to play that English tramp in your picture. But take it from me, that kind of tramp don't hang out in Hollywood\". Aileen had spent her 20s married to Charles McKenzie Pringle, the son of Sir John Pringle, a Jamaica landowner and a member of the Privy and Legislative Councils of Jamaica. Aileen lived in Jamaica until she went on stage with George Arliss. When she began divorce proceedings against Pringle in 1926, Hollywood gossip columnists speculated she would marry H.L. Mencken. She did not remarry until 1944 when she became the bride of James M. Cain, author of \"The Postman Always Rings Twice\". I opened my 1980 telephone conversation with Aileen by mentioning that the day before I had been reading her correspondence with Mencken at the New York Public Library. \"But all the letters were destroyed\", she said. I knew that Mencken had asked for all of his letters to her back at the time he became engaged to Sara Haardt. Aileen was the only woman who received such a request from Mencken at that time. \"It was your letters from the late '30s and '40s I was reading\", I told Aileen. \"In one of them Mencken was urging you to write a book. Did you ever finish it?\" \"No. I got married instead.\" In a 1946 letter she wrote to Mencken. \"If I had remained married to that psychotic Cain, I would be wearing a straitjacket instead of the New Look.\"\n\nDate of Death 16 December 1989, New York City, New York",
        "birthday": "1895-07-23",
        "deathday": "1989-12-16",
        "gender": 1,
        "homepage": null,
        "id": 1041608,
        "imdb_id": "nm0697800",
        "known_for_department": "Acting",
        "name": "Aileen Pringle",
        "place_of_birth": "San Francisco, California, USA",
        "popularity": 2.5167,
        "profile_path": "/hTEtDoW8jRsM7ZXvD0fw2XhJTzp.jpg"
    }
}