{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lghWedsBBl3lPlIs4EpZpP64mUT.jpg",
                "genre_ids": [
                    18,
                    35,
                    10749
                ],
                "id": 603661,
                "original_language": "en",
                "original_title": "The Hating Game",
                "overview": "Resolving to achieve professional success without compromising her ethics, Lucy embarks on a ruthless game of one-upmanship against cold and efficient nemesis Joshua, a rivalry that is complicated by her growing attraction to him.",
                "popularity": 5.405,
                "poster_path": "/prbZxJxGcy07y60eq8lCGMciTYz.jpg",
                "release_date": "2021-12-09",
                "title": "The Hating Game",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1133,
                "character": "Anthony Templeman",
                "credit_id": "62e0201a481382004cbd8dae",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/5tb7RjF0OAAaiGDUXsuedvhoGqV.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 837881,
                "original_language": "en",
                "original_title": "She Said",
                "overview": "New York Times reporters Megan Twohey and Jodi Kantor break one of the most important stories in a generation — a story that helped launch the #MeToo movement and shattered decades of silence around the subject of sexual assault in Hollywood.",
                "popularity": 4.0153,
                "poster_path": "/jG4UI2dbNWlWtTTupjeU3fRJ5Fn.jpg",
                "release_date": "2022-11-17",
                "title": "She Said",
                "video": false,
                "vote_average": 7.224,
                "vote_count": 655,
                "character": "Lance Maerov",
                "credit_id": "63974892d05a030085cbb774",
                "order": 58
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Sean J. Cullen "
        ],
        "biography": "Sean Cullen was awarded the 2024 Katherine Cornell Award for his portrayal of Joe Keller in \"All My Sons,\" at Buffalo's Road Less Traveled Theater. He's appearing now in the streaming series \"The Green Veil,\" starring John Leguizamo; and later this year will play Mac Shepard in \"The Reunion,\" a new feature written and directed by Roland Ellis. Sean's previous credits include Maria Schrader's \"She Said\" (Universal), with Zoe Kazan and Carey Mulligan; and \"The Hating Game,\" adapted from the best-selling novel and directed by Peter Hutchings. Sean has appeared in Tony Gilroy's Oscar-nominated \"Michael Clayton,\" starring George Clooney; and Lincoln Center's Tony-Award-Winning \"Rogers & Hammerstein's South Pacific,\" directed by Bart Sher and starring Kelli O'Hara. Sean's other film work includes \"Revolutionary Road,\" directed by Sam Mendes and starring Kate Winslet and Leonardo DiCaprio; \"He Does Not Want Peace,\" starring David Strathairn and Lindsay Duncan; \"Simone,\" his first project with Al Pacino; \"Cop Out,\" directed by Kevin Smith and starring Bruce Willis and Tracey Morgan; \"Rushed,\" starring Siobhan Fallon Hogan; \"Unintended,\" starring Elizabeth Lail, directed by Anja Murmann; and Universal's \"DeLorean,\" starring Alec Baldwin. Sean's TV credits include the recurring role of FBI Director William Webster in David Fincher's \"Mindhunter\" (Netflix); and guest-starring appearances in \"I Know This Much Is True,\" adapted and directed by Derek Cianfrance (HBO); Barry Levinson's \"Paterno\" (HBO), his second project with Al Pacino; \"Bull\" (CBS); \"The Blacklist\" (NBC); and a recurring role on \"Suits\" (USA). He also appeared as \"Franz\" in \"NBC's The Sound of Music Live,\" starring Carrie Underwood. Sean's Broadway credits also include Clifford Odet's \"Golden Boy,\" starring Yvonne Strahovski and Tony Shaloub; \"James Joyce's The Dead,\" starring Christopher Walken; and the National Theatre of Great Britain's production of \"Coram Boy.\" He has also appeared at more than twenty of America's leading regional theater's, including the Kennedy Center, Williamstown Theatre Festival, San Francisco's A.C.T., the Ahmanson Theatre, Seattle Rep, the Alley Theatre, Huntington Theatre, Westport Country Playhouse and the Berkshire Theatre Festival. Sean was awarded a Portland (Oregon) \"Drammy\" for his work in Martin McDonagh's \"The Pillowman\"; he shared in the San Francisco Chronicle's \"Best Ensemble Award,\" playing \"Gabriel Conroy\" in Richard Nelson's \"James Joyce's The Dead\"; and he was recognized with a Pittsburgh Post-Gazette Award for playing Tom in \"The Glass Menagerie.\" in 2020, Sean returned to his hometown of Buffalo, New York, where Road Less Traveled Productions recognized him as that theatre's \"American Theater Master.\" In 2011, Bishop TImon-St. Jude High School honored him with its first \"Timon Center for Media & the Arts Distinguished Alumnus Award.\" Sean is also a graduate of St. Bonaventure University and the Yale School of Drama.",
        "birthday": "1960-05-09",
        "deathday": null,
        "gender": 2,
        "homepage": "https://resumes.actorsaccess.com/Sean_Cullen",
        "id": 104196,
        "imdb_id": "nm1332395",
        "known_for_department": "Acting",
        "name": "Sean Cullen",
        "place_of_birth": "Buffalo, New York, USA",
        "popularity": 0.1399,
        "profile_path": "/1zE3CeOpps8mhUu12HnSyzxT8Vc.jpg"
    }
}