{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/vHwrJiFc74Lb8D0Trvdc0v04gRK.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 22954,
                "original_language": "en",
                "original_title": "Invictus",
                "overview": "Newly elected President Nelson Mandela knows his nation remains racially and economically divided in the wake of apartheid. Believing he can bring his people together through the universal language of sport, Mandela rallies South Africa's rugby union team as they make their historic run to the 1995 Rugby World Cup Championship match.",
                "popularity": 4.0993,
                "poster_path": "/runuhBAAX7PmdjGhqRKCyl4bh7z.jpg",
                "release_date": "2009-12-11",
                "title": "Invictus",
                "video": false,
                "vote_average": 7.182,
                "vote_count": 4223,
                "character": "New Zealand All Blacks",
                "credit_id": "61bf6849d14443004147156b",
                "order": 98
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Bjorn Jorg Walter Steinbach"
        ],
        "biography": "Bjorn Jorg Walter Steinbach hails from Port Elizabeth, South Africa. He graduated from Grey High School in 2002 and then in 2003 attended school at the University of Cape Town to study psychology. In 2005, he was on Fear Factor: South Africa. He left UCT and enrolled in City Varsity in 2006 to pursue acting. He also enrolled in the summer program at the Esper Studio in New York in 2008. His first project was a short film called Small Killing (2008) that was filmed and aired in South Africa. Bjorn got his first U.S. break on a project called Generation Kill (2008), an HBO original 7 part mini-series about the 1st Recon Marine Battallion that was sent in during the first phase of the war in Iraq. He portrayed Cpl. Michael Stinetorf in all 7 episodes. Since then he has worked on the made for TV movie, Natalie Holloway (2009) which aired on USA, and The Philanthropist (2009) which aired on NBC.",
        "birthday": "1985-10-20",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1042812,
        "imdb_id": "nm2656882",
        "known_for_department": "Acting",
        "name": "Bjorn Steinbach",
        "place_of_birth": "Port Elizabeth, South Africa",
        "popularity": 0.0743,
        "profile_path": "/8sxtyb2zQqtyRxdZa0WluD6jyj0.jpg"
    }
}