{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/pgtHrfRnVpOWbiGYFVoHM3E9rN.jpg",
                "genre_ids": [
                    35
                ],
                "id": 11686,
                "original_language": "en",
                "original_title": "Love and Death",
                "overview": "In czarist Russia, a neurotic soldier and his distant cousin formulate a plot to assassinate Napoleon.",
                "popularity": 2.3679,
                "poster_path": "/oJXFd1UHZoOQ1UtoLxbyBLGJDox.jpg",
                "release_date": "1975-06-10",
                "title": "Love and Death",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 927,
                "character": "Drill Sergeant",
                "credit_id": "52fe44799251416c75035f91",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/42mSR48e4h6Zp5BkTUyWPYsAA1X.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 1883,
                "original_language": "en",
                "original_title": "Malcolm X",
                "overview": "A tribute to the controversial black activist and leader of the struggle for black liberation. He hit bottom during his imprisonment in the '50s, he became a Black Muslim and then a leader in the Nation of Islam. His assassination in 1965 left a legacy of self-determination and racial pride.",
                "popularity": 7.04,
                "poster_path": "/o2s9ow0uRRm1BcF3teznk5twd90.jpg",
                "release_date": "1992-11-18",
                "title": "Malcolm X",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 1773,
                "character": "Chuck",
                "credit_id": "61f3236ae9da6900c4240eef",
                "order": 34
            },
            {
                "adult": false,
                "backdrop_path": "/6aoyUbvu0419XLKLIMoH0TkEicH.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 103,
                "original_language": "en",
                "original_title": "Taxi Driver",
                "overview": "Suffering from insomnia, disturbed loner Travis Bickle takes a job as a New York City cabbie, haunting the streets nightly, growing increasingly detached from reality as he dreams of cleaning up the filthy city.",
                "popularity": 11.9039,
                "poster_path": "/ekstpH614fwDX8DUln1a2Opz0N8.jpg",
                "release_date": "1976-02-09",
                "title": "Taxi Driver",
                "video": false,
                "vote_average": 8.135,
                "vote_count": 12865,
                "character": "Angry Black Man",
                "credit_id": "633d3193ecc7e800822a1a24",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Robinson Frank Adu"
        ],
        "biography": "Frank Edward Robinson was born on April 25, 1937 to the late Adkin and Mary Robinson in White Plains, New York. Frank was a resident of The Bronx, New York for nearly seventy-five years. He was educated in New York City public schools in the Bronx and Manhattan and later studied acting at the American Community Theater under the direction of the late Maxwell Glanville. He was united in marriage to Claretha Fleming on November 27, 1965. In this union they raised three children. Frank completed one tour of service in the United States Marine Corps beginning in 1956. Later, while raising his family and pursuing an acting career, he gained employment with the United Postal Service where he remained until his retirement in 2001. His true passion was for the arts as a vehicle for cultural and political awareness. This led him to join a group of artists with similar interests and worldview to help found the African Jazz Arts Society and Studios (AJASS), a progenitor of the Black Arts and \"Black is Beautiful\" movements, out of which grew the renowned Grandassa Models and the \"Naturally\" show. In addition to being one of two male \"Naturally\" models, Frank served as the Director of the AJASS Repertory Theater, staging and appearing in Caste Life Revue and Portrait of Patrice Lumumba. Forever connected to his AJASS family, Frank extended his reach as he pursued a career as a professional actor, devoting his time talent and energy to theater as a performer, teacher and mentor. Performing in venues at home and abroad (Switzerland, France and Italy), Frank worked in stage, television and on the big screen. Among his stage credits are Amiri Baraka's Slave Ship; Ray Aranha's My Sister, My Sister; Richard Wesley's The Mighty Gents; Phillip Hayes Dean's Every Night When the Sun Goes Down; Melvin van Peebles' Ain't Supposed to Die A Natural Death; August Wilson's Joe Turner's Come and Gone & Two Trains Running; Leslie Lee's Black Eagles; Public Theater Productions of The Basic Training of Pavlo Hummel and Corelainus. As a member of Gertrude Jeannette's HADLEY Players Repertory Company, Frank also appeared in This Way Forward, A Bolt from the Blue and Gladys' Dilemma. Film appearances include Across 110th Street, Fort Apache The Bronx, Love and Death, Taxi Driver, Heart, For Love of the Game and Malcolm X. Work in television includes Like It Is, Kojak, The Equalizer, Spencer for Hire, New York Undercover, Law and Order and The Cosby Show.",
        "birthday": "1937-04-25",
        "deathday": "2018-12-01",
        "gender": 2,
        "homepage": null,
        "id": 1042,
        "imdb_id": "nm0012524",
        "known_for_department": "Acting",
        "name": "Frank Adu",
        "place_of_birth": "White Plains, New York, USA",
        "popularity": 2.0083,
        "profile_path": "/jTA0rWskaadhC6I3mdSXmQgu67n.jpg"
    }
}