{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gdxPHC5nw9sBrrUyiOnzkWqnLE4.jpg",
                "genre_ids": [
                    28,
                    35,
                    878,
                    14
                ],
                "id": 251516,
                "original_language": "en",
                "original_title": "Kung Fury",
                "overview": "During an unfortunate series of events, a friend of Kung Fury is assassinated by the most dangerous kung fu master criminal of all time, Adolf Hitler, a.k.a Kung Führer.  Kung Fury decides to travel back in time to Nazi Germany in order to kill Hitler and end the Nazi empire once and for all.",
                "popularity": 1.2682,
                "poster_path": "/f1QpIlCqlFXp1hjnLplXb5irxip.jpg",
                "release_date": "2015-05-22",
                "title": "Kung Fury",
                "video": false,
                "vote_average": 7.467,
                "vote_count": 1883,
                "character": "Private Lahmstache",
                "credit_id": "554532d5c3a3680cd5004ccc",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Gustafsson was born in Goteborg, Sweden. He studied at the Calle Flygares Theater School in Stockholm to become an actor.  But before his debut as an actor, he had already debuted in 2005 as a stand-up comedian at Bungy Comedy, a Swedish club for stand-up beginners. In 2006 he enrolled at Standup Star, a stand-up school, where among others, Özz Nûjen and Jakob Öqvist, two of the most well-known comedians in Sweden, have attended.\n\nAs of 2008, his most notable appearance was in Melodifestivalen 2008, the Swedish selections for the Eurovision Song Contest. For example, he sang a song to Kristian Luuk's  (the host) girlfriend Carina Berg. In his song he declared his love for  her. Afterward, Berg said that she had to hide her cheeks so people  couldn't see that she was blushing.\n\nGustafsson gained a certain degree of international fame following a World of Warcraft (WoW) joke in Parlamentet,  talking about people wasting time on the internet and not contributing  to their party's effort by playing inefficiently, using so much internal  WoW terminology himself that he was incomprehensible to non-players. The scene was spread over the Internet, mainly on YouTube, where translations into other languages could also be found.\n\nIn 2008, Björn received big media attention by great efforts in Parlamentet and as an entertainment in the breaks to Melodifestivalens and he also got voted as the Sweden's funniest man by Aftonbladet's readers on 6 March 2008. He also read the Swedish votes at the Eurovision Song Contest 2008. He continued his \"stand-up\" shows at the big stage, in the 44th Guldbagge Awards in 2009 together with Johan Glans, and with Robert Gustafsson in the Svenska idrottsgalan 2009 (Swedish athletics awards) where he also presented the nominations for rookie of the year.",
        "birthday": "1986-02-19",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.bjorngustafsson.se/",
        "id": 1042841,
        "imdb_id": "nm2930714",
        "known_for_department": "Acting",
        "name": "Björn Gustafsson",
        "place_of_birth": "Kungälv, Västra Götalands län, Sweden",
        "popularity": 0.5574,
        "profile_path": "/70iVhIfiswXAHDqKWMhSSFAIkhH.jpg"
    }
}