{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/oA4n3fCEW86QoLTDDlAfik9eOq9.jpg",
                "genre_ids": [
                    35
                ],
                "id": 437033,
                "original_language": "es",
                "original_title": "Toc Toc",
                "overview": "A group of patients meet at a prestigious psychologist's office. Apart from the day and time of the appointment, something else unites them all: all six suffer from OCD. But the plane bringing the doctor is unexpectedly delayed, which forces them to spend an endless wait until the doctor shows up. Will they be able to keep their manias, impulses, convulsions, obsessions and rituals at bay during the wait?",
                "popularity": 3.5369,
                "poster_path": "/qKrYZOXuayCcqJri6vwfzA8kCxu.jpg",
                "release_date": "2017-09-01",
                "title": "Toc Toc",
                "video": false,
                "vote_average": 7.102,
                "vote_count": 1238,
                "character": "Paciente nuevo grupo #5",
                "credit_id": "5b5c0de50e0a262e9f00d960",
                "order": 26
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Arturo Antón Valls Mollà",
            "阿圖羅華勒斯"
        ],
        "biography": "Nació en el barrio de La Punta (Valencia). Estudió en el instituto San Vicente Ferrer. Comenzó la carrera de Periodismo en Valencia, la cual abandonó cuando empezó como reportero en una televisión local de Valencia (Valencia Te Ve), un magacine presentado por Laura Pérez Vehí llamado \"La luna de Valencia\", y teniendo como compañera de programa a Carmen Alcayde. Su debut en una televisión nacional fue en 1996, como reportero en la primera etapa de Caiga Quien Caiga, que presentaba Wyoming. Una vez que finalizó el programa en 2002, fue fichado por la FORTA, donde presentó el programa X cuánto?, que se emitió en varias cadenas autonómicas españolas como Telemadrid o Canal 9 y posteriormente presentó el espacio de zapping Licencia para mirar, donde protagonizó monólogos y sketches. Más tarde colaboraría con Florentino Fernández y Nuria Roca en el programa de humor UHF de Antena 3. Después presentó durante un corto espacio de tiempo Los Más, junto a Silvia Jato. Finalmente, recaló de nuevo en Telecinco, sustituyendo durante unos meses a Jesús Vázquez como presentador del concurso Allá tú. También participó en la serie Gominolas, que solo duró 7 capítulos en antena. Ha intervenido ocasionalmente en capítulos de varias series televisivas como Un paso adelante, 7 vidas y Aída. Por otra parte, ha desarrollado su faceta de actor en la gran pantalla en las películas El corazón del guerrero y Torrente 2: Misión en Marbella. Fue Jesús Quesada en Camera Café y posteriormente interpretó al mismo personaje en ¡Fibrilando! También colaboró esporádicamente en Muchachada Nui. En 2008 filmó la película 8 citas junto a Fernando Tejero entre otros. En diciembre de 2009 estrena el programa Vaya tropa en Cuatro, que es retirado poco después por sus bajos índices de audiencia. En julio de 2010 protagoniza la parodia La isla de los nominados y en el verano de 2011 ficha por Antena 3 para presentar el concurso ¡Ahora caigo!, concurso que en su primera emisión se hizo con el liderato de la noche y con el minuto de oro, siendo un gran triunfo.1 Tras aparecer como invitado especial en la primera edición del programa Tu cara me suena, desde el 1 de octubre de 2012 hasta el 11 de febrero de 2013 formó parte de la segunda edición, donde se clasificó como tercer finalista. El 23 de octubre de 2012 Arturo Valls presentó junto a Patricia Conde la gala de los Neox Fan Awards en Neox.2 El 18 de enero de 2013, Arturo Valls fue confirmado como presentador de Splash: famosos al agua, programa emitido por Antena 3. El 24 de septiembre de 2013 Arturo Valls volvió a presentar la segunda edición de los Neox Fan Awards en Neox junto a Anna Simon. Desde el 15 de noviembre de 2013 presenta en el prime time de los viernes de Antena 3 el concurso de cómicos Me resbala. El 28 de noviembre de 2013 volvió como invitado al programa Tu cara me suena imitando a Miley Cyrus.",
        "birthday": "1975-03-24",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.chaomanagement.com/index.php/arturo-valls/biografia-arturo-valls/",
        "id": 1042765,
        "imdb_id": "nm0885219",
        "known_for_department": "Acting",
        "name": "Arturo Valls",
        "place_of_birth": "València, Comunitat Valenciana, Spain",
        "popularity": 0.1433,
        "profile_path": "/cTiFlNMnUR0oK2ACTPiAavaJqNk.jpg"
    }
}