{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wSJHuSD7ojzoXifWjOAjxV7UpEL.jpg",
                "genre_ids": [
                    10751,
                    16,
                    10402,
                    12
                ],
                "id": 354912,
                "original_language": "en",
                "original_title": "Coco",
                "overview": "Despite his family’s baffling generations-old ban on music, Miguel dreams of becoming an accomplished musician like his idol, Ernesto de la Cruz. Desperate to prove his talent, Miguel finds himself in the stunning and colorful Land of the Dead following a mysterious chain of events. Along the way, he meets charming trickster Hector, and together, they set off on an extraordinary journey to unlock the real story behind Miguel's family history.",
                "popularity": 21.5358,
                "poster_path": "/6Ryitt95xrO8KXuqRGm1fUuNwqF.jpg",
                "release_date": "2017-10-27",
                "title": "Coco",
                "video": false,
                "vote_average": 8.202,
                "vote_count": 20232,
                "character": "Mamá Coco (voice)",
                "credit_id": "58dbe1ef92514133c900d995",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ana Ofelia Murgía"
        ],
        "biography": "Ana Ofelia Murguía was a Mexican actress with a long career in theater, film and television for more than 40 years. She is a graduate of the Theater School of the National Institute of Fine Arts and a student of the “father of Mexican theater” Seki Sano, which forged her for a fruitful career on stage. She received the Ariel Award for Best Female Co-Acting on four occasions for \"Cadena Perpetua\" (1979), \"Los Motivos de Luz\" (1986), \"La Reina de la Noche\" (1996), and the Ariel de Oro for lifetime achievement in 2011. She also won three times the Silver Goddess award for The Motifs of Light (1986), Written in the Body of the Night (2002), The Good Herbs (2011). In 2004 he received the silver Mayahuel for his career at the Guadalajara Film Festival, and in 2007 he obtained special recognition at the Lunas del Auditorio. Ana Ofelia Murguía voiced Miguel's great-grandmother in the Oscar-winning animated film Coco (2017).",
        "birthday": "1933-12-08",
        "deathday": "2023-12-31",
        "gender": 1,
        "homepage": null,
        "id": 1043869,
        "imdb_id": "nm0613872",
        "known_for_department": "Acting",
        "name": "Ana Ofelia Murguía",
        "place_of_birth": "Mexico City, Mexico",
        "popularity": 0.424,
        "profile_path": "/rjlxNNR3t2BXDm1yjXLHx5489cV.jpg"
    }
}