{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mDu3nkdjzkJ9loy3QyppGcLjaI7.jpg",
                "genre_ids": [
                    18
                ],
                "id": 11321,
                "original_language": "en",
                "original_title": "Seven Pounds",
                "overview": "An IRS agent with a fateful secret embarks on an extraordinary journey of redemption by forever changing the lives of seven strangers.",
                "popularity": 4.1403,
                "poster_path": "/85zUipgVy2QbvAJ6djZXYaGckMv.jpg",
                "release_date": "2008-12-18",
                "title": "Seven Pounds",
                "video": false,
                "vote_average": 7.606,
                "vote_count": 6977,
                "character": "George's Doctor",
                "credit_id": "52fe44259251416c7502a6a9",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/20wSDAS6rUWhkZQ2PxPC9TRsAd1.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 11499,
                "original_language": "en",
                "original_title": "Frost/Nixon",
                "overview": "For three years after being forced from office, Nixon remained silent. But in summer 1977, the steely, cunning former commander-in-chief agreed to sit for one all-inclusive interview to confront the questions of his time in office and the Watergate scandal that ended his presidency. Nixon surprised everyone in selecting Frost as his televised confessor, intending to easily outfox the breezy British showman and secure a place in the hearts and minds of Americans. Likewise, Frost's team harboured doubts about their boss's ability to hold his own. But as the cameras rolled, a charged battle of wits resulted.",
                "popularity": 4.5484,
                "poster_path": "/z4cQ2mJxwPZUwVh97yX9oNsLLZQ.jpg",
                "release_date": "2008-10-15",
                "title": "Frost/Nixon",
                "video": false,
                "vote_average": 7.277,
                "vote_count": 1232,
                "character": "Frank Gannon",
                "credit_id": "52fe444c9251416c7502fc7b",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/bYimqNnizPUCnL5HOdoCW02IGmH.jpg",
                "genre_ids": [
                    18,
                    35,
                    10749
                ],
                "id": 74643,
                "original_language": "fr",
                "original_title": "The Artist",
                "overview": "Hollywood, 1927: As silent movie star George Valentin wonders if the arrival of talking pictures will cause him to fade into oblivion, he sparks with Peppy Miller, a young dancer set for a big break.",
                "popularity": 3.4438,
                "poster_path": "/z68py0ZqPgeacGPG54AGVRbNBS7.jpg",
                "release_date": "2011-10-12",
                "title": "The Artist",
                "video": false,
                "vote_average": 7.45,
                "vote_count": 3365,
                "character": "Director #2",
                "credit_id": "566da9a3c3a36834c100bcd9",
                "order": 29
            },
            {
                "adult": false,
                "backdrop_path": "/AfGp6Ev3BVdEd7L99kGQzOzsqRb.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 568,
                "original_language": "en",
                "original_title": "Apollo 13",
                "overview": "The true story of technical troubles that scuttle the Apollo 13 lunar mission in 1970, risking the lives of astronaut Jim Lovell and his crew, with the failed journey turning into a thrilling saga of heroism. Drifting more than 200,000 miles from Earth, the astronauts work furiously with the ground crew to avert tragedy.",
                "popularity": 8.5919,
                "poster_path": "/tVeKscCm2fY1xDXZk8PgnZ87h9S.jpg",
                "release_date": "1995-06-30",
                "title": "Apollo 13",
                "video": false,
                "vote_average": 7.451,
                "vote_count": 5604,
                "character": "GUIDO White",
                "credit_id": "5bc36f8d92514179c7047ae4",
                "order": 29
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Andy Milder (born August 16, 1969) is an American actor. Milder was born in Omaha, Nebraska. He moved to Santa Monica, California, at a young age and then went to the University of California, Berkeley, majoring in Economics before studying at the American Conservatory Theater in San Francisco.\n\nHe has appeared in such films as Apollo 13, Armageddon, Rumor Has It…, Frost/Nixon, Transformers, and Domino. He was a series regular on Fame L.A. and Weeds, and appeared on such shows as Star Trek: Voyager, Star Trek: Deep Space Nine, The West Wing, Six Feet Under, Ugly Betty, Boston Legal, Parks and Recreation, Married... with Children, The Wonder Years, Private Practice, and Criminal Minds. Milder provided narration for Ballroom Bootcamp, 101 Most Starlicious Make-Overs, Wrecks to Riches, and Lost Gold of World War II. He provided the voice of Lightning Lad in the 2006 animated series Legion of Super Heroes and the film Lego DC Comics Super Heroes: Justice League: Cosmic Clash. From 2005 to 2009, he was a recurring cast member and later series regular on Weeds as Dean Hodes. Starting in 2011, he is a recurring cast member on the Disney Channel sitcom Austin & Ally as Lester Dawson. He also had an appearance on the show Royal Pains as well as Rizzoli & Isles.\n\nMilder lives in Manhattan Beach, California, with his wife, Dr. Betty Lee.\n\nFrom Wikipedia.",
        "birthday": "1969-08-16",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1043304,
        "imdb_id": "nm0586994",
        "known_for_department": "Acting",
        "name": "Andy Milder",
        "place_of_birth": " Omaha, Nebraska, USA",
        "popularity": 0.5421,
        "profile_path": "/z7sCgA9TiyVuBosmgBJbAxgm05K.jpg"
    }
}