{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/en971MEXui9diirXlogOrPKmsEn.jpg",
                "genre_ids": [
                    28,
                    12,
                    35
                ],
                "id": 293660,
                "original_language": "en",
                "original_title": "Deadpool",
                "overview": "The origin story of former Special Forces operative turned mercenary Wade Wilson, who, after being subjected to a rogue experiment that leaves him with accelerated healing powers, adopts the alter ego Deadpool. Armed with his new abilities and a dark, twisted sense of humor, Deadpool hunts down the man who nearly destroyed his life.",
                "popularity": 16.108,
                "poster_path": "/3E53WEZJqP6aM84D8CckXx4pIHw.jpg",
                "release_date": "2016-02-09",
                "title": "Deadpool",
                "video": false,
                "vote_average": 7.623,
                "vote_count": 31917,
                "character": "Stripper (uncredited)",
                "credit_id": "6158ad80b1f68d006761976d",
                "order": 35
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Victoria DeMare"
        ],
        "biography": "Victoria De Mare is one of Hollywood's reigning \"Hottest Horror Scream Queens\" for over a decade according to the cover feature editorial article, interview, & pictorial of the January 2017 issue of Hustler Magazine. She has over 150 Film & TV credits including music & counting. She is best known for her creation & portrayal of the sexy demon succubus clown, \"Batty Boop\" from the horror/comedy feature film series, 'Killjoy'.\n\nVictoria is a graduate of New York University with a Bachelor of Arts in Theatre Arts and Broadcast Journalism. In addition to being an award-winning character actor, she is also a published writer, published poet, published professional model, LACMA(Los Angeles County Museum of Art) exhibit art model, live TV talk show host & producer(SKY Channel UK & Europe) as well as a professional dancer. Victoria is also a professional lead, back-up, harmony, & \"ghost\" vocalist as well as an award-winning songwriter, composer, arranger, music producer, & music publisher(ASCAP).",
        "birthday": "1974-01-01",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.victoriademare.com/vdm/index2.html",
        "id": 104458,
        "imdb_id": "nm1389064",
        "known_for_department": "Acting",
        "name": "Victoria De Mare",
        "place_of_birth": "Wilmington, Delaware, USA",
        "popularity": 0.408,
        "profile_path": "/isKedj2RvhVHs9DxmMX0lSXLBco.jpg"
    }
}