{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2sE6hrwfn9IV7eDlMvpIb9q1EWy.jpg",
                "genre_ids": [
                    35,
                    10402,
                    10749
                ],
                "id": 114150,
                "original_language": "en",
                "original_title": "Pitch Perfect",
                "overview": "College student Beca knows she does not want to be part of a clique, but that's exactly where she finds herself after arriving at her new school. Thrust in among mean gals, nice gals and just plain weird gals, Beca finds that the only thing they have in common is how well they sing together. She takes the women of the group out of their comfort zone of traditional arrangements and into a world of amazing harmonic combinations in a fight to the top of college music competitions.",
                "popularity": 5.2945,
                "poster_path": "/gsFoJk9g8W3zgaipRrrURk7LbiF.jpg",
                "release_date": "2012-09-28",
                "title": "Pitch Perfect",
                "video": false,
                "vote_average": 7.28,
                "vote_count": 6699,
                "character": "BU Harmonics #4",
                "credit_id": "57003e0fc3a3686e88003177",
                "order": 55
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Έμμα Γκρέιβς",
            "إيما غرايفز",
            "艾瑪·格雷夫斯",
            "Emilia Graves",
            "埃玛·格雷夫斯",
            "אמה גרייבס",
            "エマ・グレイヴス",
            "엠마 그레이브스",
            "Емма Грейвс",
            "เอ็มม่า กราเวส"
        ],
        "biography": "Emma Graves is a Louisiana actress known for her roles in Rent-A-Ryde (2018), Lowest Bidders (2017), Hush (2016), In The Hell of Dixie (2016), & Pitch Perfect (2012).\n\nEmma was born in Snellville, Georgia and moved with her family to Louisiana when she was two years old. Theatre was her first true passion, as it nurtured her soul and saved her from everything going on around her. She dove into the world of film at 17 when her agent found and signed her. She studied film in depth under her coach and mentor, Debby Gaudet, and discovered the beauty that is film acting. By the time she graduated high school, Emma was voted \"Most Talented\" by her senior class, an honorary member of the National Thespian Society, and was classically trained to sing any genre of music.\n\nShe went on to gain a Bachelor of Arts in Theatre as well as degrees in Music & Psychology from Louisiana College where she also studied directly under her agent.",
        "birthday": "1992-11-23",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1044197,
        "imdb_id": "nm4738909",
        "known_for_department": "Acting",
        "name": "Emma Graves",
        "place_of_birth": null,
        "popularity": 0.55,
        "profile_path": "/3a93BgglFIIPQc9VekxLVLAZ57z.jpg"
    }
}