{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kT8orKwz2bmRdHBLnG44yucYtFy.jpg",
                "genre_ids": [
                    28,
                    53
                ],
                "id": 204082,
                "original_language": "en",
                "original_title": "Homefront",
                "overview": "Phil Broker is a former DEA agent who has gone through a crisis after his action against a biker gang went horribly wrong and it cost the life of his boss' son. He is recently widowed and is left with a 9-years-old daughter, Maddy. He decides to quit the turbulent and demanding life of thrill for Maddy's sake and retires to a small town. His daughter fights off a boy who was bullying her at school and this sets in motion a round of events that end in his direct confrontation with the local Meth drug lord. His past history with the biker gang also enters the arena, making matters more complex. But he has a mission in his mind to protect his daughter and he is ready to pay any cost that it demands.",
                "popularity": 10.4802,
                "poster_path": "/6pF8D9bDIAmuHgCqGKEfuNWRQam.jpg",
                "release_date": "2013-11-12",
                "title": "Homefront",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 3647,
                "character": "Junior DEA Agent",
                "credit_id": "5c1a7dad92514159af14780a",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Michael Traynor (born December 12, 1975) is an American actor and dancer known for his roles on The Walking Dead, Rectify and The Fosters.\n\nTraynor began his career as a dancer, receiving dance scholarships and dancing professionally for a few years, but after performing in a few small acting roles he decided to become an actor. His most notable roles are Nicholas on The Walking Dead, George Melton on Rectify and Craig on The Fosters.",
        "birthday": "1975-12-12",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1046538,
        "imdb_id": "nm1290115",
        "known_for_department": "Acting",
        "name": "Michael Traynor",
        "place_of_birth": "Ft. Lauderdale, Florida, USA",
        "popularity": 0.1557,
        "profile_path": "/j0q2FJUS3ZyAhkIh7mnvGhFyK3M.jpg"
    }
}