{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/pDGkMdMHkl1qRAYmQjdLKVx3euQ.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 16958,
                "original_language": "en",
                "original_title": "The Asphalt Jungle",
                "overview": "Recently paroled from prison, legendary burglar \"Doc\" Riedenschneider, with funding from Alonzo Emmerich, a crooked lawyer, gathers a small group of veteran criminals together in the Midwest for a big jewel heist.",
                "popularity": 5.6422,
                "poster_path": "/8xsUnT0P2fJWQv9jGDhs3i9Zx2l.jpg",
                "release_date": "1950-05-12",
                "title": "The Asphalt Jungle",
                "video": false,
                "vote_average": 7.493,
                "vote_count": 504,
                "character": "Woman (uncredited)",
                "credit_id": "633c18f2481382007aa0aaa9",
                "order": 64
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Helen Johnson"
        ],
        "biography": "Judith Wood (born Helen Johnson, August 1, 1906 – April 6, 2002) was an American film actress.\n\nWood's first role was in the 1929 film Gold Diggers of Broadway. In this first film, as well as in the four in which she would star during 1930, Wood was credited under her birth name.\n\nHer first film of 1931 was It Pays to Advertise, which starred Carole Lombard. It was the last film in which she was billed as Helen Johnson, and thereafter all of her film credits were under the name Judith Wood. In 1931, she was selected as one of 13 girls to be WAMPAS Baby Stars, along with actresses Marian Marsh, Karen Morley, Marion Shilling, and Barbara Weeks. Wood starred in six films in 1931, and then her career slowed and eventually faded. Also in 1931, she was injured in an automobile accident and spent months recuperating.\n\nShe starred as Kitty Packard in the original Broadway production of Dinner at Eight, but the film version went to Jean Harlow. In 1934, she only received three film roles, one of which was uncredited. In 1936 and 1937, she had small but credited roles in two films, then did not receive another until 1941, which was uncredited. Her last film was in 1950 when she had an uncredited role in The Asphalt Jungle (1950).\n\nOn March 17, 1939, Wood married Percival Christopher Wren Jr. in Tokyo, Japan. Following her marriage she retired from acting, but remained in Los Angeles. She died there in 2002 of natural causes, aged 95.",
        "birthday": "1906-08-01",
        "deathday": "2002-04-06",
        "gender": 1,
        "homepage": null,
        "id": 1047396,
        "imdb_id": "nm0939813",
        "known_for_department": "Acting",
        "name": "Judith Wood",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 2.3305,
        "profile_path": "/vjXy3vc2DX14kK9tfnCwGGNaVyB.jpg"
    }
}