{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7TvehiVjzE9hMvnq94mOYjP8kGT.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 14926,
                "original_language": "en",
                "original_title": "Uptown Girls",
                "overview": "Molly Gunn, the freewheeling daughter of a deceased rock legend, is forced to get a job when her manager steals her money. As nanny for precocious Ray, the oft ignored daughter of a music executive she learns what it means to be an adult while teaching Ray how to be a child.",
                "popularity": 3.2784,
                "poster_path": "/liazMoopc2fhWq1YlfwasQcvWu.jpg",
                "release_date": "2003-08-15",
                "title": "Uptown Girls",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 983,
                "character": "Celebrity",
                "credit_id": "61ad7a1826346200887fd3be",
                "order": 41
            },
            {
                "adult": false,
                "backdrop_path": "/sBB39VMtByFltGGGW2c5N6LOAvj.jpg",
                "genre_ids": [
                    18,
                    53,
                    80
                ],
                "id": 8470,
                "original_language": "en",
                "original_title": "John Q",
                "overview": "John Quincy Archibald is a father and husband whose son is diagnosed with an enlarged heart and then finds out he cannot receive a transplant because HMO insurance will not cover it. Therefore, he decides to take a hospital full of patients hostage until the hospital puts his son's name on the donor's list.",
                "popularity": 4.3211,
                "poster_path": "/xEE91LvXiqgs7Hmdl44LCzHtFf6.jpg",
                "release_date": "2002-02-15",
                "title": "John Q",
                "video": false,
                "vote_average": 7.136,
                "vote_count": 2486,
                "character": "Nas",
                "credit_id": "60976477b39e35003c18e946",
                "order": 57
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Nasir bin Olu Dara Jones",
            "Nasty Nas",
            "Nasir (Nas) Jones",
            "Nasir Jones"
        ],
        "biography": "Nasir bin Olu Dara Jones (September 14, 1973), better known by his stage name Nas, is an American rapper and businessman. Rooted in East Coast hip hop, he is regarded as one of the greatest and most influential rappers of all time.\r\n\r\nThe son of jazz musician Olu Dara, Jones's musical career began in 1989 as he adopted the moniker of \"Nasty Nas\" and recorded demos for Large Professor. He was a featured artist on Main Source's \"Live at the Barbeque\" (1991), also produced by Large Professor. Nas's debut album Illmatic (1994) received universal acclaim upon release, and is considered to be one of the greatest hip hop albums of all time; in 2021, the album was inducted into the Library of Congress's National Recording Registry. His second album It Was Written (1996) debuted atop the Billboard 200 and charted for four consecutive weeks; the album, along with its single \"If I Ruled the World (Imagine That)\" (featuring Lauryn Hill), catapulted Nas into international success. Both released in 1999, Nas's albums I Am and Nastradamus were criticized as inconsistent and too commercially oriented, and critics and fans feared that his output was declining in quality.\r\n\r\nFrom 2001 to 2005, Nas was involved in a highly publicized feud with Jay-Z, popularized by the diss track \"Ether\". It was this feud, along with Nas's albums Stillmatic (2001), God's Son (2002), and the double album Street's Disciple (2004), that helped restore his critical standing. After squashing the feud, Nas signed to Jay-Z's Def Jam Recordings in 2006 and went in a more provocative, politicized direction with the albums Hip Hop Is Dead (2006) and his untitled 9th studio album (2008). In 2010, Nas released Distant Relatives, a collaboration album with Damian Marley, donating all royalties to charities active in Africa. His 10th studio album, Life Is Good (2012), was nominated for Best Rap Album at the 55th Annual Grammy Awards. After receiving thirteen nominations, his 12th studio album, King's Disease (2020), won him his first Grammy for Best Rap Album at the 63rd Annual Grammy Awards; he then followed it by releasing his 13th studio album, King's Disease II (2021), as the album's sequel. In the same year, his 14th studio album, Magic, was released on Christmas Eve.\r\n\r\nIn 2012, The Source ranked him second on their list of the \"Top 50 Lyricists of All Time\". In 2013, Nas was ranked 4th on MTV's \"Hottest MCs in the Game\" list. About.com ranked him first on their list of the \"50 Greatest MCs of All Time\" in 2014, and a year later, Nas was featured on the \"10 Best Rappers of All Time\" list by Billboard. He is also an entrepreneur through his own record label; he serves as associate publisher of Mass Appeal magazine and the co-founder of Mass Appeal Records. Nas has released fourteen studio albums since 1994, ten of which are certified gold, platinum or multi-platinum in the U.S.\r\n\r\nDescription above from the Wikipedia article Nas, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1973-09-14",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.nasirjones.com/",
        "id": 104779,
        "imdb_id": "nm0621576",
        "known_for_department": "Acting",
        "name": "Nas",
        "place_of_birth": "Crown Heights, Brooklyn, New York, USA",
        "popularity": 0.6289,
        "profile_path": "/zK3UB7QYI8eJDRKbM7B3ewDKr2V.jpg"
    }
}