{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fOfcbdBQBCO4Y2hy6DfLbb30klU.jpg",
                "genre_ids": [
                    18,
                    37,
                    10749,
                    10752,
                    28
                ],
                "id": 4476,
                "original_language": "en",
                "original_title": "Legends of the Fall",
                "overview": "In early 20th-century Montana, Col. William Ludlow lives on a ranch in the wilderness with his sons, Alfred, Tristan, and Samuel. Eventually, the unconventional but close-knit family are bound by loyalty, tested by war, and torn apart by love, as told over the course of several decades in this epic saga.",
                "popularity": 6.4016,
                "poster_path": "/t1KPGlW0UGd0m515LPQmk2F4nu1.jpg",
                "release_date": "1994-12-23",
                "title": "Legends of the Fall",
                "video": false,
                "vote_average": 7.393,
                "vote_count": 2716,
                "character": "Samuel Decker",
                "credit_id": "5dec0046daf57c0019ea8bb6",
                "order": 24
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "David A. Kaye"
        ],
        "biography": "Vancouver-based artist David Andrew Kaye was born in Saskatoon, Saskatchewan, Canada before his family moved to Vancouver, British Columbia. David's film debut came in the Academy Award-winning film Legends of the Fall (1994) as Samuel Decker. David continued to work as a child actor, breaking into the voice over scene in 2001, voicing 100 episodes as the title character in Make Way for Noddy (2001) until he took a break to go to school at the University of British Columbia. While attending school, he took a film production class and realized a new passion. In 2008, he started Whiskaye Films with Jameson Parker. He graduated in 2011 with a Bachelor of Fine Arts degree in Acting. After graduating, David performed in a number of live shows, including three BC based runs of multiple award-winning hip-hop Shakespeare musical \"The Bombitty of Errors\". While live performances were beginning to roll in, David had been producing music videos with Whiskaye Films and teamed up with award-winning writer and director Tyler Funk. David worked with Tyler's company North of Now Films, producing branded digital content and broadcast commercials, garnering millions of online views and multiple awards. David is producing and voicing several characters in White Ninja (2015). He is an actor and producer also known for 3000 Miles to Graceland (2001).",
        "birthday": "1988-08-04",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1048574,
        "imdb_id": "nm0443287",
        "known_for_department": "Acting",
        "name": "David Kaye",
        "place_of_birth": "Saskatoon, Saskatchewan, Canada",
        "popularity": 1.0686,
        "profile_path": "/fAK9KpVtPeZ9MTUXamfVqwUGBId.jpg"
    }
}