{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/l36ekUEEDLMAuL0YAU2Qxfq1i6X.jpg",
                "genre_ids": [
                    10751,
                    16,
                    35,
                    12
                ],
                "id": 458253,
                "original_language": "en",
                "original_title": "Missing Link",
                "overview": "The charismatic Sir Lionel Frost considers himself to be the world's foremost investigator of myths and monsters. Trouble is, none of his small-minded, high-society peers seems to recognize this. Hoping to finally gain acceptance from these fellow adventurers, Sir Lionel travels to the Pacific Northwest to prove the existence of a legendary creature known as the missing link.",
                "popularity": 2.9044,
                "poster_path": "/bqQ38oKuROlAgyZcRII9tqtoPNi.jpg",
                "release_date": "2019-04-04",
                "title": "Missing Link",
                "video": false,
                "vote_average": 6.926,
                "vote_count": 892,
                "character": "Ama Lhamu (voice)",
                "credit_id": "5af15bf9c3a36837c8003564",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Amrita Acaria"
        ],
        "biography": "Amrita Acharia (also spelled Acharya) is a Norwegian actress of Ukrainian and Nepalese background. Acharia was born in Nepal to a Nepalese father and Ukrainian mother. She grew up in Kathmandu, Ukraine, England and Tromsø. She speaks Ukrainian, Russian and English, in addition to learning Norwegian when she moved to Norway at age thirteen. After finishing high school in Norway, she moved to England at age nineteen to pursue her acting career. Acharia played the role of the Dothraki handmaiden Irri in the first two seasons of Game of Thrones. Her character was written out of the series during the second season, despite surviving far longer in the books upon which the series is based. In 2011, Acharia starred in the one off BBC Christmas show, Lapland.",
        "birthday": "1987-07-31",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1048692,
        "imdb_id": "nm3822505",
        "known_for_department": "Acting",
        "name": "Amrita Acharia",
        "place_of_birth": "Kathmandu, Nepal",
        "popularity": 0.7348,
        "profile_path": "/AaFZh8HcQG14QDFA30YFSaQWlvh.jpg"
    }
}