{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/nKwGUiqPdNf47XFjlbR5IFwAaOL.jpg",
                "genre_ids": [
                    12,
                    36,
                    10752
                ],
                "id": 947,
                "original_language": "en",
                "original_title": "Lawrence of Arabia",
                "overview": "The story of British officer T.E. Lawrence's mission to aid the Arab tribes in their revolt against the Ottoman Empire during the First World War. Lawrence becomes a flamboyant, messianic figure in the cause of Arab unity but his psychological instability threatens to undermine his achievements.",
                "popularity": 6.3976,
                "poster_path": "/AiAm0EtDvyGqNpVoieRw4u65vD1.jpg",
                "release_date": "1962-12-11",
                "title": "Lawrence of Arabia",
                "video": false,
                "vote_average": 7.994,
                "vote_count": 3214,
                "character": "Reporter (uncredited)",
                "credit_id": "57150ef192514105a80033b3",
                "order": 33
            },
            {
                "adult": false,
                "backdrop_path": "/1yWn9A2LN0uRGudIg0bV2Np6T69.jpg",
                "genre_ids": [
                    10752,
                    28,
                    18
                ],
                "id": 9289,
                "original_language": "en",
                "original_title": "The Longest Day",
                "overview": "The retelling of June 6, 1944, from the perspectives of the Germans, US, British, Canadians, and the Free French. Marshall Erwin Rommel, touring the defenses being established as part of the Reich's Atlantic Wall, notes to his officers that when the Allied invasion comes they must be stopped on the beach. \"For the Allies as well as the Germans, it will be the longest day\"",
                "popularity": 3.7565,
                "poster_path": "/5zmvEofdIlgXrQl9A7e5IOzlnFU.jpg",
                "release_date": "1962-09-25",
                "title": "The Longest Day",
                "video": false,
                "vote_average": 7.594,
                "vote_count": 977,
                "character": "RAF Briefing Officer (uncredited)",
                "credit_id": "575460eec3a368346e0011c4",
                "order": 80
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Джек Хедли"
        ],
        "biography": "Jack Hedley (born in London on 28 October 1930 as Jack Hawkins, name changed to avoid confusion with his namesake) was an English actor, best known for his performances on television.\n\nHis screen career began in 1950 with a 13-minute drama-documentary about polio called A Life to be Lived. In the 1950s he starred in a number of films and TV appearances, such as Left Right and Centre, Fair Game, and the Alun Owen-scripted No Trams to Lime Street with Billie Whitelaw. He became a TV star in the Francis Durbridge-scripted BBC series The World of Tim Frazer (transmitted from November 1960 to March 1961), the 18 instalments of which comprised three separate serials of six episodes each. He also played Corrigan Blake in Alun Owen's 1962 BBC play You Can't Win 'Em All, the role being taken over by John Turner in the series Corrigan Blake that resulted the following year. He was also in Alun Owen's 'A Little Winter Love'.\n\nHe appeared in a number of British films of the 1960s, notably Lawrence of Arabia (1962), The Scarlet Blade (1963), Witchcraft (1964), Of Human Bondage (1964), The Secret of Blood Island (1964) and The Anniversary (1968). He also had roles in several 1970s BBC dramas, such as that of Lt Colonel Preston in Colditz (1972-4) and ex-serviceman Alan Haldane in Who Pays the Ferryman? (1977). Reportedly, the series was marked off-screen by personality clashes between Hedley and his co-stars Betty Arvaniti and Maria Sokali.\n\nHedley later appeared in the James Bond film For Your Eyes Only as Sir Timothy Havelock, also voicing Havelock's parrot. Soon after this, in the autumn of 1981 he played the lead role (cynical investigative cop Fred Williams) in Lucio Fulci's The New York Ripper (Lo squartatore di New York), in which his voice was dubbed. He also starred with Stanley Baker and Jean Seberg in the film of Irwin Shaw's 'In The French Style'.\n\nOther TV appearances include: The Saint, Gideon's Way (The Alibi Man), Softly, Softly, Dixon of Dock Green, The Buccaneers, Return of the Saint, One by One, Remington Steele, Only Fools and Horses (A Royal Flush), 'Allo 'Allo, Dalziel and Pascoe, and the television film version of Brief Encounter.\n\nDescription above from the Wikipedia article Jack Hedley,licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1930-10-28",
        "deathday": "2021-12-11",
        "gender": 2,
        "homepage": null,
        "id": 10507,
        "imdb_id": "nm0373324",
        "known_for_department": "Acting",
        "name": "Jack Hedley",
        "place_of_birth": "London, England, UK",
        "popularity": 0.1763,
        "profile_path": "/koBMl6FyEYlB42FyZMAyjKY2XFr.jpg"
    }
}