{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dYocWQoWk3Y6vBa0pGc0OQ8GLqn.jpg",
                "genre_ids": [
                    28,
                    12,
                    35,
                    10752,
                    10749
                ],
                "id": 961,
                "original_language": "en",
                "original_title": "The General",
                "overview": "During America’s Civil War, Union spies steal engineer Johnny Gray's beloved locomotive, 'The General'—with Johnnie's lady love aboard an attached boxcar—and he single-handedly must do all in his power to both get The General back and to rescue Annabelle.",
                "popularity": 1.8743,
                "poster_path": "/nIp4gIXogCjfB1QABNsWwa9gSca.jpg",
                "release_date": "1926-12-25",
                "title": "The General",
                "video": false,
                "vote_average": 7.942,
                "vote_count": 1329,
                "character": "Union General Who Gives Command to Cross Bridge (uncredited)",
                "credit_id": "566a16bac3a36836b4006904",
                "order": 27
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/tSipsYTp565LkopntX1lZNLPYHP.jpg",
                "genre_ids": [
                    28,
                    35,
                    9648
                ],
                "id": 992,
                "original_language": "en",
                "original_title": "Sherlock Jr.",
                "overview": "A film projectionist longs to be a detective, and puts his meagre skills to work when he is framed by a rival for stealing his girlfriend's father's pocketwatch.",
                "popularity": 2.7596,
                "poster_path": "/1G9r3rqtbFAQuyWKOZm4Y5J5s7Q.jpg",
                "release_date": "1924-04-17",
                "title": "Sherlock Jr.",
                "video": false,
                "vote_average": 8.1,
                "vote_count": 1071,
                "credit_id": "52fe4297c3a36847f802aadf",
                "department": "Camera",
                "job": "Director of Photography"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Elgin Lessley (also credited as Lesly, Lessly, and Leslie) (June 10, 1883 - January 10, 1944) was an American hand-crank cameraman of the silent film era—a period of filmmaking when virtually all special effects work had to be produced inside the camera during filming. Though Lessley worked earlier with Roscoe \"Fatty\" Arbuckle, and later with Harry Langdon, he is best known for the groundbreaking effects he produced with Buster Keaton, who dubbed him \"the human metronome\" for his ability to crank consistently at any requested speed.\n\nLessley's most striking effects were in The Playhouse (1921) and Sherlock Jr. (1924). In The Playhouse, through use of a specially shuttered lens and repeated back-cranking and re-cranking, Lessley allowed Keaton to appear as up to nine characters simultaneously, interacting with one another. In Sherlock Jr., Lessley's careful positioning of camera and actor in various locations produced the effect of a man stuck in a movie where his location keeps changing as he struggles to keep up. Lessley retired from filmmaking after shooting The Cameraman with Buster Keaton in 1928.",
        "birthday": "1883-01-10",
        "deathday": "1944-02-08",
        "gender": 2,
        "homepage": null,
        "id": 10522,
        "imdb_id": "nm0504380",
        "known_for_department": "Camera",
        "name": "Elgin Lessley",
        "place_of_birth": "Higbee, Missouri, USA",
        "popularity": 0.0607,
        "profile_path": "/9e3zbjGI0aZaW97IHmQrm83ST1t.jpg"
    }
}