{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7e9uENnSM93CQXyzLSuzBUgxm4P.jpg",
                "genre_ids": [
                    99,
                    10402
                ],
                "id": 164558,
                "original_language": "en",
                "original_title": "One Direction: This Is Us",
                "overview": "\"One Direction: This Is Us\" is a captivating and intimate all-access look at life on the road for the global music phenomenon. Weaved with stunning live concert footage, this inspiring feature film tells the remarkable story of Niall, Zayn, Liam, Harry and Louis' meteoric rise to fame, from their humble hometown beginnings and competing on the X-Factor, to conquering the world and performing at London’s famed O2 Arena. Hear it from the boys themselves and see through their own eyes what it's really like to be One Direction.",
                "popularity": 1.2147,
                "poster_path": "/b720e7DW3nqRJaUH9xpTtvYhnUj.jpg",
                "release_date": "2013-08-28",
                "title": "One Direction: This Is Us",
                "video": false,
                "vote_average": 8.254,
                "vote_count": 1053,
                "character": "Self",
                "credit_id": "52fe4c7bc3a36847f82309bb",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Lou",
            "لوئیس تاملینسون"
        ],
        "biography": "Louis William Tomlinson (born 24 December 1991) is an English singer-songwriter and actor, best known as a member of the boy band 'One Direction'. Tomlinson began his career as an actor, initially appearing in ITV drama, Fat Friends, as an extra. He also went on to appear in another ITV drama film, If I Had You (2006), and the BBC drama Waterloo Road. In 2010, he became a founding member of 'One Direction' after auditioning as a solo artist on \"The X Factor\". Following the band's hiatus, Tomlinson released the single \"Just Hold On\" with Steve Aoki in December 2016.\n\nDescription above is from the Wikipedia article Louis Tomlinson, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1991-12-24",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.louis-tomlinson.com",
        "id": 1052106,
        "imdb_id": "nm4164873",
        "known_for_department": "Acting",
        "name": "Louis Tomlinson",
        "place_of_birth": "Doncaster, Yorkshire, England, UK",
        "popularity": 0.4007,
        "profile_path": "/9qAH9kOlrdilv5Xdk24bsPO5F8z.jpg"
    }
}