{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/or90vNrOVnYwi07fYYpQ3pbnjxP.jpg",
                "genre_ids": [
                    18,
                    53
                ],
                "id": 702,
                "original_language": "en",
                "original_title": "A Streetcar Named Desire",
                "overview": "A disturbed, aging Southern belle moves in with her sister for solace — but being face-to-face with her brutish brother-in-law accelerates her downward spiral.",
                "popularity": 3.2027,
                "poster_path": "/aicdlO5vt7z2ARm279eGzJeYCLQ.jpg",
                "release_date": "1951-09-19",
                "title": "A Streetcar Named Desire",
                "video": false,
                "vote_average": 7.617,
                "vote_count": 1411,
                "character": "Blanche DuBois",
                "credit_id": "52fe426dc3a36847f801db07",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/ft8WRF2xqEwwGWa59naDUybKTAx.jpg",
                "genre_ids": [
                    18,
                    10752,
                    10749
                ],
                "id": 770,
                "original_language": "en",
                "original_title": "Gone with the Wind",
                "overview": "The spoiled daughter of a Georgia plantation owner conducts a tumultuous romance with a cynical profiteer during the American Civil War and Reconstruction Era.",
                "popularity": 7.332,
                "poster_path": "/lNz2Ow0wGCAvzckW7EOjE03KcYv.jpg",
                "release_date": "1939-12-15",
                "title": "Gone with the Wind",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 4191,
                "character": "Scarlett O'Hara",
                "credit_id": "52fe4274c3a36847f801fe17",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Вів'єн Мері Гартлі",
            "Vivian Mary Hartley",
            "Vivian Leigh",
            "ویوین لی"
        ],
        "biography": "Vivien Leigh (born Vivian Mary Hartley on November 5, 1913, in Darjeeling, British India) was an English actress renowned for her roles in Hollywood and British theater. She won two Academy Awards for Best Actress, portraying Scarlett O’Hara in Gone with the Wind (1939) and Blanche DuBois in A Streetcar Named Desire (1951), both performances that solidified her place among the greatest actresses of classic cinema.\n\nLeigh was the only child of Ernest Hartley, a British broker, and Gertrude Yackjee, who had Anglo-Indian and Armenian ancestry. She spent her childhood between England and Europe, attending convent schools before enrolling at the Royal Academy of Dramatic Art (RADA) in London in 1932, setting the stage for her acting career.\n\nHer film debut came in Things Are Looking Up (1934), followed by roles in British films such as Fire Over England (1937), where she starred alongside Laurence Olivier. Their professional collaboration soon became a high-profile romance, capturing public fascination.\n\nLeigh’s breakthrough role was Scarlett O’Hara in Gone with the Wind (1939), a part for which she beat hundreds of actresses in a legendary casting search. The film became one of the most celebrated in cinematic history, and her performance earned international acclaim, securing her first Academy Award.\n\nLeigh continued to star in films such as Waterloo Bridge (1940) and That Hamilton Woman (1941), frequently working with Olivier, whom she married in 1940. Their union lasted 20 years, during which they became one of the most revered couples in theater and film, starring together in Shakespearean productions and three films.\n\nIn 1951, she won her second Academy Award for A Streetcar Named Desire, where her portrayal of Blanche DuBois was deeply personal, reflecting her own struggles with mental health.\n\nLeigh suffered from bipolar disorder, which profoundly affected her career and personal relationships. She also battled chronic tuberculosis, first diagnosed in the mid-1940s, which ultimately led to her death on July 8, 1967, at the age of 53.\n\nAfter divorcing Olivier in 1960, she found companionship with actor John Merivale, who remained by her side until her passing.\n\nDespite periods of career instability, Leigh remains one of the most celebrated actresses of her time. In 1999, the American Film Institute (AFI) ranked her as the 16th greatest female movie star of classic Hollywood cinema. She also won a Tony Award for Tovarich (1963), proving her talent extended beyond film.\n\nHer beauty, talent, and dedication made her an enduring icon, and her performances continue to be studied and celebrated worldwide.",
        "birthday": "1913-11-05",
        "deathday": "1967-07-07",
        "gender": 1,
        "homepage": null,
        "id": 10538,
        "imdb_id": "nm0000046",
        "known_for_department": "Acting",
        "name": "Vivien Leigh",
        "place_of_birth": "Darjeeling, Bengal Presidency, British India [now West Bengal, India]",
        "popularity": 0.6096,
        "profile_path": "/h1hS5o0cKXF2g9Wjej0RtibMPT0.jpg"
    }
}