{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dYocWQoWk3Y6vBa0pGc0OQ8GLqn.jpg",
                "genre_ids": [
                    28,
                    12,
                    35,
                    10752,
                    10749
                ],
                "id": 961,
                "original_language": "en",
                "original_title": "The General",
                "overview": "During America’s Civil War, Union spies steal engineer Johnny Gray's beloved locomotive, 'The General'—with Johnnie's lady love aboard an attached boxcar—and he single-handedly must do all in his power to both get The General back and to rescue Annabelle.",
                "popularity": 1.8743,
                "poster_path": "/nIp4gIXogCjfB1QABNsWwa9gSca.jpg",
                "release_date": "1926-12-25",
                "title": "The General",
                "video": false,
                "vote_average": 7.942,
                "vote_count": 1329,
                "character": "Union General",
                "credit_id": "52fe4294c3a36847f802994f",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/tSipsYTp565LkopntX1lZNLPYHP.jpg",
                "genre_ids": [
                    28,
                    35,
                    9648
                ],
                "id": 992,
                "original_language": "en",
                "original_title": "Sherlock Jr.",
                "overview": "A film projectionist longs to be a detective, and puts his meagre skills to work when he is framed by a rival for stealing his girlfriend's father's pocketwatch.",
                "popularity": 2.7596,
                "poster_path": "/1G9r3rqtbFAQuyWKOZm4Y5J5s7Q.jpg",
                "release_date": "1924-04-17",
                "title": "Sherlock Jr.",
                "video": false,
                "vote_average": 8.1,
                "vote_count": 1071,
                "character": "Girl's Father / Man on Film Screen",
                "credit_id": "52fe4297c3a36847f802aafd",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Joseph Hallie Keaton (July 6, 1867 – January 13, 1946) was an American vaudeville performer and silent film actor. He was the father of actor Buster Keaton and appeared with his son in several films.\n\nKeaton was born a few miles south of Terre Haute, Indiana, to Libbie Jane and Joseph Francis Keaton IV. Leaving home in 1889, the year of the Land Rush, he homesteaded in the Oklahoma territory for a time, securing a claim three and a half miles northwest of Edmond. A few months into Keaton's residency, the neighboring homesteader (a Canadian whom Keaton had befriended on their shared journey west) was murdered and partially buried by a claim jumper; the body was subsequently discovered, and \"justice was meted out\" to the murderer by Keaton and a group of three or four men that included Robert Galbreath Jr.\n\nOn May 31, 1894, Joe Keaton eloped with Myra Edith Cutler, who became known as Myra Keaton. Myra performed with Joe in a vaudeville act called the Two Keatons. Joe and Myra's first child was Joseph Frank Keaton, who became known as the silent film actor Buster Keaton; their other children were Harry Keaton and Louise Keaton.\n\nWhen Buster was only a few years old, he joined the act, which became the Three Keatons. The act was a rough-and-tumble one, with Buster being thrown around on stage most of the time. As the years went by, Joe Keaton became an alcoholic; when Buster was 21, Myra left him, taking Buster with her. However, after Buster found success in silent film, he supported Joe and gave him small parts in several movies. Myra and Joe reunited, but eventually split up again. He lived alone in a Hollywood hotel for many years. He stopped drinking with the help of a girlfriend who was a Christian Scientist.\n\nJoe Keaton died on January 13, 1946, at his home in Hollywood after a long illness, according to the New York Times. However, Buster later said he was hit by a car, and state death records show that he died in Ventura. He was buried in Inglewood Cemetery in Inglewood, California, in an unmarked grave. In 2018, Keaton fans around the world raised the necessary funds and had the grave marked with a headstone.",
        "birthday": "1867-07-06",
        "deathday": "1946-01-13",
        "gender": 2,
        "homepage": null,
        "id": 10530,
        "imdb_id": "nm0444172",
        "known_for_department": "Acting",
        "name": "Joe Keaton",
        "place_of_birth": "Terre Haute, Indiana, USA",
        "popularity": 0.9193,
        "profile_path": "/jCPa5FUv7izUmOekWPPd5bQJ8kh.jpg"
    }
}