{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rqnOgJWvlURkcOWfGqiACvkTAqG.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 14811,
                "original_language": "en",
                "original_title": "Fiddler on the Roof",
                "overview": "In a pre-revolutionary Russia, a poor Jewish milkman struggles with the challenges of a changing world as his daughters fall in love and antisemitism grows.",
                "popularity": 3.8019,
                "poster_path": "/v65PHx7Q6Jx0anyNeUOX07SJic9.jpg",
                "release_date": "1971-11-03",
                "title": "Fiddler on the Roof",
                "video": false,
                "vote_average": 7.73,
                "vote_count": 605,
                "character": "Fyedka",
                "credit_id": "52fe461c9251416c7506d6f3",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Raymond Lovelock"
        ],
        "biography": "Ray Lovelock was born on June 19, 1950 in Rome, Italy to an Italian mother and English father.  Ray first became interested in acting while attending college as a teenager. He began as an extra in both movies and TV commercials to make extra money. An acting agent discovered Ray performing in the Roman nightclub The Piper. This lead to his first role in Djanjo Kill. It was his part in Bandits in Milan that launched his acting career. He appeared as David in the eerie Queens of Evil, George in  The Living Dead at the Manchester Morgue, Edgar in Autopsy, and Aldo in Terror. He also had a recurring role as Hans Rudolf in the TV series Incantesimo.\n\nHis wife Gioai is also his agent. They met in 1968 and got married in 1970. Their daughter Francesca Romana Lovelock was born in 1971 and works as an assistant director in Naples. An avid soccer lover, Ray Lovelock serves as the captain of an Italian actors soccer team who play soccer matches to raise money for charity.",
        "birthday": "1950-06-19",
        "deathday": "2017-11-10",
        "gender": 2,
        "homepage": null,
        "id": 105337,
        "imdb_id": "nm0522590",
        "known_for_department": "Acting",
        "name": "Ray Lovelock",
        "place_of_birth": "Rome, Lazio, Italy",
        "popularity": 0.6522,
        "profile_path": "/uZQa8foSrVLnTaBc3oQflriMawl.jpg"
    }
}