{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sGKUhw88FMH5gfz0E6BK2YOZ5se.jpg",
                "genre_ids": [
                    36,
                    18
                ],
                "id": 82695,
                "original_language": "en",
                "original_title": "Les Misérables",
                "overview": "An adaptation of the successful stage musical based on Victor Hugo's classic novel set in 19th-century France. Jean Valjean, a man imprisoned for stealing bread, must flee a relentless policeman named Javert. The pursuit consumes both men's lives, and soon Valjean finds himself in the midst of the student revolutions in France.",
                "popularity": 6.8937,
                "poster_path": "/6CuzBs2Lb8At7qQr64mLXg2RYRb.jpg",
                "release_date": "2012-12-18",
                "title": "Les Misérables",
                "video": false,
                "vote_average": 7.315,
                "vote_count": 5417,
                "character": "Ensemble Factory Women",
                "credit_id": "52fe486d9251416c9108c275",
                "order": 122
            },
            {
                "adult": false,
                "backdrop_path": "/kfofK4GzJsJZhCShqZY438c8Y4Y.jpg",
                "genre_ids": [
                    35,
                    12,
                    10751
                ],
                "id": 116149,
                "original_language": "en",
                "original_title": "Paddington",
                "overview": "A young Peruvian bear travels to London in search of a home. Finding himself lost and alone at Paddington Station, he meets the kindly Brown family, who offer him a temporary haven.",
                "popularity": 6.4265,
                "poster_path": "/wpchRGhRhvhtU083PfX2yixXtiw.jpg",
                "release_date": "2014-11-24",
                "title": "Paddington",
                "video": false,
                "vote_average": 7.114,
                "vote_count": 3989,
                "character": "Master Gruber's Aunt",
                "credit_id": "55e419c292514137e9003464",
                "order": 18
            },
            {
                "adult": false,
                "backdrop_path": "/pQQggUuDMleFSl2tQYxzTmKIiLU.jpg",
                "genre_ids": [
                    12,
                    9648,
                    80
                ],
                "id": 497582,
                "original_language": "en",
                "original_title": "Enola Holmes",
                "overview": "While searching for her missing mother, intrepid teen Enola Holmes uses her sleuthing skills to outsmart big brother Sherlock and help a runaway lord.",
                "popularity": 7.786,
                "poster_path": "/riYInlsq2kf1AWoGm80JQW5dLKp.jpg",
                "release_date": "2020-09-23",
                "title": "Enola Holmes",
                "video": false,
                "vote_average": 7.247,
                "vote_count": 6270,
                "character": "Grace Whitting",
                "credit_id": "5f6baaee6517d60037d4e10e",
                "order": 26
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Mary grew up in Zimbabwe  and came to London to train. She has been acting in film, television and theatre since 1980, and teaching alongside her acting work for 10 years.  Recent acting with the acclaimed film directors Mike Leigh and Joanna Hogg led to Mary teaching improvisation for film at several drama schools in London.\n\nFilm work includes –  Testament of Youth (James Kent), The Riot Club (Lone Scherfig), Paddington (Paul King), Woman in Black Angel of Death (Tom Harper) Exhibition (Joanna Hogg), Les Miserables (Tom Hooper), Suspension of Disbelief (Mike Figgis), Chatroom (Hideo Nakata), Unrelated (Joanna Hogg – Guardian & Evening Standard award for best first film, Independent Film Critic’s Award for best film), Topsy Turvy (Mike Leigh).\n\nTV work includes – War & Peace, Partners in Crime, The Casual Vacancy, Whitechapel, Holby City, Great Expectations, The Crimson Petal and the White, Canoe Man, Antiques Rogue Show, The Thieving Headmistress, George Orwell A Life in Pictures, The Rector’s Wife, Frank Stubbs, Lovejoy, Sorry!\n\nTheatre includes playing lead roles in Repertory Theatres all over UK. London work includes “Aunt Dan & Lemon” Royal Court, Olive Oyl in “Popeye” Arts Theatre, Maria in “Twelfth Night” for  Regents Park, “Trilby & Svengali” for Shared Experience at Lyric Hammersmith, 2 years of work for Mike Alfreds at Sadlers Wells, and experimental improvised work with David Gale & David Glass Ensemble.",
        "birthday": "1959-06-12",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.screenacting.co.uk/our-tutors/mary-roscoe/",
        "id": 105440,
        "imdb_id": "nm0741192",
        "known_for_department": "Acting",
        "name": "Mary Roscoe",
        "place_of_birth": "Harare,Zimbabwe",
        "popularity": 0.4356,
        "profile_path": "/92Ec3yY8zyDrgifreAMPXkeMHQE.jpg"
    }
}