{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6Zo212BjDdDMqRIqcaiWXn10hty.jpg",
                "genre_ids": [
                    28,
                    36,
                    18
                ],
                "id": 37472,
                "original_language": "cn",
                "original_title": "葉問2",
                "overview": "Having defeated the best fighters of the Imperial Japanese army in occupied Shanghai, Ip Man and his family settle in post-war Hong Kong. Struggling to make a living, Master Ip opens a kung fu school to bring his celebrated art of Wing Chun to the troubled youth of Hong Kong. His growing reputation soon brings challenges from powerful enemies, including pre-eminent Hung Gar master, Hung Quan.",
                "popularity": 0.6589,
                "poster_path": "/aC5nwtbadmJqvl4eVCJPno16Mx5.jpg",
                "release_date": "2010-04-29",
                "title": "Ip Man 2",
                "video": false,
                "vote_average": 7.459,
                "vote_count": 2373,
                "character": "Tsui Sai-Cheong",
                "credit_id": "56f2271b925141553f000314",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            " 釋小龍 ",
            "Siu Lung Sik",
            "Sik Siu-Lung",
            "释小龙",
            "Shi Xiaolong"
        ],
        "biography": "Ashton Chen Xiaolong, also known by his stage name Shi Xiaolong (Chinese: 释小龙), is a Chinese actor and martial artist. He has been a disciple of Shi Yongxin, the current abbot of Shaolin Temple, since he was two years old. Originally named \"Chen Xiaolong\", Chen was given a dharma name - Shi Xiaolong - by the abbot. He was taught martial arts by his father and Shi Yongxin at a young age. He gained attention in the entertainment industry after his performance at the International Shaolin Kung Fu Festival in Zhengzhou at the age of four. He became a child actor in China and achieved great success in films such as the 1994 martial arts comedy Shaolin Popey II: Messy Temple. In 2003, he stopped acting and went to study in the United States. In 2005, he returned to China and starred as Zhan Zhao in the television series Young Justice Bao III. In 2007, he continued his studies in the United States and graduated from high school in 2008 from the prestigious Performing Children's School (PCS) in New York City. He has continued his acting career in China since then. In 2010, Chen played one of Ip Man's students in the martial arts film Ip Man 2.",
        "birthday": "1988-01-06",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1054335,
        "imdb_id": "nm0797679",
        "known_for_department": "Acting",
        "name": "Ashton Chen",
        "place_of_birth": "Zhengzhou, Henan, China ",
        "popularity": 0.9165,
        "profile_path": "/v4WAFHLVHkEO3Rvcq6lMxI5Bfhl.jpg"
    }
}