{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kIBBeb94FbNfLSljeFUxUoszflb.jpg",
                "genre_ids": [
                    18,
                    10752,
                    36
                ],
                "id": 17295,
                "original_language": "it",
                "original_title": "La battaglia di Algeri",
                "overview": "Paratrooper commander Colonel Mathieu, a former French Resistance fighter during World War II, is sent to Algeria to reinforce efforts to squelch the uprisings of the Algerian War. There he faces Ali la Pointe, a former petty criminal who, as the leader of the Algerian Front de Liberation Nationale, directs terror strategies against the colonial French government occupation. As each side resorts to ever-increasing brutality, no violent act is too unthinkable.",
                "popularity": 2.1462,
                "poster_path": "/2p3AFtOHFvP6OeVMqlnL1zLKOqL.jpg",
                "release_date": "1966-09-08",
                "title": "The Battle of Algiers",
                "video": false,
                "vote_average": 7.872,
                "vote_count": 826,
                "character": "Halima",
                "credit_id": "52fe47169251416c7508d563",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Fusia El Kader ",
            "Fouzia Menaceri",
            "فوزية مناصري"
        ],
        "biography": "Fouzia Menaceri (فوزية مناصري), born Fouzia El Kader in 1940 and died September 10, 2019, is an Algerian actress.\n\nShe was 25 years old, in 1966, when she was spotted by the film crew of Gillo Pontecorvo's film \"The Battle of Algiers\", to play the role of Hassiba Ben Bouali, one of the heroines of the Battle of the Casbah d 'Algiers alongside Brahim Hadjadj, Jean Martin, Yacef Saadi, Rouiched.. The action of the film \"The Battle of Algiers\" takes place in 1957, in Algeria, the people, supported by the FLN, revolt against the French occupier. On both sides, extreme methods are used: torture by the French army and the poor man's war, terrorism by Algerians in revolt against the power in place. The war will spare no one. In the Casbah district of Algiers, a former delinquent, Ali La Pointe, refuses to stop the fighting, even when the situation seems desperate. For his part, Colonel Mathieu tries as best he can to carry out his mission, even if it means resorting to drastic means... The film won the Golden Lion at the Venice Film Festival in 1966.\n\nAfter the success of the film, the dazzling notoriety for the cast mainly made up of non-professionals, and despite the encouragement of Gillo Pontecorvo the young actress did not continue her career. She will reappear in interviews in the documentaries dedicated to the 50th anniversary of the cult film. She died on Tuesday September 10, 2019 in Algiers, at the age of 79.",
        "birthday": "1940-01-01",
        "deathday": "2019-09-10",
        "gender": 1,
        "homepage": "https://www.spla.pro/fr/fiche.personnes.spla.56368.html",
        "id": 1055191,
        "imdb_id": "nm0252678",
        "known_for_department": "Acting",
        "name": "Fouzia El Kader",
        "place_of_birth": "Algiers, Algeria",
        "popularity": 0.177,
        "profile_path": "/7hJkCgyubDlc4CDaFW4XduXp3qy.jpg"
    }
}