{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xyXmtuvsoM5J3yNad0nvcetpBdY.jpg",
                "genre_ids": [
                    12,
                    14,
                    28
                ],
                "id": 49051,
                "original_language": "en",
                "original_title": "The Hobbit: An Unexpected Journey",
                "overview": "Bilbo Baggins, a hobbit enjoying his quiet life, is swept into an epic quest by Gandalf the Grey and thirteen dwarves who seek to reclaim their mountain home from Smaug, the dragon.",
                "popularity": 16.5982,
                "poster_path": "/yHA9Fc37VmpUA5UncTxxo3rTGVA.jpg",
                "release_date": "2012-12-12",
                "title": "The Hobbit: An Unexpected Journey",
                "video": false,
                "vote_average": 7.362,
                "vote_count": 18991,
                "character": "Lindir",
                "credit_id": "52fe4783c3a36847f8139fb9",
                "order": 32
            },
            {
                "adult": false,
                "backdrop_path": "/2u7zbn8EudG6kLlBzUYqP8RyFU4.jpg",
                "genre_ids": [
                    12,
                    14,
                    28
                ],
                "id": 122,
                "original_language": "en",
                "original_title": "The Lord of the Rings: The Return of the King",
                "overview": "As armies mass for a final battle that will decide the fate of the world--and powerful, ancient forces of Light and Dark compete to determine the outcome--one member of the Fellowship of the Ring is revealed as the noble heir to the throne of the Kings of Men. Yet, the sole hope for triumph over evil lies with a brave hobbit, Frodo, who, accompanied by his loyal friend Sam and the hideous, wretched Gollum, ventures deep into the very dark heart of Mordor on his seemingly impossible quest to destroy the Ring of Power.​",
                "popularity": 23.019,
                "poster_path": "/rCzpDGLbOoPwLjy3OAm5NUPOTrC.jpg",
                "release_date": "2003-12-17",
                "title": "The Lord of the Rings: The Return of the King",
                "video": false,
                "vote_average": 8.489,
                "vote_count": 25451,
                "character": "Elf Escort",
                "credit_id": "5b53abbe0e0a26232701c21c",
                "order": 34
            },
            {
                "adult": false,
                "backdrop_path": "/z51Wzj94hvAIsWfknifKTqKJRwp.jpg",
                "genre_ids": [
                    12,
                    14,
                    28
                ],
                "id": 120,
                "original_language": "en",
                "original_title": "The Lord of the Rings: The Fellowship of the Ring",
                "overview": "Young hobbit Frodo Baggins, after inheriting a mysterious ring from his uncle Bilbo, must leave his home in order to keep it from falling into the hands of its evil creator. Along the way, a fellowship is formed to protect the ringbearer and make sure that the ring arrives at its final destination: Mt. Doom, the only place where it can be destroyed.",
                "popularity": 27.0563,
                "poster_path": "/6oom5QYQ2yQTMJIbnvbkBL9cHo6.jpg",
                "release_date": "2001-12-18",
                "title": "The Lord of the Rings: The Fellowship of the Ring",
                "video": false,
                "vote_average": 8.425,
                "vote_count": 26375,
                "character": "Figwit (uncredited)",
                "credit_id": "5f546a968d2f8d0037c535ef",
                "order": 48
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Rhymenoceros"
        ],
        "biography": "Bret Peter Tarrant McKenzie (born 29 June 1976 in Wellington, New Zealand) is a comedian, actor, musician and producer, best known for being one half of the musical comedy duo Flight of the Conchords along with Jemaine Clement. In the 2000s, the duo's comedy and music became the basis of a BBC radio series and then an oft-lauded American television series, which aired for two seasons on HBO. Active since 1998, the duo released their most recent comedy special, Live in London, in 2018.\n\nPrimarily a musician, McKenzie has worked as a songwriter and music supervisor for film and television since the 2010s. He served as music supervisor for two Muppet films, The Muppets (2011) and Muppets Most Wanted (2014), the former of which won him an Academy Award for Best Original Song for the song \"Man or Muppet\". In the 2000s, McKenzie was part of reggae fusion band The Black Seeds and Wellington International Ukulele Orchestra, and, in the 2010s, he began performing solo material. His debut album Songs Without Jokes was released in August 2022.\n\nAs an actor, he portrayed elves in Peter Jackson's The Lord of the Rings and The Hobbit film trilogies: in the first he remained unnamed with fans naming him Figwit, a character originally cast as an extra who gained attention thanks to the trilogy's fan community. He later appears in The Hobbit as Lindir, a minor character who originally appears in the book of The Fellowship of the Ring.",
        "birthday": "1976-06-29",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 105584,
        "imdb_id": "nm1235366",
        "known_for_department": "Acting",
        "name": "Bret McKenzie",
        "place_of_birth": "Wellington, New Zealand",
        "popularity": 0.1428,
        "profile_path": "/xnoo95JB2XLdHbsYWHfUL7WkpIW.jpg"
    }
}