{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/nKwGUiqPdNf47XFjlbR5IFwAaOL.jpg",
                "genre_ids": [
                    12,
                    36,
                    10752
                ],
                "id": 947,
                "original_language": "en",
                "original_title": "Lawrence of Arabia",
                "overview": "The story of British officer T.E. Lawrence's mission to aid the Arab tribes in their revolt against the Ottoman Empire during the First World War. Lawrence becomes a flamboyant, messianic figure in the cause of Arab unity but his psychological instability threatens to undermine his achievements.",
                "popularity": 6.3976,
                "poster_path": "/AiAm0EtDvyGqNpVoieRw4u65vD1.jpg",
                "release_date": "1962-12-11",
                "title": "Lawrence of Arabia",
                "video": false,
                "vote_average": 7.994,
                "vote_count": 3214,
                "character": "Majid",
                "credit_id": "52fe4291c3a36847f8028fd1",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "جميل راتب",
            "Gamil Rateb",
            "Gameel Abu-Bakr Raateb"
        ],
        "biography": "Born Gameel Abu-Bakr Raateb (November 1928 – Cairo) is an Egyptian actor. In 1940s, Gameel first appeared in the film “Al-forsaan al-thalaatha i.e. The three musketeers”, his family refused the idea and his scenes were removed. Raateb traveled to Paris to study Law and Economy, yet he preferred studying Theatre and appeared in Shakespeare’s “Much ado without nothing (1947)”. To provide living expenses, Gameel worked in small jobs besides acting and then became a notable member of the “Comédie Française”. American filmmaker Carol Reed presented Gameel Raateb in “Trapeze (1956)” along with Burt Lancaster, Tony Curtis and Gina Lollobrigida. Gameel also showed in many TV series like; “Rehlat al-million i.e. The journey to be a millionaire” and “Sonbol ba’d al-million i.e. Sonbol..a millionaire”. He played the villain his unique way and excelled in authoritarian and aristocrat roles especially with Faaten Hamaama in “Hekaaya waraa koll baab i.e. A story behind every door”.",
        "birthday": "1926-08-18",
        "deathday": "2018-09-19",
        "gender": 2,
        "homepage": null,
        "id": 105634,
        "imdb_id": "nm0711633",
        "known_for_department": "Acting",
        "name": "Gamil Ratib",
        "place_of_birth": "Cairo, Egypt",
        "popularity": 0.1377,
        "profile_path": "/9ZNYtVH3LAq5UtGVnyPZvoKqlSp.jpg"
    }
}