{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lO5c0zG8s1dBPHcRparpNlNGWU9.jpg",
                "genre_ids": [
                    18
                ],
                "id": 394117,
                "original_language": "en",
                "original_title": "The Florida Project",
                "overview": "The story of a precocious six year-old and her ragtag group of friends whose summer break is filled with childhood wonder, possibility and a sense of adventure while the adults around them struggle with hard times.",
                "popularity": 3.6,
                "poster_path": "/bnSTP1PY2fDyat0eUa4QouuGV7F.jpg",
                "release_date": "2017-10-06",
                "title": "The Florida Project",
                "video": false,
                "vote_average": 7.429,
                "vote_count": 2947,
                "character": "Officer Gary",
                "credit_id": "591a5be692514159c105fdd8",
                "order": 44
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Gary was born in Louisville, Kentucky and he grew up in Lakeland, Florida. He has spent the last 30 years working at the Lakeland Police Department with his last assignment as the official spokesperson for the police department. He got his big break in 2009 as a Police Technical Advisor on the set of the film \"Endure\", the Polk-based crime thriller written and directed by Joe O'Brien. As a consultant for the film starring Judd Nelson, Devon Sawa and Tom Arnold, he put his knowledge to work and even ended up as a featured extra in the film.\n\nGary continued to work full time as Police Sergeant, Public Information Officer while working part-time in the film/TV industry mostly as a police technical advisor. He has worked with the Discovery Channel on several on crime syndicate series and local production companies on various commercials.\n\nRoles in more indies followed, including The Breaking Point (2014), Two days (2016) and Turnaround (2017). By now, Gary had built a reliable reputation for playing a cop and he continues to amass a diverse body of film and television work, challenging himself with each role.\n\nGary has been a featured extra on several films highlighting his acting ability such as in \"Frank vs God\" featuring Henry Ian Cusick who is known for his role as Desmond Hume on the U.S. television series Lost, for which he received a Primetime Emmy Award nomination. In 2016, Gary was also featured in Sean Baker's film, The Florida Project staring alongside Willem Dafoe.\n\nGary was a consultant in both of these films. Gary's aim is simple; to provide the film/TV industry with the best technical advice, maintain the authenticity and realism of their production while respecting the creative process of film making.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1056735,
        "imdb_id": "nm3140021",
        "known_for_department": "Acting",
        "name": "Gary B. Gross",
        "place_of_birth": "Louisville, Kentucky, USA",
        "popularity": 0.2186,
        "profile_path": "/zlPOfFOygIZfCAqWUTcBDTCQI0u.jpg"
    }
}