{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ft8WRF2xqEwwGWa59naDUybKTAx.jpg",
                "genre_ids": [
                    18,
                    10752,
                    10749
                ],
                "id": 770,
                "original_language": "en",
                "original_title": "Gone with the Wind",
                "overview": "The spoiled daughter of a Georgia plantation owner conducts a tumultuous romance with a cynical profiteer during the American Civil War and Reconstruction Era.",
                "popularity": 7.332,
                "poster_path": "/lNz2Ow0wGCAvzckW7EOjE03KcYv.jpg",
                "release_date": "1939-12-15",
                "title": "Gone with the Wind",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 4191,
                "character": "Belle Watling",
                "credit_id": "52fe4274c3a36847f801fe95",
                "order": 24
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "オナ・マンソン",
            "Owena Elizabeth Wolcott"
        ],
        "biography": "Ona Munson (June 16, 1903 – February 11, 1955) was an American  actress perhaps best known for her portrayal of prostitute Belle Watling in Gone with the Wind (1939).\n\nShe first came to fame on Broadway as the singing and dancing ingenue in the original production of No, No, Nanette. From this, Munson had a very successful stage and radio career in 1930s in New York. She introduced the song \"You're the Cream in My Coffee\" in the 1927 Broadway musical Hold Everything.\n\nHer first starring role was in a Warner Brothers talkie called Going Wild (1930). Originally this film was intended as musical but all the numbers were removed prior to release due to the public's distaste for musicals which had virtually saturated the cinema in 1929-1930. Munson appeared the next year in a musical comedy called Hot Heiress in which she sings several songs along with her co-star Ben Lyon. She also starred in Broadminded (1931) and Five Star Final (1931). She briefly retired from the screen, only to return in 1938.\n\nWhen David O. Selznick was casting his production Gone with the Wind, he first announced that Mae West was to play Belle, but this was a publicity stunt. Tallulah Bankhead refused the role as too small. Munson herself was the antithesis of the voluptuous Belle: freckled and of slight build. But her skills as an actress electrified her screen test: it was all in the voice. She spoke deep and throaty in her test, and her voice conveyed sexiness and worldliness. The rest could be remedied by the wardrobe and makeup departments.\n\nMunson’s career was stalemated by the acclaim of Gone with the Wind; for the remainder of her career, she was typecast in similar roles. Two years later, she played a huge role as another madam, albeit a Chinese one, in Josef von Sternberg's film noir The Shanghai Gesture.\n\nFor her contribution to the motion picture industry, Ona Munson has a star on the Hollywood Walk of Fame at 6211 Hollywood Boulevard.\n\nMunson was married three times, to actor and director Edward Buzzell in 1927, to Stewart McDonald in 1941, and designer Eugene Berman in 1949.\n\nIn 1955, plagued by ill health, she committed suicide at the age of 51 with an overdose of barbiturates in her apartment in New York. A note found next to her deathbed read, \"This is the only way I know to be free again...Please don't follow me.\"",
        "birthday": "1903-06-16",
        "deathday": "1955-02-11",
        "gender": 1,
        "homepage": null,
        "id": 105797,
        "imdb_id": "nm0613262",
        "known_for_department": "Acting",
        "name": "Ona Munson",
        "place_of_birth": "Portland, Oregon, USA",
        "popularity": 0.6487,
        "profile_path": "/cnsCfYGtTGjTYh50ZbBo7rql61c.jpg"
    }
}