{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yFZG86Zvdy6JuIlMW9eHxlVkct5.jpg",
                "genre_ids": [
                    16,
                    28,
                    12,
                    14,
                    878
                ],
                "id": 413594,
                "original_language": "ja",
                "original_title": "劇場版 ソードアート・オンライン -オーディナル・スケール-",
                "overview": "In 2026, four years after the infamous Sword Art Online incident, a revolutionary new form of technology has emerged: the Augma, a device that utilizes an Augmented Reality system. Unlike the Virtual Reality of the NerveGear and the Amusphere, it is perfectly safe and allows players to use it while they are conscious, creating an instant hit on the market. The most popular application for the Augma is the game Ordinal Scale, which immerses players in a fantasy role-playing game with player rankings and rewards.  Following the new craze, Kirito's friends dive into the game, and despite his reservations about the system, Kirito eventually joins them. While at first it appears to be just fun and games, they soon find out that the game is not all that it seems...",
                "popularity": 4.319,
                "poster_path": "/2szdEK0Mr0RG0nWGFVTseNQHbnP.jpg",
                "release_date": "2017-02-18",
                "title": "Sword Art Online: The Movie – Ordinal Scale",
                "video": false,
                "vote_average": 7.695,
                "vote_count": 711,
                "character": "Yuna (voice)",
                "credit_id": "644199c3fcec2e04bdd90ca1",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "神田 沙也加 ",
            "かんだ さやか",
            "SAYAKA",
            "ALICE",
            "ALICes",
            "アリセス",
            "Kanda Sayaka"
        ],
        "biography": "Born in Tokyo in 1986.\n\nWhile attending school in Los Angeles in 1999, she appeared in the short film \"Bean Cake\" directed by David Greenspan. The film won the Palme d'Or (highest award) for short films at the 54th Cannes Film Festival in 2001. She debuted as SAYAKA in 2001. Since then, she has attracted attention for her work in the commercial \"Ice no Mi,\" the theme song for the drama \"ever since,\" the heroine of the movie \"Dragon Head,\" and the stage play \"INTO THE WOODS.\" Since then, she has been active in commercials, movies, dramas, stage plays, and musicals, focusing on her singing career, and in December 2006, she changed her stage name from SAYAKA to her real name, Sayaka Kanda. Since then, she has been active mainly in stage plays and musicals. She has performed in hit productions such as \"The Tale of Murasaki Shikibu,\" \"A Midsummer Night's Dream,\" \"The Woman in White,\" \"Dream Person,\" \"Grease,\" \"Les Miserables,\" \"She Loves Me,\" \"Gekidan Shinkansen Rose and Samurai ~ GoemonRock OverDrive,\" \"Peter Pan,\" and \"The Fantasticks.\" She is currently attracting a lot of attention as a talented actress.",
        "birthday": "1986-10-01",
        "deathday": "2021-12-18",
        "gender": 1,
        "homepage": "http://www.sayaka-kanda.net",
        "id": 1057409,
        "imdb_id": "nm1665832",
        "known_for_department": "Acting",
        "name": "Sayaka Kanda",
        "place_of_birth": "Setagaya, Tokyo, Japan",
        "popularity": 0.7951,
        "profile_path": "/8lDihENN1FL3Wkblhi9nCraYTMy.jpg"
    }
}