{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8P6ZGneM8xgycqqtno72xPuzxaQ.jpg",
                "genre_ids": [
                    12,
                    18
                ],
                "id": 203819,
                "original_language": "en",
                "original_title": "Tracks",
                "overview": "Accompanied only by her faithful dog and four camels, an Australian satisfies her craving for solitude by embarking on a solo trip across the desert from Alice Springs to the Indian Ocean.",
                "popularity": 0.0943,
                "poster_path": "/qDSA80DC8BmBrErQsiL23qwoeCw.jpg",
                "release_date": "2013-12-19",
                "title": "Tracks",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 541,
                "character": "Marg",
                "credit_id": "564514b0c3a36870e0006b00",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Emma Booth (born c. 1982) is an Australian model-turned-actress. Coming from Perth in Western Australia, the former teen model and TV star has recently achieved international stardom with a main role in the film Introducing the Dwights opposite Brenda Blethyn. Frequently referred to as the \"next big thing\" from Australia after Clubland (North American title of Introducing the Dwights) was screened at the Sundance Film Festival, many talent agencies solicited her for roles in upcoming films.\n\nAs a result, in 2008 she appeared in the horror film Blood Creek to be directed by Joel Schumacher. She will also be appearing in Hippie Hippie Shake with Cillian Murphy and Sienna Miller, an account of the Schoolkids OZ obscenity trials in Great Britain.\n\nCurrently, she is working on the film The Wrong Girl, an Australian true-life drama about a teen who had been raped by a notorious Sydney gang and her four-year struggle for justice, written by award-winning screenwriter Nicholas Hammond and directed by Michael Jenkins.",
        "birthday": "1982-11-28",
        "deathday": null,
        "gender": 1,
        "homepage": "https://shanahan.com.au/client/emma-booth/",
        "id": 105838,
        "imdb_id": "nm1134439",
        "known_for_department": "Acting",
        "name": "Emma Booth",
        "place_of_birth": "Perth, Western Australia, Australia",
        "popularity": 0.3576,
        "profile_path": "/9mxCaOgYPeXN2DtbjaKHIreiZNS.jpg"
    }
}