{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3tWw50B1xXlCnJ9A7NX4nNzZF4j.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 350,
                "original_language": "en",
                "original_title": "The Devil Wears Prada",
                "overview": "Andy moves to New York to work in the fashion industry. Her boss is extremely demanding, cruel and won't let her succeed if she doesn't fit into the high class elegant look of their magazine.",
                "popularity": 11.0124,
                "poster_path": "/8912AsVuS7Sj915apArUFbv6F9L.jpg",
                "release_date": "2006-06-29",
                "title": "The Devil Wears Prada",
                "video": false,
                "vote_average": 7.393,
                "vote_count": 12508,
                "character": "Serena",
                "credit_id": "5f502e3ec5840d0039794a4a",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Gisele Caroline Bündchen",
            "ژیزل بوندشن"
        ],
        "biography": "Gisele Caroline Bündchen (born 20 July 1980) is a Brazilian fashion model, occasional film actress and goodwill ambassador for the UN Environment Programme.\n\nIn the late 1990s, Bündchen became one of the first in a wave of Brazilian models to find success. In 1999, Vogue magazine dubbed her \"The Return of the Sexy Model\" and she was credited with ending the \"heroin chic\" era of modeling.\n\nBündchen was one of Victoria's Secret Angels from 2000 until 2006. Since 2004, she has been the highest-paid model in the world and the sixteenth richest woman in the entertainment industry with an estimated $70 million fortune. Models Claudia Schiffer and Naomi Campbell have argued that Bündchen is the only true remaining \"supermodel\" and according to Forbes she may become the world's first ever billionaire supermodel.\n\nAs an occasional actress, she had supporting roles in Taxi (2004) and The Devil Wears Prada (2006).\n\nFrom 2000 to 2005, Bündchen was in a much-publicized relationship with American actor Leonardo DiCaprio. She married New England Patriots quarterback Tom Brady in 2009.",
        "birthday": "1980-07-20",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.giselebundchen.com.br",
        "id": 10583,
        "imdb_id": "nm1014528",
        "known_for_department": "Acting",
        "name": "Gisele Bündchen",
        "place_of_birth": "Horizontina, Rio Grande do Sul, Brazil",
        "popularity": 0.4635,
        "profile_path": "/rXPQOeTQRtBoSVfrqEfVE6hS2xF.jpg"
    }
}