{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/scQf03Fm3jeyv4FH04qvi4fp4wh.jpg",
                "genre_ids": [
                    80,
                    35,
                    28
                ],
                "id": 402900,
                "original_language": "en",
                "original_title": "Ocean's Eight",
                "overview": "Debbie Ocean, a criminal mastermind, gathers a crew of female thieves to pull off the heist of the century at New York's annual Met Gala.",
                "popularity": 9.568,
                "poster_path": "/MvYpKlpFukTivnlBhizGbkAe3v.jpg",
                "release_date": "2018-06-07",
                "title": "Ocean's Eight",
                "video": false,
                "vote_average": 6.968,
                "vote_count": 8525,
                "character": "Heidi Klum",
                "credit_id": "5b1b76c90e0a261f9f01b04d",
                "order": 98
            },
            {
                "adult": false,
                "backdrop_path": "/3tWw50B1xXlCnJ9A7NX4nNzZF4j.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 350,
                "original_language": "en",
                "original_title": "The Devil Wears Prada",
                "overview": "Andy moves to New York to work in the fashion industry. Her boss is extremely demanding, cruel and won't let her succeed if she doesn't fit into the high class elegant look of their magazine.",
                "popularity": 11.0124,
                "poster_path": "/8912AsVuS7Sj915apArUFbv6F9L.jpg",
                "release_date": "2006-06-29",
                "title": "The Devil Wears Prada",
                "video": false,
                "vote_average": 7.393,
                "vote_count": 12508,
                "character": "Heidi Klum",
                "credit_id": "5f502e98439be1003268fd4a",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Χάιντι Κλουμ",
            "Heidi Samuel",
            "Heidi Kaulitz",
            "هایدی کلوم"
        ],
        "biography": "Heidi Klum (German pronunciation: [ˈhaɪ̯diː ˈklʊm];) is a German model, television personality, businesswoman, fashion designer, singer, television producer, author, and actress. She appeared on the cover of the Sports Illustrated Swimsuit Issue in 1998 and was the first German model to become a Victoria's Secret Angel.\n\nFollowing a successful modeling career, Klum became the host and a judge of Germany's Next Topmodel and the reality show Project Runway, which earned her an Emmy nomination in 2008 and a win in 2013 for Outstanding Host for a Reality or Reality-Competition Program (shared with co-host Tim Gunn). Klum has been nominated for six Emmy Awards.\n\nKlum was born and raised in Bergisch Gladbach, a town outside Cologne, West Germany. She is the daughter of Erna, a hairdresser, and Günther Klum, a cosmetics company executive. A friend convinced her to enrol in a national modelling contest called \"Model 92\". Out of 25,000 contestants, Klum was voted the winner on 29 April 1992, and offered a modelling contract worth US$300,000 by Thomas Zeumer, CEO of Metropolitan Models New York. After winning, she appeared on the Gottschalk Late Night Show, a German television show with host Thomas Gottschalk. She accepted the contract a few months later, after graduating from school, and decided not to try for an apprentice position at a fashion design school.\n\nThis page is based on a Wikipedia article written by contributors. Text is available under the CC BY-SA 4.0 license; additional terms may apply.",
        "birthday": "1973-06-01",
        "deathday": null,
        "gender": 1,
        "homepage": "https://heidiklum.de/",
        "id": 10584,
        "imdb_id": "nm0005099",
        "known_for_department": "Acting",
        "name": "Heidi Klum",
        "place_of_birth": "Bergisch Gladbach, Germany",
        "popularity": 0.7878,
        "profile_path": "/UZiPxAUSkXJsXaHTJDnlW9lqnX.jpg"
    }
}