{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9hWiNbvLR3nPDanTdEWOc4EeBGp.jpg",
                "genre_ids": [
                    35,
                    10402
                ],
                "id": 704,
                "original_language": "en",
                "original_title": "A Hard Day's Night",
                "overview": "Capturing John Lennon, Paul McCartney, George Harrison and Ringo Starr in their electrifying element, 'A Hard Day's Night' is a wildly irreverent journey through this pastiche of a day in the life of The Beatles during 1964. The band have to use all their guile and wit to avoid the pursuing fans and press to reach their scheduled television performance, in spite of Paul's troublemaking grandfather and Ringo's arrest.",
                "popularity": 2.2603,
                "poster_path": "/6Ulsccp2VkaVU5qbya3bxm9JG4x.jpg",
                "release_date": "1964-07-07",
                "title": "A Hard Day's Night",
                "video": false,
                "vote_average": 7.332,
                "vote_count": 708,
                "character": "Ringo",
                "credit_id": "52fe426dc3a36847f801dca7",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/wDln5edQPFYMeKvakkYCLUXOPRP.jpg",
                "genre_ids": [
                    18
                ],
                "id": 13920,
                "original_language": "en",
                "original_title": "Radio",
                "overview": "In the racially divided town of Anderson, South Carolina in 1976, football coach Harold Jones spots a mentally disabled African-American young man nicknamed Radio near his practice field and is inspired to befriend him. Soon, Radio is Jones' loyal assistant, and he becomes a student at T.L. Hanna High School. But things start to sour when Coach Jones begins taking guff from parents and fans who feel that his devotion to Radio is getting in the way of the team's quest for a championship.",
                "popularity": 4.7392,
                "poster_path": "/uQ6ci4iFHhB6TWB2f4wftR7AEly.jpg",
                "release_date": "2003-10-24",
                "title": "Radio",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 786,
                "character": "Stinger the Mascot (uncredited)",
                "credit_id": "62279283871b340047b50245",
                "order": 22
            },
            {
                "adult": false,
                "backdrop_path": "/rW0zvmvdjKTrYz50I1j5XjSweiy.jpg",
                "genre_ids": [
                    10402,
                    16,
                    12,
                    35,
                    14
                ],
                "id": 12105,
                "original_language": "en",
                "original_title": "Yellow Submarine",
                "overview": "The wicked Blue Meanies take over Pepperland, eliminating all color and music. As the only survivor, the Lord Admiral escapes in the yellow submarine and journeys to Liverpool to enlist the help of the Beatles.",
                "popularity": 1.815,
                "poster_path": "/1pmeLKaLFNggcsAk5FiouIvo3ST.jpg",
                "release_date": "1968-07-17",
                "title": "Yellow Submarine",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 526,
                "character": "Ringo (uncredited)",
                "credit_id": "5e96807630f79c0012d7eb19",
                "order": 9
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/uov0QRXGEaIsVGis2ttJ1ax32Kc.jpg",
                "genre_ids": [
                    18,
                    10749,
                    14
                ],
                "id": 4688,
                "original_language": "en",
                "original_title": "Across the Universe",
                "overview": "When young dockworker Jude leaves Liverpool to find his estranged father in the United States, he is swept up by the waves of change that are re-shaping the nation. Jude falls in love with Lucy, who joins the growing anti-war movement. As the body count in Vietnam rises, political tensions at home spiral out of control and the star-crossed lovers find themselves in a psychedelic world gone mad.",
                "popularity": 2.069,
                "poster_path": "/447c8Te3DXC46rQvDEixKGO4dS6.jpg",
                "release_date": "2007-09-14",
                "title": "Across the Universe",
                "video": false,
                "vote_average": 7.139,
                "vote_count": 1387,
                "credit_id": "642f4e026dea3a00f396b0d4",
                "department": "Sound",
                "job": "Songs"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Richard Starkey",
            "The Beatles",
            "ザ・ビートルズ"
        ],
        "biography": "Richard Starkey MBE (born 7 July 1940), better known by his stage name Ringo Starr, is an English musician, singer-songwriter, and actor who gained worldwide fame as the drummer for The Beatles. When the band formed in 1960, Starr was a member of another Liverpool band, Rory Storm and the Hurricanes. He became The Beatles' drummer in August 1962, taking the place of Pete Best. In addition to his contribution as drummer, Starr featured as lead vocals on a number of successful Beatles songs (in particular, \"With a Little Help from My Friends\", \"Yellow Submarine\", and The Beatles version of \"Act Naturally\"), as co-writer with the song \"What Goes On\" and primary writer with \"Don't Pass Me By\" and \"Octopus's Garden\".\n\nAs drummer for The Beatles, Starr was musically creative, and his contribution to the band's music has received high praise from notable drummers in more recent times. Starr described himself as \"your basic offbeat drummer with funny fills\", technically limited by being a left-handed person playing a right-handed kit. Drummer Steve Smith said that Starr's popularity \"brought forth a new paradigm\" where \"we started to see the drummer as an equal participant in the compositional aspect\" and that Starr \"composed unique, stylistic drum parts for The Beatles songs\". In 2011, Starr was picked as the fifth-best drummer of all-time by Rolling Stone readers, behind drummers such as John Bonham, Keith Moon and Neil Peart.\n\nStarr is the most documented and critically acclaimed actor-Beatle, playing a central role in several Beatles films, and appearing in numerous other movies, both during and after his career with The Beatles. After The Beatles' break-up in 1970, Starr achieved solo musical success with several singles and albums, and recorded with each of his fellow ex-Beatles as they too developed their post-Beatle musical careers. He has also been featured in a number of TV documentaries, hosted TV shows, and narrated the first two series of the children's television series Thomas the Tank Engine & Friends. He currently tours with the All-Starr Band.",
        "birthday": "1940-07-07",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.ringostarr.com",
        "id": 10594,
        "imdb_id": "nm0823592",
        "known_for_department": "Acting",
        "name": "Ringo Starr",
        "place_of_birth": "Liverpool, England, UK",
        "popularity": 0.3256,
        "profile_path": "/7fSrrdl90BYdR3dtOnNkosOw0kw.jpg"
    }
}