{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9hWiNbvLR3nPDanTdEWOc4EeBGp.jpg",
                "genre_ids": [
                    35,
                    10402
                ],
                "id": 704,
                "original_language": "en",
                "original_title": "A Hard Day's Night",
                "overview": "Capturing John Lennon, Paul McCartney, George Harrison and Ringo Starr in their electrifying element, 'A Hard Day's Night' is a wildly irreverent journey through this pastiche of a day in the life of The Beatles during 1964. The band have to use all their guile and wit to avoid the pursuing fans and press to reach their scheduled television performance, in spite of Paul's troublemaking grandfather and Ringo's arrest.",
                "popularity": 2.2603,
                "poster_path": "/6Ulsccp2VkaVU5qbya3bxm9JG4x.jpg",
                "release_date": "1964-07-07",
                "title": "A Hard Day's Night",
                "video": false,
                "vote_average": 7.332,
                "vote_count": 708,
                "character": "T.V. Director",
                "credit_id": "52fe426dc3a36847f801dcb7",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Vittorio Giorgio Andre Spinetti",
            "Victor Spineti"
        ],
        "biography": "Victor Sinetti (born Vittorio Giorgio Andre Spinetti) was a Welsh comedy actor, author and poet. He appeared in dozens of films and stage plays throughout his 50-year career, including the three 1960s Beatles films \"A Hard Day's Night\", \"Help!\" and \"Magical Mystery Tour\".\n\nBorn in Cwm, Ebbw Vale, Wales, Spinetti was educated at Monmouth School and the Royal Welsh College of Music and Drama in Cardiff, of which he became a Fellow. After various menial jobs, Spinetti pursued a stage career and was closely associated with Joan Littlewood's Theatre Workshop in London, England. Among the productions were \"Fings Ain't Wot They Used T'Be\" and \"Oh! What a Lovely War\" (1963), which transferred to New York City and for which he won a Tony Award. Spinetti's film career developed simultaneously; his dozens of film appearances would include Zeffirelli's \"The Taming of the Shrew\", \"Under Milk Wood\", \"The Return of the Pink Panther\" and \"Under the Cherry Moon\".\n\nDuring his later career, Spinetti acted with the Royal Shakespeare Company, in such roles as Lord Foppington in \"The Relapse\" and the Archbishop in \"Richard III\", at Stratford-upon-Avon; and, in 1990, he appeared in \"The Krays\". In 2008 he appeared in a one-man show, \"A Very Private Diary\", which toured the UK as \"A Very Private Diary ... Revisited!\", recounting his life story. Spinetti was diagnosed with prostate cancer in 2011 and died of the disease in June 2012.",
        "birthday": "1933-09-02",
        "deathday": "2012-06-19",
        "gender": 2,
        "homepage": null,
        "id": 10598,
        "imdb_id": "nm0818920",
        "known_for_department": "Acting",
        "name": "Victor Spinetti",
        "place_of_birth": "Cwm, Ebbw Vale, Monmouthshire, Wales",
        "popularity": 0.2652,
        "profile_path": "/bcanHW2duY9o0k724FhYa4D4a6h.jpg"
    }
}