{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/LTjGvAf92YLudl5zqJP9tHLuSo.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 4518,
                "original_language": "en",
                "original_title": "Elizabeth",
                "overview": "The story of the ascension to the throne and the early reign of Queen Elizabeth the First, the endless attempts by her council to marry her off, the Catholic hatred of her and her romance with Lord Robert Dudley.",
                "popularity": 6.629,
                "poster_path": "/qEk48VLOdibXFVIEzE9ETZUBcCs.jpg",
                "release_date": "1998-09-13",
                "title": "Elizabeth",
                "video": false,
                "vote_average": 7.172,
                "vote_count": 1439,
                "character": "Lady in Waiting",
                "credit_id": "59e3d96a925141085501b580",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Lily Rose Beatrice Cooper"
        ],
        "biography": "Lily Allen is a British singer, songwriter, author, actress, and businesswoman.\n\nHer music career incorporates elements of electropop, R&B, ska, and reggae.\n\nThroughout her long spanning music career, Allen has released fourth studio albums: 'It's Not Me, It's You' (2009), 'Sheezus' (2014) both records topped the UK Albums Charts and 'Alright, Still' (2006) and 'No Shame' (2018) which peaked at 2 and 8 on the United Kingdom, respectively. As well, she has topped the UK Singles Charts in three occasions, with the number #1 smash hits: 'Smile' (2006), 'The Fear' (2009), and Somewhere Only We Know (2014). She has received several recognitions for her music, including nominations for nine BRIT Awards (including one win for British Female Solo Artist in 2010), one Grammy Award nomination for Best Alternative Album (Alright, Still), three Ivor Novello Awards wins, one Mercury Prize nomination for Album Of The Year (No Shame), and twelve NME Awards (including three wins).  As an actress, Allen made her debut on the big screen on 'How to Build a Girl' (2019), and in 2021, she made her West End debut in the new play '2:22 A Ghost Story', for which she received a Laurence Olivier Award nomination for Best Actress.\n\nIn 2018, Allen released her autobiographical book, 'My Thoughts Exactly' to positive reviews, and several extracts from the book generated considerable press coverage prior to release.\n\nShe currently stars on the Sky Atlantic original comedy series, 'Dreamland' (2023–)",
        "birthday": "1985-05-02",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.lilyallenmusic.com/",
        "id": 1060422,
        "imdb_id": "nm0020770",
        "known_for_department": "Acting",
        "name": "Lily Allen",
        "place_of_birth": "Hammersmith, London, England, UK",
        "popularity": 0.2082,
        "profile_path": "/tHbYN9MxYEmgMtqMLJm4O1HUQn7.jpg"
    }
}