{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2pViauhiZLhAUb1lsY6wRir69SF.jpg",
                "genre_ids": [
                    35
                ],
                "id": 1621,
                "original_language": "en",
                "original_title": "Trading Places",
                "overview": "A snobbish investor and a wily street con-artist find their positions reversed as part of a bet by two callous millionaires.",
                "popularity": 7.9137,
                "poster_path": "/8mBuLCOcpWnmYtZc4aqtvDXslv6.jpg",
                "release_date": "1983-06-07",
                "title": "Trading Places",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 3447,
                "character": "Official #1",
                "credit_id": "58b4207cc3a368527d014d0a",
                "order": 79
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "​From Wikipedia, the free encyclopedia.  \n\nRalph Clanton (September 11, 1914 - December 29, 2002) was an American character actor. Although his name is not familiar to audiences, he did play a significant supporting role in a classic film which is revived regularly. His most often seen performance is as the Comte De Guiche in the 1950 film Cyrano de Bergerac, the first sound version in English of Edmond Rostand's classic play, and the film for which José Ferrer won his only Academy Award for Best Actor. Besides Ferrer as Cyrano, Clanton was the only holdover from the cast of the 1946 Broadway revival of the play, and would play the role of De Guiche opposite him once more, in a New York City Center production in 1953.\n\nIn addition to playing De Guiche in \"Cyrano\", Clanton was featured in seven different episodes of Alfred Hitchcock's television show, as well as making several appearances on the Hallmark Hall of Fame. In 1976, he played the role of George Washington in a PBS television production of Sidney Kingsley's The Patriots, a drama that had itself been produced on the Hallmark Hall of Fame in 1963, but without Clanton. He also played the role of Jasper Delaney on the TV soap operas, Another World and its spinoff, Somerset.\n\nHe played the role of Mr. Ingram in the sci-fi thriller The 27th Day.\n\nHe played guest star roles on numerous television series, including Perry Mason, in addition to appearing on Broadway in the role of Claude Nau in Robert Bolt's Vivat! Vivat Regina!, as well as in several Shakespeare productions. One of his last roles was a bit part in the hit Dan Aykroyd - Eddie Murphy film Trading Places, in 1983.\n\nIn a playbill for the 1946 revival of Cyrano de Bergerac he is listed as a direct descendant of members of the infamous Clanton gang, which took part in the Gunfight at the O.K. Corral\n\nDescription above from the Wikipedia article Ralph Clanton,  licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1914-09-11",
        "deathday": "2002-12-29",
        "gender": 2,
        "homepage": null,
        "id": 106005,
        "imdb_id": "nm0163404",
        "known_for_department": "Acting",
        "name": "Ralph Clanton",
        "place_of_birth": null,
        "popularity": 0.0454,
        "profile_path": "/pTwRLszCuLcc2iqO8oPJQUd72dT.jpg"
    }
}