{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zAL3LOswagN9onjN8DPcNFTqKuD.jpg",
                "genre_ids": [
                    18
                ],
                "id": 705,
                "original_language": "en",
                "original_title": "All About Eve",
                "overview": "From the moment she glimpses her idol at the stage door, Eve Harrington is determined to take the reins of power away from the great actress Margo Channing. Eve maneuvers her way into Margo's Broadway role, becomes a sensation and even causes turmoil in the lives of Margo's director boyfriend, her playwright and his wife. Only the cynical drama critic sees through Eve, admiring her audacity and perfect pattern of deceit.",
                "popularity": 2.0482,
                "poster_path": "/blBzZaatPWVuWpXEnPscMA4Xp6m.jpg",
                "release_date": "1950-11-09",
                "title": "All About Eve",
                "video": false,
                "vote_average": 8.076,
                "vote_count": 1604,
                "character": "Phoebe",
                "credit_id": "52fe426dc3a36847f801dd5b",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Barbara Jane Bates"
        ],
        "biography": "Barbara Jane Bates (August 6, 1925 – March 18, 1969) was an American singer and actress, best known for her portrayal of Phoebe in the 1950 drama film All About Eve and as Katy Morgan on It's a Great Life (1954–1956).\n\nThe eldest of three daughters, Bates was born in Denver, Colorado. While growing up in Denver, she studied ballet and worked as a teen fashion model. The shy teen was persuaded to enter a local beauty contest and won, receiving two round-trip train tickets to Hollywood, California. Two days before returning to Denver, Bates met Cecil Coan, a United Artists publicist, whom she would later marry.\n\nIn September 1944, 19-year-old Bates signed a contract with Universal Pictures after Cecil Coan introduced her to producer Walter Wanger. Soon after, she was cast as one of the \"Seven Salome Girls\" in the 1945 drama, Salome Where She Danced starring Yvonne De Carlo. Around this time, she fell in love with Coan, who was married with two sons and two daughters. In March 1945, Coan divorced his wife Helen Coan and secretly married Bates, on March 25, 1945, in Chihuahua, Mexico. Bates spent the next few years as a stock actress, landing bit parts in movies and doing cheesecake layouts for magazines such as Yank, the Army Weekly and Life. One of those photo sessions caught the eye of executives at Warner Bros., which signed her in 1947. Warner Bros. highlighted her \"girl-next-door\" image and her acting career took off. She appeared with some of the biggest stars of the day, including Bette Davis in June Bride and Danny Kaye in The Inspector General.\n\nIn late 1949, Bates auditioned for the small role of Phoebe in Fox's upcoming All About Eve. In competition for the part were Zsa Zsa Gabor and others, but Bates impressed the producers and was given the part. She made a short but important appearance as the devious schemer, Phoebe, at the end of the film. Bates's image is enshrined in the film's last scene, posing in front of a three-way mirror, while holding the award won by her idol Eve Harrington, played by Anne Baxter.  After her appearance in All About Eve, Bates co-starred in Cheaper by the Dozen, and its sequel Belles on Their Toes, with Jeanne Crain and Myrna Loy. In 1951, she landed a role opposite MacDonald Carey and Claudette Colbert in the comedy Let's Make It Legal. Fox refused to lend out Bates for the role of the suicidal ballerina saved by Charlie Chaplin's aging vaudevillian in Limelight (1952). She co-starred with Donna Reed as the love interests of Dean Martin and Jerry Lewis in the 1953 hit comedy The Caddy.\n\nIn January 1967, Bates's husband died of cancer. Devastated by his death, Bates grew more depressed, and she again became suicidal. Later that year, she returned to Denver and fell out of public view. For a time, Bates worked as a secretary, dental assistant, and hospital aide. In December 1968, she married for the second time, to a childhood friend, sportscaster William Reed. Despite her new marriage and location, Bates remained increasingly despondent and depressed.\n\nOn March 18, 1969, just months after her marriage to Reed, Barbara Bates died from suicide in her mother's garage by carbon monoxide poisoning. She was 43 years old. She is buried at Crown Hill Cemetery in Jefferson County, Colorado.",
        "birthday": "1925-08-06",
        "deathday": "1969-03-18",
        "gender": 1,
        "homepage": null,
        "id": 10611,
        "imdb_id": "nm0060845",
        "known_for_department": "Acting",
        "name": "Barbara Bates",
        "place_of_birth": "Denver, Colorado, USA",
        "popularity": 0.6663,
        "profile_path": "/tKHAPTZYYshqKMlQiETPkGX2vuL.jpg"
    }
}