{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ydF3hT1fjrM71AbNAYBZKnq6rtL.jpg",
                "genre_ids": [
                    10752,
                    18
                ],
                "id": 10015,
                "original_language": "en",
                "original_title": "Heartbreak Ridge",
                "overview": "A hard-nosed, hard-living Marine gunnery sergeant clashes with his superiors and his ex-wife as he takes command of a spoiled recon platoon with a bad attitude.",
                "popularity": 5.766,
                "poster_path": "/aMr99UigkMCTSPnLTpkzJeLmpyc.jpg",
                "release_date": "1986-12-05",
                "title": "Heartbreak Ridge",
                "video": false,
                "vote_average": 6.887,
                "vote_count": 1057,
                "character": "Profile",
                "credit_id": "52fe43089251416c75000cdd",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/vSd89kiENYeFa6mPHzsM5BgliPm.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 4032,
                "original_language": "en",
                "original_title": "My Girl",
                "overview": "Vada Sultenfuss is obsessed with death. Her mother is dead, and her father runs a funeral parlor. She is also in love with her English teacher, and joins a poetry class over the summer just to impress him. Thomas J., her best friend, is \"allergic to everything\", and sticks with Vada despite her hangups. When Vada's father hires Shelly, and begins to fall for her, things take a turn to the worse...",
                "popularity": 3.8836,
                "poster_path": "/qyJJNHteA7BUwQSey05t7qP4vRV.jpg",
                "release_date": "1991-11-27",
                "title": "My Girl",
                "video": false,
                "vote_average": 7.407,
                "vote_count": 2185,
                "character": "Justin",
                "credit_id": "5edcf96c8d52c90027a69669",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Thomas Louis \"Tom\" Villard (November 19, 1953 – November 14, 1994) was an American actor. He is known for his leading role in the 1980s series We Got It Made, as well as roles in feature films One Crazy Summer, Heartbreak Ridge, My Girl, and Popcorn.\n\nVillard was born in Waipahu, Hawaii and grew up in Spencerport, New York, the son of Diane Ruth (MacNaughton), a teacher of the emotionally handicapped, and Ronald Louis Villard, a photochemical engineer. He attended Allegheny College in Meadville, Pennsylvania, before moving to New York City to attend the Lee Strasberg Theatre and Film Institute and the American Musical and Dramatic Academy in the early 1970s. In 1980 Villard moved to Los Angeles and soon started landing roles on television and in movies. He also continued performing on stage until the end of his career.\n\nOn November 14, 1994, Villard died of AIDS-related pneumonia. He was survived by his parents, Ron and Diane Villard, twin brothers Timothy and Terry, sister Susan, and his partner Scott Chambliss.",
        "birthday": "1953-11-19",
        "deathday": "1994-11-14",
        "gender": 2,
        "homepage": null,
        "id": 106247,
        "imdb_id": "nm0898014",
        "known_for_department": "Acting",
        "name": "Tom Villard",
        "place_of_birth": "Waipahu, Hawaii, USA",
        "popularity": 0.208,
        "profile_path": "/zGuezgaC1YdQhPMpv1oA8VZa1mv.jpg"
    }
}