{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6nLdSON3ErniBZTXWG7WRqs5jGz.jpg",
                "genre_ids": [
                    14,
                    18,
                    53,
                    9648,
                    10749
                ],
                "id": 251,
                "original_language": "en",
                "original_title": "Ghost",
                "overview": "After a young man is murdered, his spirit stays behind to warn his lover of impending danger, with the help of a reluctant psychic.",
                "popularity": 7.9429,
                "poster_path": "/w9RaPHov8oM5cnzeE27isnFMsvS.jpg",
                "release_date": "1990-07-13",
                "title": "Ghost",
                "video": false,
                "vote_average": 7.226,
                "vote_count": 5775,
                "character": "Mover",
                "credit_id": "5e1a451b459ad6001435b3f3",
                "order": 22
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Martin Macka A. Foley, Jr. (Birth Name)",
            "Martin Foley"
        ],
        "biography": "Macka Foley was born on January 2, 1951 in Portland, Maine, USA as Martin Macka A. Foley, Jr., to the late Martin and Dorothy Dixie (Lee) Foley. He grew up in the West End, having attended St. Dominics School and graduating from Portland High School Class of 1969 where he was proud to have been voted most witty by his classmates. Macka was a well-known athlete and Captain of the basketball team. He enlisted in the United States Marine Corps following high school; Macka served two tours in the Vietnam War and was awarded the Purple Heart for wounds he sustained in the line of duty. Following his honorable discharge, Macka was a heavyweight boxer from 1969-1979 having had 54 professional fights. He fought bouts all over the world, and on every continent except Antarctica. He had an encyclopedic knowledge of the history of boxing and could name every champion in every division since they started recording it in this country. He moved to Los Angeles California in 1986 where he became a boxing trainer. Macka was proud of those he trained, especially his championship fighters, James Toney, Manny Pacquiao, and Brian Viloria. He also trained several actors and actresses in California, earning the recognition of being one of the best trainers in the business. For the last 10 years, Macka trained James Franco who was like a son to him. Franco recently posted on Facebook, I just heard that Macka Foley passed away. He was a boxing trainer and a saint of the sweet science. I spent years with him. He showed me that anything in life: boxing, acting or just living, is all about breathing and being relaxed in yourself. Ill never forget him. In addition to his training career, he appeared in over 500 television shows, several movies and many commercials to which he is known for his work on Ghost (1990), Parker Lewis Can't Lose (1990) and Death House (1988).  Macka was very spiritual man who considered daily meditation a very important aspect of his life. He was known for being a comical, spontaneous, and quick witted man.  He passed away unexpectedly on August 3, 2015 in Los Angeles, California, USA.",
        "birthday": "1951-01-02",
        "deathday": "2015-08-03",
        "gender": 2,
        "homepage": null,
        "id": 106282,
        "imdb_id": "nm0284190",
        "known_for_department": "Acting",
        "name": "Macka Foley",
        "place_of_birth": "Portland, Maine, USA",
        "popularity": 0.0604,
        "profile_path": "/wr7rPqRowVgnoVXdMtXjcXKRsbN.jpg"
    }
}