{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cgrQefMZspzBD2HXmZ8LYoCuN5m.jpg",
                "genre_ids": [
                    18,
                    10402
                ],
                "id": 16620,
                "original_language": "en",
                "original_title": "La Bamba",
                "overview": "Los Angeles teenager Ritchie Valens becomes an overnight rock 'n' roll success in 1958, thanks to a love ballad called \"Donna\" that he wrote for his girlfriend. But as his star rises, Valens has conflicts with his jealous brother, Bob, and becomes haunted by a recurring nightmare of a plane crash just as he begins his first national tour alongside Buddy Holly.",
                "popularity": 3.6443,
                "poster_path": "/6Znulqtc7cdqlUC69HGf26Ef5fi.jpg",
                "release_date": "1987-07-24",
                "title": "La Bamba",
                "video": false,
                "vote_average": 7.272,
                "vote_count": 744,
                "character": "Eddie Cochran",
                "credit_id": "52fe46e19251416c750868c5",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Stray Cats"
        ],
        "biography": "Brian Robert Setzer (born April 10, 1959) is an American guitarist, singer, and songwriter. He found widespread success in the early 1980s with the 1950s-style rockabilly group Stray Cats, and returned to the music scene in the early 1990s with his swing revival band, the Brian Setzer Orchestra. In 1987, he made a cameo appearance as Eddie Cochran in the film La Bamba.\n\nSetzer was born April 1959 in Massapequa, New York. He started on the euphonium and played in jazz bands when he was in school. He found a way to hear jazz at the Village Vanguard, though as he got older he became more interested in rock, punk, and rockabilly. He was a member of the Bloodless Pharaohs and the Tomcats, which he began with his brother, Gary. The Tomcats became the Stray Cats when double bassist Lee Rocker and drummer Slim Jim Phantom joined and Gary left the band. In 1980, thinking they might have more success in England than in America, they sold their instruments to pay for airplane tickets and flew to London.\n\nAfter performing in London for a few months, they met Dave Edmunds, a guitarist and record producer who shared their love of rockabilly and 1950s' rock and roll. Edmunds produced their debut album, Stray Cats (Arista, 1981), which yielded two hit singles, \"Stray Cat Strut\" and \"Rock This Town\". The second album, Gonna Ball (Arista, 1982), was less successful. The band returned to America and released Built for Speed (EMI, 1982), produced again by Dave Edmunds, with songs collected from their first two albums. Helped by their music videos on MTV, the Stray Cats became popular in America. Their next album, Rant n' Rave with the Stray Cats (EMI, 1983) produced the hit \"(She's) Sexy + 17\".\n\nThe Stray Cats disbanded in 1984, though they occasionally reunited, recorded, and toured. After recording three albums with different producers, they returned to Dave Edmunds for Choo Choo Hot Fish (1992).\n\nAfter the Stray Cats disbanded in 1984, Setzer began a solo career that included working as a sideman for other acts, such as the Honeydrippers led by Robert Plant. On his first solo album, The Knife Feels Like Justice (EMI, 1986), he turned away from rockabilly and moved toward rhythm and blues (R&B) and the heartland rock of John Mellencamp. The album was produced by Don Gehman and featured Kenny Aronoff on drums. Both men had worked on albums by Mellencamp. His second studio album Live Nude Guitars followed in 1988. While this album retained some heartland rock elements, it found Setzer moving in more of a straight-ahead blues rock direction, comparable to George Thorogood's style; Setzer served as co-producer along with Larson Paine, Chris Thomas and David A. Stewart. He went on tour with Thorogood later that year. ...\n\nSource: Article \"Brian Setzer\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1959-04-10",
        "deathday": null,
        "gender": 2,
        "homepage": "https://briansetzer.com/",
        "id": 106290,
        "imdb_id": "nm0005410",
        "known_for_department": "Acting",
        "name": "Brian Setzer",
        "place_of_birth": "Massapequa, Long Island, New York, USA",
        "popularity": 0.0854,
        "profile_path": "/dTVXp7T4umdpBVqFrykWwHKMwou.jpg"
    }
}