{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7D1v3y0RPoyJBZAx4eGdjcqJUuD.jpg",
                "genre_ids": [
                    12,
                    35,
                    18
                ],
                "id": 17379,
                "original_language": "en",
                "original_title": "Last Holiday",
                "overview": "The discovery that she has a terminal illness prompts introverted department store saleswoman Georgia Byrd to reflect on what she realizes has been an overly cautious life. With weeks to live, she withdraws her life savings, sells all her possessions and jets off to Europe where she lives it up at a posh hotel. Upbeat and passionate, Georgia charms everybody she meets, including renowned Chef Didier. The only one missing from her new life is her longtime crush Sean Matthews.",
                "popularity": 4.2064,
                "poster_path": "/hRNZszPHjIpYGlrMN3o4f6f6cVd.jpg",
                "release_date": "2006-01-13",
                "title": "Last Holiday",
                "video": false,
                "vote_average": 7.219,
                "vote_count": 807,
                "character": "Dr. Gupta",
                "credit_id": "5ccd0d000e0a262fb8029b2b",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "란지트 초드리",
            "Ranjit Chowdhury",
            "Ranjit Chowdhary"
        ],
        "biography": "Ranjit Chowdhry (September 19, 1955 – April 15, 2020) was an Indian character actor, known for his roles in television, movies, and theatre. Early in his career, he had prominent parts in Hindi comedies. After moving to the United States in the 1980s, Chowdhry starred in the English language films Lonely in America (1990) and Sam & Me (1991), the latter of which he also wrote. He would go on to have supporting roles in films such as Mississippi Masala, It Could Happen to You, Camilla, Girl 6, I'm Not Rappaport, Autumn in New York, and Last Holiday. He is also remembered for his two appearances on The Office as Vikram, a wise telemarketer and former surgeon who briefly works with Michael.",
        "birthday": "1955-09-19",
        "deathday": "2020-04-15",
        "gender": 2,
        "homepage": null,
        "id": 106461,
        "imdb_id": "nm0159529",
        "known_for_department": "Acting",
        "name": "Ranjit Chowdhry",
        "place_of_birth": "Mumbai, India",
        "popularity": 0.1485,
        "profile_path": "/8UnOZLpgfPlmt9WMOMbv2DJj0gl.jpg"
    }
}