{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3q35nBLCIdEbxYfsr7D5ocYQXKz.jpg",
                "genre_ids": [
                    18,
                    10751,
                    14
                ],
                "id": 1585,
                "original_language": "en",
                "original_title": "It's a Wonderful Life",
                "overview": "A holiday favourite for generations...  George Bailey has spent his entire life giving to the people of Bedford Falls.  All that prevents rich skinflint Mr. Potter from taking over the entire town is George's modest building and loan company.  But on Christmas Eve the business's $8,000 is lost and George's troubles begin.",
                "popularity": 6.3809,
                "poster_path": "/bSqt9rhDZx1Q7UZ86dBPKdNomp2.jpg",
                "release_date": "1946-12-20",
                "title": "It's a Wonderful Life",
                "video": false,
                "vote_average": 8.272,
                "vote_count": 4589,
                "character": "Cousin Tilly",
                "credit_id": "52fe4301c3a36847f80335a5",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Mary Lou Treen",
            "Mary Louise Summers"
        ],
        "biography": "From Wikipedia, the free encyclopedia:\n\nMary Treen (born Mary Louise Summers, March 27, 1907 – July 20, 1989) was an American film and television actress, a familiar face who brought levity to the screen. A minor actress for much of her career, she managed to secure a plain, unassuming niche for herself in the Hollywood of the 1940s, 1950s, and 1960s.\n\nEarly years\n\nShe was born in St. Louis, Missouri, the daughter of attorney Don. C. Summers and actress Helene Sullivan Summers. In 1908, when Mary Louise was 11 months old, her mother sued her father for divorce on the grounds that he failed to provide for her. Her father died while she was an infant. She was reared in California by her mother and her stepfather, a physician. Treen attended the Westlake School for Girls and a convent where she tried out successfully in school plays.\n\nCareer\n\nDuring her career, Treen was seen in over 40 films. Among her film roles were Tilly, the secretary of the Building and Loan, in It's a Wonderful Life (1946) and the role of Pat in the drama Kitty Foyle (1940) starring Ginger Rogers.\n\nHer longest-running role was as Hilda, the maid and baby nurse, in 64 episodes from 1962 to 1965 of the NBC and CBS sitcom The Joey Bishop Show. Earlier, in the 1954–1955 season, she was cast in thirty-eight episodes as Emily Dodger on the CBS sitcom Willy.\n\nDeath\n\nTreen died of cancer in Newport Beach, California, July 20, 1989. She was 82. Her only survivors were distant cousins. One of her cousins was actor Mort Mills.",
        "birthday": "1907-03-27",
        "deathday": "1989-07-20",
        "gender": 1,
        "homepage": null,
        "id": 106584,
        "imdb_id": "nm0871695",
        "known_for_department": "Acting",
        "name": "Mary Treen",
        "place_of_birth": "Saint Louis, Missouri, USA",
        "popularity": 0.2701,
        "profile_path": "/cJWAKUmj5qP4zLfUfiYtbDQ109w.jpg"
    }
}