{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zZvtZZXRnZ4Tdcs0QEWaZZcIWy8.jpg",
                "genre_ids": [
                    53,
                    9648
                ],
                "id": 567,
                "original_language": "en",
                "original_title": "Rear Window",
                "overview": "A wheelchair-bound photographer spies on his neighbors from his apartment window and becomes convinced one of them has committed murder.",
                "popularity": 6.1933,
                "poster_path": "/ILVF0eJxHMddjxeQhswFtpMtqx.jpg",
                "release_date": "1954-08-01",
                "title": "Rear Window",
                "video": false,
                "vote_average": 8.349,
                "vote_count": 6829,
                "character": "Girl at Songwriter's Party (uncredited)",
                "credit_id": "59851d579251414376013310",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Marleine Gaile English"
        ],
        "biography": "She was born Marleine Gaile English in San Diego, California. As a teenager, she worked as a model and performed locally.\n\nEnglish was originally signed to a contract by Paramount Pictures in 1952 after winning a San Diego beauty pageant to be \"Fairest of the Fair\". She was paid $150 per week to appear in such films as Red Garters (1954) and Rear Window (1954). She was often cut out of these films. Her contract went up to $200 a week.\n\nHer breakthrough role came when she was borrowed by Aubrey Schenck to appear in Shield for Murder (1954).\n\nShe received a major break when she was cast opposite Spencer Tracy in The Mountain, a film which was to be made in France. English was given a smallpox vaccine before leaving to go on location. She quickly developed a raging fever and decided to pull out of the movie. Paramount suspended English and replaced her with Barbara Darrow. Parade Magazine questioned English about her decision in September 1955. She said it was a very dumb move and was unsure why she decided against making The Mountain. A close relative told the publication that English had fallen in love with Paramount actor Larry Pennell. She became enraged when the studio would not give Pennell a role in the film so they could travel to France together.\n\nEnglish made mostly B films throughout her career in Hollywood. Some of these include Three Bad Sisters, Runaway Daughters, The She Creature, Flesh and the Spur, and Voodoo Woman. In 1955, she appeared with John Ireland and Pennell in Hell's Horizon.",
        "birthday": "1935-01-04",
        "deathday": "2012-12-10",
        "gender": 1,
        "homepage": null,
        "id": 106504,
        "imdb_id": "nm0257656",
        "known_for_department": "Acting",
        "name": "Marla English",
        "place_of_birth": "San Diego, California, USA",
        "popularity": 1.4684,
        "profile_path": "/tCdWA7ajfQiSQ0tfUH213gDGZzE.jpg"
    }
}