{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/teLJilYBEdBiCNwPuiJaJT0p7i8.jpg",
                "genre_ids": [
                    37,
                    18,
                    9648
                ],
                "id": 11901,
                "original_language": "en",
                "original_title": "High Plains Drifter",
                "overview": "A gunfighting stranger comes to the small settlement of Lago. After gunning down three gunmen who tried to kill him, the townsfolk decide to hire the Stranger to hold off three outlaws who are on their way.",
                "popularity": 4.7535,
                "poster_path": "/AjkJCFkqanK1OZqiHxc6Kl2wPQO.jpg",
                "release_date": "1973-04-19",
                "title": "High Plains Drifter",
                "video": false,
                "vote_average": 7.339,
                "vote_count": 1245,
                "character": "Lutie Naylor",
                "credit_id": "52fe449e9251416c7503b0d7",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/ctzKCslTsMRsOJNvAm1Mw8ytiHY.jpg",
                "genre_ids": [
                    28,
                    12,
                    35,
                    18,
                    37
                ],
                "id": 9359,
                "original_language": "en",
                "original_title": "Maverick",
                "overview": "Bret Maverick is a gambler who would rather con someone than fight them, and needs an additional $3k in order to enter a winner-takes-all poker game beginning in a few days. He joins forces with a woman with a marvelous Southern accent, and the two try and enter the game.",
                "popularity": 4.5071,
                "poster_path": "/mTVbGGi5PIexmxVzeyFd2RYKwfM.jpg",
                "release_date": "1994-05-20",
                "title": "Maverick",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 1661,
                "character": "Stage Driver",
                "credit_id": "52fe44edc3a36847f80b2457",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nPaul Brinegar (December 19, 1917 – March 27, 1995) was an American character actor best known for his roles in three western series: The Life and Legend of Wyatt Earp, Rawhide, and Lancer.\n\nBrinegar's first credited appearance in a feature film was in Larceny (1948). From there, he launched a steady film career that slowed considerably in the late 1950s, after he began appearing on television but did not end until 1994, when Brinegar made his final screen appearance, as a stagecoach driver, in the 1994 film version of Maverick.\n\nBrinegar appeared more than 100 times between 1946 and 1994 in western films, often specializing in playing \"feisty, grizzled cowboy sidekicks\". On television, from 1956 to 1958, he played James H. \"Dog\" Kelley, the mayor of Dodge City, Kansas, in the ABC/Desilu western series The Life and Legend of Wyatt Earp starring Hugh O'Brian. Brinegar appeared in that series 33 times as Kelley and in one other episode in another role. In 1959 he played Ludwig, a bartender, in the episode \"The Ringer\" of the western series The Texan with Rory Calhoun. Brinegar, however, is best remembered as the cattle-drive cook George Washington Wishbone on the CBS series Rawhide from 1959 to 1966. Earlier he had played a similar role, one as the character Tom Jefferson Jeffrey, in the 1958 movie Cattle Empire upon which Rawhide was based.\n\nBrinegar also made two guest appearances on CBS's Perry Mason. His first appearance on that series, prior to Rawhide, was in 1958. He performed as Tom Sackett in the first-season episode titled \"The Case of the Sun Bather's Diary\". His second appearance on Perry Mason was during the series' ninth and final season. He played Jason Rohan in the 1966 episode \"The Case of the Unwelcome Well\".\n\nIn the 1968-1970 CBS western series Lancer, Brinegar had the role of Jelly Hoskins; and in 1969 he appeared in the western film Charro! starring Elvis Presley. Then, in 1973, he played the barman in Clint Eastwood's film High Plains Drifter. From 1982 to 1983, returning to television, Brinegar portrayed a humorous cowboy-like character, Lamar Pettybone, during the first season of the ABC series Matt Houston. Later he reprised a revised version of his Rawhide Wishbone character for the 1991 TV movie The Gambler Returns: The Luck of the Draw, in which he delivers a brief monologue that includes about a dozen references to old television western series.",
        "birthday": "1917-12-19",
        "deathday": "1995-03-27",
        "gender": 2,
        "homepage": null,
        "id": 106611,
        "imdb_id": "nm0109495",
        "known_for_department": "Acting",
        "name": "Paul Brinegar",
        "place_of_birth": "Tucumcari, New Mexico, USA",
        "popularity": 0.481,
        "profile_path": "/6GarNdMHXLKSnt9BAVYa5jtoYi0.jpg"
    }
}