{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/aQ2ZbNqIaecoQsryNe33UmDtms.jpg",
                "genre_ids": [
                    12,
                    10751,
                    14,
                    35,
                    10749
                ],
                "id": 2493,
                "original_language": "en",
                "original_title": "The Princess Bride",
                "overview": "In this enchantingly cracked fairy tale, the beautiful Princess Buttercup and the dashing Westley must overcome staggering odds to find happiness amid six-fingered swordsmen, murderous princes, Sicilians and rodents of unusual size. But even death can't stop these true lovebirds from triumphing.",
                "popularity": 5.7612,
                "poster_path": "/dvjqlp2sAhUeFjUOfQDgqwpphHj.jpg",
                "release_date": "1987-09-25",
                "title": "The Princess Bride",
                "video": false,
                "vote_average": 7.684,
                "vote_count": 4811,
                "character": "The King",
                "credit_id": "54c2f8619251416185000351",
                "order": 16
            },
            {
                "adult": false,
                "backdrop_path": "/2hABgVIhalvUB30Z2kIPVv8YX9n.jpg",
                "genre_ids": [
                    28,
                    12,
                    10752
                ],
                "id": 1654,
                "original_language": "en",
                "original_title": "The Dirty Dozen",
                "overview": "12 American military prisoners in World War II are ordered to infiltrate a well-guarded enemy château and kill the Nazi officers vacationing there. The soldiers, most of whom are facing death sentences for a variety of violent crimes, agree to the mission and the possible commuting of their sentences.",
                "popularity": 5.0242,
                "poster_path": "/tFWWsuhp22zJ6OG6QepJIiPUfeF.jpg",
                "release_date": "1967-06-15",
                "title": "The Dirty Dozen",
                "video": false,
                "vote_average": 7.596,
                "vote_count": 1257,
                "character": "German Officer (uncredited)",
                "credit_id": "55e1ea0f92514162bb00008d",
                "order": 30
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia.  Willoughby Gray (5 November 1916 – 13 February 1993) was an English actor of stage and screen born in London. (Though several sources suggest he was born in Aberdeen, Scotland). He was the stepson of Henry Pownall, as his father, Captain John Gray, was killed in Iraq close to the time of his birth.  John Willoughby Gray served with distinction during the Second World War with GHQ Liaison Regiment (Phantom). For most of the campaign in Europe he commanded a patrol with 11th Armoured Division. For his gallant and distinguished services in the North West Europe campaign, he was appointed MBE. His recommendation reads:  \"Captain Gray has commanded a divisional patrol with outstanding success throughout the campaign. The resource and initiative shown by him at all times has resulted in a great deal of vital information reaching Army and Corps HQ much more quickly than would otherwise have been the case, In addition, he has shown great enterprise and complete disregard for his own personal safety on many occasions, notably whilst carrying out reconnaissances in the Antwerp area during the advance through Belgium. The bearing of this officer under arduous conditions and his cheerfulness and willingness to do any work delegated to him unhesitatingly have been an example to those with whom he came in contact.\"  He achieved popularity in the mid-1950s after making 38 appearances on the television series The Adventures of Robin Hood. He appeared as 'Pete' in Harold Pinter's The Birthday Party on its very first run in 1958, this being just one of countless stage performances he made. Though over-shadowed by his stage career, Gray made a handful of incredibly popular films, notably as a priest in Laurence Olivier's film Richard III (1955), The Mummy (1959), Absolution (1978), The Hit(1984), the James Bond film A View to a Kill (1985) as retired Nazi doctor and Max Zorin (Christopher Walken) henchman Karl Mortner/Hans Glaub,[1] and as the elderly and kind king in The Princess Bride (1987).  In the late 1980s, he appeared in the BBC drama Howards' Way as banker Sir John Stevens.  In Sergei Bondarchuk's 1970 film Waterloo, he is credited as both an actor (playing Captain Ramsey) and a military consultant.[2]  Gray died aged 76 in February 1993. His wife, who wrote as Felicity Gray,(Nee Margaret Andraea) was a choreographer, speaker and writer on ballet, who notably taught Gene Tierney for her role in Never Let Me Go.  Description above from the Wikipedia article Willoughby Gray, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1916-11-06",
        "deathday": "1993-02-13",
        "gender": 2,
        "homepage": null,
        "id": 10664,
        "imdb_id": "nm0337016",
        "known_for_department": "Acting",
        "name": "Willoughby Gray",
        "place_of_birth": "London, England, UK",
        "popularity": 0.5632,
        "profile_path": "/rH24RhUjV7N5NCHAB7BSFTcL1VX.jpg"
    }
}