{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/14h57Khhp9hi11aJivH58u5tFyR.jpg",
                "genre_ids": [
                    27,
                    35,
                    878
                ],
                "id": 10925,
                "original_language": "en",
                "original_title": "The Return of the Living Dead",
                "overview": "When foreman Frank shows new employee Freddy a secret military experiment in a supply warehouse in Louisville, Kentucky, the two klutzes accidentally release a gas that reanimates corpses into flesh-eating zombies. As the epidemic spreads throughout the town, and the creatures satisfy their hunger in gory and outlandish ways, Frank and Freddy fight to survive with the help of their boss and a mysterious mortician.",
                "popularity": 4.7159,
                "poster_path": "/oNsV9BychAe4Sk6xFKp558Rlpyz.jpg",
                "release_date": "1985-04-25",
                "title": "The Return of the Living Dead",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 2196,
                "character": "Casey",
                "credit_id": "52fe43d29251416c7501f78d",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/bYimqNnizPUCnL5HOdoCW02IGmH.jpg",
                "genre_ids": [
                    18,
                    35,
                    10749
                ],
                "id": 74643,
                "original_language": "fr",
                "original_title": "The Artist",
                "overview": "Hollywood, 1927: As silent movie star George Valentin wonders if the arrival of talking pictures will cause him to fade into oblivion, he sparks with Peppy Miller, a young dancer set for a big break.",
                "popularity": 3.1239,
                "poster_path": "/z68py0ZqPgeacGPG54AGVRbNBS7.jpg",
                "release_date": "2011-10-12",
                "title": "The Artist",
                "video": false,
                "vote_average": 7.451,
                "vote_count": 3367,
                "character": "Flapper Starlet (uncredited)",
                "credit_id": "566db5139251415ec500bfbd",
                "order": 76
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Jewel Shepard is an American writer, photographer, and actress, best known for her roles in movies such as Party Camp (1987) and Return of the Living Dead (1985).\n\nShephard arrived in California in the early 80s, where she supported herself by working as a stripper in various Los Angeles strip clubs and modeling for car shoots. It was during her time stripping that she met genre filmmaker Dan O'Bannon. After a number of small television roles, Shepard broke into film with H. B. Halicki's The Junkman (1982). Roles in over a dozen B movies followed; including 1985's The Return of the Living Dead, which was directed and written by O'Bannon. In 1992 she capitalized on her \"B-girl\" status by penning Invasion of the B-Girls, a book of interviews with cult actresses such as Kitten Natividad, Linnea Quigley, Yvette Vickers, Haji, and Mary Woronov. She has also written for such publications as Premiere, Cosmopolitan, Details, and The Associated Press.\n\nHer autobiography, If I'm So Famous, How Come Nobody's Ever Heard of Me?, detailing some of the less glamorous aspects of film making and her experiences working in adult entertainment, was published in 1996.\n\nShepard has been struggling with invasive breast cancer since 2011, and has been treated with chemotherapy, lymph node removal and a double mastectomy.\n\nSource: Article \"Jewel Shepard\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1958-01-03",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 106669,
        "imdb_id": "nm0791636",
        "known_for_department": "Acting",
        "name": "Jewel Shepard",
        "place_of_birth": "Brooklyn, New York, USA",
        "popularity": 0.174,
        "profile_path": "/7NoD30PXzto1suN53w3cBEwHJhK.jpg"
    }
}