{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9AjG0YJLgDUtHl5KgrThHPhNNwZ.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 3083,
                "original_language": "en",
                "original_title": "Mr. Smith Goes to Washington",
                "overview": "After the death of a United States Senator, idealistic Jefferson Smith is appointed as his replacement in Washington. Soon, the naive and earnest new senator has to battle political corruption.",
                "popularity": 2.8661,
                "poster_path": "/nDjg1fbNyq15excNDl3acd2IqAk.jpg",
                "release_date": "1939-10-19",
                "title": "Mr. Smith Goes to Washington",
                "video": false,
                "vote_average": 7.843,
                "vote_count": 1118,
                "character": "Porter (uncredited)",
                "credit_id": "555f2b8f9251416f690009d1",
                "order": 156
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Charles Randolph Moore",
            "Charles Moore",
            "Charlie Moore"
        ],
        "biography": "Charles R. Moore (April 23, 1893, Chicago, Illinois - July 20, 1947, Los Angeles, California) was an African-American actor who appeared in over 100 films in his acting career, and was sometimes credited as Charles Moore or Charlie Moore Moore played small parts such as servants, bootblacks, elevator operators, menial laborers, and, especially, railroad porters and Red Caps. Film buffs may remember him in Meet John Doe where he played the City Hall janitor trying to smoke a cigar while washing the floor on the Christmas Eve that John Doe has threatened to jump off the building. Moore was part of Preston Sturges' unofficial \"stock company\" of character actors, appearing in six of Sturges' films. In Sullivan's Travels, Moore had a memorable moment as the chef who is propelled headfirst through the roof of the land yacht during the chase scene. Moore was also a dancer, but that skill was not often called for in his film appearances.",
        "birthday": "1893-04-23",
        "deathday": "1947-07-20",
        "gender": 2,
        "homepage": null,
        "id": 1067843,
        "imdb_id": "nm0601023",
        "known_for_department": "Acting",
        "name": "Charles R. Moore",
        "place_of_birth": "Chicago, Illinois, USA",
        "popularity": 0.0623,
        "profile_path": "/s2S1OOVnlBCKOo3Z3Z6nvlKPMqc.jpg"
    }
}