{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mO5rgg8mr4fUIMrZykwP2MjPVmZ.jpg",
                "genre_ids": [
                    10402,
                    35,
                    27
                ],
                "id": 27327,
                "original_language": "en",
                "original_title": "Phantom of the Paradise",
                "overview": "Singer-songwriter Winslow Leach seeks revenge on the nefarious music producer Swan, who steals both Winslow's music and his favorite singer for the grand opening of Swan's new rock palace, the Paradise.",
                "popularity": 4.7856,
                "poster_path": "/qDOtGWeSQNwB3dG7Amt1K0JW0az.jpg",
                "release_date": "1974-10-31",
                "title": "Phantom of the Paradise",
                "video": false,
                "vote_average": 7.482,
                "vote_count": 703,
                "character": "Groupie",
                "credit_id": "52fe4542c3a368484e04fdc1",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Patrice Rohmer was a very radiant, shapely and sexy blonde actress who had an extremely fleeting acting career, but did do her considerable utmost to greatly enliven the small handful of enjoyably trashy 70s drive-in films she graced with her infectiously engaging, energetic and uninhibited presence. Rohmer made her film debut as a one night stand in \"Harrad Summer\" (1974). She then had tiny parts as a groupie in Brian De Palma's gloriously gonzo horror rock comedy musical \"Phantom of the Paradise\" (1974) and a vacuous, baby-voiced stripper in Robert Aldrich's gritty police mystery thriller \"Hustle\" (1975). Patrice's biggest, most substantial and memorable role ever was as Sesame, who was one of the titular saucy'n'sensuous oversexed airhead lead characters in the uproariously raunchy'n'ridiculous drive-in exploitation riot \"Revenge of the Cheerleaders\" (1975). Rohmer also contributed a solid, yet minor turn as criminal Tommy Lee Jones' spiteful and jealous ex-girlfriend Cassie Anne in the terrific redneck action romp \"Jackson County Jail\" (1976). Alas, Rohmer stopped acting in the mid 70s.\n\n- IMDb Mini Biography By: woodyanders",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 106763,
        "imdb_id": "nm0737543",
        "known_for_department": "Acting",
        "name": "Patrice Rohmer",
        "place_of_birth": null,
        "popularity": 0.1061,
        "profile_path": "/bJQF26gWn62MDWkP3NsmSZdFPXB.jpg"
    }
}