{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6EO11KoiMMG29ISaQrm2G5DCe1X.jpg",
                "genre_ids": [
                    9648,
                    27,
                    53
                ],
                "id": 838209,
                "original_language": "ko",
                "original_title": "파묘",
                "overview": "After tracing the origin of a disturbing supernatural affliction to a wealthy family's ancestral gravesite, a team of paranormal experts relocates the remains—and soon discovers what happens to those who dare to mess with the wrong grave.",
                "popularity": 9.172,
                "poster_path": "/6dasJ58GGFcC62H9KuukAryltUp.jpg",
                "release_date": "2024-02-22",
                "title": "Exhuma",
                "video": false,
                "vote_average": 7.553,
                "vote_count": 554,
                "character": "Lee Hwa-rim",
                "credit_id": "62f5e7c2b39e350080fbdc26",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "김고은",
            "Kim Ko-eun",
            "Kim Goeun",
            "金高銀",
            "キム・ゴウン",
            "کیم گو اون",
            "Ким Го Ын",
            "Ким Гоын",
            "Ким Го-ын"
        ],
        "biography": "Kim Go Eun is a South Korean actress under BH Entertainment. Kim's first-ever on-screen role was in the 2012 critically acclaimed film \"A Muse\". Her daring and naturalistic performance in the film won her accolades in South Korea. Even though she was met with many offers, she decided to take a break to go back to school and finish her degree. Two years later, Kim returned to the screen in the 2014 crime thriller \"Monster\".\n\nIn 2019, Kim was named as a Chanel ambassador for South Korea and was later selected to be one of the seven faces for Chanel's \"J12 Turns 20\" campaign in 2020. In 2019, Kim Go Eun has been appointed as an honorary ambassador for the Ministry of Environment's Resource Circulation held at the Korea Press Center on August 30, 2019. Kim Go Eun actively paid attention to social contribution and environmental protection activities such as donating to wildfire victims in the Gangwon area and removing plastic in the seas with their “NO Plastic Challenge”.",
        "birthday": "1991-07-02",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1067849,
        "imdb_id": "nm5036289",
        "known_for_department": "Acting",
        "name": "Kim Go-eun",
        "place_of_birth": "Seoul, South Korea",
        "popularity": 2.8754,
        "profile_path": "/9IiR3lsMK0BkBJGeQFTeBoLxEQl.jpg"
    }
}