{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/el4j0LHk56uH6ErE5FZu2x5UJx8.jpg",
                "genre_ids": [
                    99,
                    36,
                    18
                ],
                "id": 549559,
                "original_language": "en",
                "original_title": "Apollo 11",
                "overview": "A look at the Apollo 11 mission to land on the moon led by commander Neil Armstrong and pilot Buzz Aldrin.",
                "popularity": 2.851,
                "poster_path": "/woLMRroHyoTGoXyxdEeBJEYBFtu.jpg",
                "release_date": "2019-03-01",
                "title": "Apollo 11",
                "video": false,
                "vote_average": 7.87,
                "vote_count": 667,
                "character": "Self (archive footage)",
                "credit_id": "5c7db82dc3a36843ed193144",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Μάικλ Κόλινς"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nMichael Collins (born October 31, 1930 in Rome, Italy) was a former American astronaut and test pilot. Selected as part of the third group of fourteen astronauts in 1963, he flew in space twice. His first spaceflight was Gemini 10, in which he and command pilot John Young performed two rendezvous with different spacecraft and Collins undertook two EVAs. His second spaceflight was as the command module pilot for Apollo 11. While he orbited the Moon, Neil Armstrong and Buzz Aldrin made the first manned landing on the lunar surface. He is one of only 24 humans to have flown to the Moon.\n\nPrior to becoming an astronaut, he had attended the United States Military Academy, and from there he joined the United States Air Force and flew F-86s at Chambley-Bussieres Air Base, France. He was accepted to the USAF Experimental Flight Test Pilot School at Edwards Air Force Base in 1960. He unsuccessfully applied for the second astronaut group but was accepted for the third group.\n\nAfter retiring from NASA in 1970 he took a job in the Department of State as Assistant Secretary of State for Public Affairs. A year later he became the director of the National Air and Space Museum. He held this position until 1978 when he stepped down to become undersecretary of the Smithsonian Institution. In 1980 he took the job as Vice President of LTV Aerospace. He resigned in 1985 to start his own business.\n\nHe was married to Patricia until her death in April 2014, and they had three children: Kate, Ann, and Michael, Jr.\n\nDescription above from the Wikipedia article Michael Collins(astronaut), licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1930-10-31",
        "deathday": "2021-04-28",
        "gender": 2,
        "homepage": null,
        "id": 106840,
        "imdb_id": "nm0172531",
        "known_for_department": "Acting",
        "name": "Michael Collins",
        "place_of_birth": "Rome, Italy",
        "popularity": 0.0431,
        "profile_path": null
    }
}