{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/llVPUs3j9RywSMstGRepSeS8vSL.jpg",
                "genre_ids": [
                    35
                ],
                "id": 6471,
                "original_language": "en",
                "original_title": "The Jerk",
                "overview": "After discovering he's not really black like the rest of his family, likable dimwit Navin Johnson sets off on a hilarious misadventure that takes him from rags to riches and back again. The slaphappy jerk strikes it rich, but life in the fast lane isn't all it's cracked up to be and, in the end, all that really matters to Johnson is his true love.",
                "popularity": 1.9246,
                "poster_path": "/mIjOWtUofyt9Jawge7FbvITjU3D.jpg",
                "release_date": "1979-12-14",
                "title": "The Jerk",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 849,
                "character": "Con Man",
                "credit_id": "61f6240137b3a900f20147aa",
                "order": 24
            },
            {
                "adult": false,
                "backdrop_path": "/tmU7GeKVybMWFButWEGl2M4GeiP.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 238,
                "original_language": "en",
                "original_title": "The Godfather",
                "overview": "Spanning the years 1945 to 1955, a chronicle of the fictional Italian-American Corleone crime family. When organized crime family patriarch, Vito Corleone barely survives an attempt on his life, his youngest son, Michael steps in to take care of the would-be killers, launching a campaign of bloody revenge.",
                "popularity": 29.4604,
                "poster_path": "/3bhkrj58Vtu7enYsRolD1fZdja1.jpg",
                "release_date": "1972-03-14",
                "title": "The Godfather",
                "video": false,
                "vote_average": 8.686,
                "vote_count": 21833,
                "character": "Luca Brasi",
                "credit_id": "6489ac90d2b20900ca220c08",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Lenny Passaforo"
        ],
        "biography": "Tall and solidly built, this Italian-American professional wrestler turned actor was born Lenny Passaforo in Brooklyn, New York, and is best remembered for his first on-screen role as the not too bright but ever loyal bodyguard Luca Brasi in The Godfather (1972). Montana didn't get a lot of screen time before being eliminated by the henchmen of opposing gangster Al Lettieri with a garrote and a knife; however, he caught the eye of casting agents and over the next ten years racked up roles in 16 movies. Usually cast as \"muscle for hire\", he was equally good at playing the intimidating thug or a buffoonish hoodlum, such as in Battle Creek Brawl (1980) and The Jerk (1979). His last film appearance was in the B-thriller Blood Song (1982), which he also co-wrote. He died in May 1992 of a heart attack while in Italy.",
        "birthday": "1926-03-13",
        "deathday": "1992-05-12",
        "gender": 2,
        "homepage": null,
        "id": 106811,
        "imdb_id": "nm0598926",
        "known_for_department": "Acting",
        "name": "Lenny Montana",
        "place_of_birth": " Brooklyn, New York, USA",
        "popularity": 1.3173,
        "profile_path": "/3R52Zh3MBCaSPqmcyWcD1Y0N4wo.jpg"
    }
}