{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/43BEez1EGdmNpg8rcPUFToujlii.jpg",
                "genre_ids": [
                    53,
                    80
                ],
                "id": 161,
                "original_language": "en",
                "original_title": "Ocean's Eleven",
                "overview": "Less than 24 hours into his parole, charismatic thief Danny Ocean is already rolling out his next plan: In one night, Danny's hand-picked crew of specialists will attempt to steal more than $150 million from three Las Vegas casinos. But to score the cash, Danny risks his chances of reconciling with ex-wife, Tess.",
                "popularity": 9.4093,
                "poster_path": "/hQQCdZrsHtZyR6NbKH2YyCqd2fR.jpg",
                "release_date": "2001-12-07",
                "title": "Ocean's Eleven",
                "video": false,
                "vote_average": 7.451,
                "vote_count": 12045,
                "character": "Wayne Newton",
                "credit_id": "5eb5b08fccb15f002185e7d1",
                "order": 46
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Carson Wayne Newton",
            "Mr. Las Vegas",
            "The Midnight Idol",
            "Mr. Entertainment",
            "Mr. New Vegas"
        ],
        "biography": "Wayne Newton is a singer and stage performer from the 1960s to the present. He is of English, Irish, Scottish, Welsh and German as well as Native American (specifically Powhatan and Cherokee) ancestry. In the 1960s, he was a very popular singer with a very clean cut youthful appearance, with hits like \"Danke Schon\". However, because he had a high pitched voice, many joked (wrongly) that he was effeminate or even gay, and Johnny Carson made Newton the butt of his jokes, but when Newton threatened Carson, he stopped telling the jokes. In the 1970s, he reinvented himself with a completely different image, and became more successful than ever! He has performed over 30,000 solo shows in Las Vegas which has earned him the nicknamed of \"Mr. Las Vegas\". He has also appeared in a few movies from the 1950s to the present, usually in cameo roles as himself. As of 2020, he is still alive at the age of 78!",
        "birthday": "1942-04-03",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.waynenewton.com/",
        "id": 10681,
        "imdb_id": "nm0628611",
        "known_for_department": "Acting",
        "name": "Wayne Newton",
        "place_of_birth": "Roanoke, Virginia, USA",
        "popularity": 0.7239,
        "profile_path": "/nyRTuri5DvC1WYhMpMjORUci9Gl.jpg"
    }
}