{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/69D57G3XqQMVNCwK0Z2PCcYC4Da.jpg",
                "genre_ids": [
                    18
                ],
                "id": 25538,
                "original_language": "zh",
                "original_title": "一一",
                "overview": "Each member of a family in Taipei asks hard questions about life's meaning as they live through everyday quandaries. NJ is morose: his brother owes him money, his mother-in-law is in a coma, his wife suffers a spiritual crisis when she finds her life a blank and his business partners make bad decisions.",
                "popularity": 4.5736,
                "poster_path": "/mR8dSQZI8X6Z1NClJhFrtJp636z.jpg",
                "release_date": "2000-09-20",
                "title": "Yi Yi",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 595,
                "character": "Hotel Okura Guest",
                "credit_id": "637328065a4690007feecf4f",
                "order": 77
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Gazoo"
        ],
        "biography": "Christian Storms, the Tokyo-based actor, dialogue coach, translator, director, producer has spent half his life in Japan. If you've seen a Japanese film, he's probably translated the subtitles. If you've seen a documentary about Japan, he probably produced it.\n\nChristian is the owner/line producer of Local 81, a Tokyo-based TV/film production company which produces local shoots for mainly US/UK broadcasters. For example, he has spearheaded many Japan-related TV shows for networks like the BBC (Top Gear), the Discovery Channel, Nat Geo (Locked Up Abroad) and AXN (The Amazing Race Asia). In addition, as a producer with experience in over 70 projects, Christian was hired by FIFA for the 2010 and 2014 World Cups as the ENG producer for the Japan team.",
        "birthday": "1968-08-30",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 106961,
        "imdb_id": "nm1218835",
        "known_for_department": "Camera",
        "name": "Christian Storms",
        "place_of_birth": "Evansville, Indiana, USA",
        "popularity": 0.0513,
        "profile_path": "/kbHmBdvrIPZVsGpRAKbm7ZM5rcQ.jpg"
    }
}