{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/aL53oMdZKZRJRH8txH07DLuleF9.jpg",
                "genre_ids": [
                    14,
                    12,
                    28
                ],
                "id": 284052,
                "original_language": "en",
                "original_title": "Doctor Strange",
                "overview": "After his career is destroyed, a brilliant but arrogant surgeon gets a new lease on life when a sorcerer takes him under her wing and trains him to defend the world against evil.",
                "popularity": 9.5286,
                "poster_path": "/uGBVj3bEbCoZbDjjl9wTxcygko1.jpg",
                "release_date": "2016-10-25",
                "title": "Doctor Strange",
                "video": false,
                "vote_average": 7.418,
                "vote_count": 22792,
                "character": "Brunette Zealot",
                "credit_id": "5e84c689cb6db50018a832f8",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Zara Phythian is an English convicted sex offender; and former actress, stuntwoman, and martial artist/instructor. She's known for her work on Doctor Strange (2016), Morgan (2016), and Cannibals and Carpet Fitters (2017).\n\nShe started studying Shotokan Karate when she was seven years old and later turned to Tae Kwon Do. In 2006 she became the first British martial artist to be inducted into the International Karate & Kickboxing Hall of Fame (IKKHoF).\n\nIn 2015, she married producer/director and martial arts instructor Victor Marke, who is over 20 years older than her, and was also convicted along with her. The couple met when he was Zara's martial arts instructor.\n\nIn May of 2022, she was convicted of 14 child sex offenses and found guilty of the sexual abuse of a girl from age 13 to 15 - between 2005 and 2008, while working as martial arts instructors in the UK, along with her husband Victor Marke. She was sentenced to eight years imprisonment while Victor was sentenced to 14 years imprisonment for jointly abusing the same victim, as well as the indecent assault of a second girl on his own.",
        "birthday": "1984-05-10",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1070721,
        "imdb_id": "nm2333360",
        "known_for_department": "Acting",
        "name": "Zara Phythian",
        "place_of_birth": "England",
        "popularity": 1.6288,
        "profile_path": "/dCYA8TFgY2s7kc7SHwk2Y7smMAn.jpg"
    }
}