{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qr7dUqleMRd0VgollazbmyP9XjI.jpg",
                "genre_ids": [
                    878,
                    18,
                    53
                ],
                "id": 78,
                "original_language": "en",
                "original_title": "Blade Runner",
                "overview": "In the smog-choked dystopian Los Angeles of 2019, blade runner Rick Deckard is called out of retirement to terminate a quartet of replicants who have escaped to Earth seeking their creator for a way to extend their short life spans.",
                "popularity": 12.7734,
                "poster_path": "/63N9uy8nd9j7Eog2axPQ8lbr3Wj.jpg",
                "release_date": "1982-06-25",
                "title": "Blade Runner",
                "video": false,
                "vote_average": 7.941,
                "vote_count": 14371,
                "character": "Taffey Lewis",
                "credit_id": "52fe4214c3a36847f8002631",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Monty Pike"
        ],
        "biography": "Hy Pyke (December 2, 1935 – October 26, 2006) was an American character actor.\n\nPyke was born Monty Pike in Los Angeles, California, the son of vaudevillian David Pike and his wife Pauline. Pyke majored in theatre at UCLA in the 1960s, appearing in numerous student films, including one for Ray Manzarek, keyboard player of The Doors, called Induction (1965), which also featured The Doors vocalist Jim Morrison in a brief role. During that time period, Pyke was also associated with Del Close.\n\nFrom UCLA, Pyke went on to have a long career playing strange, often comic characters in usually out-of-the-ordinary, low-budget, independent features, with some brief appearances in mainstream films. Some of his mainstream appearances, like a small part in the John Milius film Dillinger (1973), ended up cut out of the final film. Although many of his better known films are in the horror genre, Pyke acted in everything from blaxploitation to musical comedies. He had a uniquely manic acting style, with a penchant for physical, exaggerated comedy, marked by a distinctive, raspy voice.\n\nIn the 1970s, Pyke's physical appearance was equally distinctive. Very short, slightly overweight, with a moustache and heavily balding head of wild black hair, he resembled the archetypal Mexican bandit of B-westerns or Sancho Panza (a role he played in The Erotic Adventures Of Don Quixote, 1976). Besides his film work, Pyke acted in theater, musical revues, etc.\n\nDuring the 1970s, Pyke delivered a number of bizarre performances in off-beat films. His most memorable role was as a creepy bus driver in the 1975 horror film Lemora: A Child's Tale Of The Supernatural. Other notable 1970s Pyke appearances were in Dolemite, (1975), The First Nudie Musical, (1976), and in Spawn Of The Slithis, (1978). Pyke played the part of Bebe Rebozo in an unreleased Richard Nixon satire called The Way He Was.\n\nFrom Wikipedia, the free encyclopedia",
        "birthday": "1935-12-02",
        "deathday": "2006-10-16",
        "gender": 2,
        "homepage": null,
        "id": 107074,
        "imdb_id": "nm0131987",
        "known_for_department": "Acting",
        "name": "Hy Pyke",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.2528,
        "profile_path": "/uuSQqL8n4VkFXdWDq1XkEHDOvou.jpg"
    }
}