{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gXIuss4Ajlex0E6iJPjkSTR8Qip.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 389015,
                "original_language": "en",
                "original_title": "I, Tonya",
                "overview": "Competitive ice skater Tonya Harding rises amongst the ranks at the U.S. Figure Skating Championships, but her future in the sport is thrown into doubt when her ex-husband intervenes.",
                "popularity": 3.4338,
                "poster_path": "/6gNXwSHxaksR1PjVZRqNapmkgj3.jpg",
                "release_date": "2017-12-07",
                "title": "I, Tonya",
                "video": false,
                "vote_average": 7.478,
                "vote_count": 5981,
                "character": "Spectator (uncredited)",
                "credit_id": "64c91221b9744200ad31a453",
                "order": 40
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "J.B. Hivemind",
            "Joseph Heath",
            "Joseph G. Heath"
        ],
        "biography": "Joe Heath is the creative force behind Minty Pineapple Entertainments, writing, editing, directing, and acting in nearly everything featured on this website. His screenplays and short films have been featured in numerous festivals including The Chattanooga Film Festival, Atlanta Film Festival, Nashville Film Festival, the Filmmatic Comedy Screenplay Awards, and many more. He has worked as an editor on the nationally syndicated shows The Unseen World and More Than the Music as well as writing, filming, and starring in an unaired pilot for the same production company. He has also written pop culture articles for Looper and The Dipp, co-written a pair of novels, co-hosted multiple podcasts, written numerous comic books, and played a Dairy Queen employee in Guardians of the Galaxy Vol. 2. He is currently seeking literary representation.",
        "birthday": "1989-03-04",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.mintypineapple.com/",
        "id": 1071648,
        "imdb_id": "nm3004629",
        "known_for_department": "Directing",
        "name": "Joe Heath",
        "place_of_birth": null,
        "popularity": 0.0546,
        "profile_path": null
    }
}