{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8zLS8p1tRyWFLRFfmgQq0j5WE6z.jpg",
                "genre_ids": [
                    12,
                    28,
                    14
                ],
                "id": 564,
                "original_language": "en",
                "original_title": "The Mummy",
                "overview": "Dashing legionnaire Rick O'Connell stumbles upon the hidden ruins of Hamunaptra while in the midst of a battle to claim the area in 1920s Egypt. It has been over three thousand years since former High Priest Imhotep suffered a fate worse than death as a punishment for a forbidden love—along with a curse that guarantees eternal doom upon the world if he is ever awoken.",
                "popularity": 14.2681,
                "poster_path": "/yhIsVvcUm7QxzLfT6HW2wLf5ajY.jpg",
                "release_date": "1999-04-16",
                "title": "The Mummy",
                "video": false,
                "vote_average": 6.95,
                "vote_count": 9494,
                "character": "Jonathan Carnahan",
                "credit_id": "52fe4253c3a36847f80156b1",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/ffAL7ZiUnCay51SeHFTrTEUpUkO.jpg",
                "genre_ids": [
                    18
                ],
                "id": 10400,
                "original_language": "en",
                "original_title": "The Hurricane",
                "overview": "The story of Rubin \"Hurricane\" Carter, a boxer wrongly imprisoned for murder, and the people who aided in his fight to prove his innocence.",
                "popularity": 3.8457,
                "poster_path": "/eOzbt7KsqTC8gcjJMxcQnr89cxJ.jpg",
                "release_date": "1999-09-17",
                "title": "The Hurricane",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 1460,
                "character": "Terry",
                "credit_id": "53d8bd0f0e0a261c81001e8f",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "John David Hannah",
            "جان هانا"
        ],
        "biography": "John Hannah (born April 23, 1962) is a Scottish actor of film and television. He has appeared in Stephen Sommers' Mummy Series, Richard Curtis' Four Weddings and a Funeral, and Sliding Doors with Gwyneth Paltrow.\n\nAfter completing his secondary education, Hannah enrolled at the Royal Scottish Academy of Music and Drama (now known as the Royal Conservatoire of Scotland) in Glasgow. His time at the academy laid the foundation for his acting career, and he graduated with honors.\n\nJohn Hannah's acting career took off in the late 1980s and early 1990s with notable stage performances, including roles with the Royal Shakespeare Company. His breakthrough on the big screen came with the critically acclaimed film \"Four Weddings and a Funeral\" (1994), where he played the endearing and scene-stealing character, Matthew. The film's success catapulted Hannah into international recognition.\n\nFollowing his success in \"Four Weddings and a Funeral,\" he continued to build a diverse and impressive filmography. He starred in films such as \"Sliding Doors\" (1998), \"The Mummy\" (1999), and its sequel \"The Mummy Returns\" (2001), gaining popularity for his charismatic and versatile performances. Additionally, he showcased his talent in television, earning praise for his roles in series like \"Rebus\" and \"Spartacus.\"\n\nBeyond the screen, he maintains a private personal life. In 1996, he married actress Joanna Roth, and the couple has two children. Despite his fame, he remains known for his down-to-earth demeanor and commitment to his craft.",
        "birthday": "1962-04-23",
        "deathday": null,
        "gender": 2,
        "homepage": "http://argtalent.com/john-hannah",
        "id": 10727,
        "imdb_id": "nm0001314",
        "known_for_department": "Acting",
        "name": "John Hannah",
        "place_of_birth": "East Kilbride, Scotland, UK",
        "popularity": 1.266,
        "profile_path": "/8GzJhaZrChZpv84SU4vAsvsR3cl.jpg"
    }
}