{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/a9quMrUTdE1uCfQ6fLYS0RjJrGe.jpg",
                "genre_ids": [
                    12
                ],
                "id": 204668,
                "original_language": "fr",
                "original_title": "Belle et Sébastien",
                "overview": "Belle and Sebastian is set high in the snowy Alps during the Second World War. The resourceful Sebastian is a lonely boy who tames and befriends a giant, wild mountain dog, Belle – even though the villagers believe her to be ‘the beast’ that has been killing their sheep.",
                "popularity": 4.1165,
                "poster_path": "/km3ogCGHmlL7M4msTU6pWcJFpRu.jpg",
                "release_date": "2013-12-18",
                "title": "Belle and Sebastian",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 665,
                "character": "Lieutenant Peter",
                "credit_id": "52fe4cf7c3a368484e1cfb11",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Andreas Pietschmann (born 22 March 1969) is a German theater, film, and television actor.\n\nPietschmann played football in the youth department of Würzburger Kickers and was considered a talented player. Later, he did his military service with the Bundeswehr, during which time he also became involved in theater acting. He appeared in a stage production of Die Feuerzangenbowle, among others. After a serious car accident, Pietschmann decided to pursue acting seriously.\n\nHe attended drama school in the city of Bochum from 1993 to 1996, followed by a four-year engagement at the Schauspielhaus Bochum drama theater. Following this, Pietschmann transferred to the Thalia Theater in Hamburg for the 2000/2001 season, and he left in 2007 to focus on film and television. He has also participated in numerous radio productions. Additionally, Pietschmann has narrated several audiobooks, including The Shadow of the Wind by Carlos Ruiz Zafón, The Law of Dreams by Peter Behrens, Thanks for the Memories by Cecelia Ahern, and The Brief Wondrous Life of Oscar Wao by Junot Díaz.\n\nPietschmann gained fame due to his role in GSG 9 – Ihr Einsatz ist ihr Leben. On the show, he plays the urbane Konstantin \"Konny\" Brendorp, who comes from a noble family. Since 2017, he has had a starring role in the Netflix series Dark, playing \"The Stranger\".\n\nSince then, he has worked both at the Maxim Gorki Theater in Berlin, as well as having several guest roles in various television series.\n\nPietschmann lives in Berlin with his partner, the actress Jasmin Tabatabai, and has two children with her: a daughter, Helena Leila (born July 5, 2009), and a son, Johan Anton (born August 13, 2013). Pietschmann is also the stepfather to Tabatabai's daughter Angelina, from her previous marriage.\n\nSource: Article \"Andreas Pietschmann\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1969-03-22",
        "deathday": null,
        "gender": 2,
        "homepage": "https://andreaspietschmann.com/",
        "id": 1073985,
        "imdb_id": "nm0682960",
        "known_for_department": "Acting",
        "name": "Andreas Pietschmann",
        "place_of_birth": "Würzburg, Germany",
        "popularity": 0.3019,
        "profile_path": "/72Srjd11dwvovxe1tyUKU0ml04u.jpg"
    }
}