{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jhM3wgWUrrOkz9r4xwV5cV5RhI4.jpg",
                "genre_ids": [
                    878
                ],
                "id": 17654,
                "original_language": "en",
                "original_title": "District 9",
                "overview": "Thirty years ago, aliens arrive on Earth. Not to conquer or give aid, but to find refuge from their dying planet. Separated from humans in a South African area called District 9, the aliens are managed by Multi-National United, which is unconcerned with the aliens' welfare but will do anything to master their advanced technology. When a company field agent contracts a mysterious virus that begins to alter his DNA, there is only one place he can hide: District 9.",
                "popularity": 8.0237,
                "poster_path": "/tuGlQkqLxnodDSk6mp5c2wvxUEd.jpg",
                "release_date": "2009-08-05",
                "title": "District 9",
                "video": false,
                "vote_average": 7.454,
                "vote_count": 9901,
                "character": "MNU Doctor",
                "credit_id": "5464d2020e0a262942001f5f",
                "order": 19
            },
            {
                "adult": false,
                "backdrop_path": "/bGgcTfGf8jggZZotx3uKpRF2zbv.jpg",
                "genre_ids": [
                    12,
                    10751,
                    18
                ],
                "id": 498248,
                "original_language": "fr",
                "original_title": "Mia et le lion blanc",
                "overview": "A young girl from London moves to Africa with her parents where she befriends a lion cub.",
                "popularity": 6.1536,
                "poster_path": "/zXfwBeYe0RnqsJ0dnBoFTB4SSrG.jpg",
                "release_date": "2018-08-02",
                "title": "Mia and the White Lion",
                "video": false,
                "vote_average": 7.269,
                "vote_count": 894,
                "character": "M. Kruger, School Principal",
                "credit_id": "5c159e7fc3a36866bd36fa5c",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "David Geoffrey Clatworthy (11 July 1960 – 8 September 2020) was a South African actor and director.\n\nClatworthy was born on 11 July 1960 in South Africa. He completed education from Pretoria Boys High School. From 1978 to 1979, he became the regimental instructor for the School of Artillery. In 1980, he enrolled to the University of Cape Town to study a bilingual Performer's Diploma in Speech and Drama. He graduated with the degree in 1983.\n\nHe was married to fellow actress Wilmien Rossouw. The couple had two children. He was later in a relationship with Michelle Botha, where they have a son.\n\nHe diagnosed with an esophagus cancer for some time. He died on 8 September 2020 at the age of 60.\n\nHe made notable performances in many theatre plays such as; The King and I, Life Is a Pitch, Macbeth, Revamp, The Boys Next Door, and Beyond Therapy. He played the role \"Jamie\" in Long Day’s Journey Into Night, where he won the Fleur Du Cap Award for Best Supporting Actor. Apart from that, he was also nominated for a Fleur Du Cap Award and the Dalro award in 1989. In 1990, he made film debut with Return to Justice and played the role \"Hayes\".\n\nIn 2008, he acted in the SABC2 television sitcom On the Couch with the role \"Arno\". In 2012, he starred as \"Commander Schoeman\" in the Mzansi Magic crime drama serial Mshika-shika. In 2013, he made a guest role in the SABC3 sitcom Safe. In 2016, he joined with the kykNET Afrikaans soap opera Getroud met Rugby and played the role \"Gerald Richter\". In the meantime, he also became a director of the show. In 2018, he played the role \"Clive Wright\" in SABC2 sitcom Konsternasie Oppie Stasie. Other than that, he acted in the international science fiction film District 9 and joined with the first season of Netflix film The Crown.\n\nApart from cinema, theatre and television, he rendered his voice in over 100 radio dramas. Some his other notable film appearances came through, Mia et le lion blanc, Harry Game, Young Ones, The Making of the Mahatma, Everyman's Taxi, Lunar Cop, Verraaiers, Platteland, and Winnie Mandela.\n\nSource: Article \"David Clatworthy\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1960-07-11",
        "deathday": "2020-09-08",
        "gender": 2,
        "homepage": null,
        "id": 1073473,
        "imdb_id": "nm0165196",
        "known_for_department": "Acting",
        "name": "David Clatworthy",
        "place_of_birth": "South Africa",
        "popularity": 0.0448,
        "profile_path": "/f7Nc90L59usUFkgtrpc381v4RSC.jpg"
    }
}