{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lOrM3OQhHlzEkpF7Ih3GghecrA8.jpg",
                "genre_ids": [
                    35
                ],
                "id": 583,
                "original_language": "en",
                "original_title": "Life of Brian",
                "overview": "Brian Cohen is an average young Jewish man, but through a series of ridiculous events, he gains a reputation as the Messiah. When he's not dodging his followers or being scolded by his shrill mother, the hapless Brian has to contend with the pompous Pontius Pilate and acronym-obsessed members of a separatist movement. Rife with Monty Python's signature absurdity, the tale finds Brian's life paralleling Biblical lore, albeit with many more laughs.",
                "popularity": 5.53,
                "poster_path": "/lSSA64WF0M0BXnjwr2quMh6shCl.jpg",
                "release_date": "1979-08-17",
                "title": "Life of Brian",
                "video": false,
                "vote_average": 7.761,
                "vote_count": 4652,
                "character": "Judith Iscariot",
                "credit_id": "52fe4256c3a36847f8016513",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Sue Jones-Davies is a Welsh actress, singer and politician. She has appeared on stage, screen and television.\n\nShe met her former husband, the actor and writer Chris Langham, when they both studied at Bristol University. After graduation they moved to London but later separated, when she moved to Aberystwyth with her three sons.\n\nShe became the Plaid Cymru Mayor of Aberystwyth in 2008, and now serves as town councillor there. The town of Aberystwyth had banned the showing of the film \"The Life of Brian\", in which she played Judith Iscariot,  since its release in 1979.",
        "birthday": "1949-01-01",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 10737,
        "imdb_id": "nm0429495",
        "known_for_department": "Acting",
        "name": "Sue Jones-Davies",
        "place_of_birth": "Wales, UK",
        "popularity": 0.3171,
        "profile_path": "/iQu3NvOrL2oVQuJ0w6pdwtg0vnW.jpg"
    }
}