{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/w5IDXtifKntw0ajv2co7jFlTQDM.jpg",
                "genre_ids": [
                    878,
                    9648,
                    12
                ],
                "id": 62,
                "original_language": "en",
                "original_title": "2001: A Space Odyssey",
                "overview": "Humanity finds a mysterious object buried beneath the lunar surface and sets off to find its origins with the help of HAL 9000, the world's most advanced super computer.",
                "popularity": 13.6206,
                "poster_path": "/ve72VxNqjGM69Uky4WTo2bK6rfq.jpg",
                "release_date": "1968-04-02",
                "title": "2001: A Space Odyssey",
                "video": false,
                "vote_average": 8.065,
                "vote_count": 12026,
                "character": "Poole's Mother",
                "credit_id": "52fe4212c3a36847f8001a7b",
                "order": 14
            },
            {
                "adult": false,
                "backdrop_path": "/1ZKHzSGJm0kvlCp4echAOtKnDTm.jpg",
                "genre_ids": [
                    16,
                    18,
                    10751
                ],
                "id": 3170,
                "original_language": "en",
                "original_title": "Bambi",
                "overview": "Bambi's tale unfolds from season to season as the young prince of the forest learns about life, love, and friends.",
                "popularity": 5.8203,
                "poster_path": "/wV9e2y4myJ4KMFsyFfWYcUOawyK.jpg",
                "release_date": "1942-08-14",
                "title": "Bambi",
                "video": false,
                "vote_average": 7.011,
                "vote_count": 5840,
                "character": "Adolescent Faline (voice) (uncredited)",
                "credit_id": "52fe438cc3a36847f805ca9d",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Anne Gillis",
            "Alma Mabel Conner"
        ],
        "biography": "Ann Gillis was born Alma Mabel Conner on February 12, 1927, in Little  Rock, Arkansas. At age seven, she appeared in her first film, Men in White  (1934), as an extra. During the next two years, she had uncredited  appearances in six more films until she received her first major role in  King of Hockey (1936). Warner Brothers Studios gave significant screen time to Gillis in this movie, in hopes that she would become another Shirley Temple.  Although (like all child stars of the 1930s) she never achieved  Temple's level of fame, for the next several years Gillis starred in  many films, almost always playing a spoiled, bratty character. She had  two rare sympathetic roles as Becky Thatcher in The Adventures of Tom Sawyer (1938) and as the title character in Little Orphan Annie  (1938). One scene in The Adventures of Tom Sawyer called for her to go  into screaming hysterics when her character was trapped in a cave of  bats, and Gillis delivered in a powerful performance that is probably  the most memorable scene of her film career. As Gillis grew older,  however, her career slowed down, and she left Hollywood in 1947. When  she left Hollywood she married Paul Ziebold and had 2 sons. She then  divorced, relocated to New York City and married Richard Fraser,  a Scottish-born actor (they had a son born in 1958). During the 1950s  and '60s, Gillis made sporadic television appearances, and in 1959, she  hosted a national telecast presentation of The Adventures of Tom Sawyer.  Gillis and her husband moved to England in 1961, and they were living  in London when they heard of a casting call for 2001: A Space Odyssey  (1968) that called for an American actress living in the city. Gillis  auditioned and got the role; it remains her final film to date. Ann moved to Belgium in 1972 where she met and married Belgian René Van Hulst (deceased 1999).  She lived in Belgium from 1972 to 2014 and became a Belgian citizen, devoting much of her time to painting and music, she was an accomplished pianist and harpist. She moved to England, UK in December 2014 and passed away peacefully on 31/1/2018.",
        "birthday": "1927-02-12",
        "deathday": "2018-01-31",
        "gender": 1,
        "homepage": "http://www.1canhelp.com/ann_gillis/",
        "id": 107445,
        "imdb_id": "nm0319268",
        "known_for_department": "Acting",
        "name": "Ann Gillis",
        "place_of_birth": "Little Rock, Arkansas, USA",
        "popularity": 0.6608,
        "profile_path": "/snMxooC0nhjSvVPnxBWO396b1Jl.jpg"
    }
}