{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ft8WRF2xqEwwGWa59naDUybKTAx.jpg",
                "genre_ids": [
                    18,
                    10752,
                    10749
                ],
                "id": 770,
                "original_language": "en",
                "original_title": "Gone with the Wind",
                "overview": "The spoiled daughter of a Georgia plantation owner conducts a tumultuous romance with a cynical profiteer during the American Civil War and Reconstruction Era.",
                "popularity": 7.332,
                "poster_path": "/lNz2Ow0wGCAvzckW7EOjE03KcYv.jpg",
                "release_date": "1939-12-15",
                "title": "Gone with the Wind",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 4191,
                "character": "Boy in Band (uncredited)",
                "credit_id": "555ab6a2c3a3681089000da2",
                "order": 89
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nThomas Francis Kelly (April 6, 1925 – January 26, 2016) professionally known as Tommy Kelly was an American child actor. He is remembered for his title role in The Adventures of Tom Sawyer in 1938 based on Mark Twain's novel of the same name.\n\nKelly was born in the Bronx, the son of Nora and Michael Kelly, a fireman, in humble circumstances. He had twelve siblings. Kelly's grandparents, all four, were from Ireland. He began his acting career at the age of twelve when he was selected to play the role of Tom Sawyer in the 1938 movie The Adventures of Tom Sawyer, an adaption of Mark Twain's classic The Adventures of Tom Sawyer. Approximately 25,000 boys had auditioned for that role and it is said that famous producer David O. Selznick handpicked Kelly for the role. Despite Kelly's earning good critical reviews for his performance, the film was only a poor financial success. He also played the lead role in Peck's Bad Boy with the Circus later that year as Bill Peck.\n\nIn 1939, Tommy Kelly had a small but memorable part in Gone with the Wind as the boy crying in a band in Atlanta while the death lists are given out. He played the notable supporting role of Willie in Archie Mayo's musical film They Shall Have Music (1939) followed by a leading role as a young cadet in the B movie Military Academy (1940). As he reached adulthood, Kelly's roles in movies were minor and he was often uncredited. He appeared in The Magnificent Yankee in 1950, which turned out to be his last of 19 films before ending his acting career.\n\nAs with many other stars, the war years found Tommy in the U.S. Army; he served in the infantry rather than the USO, as did some other child stars. He fought in the European theater, participating in the critical campaign for the bridge at Remagen.",
        "birthday": "1925-04-06",
        "deathday": "2016-01-26",
        "gender": 2,
        "homepage": null,
        "id": 107444,
        "imdb_id": "nm0446921",
        "known_for_department": "Acting",
        "name": "Tommy Kelly",
        "place_of_birth": "Bronx, New York City, New York, USA",
        "popularity": 0.2183,
        "profile_path": "/i7PPLlRcCvN6VGURjbF7xsXk8Ul.jpg"
    }
}