{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yrepQdpreOorLyBJyvZkGn3Izfe.jpg",
                "genre_ids": [
                    99
                ],
                "id": 490003,
                "original_language": "en",
                "original_title": "Won't You Be My Neighbor?",
                "overview": "For more than thirty years, and through his television program, Fred Rogers (1928-2003), host, producer, writer and pianist, accompanied by his puppets and his many friends, spoke directly to young children about some of life's most important issues.",
                "popularity": 0.944,
                "poster_path": "/8qE8NZjiP2M884baH0VoLF828Vp.jpg",
                "release_date": "2018-06-29",
                "title": "Won't You Be My Neighbor?",
                "video": false,
                "vote_average": 8.008,
                "vote_count": 568,
                "character": "Self - TV Host (archive footage)",
                "credit_id": "5ab1d2680e0a261dff000e27",
                "order": 32
            },
            {
                "adult": false,
                "backdrop_path": "/cSJMk9Jar8SibFXL8JAF9p2fhKu.jpg",
                "genre_ids": [
                    18,
                    36,
                    10751
                ],
                "id": 501907,
                "original_language": "en",
                "original_title": "A Beautiful Day in the Neighborhood",
                "overview": "An award-winning cynical journalist, Lloyd Vogel, begrudgingly accepts an assignment to write an Esquire profile piece on the beloved television icon Fred Rogers. After his encounter with Rogers, Vogel's perspective on life is transformed.",
                "popularity": 2.9829,
                "poster_path": "/p9vCAVhDK375XyobVcKqzqzsUHE.jpg",
                "release_date": "2019-09-07",
                "title": "A Beautiful Day in the Neighborhood",
                "video": false,
                "vote_average": 6.951,
                "vote_count": 1675,
                "character": "Self (archive footage) (uncredited)",
                "credit_id": "5f13335c2afb2500353d7e18",
                "order": 63
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Фред Роджерс",
            "Fred McFeely Rogers"
        ],
        "biography": "Fred McFeely Rogers (March 20, 1928 – February 27, 2003), commonly known as Mister Rogers, was an American television host, author, producer, and Presbyterian minister. He was the creator, showrunner, and host of the preschool television series Mister Rogers' Neighborhood, which ran from 1968 to 2001.\n\nBorn in Latrobe, Pennsylvania, near Pittsburgh, Rogers earned a bachelor's degree in music from Rollins College in 1951. He began his television career at NBC in New York, returning to Pittsburgh in 1953 to work for children's programming at NET (later PBS) television station WQED. He graduated from Pittsburgh Theological Seminary with a bachelor's degree in divinity in 1962 and became a Presbyterian minister in 1963. He attended the University of Pittsburgh's Graduate School of Child Development, where he began his 30-year collaboration with child psychologist Margaret McFarland. He also helped develop the children's shows The Children's Corner (1955) for WQED in Pittsburgh and Misterogers (1963) in Canada for the Canadian Broadcasting Corporation. In 1968, he returned to Pittsburgh and adapted the format of his Canadian series to create Mister Rogers' Neighborhood. It ran for 33 years, and was critically acclaimed for focusing on children's emotional and physical concerns, such as death, sibling rivalry, school enrollment, and divorce.\n\nRogers died of stomach cancer on February 27, 2003, 3 weeks before the age of 75. His work in children's television has been widely lauded, and he received more than 40 honorary degrees and several awards, including the Presidential Medal of Freedom in 2002 and a Lifetime Achievement Emmy in 1997. He was inducted into the Television Hall of Fame in 1999. Rogers influenced many writers and producers of children's television shows, and his broadcasts have served as a source of comfort during tragic events, even after his death.",
        "birthday": "1928-03-20",
        "deathday": "2003-02-27",
        "gender": 2,
        "homepage": "https://www.misterrogers.org/",
        "id": 1074129,
        "imdb_id": "nm0736872",
        "known_for_department": "Acting",
        "name": "Fred Rogers",
        "place_of_birth": "Latrobe, Pennsylvania, USA",
        "popularity": 0.1257,
        "profile_path": "/d000aVyO5zYls7MrSCU6EhG4eoz.jpg"
    }
}