{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6IFTmhNh9kmwd5ix53OdlSphPYl.jpg",
                "genre_ids": [
                    35,
                    80
                ],
                "id": 623,
                "original_language": "en",
                "original_title": "A Fish Called Wanda",
                "overview": "While a diamond advocate attempts to steal a collection of diamonds, troubles arise when he realises he’s not the only one after the collection.",
                "popularity": 5.4089,
                "poster_path": "/hkSGFNVfEEUXFCxRZDITFHVhUlu.jpg",
                "release_date": "1988-07-15",
                "title": "A Fish Called Wanda",
                "video": false,
                "vote_average": 7.204,
                "vote_count": 2298,
                "character": "Judge",
                "credit_id": "52fe4260c3a36847f8019685",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/kfofK4GzJsJZhCShqZY438c8Y4Y.jpg",
                "genre_ids": [
                    35,
                    12,
                    10751
                ],
                "id": 116149,
                "original_language": "en",
                "original_title": "Paddington",
                "overview": "A young Peruvian bear travels to London in search of a home. Finding himself lost and alone at Paddington Station, he meets the kindly Brown family, who offer him a temporary haven.",
                "popularity": 6.4265,
                "poster_path": "/wpchRGhRhvhtU083PfX2yixXtiw.jpg",
                "release_date": "2014-11-24",
                "title": "Paddington",
                "video": false,
                "vote_average": 7.114,
                "vote_count": 3989,
                "character": "Head Geographer",
                "credit_id": "55e419bfc3a3684191003aea",
                "order": 27
            },
            {
                "adult": false,
                "backdrop_path": "/zyWbOvKCdA9V9P5xuUG2eiPYsUo.jpg",
                "genre_ids": [
                    12,
                    14,
                    10751
                ],
                "id": 10601,
                "original_language": "en",
                "original_title": "Peter Pan",
                "overview": "In stifling Edwardian London, Wendy Darling mesmerizes her brothers every night with bedtime tales of swordplay, swashbuckling and the fearsome Captain Hook. But the children become the heroes of an even greater story, when Peter Pan flies into their nursery one night and leads them over moonlit rooftops through a galaxy of stars and to the lush jungles of Neverland.",
                "popularity": 4.8015,
                "poster_path": "/6QdU3TZZrIvXFzoHOwafZAynFjB.jpg",
                "release_date": "2003-12-18",
                "title": "Peter Pan",
                "video": false,
                "vote_average": 7.15,
                "vote_count": 2699,
                "character": "Sir Edward Quiller Couch",
                "credit_id": "5a4fc4f2c3a368741e001e5b",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Geoffrey Dyson Palmer"
        ],
        "biography": "Geoffrey Dyson Palmer, OBE (4 June 1927 - 5 November 2020) was an English actor known for his roles in British television sitcoms playing Jimmy Anderson in The Fall and Rise of Reginald Perrin (1976–79), Ben Parkinson in Butterflies (1978–1983) and Lionel Hardcastle in As Time Goes By (1992–2005). His film appearances include A Fish Called Wanda (1988), The Madness of King George (1994), Mrs. Brown (1997), and Tomorrow Never Dies (1997).\n\nGeoffrey Dyson Palmer was born on 4 June 1927 in North Finchley, Middlesex. He was the son of Frederick Charles Palmer, who was a chartered surveyor, and Norah Gwendolen (née Robins). He attended Highgate School from September 1939 to December 1945. He served as a corporal instructor in small arms and field training in the Royal Marines during his national service from 1946 to 1948, following which he briefly worked as an unpaid trainee assistant stage manager.\n\nPalmer's early television appearances included multiple roles in episodes of The Army Game (Granada Television), two episodes of The Baron and as a property agent in Cathy Come Home (1966). After a major break in John Osborne's West of Suez at the Royal Court with Ralph Richardson, he acted in major productions at the Royal Court and for the National Theatre Company and was directed by Laurence Olivier in J. B. Priestley's Eden End. Palmer found the play so dull, however, that he was deterred from a stage career.\n\nTwo BBC sitcom roles brought him attention in the 1970s: the hapless brother-in-law of Reggie Perrin in The Fall and Rise of Reginald Perrin (1976–79), and the phlegmatic dentist Ben Parkinson in Butterflies (1978–1983).\n\nIn 1978, Palmer appeared as organized crimelord Simon Sinclair in London Weekend Television's hard-hitting police drama The Professionals, the episode entitled \"Where the Jungle Ends\".\n\nPalmer played Doctor Price in the Fawlty Towers episode \"The Kipper and the Corpse\" (1979), determined to have breakfast amidst the confusion caused by the death of a guest and Fawlty's inept way of handling the emergency. In 1986, Palmer appeared as Donald Fairchild in the first series of an ITV sitcom, Executive Stress, alongside Penelope Keith. He later left, and was replaced by Peter Bowles.\n\nPalmer later starred opposite Judi Dench for over a decade in another BBC sitcom, As Time Goes By (1992–2005). In 1997, he also appeared with Dench in the James Bond film Tomorrow Never Dies, in which he portrayed Admiral Roebuck to Dench's M, and Mrs Brown, playing Sir Henry Ponsonby to Dench's Queen Victoria.\n\nPalmer married Sally Green in 1963. They had a daughter, Harriet, and a son, Charles, a television director. Palmer was a longtime resident of Lee Common in the Chiltern Hills, Buckinghamshire, and enjoyed fly fishing in his spare time. At the time of his death, he resided in Berkhamsted, Hertfordshire.\n\nPalmer died peacefully at his home on 5 November 2020, aged 93.",
        "birthday": "1927-06-04",
        "deathday": "2020-11-05",
        "gender": 2,
        "homepage": null,
        "id": 10746,
        "imdb_id": "nm0658244",
        "known_for_department": "Acting",
        "name": "Geoffrey Palmer",
        "place_of_birth": "Finchley, Middlesex, England, UK",
        "popularity": 0.4147,
        "profile_path": "/wfFydeTnTIdtu8oKcY7SCo7u7pg.jpg"
    }
}