{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mFfyE5DPFDqoes4HIcElHc2a15y.jpg",
                "genre_ids": [
                    18
                ],
                "id": 334,
                "original_language": "en",
                "original_title": "Magnolia",
                "overview": "On one random day in the San Fernando Valley, a dying father, a young wife, a male caretaker, a famous lost son, a police officer in love, a boy genius, an ex-boy genius, a game show host and an estranged daughter will each become part of a dazzling multiplicity of plots, but one story.",
                "popularity": 8.2737,
                "poster_path": "/tpfC325Jk6S38VTe5dDWjWtoyxr.jpg",
                "release_date": "1999-12-17",
                "title": "Magnolia",
                "video": false,
                "vote_average": 7.729,
                "vote_count": 3744,
                "character": "Burt Ramsey / Narrator",
                "credit_id": "52fe4239c3a36847f800d703",
                "order": 12
            },
            {
                "adult": false,
                "backdrop_path": "/bQEIYntlPba76NN41uWxIzUmzBb.jpg",
                "genre_ids": [
                    18
                ],
                "id": 4995,
                "original_language": "en",
                "original_title": "Boogie Nights",
                "overview": "Set in 1977, back when sex was safe, pleasure was a business and business was booming, idealistic porn producer Jack Horner aspires to elevate his craft to an art form. Horner discovers Eddie Adams, a hot young talent working as a busboy in a nightclub, and welcomes him into the extended family of movie-makers, misfits and hangers-on that are always around. Adams' rise from nobody to a celebrity adult entertainer is meteoric, and soon the whole world seems to know his porn alter ego, \"Dirk Diggler\". Now, when disco and drugs are in vogue, fashion is in flux and the party never seems to stop, Adams' dreams of turning sex into stardom are about to collide with cold, hard reality.",
                "popularity": 13.5173,
                "poster_path": "/wnE24UPCPQsQnbBOu4zVE2qaDNm.jpg",
                "release_date": "1997-10-10",
                "title": "Boogie Nights",
                "video": false,
                "vote_average": 7.634,
                "vote_count": 3314,
                "character": "Kurt Longjohn",
                "credit_id": "52fe43edc3a36847f8078b01",
                "order": 12
            },
            {
                "adult": false,
                "backdrop_path": "/yCnJT53HMXAK87xzPAdjdYhZ3JE.jpg",
                "genre_ids": [
                    18,
                    9648,
                    878
                ],
                "id": 1124,
                "original_language": "en",
                "original_title": "The Prestige",
                "overview": "A mysterious story of two magicians whose intense rivalry leads them on a life-long battle for supremacy -- full of obsession, deceit and jealousy with dangerous and deadly consequences.",
                "popularity": 11.832,
                "poster_path": "/2ZOzyhoW08neG27DVySMCcq2emd.jpg",
                "release_date": "2006-10-17",
                "title": "The Prestige",
                "video": false,
                "vote_average": 8.204,
                "vote_count": 16794,
                "character": "Milton",
                "credit_id": "55044ad39251412bfa000ec4",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Richard Jay Potash"
        ],
        "biography": "Ricky Jay (born Richard Jay Potash) was an actor, magician, cardsharp, and film consultant. Ricky's love and deep study of card tricks and deception gained him worldwide fame and respect, and he was often called in to consult for movies and TV shows where deception was a key element of the story. Ricky was an exceptional close-up magician and playing-card handler, but he also acted in movies such as Boogie Nights, Tomorrow Never Dies, and Magnolia, as well as TV shows like the X-Files, HBO's Deadwood, and David Mamet's The Unit, always playing intense characters who seemed to know everything but only handed out information in riddles and suggestions.",
        "birthday": "1946-06-26",
        "deathday": "2018-11-24",
        "gender": 2,
        "homepage": null,
        "id": 10743,
        "imdb_id": "nm0419633",
        "known_for_department": "Acting",
        "name": "Ricky Jay",
        "place_of_birth": "Brooklyn, New York City, New York, USA",
        "popularity": 0.4683,
        "profile_path": "/xtJvNUSwIOKZ4Z4SDOYjPhvdtIN.jpg"
    }
}