{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rl95VDEP3nsUQmGzE0S1S7y6T0N.jpg",
                "genre_ids": [
                    10752,
                    28
                ],
                "id": 190859,
                "original_language": "en",
                "original_title": "American Sniper",
                "overview": "U.S. Navy SEAL Chris Kyle takes his sole mission—protect his comrades—to heart and becomes one of the most lethal snipers in American history. His pinpoint accuracy not only saves countless lives but also makes him a prime target of insurgents. Despite grave danger and his struggle to be a good husband and father to his family back in the States, Kyle serves four tours of duty in Iraq. However, when he finally returns home, he finds that he cannot leave the war behind.",
                "popularity": 8.8358,
                "poster_path": "/i1U46OwMc6vlm7OoSUKfqUH615e.jpg",
                "release_date": "2014-12-25",
                "title": "American Sniper",
                "video": false,
                "vote_average": 7.418,
                "vote_count": 13266,
                "character": "The Butcher",
                "credit_id": "5636a5ec9251413b4600d8c0",
                "order": 30
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Mido Hamada (born 1971) is a German-Egyptian actor having played roles in film, theater and television. Hamada attended the Oxford School of Drama. He lives in London, England. His roles include Ahmed Shah Massoud in the television mini-series The Path to 9/11 and smaller roles in the British television series \"Hannibal\" and \"Feel the Force\". In 2004, he also played a role in the blockbuster film, Sky Captain and the World of Tomorrow. Hamada has most recently finished shooting a film \"The Situation\" in which he played Zaid, an Iraqi photographer. Hamada appeared in the Fox hit series 24 as Samir Mehran. Samir, a rogue intelligence agent from the fictional Middle-Eastern country of Kamistan attempting to, and later successfully assassinating its elected president, Omar Hassan (Anil Kapoor). He served as the season's arch-villain for most of its episodes.",
        "birthday": "1971-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": "https://waringandmckenna.com/clients/mido-hamada/",
        "id": 107561,
        "imdb_id": "nm1715024",
        "known_for_department": "Acting",
        "name": "Mido Hamada",
        "place_of_birth": "Cairo, Egypt",
        "popularity": 0.2797,
        "profile_path": "/iSQsrTcaMu4agVwRWfMpUTrwBzL.jpg"
    }
}