{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gZWl93sf8AxavYpVT1Un6EF3oCj.jpg",
                "genre_ids": [
                    80,
                    53,
                    18
                ],
                "id": 475557,
                "original_language": "en",
                "original_title": "Joker",
                "overview": "During the 1980s, a failed stand-up comedian is driven insane and turns to a life of crime and chaos in Gotham City while becoming an infamous psychopathic crime figure.",
                "popularity": 15.2359,
                "poster_path": "/udDclJoHjfjb8Ekgsd4FDteOkCU.jpg",
                "release_date": "2019-10-01",
                "title": "Joker",
                "video": false,
                "vote_average": 8.133,
                "vote_count": 26800,
                "character": "Band Leader",
                "credit_id": "5d9d1027839018001e060ef8",
                "order": 52
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Born in Anchorage, Alaska, Keith grew up loving the outdoors, skiing, fishing, and camping until his parents returned to their roots in the Amish country of Western Pennsylvania. It was here, during his teenage years that he discovered music, acting and theatre. He received a bachelors degree in music education/trumpet from Clarion University and then spent the next three years as a high school band director in Northwestern Pa. From there, he moved to South Florida to work on a masters degree from the University of Miami in theatre/voice. After graduating, New York became his home as he pursued his love affair with story telling and performance.\n\nWithin three years, he was co-starring with Tammy Grimes, Off-Broadway in \"Mademoiselle Colombe\", when Harold Prince saw his work and invited him to join the Broadway company of \"Phantom Of The Opera\". Since then he has starred in Broadway productions working with Stephen Sondheim and John Doyle, regional theatre, opera, and an appearance at the White House for President George H. Bush. Symphonic concerts have taken him all over the world with Skitch Henderson and Peter Nero.\n\nEarly television appearances lead to more definitive work in film and episodic television, including \"The Marvelous Mrs. Maisel\", \"Royal Pains\" and \"Sex&Drugs&Rock&Roll\". Recent film work includes \"Joker\", \"Red\", \"Diving Normal\", and \"Crime Partners\".\n\nAs a writer, his screen play \"Conduit\" finds the most cynical woman on earth traveling through time to alter the events of 33 AD. Outrageous exploits and shocking discoveries force her to confront personal demons or risk a cataclysmic change of history.\n\nKeith continues to make the New York area a home for his family, and when he's not busy on set or in the theatre, he spends much of his time pursing his love for flying. As a single engine pilot, his perfect weekend is a flight to some location where he can return to the outdoors, golfing, scuba diving, skiing, camping or fishing.\n\n(Biography by SYI.)",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 107509,
        "imdb_id": "nm2244474",
        "known_for_department": "Acting",
        "name": "Keith Buterbaugh",
        "place_of_birth": null,
        "popularity": 0.0473,
        "profile_path": "/7n0VSMTeyTuvLfgv7x2TLG0YD9G.jpg"
    }
}