{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lFLQNIkNVIHLXNVDHbt4pow4lXc.jpg",
                "genre_ids": [
                    18,
                    10749,
                    36
                ],
                "id": 423612,
                "original_language": "de",
                "original_title": "Werk ohne Autor",
                "overview": "German artist Kurt Barnert has escaped East Germany and now lives in West Germany, but is tormented by his childhood under the Nazis and the GDR regime.",
                "popularity": 1.1593,
                "poster_path": "/fn0Tp9SG0IQ3Nx8iHPYPiseLMWd.jpg",
                "release_date": "2018-10-03",
                "title": "Never Look Away",
                "video": false,
                "vote_average": 7.77,
                "vote_count": 714,
                "character": "Elisabeth May",
                "credit_id": "586987d09251414e8201079c",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Saskia-Sophie Rosendahl"
        ],
        "biography": "Saskia-Sophie Rosendahl (born 9 July 1993) is a German actress. She is best known for her role in the film Lore (2012), for which she won the AACTA Award for Best Young Actor.\n\nSaskia Rosendahl began her career with the children's ballet of the Halle Opera, with which she performed various theatre appearances from 2001 to 2011. From 2008 to 2011 she worked as an actress in productions of the improvisational theatre \"Kaltstart\" and the New Theatre Halle. In 2010, Rosendahl made her cinema debut in Wolfgang Dinslage's film Für Elise. In 2011, while still at school, she took on the lead role in Cate Shortland's German-language anti-war drama Lore, which won the audience award at the Locarno Film Festival in 2012 and was the official Australian entry for the 2013 Academy Awards in the category “Best Foreign Language Film”. The magazine Variety praised the maturity and security of the portrayal of her complex role and called Rosendahl an \"exciting new talent\". At the 23rd Stockholm International Film Festival, she received the award for “Best Actress” for her role in Lore, and at the presentation of the Australian AACTA Award in 2013, she was honored as the best young actress.\n\nShe graduated from school in 2012 and was part of the ensemble of Vivian Naefe's cinema adaptation of the book bestseller The Taste of Apple Seeds. From August to October 2012, she was directed by Denis Dercourt in a leading role in the movie A Pact in front of the camera. At the Berlinale 2013, Rosendahl was presented by the European Film Promotion as one of the ten European “Shooting Stars”. In the same year, she received a nomination for the New Faces Award for Best Young Actress. In Lindenberg! Do your thing (2020) she plays Petra, immortalized in the song \"Mädchen aus Ostberlin\" by Udo Lindenberg.",
        "birthday": "1993-07-09",
        "deathday": null,
        "gender": 1,
        "homepage": "https://players.de/actresses/saskia-rosendahl/",
        "id": 1075020,
        "imdb_id": "nm4551978",
        "known_for_department": "Acting",
        "name": "Saskia Rosendahl",
        "place_of_birth": "Halle an der Saale, Germany",
        "popularity": 0.3434,
        "profile_path": "/cuUFQveV590Qnfr4CgVq9Tp0ecV.jpg"
    }
}