{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9oI4ImMclu3l0OHaK7o9eELfL3l.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 375785,
                "original_language": "en",
                "original_title": "Then Came You",
                "overview": "An American hypochondriac who is working as a baggage handler is forced to confront his fears when a British teenager with a terminal illness enlists him to help her carry out her eccentric bucket list.",
                "popularity": 2.5009,
                "poster_path": "/658QP5tmBRUlE5JvxOnnmITfG1F.jpg",
                "release_date": "2018-12-05",
                "title": "Then Came You",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 521,
                "character": "Greg",
                "credit_id": "5c12b1d09251415b13f76662",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/oOZM1C3wZtsZtdidVgEazeas7U4.jpg",
                "genre_ids": [
                    10749,
                    35
                ],
                "id": 727745,
                "original_language": "en",
                "original_title": "The Kissing Booth 3",
                "overview": "It’s the summer before Elle heads to college, and she has a secret decision to make. Elle has been accepted into Harvard, where boyfriend Noah is matriculating, and also Berkeley, where her BFF Lee is headed and has to decide if she should stay or not.",
                "popularity": 4.2845,
                "poster_path": "/c7xcqnMDVQ5v1hJBm3AZ5YikNe6.jpg",
                "release_date": "2021-08-11",
                "title": "The Kissing Booth 3",
                "video": false,
                "vote_average": 6.877,
                "vote_count": 1965,
                "character": "Westin Barkley",
                "credit_id": "6113d0e37707000045286a88",
                "order": 32
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Colin Moss was born in Johannesburg, South Africa to parents Veronica Salt and Richard Moss. He is of English (his paternal grandfather was a Cockney), Irish (maternal & paternal), Germanic and South African heritage. Colin started his career on the South African stand-up and improv comedy circuit and continues to perform comedy between acting gigs. He studied acting at the University of Kwazulu-Natal and later went on to become a household name with appearances on a host of popular South African television series and films.\n\nHis international film roles have included playing Officer DeWitt in the period drama, The World Unseen, which won several awards on the international festival circuit. He followed this with a lead role in Surviving Evil - playing alongside an international cast including Billy Zane, the role of Max in a BBC adaptation of D.H. Lawrence's Women in Love, opposite Rosamund Pike and the role of Kevin Fuller in Momentum, starring opposite Olga Kurylenko, James Purefoy and Morgan Freeman. His theatre roles include that Tom in Neil LaBute's Fat Pig and Paul in David Hare's My Zinc Bed.\n\nColin relocated to New York City in 2015, looking for fresh challenges and new opportunities and was quickly signed by The Talent House. The first job he booked in New York was a recurring role (Justin Boden) on Marvel's hit Netflix series, Jessica Jones, playing opposite David Tennant and Krysten Ritter. He has since booked the role of Anthony in the latest season of Netflix's Black Mirror, working with Bryce Dallas Howard and Alice Eve, David Simon's The Deuce for HBO, working opposite Maggie Gyllenhaal, a supporting role in Peter Hutchings film, Then Came You, with Masie Williams, Asa Butterfield and Sonya Walger and the role of Drew Conrad in Christmas in the Wild, starring Rob Lowe and Kristin Davis. 2019 saw Colin book the role of Hath in SyFy Channel's Vagrant Queen, his first series regular role for an American channel.",
        "birthday": "1976-02-09",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 107525,
        "imdb_id": "nm1412503",
        "known_for_department": "Acting",
        "name": "Colin Moss",
        "place_of_birth": "Johannesburg, South Africa",
        "popularity": 0.1974,
        "profile_path": "/3aMvZxFFqIuLQLijW2X5TXEHMhs.jpg"
    }
}