{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7D1v3y0RPoyJBZAx4eGdjcqJUuD.jpg",
                "genre_ids": [
                    12,
                    35,
                    18
                ],
                "id": 17379,
                "original_language": "en",
                "original_title": "Last Holiday",
                "overview": "The discovery that she has a terminal illness prompts introverted department store saleswoman Georgia Byrd to reflect on what she realizes has been an overly cautious life. With weeks to live, she withdraws her life savings, sells all her possessions and jets off to Europe where she lives it up at a posh hotel. Upbeat and passionate, Georgia charms everybody she meets, including renowned Chef Didier. The only one missing from her new life is her longtime crush Sean Matthews.",
                "popularity": 4.2064,
                "poster_path": "/hRNZszPHjIpYGlrMN3o4f6f6cVd.jpg",
                "release_date": "2006-01-13",
                "title": "Last Holiday",
                "video": false,
                "vote_average": 7.219,
                "vote_count": 807,
                "character": "Smokey Robinson",
                "credit_id": "63a3ca0c64f716007c54081e",
                "order": 47
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Smokey Robinson & The Miracles ",
            "Smokey Robinson and The Miracles",
            " William 'Smokey' Robinson"
        ],
        "biography": "William \"Smokey\" Robinson Jr. is an American singer, songwriter, record producer, and former record executive. Robinson was the founder and frontman of the Motown vocal group the Miracles, for which he was also chief songwriter and producer. Robinson led the group from its 1955 origins as \"the Five Chimes\" until 1972, when he announced a retirement from the group to focus on his role as Motown's vice president. However, Robinson returned to the music industry as a solo artist the following year. Following the sale of Motown Records in 1988, Robinson left the company in 1990.\n\nRobinson was inducted into the Rock and Roll Hall of Fame in 1987, and was awarded the 2016 Library of Congress Gershwin Prize for his lifetime contributions to popular music.",
        "birthday": "1940-02-19",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 107617,
        "imdb_id": "nm0005373",
        "known_for_department": "Acting",
        "name": "Smokey Robinson",
        "place_of_birth": "Detroit, Michigan, USA",
        "popularity": 0.1061,
        "profile_path": "/uAvpLcAVrZ2w4BvLYRGJpscDJ0P.jpg"
    }
}