{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2EfbAWLq8s2f1LxTAIuLGYpKETV.jpg",
                "genre_ids": [
                    12,
                    28,
                    14
                ],
                "id": 8009,
                "original_language": "en",
                "original_title": "Highlander",
                "overview": "He fought his first battle on the Scottish Highlands in 1536. He will fight his greatest battle on the streets of New York City in 1986. His name is Connor MacLeod. He is immortal.",
                "popularity": 6.3538,
                "poster_path": "/8Z8dptJEypuLoOQro1WugD855YE.jpg",
                "release_date": "1986-03-07",
                "title": "Highlander",
                "video": false,
                "vote_average": 6.872,
                "vote_count": 2745,
                "character": "Michael PS Hayes (uncredited)",
                "credit_id": "627c3259967cc7006776147b",
                "order": 38
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Michael Hayes",
            "\t Dok Hendrix",
            "Lord Michael Hayes",
            "Screaming Eagle",
            "Freebird Michael Hayes",
            "Michael \"P.S.\" Hayes"
        ],
        "biography": "Michael Seitz is an American retired professional wrestler and former musician. Seitz is best known for leading The Fabulous Freebirds under the ring name Michael \"P.S.\" (\"Purely Sexy\")Hayes and for his role as an announcer under the name Dok Hendrix in WWE. He currently works with WWE as one of the senior producers.  He then became a backstage road agent (producer) and color commentator for WWE. Initially appearing for one night on the September 23, 1999 broadcast of SmackDown!, Hayes became a color commentator on Sunday Night Heat alongside Michael Cole and Kevin Kelly from 2000 to 2001, although he was mostly used on the international broadcasts of that show. At WrestleMania X-Seven on April 1, 2001, he competed in the gimmick Battle Royal, but was eliminated by The One Man Gang.\n\nIn October 2006, Hayes became the head creative writer for the SmackDown brand after Alex Greenfield's departure from the company. He can be seen on the second season of WWE Classics on Demand series Legends of Wrestling.\n\nHayes made occasional appearances on WWE programs: on the December 7, 2007 episode of SmackDown, Hayes was a guest of MVP's VIP Lounge. Hayes promoted the new Triumph and Tragedy of WCCW DVD and reinforced its anti-drug message. However, Hayes ended up being attacked by MVP before being saved by Rey Mysterio, Jr.\n\nIn October 2013, Hayes took a leave of absence from WWE for personal reasons,but he returned to work on December 2, 2013.\n\nOn August 1, 2014 Hayes appeared in a short segment on the online series JBL and Cole Show in which he stared at a \"Free Birds, call to enquire\" flier. In February 2015, Hayes partook in a WWE.com interview alongside Arn Anderson with Michael Cole to discuss Triple H and Sting's match at WrestleMania 31.\n\nOn April 2, 2016, Hayes was inducted into the WWE Hall of Fame with the Fabulous Freebirds. Hayes accepted the award alongside Jimmy Garvin.\n\nIn 1987, on the back of the popularity of the \"Badstreet USA\" theme, Hayes recorded and released an album, Off The Streets. He also performed live concerts to promote the album with his backing band, the Badstreet Band. The July 1988 issue of Pro Wrestling Illustrated (written circa March 1988) contained a bcolumn by writer Dave Rosenbaum in which he visited the box office for a Badstreet Band show and surveyed what sort of people would actually go to Hayes' concerts.\n\nIn 1992, Hayes performed a duet with music producer Darwin Conort called \"Freebird Forever\" on the WCW album, Slam Jam 1.\n\nIn 2011, Hayes paid tribute to his Freebird brother Terry Gordy, who died of a heart attack caused by a blood clot in 2001, with a song entitled \"Freebird Road\". His music video was an emotional and stirring trip down memory lane as a Freebird and shows shots of him at Gordy's grave.",
        "birthday": "1959-03-29",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1076817,
        "imdb_id": "nm0782721",
        "known_for_department": "Acting",
        "name": "Michael Seitz",
        "place_of_birth": "Pensacola, Florida, USA",
        "popularity": 1.0446,
        "profile_path": "/82dSkdwQ1YyQJchAY4LtSM8C3SK.jpg"
    }
}