{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lkdP7XOj3OnbeyVP79Rbxckkz5R.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 29458,
                "original_language": "it",
                "original_title": "I cento passi",
                "overview": "Peppino Impastato is a quick-witted lad growing up in 1970s Sicily. Despite hailing from a family with Mafia ties and living just one hundred steps from the house of local boss Tano Badalamenti, Peppino decides to expose the Mafia by using a pirate radio station to broadcast his political pronouncements in the form of ironic humour.",
                "popularity": 4.1217,
                "poster_path": "/dpQpjLslfQlpDv7eCVRDPQAKgqs.jpg",
                "release_date": "2000-09-01",
                "title": "One Hundred Steps",
                "video": false,
                "vote_average": 7.806,
                "vote_count": 705,
                "character": "Giovanni Impastato",
                "credit_id": "52fe45e1c3a368484e074537",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/lzSEhkipvwLLmL3PUIDreQCJdqs.jpg",
                "genre_ids": [
                    18,
                    35,
                    10749
                ],
                "id": 25846,
                "original_language": "it",
                "original_title": "Baarìa",
                "overview": "Giuseppe Tornatore traces three generations of a Sicilian family in in the Sicilian town of Bagheria (known as Baarìa in the local Sicilian dialect), from the 1930s to the 1980s, to tell the story of the loves, dreams and delusions of an unusual community.",
                "popularity": 2.4397,
                "poster_path": "/rmXfpOSsgX7uLzScCodIZP4Kcke.jpg",
                "release_date": "2009-09-25",
                "title": "Baaria",
                "video": false,
                "vote_average": 7.236,
                "vote_count": 649,
                "character": "maestro di catechismo",
                "credit_id": "59684b79925141329c00fb85",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Nasce a Palermo il 27 maggio del 1974, secondo di quattro figli. Dopo la maturità classica, si iscrive all'università per studiare Lettere Antiche, facoltà che abbandona dopo due anni per l'Accademia Nazionale d'Arte Drammatica Silvio D'Amico di Roma, dove si diploma nel 1998 (frequenta inoltre diversi laboratori teatrali, in Italia e all'estero). Dopo aver debuttato in teatro, alterna il lavoro teatrale con quello televisivo e cinematografico.\n\nNel 2000 appare sul grande schermo con i film Il manoscritto del principe di Roberto Andò, che parla della stesura de Il Gattopardo da parte di Tomasi di Lampedusa, e I cento passi di Marco Tullio Giordana, in cui interpreta il ruolo del fratello di Peppino Impastato, ucciso dalla mafia. Dello stesso anno è il cortometraggio L'affresco di Marco Bellocchio, a cui fanno seguito, tra l'altro, il film Paz! (2002) e vari lavori televisivi: Francesco (2002), Giulio Cesare (2002) e L'inganno (2003).\n\nNel 2002 esce il film El Alamein, diretto da Enzo Monteleone, dove interpreta il ruolo di un soldato italiano che, nell'ottobre del 1942, è bloccato presso El Alamein insieme a suoi compagni (Pierfrancesco Favino, Emilio Solfrizzi, Silvio Orlando e Roberto Citran). Grazie alla sua interpretazione, nel 2003 vince il Globo d'Oro come migliore attore esordiente.\n\nSuccessivamente è nel cast di Buongiorno, notte (2003), ancora diretto da Marco Bellocchio, a cui fanno seguito i film Movimenti e Stai con me, entrambi del 2004, Ma quando arrivano le ragazze? (2005) di Pupi Avati, e La terra (2006), regia di Sergio Rubini, per cui ottiene la nomination come Migliore Attore Rivelazione.\n\nTra gli altri suoi lavori, ricordiamo le fiction tv: Giovanni Falcone, l'uomo che sfidò Cosa Nostra di Andrea ed Antonio Frazzi (2006), Caravaggio, Il figlio della luna ed Era mio fratello, e i film: L'abbuffata e Non pensarci, tutti del 2007, ma quest'ultimo uscito nelle sale il 4 aprile 2008.\n\nNel 2009 ritorna nelle sale cinematografiche con i film: La siciliana ribelle, regia di Marco Amenta, Baarìa, regia di Giuseppe Tornatore, Tris di donne &amp; abiti nuziali, regia di Vincenzo Terracciano, La cosa giusta, regia di Marco Campogiani.\n\nA aprile 2010 esce nelle sale l'opera prima dell'attore/regista Rocco Papaleo, Basilicata coast to coast, che vede Briguglia tra i protagonisti insieme allo stesso Papaleo, Alessandro Gassman, Giovanna Mezzogiorno e, al suo debutto come attore, il cantante Max Gazzè.\n\nhttp://it.wikipedia.org/wiki/Paolo_Briguglia",
        "birthday": "1974-05-27",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 107626,
        "imdb_id": "nm0109277",
        "known_for_department": "Acting",
        "name": "Paolo Briguglia",
        "place_of_birth": "Palermo, Italy",
        "popularity": 0.0867,
        "profile_path": "/m5zgv4OzYydp05xfdmaOJ9BkVhY.jpg"
    }
}