{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tb0uo01w2kDHiQwTszsLlSusAm4.jpg",
                "genre_ids": [
                    28,
                    878,
                    27
                ],
                "id": 315011,
                "original_language": "ja",
                "original_title": "シン・ゴジラ",
                "overview": "When a massive, gilled monster emerges from the deep and tears through the city, the government scrambles to save its citizens.  A rag-tag team of volunteers cuts through a web of red tape to uncover the monster's weakness and its mysterious ties to a foreign superpower.  But time is not on their side - the greatest catastrophe to ever befall the world is about to evolve right before their very eyes.",
                "popularity": 7.8766,
                "poster_path": "/jPNShaWZMpVF0iQ7j1dvTuZLD20.jpg",
                "release_date": "2016-07-29",
                "title": "Shin Godzilla",
                "video": false,
                "vote_average": 7.218,
                "vote_count": 1449,
                "character": "Biology Professor",
                "credit_id": "5764cbb1925141681e0002b2",
                "order": 41
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Kazuo Hara (原一男 Hara Kazuo, born 8 June 1945) is a Japanese documentary film director. After dropping out of university to work at a special education school, he made his 1972 debut work Goodbye CP about a group of individuals with cerebral palsy. He won the award for Best Director at the 12th Hochi Film Award and at the 9th Yokohama Film Festival for The Emperor's Naked Army Marches On. That film also earned him the Directors Guild of Japan New Directors Award. In 2017 he released the documentary Sennan Asbestos Disaster which received the 2017 Audience Award at the Tokyo Filmex International Film Festival and the 2017 BIFF Mecenat Award at the Busan International Film Festival. His documentary works often depict people who push against the boundaries of propriety and obedience in Japanese society.",
        "birthday": "1945-06-08",
        "deathday": null,
        "gender": 2,
        "homepage": "http://docudocu.jp/",
        "id": 1077301,
        "imdb_id": "nm0361672",
        "known_for_department": "Directing",
        "name": "Kazuo Hara",
        "place_of_birth": "Ube, Yamaguchi, Japan",
        "popularity": 1.4989,
        "profile_path": "/eVcCt8yNWSbGKLWF8epCGpG6YlY.jpg"
    }
}