{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/x4biAVdPVCghBlsVIzB6NmbghIz.jpg",
                "genre_ids": [
                    37
                ],
                "id": 429,
                "original_language": "it",
                "original_title": "Il buono, il brutto, il cattivo",
                "overview": "While the Civil War rages on between the Union and the Confederacy, three men – a quiet loner, a ruthless hitman, and a Mexican bandit – comb the American Southwest in search of a strongbox containing $200,000 in stolen gold.",
                "popularity": 13.3055,
                "poster_path": "/bX2xnavhMYjWDoZp1VM6VnU1xwe.jpg",
                "release_date": "1966-12-22",
                "title": "The Good, the Bad and the Ugly",
                "video": false,
                "vote_average": 8.464,
                "vote_count": 9165,
                "character": "Storekeeper",
                "credit_id": "631efed5b87aec007f89c144",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Vincenzo Squatriti"
        ],
        "biography": "Enzo Petito (24 July 1897 – 17 July 1967) was an Italian film and stage character actor. A theatre actor under Eduardo De Filippo in the 1950s in the Teatro San Ferdinando of Naples, with whom he was professionally closely associated, Petito also appeared in several of his films, often co-starring Eduardo or/and brother, Peppino De Filippo, brothers who are considered to be amongst the greatest Italian actors of the 20th century. Petito played minor roles in some memorable commedia all'Italiana movies directed by the likes of Dino Risi and Mario Monicelli in the late 1950s and early 1960s, often appearing alongside actors such as Nino Manfredi, Alberto Sordi, Peppino De Filippo, Anna Maria Ferrero, and Totò.\n\nAlthough never a leading actor, he made a number of small appearances as character actors alongside Italy's leading film stars in films throughout the early to mid-1960s and is arguably best known in world cinema for his role as the store keeper in the Sergio Leone classic Spaghetti Western film The Good, the Bad and the Ugly in 1966. His roles ranged from storekeepers and cobblers to priests and homeless men. His role of most esteem, however, is perhaps as Napoleon in Sergio Corbucci's comedy Chi si ferma è perduto in 1963.",
        "birthday": "1897-07-24",
        "deathday": "1967-07-17",
        "gender": 2,
        "homepage": null,
        "id": 1077276,
        "imdb_id": "nm0677654",
        "known_for_department": "Acting",
        "name": "Enzo Petito",
        "place_of_birth": "Naples, Italy",
        "popularity": 0.8689,
        "profile_path": null
    }
}