{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lgrgEf43kYFm9mh6pj8ArcaxUbd.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 191714,
                "original_language": "hi",
                "original_title": "The Lunchbox",
                "overview": "A mistaken delivery in Mumbai's famously efficient lunchbox delivery system (Mumbai's Dabbawallahs) connects a young housewife to a stranger in the dusk of his life. They build a fantasy world together through notes in the lunchbox. Gradually, this fantasy threatens to overwhelm their reality.",
                "popularity": 3.6329,
                "poster_path": "/jSOiz1h97i3qwjZJXY8SeLvjPsl.jpg",
                "release_date": "2013-09-20",
                "title": "The Lunchbox",
                "video": false,
                "vote_average": 7.36,
                "vote_count": 752,
                "character": "Ila",
                "credit_id": "52fe4c8f9251416c910f8cd7",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "نیمرات کور"
        ],
        "biography": "Nimrat Kaur is an Indian actress who appears in Hindi films and on American television.  She began her career as a print model in Mumbai and then started working as a theater actress.  Kaur was launched in a two-part music video for the songs \"Tera Mera Pyar\" by Kumar Sanu and \"Yeh Kya Hua\" by Shreya Ghoshal in 2004.\n\nKaur made her film debut with a small role in an English film - One Night with the King (2006).  Kaur starred in Anurag Kashyap's production Peddlers (2012), her debut hindi film, which was screened at the 2012 Cannes Film Festival, followed by The Lunchbox (2013) with Irrfan Khan, which was screened at the 2013 Cannes Film Festival.  In 2015, she starred in Showtime's TV series Homeland playing the role of Tasneem Qureshi, an ISI Agent.",
        "birthday": "1982-03-13",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1077932,
        "imdb_id": "nm1909661",
        "known_for_department": "Acting",
        "name": "Nimrat Kaur",
        "place_of_birth": null,
        "popularity": 0.5211,
        "profile_path": "/4cEWXSY4v4ItRQaFmPZStEyxa9D.jpg"
    }
}