{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1YlaU9vXlD4K5EBGZKjaCb9rJb9.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 1955,
                "original_language": "en",
                "original_title": "The Elephant Man",
                "overview": "A Victorian surgeon rescues a heavily disfigured man being mistreated by his \"owner\" as a side-show freak. Behind his monstrous façade, there is revealed a person of great intelligence and sensitivity. Based on the true story of Joseph Merrick (called John Merrick in the film), a severely deformed man in 19th century London.",
                "popularity": 5.8543,
                "poster_path": "/u0wpPYjuSt8DIe1Y3Vapnh8jcKE.jpg",
                "release_date": "1980-10-09",
                "title": "The Elephant Man",
                "video": false,
                "vote_average": 8.049,
                "vote_count": 3723,
                "character": "Mrs Kendal",
                "credit_id": "52fe4326c3a36847f803df97",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/rQEhJmR9SJ2yJUKjD8RDTagVBHy.jpg",
                "genre_ids": [
                    18,
                    10749,
                    35
                ],
                "id": 37247,
                "original_language": "en",
                "original_title": "The Graduate",
                "overview": "A disillusioned college graduate finds himself torn between his older lover and her daughter.",
                "popularity": 7.8022,
                "poster_path": "/z1Z1tZMR66RxcNeHbwoEhYeqOlP.jpg",
                "release_date": "1967-12-21",
                "title": "The Graduate",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 3502,
                "character": "Mrs. Robinson",
                "credit_id": "52fe46369251416c9104d0a3",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "アン・バンクロフト",
            "Anna Maria Louisa Italiano"
        ],
        "biography": "Anne Bancroft (born Anna Maria Louisa Italiano; September 17, 1931 – June 6, 2005) was an American actress. Respected for her acting prowess and versatility, Bancroft received an Academy Award, three BAFTA Awards, two Golden Globe Awards, two Tony Awards, two Primetime Emmy Awards, and a Cannes Film Festival Award. She is one of only 24 thespians to achieve the Triple Crown of Acting.\n\nBancroft was born Anna Maria Louisa (or Luisa) Italiano on September 17, 1931, in the Bronx, New York City, the middle of three daughters of Mildred (née Di Napoli), a telephone operator, and Michael G. Italiano, a dress pattern maker. Both of her parents' surnames were toponymic. Her parents were Italian immigrants from Southern Italy. In an interview, she stated that her family was originally from Muro Lucano, in the province of Potenza. She was raised in the Roman Catholic faith. Bancroft was raised in Little Italy, in the Belmont neighborhood of the Bronx, attended P.S. 12, later moving to 1580 Zerega Ave.\n\nBancroft's Broadway debut in the two-character drama Two for the Seesaw (1958), brought her wide recognition for the depth of her talent and garnered her a Tony Award for best supporting actress. She won the Academy Award for Best Actress for her performance as Annie Sullivan in The Miracle Worker (1962), and was nominated for an Academy Award for Best Actress for her performance as Mrs. Robinson in The Graduate (1967).\n\nBancroft continued to have a successful career in film and television. She starred in a number of other films, including The Elephant Man (1980), 84 Charing Cross Road (1987), and Agnes of God (1985), for which she was nominated for an Academy Award for Best Actress. She also had a recurring role on the television series Modern Family.\n\nBancroft was married to director Mel Brooks from 1964 until her death in 2005. They had one son, Max Brooks.",
        "birthday": "1931-09-17",
        "deathday": "2005-06-06",
        "gender": 1,
        "homepage": null,
        "id": 10774,
        "imdb_id": "nm0000843",
        "known_for_department": "Acting",
        "name": "Anne Bancroft",
        "place_of_birth": "Bronx, New York, USA",
        "popularity": 1.7641,
        "profile_path": "/ydabiabIsMBe2HsNmx43gBpqzxx.jpg"
    }
}