{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6qOyw4yfzbzTp5YsCX26C28Do0S.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 872,
                "original_language": "en",
                "original_title": "Singin' in the Rain",
                "overview": "In 1927 Hollywood, a silent film star falls for a chorus girl just as he and his paranoid screen partner struggle to make the difficult transition to talking pictures.",
                "popularity": 4.2669,
                "poster_path": "/w03EiJVHP8Un77boQeE7hg9DVdU.jpg",
                "release_date": "1952-04-10",
                "title": "Singin' in the Rain",
                "video": false,
                "vote_average": 8.146,
                "vote_count": 3306,
                "character": "Security Guard (uncredited)",
                "credit_id": "61abeab026346200887d5986",
                "order": 64
            },
            {
                "adult": false,
                "backdrop_path": "/2clBxxclZJ4OK1xzhmCCXHEfy3r.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 759,
                "original_language": "en",
                "original_title": "Gentlemen Prefer Blondes",
                "overview": "Lorelei Lee is a beautiful showgirl engaged to be married to the wealthy Gus Esmond, much to the disapproval of Gus' rich father, Esmond Sr., who thinks that Lorelei is just after his money. When Lorelei goes on a cruise accompanied only by her best friend, Dorothy Shaw, Esmond Sr. hires Ernie Malone, a private detective, to follow her and report any questionable behavior that would disqualify her from the marriage.",
                "popularity": 2.7271,
                "poster_path": "/fDozhst5HVJJcd3BM8ZOsKniO7Q.jpg",
                "release_date": "1953-07-14",
                "title": "Gentlemen Prefer Blondes",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1011,
                "character": "Courtroom Officer (uncredited)",
                "credit_id": "6574de41c6006d01027be9d8",
                "order": 53
            },
            {
                "adult": false,
                "backdrop_path": "/uChOlEWqFwxwJ3eZP9eQj2yqczd.jpg",
                "genre_ids": [
                    35,
                    10402,
                    10749
                ],
                "id": 13368,
                "original_language": "en",
                "original_title": "White Christmas",
                "overview": "Two talented song-and-dance men team up after the war to become one of the hottest acts in show business. In time they befriend and become romantically involved with the beautiful Haynes sisters who comprise a sister act.",
                "popularity": 3.2375,
                "poster_path": "/A5kBQsHKbIptxJyELEpHQJROCRj.jpg",
                "release_date": "1954-10-14",
                "title": "White Christmas",
                "video": false,
                "vote_average": 7.183,
                "vote_count": 540,
                "character": "Nightclub Patron (uncredited)",
                "credit_id": "6648913282e0c772262f7a0f",
                "order": 29
            },
            {
                "adult": false,
                "backdrop_path": "/5zTwAcnI3zCJ0mucPPnoBtkSWEV.jpg",
                "genre_ids": [
                    35,
                    10749,
                    80
                ],
                "id": 239,
                "original_language": "en",
                "original_title": "Some Like It Hot",
                "overview": "Two musicians witness a mob hit and struggle to find a way out of the city. Their only opportunity comes in the form of joining an all-girl band as they prepare to leave on a tour. The two disguise themselves as women and struggle to keep their identities secret as they deal with the problems this brings.",
                "popularity": 6.0458,
                "poster_path": "/hVIKyTK13AvOGv7ICmJjK44DTzp.jpg",
                "release_date": "1959-03-19",
                "title": "Some Like It Hot",
                "video": false,
                "vote_average": 8.096,
                "vote_count": 3670,
                "character": "Police Officer (uncredited)",
                "credit_id": "5e1292bdd8af670014bdd477",
                "order": 55
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "George Howard Blandford"
        ],
        "biography": "Tall distinguished looking George Ford started out as a contract player in the early 1930s but like most contract players, it didn't work out. Never discouraged, Ford moved on to roles as dancers, socialites, and chorus boys. Ford would occasionally have dialog but he was constantly used for his good looking appearance and his unique ability to ballroom dance.\n\nDuring the 1950s, Ford developed a reputation for being one of the best dancers in Hollywood. Musicals weren't his specialty though, it was the nice ballrooms and the socialite parties. He continue to work these throughout his career. He also managed to appear in a lot of various war films playing soldiers and high ranking military officers. With the popularity of television westerns increase, Ford found himself frequently appearing at square dances and as a dancer to show the leading ladies off. Eventually he became a regular townsman for a few years on Gunsmoke appearing in the bar scenes and playing bank tellers and town dignitaries.\n\nBy 1968, Ford's work started to decrease and he decided to retire to Colorado where he could take up skiing and where he and his wife regularly competed in ballroom dancing contest. Like many extras, Ford's talents were not known to the general film public but he leaves behind a legacy of making the other dancers he danced with look better than they were and a large amount of film work that can be appreciated by future generation.",
        "birthday": "1905-03-31",
        "deathday": "1983-07-30",
        "gender": 2,
        "homepage": null,
        "id": 1078774,
        "imdb_id": "nm1843663",
        "known_for_department": "Acting",
        "name": "George Ford",
        "place_of_birth": "Pittsburgh, Pennsylvania, USA",
        "popularity": 0.1698,
        "profile_path": null
    }
}