{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/iB1tCWl4MKl6OO1kMBD5LxM5BmJ.jpg",
                "genre_ids": [
                    14,
                    18,
                    9648
                ],
                "id": 14696,
                "original_language": "ja",
                "original_title": "雨月物語",
                "overview": "In 16th century Japan, peasants Genjuro and Tobei sell their earthenware pots to a group of soldiers in a nearby village, in defiance of a local sage's warning against seeking to profit from warfare. Genjuro's pursuit of both riches and the mysterious Lady Wakasa, as well as Tobei's desire to become a samurai, run the risk of destroying both themselves and their wives, Miyagi and Ohama.",
                "popularity": 3.1302,
                "poster_path": "/r8RiuKTIYIJBjczBVsfeP5C00CJ.jpg",
                "release_date": "1953-03-26",
                "title": "Ugetsu",
                "video": false,
                "vote_average": 7.998,
                "vote_count": 611,
                "character": "Ohama",
                "credit_id": "5e7da1d76c849200166b0c99",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Mitsuko Sekiba",
            "Мицуко Мито"
        ],
        "biography": "Mitsuko Mito (水戸光子 Mito Mitsuko, 23 March 1919 – 5 April 1981) was a Japanese actress. She appeared in more than 50 films between 1935 and 1973. Her real name was Mitsuko Sekiba.\n\nIn 1934, the year after she dropped out of Okazaki Municipal Girls' High School (now Aichi Prefectural Okazaki Kita High School), she moved from the Manpei Hotel in Nagoya to the Manpei Hotel in Atami where she was working. There, she was scouted by Shochiku director Isaburo Inoue, who happened to be staying at the hotel, and joined the Shochiku Kamata Studios .\n\nIn 1945, she married actor Morikawa Shin. She retired from acting and had a child, but divorced the following year. She returned to the big screen early in Omitsu no Endan, released in October of the same year. While she played cheerful, down-to-earth characters, after leaving Shochiku she also broadened her acting range by taking on dirty roles in films such as Woman, Osho, Outcome of War, Ugetsu Monogatari, and An Inn at Osaka.\n\nShe died of a liver tumor on April 5, 1981 at the age of 62.",
        "birthday": "1919-03-23",
        "deathday": "1981-04-05",
        "gender": 1,
        "homepage": null,
        "id": 108021,
        "imdb_id": "nm0593930",
        "known_for_department": "Acting",
        "name": "Mitsuko Mito",
        "place_of_birth": "Onuma District, Fukushima Prefecture, Japan",
        "popularity": 0.1898,
        "profile_path": "/kCyFyOJieZ70TnYUmGQatdzET4n.jpg"
    }
}