{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/vUuMauTTlsp7LB9dN9phXA0i9Nd.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 1824,
                "original_language": "en",
                "original_title": "50 First Dates",
                "overview": "Henry is a player skilled at seducing women. But when this veterinarian meets Lucy, a girl with a quirky problem when it comes to total recall, he realizes it's possible to fall in love all over again…and again, and again. That's because the delightful Lucy has no short-term memory, so Henry must woo her day after day until he finally sweeps her off her feet.",
                "popularity": 7.0898,
                "poster_path": "/4T0cSswKtXk37r0QbqoLbTtlbO1.jpg",
                "release_date": "2004-02-13",
                "title": "50 First Dates",
                "video": false,
                "vote_average": 6.872,
                "vote_count": 7440,
                "character": "Nick",
                "credit_id": "52fe4318c3a36847f8039b83",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/zJeYB7rX1kg5kVmzB0kxbvxmYOl.jpg",
                "genre_ids": [
                    18
                ],
                "id": 87093,
                "original_language": "en",
                "original_title": "Big Eyes",
                "overview": "In the late 1950s and early '60s, artist Walter Keane achieves unbelievable fame and success with portraits of saucer-eyed waifs. However, no one realizes that his wife, Margaret, is the real painter behind the brush. Although Margaret is horrified to learn that Walter is passing off her work as his own, she is too meek to protest too loudly. It isn't until the Keanes' marriage comes to an end and a lawsuit follows that the truth finally comes to light.",
                "popularity": 3.1327,
                "poster_path": "/203HAjJcLMl7xThcTqZx4zmEGcV.jpg",
                "release_date": "2014-12-24",
                "title": "Big Eyes",
                "video": false,
                "vote_average": 6.979,
                "vote_count": 3541,
                "character": "Radio DJ",
                "credit_id": "56479d3dc3a36826050044b5",
                "order": 53
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Nephi Pomaikai Brown"
        ],
        "biography": "Pomai Brown, was born in Honolulu, Hawaii on January 5, 1961 to Wilfred Ku'ualoha Brown and Amy Kaelehiwa Keko'olani. Being of Hawaiian decent (Keko'olani of Waipi'o), he attended and graduated from The Kamehameha Schools at Kapalama. He began his musical career playing the ukulele with Ka Hale Hula O Keko'olani at the age of 12 and continued on with Band, Orchestra and Concert Glee at Kamehameha. In 1994 he studied the Hawaiian Steel Guitar with world renown steel guitarist Jerry Byrd, and upon graduation, traveled with Jerry to Japan for a concert performance.  A graduate of Hawaii Pacific College (Magna Cum Laude), Pomai has used his business degree in entrepreneurial studies to help promote and advance his career in the entertainment industry.\n\nHe has studied the \"energy\" of acting from \n\nCary-Hiroyuki Tagawa, method acting fromScott Rogers, and Improvisation from Roger Wilko. His first acting role as Nick, the chef in 50 First Dates (2004) was made possible by comedian Adam Sandler and DirectorPeter Segal. Casting Director Roger Mussenden saw Pomai playing the ukulele on the TV series The Mole: Episode #3.1 (2003) and invited him to submit an audition tape.  Pomai and his wife Toni, currently head their own production company, Hollywood Brown Entertainment. They produce Island contemporary music, T.V. productions and live Polynesian show productions for select clientèle.  - IMDb Mini Biography By: Ilex Matikea",
        "birthday": "1961-01-05",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1080056,
        "imdb_id": "nm1366553",
        "known_for_department": "Acting",
        "name": "Pomaika'i Brown",
        "place_of_birth": "Honolulu, HI",
        "popularity": 0.0791,
        "profile_path": "/lAn1oqomqtyFjeZRRHzde25duD6.jpg"
    }
}