{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jsgRkhPxYtzAhDFCUyNbvlX63tY.jpg",
                "genre_ids": [
                    10749,
                    10751,
                    16,
                    14
                ],
                "id": 10020,
                "original_language": "en",
                "original_title": "Beauty and the Beast",
                "overview": "Follow the adventures of Belle, a bright young woman who finds herself in the castle of a prince who's been turned into a mysterious beast. With the help of the castle's enchanted staff, Belle soon learns the most important lesson of all -- that true beauty comes from within.",
                "popularity": 11.4334,
                "poster_path": "/hUJ0UvQ5tgE2Z9WpfuduVSdiCiU.jpg",
                "release_date": "1991-10-22",
                "title": "Beauty and the Beast",
                "video": false,
                "vote_average": 7.731,
                "vote_count": 10301,
                "character": "Gaston (voice)",
                "credit_id": "52fe43099251416c75000fb7",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia.\n\nRichard White (born August 4, 1953 in Oak Ridge, Tennessee) is an American actor, opera singer and voice actor. He is best known for voicing the character of Gaston in Disney's Beauty and the Beast and in the TV series House of Mouse. His vocal range is low tenor-baritone.\n\nHe also played the character of Gaylord Ravenal in Show Boat at Paper Mill Playhouse and Robert Mission in The New Moon, at the New York City Opera. White also created the title role of Erik in the world premiere of Arthur Kopit and Maury Yeston's musical, Phantom and sings the role on the cast recording.\n\nWhite has performed on Broadway as Joey in The Most Happy Fella and has had roles in New York revivals of Brigadoon, South Pacific, and Auntie Mame.\n\nHe was also considered for the voice of Governor Ratcliffe in the 1995 Disney animated feature Pocahontas, but the producers realized that viewers would hear his voice and think of Gaston. David Ogden Stiers, White's co-star from Beauty and the Beast, provided Ratcliffe's voice.\n\nDescription above from the Wikipedia article Richard White(actor), licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1953-08-04",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 108055,
        "imdb_id": "nm0925369",
        "known_for_department": "Acting",
        "name": "Richard White",
        "place_of_birth": "Oak Ridge, Tennessee, USA",
        "popularity": 1.2976,
        "profile_path": "/ffrXvosdpVWd00neXUyposGNViF.jpg"
    }
}