{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/aDi4GqSYi4pcTvS7A9AuXLuhUVQ.jpg",
                "genre_ids": [
                    35,
                    80
                ],
                "id": 25866,
                "original_language": "fr",
                "original_title": "Le Corniaud",
                "overview": "In this Franco-Italian gangster parody, a shopkeeper on his way to an Italian holiday suffers a crash that totals his car. The culprit can only compensate his ruined trip by driving an American friend's car from Naples to Bordeaux, but as it happens to be filled with such contraband as stolen money, jewelry and drugs, the involuntary and unwitting companions in crime soon attract all but recreational attention from the \"milieu\".",
                "popularity": 2.7089,
                "poster_path": "/kGFE3U01sMApp5Q7h0akEvdTwPK.jpg",
                "release_date": "1965-03-24",
                "title": "The Sucker",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 674,
                "character": "Gina, manicurist",
                "credit_id": "52fe44e0c3a368484e03c0cf",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Alida Rustichelli"
        ],
        "biography": "Alida Chelli (23 October 1943 – 14 December 2012) was an Italian actress, singer, and TV-hostess. She was mainly known for her appearances in stage musicals.\n\nBorn in Carpi as Alida Rustichelli, Chelli was daughter of composer Carlo Rustichelli and sister of composer Paolo Rustichelli. She achieved her first success as singer, with the song \"Sinnò me moro\", which opens the 1959 film Un maledetto imbroglio.\n\nThen, Chelli achieved a major fame on stage, starring in a number of successful musical comedies such as Rugantino (1978, together with Enrico Montesano), Cyrano (1979, with Domenico Modugno), and Aggiungi un posto a tavola (1990, with Johnny Dorelli). She has also appeared in many films, mainly comedies, and TV-shows.\n\nShe was the wife of actor Walter Chiari, and from their union was born Simone Annicchiarico. After the end of the marriage the actress had a relationship with TV-presenter Pippo Baudo. She died in Rome at 69, after a long illness.\n\nSource: Article \"Alida Chelli\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1943-10-23",
        "deathday": "2012-12-14",
        "gender": 1,
        "homepage": null,
        "id": 108089,
        "imdb_id": "nm0155072",
        "known_for_department": "Acting",
        "name": "Alida Chelli",
        "place_of_birth": "Carpi, Modena, Emilia-Romagna, Italy",
        "popularity": 0.268,
        "profile_path": "/m45lukzdSzml7p0leLtvPW8Do4J.jpg"
    }
}