{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tbF57JNof8j3X14GhZtqafkrziU.jpg",
                "genre_ids": [
                    878,
                    12
                ],
                "id": 313106,
                "original_language": "en",
                "original_title": "Doctor Who: The Day of the Doctor",
                "overview": "In 2013, something terrible is awakening in London's National Gallery; in 1562, a murderous plot is afoot in Elizabethan England; and somewhere in space an ancient battle reaches its devastating conclusion. All of reality is at stake as the Doctor's own dangerous past comes back to haunt him.",
                "popularity": 1.2786,
                "poster_path": "/6c0CjymaupC5xerJCemuaSV4CLj.jpg",
                "release_date": "2013-11-23",
                "title": "Doctor Who: The Day of the Doctor",
                "video": false,
                "vote_average": 8.2,
                "vote_count": 761,
                "character": "Clara Oswald",
                "credit_id": "55266f3fc3a3687df3003e3f",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/3WK7p9EdZmmvB1IbB2Vw9Rf4lXH.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 296096,
                "original_language": "en",
                "original_title": "Me Before You",
                "overview": "A small town girl is caught between dead-end jobs. A high-profile, successful man becomes wheelchair bound following an accident. The man decides his life is not worth living until the girl is hired for six months to be his new caretaker. Worlds apart and trapped together by circumstance, the two get off to a rocky start. But the girl becomes determined to prove to the man that life is worth living and as they embark on a series of adventures together, each finds their world changing in ways neither of them could begin to imagine.",
                "popularity": 14.9446,
                "poster_path": "/Ia3dzj5LnCj1ZBdlVeJrbKJQxG.jpg",
                "release_date": "2016-06-01",
                "title": "Me Before You",
                "video": false,
                "vote_average": 7.928,
                "vote_count": 12828,
                "character": "Katrina 'Treena' Clark",
                "credit_id": "5548033ec3a368787e0001e7",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/yFuKvT4Vm3sKHdFY4eG6I4ldAnn.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 1771,
                "original_language": "en",
                "original_title": "Captain America: The First Avenger",
                "overview": "During World War II, Steve Rogers is a sickly man from Brooklyn who's transformed into super-soldier Captain America to aid in the war effort. Rogers must stop the Red Skull – Adolf Hitler's ruthless head of weaponry, and the leader of an organization that intends to use a mysterious device of untold powers for world domination.",
                "popularity": 10.4058,
                "poster_path": "/vSNxAJTlD0r02V9sPYpOjqDZXUK.jpg",
                "release_date": "2011-07-22",
                "title": "Captain America: The First Avenger",
                "video": false,
                "vote_average": 7.005,
                "vote_count": 22134,
                "character": "Connie",
                "credit_id": "5776e897c3a3685c2000394f",
                "order": 28
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jenna-Louise Coleman",
            "제나 콜먼",
            "珍娜·科尔曼",
            "ジェナ・ルイーズ・コールマン",
            "جنا کولمن"
        ],
        "biography": "Jenna-Louise Coleman, since 2013 credited as Jenna Coleman, is an English actress. She is known for her roles as Jasmine Thomas in the ITV soap opera Emmerdale (2005–2009), Clara Oswald in the BBC science fiction series Doctor Who (2012–2015, 2017), Queen Victoria in the ITV period drama Victoria (2016–2019), Joanna Lindsay in the crime miniseries The Cry (2018), and Marie-Andrée Leclerc in the crime miniseries The Serpent (2021). She landed the part of Jasmine Thomas in Emmerdale in 2005 and, for it, she was nominated for the \"Best Newcomer\" award at British Soap Awards in 2007, and at the National Television Awards in 2006, she was nominated for the \"Most Popular Newcomer\" award. She received a nomination for the \"Best Actress\" award from the TV Choice Awards.\n\nIn 2011, she made her feature film debut in Captain America: The First Avenger. She played Susan Brown in a BBC Four television adaptation of the John Braine novel Room at the Top in 2012. Also in 2012, she landed the part of Annie Desmond in a mini-series Titanic. She provided the voice for the character Melia in the English dub of the 2011 video game Xenoblade Chronicles. In 2012, she was cast as Rosie in Dancing on the Edge. She starred as Lydia Wickham in the adaptation of Death Comes to Pemberley (2013).\n\nShe made a surprise appearance on Doctor Who in the first episode of the seventh series as Oswin Oswald, a guest character, but she debuted as a series regular in the Christmas special episode \"The Snowmen\" as Clara Oswin Oswald. She plays eleventh's and twelve's Doctor companion until 2015. In 2016, she starred in ITV's drama Victoria.",
        "birthday": "1986-04-27",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1080542,
        "imdb_id": "nm1982510",
        "known_for_department": "Acting",
        "name": "Jenna Coleman",
        "place_of_birth": "Blackpool, Lancashire, England, UK",
        "popularity": 2.0447,
        "profile_path": "/pylSrUkaLzDvfflyMnU32eY0vrN.jpg"
    }
}