{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xga9dXEIJHAjNLGMjw4VDPH7LJB.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 9090,
                "original_language": "en",
                "original_title": "To Wong Foo, Thanks for Everything! Julie Newmar",
                "overview": "Manhattan drag queens Vida Boheme and Noxeema Jackson impress regional judges in competition, securing berths in the Nationals in Los Angeles. When the two meet pathetic drag novice Chi-Chi Rodriguez — one of the losers that evening — the charmed Vida and Noxeema agree to take the hopeless youngster under their joined wing. Soon the three set off on a madcap road trip across America and struggle to make it to Los Angeles in time.",
                "popularity": 3.1959,
                "poster_path": "/xlRhO3TzTxCFn2s9LEcVi7s582t.jpg",
                "release_date": "1995-09-08",
                "title": "To Wong Foo, Thanks for Everything! Julie Newmar",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 708,
                "character": "Noxeema Jackson",
                "credit_id": "52fe44dbc3a36847f80ae0ab",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/tLI7N5679ugChOW00i3Y3Xfc4PY.jpg",
                "genre_ids": [
                    35
                ],
                "id": 9942,
                "original_language": "en",
                "original_title": "Major League",
                "overview": "When Rachel Phelps inherits the Cleveland Indians from her deceased husband, she's determined to move the team to a warmer climate—but only a losing season will make that possible, which should be easy given the misfits she's hired. Rachel is sure her dream will come true, but she underestimates their will to succeed.",
                "popularity": 2.8423,
                "poster_path": "/ypUedY9zX4nGGf1lQv1UGc8PhPA.jpg",
                "release_date": "1989-02-16",
                "title": "Major League",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 831,
                "character": "Willie Mays Hayes",
                "credit_id": "52fe454cc3a36847f80c67b9",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/by8z9Fe8y7p4jo2YlW2SZDnptyT.jpg",
                "genre_ids": [
                    28,
                    35,
                    878
                ],
                "id": 533535,
                "original_language": "en",
                "original_title": "Deadpool & Wolverine",
                "overview": "A listless Wade Wilson toils away in civilian life with his days as the morally flexible mercenary, Deadpool, behind him. But when his homeworld faces an existential threat, Wade must reluctantly suit-up again with an even more reluctant Wolverine.",
                "popularity": 37.9885,
                "poster_path": "/8cdWjvZQUExUUTzyp4t6EDMubfO.jpg",
                "release_date": "2024-07-24",
                "title": "Deadpool & Wolverine",
                "video": false,
                "vote_average": 7.58,
                "vote_count": 7729,
                "character": "Blade",
                "credit_id": "66a0f1546aef695b11dd76e5",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/2ycAZWELqHygeqivCLuqNQsYPSP.jpg",
                "genre_ids": [
                    18,
                    35,
                    36
                ],
                "id": 528888,
                "original_language": "en",
                "original_title": "Dolemite Is My Name",
                "overview": "The story of Rudy Ray Moore, who created the iconic big screen pimp character Dolemite in the 1970s.",
                "popularity": 2.0108,
                "poster_path": "/uoAqJg7ZSmftnBGOkupU1ySZQU0.jpg",
                "release_date": "2019-10-04",
                "title": "Dolemite Is My Name",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 1209,
                "character": "D’Urville Martin",
                "credit_id": "5b22d4100e0a264dae01d900",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Wesley Trent Snipes",
            "وسلی اسنایپس",
            "وسلی اِسنَایپس"
        ],
        "biography": "Wesley Trent Snipes (born July 31, 1962) is an American actor and martial artist. Snipes has made films in a variety of genres, such as numerous thrillers, dramatic feature films, and comedies, though he is best known for his action films. He was nominated for the Independent Spirit Award for Best Supporting Male for his work in The Waterdance (1992) and won the Volpi Cup for Best Actor for his performance in the film One Night Stand (1997).\n\nBorn in Florida, Snipes had notable parts in the comedy film Major League (1989), the drama Mo' Better Blues (1990), and the crime drama King of New York (1990) before gaining prominence by playing a drug lord in the crime drama New Jack City (1991). He subsequently received more attention for the drama film Jungle Fever (1991), the sports comedy White Men Can't Jump (1992), and the action film Passenger 57 (1992). He has since starred in various genres, such as the comedy film To Wong Foo, Thanks for Everything! Julie Newmar (1995), the thriller The Fan (1996), and the drama film Down in the Delta (1998), but mostly established himself as an action star, portraying both heroes and villains in films such as Demolition Man (1993), Rising Sun (1993), Money Train (1995), and U.S. Marshals (1998). Also in 1998, he was cast as Eric Brooks/BBlade in the superhero film Blade, based on the Marvel Comics superhero of the same name, a role he went on to reprise in Blade II (2002), Blade: Trinity (2004), and Deadpool & Wolverine (2024).\n\nSnipes had smaller roles during the 2000s and moved to direct-to-video action films before returning to the theatrical release with films such as Brooklyn's Finest (2009) and The Expendables 3 (2014). His television work includes multiple episodes in the drama series H.E.L.P. (1990), the action thriller crime drama series The Player (2015), and the drama limited series True Story (2021), as well as the romantic drama film Disappearing Acts (2000).\n\nHe formed a production company, Amen-Ra Films, in 1991, and a subsidiary, Black Dot Media, to develop projects for film and television. Snipes has been training in martial arts since the age of 12, earning a 5thdan black belt in Shotokan karate and a 2nddan black belt in Hapkido. He is credited with helping popularise martial arts in Hollywood and bringing martial arts to mainstream audiences, as well as contributing to the representation of Black actors in action roles, breaking stereotypes. In 2017, Snipes made his debut as a novelist with the urban fantasy supernatural adventure Talon of God.\n\nDescription above from the Wikipedia article Wesley Snipes, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1962-07-31",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 10814,
        "imdb_id": "nm0000648",
        "known_for_department": "Acting",
        "name": "Wesley Snipes",
        "place_of_birth": "Orlando, Florida, USA",
        "popularity": 1.8576,
        "profile_path": "/81D6oJ81kiQ5xnEHhaHrY29ntdO.jpg"
    }
}