{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xgU3KkqiME9pGe5gGCNpUYkoSWg.jpg",
                "genre_ids": [
                    27,
                    53,
                    12
                ],
                "id": 578,
                "original_language": "en",
                "original_title": "Jaws",
                "overview": "When the seaside community of Amity finds itself under attack by a dangerous great white shark, the town's chief of police, a young marine biologist, and a grizzled hunter embark on a desperate quest to destroy the beast before it strikes again.",
                "popularity": 14.1815,
                "poster_path": "/lxM6kqilAdpdhqUl2biYp5frUxE.jpg",
                "release_date": "1975-06-20",
                "title": "Jaws",
                "video": false,
                "vote_average": 7.677,
                "vote_count": 11008,
                "character": "Lifeguard (uncredited)",
                "credit_id": "56ba1d3ec3a3681e5d002d78",
                "order": 26
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Christopher Sands was cast at the age of 16 by famous Casting Director Shari Rhodes as the Lifeguard in Steven Spielberg's original JAWS. That experience led him to move to Los Angeles after graduating from Harvard College in 1979 with a degree in Russian History to pursue film production. He worked initially for ABC News as a Desk Assistant. Thereafter he worked for producer/director John Rich, first at 20th Century Fox, and then for ABC Television and Witt-Thomas-Harris as an Assistant Producer on the television series Benson starring Robert Guillaume. He then worked for Writer/Director Djordje Milicevic as an Assistant Producer on his film Riding Fast starring Meg Foster. Thereafter he joined Ohlmeyer Productions/RJR Nabisco where he served in various creative and production capacities, mostly as Associate Producer, on their projects Hollywood's Most Sensational Mysteries (NBC), television films Crime of Innocence, 1985 (Andy Griffith), Under Siege, 1986 (Peter Strauss), Bluffing It, 1987 (Dennis Weaver) and Right to Die, 1987 (Raquel Welch). In 1988 he left Hollywood to become a film producer and communications executive at the Harvard University School of Public Health where he produced, directed and wrote several short documentaries and public health PSA's dealing with the HIV pandemic.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1081816,
        "imdb_id": "nm0762300",
        "known_for_department": "Acting",
        "name": "Christopher Sands",
        "place_of_birth": null,
        "popularity": 0.0281,
        "profile_path": null
    }
}