{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xQRh7hSPdtEE0aUmuY8EdifrXPK.jpg",
                "genre_ids": [
                    10402,
                    18
                ],
                "id": 12545,
                "original_language": "en",
                "original_title": "Jesus Christ Superstar",
                "overview": "As played out by a theatre troupe, the last days of Jesus Christ are depicted from the perspective of Judas Iscariot, his betrayer. As Jesus' following increases, Judas begins to worry that Jesus is falling for his own hype, forgetting the principles of his teachings and growing too close to the prostitute Mary Magdalene.",
                "popularity": 2.7775,
                "poster_path": "/p5LGgKCVGGVZKTkwKzpBDIesydj.jpg",
                "release_date": "1973-08-15",
                "title": "Jesus Christ Superstar",
                "video": false,
                "vote_average": 7.086,
                "vote_count": 579,
                "character": "Annas",
                "credit_id": "52fe44f89251416c75047433",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/e7cTxDnHGQIozy0Os5r6HauL1Gz.jpg",
                "genre_ids": [
                    10402,
                    18,
                    35
                ],
                "id": 10654,
                "original_language": "en",
                "original_title": "Hair",
                "overview": "Upon receiving his draft notice and leaving his family ranch in Oklahoma, Claude heads to New York and befriends a tribe of long-haired hippies on his way to boot camp.",
                "popularity": 2.8456,
                "poster_path": "/z0ctToyPWCB2RgIkMpD6RhRKAeH.jpg",
                "release_date": "1979-03-15",
                "title": "Hair",
                "video": false,
                "vote_average": 7.278,
                "vote_count": 697,
                "character": "Ain't Got No",
                "credit_id": "64fdc3166a2227011a7947f5",
                "order": 33
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Kurt \"Frenchy\" Yaghjian",
            "Kurt Yahjian",
            "Frenchy Yaghjian"
        ],
        "biography": "Kurt \"Frenchy\" Yaghjian is an American actor and singer known for his appearance as Annas in the 1973 film Jesus Christ Superstar. Kurt Yaghjian is the son of Haig Yaghjian, a former assistant conductor of the Cincinnati Symphony Orchestra, and was a member of a school choir that participated in the premiere of Gian Carlo Menotti's The Death of the Bishop of Brindisi in May 1963. He is of Armenian descent. Menotti was impressed with the expressiveness of Yaghjian's face and recommended him to NBC for the role of Amahl in Amahl and the Night Visitors in 1963, the first time that the production was videotaped, previous versions having been shown live. The videotaped version with Yaghjian was shown annually until 1966. In 1971 he graduated from North Carolina School of the Arts. He has taken part in advertising campaigns for products such as Coca-Cola, Ford Motors, Domino's Pizza, Toyota, Cadillac, Chevrolet, Budweiser and Sprite. He appeared in the original Broadway production of Jesus Christ Superstar from 12 October 1971 to 30 June 1973 as a leper, a reporter and as understudy to Ben Vereen as Judas Iscariot.",
        "birthday": null,
        "deathday": null,
        "gender": 0,
        "homepage": null,
        "id": 1081882,
        "imdb_id": "nm0944894",
        "known_for_department": "Acting",
        "name": "Kurt Yaghjian",
        "place_of_birth": null,
        "popularity": 0.0214,
        "profile_path": "/5oUYJP3PmbfTfEivQ4xNXA74COZ.jpg"
    }
}