{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wcJmFsz8RqIhozMwvU81hreTX4i.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 12163,
                "original_language": "en",
                "original_title": "The Wrestler",
                "overview": "Aging wrestler Randy \"The Ram\" Robinson is long past his prime but still ready and rarin' to go on the pro-wrestling circuit. After a particularly brutal beating, however, Randy hangs up his tights, pursues a serious relationship with a long-in-the-tooth stripper, and tries to reconnect with his estranged daughter. But he can't resist the lure of the ring and readies himself for a comeback.",
                "popularity": 3.5185,
                "poster_path": "/6OTR8dSoNGjWohJNo3UhIGd3Tj.jpg",
                "release_date": "2008-09-07",
                "title": "The Wrestler",
                "video": false,
                "vote_average": 7.532,
                "vote_count": 3809,
                "character": "Wrestler",
                "credit_id": "5be4e000c3a36810c403a153",
                "order": 49
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Austin Aries",
            "Austin Starr"
        ],
        "biography": "Daniel Healy Solwold Jr., better known by his ring name Austin Aries, is an American professional wrestler currently signed to the Control Your Narrative wrestling promotion. He is best known for his time with Impact Wrestling, where he is a three-time Impact World Champion and a six-time Impact X Division Champion, and Ring of Honor (ROH) where he was the first multi-time ROH World Champion. He is also known for his time with WWE, where he competed in the cruiserweight division as well as doing color commentary. Between TNA/Impact and ROH, Aries has held 14 total championships and has also held numerous international and U.S. independent championships.\n\nAries began to work with ROH in 2004, joining the Generation Next faction. He won the ROH World Tag Team Championship with his teammate Roderick Strong, and at Final Battle 2004, ROH's biggest event, defeated Samoa Joe to win the ROH World Championship, ending the latter's 645-day reign. He would regain the title in 2009, becoming the first multi-time champion. After moving on to Impact Wrestling, then known as Total Nonstop Action Wrestling (TNA), Aries won the X Division Championship six times. His first reign is the longest of the title's history at 301 days and created the \"Option C\" clause, trading the title for a TNA World Heavyweight title opportunity at Destination X, winning the title. He also won the TNA World Tag Team Championship and the Impact Grand Championship, becoming a Grand Slam Champion in Impact Wrestling.[1] After a short hiatus from the wrestling industry from 2019 to 2021, he is currently making appearances for the National Wrestling Alliance and other independent wrestling companies.",
        "birthday": "1978-04-15",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1081097,
        "imdb_id": "nm2025217",
        "known_for_department": "Acting",
        "name": "Daniel Solwold Jr.",
        "place_of_birth": "Milwaukee, Wisconsin, USA",
        "popularity": 0.8322,
        "profile_path": "/xmKtcgNLf8Wmjn5zctjNXnPVNJL.jpg"
    }
}