{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yjlg8Gq3TAWlFSUxh7Icey8uM4P.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 10653,
                "original_language": "en",
                "original_title": "The Seven Year Itch",
                "overview": "With his family away for their annual summer holiday, a publishing executive decides to live a bachelor's life. The beautiful but ditzy blonde from the apartment above catches his eye and they soon start spending time together—maybe a little too much time!",
                "popularity": 1.7389,
                "poster_path": "/4oLqx0QbjWFzWtkxRmDLGH47CUJ.jpg",
                "release_date": "1955-06-03",
                "title": "The Seven Year Itch",
                "video": false,
                "vote_average": 7.063,
                "vote_count": 934,
                "character": "Miss Morris",
                "credit_id": "52fe439c9251416c75017305",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Marguerite Florence Chapman"
        ],
        "biography": "From Wikipedia, the free encyclopedia.   \n\nMarguerite Chapman (March 9, 1918 — August 31, 1999) was an American actress.\n\nBorn in Chatham, New York, she was working as a telephone switchboard operator in White Plains, New York when her good looks brought about the opportunity to pursue a career in modeling. Signed by the prestigious John Robert Powers Agency in New York City, the publicity she earned modeling brought an offer from 20th Century Fox film studios in Hollywood.\n\nShe made her film debut in 1940, working for the next two years in small roles. In 1942, her big break came with Republic Pictures when she was cast in the leading female role in the twelve-part adventure film serial Spy Smasher, a production that is considered by many as one of the best serials ever made. As a result, Chapman soon began receiving offers for more leading roles and appeared opposite important stars such as Edward G. Robinson and George Sanders. With America's entry in World War II, she entertained the troops, worked for the War bond drive and at the Hollywood Canteen.\n\nDuring the 1950s Chapman continued to perform mostly in secondary film roles, notably in Marilyn Monroe's 1955 hit The Seven Year Itch. However, with the advent of television she kept busy into the early 1960s with guest appearances in a number different shows including Rawhide, Perry Mason, and Four Star Playhouse.\n\nChapman was reportedly initially selected to play the role of \"Old Rose\" Dawson-Calvert in the 1997 James Cameron epic Titanic but poor health prevented her from accepting the offer.[citation needed]\n\nFor her contribution to the motion picture industry, Marguerite Chapman has a star on the Hollywood Walk of Fame at 6290 Hollywood Blvd.\n\nMarguerite Chapman died in 1999, aged 81, and was interred in Holy Cross Cemetery, in Culver City, California\n\nDescription above from the Wikipedia article Marguerite Chapman, licensed under CC-BY-SA,full list of contributors on Wikipedia.",
        "birthday": "1918-03-09",
        "deathday": "1999-08-31",
        "gender": 1,
        "homepage": null,
        "id": 108232,
        "imdb_id": "nm0152460",
        "known_for_department": "Acting",
        "name": "Marguerite Chapman",
        "place_of_birth": "Chatham, New York, USA",
        "popularity": 0.2522,
        "profile_path": "/TPhmvEs5mZT7jEKGluMfJL0w16.jpg"
    }
}