{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/iTPTdfEGYGwbELLLvNnmgKZpVZj.jpg",
                "genre_ids": [
                    18,
                    10749,
                    35
                ],
                "id": 660120,
                "original_language": "no",
                "original_title": "Verdens verste menneske",
                "overview": "The chronicles of four years in the life of Julie, a young woman who navigates the troubled waters of her love life and struggles to find her career path, leading her to take a realistic look at who she really is.",
                "popularity": 3.6275,
                "poster_path": "/1NxGNQchGBTHXJ6RShLY1IlZqWn.jpg",
                "release_date": "2021-10-13",
                "title": "The Worst Person in the World",
                "video": false,
                "vote_average": 7.441,
                "vote_count": 1601,
                "character": "Eivind",
                "credit_id": "600a13dad55c3d003f6bd6bc",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Herbert Nordrum (born 1987) is a Norwegian actor.\n\nHe studied at the Norwegian National Academy of Theatre from 2008 to 2011.\n\nHe won the Amanda Award in 2014 for Best Supporting Actor and the Kanon Award in 2013 for Best Supporting Role for his role as \"Karl\" in Pornopung. He had the lead role in the 2018 TV series Match. He played the lead role as Poppe in the 2020 film Fjols til fjells. He was nominated for the Amanda Award 2020 in the category of Best Male Actor for this performance. He played one of the lead roles in Joachim Trier's film comedy The Worst Person in the World, which premiered at the Cannes Film Festival on July 9, 2021. For the film, he was nominated for the Amanda Award 2022 in the category of Best Supporting Actor. He won the Guldbaggen for Best Male Lead in 2024 for his role in the film Hypnosis.\n\nNordrum has been employed at Trøndelag Teater. As of 2021, he works at the National Theatre.\n\nDescription above from the Wikipedia article Herbert Nordrum, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1987-06-30",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1083266,
        "imdb_id": "nm5122260",
        "known_for_department": "Acting",
        "name": "Herbert Nordrum",
        "place_of_birth": "Norway",
        "popularity": 0.4017,
        "profile_path": "/wMT9o2WNfLGE4dD8Rkt2Rem4Ljt.jpg"
    }
}