{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ncWUcY7ihZ2co7vqUCHqwF6t9us.jpg",
                "genre_ids": [
                    53,
                    18
                ],
                "id": 296098,
                "original_language": "en",
                "original_title": "Bridge of Spies",
                "overview": "During the Cold War, the Soviet Union captures U.S. pilot Francis Gary Powers after shooting down his U-2 spy plane. Sentenced to 10 years in prison, Powers' only hope is New York lawyer James Donovan, recruited by a CIA operative to negotiate his release. Donovan boards a plane to Berlin, hoping to win the young man's freedom through a prisoner exchange. If all goes well, the Russians would get Rudolf Abel, the convicted spy who Donovan defended in court.",
                "popularity": 5.9643,
                "poster_path": "/fmOOjHAQzxr0c1sfcY4qkiSRBH6.jpg",
                "release_date": "2015-10-15",
                "title": "Bridge of Spies",
                "video": false,
                "vote_average": 7.236,
                "vote_count": 7031,
                "character": "Courthouse Reporter #1",
                "credit_id": "5430504e0e0a26464f0010f0",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/6mqgl2szMLRYj4lhlXOjju5Tpeo.jpg",
                "genre_ids": [
                    12,
                    16,
                    9648
                ],
                "id": 17578,
                "original_language": "en",
                "original_title": "The Adventures of Tintin",
                "overview": "Intrepid young reporter, Tintin, and his loyal dog, Snowy, are thrust into a world of high adventure when they discover a ship carrying an explosive secret. As Tintin is drawn into a centuries-old mystery, Ivan Ivanovitch Sakharine suspects him of stealing a priceless treasure. Tintin and Snowy, with the help of salty, cantankerous Captain Haddock and bumbling detectives, Thompson and Thomson, travel half the world, one step ahead of their enemies, as Tintin endeavors to find the Unicorn, a sunken ship that may hold a vast fortune, but also an ancient curse.",
                "popularity": 5.3778,
                "poster_path": "/fQZ3sLR1Fi63NMsNRbjm9q5qODJ.jpg",
                "release_date": "2011-10-24",
                "title": "The Adventures of Tintin",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 5584,
                "character": "Barnaby (voice)",
                "credit_id": "6733222b09b256d09461b49c",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Joe Starr was born in Brooklyn, New York, on New Years Eve, 1969. Joe studied acting at the J. Beckson Studios in NYC while a professional Stand-up Comedian touring the United States, Canada & Europe. It was a recurring role on \"Important Things with Demitri Martin\" (Comedy Central) that caught the attention of New York's biggest Casting Directors. Joe Starr was soon Guest Starring on major Network shows (Gotham, Blue Bloods, Bull) and acting in major motion pictures (The Adventures of Tintin, Chuck, Date Night). He has acted along side Liev Schreiber, Andy Serkis, & Daniel Craig, and been directed by such luminaries as Oliver Stone, Peter Jackson and Steven Spielberg. Recently, Joe received great reviews for playing \"Enzo\" on CBS's hit \"Kevin Can Wait\". Joe Starr is the grandson of vaudeville dancer, Wally Valez, and spent his youth learning to use his body for Comedy instead of Dance. His lifelong study of the history and traditions of Show Business has made him a favorite guest on podcasts about The Biz and a guest speaker for Stand-up Comedy Classes and Acting Seminars. An 'old soul' at heart, it was none other than Comedy Legend, Jerry Lewis, who gave Joe the title of 'The youngest old man in Show Business.\"",
        "birthday": "1969-12-31",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.williamclare.com/joe-starr",
        "id": 1083807,
        "imdb_id": "nm2338652",
        "known_for_department": "Acting",
        "name": "Joe Starr",
        "place_of_birth": "Brooklyn, New York, U.S.",
        "popularity": 0.0486,
        "profile_path": null
    }
}