{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sUQgwo4oCgNVbpIq7ZtIUhF5hOe.jpg",
                "genre_ids": [
                    10402,
                    18,
                    10749
                ],
                "id": 585244,
                "original_language": "en",
                "original_title": "I Still Believe",
                "overview": "The true-life story of Christian music star Jeremy Camp and his journey of love and loss that looks to prove there is always hope.",
                "popularity": 4.4654,
                "poster_path": "/dqA2FCzz4OMmXLitKopzf476RVB.jpg",
                "release_date": "2020-03-12",
                "title": "I Still Believe",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 1202,
                "character": "Terry Camp",
                "credit_id": "5d5f3126f263ba2ba594cb48",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Eilleen Regina Edwards",
            "Shania",
            "Eileen Twain"
        ],
        "biography": "Shania Twain, a Canadian country music singer-songwriter and actor, was born on August 28, 1965 as Eilleen Regina Edwards in Windsor, Ontario, Canada. She is one of three daughters of Clarence and Sharon (Morrison) Edwards (sister Jill is two years older and Carrie-Ann three years younger). When she was age six, her mother remarried Jerry Twain, a full-blooded Ojibwa native from Timmins, Ontario, who adopted her as his own. She started out singing in bars as a child after hours, and, at thirteen, appeared on The Tommy Hunter Show (1965). When she was 22, her parents were killed in an accident, and she became the legal guardian of her half-brothers (Mark, then 13, and Darryl, then 14) and sister, putting her musical career on hold to raise her family. In 1991 she changed her name to Shania (meaning \"I'm on my way\" in Ojibwa, it was the name of a co-worker), and signed a contract with Mercury Nashville that same year. Her first album went by without notice, but her second album (produced with Robert John (Mutt) Lange, who she wed on December 28, 1993 and divorced on June 9, 2010) broke world records with its sales! Referred to as \"The Queen of Country Pop,\" she is one of the most commercially successful artists of all time, having sold over 85 million albums. Presently married to Frederic Nicolas Thiebaud on January 1, 2011 - present.",
        "birthday": "1965-08-28",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.shaniatwain.com/",
        "id": 108558,
        "imdb_id": "nm0005510",
        "known_for_department": "Acting",
        "name": "Shania Twain",
        "place_of_birth": "Windsor, Ontario, Canada",
        "popularity": 0.4715,
        "profile_path": "/3owuqJmMriymwz05fzJ7z9mRSrA.jpg"
    }
}