{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4fLZUr1e65hKPPVw0R3PmKFKxj1.jpg",
                "genre_ids": [
                    16,
                    35,
                    10751,
                    14,
                    10749
                ],
                "id": 976573,
                "original_language": "en",
                "original_title": "Elemental",
                "overview": "In a city where fire, water, land and air residents live together, a fiery young woman and a go-with-the-flow guy will discover something elemental: how much they have in common.",
                "popularity": 13.222,
                "poster_path": "/4Y1WNkd88JXmGfhtWR7dmDAo1T2.jpg",
                "release_date": "2023-06-14",
                "title": "Elemental",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 4958,
                "character": "Ember (voice)",
                "credit_id": "631bd27f65e0a200893de33e",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/8YSpQBdGvuvSj9pLsY2yoUb9fZn.jpg",
                "genre_ids": [
                    35,
                    10749,
                    18
                ],
                "id": 597219,
                "original_language": "en",
                "original_title": "The Half of It",
                "overview": "Shy, straight-A student Ellie is hired by sweet but inarticulate jock Paul, who needs help wooing the most popular girl in school. But their new and unlikely friendship gets tricky when Ellie discovers she has feelings for the same girl.",
                "popularity": 2.9568,
                "poster_path": "/jC1PNXGET1ZZQyrJvdFhPfXdPP1.jpg",
                "release_date": "2020-05-01",
                "title": "The Half of It",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 1540,
                "character": "Ellie Chu",
                "credit_id": "5ef47eabab1bc70035963cf5",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Leah Liang Lewis",
            "Leah Liang",
            "Leah Marie Liang Lewis",
            "莉娅·刘易斯"
        ],
        "biography": "Adopted from a Chinese orphanage as an infant, American actress Leah Lewis is poised to emigrate into living rooms everywhere with her triple talent as an actress, singer, and dancer. She was raised in Windermere, FL and in Los Angeles, CA.\n\nLeah Lewis is known for her breakout performance in the Netflix feature film, \"The Half of It,\" written and directed by Alice Wu. The film launched globally on Netflix after winning the Founders Award for Best U.S. Narrative Feature at the Tribeca Film Festival. Lewis also portrays the starring role of 'Ember' in Pixar's animated feature, \"Elemental\" written and directed by Peter Sohn.\" She is also known for her role 'George Fan' in the CW series \"Nancy Drew.\"\n\nIn addition to her acting, Lewis is professionally trained singer since childhood who has been writing her own music since the age of 15. In her free time, Lewis has many hobbies with a strong physical background including power lifting, dancing, yoga and strength and conditioning training. She enjoys writing, playing guitar, staying active in nature, advocating for mental health care, spending time with her family and creating strong community while traveling or resting between work.",
        "birthday": "1996-12-09",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1087262,
        "imdb_id": "nm2301427",
        "known_for_department": "Acting",
        "name": "Leah Lewis",
        "place_of_birth": "Shanghai, China",
        "popularity": 0.3968,
        "profile_path": "/4TTwg4Wrpe6qa1NrGKP508v2j3A.jpg"
    }
}