{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hTLydq9rAuO0Eus1WWqab1tpyGg.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 417678,
                "original_language": "en",
                "original_title": "Everything, Everything",
                "overview": "A teenager who's lived a sheltered life because she's allergic to everything, falls for the boy who moves in next door.",
                "popularity": 3.7981,
                "poster_path": "/gukkmf3W5Cev7winxBa8FHvKLql.jpg",
                "release_date": "2017-05-18",
                "title": "Everything, Everything",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 3713,
                "character": "Dr. Francis",
                "credit_id": "59856794c3a36874bc01b943",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Francoise Yip Fong-Wa",
            "葉芳華",
            "Francoise C.J. Yip",
            "Yip Fong-Wa",
            "叶芳华",
            "فرانسواز ییپ"
        ],
        "biography": "Françoise Fong-Wa Yip ( born September 4, 1972) is a Canadian actress. Her best-known roles are the redeemable bad girls in Jackie Chan's Rumble in the Bronx and Jet Li's Black Mask. The critical and financial success of Rumble in the Bronx (and its subsequent number-one box-office bow in the United States) made Yip an instant success and garnered her two Hong Kong Film Award nominations. She continued to do movies and star in TV, but her roles were less known or temporary. The characters she plays often get killed or serve as a background character. Yip appeared in the television series Andromeda as two different characters. Her first character was arrested, and her final character was murdered. She did two movies with Jet Li, the first as a lead romantic interest in Black Mask and the second in Romeo Must Die, but this time she played a Chinese gangster motorcycle assassin killed by Jet Li and Aaliyah. An unfortunate aspect of her career is that none of the TV shows she starred in lasted beyond a full season, and if she did have a starring role in a movie it was a straight-to-video/DVD film. Her most recent appearance was in the new Aliens vs. Predator: Requiem movie, and she guest-starred in the Canadian TV show Blood Ties.\n\nDescription above from the Wikipedia article Françoise Fong-Wa Yip, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1972-09-04",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 10875,
        "imdb_id": "nm0948123",
        "known_for_department": "Acting",
        "name": "Françoise Yip",
        "place_of_birth": "North Vancouver, British Columbia, Canada",
        "popularity": 0.894,
        "profile_path": "/2fBymfOzhw8wB6wHFHbxulNysB4.jpg"
    }
}