{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hk4PwhKhT7q7jp1lvA8aiYqDluy.jpg",
                "genre_ids": [
                    16,
                    18,
                    35,
                    27,
                    14
                ],
                "id": 926899,
                "original_language": "en",
                "original_title": "The House",
                "overview": "Across different eras, a poor family, an anxious developer and a fed-up landlady become tied to the same mysterious house in this animated dark comedy.",
                "popularity": 3.2068,
                "poster_path": "/xhE1EYcD6U7m5R8AT7yf29CCxia.jpg",
                "release_date": "2022-01-14",
                "title": "The House",
                "video": false,
                "vote_average": 7.016,
                "vote_count": 1080,
                "character": "Police Officer #2 (voice)",
                "credit_id": "61e32674af6e94006582d00b",
                "order": 13
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/wUwizGzbTk5CTiKBnE4Pq1MONwD.jpg",
                "genre_ids": [
                    16,
                    12,
                    28,
                    10751,
                    14
                ],
                "id": 560057,
                "original_language": "en",
                "original_title": "The Sea Beast",
                "overview": "When a young girl stows away on the ship of a legendary sea monster hunter, they launch an epic journey into uncharted waters — and make history to boot.",
                "popularity": 6.6693,
                "poster_path": "/9Zfv4Ap1e8eKOYnZPtYaWhLkk0d.jpg",
                "release_date": "2022-06-24",
                "title": "The Sea Beast",
                "video": false,
                "vote_average": 7.321,
                "vote_count": 1593,
                "credit_id": "62cf4935b39e35005140c352",
                "department": "Sound",
                "job": "ADR & Dubbing"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Ayesha Antoine is an English actress. She is known for portraying Rachel Baptiste in Holby City, and Poppy Silver in Grange Hill\n\nAntoine was born in Essex, England. She is of English, Dominican, and Welsh descent. In 1998 Antoine studied Psychology and English at the University of Manchester. After graduating, she returned to London to restart her career. Antoine began her television career in the 1990s playing Poppy Silver in Grange Hill. At this time she also made her first appearance in Holby City. Other television credits include the role of Kelly Grogan in sitcom pilot Placebo and a husband-beating shoplifter in The Bill. In 2008, Antoine guest starred as Dee Dee Blasco in the Doctor Who episode \"Midnight\", an experience she described as: \"so much fun…it’s a brilliant show and I loved every minute.\" She joined the regular cast of Holby City in 2008, playing staff nurse Rachel Baptiste. In 2009, Antoine appeared in BAFTA winner Paul Whitehouse's new series Down The Line.\n\nIn 2005, Antoine won the Norman Beaton Fellowship. She was a member of the BBC Radio Drama Company for six months and lent her voice to over twenty five radio dramas including The Lysistrata Project, Hold My Breath, Westway, The No.1 Ladies Detective Agency, The Fountain Overflows and Father & Son. In 2013, she was the featured presenter for Dr. Forever!, a five-part documentary series featured in the Classic Doctor Who DVD range.",
        "birthday": "1981-05-08",
        "deathday": null,
        "gender": 1,
        "homepage": "https://cam.co.uk/talent/ayesha-antoine/",
        "id": 1087563,
        "imdb_id": "nm0031137",
        "known_for_department": "Acting",
        "name": "Ayesha Antoine",
        "place_of_birth": "Chelmsford, Essex, UK",
        "popularity": 0.7169,
        "profile_path": "/7EQ1NyUQzUavbUczcufkQG5Sweu.jpg"
    }
}