{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5WparwIlAtSZW0tcWbK2NHEZJC6.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 310307,
                "original_language": "en",
                "original_title": "The Founder",
                "overview": "The true story of how Ray Kroc, a salesman from Illinois, met Mac and Dick McDonald, who were running a burger operation in 1950s Southern California. Kroc was impressed by the brothers’ speedy system of making the food and saw franchise potential. He maneuvered himself into a position to be able to pull the company from the brothers and create a billion-dollar empire.",
                "popularity": 5.7329,
                "poster_path": "/8gLIksu5ggdfBL1UbeTeonHquxl.jpg",
                "release_date": "2016-11-24",
                "title": "The Founder",
                "video": false,
                "vote_average": 7.136,
                "vote_count": 5176,
                "character": "Kroc Corporate Lawyer",
                "credit_id": "657b1dca8e2ba6011b671f5a",
                "order": 26
            },
            {
                "adult": false,
                "backdrop_path": "/dcyPj11c00lOhMESAVWtJKzlHt4.jpg",
                "genre_ids": [
                    18
                ],
                "id": 250538,
                "original_language": "en",
                "original_title": "The Good Lie",
                "overview": "A young refugee of the Sudanese Civil War who wins a lottery for relocation to the United States with three other lost boys. Encountering the modern world for the first time, they develop an unlikely friendship with a brash American woman assigned to help them, but the young man struggles to adjust to this new life and his feelings of guilt about the brother he left behind.",
                "popularity": 2.1143,
                "poster_path": "/yAhoeIwwtPxJ7uf9HLIMHIqWFnL.jpg",
                "release_date": "2014-09-10",
                "title": "The Good Lie",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 543,
                "character": "Police Officer",
                "credit_id": "54ed8c05c3a368402d00126e",
                "order": 35
            },
            {
                "adult": false,
                "backdrop_path": "/wePpxpU1eNZnHCChP5xGNJrGKY3.jpg",
                "genre_ids": [
                    10751,
                    18
                ],
                "id": 339984,
                "original_language": "en",
                "original_title": "Miracles from Heaven",
                "overview": "When Christy discovers her 10-year-old daughter Anna has a rare, incurable disease, she becomes a ferocious advocate for her daughter’s healing as she searches for a solution. After Anna has a freak accident and falls three stories, a miracle unfolds in the wake of her dramatic rescue that leaves medical specialists mystified, her family restored and their community inspired.",
                "popularity": 5.4227,
                "poster_path": "/hz9VF1TfaM0D04pYneSXUkNeOZv.jpg",
                "release_date": "2016-03-17",
                "title": "Miracles from Heaven",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 1223,
                "character": "Dr. Dorsi",
                "credit_id": "55fafe25c3a36826f5000173",
                "order": 17
            },
            {
                "adult": false,
                "backdrop_path": "/ebcXKfXz3ly9TXh5Anef8LYhfEn.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 87825,
                "original_language": "en",
                "original_title": "Trouble with the Curve",
                "overview": "Slowed by age and failing eyesight, crack baseball scout Gus Lobel takes his grown daughter along as he checks out the final prospect of his career. Along the way, the two renew their bond, and she catches the eye of a young player-turned-scout.",
                "popularity": 4.8387,
                "poster_path": "/zLZQVmxOj5kICbS5Pq7rB1cbPvP.jpg",
                "release_date": "2012-09-21",
                "title": "Trouble with the Curve",
                "video": false,
                "vote_average": 6.995,
                "vote_count": 1643,
                "character": "Umpire",
                "credit_id": "57c88289c3a36866e600162f",
                "order": 35
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Sharing a birthday with Bruce Lee and Jimi Hendrix didn't add pressure to the skinny Spanish kid, it only inspired ambition. Raised on baseball fields in Tampa, Florida, Kenny Alfonso spent most of his youth following a funny Dad and older brother around, learning to hit a curveball, and secretly wishing he was Kung Fu - Rock Star. After a brief stint in a few minor league camps, Kenny spent time as a State Attorney's Investigator and Pharmaceautical Rep before becoming a full-time actor in 1994.\n\nOn film Kenny can be seen in \"The Bay\" Directed by Barry Levinson, \"Trouble with The Curve\" starring Clint Eastwood, Amy Adams and Justin Timberlake, \"The Hot Flashes\" starring Brooke Shields, Virginia Madsen, Wanda Sykes, Daryl Hannah and Camryn Manheim, \"The Change Up\" starring Ryan Reynolds and Jason Bateman amongst others.\n\nOn TV Kenny returns this Summer for a 4th season as Attorney Joe Cummings in the Lifetime Network Hit \"Drop Dead Diva\". Other TV credits include; ABC Family's \"Christmas Cupid, the Lifetime mini-series \"Marry Me\", USA Network's \"Necessary Roughness\", Lifetime's \"Army Wives\", Fox's \"Prison Break\" and Tyler Perry's \"House of Payne\" on TBS. Kenny was the Co-host and 'Barkitect' of \"Barkitecture\", a 'how to' show on the D.I.Y. Network and HGTV.\n\nHe has appeared in over 80 national and regional commercials and has performed on stage from coast-to-coast in his one-man shows and The Goods Variety Show which he co-created. \n\nHe is also the co-founder and principle owner of The Goods® Brand. Founded in 1997, TGI is the Atlanta-based entertainment and clothing company connected by The Goods® Brand and its meaning of self-belief and empowerment. \n\nKenny makes his home in Atlanta with daughter Jessy and long time partner, actress Melissa Ponzio. - IMDb Mini Biography",
        "birthday": "1966-11-27",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1088939,
        "imdb_id": "nm0019171",
        "known_for_department": "Acting",
        "name": "Kenny Alfonso",
        "place_of_birth": "Tampa, Florida, USA",
        "popularity": 0.3987,
        "profile_path": "/oZTZ6eK1KIJCXNgHtclPbSjyEfO.jpg"
    }
}