{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/k8sH3RyFg1G4fHN0k9QNoHk8i4E.jpg",
                "genre_ids": [
                    53,
                    18,
                    9648,
                    80
                ],
                "id": 13528,
                "original_language": "en",
                "original_title": "Gaslight",
                "overview": "A newlywed fears she's going mad when strange things start happening at the family mansion.",
                "popularity": 2.535,
                "poster_path": "/gXKszCl5Q1KrgWRWpPcqn94CP58.jpg",
                "release_date": "1944-05-04",
                "title": "Gaslight",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 515,
                "character": "Lady Dalroy",
                "credit_id": "54bf403b9251416e60007fe2",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nHeather Thatcher (3 September 1896 – 15 February 1987) was an English actress in theatre and films. She was from London.  The Plaything (1929), produced by Castleton Knight and Elstree Studios, begins as a silent film. It develops into an audible film which is recorded in good quality for its time. The theme concerns a Highland laird who falls in love with a hedonistic London heiress. Thatcher plays a prominent role as Martyn Bennett.\n\nIn 1931 she visited Hollywood while attending the wedding of James Gleason. As a star of English comedy, she was being compared to Marilyn Miller, Thatcher wore a monocle to the marriage ceremony. In the autumn of 1931 she was invited to a reception following the premiere of Strictly Dishonorable (1931), at the Carthay Circle Theatre. Among her friends in films were Anthony Bushell and Zelma O'Neal.\n\nThatcher was signed by MGM in February 1932. She was given a feature role in But The Flesh Is Weak (1932). The film stars Robert Montgomery and is directed by Jack Conway. The film was adapted from a British stage production which showcased Novello. Thatcher was praised for her performance. German actress, Nora Gregor was found disappointing. The English actress \"gives a brilliant performance and creates the only human being in the piece.\"\n\nThatcher sued Gloria Swanson British Productions for breach of contract in a suit which was settled in December 1933. During the filming of Perfect Understanding (1933) Thatcher's contract was cancelled before the production was completed. No explanation was given. She was excluded from the film when a new author was hired. The replacement writer chose to eliminate her character.\n\nThe Private Life of Don Juan (1934) was also filmed at Elstree Studios. The film has Douglas Fairbanks Sr. as its leading man. Owen Nares plays the title role and Thatcher is Anna Dora, one of the ladies.\n\nLater in her career Thatcher returned to Britain to make films. Among these is Will Any Gentleman...? (1953), filmed at Elstree Studios in Borehamwood. Thatcher appears together with George Cole and Veronica Hurst. The film was a short adventure about a hypnotist who puts a man in a trance.\n\nThatcher made her last films in 1955. The Deep Blue Sea has a screenplay written by Terence Rattigan and features Vivien Leigh and Kenneth More. Thatcher depicts Aunt May Luton in Josephine and Men. The film is a comedy starring Glynis Johns and Peter Finch.",
        "birthday": "1896-09-03",
        "deathday": "1987-02-15",
        "gender": 1,
        "homepage": null,
        "id": 108804,
        "imdb_id": "nm0857124",
        "known_for_department": "Acting",
        "name": "Heather Thatcher",
        "place_of_birth": "London, England, UK",
        "popularity": 0.1376,
        "profile_path": "/pAa4bVyUUSbrWT8ghhDsfvxvIaw.jpg"
    }
}