{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6tAYyCxF0T5oUIH95zMBC3X3W5T.jpg",
                "genre_ids": [
                    10751,
                    14,
                    35
                ],
                "id": 668461,
                "original_language": "en",
                "original_title": "Slumberland",
                "overview": "A young girl discovers a secret map to the dreamworld of Slumberland, and with the help of an eccentric outlaw, she traverses dreams and flees nightmares, with the hope that she will be able to see her late father again.",
                "popularity": 2.4604,
                "poster_path": "/eCgBLNAFC4XDZ4DiyQ80PIJdSHU.jpg",
                "release_date": "2022-11-18",
                "title": "Slumberland",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 886,
                "character": "Carla",
                "credit_id": "637b56f431644b00cdfeef31",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/sBB39VMtByFltGGGW2c5N6LOAvj.jpg",
                "genre_ids": [
                    18,
                    53,
                    80
                ],
                "id": 8470,
                "original_language": "en",
                "original_title": "John Q",
                "overview": "John Quincy Archibald is a father and husband whose son is diagnosed with an enlarged heart and then finds out he cannot receive a transplant because HMO insurance will not cover it. Therefore, he decides to take a hospital full of patients hostage until the hospital puts his son's name on the donor's list.",
                "popularity": 4.3211,
                "poster_path": "/xEE91LvXiqgs7Hmdl44LCzHtFf6.jpg",
                "release_date": "2002-02-15",
                "title": "John Q",
                "video": false,
                "vote_average": 7.136,
                "vote_count": 2486,
                "character": "State Employee",
                "credit_id": "60975e9254508d003c0d7f52",
                "order": 27
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Yanna MacIntosh"
        ],
        "biography": "Yanna McIntosh (born 1970) is a Jamaican-born Canadian stage, film and television actress. Yanna honed her craft at the University of Toronto and the American Repertory Theatre Institute at Harvard University. Her teaching roles at the National Theatre School and Humber College included directing students in acclaimed productions like Macbeth, Julius Caesar, and Richard III. Her portrayal of Pat Barrows in the 2006 TV movie \"Doomstown\" earned her a 2007 Gemini Award for Best Performance by an Actress in a Featured Supporting Role. Notably, McIntosh made history in 2011 as the inaugural recipient of the Toronto Theatre Critics’ Award for Best Actress in a Play for her role in \"Ruined,\" which also garnered her a Dora Mavor Moore Award for Outstanding Performance. She had previously won Doras for her roles in Florence Gibson’s \"Belle\" and Athol Fugard’s \"Valley Song.\"",
        "birthday": "1970-01-01",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 108894,
        "imdb_id": "nm0570700",
        "known_for_department": "Acting",
        "name": "Yanna McIntosh",
        "place_of_birth": "Giamaica",
        "popularity": 0.255,
        "profile_path": "/yNLvstXT7T0POLQjMuLf4K5cTRz.jpg"
    }
}