{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sZUnqJCjEUtdZ0vhPO3oe1PFYV9.jpg",
                "genre_ids": [
                    27,
                    18,
                    9648
                ],
                "id": 8408,
                "original_language": "en",
                "original_title": "Day of the Dead",
                "overview": "As the world is overrun by zombies, scientists and military personnel in an underground Florida bunker must decide on how they should deal with the undead.",
                "popularity": 3.2169,
                "poster_path": "/bi7SO5F4VyyGQTlxQirbH1dwKzW.jpg",
                "release_date": "1985-07-03",
                "title": "Day of the Dead",
                "video": false,
                "vote_average": 7.041,
                "vote_count": 1308,
                "character": "Featured Zombie",
                "credit_id": "52fe44a5c3a36847f80a213d",
                "order": 14
            },
            {
                "adult": false,
                "backdrop_path": "/gYapxyWZXFYcCHtf5dVB2Ub9RTy.jpg",
                "genre_ids": [
                    18
                ],
                "id": 2007,
                "original_language": "en",
                "original_title": "Lorenzo's Oil",
                "overview": "Augusto and Michaela Odone are dealt a cruel blow by fate when their five-year-old son Lorenzo is diagnosed with a rare and incurable disease. But the Odones' persistence and faith leads to an unorthodox cure which saves their boy and re-writes medical history.",
                "popularity": 2.6869,
                "poster_path": "/suRf59zRu1h8Zq4Gxekn6UiLGaM.jpg",
                "release_date": "1992-12-30",
                "title": "Lorenzo's Oil",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 542,
                "character": "Pellerman",
                "credit_id": "5deebd73daf57c0013eeeab9",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "William Cameron is best known as the author of Violet Sharp, winner of the 2007 Julie Harris Playwriting Prize. Violet Sharp, a drama of the Lindbergh Kidnapping Case, received its world premiere at Theatre 40 in Los Angeles in 2009 and was published by Samuel French in 2012.  ​More recently, Bill’s drama Truth Be Told has received national attention. A taut, two-character drama exploring the aftermath of a mass shooting, Truth Be Told won both the 2020 Stanley Drama Award from Wagner College and the W. Keith Hedrick Playwriting Contest from HRC Showcase Theatre.  Truth Be Told was also featured in this year’s Ashland New Plays Festival in Ashland, Oregon, as well as the Dayton Playhouse's FutureFest 2021.\n\n​Bill’s plays have been performed around the country, including off-off Broadway at the Harold Clurman Theatre, the Source Theatre in Washington, DC, the Pittsburgh New Works Festival, and numerous community and academic theatres. Professor emeritus of Theatre and Communication Arts at Washington & Jefferson College in Pennsylvania, William has written several plays tailored specifically to his students. These include Intersect, a drama about racial tensions at a small college, and Cease to Exist, a chronicle of the Manson murders.  Bill lives in Washington, Pennsylvania with his wife, artist and actress Susan Martinelli.",
        "birthday": "1955-01-21",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.williamcameron.net",
        "id": 1090362,
        "imdb_id": "nm0131752",
        "known_for_department": "Acting",
        "name": "William Cameron",
        "place_of_birth": "Washington, Pennsylvania, USA",
        "popularity": 0.0579,
        "profile_path": null
    }
}