{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/o869RihWTdTyBcEZBjz0izvEsVf.jpg",
                "genre_ids": [
                    878,
                    12
                ],
                "id": 693134,
                "original_language": "en",
                "original_title": "Dune: Part Two",
                "overview": "Follow the mythic journey of Paul Atreides as he unites with Chani and the Fremen while on a path of revenge against the conspirators who destroyed his family. Facing a choice between the love of his life and the fate of the known universe, Paul endeavors to prevent a terrible future only he can foresee.",
                "popularity": 16.311,
                "poster_path": "/6izwz7rsy95ARzTR3poZ8H6c5pp.jpg",
                "release_date": "2024-02-27",
                "title": "Dune: Part Two",
                "video": false,
                "vote_average": 8.136,
                "vote_count": 7031,
                "character": "Harkonnen Scanner Operator",
                "credit_id": "6468f69ac3514c00e5dd3e44",
                "order": 73
            },
            {
                "adult": false,
                "backdrop_path": "/sFEYsEfzTx7hhjetlNrme8B5OUo.jpg",
                "genre_ids": [
                    28,
                    53,
                    878
                ],
                "id": 752,
                "original_language": "en",
                "original_title": "V for Vendetta",
                "overview": "In a world in which Great Britain has become a fascist state, a masked vigilante known only as “V” conducts guerrilla warfare against the oppressive British government. When V rescues a young woman from the secret police, he finds in her an ally with whom he can continue his fight to free the people of Britain.",
                "popularity": 8.3222,
                "poster_path": "/1avD1JeaRiJX5M4ahPdZPypGoGN.jpg",
                "release_date": "2006-02-23",
                "title": "V for Vendetta",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 15001,
                "character": "Soldier (uncredited)",
                "credit_id": "553d311bc3a3683c48004785",
                "order": 75
            },
            {
                "adult": false,
                "backdrop_path": "/mhgfOLtAiJk1nm3kKlkiUKl7e9M.jpg",
                "genre_ids": [
                    53,
                    80,
                    9648
                ],
                "id": 2252,
                "original_language": "en",
                "original_title": "Eastern Promises",
                "overview": "A Russian teenager living in London dies during childbirth but leaves clues in her diary that could tie her child to a rape involving a violent Russian mob family.",
                "popularity": 4.7293,
                "poster_path": "/dpiJWb4NrWgcOg2rusuLhDM0hTm.jpg",
                "release_date": "2007-09-14",
                "title": "Eastern Promises",
                "video": false,
                "vote_average": 7.356,
                "vote_count": 3513,
                "character": "Football Hooligan (uncredited)",
                "credit_id": "553d314ac3a3683e5500606c",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Anthony Cook",
            "Anthony Francis Cook"
        ],
        "biography": "Tony is a young British actor, born and raised in South London.\n\nTony began his leap from student performances to professional roles during his studies, by taken the role of John Proctor in 'The Crucible', a large challenge for a young actor. Tony's portrayal of the character led him to high praise. From this, he then began to leave the stage to enter into film.\n\nTony is a recognizable actor within the British Independent Film industry, completing many feature films and shorts, working with some of the most talented cast and crews ranging from areas such as Britain, Hong Kong, America, Ireland and many more. He was first noticed by the talented director, Steven Nesbit, who took Tony under his wing and aided his growth as an actor which allowed him to work alongside talent such as the DoP Geoff Boyle . Tony has completed photo shoots for publicity, where he will be advertised as \"one of Britain's best undiscovered actors\".\n\nTony has completed work for MTV BASE, acting in multiple comedy sketches, which led to him being cast in an MTV International Aids awareness short, both of which where shown globally.\n\nRecently, he has acted in the feature film 'Butterflies & Bullets'. Whilst also completing the role of James - Barman in Nick Moran (Lock, Stock and Two Smoking Barrels(1998) lead actor) feature The Kid (2010) where he acted alongside Rupert Friend and David O'Hara.\n\nTony has had press coverage since beginning his break from independent films into mainstream cinematic releases. He has been approached to do cinematic films whilst producing his own, Welcome to Purgatory (2015) and Superman: Requiem (2011). He has been interviewed by multiple newspapers and BBC radio London.\n\nTony was called upon by Toby Richards, creators of Rise of the Footsoldier (2007)andDoghouse (2009) to perform in his short film Father's Day (2009) which has received critical acclaim on the festival circuit. Shot on RED one and starring Toby Richards and Kevin McNally (Valkyrie (2008), Pirates of the Caribbean: On Stranger Tides (2011)).\n\nHe has recently attended film festivals, promoting Three (2010) and Ari (2010), 'Three' was nominated for best comedy at the Portobello Film Festival. After completingYoghurt (2010), Tony is now preparing for 'Fracture', a short film using green screen to portray four different versions of Tony's character. Once this is complete, Tony will be moving on to film 'Welcome To Purgatory'.\n\nTony frequently works alongside Marcus Ako, Gene Fallaize and Tony Fordham .",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 109167,
        "imdb_id": "nm3578065",
        "known_for_department": "Acting",
        "name": "Tony Cook",
        "place_of_birth": "South London, England, UK",
        "popularity": 0.1338,
        "profile_path": "/7F6BWp311YTed9xJ42GpgAckHEE.jpg"
    }
}