{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5P6hWD4zxAMntRuRnB4MmPLijNw.jpg",
                "genre_ids": [
                    18
                ],
                "id": 22881,
                "original_language": "en",
                "original_title": "The Blind Side",
                "overview": "The story of Michael Oher, a homeless and traumatized boy who became an All American football player and first round NFL draft pick with the help of a caring woman and her family.",
                "popularity": 14.2372,
                "poster_path": "/bMgq7VBriuBFknXEe9E9pVBYGZq.jpg",
                "release_date": "2009-11-20",
                "title": "The Blind Side",
                "video": false,
                "vote_average": 7.674,
                "vote_count": 6589,
                "character": "DMV Employee",
                "credit_id": "5f5053c24cd912003477e072",
                "order": 23
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Stacey Turner was born in Atlanta, GA to Peggy, a real estate broker and Jerry Turner, a government employee with the U.S. Department of Education. Stacey attended Georgia State University and after college moved around the U.S. for six years while pursuing a television news career. Atlanta was the final stop on the news circuit, where she worked as the morning reporter for CBS46's Good Morning Atlanta. While in the news biz Stacey earned an Emmy nomination, two Society of Professional Journalists Green Eyeshade Awards, and was selected as a favorite television personality by a local Texas magazine.\n\nHer first acting role was in a church play at the age of 6. For Stacey, being from a small town on the outskirts of Atlanta was about as far from Hollywood as a girl could be. It wouldn't be until many years later, doing a play while working as a reporter in Savannah, that the interest would be re-sparked. Stacey decided to leave a career in the news industry to pursue acting full time. It wasn't long before she landed a small role in the film The Blind Side (2009) starring Sandra Bullock. While in Atlanta she also booked roles on The Army Wives and Drop Dead Diva. Shortly after that Stacey moved to Los Angeles to continue her career. Since her move she has had the opportunity to work on several films with directors such as Sophia Coppola, The Bling Ring (2013), Phil Joanou, The Veil (2015) and Jonathan Liebesman, Battle: Los Angeles (2011). She has also worked on top rated television shows including Bones, Scandal, Graceland and Legends.\n\n- IMDb Mini Biography",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1091772,
        "imdb_id": "nm2407063",
        "known_for_department": "Acting",
        "name": "Stacey Turner",
        "place_of_birth": "Atlanta, Georgia, USA",
        "popularity": 1.3218,
        "profile_path": "/9vNOZjmuhhvnrl6ee3UBQA5ZClz.jpg"
    }
}