{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mFfyE5DPFDqoes4HIcElHc2a15y.jpg",
                "genre_ids": [
                    18
                ],
                "id": 334,
                "original_language": "en",
                "original_title": "Magnolia",
                "overview": "On one random day in the San Fernando Valley, a dying father, a young wife, a male caretaker, a famous lost son, a police officer in love, a boy genius, an ex-boy genius, a game show host and an estranged daughter will each become part of a dazzling multiplicity of plots, but one story.",
                "popularity": 8.4459,
                "poster_path": "/tpfC325Jk6S38VTe5dDWjWtoyxr.jpg",
                "release_date": "1999-12-17",
                "title": "Magnolia",
                "video": false,
                "vote_average": 7.729,
                "vote_count": 3746,
                "character": "Officer Tom 1958 (uncredited)",
                "credit_id": "645ff11a6e0d72013dcbae87",
                "order": 107
            },
            {
                "adult": false,
                "backdrop_path": "/bYimqNnizPUCnL5HOdoCW02IGmH.jpg",
                "genre_ids": [
                    18,
                    35,
                    10749
                ],
                "id": 74643,
                "original_language": "fr",
                "original_title": "The Artist",
                "overview": "Hollywood, 1927: As silent movie star George Valentin wonders if the arrival of talking pictures will cause him to fade into oblivion, he sparks with Peppy Miller, a young dancer set for a big break.",
                "popularity": 3.2908,
                "poster_path": "/z68py0ZqPgeacGPG54AGVRbNBS7.jpg",
                "release_date": "2011-10-12",
                "title": "The Artist",
                "video": false,
                "vote_average": 7.45,
                "vote_count": 3366,
                "character": "Michel (uncredited)",
                "credit_id": "566db2dbc3a3683f5600b698",
                "order": 65
            },
            {
                "adult": false,
                "backdrop_path": "/tyBkBHKDrJyVUeCs550kMr61jnq.jpg",
                "genre_ids": [
                    10749,
                    27
                ],
                "id": 6114,
                "original_language": "en",
                "original_title": "Bram Stoker's Dracula",
                "overview": "In 19th century England, Count Dracula travels to London and meets Mina Harker, a young woman who appears as the reincarnation of his lost love.",
                "popularity": 7.9936,
                "poster_path": "/n39glC4GkBeCbwdenES8ZBodim8.jpg",
                "release_date": "1992-11-13",
                "title": "Bram Stoker's Dracula",
                "video": false,
                "vote_average": 7.446,
                "vote_count": 5438,
                "character": "Priest (uncredited)",
                "credit_id": "5e8d64fb629b2c0013016d1f",
                "order": 37
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Michael Laren was catapulted to success early on in his dramatic journey with a career-defining portrayal of Jack Frost. His performance in the parochial chestnut \"The Christmas Song Sketch\" from Sister Bea DeMille's 1967 St. Mary's Grade School Yuletide Extravaganza brought down the Catholitorium. Young Master Laren received quite favorable reviews from the Vatican (Pope Paul VI). Alas, his intervening years have been spent trying to recapture that youthful pinnacle of success and the aforementioned papal adulation. Thus for many a year, and through many a succession of papal heirs to St. Peter's throne (with nary a congratulatory note or opening night bouquet from any one of them, mind you), Michael has journeyed forward with steadfast determination, ever onward in search of his next great theatrical conquest. Whether under the lights of the Broadway stage (a nice supporting part with limited dancing, modest housing and per diem) or beneath the tinsel of Hollywood (a series regular role whose character, though mute, appears in every episode of a weekly one-hour program and whose presence is integral to the story lines), Michael Laren will trod the boards, continuing to have a profound dramatic impact on monasteries and nunneries the world over. Plus a few synagogues, (from his great-great-grandmothers side)...also a couple of ashrams...oh, and a vegan commune in Topanga Canyon.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1091366,
        "imdb_id": "nm0488083",
        "known_for_department": "Acting",
        "name": "Michael Laren",
        "place_of_birth": "Redwood City, California, USA ",
        "popularity": 0.2173,
        "profile_path": null
    }
}