{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6kqybERm5qi2jGpu8I7DaQPxpSU.jpg",
                "genre_ids": [
                    16,
                    18
                ],
                "id": 2011,
                "original_language": "fr",
                "original_title": "Persepolis",
                "overview": "In 1970s Iran, Marjane 'Marji' Satrapi watches events through her young eyes and her idealistic family of a long dream being fulfilled of the hated Shah's defeat in the Iranian Revolution of 1979. However as Marji grows up, she witnesses first hand how the new Iran, now ruled by Islamic fundamentalists, has become a repressive tyranny on its own.",
                "popularity": 2.2027,
                "poster_path": "/aU8i2QAdTyRR1nYb36Gq51xXP8p.jpg",
                "release_date": "2007-06-27",
                "title": "Persepolis",
                "video": false,
                "vote_average": 7.887,
                "vote_count": 2037,
                "character": "Marjane's Father (voice)",
                "credit_id": "52fe432cc3a36847f803fc5b",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/c2gcLDxniE0lNmT2a7CcQVuW6En.jpg",
                "genre_ids": [
                    12,
                    28,
                    53
                ],
                "id": 36557,
                "original_language": "en",
                "original_title": "Casino Royale",
                "overview": "Le Chiffre, a banker to the world's terrorists, is scheduled to participate in a high-stakes poker game in Montenegro, where he intends to use his winnings to establish his financial grip on the terrorist market. M sends Bond—on his maiden mission as a 00 Agent—to attend this game and prevent Le Chiffre from winning. With the help of Vesper Lynd and Felix Leiter, Bond enters the most important poker game in his already dangerous career.",
                "popularity": 15.7119,
                "poster_path": "/lMrxYKKhd4lqRzwUHAy5gcx9PSO.jpg",
                "release_date": "2006-11-14",
                "title": "Casino Royale",
                "video": false,
                "vote_average": 7.564,
                "vote_count": 11141,
                "character": "Alex Dimitrios",
                "credit_id": "52fe45f29251416c91043e83",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/flqONlzGNUkGCJr9BfBhGNLYo6B.jpg",
                "genre_ids": [
                    35,
                    36
                ],
                "id": 544510,
                "original_language": "fr",
                "original_title": "Edmond",
                "overview": "Paris, France, December 1897. The young playwright Edmond Rostand feels like a failure. Inspiration has abandoned him. Married and father of two children, desperate and penniless, he persuades the great actor Constant Coquelin to perform the main role in his new play. But there is a problem: Coquelin wants to premiere it at Christmas and Edmond has not written a single word.",
                "popularity": 1.918,
                "poster_path": "/9Y1VxSfJdu8fqQqgX0x6OObxvUw.jpg",
                "release_date": "2018-11-10",
                "title": "Cyrano, My Love",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 516,
                "character": "Ange Fleury",
                "credit_id": "5b812a400e0a26459600ca04",
                "order": 9
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/gwRWQeHfPuA8mg73kydQsM8rdXq.jpg",
                "genre_ids": [
                    18
                ],
                "id": 687,
                "original_language": "en",
                "original_title": "Dead Man Walking",
                "overview": "A death row inmate turns for spiritual guidance to a local nun in the days leading up to his scheduled execution for the murders of a young couple.",
                "popularity": 3.3932,
                "poster_path": "/eShxyjhWoFl3BwsuEmVsr4nLaMZ.jpg",
                "release_date": "1995-12-29",
                "title": "Dead Man Walking",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1415,
                "credit_id": "57b3b5a792514148cd0011cc",
                "department": "Crew",
                "job": "Thanks"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Simone Abkarian"
        ],
        "biography": "Simon Abkarian (born 5 March 1962) is a French-Armenian actor.\n\nBorn in Gonesse, Val d'Oise, of Armenian descent, Abkarian spent his childhood in Lebanon. He moved to Los Angeles, where he joined an Armenian theater company managed by Gerald Papazian. He returned to France in 1985, settling in Paris. He took classes at the Acting International school, then he joined Ariane Mnouchkine's Théâtre du Soleil.\n\nAbkarian left the Théâtre du Soleil in 1993 and played in 2001 \"Beast on the Moon\" by Richard Kalinoski, directed by Irina Brook, a play about the life of a survivor of the Genocide of the Armenians, a role which won him critical acclaims and the Molière of the best comedian.\n\nHis first roles in cinema were proposed by French filmaker Cédric Klapisch, who asked him to play in several of his movies, notably in \"Chacun cherche son chat\" (\"When the Cat is Away\" (1996) and in \"Ni pour, ni contre (bien au contraire)\" en 2003.\n\nHe was featured in Sally Potter's Yes (2004), in which he played the lead role.\n\nAbkarian then played Mehdi Ben Barka in the thriller \"J'ai vu tuer Ben Barka\" by Serge Le Péron, about the kidnapping and the murder of the leader of the Moroccan opposition. He then played in \"Prendre Femme\" by Ronit Elkabetz which won him several interpretation prizes. Playing different roles and in different genres, he was featured in the adventure \"Zaïna, cavalière de l'Atlas\" by Bourlem Guerdjou, in the comedy \"Le Démon de midi\" by Marie-Pascale Osterriet. He has also appeared in Atom Egoyan's Ararat (2002), he was Albert in Almost Peaceful (2004) by French Director Michel Deville a film about Holocaust survivors, he was featured in \"Your Dreams\" (2005) by Denis Thybaud. He played the role of villain Alex Dimitrios in the James Bond film, Casino Royale. The character is a Government contractor and arms dealer working against Bond.\n\nHe was featured as Sahak in the thriller \"Les Mauvais Joueurs\" (\"The Gamblers\") (2007) by Frédéric Balekdjian. He has also been the voice of Ebi in the French version of the animated feature \"Persepolis\". Abkarian played the role of the eminent Armenian poet Missak Manouchianin in \"Army of Crime\" (2010) by Robert Guédiguian, a French filmaker based in Marseilles, who is also of Armenian parentage.\n\nHe has also played Dariush Bakhshi, the Iranian Special Consul, in the BBC drama Spooks MI-5.\n\nAbkarian is known for his intensity in acting and for his ecclectism in the roles he choses.\n\nDescription above from the Wikipedia article Simon Abkarian, licensed under CC-BY-SA, full list of contributors on Wikipedia .",
        "birthday": "1962-03-05",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 10917,
        "imdb_id": "nm0008787",
        "known_for_department": "Acting",
        "name": "Simon Abkarian",
        "place_of_birth": "Gonesse, Val d'Oise, France",
        "popularity": 0.2441,
        "profile_path": "/rpw1AujIl0vJD6cyMDo2ykJ8rZA.jpg"
    }
}