{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/c2gcLDxniE0lNmT2a7CcQVuW6En.jpg",
                "genre_ids": [
                    12,
                    28,
                    53
                ],
                "id": 36557,
                "original_language": "en",
                "original_title": "Casino Royale",
                "overview": "Le Chiffre, a banker to the world's terrorists, is scheduled to participate in a high-stakes poker game in Montenegro, where he intends to use his winnings to establish his financial grip on the terrorist market. M sends Bond—on his maiden mission as a 00 Agent—to attend this game and prevent Le Chiffre from winning. With the help of Vesper Lynd and Felix Leiter, Bond enters the most important poker game in his already dangerous career.",
                "popularity": 16.5461,
                "poster_path": "/lMrxYKKhd4lqRzwUHAy5gcx9PSO.jpg",
                "release_date": "2006-11-14",
                "title": "Casino Royale",
                "video": false,
                "vote_average": 7.564,
                "vote_count": 11144,
                "character": "Solange",
                "credit_id": "52fe45f29251416c91043e7f",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "​Caterina Murino was born on September 15, 1977, in Cagliari, Sardinia, Italy. In 1996 she reached the fourth place in the Miss Italy contest. Then she moved to Milan where she began working as a model in commercials for Mastercard, Swatch, Mercedes Benz, and Nescafe among other gigs. From 1999-2000 she studied acting at the Scuola di Cinema e Teatro di Francesca de Sapio in Italy. In 1999, Murino made her acting debut in a stage production of Richard III and also in several Italian language plays. In 2002 she began her film and television career with playing bit parts in Italian, German, and French productions. Her breakthrough came in 2004, when she co-starred opposite Jean Reno in a French comedy L'enquête Corse (2004).\n\nMs. Murino is trilingual, she speaks French and English in addition to her native Italian. She is a versatile actress and a good athlete. Her talents include singing, dancing tango, flamenco and oriental dances, as well as horseback riding. She is co-starring as Solange, one of three Bond girls, opposite Daniel Craig in Casino Royale (2006).  ((Bio from IMDB))",
        "birthday": "1977-09-15",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 10916,
        "imdb_id": "nm1166528",
        "known_for_department": "Acting",
        "name": "Caterina Murino",
        "place_of_birth": "Cagliari, Sardinia, Italy",
        "popularity": 1.1215,
        "profile_path": "/2B4D38LJ3noNbwcukETrQ1DUiQt.jpg"
    }
}