{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/evUB9YKE5IPPtQOchcEF6hS90BO.jpg",
                "genre_ids": [
                    18,
                    9648,
                    80
                ],
                "id": 37257,
                "original_language": "en",
                "original_title": "Witness for the Prosecution",
                "overview": "An ailing barrister agrees to defend a man in a sensational murder trial where the unconvincing testimony of the defendant's wife becomes a subject of confusion.",
                "popularity": 4.358,
                "poster_path": "/bCj4EfuehAlgBwVd3diyWyhuuau.jpg",
                "release_date": "1957-12-17",
                "title": "Witness for the Prosecution",
                "video": false,
                "vote_average": 8.214,
                "vote_count": 1541,
                "character": "Leonard Vole",
                "credit_id": "52fe46379251416c9104d25d",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Тайрон Пауэр",
            "Tyrone Edmund Power III",
            "泰隆·鲍华",
            "تایرون پاور"
        ],
        "biography": "One of the great romantic swashbuckling stars of the mid-twentieth  century, and the third Tyrone Power of four in a famed acting dynasty  reaching back to the eighteenth century. His great-grandfather was the  first Tyrone Power (1795-1841), a famed Irish comedian. His father,  known to historians as Tyrone Power Sr.,  but to his contemporaries as either Tyrone Power or Tyrone Power the  Younger, was a huge star in the theater (and later in films) in both  classical and modern roles. His mother, Patia Riaume (Mrs. Tyrone Power), was also a Shakespearean actress as well as a respected dramatic coach.\n\nTyrone  Edmund Power, Jr., (also called Tyrone Power III; May 5, 1914 - November 15, 1958) was born at his  mother's home of Cincinnati, Ohio, in 1914. A frail, sickly child, he  was taken by his parents to the warmer climate of southern California.  After his parents' divorce, he and his sister Anne Power returned to Cincinnati with their mother. There he attended school  while developing an obsession with acting. Although raised by his  mother, he corresponded with his father, who encouraged his acting  dreams. He was a supernumerary in his father's stage production of 'The  Merchant of Venice' in Chicago and held him as he died suddenly of a  heart attack later that year.\n\nStartlingly handsome, young Tyrone  nevertheless struggled to find work in Hollywood. He appeared in a few  small roles, then went east to do stage work. A screen test led to a  contract at 20th Century Fox in 1936, and he quickly progressed to  leading roles. Within a year or so, he was one of Fox's leading stars,  playing in contemporary and period pieces with ease. Most of his roles  were colorful without being deep, and his swordplay was more praised  than his wordplay. He served in the Marine Corps in World War II as a  transport pilot, and he saw action in the Pacific Theater of operations.\n\nAfter the war, he got his best reviews for an atypical part as a downward-spiraling con-man in Nightmare Alley (1947). Although he remained a huge star, much of his postwar work was  unremarkable. He continued to do notable stage work and also began  producing films. Following a fine performance in Billy Wilder's Witness for the Prosecution (1957), Power began production on Solomon and Sheba (1959). Halfway through shooting, he collapsed during a dueling scene with George Sanders, and he died of a heart attack before reaching a hospital.",
        "birthday": "1914-05-05",
        "deathday": "1958-11-15",
        "gender": 2,
        "homepage": null,
        "id": 10922,
        "imdb_id": "nm0000061",
        "known_for_department": "Acting",
        "name": "Tyrone Power",
        "place_of_birth": "Cincinnati, Ohio, USA",
        "popularity": 0.7366,
        "profile_path": "/zHKNyYKkWIQBwhqxCMNBns1eoXR.jpg"
    }
}