{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/evUB9YKE5IPPtQOchcEF6hS90BO.jpg",
                "genre_ids": [
                    18,
                    9648,
                    80
                ],
                "id": 37257,
                "original_language": "en",
                "original_title": "Witness for the Prosecution",
                "overview": "An ailing barrister agrees to defend a man in a sensational murder trial where the unconvincing testimony of the defendant's wife becomes a subject of confusion.",
                "popularity": 4.358,
                "poster_path": "/bCj4EfuehAlgBwVd3diyWyhuuau.jpg",
                "release_date": "1957-12-17",
                "title": "Witness for the Prosecution",
                "video": false,
                "vote_average": 8.214,
                "vote_count": 1541,
                "character": "Mr. Myers",
                "credit_id": "52fe46379251416c9104d279",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/1rSF7UoY6aU8i7yJOLovZv8AYwX.jpg",
                "genre_ids": [
                    53
                ],
                "id": 31997,
                "original_language": "en",
                "original_title": "Saboteur",
                "overview": "Aircraft factory worker Barry Kane flees across the United States after he is wrongly accused of starting the fire that killed his best friend.",
                "popularity": 3.4948,
                "poster_path": "/iDKOOTymUZg0WAWPcbdP6nPZEFF.jpg",
                "release_date": "1942-04-24",
                "title": "Saboteur",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 518,
                "character": "Man (uncredited)",
                "credit_id": "664fa9cddd35d1e2b7caf36c",
                "order": 98
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Torin Herbert Erskine Thatcher",
            "Lt. Torin Thatcher R.A.",
            "T. Atkinson",
            "Торин Тэтчер",
            "托林·撒切尔"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nTorin Thatcher (15 January 1905 - 4 March 1981) was an English actor born in Bombay, British India, India), to English parents. He was an imposing, powerfully built figure noted for his flashy portrayals of screen villains.\n\nHe was educated in England at Bedford School and at the Royal Academy of Dramatic Art. He worked as a schoolmaster before first appearing on the London stage in 1927 and then entering British films in 1934. He appeared in the 1937 Old Vic stage production of Hamlet, in which Laurence Olivier made his first appearance in the title role, opposite Vivien Leigh as Ophelia. During the Second World War, he served with the Royal Artillery and was demobilized with the rank of lieutenant colonel.\n\nThatcher appeared in classic British films of the late 1930s and 1940s, including Major Barbara (1941) and Great Expectations (1946), in which he played Bentley Drummle. He moved to Hollywood in the 1950s. He was constantly in demand, invariably lending his looming figure and baleful countenance to sinister or stern roles in popular costume thrillers such as The Crimson Pirate (1952), Blackbeard the Pirate (1952), The Robe (1953) (as the disapproving father of Richard Burton's character), The Black Shield of Falworth (1954), Helen of Troy (1956), Darby's Rangers (1958), and The 7th Voyage of Sinbad (1958). He also appeared in the Marlon Brando and Trevor Howard 1962 remake of Mutiny on the Bounty.\n\nHe returned to the stage quite frequently, notably on Broadway, in such esteemed productions as Edward, My Son (1948), That Lady (1949) and Billy Budd (1951). In 1959, he portrayed Captain Keller in the award-winning play The Miracle Worker with Anne Bancroft and Patty Duke. All of these plays were filmed, but Thatcher did not appear in the movie versions.\n\nAlso a steady fixture on television, he appeared in such made-for-TV films as adaptations of A. J. Cronin's Beyond This Place (1957) and The Citadel (1960),Bonanza(1961), and Brenda Starr (1976). He also played the title role in a Philco Television Playhouse version of Othello and acted in a CBS production of Beyond This Place (1957).\n\nThatcher died of cancer on March 4, 1981, in Thousand Oaks, California, in the Los Angeles area.",
        "birthday": "1905-01-15",
        "deathday": "1981-03-04",
        "gender": 2,
        "homepage": null,
        "id": 10925,
        "imdb_id": "nm0857147",
        "known_for_department": "Acting",
        "name": "Torin Thatcher",
        "place_of_birth": "Bombay, British India, India",
        "popularity": 0.3032,
        "profile_path": "/d5PZBimAcJjP239mVx98a2Ifv1o.jpg"
    }
}