{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/c8Pi8F1FzpNebtgXcSjC9nWCdSW.jpg",
                "genre_ids": [
                    35,
                    10752
                ],
                "id": 914,
                "original_language": "en",
                "original_title": "The Great Dictator",
                "overview": "Dictator Adenoid Hynkel tries to expand his empire while a poor Jewish barber tries to avoid persecution from Hynkel's regime.",
                "popularity": 4.0004,
                "poster_path": "/nhMXB8GTdswYMCL9nepDZymJCOr.jpg",
                "release_date": "1940-10-15",
                "title": "The Great Dictator",
                "video": false,
                "vote_average": 8.292,
                "vote_count": 3523,
                "character": "Garbitsch",
                "credit_id": "52fe428cc3a36847f802747f",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/iItypZVpdnxTFgA0iv345AzMUqk.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 981,
                "original_language": "en",
                "original_title": "The Philadelphia Story",
                "overview": "When a rich woman's ex-husband and a tabloid-type reporter turn up just before her planned remarriage, she begins to learn the truth about herself.",
                "popularity": 6.7871,
                "poster_path": "/dKUubjvxO78XDts6VP1Ggcp4R9O.jpg",
                "release_date": "1940-12-05",
                "title": "The Philadelphia Story",
                "video": false,
                "vote_average": 7.617,
                "vote_count": 914,
                "character": "Sidney Kidd",
                "credit_id": "52fe4296c3a36847f802a311",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/evUB9YKE5IPPtQOchcEF6hS90BO.jpg",
                "genre_ids": [
                    18,
                    9648,
                    80
                ],
                "id": 37257,
                "original_language": "en",
                "original_title": "Witness for the Prosecution",
                "overview": "An ailing barrister agrees to defend a man in a sensational murder trial where the unconvincing testimony of the defendant's wife becomes a subject of confusion.",
                "popularity": 4.358,
                "poster_path": "/bCj4EfuehAlgBwVd3diyWyhuuau.jpg",
                "release_date": "1957-12-17",
                "title": "Witness for the Prosecution",
                "video": false,
                "vote_average": 8.214,
                "vote_count": 1541,
                "character": "Mayhew",
                "credit_id": "52fe46379251416c9104d271",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/xMoQjqa3JUc2unO4nF9PmM1JTQu.jpg",
                "genre_ids": [
                    10402,
                    35,
                    10749
                ],
                "id": 11113,
                "original_language": "en",
                "original_title": "My Fair Lady",
                "overview": "A snobbish phonetics professor agrees to a wager that he can take a flower girl and make her presentable in high society.",
                "popularity": 4.1451,
                "poster_path": "/bTXVc29lGSNclf94VIZ49W4gGKl.jpg",
                "release_date": "1964-12-01",
                "title": "My Fair Lady",
                "video": false,
                "vote_average": 7.499,
                "vote_count": 1368,
                "character": "Ambassador (uncredited)",
                "credit_id": "60134cc6ea84c7003ebf9b08",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Henry Daniel",
            "亨利·丹尼尔",
            "Charles Henry Pywell Daniell"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nCharles Henry Daniell (5 March 1894 – 31 October 1963) was an English actor who had a long and prestigious career on stage as well as in films. He is perhaps best known for his villainous roles in films like The Great Dictator, The Philadelphia Story and The Sea Hawk. Daniell was given few opportunities to play a 'good guy', including a supporting part as Franz Liszt in the biographical film Song of Love (1947). His last name is sometimes spelled \"Daniel\".\n\nDaniell's film debut came in 1929 in Jealousy. He appeared as Professor Moriarty in the Basil Rathbone-Nigel Bruce Sherlock Holmes film The Woman in Green (1945). He appeared in other films such as Charlie Chaplin's The Great Dictator (1940) (playing Garbitsch, to sound like \"garbage\", a parody of Joseph Goebbels), and The Body Snatcher (1945, with Boris Karloff and Bela Lugosi) – as well as two other films in the Sherlock Holmes/Basil Rathbone series: The Voice of Terror (1942) and Sherlock Holmes in Washington (1943) with fellow Moriarty George Zucco.\n\nDaniell played the sleazy Baron de Varville opposite Greta Garbo in Camille (1936). Another early triumph was his portrayal of Cecil in The Private Lives of Elizabeth and Essex (1939). He also played the treacherous Lord Wolfingham (no relation to Francis Walsingham) in The Sea Hawk (1940), fighting Errol Flynn in what is often considered one of the most spectacular sword fighting duels ever filmed. When Michael Curtiz cast him in this film, Henry Daniell initially refused because he couldn't fence. Curtiz accomplished the climactic duel through the use of shadows and over-shoulder shots, with a double fencing Flynn with ingenious inter-cutting of their faces.\n\nTowards the end of the Second World War, he appeared in one of his most memorable film roles, as the cruel Mr. Brocklehurst in Jane Eyre (1944), opposite Joan Fontaine who played Eyre. That same year he appeared in The Suspect as Charles Laughton's blackmailing next-door neighbour. In the 1950s and 1960s, he did much television, and also appeared as the malevolent Dr. Emil Zurich in Edward L. Cahn's The Four Skulls of Jonathan Drake (1959), and in an episode of Maverick, \"Pappy\" opposite James Garner the same year. An absolute professional, he was always on the set when needed, and impatient when delays in filming took place. Much in demand for his dry, sardonic delivery, Daniell moved easily from big-budget films, such as (uncredited) Mutiny on the Bounty (1962), to television without difficulty. In 1957, Daniell appeared as King Charles II of England in the NBC anthology series The Joseph Cotten Show in the episode \"The Trial of Colonel Blood\", with Michael Wilding in the title role. In the same year he played the instructing solicitor to Charles Laughton's leading counsel barrister in Witness for the Prosecution (1957).\n\nThe actor claimed one of his favourite roles was as Tony Curtis' supervisor in the acclaimed Blake Edwards film Mister Cory (1957) at a time when the actor's career was clearly slowing down, but Daniell retained some of the best and most memorable lines in the movie, \"A gentleman never grabs. Manners, Mister Cory. I find them a prerequisite in any circumstance.\"",
        "birthday": "1894-03-04",
        "deathday": "1963-10-31",
        "gender": 2,
        "homepage": null,
        "id": 10924,
        "imdb_id": "nm0199787",
        "known_for_department": "Acting",
        "name": "Henry Daniell",
        "place_of_birth": "Barnes, Surrey, UK",
        "popularity": 0.3675,
        "profile_path": "/5g4V2fKBAI5TGjqfItfsnPjqZN9.jpg"
    }
}