{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/c2gcLDxniE0lNmT2a7CcQVuW6En.jpg",
                "genre_ids": [
                    12,
                    28,
                    53
                ],
                "id": 36557,
                "original_language": "en",
                "original_title": "Casino Royale",
                "overview": "Le Chiffre, a banker to the world's terrorists, is scheduled to participate in a high-stakes poker game in Montenegro, where he intends to use his winnings to establish his financial grip on the terrorist market. M sends Bond—on his maiden mission as a 00 Agent—to attend this game and prevent Le Chiffre from winning. With the help of Vesper Lynd and Felix Leiter, Bond enters the most important poker game in his already dangerous career.",
                "popularity": 16.5461,
                "poster_path": "/lMrxYKKhd4lqRzwUHAy5gcx9PSO.jpg",
                "release_date": "2006-11-14",
                "title": "Casino Royale",
                "video": false,
                "vote_average": 7.564,
                "vote_count": 11146,
                "character": "Woman in Casino (uncredited)",
                "credit_id": "56a02d02c3a36858cb00a85f",
                "order": 71
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Tara Cardinal is the daughter of a psychic and a musician. Tara grew up on a small farm in Indiana. Cardinal moved out on her own at age 16 and worked three jobs in order to initially support herself. She was discovered in a shopping mall and acted in her first movie in 2006. Tara frequently appears in horror and fantasy films and likes to perform her own stunts. Moreover, Cardinal has not only acted on stage, but also has modeled for various comic book characters, performed at Renaissance Festivals, and even done live shows as a professional wrestler. A dedicated humanitarian and staunch advocate for children's rights, Tara co-founded the non-profit peer counseling organization C.L.U.B. (Children Living Under Blindness) at age 12 and has toured middle schools in both America and Canada educating children on their rights and resources since the age of 15. Cardinal has a Bachelor's Degree in Psychology. In addition, Cardinal writes poetry as well as writes for the websites the IndependentCritic.com and NerdRemix.com. She lives in Los Angeles, California.",
        "birthday": "1978-03-10",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1093967,
        "imdb_id": "nm2286991",
        "known_for_department": "Acting",
        "name": "Tara Cardinal",
        "place_of_birth": null,
        "popularity": 0.0763,
        "profile_path": "/iayVmkFxcTkB16ATNPF0suyceCP.jpg"
    }
}