{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wcJmFsz8RqIhozMwvU81hreTX4i.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 12163,
                "original_language": "en",
                "original_title": "The Wrestler",
                "overview": "Aging wrestler Randy \"The Ram\" Robinson is long past his prime but still ready and rarin' to go on the pro-wrestling circuit. After a particularly brutal beating, however, Randy hangs up his tights, pursues a serious relationship with a long-in-the-tooth stripper, and tries to reconnect with his estranged daughter. But he can't resist the lure of the ring and readies himself for a comeback.",
                "popularity": 3.5185,
                "poster_path": "/6OTR8dSoNGjWohJNo3UhIGd3Tj.jpg",
                "release_date": "2008-09-07",
                "title": "The Wrestler",
                "video": false,
                "vote_average": 7.532,
                "vote_count": 3809,
                "character": "Wrestler",
                "credit_id": "57c4c998925141129b0023ce",
                "order": 54
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Very Mysterious Ice Cream",
            "Tenshi Takami",
            "Double C",
            "Antonio Cesaro",
            "Claudio Castignoli",
            "Cesaro"
        ],
        "biography": "Claudio Castagnoli is a Swiss professional wrestler, best known for his tenure in WWE under the ring name Cesaro (shortened from Antonio Cesaro). Prior to signing with WWE, Castagnoli wrestled under his real name in Ring of Honor (ROH) and various independent promotions, including Pro Wrestling Guerrilla (PWG), Combat Zone Wrestling (CZW), and Pro Wrestling Noah (NOAH). Castagnoli is an accomplished tag team wrestler, being a two-time ROH World Tag Team Champion with his partner Chris Hero (as \"The Kings of Wrestling;\" their 364-day reign as champions was the longest in ROH history up to that time). As Cesaro, he held 7 tag team titles in WWE: a two-time WWE SmackDown Tag Team Champion, and a five-time WWE (Raw) Tag Team Champion. Castagnoli has also held various independent tag team titles, such as the Chikara Campeonatos de Parejas, the JCW Tag Team Championship, and the CZW World Tag Team Championship. The Kings of Wrestling (the tag team he had with Chris Hero) were voted the 2010 Tag Team of the Year by Wrestling Observer Newsletter readers. He has additionally had success as a singles wrestler, being a one-time WWE United States Champion, the winner of the inaugural André the Giant Memorial Trophy at WrestleMania XXX, and a one-time PWG World Champion. When playing a villainous character, particularly in the United States, Castagnoli has been known to emphasize his European origin as part of his gimmick, proclaiming a superior intellect and fashion sensibility while regularly using moves such as the European uppercut. He gained a reputation for impressive in-ring feats of strength, and was called one of WWE's best and most underrated performers for much of his time there. He was even voted Most Underrated Wrestler in the world, for a record four years in a row (2013–2016), by the Wrestling Observer Newsletter.",
        "birthday": "1980-12-27",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1093514,
        "imdb_id": "nm2153884",
        "known_for_department": "Acting",
        "name": "Claudio Castagnoli",
        "place_of_birth": "Lucerne, Switzerland",
        "popularity": 0.3098,
        "profile_path": "/23LyZUJHA8VViWRJ3XamNMfZp60.jpg"
    }
}