{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cuodmX7wuVDciUH8LdSFEqoTzIy.jpg",
                "genre_ids": [
                    53,
                    80,
                    28
                ],
                "id": 70670,
                "original_language": "no",
                "original_title": "Hodejegerne",
                "overview": "An accomplished headhunter risks everything to obtain a valuable painting owned by a former mercenary.",
                "popularity": 3.3262,
                "poster_path": "/k5DQqsb9T8djkTAOdwNCBBBHrtK.jpg",
                "release_date": "2011-08-26",
                "title": "Headhunters",
                "video": false,
                "vote_average": 7.247,
                "vote_count": 1289,
                "character": "TV-vert",
                "credit_id": "52fe4808c3a368484e0e6301",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Nils Gunnar Lie er en norsk journalist og programaleder fra Øystese i Hordaland, og en av pionerene i TV 2.\n\nLie ble ansatt i NRK i 1976. Han startet i radioen der han var innom både Utenlandsprogrammet og Dagsnytt-redaksjonen. I 1980/1981 var Lie NRKs korrespondent i København. Fra 1983 gikk Lie over til fjernsynet. Han var reporter og programleder i Dagsrevyen og dessuten programleder for debattprogrammet Antenne 10. I 1989 var han programleder for NRKs Frokost-TV sammen med Hilde Hummelvoll. Lie gikk over til TV2 etter 16 år i NRK og ledet debattprogrammet Holmgang fra TV 2s oppstart i l992. I 1996 og 1997 ledet han i tillegg den norske utgaven av Jeopardy!. I 1998 gikk han over til TV 2 Nyhetene hvor han var nyhetsanker i 7 år. Fra 2005 til 2012 var han programleder for God morgen, Norge! sammen med Signe Tynning. Fra januar 2012 har Lie vært livereporter i Nyhetskanalen\n\n og våren 2012 var han også programleder for Artistgallaen på TV 2. Nils\n\n Gunnar Lie er utdannet lærer og har i tillegg statsvitenskap og engelsk\n\n gr. fag.\n\nHan ble i 1989 tildelt Kringkastingsprisen og ble kåret til Årets TV-navn samme år. Han fikk Alf Helleviks mediemålspris i 2001.",
        "birthday": "1950-11-23",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1093941,
        "imdb_id": "nm0509276",
        "known_for_department": "Acting",
        "name": "Nils Gunnar Lie",
        "place_of_birth": "Øystese, Kvam, Norway",
        "popularity": 0.0071,
        "profile_path": null
    }
}