{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sRXMmeNHTSWRYdDz3zaHNyyPJ0u.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749
                ],
                "id": 7326,
                "original_language": "en",
                "original_title": "Juno",
                "overview": "Faced with an unplanned pregnancy, sixteen year old high-schooler, Juno MacGuff, makes an unusual decision regarding her unborn child.",
                "popularity": 5.36,
                "poster_path": "/jNIn2tVhpvFD6P9IojldI3mNYcn.jpg",
                "release_date": "2007-12-05",
                "title": "Juno",
                "video": false,
                "vote_average": 7.052,
                "vote_count": 7374,
                "character": "Ultrasound Technician",
                "credit_id": "56ccd2e79251415cd7000109",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Born in the United Kingdom, Kaaren de Zilva grew up in Canada and describes her ancestry as an eclectic mix. Her parents were born in Sri Lanka and throughout the family tree the predominant ethnicities are Portuguese and Dutch. She began her pursuit of an acting career at a young age. She attended the Gastown Actors' Studio in Vancouver, British Columbia with Mel Tuck, as well as receiving tutelage from Ivanna Chubbick and Larry Moss.\n\nKaaren made her professional acting debut playing a young cheerleader in the Corey Haim coming-of-age flick titled \"Anything for Love.\" Since then she has worked steadily, appearing in numerous television and film roles. Her credits in episodic TV include \"Stephen King's Dead Zone,\" the highly acclaimed \"DaVinci's Inquest\" and recurring roles on \"DaVinci City Hall\" and \"The L Word.\" She also appeared in an installment of the horror series. \"Hellraiser VI: Hellseeker\". In 2007, Kaaren hit a career high point with a well-received turn in the Oscar-nominated movie, \"Juno,\" a commercially successful and critically acclaimed film about teen pregnancy. Cast as the ultrasound tech, Kaaren delivers a solid performance in emotionally charged scene with rising young star, Ellen Page (Juno MacGuff) and multiple Emmy Award-winner Allison Janney (Juno's stepmother Bren). The ultrasound tech has a strong influence on the pregnant teen that chooses life over abortion. In a busy 2007, Kaaren has also graced the lens in the thriller \"Post Mortem,\" aka \"I Know What I Saw\" in which she plays the psychic Nadira. She has also completed shooting on \"The Last Mimzy\", as well as. a television mini-series that examines the complexities and culture of the Asian crime triads, \"Dragon Boys.\"\n\nDespite her busy career, Kaaren manages to keep a strict regimen of cardio and weight training, and finds time to relax with her hobbies of shooting pool and playing Texas Hold 'em poker. She also likes to spend quality time with her Bernese Mountain Dog.\n\nHer goals are to continue to choose unique roles that examine the human spirit that both challenge and inspire her. Although her passion for acting is what drives her artistically, she also hopes to one day establish her own production company.",
        "birthday": "1979-05-16",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1093538,
        "imdb_id": "nm0212508",
        "known_for_department": "Acting",
        "name": "Kaaren de Zilva",
        "place_of_birth": " London, England",
        "popularity": 0.4396,
        "profile_path": "/ij8Adx5ODCIP8QExjNNg1qlBnQr.jpg"
    }
}