{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fYI8WX2DquAHMqwh5mOMxc6RU5j.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749
                ],
                "id": 416477,
                "original_language": "en",
                "original_title": "The Big Sick",
                "overview": "Pakistan-born comedian Kumail Nanjiani and grad student Emily Gardner fall in love but struggle as their cultures clash. When Emily contracts a mysterious illness, Kumail finds himself forced to face her feisty parents, his family's expectations, and his true feelings.",
                "popularity": 5.3065,
                "poster_path": "/9fJTT8pBxxQsFILJHTtHhdYFr77.jpg",
                "release_date": "2017-03-30",
                "title": "The Big Sick",
                "video": false,
                "vote_average": 7.331,
                "vote_count": 2519,
                "character": "Mary",
                "credit_id": "57ddbc4ec3a3681412002f6b",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Aidan Mackenzy Bryant"
        ],
        "biography": "Aidan Mackenzy Bryant (born May 7, 1987) is an American actress and comedian. Bryant is most notable for being a cast member on the NBC late-night sketch comedy series Saturday Night Live for ten seasons, joining the show for its 38th season in 2012, and leaving at the end of its 47th season in 2022. For her work on the series, she was nominated for three Primetime Emmy Awards, including two nominations for Outstanding Supporting Actress in a Comedy Series.\n\nHer other work includes a voice role in the animated series Danger & Eggs (2017) and the Netflix adult animated series Human Resources. She played a starring role in the sitcom Shrill (2019–2021); for the latter, she also served as writer and executive producer and was nominated for the Primetime Emmy Award for Outstanding Lead Actress in a Comedy Series.\n\nDescription above from the Wikipedia article Aidy Bryant, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1987-05-07",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1093920,
        "imdb_id": "nm5262775",
        "known_for_department": "Acting",
        "name": "Aidy Bryant",
        "place_of_birth": "Phoenix, Arizona, USA",
        "popularity": 0.3295,
        "profile_path": "/zXRwe1eNLwMYhQqdOkWpRy69Wi0.jpg"
    }
}