{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/exnFsbb9c3fDutTsgtJSWcDmZm0.jpg",
                "genre_ids": [
                    18,
                    10749,
                    80
                ],
                "id": 511809,
                "original_language": "en",
                "original_title": "West Side Story",
                "overview": "Two youngsters from rival New York City gangs fall in love, but tensions between their respective friends build toward tragedy.",
                "popularity": 6.1223,
                "poster_path": "/yfz3IUoYYSY32tkb97HlUBGFsnh.jpg",
                "release_date": "2021-12-08",
                "title": "West Side Story",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 1662,
                "character": "Diesel",
                "credit_id": "6229155d871b340047b93cd7",
                "order": 30
            },
            {
                "adult": false,
                "backdrop_path": "/e47cvCgbZogOyKXSenT9aqCDhe8.jpg",
                "genre_ids": [
                    18,
                    53
                ],
                "id": 127517,
                "original_language": "en",
                "original_title": "Disconnect",
                "overview": "A hard-working lawyer, attached to his cell phone, can't find the time to communicate with his family. An estranged couple uses the internet as a means to escape from their lifeless marriage. A widowed ex-cop struggles to raise a mischievous son who cyber-bullies a classmate. An ambitious journalist sees a career-making story in a teen that performs on an adult-only site. They are strangers, neighbors and colleagues and their stories collide as ordinary people struggling to connect in today's wired world.",
                "popularity": 1.998,
                "poster_path": "/mAStXq4ncbLBnujd3LG4KDd7Z3a.jpg",
                "release_date": "2013-04-12",
                "title": "Disconnect",
                "video": false,
                "vote_average": 7.059,
                "vote_count": 1161,
                "character": "Shane",
                "credit_id": "52fe4afcc3a368484e17163b",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Kevin Csolak is a professional actor, dancer, and singer. Born in Flemington, New Jersey, Kevin spent his youth at his mother's performing arts school. He was signed at age ten with Shirley Grant Management. He recurred as Daniel Hughes on As The World Turns for CBS and performed at the Hilton Theatre on Broadway (presently The Lyric Theatre) in the original cast of How the Grinch Stole Christmas. The following year, Kevin performed in the world premiere cast of Cirque du Soleil's Wintuk as Jamie at the Wamu Theatre at Madison Square Garden.\n\nKevin attended Frances A. Demares Elementary School, Reading-Fleming Intermediate School, JP Case Middle School and graduated from Hunterdon Central Regional High School in Flemington, NJ. He was very active in Student Government and from 7th through 12th grade was class president.\n\nKevin was accepted to New York City's PACE University's prestigious Musical Theatre Class of 2018. After a year with the program, he moved to Los Angeles, California to focus on his film and TV career. While in LA Kevin worked closely with top LA dance icons and mentors including Marty Kudelka, Ivan Koumaev, Misha Gabriel, Anze Skrube, and others. Repped by Clear Talent Group for dance, Kevin continues to work in the commercial dance industry. Kevin danced for Hayley Kiyoko in the 2018 VMA's and for Justin Timberlake in the 2018 Super Bowl 52 Halftime Show.\n\nKevin was honored to work with Casey Nicholaw in the world premiere of The Prom musical at the alliance in Atlanta. He was back on Broadway in the original cast of Tina Fey's Mean Girls at the August Wilson Theatre. He went on to play the principle role of A-Rab in Ivo Van Hove's West Side Story at The Broadway Theatre in NYC.\n\nA career highlight has been playing Diesel in Steven Spielberg's Oscar Nominated West Side Story movie. He was one of five actors who were featured in both the movie and the Broadway revival. During the Spring and Summer of 2021, Kevin found himself back on the west coast shooting Season 6 of Warner Bros. and TNT's Animal Kingdom in the role of Andrew to be released in 2022.\n\nKevin was named to The Ensemblist's Inaugural 2018 list of 'Ones to Watch' in 2019 as one of the 'exciting new talent hitting Broadway Stages this year.' He was also featured in Pop Culturalist, Nyota Magazine, and in Time Out NY's Top Ten Hot Boys on Broadway.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.kevincsolak.com",
        "id": 1094567,
        "imdb_id": "nm2334991",
        "known_for_department": "Acting",
        "name": "Kevin Csolak",
        "place_of_birth": "Flemington, New Jersey, USA",
        "popularity": 0.2035,
        "profile_path": "/qw1ZHpLfDV5DcLt2w0Uba3eUzVo.jpg"
    }
}