{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wNAhuOZ3Zf84jCIlrcI6JhgmY5q.jpg",
                "genre_ids": [
                    28,
                    878,
                    12
                ],
                "id": 786892,
                "original_language": "en",
                "original_title": "Furiosa: A Mad Max Saga",
                "overview": "As the world falls, young Furiosa is snatched from the Green Place of Many Mothers into the hands of a great biker horde led by the warlord Dementus. Sweeping through the wasteland, they encounter the citadel presided over by Immortan Joe. The two tyrants wage war for dominance, and Furiosa must survive many trials as she puts together the means to find her way home.",
                "popularity": 14.2793,
                "poster_path": "/iADOJ8Zymht2JPMoy3R7xceZprc.jpg",
                "release_date": "2024-05-22",
                "title": "Furiosa: A Mad Max Saga",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 4383,
                "character": "Black Thumb",
                "credit_id": "664d2d68bf76ddfdbccdd64b",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Clarence Ryan",
            "Κλάρενς Ράιαν"
        ],
        "biography": "Clarence Ryan is an Australian actor. Clarence Ryan is the nephew of Trevor Jamieson, which they discovered while filming Lockie Leonard in 2007. He has been acting since he was 14.\n\nRyan played the lead role in Wrong Kind of Black, was a co-lead in September and featured in a segment of We Are Still Here.\n\nHe played a lead in Lockie Leonard, as well as in KGB, an Australian comedy series following two rookie detectives through Perth, appeared in the second season of Cleverman and in the third series of Mystery Road.\n\nOther featured roles include the film Blueback (film); the historical documentary Yagan, about the Noongar warrior Yagan; and the 2014 stage production of King Hit, which follows the life of Geoffrey Narkle, an Aboriginal man and a member of the Stolen Generations, and his boxing career during reflecting on culture, identity, and finding strength.\n\nFor his performance in September he was nominated for 2008 AFI Award for Best Young Actor and for his performance in Mystery Road: Origin he was nominated for the 2023 Logie Award Most Outstanding Supporting Actor.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 109437,
        "imdb_id": "nm2164330",
        "known_for_department": "Acting",
        "name": "Clarence John Ryan",
        "place_of_birth": null,
        "popularity": 0.7665,
        "profile_path": "/gcQZkN1c0OEF670GucAZmuB57Zt.jpg"
    }
}