{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mhpDSuNyHPMsccI7zISEaskTgOQ.jpg",
                "genre_ids": [
                    28,
                    36,
                    10749,
                    10752
                ],
                "id": 9361,
                "original_language": "en",
                "original_title": "The Last of the Mohicans",
                "overview": "In war-torn colonial America, in the midst of a bloody battle between British, the French and Native American allies, the aristocratic daughter of a British Colonel and her party are captured by a group of Huron warriors. Fortunately, a group of three Mohican trappers comes to their rescue.",
                "popularity": 6.1306,
                "poster_path": "/qzJMPWRtZveBkxXOv3ucWhoJuyj.jpg",
                "release_date": "1992-08-26",
                "title": "The Last of the Mohicans",
                "video": false,
                "vote_average": 7.384,
                "vote_count": 3242,
                "character": "Scottish Officer (uncredited)",
                "credit_id": "5ee794abafa1b00023c17d19",
                "order": 48
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Began acting at age seven, portraying his boyhood hero \"Robin Hood\" in a school play. Thirty years later, he got to reprise the character in a professional theatrical production, plus choreographing the fight sequences.  A third generation Texan, he fulfilled another boyhood dream -- that of performing in an Alamo movie...and not just one, but two Alamo movies.  He earned a BFA in theatre arts from TCU (Texas Christian University) with additional studies in cinematography. Studies also include London Academy of Music and Dramatic Art, The Film Actors Lab in Dallas, \n\nDeVera Marcus' Improv Class in L.A., &amp; numerous L.A. voice-over coaches.  Benton has performed in over 100 stage productions and national tours including 25 years with 2 partners in an award winning sketch comedy act -- \"The Gunfighters\" -- with over 6000 performances nationally, quite literally everywhere from being introduced onstage by \n\nTony Randall at Madison Square Garden to performing alongsideClayton Moore of The Lone Ranger (1949) fame at a festival in Texas.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.bentonjennings.com/",
        "id": 109451,
        "imdb_id": "nm0421110",
        "known_for_department": "Acting",
        "name": "Benton Jennings",
        "place_of_birth": "El Paso - Texas - USA",
        "popularity": 0.1287,
        "profile_path": "/nWoSDRjewvXz6bWNn1aTRVbTgfD.jpg"
    }
}