{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zAL3LOswagN9onjN8DPcNFTqKuD.jpg",
                "genre_ids": [
                    18
                ],
                "id": 705,
                "original_language": "en",
                "original_title": "All About Eve",
                "overview": "From the moment she glimpses her idol at the stage door, Eve Harrington is determined to take the reins of power away from the great actress Margo Channing. Eve maneuvers her way into Margo's Broadway role, becomes a sensation and even causes turmoil in the lives of Margo's director boyfriend, her playwright and his wife. Only the cynical drama critic sees through Eve, admiring her audacity and perfect pattern of deceit.",
                "popularity": 2.0482,
                "poster_path": "/blBzZaatPWVuWpXEnPscMA4Xp6m.jpg",
                "release_date": "1950-11-09",
                "title": "All About Eve",
                "video": false,
                "vote_average": 8.076,
                "vote_count": 1604,
                "character": "Girl",
                "credit_id": "52fe426dc3a36847f801dd6b",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/bd9lxQ4SgnNb6NPIph4pz5HGLpY.jpg",
                "genre_ids": [
                    878,
                    27
                ],
                "id": 31682,
                "original_language": "en",
                "original_title": "The Incredible Shrinking Man",
                "overview": "A dangerous combination of radiation and insecticide causes the unfortunate Scott Carey to shrink, slowly but surely, until he is only a few inches tall. His home becomes a wilderness where he must survive everything from spiders living in the cellar to his beloved cat.",
                "popularity": 3.6648,
                "poster_path": "/vI7IdqfvsyoQAjAzRWS2fYvUoOu.jpg",
                "release_date": "1957-02-22",
                "title": "The Incredible Shrinking Man",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 525,
                "character": "Louise Carey",
                "credit_id": "52fe44979251416c9101622b",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Elizabeth Shaubell"
        ],
        "biography": "Randy Stuart, born as Elizabeth Shaubell (October 24, 1924 – July 20, 1996), was an American actress in film and television. A familiar face in several popular films of the 1940s and 1950s, and later in Western-themed television series, she is perhaps best remembered as Louise Carey, the wife of Scott Carey, played by Grant Williams, in The Incredible Shrinking Man (1957), a science-fiction classic named in 2009 as “culturally, historically or aesthetically” significant to be preserved for all time in the Library of Congress's National Film Registry.\n\nA screen test in the play The Women led to Stuart being placed under contract at 20th Century Fox. Her film debut was uncredited in the 1947 picture, The Foxes of Harrow. Stuart plays the birth mother of main character Stephen Fox, in the film's initial scene.\n\nIn 1948, she played Peggy, a knowing secretary (and collaborator with star Clifton Webb) in the comedy Sitting Pretty. She also appeared that year (sixth-billed) as the wife of a returning veteran in Apartment for Peggy with William Holden and Jeanne Crain.\n\nIn 1949, she portrayed Lieutenant Eloise Billings, an object of desire for Cary Grant, in the Howard Hawks film I Was a Male War Bride, also starring Ann Sheridan. That same year, she appeared opposite Jose Ferrer in Otto Preminger's psychological noir, Whirlpool. Stuart was billed on posters as a supporting player in the comedy / musical Dancing in the Dark, starring William Powell and Betsy Drake.\n\nIn 1950, Stuart was briefly in that year's Best Picture, All About Eve, as a telephone friend of Anne Baxter. She had fourth billing in the noir comedy Stella, with Ann Sheridan and Victor Mature.\n\nIn 1951, she appeared as Marge Boyd in I Can Get It For You Wholesale, in what might have been her breakout role. In 1952, Stuart teamed again with Grant and Drake in the comedy Room for One More for Warner Bros.\n\nAfter 1957's Incredible Shrinking Man, she was cast as Nancy Dawson in the 1958 western film, Man from God's Country, starring George Montgomery. She also guest-starred about that time in Montgomery's short-lived television western television series, Cimarron City.\n\nn the late 1970s and early 1980s, Stuart (known by her married name, Betty Wallis) was instrumental in developing the alumni program at Chaminade College Preparatory School in West Hills, California, from which her two youngest children had graduated. She was listed as a resource for information for the school. She later was director of alumni affairs at Cal State Northridge.\n\nStuart was married to Kenneth Wayne Smith (1943-1945), Edward Charles George (1947-1954; one child), Lane Allan (aka Albert Wootten, 1954-1968; three children), and Ernest Dineen Wallis (1971-1982). The first three marriages ended in divorce, and the last ended with Wallis's death.\n\nStuart died of lung cancer on July 20, 1996, at the age of 71 in Bakersfield, California.",
        "birthday": "1924-10-12",
        "deathday": "1996-07-20",
        "gender": 1,
        "homepage": null,
        "id": 109407,
        "imdb_id": "nm0835836",
        "known_for_department": "Acting",
        "name": "Randy Stuart",
        "place_of_birth": "Iola, Kansas, USA",
        "popularity": 0.1442,
        "profile_path": "/7hzDV4VwBYJZ4D1L6crc2kLcspc.jpg"
    }
}