{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ctzKCslTsMRsOJNvAm1Mw8ytiHY.jpg",
                "genre_ids": [
                    28,
                    12,
                    35,
                    18,
                    37
                ],
                "id": 9359,
                "original_language": "en",
                "original_title": "Maverick",
                "overview": "Bret Maverick is a gambler who would rather con someone than fight them, and needs an additional $3k in order to enter a winner-takes-all poker game beginning in a few days. He joins forces with a woman with a marvelous Southern accent, and the two try and enter the game.",
                "popularity": 4.7713,
                "poster_path": "/mTVbGGi5PIexmxVzeyFd2RYKwfM.jpg",
                "release_date": "1994-05-20",
                "title": "Maverick",
                "video": false,
                "vote_average": 6.889,
                "vote_count": 1662,
                "character": "Sweet-Faced Gambler",
                "credit_id": "52fe44edc3a36847f80b243f",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Clint Patrick Black"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nClint Patrick Black (born February 4, 1962) is an American country music singer, songwriter, musician, multi-instrumentalist, record producer and actor. Signed to RCA Nashville in 1989, Black's debut album Killin' Time produced four straight number one singles on the US Billboard Hot Country Singles & Tracks charts. Although his momentum gradually slowed throughout the 1990s, Black consistently charted hit songs into the 2000s. He has had more than 30 singles on the US Billboard country charts, twenty-two of which have reached number one, in addition to having released twelve studio albums and several compilation albums. In 2003, Black founded his own record label, Equity Music Group. Black has also ventured into acting, having made appearances in a 1993 episode of the TV series Wings and in the 1994 film Maverick, as well as a starring role in 1998's Still Holding On: The Legend of Cadillac Jack.",
        "birthday": "1962-02-04",
        "deathday": null,
        "gender": 2,
        "homepage": "http://clintblack.com/",
        "id": 109577,
        "imdb_id": "nm0004756",
        "known_for_department": "Acting",
        "name": "Clint Black",
        "place_of_birth": "Long Branch, New Jersey, USA",
        "popularity": 0.1332,
        "profile_path": "/brnmahG6dW9ynPB8D4YSSnWO1Wm.jpg"
    }
}