{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/81ME78JndOYu7IluTi1rxh0cLY2.jpg",
                "genre_ids": [
                    18
                ],
                "id": 25793,
                "original_language": "en",
                "original_title": "Precious",
                "overview": "Set in Harlem in 1987, Claireece \"Precious\" Jones is a 16-year-old African American girl born into a life no one would want. She's pregnant for the second time by her absent father; at home, she must wait hand and foot on her mother, an angry woman who abuses her emotionally and physically. School is chaotic and Precious has reached the ninth grade with good marks and a secret; She can't read.",
                "popularity": 4.0416,
                "poster_path": "/d4ltLIDbvZskSwbzXqi0Hfv5ma4.jpg",
                "release_date": "2009-11-06",
                "title": "Precious",
                "video": false,
                "vote_average": 7.322,
                "vote_count": 1691,
                "character": "Rita Romero",
                "credit_id": "52fe44dec3a368484e03b7d3",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Stephanie Lee Andujar"
        ],
        "biography": "Stephanie Lee Andujar is an American actress, Born and raised in Manhattan, New York, USA on July 15, 1986.  Stephanie Andujar began performing at the age of 12. While growing up in the Chelsea Housing Projects, Stephanie's parents put her into an after school program that would change the course of her life. Starring in theater performances from \"The Wiz\", \"The Crucible\", \"The Good Woman of Setzuan\", to television and film including: Blue Bloods (2010), Law & Order: Special Victims Unit (1999), the Academy Award winning film Precious (2009), and Marjorie Prime (2017). While embarking on her acting career, Stephanie also obtained her Business Degree at Pace University in New York City. Stephanie's standout performance can be seen in Netflix's Orange Is the New Black (2013), as the Young Miss Rosa. \"Stephanie Andujar, who plays Young Rosa, is mesmerizing, and I want her to star in a prequel spin-off called Portrait of the Prisoner as a Young Bank Robber\" -Entertainment Weekly, Hillary Busis. In 2016, Stephanie formed Andujar Productions with her family and has since produced and starred in a comedy series StephA: One Woman Show (2016), along with Musical Performances with songs \"Baila Conmigo\" and \"Me Encanta\". Stephanie's authenticity shines with each performance given.",
        "birthday": "1986-07-15",
        "deathday": null,
        "gender": 1,
        "homepage": "http://stephanieandujar.com/",
        "id": 109562,
        "imdb_id": "nm2837910",
        "known_for_department": "Acting",
        "name": "Stephanie Andujar",
        "place_of_birth": "Manhattan, New York, USA",
        "popularity": 0.0576,
        "profile_path": "/dNmZm9arYHJdiTbFsL6O6Rx7xHT.jpg"
    }
}