{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/vHwrJiFc74Lb8D0Trvdc0v04gRK.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 22954,
                "original_language": "en",
                "original_title": "Invictus",
                "overview": "Newly elected President Nelson Mandela knows his nation remains racially and economically divided in the wake of apartheid. Believing he can bring his people together through the universal language of sport, Mandela rallies South Africa's rugby union team as they make their historic run to the 1995 Rugby World Cup Championship match.",
                "popularity": 4.3605,
                "poster_path": "/runuhBAAX7PmdjGhqRKCyl4bh7z.jpg",
                "release_date": "2009-12-11",
                "title": "Invictus",
                "video": false,
                "vote_average": 7.181,
                "vote_count": 4219,
                "character": "Etienne Feyder",
                "credit_id": "52fe4457c3a368484e01d941",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/13Nz8EchKRdCgJcKdEoJAnpiVn2.jpg",
                "genre_ids": [
                    28,
                    12,
                    14
                ],
                "id": 791373,
                "original_language": "en",
                "original_title": "Zack Snyder's Justice League",
                "overview": "Determined to ensure Superman's ultimate sacrifice was not in vain, Bruce Wayne aligns forces with Diana Prince with plans to recruit a team of metahumans to protect the world from an approaching threat of catastrophic proportions.",
                "popularity": 13.7837,
                "poster_path": "/tnAuB8q5vv7Ax9UAEje5Xi4BXik.jpg",
                "release_date": "2021-03-18",
                "title": "Zack Snyder's Justice League",
                "video": false,
                "vote_average": 8.11,
                "vote_count": 10399,
                "character": "Ancient Atlantean King",
                "credit_id": "601b56fe470ead003e74d415",
                "order": 61
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Julian Lewis Jones is a Welsh actor. He has appeared largely in British television in shows such as \"Where the Heart Is\" and the Welsh-language drama series \"Caerdydd\".  In 2009, he starred in Clint Eastwood's drama film \"Invictus\", as the head of Nelson Mandela's bodyguard team.\n\nOriginally from Anglesey, Julian Lewis Jones currently lives in Nantgaredig, Carmarthenshire.\n\nHe has appeared on various productions on the Welsh-language channel S4C, including as a presenter of a popular fishing programme \"Sgota\".\n\nIn 2010 he appeared in the TV series \"The Tudors\" as Mr. Roper (the park keeper) in Season 4, Episode 1. Also in 2010 he appeared on British TV series \"Spooks\" (US title MI-5) as Russian spy Viktor Barenshik in Season 9, Episode 3. In 2012 and 2013, he appeared in the Sky1 drama-comedy series \"Stella\" as Karl Morris and in an episode of the BBC Two drama-comedy series \"Ambassadors\".\n\nJones has been cast in an undisclosed role in, Justice League (2017); a film based on the DC Comics superhero team of the same name.",
        "birthday": "1968-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": "https://jag-london.com/clients/item/julian-lewis-jones.html",
        "id": 109650,
        "imdb_id": "nm0428484",
        "known_for_department": "Acting",
        "name": "Julian Lewis Jones",
        "place_of_birth": "Bangor, Caernarfonshire, Wales",
        "popularity": 0.309,
        "profile_path": "/s6bfs9wbqB3gRhgNH8FmEq39qyZ.jpg"
    }
}