{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/w7Z4BVMin49voNN61IUWyN9DopV.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 86837,
                "original_language": "fr",
                "original_title": "Amour",
                "overview": "Georges and Anne are in their eighties. They are cultivated, retired music teachers. Their daughter, who is also a musician, lives abroad with her family. One day, Anne has a stroke, and the couple's bond of love is severely tested.",
                "popularity": 3.2873,
                "poster_path": "/19hyCudualHxCD0GrEngqsi0wBF.jpg",
                "release_date": "2012-09-20",
                "title": "Amour",
                "video": false,
                "vote_average": 7.756,
                "vote_count": 1690,
                "character": "Concierge",
                "credit_id": "52fe49a49251416c910b3d85",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Estreia-se como actriz na peça Mariana Espera Casamento, de Jean-Paul Wenzel, sob a direcção de Luís Miguel Cintra, em 1983. Conclui o Curso de Formação de Actores do Conservatório Nacional, em 1985. Ainda no Teatro da Cornucópia representou Perversões de David Mamet, dirigida por Miguel Guilherme e José Pedro Gomes; Antes que a Noite Venha de Eduarda Dionísio, com Adriano Luz; Sangue no Pescoço do Gato de Fassbinder, com Luís Miguel Cintra. Em 1989 participou em Como é Diferente o Amor em Portugal, adaptação da obra de Júlio Dantas, dirigida por Fernando Gomes. Nunca Nada de Ninguém de Luísa Costa Gomes, encenado por Ana Tamen valeu-lhe a nomeação para o Prémio Garrett para a Melhor Interpretação Feminina (1991). Em 1997 participou em Peter Pan de James Barrie, encenado por António Pires no São Luiz.\n\nNo cinema foi dirigida por João Botelho (1994 - Três Palmeiras; 1999 Tráfico; 2003 - A Mulher Que Acreditava Ser a Presidente dos EUA; 2005 - O Fatalista), João Mário Grilo (1998 - Longe da Vista; 2002 - A Falha; 2000 - 451 Forte), José Nascimento (2000 - Tarde Demais), Teresa Villaverde (1998 - Os Mutantes), Manoel de Oliveira (1998 - Inquietude), João César Monteiro (1992 - O Último Mergulho) ou Jorge Silva Melo (1987 - Agosto; 1985 - Ninguém duas Vezes).\n\nNa televisão, apareceu em A Mala de Cartão (1988) série que contava com a participação de Irene Papas. Trabalhou junto do humorista Herman José, em Casino Royal (1989), Crime na Pensão Estrelinha (1990) e Serafim Saudade - o regresso do Herói (2001). Participou ainda em Sai da Minha1996, Médico de Família (1998/2000), A Minha Sogra é uma Bruxa (2003), na telenovela Tempo de Viver (2006) de Rui Vilhena (a sua estreia na TVI e em telenovelas) Conta-me como Foi (2007-2009). Apresentou com Henrique Mendes o concurso Caça ao Tesouro (1994). Em 2011 após 2 anos de ausência, regressa à televisão em grande dose trabalhando nos 3 canais Portugueses generalistas: primeiro na sitcom da SIC A Família Mata, depois no telefilme da TVI O Profeta e por fim na 2ª temporada da Série da RTP Maternidades. Salienta a sua colaboração com o encenador e cineasta João Canijo. Com ele trabalhou no teatro (1988 - Crimes do Coração de Beth Henley; 1987 - Jogos de Praia de Whitehead; 1994 - Confissões ao Luar de Eugene O'Neill; 2002 - Sete Vidas de Rosa Lobato de Faria), no cinema (1988 - Três Menos Eu (Festival Les Stars De Demain); 1990 - Filha da Mãe; 2001 - Ganhar a Vida; 2004 - Noite Escura) e na televisão (1990 - Alentejo sem Lei; 1996 - Sai da Minha Vida).\n\nPremiada em 2002 e 2012 com o Globo de Ouro na categoria de Melhor Actriz de Cinema, com Ganhar a Vida e Sangue do meu Sangue de João Canijo. Foi homenageada no Festival de Santa Maria da Feira em 2004. Em 2012, foi considerada na Gala SPAUTORES, a melhor actriz de cinema, devido à sua interpretação no filme Sangue do meu Sangue",
        "birthday": "1963-01-11",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 109713,
        "imdb_id": "nm0087324",
        "known_for_department": "Acting",
        "name": "Rita Blanco",
        "place_of_birth": "Algés, Oeiras, Portugal",
        "popularity": 0.0968,
        "profile_path": "/37uYod765Xi2hV5WPuGkzeWy3E5.jpg"
    }
}