{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/h1vBJ0uN4QCbBb5WVKxmtfTrHoY.jpg",
                "genre_ids": [
                    37
                ],
                "id": 11697,
                "original_language": "en",
                "original_title": "The Man Who Shot Liberty Valance",
                "overview": "Questions arise when Senator Stoddard attends the funeral of a local man named Tom Doniphon in a small Western town. Flashing back, we learn Doniphon saved Stoddard, then a lawyer, when he was roughed up by a crew of outlaws terrorizing the town, led by Liberty Valance. As the territory's safety hung in the balance, Doniphon and Stoddard, two of the only people standing up to him, proved to be very important, but different, foes to Valance.",
                "popularity": 2.5409,
                "poster_path": "/4C1R0LEivLjbv3swAzJfzh0tzXl.jpg",
                "release_date": "1962-04-13",
                "title": "The Man Who Shot Liberty Valance",
                "video": false,
                "vote_average": 7.808,
                "vote_count": 1216,
                "character": "Townswoman (uncredited)",
                "credit_id": "570013899251417647000932",
                "order": 42
            },
            {
                "adult": false,
                "backdrop_path": "/p47ihFj4A7EpBjmPHdTj4ipyq1S.jpg",
                "genre_ids": [
                    18
                ],
                "id": 599,
                "original_language": "en",
                "original_title": "Sunset Boulevard",
                "overview": "A hack screenwriter writes a screenplay for a former silent film star who has faded into Hollywood obscurity.",
                "popularity": 5.7842,
                "poster_path": "/sC4Dpmn87oz9AuxZ15Lmip0Ftgr.jpg",
                "release_date": "1950-08-10",
                "title": "Sunset Boulevard",
                "video": false,
                "vote_average": 8.293,
                "vote_count": 2743,
                "character": "Courtier (uncredited)",
                "credit_id": "57b5ee5592514119a1002d08",
                "order": 51
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Eva Barbara Novak"
        ],
        "biography": "Eva Barbara Novak (February 14, 1898 – April 17, 1988) was an American film actress, who was quite popular during the silent film era.\n\nOn February 14, 1898, Eva Barbara Novak was born in St. Louis, Missouri, to Joseph Jerome Novak, an immigrant from Bohemia, and Barbara Medek. Her older sister, Johana, also became an actress. Joseph Novak died when Eva was still a child and Barbara was left to raise five children.\n\nNovak began her acting career in 1917 in L-KO's Roped into Scandal, followed by another seven films that same year. She appeared in 17 films in 1918, and another eight in 1919. In 1920, she starred opposite Tom Mix in The Daredevil, one of six film roles she would have that year, and one of ten films in which she starred opposite Mix.\n\nIn 1921, she married stuntman William Reed, whom she met while on location for a film. They had two daughters Vivian Barbara and Pamela Eve.\n\nNovak was interested in stunt performing herself, having been taught by Mix to perform many of her own stunts. From 1921 to 1928, she appeared in and starred in 48 films, including an early version of Boston Blackie. She also co-starred with Betty Bronson and Jack Benny in The Medicine Man (1930) and appeared in the 1922 film Chasing the Moon, which was an early forerunner of the 1950s film D.O.A. In the late 1920s, she and her husband moved to Australia, where she made numerous films, including The Romance of Runnibede. However, with the advent of \"talking films\", her popularity faded. She would continue to act, but mostly in obscure roles.\n\nShe appeared in 123 films between 1917 and 1965, when she retired. She was residing in Woodland Hills, Los Angeles at the time of her death from pneumonia at the age of 90, on April 17, 1988.\n\nIn May 1923, the Altoona Tribune held a contest to find the girl who most closely resembled Novak. An announcement in the newspaper said that the winner would receive $250 worth of clothes from a store.",
        "birthday": "1898-02-14",
        "deathday": "1988-04-17",
        "gender": 1,
        "homepage": null,
        "id": 109777,
        "imdb_id": "nm0636834",
        "known_for_department": "Acting",
        "name": "Eva Novak",
        "place_of_birth": "Saint Louis, Missouri, USA",
        "popularity": 0.1571,
        "profile_path": "/dvg9DEBHyXLixbwsaZlQi6IUsXN.jpg"
    }
}