{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yPXW7E4Tu1Eltb5lxQSwHNLEzlx.jpg",
                "genre_ids": [
                    28,
                    35,
                    80,
                    18
                ],
                "id": 337170,
                "original_language": "en",
                "original_title": "American Made",
                "overview": "The true story of pilot Barry Seal, who transported contraband for the CIA and the Medellin cartel in the 1980s.",
                "popularity": 8.2425,
                "poster_path": "/23ILgoPSO5ShKcTZOuiTVfqFAUB.jpg",
                "release_date": "2017-08-18",
                "title": "American Made",
                "video": false,
                "vote_average": 6.896,
                "vote_count": 4741,
                "character": "Agent Horace Wainwright",
                "credit_id": "5a4dae82c3a3683b760040f8",
                "order": 30
            },
            {
                "adult": false,
                "backdrop_path": "/cSJMk9Jar8SibFXL8JAF9p2fhKu.jpg",
                "genre_ids": [
                    18,
                    36,
                    10751
                ],
                "id": 501907,
                "original_language": "en",
                "original_title": "A Beautiful Day in the Neighborhood",
                "overview": "An award-winning cynical journalist, Lloyd Vogel, begrudgingly accepts an assignment to write an Esquire profile piece on the beloved television icon Fred Rogers. After his encounter with Rogers, Vogel's perspective on life is transformed.",
                "popularity": 2.5163,
                "poster_path": "/p9vCAVhDK375XyobVcKqzqzsUHE.jpg",
                "release_date": "2019-09-07",
                "title": "A Beautiful Day in the Neighborhood",
                "video": false,
                "vote_average": 6.949,
                "vote_count": 1677,
                "character": "Darin Scharf (uncredited)",
                "credit_id": "5f13322265c26c0037bab15e",
                "order": 50
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Kevin Johnson"
        ],
        "biography": "Veteran actor Kevin L. Johnson can be seen across both television and film, but he is best known for his role as 'Sam Dermody' in Netflix's hit series \"Ozark\" starring Jason Bateman and Laura Linney. What originally started as a two-episode role in season one, led instead to Johnson portraying 'Sam' each additional season, including the fourth and final. Johnson will soon be seen as 'Eric' in Netlflix's \"Florida Man,\" executive produced by Bateman and will guest star in the hit cult show \"Stranger Things.\"\n\nJohnson fell in love with acting while attending Clemson University. As an assignment for his newly declared English major, Kevin was required to see \"A Funny Thing Happened on the Way to the Forum.\" The grand production impacted him so greatly that he registered for acting classes the next day for the following semester. After he had a bit of formal acting training that helped the self-proclaimed introvert break out of his shell, Johnson had the confidence to audition for his first role at Clemson. While the audition didn't result in a part, Kevin became a part of the tech crew, furthering his knowledge of production.\n\nBefore long Johnson won the lead role as 'Sam,' the pickle maker seeking a love match in \"Crossing Delancey\" at Clemson Little Theatre, before starring as 'Oswald' in a Shakespeare in the Park production of \"King Lear.\" Additional theatre credits include the lead role of 'Willy Wonka' in \"Charlie and the Chocolate Factory\" at Easley Foothills Playhouse, 'Bardolph' in \"Henry V\" at Brooks Theater at Clemson University and 'Wally' in \"1940's Radio Hour\" at Clemson Little Theatre. Kevin also discovered that he could sing while attending auditions during college. Although his mother had been a country singer, Johnson hadn't tested his own voice until he checked out a cast recording of \"Urinetown\" from the library to prepare for an audition.\n\nKevin graduated from Clemson University with a degree in English and a minor in advertising before landing an agent. He then began booking roles in commercials, including the North Carolina State Lottery and Burger King, and numerous short films. Johnson landed his first television role on the hit series \"One Tree Hill,\" an audition he almost didn't attend. He then went on to book his first film role in \"My Redneck Roots\" and his first lead role in the film \"Destiny Road.\"\n\nJohnson's expansive resume includes roles in numerous television series and films. His television credits include Cinemax's \"Banshee,\" CBS' \"Reckless,\" MTV's \"Finding Carter,\" FOX's \"The Resident,\" OWN's \"Greenleaf\" and OWN's \"If Loving You Is Wrong.\" His additional film credits include \"Prisoners\" opposite Jake Gyllenhaal, \"Careful What You Wish For\" opposite Nick Jonas, \"American Animals\" opposite Evan Peters and \"Blue Ridge\" opposite Johnathon Schaech",
        "birthday": "1982-06-25",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.kevinljohnson.com",
        "id": 1098577,
        "imdb_id": "nm4114414",
        "known_for_department": "Acting",
        "name": "Kevin L. Johnson",
        "place_of_birth": "Clemson, South Carolina, USA",
        "popularity": 0.1034,
        "profile_path": "/8YnbMp7uvZipkTIhVypp6RPj5Rn.jpg"
    }
}