{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fEaZwgkX2k91LJZ5APkaK0aDwg1.jpg",
                "genre_ids": [
                    18
                ],
                "id": 321741,
                "original_language": "en",
                "original_title": "Concussion",
                "overview": "A dramatic thriller based on the incredible true David vs. Goliath story of American immigrant Dr. Bennet Omalu, the brilliant forensic neuropathologist who made the first discovery of CTE, a football-related brain trauma, in a pro player and fought for the truth to be known. Omalu's emotional quest puts him at dangerous odds with one of the most powerful institutions in the world.",
                "popularity": 2.0031,
                "poster_path": "/uuRFr7Jhsq7bITDyyvxZrQMAr9e.jpg",
                "release_date": "2015-11-12",
                "title": "Concussion",
                "video": false,
                "vote_average": 7.082,
                "vote_count": 2627,
                "character": "Gracie",
                "credit_id": "58b473fdc3a368527d0184a7",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Sara Lindsey was born in Washington, D.C. and raised in Ellicott City, Maryland. She is the youngest of four children and only daughter of two physicians. She showed an interest in the performing arts at an early age; her first play was an adaptation of Shel Silverstein's A Light in the Attic with her first grade class. She continued acting through elementary and middle school, and started performing in shows at professional theaters in the area. In addition to acting, Sara was a very musical child and started playing instruments and singing at school and in choirs. She became an accomplished oboe player, performing for several years as principal oboist in the Peabody Preparatory Sinfonietta in Baltimore, Maryland. She was also a member of Maryland All State Choir for six consecutive years. Throughout high school, she continued to act in plays and musicals, and went on to study drama at Carnegie Mellon University where she graduated with a BFA in 2011. She booked her first film role while still in college in the J.J. Abrams thriller Super 8, and quickly moved to Los Angeles to pursue more film and television. Within one year of graduating, Sara landed roles in four other feature films: Won't Back Down, Fun Size, Jack Reacher, and most notably Promised Land with Matt Damon and Frances McDormand. She currently lives in Los Angeles with her dog, Max.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1098033,
        "imdb_id": "nm3935293",
        "known_for_department": "Acting",
        "name": "Sara Lindsey",
        "place_of_birth": "Washington, District of Columbia, USA",
        "popularity": 0.4946,
        "profile_path": "/zV4S97xR3PTTPvcTufMmc4vYDBW.jpg"
    }
}