{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7FregPTA0h0ROUvHvq62TBAzmSV.jpg",
                "genre_ids": [
                    18
                ],
                "id": 209276,
                "original_language": "en",
                "original_title": "Starred Up",
                "overview": "19-year-old Eric, arrogant and ultra-violent, is prematurely transferred to the same adult prison facility as his estranged father. As his explosive temper quickly finds him enemies in both prison authorities and fellow inmates — and his already volatile relationship with his father is pushed past breaking point — Eric is approached by a volunteer psychotherapist, who runs an anger management group for prisoners. Torn between gang politics, prison corruption, and a glimmer of something better, Eric finds himself in a fight for his own life, unsure if his own father is there to protect him or join in punishing him.",
                "popularity": 2.044,
                "poster_path": "/e1DRGfyRxYQclvJOJiXwAw5gDg2.jpg",
                "release_date": "2014-03-21",
                "title": "Starred Up",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 972,
                "character": "Spencer",
                "credit_id": "52fe4d60c3a368484e1e5dcd",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "피터 페딘난도"
        ],
        "biography": "Peter Ferdinando is a British character actor, known for his varied performances.\n\nHe has collaborated extensively with director and cousin Gerard Johnson, playing the title role in the critically acclaimed Tony and the lead role in their more recent film together, the award-winning Hyena.\n\nHe played the King Pin Spencer in David Mackenzie's prison drama Starred Up.\n\nHe also regularly collaborates with British filmmaker Ben Wheatley, having played Jacob in A Field in England, The Half-Face Man in \"Deep Breath\", the first episode of series 8 of Doctor Who, and Paul in Wheatley's High-Rise.\n\nMore recent work includes Tommy's Honour with Peter Mullan, directed by Jason Connery, Ghost in the Shell, with Scarlett Johansson and Juliet Binoche, directed by Rupert Sanders, and Guy Ritchie's King Arthur: Legend of the Sword, with Jude Law. In 2017, he starred in Woody Harrelson's experimental, live film directorial debut Lost In London alongside Owen Wilson, Willie Nelson and Woody Harrelson.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 109833,
        "imdb_id": "nm0272252",
        "known_for_department": "Acting",
        "name": "Peter Ferdinando",
        "place_of_birth": "London, United Kingdom",
        "popularity": 0.2515,
        "profile_path": "/guAO6rcuSCahk4v3I6Y9uqSwumj.jpg"
    }
}