{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/pLHK5934S3lX73PAGuGPxr7un2p.jpg",
                "genre_ids": [
                    16,
                    10751,
                    14,
                    12,
                    18
                ],
                "id": 475215,
                "original_language": "ja",
                "original_title": "未来のミライ",
                "overview": "Unhappy after his new baby sister displaces him, four-year-old Kun begins meeting people and pets from his family's history in their unique house in order to help him become the big brother he was meant to be.",
                "popularity": 4.6574,
                "poster_path": "/b9XvI4Nehzi0nXyNVD6DtT39P6l.jpg",
                "release_date": "2018-06-16",
                "title": "Mirai",
                "video": false,
                "vote_average": 7.144,
                "vote_count": 803,
                "character": "Father (voice)",
                "credit_id": "5b5ddbddc3a368422103392d",
                "order": 2
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/zVDJ4cRgSpHlILSm7kGiklHQ6O7.jpg",
                "genre_ids": [
                    16,
                    35,
                    12,
                    28
                ],
                "id": 1062807,
                "original_language": "ja",
                "original_title": "劇場版 SPY×FAMILY CODE: White",
                "overview": "While under the guise of taking his family on a weekend winter getaway, Loid's attempt to make progress on his current mission Operation Strix proves difficult when Anya mistakenly gets involved and triggers events that threaten world peace.",
                "popularity": 5.5839,
                "poster_path": "/xlIQf4y9eB14iYzNN142tROIWON.jpg",
                "release_date": "2023-12-22",
                "title": "SPY x FAMILY CODE: White",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 568,
                "credit_id": "6585325c98f1f152b10a5d33",
                "department": "Sound",
                "job": "Theme Song Performance"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "星野 源",
            "جن هوشینو"
        ],
        "biography": "Gen Hoshino (星野 源, Hoshino Gen, born January 28, 1981) is a Japanese singer-songwriter, musician, actor, and writer.\n\nHoshino's movie debut, Lee Sang-il's 69, was an adaptation of the Ryū Murakami novel of the same name. He previously acted in various television dramas and stage plays. In 2012, he debuted as a voice actor, voicing Buddha in the original video animation (OVA) adaptation of Hikaru Nakamura's manga Saint Young Men, and also provided a theme song called \"Gag\" for its 2013 theatrical version, where he reprised his role. In 2013, he played the lead character in Masahide Ichii's Blindly in Love (箱入り息子の恋, Hakoiri Musuko no Koi) alongside Kaho, and starred in the Sion Sono film Why Don't You Play in Hell?. In 2016, Hoshino starred in TBS's The Full-Time Wife Escapist. With Yui Aragaki as his co-star, he portrayed a salaryman named Hiramasa Tsuzaki. The drama achieved steadily rising ratings, with a real-time viewership peak rating of 20.8% on the final episode, and an overall rating of 14.5%. Hoshino's performance earned him several Best Supporting Actor awards. He also provided the theme song for the drama, titled \"Koi\".\n\nIn 2017, Hoshino lent his voice to the main character of award-winning animated film Night Is Short, Walk On Girl. He also became the voice of the Father in Mamoru Hosoda's Mirai, which was released into theaters in Japan on July 20, 2018.\n\nIdaten, NHK's 2019 Taiga drama, chosen for the theme to encourage the Tokyo 2020 Olympic Games, Hoshino portrayed Kazushige Hirasawa, who delivered the persuasive speech that helped determine the venue for the Tokyo 1964 Olympic Games.\n\nOn April 30, 2018, it was announced that Hoshino will star in Samurai Shifters, the film adaptation of Akihiro Dobashi's historical novel Hikkoshi Daimyo Sanzenri, set to premier on August 30, 2019. In the movie, he plays a bookworm samurai called Harunosuke Katagiri, who receives the mission to help a daimyo move. It will be Hoshino's first lead role in a live-action movie since Blindly in Love in 2013.",
        "birthday": "1981-01-28",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.hoshinogen.com",
        "id": 1098601,
        "imdb_id": "nm2273252",
        "known_for_department": "Acting",
        "name": "Gen Hoshino",
        "place_of_birth": "Saitama, Japan",
        "popularity": 1.2555,
        "profile_path": "/jpimO9RAv2HSFAUslddcHqlvlJK.jpg"
    }
}