{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/vTNzXPvFRn8Z4vn2myhkNpq26J6.jpg",
                "genre_ids": [
                    35,
                    80,
                    28
                ],
                "id": 290250,
                "original_language": "en",
                "original_title": "The Nice Guys",
                "overview": "A private eye investigates the apparent suicide of a fading porn star in 1970s Los Angeles and uncovers a conspiracy.",
                "popularity": 5.7427,
                "poster_path": "/clq4So9spa9cXk3MZy2iMdqkxP2.jpg",
                "release_date": "2016-05-15",
                "title": "The Nice Guys",
                "video": false,
                "vote_average": 7.127,
                "vote_count": 8256,
                "character": "Die-In Protester",
                "credit_id": "5b6b51620e0a267ef111d801",
                "order": 29
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Meredith Ann Berg"
        ],
        "biography": "Award-winning writer/director Meredith Berg graduated from NYU Tisch and resides in Los Angeles where she has built a resume of producing, writing, directing and comic-book editing. While in New York, she adapted and directed the Off-Broadway update of Julius Caesar for the York Shakespeare Company, and remains active in Los Angeles theater, most recently directing the world premiere of “Lights Off, Eyes Closed”.\n\nAn avid genre fan, Meredith has both created and edited comic books, most recognizably story-editing the graphic novel for “COWBOYS & ALIENS,” upon which the feature film starring Daniel Craig and Harrison Ford was based. As a writer and director, Meredith won festival awards for her AFI Directing Workshop for Women horror short, “VOID,” which premiered at Screamfest LA and is available on Amazon. Her feature screenplay, “FACELESS,” was a finalist for the Sundance Screenwriters Lab, and was featured on the Blood List; a list of the best thriller and horror feature screenplays of the year. Meredith wrote and directed the hit digital series \"LANA STEELE:MAKEUP SPY\" for Estee Lauder Cosmetics, starring YouTube sensation Lilly Singh. The wildly popular series currently has over 7 million views. \"DEMENTIA,\" her first feature script to hit theaters, was produced by BoulderLight Pictures and released by IFC. Earning rave reviews in several publications, including the Village Voice and the LA Times, \"DEMENTIA\" was selected as the New York Times' Critic's Pick of the week and is available in theaters as well as on iTunes, Amazon and Netflix.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.meredithberg.com/",
        "id": 1099812,
        "imdb_id": "nm1240898",
        "known_for_department": "Writing",
        "name": "Meredith Berg",
        "place_of_birth": null,
        "popularity": 0.0453,
        "profile_path": "/fPHG5wAaLgmDjlLiLRYFStK9kFy.jpg"
    }
}