{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/g3yflwqajsVEYdUr7B84fMHBkAw.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 329805,
                "original_language": "fr",
                "original_title": "Mon roi",
                "overview": "Tony is admitted to a rehabilitation center after a serious ski accident. Dependent on the medical staff and pain relievers, she takes time to look back on a turbulent relationship that she experienced with Georgio.",
                "popularity": 2.3585,
                "poster_path": "/kOhRkC7J3jpAgHGC0Uh3SoCqU4c.jpg",
                "release_date": "2015-10-21",
                "title": "My King",
                "video": false,
                "vote_average": 7.142,
                "vote_count": 793,
                "character": "Mayor",
                "credit_id": "55eaa3f59251413e3a009459",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "François-Marie Banier (born 27 June 1947) is a French novelist, playwright, artist, actor and photographer. His published works include Le Passé Composé (1971) and Balthazar, Fils de Famille (1985).\n\nBanier is particularly known for his photographs of celebrities and other public figures and for his friendships with members of high society. In a prominent legal case, in 2016 he was convicted of 'abuse of weakness' of the elderly billionaire Liliane Bettencourt.\n\nBanier was born on June 27, 1947 in Paris, France. A second son, he grew up in a middle-class family in the 16th arrondissement of Paris. He has claimed he had been \"completely incomprehensible to [his] parents\". Although Banier was brought up as a Catholic, his Hungarian-born father (actual name: Banyaï) concealed the fact that he had converted from Judaism under the Nazi regime. His father was an advertising executive, who beat him for disobeying “idiotic rules” and this led him to attempt suicide at the age of 15.\n\nDespite his modest background, from an early age he was a precocious and hyperactive talent, who was able to develop friendships with some of Paris' wealthiest arts patrons and artists. At the age of 16, he met Salvador Dalí, who would send his car to bring Banier to his suite at the Hotel Meurice to discuss art. At the age of 19, he befriended the wealthy heiress and patron of the arts Marie-Laure de Noailles who was then 64.\n\nBy the time he was 20, Banier was working as the house press officer for Pierre Cardin. While working at Cardin, he began taking photographs, and among his earliest subjects was novelist Truman Capote.\n\nIn 1969, Banier published his first novel, Les Résidences secondaires ou la Vie distraite (Second Homes or Distracted Life), at the age of 22. Around the same time, a well-known Parisian designer and antique dealer Madeleine Castaing collected some of his photographs.\n\nIn 1971, Banier published his second novel, Le Passé Composé. During this period Banier was involved with interior designer Jacques Grange. In 1972, fashion designer Yves Saint Laurent invited them to Marrakech for Easter where they met artist Andy Warhol.\n\nIn August 1972, The Sunday Times Magazine ran a cover story by James Fox titled \"François-Marie Banier—Golden Boy of Paris,\" accompanied by photos of Banier around Paris by Eve Arnold. \"When James's story came out I received thousands of letters from English boys. Girls sent me pictures of themselves in the nude. I received money in the mail … James's article was cretinous. It did me a disservice by missing the anxiety of my youth, the difficulty I was experiencing as a young boy alone, in front of life without family,\" Banier said.\n\nHis third novel, La Tête la Première (Head First), was published in 1972. In 1975, he wrote his first play, Hôtel du Lac.\n\nBanier's photographs were first exhibited at the Centre Pompidou in Paris in 1991. He has since exhibited his work internationally including at the Metropolitan Museum of Photography in Tokyo, Museum Haus Lange in Krefeld, and Villa Medici in Rome. ...\n\nSource: Article \"François-Marie Banier\" from Wikipedia in English, licensed under CC-BY-SA.",
        "birthday": "1947-06-27",
        "deathday": null,
        "gender": 2,
        "homepage": "https://fmbanier.com/",
        "id": 1099236,
        "imdb_id": "nm0052017",
        "known_for_department": "Acting",
        "name": "François-Marie Banier",
        "place_of_birth": "Paris, France",
        "popularity": 0.0617,
        "profile_path": "/xINdlSiOY6hp64K2YN1IQEmC69h.jpg"
    }
}