{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yCGCtDRIaEHSPd5pO8NPfTML6Jh.jpg",
                "genre_ids": [
                    28,
                    14,
                    10770
                ],
                "id": 877703,
                "original_language": "en",
                "original_title": "Teen Wolf: The Movie",
                "overview": "The wolves are howling once again, as a terrifying ancient evil emerges in Beacon Hills. Scott McCall, no longer a teenager yet still an Alpha, must gather new allies and reunite trusted friends to fight back against this powerful and deadly enemy.",
                "popularity": 5.83,
                "poster_path": "/wAkpPm3wcHRqZl8XjUI3Y2chYq2.jpg",
                "release_date": "2023-01-18",
                "title": "Teen Wolf: The Movie",
                "video": false,
                "vote_average": 7.527,
                "vote_count": 898,
                "character": "Victoria Argent",
                "credit_id": "63d291d4a410c811e9bedb0a",
                "order": 19
            },
            {
                "adult": false,
                "backdrop_path": "/5P6hWD4zxAMntRuRnB4MmPLijNw.jpg",
                "genre_ids": [
                    18
                ],
                "id": 22881,
                "original_language": "en",
                "original_title": "The Blind Side",
                "overview": "The story of Michael Oher, a homeless and traumatized boy who became an All American football player and first round NFL draft pick with the help of a caring woman and her family.",
                "popularity": 14.2372,
                "poster_path": "/bMgq7VBriuBFknXEe9E9pVBYGZq.jpg",
                "release_date": "2009-11-20",
                "title": "The Blind Side",
                "video": false,
                "vote_average": 7.674,
                "vote_count": 6589,
                "character": "Elaine",
                "credit_id": "5f5053a2f29d6600315e93d9",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Eaddy Mays, an American actress and producer, was born in New York and raised by her mother. At eight years old, Mays transformed the basement of their home into the \"Magic Theater,\" where her mother and dozens of stuffed animals were subjected to countless recreations of blockbuster films and Broadway plays with Mays starring in every role. By the age of ten, Mays was strongly encouraged by her mother to pursue this passion outside the home; she was cast in a community theatre production of Hans Christian Andersen's fairy tale \"The Snow Queen.\"\n\nIn the years that followed, Mays put her passion into the newly formed family business by hosting video presentations for the production company owned by her step-father, Bob Haymes, singer, actor and songwriter, who is known best for his song \"That's All,\" an oft recorded tune now part of the Great American Songbook. This hosting work brought the teenage Mays to China in 1984 and later to Hong Kong and Japan.\n\nAfter graduating college and dabbling in commercial radio and television for several years, Mays began her acting career in earnest in 2009 when she was cast as Elaine in the Academy Award winning film \"The Blind Side\" in which she appeared opposite Sandra Bullock, in the infamous 'ladies who lunch' scenes. Before the film was released, Mays was cast as a cancer patient for a medical center commercial, in which she agreed to shave her head completely bald. Mays surprised producers by eagerly insisting that she be allowed to do the actual shearing herself and excitedly requested that the event be captured on video and posted on YouTube.\n\nThis radical change in appearance prompted a shift in her career and shortly thereafter she was cast in MTV's supernatural thriller TV series,\"Teen Wolf\". She appeared occasionally in season one. But, throughout seasons two and three, she was featured as a chilling, memorable villain, garnering attention and praise from critics for her performance and gathering hate mail from more radical fans for her part as the evil nemesis of their beloved werewolves.\n\nThroughout the years, the same passion that led the eight-year-old Mays to create \"Magic Theater\" in her basement sent her to diving into the murky waters of film and television producing. Mays co-wrote, produced and starred in the full-length independent feature film, \"Highland Fling,\" a romantic comedy about a fun-loving Scotsman and a straight-laced southern belle shooting a reality TV show at a Scottish Highland Festival in small town America. Simultaneously, Mays and her angelically patient, sleep-deprived crew shot the actual series pilot for the television show featured in the film.\n\nMays has a long history of volunteer work with kids, beginning first in college where she was a \"big sister\" in Big Brothers Big Sisters of America. Later, she served as the Custodian and Legal Guardian for two displaced young girls in the custody of the State's Foster Care program. These experiences compelled Mays to help create and manage The Highland House, a homeless shelter for at-risk youth displaced from their home.\n\nMays still volunteers with youth today, works in Los Angeles; she has three children (with a basement theater of their own!); Cali, a Percheron mare; Kidiot, a barn cat ....and almost enough hours in the day.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1099429,
        "imdb_id": "nm1712612",
        "known_for_department": "Acting",
        "name": "Eaddy Mays",
        "place_of_birth": "New York, New York",
        "popularity": 0.0879,
        "profile_path": "/tOkqsD1f5qhg8hxqcWmf9CUyTy4.jpg"
    }
}