{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/AdBXP8e6K3FYdDrMx3Wr6WZqCYF.jpg",
                "genre_ids": [
                    12,
                    14,
                    35
                ],
                "id": 493529,
                "original_language": "en",
                "original_title": "Dungeons & Dragons: Honor Among Thieves",
                "overview": "A charming thief and a band of unlikely adventurers undertake an epic heist to retrieve a lost relic, but things go dangerously awry when they run afoul of the wrong people.",
                "popularity": 10.1578,
                "poster_path": "/v7UF7ypAqjsFZFdjksjQ7IUpXdn.jpg",
                "release_date": "2023-03-23",
                "title": "Dungeons & Dragons: Honor Among Thieves",
                "video": false,
                "vote_average": 7.334,
                "vote_count": 4140,
                "character": "Porb Piradost",
                "credit_id": "64546231c044290185721a19",
                "order": 26
            },
            {
                "adult": false,
                "backdrop_path": "/6MKr3KgOLmzOP6MSuZERO41Lpkt.jpg",
                "genre_ids": [
                    35,
                    80,
                    12
                ],
                "id": 337404,
                "original_language": "en",
                "original_title": "Cruella",
                "overview": "In 1970s London amidst the punk rock revolution, a young grifter named Estella is determined to make a name for herself with her designs. She befriends a pair of young thieves who appreciate her appetite for mischief, and together they are able to build a life for themselves on the London streets. One day, Estella’s flair for fashion catches the eye of the Baroness von Hellman, a fashion legend who is devastatingly chic and terrifyingly haute. But their relationship sets in motion a course of events and revelations that will cause Estella to embrace her wicked side and become the raucous, fashionable and revenge-bent Cruella.",
                "popularity": 11.2552,
                "poster_path": "/hjS9mH8KvRiGHgjk6VUZH7OT0Ng.jpg",
                "release_date": "2021-05-26",
                "title": "Cruella",
                "video": false,
                "vote_average": 7.987,
                "vote_count": 9720,
                "character": "Police Commissioner",
                "credit_id": "60b260c9477215005802ec46",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Paul Reginald Bazely",
            "Paul Bazel"
        ],
        "biography": "Paul Reginald Bazely (born May 6, 1968) is an English actor. He is known for portraying Troy in the ITV sitcom Benidorm. His other TV credits include Making Out, Emmerdale, Heartbeat, Doctors, Holby City, Vanity Fair, The IT Crowd and Cruella.\n\nBazely made his television debut in five episodes of the BBC series Making Out in 1991. Then in 2006, he landed his first starring role as Troy in the ITV comedy series Benidorm, making his final appearance in 2017. In 2016, he appeared in \"Shut Up and Dance\", an episode of the anthology series Black Mirror. Then in 2020, he starred in an episode of The Good Karma Hospital, and portrayed the recurring role of Grahame McKenna in the BBC soap opera Doctors.\n\nSince 2009 Bazely has narrated a number of audiobooks by the Indian-born spiritual teacher and author Eknath Easwaran, including The Bhagavad Gita, The Bhagavad Gita for Daily Living, Essence of the Upanishads, The Dhammapada, Passage Meditation and Gandhi the Man.",
        "birthday": "1968-05-06",
        "deathday": null,
        "gender": 2,
        "homepage": "https://profile.tagmin.com/66teckvp93932n0q87vn16b115se8i28063u",
        "id": 110075,
        "imdb_id": "nm0063311",
        "known_for_department": "Acting",
        "name": "Paul Bazely",
        "place_of_birth": "Brighton, East Sussex, England, UK",
        "popularity": 0.3051,
        "profile_path": "/jO9aI50zQWDKCQe7BwukzKg0PMp.jpg"
    }
}