{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tmP4COlAaowO0FniW30aatOcmMq.jpg",
                "genre_ids": [
                    18,
                    35,
                    10749,
                    10402
                ],
                "id": 243,
                "original_language": "en",
                "original_title": "High Fidelity",
                "overview": "After his long-time girlfriend dumps him, a thirty-year-old record store owner seeks to understand why he is unlucky in love while recounting his \"top five breakups of all time\".",
                "popularity": 3.1403,
                "poster_path": "/e2LZGB62GMhv3Fo8tDZjY87I81a.jpg",
                "release_date": "2000-03-17",
                "title": "High Fidelity",
                "video": false,
                "vote_average": 7.12,
                "vote_count": 2080,
                "character": "Louis",
                "credit_id": "52fe422cc3a36847f80099a3",
                "order": 35
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Alex Désert (born July 18, 1968) is a Haitian-American actor and musician most known for his roles in the TV series The Flash, Becker, and Boy Meets World. He is also a founding member of Los Angeles-based ska band Hepcat.\n\nHis first strong television presence was on a controversial CBS program entitled TV 101 where he co-starred with friend Matt LeBlanc. From 1990 to 1991, he played police lab scientist Julio Mendez alongside John Wesley Shipp in CBS' superhero TV series based on DC Comics' The Flash.\n\nIn 1992 he starred in the short lived Fox series the The Heights.\n\nFrom 1995 to 1996 Désert played Eli Williams on the hit TV show Boy Meets World\n\nFrom 1998 until 2004, he played the role of Jake Malinak, the blind magazine stand owner, on the American sitcom Becker alongside Ted Danson.\n\nAs a film actor he appeared in PCU with Jeremy Piven and Jon Favreau. He also appeared in Swingers with Vince Vaughn and Jon Favreau, where he made famous the line \"This place is dead anyway.\" He also had a small part as the character Louis in High Fidelity in 2000.\n\nDésert also appeared in Sarah Silverman's The Great Schlep web advertisement, which encouraged young Jews to drive to Florida and convince their Jewish grandparents to support Barack Obama in the 2008 U.S. presidential election.\n\nHe also appeared in Let It Shine.\n\nIn 2009, he provided the voice for Col. Nick Fury in an episode of Wolverine and the X-Men. In early 2010 he starred in the film Lego: The Adventures of Clutch Powers and Lego Clutch Powers: Bad Hair Day. In late 2010, he reprised the role for the animated series, Avengers: Earth's Mightiest Heroes and his father Jack Fury.\n\nLater in 2009 he also made an appearance on the t.v. show, House. He played a claustrophobic patient at a mental hospital in the episode \"Broken\" during the sixth season.\n\nIn 2011, Désert starred as Wise in the YouTube web series The LeBrons.\n\nDésert has lent his voice to various Video Games in his career, including Crystal Dynamic's Tomb Raider: Legend (as \"Zip\"), Tomb Raider: Underworld, Splinter Cell: Double Agent and Scarface: The World is Yours. He portrayed the auto-tuned pimp Zimos in the 2011 THQ release, Saints Row: The Third. In 2012, Désert co-starred as Levi in Disney's Let It Shine.\n\nIn 2013, Désert reprised his role as Zimos in Saints Row IV DLC.",
        "birthday": "1968-07-18",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 110141,
        "imdb_id": "nm0246373",
        "known_for_department": "Acting",
        "name": "Alex Désert",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.3526,
        "profile_path": "/iz5fLxrOTKYUkpUmGXgVfCfIZxn.jpg"
    }
}