{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8rBBojmT5vwkuVh2hFWBkbWtlBX.jpg",
                "genre_ids": [
                    36,
                    18
                ],
                "id": 10139,
                "original_language": "en",
                "original_title": "Milk",
                "overview": "The true story of Harvey Milk, the first openly gay man ever elected to public office. In San Francisco in the late 1970s, Harvey Milk becomes an activist for gay rights and inspires others to join him in his fight for equal rights that should be available to all Americans.",
                "popularity": 4.1614,
                "poster_path": "/ot4ImF4b7QbS6XsTdMH3pWxNmX2.jpg",
                "release_date": "2008-11-05",
                "title": "Milk",
                "video": false,
                "vote_average": 7.24,
                "vote_count": 2295,
                "character": "Self (archive footage)",
                "credit_id": "6201b15a9ae613001c9b24d6",
                "order": 32
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Harvey Bernard Milk (May 22, 1930 – November 27, 1978) was an American politician and the first openly gay man to be elected to public office in California, as a member of the San Francisco Board of Supervisors. Milk was born and raised in New York where he acknowledged his homosexuality as an adolescent, but chose to pursue sexual relationships with secrecy and discretion well into his adult years. His experience in the counterculture of the 1960s caused him to shed many of his conservative views about individual freedom and the expression of sexuality.\n\nMilk moved to San Francisco in 1972 and opened a camera store. Although he had been restless, holding an assortment of jobs and moving house frequently, he settled in The Castro, a neighborhood that was experiencing a mass immigration of gay men and lesbians. He was compelled to run for city supervisor in 1973, though he encountered resistance from the existing gay political establishment. His campaign was compared to theater; he was brash, outspoken, animated, and outrageous, earning media attention and votes, although not enough to be elected. He campaigned again in the next two supervisor elections, dubbing himself the \"Mayor of Castro Street\". Voters responded enough to warrant his running for the California State Assembly as well. Taking advantage of his growing popularity, he led the gay political movement in fierce battles against anti-gay initiatives. Milk was elected city supervisor in 1977 after San Francisco reorganized its election procedures to choose representatives from neighborhoods rather than through city-wide ballots.\n\nMilk served almost eleven months in office, during which he sponsored a bill banning discrimination in public accommodations, housing, and employment on the basis of sexual orientation. The Supervisors passed the bill by a vote of 11–1, and it was signed into law by Mayor George Moscone. On November 27, 1978, Milk and Moscone were assassinated by Dan White, a disgruntled former city supervisor.\n\nDespite his short career in politics, Milk became an icon in San Francisco and a martyr in the gay community. In 2002, Milk was called \"the most famous and most significantly open LGBT official ever elected in the United States\". Anne Kronenberg, his final campaign manager, wrote of him: \"What set Harvey apart from you or me was that he was a visionary. He imagined a righteous world inside his head and then he set about to create it for real, for all of us.\" Milk was posthumously awarded the Presidential Medal of Freedom in 2009.\n\nDescription above from the Wikipedia article Harvey Milk, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1930-05-22",
        "deathday": "1978-11-27",
        "gender": 2,
        "homepage": "https://milkfoundation.org",
        "id": 110168,
        "imdb_id": "nm0587548",
        "known_for_department": "Acting",
        "name": "Harvey Milk",
        "place_of_birth": "Woodmere, Long Island, New York, USA",
        "popularity": 0.0261,
        "profile_path": "/qZ7dcJdmAndNclqeQLHtglvNEaN.jpg"
    }
}