{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/s8ftvFvafWWEhApISamHx32bx6h.jpg",
                "genre_ids": [
                    12,
                    28,
                    878
                ],
                "id": 36658,
                "original_language": "en",
                "original_title": "X2",
                "overview": "Professor Charles Xavier and his team of genetically gifted superheroes face a rising tide of anti-mutant sentiment led by Col. William Stryker. Storm, Wolverine and Jean Grey must join their usual nemeses—Magneto and Mystique—to unhinge Stryker's scheme to exterminate all mutants.",
                "popularity": 0.3553,
                "poster_path": "/bWMw0FMsY8DICgrQnrTSWbzEgtr.jpg",
                "release_date": "2003-04-27",
                "title": "X2",
                "video": false,
                "vote_average": 7.031,
                "vote_count": 10515,
                "character": "Surgeon",
                "credit_id": "58afd535c3a3682cee008f85",
                "order": 68
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/pl01vQJ70PMbv1x2JQ9XvMz2tNL.jpg",
                "genre_ids": [
                    27,
                    35
                ],
                "id": 23202,
                "original_language": "en",
                "original_title": "Trick 'r Treat",
                "overview": "Four interwoven stories that occur on Halloween: an everyday high school principal has a secret life as a serial killer; a college virgin might have just met the one guy for her; a group of teenagers pull a mean prank, and a bitter old recluse receives an uninvited guest.",
                "popularity": 6.0492,
                "poster_path": "/w0nmol4g7n6MFfhfphV7GzHHYjB.jpg",
                "release_date": "2007-12-09",
                "title": "Trick 'r Treat",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 1961,
                "credit_id": "52fe4462c3a368484e01ffe1",
                "department": "Production",
                "job": "Executive Producer"
            },
            {
                "adult": false,
                "backdrop_path": "/s8ftvFvafWWEhApISamHx32bx6h.jpg",
                "genre_ids": [
                    12,
                    28,
                    878
                ],
                "id": 36658,
                "original_language": "en",
                "original_title": "X2",
                "overview": "Professor Charles Xavier and his team of genetically gifted superheroes face a rising tide of anti-mutant sentiment led by Col. William Stryker. Storm, Wolverine and Jean Grey must join their usual nemeses—Magneto and Mystique—to unhinge Stryker's scheme to exterminate all mutants.",
                "popularity": 0.3553,
                "poster_path": "/bWMw0FMsY8DICgrQnrTSWbzEgtr.jpg",
                "release_date": "2003-04-27",
                "title": "X2",
                "video": false,
                "vote_average": 7.031,
                "vote_count": 10515,
                "credit_id": "52fe45fe9251416c91045855",
                "department": "Writing",
                "job": "Screenplay"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Dan Harris (born August 29, 1979) is an American screenwriter and director best known for working with Michael Dougherty and Bryan Singer, and whose writing credits include Superman Returns, X2, and X-Men: Apocalypse.\n\nHarris was raised in Kingston, Pennsylvania. He went to Wyoming Valley West Middle and High Schools and graduated from Wyoming Seminary. Before he received his bachelor's degree from Columbia University, Harris's short film Urban Chaos Theory won the Grand Jury Prize for Best Short Film at the NoDance Film Festival, and the following winter, his short film, \"The Killing of Candice Klein,\" played at the 2002 Sundance Film Festival.\n\nHarris made his feature film directing debut with Imaginary Heroes, starring Sigourney Weaver, Jeff Daniels, Emile Hirsch, and Michelle Williams. The film had its world premiere at the 29th Toronto International Film Festival and opened Winter 2005 after being given special recognition for excellence in filmmaking from the National Board of Review.\n\nIn addition to Superman Returns, Harris and his writing partner Michael Dougherty have co-written many films, including Urban Legends: Bloody Mary and X2, which he wrote at the age of 22 for director Bryan Singer, an assignment offered to him after the director read the screenplay for Imaginary Heroes. In the same year, he was honoured as one of Variety’s top 10 screenwriters to watch.\n\nHarris directed I, Lucifer, a film based on the novel, which he adapted with Michael Dougherty. Harris and Dougherty opted out of writing the upcoming Superman sequel.\n\nHarris co-wrote X-Men: Apocalypse with Singer, Dougherty, and Simon Kinberg.\n\nAlso with Dougherty and Singer, Harris wrote the Superman Returns prequel comic books for DC Comics.\n\nHarris' photography has twice been published by New York fashion and arts landmark Visionaire, and he was part of Vanity Fair's \"Hollywood Portfolio\" in 2005.\n\nDescription above from the Wikipedia article Dan Harris, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1979-08-29",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 11013,
        "imdb_id": "nm0003529",
        "known_for_department": "Writing",
        "name": "Dan Harris",
        "place_of_birth": "Kingston, Pennsylvania, USA",
        "popularity": 0.1177,
        "profile_path": "/jLmdzNmLYuIg6CwiWmXd6f5vDxo.jpg"
    }
}