{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rRwD4MoBlkBXWQ6PDnbKRSU5dDu.jpg",
                "genre_ids": [
                    53,
                    18,
                    80
                ],
                "id": 1359,
                "original_language": "en",
                "original_title": "American Psycho",
                "overview": "A wealthy New York investment banking executive hides his alternate psychopathic ego from his co-workers and friends as he escalates deeper into his illogical, gratuitous fantasies.",
                "popularity": 8.8291,
                "poster_path": "/9uGHEgsiUXjCNq8wdq4r49YL8A1.jpg",
                "release_date": "2000-04-13",
                "title": "American Psycho",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 11595,
                "character": "Vanden",
                "credit_id": "56994bf2c3a3680ce600001f",
                "order": 22
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Cat Black"
        ],
        "biography": "Catherine Black is an award winning Canadian actress, artist and filmmaker. She grew up in Owen Sound, a hilly artists haven in Southern Ontario. On her childhood snowmobile, Catherine disappeared into endless fields very fast. She is inspired by the outdoors. Nature and wide, open space, play a prominent role in Catherine’s art. It was the unsupervised moments running around outside that informed so much of her strength, independence and artistic taste.  Black is a self-taught painter. Her paintings have been exhibited internationally. Most recently Catherine photographed and wrote about the journey of her large oil paintings traveling from her family farm in Fergus Ontario across the Old Oregon Trail to California. This was Catherine’s own Westward Expansion.  As an actress, Catherine is best known for her role as Vanden in American Psycho, performing with Christian Bale, starring with Crispin Glover in The Donner Party (Showtime) and multiple guest starring roles, most recently on season 2 of Playing House (USA, NBC). Catherine has performed with Christian Bale, Malcolm McDowell, Crispin Glover, Peter Weller, Mark and Michael Polish, Winona Ryder, Hillary Duff, Sean Astin, Shawn Ashmore, Jon Cryer, Chevy Chase, Mark Boone Jr., Jared Leto, Reese Witherspoon, Keegan Michael-Key, Eric Idle, Elyes Gabel, Harland Williams, Katey Sagal and many more.  Catherine’s extensive practice as an actor and artist has rooted her artistic vision in filmmaking. Her filmmaking debut, the multi award winning ‘sexy and surreal’ short film, De Puta Madre A Love Story (2014),WON Catherine both Best Director (London IFF 2015), Best Lead Actress (Madrid IFF 2014) for her performance, and Best Cinematography (Columbia Gorge IFF 2014).  Catherine is currently in post production for her latest filmmaking venture, Girl Trip.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 110245,
        "imdb_id": "nm0085213",
        "known_for_department": "Acting",
        "name": "Catherine Black",
        "place_of_birth": " Toronto, Canada",
        "popularity": 0.1531,
        "profile_path": "/2b83HslBqBgVZje3xR30DkIelQN.jpg"
    }
}