{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dCuwNZp2DLOWr8qV0GDBHINhVZM.jpg",
                "genre_ids": [
                    18,
                    14
                ],
                "id": 103328,
                "original_language": "fr",
                "original_title": "Holy Motors",
                "overview": "We follow 24 hours in the life of a being moving from life to life like a cold and solitary assassin moving from hit to hit. In each of these interwoven lives, the being possesses an entirely distinct identity: sometimes a man, sometimes a woman, sometimes youthful, sometimes old. By turns murderer, beggar, company chairman, monstrous creature, worker, family man.",
                "popularity": 1.6796,
                "poster_path": "/4ZuTrrDQhCS9f6KzIX6HfsjjyMd.jpg",
                "release_date": "2012-07-02",
                "title": "Holy Motors",
                "video": false,
                "vote_average": 6.991,
                "vote_count": 1199,
                "character": "Cyber Woman",
                "credit_id": "52fe4a1cc3a36847f81ba219",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Julia Gunthel",
            "Julia Günthel"
        ],
        "biography": "Julia Gunthel - Goddess of Flexibility\n\nJulia Günthel is the most flexible woman in the world, gymnast, model and actress. The girl is also known as Zlata. By the way, she is a two time Guinness World Record holder. You know, Julia is the tallest rubber woman (176 cm). On November 23, 2007 the girl burst three balloons with her back for 12 seconds! Moreover, she is able to open the bottles with her feet, standing on the hands.\n\nAwesome girl was born in Naberezhnye Chelny, Russia. When she was four years old her unique abilities were discovered in the kindergarten. At the age of six little girl joined the circus studio in her native city. For the first time Julia performed when she was 10.\n\nHer family moved to Leipzig, Germany, when she was 16 years old. To tell the truth, Julia has to train very hard to keep her muscles in shape and to be as flexible as possible. At the same time, the incredible girl admits that it is natural for her to bend her body so much, she feels discomfort only when she has to remain bent for a long time, for example, for a photo session. Every day she spends 5 hours training!  In 2012 Gunthel was awarded the title of The Most Flexible Woman In The World by Discovery Channel. What is more, Julia starred along with Eva Mendes and Kylie Minogue in the fantasy drama film Holy Motors in 2012. Amazing girl posed in the role of an office worker for Zlata new calendar 2013. Now Julia lives in Germany. She is married and has son Leon. However, they say that the couple divorced.\n\n“You don’t need to look to the right or to the left. Do not listen to what people are saying to you, and just be yourself”- says Julia.\n\nZlata inspires artists who paint pictures with her image and sculpt sculptures in which she is embodied in her unimaginable poses. A beautiful body in combination with grace and flexibility leaves no one indifferent.\n\nSource: www.schlangenfrau.com",
        "birthday": "1984-10-20",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.zlatexa.com/",
        "id": 1102330,
        "imdb_id": "nm2361009",
        "known_for_department": "Acting",
        "name": "Zlata",
        "place_of_birth": "Naberezhnye Chelny, Russia",
        "popularity": 0.0239,
        "profile_path": "/gWQyQk3L9nQGlU4gXUsPRZrJ8wE.jpg"
    }
}