{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ruF3Lmd4A8MHbnEBE6lxPMbsHGL.jpg",
                "genre_ids": [
                    9648,
                    18
                ],
                "id": 15,
                "original_language": "en",
                "original_title": "Citizen Kane",
                "overview": "Newspaper magnate Charles Foster Kane is taken from his mother as a boy and made the ward of a rich industrialist. As a result, every well-meaning, tyrannical or self-destructive move he makes for the rest of his life appears in some way to be a reaction to that deeply wounding event.",
                "popularity": 6.1449,
                "poster_path": "/sav0jxhqiH0bPr2vZFU0Kjt2nZL.jpg",
                "release_date": "1941-04-17",
                "title": "Citizen Kane",
                "video": false,
                "vote_average": 8.0,
                "vote_count": 5751,
                "character": "Raymond",
                "credit_id": "52fe420ec3a36847f80008b7",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Paul Sternberg"
        ],
        "biography": "Paul Stewart (March 13, 1908 – February 17, 1986) was an American character actor known for his tough, guttural voice. He frequently portrayed villains and mobsters throughout his lengthy career.\n\nBorn Paul Sternberg in New York City, Stewart graduated from Columbia University and made his Broadway theatre debut in the play Two Seconds in 1931. A few years later he met Orson Welles, who invited him to join the Mercury Theatre, where he participated in the notorious 1938 radio broadcast of The War of the Worlds. He was a founding member of AFTRA.\n\nSternberg's many screen credits include Citizen Kane, Twelve O'Clock High, Champion, Kiss Me Deadly, The Bad and the Beautiful, In Cold Blood, The Day of the Locust, S.O.B., and W.C. Fields and Me, in which he portrayed Florenz Ziegfeld. On television, he appeared in Playhouse 90, Alfred Hitchcock Presents, Alcoa Theatre, Dr. Kildare, Wagon Train, Gunsmoke, It Takes a Thief, Mannix, The Name of the Game, McMillan &amp; Wife, Mission Impossible,The Rockford Files, Lou Grant, and Remington Steele, among many others. He also directed some television episodes, among them \"Little Girl Lost\", from the Twilight Zone.\n\nStewart was married to big band singer/actress Peg La Centra from 1939 until his death from a heart attack in Los Angeles at age 77. He was characterized in the 1999 television movie RKO 281.",
        "birthday": "1908-03-13",
        "deathday": "1986-02-17",
        "gender": 2,
        "homepage": null,
        "id": 11033,
        "imdb_id": "nm0829717",
        "known_for_department": "Acting",
        "name": "Paul Stewart",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.4818,
        "profile_path": "/8dsAzDIErQFdPAZOJaaVGrohdnf.jpg"
    }
}