{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7ZO9yoEU2fAHKhmJWfAc2QIPWJg.jpg",
                "genre_ids": [
                    53,
                    28,
                    878
                ],
                "id": 766507,
                "original_language": "en",
                "original_title": "Prey",
                "overview": "When danger threatens her camp, the fierce and highly skilled Comanche warrior Naru sets out to protect her people. But the prey she stalks turns out to be a highly evolved alien predator with a technically advanced arsenal.",
                "popularity": 9.6544,
                "poster_path": "/ujr5pztc1oitbe7ViMUOilFaJ7s.jpg",
                "release_date": "2022-08-02",
                "title": "Prey",
                "video": false,
                "vote_average": 7.678,
                "vote_count": 7224,
                "character": "Sumu (Chief Wife)",
                "credit_id": "62a030f4d2147c117da7239d",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Stefany was born and raised in North Vancouver BC. She is the only daughter of Squamish Nation hereditary Chief Joe Mathias and Janice Antoine, the principal of the Coldwater School in Merritt, BC.\n\nHer love of the arts was ignited in her as a young child because her mom brought her to the theatre for children and her dad to see movies of all kinds. Not only did they both encourage her acting they also supported her love of singing, dance, and writing.\n\nStefany graduated from the University of British Columbia theatre program and continued in Theater until she was noticed by Chris Haddock who cast her in his acclaimed TV series \"DaVinci's Inquest,\" where she played a recurring role. She then went on to appear in \"Da Vinci City Hall\", \"The Collector\" and several independent feature-length and short films.\n\nShe also attended the Vancouver Film School for film production and directing. Stefany splits her time between Los Angeles and British Columbia.  When she was 7 years old, she was cast in the play Little Mermaid (based on Hans Christian Anderson's book) which was aired on the local cable network in North Vancouver. Although she did not win the coveted role of the Little Mermaid, she was cast as the evil Sea Witch and thus began her love affair with acting.\n\nShe danced for 12 years as she was building her acting career, until she injured her shoulder.\n\nStefany now carries the title of hereditary Chief with the Squamish Nation after the passing of her father on March 10th, 2000. She is one of 16 hereditary chiefs.",
        "birthday": "1972-03-12",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.stefanymathias.com/",
        "id": 1103483,
        "imdb_id": "nm0558774",
        "known_for_department": "Acting",
        "name": "Stefany Mathias",
        "place_of_birth": " North Vancouver, British Columbia, Canada",
        "popularity": 0.1373,
        "profile_path": "/ziJ5fXAQVJ6X5y6vLpcmze1dyp.jpg"
    }
}