{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3ddK0Ba1jd81n6yA7gIFbaw5QgG.jpg",
                "genre_ids": [
                    18,
                    9648
                ],
                "id": 152780,
                "original_language": "fr",
                "original_title": "Le passé",
                "overview": "After four years apart, Ahmad returns to his wife Marie in Paris in order to progress their divorce. During his brief stay, he cannot help noticing the strained relationship between Marie and her daughter Lucie. As he attempts to improve matters between mother and daughter Ahmad unwittingly lifts the lid on a long buried secret...",
                "popularity": 3.3614,
                "poster_path": "/8nff89qjYN3Hck5G33xeRPsM8TZ.jpg",
                "release_date": "2013-05-17",
                "title": "The Past",
                "video": false,
                "vote_average": 7.244,
                "vote_count": 580,
                "character": "Ahmad",
                "credit_id": "52fe4b2b9251416c910d2261",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "علی مصفا",
            "Ali Mosafa"
        ],
        "biography": "Ali Mosaffa (علی مصفا) was born in Tehran, Iran. His father, Mozaher Mosaffa is a renowned Persian poet and professor of Persian literature at the University of Tehran (UT). Mosaffa mother, Amir Banoo Karimi is also a leading scholar and professor of Persian literature at the University of Tehran (UT) and the eldest daughter of the legendary Persian poet, Amiri Firuzkuhi. As a child, Ali Mosaffa discovered his interest in story writing and english, contributing to his fluency in the language. He is a graduate of Civil Engineering from the University of Tehran (UT) where he showed an interest in acting; making his debut in the 1991 film, Omid. Mosaffa went on to win the prize for best male actor the following year at the Fajr International Film Festival for his role in Darius Mehrjui's film, Pari. Mosaffa met his future wife, Iranian actress Leila Hatami on the set of Dariush Mehrjui's 1996 film, Leila. The two married in 1999 and have two children, a son named Mani (born February 2007) and a daughter named Asal (born October 2008). Ali Mosaffa is also known for The Mix, Pari, The Tower of Minoo, The Last Step, Beloved Sky, There Are Things You Don't Know, The Past, What's the Time in Your World, Death of the Fish, Duet.",
        "birthday": "1966-12-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1104854,
        "imdb_id": "nm0608214",
        "known_for_department": "Acting",
        "name": "Ali Mosaffa",
        "place_of_birth": "Tehran, Iran",
        "popularity": 0.2743,
        "profile_path": "/gBcLnM9NeGpHw730ud3yKe1lYZi.jpg"
    }
}