{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/Ac2s9RJEi1ZeaQopoLsqlsmWQmx.jpg",
                "genre_ids": [
                    18
                ],
                "id": 85350,
                "original_language": "en",
                "original_title": "Boyhood",
                "overview": "The film tells a story of a divorced couple trying to raise their young son. The story follows the boy for twelve years, from first grade at age 6 through 12th grade at age 17-18, and examines his relationship with his parents as he grows.",
                "popularity": 3.4778,
                "poster_path": "/2BvtvDUyxiMJ4dmKfiQf4qdOHQN.jpg",
                "release_date": "2014-06-05",
                "title": "Boyhood",
                "video": false,
                "vote_average": 7.493,
                "vote_count": 5326,
                "character": "Kenny",
                "credit_id": "555716019251411e54005176",
                "order": 27
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "At the age of five, Cambell Westmoreland - who was born on May 28, 1996 in Moscow, Russia, and who now calls San Antonio, Texas home - started asking his mom \"Why is my picture not on that sign? How old do you have to be to be on TV or in a movie?\" She thought that it was just a phase, but encouraged him by signing him up for acting classes, which led to to him getting signed with an agent.\n\nFortunately for audiences and filmmakers alike, the phase hasn't passed, as since that time, Cambell has had the pleasure of working with such acclaimed directors as Richard Linklater (on Boyhood), Kimberly Peirce (on Stop Loss), and Robert Rodriguez (on Shorts), as well as emerging filmmakers like Bryan Ortiz (on The Big Scary German and DR. S The Movie), Carl Theil (on Drawing Closer, the Grammy nominated music producer and noted film composer's directorial debut) and award-winning filmmaker at the 2006 Sundance Film Festival, Pablo Veliz (on The Boys of Ghost Town).\n\nCambell's credits also include commercial campaigns for Wal-Mart and Sears, a pilot for MTV, and several theatre credits. When he is not on stage or on screen, Cambell can be found on the field playing football, baseball, or soccer.\n\n- IMDb Mini Biography",
        "birthday": "1996-05-28",
        "deathday": null,
        "gender": 0,
        "homepage": null,
        "id": 1104323,
        "imdb_id": "nm2506154",
        "known_for_department": "Acting",
        "name": "Cambell Westmoreland",
        "place_of_birth": "Moscow, Russia",
        "popularity": 0.0143,
        "profile_path": null
    }
}