{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tzCBj6duyr0h3Y2SACNprdL5WsB.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 31175,
                "original_language": "de",
                "original_title": "Soul Kitchen",
                "overview": "In Hamburg, German-Greek chef Zinos unknowingly disturbs the peace in his locals-only restaurant by hiring a more talented chef.",
                "popularity": 1.5512,
                "poster_path": "/9Y2OQ7MFouzmVCMqqvZPLrzHF0F.jpg",
                "release_date": "2009-09-09",
                "title": "Soul Kitchen",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 555,
                "character": "",
                "credit_id": "5d9305547cffda0019fc59f2",
                "order": 24
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Peter Lohmeyer (born 22 January 1962 in Niedermarsberg) is a German actor. He has appeared in more than one hundred films since 1980.\n\nLohmeyer is the youngest of three children of the Protestant pastor Dieter Lohmeyer and his wife. Due to his father's profession, he completed his school education at various places. From 1972-1974 he attended the Albrecht-Dürer-Gymnasium in Hagen, the Eberhard-Ludwigs-Gymnasium in Stuttgart from 1974-1976, and the Stadtgymnasium Dortmund from 1976-1981. From 1982 to 1984 he received acting lessons at the Westfälische Schauspielschule in Bochum, but left without graduating.\n\nLohmeyer made his stage debut in the play called 'Was heißt hier Liebe' at the Schauspielhaus Bochum. Afterwards he performed at theatres in Düsseldorf, Stuttgart, Hamburg, and at the Schiller Theater in Berlin. In 2009 he returned to the Schauspielhaus Bochum for a new stage version of the play 'Menschen im Hotel'. He took on his first role in a TV movie called 'Der Kampfschwimmer' in 1983. Afterwards he took role in the TV movie 'Alles Paletti'. Loymeyer made his film debut in the comedy 'Tiger, Löwe, Panther' in 1988. He became famous with 'Die Straßen von Berlin' (1995 to 1998) and 'The Miracle of Bern' (Das Wunder von Bern, 2003, by Sönke Wortmann). Lohmeyer also played leading roles in movies by Peter Lichtefeld, a German film director, including the road movie 'Trains'n'Roses', which earned him a German Film Award. In 2005 he was seen in 'Am Tag als Bobby Ewing starb' by Lars Jessen. Lohmeyer received the German Film Award in Gold for 'Trains'n'Roses' and in 2000 he received a Bavarian TV Award for 'Der Elefant in meinem Bett'.\n\nLohmeyer has four children from two different relationships. He and his former partner, camera assistant Katrin Klamroth, have three children (Lola Klamroth, Louis Klamroth and Leila Lynn Klamroth). His fourth son, Ivo Lohmeyer, comes from another relationship. From 2008 to July 2014 he was married to Sarah Wiener.\n\nSource: Article \"Peter Lohmeyer\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1962-01-22",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 11071,
        "imdb_id": "nm0517885",
        "known_for_department": "Acting",
        "name": "Peter Lohmeyer",
        "place_of_birth": "Niedermarsberg, North Rhine-Westphalia, Germany",
        "popularity": 0.2954,
        "profile_path": "/1hnbaz9deXeNzCDwPxudTea17rV.jpg"
    }
}