{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/g1QkFTSkqA0Pq1p63jTsPIEA7zy.jpg",
                "genre_ids": [
                    18
                ],
                "id": 1246,
                "original_language": "en",
                "original_title": "Rocky Balboa",
                "overview": "When he loses a highly publicized virtual boxing match to ex-champ Rocky Balboa, reigning heavyweight titleholder Mason Dixon retaliates by challenging the Italian Stallion to a 10-round exhibition bout. To the surprise of his son and friends, Rocky agrees to come out of retirement and face an opponent who's faster, stronger and thirty years his junior. Rocky takes on Dixon in what will become the greatest fight in boxing history!",
                "popularity": 5.8305,
                "poster_path": "/byBlJvZwCqgtIwrZNv0pyE974jC.jpg",
                "release_date": "2006-12-20",
                "title": "Rocky Balboa",
                "video": false,
                "vote_average": 6.873,
                "vote_count": 3639,
                "character": "Patron at Adrian's (uncredited)",
                "credit_id": "5f7be0b41fd36f00385316c6",
                "order": 54
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/dLL90vskYFn1S89RZp5TUguK9wl.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 4982,
                "original_language": "en",
                "original_title": "American Gangster",
                "overview": "Loosely based on the criminal career of Frank Lucas, a gangster from La Grange, North Carolina, who smuggled heroin into the United States on American service planes returning from the Vietnam War, before being detained by a task force led by Newark Detective Richie Roberts.",
                "popularity": 6.9465,
                "poster_path": "/8sV6nWuKczuXRt0C6EWoXqJAj6G.jpg",
                "release_date": "2007-11-02",
                "title": "American Gangster",
                "video": false,
                "vote_average": 7.591,
                "vote_count": 5730,
                "credit_id": "61a56ab40cb33500936688c3",
                "department": "Crew",
                "job": "Stunts"
            },
            {
                "adult": false,
                "backdrop_path": "/y2DB71C4nyIdMrANijz8mzvQtk6.jpg",
                "genre_ids": [
                    28,
                    80,
                    18,
                    53
                ],
                "id": 49026,
                "original_language": "en",
                "original_title": "The Dark Knight Rises",
                "overview": "Following the death of District Attorney Harvey Dent, Batman assumes responsibility for Dent's crimes to protect the late attorney's reputation and is subsequently hunted by the Gotham City Police Department. Eight years later, Batman encounters the mysterious Selina Kyle and the villainous Bane, a new terrorist leader who overwhelms Gotham's finest. The Dark Knight resurfaces to protect a city that has branded him an enemy.",
                "popularity": 17.1291,
                "poster_path": "/hr0L2aueqlP2BYUblTTjmtn0hw4.jpg",
                "release_date": "2012-07-17",
                "title": "The Dark Knight Rises",
                "video": false,
                "vote_average": 7.787,
                "vote_count": 23553,
                "credit_id": "5e1a93361065d3001628cc83",
                "department": "Crew",
                "job": "Stunts"
            },
            {
                "adult": false,
                "backdrop_path": "/enNubozHn9pXi0ycTVYUWfpHZm.jpg",
                "genre_ids": [
                    18,
                    28,
                    80,
                    53
                ],
                "id": 155,
                "original_language": "en",
                "original_title": "The Dark Knight",
                "overview": "Batman raises the stakes in his war on crime. With the help of Lt. Jim Gordon and District Attorney Harvey Dent, Batman sets out to dismantle the remaining criminal organizations that plague the streets. The partnership proves to be effective, but they soon find themselves prey to a reign of chaos unleashed by a rising criminal mastermind known to the terrified citizens of Gotham as the Joker.",
                "popularity": 67.4752,
                "poster_path": "/qJ2tW6WMUDux911r6m7haRef0WH.jpg",
                "release_date": "2008-07-16",
                "title": "The Dark Knight",
                "video": false,
                "vote_average": 8.523,
                "vote_count": 34427,
                "credit_id": "5e1a93931d820f001526a050",
                "department": "Crew",
                "job": "Stunts"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "DG",
            "David James Gere"
        ],
        "biography": "David James Gere grew up in the small town of Cromwell, CT. His mother and sister were tragically killed in a mysterious drowning accident when he was very young. His father, James, an educator, later married Veronica Gere, who raised him. An outstanding student, Gere graduated from Providence College in Rhode Island (1997), receiving a BA in Political Science and a Minor in Film Studies. Early on, David began modeling and working on both sides of the camera in films and commercials. Despite a European print campaign for GUESS Jeans (1997), David was more inspired by acting and filmmaking. He soon began a run of short films, documentaries, and music videos (MTV2) that were critically well-received. He developed a relationship with the emerging Rhode Island directors, Michael Corrente and Peter Farrelly, and got his first acting break in Outside Providence (1999), a film which Peter and his brother Bobby Farrelly produced and Corrente directed. In 2006, David appeared in Rocky Balboa, which he cites as a significant turning point, having been directed by his childhood hero, Sylvester Stallone. In 2007, David appeared on the CW Network's hit show Gossip Girl as Frank Meltzer. David is also an experienced stuntman, having performed stunts in The Dark Knight (2008) as one of Bane's Mercenaries. After working closely with professional wrestling legend Tommy Dreamer on the horror movie set of Army Of The Damned (2013), David began a career in the squared circle. Under Dreamer's guidance, Gere began performing as the villainous heel manager, DG Haven. The character has a cult level following, and is established in major promotions throughout North America. David is currently continuing his acting career, and is a producing partner for several major production companies including Verdi Productions and Woodhaven Media. Gere launched his new production company, Shadow Vale Productions in 2018. David Gere resides in Connecticut, where he owns several nightlife venues. David is also an accomplished abstract painter, his pieces have appeared in various films, and his work has been commissioned by celebrity peers. David is very devoted to charitable causes for children, ranging from The United Way, to local organizations, including his own youth mentor program. He often credits his focus for helping young people, along with his drive and desire to create, to the difficult loss he experienced as a boy.",
        "birthday": "1975-02-15",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1108733,
        "imdb_id": "nm1020877",
        "known_for_department": "Production",
        "name": "David Gere",
        "place_of_birth": "Cromwell, Connecticut, USA",
        "popularity": 0.1009,
        "profile_path": "/gSqF3mVYmYh3RheHA8ldJ7t267H.jpg"
    }
}