{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/byQdu1nzQLI9t1VeoP1xuQfru3L.jpg",
                "genre_ids": [
                    80,
                    53
                ],
                "id": 996,
                "original_language": "en",
                "original_title": "Double Indemnity",
                "overview": "A seductive housewife draws an insurance salesman into a plot of adultery and crime to collect on her husband's life insurance.",
                "popularity": 3.5639,
                "poster_path": "/rVNYZZgfhwqVMMWlBmxOfWqnwCj.jpg",
                "release_date": "1944-07-06",
                "title": "Double Indemnity",
                "video": false,
                "vote_average": 8.106,
                "vote_count": 1902,
                "character": "Dietrichsons' Maid Nettie (uncredited)",
                "credit_id": "549d33379251415dc1004a08",
                "order": 23
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nBetty Farrington (May 14, 1898 – February 3, 1989) was an American character actress active from the 1920s through 1960.\n\nBorn in Missouri's largest city, Kansas City, Betty Farrington would play mostly supporting and minor roles during her career, although she would occasionally be given a featured or leading part, appearing in almost 100 films during her career. Some of the more notable films she appeared in include: Preston Sturges' The Lady Eve (1941), starring Barbara Stanwyck and Henry Fonda; 1942's My Favorite Blonde and 1947's My Favorite Brunette, both starring Bob Hope; the classic film noir Double Indemnity (1944), starring Fred MacMurray, Stanwyck, and Edward G. Robinson; 1944's The Uninvited, starring Ray Milland and Ruth Hussey; Cecil B. Demille's Unconquered (1948), starring Gary Cooper and Paulette Goddard; the epic Samson and Delilah (1950), with Victor Mature and Hedy Lamarr in the title roles; Father of the Bride (1950), directed by Vincente Minnelli, and starring Spencer Tracy, Joan Bennett, and Elizabeth Taylor; and Minnelli's 1953 The Band Wagon, starring Fred Astaire and Cyd Charisse.  Her final big screen appearance would be in 1956's The Fastest Gun Alive, starring Glenn Ford. Farrington would make guest appearances on several television shows in the late 1950s, including Sergeant Preston of the Yukon and Perry Mason. She died in San Diego three-and-a-half months before her 91st birthday.",
        "birthday": "1898-05-14",
        "deathday": "1989-02-03",
        "gender": 1,
        "homepage": null,
        "id": 1108832,
        "imdb_id": "nm0268426",
        "known_for_department": "Acting",
        "name": "Betty Farrington",
        "place_of_birth": "Kansas City, Missouri, USA ",
        "popularity": 0.0551,
        "profile_path": null
    }
}