{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7en9qwF88VfxPXsN6azHmUxRBNy.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 21575,
                "original_language": "fr",
                "original_title": "Un prophète",
                "overview": "Sentenced to six years in prison, Malik El Djebena is alone in the world and can neither read nor write. On his arrival at the prison, he seems younger and more brittle than the others detained there. At once he falls under the sway of a group of Corsicans who enforce their rule in the prison. As the 'missions' go by, he toughens himself and wins the confidence of the Corsican group.",
                "popularity": 5.8458,
                "poster_path": "/x9Jb8kewBHPzjTtgCQvoQoDsy4d.jpg",
                "release_date": "2009-08-26",
                "title": "A Prophet",
                "video": false,
                "vote_average": 7.585,
                "vote_count": 1631,
                "character": "Malik's Lawyer",
                "credit_id": "52fe441fc3a368484e010c5d",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/1nR9mCsJD02j13wet0yAnVhEG6Y.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 71157,
                "original_language": "fr",
                "original_title": "Polisse",
                "overview": "Paris, France. Fred and his colleagues, members of the BPM, the Police Child Protection Unit, dedicated to pursuing all sorts of offenses committed against the weakest, must endure the scrutiny of Melissa, a photographer commissioned to graphically document the daily routine of the team.",
                "popularity": 2.378,
                "poster_path": "/cKs3XSFVbFeZcH3g9geAvr6ApOl.jpg",
                "release_date": "2011-10-06",
                "title": "Polisse",
                "video": false,
                "vote_average": 7.781,
                "vote_count": 1268,
                "character": "Grocery Store Manager",
                "credit_id": "5a625af4c3a36836b400498a",
                "order": 57
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Рабах Лусиф ",
            "رباح لوصيف"
        ],
        "biography": "Rabah Loucif (Arabic: رباح لوصيف), born January 1, 1944, in Chlef, Algeria, under the sign of Capricorn, is a French-Algerian actor.\n\nRabah began his theatrical career in Algeria, winning first prize at the Young Algerian Theater Festival and directing various iconic plays such as Caligula, Montserrat, and The Tales of Djeha, actively participating in the development of Algerian theater through numerous national performances. Based in France since 1958, he has established himself on the French-speaking stage—in theater, film, and television—collaborating with great directors such as Chéreau, Perinetti, Beineix, Boisset, and Audiard.\n\nRabah Loucif has also distinguished himself in notable roles on television: he notably plays \"Hassan\" in the series Diane, femme flic, \"Tariq's Father\" in La promesse du feu, \"Farflaoui\" in Julie Lescaut, and \"Mohamed Ben Sala\" in \"Une famille Formidable\". His eclectic filmography includes more than sixty roles in film, television, and short films, combining drama, comedy, and politically charged works, including: R.A.S. (1973), The Lifeguard (1979), Beaujolais Nouveau Est Arrivé (1978), Train d’Enfer (1985), Banzaï (1983), Pentimento (1989), Fruits and Vegetables (1994), Honor of the Tribe (1993), and Shock Waves (2007), A Prophet (2009), 37°2 Le Matin (Betty Blue, 1986), Polisse (2011), Mohamed Dubois (2013), Ramdam (2020), etc.\n\nRabah Loucif remains a familiar face to French and Algerian audiences, recognized for his authenticity, versatility, and artistic commitment to poignant human stories, social dramas, and popular comedies.",
        "birthday": "1944-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.agence-djouhra.fr/artiste.cfm/99236_115_2-Rabah_LOUCIF.html",
        "id": 1109346,
        "imdb_id": "nm0521646",
        "known_for_department": "Acting",
        "name": "Rabah Loucif",
        "place_of_birth": "Chlef, Algeria",
        "popularity": 0.0498,
        "profile_path": "/sMnMBCU1qoNU7dOh2bIi2DCpdGe.jpg"
    }
}