{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gpyu3jQeMQeUFAVjCSrVCrYYK3f.jpg",
                "genre_ids": [
                    99
                ],
                "id": 23128,
                "original_language": "en",
                "original_title": "The Cove",
                "overview": "The Cove tells the amazing true story of how an elite team of individuals, films makers and free divers embarked on a covert mission to penetrate the hidden cove in Japan, shining light on a dark and deadly secret. The shocking discoveries were only the tip of the iceberg.",
                "popularity": 1.937,
                "poster_path": "/miodcVtQv2YxpKjjHJWcV0EDfSP.jpg",
                "release_date": "2009-07-31",
                "title": "The Cove",
                "video": false,
                "vote_average": 7.936,
                "vote_count": 628,
                "character": "Self",
                "credit_id": "52fe4460c3a368484e01f607",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ric O'Feldman",
            "Ric O'Barry",
            "Richard Barry O'Feldman"
        ],
        "biography": "From Wikipedia, the free encyclopedia.  Richard (Ric) O'Barry (born c. 1939 ) was first recognized in the 1960s for capturing and training the five dolphins that were used in the well-known TV series Flipper. O'Barry made a radical transition from training dolphins in captivity to assertively combating the captivity industry soon after Kathy, one of the Flipper dolphins, died, committing suicide in his arms, according to O'Barry .  In 1970 he founded the Dolphin Project, a group that aims to educate the public about captivity and, where feasible, free captive dolphins . He was featured in the Academy Award-winning film, The Cove (2009), which used covert techniques to expose the yearly dolphin drive hunting that goes on in Taiji, Japan.\n\nDescription above from the Wikipedia article Ric O'Barry, licensed under CC-BY-SA,full list of contributors on Wikipedia.",
        "birthday": "1939-10-14",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.dolphinproject.com/",
        "id": 110920,
        "imdb_id": "nm0639337",
        "known_for_department": "Acting",
        "name": "Richard O'Barry",
        "place_of_birth": "Miami, Florida, USA",
        "popularity": 0.0741,
        "profile_path": null
    }
}