{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/aCURY1tNUkvrNnjw5qYJXTUp7z.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 33602,
                "original_language": "en",
                "original_title": "Temple Grandin",
                "overview": "A biopic of Temple Grandin, an autistic American who has become one of the leading scientists in humane livestock handling.",
                "popularity": 3.1623,
                "poster_path": "/gQhQ6yEkUkDDo1zugpq46PJN8xZ.jpg",
                "release_date": "2010-02-06",
                "title": "Temple Grandin",
                "video": false,
                "vote_average": 7.8,
                "vote_count": 511,
                "character": "Nancy",
                "credit_id": "52fe45279251416c910293fb",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/Ac2s9RJEi1ZeaQopoLsqlsmWQmx.jpg",
                "genre_ids": [
                    18
                ],
                "id": 85350,
                "original_language": "en",
                "original_title": "Boyhood",
                "overview": "The film tells a story of a divorced couple trying to raise their young son. The story follows the boy for twelve years, from first grade at age 6 through 12th grade at age 17-18, and examines his relationship with his parents as he grows.",
                "popularity": 3.9047,
                "poster_path": "/2BvtvDUyxiMJ4dmKfiQf4qdOHQN.jpg",
                "release_date": "2014-06-05",
                "title": "Boyhood",
                "video": false,
                "vote_average": 7.493,
                "vote_count": 5326,
                "character": "Tammy",
                "credit_id": "52fe49369251416c910a6429",
                "order": 31
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Tamara Haasen",
            "Tamara Haasan",
            "Tamara Jolaine Haasen"
        ],
        "biography": "Tamara Jolaine, began her acting career in Canada. At age 18, around the time of her completion of her Political Science degree at the University of Toronto, she cast aside her plans to attend law school and began an artistic journey revolving around both acting and music.  In Toronto, Tamara worked on many film and commercial projects. The feature independent film\n\nTough Love, directed by Frank Caruso, was her first official starring role and aided in her decision to take acting further and move to study in New York.  Jolaine studied at Circle in the Square Theater School and it was there, in Times Square, where she really began to hone her skills. Following the completion of her training, Tamara set her sights on the theater, starring in many off-Broadway shows, including the hit show \n\nLine, written by Israel Horowitz. She also got her feet wet in a musical titled, Let’s Be Frank, playing both Lauren Bacall and Shirley Maclain, which received widespread accolades from audiences all over Manhattan. By the time she left New York, Tamara had starred in more than seven off-Broadway plays.  It was in Austin where Tamara found her ultimate acting mentor, David A. Cox. David studied for many years under the great Sanford Meisner and today he personally embodies the man’s teaching spirit and methods. Under Cox’s tutelage, Tamara continued to develop her craft, which eventually aided in her securing a recurring role on NBC’s \n\nFriday Night Lights, as Erin, the free-spirited waitress who finds herself in a life altering circumstance. In the second season finale her character, Erin, reveals to former star quarterback, Jason Streets, that she is pregnant with his child.",
        "birthday": "1983-05-20",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 110990,
        "imdb_id": "nm1846817",
        "known_for_department": "Acting",
        "name": "Tamara Jolaine",
        "place_of_birth": "London, Ontario, Canada",
        "popularity": 0.0912,
        "profile_path": "/cL9pYIMolSdT4gBu9vNcmqxRqx3.jpg"
    }
}