{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uxezSInaPoH20CyHx4TuY1LzGly.jpg",
                "genre_ids": [
                    16,
                    35,
                    10751,
                    10770,
                    878,
                    12,
                    28,
                    10402
                ],
                "id": 71689,
                "original_language": "en",
                "original_title": "Phineas and Ferb The Movie: Across the 2nd Dimension",
                "overview": "Phineas and Ferb get trapped in an alternate dimension where the evil Doofenshmirtz rules the tri-state area. They must find a way back home with the help of their pet platypus named Perry, who they discover is a secret agent.",
                "popularity": 4.2913,
                "poster_path": "/updMFSOZwEftfkJRpozwBlRlYI2.jpg",
                "release_date": "2011-08-05",
                "title": "Phineas and Ferb The Movie: Across the 2nd Dimension",
                "video": false,
                "vote_average": 7.095,
                "vote_count": 580,
                "character": "Additional Voices (voice)",
                "credit_id": "62ce536cb9744201c5e5793c",
                "order": 15
            },
            {
                "adult": false,
                "backdrop_path": "/ziC23LkMYj8gToQQYQGWSGJCLNF.jpg",
                "genre_ids": [
                    10751,
                    16,
                    35,
                    12
                ],
                "id": 82690,
                "original_language": "en",
                "original_title": "Wreck-It Ralph",
                "overview": "Wreck-It Ralph is the 9-foot-tall, 643-pound villain of an arcade video game named Fix-It Felix Jr., in which the game's titular hero fixes buildings that Ralph destroys. Wanting to prove he can be a good guy and not just a villain, Ralph escapes his game and lands in Hero's Duty, a first-person shooter where he helps the game's hero battle against alien invaders. He later enters Sugar Rush, a kart racing game set on tracks made of candies, cookies and other sweets. There, Ralph meets Vanellope von Schweetz who has learned that her game is faced with a dire threat that could affect the entire arcade, and one that Ralph may have inadvertently started.",
                "popularity": 15.0327,
                "poster_path": "/zWoIgZ7mgmPkaZjG0102BSKFIqQ.jpg",
                "release_date": "2012-11-01",
                "title": "Wreck-It Ralph",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 12695,
                "character": "Additional Voices (voice)",
                "credit_id": "5728d8d692514175f500097f",
                "order": 60
            },
            {
                "adult": false,
                "backdrop_path": "/hqyjzDRCs1N5gEsh2gklzPdsEFD.jpg",
                "genre_ids": [
                    28,
                    53,
                    12
                ],
                "id": 56292,
                "original_language": "en",
                "original_title": "Mission: Impossible - Ghost Protocol",
                "overview": "Ethan Hunt and his team are racing against time to track down a dangerous terrorist named Hendricks, who has gained access to Russian nuclear launch codes and is planning a strike on the United States. An attempt to stop him ends in an explosion causing severe destruction to the Kremlin and the IMF to be implicated in the bombing, forcing the President to disavow them. No longer being aided by the government, Ethan and his team chase Hendricks around the globe, although they might still be too late to stop a disaster.",
                "popularity": 10.1393,
                "poster_path": "/psiWp3VTjznfokmGQG9uqiiknQQ.jpg",
                "release_date": "2011-12-07",
                "title": "Mission: Impossible - Ghost Protocol",
                "video": false,
                "vote_average": 7.104,
                "vote_count": 10366,
                "character": "Swedish Translator (voice)",
                "credit_id": "5b5c0cf3c3a368421b00f0ba",
                "order": 34
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Gracie Lazar"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nApril Stewart (aka Gracie Lazar) is an American voice actress. She is best known for providing the voices of several female characters on the animated cartoon TV series South Park alongside fellow voice actress Mona Marshall. Born and raised in Truckee, California, Stewart started acting at the age 12. Her father, Freddie Stewart, was a singer with the Tommy Dorsey Orchestra. In early 2008, April Stewart had her first child.\n\nApril is the voice of Liane Cartman, Sharon Marsh, Mrs. McCormick, Shelley Marsh, The Mayor, Principal Victoria, Wendy Testaburger and numerous other characters starring in South Park. She is also the voice of Maria Rivera on Nickelodeon's El Tigre: The Adventures of Manny Rivera.",
        "birthday": "1968-02-08",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 111467,
        "imdb_id": "nm0829181",
        "known_for_department": "Acting",
        "name": "April Stewart",
        "place_of_birth": "Truckee, California, USA",
        "popularity": 0.3147,
        "profile_path": "/qmPAms01P6ZHp5wjQW2XkymwjCx.jpg"
    }
}