{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tsSWHgaFlzzkp3o976juBZbmcs2.jpg",
                "genre_ids": [
                    28,
                    80,
                    878
                ],
                "id": 754,
                "original_language": "en",
                "original_title": "Face/Off",
                "overview": "In order to foil a terrorist plot, an FBI agent undergoes facial transplant surgery and assumes the identity of a criminal mastermind. The plan turns sour when the criminal wakes up prematurely and seeks revenge.",
                "popularity": 6.5867,
                "poster_path": "/69Xzn8UdPbVnmqSChKz2RTpoNfB.jpg",
                "release_date": "1997-06-27",
                "title": "Face/Off",
                "video": false,
                "vote_average": 7.047,
                "vote_count": 5603,
                "character": "Jamie Archer",
                "credit_id": "52fe4271c3a36847f801f0ef",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/bWftGh0aLMzb8wetgziLq3fHpTJ.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 9769,
                "original_language": "en",
                "original_title": "Lolita",
                "overview": "Humbert Humbert is a middle-aged British novelist who is both appalled by and attracted to the vulgarity of American culture. When he comes to stay at the boarding house run by Charlotte Haze, he soon becomes obsessed with Lolita, the woman's teenaged daughter.",
                "popularity": 10.0685,
                "poster_path": "/9INcC14WZjCMKGE360VXmklCLdZ.jpg",
                "release_date": "1997-09-27",
                "title": "Lolita",
                "video": false,
                "vote_average": 7.135,
                "vote_count": 1876,
                "character": "Dolores \"Lolita\" Haze",
                "credit_id": "52fe4529c3a36847f80bfd6f",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "دومینیک سوین"
        ],
        "biography": "Dominique Ariane Swain (born August 12, 1980) is an American actress. She is best known for her roles as the title character in the 1997 film adaptation of Vladimir Nabokov's novel Lolita, and as Jamie Archer in the film Face/Off.\n\nSwain started her career in Hollywood as a stunt double; she appeared as the double for Macaulay Culkin's younger sister Quinn in Joseph Ruben's The Good Son (1993). In 1995, at the age of 14, she was chosen out of 2,500 girls to play the title role in Adrian Lyne's controversial 1997 screen adaptation of Lolita, as Dolores \"Lolita\" Haze. She was 15 during filming and her performance was praised by critics. She later then played the rebellious teen Jamie Archer in John Woo's Face/Off (1997). She starred in the 1998 drama film Girl, in which she plays a high-schooler who is determined to lose her virginity. In 2009, Swain appeared in Starz Inside: Sex and the Cinema which discussed the depiction of sex in film. That same year, she was featured in the movie Noble Things, about the country star Jimmy Wayne Collins, which also starred country musician Lee Ann Womack. Swain also starred in the horror/slasher film Fall Down Dead as the main character, Christie Wallace. She starred in Monte Hellman's romance thriller Road to Nowhere in 2010. In 2011, Swain was featured in David Ren's action thriller The Girl from the Naked Eye. She starred in the direct-to-video science fiction film Nazis at the Center of the Earth in 2012. In 2013, Swain starred in Gregory Hatanaka's drama film Blue Dream as Gena Townsend.\n\n​From Wikipedia, the free encyclopedia",
        "birthday": "1980-08-12",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 11149,
        "imdb_id": "nm0000663",
        "known_for_department": "Acting",
        "name": "Dominique Swain",
        "place_of_birth": "Malibu, California, USA",
        "popularity": 1.0464,
        "profile_path": "/7zRGmaNRvUCtbD4K3o6Hjmw65IL.jpg"
    }
}