{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2bHoj05gR7I5gp4oeoDCY6bU42d.jpg",
                "genre_ids": [
                    12,
                    28,
                    14,
                    10752,
                    36
                ],
                "id": 127533,
                "original_language": "ja",
                "original_title": "るろうに剣心",
                "overview": "In 1868, after the Bakumatsu war ends, the ex-assassin Kenshin Himura traverses Japan with an inverted sword, to defend the needy without killing.",
                "popularity": 4.6661,
                "poster_path": "/vo3Zs07PZfKNsTrU0pcPZONJcN5.jpg",
                "release_date": "2012-08-25",
                "title": "Rurouni Kenshin Part I: Origins",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 849,
                "character": "Tsubame Sanjo",
                "credit_id": "5bd34f5e92514103a0003c76",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "나가노 메이",
            "永野 芽郁"
        ],
        "biography": "Mei Nagano is a Japanese actress. She is known for playing Rinko in the film My Love Story! (2015) as well as Yosano Suzume in the film Daytime Shooting Star (2017). In June 2017, she was announced as the lead for NHK's 98th Asadora, Hanbun, Aoi, due air in April 2018.\n\nNagano was scouted in Kichijouji, Tokyo when she was in her third year of elementary school. She made her acting debut in the 2009 action-adventure film Hard Revenge Milly: Bloody Battle, as a minor character.\n\nIn 2015, she played the heroine, Rinko Yamato, in the romantic comedy film, My Love Story! In July 2016, she starred in her first lead role in the teen drama, Koe Koi, as high school student Yuiko Yoshioka, who meets a mysterious boy who wears a paper bag over his head. In September, she starred in the Japanese version of the film Gods of Egypt. She provided the voice for the character Zaya. She also appeared in commercials for Calpis Water, Sekisui House, Townwork, UQ Mobile, and Alpen. In 2017, she starred in the romance film, Daytime Shooting Star.\n\nNagano was a regular model for Japanese fashion magazines Nico☆Petite and nicola. In August 2016, she became an exclusive model for Seventeen.",
        "birthday": "1999-09-24",
        "deathday": null,
        "gender": 1,
        "homepage": "https://blog.stardust.co.jp/naganomei/",
        "id": 1115068,
        "imdb_id": "nm3737209",
        "known_for_department": "Acting",
        "name": "Mei Nagano",
        "place_of_birth": "Tokyo, Japan",
        "popularity": 1.5346,
        "profile_path": "/vexy1AF1wedrDifb9pbguiry4vU.jpg"
    }
}