{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/r3ibKnJ3qZvcm42OleT0HlcRDUk.jpg",
                "genre_ids": [
                    16,
                    12,
                    14,
                    10751
                ],
                "id": 79707,
                "original_language": "ja",
                "original_title": "星を追う子ども",
                "overview": "The film centers on Asuna, a young girl who spends her solitary days listening to the mysterious music emanating from the crystal radio she received from her late father as a memento. One day while walking home she is attacked by a fearsome monster and saved by a mysterious boy named Shun. However, Shun disappears and Asuna embarks on a journey of adventure to the land of Agartha with her teacher Mr. Morisaki to meet a Shun again. Through her journey she comes to know the cruelty and beauty of the world, as well as loss.",
                "popularity": 4.7394,
                "poster_path": "/hWyBwsjMgtuZL2i1QBWQY0OCh0M.jpg",
                "release_date": "2011-05-07",
                "title": "Children Who Chase Lost Voices",
                "video": false,
                "vote_average": 7.241,
                "vote_count": 749,
                "character": "Mana (voice)",
                "credit_id": "52fe49e1c3a368484e145291",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/yFZG86Zvdy6JuIlMW9eHxlVkct5.jpg",
                "genre_ids": [
                    16,
                    28,
                    12,
                    14,
                    878
                ],
                "id": 413594,
                "original_language": "ja",
                "original_title": "劇場版 ソードアート・オンライン -オーディナル・スケール-",
                "overview": "In 2026, four years after the infamous Sword Art Online incident, a revolutionary new form of technology has emerged: the Augma, a device that utilizes an Augmented Reality system. Unlike the Virtual Reality of the NerveGear and the Amusphere, it is perfectly safe and allows players to use it while they are conscious, creating an instant hit on the market. The most popular application for the Augma is the game Ordinal Scale, which immerses players in a fantasy role-playing game with player rankings and rewards.  Following the new craze, Kirito's friends dive into the game, and despite his reservations about the system, Kirito eventually joins them. While at first it appears to be just fun and games, they soon find out that the game is not all that it seems...",
                "popularity": 4.319,
                "poster_path": "/2szdEK0Mr0RG0nWGFVTseNQHbnP.jpg",
                "release_date": "2017-02-18",
                "title": "Sword Art Online: The Movie – Ordinal Scale",
                "video": false,
                "vote_average": 7.695,
                "vote_count": 711,
                "character": "Keiko Ayano / Silica (voice)",
                "credit_id": "57e58aa5c3a3681be300150a",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "日高 里菜",
            "Hidaka Rina",
            "رینا هیداکا",
            "رینا هیداکای"
        ],
        "biography": "Rina Hidaka (日高 里菜, Hidaka Rina, born June 15, 1994) is a Japanese actress and voice actress from Chiba Prefecture. She is affiliated with StarCrew, having been previously with AT Production and Office Osawa. Announced the marriage on January 1, 2024, and her husband Yuma Uchida is also a voice actor.",
        "birthday": "1994-06-15",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.starcrew.co.jp/talent/hidakarina",
        "id": 1116334,
        "imdb_id": "nm2999868",
        "known_for_department": "Acting",
        "name": "Rina Hidaka",
        "place_of_birth": "Chiba, Japan",
        "popularity": 0.9115,
        "profile_path": "/7JupZGvqcq4dRxiTKpPxzg8NUS4.jpg"
    }
}