{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2clBxxclZJ4OK1xzhmCCXHEfy3r.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 759,
                "original_language": "en",
                "original_title": "Gentlemen Prefer Blondes",
                "overview": "Lorelei Lee is a beautiful showgirl engaged to be married to the wealthy Gus Esmond, much to the disapproval of Gus' rich father, Esmond Sr., who thinks that Lorelei is just after his money. When Lorelei goes on a cruise accompanied only by her best friend, Dorothy Shaw, Esmond Sr. hires Ernie Malone, a private detective, to follow her and report any questionable behavior that would disqualify her from the marriage.",
                "popularity": 2.362,
                "poster_path": "/fDozhst5HVJJcd3BM8ZOsKniO7Q.jpg",
                "release_date": "1953-07-14",
                "title": "Gentlemen Prefer Blondes",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1011,
                "character": "Dorothy Shaw",
                "credit_id": "52fe4272c3a36847f801f48d",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ernestine Jane Geraldine Russell",
            "جین راسل"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nJane Russell (June 21, 1921 – February 28, 2011) was an American film actress and was one of Hollywood's leading sex symbols in the 1940s and 1950s.\n\nRussell moved from the Midwest to California, where she had her first film role in 1943 with The Outlaw. In 1947, Russell delved into music before returning to films. After starring in multiple films in the 1950s, Russell again returned to music while completing several other films in the 1960s. She starred in over 20 films throughout her career.\n\nRussell married three times and adopted three children and, in 1955, founded the World Adoption International Fund. For her achievements in film, she received several accolades including having her hand and foot prints immortalized in the forecourt of Grauman's Chinese Theatre and a star on the Hollywood Walk of Fame.\n\nDescription above from the Wikipedia article Jane Russell, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1921-06-21",
        "deathday": "2011-02-28",
        "gender": 1,
        "homepage": null,
        "id": 11165,
        "imdb_id": "nm0000066",
        "known_for_department": "Acting",
        "name": "Jane Russell",
        "place_of_birth": "Bemidji, Minnesota, USA",
        "popularity": 0.416,
        "profile_path": "/i0EFJW983yikjX3CNL3wU8iqmNU.jpg"
    }
}