{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2clBxxclZJ4OK1xzhmCCXHEfy3r.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 759,
                "original_language": "en",
                "original_title": "Gentlemen Prefer Blondes",
                "overview": "Lorelei Lee is a beautiful showgirl engaged to be married to the wealthy Gus Esmond, much to the disapproval of Gus' rich father, Esmond Sr., who thinks that Lorelei is just after his money. When Lorelei goes on a cruise accompanied only by her best friend, Dorothy Shaw, Esmond Sr. hires Ernie Malone, a private detective, to follow her and report any questionable behavior that would disqualify her from the marriage.",
                "popularity": 2.362,
                "poster_path": "/fDozhst5HVJJcd3BM8ZOsKniO7Q.jpg",
                "release_date": "1953-07-14",
                "title": "Gentlemen Prefer Blondes",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1011,
                "character": "Henry Spofford III",
                "credit_id": "52fe4272c3a36847f801f49d",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "George Karl Wentzlaff",
            "George \"Foghorn\" Winslow"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nGeorge \"Foghorn\" Winslow (May 3, 1946 – June 13, 2015), born George Karl Wentzlaff, was an American child actor of the 1950s known for his stentorian voice and deadpan demeanor. He appeared in several films, some opposite such stars as Marilyn Monroe, Cary Grant, Ginger Rogers, Dean Martin, and Jerry Lewis. In the late 1950s, he retired from acting.\n\nNicknamed \"Foghorn\" for his raspy voice as a slender child with dark blond hair and deep blue eyes, Wentzlaff, a Los Angeles native, broke into the entertainment business on Art Linkletter's family-oriented radio program, People are Funny. Asked his name by Linkletter, the youngster said: \"George Wentzlaff, but I'd rather be Casey Jones\", with a delivery that cracked up Linkletter and the audience.\n\nCary Grant, who heard the show and was impressed with Wentzlaff's unusual voice and comedy instincts, introduced him to director Norman Taurog, leading to his roles in Grant's films, Room for One More (1952) and Monkey Business (also 1952), which co-stars Ginger Rogers and Marilyn Monroe, making her first movie appearance with platinum-blond hair. Next up was Gentlemen Prefer Blondes (1953), in which Wentzlaff — playing Henry Spofford III, Monroe's young admirer — stole scenes from the actress, including his line about her possessing a \"certain animal magnetism\". In the comedy Mister Scoutmaster (1953), he traded barbs with Clifton Webb, and he had a small role in the musical comedy Artists and Models (1955), with Dean Martin, Jerry Lewis, Dorothy Malone and newcomer Shirley MacLaine in what Aurora called Wentzlaff's \"last 'good' movie.\".\n\nBy the age of 12, Winslow retired from the screen.",
        "birthday": "1946-05-03",
        "deathday": "2015-06-13",
        "gender": 2,
        "homepage": null,
        "id": 11171,
        "imdb_id": "nm0935487",
        "known_for_department": "Acting",
        "name": "George Winslow",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.1028,
        "profile_path": "/3q1SCYKJmXnnCBq6f7Qc03jNjdG.jpg"
    }
}