{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xACx8htL9Ubz1qGe0gU2ggHonxV.jpg",
                "genre_ids": [
                    12,
                    14
                ],
                "id": 672,
                "original_language": "en",
                "original_title": "Harry Potter and the Chamber of Secrets",
                "overview": "Cars fly, trees fight back, and a mysterious house-elf comes to warn Harry Potter at the start of his second year at Hogwarts. Adventure and danger await when bloody writing on a wall announces: The Chamber Of Secrets Has Been Opened. To save Hogwarts will require all of Harry, Ron and Hermione’s magical abilities and courage.",
                "popularity": 23.5938,
                "poster_path": "/sdEOH0992YZ0QSxgXNIGLq1ToUi.jpg",
                "release_date": "2002-11-13",
                "title": "Harry Potter and the Chamber of Secrets",
                "video": false,
                "vote_average": 7.706,
                "vote_count": 22826,
                "character": "Young Hagrid",
                "credit_id": "58f31ca79251413d7200d5c1",
                "order": 70
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/vbk5CfaAHOjQPSAcYm6AoRRz2Af.jpg",
                "genre_ids": [
                    12,
                    14
                ],
                "id": 673,
                "original_language": "en",
                "original_title": "Harry Potter and the Prisoner of Azkaban",
                "overview": "Year three at Hogwarts means new fun and challenges as Harry learns the delicate art of approaching a Hippogriff, transforming shape-shifting Boggarts into hilarity and even turning back time. But the term also brings danger: soul-sucking Dementors hover over the school, an ally of the accursed He-Who-Cannot-Be-Named lurks within the castle walls, and fearsome wizard Sirius Black escapes Azkaban. And Harry will confront them all.",
                "popularity": 22.6761,
                "poster_path": "/aWxwnYoe8p2d2fcxOqtvAtJ72Rw.jpg",
                "release_date": "2004-05-31",
                "title": "Harry Potter and the Prisoner of Azkaban",
                "video": false,
                "vote_average": 8.011,
                "vote_count": 22394,
                "credit_id": "52fe4268c3a36847f801c163",
                "department": "Crew",
                "job": "Stunts"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nMartin Christopher Bayfield (born 21 December 1966) is an English former rugby union footballer who played lock forward for Northampton Saints, Bedford Blues and England, gaining 31 England and 3 Lions caps.\n\nBayfield was born in Bedford. The 208 cm (6 ft 10in) tall policeman made his England debut in 1991, and although he was omitted from the 1991 World Cup squad, was a part of the 1992 Five Nations Grand Slam winning side. He went on the 1993 British Lions tour to New Zealand and was part of the 1995 World Cup squad. He would play 18 times partnering Martin Johnson. His final appearance for England came in the 1996 Five Nations match against Wales.\n\nHis last game was against Gloucester in February 1998, a neck injury sustained in training a few days later forced him to retire.\n\nSince retirement, Bayfield has worked as a journalist, an after dinner speaker and has since appeared in the Harry Potter films playing the half-giant Hagrid, normally played by Robbie Coltrane, in longer shots which need to emphasise Hagrid's height. He presents the NFL and World's Strongest Man coverage on UK Channel Five and works as a rugby correspondent on BBC Radio 5 Live. He has also been involved as a presenter in ITV's coverage of the 2007 Rugby World Cup as well as currently presenting ITV's Guinness Premiership higlights. He is actively involved with charity, and is an Honorary President of Wooden Spoon - the rugby charity that supports disadvantaged children and young people.\n\nHe also appeared in Harry Potter and the Chamber of Secrets, as a young Rubeus Hagrid, and has also been a stuntman on all the Harry Potter films.\n\nBayfield also played Rugby Player 2 in an episode of New Tricks on BBC1 (first shown on 1 September 2008).\n\nMartin is represented by sports marketing agency ENS Ltd.\n\nDescription above from the Wikipedia article martin Bayfield, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1966-12-21",
        "deathday": null,
        "gender": 0,
        "homepage": null,
        "id": 11177,
        "imdb_id": "nm0062992",
        "known_for_department": "Acting",
        "name": "Martin Bayfield",
        "place_of_birth": "Bedford",
        "popularity": 0.0986,
        "profile_path": null
    }
}