{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2clBxxclZJ4OK1xzhmCCXHEfy3r.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 759,
                "original_language": "en",
                "original_title": "Gentlemen Prefer Blondes",
                "overview": "Lorelei Lee is a beautiful showgirl engaged to be married to the wealthy Gus Esmond, much to the disapproval of Gus' rich father, Esmond Sr., who thinks that Lorelei is just after his money. When Lorelei goes on a cruise accompanied only by her best friend, Dorothy Shaw, Esmond Sr. hires Ernie Malone, a private detective, to follow her and report any questionable behavior that would disqualify her from the marriage.",
                "popularity": 2.362,
                "poster_path": "/fDozhst5HVJJcd3BM8ZOsKniO7Q.jpg",
                "release_date": "1953-07-14",
                "title": "Gentlemen Prefer Blondes",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1011,
                "character": "Gus Esmond",
                "credit_id": "52fe4272c3a36847f801f499",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Tom Noonan",
            "Noonan and Marshall\t",
            "Thomas Noone"
        ],
        "biography": "Tommy Noonan (born Thomas Noone ( April 29, 1921 – April 24, 1968) was a comedy genre film performer, screenwriter and producer. He acted in a 65 projects including high-profile films as well as B movies from the 1940s through the 1960s and he made several tv appearances also; he is best known for his supporting performances as Gus Esmond, wealthy fiancé of Lorelei Lee (Marilyn Monroe), in Gentlemen Prefer Blondes (1953), and as musician Danny McGuire in A Star Is Born (1954). In addition to starring alongside Marilyn Monroe, Noonan is also noted for having played love interests to Jayne Mansfield in Promises..... Promises! (1963) and Mamie Van Doren in 3 Nuts in Search of a Bolt (Which he also directed) (1964), making him the only actor to play love interests to the 3 former who were dubbed the 3 Ms of Golden Age Hollywood.",
        "birthday": "1922-04-29",
        "deathday": "1968-04-24",
        "gender": 2,
        "homepage": null,
        "id": 11170,
        "imdb_id": "nm0634749",
        "known_for_department": "Acting",
        "name": "Tommy Noonan",
        "place_of_birth": "Bellingham, Washington, USA",
        "popularity": 0.6704,
        "profile_path": "/5UppgieZgwF2LimxjUM5ml0bTgB.jpg"
    }
}