{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gTO4GgaQDn5msqOvX6LeTj6H7CR.jpg",
                "genre_ids": [
                    80,
                    18,
                    28
                ],
                "id": 13939,
                "original_language": "en",
                "original_title": "Death Wish",
                "overview": "After his wife is murdered by street punks, a pacifistic New York City architect becomes a one-man vigilante squad, prowling the streets for would-be muggers after dark.",
                "popularity": 3.1347,
                "poster_path": "/rNksI6UiuTgLtBy69WvKT1PrG0R.jpg",
                "release_date": "1974-07-24",
                "title": "Death Wish",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 893,
                "character": "Alma Lee Brown",
                "credit_id": "6303796ddfe31d007b82fb4c",
                "order": 17
            },
            {
                "adult": false,
                "backdrop_path": "/dfkE2LppPbJ1qUzi3tdND5iuMFp.jpg",
                "genre_ids": [
                    35,
                    80
                ],
                "id": 10607,
                "original_language": "en",
                "original_title": "Don't Be a Menace to South Central While Drinking Your Juice in the Hood",
                "overview": "When Ashtray moves to South Central L.A. to live with his father (who appears to be the same age he is) and grandmother (who likes to talk tough and smoke reefer), he falls in with his gang-banging cousin Loc Dog, who along with the requisite pistols and Uzi carries a thermo-nuclear warhead for self-defense. Will Ashtray be able to keep living the straight life?",
                "popularity": 6.7019,
                "poster_path": "/HZQBF7JDd2e9p4rPSbSHuWHaCC.jpg",
                "release_date": "1996-01-12",
                "title": "Don't Be a Menace to South Central While Drinking Your Juice in the Hood",
                "video": false,
                "vote_average": 7.03,
                "vote_count": 1402,
                "character": "Loc Dog's Grandma",
                "credit_id": "5761d820c3a3682f2300027e",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nHelen Dorothy Martin (July 23, 1909 – March 25, 2000) was an American actress of stage and television who is perhaps most well known for her role in the sitcom 227 as Marla Gibbs' neighbor Pearl.\n\nMartin was born in St. Louis, Missouri, the daughter of Amanda Frankie (née Fox) and William Martin, a minister.\n\nMartin was a Broadway character actress for many decades, debuting in Orson Welles' production of Native Son in 1941. She appeared in at least a dozen Broadway shows including Jean Genet's The Blacks, Raisin from 1973 to 1975, Ossie Davis' Purlie Victorious (and later the musical version, which was called Purlie), The Amen Corner and Tennessee Williams' Period of Adjustment. She was an original member of the American Negro Theater.\n\nShe first became famous later in life for her guest role as Wanda on the television series Good Times, and later as the wisecracking neighbor Pearl Shay on the television sitcom 227. She also played on the short-run sitcoms Baby, I'm Back (as mother in-law, Luzelle) and That's My Mama; as Loc Dog's grandma, Don't Be a Menace to South Central While Drinking Your Juice in the Hood (1996), the matronly grandmother Mama Doll in the 1998 film Bulworth, and the no-nonsense grandmother in the film Hollywood Shuffle. Helen Martin died of a heart attack on March 25, 2000.\n\nDescription above from the Wikipedia article Helen Martin, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1909-07-23",
        "deathday": "2000-03-25",
        "gender": 1,
        "homepage": null,
        "id": 111872,
        "imdb_id": "nm0552385",
        "known_for_department": "Acting",
        "name": "Helen Martin",
        "place_of_birth": "St. Louis, Missouri, USA",
        "popularity": 0.472,
        "profile_path": "/vgx3N9pRkJIyw3xCflbbwQzw0hG.jpg"
    }
}