{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9eHg5qX7LkjW2Zrejvap2RmFGlD.jpg",
                "genre_ids": [
                    18,
                    36,
                    10752
                ],
                "id": 777,
                "original_language": "fr",
                "original_title": "La Grande Illusion",
                "overview": "A group of French soldiers, including the patrician Captain de Boeldieu and the working-class Lieutenant Maréchal, grapple with their own class differences after being captured and held in a World War I German prison camp. When the men are transferred to a high-security fortress, they must concoct a plan to escape beneath the watchful eye of aristocratic German officer von Rauffenstein, who has formed an unexpected bond with de Boeldieu.",
                "popularity": 3.2904,
                "poster_path": "/lWg41zE0FVixkNsFgxnlRyvDYv9.jpg",
                "release_date": "1937-06-04",
                "title": "Grand Illusion",
                "video": false,
                "vote_average": 7.87,
                "vote_count": 736,
                "character": "Le sénégalais",
                "credit_id": "5aa8640cc3a36839ce028e05",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "حبيب بنجليا"
        ],
        "biography": "Habib Benglia, born August 25, 1895 in Oran (Algeria) and died December 2, 1960 at the Hôtel-Dieu hospital in Paris 4th, is a French actor and dancer. He was the first black French artist to experience such success in the 1920s. Married, he was the father of two children.\n\nBorn to caravan parents, originally from Mali (then called French Sudan), he lived his entire childhood in Timbuktu, before arriving, with his parents, in mainland France to deliver camels to the acclimatization garden where the exhibition was held. colonial \"Les Nègres\", in 1912. He decided to stay in France and began his career in 1913, both in theater and in cinema, after having met the actress and dancer Régine Flory, who introduced him to Cora Laparcerie, director of the Théâtre de la Renaissance. Mobilized for the First World War, he then joined Firmin Gémier's theater company which ended up at the Théâtre National de l'Odéon with Gaston Baty in 1922. Benglia was thus the first black to play roles from the classical repertoire, and he found himself also performing the title role of The Emperor Jones at the Odéon in 19234, at the age of 27. However, he explored other aspects of his art: dance, revues, vaudeville... Theater in all its forms remained his passion for more than 36 years. It was primarily through theater that he played a major role in Parisian cultural life between the wars.\n\nBenglia was also interested in cinema, but French cinema hardly offered him good roles. He is most often found in small roles in second-rate films, but also in a few colonial propaganda films, sometimes in ridiculously exotic roles. A few exceptions: Benglia stars in “Daïnah La Métisse”, he has interesting passages in “Sola ou Les Mystères de Paris”, then he makes a brief appearance in “Les Enfants du Paradis”, a film in which he only worked two days (December 5 and 6, 1943). In total, he appeared in around sixty films. It was the range of his deep voice which was most remarkable and which determined the roles entrusted to him.\n\nHe died on December 2, 1960 at the Hôtel-Dieu hospital in Paris.",
        "birthday": "1895-08-25",
        "deathday": "1960-12-02",
        "gender": 2,
        "homepage": "http://www.spla.pro/fr/fiche.personnes.spla.4127.html",
        "id": 1118636,
        "imdb_id": "nm0071051",
        "known_for_department": "Acting",
        "name": "Habib Benglia",
        "place_of_birth": "Oran, Algeria",
        "popularity": 0.0071,
        "profile_path": "/8zmgr2NE5NkVcRUvW7EcnlXa75H.jpg"
    }
}