{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4VgyburZo88ocO1aSRFm0i5H5VX.jpg",
                "genre_ids": [
                    35
                ],
                "id": 760,
                "original_language": "fr",
                "original_title": "Les Aventures de Rabbi Jacob",
                "overview": "In this riot of frantic disguises and mistaken identities, Victor Pivert, a blustering, bigoted French factory owner, finds himself taken hostage by Slimane, an Arab rebel leader. The two dress up as rabbis as they try to elude not only assasins from Slimane's country, but also the police, who think Pivert is a murderer. Pivert ends up posing as Rabbi Jacob, a beloved figure who's returned to France for his first visit after 30 years in the United States. Adding to the confusion are Pivert's dentist-wife, who thinks her husband is leaving her for another woman, their daughter, who's about to get married, and a Parisian neighborhood filled with people eager to celebrate the return of Rabbi Jacob.",
                "popularity": 2.3913,
                "poster_path": "/oYuCFxS2BGCHNGuv9No0GoP2DZf.jpg",
                "release_date": "1973-10-17",
                "title": "The Mad Adventures of Rabbi Jacob",
                "video": false,
                "vote_average": 7.399,
                "vote_count": 1011,
                "character": "Moishe Schmoll",
                "credit_id": "52fe4272c3a36847f801f54b",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/1XqIhsqnAozznGhxlGdI0GPcCro.jpg",
                "genre_ids": [
                    18,
                    10752
                ],
                "id": 423,
                "original_language": "en",
                "original_title": "The Pianist",
                "overview": "The true story of pianist Władysław Szpilman's experiences in Warsaw during the Nazi occupation. When the Jews of the city find themselves forced into a ghetto, Szpilman finds work playing in a café; and when his family is deported in 1942, he stays behind, works for a while as a laborer, and eventually goes into hiding in the ruins of the war-torn city.",
                "popularity": 8.4545,
                "poster_path": "/2hFvxCCWrTmCYwfy7yum0GKRi3Y.jpg",
                "release_date": "2002-09-17",
                "title": "The Pianist",
                "video": false,
                "vote_average": 8.381,
                "vote_count": 9679,
                "character": "Rubenstein",
                "credit_id": "5783c97ec3a3681795000191",
                "order": 24
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jean Herbert",
            "Jean Hébert",
            "Popek",
            "Judka Herpstu"
        ],
        "biography": "Popeck (born Judka Herpstu; 18 May 1936) is a French actor and stand-up comedian.\n\nThe son of Jewish immigrants from Poland and Romania, Judka Herpstu was born in Paris. He was among the children saved from the Holocaust by the OSE, but his mother was murdered in Auschwitz. He studied acting at the Cours Simon and started his career on stage under the name Jean Herbert.\n\nIn 1968, Herpstu created the character of Popeck, a grumpy Eastern-European immigrant dressed in a 3-piece suit, wearing a bowler hat and speaking French with a strong Yiddish accent. Sketches featuring Popeck made Herpstu known to the larger public, and the actor identified with his character so far as to finally adopt the name Popeck for himself in 1978.\n\nIn addition to his work on stage, Popeck has acted in movies. He had a small role in Roman Polanski's The Pianist.\n\nSource: Article \"Popeck\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1935-05-18",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 11193,
        "imdb_id": "nm0691201",
        "known_for_department": "Acting",
        "name": "Popeck",
        "place_of_birth": "Paris, France",
        "popularity": 0.1151,
        "profile_path": "/eBKbS1aHfIeYTE76xZ0L6uK1stY.jpg"
    }
}