{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7EazpcvoCfNZZysgljUAkQCBvW.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 614917,
                "original_language": "en",
                "original_title": "King Richard",
                "overview": "The story of how Richard Williams served as a coach to his daughters Venus and Serena, who will soon become two of the most legendary tennis players in history.",
                "popularity": 5.0956,
                "poster_path": "/2dfujXrxePtYJPiPHj1HkAFQvpu.jpg",
                "release_date": "2021-11-18",
                "title": "King Richard",
                "video": false,
                "vote_average": 7.622,
                "vote_count": 2673,
                "character": "PV CC Tennis Pro",
                "credit_id": "6199f24c71458f004298ddad",
                "order": 19
            },
            {
                "adult": false,
                "backdrop_path": "/fnTrZiCRXCk3I6mnYvJwiMZf6pF.jpg",
                "genre_ids": [
                    18
                ],
                "id": 524348,
                "original_language": "en",
                "original_title": "The Report",
                "overview": "The story of Daniel Jones, lead investigator for the US Senate’s sweeping study into the CIA's Detention and Interrogation Program, which was found to be brutal, immoral and ineffective. With the truth at stake, Jones battled tirelessly to make public what many in power sought to keep hidden.",
                "popularity": 3.9901,
                "poster_path": "/sG5NI6TMNR9ftOdTIXmG0hrBYSY.jpg",
                "release_date": "2019-09-12",
                "title": "The Report",
                "video": false,
                "vote_average": 7.045,
                "vote_count": 1086,
                "character": "Senator Martin Heinrich",
                "credit_id": "5d7e3ecaf0647c00109d282e",
                "order": 42
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Noah Bean (born 1978) is an American actor best known for his role as David Connor on the FX legal drama Damages and as Ryan Fletcher on the 2010 The CW series Nikita as David Connor on the FX legal drama Damages and his leading performance in the independent film The Pill.\n\nPersonal life\n\nBean was born in Boston, Massachusetts. As a child, Bean attended Pine Point School and The Williams School in Connecticut. An only child, he describes himself as being so quiet and shy that his school would phone his parents asking whether anything was wrong at home: \"I was deathly shy and basically scared of people in general.\"  In high school his mother encouraged him to become involved in drama, which he says helped him open up, \"I found when I had a script in my hand I could speak.\"[6] He later attended Boston University's College of Fine Arts before he was offered his first theatre role by director Michael Ritchie.\n\nBean hails from Mystic, Connecticut, although he has lived and worked in Los Angeles and is currently living in New York. He is friends with actor Seth Gabel and director Jack Bender and also says he has come to be good friends with Damages co-actor and on-screen fiancée Rose Byrne.\n\nDescription above from the Wikipedia article Noah Bean, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1978-08-20",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 111945,
        "imdb_id": "nm0063800",
        "known_for_department": "Acting",
        "name": "Noah Bean",
        "place_of_birth": "Boston, Massachusetts, USA",
        "popularity": 0.6042,
        "profile_path": "/o1aKAllaQWQ1xrcBlcOpUJKn8AB.jpg"
    }
}