{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4VgyburZo88ocO1aSRFm0i5H5VX.jpg",
                "genre_ids": [
                    35
                ],
                "id": 760,
                "original_language": "fr",
                "original_title": "Les Aventures de Rabbi Jacob",
                "overview": "In this riot of frantic disguises and mistaken identities, Victor Pivert, a blustering, bigoted French factory owner, finds himself taken hostage by Slimane, an Arab rebel leader. The two dress up as rabbis as they try to elude not only assasins from Slimane's country, but also the police, who think Pivert is a murderer. Pivert ends up posing as Rabbi Jacob, a beloved figure who's returned to France for his first visit after 30 years in the United States. Adding to the confusion are Pivert's dentist-wife, who thinks her husband is leaving her for another woman, their daughter, who's about to get married, and a Parisian neighborhood filled with people eager to celebrate the return of Rabbi Jacob.",
                "popularity": 2.62,
                "poster_path": "/oYuCFxS2BGCHNGuv9No0GoP2DZf.jpg",
                "release_date": "1973-10-17",
                "title": "The Mad Adventures of Rabbi Jacob",
                "video": false,
                "vote_average": 7.401,
                "vote_count": 1012,
                "character": "Salomon, Pivert's driver",
                "credit_id": "52fe4272c3a36847f801f547",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Henri Guybet (born 21 December 1936) is a French actor. He has appeared in more than one hundred films since 1964.\n\nGuybet started his career in dinner theater in the Café de la Gare, alongside Coluche and Miou-Miou in late 1960s. Gérard Oury gave him his first major film role in The Mad Adventures of Rabbi Jacob, where he plays Solomon, the Jewish driver of Louis de Funès. His comic talent explodes shortly after with Georges Lautner in Pas de Problème. In 1978 he got the leading role in the film The Pawn, where he played Bertrand Barabi a \"pawn\" who falls in love for the mother of one of his students, played by Claude Jade. This was his only romantic role and his only lead. In the late 1970s, he made several \"nanars\" and became a second recurring role. In theater, he became a big name in boulevard theater.\n\nHis son is also an actor.\n\nSource: Article \"Henri Guybet\" from Wikipedia in english, licensed under CC-BY-SA 3.0.",
        "birthday": "1936-12-21",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 11192,
        "imdb_id": "nm0349869",
        "known_for_department": "Acting",
        "name": "Henri Guybet",
        "place_of_birth": "Paris, France",
        "popularity": 0.2081,
        "profile_path": "/cG7AebtvUjv4u1x1A4w8wwmnM01.jpg"
    }
}