{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/oqblGh9vRXFBV9Auu8St5i50njr.jpg",
                "genre_ids": [
                    16,
                    10751,
                    12,
                    14
                ],
                "id": 323661,
                "original_language": "fr",
                "original_title": "Mune, le gardien de la lune",
                "overview": "When a faun named Mune becomes the Guardian of the Moon, little did he had unprepared experience with the Moon and an accident that could put both the Moon and the Sun in danger, including a corrupt titan named Necross who wants the Sun for himself and placing the balance of night and day in great peril. Now with the help of a wax-child named Glim and the warrior, Sohone who also became the Sun Guardian, they go out on an exciting journey to get the Sun back and restore the Moon to their rightful place in the sky.",
                "popularity": 2.5346,
                "poster_path": "/fWjm8AH9YqkRUR2yf4y1mDIvj0O.jpg",
                "release_date": "2015-02-05",
                "title": "Mune: Guardian of the Moon",
                "video": false,
                "vote_average": 7.279,
                "vote_count": 571,
                "character": "Glim (voice)",
                "credit_id": "56cb7fbd925141245a000069",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Izia Higelin",
            "이지아 이즐랭",
            "Izïa"
        ],
        "biography": "Izïa Higelin (born 24 September 1990), more commonly known by her stage name Izia, is a French rock singer, guitarist and actress. Her most recent album, Citadelle, was released in 2019.\n\nIzïa was born in Paris on 24 September 1990 to Jacques Higelin, a famous French singer of Belgian and Alsatian descent, and Aziza Zakine, a dancer and chorist of Tunisian descent. She comes from a family of artists; beside her father and mother, her two half brothers are Arthur H and Kên Higelin. She was influenced by music from an early age when her father introduced her to jazz and British pop music. At the age of seven, she formed a duo with her father; she provided the vocals while he played piano.\n\nWhen she was 13 Izïa started to take an interest in rock bands such as Nirvana and Led Zeppelin. At this time, she wrote her first song, titled \"Hey Bitch\", which later featured on her debut album.\n\nA year later she met Caravan Palace bassist Antoine Toustou through her parents and the pair played their first live show in 2004. Six months later, her backing group was expanded to three people when Izïa and Toustou were joined by Sébastien Hoog and Vincent Polycarpe. She left school at the age of 15 in order to concentrate on a career in music.\n\nIn 2006, Izïa released her first extended play and the following year she opened for Iggy & the Stooges at the Printemps de Bourges music festival. She consequently embarked on a tour of France, which consisted of over thirty dates. On 8 June 2009, her eponymous debut studio album, Izia was released in France. In some reviews, the album garnered comparisons to Janis Joplin. The album performed reasonably well in the French albums chart, achieving a peak position of #31 and staying in the top 100 for 17 consecutive weeks.\n\nIzïa has since released three more albums that reached the charts in France: So Much Trouble (2011), La Vague (2015), and Citadelle (2019). In 2021, Izïa contributed a cover of the Metallica song \"My Friend of Misery\" to the charity tribute album The Metallica Blacklist.\n\nIzïa made her film debut in 2012, appearing in the film Bad Girl under her full name, Izia Higelin. She was nominated for several awards for her performance in the film, including the César Award for Most Promising Actress. Since then she has continued to act sporadically, appearing in the 2015 film Summertime and playing Camille Claudel in the 2017 film Rodin.\n\nSource: Article \"Izïa\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1990-09-24",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.iziamusic.com/",
        "id": 1121169,
        "imdb_id": "nm3495920",
        "known_for_department": "Acting",
        "name": "Izïa Higelin",
        "place_of_birth": "Paris, France",
        "popularity": 0.1768,
        "profile_path": "/bHt0lK9qNQLXhwRSYfp8Yt6i0kb.jpg"
    }
}