{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qodtpClU5xHfaTjQBPnt37OGRBd.jpg",
                "genre_ids": [
                    35
                ],
                "id": 761,
                "original_language": "fr",
                "original_title": "L'Aile ou la Cuisse",
                "overview": "Charles Duchemin, a well-known gourmet and publisher of a famous restaurant guide, is waging a war against fast food entrepreneur Tri- catel to save the French art of cooking. After having agreed to appear on a talk show to show his skills in naming food and wine by taste, he is confronted with two disasters: his son wants to become a clown rather than a restaurant tester and he, the famous Charles Duchemin, has lost his taste!",
                "popularity": 2.7626,
                "poster_path": "/ywkIu5l3iAgPZvLFEVBDYxLouH8.jpg",
                "release_date": "1976-10-27",
                "title": "The Wing or the Thigh?",
                "video": false,
                "vote_average": 7.205,
                "vote_count": 926,
                "character": "Gérard Duchemin",
                "credit_id": "52fe4272c3a36847f801f60d",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/3yZva3ONs7C1kKJ6IVvrZQJCUIj.jpg",
                "genre_ids": [
                    14,
                    35,
                    10402,
                    10749
                ],
                "id": 5590,
                "original_language": "fr",
                "original_title": "Peau d'âne",
                "overview": "A fairy godmother helps a princess disguise herself so she won't have to marry her father.",
                "popularity": 1.816,
                "poster_path": "/kSODEFNpTBCOJNHhsbwrwvH0Uvd.jpg",
                "release_date": "1970-12-20",
                "title": "Donkey Skin",
                "video": false,
                "vote_average": 7.223,
                "vote_count": 532,
                "character": "Chanteur",
                "credit_id": "6737b284e05823bd9c7c83e5",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Michel Colucci"
        ],
        "biography": "Michel Gérard Joseph Colucci (28 October 1944 – 19 June 1986), better known under his stage name Coluche, was a French stage comedian and cinema actor. He adopted Coluche as a stage name at age 26, when he began his entertainment career. He became known for his irreverent attitude towards politics and the establishment, and he incorporated this into much of his material. He was one of the first major comedians to regularly use profanities as a source of humor on French television. He also founded the charity \"Les Restaurants du Coeur\" which still provides free meals and other products to people in need.\n\nColucci was born on 28 October 1944, just weeks after the Liberation of Paris, in a hospital in the 14th arrondissement of the city. His mother, Simone Bouyer (called \"Monette\"), worked as a florist in the Boulevard du Montparnasse. His father, Honorio Colucci, from Casalvieri in Lazio, Italy, was a painter and decorator. His father died in 1947 at age 31 from poliomyelitis; his wife struggled thereafter to raise the young Michel and his sister (Danièle, 18 months older than Michel) on a meagre salary.\n\nColuche showed little promise at school, and left after completing his primary studies (June 1958). He tried various temporary jobs, and had several run-ins with authorities. During this time his mother bought him a guitar, which he taught himself to play. In 1964 he joined the 60th Infantry Regiment de Lons-le-Saunier, but was imprisoned for insubordination. On his return to civilian life, he worked in his mother's florist shop which she had been able to open on rue d'Aligre, and later in a larger shop which she opened near la Gare de Lyon. He found this work dull, and suddenly quit, which caused a long-lasting breach with his mother.\n\nAt the end of the 1960s he tried his luck as a singer in cafes, then turned to comedy.\n\nIn 1969, with Romain Bouteille he was present at the start of the Café de la Gare, meeting place of a group of young comedic actors practically all of whom were to become famous: Patrick Dewaere, Henri Guybet, Miou-Miou, Martin Lamotte, etc. Among the patrons of the Café de la Gare were Georges Moustaki, Raymond Devos, Jean Ferrat, Jacques Brel, Leni Escudero, Pierre Perret and Jean Yanne. Later they were joined by Gérard Lanvin, Renaud, Rufus, Diane Kurys, Coline Serreau, Anémone, Gérard Depardieu, Thierry Lhermitte, Josiane Balasko and Gérard Jugnot.\n\nColuche's first sketch C'est l'histoire d'un mec (It's the story of a guy) was about the difficulties of telling a funny story. He quickly found success, but alcohol problems forced him to leave the group.\n\nHe went on to found another group, Le vrai chic parisien (The true Parisian chic) and it was then that he met his future wife, Véronique Kantor. They married in 1975 and had two sons, Marius and Romain Colucci. His behaviour and addictions forced him to leave the new group and launch his solo career.\n\nIt was at this point that he began to dress in his well-known outfit of white tennis shoes, blue striped overalls, a bright yellow T-shirt and round glasses. He became famous with his parody of a TV game (Le Schmilblick). He was sacked by the radio stations Europe 1 and Radio Monte Carlo for vulgarity. ...\n\nSource: Article \"Coluche\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1944-10-28",
        "deathday": "1986-06-19",
        "gender": 2,
        "homepage": null,
        "id": 11214,
        "imdb_id": "nm0173354",
        "known_for_department": "Acting",
        "name": "Coluche",
        "place_of_birth": "Paris, France",
        "popularity": 0.3163,
        "profile_path": "/jt3Pb213mNL1TmRTIzaXRoZoL5H.jpg"
    }
}