{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5kgm1kubnGUwhd8oEqKa9lfW2hY.jpg",
                "genre_ids": [
                    18,
                    53
                ],
                "id": 322125,
                "original_language": "fr",
                "original_title": "Un Homme idéal",
                "overview": "A struggling writer finds a shortcut to fame, but a blackmailer threatens to ruin his perfect life.",
                "popularity": 1.6851,
                "poster_path": "/dgmgPPPI3APwLHXRvxaGCWGf3FE.jpg",
                "release_date": "2015-03-18",
                "title": "A Perfect Man",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 680,
                "character": "Self (archive footage)",
                "credit_id": "5c08d19ec3a368252800f616",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Yann Moix (born 31 March 1968) is a French author, film director and television presenter. He is the author of ten novels and the recipient of several literary prizes. He has directed three films. He was a columnist on On n'est pas couché.\n\nYann Moix was born on 31 March 1968 in Nevers, France. He earned a bachelor's degree in Philosophy from the University of Reims Champagne-Ardenne and graduated from the École supérieure de commerce de Reims. He subsequently graduated from Sciences Po.\n\nMoix is the author of several novels. He won the Prix Goncourt du premier roman, as well as the Prix François Mauriac from the Académie Française, for Jubilations vers le ciel in 1996. In 2013, he won the Prix Renaudot for Naissance.\n\nMoix has directed three films, including Podium, which is based on one of his novels. Between 2015 and 2018, Moix was a panellist on On n'est pas couché, a television program. He also writes for the magazine La Règle du Jeu.\n\nIn 2009, Moix signed a petition in support of film director Roman Polanski, calling for his release after Polanski was arrested in Switzerland in relation to his 1977 charge for drugging and raping a 13-year-old girl.\n\nIn 2010, Moix signed a petition against the Gayssot Act created by his friend and Holocaust denier Paul-Éric Blanrue, stating that Robert Faurisson and Serge Thion were \"serious, intelligent, though delirious revisionists\".\n\nIn January 2019, Moix's comments about women over the age of 50 caused outrage on social media in France. In an interview with the French edition of the women's magazine Marie Claire, Moix declared that women in their 50s were “invisible” to him and that he preferred \"younger women's bodies.\" He added that he preferred dating Asian women, particularly if they are Korean, Chinese or Japanese.\n\nIn August 2019, his novel Orléans was published to critical acclaim, but it left critics and the public bewildered about the revelations it contained. The book, despite being presented as a novel, is made to look heavily autobiographical, which lead the public to think that Yann Moix actually endured as a young boy what the protagonist goes through. The book is laced with hate for the narrator's parents, with Moix positioning himself between the lines as a real-life long-suffering victim who finally dares to tell the truth. Following public protests by Moix's parents and younger brother, it was revealed that some of the severe incidents described in the book actually took place between him and his brother, who is not mentioned in the book, with Yann Moix as the tormentor, and that several of the situations depicted were in fact made up or \"heavily exaggerated\". His brother, Alexandre Moix, who is also a writer and film producer and whose first book Yann Moix had apparently tried to block the publication of on the grounds that \"there can only be one Moix, MOI!\" [him], told media that his elder brother \"prefers to serve his own ambition rather than the truth\". He also stated that his older brother should not be a flag-bearer for suffering children, since \"he doesn't care about other people's suffering\". ...\n\nSource: Article \"Yann Moix\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1968-03-31",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 112197,
        "imdb_id": "nm1011749",
        "known_for_department": "Writing",
        "name": "Yann Moix",
        "place_of_birth": "Nevers, Nièvre, France",
        "popularity": 0.0602,
        "profile_path": "/5SHsv4VzdgDCFOBrBhOIE7T3MlS.jpg"
    }
}