{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qodtpClU5xHfaTjQBPnt37OGRBd.jpg",
                "genre_ids": [
                    35
                ],
                "id": 761,
                "original_language": "fr",
                "original_title": "L'Aile ou la Cuisse",
                "overview": "Charles Duchemin, a well-known gourmet and publisher of a famous restaurant guide, is waging a war against fast food entrepreneur Tri- catel to save the French art of cooking. After having agreed to appear on a talk show to show his skills in naming food and wine by taste, he is confronted with two disasters: his son wants to become a clown rather than a restaurant tester and he, the famous Charles Duchemin, has lost his taste!",
                "popularity": 2.7626,
                "poster_path": "/ywkIu5l3iAgPZvLFEVBDYxLouH8.jpg",
                "release_date": "1976-10-27",
                "title": "The Wing or the Thigh?",
                "video": false,
                "vote_average": 7.205,
                "vote_count": 926,
                "character": "Marguerite",
                "credit_id": "52fe4272c3a36847f801f619",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/g1DJxf3aSViA9QrlQjXNFtqg3M.jpg",
                "genre_ids": [
                    35
                ],
                "id": 2798,
                "original_language": "fr",
                "original_title": "Oscar",
                "overview": "This film originated as a play in Paris. The story focuses on the one-day adventures of Bertrand Barnier played with a genius of French cinema, Louis de Funes. In the same morning he learns that his daughter is pregnant, an employee stole a large amount of money from his company, his maid is about to resign in order to marry a wealthy neighbor and his body builder is interested in marrying his daughter. The seemingly complicated story-line is full of comedy or errors and some of the most hilarious mime scenes of the French cinema.",
                "popularity": 2.5863,
                "poster_path": "/imsP4Vl1UpsLf27DPxX1atIubBB.jpg",
                "release_date": "1967-10-11",
                "title": "Oscar",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 505,
                "character": "Mme Germaine Barnier, épouse de Bertrand",
                "credit_id": "52fe436ec3a36847f8053a2b",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Claude Gensac (1 March 1927 – 27 December 2016) was a French actress. She appeared in more than 70 films and television productions since 1952. Gensac is the oldest nominee to date in the category César Award for Best Supporting Actress, nominated in 2015 for her role as Marthe in the film Lulu femme nue.\n\nIn 1952, Gensac portrayed the character of Evelyne in her first feature film, La Vie d'un homme honnête. She collaborated on a number of films with Louis de Funès, often playing his wife, to international acclaim. She appeared in the series of movies \"Les Gendarmes\" with Louis de Funès. She played De Funès' wife, Josepha Cruchot. After De Funès's death in 1983, Gensac was rarely involved in film, but was active as a theater actress. In 2001 she returned to film in the French version of Absolutely Fabulous, her first film role since 1983. Gensac appeared in over 100 cinema and television films, as well as numerous theater roles. In 2011 she was awarded the Ordre des Arts et des Lettres at the officer grade.\n\nClaude Gensac was married twice: from 1952 to 1954 with the actor Pierre Mondy and from 1958 to 1977 with Henri Chemin, a racer and PR Manager of Ford France with whom she had a son. She died in her sleep on 27 December 2016. She was 89 years old.\n\nSource: Article \"Claude Gensac\" from Wikipedia in english, licensed under CC-BY-SA 3.0.",
        "birthday": "1927-03-01",
        "deathday": "2016-12-27",
        "gender": 1,
        "homepage": null,
        "id": 11217,
        "imdb_id": "nm0312985",
        "known_for_department": "Acting",
        "name": "Claude Gensac",
        "place_of_birth": "Acy-en-Multien, Oise, France",
        "popularity": 0.3665,
        "profile_path": "/sW8Ox9TEy5BvdFM56Dd7C0Rb2Ap.jpg"
    }
}