{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wMzToVniA09xWS0DXSRQiufVvpZ.jpg",
                "genre_ids": [
                    28,
                    16,
                    12,
                    35
                ],
                "id": 374205,
                "original_language": "ja",
                "original_title": "ワンピース　フィルム GOLD",
                "overview": "The glittering Gran Tesoro, a city of entertainment beyond the laws of the government, is a sanctuary for the world’s most infamous pirates, Marines, and filthy rich millionaires. Drawn by dreams of hitting the jackpot, Captain Luffy and his crew sail straight for the gold. But behind the gilded curtains lies a powerful king whose deep pockets and deeper ambitions spell disaster for the Straw Hats and the New World alike.",
                "popularity": 3.0728,
                "poster_path": "/9PgiOFTLZXP7emlwcIt0yRasJ9h.jpg",
                "release_date": "2016-07-23",
                "title": "One Piece Film: GOLD",
                "video": false,
                "vote_average": 7.225,
                "vote_count": 507,
                "character": "Koala (voice)",
                "credit_id": "587fab40c3a36854f800256a",
                "order": 17
            },
            {
                "adult": false,
                "backdrop_path": "/5lAMQMWpXMsirvtLLvW7cJgEPkU.jpg",
                "genre_ids": [
                    16,
                    18,
                    10749
                ],
                "id": 378064,
                "original_language": "ja",
                "original_title": "映画 聲の形",
                "overview": "Shouya Ishida starts bullying the new girl in class, Shouko Nishimiya, because she is deaf. But as the teasing continues, the rest of the class starts to turn on Shouya for his lack of compassion. When they leave elementary school, Shouko and Shouya do not speak to each other again... until an older, wiser Shouya, tormented by his past behaviour, decides he must see Shouko once more. He wants to atone for his sins, but is it already too late...?",
                "popularity": 9.0043,
                "poster_path": "/tuFaWiqX0TXoWu7DGNcmX3UW7sT.jpg",
                "release_date": "2016-09-17",
                "title": "A Silent Voice: The Movie",
                "video": false,
                "vote_average": 8.383,
                "vote_count": 4217,
                "character": "Miyako Ishida (voice)",
                "credit_id": "5f3c986c8dbc330034a771c7",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Юкино Сацуки",
            "井上由起",
            "Yuki Inoue",
            "雪野 五月",
            "雪乃 五月",
            "ساتسوکی یوکینو",
            "ساتسوکی یوكينو"
        ],
        "biography": "Satsuki Yukino (ゆきの さつき, Yukino Satsuki, previously 雪乃 五月, 雪野 五月), real name Yuki Inoue (井上 由起, Inoue Yuki), born May 25, 1970, is a popular Japanese voice actress from Ōtsu, Shiga. Yukino is also a singer as part of the Hinata Girls. She was a member of Ken Production until 2016.\n\nYukino's most well-known voice roles include Kagome Higurashi in Inuyasha, Mutsumi Otohime in Love Hina, Yoruichi Shihouin in Bleach, Kaname Chidori in all the Full Metal Panic series, Mion and Shion Sonozaki in Higurashi no Naku Koro ni, Milly Thompson in Trigun and Kira Yukyou in Yu-Gi-Oh! 5D's\n\nDescription above from the Wikipedia article Satsuki Yukino, licensed under CC-BY-SA, full list of contributors on Wikipedia .",
        "birthday": "1970-05-25",
        "deathday": null,
        "gender": 1,
        "homepage": "https://ameblo.jp/yukino-hime/",
        "id": 112205,
        "imdb_id": "nm0950830",
        "known_for_department": "Acting",
        "name": "Satsuki Yukino",
        "place_of_birth": "Otsu, Shiga, Japan",
        "popularity": 1.0452,
        "profile_path": "/fb9LqdOZPNjlXq3uHriBOmIe2WP.jpg"
    }
}