{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qodtpClU5xHfaTjQBPnt37OGRBd.jpg",
                "genre_ids": [
                    35
                ],
                "id": 761,
                "original_language": "fr",
                "original_title": "L'Aile ou la Cuisse",
                "overview": "Charles Duchemin, a well-known gourmet and publisher of a famous restaurant guide, is waging a war against fast food entrepreneur Tri- catel to save the French art of cooking. After having agreed to appear on a talk show to show his skills in naming food and wine by taste, he is confronted with two disasters: his son wants to become a clown rather than a restaurant tester and he, the famous Charles Duchemin, has lost his taste!",
                "popularity": 2.7626,
                "poster_path": "/ywkIu5l3iAgPZvLFEVBDYxLouH8.jpg",
                "release_date": "1976-10-27",
                "title": "The Wing or the Thigh?",
                "video": false,
                "vote_average": 7.205,
                "vote_count": 926,
                "character": "Vittorio",
                "credit_id": "5da38acab84f9400189c6ae5",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Vittorio Caprioli (15 August 1921 – 2 October 1989) was an Italian film actor, film director and screenwriter. He appeared in 109 films between 1946 and 1990, mostly in French productions. He was born and died in Naples, Italy.\n\nCaprioli was born in Naples. Having graduated from the Accademia Nazionale di Arte Drammatica Silvio D'Amico in Rome, he made his stage debut in 1942 in the Carli-Racca company. From 1945, he began his collaboration with the Italian public broadcaster, RAI, often together with Luciano Salce, creating magazine and variety programs. Arriving in 1948 at the Piccolo theatre in Milan, where under the direction of Giorgio Strehler he took part in William Shakespeare's The Tempest. At the beginning of 1950, he was cast alongside Alberto Bonucci and Gianni Cajafa for the Neapolitan Carosello musical theatrical work, directed by Ettore Giannini.\n\nA versatile interpreter, in 1950 he founded, with Bonucci and Franca Valeri the Teatro dei Gobbi, which proposed a subtly satirical type of show. In 1960, he married Valeri with whom he presented plays. They divorced in 1974.\n\nHe appeared in cinema as a character actor and made his directorial debut in 1961 with Lions In the Sun, which was later selected to enter the list of the 100 Italian films to be saved.\n\nHe followed this with Paris, My Love and then a segment of I cuori infranti which was shown as part of a retrospective on Italian comedy at the 67th Venice International Film Festival. The Splendors and Miseries of Madame Royale in 1970 was generally considered to be his best film.\n\nHe continued to appear on stage in between his films and was occasionally tempted by television, where he began his career in 1959, but he never really loved the small screen (\"I suffer more than anything because of the absence of the public, which I consider an integral and irreplaceable part of the show in which I participate\"). In the Sixties he acted in Village Wooing, directed by Antonello Falqui, and in 1972 he let himself be tempted by a television variety show, which he wrote and interpreted, Una Serata con Vittorio Caprioli.\n\nIn his last years he returned to theater interpreting, among others, Don Marzio in Carlo Goldoni's Bottega del caffè, The Sunshine Boys by Neil Simon paired with Mario Carotenuto, and Capocomico in Luigi Pirandello's Six Characters in Search of an Author. During the rehearsals of a interpretation of Napoli Milionaria, he died suddenly at the age of 68, in a room of one of the famous hotels on the promenade of Naples, struck down by a heart attack.\n\nSource: Article \"Vittorio Caprioli\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1921-08-15",
        "deathday": "1989-10-02",
        "gender": 2,
        "homepage": null,
        "id": 11223,
        "imdb_id": "nm0135671",
        "known_for_department": "Acting",
        "name": "Vittorio Caprioli",
        "place_of_birth": "Napoli, Campania, Italia",
        "popularity": 0.3389,
        "profile_path": "/9N1v5ihkkOcuH9gBIEtfItpXjHK.jpg"
    }
}