{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xkaeirZBfs9nfz2TJoFHxyOLCcC.jpg",
                "genre_ids": [
                    18
                ],
                "id": 22683,
                "original_language": "en",
                "original_title": "Gifted Hands: The Ben Carson Story",
                "overview": "Gifted Hands: The Ben Carson Story is a movie based on the life story of world-renowned neurosurgeon Ben Carson from 1961 to 1987.",
                "popularity": 7.4794,
                "poster_path": "/4NxxtiqezjUmUxoDTOjO5FeJvFt.jpg",
                "release_date": "2009-02-07",
                "title": "Gifted Hands: The Ben Carson Story",
                "video": false,
                "vote_average": 7.8,
                "vote_count": 744,
                "character": "Hospital Visitor (uncredited)",
                "credit_id": "5f3f1edc19ab5900351e08e9",
                "order": 56
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Penny Gibbs is an actress in the Detroit area. She just completed a\n\nwonderful supporting role in the feature film Cedar Rapids last in\n\nwhich her character was directly involved with Ed Helms, Mike O'Malley,\n\nAnne Heche, John C Reilly among others for the core of the movie. She\n\ncan also be seen in a Ziebart commercial, a Harley Home Improvement commercial, a Trident layers commercial and a Baker College commercial where she had the lead in all.\n\nShe is usually cast as the loving mother/wife/friend types but also\n\nreally enjoys playing over the top roles with a bit of an edge.\n\nHer acting teacher describes her as an \"emotional actress with a\n\nsensitivity and depth of emotion\" and she usually finds that directors\n\nwant to make her cry!\n\nHer role in a short called Oily Pen Stuff for the Sundance Film\n\nFestival was hailed by the director who told us \"Sharon, the footage\n\nturned out awesome. I LOVE the lady you got, and her \"Come back here\n\nyou little punk\" is so far the best part of the entire short.\" The\n\ndirector in her feature film said about her suicide performance in\n\nPolitics of Street Crime \"Penny was heartbreaking as the tragic mother\n\nof Monique. With blood splattered everywhere and tears in her eyes,\n\nPenny performed a classic suicide scene worthy of Meryl Streep.\" Her\n\nlatest performance as Emma Fisherman had the director and crew in tears\n\nas she wept trying to aid a dying friend to the afterlife.\n\nPenny would describe herself somewhere between Susan Sarandon (whose\n\nwork she admires greatly), Sally Field and Ellen Barkin, but she is\n\nyounger than these talented ladies. In addition, she is also\n\ncomfortable playing slightly neurotic, funny roles such as Shelly Long\n\nand Meg Ryan.\n\nHer years of training at the Actors Workshop has taught her much. She\n\nwas pushed well beyond her comfort zone everyday and it helped her to\n\ngrow as a person and as an actress as well as teach her the art of\n\nimprove.\n\nShe is also proud that she landed an interview with Lord of the Rings\n\nactor, Billy Boyd while on location in Sault Ste. Marie Canada while\n\nthey were filming Ecstasy. She had a part as an extra and he graciously\n\npermitted her an interview for a web site she runs.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1123018,
        "imdb_id": "nm3779992",
        "known_for_department": "Acting",
        "name": "Penny Gibbs",
        "place_of_birth": null,
        "popularity": 0.0143,
        "profile_path": null
    }
}