{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/pjlxrd646cBYznHoPBWTzz6FujX.jpg",
                "genre_ids": [
                    28,
                    878,
                    18
                ],
                "id": 39254,
                "original_language": "en",
                "original_title": "Real Steel",
                "overview": "Charlie Kenton is a washed-up fighter who retired from the ring when robots took over the sport. After his robot is trashed, he reluctantly teams up with his estranged son to rebuild and train an unlikely contender.",
                "popularity": 17.3868,
                "poster_path": "/4GIeI5K5YdDUkR3mNQBoScpSFEf.jpg",
                "release_date": "2011-09-28",
                "title": "Real Steel",
                "video": false,
                "vote_average": 7.061,
                "vote_count": 8734,
                "character": "Fight Fan (uncredited)",
                "credit_id": "58792713c3a3683f37000682",
                "order": 29
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Michael B. Ancrile is an Actor and Comedian, who can flow seamlessly between Comedy and the Dramatic. He has appeared in several feature films including, Transformer: Age of Extinction, Real Steel, Whip It, Street Boss, Super Sucker and many more. He has also played Key, Diverse roles in many award winning short films, including Train Station and The Greatest Gift 2.0.\n\nMichael has also appeared in several National Television programs, including HBO's Hung, ABC's Detroit 1-8-7, The Discovery Channel: You Spoof Discovery, TNT Network: Moviefest and Fox Sports The Best Damn Sports Show Period. Michael has also appeared in many local and National Commercials, including Diet Coke, Detroit Pistons, Alro and Firekeepers Casino.\n\nMichael has Developed Many Original Comedy Characters over the years, which he has used in his Stand up Comedy Act and on Local and National Radio shows, including the Jim Rome Show. He has also appeared as these Characters in local and National commercials and TV shows including Creep Theater, where he met and developed an excellent working and creative relationship with Phillip Assenmacher. The two of them have gone on to many Diverse projects together, including Many Celebrity and Civilian Interviews, including Dawn Wells, Ernest Thomas, John Dugan, John Provost, Erin Gray, Karen McDougal and many many more.\n\nMichael is proud and grateful to join the staff at Tressa Graves Productions, and has quickly developed a great creative and working relationship with Tressa and all the staff at TGP, all in the hopes of continuing the fine tradition of excellence and creativity established by Tressa Graves and the staff at TGP.\n\nWhile co-staring in the Tressa Graves Production Film, Sociopath, Michael gives a very scary, menacing performance, in a very pivotal role of one of the stalkers, Oli. Amazingly, Michael also wrote the title song \"Sociopath\" the melody and lyrics for the film. In addition, Michael sings the song, a duet, with another member of the production. Michael also wrote and performed a second song \"The Stalker Song\" for the film.\n\nThe COVID shutdown, did not stop Tressa Graves and Michael Ancrile from collaborating on a new project. A Web Series, Quarantine. A series based on the \"Dr. Death\" virus shutdown. Michael gives a very powerful, emotional performance, when he stars in the series as Tony Berks. Michael also Co-Wrote the series with Tessa Graves.\n\nMichael gives a haunting performance, as he co-stars in the TGP film, The Teddy Bear Girl. Michael's performance in the film, leaves you wondering if his character is a ghost, or is he real, or is it all just in your mind? Michael again, wrote and performed the title song, Teddy Bear Girl, for the film.\n\nMichael gives one of his strongest, most emotionally charged performances, as he Stars in, Phantom. A film written specifically for Michael, by Tressa Graves. Michael is the only actor on camera for the entire film, as he takes you on a emotional rollercoaster as he slowly, comes to grips with what he has done. Once again, Michael wrote and performed the title song, Olivia, for the film.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1123015,
        "imdb_id": "nm2370487",
        "known_for_department": "Acting",
        "name": "Mike Ancrile",
        "place_of_birth": null,
        "popularity": 0.0143,
        "profile_path": "/w7Hp8jmZr7FhdcLnEHtrt6zTUD5.jpg"
    }
}