{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mazqYfDUreT2KE6ZsaWT59JARHZ.jpg",
                "genre_ids": [
                    16,
                    18
                ],
                "id": 83389,
                "original_language": "ja",
                "original_title": "コクリコ坂から",
                "overview": "Yokohama, 1963. Japan is picking itself up from the devastation of World War II and preparing to host the 1964 Olympics—and the mood is one of both optimism and conflict as the young generation struggles to throw off the shackles of a troubled past. Against this backdrop of hope and change, a friendship begins to blossom between high school students Umi and Shun—but a buried secret from their past emerges to cast a shadow on the future and pull them apart.",
                "popularity": 4.6666,
                "poster_path": "/rRLYX4RZIyloHSJwvZKAhphAjiB.jpg",
                "release_date": "2011-07-16",
                "title": "From Up on Poppy Hill",
                "video": false,
                "vote_average": 7.535,
                "vote_count": 1849,
                "character": "Shiro Mizunuma / Hiroshi Tachibana (voice)",
                "credit_id": "52fe489d9251416c910927ff",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "風間俊介"
        ],
        "biography": "Kazama Shunsuke is a Japanese actor, entertainer, voice actor, and presenter born in Sumida, Tokyo, Japan. After leaving SMILE-UP, he has been active as a freelancer.\n\nKazama's interest in television dramas led him to audition for Johnny & Associates in 1997, during his second year of junior high school, at the encouragement of his family. He debuted that same year with the group Shonentai and continued as a Johnny's Jr. He also worked as a backup dancer for groups like TOKIO and V6. Despite joining B.I.G. in September 1998, a hiatus due to high school exams led to a shift in his role within the agency.\n\nIn 2000, Kazama ventured into voice acting, debuting in the TV anime \"Yu-Gi-Oh! Duel Monsters\".\n\nIn early May 2013, Kazama married a non-celebrity woman, with the announcement made through Johnny & Associates in July of that year.\n\nOn October 15, 2015, a dedicated page for Kazama was established on the Johnny & Associates official website, signifying his departure from Johnny's Jr.\n\nOn February 11, 2019, reports surfaced of Kazama's wife giving birth to their first son.\n\nOn December 16, 2023, SMILE-UP's official website announced Kazama's intention to become independent by the end of that month. He subsequently established his own personal agency and now holds the title of \"representative director\".",
        "birthday": "1983-06-17",
        "deathday": null,
        "gender": 2,
        "homepage": "https://shunsuke-kazama.com/",
        "id": 1124535,
        "imdb_id": "nm0443562",
        "known_for_department": "Acting",
        "name": "Shunsuke Kazama",
        "place_of_birth": "Tokyo, Japan",
        "popularity": 2.2347,
        "profile_path": "/zeovF5ViACeqmmz9NkjMAm8tVAp.jpg"
    }
}