{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7nFfW8RM50PANBIdfI9Ut3FdoSB.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749
                ],
                "id": 310593,
                "original_language": "it",
                "original_title": "Youth",
                "overview": "Two lifelong friends bond whilst vacationing in a luxury Swiss Alps lodge as they ponder retirement. While Fred has no plans to resume his musical career despite the urging of his loving daughter Lena, Mick is intent on finishing the screenplay for what may be his last important film for his muse Brenda. And where will inspiration lead their younger friend Jimmy, an actor grasping to make sense of his next performance?",
                "popularity": 2.7917,
                "poster_path": "/ceRN51oeadmccAvqvDxpnnNRcLU.jpg",
                "release_date": "2015-05-20",
                "title": "Youth",
                "video": false,
                "vote_average": 6.898,
                "vote_count": 2130,
                "character": "Girl Screenwriter",
                "credit_id": "562e4b62c3a3681b4b00a4c2",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/42gqGeyXh4caHP19Tqf8DMRgc7r.jpg",
                "genre_ids": [
                    35,
                    10749,
                    18
                ],
                "id": 556678,
                "original_language": "en",
                "original_title": "Emma.",
                "overview": "In 1800s England, a well-meaning but selfish young woman meddles in the love lives of her friends.",
                "popularity": 3.7723,
                "poster_path": "/uHpHzbHLSsVmAuuGuQSpyVDZmDc.jpg",
                "release_date": "2020-02-13",
                "title": "Emma.",
                "video": false,
                "vote_average": 7.019,
                "vote_count": 1848,
                "character": "Isabella Knightley",
                "credit_id": "5cbe368c0e0a2660dcf29d88",
                "order": 35
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "克洛伊·皮里"
        ],
        "biography": "Chloe Pirrie (born August 25, 1987) is a Scottish actress. She has played main roles in the 2014 miniseries The Game, the 2012 film Shell, and the 2015 television film An Inspector Calls. She has also appeared in the 2016 miniseries War & Peace, the 2015 film Youth, the 2015 film Blood Cells and a 2013 episode of Black Mirror. In 2015 she also co-starred in the Academy Award winner for Best Live Action Short Film, Stutterer.\n\nPirrie was raised in Stockbridge, Edinburgh, and attended the Mary Erskine School. She began acting in school and decided to pursue it as a career after being cast in a school production of The Cherry Orchard. She moved to London at the age of 18 to attend the Guildhall School of Music and Drama and graduated in 2009. Pirrie's professional acting career began in 2009. She made her debut at the Royal National Theatre in a 2010 production of Men Should Weep alongside numerous other Scottish actors. Shortly afterwards, she appeared in Solstice, a short film released in 2010. Her first role in a feature film was in Shell (2012), a Scottish drama in which Pirrie played the eponymous main character. For this performance she won Most Promising Newcomer at the British Independent Film Awards 2013 and was nominated for Best British Newcomer at the 2012 BFI London Film Festival Awards. In 2013, she played a politician in \"The Waldo Moment\", an episode of the anthology series Black Mirror. In the same year she was named as one of BAFTA's \"Breakthrough Brits\" and Screen International's \"UK Stars of Tomorrow\".\n\nIn 2014, Pirrie starred in the BBC miniseries The Game, a Cold War spy thriller in which she played an MI5 secretary. The following year she appeared as Sheila Birling in Helen Edmundson's BBC One adaptation of J. B. Priestley's An Inspector Calls, in the miniseries The Last Panthers, the British independent film Burn Burn Burn, and the Italian film Youth.\n\nIn 2015, she starred as Ellie in the Academy Award winner for Best Live Action Short Film, Stutterer. Ellie is the love interest for Greenwood (played by Matthew Needham). Greenwood has a major stuttering problem and can't speak effectively, causing him to panic when Ellie suggests they take what had only been an online relationship, offline to meet in person. After finally giving in, Greenwood learns a secret about Ellie that changes everything.\n\nShe played Julie Karagina in the 2016 BBC miniseries War & Peace and was cast as Emily Brontë in To Walk Invisible, a BBC drama about the Brontë family created by Sally Wainwright. She also starred in the Death In Paradise episode 'In The Footsteps Of A Killer' as Grace Matlock, an employee at the Saint Marie Times.\n\nShe also plays Lara in the 2016 BBC thriller series, The Living and the Dead. In 2017, she starred in the Netflix series, The Crown for its second season, playing Eileen Parker. In 2018, she appeared in the BBC/Netflix miniseries Troy: Fall of a City.",
        "birthday": "1987-08-25",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1125581,
        "imdb_id": "nm4006608",
        "known_for_department": "Acting",
        "name": "Chloe Pirrie",
        "place_of_birth": "Edinburgh, Scotland, UK",
        "popularity": 0.8686,
        "profile_path": "/t5pUoG5kDk8F0uNQ1reMD8Cd4V0.jpg"
    }
}