{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2Mlw0JRNZHXLYxbeJ0LmiCCTiok.jpg",
                "genre_ids": [
                    14,
                    18
                ],
                "id": 34647,
                "original_language": "en",
                "original_title": "Enter the Void",
                "overview": "This psychedelic tour of life after death is seen entirely from the point of view of Oscar, a young American drug dealer and addict living in Tokyo with his prostitute sister, Linda. When Oscar is killed by police during a bust gone bad, his spirit journeys from the past -- where he sees his parents before their deaths -- to the present -- where he witnesses his own autopsy -- and then to the future, where he looks out for his sister from beyond the grave.",
                "popularity": 4.137,
                "poster_path": "/krKnsfvSJM1PL40tLicRhVQ6kuG.jpg",
                "release_date": "2010-05-05",
                "title": "Enter the Void",
                "video": false,
                "vote_average": 7.304,
                "vote_count": 1887,
                "character": "Oscar",
                "credit_id": "52fe45719251416c91032793",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia.\n\nNathaniel Chaplin \"Nathan\" Brown (born May 20, 1988) is an American actor and director whose career started by playing the lead role in the 2009 thriller Enter the Void, which was directed by Gaspar Noé, and nominated for a Cannes Palme d'Or. He starred alongside American actress Paz de la Huerta.\n\nBorn in Hershey, PA, Brown had been taught at home by his mother until the 10th grade. He has one older sister, Hannah, two younger sisters, Elizabeth, and Abigail, and one younger brother, Wells.\n\nNathan moved to New York City in 2007 when he was street cast by Barbara Pfister to model shows during Fashion Week. His modeling career spanned two seasons and ended when he was cast for Enter The Void. After the shooting of the movie, he appeared in a Barneys New York ad campaign alongside Gabe Nevins shot by Nick Haymes. He was also shot by Nan Goldin for V Magazine where he gave an interview for the July 2009 issue.\n\nDescription above from the Wikipedia article Nathaniel Brown, licensed under CC-BY-SA, full list of contributors on Wikipedia.​",
        "birthday": "1988-05-20",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 112741,
        "imdb_id": "nm1140926",
        "known_for_department": "Acting",
        "name": "Nathaniel Brown",
        "place_of_birth": "Richmond, Virginia, USA",
        "popularity": 0.0946,
        "profile_path": "/iaSXvE3XAMn3P8tCR96ktnHfAzw.jpg"
    }
}