{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2sE6hrwfn9IV7eDlMvpIb9q1EWy.jpg",
                "genre_ids": [
                    35,
                    10402,
                    10749
                ],
                "id": 114150,
                "original_language": "en",
                "original_title": "Pitch Perfect",
                "overview": "College student Beca knows she does not want to be part of a clique, but that's exactly where she finds herself after arriving at her new school. Thrust in among mean gals, nice gals and just plain weird gals, Beca finds that the only thing they have in common is how well they sing together. She takes the women of the group out of their comfort zone of traditional arrangements and into a world of amazing harmonic combinations in a fight to the top of college music competitions.",
                "popularity": 5.2945,
                "poster_path": "/gsFoJk9g8W3zgaipRrrURk7LbiF.jpg",
                "release_date": "2012-09-28",
                "title": "Pitch Perfect",
                "video": false,
                "vote_average": 7.28,
                "vote_count": 6699,
                "character": "Opening Bellas #2",
                "credit_id": "55c2f2cec3a3686d11001175",
                "order": 61
            },
            {
                "adult": false,
                "backdrop_path": "/cHkhb5A4gQRK6zs6Pv7zorHs8Nk.jpg",
                "genre_ids": [
                    28,
                    80,
                    53
                ],
                "id": 168259,
                "original_language": "en",
                "original_title": "Furious 7",
                "overview": "Deckard Shaw seeks revenge against Dominic Toretto and his family for his comatose brother.",
                "popularity": 14.3471,
                "poster_path": "/wurKlC3VKUgcfsn0K51MJYEleS2.jpg",
                "release_date": "2015-04-01",
                "title": "Furious 7",
                "video": false,
                "vote_average": 7.224,
                "vote_count": 10951,
                "character": "Jasmine",
                "credit_id": "56417c7b92514128a90018fb",
                "order": 39
            },
            {
                "adult": false,
                "backdrop_path": "/lxCUDgZ54myV7goBrkpFoHRt9Ms.jpg",
                "genre_ids": [
                    28,
                    35,
                    80
                ],
                "id": 64688,
                "original_language": "en",
                "original_title": "21 Jump Street",
                "overview": "When cops Schmidt and Jenko join the secret Jump Street unit, they use their youthful appearances to go undercover as high school students. They trade in their guns and badges for backpacks, and set out to shut down a dangerous drug ring. But, as time goes on, Schmidt and Jenko discover that high school is nothing like it was just a few years earlier -- and, what's more, they must again confront the teenage terror and anxiety they thought they had left behind.",
                "popularity": 6.081,
                "poster_path": "/8v3Sqv9UcIUC4ebmpKWROqPBINZ.jpg",
                "release_date": "2012-03-14",
                "title": "21 Jump Street",
                "video": false,
                "vote_average": 6.883,
                "vote_count": 10613,
                "character": "Eric's Friend",
                "credit_id": "5a702fcc0e0a26796900e8b4",
                "order": 47
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Brittney Marie Alger",
            "Brittney Barlow",
            "Μπρίτνεϊ Άλγκερ",
            "Brittany M. Barlow",
            "Brittany Marie Barlow",
            "Brittany M. Alger"
        ],
        "biography": "Brittney Alger is an American actress, born in Westlake, Ohio. She first realized she had an itch for drama while studying theatre in high school. Brittney participated in various plays and musicals, it was then that she realized the power it had to connect people. It wasn't until she portrayed an orphan in a local church play, where she connected so deeply to the role and witnessed how touched the audience was; she knew it was what she wanted to do forever. She began honing her craft by enrolling in multiple acting classes and workshops in New Orleans, Louisiana. It was there that she learned the basics of acting, including discipline, focus, and the teamwork it takes to be a successful actress in this business. After landing her first lead role in the film, The Demented, she decided it was time to move to Los Angeles. Brittney continues to show that she has what it takes through her magnetic personality, vulnerability and beauty.\n\n- IMDb Mini Biography By: Miles O'Keefe",
        "birthday": "1988-10-25",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1128522,
        "imdb_id": "nm4329380",
        "known_for_department": "Acting",
        "name": "Brittney Alger",
        "place_of_birth": "Ohio, USA",
        "popularity": 0.6071,
        "profile_path": "/jlOCO4CGpcbCd6eMvimNhuZmDSx.jpg"
    }
}