{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sFEYsEfzTx7hhjetlNrme8B5OUo.jpg",
                "genre_ids": [
                    28,
                    53,
                    878
                ],
                "id": 752,
                "original_language": "en",
                "original_title": "V for Vendetta",
                "overview": "In a world in which Great Britain has become a fascist state, a masked vigilante known only as “V” conducts guerrilla warfare against the oppressive British government. When V rescues a young woman from the secret police, he finds in her an ally with whom he can continue his fight to free the people of Britain.",
                "popularity": 8.3222,
                "poster_path": "/1avD1JeaRiJX5M4ahPdZPypGoGN.jpg",
                "release_date": "2006-02-23",
                "title": "V for Vendetta",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 15001,
                "character": "Lilliman",
                "credit_id": "52fe4270c3a36847f801ec49",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/1YlaU9vXlD4K5EBGZKjaCb9rJb9.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 1955,
                "original_language": "en",
                "original_title": "The Elephant Man",
                "overview": "A Victorian surgeon rescues a heavily disfigured man being mistreated by his \"owner\" as a side-show freak. Behind his monstrous façade, there is revealed a person of great intelligence and sensitivity. Based on the true story of Joseph Merrick (called John Merrick in the film), a severely deformed man in 19th century London.",
                "popularity": 5.8543,
                "poster_path": "/u0wpPYjuSt8DIe1Y3Vapnh8jcKE.jpg",
                "release_date": "1980-10-09",
                "title": "The Elephant Man",
                "video": false,
                "vote_average": 8.049,
                "vote_count": 3723,
                "character": "Fox",
                "credit_id": "52fe4326c3a36847f803dfab",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/lAaAtQ5b8iX9JeG6QUq4RM1paKD.jpg",
                "genre_ids": [
                    18
                ],
                "id": 10435,
                "original_language": "en",
                "original_title": "Chaplin",
                "overview": "An aged Charlie Chaplin narrates his life to his autobiography's editor, including his rise to wealth and comedic fame from poverty, his turbulent personal life and his run-ins with the FBI.",
                "popularity": 3.8615,
                "poster_path": "/Aeltt5tl02zrEj4GoMynHc94lWG.jpg",
                "release_date": "1992-12-17",
                "title": "Chaplin",
                "video": false,
                "vote_average": 7.438,
                "vote_count": 1131,
                "character": "Butler",
                "credit_id": "642d50980d2f5300f4f74735",
                "order": 126
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Джон Стэндинг",
            "Sir John Ronald Leon, 4t baronet",
            "John Ronald Leon"
        ],
        "biography": "Sir John Ronald Leon, 4th Baronet (born 16 August 1934) is an English actor and baronet who is known as John Standing. He is the stepson of John Clements. Standing was born in London, the son of Kay Hammond (née Dorothy Katherine Standing), an actress, and Sir Ronald George Leon, 3rd Baronet, a stockbroker descended from Sir Herbert Leon, the builder of Bletchley Park. He succeeded his father as the 4th baronet in 1964, but does not use the title. The Leon family were, until 1937, owners of Bletchley Park, the country house in Buckinghamshire used in the Second World War as a code-breaking centre. He was educated at Eton College and Millfield School, Somerset. He served in the King's Royal Rifle Corps as a second lieutenant, before going on to study at the Byam Shaw School of Art in London\n\nStanding began his career in Peter Brook's 1955 production of Titus Andronicus starring Laurence Olivier and wife Vivien Leigh and later played leading parts in Oscar Wilde's The Importance of Being Earnest, Christopher Fry's Ring Round the Moon, A Sense of Detachment by John Osborne, and Noël Coward's Private Lives, with Maggie Smith. He was nominated for an Olivier award (1979) for Close of Play at the National Theatre. He made his film debut in The Wild and the Willing (1962), going on to appear in King Rat (1965), Walk, Don't Run (1966), The Psychopath (1966), The Eagle Has Landed (1976), The Elephant Man (1980), Nightflyers (1987), Mrs Dalloway (1997) and A Good Woman (2004).\n\nOne of his first major television roles was as Sidney Godolphin in the BBC twelve-part serial, The First Churchills (1969). Other television appearances include Tinker, Tailor, Soldier, Spy (1979); the ITV sitcom The Other 'Arf (1980–84), with Lorraine Chase; The Choir (1995) and King Solomon's Mines (2004). In the United States, he made guest appearances in numerous weekly programmes including L.A. Law, Civil Wars and Murder, She Wrote, and co-starred briefly with Robert Wagner and Samantha Smith in the action series Lime Street (1985). In 1976, he also appeared opposite Peter O'Toole in the little-seen BBC thriller film, Rogue Male, directed by Clive Donner.  He appeared in the horror film Nightflyers (1987) adapted from a short story by George R. R. Martin. In 2002, he had a speaking credit on Lost Horizons, the second studio album from the British electronic duo Lemon Jelly. On track 1, \"Elements\", he lists the basic “elements\" that make up the world: ash, metal, water, wood, fire and sky. On track 3, \"Ramblin' Man\", Standing reads a long list of various locations around the world, ranging from small Sussex villages to major world capitals. In July 2010, it was confirmed that he would be appearing as Jon Arryn in the HBO series Game of Thrones, based on Martin's A Song of Ice and Fire novels.",
        "birthday": "1934-08-16",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 11282,
        "imdb_id": "nm0822062",
        "known_for_department": "Acting",
        "name": "John Standing",
        "place_of_birth": "London, England, UK",
        "popularity": 0.3779,
        "profile_path": "/hQpTeZDljWR2F9n1PcL7sXilwCE.jpg"
    }
}