{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/38uM6QuI06znUCELfOSiVQy05CX.jpg",
                "genre_ids": [
                    37
                ],
                "id": 301,
                "original_language": "en",
                "original_title": "Rio Bravo",
                "overview": "A small-town sheriff in the American West enlists the help of a disabled man, a drunk, and a young gunfighter in his efforts to hold in jail the brother of the local bad guy.",
                "popularity": 5.5199,
                "poster_path": "/4gI4KKmoi0d3yfsF71YU3S0I5t8.jpg",
                "release_date": "1959-03-18",
                "title": "Rio Bravo",
                "video": false,
                "vote_average": 7.813,
                "vote_count": 1204,
                "character": "(uncredited)",
                "credit_id": "57045ae59251415bb90012e4",
                "order": 25
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Nesdon Foye Booth"
        ],
        "biography": "Nesdon Foye Booth was an American film and television actor. He appeared in over 100 films and television programs, and was known for his recurring role as Frank the bartender in the American western television series Cimarron City.\n\nNesdon (a.k.a. Ned) was born in Baker City, Oregon. He began his career in Portland, Oregon, acting on old-time radio programs then served during WW2 in a field artillery division at Fort MacArthur in San Pedro, CA. He was among a group of soldiers stationed there, some of whom, such as Sterling Holloway and Tex Terry, were established Hollywood actors, who wrote, produced and performed a morale-boosting stage production initially called the Yardbirds of Fort MacArthur, but which proceeded to become a successful stage musical titled Hey, Rookie. Nesdon played numerous roles but was most notable as the company's the prima ballerina.\n\nFollowing the war he attended the newly chartered California State College, Los Angeles, (now called California State University, Los Angeles) on the site of Los Angeles City College, graduating in 1949 with a Bachelor's degree in theater. He continued to work as character actor guest-starring and as a bit player in numerous television programs including Gunsmoke, Bonanza, The Twilight Zone, Sky King, Colt .45, Tales of Wells Fargo, 77 Sunset Strip, The Lawless Years, Lawman, Father Knows Best, The Life and Legend of Wyatt Earp, Man with a Camera, Peter Gunn and Perry Mason. Booth died in March 1964 of a heart attack in Hollywood, California at Cedars of Lebanon Hospital (now known as Cedars Sinai Medical Center. He was buried in Olive Lawn Memorial Park.",
        "birthday": "1918-09-01",
        "deathday": "1964-03-25",
        "gender": 2,
        "homepage": null,
        "id": 112935,
        "imdb_id": "nm0095772",
        "known_for_department": "Acting",
        "name": "Nesdon Booth",
        "place_of_birth": "Baker City, Oregon, USA",
        "popularity": 0.1274,
        "profile_path": null
    }
}