{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/eYDAnSidN4rIEuneS5gEJkTyk3l.jpg",
                "genre_ids": [
                    28,
                    80,
                    35
                ],
                "id": 9056,
                "original_language": "cn",
                "original_title": "警察故事",
                "overview": "Officer Chan Ka Kui manages to put a major Hong Kong drug dealer behind the bars practically alone, after a shooting and an impressive chase inside a slum. Now, he must protect the boss' secretary, Selina, who will testify against the gangster in court.",
                "popularity": 5.4166,
                "poster_path": "/h2wxvGUK0ops0R3A7AA1QSXGOqV.jpg",
                "release_date": "1985-12-14",
                "title": "Police Story",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 949,
                "character": "Drug Dealer (uncredited)",
                "credit_id": "665f4045ef490f5f9dc276a4",
                "order": 35
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Danny Lau",
            "劉丹",
            "Dan Lau",
            "刘丹",
            "刘庆基",
            "劉慶基",
            "丹爷",
            "叉烧炳",
            "لاو دان"
        ],
        "biography": "Liu Tan was born in Shanghai in 1945 and moved with his family to Hong Kong five years later. In 1968, Liu entered the actor training class run by Cathay Film Organisation and was signed up by the studio after graduated. Liu started his career in supporting roles until he got his big break in \"An Apple A Day\" in 1970. Liu moved to Shaw Brothers in 1971 and among the movies he appeared in \"The Devil's Mirror\" and \"The Warlord\". Liu left Shaw Brothers in 1972 to concentrate predominantly on voice dubbing while he still making sporadic appearance in films. In 1977, Liu joined TVB as a contract actor. His acclaimed role was as the villain in the classic series \"The Bund\". For the past two decades, Liu has made regular appearance in TVB and he was one of the popular artists in Hong Kong. -- From the Celestial DVD release of \"The Devil's Mirror\".",
        "birthday": "1945-12-18",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1133980,
        "imdb_id": "nm0490623",
        "known_for_department": "Acting",
        "name": "Danny Lau Dan",
        "place_of_birth": "Weihai, Shandong Province, China",
        "popularity": 0.6729,
        "profile_path": "/gEmCCnMg9GvskUPSuGQA3ae8irk.jpg"
    }
}