{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ecZ6MQ3Y63dtn35km6odO0e39aQ.jpg",
                "genre_ids": [
                    27,
                    35
                ],
                "id": 763,
                "original_language": "en",
                "original_title": "Braindead",
                "overview": "When a Sumatran rat-monkey bites Lionel Cosgrove's mother, she's transformed into a zombie and begins killing (and transforming) the entire town while Lionel races to keep things under control.",
                "popularity": 3.6337,
                "poster_path": "/pa39D8TQs6aNw3hiUs4jLjHVUB0.jpg",
                "release_date": "1992-08-13",
                "title": "Braindead",
                "video": false,
                "vote_average": 7.388,
                "vote_count": 1745,
                "character": "Lionel",
                "credit_id": "52fe4273c3a36847f801f77b",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Timothy Balme",
            "Tim Balme",
            "Timothy Guy Balme"
        ],
        "biography": "Timothy Guy Balme (born January 18, 1967), also known as Tim Balme, is an actor and screenwriter from New Zealand. He's most well known for his roles on the long-running soap opera Shortland Street and Mercy Peak, as well as lead roles in the cult favourites Braindead and Jack Brown Genius. He most recently was a writer and actor on the television series The Almighty Johnsons.\n\nBalme is married to actress Katie Wolfe, with whom he has two children; daughter Edie (born 2001) and son Nikau (born 2005). Balme also has a son, Sam (born 1987) from a previous relationship.\n\nBalme graduated from Toi Whakaari in 1989, and his first lead role was in the 1992 film Braindead (aka Dead Alive). Balme and his wife, along with Simon Bennett and Robyn Malcolm, founded the New Zealand Actors' Company, which ran for three productions before being dissolved. An actor for the better part of twenty years, he has recently branched out into writing, and has scripted episodes for television series such as Diplomatic Immunity and Outrageous Fortune. Balme also wrote the short film Redemption, directed by his wife, which was selected as part of the short film line-up at the Sundance Film Festival for 2011.\n\nBalme worked as the head of development for South Pacific Pictures for three years before returning to freelancing. He currently writes for shows such as the popular Channel 7 drama 800 Words and is head writer for the murder mystery series The Brokenwood Mysteries. In 2015 he won the Best Television Screenplay award at the SWANZ (NZ Writer's Guild Awards) for Brokenwood Ep 2 \"Sour Grapes\".\n\nFrom Wikipedia, the free encyclopedia",
        "birthday": "1967-01-18",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.aucklandactors.co.nz/actors/details/tim-balme",
        "id": 11332,
        "imdb_id": "nm0050975",
        "known_for_department": "Acting",
        "name": "Timothy Balme",
        "place_of_birth": " New Zealand",
        "popularity": 0.1841,
        "profile_path": "/l1MWge3W4M3y1wYRJ9sLYkDLLHd.jpg"
    }
}