{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5HjzYTihkH7EvOWSE7KcsF6pBMM.jpg",
                "genre_ids": [
                    10751,
                    35,
                    12,
                    16
                ],
                "id": 522478,
                "original_language": "en",
                "original_title": "Peter Rabbit 2: The Runaway",
                "overview": "Peter Rabbit runs away from his human family when he learns they are going to portray him in a bad light in their book. Soon, he crosses paths with an older rabbit who ropes him into a heist.",
                "popularity": 6.1345,
                "poster_path": "/cycDz68DtTjJrDJ1fV8EBq2Xdpb.jpg",
                "release_date": "2021-03-25",
                "title": "Peter Rabbit 2: The Runaway",
                "video": false,
                "vote_average": 7.066,
                "vote_count": 852,
                "character": "Mrs. Tiggy-Winkle (voice)",
                "credit_id": "6606740b283ed9014917e69a",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Sia Furler",
            "Сиа",
            "سیا",
            "Сиа Фёрлер"
        ],
        "biography": "Sia Kate Isobelle Furler (born 18 December 1975) is an Australian singer and songwriter. Sia's music incorporates hip hop, funk and soul as a base for her vocal styling.\n\nShe started her career as a singer in the local Adelaide acid jazz band Crisp in the mid-1990s. In 1997, when Crisp disbanded, she released her debut studio album titled OnlySee on Flavoured Records in Australia. Following the event, she moved to London, England and provided lead vocals for British duo Zero 7.\n\nIn 2000, Sia signed to Sony Music's sub-label Dance Pool and released her second studio album, Healing Is Difficult, the following year. Displeased with the promotion of the record, she signed to Go! Beat and released her third studio album, Colour the Small One, in 2004. Dissatisfied with the project's struggling to connect with a mainstream audience, Sia relocated to New York City in 2005 and began touring across the United States. Sia released her fourth and fifth studio releases, Some People Have Real Problems and We Are Born, in 2008 and 2010, respectively.\n\nIn 2014, Sia broke through as a solo recording artist when her sixth studio album, 1000 Forms of Fear, debuted at No. 1 in the U.S. Billboard 200 and generated the top-ten single \"Chandelier\" and a trilogy of music videos co-directed by Sia and starring child dancer Maddie Ziegler. Since then, Sia has usually worn a wig that obscures her face to protect her privacy.\n\nHer seventh studio album, This Is Acting (2016), spawned her first Billboard Hot 100 number one single, \"Cheap Thrills\". The same year, she began her Nostalgic for the Present Tour, which incorporated dancing by Ziegler and others, and other performance art elements. Her eighth studio album, Everyday Is Christmas, was released in 2017 and reissued in 2018 with three bonus tracks. In 2018, she collaborated with Labrinth and Diplo in the group LSD, and they released their self-titled debut album in April 2019. Sia has written many songs for films, and she directed a feature film, titled Music, which was released in early 2021 alongside an album, Music – Songs from and Inspired by the Motion Picture.\n\nAmong the accolades received by Sia are nearly a dozen ARIA Awards, 9 Grammy Award nominations and an MTV Video Music Award.\n\nIn the 2014 South Park episode \"The Cissy\", Sia provided the vocals for the fictional Lorde track \"Push (Feeling Good on a Wednesday)\". In 2016, Sia covered \"Blackbird\" by The Beatles for the Netflix original series Beat Bugs. She was the voice of pop star Songbird Serenade in the 2017 animated film My Little Pony: The Movie and she contributed an original song, \"Rainbow\", to the film's soundtrack. She wrote the songs for the soundtrack to the 2018 musical film Vox Lux, with a score by Scott Walker.\n\nShe wrote a screenplay (based on a story that she had written in 2007) for the 2021 musical film, Music, which starred Ziegler, Kate Hudson and Leslie Odom Jr. She also directed the film and wrote its soundtrack. It was nominated for Best Motion Picture – Musical or Comedy at the 78th Golden Globe Awards. As director, Sia later won the Golden Raspberry Award for Worst Director.",
        "birthday": "1975-12-18",
        "deathday": null,
        "gender": 1,
        "homepage": "http://siamusic.net",
        "id": 1136517,
        "imdb_id": "nm2397981",
        "known_for_department": "Acting",
        "name": "Sia",
        "place_of_birth": "Adelaide, South Australia, Australia",
        "popularity": 1.0606,
        "profile_path": "/nGORvBMw1MGOTrJ5go10kLhQHbR.jpg"
    }
}