{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/exk2xDI2YT5UHs5Bow79AVRGOnP.jpg",
                "genre_ids": [
                    53,
                    9648,
                    10749
                ],
                "id": 506,
                "original_language": "en",
                "original_title": "Marnie",
                "overview": "Marnie is a thief, a liar, and a cheat. When her new boss, Mark Rutland, catches on to her routine kleptomania, she finds herself being blackmailed.",
                "popularity": 2.8616,
                "poster_path": "/nRRy4VO2A3Py7wiZBPz11PAlogp.jpg",
                "release_date": "1964-07-17",
                "title": "Marnie",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 1176,
                "character": "Hotel Chauffeur (uncredited)",
                "credit_id": "61e107251511aa006969f7e8",
                "order": 15
            },
            {
                "adult": false,
                "backdrop_path": "/d7gEJYEookiF0SHPD8fMXcCgpC9.jpg",
                "genre_ids": [
                    18,
                    14,
                    10749
                ],
                "id": 16633,
                "original_language": "en",
                "original_title": "Somewhere in Time",
                "overview": "Young writer Richard Collier is met on the opening night of his first play by an old lady who begs him to \"Come back to me\". Mystified, he tries to find out about her, and learns that she is a famous stage actress from the early 1900s. Becoming more and more obsessed with her, by self-hypnosis he manages to travel back in time—where he meets her.",
                "popularity": 2.211,
                "poster_path": "/hmdegiSwVYUNvEfihaE3HRM3Sos.jpg",
                "release_date": "1980-10-02",
                "title": "Somewhere in Time",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 622,
                "character": "Arthur's Father",
                "credit_id": "58338813925141272d000e4b",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "John Alvin Hoffstadt"
        ],
        "biography": "John Alvin, born John Alvin Hoffstadt was an American film, stage and television actor.  Alvin was signed with Warner Brothers Studios for an exclusive four-year contract during the World War II era, although he was \"borrowed\" by 20th Century Fox to appear in 1944's Oscar-nominated The Fighting Sullivans. He appeared in more than 25 Warner Brothers films during this time, including Northern Pursuit (which starred Errol Flynn), The Beast with Five Fingers, The Very Thought of You, and Objective, Burma!. His pictures after the contract period included Irma la Douce, Inside Daisy Clover, They Shoot Horses, Don't They?, and Alfred Hitchcock's Marnie. However, it was his role in the 1943 film Destination Tokyo, in which he co-starred with John Garfield and Cary Grant, that left the largest impression on Alvin. Years later, in a 2006 interview, Alvin credited Grant with having a major impact on his career path: \"I learned more about show business from him than from anyone. He was very attentive and helpful.\"\n\nAlvin later enjoyed a separate television career, which spanned from the 1950s to the 1980s. His television credits included various roles on Leave It to Beaver, All in the Family, Lou Grant, Dragnet, General Hospital, Murder, She Wrote, Starsky and Hutch, The Incredible Hulk and I Spy. Alvin's also appeared in numerous television commercials advertising for such products as Mattel, H&R Block, McDonald's, Porsche and Audi.\n\nAlvin's theater repertoire included Send Me No Flowers, The Student Prince, The Chicago Conspiracy Trial and The Cradle Will Rock. He also appeared in a production of Rain, which was directed by Charlie Chaplin.\n\nHe largely retired from acting in the 1990s; his final film appearance was in 1994's Milk Money. During his retirement, Alvin often showed his movies for audiences at the Conejo Valley Senior Concerns, an organization for senior citizens based in Thousand Oaks, California.",
        "birthday": "1917-10-24",
        "deathday": "2009-02-27",
        "gender": 2,
        "homepage": null,
        "id": 113704,
        "imdb_id": "nm0023569",
        "known_for_department": "Acting",
        "name": "John Alvin",
        "place_of_birth": "Chicago, Illinois, USA",
        "popularity": 0.2906,
        "profile_path": "/llCjyU2jvjiXofhVjOhsZhSl2Lr.jpg"
    }
}