{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yI0xd7X8UktQ6cb8TdWKNTOWxhm.jpg",
                "genre_ids": [
                    35
                ],
                "id": 8764,
                "original_language": "en",
                "original_title": "Top Secret!",
                "overview": "Popular and dashing American singer Nick Rivers travels to East Germany to perform in a music festival. When he loses his heart to the gorgeous Hillary Flammond, he finds himself caught up in an underground resistance movement. Rivers joins forces with Agent Cedric and Flammond to attempt the rescue of her father, Dr. Paul, from the Germans, who have captured the scientist in hopes of coercing him into building a new naval mine.",
                "popularity": 3.4754,
                "poster_path": "/hRTbfR27xghnVMs3ZJ3EhK3zzud.jpg",
                "release_date": "1984-06-08",
                "title": "Top Secret!",
                "video": false,
                "vote_average": 7.092,
                "vote_count": 1293,
                "character": "German Soldier (uncredited)",
                "credit_id": "66c4b65e1742a4e306712305",
                "order": 72
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Frank trained at East 15, one of the best drama schools in England and, since 1983, he has appeared in many television dramas and feature films. From the 80's classics like Dempsey & Makepeace, Minder, Blott on the Landscape and Bergerac to The Bill, EastEnders and A Game of Thrones, Frank has been a regular face on British TV.\n\nFrank has played lead roles in many independent films. As well as featuring in Game of Thrones, episode 6 of Season 8 - the grand finale, in late 2019 he wrapped on the feature film \"Hosts\" which was released in 2020. Frank also completed the feature film \"Blood Highway\", where he plays the lead, Martin. This is D B Morgan's debut feature film, which was theatrically released in 2020. Also on Amazon Prime are \"Nest of Vampires\", \"To Dream\" and \"Christmas Slay\".",
        "birthday": "1957-01-15",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.starnow.com/u/frankjakeman1/",
        "id": 1138198,
        "imdb_id": "nm2099350",
        "known_for_department": "Acting",
        "name": "Frank Jakeman",
        "place_of_birth": "Bletchley, Buckinghamshire, England, UK. [now Milton Keynes, Buckinghamshire, England, UK]",
        "popularity": 0.0803,
        "profile_path": "/r4zACU2dhsPp2wVSdi3M09Vkjll.jpg"
    }
}