{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dq18nCTTLpy9PmtzZI6Y2yAgdw5.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 497698,
                "original_language": "en",
                "original_title": "Black Widow",
                "overview": "Natasha Romanoff, also known as Black Widow, confronts the darker parts of her ledger when a dangerous conspiracy with ties to her past arises. Pursued by a force that will stop at nothing to bring her down, Natasha must deal with her history as a spy and the broken relationships left in her wake long before she became an Avenger.",
                "popularity": 9.4013,
                "poster_path": "/7JPpIjhD2V0sKyFvhB9khUMa30d.jpg",
                "release_date": "2021-07-07",
                "title": "Black Widow",
                "video": false,
                "vote_average": 7.191,
                "vote_count": 10767,
                "character": "Mason",
                "credit_id": "5cae5c059251412fa620ea12",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "OT Fagbenle",
            "Olatunde Olateju Olaolorun Fagbenle",
            "O. T. 패그벤늘",
            "O.T. Fagbenle",
            "أولاتوندي فاغبنلي"
        ],
        "biography": "Born in London and raised across London, Spain, and Nigeria, Fagbenle was a world traveler at a young age. As a child, music was his passion and he played the saxophone in bands across Europe, performing at the Edinburgh Festival, Wembley Arena, the Royal Albert Hall, and even touring Spain. When he was 16 years old, Fagbenle landed his first proper role in a Nigerian adaptation of the William Shakespeare play Macbeth. Originally hired to play the saxophone, Fagbenle was also given several lines in the play, and he knew at that moment that acting was his calling. The director was so impressed by Fagbenle's work, by the second revival of the play he had secured the lead role. Fagbenle went on to attend the prestigious Royal Academy of Dramatic Arts, graduating early in 2001 and joining alumni such as Sean Bean, Ralph Fiennes, and Anthony Hopkins. Theatre became his passion, as he appeared in dozens of plays across the UK, working in notable productions including the national tours of shows such as Ragamuffin, Romeo & Juliet [as Mercutio], and the West End debut of Porgy and Bess, the musical. Fagbenle was soon offered his first lead role for the stage, in John Guare's award winning play Six Degrees of Separation. His work was met by outstanding reviews, and a M.E.N. Theatre Award for Best Actor in a Leading Role. While Fagbenle's career flourished on the theatre front, he also made his break into film and television.\n\nIn 2006, Fagbenle made his feature film debut, appearing in The Weinstein Company's Breaking and Entering (2006) opposite Jude Law, Robin Wright, and Juliette Binoche. He was next seen in I Could Never Be Your Woman (2007) in 2007 alongside Michelle Pfeiffer, Paul Rudd, and Saoirse Ronan. In 2008, he made his first appearance on US television, starring on NBC's Quarterlife (2007) playing John, a singer songwriter-- where Fagbenle was able pen and perform all the songs his character played on the show. 2008 also brought starring roles for Fagbenle in the UK; as he appeared in the critically acclaimed Walter's War (2008) as Walter Tull, a biopic of the first mixed heritage officer in the British Army, and Consuming Passion (2008) for the BBC. In 2010, Fagbenle took a leading role as Chris in the BBC One flagship show Material Girl (2010). He also starred in the television series Thorne: Sleepyhead (2010) and Thorne: Scaredycat (2010), adaptations of the Mark Billingham novels Sleepyhead and Scaredy Cat. Directed by 24 (2001) producer Stephen Hopkins, the six one hour episodes also starred Sandra Oh, and David Morrissey, and was sold to over 100 countries. 2010 also brought Fagbenle back to the states, where he starred opposite Tia and Tamera Mowry in the Lifetime movie Double Wedding (2010).\n\nIn his down time, Fagbenle loves to go backpacking, play basketball, and volunteers at numerous schools, putting on free drama and music classes for kids.",
        "birthday": "1981-01-22",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 113970,
        "imdb_id": "nm1282966",
        "known_for_department": "Acting",
        "name": "O-T Fagbenle",
        "place_of_birth": "London, England, UK",
        "popularity": 0.4413,
        "profile_path": "/baIiZBDYpYXfG4SlonbcqyYg6l.jpg"
    }
}