{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/AqLcLsGGTzAjm3pCCq0CZCQrp6m.jpg",
                "genre_ids": [
                    12,
                    14
                ],
                "id": 12444,
                "original_language": "en",
                "original_title": "Harry Potter and the Deathly Hallows: Part 1",
                "overview": "Harry, Ron and Hermione walk away from their last year at Hogwarts to find and destroy the remaining Horcruxes, putting an end to Voldemort's bid for immortality. But with Harry's beloved Dumbledore dead and Voldemort's unscrupulous Death Eaters on the loose, the world is more dangerous than ever.",
                "popularity": 18.8359,
                "poster_path": "/iGoXIpQb7Pot00EEdwpwPajheZ5.jpg",
                "release_date": "2010-11-17",
                "title": "Harry Potter and the Deathly Hallows: Part 1",
                "video": false,
                "vote_average": 7.739,
                "vote_count": 19733,
                "character": "Death Eater",
                "credit_id": "52fe44e29251416c7504444b",
                "order": 65
            },
            {
                "adult": false,
                "backdrop_path": "/qZYvF1M7y8Gfp4S6OBHbYfB0Lgc.jpg",
                "genre_ids": [
                    28,
                    12,
                    14
                ],
                "id": 639933,
                "original_language": "en",
                "original_title": "The Northman",
                "overview": "Prince Amleth is on the verge of becoming a man when his father is brutally murdered by his uncle, who kidnaps the boy's mother. Two decades later, Amleth is now a Viking who's on a mission to save his mother, kill his uncle and avenge his father.",
                "popularity": 8.4379,
                "poster_path": "/aSSJMnHknzKjlZ6zybwD7eyJ4Po.jpg",
                "release_date": "2022-04-07",
                "title": "The Northman",
                "video": false,
                "vote_average": 7.036,
                "vote_count": 4702,
                "character": "Standard Bearer",
                "credit_id": "5fd7c1f79408ec003fda3451",
                "order": 37
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Since his appearance in Harry Potter And the Deathly Hallows (2010) as a handraising, trainstopping, carriageboarding, kidscaring Deatheater! Jon has been pursuing much darker film roles. Born In Yorkshire and originally an Aerospace engineer Jon has developed a compelling, unique and very striking look, and a style that has brought a string of excitingly unusual and very challenging roles. From the violently iconic Diggs in the soon to be released 'Hard Shoulder' to the Drunken desperation of Father Lawrence in 'The Zombie King' working with Corey Feldman and Edward Furlong. Jon has also been very fortunate to be involved with several ground breaking projects like 'The Underwater Realm', 'Bloody Cuts' and 'Sleeping Dogs'. During early 2012 Jon worked with Former 2 times WBO world champion Steve Collins, playing the lead in the highly anticipated 'Tax City' a no holds barred tale of life in London's notorious cardboard City. may 2012 saw splitting his time between London and Pisa where he filming on 'Zombie Massacre' playing Doug Mulligan an up-in-your-face trailer trash/hippy yank trying to save the his dog, his girl, and the world. Jon's easy going nature, striking appearance, on-screen intensity and eagerness to embrace the unusual and the demanding make him a top choice for directors, writers and producers and he looks forwards to the challenges to come. If you can work with him... do!",
        "birthday": "1966-11-18",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.joncampling.com/",
        "id": 1140635,
        "imdb_id": "nm1376997",
        "known_for_department": "Acting",
        "name": "Jon Campling",
        "place_of_birth": "Hull, England, UK",
        "popularity": 1.0767,
        "profile_path": "/yeWRsLQ6MRc3hVC5RqOmeqbIl5E.jpg"
    }
}