{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/pZcoSJUb3Lgr9Rzg2shg1PtTBP9.jpg",
                "genre_ids": [
                    18,
                    9648,
                    10749
                ],
                "id": 110,
                "original_language": "fr",
                "original_title": "Trois couleurs : Rouge",
                "overview": "Part-time model Valentine unexpectedly befriends a retired judge after she runs over his dog. At first, the grumpy man shows no concern about the dog, and Valentine decides to keep it. But the two form a bond when she returns to his house and catches him listening to his neighbors’ phone calls.",
                "popularity": 5.2119,
                "poster_path": "/JHmsBiX1tjCKqAul1lzC20WcAW.jpg",
                "release_date": "1994-05-12",
                "title": "Three Colors: Red",
                "video": false,
                "vote_average": 7.916,
                "vote_count": 1467,
                "character": "Dealer",
                "credit_id": "615b1d8d8e2ba60043467229",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": true,
        "also_known_as": [
            "Henri Louis Roland Carey"
        ],
        "biography": "This 1960s Italian epic star of Swiss-French dual nationality was different from most other \"peplum\" actors in that he actually went to drama school. Born in Lausanne in 1933 of an Irish father and French mother, Roland attended the Paris Conservatory, and his early work on the Paris stage included the role of Fortinbras in Hamlet, plus several performances for the Comedie-Francaise. From 1951 he played small parts in French films and eventually made his international screen debut in 1956 with a small part in Trapeze in which he doubled for Burt Lancaster. In 1959 he tried his luck in Hollywood, but owing to work permit problems was only given television bit parts in Bonanza, Laramie, The Twilight Zone, U.S. Steel Hour and Thriller. Returning to Europe, he appeared in the television series Tales of the Vikings produced in Munich for Kirk Douglas's company. This attracted the attention of the Rome studios who were seeking athletic actors to play in historical epics. Since Roland's CV listed his sporting activities as tennis, horse riding, ice hockey, roller hockey, soccer, American football, skiing, water skiing, swimming, motor racing, sailing, boxing, karate, fencing, cycling, motocross, side-car racing, volleyball, basketball and rafting, it was hardly surprising that Riccardo Freda selected him for the lead part of mythological hero Jason in The Giants of Thessaly (1960). He also starred in Sword of El Cid (1963) and Revolt of the Barbarians (1964). After the epics Roland switched to more artistic parts and cameo roles, and used the pseudonym \"Rod Carter\" for action movies. Because of his theatrical experience he was also in demand as a voice actor at Fono Roma where he dubbed Italian pictures into French, but he also speaks fluent English, German and Italian. Since 1982 he has been based almost entirely in Switzerland, although he lives near Florence. Thank you to the Cinematheque Suisse for assisting with this biography, and special thanks to Roland Carey for his kind help.",
        "birthday": "1933-02-20",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1140941,
        "imdb_id": "nm0137029",
        "known_for_department": "Acting",
        "name": "Roland Carey",
        "place_of_birth": "Lausanne, Switzerland",
        "popularity": 1.62,
        "profile_path": "/jynPOZGBo9ANYHPmTvs4ygFWTWk.jpg"
    }
}