{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sSrMPJoHT3qGqdeDPs88mm8ksu5.jpg",
                "genre_ids": [
                    27,
                    35,
                    53,
                    18,
                    10749
                ],
                "id": 1547,
                "original_language": "en",
                "original_title": "The Lost Boys",
                "overview": "When an unsuspecting town newcomer is drawn to local blood fiends, the Frog brothers and other unlikely heroes gear up to rescue him.",
                "popularity": 7.1423,
                "poster_path": "/nH1lvyQvfbL5GKScTtT6zkIvDEn.jpg",
                "release_date": "1987-07-31",
                "title": "The Lost Boys",
                "video": false,
                "vote_average": 7.085,
                "vote_count": 2167,
                "character": "Paul",
                "credit_id": "52fe42fcc3a36847f8031dd7",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia.\n\nBrooke McCarter (born April 22, 1963) is an American actor of film and television noted for one of his earliest roles as Paul in The Lost Boys in 1987, alongside Jason Patric, Corey Haim, Kiefer Sutherland, Jami Gertz, Corey Feldman, Dianne West, Alex Winter, Jamison Newlander and Barnard Hughes.\n\nMcCarter has also appeared in films such as Thrashin' in 1986, Wired in 1989, The Uh-oh Show in 2009, and has made television appearances in shows such as The Twilight Zone.\n\nBrooke McCarter began his career in the entertainment industry as a model with the prestigious Ford modeling agency in New York after winning a national talent search right out of college. He soon began doing major campaigns for companies such as Levis and JC Penney. Brooke engaged in a performing arts curriculum of voice, dance and acting. He then studied exclusively with acting coach icon Stella Adler. Upon completing his New York education he quickly moved to Los Angeles and began working immediately, booking national commercials for major products such as Pepsi, Miller and Chevrolet. Brooke then began his cult actor status with his first feature film, Thrashin, the first skateboard movie which launched the careers of Tony Hawk, Josh Brolin and the Red Hot Chili Peppers. His first big break came with a co-starring role in the 80's vampire hit The Lost Boys, which also launched the careers of Keifer Sutherland and Corey Haim and Corey Feldman. Brooke appeared in TV shows such as the Twlight Zone and Route 66. His last feature film was Wired, about the life of John Belushi starring Michael Chikilis. Brooke then turned to his musical talent as a drummer and music programmer, and began scoring independent feature films such as Fast Getaway and documentaries such as Leaves of Green in which he served as director as well. In 1998 he took a 10 year break from Hollywood to pursue other business interests in the telecommunications industry. In 2009, Brooke returned to cult horror movie status with the lead role in horror icon Herschell Gordon Lewis's The Uh-Oh Show due to be released spring of 2010.\n\nDescription above from the Wikipedia article Brooke McCarter, licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": "1963-04-22",
        "deathday": "2015-12-22",
        "gender": 2,
        "homepage": null,
        "id": 114149,
        "imdb_id": "nm0565029",
        "known_for_department": "Acting",
        "name": "Brooke McCarter",
        "place_of_birth": "Philadelphia, Pennsylvania, USA",
        "popularity": 0.0569,
        "profile_path": "/A0RzEN2xWWfogHtJvFrz4D87eUi.jpg"
    }
}