{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7e9uENnSM93CQXyzLSuzBUgxm4P.jpg",
                "genre_ids": [
                    99,
                    10402
                ],
                "id": 164558,
                "original_language": "en",
                "original_title": "One Direction: This Is Us",
                "overview": "\"One Direction: This Is Us\" is a captivating and intimate all-access look at life on the road for the global music phenomenon. Weaved with stunning live concert footage, this inspiring feature film tells the remarkable story of Niall, Zayn, Liam, Harry and Louis' meteoric rise to fame, from their humble hometown beginnings and competing on the X-Factor, to conquering the world and performing at London’s famed O2 Arena. Hear it from the boys themselves and see through their own eyes what it's really like to be One Direction.",
                "popularity": 1.2147,
                "poster_path": "/b720e7DW3nqRJaUH9xpTtvYhnUj.jpg",
                "release_date": "2013-08-28",
                "title": "One Direction: This Is Us",
                "video": false,
                "vote_average": 8.254,
                "vote_count": 1053,
                "character": "Self",
                "credit_id": "63c461160328b900da8a97f4",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "CR7",
            "Cristiano Ronaldo dos Santos Aveiro",
            "El Bicho",
            "C罗",
            "小小罗",
            "Aveiro",
            "CA5",
            "El Comandante",
            "Mr. Champions",
            "GOAT",
            "The G.O.A.T.",
            "کریستیانو رونالدو"
        ],
        "biography": "Cristiano Ronaldo dos Santos Aveiro GOIH ComM (Portuguese pronunciation: [kɾiʃˈtjɐnu ʁɔˈnaldu]; born 5 February 1985) is a Portuguese professional footballer who plays as a forward for and captains both Saudi Pro League club Al Nassr and the Portugal national team. Widely regarded as one of the greatest players of all time, Ronaldo has won five Ballon d'Or awards, a record three UEFA Men's Player of the Year Awards, and four European Golden Shoes, the most by a European player. He has won 33 trophies in his career, including seven league titles, five UEFA Champions Leagues, the UEFA European Championship and the UEFA Nations League. Ronaldo holds the records for most appearances (183), goals (140) and assists (42) in the Champions League, goals in the European Championship (14), international goals (128) and international appearances (206). He is one of the few players to have made over 1,200 professional career appearances, the most by an outfield player, and has scored over 890 official senior career goals for club and country, making him the top goalscorer of all time.",
        "birthday": "1985-02-05",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.cristianoronaldo.com/",
        "id": 1141894,
        "imdb_id": "nm1860184",
        "known_for_department": "Acting",
        "name": "Cristiano Ronaldo",
        "place_of_birth": "Funchal, Madeira, Portugal",
        "popularity": 0.3171,
        "profile_path": "/ty0FuQcOzl6ejhCqSiJcm1shRKy.jpg"
    }
}