{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3wwMtp2F7CgmOl2EX9q1r2yjOEk.jpg",
                "genre_ids": [
                    14,
                    35,
                    10749
                ],
                "id": 10849,
                "original_language": "en",
                "original_title": "The Purple Rose of Cairo",
                "overview": "Cecilia is a waitress in New Jersey, living a dreary life during the Great Depression. Her only escape from her mundane reality is the movie theatre. After losing her job, Cecilia goes to see 'The Purple Rose of Cairo' in hopes of raising her spirits, where she watches dashing archaeologist Tom Baxter time and again.",
                "popularity": 4.4532,
                "poster_path": "/ccsint43E44B7NGceEhVimD93Yt.jpg",
                "release_date": "1985-03-01",
                "title": "The Purple Rose of Cairo",
                "video": false,
                "vote_average": 7.399,
                "vote_count": 1084,
                "character": "Reporter",
                "credit_id": "61aaea530b5fd6001918247b",
                "order": 44
            },
            {
                "adult": false,
                "backdrop_path": "/le14c0VjhbBv475RAEQ13Wt2loo.jpg",
                "genre_ids": [
                    18,
                    80,
                    28
                ],
                "id": 10648,
                "original_language": "en",
                "original_title": "Magnum Force",
                "overview": "\"Dirty\" Harry Callahan is a San Francisco Police Inspector on the trail of a group of rogue cops who have taken justice into their own hands. When shady characters are murdered one after another in grisly fashion, only Dirty Harry can stop them.",
                "popularity": 3.2049,
                "poster_path": "/1uX1uzn09seCftG3rTGLPyFXxV6.jpg",
                "release_date": "1973-12-13",
                "title": "Magnum Force",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 1119,
                "character": "Reporter (uncredited)",
                "credit_id": "67f04329a9313c7184ad2abc",
                "order": 43
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Bob Trebor"
        ],
        "biography": "Born on June 7, 1953, in Philadelphia, Robert Trebor had a few bit roles before his career got going in the 1980s with small roles in such films as Gorp (1980), Turk 182 and The Purple Rose of Cairo (both 1985). His breakout role was as notorious “Son of Sam” serial killer Berkowitz in the CBS telepic Out of the Darkness (1985). The following year, Trebor had a key role opposite Roy Scheider and Ann-Margret in John Frankenheimer’s noir thriller 52 Pick-Up. During the next decade, he went on to big-screen roles in Making Mr. Right (1987), Talk Radio (1988), Universal Soldier (1992), and others.\n\nAlong the way, Trebor did guest shots on such popular TV series as Miami Vice, Murphy Brown, Baywatch, Night Court, Tales from the Crypt, and more. Then came his signature role: the friendly but sometimes unscrupulous salesman Salmoneus in Hercules: The Legendary Journeys, the 1995-99 syndicated action series starring Kevin Sorbo as the demigod son of Zeus. Trebor appeared in nearly two dozen episodes spanning all five seasons and played a different character, studio chief B.S. Hollingsfoffer, for one episode late in the show’s run. He reprised the Salmoneus character for several episodes of Hercules companion series Xena: Warrior Princess, starring Lucy Lawless.\n\nTrebor had mostly film roles after the turn of the century, appearing in Dying on the Edge (2001), Jiminy Glick in Lalawood, Meet Market (both 2004), The Devil’s Rejects (2005), and, in his final screen appearance, as a producer in the Coen brothers’ Hail Caesar! (2016).",
        "birthday": "1953-06-07",
        "deathday": "2025-03-11",
        "gender": 2,
        "homepage": null,
        "id": 114271,
        "imdb_id": "nm0871636",
        "known_for_department": "Acting",
        "name": "Robert Trebor",
        "place_of_birth": " Philadelphia, Pennsylvania, USA",
        "popularity": 0.1951,
        "profile_path": "/2oUhMyFu5HcYFR4Paq7ifqfId3z.jpg"
    }
}