{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sVWUcBHwq2LQtDeqwXzI1uMpA3h.jpg",
                "genre_ids": [
                    18
                ],
                "id": 471707,
                "original_language": "pl",
                "original_title": "Boże Ciało",
                "overview": "A pious 20-year-old juvenile delinquent is sent to work at a sawmill in a small town; on arrival, he dresses up as a priest and accidentally takes over the local parish. The arrival of this young, charismatic preacher is an opportunity for the local community to begin the healing process after a tragedy that happened a year prior.",
                "popularity": 2.622,
                "poster_path": "/aUM9CZLwvbgTMiYducW3rBoqDyd.jpg",
                "release_date": "2019-09-10",
                "title": "Corpus Christi",
                "video": false,
                "vote_average": 7.644,
                "vote_count": 571,
                "character": "Father #4",
                "credit_id": "6855814219fbdc8aed1e24b7",
                "order": 37
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "1983 Wykształcenie - rok ukończenia studiów PWST w Krakowie\n\n1983. 09. 24 Debiut teatralny\n\n1992 Nagroda wyróżnienie za rolę Johnniego w \"Dzień dobry i do widzenia\" Fugarda na XXVII Ogólnopolskim Przeglądzie Teatrów Małych Form w Szczecinie\n\n1997 Nagroda \"Złota Maska\" za rolę Walpurga w \"Wariacie i zakonnicy\" w Teatrze im. Wyspiańskiego\n\n1997 Nagroda wyróżnienie za rolę Mefistofela w spektaklu\"Ballady i romanse\" na XXII Opolskich Konfrontacjach Teatralnych \"Klasyka Polska\"\n\nOd 1994 aktor Teatru Śląskiego im. Wyspiańskiego w Katowicach. Jego droga do śląskiej sceny wiodła przez Teatr Dramatyczny w Warszawie, Teatr im. Słowackiego w Krakowie i Teatr Polski w Bydgoszczy.  Od 1994 aktor Teatru Śląskiego im. Wyspiańskiego w Katowicach. Jego droga do śląskiej sceny wiodła przez Teatr Dramatyczny w Warszawie, Teatr im. Słowackiego w Krakowie i Teatr Polski w Bydgoszczy.",
        "birthday": "1955-01-01",
        "deathday": null,
        "gender": 0,
        "homepage": null,
        "id": 1142964,
        "imdb_id": "nm0913213",
        "known_for_department": "Acting",
        "name": "Juliusz Krzysztof Warunek",
        "place_of_birth": "Kraków, Poland",
        "popularity": 0.0264,
        "profile_path": "/a0pLAUmG04cq0XPjjsLu3gjfTbv.jpg"
    }
}