{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ruF3Lmd4A8MHbnEBE6lxPMbsHGL.jpg",
                "genre_ids": [
                    9648,
                    18
                ],
                "id": 15,
                "original_language": "en",
                "original_title": "Citizen Kane",
                "overview": "Newspaper magnate Charles Foster Kane is taken from his mother as a boy and made the ward of a rich industrialist. As a result, every well-meaning, tyrannical or self-destructive move he makes for the rest of his life appears in some way to be a reaction to that deeply wounding event.",
                "popularity": 6.1449,
                "poster_path": "/sav0jxhqiH0bPr2vZFU0Kjt2nZL.jpg",
                "release_date": "1941-04-17",
                "title": "Citizen Kane",
                "video": false,
                "vote_average": 8.0,
                "vote_count": 5751,
                "character": "Extra (uncredited)",
                "credit_id": "549d3bbcc3a3682f16005694",
                "order": 21
            },
            {
                "adult": false,
                "backdrop_path": "/9AjG0YJLgDUtHl5KgrThHPhNNwZ.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 3083,
                "original_language": "en",
                "original_title": "Mr. Smith Goes to Washington",
                "overview": "After the death of a United States Senator, idealistic Jefferson Smith is appointed as his replacement in Washington. Soon, the naive and earnest new senator has to battle political corruption.",
                "popularity": 2.8661,
                "poster_path": "/nDjg1fbNyq15excNDl3acd2IqAk.jpg",
                "release_date": "1939-10-19",
                "title": "Mr. Smith Goes to Washington",
                "video": false,
                "vote_average": 7.846,
                "vote_count": 1117,
                "character": "Diggs (uncredited)",
                "credit_id": "555f24889251417e4f002871",
                "order": 83
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Maurice George Costello"
        ],
        "biography": "From Wikipedia\n\nMaurice George Costello (February 22, 1877 – October 29, 1950) was an American prominent vaudeville actor of the late 1890s and early 1900s, who later played a principal role in early American films, as both a leading man, supporting player and a director.\n\nCostello was born in Pittsburgh, Pennsylvania to Irish immigrants Ellen and Thomas Costello. He appeared in his first motion picture in 1905, in which he had the honour of appearing in the first serious film to feature the character of Sherlock Holmes in the movie Adventures of Sherlock Holmes, in which Costello played the title role. He continued to work for Vitagraph, being a member of the first motion picture stock company ever formed, playing opposite Florence Turner. Among some of his best known pictures are A Tale of Two Cities, The Man Who Couldn't Beat God and For the Honor of the Family. After an absence of some years he returned to the screen. He was married to actress Mae Costello (née Altschuk). His descendants include two daughters, actresses Dolores Costello and Helene Costello, a grandson John Drew Barrymore, and a great granddaughter Drew Barrymore. He was one of the world's first leading men in early American cinema, but like a lot of other silent screen stars, he found the transition to \"talkies\" extremely difficult, and his leading man status was over. However, Costello was a trouper, and continued to appear in movies, often in small roles and bit parts, right up until his death in 1950.",
        "birthday": "1877-02-20",
        "deathday": "1950-10-29",
        "gender": 2,
        "homepage": null,
        "id": 1142371,
        "imdb_id": "nm0007221",
        "known_for_department": "Acting",
        "name": "Maurice Costello",
        "place_of_birth": "Pittsburgh, Pennsylvania, USA",
        "popularity": 0.1452,
        "profile_path": "/92Q6cg7efdgMrmNbGNXBoF2hrpB.jpg"
    }
}