{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/q2Ev0aXGXm5Hnm12TVtvdgNhMnv.jpg",
                "genre_ids": [
                    36,
                    18,
                    12
                ],
                "id": 285783,
                "original_language": "en",
                "original_title": "The Walk",
                "overview": "The story of French high-wire artist Philippe Petit's attempt to cross the Twin Towers of the World Trade Center in 1974.",
                "popularity": 2.3865,
                "poster_path": "/tiESRqurrZwAC0hpERogOsBhjeg.jpg",
                "release_date": "2015-09-30",
                "title": "The Walk",
                "video": false,
                "vote_average": 6.995,
                "vote_count": 3270,
                "character": "Woman in Chalk Circle",
                "credit_id": "584d4d52c3a3682ad4009ea3",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Inka was born in Bosnia, grew up in Algeria and with the outbreak of war, settled with her family in Canada. Thanks to her rich and nomadic upbringing, she is a polyglot who developed a fascination for human behaviour and a passion for acting at a young age, winning \"the outstanding actress award\" and voted \"most likely to win an Oscar,\" at her high school's intensive theatre program in North-Vancouver BC.\n\nShe's had the privilege to work with Oscar-winning Robert Zemeckiss' The Walk (2015) opposite Joseph Gordon-Levitt and caught the eye of multi award-winning Denis Côté who cast her in two of his features, Vic + Flo Saw a Bear (2013) and Boris Without Béatrice (2016). In 2015, she landed her first Bosnian role, playing Svetlena in award-winning director Igor Drljaca's The Waiting Room (2015) which screened at numerous film festivals including TIFF.\n\nAlongside her acting career, Inka is a professional dancer, specializing in Cuban Rhythms. She has performed in numerous cities all over Canada, either solo or for companies like Estilo Cubano, Drum Café, and Vision Diversité.\n\nA real chameleon and character actress, Inka is paving a prolific international career, splitting her time between Montreal, Toronto, Vancouver, LA and Europe.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.agencedelauniere.com/comediennes/inka-malovic",
        "id": 1142295,
        "imdb_id": "nm3600570",
        "known_for_department": "Acting",
        "name": "Inka Malovic",
        "place_of_birth": "Bosnia ",
        "popularity": 0.1115,
        "profile_path": "/lpoouk7ctR7xmZmRBPp7nLm6LER.jpg"
    }
}