{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1GZCV0dwIoAn6jpWPfVAbeMTVC2.jpg",
                "genre_ids": [
                    12,
                    10751,
                    18
                ],
                "id": 481848,
                "original_language": "en",
                "original_title": "The Call of the Wild",
                "overview": "Buck is a big-hearted dog whose blissful domestic life is turned upside down when he is suddenly uprooted from his California home and transplanted to the exotic wilds of the Yukon during the Gold Rush of the 1890s. As the newest rookie on a mail delivery dog sled team—and later its leader—Buck experiences the adventure of a lifetime, ultimately finding his true place in the world and becoming his own master.",
                "popularity": 5.5757,
                "poster_path": "/33VdppGbeNxICrFUtW2WpGHvfYc.jpg",
                "release_date": "2020-02-19",
                "title": "The Call of the Wild",
                "video": false,
                "vote_average": 7.537,
                "vote_count": 3846,
                "character": "Second Rail Worker",
                "credit_id": "5f85e318afe2240037193efa",
                "order": 33
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Originally from Chicago, Paul Mabon grew up having a front row seat to some of the best theater the city had to offer. Being the the son of an accomplished actor, Paul Mabon Sr., the seed was planted for a career in acting.\n\nInevitably, Paul moved to Los Angeles to pursue a television and film career. Once in Los Angeles, Paul continued to hone his acting skills by earning roles in plays in much larger theaters, sketch comedy troupes, television shows, and national and international television commercials.\n\nPaul is also an avid poet and has appeared on Season V of Russell Simmons presents Def Poetry.\n\nOne of his most meaningful accomplishments was earning a lifetime membership to The Actors Studio.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1143952,
        "imdb_id": "nm3379735",
        "known_for_department": "Acting",
        "name": "Paul Mabon",
        "place_of_birth": null,
        "popularity": 0.1745,
        "profile_path": "/f1vrCMrJaka9s44Ib8dYuHIp9wp.jpg"
    }
}