{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/g3yflwqajsVEYdUr7B84fMHBkAw.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 329805,
                "original_language": "fr",
                "original_title": "Mon roi",
                "overview": "Tony is admitted to a rehabilitation center after a serious ski accident. Dependent on the medical staff and pain relievers, she takes time to look back on a turbulent relationship that she experienced with Georgio.",
                "popularity": 2.3585,
                "poster_path": "/kOhRkC7J3jpAgHGC0Uh3SoCqU4c.jpg",
                "release_date": "2015-10-21",
                "title": "My King",
                "video": false,
                "vote_average": 7.142,
                "vote_count": 793,
                "character": "Nico",
                "credit_id": "570db5a19251415e2c00045c",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Norman Jacky Cyril Thavaud (born 14 April 1987) also known as the channel name Norman fait des vidéos (Norman makes videos), is a French comedian and blogger known for his short comic YouTube videos. Several of his videos have been viewed tens of millions of times.\n\nNorman was born on 14 April 1987 in Arras, France. His mother was a history and geography teacher and his father, Jackie Thavaud, was a culture promoter and head of a local cinema school. As a child, Norman played the saxophone for seven years in a conservatory. He also made numerous videos using his father's camera. Having gained his high school baccalaureate in 2005, Norman moved to Paris in order to study cinema. He had a succession of jobs before becoming a video montage specialist.\n\nNorman met Hugo Dessioux (alias Hugo tout seul) at college and they formed the \"Le Velcrou\" comedic group in March 2008. \"Le Velcrou\" regularly posted comical videos on the Dailymotion website. Four months later, Marc Jarousseau (alias Kemar), a friend from university, joined the team.\n\nThanks to Le Velcrou, Norman met Cyprien Iov (alias Monsieur Dream), another video blogger, who appeared in a few of Le Velcrou's videos. In December of the same year, Cyprien created \"Super Mega Noël\", a short humorous film about Christmas. Cyprien featured other bloggers in his work, including Hugo and Norman.\n\nIn July 2009, Norman was awarded a degree in cinematography from University Paris-1 Panthéon-Sorbonne. Le Velcrou broke up in October 2010. Since then, the group's former members have been producing solo videos.\n\nAt the end of 2010, Norman launched a new format: short video sequences of about 4 minutes long, in which he embodied \"mister average\" and dealt with daily life subjects, as seen in his first one-man video titled \"Table tennis club\". His account was created on January 3, 2011. Two months later, he posted what became at the time his most popular video, \"The bilinguals\", marking the beginning of his notoriety. It was subsequently surpassed in views by the \"Now, I have Google\" video, among others. \"Luigi Clash Mario\" is today his most viewed video, with over 86 million views as of March, 2021. Norman records his videos in his Parisian flat where he lives with his flatmate and his two cats (Sergi, who often appears in his videos, and Becassine).\n\nHis videos have been viewed billions of times, enabling him to be paid by the YouTube internet website and to attract national media attention. Several media outlets have called him a \"web phenomenon\", including reporter Eric Loret who described Norman and his partners, Cyprien and Hugo Dessioux (who have launched the same format as Norman), as having the advantage of being \"young artists who are really good at business and communication, able to manage all strategic decisions with the biggest candour.\" ...\n\nSource: Article \"Norman Thavaud\" from Wikipedia in English, licensed under CC-BY-SA.",
        "birthday": "1987-04-14",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1145002,
        "imdb_id": "nm5004095",
        "known_for_department": "Acting",
        "name": "Norman Thavaud",
        "place_of_birth": "Arras, Pas-de-Calais, France",
        "popularity": 0.0733,
        "profile_path": "/uozzSwX2ADdLAmUuxbodq8PDdt6.jpg"
    }
}