{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7e9uENnSM93CQXyzLSuzBUgxm4P.jpg",
                "genre_ids": [
                    99,
                    10402
                ],
                "id": 164558,
                "original_language": "en",
                "original_title": "One Direction: This Is Us",
                "overview": "\"One Direction: This Is Us\" is a captivating and intimate all-access look at life on the road for the global music phenomenon. Weaved with stunning live concert footage, this inspiring feature film tells the remarkable story of Niall, Zayn, Liam, Harry and Louis' meteoric rise to fame, from their humble hometown beginnings and competing on the X-Factor, to conquering the world and performing at London’s famed O2 Arena. Hear it from the boys themselves and see through their own eyes what it's really like to be One Direction.",
                "popularity": 1.2147,
                "poster_path": "/b720e7DW3nqRJaUH9xpTtvYhnUj.jpg",
                "release_date": "2013-08-28",
                "title": "One Direction: This Is Us",
                "video": false,
                "vote_average": 8.254,
                "vote_count": 1053,
                "character": "Self",
                "credit_id": "52fe4c7bc3a36847f82309b7",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "ZAYN",
            "Зейн Малік",
            "Zayn Malik"
        ],
        "biography": "Zain Javadd Malik (born 12 January 1993), who records mononymously as ZAYN, is an English singer and songwriter. In 2010, Malik auditioned as a solo artist for the British reality television music competition, \"The X Factor\". After being eliminated as a solo performer, Malik was brought back into the competition, along with Harry Styles, Niall Horan, Liam Payne, and Louis Tomlinson, to form the boy band 'One Direction'. During his time in the group, Malik and his bandmates released the albums Up All Night (2011), Take Me Home (2012), Midnight Memories (2013), and Four (2014). In March 2015, Malik's representative announced the singer's departure from the band.\n\nDescription above is from the Wikipedia article Zayn Malik, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1993-01-12",
        "deathday": null,
        "gender": 2,
        "homepage": "http://inzayn.com/",
        "id": 1146050,
        "imdb_id": "nm4098557",
        "known_for_department": "Acting",
        "name": "Zayn Malik",
        "place_of_birth": "Bradford, West Yorkshire, England, UK ",
        "popularity": 0.3622,
        "profile_path": "/AmVsOV2WGnHWLkpsUvpbPNZoBAf.jpg"
    }
}