{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qBayL198ACrAVX9ixzFPYtqvxQX.jpg",
                "genre_ids": [
                    27
                ],
                "id": 764,
                "original_language": "en",
                "original_title": "The Evil Dead",
                "overview": "In 1979, a group of college students find a Sumerian Book of the Dead in an old wilderness cabin they've rented for a weekend getaway.",
                "popularity": 5.8375,
                "poster_path": "/54C1qdaiSijIU5NeNb4WsPJdNkG.jpg",
                "release_date": "1981-10-15",
                "title": "The Evil Dead",
                "video": false,
                "vote_average": 7.276,
                "vote_count": 4227,
                "character": "Shelly",
                "credit_id": "66186586af3da6016317fa73",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Sarah York",
            "Theresa Mary Catherine Seyferth",
            "테레사 틸리"
        ],
        "biography": "Theresa Tilly made a monstrous feature film debut as Shelly in Sam Raimi's influential classic, The Evil Dead (1981). After working as a stand-up comedian in her hometown of Detroit, she set her sights on acclaimed improv comedy troupe The Second City Chicago. Her work there earned her a role on a sketch comedy pilot called YouTV, co-starring alongside late-night TV legend Steve Allen. Although the show was not picked up, it served as an impetus for the budding performer to move to Los Angeles in order to pursue her acting career.\n\nTilly has since appeared in over 100 films, TV shows, plays, and commercials, including: Debutante (1998), opposite Selma Blair and Josh Hartnett; Back in the Day (2014), written and directed by actor Michael Rosenbaum; Appearances, a PBS special written by celebrated author Elmore Leonard; Brutal Massacre: A Comedy (2007), alongside the late horror icon Gunnar Hansen; and Oz The Great and Powerful (2013), which reunited her with The Evil Dead director Sam Raimi. She was also the first female to announce ESPN's ESPY Awards.",
        "birthday": "1953-11-06",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 11465,
        "imdb_id": "nm0863462",
        "known_for_department": "Acting",
        "name": "Theresa Tilly",
        "place_of_birth": "Detroit, Michigan, USA",
        "popularity": 0.1717,
        "profile_path": "/dArbS5OBk1pyBOu74HlzkIuCSss.jpg"
    }
}