{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wFbPbJ9uRDpjY7micBTeolgkOA4.jpg",
                "genre_ids": [
                    18,
                    27,
                    878
                ],
                "id": 3035,
                "original_language": "en",
                "original_title": "Frankenstein",
                "overview": "Tampering with life and death, Henry Frankenstein pieces together salvaged body parts to bring a human monster to life; the mad scientist's dreams are shattered by his creation's violent rage as the monster awakens to a world in which he is unwelcome.",
                "popularity": 5.6174,
                "poster_path": "/mu6wHwH0IwCCaEYtpqujuPJYat1.jpg",
                "release_date": "1931-11-21",
                "title": "Frankenstein",
                "video": false,
                "vote_average": 7.464,
                "vote_count": 1679,
                "character": "Little Maria",
                "credit_id": "558728e39251411dec00585b",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/hrED8MSOn4xJP9Cpk7WomUcFKGI.jpg",
                "genre_ids": [
                    27,
                    878
                ],
                "id": 229,
                "original_language": "en",
                "original_title": "Bride of Frankenstein",
                "overview": "Dr. Frankenstein and his monster both turn out to be alive, not killed as previously believed. Dr. Frankenstein wants to get out of the evil experiment business, but when a mad scientist, Dr. Pretorius, kidnaps his wife, Dr. Frankenstein agrees to help him create a new creature.",
                "popularity": 2.9539,
                "poster_path": "/5241zUwe7rC17MNc2QpCBKKdp1N.jpg",
                "release_date": "1935-04-20",
                "title": "Bride of Frankenstein",
                "video": false,
                "vote_average": 7.509,
                "vote_count": 1037,
                "character": "Girl (uncredited)",
                "credit_id": "55a5dddb925141099b0007c4",
                "order": 35
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nMarilyn Harris (July 17, 1924 – December 1, 1999) was an American child actress who appeared in several Hollywood productions in the 1930s and 1940s. She is best remembered for her role as \"Little Maria\" in the 1931 horror film Frankenstein.  Harris was born in San Fernando, California and placed in a Los Angeles orphanage shortly after her birth. She was adopted by an area couple when she was a month old. Shortly after her adoption, she appeared in a Rin Tin Tin film. In her later years, Harris revealed that her adoptive mother forced her to pursue a screen career because of her own failed attempts to become an actress. Harris also claimed that her mother was physically and emotionally abusive.\n\nIn 1931, Harris won the role of \"Little Maria\" in the horror film Frankenstein. In arguably the film's most memorable scene, Maria meets the fugitive monster (played by Boris Karloff) beside a lakeside and charms the monster with her innocence, humanity and friendship, something which he had not experienced with previously hostile, mistrusting adults. A children's game is however tragically misinterpreted by the monster, and he ends up throwing Little Maria into the lake, unintentionally drowning her and turning the surrounding village's population into a lynch mob, baying for revenge after the child's body is found. The shot of Maria being thrown into the water was cut from original prints and only restored in the 1980s.\n\nAfter appearing in Frankenstein, Harris continued her career in small roles in films. She left acting at the age of 19 shortly after marrying Wally Watkins, a bouncer she met while working as a cashier at the Hollywood Palladium. The couple had a son the following year. After Harris' husband died in 1981, she remarried. Harris' second husband, Carl, died in 1988. In 1983, 52 years after the film, Harris resumed a friendship with Frankenstein actress Mae Clarke who resided at the Motion Picture & Television Country House and Hospital. Clarke had put out a televised effort to locate Marilyn Harris during an interview with LA movie host Tom Hatton.",
        "birthday": "1924-07-17",
        "deathday": "1999-12-01",
        "gender": 1,
        "homepage": null,
        "id": 1146154,
        "imdb_id": "nm0365048",
        "known_for_department": "Acting",
        "name": "Marilyn Harris",
        "place_of_birth": "San Fernando, California, USA",
        "popularity": 0.0659,
        "profile_path": "/oLtNJklY7V6O0W0ZXwvmFsLCBch.jpg"
    }
}