{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sw7mordbZxgITU877yTpZCud90M.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 769,
                "original_language": "en",
                "original_title": "GoodFellas",
                "overview": "The true story of Henry Hill, a half-Irish, half-Sicilian Brooklyn kid who is adopted by neighbourhood gangsters at an early age and climbs the ranks of a Mafia family under the guidance of Jimmy Conway.",
                "popularity": 15.4085,
                "poster_path": "/aKuFiU82s5ISJpGZp7YkIr3kCUd.jpg",
                "release_date": "1990-09-12",
                "title": "GoodFellas",
                "video": false,
                "vote_average": 8.5,
                "vote_count": 13626,
                "character": "Sonny Bunz",
                "credit_id": "52fe4274c3a36847f801fd37",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/6zfPDvqeZUleXjNaU5iWQwHUtCN.jpg",
                "genre_ids": [
                    35,
                    80
                ],
                "id": 11382,
                "original_language": "en",
                "original_title": "Bullets Over Broadway",
                "overview": "After young playwright, David Shayne obtains funding for his play from gangster Nick Valenti, Nick's girlfriend Olive miraculously lands the role of a psychiatrist—but not only is she a bimbo who could never pass for a psychiatrist—she's a dreadful actress. David puts up with the leading man who is a compulsive eater, the grand dame who wants her part jazzed up, and Olive's interfering hitman/bodyguard—but, eventually he must decide whether art or life is more important.",
                "popularity": 3.4403,
                "poster_path": "/mY9D1oCLeDKNMdUO8EV7MoCZ3up.jpg",
                "release_date": "1994-10-14",
                "title": "Bullets Over Broadway",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 639,
                "character": "Aldo",
                "credit_id": "5b799690c3a36860ea02f576",
                "order": 51
            },
            {
                "adult": false,
                "backdrop_path": "/qfJ6aJKRPUZ7kYOp7iuzl5jkyX5.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 2639,
                "original_language": "en",
                "original_title": "Deconstructing Harry",
                "overview": "Writer Harry Block draws inspiration from people he knows, and from events that happened to him, sometimes causing these people to become alienated from him as a result.",
                "popularity": 4.3178,
                "poster_path": "/i7Z5DdznqANJUjqWISEFu9bw6J7.jpg",
                "release_date": "1997-12-12",
                "title": "Deconstructing Harry",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 995,
                "character": "Camera Operator",
                "credit_id": "60c4114a5cc11d006e63a6e2",
                "order": 40
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Anthony Borgese"
        ],
        "biography": "Tony Darrow (born Anthony Borgese; October 1, 1938) is an Italian-American actor.\n\nDarrow was born in the East New York section of Brooklyn. Darrow had plenty of opportunity to observe would-be mobsters and their attitudes while growing up in his neighborhood in Brooklyn. As a teenager, he gravitated towards show business, entering and winning talent shows while working odd jobs.\n\nAfter ten years of singing in nightclubs, Darrow received an offer to appear in what turned out to be a cult film, Street Trash in which he played a mobster. Several months after Street Trash, Darrow was contacted by the film director Martin Scorsese. It turned out that Scorsese had seen Street Trash and wanted him to audition for a role in Goodfellas. He was successful and was cast as the owner of the Bamboo Lounge, Sonny. Darrow was also in the Woody Allen films Bullets over Broadway, Mighty Aphrodite, Deconstructing Harry, Small Time Crooks and Sweet and Lowdown.\n\nIn 1999, Darrow played a large role in Analyze This with Robert De Niro and Billy Crystal. The following year, he appeared in Mickey Blue Eyes with Hugh Grant, and got another big role as mobster Larry Barese in the HBO hit series The Sopranos, which he was on for the entire series run (1999–2007). More recently, Darrow starred in the independent film Lynch Mob.",
        "birthday": "1938-10-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 11482,
        "imdb_id": "nm0201700",
        "known_for_department": "Acting",
        "name": "Tony Darrow",
        "place_of_birth": "Brooklyn, New York, USA",
        "popularity": 0.3847,
        "profile_path": "/kc6cGKm2yYx5ekHo4zGizhMLBge.jpg"
    }
}