{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ft8WRF2xqEwwGWa59naDUybKTAx.jpg",
                "genre_ids": [
                    18,
                    10752,
                    10749
                ],
                "id": 770,
                "original_language": "en",
                "original_title": "Gone with the Wind",
                "overview": "The spoiled daughter of a Georgia plantation owner conducts a tumultuous romance with a cynical profiteer during the American Civil War and Reconstruction Era.",
                "popularity": 7.332,
                "poster_path": "/lNz2Ow0wGCAvzckW7EOjE03KcYv.jpg",
                "release_date": "1939-12-15",
                "title": "Gone with the Wind",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 4191,
                "character": "Ashley Wilkes",
                "credit_id": "52fe4274c3a36847f801fe27",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Leslie Howard Steiner"
        ],
        "biography": "Leslie Howard Steiner (3 April 1893 – 1 June 1943) was an English actor, director and producer. He wrote many stories and articles for The New York Times, The New Yorker, and Vanity Fair and was one of the biggest box-office draws and movie idols of the 1930s.\n\nActive in both Britain and Hollywood, Howard played Ashley Wilkes in Gone with the Wind (1939). He had roles in many other films, often playing the quintessential Englishman, including Berkeley Square (1933), Of Human Bondage (1934), The Scarlet Pimpernel (1934), The Petrified Forest (1936), Pygmalion (1938), Intermezzo (1939), \"Pimpernel\" Smith (1941), and The First of the Few (1942). He was nominated for the Academy Award for Best Actor for Berkeley Square and Pygmalion.\n\nHoward's World War II activities included acting and filmmaking. He helped to make anti-German propaganda and shore up support for the Allies—two years after his death the British Film Yearbook described Howard's work as \"one of the most valuable facets of British propaganda\". He was rumoured to have been involved with British or Allied Intelligence, sparking conspiracy theories regarding his death in 1943 when the Luftwaffe shot down BOAC Flight 777 over the Atlantic (off the coast of Cedeira, A Coruña), on which he was a passenger.\n\nDescription above from the Wikipedia article Leslie Howard, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1893-04-03",
        "deathday": "1943-06-01",
        "gender": 2,
        "homepage": null,
        "id": 11493,
        "imdb_id": "nm0001366",
        "known_for_department": "Acting",
        "name": "Leslie Howard",
        "place_of_birth": "Forest Hill, London, England, UK",
        "popularity": 0.3269,
        "profile_path": "/mlD06Vq50FnNvEPI8GcWKZ8C1BG.jpg"
    }
}