{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ft8WRF2xqEwwGWa59naDUybKTAx.jpg",
                "genre_ids": [
                    18,
                    10752,
                    10749
                ],
                "id": 770,
                "original_language": "en",
                "original_title": "Gone with the Wind",
                "overview": "The spoiled daughter of a Georgia plantation owner conducts a tumultuous romance with a cynical profiteer during the American Civil War and Reconstruction Era.",
                "popularity": 7.332,
                "poster_path": "/lNz2Ow0wGCAvzckW7EOjE03KcYv.jpg",
                "release_date": "1939-12-15",
                "title": "Gone with the Wind",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 4191,
                "character": "Mammy",
                "credit_id": "52fe4274c3a36847f801fe3f",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Hattie McDaniels"
        ],
        "biography": "Hattie McDaniel (June 10, 1893 - October 26, 1952) was an American actress whose portrayal of Mammy in Gone with the Wind (1939) won her the Oscar for Best Supporting Actress, making her the first black person to win an Academy Award.\n\nAfter working as early as the 1910s as a band vocalist, Hattie McDaniel debuted as a maid in The Golden West (1932). Her maid-mammy characters became steadily more assertive, showing up first in Judge Priest (1934) and becoming pronounced in Alice Adams (1935). In this one, directed by George Stevens and aided and abetted by star Katharine Hepburn, she makes it clear she has little use for her employers' pretentious status seeking. By The Mad Miss Manton (1938) the character she portrays actually tells off her socialite employer Barbara Stanwyck and her snooty friends. This path extends into the greatest role of McDaniel's career, Mammy in Gone with the Wind (1939). Mammy is, in a number of ways, superior to most of the white folk surrounding her.\n\nFrom that point, McDaniel's roles unfortunately descended, with the characters becoming more and more menial. McDaniel played on the \"Amos and Andy\" and Eddie Cantor radio shows in the 1930s and 1940s, the title character in her own radio show \"Beulah\" (1947-51), and the same part on TV (Beulah, 1950).",
        "birthday": "1893-06-10",
        "deathday": "1952-10-26",
        "gender": 1,
        "homepage": null,
        "id": 11498,
        "imdb_id": "nm0567408",
        "known_for_department": "Acting",
        "name": "Hattie McDaniel",
        "place_of_birth": "Wichita, Kansas, USA",
        "popularity": 0.2241,
        "profile_path": "/cw4t51HdjPUcry2MRv652t36985.jpg"
    }
}