{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/94cS0mzODEoNIXFT7nhPcI8V4IJ.jpg",
                "genre_ids": [
                    878,
                    28,
                    12
                ],
                "id": 842675,
                "original_language": "zh",
                "original_title": "流浪地球2",
                "overview": "Humans built huge engines on the surface of the earth to find a new home. But the road to the universe is perilous. In order to save earth, young people once again have to step forward to start a race against time for life and death.",
                "popularity": 6.3231,
                "poster_path": "/jAZzFYS36UFT0SKhKVmEY7qShal.jpg",
                "release_date": "2023-01-22",
                "title": "The Wandering Earth II",
                "video": false,
                "vote_average": 7.296,
                "vote_count": 648,
                "character": "太空电梯袭击者",
                "credit_id": "63d2082bcb71b800a10d2e81",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Lee Seong-Min",
            "Clara",
            "클라라",
            "Lee Sung-min",
            "이성민",
            "李成敏",
            "克拉拉",
            "クララ",
            "イ・ソンミン",
            "Clara Lee Sung-min",
            "کلارا لی"
        ],
        "biography": "Lee Sung Min, born in Switzerland, is a British model and actress, based in South Korea, represented by EYAGI Entertainment.\n\nLee Sung Min made her entertainment debut under her birth name in 2005 and starred in her first film in 2009, called Five Senses of Eros. In January of 2012, she announced at a press conference for the drama series, Take Care of Us, Captain that she will be going by her new stage name Clara. The reason for such a choice was because Clara felt that her birth name Sung Min was too \"male-sounding\" and that her English name had always been Clara.\n\nIn May 2013, Clara became an overnight sensation online after throwing a ceremonial first pitch in a professional baseball game dressed in form-fitting leggings. She has since been hailed as an up-and-coming star. Afterward, she again played supporting roles in the television series Goddess of Marriage (2013) and Emergency Couple (2014), followed by a leading role in the romance comedy film Casa Amor: Exclusive for Ladies (2015).\n\nClara is the daughter of singer Lee Seung Kyu, a former member of the bilingual band, Koreana. In January 2019, she announced her marriage to a Korean-American businessman Samuel Huang.",
        "birthday": "1985-01-15",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.koreanaclara.com/",
        "id": 1149923,
        "imdb_id": "nm4788761",
        "known_for_department": "Acting",
        "name": "Clara Lee",
        "place_of_birth": "Bern, Switzerland",
        "popularity": 0.7196,
        "profile_path": "/rCu6AzXrPpuAC5THKlO4EQFRGOb.jpg"
    }
}