{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ft8WRF2xqEwwGWa59naDUybKTAx.jpg",
                "genre_ids": [
                    18,
                    10752,
                    10749
                ],
                "id": 770,
                "original_language": "en",
                "original_title": "Gone with the Wind",
                "overview": "The spoiled daughter of a Georgia plantation owner conducts a tumultuous romance with a cynical profiteer during the American Civil War and Reconstruction Era.",
                "popularity": 7.332,
                "poster_path": "/lNz2Ow0wGCAvzckW7EOjE03KcYv.jpg",
                "release_date": "1939-12-15",
                "title": "Gone with the Wind",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 4191,
                "character": "Carreen O'Hara",
                "credit_id": "52fe4274c3a36847f801fe33",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Therese Ann Rutherford"
        ],
        "biography": "Ann Rutherford was born in Vancouver, British Columbia, Canada. The daughter of a former Metropolitan Opera singer, John Rutherford, and her actress mother, Lillian Mansfield, Ann was destined for show business. Not long after her birth, her family moved to California, where she made her stage debut in 1925.\n\nAnn appeared in many plays and on radio for the next nine years before making her first screen appearance in Waterfront Lady (1935). Ann's talent was readily apparent, and she was signed to three films in 1935: Waterfront Lady (1935), Melody Trail (1935), and The Fighting Marines (1935). By now, she was a leading lady in the fabled Westerns with two legends, John Wayne and Gene Autry.\n\nBy the time Ann was 17, she inked a deal with MGM, where she would gain the status of superstar for her portrayal of Polly Benedict in the popular Andy Hardy series with Mickey Rooney. Ann's first role as Polly was in 1938, in You're Only Young Once (1937). Three more Hardy films were produced that same year: Out West with the Hardys (1938), Love Finds Andy Hardy (1938), and Judge Hardy's Children (1938). Ann found time to play in other productions, too. One that is still loved today is the Charles Dickens' classic A Christmas Carol (1938), in which she played the sweet role of the Spirit of Christmas Past.\n\nIn 1939, Ann played the role of Annie Hawks in Of Human Hearts (1938) in addition to three more Andy Hardy films. But that year also saw Ann land a role in the most popular film in film history. She played Careen O'Hara, Scarlett's little sister, in Gone with the Wind (1939). Plenty of fans of the Andy Hardy series went to see it just for Ann. The film was unquestionably a super hit. Ann then resumed making other movies.\n\nWhile working for MGM, Ann, along with the other stars, was under the watchful eye of movie mogul Louis B. Mayer. The bottom line was profit, and Mayer kept performers' salaries minimized as much as possible. Most tried to get raises and failed. Even Mickey Rooney was decidedly underpaid during his glory years at MGM. But not Ann Rutherford. When she asked for a raise, she took out her bankbook and, showing him the amount it contained, told Mayer she had promised her mother a new house. Ann got her raise.\n\nIn 1942 at the age of 22, Ann appeared in her last Andy Hardy film, Andy Hardy's Double Life (1942). She then left MGM and freelanced her talent. Ann was still in demand. In 1943, she appeared in Happy Land (1943), but it was a little later in her career when she appeared in two big hits. In 1947, she played Gertrude Griswold in The Secret Life of Walter Mitty, and Donna Elena in Adventures of Don Juan in 1948.\n\nAfter that, Ann appeared in several TV programs and didn't return to the silver screen until 1972, in They Only Kill Their Masters (1972). Her last role came in 1976 in the dismal Won Ton Ton: The Dog Who Saved Hollywood (1976), whereupon she retired. Ann was approached to play the older Rose in 1998's mega hit Titanic (1997) but turned it down. She happily enjoyed her retirement being constantly deluged with fan mail and granting several interviews and appearances.\n\nAnn Rutherford died at her Beverly Hills home on June 11, 2012 with her close friend Anne Jeffreys by her side. She was 94 years old.",
        "birthday": "1917-11-02",
        "deathday": "2012-06-11",
        "gender": 1,
        "homepage": null,
        "id": 11495,
        "imdb_id": "nm0751946",
        "known_for_department": "Acting",
        "name": "Ann Rutherford",
        "place_of_birth": "Vancouver, British Columbia, Canada",
        "popularity": 0.35,
        "profile_path": "/q897iqz4hhZjTMrdarx6Zvn2InO.jpg"
    }
}