{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ft8WRF2xqEwwGWa59naDUybKTAx.jpg",
                "genre_ids": [
                    18,
                    10752,
                    10749
                ],
                "id": 770,
                "original_language": "en",
                "original_title": "Gone with the Wind",
                "overview": "The spoiled daughter of a Georgia plantation owner conducts a tumultuous romance with a cynical profiteer during the American Civil War and Reconstruction Era.",
                "popularity": 7.332,
                "poster_path": "/lNz2Ow0wGCAvzckW7EOjE03KcYv.jpg",
                "release_date": "1939-12-15",
                "title": "Gone with the Wind",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 4191,
                "character": "Prissy",
                "credit_id": "52fe4274c3a36847f801fe47",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Thelma \"Butterfly\" McQueen  was an American actress.  Originally a dancer, McQueen first appeared in film in 1939 as Prissy, Scarlett O'Hara's maid, in the film Gone with the Wind. She was unable to attend the movie's premiere because it was held at a whites-only theater. Often typecast as a maid, she said: \"I didn't mind playing a maid the first time, because I thought that was how you got into the business. But after I did the same thing over and over, I resented it. I didn't mind being funny, but I didn't like being stupid.] She continued as an actress in film in the 1940s, and then moved to television acting in the 1950s.  McQueen was appearing on the Broadway stage in the comedy What a Life in 1938 when she was spotted by Kay Brown, talent scout for David O. Selznick, then in pre-production for Gone With the Wind (eventually released in 1939). Brown recommended that McQueen audition for the film. After Selznick saw her screen test, he never considered anyone else and McQueen was cast in the role that would become her most identifiable – \"Prissy\", a simple-minded house maid. She uttered the famous words: \"Oh, Miss Scarlett! I don't know nothin' 'bout birthin' babies!\" Her distinctive, high-pitched voice was noted by a critic who described it as \"the itsy-little voice fading over the far horizon of comprehension\". While the role is well known to audiences, McQueen did not enjoy playing the part and felt it was demeaning to African-Americans.\n\nShe also played an uncredited bit part as a sales assistant in The Women (1939), filmed after Gone with the Wind but released before it. She also played Butterfly, Rochester's niece and Mary Livingstone's maid in the Jack Benny radio program for a time during World War II. She appeared in an uncredited role in Mildred Pierce (1945) (where she had a good amount of screen time) and played a supporting role in Duel in the Sun (1946). By 1947, she had grown tired of the ethnic stereotypes she was required to play and ended her film career.\n\nDuring World War II, McQueen frequently appeared as a comedian on the Armed Forces Radio Service broadcast Jubilee. Many of these broadcasts are available on the Internet Archive.\n\nFrom 1950 until 1952 she was featured in another racially stereotyped role on the television series Beulah. She played Beulah's friend Oriole, a character originated on radio by Ruby Dandridge, who would then take over the TV role from McQueen in 1952-53. In a lighter moment, she appeared in a 1969 episode of The Dating Game.\n\nOffers for acting roles began to dry up around this time, and she devoted herself to other pursuits including political study. She received a bachelor's degree in political science from City College of New York in 1975.[1] McQueen played the character of Aunt Thelma, a fairy godmother, in the ABC Weekend Special episode \"The Seven Wishes of Joanna Peabody\" (1978) and the ABC Afterschool Special episode \"Seven Wishes of a Rich Kid\" (1979); her performance in the latter earned her a Daytime Emmy Award for Outstanding Individual Achievement in Children's Programming. She had one more role of substance in the 1986 film The Mosquito Coast.",
        "birthday": "1911-01-07",
        "deathday": "1995-12-22",
        "gender": 1,
        "homepage": null,
        "id": 11500,
        "imdb_id": "nm0574335",
        "known_for_department": "Acting",
        "name": "Butterfly McQueen",
        "place_of_birth": "Tampa, Florida, USA",
        "popularity": 0.1154,
        "profile_path": "/hxKg665EFwIQPEcTCP08pSHbwuE.jpg"
    }
}