{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/izgDdMvuRvTtA2azhKwPvfITZU1.jpg",
                "genre_ids": [
                    12,
                    18,
                    28,
                    36
                ],
                "id": 11416,
                "original_language": "en",
                "original_title": "The Mission",
                "overview": "When a Spanish Jesuit goes into the South American wilderness to build a mission in the hope of converting the Indians of the region, a slave hunter is converted and joins his mission. When Spain sells the colony to Portugal, they are forced to defend all they have built against the Portuguese aggressors.",
                "popularity": 2.6652,
                "poster_path": "/6K9cG6LOOtySZF4D4xBu1MApC1N.jpg",
                "release_date": "1986-09-06",
                "title": "The Mission",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 1464,
                "character": "Sebastian",
                "credit_id": "52fe443c9251416c7502d7df",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Daniel Joseph Berrigan was an Jesuit priest, anti-war activist, Christian pacifist, playwright, poet, and author. His active protest against the Vietnam War earned him both scorn and admiration, especially regarding his association with the Catonsville Nine. It also landed him on the Federal Bureau of Investigation's \"most wanted list\" (the first-ever priest on the list), on the cover of Time magazine, and in prison. For the rest of his life, Dan remained one of the United States' leading anti-war activists. In 1980, he co-founded the Plowshares movement, an anti-nuclear protest group, that put him back into the national spotlight. He was also an award-winning and prolific author of some 50 books, a teacher, and a university educator",
        "birthday": "1921-05-09",
        "deathday": "2016-04-30",
        "gender": 2,
        "homepage": "https://danielberrigan.org",
        "id": 1151688,
        "imdb_id": "nm0077381",
        "known_for_department": "Acting",
        "name": "Daniel Berrigan",
        "place_of_birth": "Syracuse, New York, USA",
        "popularity": 0.6926,
        "profile_path": "/9bpZ0qUZiQftofUg42wMAtDuy0S.jpg"
    }
}