{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ySmjHc3LZd4VmmIa6sgwkMIm6xl.jpg",
                "genre_ids": [
                    35,
                    10751
                ],
                "id": 771,
                "original_language": "en",
                "original_title": "Home Alone",
                "overview": "Eight-year-old Kevin McCallister makes the most of the situation after his family unwittingly leaves him behind when they go on Christmas vacation. When thieves try to break into his home, he puts up a fight like no other.",
                "popularity": 0.6736,
                "poster_path": "/i5We88HdO9Nsrv8xLyo4toNsLUM.jpg",
                "release_date": "1990-11-16",
                "title": "Home Alone",
                "video": false,
                "vote_average": 7.446,
                "vote_count": 11858,
                "character": "Kevin",
                "credit_id": "52fe4274c3a36847f801ff87",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/vSd89kiENYeFa6mPHzsM5BgliPm.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 4032,
                "original_language": "en",
                "original_title": "My Girl",
                "overview": "Vada Sultenfuss is obsessed with death. Her mother is dead, and her father runs a funeral parlor. She is also in love with her English teacher, and joins a poetry class over the summer just to impress him. Thomas J., her best friend, is \"allergic to everything\", and sticks with Vada despite her hangups. When Vada's father hires Shelly, and begins to fall for her, things take a turn to the worse...",
                "popularity": 3.8836,
                "poster_path": "/qyJJNHteA7BUwQSey05t7qP4vRV.jpg",
                "release_date": "1991-11-27",
                "title": "My Girl",
                "video": false,
                "vote_average": 7.407,
                "vote_count": 2185,
                "character": "Thomas J. Sennett",
                "credit_id": "52fe43acc3a36847f8066b21",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/oubk1SEFtg3Q8eOncFvGQVa6OoP.jpg",
                "genre_ids": [
                    18,
                    9648,
                    27
                ],
                "id": 2291,
                "original_language": "en",
                "original_title": "Jacob's Ladder",
                "overview": "After returning home from the Vietnam War, veteran Jacob Singer struggles to maintain his sanity. Plagued by hallucinations and flashbacks, Singer rapidly falls apart as the world and people around him morph and twist into disturbing images. His girlfriend, Jezzie, and ex-wife, Sarah, try to help, but to little avail. Even Singer's chiropractor friend, Louis, fails to reach him as he descends into madness.",
                "popularity": 3.5234,
                "poster_path": "/ufLcHIi1aXjjH8MediAMvnwDsVI.jpg",
                "release_date": "1990-11-02",
                "title": "Jacob's Ladder",
                "video": false,
                "vote_average": 7.352,
                "vote_count": 1754,
                "character": "Gabe (uncredited)",
                "credit_id": "64c486f89b6e47011ce757b0",
                "order": 68
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Macaulay Carson Culkin",
            "Μακόλεϊ Κάλκιν",
            "맥컬리 컬킨",
            "マコーレー・カルキン",
            "مکالی کالکین"
        ],
        "biography": "Macaulay Culkin (born August 26, 1980) is an American actor who rose to fame in John Hughes’s 1990 box office hit Home Alone and quickly became one of the most famous child actors of the 1990s.\n\nHe next appeared in Only the Lonely and costarred in the highly acclaimed My Girl, both released in 1991. Culkin returned to his star-making role as Kevin in Home Alone 2: Lost in New York (1992), which also performed well at the box office. Culkin’s next role, a dramatic turn from his previous work, was in the dark and disturbing The Good Son (1993), in which he played a deeply troubled child.\n\nCulkin continued to work steadily, appearing in one more film that year and in three films the next year—The Nutcracker (1993), Getting Even with Dad (1994), The Pagemaster (1994), and, in the title role, Richie Rich (1994)—before taking a step back from acting in his early 20s to act occasionally and to pursue other creative opportunities.\n\nMeanwhile, Culkin had returned to acting in the early 2000s. He starred in the play Madame Melville, which opened in London in 2000 and moved to New York City (Off-Broadway) the next year. His first movie as an adult was Party Monster (2003), in which he played the murderous party promoter Michael Alig. It was closely followed by his role in Saved! (2004), a comedy in which he played a high-school student whose sister is a Christian zealot. Later films included Sex and Breakfast (2007), The Wrong Ferrari (2011), Adam Green’s Aladdin (2016), and Changeland (2019). During this time he also worked in television, notably making appearances on Will & Grace, in 2003; Foster Hall, in 2004; Kings, in 2009; Dollface, in 2019; American Horror Story, in 2021; and The Righteous Gemstones, in 2022. Culkin lent his voice to Robot Chicken (2001– ) and appeared as himself in The Jim Gaffigan Show (2015–16).\n\nCulkin pursued other creative interests as well. He wrote a novel, Junior (2005), which is the story of a young star who has a troubled relationship with his father; while ostensibly fiction, it appeared to have many similarities to Culkin’s own experiences with his father. Culkin also dabbled in music. He formed a band called the Pizza Underground that performed the songs of the Velvet Underground but with the lyrics humorously revised to incorporate a pizza theme. Pizza Underground went on a brief tour in 2014. In 2017 Culkin created the comedy website and accompanying podcast Bunny Ears, which was a satiric riff on wellness and lifestyle brands.",
        "birthday": "1980-08-26",
        "deathday": null,
        "gender": 2,
        "homepage": "https://bunnyears.com",
        "id": 11510,
        "imdb_id": "nm0000346",
        "known_for_department": "Acting",
        "name": "Macaulay Culkin",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 1.3255,
        "profile_path": "/5lSoFnWb4HmxEREqcFvBGgXu5H.jpg"
    }
}