{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ySmjHc3LZd4VmmIa6sgwkMIm6xl.jpg",
                "genre_ids": [
                    35,
                    10751
                ],
                "id": 771,
                "original_language": "en",
                "original_title": "Home Alone",
                "overview": "Eight-year-old Kevin McCallister makes the most of the situation after his family unwittingly leaves him behind when they go on Christmas vacation. When thieves try to break into his home, he puts up a fight like no other.",
                "popularity": 0.6736,
                "poster_path": "/i5We88HdO9Nsrv8xLyo4toNsLUM.jpg",
                "release_date": "1990-11-16",
                "title": "Home Alone",
                "video": false,
                "vote_average": 7.446,
                "vote_count": 11856,
                "character": "Rod",
                "credit_id": "5a8e478a9251416c8d00aca1",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Jedidiah Cohen is an American child actor best known for playing Rob in Home Alone (1990) and Home Alone 2: Lost in New York (1992). Cohen was born in Michigan, USA on 30 November 1975. His first acting role came in 1990 where he played Rod in the film Home Alone. He later reprised his role as Rod in 1992 in the sequel Home Alone 2: Lost in New York. In 1992 he also played Dickon in the theatre show \"The Secret Garden\" on Broadway (c. 1992). In 2000 he appeared in the short film Artemin Goldberg: Custom Tailor of Brassieres as Jedidiah and he also played Vladimir in the short film No Vladimir. In 2004 he met actress Kate Dawson at a musical-theater-acting master class in New York. Cohen eventually married Kate Dawson on February 25 2007. He now has a job working as a Director of Operations at a company called Tilt the Balance. In 2024, Cohen reunited with fellow Home Alone cast members for a fan event at Pandora’s Box Toys & Collectibles in New Jersey.",
        "birthday": "1975-11-30",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 11522,
        "imdb_id": "nm0169479",
        "known_for_department": "Acting",
        "name": "Jedidiah Cohen",
        "place_of_birth": "Michigan, USA",
        "popularity": 0.1964,
        "profile_path": "/m3xXaao4ZeQLoFdAdFx4HcVhRs6.jpg"
    }
}