{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qA6MHDGDY0LyutjLUgFJRbPXLpW.jpg",
                "genre_ids": [
                    27,
                    878,
                    53
                ],
                "id": 1084199,
                "original_language": "en",
                "original_title": "Companion",
                "overview": "During a weekend getaway at a secluded lakeside estate, a group of friends finds themselves entangled in a web of secrets, deception, and advanced technology. As tensions rise and loyalties are tested, they uncover unsettling truths about themselves and the world around them.",
                "popularity": 19.3374,
                "poster_path": "/oCoTgC3UyWGfyQ9thE10ulWR7bn.jpg",
                "release_date": "2025-01-22",
                "title": "Companion",
                "video": false,
                "vote_average": 7.052,
                "vote_count": 1688,
                "character": "Sid",
                "credit_id": "679defe7ebb9962403262a46",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Matthew McCarthy",
            "Matt McCarthy "
        ],
        "biography": "Matt McCarthy (born November 9, 1979) is an American comedian, actor, writer, and improviser living in Los Angeles. He is best known for his appearances on Conan and CollegeHumor.com and for hosting the We Watch Wrestling Podcast. McCarthy co-stars as Carl on the  CBS show How We Roll.\n\nMatthew McCarthy, the youngest of three, was born in Providence, Rhode Island, at the old Women & Infants Hospital on Maude Street. He grew up in an Irish-Catholic home in Rumford, Rhode Island. He attended St. Margaret's School and La Salle Academy.\n\nThe New York Times described him as a \"John Belushi-like madman, \" McCarthy began performing stand-up comedy after graduating from Fordham University, where he was the mascot of The Ram from 1999 to 2001. He then studied improvisation at the Upright Citizens Brigade Theater in New York. Before becoming a performer, he appeared as a contestant on a Cash Cab episode aired on June 26, 2006.\n\nIn 2008, he starred in a Guinness commercial for St. Patrick's Day. The following year, he portrayed The Cable Guy in  Verizon Fios commercials.\n\nMcCarthy co-founded the sketch video group Front Page Films with fellow comedians and creators, including frequent collaborator Pete Holmes. FPF made sketches, commercials and viral videos for Doritos, Crunch Fitness, CollegeHumor, and Comedy Central. McCarthy also starred in many shorts for CollegeHumor. Numerous Front Page Film videos were featured on Atom.com and Comedy Central's Tosh.\n\nIn 2010, McCarthy hosted Action Pack on AMC with Nick Stevens.\n\nMcCarthy was an avid pro wrestling fan who was a creative writer for WWE from 2011 to 2012 and 2016-2018. In 2013, McCarthy began recording episodes of the We Watch Wrestling Podcast with fellow stand-up comedians Vince Averill, Tom Sibley, and producer Rob Sibley.\n\nFrom October 2013 through June 2014, McCarthy was a series regular and writer on The Pete Holmes Show on TBS following Conan.\n\nMcCarthy began performing comedy in New York City in 2003 at various open mics, barker, and bringer shows. Quickly found a home in the East Village at the now-defunct Comedy Social, a weekly comedy showcase at Sin Bar. Soon after, he hosted a stand-up at Mo Pitkin's House of Satisfaction. McCarthy had a month-long run of his solo show \"McCarthyism\" at the infamous Rififi Cinema Classics. McCarthy also ran \"The Matt McCarthy Stand-Up Comedy Show\" at Comix NY for several months.\n\nIn 2011, McCarthy ran a monthly comedy extravaganza called MARKING OUT in Manhattan.\n\nHis stand-up comedy television performances include Season 3 of Live at Gotham, John Oliver's New York Stand-Up Show on Comedy Central.\n\nMcCarthy has performed at such festivals as Just for Laughs in Montreal, All Tomorrow's Parties, Sasquatch! Music Festival, Outside Lands Music and Arts Festival and Bonnaroo.\n\nNamed one of LA Weekly's Comics to Watch in 2014.\n\nDescription above from the Wikipedia article about Matt McCarthy (comedian), licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "http://thisismattmccarthy.com/",
        "id": 1152011,
        "imdb_id": "nm3804613",
        "known_for_department": "Acting",
        "name": "Matthew J. McCarthy",
        "place_of_birth": "Providence, Rhode Island",
        "popularity": 0.4889,
        "profile_path": "/eHKjDZPdHTz5lV1UySfMdRqMrH6.jpg"
    }
}