{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uYRnUnBE4kk5ocvyBckRfMAsZpJ.jpg",
                "genre_ids": [
                    12,
                    10749,
                    10752
                ],
                "id": 22584,
                "original_language": "en",
                "original_title": "To Have and Have Not",
                "overview": "A Martinique charter boat skipper gets mixed up with the underground French resistance operatives during WWII.",
                "popularity": 1.5152,
                "poster_path": "/m9RYIio23yClaO3fy5tcpYac1Gf.jpg",
                "release_date": "1945-01-20",
                "title": "To Have and Have Not",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 537,
                "character": "Naval Ensign (uncredited)",
                "credit_id": "5613128ac3a3686814017ca6",
                "order": 14
            },
            {
                "adult": false,
                "backdrop_path": "/1yWn9A2LN0uRGudIg0bV2Np6T69.jpg",
                "genre_ids": [
                    10752,
                    28,
                    18
                ],
                "id": 9289,
                "original_language": "en",
                "original_title": "The Longest Day",
                "overview": "The retelling of June 6, 1944, from the perspectives of the Germans, US, British, Canadians, and the Free French. Marshall Erwin Rommel, touring the defenses being established as part of the Reich's Atlantic Wall, notes to his officers that when the Allied invasion comes they must be stopped on the beach. \"For the Allies as well as the Germans, it will be the longest day\"",
                "popularity": 3.5233,
                "poster_path": "/5zmvEofdIlgXrQl9A7e5IOzlnFU.jpg",
                "release_date": "1962-09-25",
                "title": "The Longest Day",
                "video": false,
                "vote_average": 7.594,
                "vote_count": 977,
                "character": "Joe Williams",
                "credit_id": "5e50e849a93d25001347b427",
                "order": 45
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ron Randall"
        ],
        "biography": "Ron Randell (1918-1994) was an accomplished Australian actor who enjoyed a prolific career in film, television, and theater. Born in Sydney, Randell discovered his passion for acting at a young age and began honing his craft through local productions before transitioning to the professional stage.\n\nIn the 1940s, Randell made his film debut in the Australian movie \"Forty Thousand Horsemen\" and quickly garnered recognition for his charismatic on-screen presence. He went on to appear in numerous Australian films throughout the decade, solidifying his status as a rising star in his home country.\n\nSeeking to expand his horizons, Randell relocated to the United States in the early 1950s, where he continued to build an impressive body of work. He landed roles in a variety of Hollywood productions, including the war drama \"I'll Cry Tomorrow\" and the western \"Run of the Arrow.\" Randell's versatility as an actor allowed him to seamlessly transition between leading and supporting roles, and he became known for his ability to bring depth and nuance to even the most minor characters.\n\nBeyond his film work, Randell was also a fixture on American television, appearing in guest spots on popular shows like \"The Fugitive,\" \"Gunsmoke,\" and \"Mission: Impossible.\" His talents were further recognized with a Golden Globe nomination for his performance in the 1956 film \"I'll Cry Tomorrow.\"\n\nThroughout his prolific career, Ron Randell maintained a strong connection to his Australian roots, often incorporating elements of his heritage into his performances.",
        "birthday": "1918-10-08",
        "deathday": "2005-06-11",
        "gender": 2,
        "homepage": null,
        "id": 115308,
        "imdb_id": "nm0709681",
        "known_for_department": "Acting",
        "name": "Ron Randell",
        "place_of_birth": "Sydney, New South Wales, Austrailia",
        "popularity": 0.2012,
        "profile_path": "/xeLep7t85yDghTDqpOwHTKmQsf4.jpg"
    }
}