{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cq9N64ucEtfIc3eMxNr1VzY9LH9.jpg",
                "genre_ids": [
                    18
                ],
                "id": 37799,
                "original_language": "en",
                "original_title": "The Social Network",
                "overview": "In 2003, Harvard undergrad and computer programmer Mark Zuckerberg begins work on a new concept that eventually turns into the global social network known as Facebook. Six years later, Mark is one of the youngest billionaires ever, but his unprecedented success leads to both personal and legal complications when he ends up on the receiving end of two lawsuits, one involving his former friend.",
                "popularity": 7.5791,
                "poster_path": "/n0ybibhJtQ5icDqTp8eRytcIHJx.jpg",
                "release_date": "2010-10-01",
                "title": "The Social Network",
                "video": false,
                "vote_average": 7.37,
                "vote_count": 12636,
                "character": "Phoenix Club President",
                "credit_id": "52fe466f9251416c910546f3",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From wikipedia.org Dustin Began his career in 2008 after making several appearances in Little Caesars commercials that began airing across the country. His unique acting style and sense of humor coupled with an all American look quickly opened doors for him in the film and television world. Once Dustin began Landing roles in Independent features such as Street Racer (film) and House of the Wolf Man Hollywood's mainstream entertainment executives began to take notice. Dustin quickly began making appearances on networks such as TLC and CBS including a role on the hit day time soap The Young and The Restless. Columbia Pictures also cast Fitzsimons in David Fincher's hit film The Social Network as the president of Harvard's prestigious Phoenix Club.",
        "birthday": "1986-12-16",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 115406,
        "imdb_id": "nm2951481",
        "known_for_department": "Acting",
        "name": "Dustin Fitzsimons",
        "place_of_birth": "Sterling, Colorado, USA",
        "popularity": 0.0474,
        "profile_path": "/uC3Vcre1JSTywqTu4CVroGCT1C5.jpg"
    }
}