{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9eHg5qX7LkjW2Zrejvap2RmFGlD.jpg",
                "genre_ids": [
                    18,
                    36,
                    10752
                ],
                "id": 777,
                "original_language": "fr",
                "original_title": "La Grande Illusion",
                "overview": "A group of French soldiers, including the patrician Captain de Boeldieu and the working-class Lieutenant Maréchal, grapple with their own class differences after being captured and held in a World War I German prison camp. When the men are transferred to a high-security fortress, they must concoct a plan to escape beneath the watchful eye of aristocratic German officer von Rauffenstein, who has formed an unexpected bond with de Boeldieu.",
                "popularity": 3.2904,
                "poster_path": "/lWg41zE0FVixkNsFgxnlRyvDYv9.jpg",
                "release_date": "1937-06-04",
                "title": "Grand Illusion",
                "video": false,
                "vote_average": 7.87,
                "vote_count": 736,
                "character": "Le lieutenant Maréchal",
                "credit_id": "52fe4275c3a36847f8020269",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jean-Alexis Moncorgé",
            "Jean Moncorgé",
            "Jean Gabin Alexis Moncorgé",
            "Жан Габен",
            "ژان گابن"
        ],
        "biography": "Jean Gabin Alexis Moncorgé (born Jean-Alexis Moncorgé), known as Jean Gabin (17 May 1904 – 15 November 1976), was a French actor and singer. Considered a key figure in French cinema, he starred in several classic films, including Pépé le Moko (1937), La grande illusion (1937), Le Quai des brumes (1938), La bête humaine (1938), Le jour se lève (1939), and Le plaisir (1952). During his career, he twice won the Silver Bear for Best Actor from the Berlin International Film Festival and the Volpi Cup for Best Actor from the Venice Film Festival, respectively. Gabin was made a member of the Légion d'honneur in recognition of the important role he played in French cinema.\n\nGabin was born Jean-Alexis Moncorgé in Paris, the son of Madeleine Petit and Ferdinand Moncorgé, a cafe owner and cabaret entertainer whose stage name was Gabin, which is a first name in French. He grew up in the village of Mériel in the Seine-et-Oise (now Val-d'Oise) département, about 22 mi (35 km) north of Paris. He attended the Lycée Janson de Sailly. Gabin left school early, and worked as a laborer until the age of 19 when he entered show business with a bit part in a Folies Bergère production. He continued performing in a variety of minor roles before going into the military.\n\nAfter completing his military service in the Fusiliers marins, he returned to the entertainment business, working under the stage name of Jean Gabin at whatever was offered in the Parisian music halls and operettas, imitating the singing style of Maurice Chevalier, which was the rage at the time. He was part of a troupe that toured South America, and upon returning to France found work at the Moulin Rouge. His performances started getting noticed, and better stage roles came along that led to parts in two silent films in 1928.\n\nTwo years later Gabin made the transition to sound films in a 1930 Pathé Frères production, Chacun sa chance. Playing secondary roles, he made more than a dozen films over the next four years, including films directed by Maurice and Jacques Tourneur. But he only gained real recognition for his performance in Maria Chapdelaine, a 1934 production directed by Julien Duvivier. He was then cast as a romantic hero in the 1936 war drama La Bandera; this second Duvivier-directed film established him as a major star. The next year he teamed up with Duvivier again in the highly successful Pépé le Moko. Its popularity brought Gabin international recognition. That same year he starred in Jean Renoir's La Grande Illusion, an antiwar film that ran at a New York City theatre for an unprecedented six months. This was followed by another of Renoir's major works, La Bête Humaine (The Human Beast), a film noir tragedy based on the novel by Émile Zola and starring Gabin and Simone Simon, as well as Le Quai Des Brumes (Port of Shadows), one of director Marcel Carné's classics of poetic realism. His rugged charisma could be compared with Humphrey Bogart and James Cagney.\n\nHe divorced his second wife in 1939. ...\n\nSource: Article \"Jean Gabin\" from Wikipedia in English, licensed under CC-BY-SA.",
        "birthday": "1904-05-17",
        "deathday": "1976-11-15",
        "gender": 2,
        "homepage": "http://www.musee-gabin.com/",
        "id": 11544,
        "imdb_id": "nm0300064",
        "known_for_department": "Acting",
        "name": "Jean Gabin",
        "place_of_birth": "Paris, France",
        "popularity": 0.5802,
        "profile_path": "/pmFuOVTQvYdgmN7cYOuyJHPfMRt.jpg"
    }
}