{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9eHg5qX7LkjW2Zrejvap2RmFGlD.jpg",
                "genre_ids": [
                    18,
                    36,
                    10752
                ],
                "id": 777,
                "original_language": "fr",
                "original_title": "La Grande Illusion",
                "overview": "A group of French soldiers, including the patrician Captain de Boeldieu and the working-class Lieutenant Maréchal, grapple with their own class differences after being captured and held in a World War I German prison camp. When the men are transferred to a high-security fortress, they must concoct a plan to escape beneath the watchful eye of aristocratic German officer von Rauffenstein, who has formed an unexpected bond with de Boeldieu.",
                "popularity": 3.2904,
                "poster_path": "/lWg41zE0FVixkNsFgxnlRyvDYv9.jpg",
                "release_date": "1937-06-04",
                "title": "Grand Illusion",
                "video": false,
                "vote_average": 7.87,
                "vote_count": 736,
                "character": "L'instituteur",
                "credit_id": "52fe4275c3a36847f8020281",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/7AvbU0ei7Fz21jqBL4tlgSufnMp.jpg",
                "genre_ids": [
                    53,
                    80,
                    18
                ],
                "id": 2721,
                "original_language": "fr",
                "original_title": "Z",
                "overview": "Amid a tense political climate, the opposition leader is killed in an apparent accident. When a prosecutor smells a cover-up, witnesses get targeted. A thinly veiled dramatization of the assassination of Greek politician Grigoris Lambrakis and its aftermath, “Z” captures the outrage at the US-backed junta that ruled Greece at the time of its release.",
                "popularity": 3.1277,
                "poster_path": "/dFAJyFNgvOv24f2RQyI9KDxjGr3.jpg",
                "release_date": "1969-02-26",
                "title": "Z",
                "video": false,
                "vote_average": 7.795,
                "vote_count": 580,
                "character": "Illya Coste, chauffeur",
                "credit_id": "52fe4368c3a36847f8051f11",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jean Georges Gustave Dasté"
        ],
        "biography": "Jean Dasté, born Jean Georges Gustave Dasté, (18 September 1904 in Paris, France – 15 October 1994 in Saint-Priest-en-Jarez, Loire, France) was an actor and theatre director.\n\nAlthough Jean Dasté is best known for his career on stage as both an actor and director in a variety of works including those by Shakespeare and Molière, he made his first appearance on screen in a 1932 Jean Renoir film (Boudu sauvé des eaux), and 57 years later appeared in his final film at the age of 85. He played also the main character in two Jean Vigo movies, L'Atalante and Zéro de conduite. Later, he worked also with Alain Resnais and François Truffaut.\n\nHe married Danish-born actress Marie-Hélène Copeau (1902–1994), the daughter of the influential French writer, editor, and drama critic Jacques Copeau (1879–1949) and Agnès Thomsen.\n\nIn 1947, he became the founding director of the Comedie de St.-Etienne stage company in the town of Saint-Étienne in the Loire département. The success of his theater was such that there is a college and a theater in Saint-Étienne named in his honor.\n\nSource: Article \"Jean Dasté\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1904-08-18",
        "deathday": "1994-10-15",
        "gender": 2,
        "homepage": null,
        "id": 11550,
        "imdb_id": "nm0202120",
        "known_for_department": "Acting",
        "name": "Jean Dasté",
        "place_of_birth": "Paris, France",
        "popularity": 0.1535,
        "profile_path": "/euY2Sw6FKX2aPuuG5044AFTaDmK.jpg"
    }
}