{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4i3Amppd6eW5Qkhjv4gdHk3CCoE.jpg",
                "genre_ids": [
                    36,
                    10402,
                    18
                ],
                "id": 279,
                "original_language": "en",
                "original_title": "Amadeus",
                "overview": "Disciplined Italian composer Antonio Salieri becomes consumed by jealousy and resentment towards the hedonistic and remarkably talented young Salzburger composer Wolfgang Amadeus Mozart.",
                "popularity": 5.9174,
                "poster_path": "/1n5VUlCqgmVax1adxGZm8oCFaKc.jpg",
                "release_date": "1984-09-19",
                "title": "Amadeus",
                "video": false,
                "vote_average": 8.026,
                "vote_count": 4488,
                "character": "Cherubino in 'The Marriage of Figaro' (singing voice)",
                "credit_id": "57d19181c3a3684af1008665",
                "order": 37
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Anne Elizabeth Howells (12 January 1941 – 18 May 2022) was a British operatic mezzo-soprano.\n\nHowells was born in Southport, Lancashire, on 12 January 1941, the daughter of Trevor Howells and Mona Howells (née Hewart). She was educated at Sale Grammar School, where her teachers included Alfred Higson. She further studied music at the Royal Manchester College of Music (now the Royal Northern College of Music), where her teachers included Frederic Cox. Howells continued singing studies with Vera Rózsa.\n\nHowells sang in productions at Glyndebourne, the Royal Opera House, and with the Metropolitan Opera in New York, the Lyric Opera of Chicago, the opera houses of both San Francisco and Los Angeles, the four Parisian opera houses, the Grand Théâtre de Genève, the Salzburger Festspiele, the Vienna Staatsoper, the Carnegie Hall, and the Musikverein of Vienna. She sang in the premieres of Rolf Liebermann's Forêt (as Régine), Nicholas Maw's The Rising of the Moon (as Cathleen) and of Richard Rodney Bennett's Victory (as Lena). Following her retirement from public performance, Howells taught at the Royal Academy of Music.\n\nHowells was married three times. Her first marriage to Ryland Davies was from 1966 to 1981. Her second marriage was to Stafford Dean, from 1981 to 1988, and produced a son, Matthew, and a daughter, Laura. Both marriages ended in divorce. Her third marriage was to Peter Fyson, which lasted until his death in 2005. Howells died from myeloma in Andover, Hampshire on 18 May 2022, at the age of 81. Her children survive her.\n\nSource: Article \"Anne Howells\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1941-01-12",
        "deathday": "2022-05-18",
        "gender": 1,
        "homepage": null,
        "id": 1155233,
        "imdb_id": "nm0398084",
        "known_for_department": "Acting",
        "name": "Anne Howells",
        "place_of_birth": "Southport, Lancashire, England, UK",
        "popularity": 0.0143,
        "profile_path": "/oXa5tbVZBs8L9PvrsKON6Us0xpO.jpg"
    }
}