{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5dg3woJqG7kNBCEMZNGPUauHSnK.jpg",
                "genre_ids": [
                    28,
                    80,
                    53
                ],
                "id": 180299,
                "original_language": "id",
                "original_title": "The Raid 2: Berandal",
                "overview": "After fighting his way through an apartment building populated by an army of dangerous criminals and escaping with his life, SWAT team member Rama goes undercover, joining a powerful Indonesian crime syndicate to protect his family and uncover corrupt members of his own force.",
                "popularity": 4.6939,
                "poster_path": "/olA39iaXISiKEkACdELgr0ZRvIF.jpg",
                "release_date": "2014-03-27",
                "title": "The Raid 2",
                "video": false,
                "vote_average": 7.604,
                "vote_count": 2457,
                "character": "Bangun",
                "credit_id": "52fe4c449251416c7511521b",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Tio Pakusodewo",
            "Tyo Pakusadewo",
            "Irwan Susetyo Pakusadewo"
        ],
        "biography": "Kanjeng Raden Tumenggung Irwan Susetyo Pakusadewo, better known by the stage name Tio Pakusadewo (born 2 September 1963), is an Indonesian actor. He has won two Citra Awards for Best Leading Actor at the Indonesian Film Festival, for Lagu untuk Seruni (1990) and Identitas (2008).\n\nTio was born on 2 September 1963 in Jakarta. He showed interest in the arts at an early age, taking up dance while in elementary school. In senior high he was active with the school's theatre troupe, and after graduating in 1985 Tio enrolled in the Jakarta Art Institute. On the side he worked as a model, and in 1987 he made his feature film debut playing opposite Rano Karno in Bilur-Bilur Penyesalan (Stripes of Regret), an adaptation of the novel by Mira W.\n\nIn 1988 Tio took four roles, including one in Catatan Si Boy II (Boy's Diary II), which gave him national recognition. His fame was cemented through his role in Garin Nugroho's Cinta Dalam Sepotong Roti (Love in a Slice of Bread; 1990), which won the Citra Award for Best Film at the 1991 Indonesian Film Festival. Also in 1991, Tio received his first Citra Award for acting, for his role as an eccentric composer in Lagu Untuk Seruni.\n\nDuring the early 1990s the domestic film industry faced a steep decline, and Tio began to focus on soap operas. In 1993 he established his own production hous, Kalbuku, which produced several serials, including Desy (1994), Lakon Tiga Duda (Story of Three Widowers; 1994), Anak-Anak Menteng (Children of Menteng; 1996), Telaga Kesabaran (Lake of Patience; 1996), and Tirai Sutra (Silk Curtains; 1996).[3] The company, although initially highly successful, soon faced financial problems and closed; Tio also began facing a drug addiction. His last feature film role of the millennium was in Kuldesak (Dead End), an indie film co-directed by Mira Lesmana, Riza Mantovani, Riri Riza and Nan Triveni. The film was released in 1999.\n\nTio would not reenter the film industry until 2004, when he portrayed a \"sugar daddy\" in Hanny Saputra's film Virgin. His next film role, in Nia Dinata's Berbagi Suami (Love for Share; 2006), was as a polygamist who fears his four wives. Since 2007, Tio has appeared in at least two films every year. These span a variety of genres, including the horror film Legenda Sundel Bolong (Legend of Sundel Bolong; 2007), comedy Quickie Express (2007), drama Sang Penari (The Dancer; 2011), and thriller Pintu Terlarang (The Forbidden Door; 2009).\n\nIn 2010 Tio was granted the title Kanjeng Raden Tumenggung from the royal court at Sultanate of Yogyakarta; from which he is descended. That year he also established an acting school in Kemang, South Jakarta, because he considered the quality of most new Indonesian actors and actresses to be poor. The school teaches a method of acting developed by Tio himself.\n\nFrom Wikipedia, the free encyclopedia",
        "birthday": "1963-09-02",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1155281,
        "imdb_id": "nm1233777",
        "known_for_department": "Acting",
        "name": "Tio Pakusadewo",
        "place_of_birth": "Jakarta, Indonesia",
        "popularity": 0.0687,
        "profile_path": "/uAbKPJPbXVg1pi1bAEEkaMxc0Br.jpg"
    }
}