{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4avmIRBBOs9b4DKoenf8SWWJJP7.jpg",
                "genre_ids": [
                    53,
                    36,
                    18
                ],
                "id": 726759,
                "original_language": "en",
                "original_title": "Tetris",
                "overview": "In 1988, American video game salesman Henk Rogers discovers the video game Tetris. When he sets out to bring the game to the world, he enters a dangerous web of lies and corruption behind the Iron Curtain.",
                "popularity": 6.2189,
                "poster_path": "/4F2QwCOYHJJjecSvdOjStuVLkpu.jpg",
                "release_date": "2023-03-15",
                "title": "Tetris",
                "video": false,
                "vote_average": 7.659,
                "vote_count": 1528,
                "character": "Minoru Arakawa",
                "credit_id": "63cdd620e24b93007cd55d86",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "山村憲之介",
            "山村宪之介",
            "Kennosuke Yamamura",
            "山村 憲之介"
        ],
        "biography": "Ken Yamamura, born Kennosuke Yamamura (山村 憲之介, Yamamura Kennosuke, born January 21, 1986), is a Japanese actor best known for playing the younger Ichirō Yashida / Silver Samurai (sharing the main antagonist's role with Haruhiko Yamanouchi) in the 2013 film The Wolverine, and Takashi in the 2014 remake of Godzilla.\n\nYamamura was born in Osaka on January 21, 1986. He studied drama at Flinders University in Adelaide, South Australia. After graduating, he has not missed a chance to have a role in a Hollywood blockbuster.\n\nIn 2013, Yamamura made his first acting appearance as the younger Ichiro Yashida / Silver Samurai in the American superhero film The Wolverine, which had starred Hugh Jackman. The following year, he went on to portray the role of Takashi, the associate of Bryan Cranston's character, in the 2014 remake of Godzilla.\n\nIn 2019, he then appeared to portray as the character Oguchi in the thriller crime drama film Earthquake Bird, featuring Alicia Vikander and Riley Keough, which was released by Netflix on November 15, 2019.\n\nIn 2021, Yamamura has portrayed Taka in the film People Just Do Nothing: Big in Japan.",
        "birthday": "1986-01-21",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1155715,
        "imdb_id": "nm4576636",
        "known_for_department": "Acting",
        "name": "Ken Yamamura",
        "place_of_birth": null,
        "popularity": 0.1684,
        "profile_path": "/hzAAtzS3NwmwPTqzmH3SSFRz3NS.jpg"
    }
}