{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/titl6uMe5u974sLAA2Zy1kFi4sC.jpg",
                "genre_ids": [
                    18,
                    28,
                    36,
                    53
                ],
                "id": 612,
                "original_language": "en",
                "original_title": "Munich",
                "overview": "During the 1972 Olympic Games in Munich, eleven Israeli athletes are taken hostage and murdered by a Palestinian terrorist group known as Black September. In retaliation, the Israeli government recruits a group of Mossad agents to track down and execute those responsible for the attack.",
                "popularity": 4.7745,
                "poster_path": "/iUekaw96QLInZpsNwRTlRKrZgwm.jpg",
                "release_date": "2005-12-23",
                "title": "Munich",
                "video": false,
                "vote_average": 7.143,
                "vote_count": 2805,
                "character": "Newlywed Bride",
                "credit_id": "611730c499d5c3005e8271df",
                "order": 27
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Lisa Helena Werlinder"
        ],
        "biography": "​Lisa Werlinder (born 12 March 1972) is a Swedish actress, and jazz musician/singer.  She was born at in Vaksala, Uppsala.  She was educated at Royal Swedish Academy of Music in Stockholm and at Luleå Acting Academy between 1996-2000. After graduation she was immediately picked to work with Ingmar Bergman at The Royal Dramatic Theatre in Stockholm where she has since starred in several productions, the latest as Cordelia in King Lear. In 2000, she made her filmdebut as Ludmilla in the thriller film Hassel - Förgörarna and in the same year she made a more prominent role as the struggling actress Helena in the drama film Gossip by Colin Nutley and as the violinist Elisabeth in \"A song for Martin\" by Bille August. In 2001, she played the highly praised role as Nancy in the Swedish TV series Olivia Twist, a Swedish version of Oliver Twist. In 2002-2003 she played the role as the kind-hearted Josephine in the Swedish highly popular drama series Skeppsholmen.  She played in the The Inheritance by Per Fly, being nominated for a Danish Oscar. In 2005 she played Emma in the romantic comedy Doubleshift. In 2005, she portrayed the role of Kristina Månsson in the Swedish primetime television series Saltön. She also appeared in Steven Spielberg's film Munich (2005) and portrayed a lead role in the film Svarta Nejlikan opposite Michael Nyqvist (2007). Werlinder also starred in the Norwegian thriller Torpedo by Trygve Alister Diesen.",
        "birthday": "1972-03-12",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 115736,
        "imdb_id": "nm0921320",
        "known_for_department": "Acting",
        "name": "Lisa Werlinder",
        "place_of_birth": "Uppsala, Sverige",
        "popularity": 0.1733,
        "profile_path": "/kkuuRnULiVqKRiCZKx554ROFECz.jpg"
    }
}