{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/y4TbQOC9DCzZop9HwKuX73rKbYO.jpg",
                "genre_ids": [
                    28,
                    80,
                    18,
                    53
                ],
                "id": 9631,
                "original_language": "en",
                "original_title": "The Negotiator",
                "overview": "The police try to arrest expert hostage negotiator Danny Roman, who insists he's being framed for his partner's murder in what he believes is an elaborate conspiracy. Thinking there's evidence in the Internal Affairs offices that might clear him, he takes everyone in the office hostage and demands that another well-known negotiator be brought in to handle the situation and secretly investigate the conspiracy.",
                "popularity": 6.3574,
                "poster_path": "/dUMHEymATOGbs2K3E4dmNSVBgFQ.jpg",
                "release_date": "1998-07-29",
                "title": "The Negotiator",
                "video": false,
                "vote_average": 7.103,
                "vote_count": 2223,
                "character": "Eagle",
                "credit_id": "52fe4514c3a36847f80bb279",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/jZ9lWWCnV5gBRe29PpzEXNgf8i8.jpg",
                "genre_ids": [
                    18
                ],
                "id": 11093,
                "original_language": "en",
                "original_title": "House of Sand and Fog",
                "overview": "Behrani, an Iranian immigrant buys a California bungalow, thinking he can fix it up, sell it again, and make enough money to send his son to college. However, the house is the legal property of former drug addict Kathy. After losing the house in an unfair legal dispute with the county, she is left with nowhere to go. Wanting her house back, she hires a lawyer and befriends a police officer. Neither Kathy nor Behrani have broken the law, so they find themselves involved in a difficult moral dilemma.",
                "popularity": 2.3344,
                "poster_path": "/hLxSOukLfC4j5pNbdE7lqaw8KgL.jpg",
                "release_date": "2003-12-19",
                "title": "House of Sand and Fog",
                "video": false,
                "vote_average": 7.149,
                "vote_count": 791,
                "character": "Lt. Alvarez",
                "credit_id": "659e34727776f0009500577a",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/rWFLgIRGXzECIbczgo7dmnwq55q.jpg",
                "genre_ids": [
                    53,
                    28,
                    80
                ],
                "id": 8068,
                "original_language": "en",
                "original_title": "Desperado",
                "overview": "El Mariachi plunges headfirst into the dark border underworld when he follows a trail of blood to the last of the infamous Mexican drug lords, Bucho, for an action-packed, bullet-riddled showdown. With the help of his friend and a beautiful bookstore owner, El Mariachi tracks Bucho, takes on his army of desperados, and leaves his own trail of blood.",
                "popularity": 6.4584,
                "poster_path": "/e3gwpBeXpvGZsxUya9zNym5QXrw.jpg",
                "release_date": "1995-08-25",
                "title": "Desperado",
                "video": false,
                "vote_average": 6.927,
                "vote_count": 2981,
                "character": "Right Hand",
                "credit_id": "5c5ad0aa92514150c2b73b6d",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/fnTrZiCRXCk3I6mnYvJwiMZf6pF.jpg",
                "genre_ids": [
                    18
                ],
                "id": 524348,
                "original_language": "en",
                "original_title": "The Report",
                "overview": "The story of Daniel Jones, lead investigator for the US Senate’s sweeping study into the CIA's Detention and Interrogation Program, which was found to be brutal, immoral and ineffective. With the truth at stake, Jones battled tirelessly to make public what many in power sought to keep hidden.",
                "popularity": 4.0013,
                "poster_path": "/sG5NI6TMNR9ftOdTIXmG0hrBYSY.jpg",
                "release_date": "2019-09-12",
                "title": "The Report",
                "video": false,
                "vote_average": 7.045,
                "vote_count": 1086,
                "character": "Jose Rodriguez",
                "credit_id": "5d7e3f5912197e000e49525c",
                "order": 18
            },
            {
                "adult": false,
                "backdrop_path": "/lPLTLCBn39Wiy1RPQLB9xOKyF2v.jpg",
                "genre_ids": [
                    28,
                    18,
                    53
                ],
                "id": 9798,
                "original_language": "en",
                "original_title": "Enemy of the State",
                "overview": "The life of labor lawyer and dedicated family man Robert 'Bobby' Dean is turned upside down after a chance meeting with a college buddy while holiday shopping. Unbeknownst to Dean, he's just been burdened with a videotape of a congressman's assassination. Hot on the trail of this tape is a ruthless group of National Security Agents commanded by a belligerently ambitious NSA official named Reynolds. Using satellite surveillance, bugs, and other sophisticated snooping devices, the NSA infiltrates every facet of Dean's existence, tracing each physical and digital footprint he leaves while also framing him for murder. With the help of the mysterious Brill, he attempts to throw the NSA off his trail and prove his innocence.",
                "popularity": 6.5991,
                "poster_path": "/x9pXrMKLsBGGOFyyZ0Gwt9YpVub.jpg",
                "release_date": "1998-11-20",
                "title": "Enemy of the State",
                "video": false,
                "vote_average": 7.055,
                "vote_count": 4037,
                "character": "FBI Agent",
                "credit_id": "600cdff02a210c00409d9e1e",
                "order": 53
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Carlos Gomez"
        ],
        "biography": "Carlos Gomez's career spans over twenty years in film, television and theatre. The award winning actor was one of the leads of the A&amp;E series \"The Glades\". Garnering critical praise prior to its launch, The Glades became the most watched original drama series telecast in A&amp;E network history. Carlos also received a 2011 Imagen Award for best supporting actor in a television series for the show. Audiences will remember Carlos as \"Chuy\", the ex boyfriend of the talented and beautiful Salma Hayek in the hit romantic comedy Fools Rush In. Other film credits include The Negotiator, Enemy of the State, The Repalcement Killers, A Day Without a Mexican, The Perfect Game, And All About Steve starring Sandra Bullock. In 2003, he appeared as Lieutenant Alvarez in the Academy Award nominated film House of Sand and Fog, starring Sir Ben Kingsley, and Academy Award winner Jennifer Connelly. In television he appeared as paramedic Raul Melendez in the hit series ER which garnered him a Sag Award for best ensemble cast for the episode \"The Healers\". He has portrayed an extensive variety of roles in some of the highest rated TV shows such as, Friends, Nypd Blue, Boston Legal, Ncis, Criminal Minds, In Plain Sight, Charmed, Shark and the critically acclaimed Showtime series Sleeper Cell and Weeds. In theatre, Carlos completed over three hundred performances as Kevin Rosario on Broadway in the Tony Award winning musical 'In The Heights'. His two songs Inutil and Atencion were both part of the Grammy Award winning soundtrack musical as well. Carlos resides in Los Angeles, New York and Miami.  - IMDb Mini Biography",
        "birthday": "1962-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 115874,
        "imdb_id": "nm0326988",
        "known_for_department": "Acting",
        "name": "Carlos Gómez",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.3553,
        "profile_path": "/4uCM3Y4QS2uaRJBYf7Yi67VvPHl.jpg"
    }
}