{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/iVk4mVKwNE66JbBcoDwcYFvuUXM.jpg",
                "genre_ids": [
                    18,
                    53
                ],
                "id": 68734,
                "original_language": "en",
                "original_title": "Argo",
                "overview": "As the Iranian revolution reaches a boiling point, a CIA 'exfiltration' specialist concocts a risky plan to free six Americans who have found shelter at the home of the Canadian ambassador.",
                "popularity": 4.5663,
                "poster_path": "/m5gPWFZFIp4UJFABgWyLkbXv8GX.jpg",
                "release_date": "2012-10-11",
                "title": "Argo",
                "video": false,
                "vote_average": 7.281,
                "vote_count": 8597,
                "character": "Protestor (uncredited)",
                "credit_id": "6595b938a698cf6cbb439ff4",
                "order": 117
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Lucas Hall",
            "Luc Hall"
        ],
        "biography": "Early Life:\n\nLucas was raised in both Richmond and Beaverdam, Virginia. He attended Patrick Henry High School in Ashland, Virginia. Lucas attended Virginia Commonwealth University where he studied theatre performance. After he studied at Theatre VCU he toured nationally with Virginia Repertory Theatre (formerly Theatre IV, the Childrens Theatre of Virginia), for five years.\n\nActing Career:\n\nTheatre:\n\nLucas has performed in many theatres along the east coast from Wisconsin to Florida and Texas to Maine and every state in between. In 2003 he portrayed Wilbur Wright in The Wright Stuff while on tour with Theatre IV. Lucas, as Wilbur Wright, was the Co-Grand Marshal for The City of Hampton's 2003 Holly Days parade in honor of the 100 year anniversary of the Wright Brothers first flight. Lucas originated the role of John Smith in Theatre IV's first tour of The True Story of Pocahontas the musical. After touring with Theatre IV for five years, Lucas went on to work with several theatres in Virginia including Richmond Shakespeare (a Shakespeare Theatre Association member theatre), Swift Creek Mill Theatre, Mystery Dinner Playhouse, The School of the Performing Arts in the Richmond Community (SPARC), the Concert Ballet of Virginia, Sycamore Rouge and Virginia Patriots, among others.\n\nFilm & Television:\n\nLucas has worked on various film and television projects that have been seen on such networks as HBO, NBC, The History Channel, the Syfy channel, PBS, Lifetime, National Geographic Channel, Showtime, Destination America, etc.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://resumes.actorsaccess.com/LucasNHall/",
        "id": 1158373,
        "imdb_id": "nm2386829",
        "known_for_department": "Acting",
        "name": "Lucas N. Hall",
        "place_of_birth": "Richmond, Virginia, U.S.",
        "popularity": 0.0453,
        "profile_path": "/h5nm3zQHAzQRTQQPFos7K7dCCDd.jpg"
    }
}