{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6qOyw4yfzbzTp5YsCX26C28Do0S.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 872,
                "original_language": "en",
                "original_title": "Singin' in the Rain",
                "overview": "In 1927 Hollywood, a silent film star falls for a chorus girl just as he and his paranoid screen partner struggle to make the difficult transition to talking pictures.",
                "popularity": 4.2669,
                "poster_path": "/w03EiJVHP8Un77boQeE7hg9DVdU.jpg",
                "release_date": "1952-04-10",
                "title": "Singin' in the Rain",
                "video": false,
                "vote_average": 8.146,
                "vote_count": 3306,
                "character": "Call Boy (uncredited)",
                "credit_id": "61abe63b35db45009c89fa4e",
                "order": 23
            },
            {
                "adult": false,
                "backdrop_path": "/ft8WRF2xqEwwGWa59naDUybKTAx.jpg",
                "genre_ids": [
                    18,
                    10752,
                    10749
                ],
                "id": 770,
                "original_language": "en",
                "original_title": "Gone with the Wind",
                "overview": "The spoiled daughter of a Georgia plantation owner conducts a tumultuous romance with a cynical profiteer during the American Civil War and Reconstruction Era.",
                "popularity": 7.332,
                "poster_path": "/lNz2Ow0wGCAvzckW7EOjE03KcYv.jpg",
                "release_date": "1939-12-15",
                "title": "Gone with the Wind",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 4191,
                "character": "Wounded Soldier (uncredited)",
                "credit_id": "555a4c349251412de80038ed",
                "order": 43
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "John Albright started out in films in 1935 playing bellboys, students, and dancers but like most actors, his career was interrupted by World War II when he joined the Air Force. Upon returning, he resumed his career where he was made a contract player at MGM during the height of the musical era because of him his youthful looks and his ability to dance.\n\nBy the late 1940s, Albright started appearing in more and more sequences that required your generic looking townsman. He transitioned into courtroom scenes in dramas, townsman in westerns, and he would still occasionally play a bellboy or a bellhop because of his youthful appearances.\n\nIn the 1950s, he turned his sights towards the more political aspects of the Screen Extras Guild and got elected to their board. This was not a full time job though and because of his connections at Warner Brothers and MGM, he was able to appear in countless dramas and television westerns in his usual sort of roles.\n\nHis roles continued throughout the 1970s but something happened to Albright and a lot of other old time actors. The nostalgia market was in full swing and people wanted to hear about his experiences during the filming of Gone With the Wind. This lead to Albright occasionally appearing at a convention centered on the movie and it also led him to appear in several documentaries about Gone With the Wind until he passed away in 2001.",
        "birthday": "1913-04-04",
        "deathday": "2001-10-24",
        "gender": 2,
        "homepage": null,
        "id": 115992,
        "imdb_id": "nm0017021",
        "known_for_department": "Acting",
        "name": "John Albright",
        "place_of_birth": "Reading, Pennsylvania, USA",
        "popularity": 0.0362,
        "profile_path": null
    }
}