{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xwVkihNJYn6wR8Sip1aoIz5ax35.jpg",
                "genre_ids": [
                    28,
                    12,
                    53
                ],
                "id": 1669,
                "original_language": "en",
                "original_title": "The Hunt for Red October",
                "overview": "A new technologically-superior Soviet nuclear sub, the Red October, is heading for the U.S. coast under the command of Captain Marko Ramius. The American government thinks Ramius is planning to attack. Lone CIA analyst Jack Ryan has a different idea: he thinks Ramius is planning to defect, but he has only a few hours to find him and prove it - because the entire Russian naval and air commands are trying to find Ramius, too. The hunt is on!",
                "popularity": 5.8431,
                "poster_path": "/yVl7zidse4KiWtGMqHFtZCx4X3N.jpg",
                "release_date": "1990-03-02",
                "title": "The Hunt for Red October",
                "video": false,
                "vote_average": 7.376,
                "vote_count": 3445,
                "character": "Seaman (Red October)",
                "credit_id": "61208f93385202002b2caa58",
                "order": 32
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Иван Иванов"
        ],
        "biography": "Ivan Georgiev Ivanov is born on December 16, 1951 in Asenovgrad, Bulgaria. He graduated \"acting\" in National Academy for Theatre and Film Art, Sofia, Bulgaria in the class of Professor Dimitrina Gyurova . Ivan Ivanov has played on the stages of Youth Theatre and Bulgarian Army's Theater until 1983 . The movie \"Everything is Love\" is the film, after which the actor Ivan Ivanov became a sex symbol of Bulgarian cinema. Besides Rado of \"Everything is love,\" he is Assen in \"Avalanche\" ( 1982 ); Vas / Christo in the \"Combine\" (1982 ) and Trajan in \"Measure of Remand\" (1983 ). He starred in films of directors like Borislav Sharaliev ( \"Boris I\", 1985 ), Zako Heskiya ( \"Night with the white horses\", 1985), Ivan Andonov ( \"Dreamers\", 1987 ) and others. After the TV series \"Burn, burn light\" (1994) the actor released his first book of short stories and poems - \"This life, that life.\" Then come two more - \"Answer\" and \"Seven Hours Difference.\" By the first few years of the 21st century Ivanov has been engaged in dubbing movies and serials. In Bulgarian National Television he is voiced in the miniseries \"Masada,\" in the films \"Les Miserables\" (the role of Jean-Paul Belmondo), \"Love in the Clouds\" (the role of Keanu Reeves) and others; for bTV he is voiced the role of Tim Daly in the series \"The Fugitive.\" He is married to Petya Silyanova.Ivan Ivanov and Petya have a son - Stefan better known by his rap moniker Wosh MC and also the eldest son - George, who has managed as a metropolitan lawyer (judge).",
        "birthday": "1951-12-16",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 115988,
        "imdb_id": "nm0412050",
        "known_for_department": "Acting",
        "name": "Ivan Ivanov",
        "place_of_birth": "Asenovgrad, Bulgaria",
        "popularity": 0.1584,
        "profile_path": "/dJ6H0Wq9zthQa1XqPfzaBMw5F7Y.jpg"
    }
}