{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kF8ljC7Y4p1UsmKBi2LxelZpqw.jpg",
                "genre_ids": [
                    27,
                    35,
                    14
                ],
                "id": 917496,
                "original_language": "en",
                "original_title": "Beetlejuice Beetlejuice",
                "overview": "After a family tragedy, three generations of the Deetz family return home to Winter River. Still haunted by Betelgeuse, Lydia's life is turned upside down when her teenage daughter, Astrid, accidentally opens the portal to the Afterlife.",
                "popularity": 10.6067,
                "poster_path": "/kKgQzkUCnQmeTPkyIwHly2t6ZFI.jpg",
                "release_date": "2024-09-04",
                "title": "Beetlejuice Beetlejuice",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 2741,
                "character": "Jane Butterfield",
                "credit_id": "6698089f3ee6cf3aa332c878",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Amy Abigail Nuttall is an English actress and singer. She is known for her roles as Chloe Atkinson in the ITV soap opera Emmerdale (2000–2005), housemaid Ethel Parks in the ITV/PBS period drama Downton Abbey (2011–2012), and \"Little\" Jane Butterfield in Beetlejuice Beetlejuice.\n\nNuttall was born in Blackburn, Lancashire. She was educated at Bury Grammar School for Girls and trained at Tring Park School for the Performing Arts. She performed with the National Youth Music Theatre, notably playing the lead role of Princess Ismene in Aurelius at the Tyne Opera House, Newcastle and the Assembly Rooms in Edinburgh in August 1997.\n\nNuttall is credited as the youngest actress to ever understudy and play the lead role of Christine in The Phantom of the Opera (at age 17) (National Tour), she has sung at the Royal Albert Hall, Royal Festival Hall and Old Trafford and won an edition of Celebrity Stars in Their Eyes as Sarah Brightman.\n\nShortly before leaving Emmerdale, Nuttall appeared in Notes from New York at the Trafalgar Studios opposite Jon Lee and Julie Atherton. In 2005, she released her debut album as a classical vocalist, Best Days, on EMI Classics and filmed music videos for her tracks \"Best Days\", \"No Greater Gift\" and a version of \"Scarborough Fair\", which was heavily requested on Classic FM TV. Best Days peaked at number four in the UK classical chart and was nominated for Album of the Year at the 2006 Classic BRIT Awards.\n\nIn the same year, Nuttall took part in the reality TV programme Celebrity Shark Bait, which also featured Richard E. Grant and Ruby Wax and appeared in Celebrate Oliver, a musical special for BBC1.\n\nIn the autumn of 2005, Nuttall toured the UK extensively as Eliza Doolittle in My Fair Lady to critical acclaim. She shared the role with Lisa O'Hare on the National Tour due to other commitments with her first album. The tour started on 5 October 2005 at the Palace Theatre in Manchester and ended on 12 August 2006 at the Wales Millennium Centre in Cardiff.\n\nIn January 2007, Nuttall performed on BBC Radio 2's Friday Night is Music Night with an 80-piece live orchestra and in May 2007, she joined the cast of the stage revival of Boeing-Boeing at the Comedy Theatre opposite Patricia Hodge, Mark Rylance and Roger Allam. On 2 October 2007, Nuttall replaced Kim Medcalf in the London production of Cabaret at the Lyric Theatre, transferring directly from her role in Boeing-Boeing. In April 2008, Nuttall's initial six-month contract was extended until the production's closure on 21 June. Nuttall appeared in Hotel Babylon in 2009 as Melanie Hughes, the new hotel receptionist.\n\nIn June and July 2010, Nuttall played one of the lead roles in the revival of the hit musical The Hired Man at the Octagon Theatre, Bolton. Later that year, she returned to the Octagon Theatre, Bolton to play Stella Kowalski in the Tennessee Williams classic A Streetcar Named Desire. She shared the role of the Lady of the Lake in the UK tour of Spamalot, which began on 18 October 2010 at the Edinburgh Playhouse. From September 2011, Nuttall began appearing in the second series of Downton Abbey, appearing as the new maid, Ethel.",
        "birthday": "1982-06-07",
        "deathday": null,
        "gender": 1,
        "homepage": "https://theartistspartnership.co.uk/artist/amy-nuttall/",
        "id": 1160625,
        "imdb_id": "nm1142271",
        "known_for_department": "Acting",
        "name": "Amy Nuttall",
        "place_of_birth": "Blackburn, Lancashire, England, UK",
        "popularity": 0.3774,
        "profile_path": "/uQS399fI8KdUgWKu3JtQi4xjInt.jpg"
    }
}