{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6TjllWT3cGrPFyqDXurVZ3L8bBi.jpg",
                "genre_ids": [
                    9648,
                    53,
                    18
                ],
                "id": 745,
                "original_language": "en",
                "original_title": "The Sixth Sense",
                "overview": "Following an unexpected tragedy, child psychologist Malcolm Crowe meets a nine year old boy named Cole Sear, who is hiding a dark secret.",
                "popularity": 8.5538,
                "poster_path": "/vOyfUXNFSnaTk7Vk5AjpsKTUWsu.jpg",
                "release_date": "1999-08-06",
                "title": "The Sixth Sense",
                "video": false,
                "vote_average": 7.95,
                "vote_count": 12255,
                "character": "Mr. Collins",
                "credit_id": "52fe426fc3a36847f801e767",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/aoQW8NH6yY2ioQke0iKt0JZxXgv.jpg",
                "genre_ids": [
                    14,
                    18
                ],
                "id": 7980,
                "original_language": "en",
                "original_title": "The Lovely Bones",
                "overview": "After being brutally murdered, 14-year-old Susie Salmon watches from heaven over her grief-stricken family -- and her killer. As she observes their daily lives, she must balance her thirst for revenge with her desire for her family to heal.",
                "popularity": 5.9286,
                "poster_path": "/sn0iDphRxQ7I6aLd9igIgACITak.jpg",
                "release_date": "2009-12-26",
                "title": "The Lovely Bones",
                "video": false,
                "vote_average": 7.069,
                "vote_count": 4778,
                "character": "Hospital Doctor",
                "credit_id": "5c6ec727c3a3683bf0e458c0",
                "order": 29
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia.\n\nGreg Wood is a British actor. He was previously known as Greg Milburn. Greg's first acting role was in Hollyoaks, playing one of the bully's in the ground breaking portrayal of Luke Morgan's rape. Greg would then go on to play what is possibly his best known role in the now defunct soap Brookside playing a drug dealer called Terry Gibson, he later reprised the role for the spin-off DVD Unfinished Business and was one of four nominated for Soap Villan of the Year.\n\nSince leaving Brookside Greg Wood has appeared in The Courtroom, Casualty 1907 and has appeared twice in Emmerdale.\n\nGreg is the brother of Matt Milburn who played Joe Spencer in Hollyoaks\n\nHis most recent role has been playing a debt collector, Rick Neelan, in Coronation Street. Greg will be going up for the 'Best Villain' award for Coronation Street in the British Soap Awards this year.\n\nOn April 14, 2010 Coronation Street was cleared by Ofcom for broadcasting a scene where Greg's characher Rick Neelan pushed a burning newspaper through someone's letterbox. 31 people complained about the scene, claiming that the show had incited and encouraged crime. However Ofcom ruled that it was \"not likely to encourage or incite the commission of crime or lead to disorder\".\n\nDescription above from the Wikipedia article Greg Wood, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 11618,
        "imdb_id": "nm0939731",
        "known_for_department": "Acting",
        "name": "Greg Wood",
        "place_of_birth": "Manchester, Lancashire",
        "popularity": 0.1247,
        "profile_path": "/rpOK5GEHI0FH0EnTXZutLUKkcpx.jpg"
    }
}