{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/t8EDE4bkYZBaSCo7Gq8uIWtW4pV.jpg",
                "genre_ids": [
                    28,
                    18,
                    80
                ],
                "id": 11344,
                "original_language": "ko",
                "original_title": "달콤한 인생",
                "overview": "Kim Sun-woo is an enforcer and manager for a hotel owned by a cold, calculative crime boss, Kang who assigns Sun-woo to a simple errand while he is away on a business trip; to shadow his young mistress, Hee-soo, for fear that she may be cheating on him with a younger man with the mandate that he must kill them both if he discovers their affair.",
                "popularity": 3.4959,
                "poster_path": "/czoCxjadYUT2oe9cKzSnU6ZrYoI.jpg",
                "release_date": "2005-04-01",
                "title": "A Bittersweet Life",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 930,
                "character": "Hee-soo",
                "credit_id": "52fe442a9251416c7502b227",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Sin Min-a",
            "양민아",
            "Yang Min-a",
            "新慜娥",
            "Shin Min-ah",
            "شین مین آ",
            "شین مین اه",
            "شین مینا",
            " Shin Mina"
        ],
        "biography": "Shin Min-ah, born April 5th, 1984 with the birth name Yang Min-ah (양민아), is a popular South Korean actress & model. Her family consists of a father, mother, older sister & brother. In middle school, she took a picture with her friends on a school picnic and sent the photo to the teen magazine KiKi (\"키키\"). From that picture, she was chosen as a model for the magazine. Afterward, she would first appear in commercials and music videos. In 2001, she made her acting debut in the movie \"Volcano High\" and would appear again two years later in \"Madeleine\". Her breakout performance would occur in the 2005 gangster film \"A Bittersweet Life\". Her character, Hee-soo, displayed a mixture of purity and maturity that captivated South Korean audiences. Since that time, she has received an assortment of acting offers from top Korean directors and expanded her acting repertoire by selecting various types of roles: from the martial-arts comedy \"My Mighty Princess\" to 70's go-go dancer \"Go Go 70s\" to the smaller independent film \"Sisters on the Road\".\n\nMore recently in 2009, Shin Min-ah participated in the project \"Miracle Blue,\" which is a collaboration between herself, the Korean alternative band Loveholic, and the fashion design company, Calvin Klein. In the music video \"Miracle Blue,\" in which she sings, she also performs as various characters displaying child-like innocence to the sexy blonde-haired singer.",
        "birthday": "1984-04-05",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 116175,
        "imdb_id": "nm1086555",
        "known_for_department": "Acting",
        "name": "Shin Min-a",
        "place_of_birth": "Seongnam, Gyeonggi, South Korea",
        "popularity": 0.6143,
        "profile_path": "/6CjxjYvZBuvbAQTcuoPb8EeVrUI.jpg"
    }
}