{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/aSA7RuKmCQBnYKn70GYPi6ckgoY.jpg",
                "genre_ids": [
                    28,
                    53,
                    18
                ],
                "id": 11690,
                "original_language": "en",
                "original_title": "Bloodsport",
                "overview": "An American Army Major goes AWOL to Hong Kong for an outlawed martial arts contest called the Kumite.",
                "popularity": 4.3784,
                "poster_path": "/kndxR9TRK0kJ5hxzDprRSS80F2W.jpg",
                "release_date": "1988-02-26",
                "title": "Bloodsport",
                "video": false,
                "vote_average": 7.027,
                "vote_count": 1994,
                "character": "Janitor",
                "credit_id": "64a20d97d5191f00ac931e1c",
                "order": 30
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "陳志文",
            "Mandy Go Man-Dik",
            "Chan Man-Dik",
            "Ko Man-Dik",
            "Gao Min-Di",
            "陈志文",
            " 陳恩文",
            "高文迪",
            "高民迪"
        ],
        "biography": "Mandy was born in 1963 in Hong Kong. His father But Fan Chan is famous for his Chinese calligraphy. Mandy immigrated with his parents to Boston in 1976. His passion for martial arts started at the age of 12, when he was inspired by a Bruce Lee movie, Enter the Dragon. Growing up in the streets of Boston’s China Town, he took kung fu lessons and practiced his first kung-fu moves with his mentor like Donnie Yen 甄子丹 (currently he is the number one movie actor in Asia) and John S. (who is Hong Kong secretary of treasury). At school Mandy, as a part of Chinese culture classes, started to take Chinese dancing lessons and thus began his first on-stage experience, which inspired in him a passion for performing.\n\nAt the age of 20, his martial arts skills and personal charm led him back to Hong Kong, where he moved in 1983 with his good friend, Donnie Yen, to launch a movie career.  He appeared in more than 50 movies, ranging from action to drama and comedy, among them Bloodsport (with Jean Claude Van Damme), Legend of the Wolf, Drunken Tai Chi and Satan’s Return. He was also an action director of several films, including The Six Devil Women, The Green Hornet and Circus Kid. His mentors, teachers and partners were always the Yuen brothers: Yuen Woo-ping 袁和平, the Academy Award & Mac226 winning choreographer of Crouching Tiger, Hidden Dragon in 2000, who also launched the career of Jackie Chan in Snake in Eagle’s Shadow (1978) and Drunken Master (1978), and Yuen Cheung-yan 袁祥仁. They are also both known in the USA for directing movies like The Matrix (trilogy), Kill Bill Volume 1 & Volume 2, Kung Fu Hustle, Once Upon A Time In China (series), Iron Monkey, and of course The Forbidden Kingdom.\n\nMandy Chan is a multitalented person with amazing skills, not only as an actor, stunt man, and fight choreographer, but also as an action director and producer, inspired by and side by side with the Yuen brothers. His movie career led him to travel all over the world to film not just in Hong Kong, but also in China, Thailand, Taiwan, Yugoslavia, Canada and South Africa.\n\nCurrently, he owns Ultimate Film Studio Production, and Sky Lab Video Entertainment. Using his multi-talented skills in small, affordable but professional quality video production in a wide range of services which cover short films, documentaries, ads & commercials, birthday parties, and wedding ceremonies; you name it, and Mandy produces it. He also teaches a movie making class at Bunker Hill College, MA and runs an on-going martial arts film production program at Chinese Martial Arts of Acton, MA. With his expertise from years in front of and behind the camera, his curriculum reveals the magic of creating a movie, from acting to choreography and stunts, both pre-production and post- production. Camera angles, movement, lens usage, and lighting are covered; he discusses, demonstrates and teaches scene continuity, along with editing, sound effects, music and exporting the final product to the web, file or DVD.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 116352,
        "imdb_id": "nm0151015",
        "known_for_department": "Acting",
        "name": "Mandy Chan Chi-Man",
        "place_of_birth": null,
        "popularity": 0.4587,
        "profile_path": "/oNLuaZirgjyBhFD4QnaUXMclLTl.jpg"
    }
}