{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/inEy3A5OPgeYW4rjRiGycfEeQzA.jpg",
                "genre_ids": [
                    18
                ],
                "id": 637920,
                "original_language": "tr",
                "original_title": "7. Koğuştaki Mucize",
                "overview": "Separated from his daughter, a father with an intellectual disability must prove his innocence when he is jailed for the death of a commander's child.",
                "popularity": 5.1081,
                "poster_path": "/bOth4QmNyEkalwahfPCfiXjNh1r.jpg",
                "release_date": "2019-10-10",
                "title": "Miracle in Cell No. 7",
                "video": false,
                "vote_average": 8.256,
                "vote_count": 4489,
                "character": "Memo",
                "credit_id": "5db7743527d9cc0018147d8c",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "آراس بولوت اینملی"
        ],
        "biography": "Aras Bulut Iynemli is a Turkish actor. Iynemli has won numerous accolades for his acting since the beginning of his career. He is best known for his performances in the television series Oyle Bir Gecer Zaman ki (English: As Time Goes by), Muhtesem Yuzyil (English: Magnificent Century), Maral, Icerde (English: Inside) and Cukur (English: The Pit).\n\nHe has an older brother, actor Orcun Iynemli and an older sister, television host and singer Yesim Iynemli. Other relatives who are actors are Miray Daner (cousin), Cengiz Daner (uncle) and Ilhan Daner (great uncle).\n\nAfter playing a role in 2-3 commercials, he got a role in the drama series Oyle Bir Gecer Zaman ki in 2010. This drama gained international success and Iynemli received a reward as well. Before this he had also worked in the drama Back Street, but he took a hiatus after the first part as he had to complete his education of aircraft engineering. He won OSS (SAT exam in Turkey) as one of first 100 students. He continued his studies at the Istanbul Technical University. In 2011, while he was 20 he received the Antalya Television Award for Best Supporting Actor.\n\nIn 2013 he appeared in the Azerbaijani-Turkish movie Mahmut and Meryem, based on a novel by Elcin Efendiyev. He played a disabled boy in Tamam miyiz? and portrayed Sehzade Bayezid on Muhtesem Yuzyil in the same year.\n\nIn 2015, Iynemli was selected to play the main male character in the series Maral: En Guzel Hikayem together with the actress Hazal Kaya. In 2016-17, he played the role of Umut Yilmaz / Mert Karadag in Icerde. In 2017, he began playing the role of Yamac Kocovali in Cukur.\n\nIn 2019, Iynemli portrayed a mentally ill father who was wrongly imprisoned for murder in 7. Kogustaki Mucize, which broke viewing records in Turkey within a short period. After the movie was broadcast on Netflix, it was well received by audience in France and Latin America.\n\nIn addition to his acting career, Iynemli has appeared in many advertising films and is the face of numerous brands.",
        "birthday": "1990-08-25",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1163030,
        "imdb_id": "nm4199420",
        "known_for_department": "Acting",
        "name": "Aras Bulut Iynemli",
        "place_of_birth": "Istanbul, Turkey",
        "popularity": 0.8735,
        "profile_path": "/qA0t21ZwXQxjUYPPoKYLfFDyUFE.jpg"
    }
}