{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/g27PNNr3GNo72hf86KIHjzx66H4.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 226857,
                "original_language": "en",
                "original_title": "Endless Love",
                "overview": "A privileged girl and a charismatic boy's instant desire sparks a love affair made only more reckless by parents trying to keep them apart.",
                "popularity": 4.5752,
                "poster_path": "/z7FZP6uivgVc4t0mnmia0B8YygW.jpg",
                "release_date": "2014-02-12",
                "title": "Endless Love",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 1714,
                "character": "Dawn",
                "credit_id": "59c576c79251415b6e02f61e",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Brittany Montgomery"
        ],
        "biography": "actresses. Excelling in both comedy and drama, Stephanie possesses that rare ability to portray leading lady and character roles with consummate skill.\n\nStephanie trained in Los Angeles at the Ivanna Chubbuck Studio in Hollywood. She graduated Phi Beta Kappa from The University of Virginia, with a BA in English Literature and Modern Studies.\n\nHot off the set, Stephanie wrapped Endless Love, directed by Shana Feste, playing opposite Bruce Greenwood, Alex Pettyfer, Joley Richardson and Gabriella Wilde. Release is set for Valentine's Day 2014!\n\nHotter off the set, Stephanie finished up Season II of Banshee. She plays the recurring character \"Meg Yawners\" in this hit Cinemax series by Alan Ball, directed by Greg Yaitanes.\n\nWatch for Stephanie opposite Owen Wilson as sexy \"Bonnie\" in the feature film You Are Here directed by Mathew Weiner. The film is currently at the Toronto Film Festival 2013!\n\nStephanie recently co-starred on Lifetime's hit show Drop Dead Diva as porn star wife \"Lisa Hillman\" which aired live in July 2012.\n\nWatch for Stephanie on the indie circuit too! She stars in Headsome the grisley 3-D horror movie. She landed a supporting role in the tear-jerker The Heart of the Country directed by John ward. She is currently in production as the darling nemesis \"Stella\" in The 12 Lives of Sissy Carlyle.  \n\nStephanie's first professional TV role was bit part on the soap opera The Bold and The Beautiful. Stephanie went on to take leading roles as gun-shooting Annie McBride in the Western Vengenace Trail and as Parker in the cult classic Scream Bloody Murder. Stephanie's first Guest Star role on network television was as British fashionista \"Ms. Jacobs\" in Tyler Perry's Meet the Browns.\n\nStephanie was awarded Best Actress for her breathtaking portrayal as Sunny in The Last Night of Ballyhoo on the SMTG stage. Stephanie recently wowed Atlanta audiences with her comedic skills in Got Sketch? appearing on the mainstage of Sketchsworks Comedy.\n\nStephanie continues to develop her first love of dancing. She grew up performing and competing nationally in tap, jazz, ballet and modern. She founded The University of Virginia Dance Company and went on direct and choreograph original works. Stephanie now studies flamenco at Calo Gitano Flamenco Academy.\n\nStephanie is world travelled, having lived in Prague and Italy for two years as a writer and model. Stephanie returned to her native home of Atlanta where she currently resides in a Victorian house with her cat, Cotton.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.stephanienorthrup.com",
        "id": 116464,
        "imdb_id": "nm1077528",
        "known_for_department": "Acting",
        "name": "Stephanie Northrup",
        "place_of_birth": null,
        "popularity": 0.0857,
        "profile_path": "/zDggzWOzC8HJOik84Ay7KCYwvIu.jpg"
    }
}