{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/iVQifEAWEGA5ajuTjLFv3kFSIOK.jpg",
                "genre_ids": [
                    10752,
                    18
                ],
                "id": 398924,
                "original_language": "fr",
                "original_title": "Un sac de billes",
                "overview": "At the beginning of the 1940s, in a France occupied by Nazi forces, lived the Jewish Joffo family. Happy and tight-knit, she sees her future darken when all members of the family are forced to wear the yellow star. Fearing the worst, the parents organized their family to flee to the free zone in the south of the country. Maurice, twelve years old, and Joseph, ten years old, will therefore leave alone in order to maximize their chances of finding their older brothers already settled in Nice.  The brothers left to their own devices demonstrate an incredible amount of cleverness, courage, and ingenuity to escape the enemy invasion and to try to reunite their family once again.",
                "popularity": 1.255,
                "poster_path": "/kjVPBXfo7frULyUzQ8NRPAflP8G.jpg",
                "release_date": "2017-01-18",
                "title": "A Bag of Marbles",
                "video": false,
                "vote_average": 7.8,
                "vote_count": 877,
                "character": "Ferdinand",
                "credit_id": "57435f649251415bee000973",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/wfrfxivLOBtGMC98tIr2LSOeKSe.jpg",
                "genre_ids": [
                    16,
                    10751,
                    35,
                    14,
                    12
                ],
                "id": 639721,
                "original_language": "en",
                "original_title": "The Addams Family 2",
                "overview": "The Addams get tangled up in more wacky adventures and find themselves involved in hilarious run-ins with all sorts of unsuspecting characters.",
                "popularity": 5.6836,
                "poster_path": "/ld7YB9vBRp1GM1DT3KmFWSmtBPB.jpg",
                "release_date": "2021-10-01",
                "title": "The Addams Family 2",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 1352,
                "character": "(voice) (uncredited)",
                "credit_id": "68c71c28b878dbe094230e7c",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Kevin Smadja",
            "Kev' Adams",
            "Кев Адамс"
        ],
        "biography": "Kev Adams or Kev' Adams (born Kevin Smadja; 1 July 1991) is a French comedian, actor, humorist, screenwriter and film producer.\n\nAdams was born in 1991 in the 16th district of Paris. His father is a real estate agent of Algerian Jewish descent and his mother, of Tunisian Jewish descent, works in finance. He has two younger brothers, Noam and Lirone. He began taking theater classes at the age of seven. In 2009, Adams completed his French Baccalaureate in literature, and enrolled in law at the University of Paris X-Nanterre while simultaneously pursuing his acting career. He claimed that it was, \"extremely difficult, nearly impossible, to balance both.\"\n\nIn 2009, Adams was spotted by Elisa Soussan, Anne Roumanoff's producer, who invited him to perform at her Carte Blanche show at the Olympia (Paris). This stage performance was broadcast on Paris Première. Following this event, Adams was offered to be the opening act of a Gad Elmaleh show at the Palais des Sports. His first one-man show, The Young Man Show, first ran in Paris in 2009 at the Théâtre Le Temple and then continued at the Palais des Glaces before touring France. The tour ended in Switzerland on July 22, 2012, during the Paléo Festival de Nyon. He then performed a show called Test… Voilà, Voilà! at the Bataclan from November 27 to December 31, 2013.\n\nAs of May 2014, Adams has more than 3 million fans on Facebook and more than 1 million followers on Twitter and in 2017 more 4 million followers on instagram.\n\nFrom September 2010 to February 2011, Adams was a contestant on the TV program On n'demande qu'à en rire (\"We just want to laugh at it\", literally \"We ask only to laugh at it\") hosted by Laurent Ruquier. He left the show voluntarily to dedicate himself to the Soda television series, in which he plays a major role. Soda depicts the daily life of three boys and includes guest stars such as La Fouine and Amel Bent. Since the summer of 2011, the series has been broadcast on M6, and on W9 in 2012. Season three close the series in 2015.\n\nThe same year he has his biggest box office successes with Serial Teachers, as the almost-school dropout and his adventures with the worst teachers of France, and The New Adventures of Aladdin, as one of the thieves caught by the children in the midst of a robbery on Christmas Eve.\n\nIn 2018, he created the animated series Kev's World (\"Le Monde selon Kev\"). He also voiced himself in the original French version.\n\nSource: Article \"Kev Adams\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1991-07-01",
        "deathday": null,
        "gender": 2,
        "homepage": "https://kevadams-officiel.fr/",
        "id": 1165008,
        "imdb_id": "nm1133795",
        "known_for_department": "Acting",
        "name": "Kev Adams",
        "place_of_birth": "Paris, France",
        "popularity": 0.3415,
        "profile_path": "/jTqAH5n7CfPkolBIe0Bp6AfPYhZ.jpg"
    }
}