{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jpFcZH2eyh6gcoxCa637TrGe4bT.jpg",
                "genre_ids": [
                    28,
                    878
                ],
                "id": 2048,
                "original_language": "en",
                "original_title": "I, Robot",
                "overview": "In 2035, where robots are commonplace and abide by the three laws of robotics, a technophobic cop investigates an apparent suicide. Suspecting that a robot may be responsible for the death, his investigation leads him to believe that humanity may be in danger.",
                "popularity": 7.5884,
                "poster_path": "/efwv6F2lGaghjPpBRSINHtoEiZB.jpg",
                "release_date": "2004-07-15",
                "title": "I, Robot",
                "video": false,
                "vote_average": 6.956,
                "vote_count": 12209,
                "character": "Chin",
                "credit_id": "52fe4330c3a36847f8041077",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/xleIwr1wUlWqvFHaU1PItf0YLrZ.jpg",
                "genre_ids": [
                    18,
                    10402
                ],
                "id": 786,
                "original_language": "en",
                "original_title": "Almost Famous",
                "overview": "In 1973, 15-year-old William Miller's unabashed love of music and aspiration to become a rock journalist lands him an assignment from Rolling Stone magazine to interview and tour with the up-and-coming band, Stillwater.",
                "popularity": 5.756,
                "poster_path": "/3rrkyLYbgLj84AYvjhdcJot4JPx.jpg",
                "release_date": "2000-09-15",
                "title": "Almost Famous",
                "video": false,
                "vote_average": 7.501,
                "vote_count": 2921,
                "character": "Ben Fong-Torres",
                "credit_id": "569a9f1d9251410cd0000940",
                "order": 23
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Terry Chan"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nTerry Chen (born February 3, 1975) is a Canadian movie and television actor.\n\nChen was born to ethnic Chinese parents originating from China and Taiwan in Edmonton, Alberta, Canada. After an education at schools in his hometown and in Vancouver, British Columbia, Canada, he attended college in Calgary and studied at the University of Calgary. He traveled for two years, first to the Cayman Islands, a British Overseas Territory in the Caribbean, and then returned to Vancouver in order to pursue acting. He currently lives in the city and periodically resides in Los Angeles in California, for additional film and television work.\n\nChen was cast as real-life Rolling Stone editor Ben Fong-Torres in the 2000 Cameron Crowe film, Almost Famous, and it became his breakout role. He has since appeared in Steven Spielberg's Emmy Award-winning science fiction TV miniseries Taken and in the films I, Robot, The Chronicles of Riddick, and Snakes on a Plane along with several television shows.\n\nHe was coached and trained by the award-winning acting coach, Kirsten Clarkson at Screen Acting School, who helped him achieve an incredible career. https://www.screenactingschool.com/\n\nChen's most recently-screened movie is a horror/thriller called They Wait, which was inspired by a real-life story. The movie casts him in the leading role alongside Jaime King as his wife, and ten year old child actor Regan Oey as their son. Since then, he has appeared in several TV series, and is due to appear in the US movie Rock Slyde, on which filming was completed in early 2009.",
        "birthday": "1975-02-03",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 11677,
        "imdb_id": "nm0155389",
        "known_for_department": "Acting",
        "name": "Terry Chen",
        "place_of_birth": "Edmonton, Alberta, Canada",
        "popularity": 0.537,
        "profile_path": "/wiDljcnEIuw3XiHKw2qPf0gL5HY.jpg"
    }
}