{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/OfH6y4NfYpzHcA67nwT5TjhSzJ.jpg",
                "genre_ids": [
                    18,
                    10749,
                    9648
                ],
                "id": 17057,
                "original_language": "en",
                "original_title": "In a Lonely Place",
                "overview": "A violent screenwriter and a female neighbor fall in love after she clears him of murder, but she begins to have second thoughts.",
                "popularity": 2.1395,
                "poster_path": "/vbdgtwzLOpE6MppZlyYChMagvQq.jpg",
                "release_date": "1950-05-17",
                "title": "In a Lonely Place",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 619,
                "character": "Post Office Clerk (uncredited)",
                "credit_id": "630e61c9af85de007aa94be8",
                "order": 29
            },
            {
                "adult": false,
                "backdrop_path": "/i7n9u1SppzXcSO2EVgwEehzABzm.jpg",
                "genre_ids": [
                    37
                ],
                "id": 17529,
                "original_language": "en",
                "original_title": "True Grit",
                "overview": "The murder of her father sends a teenage tomboy on a mission of 'justice', which involves avenging her father's death. She recruits a tough old marshal, 'Rooster' Cogburn because he has 'true grit', and a reputation of getting the job done.",
                "popularity": 3.7222,
                "poster_path": "/9TjGjAD2deCtIG4ebi8LhIyFK6j.jpg",
                "release_date": "1969-06-11",
                "title": "True Grit",
                "video": false,
                "vote_average": 7.331,
                "vote_count": 818,
                "character": "Deputy at Prisoner Unloading (uncredited)",
                "credit_id": "63370e890d11f2007f50bd9e",
                "order": 29
            },
            {
                "adult": false,
                "backdrop_path": "/38uM6QuI06znUCELfOSiVQy05CX.jpg",
                "genre_ids": [
                    37
                ],
                "id": 301,
                "original_language": "en",
                "original_title": "Rio Bravo",
                "overview": "A small-town sheriff in the American West enlists the help of a disabled man, a drunk, and a young gunfighter in his efforts to hold in jail the brother of the local bad guy.",
                "popularity": 5.5199,
                "poster_path": "/4gI4KKmoi0d3yfsF71YU3S0I5t8.jpg",
                "release_date": "1959-03-18",
                "title": "Rio Bravo",
                "video": false,
                "vote_average": 7.813,
                "vote_count": 1204,
                "character": "Barfly (uncredited)",
                "credit_id": "5704579ec3a36869890012f0",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            " Myron Healy",
            "Myron D. Healy",
            "Michael Healy",
            "Myron D. Healey",
            "Michael Healey",
            "Myron Daniel Healey"
        ],
        "biography": "Myron Daniel Healey was an American actor. He began his career in Hollywood, California, during the early 1940s in bit parts and minor supporting roles at various studios.\n\nHealey's film debut came in 1943 with Young Ideas. Returning to film work after the war, Healey played villains and henchmen in low-budget western films. He also did some screenwriting. In the post-war period he was often seen in westerns from Monogram Pictures, often starring Johnny Mack Brown, Jimmy Wakely and Whip Wilson.\n\nIn the 1950s Healey moved to more \"bad guy\" roles in other films, including the Bomba and Jungle Jim series, crime dramas and more westerns. He portrayed the bandit Bob Dalton in an episode of the syndicated television series Stories of the Century, starring and narrated by Jim Davis. In 1955, he played a \"good guy\" for a change as Phyllis Coates' partner in the 1955 Republic Pictures serial Panther Girl of the Kongo.\n\nHealey appeared seven times as Capt. Bandcroft in The Adventures of Kit Carson. Healey played the outlaw Johnny Ringo in the western television series Tombstone Territory, with Pat Conway as Sheriff Clay Hollister, in the episode \"Johnny Ringo's Last Ride\". He appeared in an episode of the children's western series Buckskin, which aired on NBC from 1958-59. He was a semi-regular on programs produced by Gene Autry's Flying A production company: Annie Oakley, Buffalo Bill, Jr., The Range Rider, and The Gene Autry Show. He also guest-starred on the crime drama with a modern western setting, Sheriff of Cochise, starring John Bromfield, and in the western set in the 1840s, Riverboat, starring Darren McGavin. He also appeared in an episode of the second season of Zorro.\n\nBetween 1960 and 1963, Healey appeared five times on the NBC western Laramie, starring John Smith and Robert Fuller. He appeared ten times on another NBC western, The Virginian, and four times on Laredo.\n\nFrom 1959 to 1961, he played Maj. Peter Horry, top aide to Leslie Nielsen, in the miniseries Swamp Fox on Walt Disney Presents, based on the American Revolutionary War hero Francis Marion. In 1970, Healey appeared as Wardlow in the TV western \"The Men From Shiloh\" (the rebranded name of The Virginian) in the episode titled \"Jenny.\"\n\nCollectively, Healey appeared in some 140 films, including 81 westerns and three serials. Among his non-western pictures, he appeared in at least two horror films: the Americanized version of the Japanese giant-monster movie Varan the Unbelievable and The Incredible Melting Man.",
        "birthday": "1923-06-08",
        "deathday": "2005-12-21",
        "gender": 2,
        "homepage": null,
        "id": 116845,
        "imdb_id": "nm0372271",
        "known_for_department": "Acting",
        "name": "Myron Healey",
        "place_of_birth": "Petaluma, California, USA",
        "popularity": 0.3998,
        "profile_path": "/fBokJvil9CnupCjfrBylnWmYyjB.jpg"
    }
}