{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2gQ3FpzPBPX0tnS6QSQyrHwD8aF.jpg",
                "genre_ids": [
                    18,
                    10402,
                    36,
                    35
                ],
                "id": 327331,
                "original_language": "en",
                "original_title": "The Dirt",
                "overview": "The story of Mötley Crüe and their rise from the Sunset Strip club scene of the early 1980s to superstardom.",
                "popularity": 3.7424,
                "poster_path": "/xGY5rr8441ib0lT9mtHZn7e8Aay.jpg",
                "release_date": "2019-03-22",
                "title": "The Dirt",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 1268,
                "character": "Self (archive footage) (uncredited)",
                "credit_id": "643357ac4b6d9d00785e6340",
                "order": 94
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Van Halen ",
            "Halen",
            "Edward Lodewijk Van Halen",
            "Edward Van Halen",
            "Ed Van Halen"
        ],
        "biography": "Eddie Van Halen (26 January 1955 - 6 October 2020) was a Dutch-American musician, songwriter, producer, and inventor. Moving with his family (headed by musician Jan Van Halen) to Pasadena, California as a boy, Eddie and brother Alex were both trained on classical piano. Eddie got a paper route to pay for a drum set, but Alex spent far more time playing it while Eddie was at work, so Eddie \"stole\" Alex's guitar to get back at him, and they continued to play those instruments for the rest of their careers. The Van Halen brothers started a band called Mammoth, eventually recruiting frontman David Lee Roth and bassist Michael Anthony, and renamed the band Van Halen at Roth's insistence. Van Halen's debut album is one of the most influential and best-selling rock debut albums in history, and Eddie's innovative guitar playing had a massive influence on rock musicians worldwide, with Eddie being hailed as a guitar god and routinely being featured on and in guitar magazines.  After a decade with Roth as frontman, he was fired and was successfully replaced by Sammy Hagar, bringing another decade of success for the band before Hagar's departure. A third lineup featuring Gary Cherone was not successful, and Van Halen reunited with both Hagar and Roth for brief periods, replacing Anthony with Eddie's son Wolfgang on bass.\n\nEddie developed tongue cancer in the 2000s, had surgery and was in remission for a number of years, but it eventually returned, and he passed away in 2020, with an outpouring of support and appreciation from musicians the world over.",
        "birthday": "1955-01-26",
        "deathday": "2020-10-06",
        "gender": 2,
        "homepage": "http://www.van-halen.com/",
        "id": 116884,
        "imdb_id": "nm0887007",
        "known_for_department": "Acting",
        "name": "Eddie Van Halen",
        "place_of_birth": "Amsterdam, Netherlands",
        "popularity": 0.126,
        "profile_path": "/zq3LPGIS9ivL5x6dc63E9veEwZB.jpg"
    }
}