{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6MKr3KgOLmzOP6MSuZERO41Lpkt.jpg",
                "genre_ids": [
                    35,
                    80,
                    12
                ],
                "id": 337404,
                "original_language": "en",
                "original_title": "Cruella",
                "overview": "In 1970s London amidst the punk rock revolution, a young grifter named Estella is determined to make a name for herself with her designs. She befriends a pair of young thieves who appreciate her appetite for mischief, and together they are able to build a life for themselves on the London streets. One day, Estella’s flair for fashion catches the eye of the Baroness von Hellman, a fashion legend who is devastatingly chic and terrifyingly haute. But their relationship sets in motion a course of events and revelations that will cause Estella to embrace her wicked side and become the raucous, fashionable and revenge-bent Cruella.",
                "popularity": 11.2552,
                "poster_path": "/hjS9mH8KvRiGHgjk6VUZH7OT0Ng.jpg",
                "release_date": "2021-05-26",
                "title": "Cruella",
                "video": false,
                "vote_average": 7.987,
                "vote_count": 9719,
                "character": "Liberty Woman",
                "credit_id": "628cd0bfd48cee2cbe638103",
                "order": 28
            },
            {
                "adult": false,
                "backdrop_path": "/fzZmcKQv7ZTGIiPvocPhNs3wUyK.jpg",
                "genre_ids": [
                    18,
                    10749,
                    14
                ],
                "id": 122906,
                "original_language": "en",
                "original_title": "About Time",
                "overview": "The night after another unsatisfactory New Year's party, Tim's father tells his son that the men in his family have always had the ability to travel through time. They can't change history, but they can change what happens and has happened in their own lives. Thus begins the start of a lesson in learning to appreciate life itself as it is, as it comes, and most importantly, the people living alongside us.",
                "popularity": 7.7462,
                "poster_path": "/iR1bVfURbN7r1C46WHFbwCkVve.jpg",
                "release_date": "2013-09-04",
                "title": "About Time",
                "video": false,
                "vote_average": 7.913,
                "vote_count": 8873,
                "character": "Japanese Girl (uncredited)",
                "credit_id": "578e978cc3a3681748006d61",
                "order": 49
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "安部 春香",
            "Abe Haruka",
            "安部春香"
        ],
        "biography": "Haruka Abe is an Anglo-Japanese actress based in London, United Kingdom.\n\nBorn in Tokyo, Haruka spent her childhood split between New York, London and Tokyo, moving between the three cities with her family. Aged 8 she decided to try acting and at age 9 she played Bilbo Baggins in her school play adaptation of The Hobbit, an experience that confirmed to her that acting was the path she wanted to follow.\n\nHer family moved back to Tokyo when she was 11 years old, and while in middle and high school, she enrolled in a children's drama school called Gekidan Himawari in Ebisu, Shibuya, Tokyo.\n\nShe was later accepted into Aoyama University, however at aged 18 she decided instead to return to London to pursue her acting career, attending Rose Brudord drama school where she would graduate with a 1st class Bachelor of Arts degree.",
        "birthday": "1988-01-08",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.haruka4be.com/",
        "id": 1168128,
        "imdb_id": "nm2835835",
        "known_for_department": "Acting",
        "name": "Haruka Abe",
        "place_of_birth": "Nerima, Tokyo, Japan",
        "popularity": 0.2643,
        "profile_path": "/9PAgEXZqh2mstkDk79ykMsPbsJN.jpg"
    }
}