{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7AvbU0ei7Fz21jqBL4tlgSufnMp.jpg",
                "genre_ids": [
                    53,
                    80,
                    18
                ],
                "id": 2721,
                "original_language": "fr",
                "original_title": "Z",
                "overview": "Amid a tense political climate, the opposition leader is killed in an apparent accident. When a prosecutor smells a cover-up, witnesses get targeted. A thinly veiled dramatization of the assassination of Greek politician Grigoris Lambrakis and its aftermath, “Z” captures the outrage at the US-backed junta that ruled Greece at the time of its release.",
                "popularity": 3.1277,
                "poster_path": "/dFAJyFNgvOv24f2RQyI9KDxjGr3.jpg",
                "release_date": "1969-02-26",
                "title": "Z",
                "video": false,
                "vote_average": 7.795,
                "vote_count": 580,
                "character": "Pierre, a lawyer",
                "credit_id": "5656595f925141018f005fc0",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Jean-Pierre Miquel (22 January 1937 – 22 February 2003) was a French actor and theatre director, as well as an administrator of the Comédie française.\n\nArtistic director at the Théâtre de l'Odéon from 1971 to 1977, he becomes managing director of the Conservatoire national supérieur d'art dramatique from 1982 to 1993 and administrator of the Comédie française. from 1993 to 2001.\n\nIn 1985, as director of the Conservatoire national supérieur d'art dramatique de Paris, he organised a great exhibition of paintings by Dolores Puthod devoted to the Commedia dell'Arte and wrote articles published in the \"Catalogo generale delle Opere di Dolores Puthod\".\n\nSource: Article \"Jean-Pierre Miquel\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1937-01-22",
        "deathday": "2003-02-22",
        "gender": 2,
        "homepage": null,
        "id": 1168415,
        "imdb_id": "nm0591891",
        "known_for_department": "Acting",
        "name": "Jean-Pierre Miquel",
        "place_of_birth": "Neuilly-sur-Seine, Hauts-de-Seine, France",
        "popularity": 0.0398,
        "profile_path": "/7H4Dg8hBWqGOidBozLxcdgXKnfK.jpg"
    }
}