{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sctvs9cUwJD15qlTlrsh2BXsK75.jpg",
                "genre_ids": [
                    28,
                    80,
                    18
                ],
                "id": 111,
                "original_language": "en",
                "original_title": "Scarface",
                "overview": "After getting a green card in exchange for assassinating a Cuban government official, Tony Montana stakes a claim on the drug trade in Miami. Viciously murdering anyone who stands in his way, Tony eventually becomes the biggest drug lord in the state, controlling nearly all the cocaine that comes through Miami. But increased pressure from the police, wars with Colombian drug cartels and his own drug-fueled paranoia serve to fuel the flames of his eventual downfall.",
                "popularity": 14.4392,
                "poster_path": "/iQ5ztdjvteGeboxtmRdXEChJOHh.jpg",
                "release_date": "1983-12-09",
                "title": "Scarface",
                "video": false,
                "vote_average": 8.16,
                "vote_count": 12451,
                "character": "Angel",
                "credit_id": "52fe4219c3a36847f8003e73",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/llVPUs3j9RywSMstGRepSeS8vSL.jpg",
                "genre_ids": [
                    35
                ],
                "id": 6471,
                "original_language": "en",
                "original_title": "The Jerk",
                "overview": "After discovering he's not really black like the rest of his family, likable dimwit Navin Johnson sets off on a hilarious misadventure that takes him from rags to riches and back again. The slaphappy jerk strikes it rich, but life in the fast lane isn't all it's cracked up to be and, in the end, all that really matters to Johnson is his true love.",
                "popularity": 1.9246,
                "poster_path": "/mIjOWtUofyt9Jawge7FbvITjU3D.jpg",
                "release_date": "1979-12-14",
                "title": "The Jerk",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 849,
                "character": "Punk #1",
                "credit_id": "52fe4454c3a36847f808f7ff",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/yYEOYzgqPB31mkSsuPdCvXH3zHv.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 626332,
                "original_language": "en",
                "original_title": "Flamin' Hot",
                "overview": "The inspiring true story of Richard Montañez, the Frito Lay janitor who channeled his Mexican American heritage and upbringing to turn the iconic Flamin' Hot Cheetos into a snack that disrupted the food industry and became a global pop culture phenomenon.",
                "popularity": 4.6114,
                "poster_path": "/a7KyFMPXj0iY4EoLq1PIGU1WJPw.jpg",
                "release_date": "2023-03-11",
                "title": "Flamin' Hot",
                "video": false,
                "vote_average": 7.964,
                "vote_count": 761,
                "character": "Abuelito",
                "credit_id": "63bf68368efe73009488887b",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Durable Mexican-American actor Pepe Serna has appeared in more than 100 feature films and 300 television shows, but is most recognized for his gritty support performances in a variety of motion pictures, including Scarface (1983) as Al Pacino's ill-fated cocaine partner, as well as the western Silverado (1985) with Kevin Costner, the crime yarn The Rookie (1990) starring Clint Eastwood and Charlie Sheen, and the drama American Me (1992) starring Edward James Olmos. In a career surpassing five decades, Pepe's characters have played on both sides of the law -- from drug peddlers to sheriffs.\n\nHe was born (and raised) in Corpus Christi, Texas on July 23, 1944, the son of a naval base interpreter for Latin American pilots and a hairdresser. His desires to become an actor happened early in life, moving to Hollywood in 1969 to finally pursue his dreams. He didn't have to wait long to find steady Latino work on film and TV.\n\nMaking an inauspicious debut in the exploitation film The Student Nurses (1970), Pepe found more \"A\" quality work after being discovered by producer Hal B. Wallis for the coming-of-age film Tim Belcher starring Richard Thomas and Catherine Burns and the western Shoot Out (1971) starring Gregory Peck. Specializing in urban, streetwise roles, he went on to mix a number of popular films (The New Centurions (1972), The Day of the Locust (1975), Car Wash (1976), A Force of One (1979), Walk Proud (1979), Honeysuckle Rose (1980), Inside Moves (1980), Deal of the Century (1983), Red Dawn (1984), Caddyshack II (1988)) with a slew of popular TV crime dramas such as \"Mannix,\" \"Police Story,\" \"Adam-12,\" \"The Rookies,\" \"The Rockford Files,\" \"Baretta,\" \"Kojak,\" \"CHiPs,\" \"Barney Miller,\" \"Scarecrow & Mrs. King,\" \"T.J. Hooker,\" \"Simon & Simon,\" \"Hill Street Blues,\" \"Miami Vice,\" \"Cagney & Lacey\" and \"Diagnosis Murder.\"\n\nLong married to wife Diane, Pepe is a noted keynote teacher and motivational speaker who tours colleges and universities. His strong sideline as a painter has been met with critical success, having been commissioned quite frequently. His vibrant paintings and one-man stage shows reflect a serious return to his Mexican roots and was the subject of the 2015 short documentary \"Life Is Art.\"",
        "birthday": "1944-07-23",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1169,
        "imdb_id": "nm0785277",
        "known_for_department": "Acting",
        "name": "Pepe Serna",
        "place_of_birth": "Corpus Christi, Texas, USA",
        "popularity": 0.2346,
        "profile_path": "/6fEdr5dpXYjpudCtmvhpZXl9q2F.jpg"
    }
}