{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kzXUQnrUnHUGHuwWbgf9KpoU3qr.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 544401,
                "original_language": "en",
                "original_title": "Cherry",
                "overview": "Cherry drifts from college dropout to army medic in Iraq - anchored only by his true love, Emily. But after returning from the war with PTSD, his life spirals into drugs and crime as he struggles to find his place in the world.",
                "popularity": 2.9009,
                "poster_path": "/pwDvkDyaHEU9V7cApQhbcSJMG1w.jpg",
                "release_date": "2021-02-26",
                "title": "Cherry",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1323,
                "character": "Passerby (uncredited)",
                "credit_id": "5fee37c92dda89003ff08bf8",
                "order": 102
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "B.Rice",
            "Brandon Rice"
        ],
        "biography": "While some MC's may believe modeling themselves after popular artists is the way to success, B. RICE wants nothing to do with the status Quo. In a hip-hop climate where most MC's tend to be clones stuffing countless songs down the throats of its fans, B. RICE looks to capture the listener's emotions. Street credibility, undeniable freestyle skills and lyrical ingenuity make verbal combat his the only option. \"I treat the track like wild game - I size him up then destroy him with total disregard.\" \"You can't just say you are better than the next rapper. You have to prove it\", says B. RICE with his signature chuckle. B. RICE (aka Brandon Rice) was born on April 20, 1985 in Cleveland, Ohio. He was raised in a single family household with his two younger sisters where his love for rhyming began at the early age of 8. He soon began Freestyling and performing at local talent shows and by middle school was the talk of the hallways where he would battle anyone who dared challenge. By high school, B. RICE became hugely popular among his peers and was encouraged to take his talents a step further and start recording. He recorded his first demo which showcased a variety of subject matter and caught the attention of an entertainment promoter in Atlanta, GA. B. Rice signed with Gomac Incorporated Entertainment Arts Division in Atlanta, GA in 2004, which gave him his first taste of the industry. Working with platinum producers and opening for top acts from Lil Scrappy to Young Jeezy allowed B. Rice to showcase his skills and pursue his dream of Superstardom. His journey from underground into mainstream was taking its course, but after facing various legal charges and setbacks B. RICE began to place music as a side hustle. Determined to not let his dream fade, B. RICE continued to hone his talents and compile lots of new material. He joined the group C.C.A. (Capital City Assassins) and began doing local shows in Columbus, Ohio gaining the respect of fellow rappers and fans alike. His notoriety and hardcore style began to morph into an edgy blend of street smarts and extravagance. A new B. RICE had emerged style chiseled & unquestionably greater. He is currently releasing volumes of Mixtapes and working on his full-scale release. \"Im 2 Street Part 2\" is Coming Soon. Check out the latest \"Phone Ringin\" B.Rice featuring BlackChild (from Murder Inc Records). B.Rice also was in the film \"Surviving Compton: Dre, Suge, & Michel'le\" from Sony Pictures Television, Thinkfactory Media, & Lifetime Network starring Michel'le, Rhyon Nicole Brown, Curtis Hamilton, Jamie Kennedy & Kedrick Brown. Followed by the film \"Acts of Violence\" from Colecar Productions, Lionsgate Premiere, and Tri-fold Pictures starring Bruce Willis, Cole Hauser, Shawn Ashmore, Ashton Holmes, Melissa Bolona, Rotimi & Mike Epps. In addition \"Holy Hustle\" from Awalkonthewater Entertainment, Leomark Studios, and First Family Entertainment. Also be on the lookout for the film \"Cherry\" directed by Anthony & Joe Russo from Hideaway Entertainment, AGBO, & Kasbah Films, and \"A State of Mind\" from Skip Thomas Productions and Second Mark Media. Currently \"Grace and Mercy\" from Skip Thomas Productions, \"Workout Partners\" from Berry Berry Good Productions ,\"White Noise\" from Passage Pictures & Netflix starring Adam Driver, Don Cheadle, Andre 3000, and Jodie Turner-Smith.",
        "birthday": "1985-04-20",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1169294,
        "imdb_id": "nm8372419",
        "known_for_department": "Acting",
        "name": "Brandon (B.Rice) Rice",
        "place_of_birth": "Cleveland, Ohio, USA",
        "popularity": 0.0,
        "profile_path": "/kboU6dG23mM9PCN3V3Mlzqa3pST.jpg"
    }
}