{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tRKTlMoTsAhYpuq19V8Wk3RFY4O.jpg",
                "genre_ids": [
                    18
                ],
                "id": 11005,
                "original_language": "en",
                "original_title": "Awakenings",
                "overview": "Dr. Malcolm Sayer, a shy research physician, uses an experimental drug to \"awaken\" the catatonic victims of a rare disease. Leonard is the first patient to receive the controversial treatment. His awakening, filled with awe and enthusiasm, proves a rebirth for Sayer too, as the exuberant patient reveals life's simple but unutterably sweet pleasures to the introverted doctor.",
                "popularity": 6.4556,
                "poster_path": "/9gztZXuHLG6AJ0fgqGd7Q43cWRI.jpg",
                "release_date": "1990-12-04",
                "title": "Awakenings",
                "video": false,
                "vote_average": 7.775,
                "vote_count": 2687,
                "character": "Club Singer",
                "credit_id": "5cbc70b192514108d8fd9c75",
                "order": 50
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Libby Titus is a singer, songwriter, actor, and concert producer. Titus's studies at Bard College in upstate New York were cut short by pregnancy and marriage at the age of nineteen. This did not, however, prevent her pursuing her musical ambitions. In 1968, she released Libby Titus, an album of folk-rock and pop covers, on Hot Biscuit. She continued to perform as a singer, and provided backing vocals for Martin Mull's debut album Martin Mull (1972) among others. At the same time she was developing her songwriting skills. Her second album, also confusingly called Libby Titus, was produced by Phil Ramone and released by Columbia in 1977. In the late 1970s, Titus collaborated with Burt Bacharach. They wrote at least five songs together, two of them (\"Riverboat\" &amp; \"I Live in the Woods\") appearing on Bacharach's album Woman, and one (\"In Tune\") on his soundtrack for the film Together (Amo non amo), both released in 1979. Titus also sang \"Riverboat\" and \"In Tune\" on these recordings. Carly Simon's 1979 album Spy included \"Love You By Heart\", a song she wrote with Titus and Jacob Brackman. Titus later wrote \"The Sailor and the Mermaid\" with Brackman and sang it with Dr. John on the Sesame Street album In Harmony (1980). Titus and Dr. John wrote the music for Robert Frank's short film Energy and How to Get It (1981), and performed some of it on screen. As an actor, Titus had small parts in Mike Nichols's Heartburn (1986) and Penny Marshall's Awakenings (1990), in which she appeared as a club singer. Titus still performed occasionally at venues around New York in the mid-1980s. In the second half of the 1980s, Titus began producing \"rock-and-roll musicales featuring well-known musicians ... in New York restaurants and clubs\". She later recalled that her \"horrid little evenings\" started \"at this little Italian restaurant on Thirty-ninth Street that had room for thirty people. One night it would be, say, Dr. John plus Carly Simon, and it was by invitation only.\" These sessions led to the \"informal concert\" at the Lone Star Roadhouse on 20 September 1989 featuring Dr. John, Donald Fagen, Phoebe Snow, Jevetta Steele, and Bonnie Raitt that gave birth to the New York Rock and Soul Revue, which Titus produced with Fagen until the beginning of 1992. The Rock and Soul Revue also brought Walter Becker to New York, and so played a part in the 1993 reformation of Steely Dan, which Fagen and Becker had disbanded in 1981. Titus went on to write songs with Fagen, including \"Florida Room\" on Kamakiriad (1993). In 1996, Pony Canyon Records anthologised three previously unissued songs that Titus recorded for Bearsville in 1971, two by Eric Kaz and one by Kaz and Titus. \n\nTitus's mother, Julia Irene Jurist née Mooney, was an Earl Carroll dancer. In 1966, Titus married novelist Barry Titus, grandson of Helena Rubinstein; they separated in 1968. The couple had a son, the writer Ezra Titus. From 1969 and through much of the 1970s, Titus's partner was musician Levon Helm. They had a daughter, the singer Amy Helm. For some years after Titus split with Helm, her partner was musician Dr. John Mac Rebennack. In 1987, Titus met musician Donald Fagen, who was a contemporary at Bard College, and who still remembered his one sighting of her \"from a distance\" on campus two decades earlier. They married in 1993.",
        "birthday": "1946-07-06",
        "deathday": null,
        "gender": 0,
        "homepage": null,
        "id": 1169124,
        "imdb_id": "nm0864558",
        "known_for_department": "Acting",
        "name": "Libby Titus",
        "place_of_birth": "Woodstock , New York",
        "popularity": 0.3793,
        "profile_path": null
    }
}