{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sctvs9cUwJD15qlTlrsh2BXsK75.jpg",
                "genre_ids": [
                    28,
                    80,
                    18
                ],
                "id": 111,
                "original_language": "en",
                "original_title": "Scarface",
                "overview": "After getting a green card in exchange for assassinating a Cuban government official, Tony Montana stakes a claim on the drug trade in Miami. Viciously murdering anyone who stands in his way, Tony eventually becomes the biggest drug lord in the state, controlling nearly all the cocaine that comes through Miami. But increased pressure from the police, wars with Colombian drug cartels and his own drug-fueled paranoia serve to fuel the flames of his eventual downfall.",
                "popularity": 14.4392,
                "poster_path": "/iQ5ztdjvteGeboxtmRdXEChJOHh.jpg",
                "release_date": "1983-12-09",
                "title": "Scarface",
                "video": false,
                "vote_average": 8.16,
                "vote_count": 12451,
                "character": "Nick The Pig",
                "credit_id": "52fe4219c3a36847f8003e77",
                "order": 12
            },
            {
                "adult": false,
                "backdrop_path": "/38yjZWYBI0xxNqoBKiGyA4UZjk.jpg",
                "genre_ids": [
                    80,
                    18,
                    53
                ],
                "id": 6075,
                "original_language": "en",
                "original_title": "Carlito's Way",
                "overview": "Free after years in prison, Carlito Brigante intends to give up his criminal ways, but it's not long before the ex-con is sucked back into the New York City underworld. Reconnecting with his dancer girlfriend, Carlito gets entangled in the shady dealings of his friend Dave Kleinfeld, who also serves as his lawyer. An encounter with shifty gangster Benny Blanco sets the duo on a dangerous path.",
                "popularity": 6.055,
                "poster_path": "/g6D7mjQtndu768cusGmoEQY9fTB.jpg",
                "release_date": "1993-11-10",
                "title": "Carlito's Way",
                "video": false,
                "vote_average": 7.83,
                "vote_count": 3307,
                "character": "Party Guest",
                "credit_id": "55df472dc3a368347600021d",
                "order": 80
            },
            {
                "adult": false,
                "backdrop_path": "/w2rWEjAMYErpNfoK2Z0GFh1LFhN.jpg",
                "genre_ids": [
                    80,
                    18,
                    53
                ],
                "id": 819,
                "original_language": "en",
                "original_title": "Sleepers",
                "overview": "Two gangsters seek revenge on the state jail worker who during their stay at a youth prison sexually abused them. A sensational court hearing takes place to charge him for the crimes.",
                "popularity": 4.044,
                "poster_path": "/yUpiEk2EojS9ZEXb3nIQonQCYYF.jpg",
                "release_date": "1996-10-18",
                "title": "Sleepers",
                "video": false,
                "vote_average": 7.602,
                "vote_count": 3677,
                "character": "Judge #1",
                "credit_id": "5a396e7e92514154750790db",
                "order": 36
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Michael Moran"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nMichael Peter Moran (February 8, 1944 - February 4, 2004) was an American actor and playwright.\n\nMoran was born in Yuba City, California, but his family moved frequently because his father was a US Army officer. He gained some of his first experience under Gilbert Rathbun in the theater program at Seton Hall University in South Orange, N.J. - though he was not a student there - and at the Theater on the Mall in Paramus. He moved to New York City in 1966 and was educated at New York University's Tisch School of the Arts. He became a member of the theatre groups the Manhattan Project and the Cooper-Keaton Group. Both groups produced plays written by Moran, including Call Me Charlie, starring Danny DeVito. He also appeared in several productions for the New York Shakespeare Festival.\n\nMoran died at the age of 59, in a New York hospital, from Guillain-Barre Syndrome. He was four days short of his 60th birthday.\n\nDescription above from the Wikipedia article Michael P. Moran, licensed under CC-BY-SA, full list of contributors on Wikipedia.​",
        "birthday": "1944-02-08",
        "deathday": "2004-02-04",
        "gender": 2,
        "homepage": null,
        "id": 1170,
        "imdb_id": "nm0602930",
        "known_for_department": "Acting",
        "name": "Michael P. Moran",
        "place_of_birth": "Yuba City, California",
        "popularity": 0.0734,
        "profile_path": "/dqQgY3uyzf1ot16iQZwcAWQnnkg.jpg"
    }
}