{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8Qsr8pvDL3s1jNZQ4HK1d1Xlvnh.jpg",
                "genre_ids": [
                    14,
                    12
                ],
                "id": 259316,
                "original_language": "en",
                "original_title": "Fantastic Beasts and Where to Find Them",
                "overview": "In 1926, Newt Scamander arrives at the Magical Congress of the United States of America with a magically expanded briefcase, which houses a number of dangerous creatures and their habitats. When the creatures escape from the briefcase, it sends the American wizarding authorities after Newt, and threatens to strain even further the state of magical and non-magical relations.",
                "popularity": 11.2281,
                "poster_path": "/h6NYfVUyM6CDURtZSnBpz647Ldd.jpg",
                "release_date": "2016-11-16",
                "title": "Fantastic Beasts and Where to Find Them",
                "video": false,
                "vote_average": 7.311,
                "vote_count": 19241,
                "character": "Exterminator (uncredited)",
                "credit_id": "566cd0b39251412dbc004ba8",
                "order": 83
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Christine Marzano is an American-Irish model as well as an actress.  She graduated with a bachelor’s degree in psychology and neuroscience. Then, she attended Princeton University in Princeton, New Jersey. Later on, she joined the British American Drama Academy in London.\n\nMarzano started her career as a model in the year 2004. She modeled for runway and print models in countries like United States, France, Italy, and Germany. She walked the International runways for Christian Dior, YSL, Gucci, Fendi, Balmain, John Galliano, Thierry Mugler, Giorgio Armani, MaxMara, Peter Som, Dries Van Noten, and many more.\n\nWhile modeling, Marzano began serious acting training, and appeared in numerous television commercials. After graduating from Princeton, she decided to pursue acting full-time.\n\nIn the year 2012, she started acting and did movies like Seven Psychopaths for which she won the 2012 Boston Society of Film Critics Awards. Other movies which she did are Working It Out, Byzantium, Paranoia. Similarly, other motion movies in which she acted in Dare to Be Wild(2015), Rules Don’t Apply(2016), Fantastic Beasts, and Where to Find Them(2016).\n\nHowever, in 2017, she starred in some popular movies such as Host, A Midsummer Night’s Dream, and in the year 2018, she has done the movie Death Race: Beyond Anarchy.\n\nShe lives in Los Angeles, California.",
        "birthday": "1986-09-13",
        "deathday": null,
        "gender": 1,
        "homepage": "https://thechalkboardmag.com/bods-christine-marzano",
        "id": 1170656,
        "imdb_id": "nm3199692",
        "known_for_department": "Acting",
        "name": "Christine Marzano",
        "place_of_birth": "Brooklyn, New York, USA",
        "popularity": 1.7588,
        "profile_path": "/Dy4DiAFon0maQB9yrvHN71IPgk.jpg"
    }
}