{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/iEZ869MTsn6IvoK7wbKrlnlqxuc.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 452187,
                "original_language": "fr",
                "original_title": "Le Brio",
                "overview": "After an incident, a brilliant professor known for his outbursts is forced to mentor the student he wronged for a speech contest.",
                "popularity": 5.0765,
                "poster_path": "/l43VMuUg1DoItf9nMcMSj2ZSbn3.jpg",
                "release_date": "2017-11-22",
                "title": "Le Brio",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 900,
                "character": "Neila Salah",
                "credit_id": "58f150aa9251415567004fd2",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Camélia Jordana Riad-Aliouane",
            "카멜리아 조다나"
        ],
        "biography": "Camélia Jordana Riad-Aliouane (born 15 September 1992) is a French pop singer and actress. She rose to fame after participating in the television show Nouvelle Star, the French version of Pop Idol, in 2009, where she came in third.\n\nJordana was born on 15 September 1992 in Toulon, to French parents of Algerian descent. Her father Hachemi is of Berber Kabyle origin and her mother Zélihka is from Oran. She grew up in La Londe-les-Maures with her older sister and younger brother.\n\nAt the age of sixteen, she decided to audition for the seventh season of Nouvelle Star in Marseille, and managed to convince the jury with her version of Louis Armstrong's What a wonderful world. She finished in third place. After her elimination, she signed a record deal with Sony Music and released her eponymous debut album on 29 March 2010. It sold 10,169 copies in its first week and managed to enter the French SNEP Album Chart at #9.\n\nAlthough Jordana's debut single Non Non Non (Écouter Barbara) was only released as download single in France, it peaked at #3 on the French digital chart. It also charted at #3 in Belgium and #48 in Switzerland.\n\nShe participated in a song for the album So in Love by Nouvelle Star judge André Manoukian in April 2010.\n\nJordana was interviewed and played several songs on the TV5Monde programme 'Acoustic' on 7 November 2010.\n\nShe was on the jury of the Semaine de la Critique section at the 2021 Cannes Film Festival.\n\nOn 27 November 2015, Jordana participated together with Nolwenn Leroy and Yael Naim at the national memorial day for the victims of the November 2015 Paris attacks singing the song “Quand on n'a que l'amour” by Jacques Brel.\n\nSource: Article \"Camélia Jordana\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1992-09-15",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1171510,
        "imdb_id": "nm3874127",
        "known_for_department": "Acting",
        "name": "Camélia Jordana",
        "place_of_birth": "Toulon, Var, France",
        "popularity": 0.2737,
        "profile_path": "/1wfjbRaZpiI664cpNaZjgGuduxX.jpg"
    }
}