{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/g3yflwqajsVEYdUr7B84fMHBkAw.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 329805,
                "original_language": "fr",
                "original_title": "Mon roi",
                "overview": "Tony is admitted to a rehabilitation center after a serious ski accident. Dependent on the medical staff and pain relievers, she takes time to look back on a turbulent relationship that she experienced with Georgio.",
                "popularity": 2.3585,
                "poster_path": "/kOhRkC7J3jpAgHGC0Uh3SoCqU4c.jpg",
                "release_date": "2015-10-21",
                "title": "My King",
                "video": false,
                "vote_average": 7.142,
                "vote_count": 793,
                "character": "Pascal",
                "credit_id": "559e5fe79251412da9001423",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Paul Hamy (born 7 January 1982) is a French actor and model. He started his career early as a model, working for Elite Model Management before turning to cinema in 2013.\n\nHe was spotted at the age of sixteen by fashion photographer Paolo Roversi. He worked with big names like Hedi Slimane for Yves Saint Laurent, Jean-Paul Gaultier, Comme des Garçons, Christian Lacroix, poses for Vogue and travelled all over the world.\n\nHe also studied drawing and sculpture and founded “POK - Pain O choKolat”, a collective of visual artists, photographers, designers, videographers, actors, dancers, DJs and musicians. In 2010, he unveiled a series of sculptures under the title Chapeau, Chimère & Forme.\n\nHe made his on-screen debut with two movies in 2013: On My Way directed by Emmanuelle Bercot and Suzanne directed by Katell Quillévéré, for which he was nominated for the César Award for Most Promising Actor and the Lumière Award for Best Male Revelation.\n\nHis father is american and his mother french. In September 2020, he married Denitza Stefanova.\n\nSource: Article \"Paul Hamy\" from Wikipedia in English, licensed under CC-BY-SA.",
        "birthday": "1982-01-07",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1171437,
        "imdb_id": "nm5524273",
        "known_for_department": "Acting",
        "name": "Paul Hamy",
        "place_of_birth": "France",
        "popularity": 3.0094,
        "profile_path": "/xfsvDCVvSFXp5EbOaQzJ26mcXGC.jpg"
    }
}