{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lA6KdSkCTxwzvqzPqxch997RabQ.jpg",
                "genre_ids": [
                    28,
                    53
                ],
                "id": 560016,
                "original_language": "en",
                "original_title": "Monkey Man",
                "overview": "Kid is an anonymous young man who ekes out a meager living in an underground fight club where, night after night, wearing a gorilla mask, he is beaten bloody by more popular fighters for cash. After years of suppressed rage, Kid discovers a way to infiltrate the enclave of the city’s sinister elite. As his childhood trauma boils over, his mysteriously scarred hands unleash an explosive campaign of retribution to settle the score with the men who took everything from him.",
                "popularity": 5.6625,
                "poster_path": "/4lhR4L2vzzjl68P1zJyCH755Oz4.jpg",
                "release_date": "2024-04-03",
                "title": "Monkey Man",
                "video": false,
                "vote_average": 6.898,
                "vote_count": 1211,
                "character": "Tabla Maestro",
                "credit_id": "6611bff8356a71017d244f87",
                "order": 10
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/9Qs9oyn4iE8QtQjGZ0Hp2WyYNXT.jpg",
                "genre_ids": [
                    18,
                    10752
                ],
                "id": 28,
                "original_language": "en",
                "original_title": "Apocalypse Now",
                "overview": "At the height of the Vietnam war, Captain Benjamin Willard is sent on a dangerous mission that, officially, \"does not exist, nor will it ever exist.\" His goal is to locate - and eliminate - a mysterious Green Beret Colonel named Walter Kurtz, who has been leading his personal army on illegal guerrilla missions into enemy territory.",
                "popularity": 7.8079,
                "poster_path": "/gQB8Y5RCMkv2zwzFHbUJX3kAhvA.jpg",
                "release_date": "1979-05-19",
                "title": "Apocalypse Now",
                "video": false,
                "vote_average": 8.272,
                "vote_count": 8654,
                "credit_id": "593d73ecc3a3680f42020ea5",
                "department": "Sound",
                "job": "Musician"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Zakir Hussain Qureshi (9 March 1951 – 15 December 2024) was an Indian tabla player, composer, arranger, percussionist, music producer and film actor. The eldest son of esteemed tabla player Alla Rakha, Zakir Hussain was widely regarded as the greatest tabla player of his generation and one of its finest percussionists. He produced music across multiple genres and contributed to popularizing Indian classical music to a global audience.\n\nOften prefixed by the honorific title of 'Ustad', Hussain was awarded the United States National Endowment for the Arts' National Heritage Fellowship, the highest award given to traditional artists and musicians. He was also given the Government of India's Sangeet Natak Akademi Award in 1990 and the Sangeet Natak Akademi Fellowship, Ratna Sadsya, in 2018.\n\nHussain received seven Grammy Award nominations, winning four times, including three in 2024. He was described as the most recognizable exponent of the tabla by The Guardian. The New York Times marveled that the \"blur of his fingers rivals the beat of a hummingbird's wings.\"\n\nDescription above from the Wikipedia article Zakir Hussain, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1951-03-09",
        "deathday": "2024-12-15",
        "gender": 2,
        "homepage": "https://zakirhussain.com/",
        "id": 1172042,
        "imdb_id": "nm0403984",
        "known_for_department": "Sound",
        "name": "Zakir Hussain",
        "place_of_birth": "Mumbai, Maharashtra, India",
        "popularity": 2.0671,
        "profile_path": "/1VRN3HlqO2TjnXJFUrcrTGPsZTG.jpg"
    }
}