{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lmMVUuu2hHX6qrpcusiuSGU8HaC.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 9587,
                "original_language": "en",
                "original_title": "Little Women",
                "overview": "With their father away as a chaplain in the Civil War, Jo, Meg, Beth and Amy grow up with their mother in somewhat reduced circumstances. They are a close family who inevitably have their squabbles and tragedies. But the bond holds even when, later, male friends start to become a part of the household.",
                "popularity": 3.734,
                "poster_path": "/1ZzH1XMcKAe5NdrKL5MfcqZHHsZ.jpg",
                "release_date": "1994-12-21",
                "title": "Little Women",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1275,
                "character": "Local Boy (uncredited)",
                "credit_id": "6419b7f50d5d8500838837dc",
                "order": 58
            },
            {
                "adult": false,
                "backdrop_path": "/jRZ3joUcg8YDCQYl4Tog5xhY6wk.jpg",
                "genre_ids": [
                    28,
                    53
                ],
                "id": 36955,
                "original_language": "en",
                "original_title": "True Lies",
                "overview": "A fearless, globe-trotting, terrorist-battling secret agent has his life turned upside down when he discovers his wife might be having an affair with a used car salesman while terrorists smuggle nuclear war heads into the United States.",
                "popularity": 7.1285,
                "poster_path": "/pweFTnzzTfGK68woSVkiTgjLzWm.jpg",
                "release_date": "1994-07-15",
                "title": "True Lies",
                "video": false,
                "vote_average": 7.086,
                "vote_count": 4319,
                "character": "Snow Assassin (uncredited)",
                "credit_id": "63877f5ca410c8007921ed7c",
                "order": 42
            },
            {
                "adult": false,
                "backdrop_path": "/6a6AK1pANcl64BYeDA58HKqgzji.jpg",
                "genre_ids": [
                    80,
                    18,
                    53
                ],
                "id": 9366,
                "original_language": "en",
                "original_title": "Donnie Brasco",
                "overview": "An FBI undercover agent infiltrates the mob and identifies more with the mafia life at the expense of his regular one.",
                "popularity": 3.9691,
                "poster_path": "/xtKLvpOfARi1XVm8u2FTdhY5Piq.jpg",
                "release_date": "1997-02-27",
                "title": "Donnie Brasco",
                "video": false,
                "vote_average": 7.536,
                "vote_count": 4638,
                "character": "Strip Club Patron (uncredited)",
                "credit_id": "5cfbbc2ec3a3684e081f1baa",
                "order": 62
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "RAGE"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nDale Anthony Resteghini (born Boston, Massachusetts on 28 August 1968) better known as Rage is a renowned music video director. He is also a film director and music producer. Rage has helmed hundreds of videos for well-known acts from the global superstars to the emerging acts to the niche branded and as alover of music he embraces all of them and sees each venture as a challenge and an experience. A visually prolific and explosively versatile director, his work ranges from hardcore, heavy metal, rock, punk to hip hop and rapand gangsta rap. Rage is the founder of Raging Nation with Kim Resteghini, his wife and partner.\n\nSome of the biggest successful music videos Rage has helmed were for International anthems he has directed include \"Grand Theft Autumn/Where Is Your Boy\" by Fall Out Boy, \"Crank That (Soulja Boy)\" by Soulja Boy, \"We Fly High\" by Jim Jones, This Is Why I'm Hot by Mims. More recent stylized videos include Diddy and Dirty Money's video for \"Love Come Down\", The Game and Keyshia Cole's \"Game's Pain\" and Momhombi and Akon's \"Dirty Situation\".\n\nDale Resteghini started as a model, an actor and a dancer in Boston and as young man had been arrested for various infractions with the law.\n\nResteghini is currently represented for music videos and commercials around the world by several international reps.\n\nDescription above from the Wikipedia article Dale Resteghini, licensed under CC-BY-SA, full list of contributors on Wikipedia.​",
        "birthday": "1968-08-28",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 117350,
        "imdb_id": "nm0720411",
        "known_for_department": "Directing",
        "name": "Dale Resteghini",
        "place_of_birth": "Boston, Massachusetts, USA",
        "popularity": 0.1264,
        "profile_path": "/dEaxVnJpQ4sEOBDFCRUMfeAe6AJ.jpg"
    }
}