{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bAdIO0Jt886Ad1eY9bDXXeCpXsV.jpg",
                "genre_ids": [
                    10749,
                    35,
                    18
                ],
                "id": 2028,
                "original_language": "en",
                "original_title": "Say Anything...",
                "overview": "Lloyd, an eternal optimist, seeks to capture the heart of Diane, an unattainable high school beauty and straight-A student. He surprises just about everyone-including himself-when she returns the sentiment. But Diane's over-possessive, divorced Dad disapproves and it's going to take more than just the power of love to conquer all.",
                "popularity": 12.1068,
                "poster_path": "/nkucKciFGSRalw6dJtsglWqOXMC.jpg",
                "release_date": "1989-04-14",
                "title": "Say Anything...",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 1044,
                "character": "Partier",
                "credit_id": "630614bbdcb6a3007bb24d47",
                "order": 35
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Billy Stevenson "
        ],
        "biography": "Bill Stevenson (born February 18, 1969) also credited as Billy, is an American actor.\n\nStevenson contributed music to the comedy film, Girls Just Want to Have Fun (1985). Early on in his acting career, he landed roles in various films, including Like Father, Like Son (1987), Little Nikita (1988), The 'Burbs (1989), and Say Anything (1989). His film career continued throughout the nineties in productions like The Last Seduction (1994) and Outbreak (1995).\n\nHe also worked in television during the 90's, including appearances on The Fresh Prince of Bel-Air, Friends, Melrose Place, Step by Step, Hangin' with Mr. Cooper, NewsRadio, Murphy Brown, Dream On, and Tom (CBS, 1993-94). He shifted from film to television work through the early 2000s and beyond, appearing on series including ER, Prison Break, Desperate Housewives, Southland, Better Off Ted, NCIS, The Middle, Mike & Molly, Hot in Cleveland, Ghosted, Workaholics (Comedy Central), and Fresh Off The Boat, Speechless, Grace and Frankie, and Homecoming.",
        "birthday": "1969-02-18",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1173088,
        "imdb_id": "nm0828883",
        "known_for_department": "Acting",
        "name": "Bill Stevenson",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.4658,
        "profile_path": "/g4uDtDRmJw54pVAfDjYLCWPa3zC.jpg"
    }
}