{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4GPCnwvTbsDleH5QIOyDLMsK8a2.jpg",
                "genre_ids": [
                    28,
                    53,
                    878
                ],
                "id": 59967,
                "original_language": "en",
                "original_title": "Looper",
                "overview": "In the year 2044, time travel has not yet been invented but in 30 years it will have been. When the mob wants to get rid of someone, they will send their target into the past where a looper, a hired gun, like Joe is waiting to mop up. Joe is getting rich and life is good until the day the mob decides to close the loop, sending back Joe's future self for assassination.",
                "popularity": 3.7824,
                "poster_path": "/sNjL6SqErDBE8OUZlrDLkexfsCj.jpg",
                "release_date": "2012-09-26",
                "title": "Looper",
                "video": false,
                "vote_average": 6.895,
                "vote_count": 10489,
                "character": "Farm Vagrant",
                "credit_id": "56e22cfb92514178a4000dfb",
                "order": 25
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Josh \"The Ponceman\" Perry"
        ],
        "biography": "Josh left his home in Louisiana and moved to California to pursue his passion for acting. One of the hurdles Josh has had to jump... over and over again... is the fact that he has Down Syndrome. Regardless of any disability, Josh has never let anything stop his desire to act.\n\nJosh has 23 film credits and has been on Tv and the Big Screen. Josh landed a supporting role in the film American Cowslip, starring alongside Hollywood heavyweights like Val Kilmer, Rip Torn, Peter Falk, Diane Ladd, and the legendary Cloris Leachman.\n\nJosh can be seen in Looper with Joseph Gordon Levitt, Emily Blunt and Bruce Willis, which hit theatre screens in 2012. He worked on the film Coffee Town by writer/director Brad Copeland and producer Ricky Van Veen, also starring Josh Groban and Glenn Howerton.\n\nIn one of his most recent films. The Christ Slayer, he is second billed and had over 80 pages of dialogue.\n\nHis last film which screened in 2020 is Lost Heart. He plays the endearing part of Chip, who is a Bigfoot hunter and brother to the lead Hannah Sweet, Nashville Superstar.\n\nIn October, 2021 he will be shooting in Algona, Iowa in a World War II Movie.\n\nRecently Josh narrated \"Prayers and Wishes\". A story about the ups and downs of a Down Syndrome man falling in love and getting married.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1174106,
        "imdb_id": "nm1694675",
        "known_for_department": "Acting",
        "name": "Josh Perry",
        "place_of_birth": null,
        "popularity": 0.0743,
        "profile_path": "/d6Y8VoJaY2r74zFxmGewB7lyt1G.jpg"
    }
}