{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dwVF2gVQLfdbTLlDf2gteqa93gw.jpg",
                "genre_ids": [
                    10751,
                    18,
                    35
                ],
                "id": 340270,
                "original_language": "en",
                "original_title": "The Healer",
                "overview": "The film follows a man with an unwanted gift for healing who meets a teenager with cancer who helps him to find himself.",
                "popularity": 2.791,
                "poster_path": "/mwBsg7cFE7GwDPKP4Pv26w2Txmp.jpg",
                "release_date": "2017-02-17",
                "title": "The Healer",
                "video": false,
                "vote_average": 7.176,
                "vote_count": 522,
                "character": "Henry",
                "credit_id": "59fda2e4925141470c014b70",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia.\n\nBrian Downey (born 31 October 1944 in Newfoundland, Canada) is a Canadian actor perhaps best-known for his portrayal of Stanley Tweedle, in the science-fiction television series Lexx.\n\nDowney is a character actor who has appeared in various films and guest starring roles on TV, including a recurring role on Millennium. His first film role was in a 1986 Andy Jones film called The Adventure of Faustus Bidgood, which features the entire cast of CODCO. Downey has enjoyed a long professional relationship with Lexx creator Paul Donovan, dating back at least to 1988, when Donovan cast Downey in the time travel adventure film, Norman's Awesome Experience. Downey appeared as Cardinal Juan de Mella in Donovan's upcoming medieval TV thriller, The Conclave. Downey has also worked with Jessica Lange, JoBeth Williams, Sam Rockwell, and directors such as Joe Sargent. He won the 2010 only acting award at the 2010 Atlantic Film Festival for his role in \"Whirligig\", directed by Chaz Thorne, with whom he has worked on 2 previous features. He played the evil gang leader \"The Drake\", who runs the town in the feature film, Hobo with a Shotgun, starring Rutger Hauer and directed by Jason Eisener.\n\nDowney is also a musician and writer. Before being recruited as an actor, he spent many years as a musician, as a bass player, guitarist, and blues harmonica player. He has been a writer for many stage plays, and has led many script writing workshops. His first full length stage play, \"Peter's Other War\", was produced during the summer of 2009.\n\nDescription above from the Wikipedia article Brian Downey, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1944-10-31",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.briandowney.biz/",
        "id": 117458,
        "imdb_id": "nm0235978",
        "known_for_department": "Acting",
        "name": "Brian Downey",
        "place_of_birth": "St. John's, Newfoundland, Canada",
        "popularity": 0.1008,
        "profile_path": "/biVm5z6N3lDavnCCT9xmxQxujpa.jpg"
    }
}