{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/oxcaIxASeu57f6VSn8awiXz6yZS.jpg",
                "genre_ids": [
                    35,
                    10749,
                    14
                ],
                "id": 570131,
                "original_language": "fr",
                "original_title": "Mon Inconnue",
                "overview": "A man tries to make his wife fall in love with him again, after waking up in an alternate reality where she never knew him.",
                "popularity": 3.8181,
                "poster_path": "/11CkMVD0dPjhAZPaf0u9VfS46lw.jpg",
                "release_date": "2019-01-18",
                "title": "Love at Second Sight",
                "video": false,
                "vote_average": 7.053,
                "vote_count": 838,
                "character": "Mélanie",
                "credit_id": "5c1ea0a7c3a3681c34e96b42",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Camille Lellouche (born 1986 in Île-de-France) is a French actress, comedian, and singer.\n\nIn particular, she became known to the general public with her humorous and musical performances on YouTube and with her participation on the French version of The Voice.\n\nCamille Lellouche was born in 1986, in Île-de-France, and grew up in Vitry-sur-Seine, in the suburbs of Paris.\n\nShe began learning piano at the age of 4. She then learns viola. In 1997, when she was 10, she said she wanted to become a singer. Later she performs in piano bars In 2000, and she began taking acting classes. She trained in comedy at Acting International. She tried auditioning from 2005 and got some minor roles. During this time, she worked for ten years in the restaurant business.\n\nIn 2012, Camille Lellouche was spotted by director Rebecca Zlotowski in a Parisian brewery, where she was employed as restaurant manager. She obtained an important role in the feature film Grand Central, alongside Léa Seydoux, Tahar Rahim and Olivier Gourmet. The film is selected at the 2013 Cannes Film Festival.\n\nAt the same time, she used the Internet and social media to make herself known, posting videos and videos on YouTube but also on Facebook and Instagram. This experience allowed her to develop various characters and build a fan base, with more than 600,000 followers. On a shoot, she met Laurent Junca and Dominique Perrin, who detected her sense of the show and advised her to do the scene. Her first stage appearance as a humourist will then take place at the Casino de Paris as the first act with Virginie Hocq.\n\nAt the same time, she was a candidate in season 4 of The Voice show on TF1, where she advanced until the semi-final. She joined The Voice's troupe for the Zenith Tour. It is during the recording of the show that she begins to write her future show.\n\nCamille Lellouche was then engaged in the show Touche pas à mon poste! on C8 in 2016, but she quickly left the show de Cyril Hanouna, officially to focus on her career as an actress. She developed a one-woman-show, called Camille in real life (at first simply called Camille Lellouche), with which she goes on tour throughout France in 2016. She wrote and directed this show with Laurent Junca. She embodies a wide variety of female characters, with loneliness as a guideline, inspired by the many restaurant guests she met. Between the sketches, Camille Lellouche sings and plays the guitar.\n\nShe also continued her career as an actress in the cinema by turning again with Rebecca Zlotowski in Planetarium (2016), alongside Natalie Portman and Lily Rose Depp, then in The Price of Success (2017) by Teddy Lussi-Modeste.\n\nIn June 2017, she was the sponsor of the 2nd edition of Festigital in Hyères. From September 2017, she performs at the Théâtre de la Gaîté-Montparnasse. Also in September 2017, she joined TMC's Quotidien, where she played different characters in a humorous feature called Face Cam.\n\nSource: Article \"Camille Lellouche\" from Wikipedia in english, licensed under CC-BY-SA 3.0.",
        "birthday": "1986-06-10",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1174837,
        "imdb_id": "nm5674012",
        "known_for_department": "Acting",
        "name": "Camille Lellouche",
        "place_of_birth": "Paris, France",
        "popularity": 0.6827,
        "profile_path": "/2sJKETjynRZiSO6ETLR9uIOgEkQ.jpg"
    }
}