{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9AjG0YJLgDUtHl5KgrThHPhNNwZ.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 3083,
                "original_language": "en",
                "original_title": "Mr. Smith Goes to Washington",
                "overview": "After the death of a United States Senator, idealistic Jefferson Smith is appointed as his replacement in Washington. Soon, the naive and earnest new senator has to battle political corruption.",
                "popularity": 2.8661,
                "poster_path": "/nDjg1fbNyq15excNDl3acd2IqAk.jpg",
                "release_date": "1939-10-19",
                "title": "Mr. Smith Goes to Washington",
                "video": false,
                "vote_average": 7.843,
                "vote_count": 1118,
                "character": "Third Radio Speaker (uncredited)",
                "credit_id": "555f23a3c3a36868e9002828",
                "order": 66
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Georgia Cain",
            "Georgia Craine"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nGeorgia Caine (30 October 1876 – 4 April 1964) was an American actress who performed both on Broadway and in more than 80 films in her 51-year career.\n\nBorn in San Francisco, California in 1876, the daughter of two Shakespearean actors, George Caine and the former Jennie Darragh, she travelled with them when they toured the country. Caine left school at the age of 17 to join a Shakespearean repertory company. She made her Broadway debut in 1899 as the star of the musical A Reign of Error. Caine continued to perform continuously on Broadway as a star or featured performer, primarily in musicals, until the mid-1930s, including in George M. Cohan's Little Nellie Kelly, as well as his Mary, and The O'Brien Girls,. She appeared in Franz Lehár's The Merry Widow both on Broadway and in London.\n\nCaine was often written about by theater columnists until the 1930s, when her star had started to fade. She made her last Broadway appearance in 1935, in Damon Runyon and Howard Lindsay's A Slight Case of Murder.\n\nWith her stage career fading, Caine took advantage of the advent of talking pictures to change her focus and moved to California to work in Hollywood. In 1930, Caine made her first film, Good Intentions, and in the next twenty years appeared in 83 films, mostly playing character roles – mothers, aunts, and older neighbors – although she occasionally played against type, such as when she was a streetwalker in Camille (1936). Many of her parts were small and she did not receive screen credit for them.\n\nIn 1940, Caine appeared as Barbara Stanwyck's mother in the film Remember the Night, which was written by Preston Sturges, and she would go on to become part of Sturges' unofficial \"stock company\" of character actresses, appearing in seven other films written by Sturges.\n\nCaine made her final film appearance in 1950, at the age of 73, in Kiss Tomorrow Goodbye.\n\nCaine in the musical Adele (1913)\n\nAccording to Marie Dressler The Unlikeliest Star by Betty Lee, about Caine's friend Marie Dressler, Caine was married to a prominent man from San Francisco by the 1920s, but the book gives no information on what his name was or when or for how long they were married.\n\nGeorgia Caine died in Hollywood, California on 4 April 1964, at the age of 87, and is buried in Valhalla Memorial Park Cemetery in North Hollywood, California.",
        "birthday": "1876-10-30",
        "deathday": "1964-04-04",
        "gender": 1,
        "homepage": null,
        "id": 1176930,
        "imdb_id": "nm0128990",
        "known_for_department": "Acting",
        "name": "Georgia Caine",
        "place_of_birth": "San Francisco, California, USA",
        "popularity": 0.073,
        "profile_path": "/AooGGbP6uyzvIKnC23UmcJrjlAc.jpg"
    }
}