{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8WIufsaJgm7VWgAc5ALWdJ8v2kB.jpg",
                "genre_ids": [
                    14,
                    27,
                    35
                ],
                "id": 766,
                "original_language": "en",
                "original_title": "Army of Darkness",
                "overview": "Ash, a handsome, shotgun-toting, chainsaw-armed department store clerk, is time warped backwards into England's Dark Ages, where he romances a beauty and faces legions of the undead.",
                "popularity": 4.8105,
                "poster_path": "/xsgTuAtR2zSH8Umg3jWZcZjlDpe.jpg",
                "release_date": "1992-10-31",
                "title": "Army of Darkness",
                "video": false,
                "vote_average": 7.255,
                "vote_count": 3335,
                "character": "Arthur",
                "credit_id": "52fe4273c3a36847f801f9cb",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Marcus Gilbert (born 29 July 1958) is a British actor, known for his roles in Jilly Cooper's Riders and Army of Darkness (Evil Dead 3).\n\nSince 1984 he has appeared in films, including A Hazard of Hearts (1987), A Ghost in Monte Carlo (1990), Biggles (1986), Rambo III (1988) and Legacy (1990), and on television and in commercials. He has also worked in the theatre, including playing the young Viscount Goring in Oscar Wilde's An Ideal Husband with the Middle Ground Theatre Company on their national tour in 2000. In 2006, Gilbert starred as Jordan Power in the world premiere of Starry Starry Night, at The Mill at Sonning.\n\nAfter training at the Mountview Theatre School (graduated 1981 - alumni), Gilbert became a founder member of the original Odyssey Theatre Company touring London schools with productions of contemporary classics. This was followed by seasons at the Dundee Repertory Theatre and the Library Theatre, Manchester. He has made over 50 commercials including one for Lee Jeans called Mean Jeans, directed by Willi Patterson,  which won the best cinema commercial award in 1986.\n\nGilbert also runs his own film production company, Touch The Sky Productions, and while making a documentary about his climbing Mount Kilimanjaro in 2004 he visited the Arusha Children's Trust in Tanzania and filmed an appeal for the trust.",
        "birthday": "1958-07-29",
        "deathday": null,
        "gender": 2,
        "homepage": "http://marcusgilbertofficial.com/",
        "id": 11763,
        "imdb_id": "nm0317956",
        "known_for_department": "Acting",
        "name": "Marcus Gilbert",
        "place_of_birth": "Bristol, England, UK",
        "popularity": 0.5088,
        "profile_path": "/h3djDOkNHLwep1fwbGbEhT5c6dz.jpg"
    }
}