{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wz4BoW7k5LNluY4PmxHBU1IS5Bc.jpg",
                "genre_ids": [
                    18
                ],
                "id": 628534,
                "original_language": "en",
                "original_title": "The White Tiger",
                "overview": "An ambitious Indian driver uses his wit and cunning to escape from poverty and rise to the top. An epic journey based on the New York Times bestseller.",
                "popularity": 3.3322,
                "poster_path": "/5JnmseS3DZ6ad2VMbrnbGCs8Rst.jpg",
                "release_date": "2021-01-13",
                "title": "The White Tiger",
                "video": false,
                "vote_average": 6.976,
                "vote_count": 939,
                "character": "Ashok",
                "credit_id": "5d6f8af577c01f00105961c4",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Raj Kumar Yadav",
            "Raj kumar Rao",
            "Rajkumar Rao",
            "Rajkumar Yadav",
            "راجکومار رائو"
        ],
        "biography": "Rajkummar Rao Yadav is an Indian actor who appears in Hindi films. Rao has established a career in Hindi cinema and is the recipient of a National Film Award and a Filmfare Award from three nominations.\n\nAfter graduating, he moved to Mumbai for a film career and made his film debut with the 2010 experimental anthology film Love Sex Aur Dhokha. After starring in brief roles in several of the highly successful Hindi films of the following two years, he achieved success for his breakout role in 2013 with the drama film Kai Po Che!, for which he was nominated for the Best Supporting Actor award at Filmfare. That same year, he was awarded the Filmfare and the National Film Award for Best Actor and Critics Best Actor for his portrayal of Shahid Azmi in the biographical drama Shahid.  In 2014, Rao played the leading man in the successful romantic comedy Queen and the drama CityLights. Rao received critical acclaim for portraying a journalist in the biographical drama Aligarh, which earned him a second nomination for Best Supporting Actor at Filmfare.",
        "birthday": "1984-08-31",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 117727,
        "imdb_id": "nm3822770",
        "known_for_department": "Acting",
        "name": "Rajkummar Rao",
        "place_of_birth": "Gurgaon, Haryana, India",
        "popularity": 0.5506,
        "profile_path": "/ttBY7Y8x4NCpXfGS9Tc1NN8ISos.jpg"
    }
}