{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/nlPCdZlHtRNcF6C9hzUH4ebmV1w.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749,
                    10402
                ],
                "id": 313369,
                "original_language": "en",
                "original_title": "La La Land",
                "overview": "Mia, an aspiring actress, serves lattes to movie stars in between auditions and Sebastian, a jazz musician, scrapes by playing cocktail party gigs in dingy bars, but as success mounts they are faced with decisions that begin to fray the fragile fabric of their love affair, and the dreams they worked so hard to maintain in each other threaten to rip them apart.",
                "popularity": 11.254,
                "poster_path": "/uDO8zWDhfWwoFdKS4fzkUJt0Rf0.jpg",
                "release_date": "2016-12-01",
                "title": "La La Land",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 17500,
                "character": "Restaurant Patron (uncredited)",
                "credit_id": "575d5bedc3a36873a3003639",
                "order": 178
            },
            {
                "adult": false,
                "backdrop_path": "/oNoprEND25zXR6Fns8cIZUkuoMc.jpg",
                "genre_ids": [
                    35,
                    80,
                    18
                ],
                "id": 308266,
                "original_language": "en",
                "original_title": "War Dogs",
                "overview": "Based on the true story of two young men, David Packouz and Efraim Diveroli, who won a $300 million contract from the Pentagon to arm America's allies in Afghanistan.",
                "popularity": 7.4446,
                "poster_path": "/mDcPRjZC1bb6LavFU3gwsWdVfCM.jpg",
                "release_date": "2016-08-18",
                "title": "War Dogs",
                "video": false,
                "vote_average": 6.926,
                "vote_count": 5186,
                "character": "Airline Passenger (uncredited)",
                "credit_id": "5876691c9251416ed30003a6",
                "order": 76
            },
            {
                "adult": false,
                "backdrop_path": "/1hdorswm5HPxb81xq84H9gqveUq.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 371638,
                "original_language": "en",
                "original_title": "The Disaster Artist",
                "overview": "An aspiring actor in Hollywood meets an enigmatic stranger by the name of Tommy Wiseau, the meeting leads the actor down a path nobody could have predicted; creating the worst movie ever made.",
                "popularity": 2.247,
                "poster_path": "/2HuLGiyH0TPYxnCvYHAxc8K738o.jpg",
                "release_date": "2017-03-12",
                "title": "The Disaster Artist",
                "video": false,
                "vote_average": 7.107,
                "vote_count": 3617,
                "character": "Bartender (uncredited)",
                "credit_id": "59579a9f9251410bfa00a57d",
                "order": 71
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Frederick Keeve has been writing most of his life, either for pleasure, academically or professionally for the entertainment business. His first short story, The Lost Island, was published in a limited edition when he was in sixth grade. He has also been making films since he was 10-years-old, growing up in Santa Monica, with his brother, Douglas Keeve, who is a writer/director living in New York. Keeve's first film was Maxine Waters EPC, starring Edward Alan Young. This was a documentary about an employment preparation center in in South Central Los Angeles seen by hundreds of thousands of viewers on KCET public television. Keeve also produced, wrote, directed and composed the score for the award-winning From Russia to Hollywood: The 100-Year Odyssey of Chekhov and Shdanoff, which featured many award-winning and nominated actors such as Gregory Peck (in his last screen role), Jack Palance, Patricia Neal, Anthony Quinn, Robert Stack, Leslie Caron, Beatrice Straight, Sharon Gless, Lloyd Bridges and many more, closing the Hollywood Film Festival and garnering rave reviews in Variety.\n\nKeeve has optioned and developed screenplays from best-selling novels by noted writers such as Edgar winner T. Jefferson Parker and Pulitzer-nominated author Bill Granger. He has previously developed a slate of eight independent feature films with budgets ranging from $2.5M to $20M with Sonny Ritscher, Chief Controller for mega-budget films at both Warner Bros. and 20th Century Fox (Watchmen, Green Lantern, Unfaithful). Keeve is a sought-after script doctor and enjoys writing screenplay coverage. He was hired to adapt a vampire novel, Vengeance Comes, for the screen.\n\nKeeve is an accomplished musician, music director, accompanist, and composer. He wrote the book, music and lyrics for the original musical Three: Songs from the Heart, produced in Los Angeles under the auspices of the Festival of New American Musicals. The musical featured Broadway caliber talent: Ilene Graff (On Broadway: Promises, Promises, I Love My Wife, Grease), Marcus Choi (Hamilton), and was directed by Lance Roberts (On Broadway: The Pee-Wee Herman Show, Sister Act, Ghost, My Fair Lady). He has also recently organized and implemented two road shows for 100 actors in Salt Lake City with noted Hollywood Talent Agents and Casting Directors.",
        "birthday": "1954-08-01",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.backstage.com/u/frederick-keeve/",
        "id": 1177469,
        "imdb_id": "nm0444858",
        "known_for_department": "Acting",
        "name": "Frederick Keeve",
        "place_of_birth": "Santa Monica, California, U.S.",
        "popularity": 0.6153,
        "profile_path": "/fOM486OOwFfBoG5ezvUbQ71MDON.jpg"
    }
}