{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/k61xLJgPo7ScxHLLiBzTM9IDaB7.jpg",
                "genre_ids": [
                    18
                ],
                "id": 406,
                "original_language": "fr",
                "original_title": "La Haine",
                "overview": "After a chaotic night of rioting in a marginal suburb of Paris, three young friends, Vinz, Hubert and Saïd, wander around unoccupied waiting for news about the state of health of a mutual friend who has been seriously injured when confronting the police.",
                "popularity": 5.141,
                "poster_path": "/a6DGCZC2fHNr07tyRumM30ALEKE.jpg",
                "release_date": "1995-05-31",
                "title": "La Haine",
                "video": false,
                "vote_average": 8.084,
                "vote_count": 4287,
                "character": "DJ",
                "credit_id": "5eae27ebedeb43001fc69b42",
                "order": 23
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "DJ Cut Killer ",
            "Anouar Hajoui"
        ],
        "biography": "Anouar Hajoui (Arabic: أنور حجوي, Anwar Hājawiy; born 6 May 1971), better known as DJ Cut Killer or simply Cut Killer, is a Moroccan-born French DJ and record producer with a versatile repertoire of hip hop music.\n\nHe enjoys international fame and mixed in United States of America through invitations by DJ Big Dawg Pitbulls of Funkmaster Flex and Shadyville DJ's of rapper 50 Cent. For more than fifteen years, he has been one of the most emblematic DJs in French hip hop.\n\nAnouar Hajoui as a young Parisian who loved music and a frenzied activist embraced wholeheartedly the emerging Parisian movement. He joined IZB, the first association to promote the hip-hop and organize concerts, and put down scratches on Original MC's 1991 album. He performed a memorable role as himself in a scene from the cult movie La Haine. He was a DJ for MC Solaar's concerts, scratcher on IAM member Akhenaton's solo album, and a radio show on Radio Nova.\n\nIn the middle of the 1990s, Cut Killer had already become a well-respected and active DJ. He adapted and consolidated New York hip-hop in France through many of his mix tapes, mixing the latest releases and freestyles of French rap, they became favorites and collectors' items. His dynamic mixes, his smartness to catch the best 12 inches before anyone, and his flair to find local rappers made his mix-tapes important. The big number of top brass of the second generation of French rap went through this: Sages Poètes de la Rue, Lunatic, 113 and many others. The Hip Hop Soul Party series, composed of double mixed CDs, started in 1996 at MCA's. From the second volume on, exclusive tracks began to appear from Fabe, Busta Flex, among others, with one CD dedicated to hip-hop, the other to R&B. In volume three, a CD was dedicated to international hip-hop, the other to French hip-hop.\n\nKiller, after the death of his rapper mate East established a label called Double H (for Hip-Hop) as a merchandising company and then a production label. In a few years, HH became one of the most influential independent labels on the market. When shifting from Universal to Small (Sony), the Hip-Hop Soul Party project became the Cut Killer Show with a first double CD published in 1997 (containing an outro by Jamel Debbouze), followed in 1998 by Operation Freestyle, a record fully dedicated to French underground. In 1999, Cut Killer and his associates produced R&B 2000, the collective album Double H DJ Crew, but also highly respected artists such as Fabe, Doudou Masta and 113, who managed to make their album Les Princes de la Ville a platinum record to end up winning two \"Victoires de la Musique\" (French music awards) in 2000. Double H is still developing with a team of street marketing, a clothing line \"HH Wear\", a publishing company called \"Eastory Editions\", followed by another production and publishing label \"Eastory Production\". Besides, Killer is booked by Chaos Prod agency, created by his brother Chakri. ...\n\nSource: Article \"Cut Killer\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1971-05-06",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.djcutkiller.com/",
        "id": 1178648,
        "imdb_id": "nm0453155",
        "known_for_department": "Acting",
        "name": "Cut Killer",
        "place_of_birth": "Meknes, Morocco",
        "popularity": 0.3033,
        "profile_path": "/26mGsqIUyOIVALWsr9tLuQpOejU.jpg"
    }
}