{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rcEUuRtr0dFL078bNeXL8pQqrMK.jpg",
                "genre_ids": [
                    53,
                    9648
                ],
                "id": 827,
                "original_language": "fr",
                "original_title": "Les Diaboliques",
                "overview": "The cruel and abusive headmaster of a boarding school, Michel Delassalle, is murdered by an unlikely duo -- his meek wife and the mistress he brazenly flaunts. The women become increasingly unhinged by a series of odd occurrences after Delassalle's corpse mysteriously disappears.",
                "popularity": 1.5504,
                "poster_path": "/jE8ygUYBUGyUcM4sR6iinPqYeDK.jpg",
                "release_date": "1955-01-29",
                "title": "Diabolique",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 1029,
                "character": "Taxi Driver (uncredited)",
                "credit_id": "56cbb3d2c3a36865ef00096f",
                "order": 26
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Gaston Kléber Chambon"
        ],
        "biography": "Jean Clarieux (April 3, 1911 – February 11, 1970) was a French film and television actor. Generally a supporting actor appearing in smaller parts, he played a more substantial role in René Clément's 1946 resistance film The Battle of the Rails.\n\nHis tone of voice as Parisian titi is very recognizable in many American films of the 1950s and 1960s where he lends his voice to complementary actors (especially in war films and westerns), but also to Anthony Quinn. He lends his voice to Captain Haddock in a cartoon series on the adventures of Tintin directed by Ray Goossens.\n\nBeyond the dubbing, his filmography is important: he notably plays a railwayman in La Bataille du rail by René Clément, and it is his weathered face that appears on the poster of the film. In Golden Helmet by Jacques Becker, he plays the role of Paul, alongside Raymond Bussières. He also acted for television in the 1960s, notably in the series Les Cinq Dernières Minutes by Claude Loursais and in Les Beaux Yeux d'Agatha by Bernard Hecht.\n\nSource: Article \"Jean Clarieux\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1911-04-03",
        "deathday": "1970-02-11",
        "gender": 2,
        "homepage": null,
        "id": 117895,
        "imdb_id": "nm0163581",
        "known_for_department": "Acting",
        "name": "Jean Clarieux",
        "place_of_birth": "La Rochelle, Charente-Maritime, France",
        "popularity": 0.1006,
        "profile_path": "/v9UFxc2yTXvPYZfyQ853jGCiY9E.jpg"
    }
}