{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9F6zZuETJWUtkcSEnOc0JLqBHAK.jpg",
                "genre_ids": [
                    53,
                    18
                ],
                "id": 10083,
                "original_language": "en",
                "original_title": "No Way Out",
                "overview": "Navy Lt. Tom Farrell meets a young woman, Susan Atwell , and they share a passionate fling. Farrell then finds out that his superior, Defense Secretary David Brice, is also romantically involved with Atwell. When the young woman turns up dead, Farrell is put in charge of the murder investigation. He begins to uncover shocking clues about the case, but when details of his encounter with Susan surface, he becomes a suspect as well.",
                "popularity": 5.1126,
                "poster_path": "/93CzsBvRhg035yvQosRtSsTL19v.jpg",
                "release_date": "1987-08-14",
                "title": "No Way Out",
                "video": false,
                "vote_average": 6.88,
                "vote_count": 752,
                "character": "Assassin",
                "credit_id": "5bf08ca40e0a262661045788",
                "order": 12
            },
            {
                "adult": false,
                "backdrop_path": "/xinJKZQiqkdJhoYc2SXuEnhehXz.jpg",
                "genre_ids": [
                    12,
                    28,
                    35,
                    53,
                    80
                ],
                "id": 941,
                "original_language": "en",
                "original_title": "Lethal Weapon",
                "overview": "A veteran cop and an unstable detective become partners who must put their differences aside in order to bring down a heroin-smuggling ring run by ex-Special Forces.",
                "popularity": 7.0058,
                "poster_path": "/6gt44oqb4nE8vflPElffeGwsHVl.jpg",
                "release_date": "1987-03-06",
                "title": "Lethal Weapon",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 4778,
                "character": "Mercenary",
                "credit_id": "5f6a30d5dbcade0036381333",
                "order": 29
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nChris D., real name Chris Desjardins, is a punk poet, rock critic, singer, writer, actor and filmmaker. Chris D. is best known as the lead singer and founder of the early Los Angeles punk/deathrock band The Flesh Eaters. Desjardins was a feature writer at Slash magazine in 1977, when he formed a band with several friends from the Los Angeles punk scene, including Tito Larriva. The album, \"A Minute to Pray, A Second to Die\", recorded and released in 1981, featured: John Doe, DJ Bonebrake (X), Dave Alvin (The Blasters), Bill Bateman (The Blasters) and Steve Berlin (The Blasters, Los Lobos). The band recorded two further albums; \"Forever Came Today\" (1982) and \"A Hard Road to Follow\" (1983) with Don Kirk on guitar, Robyn Jameson on bass and Chris Wahl on drums, Chris D. on vocals and occasionally Jill Jordan on backing vocals.\n\nDescription above from the Wikipedia article Chris D., licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1953-01-15",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 117809,
        "imdb_id": "nm0195968",
        "known_for_department": "Acting",
        "name": "Chris D.",
        "place_of_birth": null,
        "popularity": 0.0624,
        "profile_path": "/9vdkHkU8CbISiawNX91IaZkC9d0.jpg"
    }
}