{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yvbXGWjg30sj7rohEZvSe90jSJC.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 396371,
                "original_language": "en",
                "original_title": "Molly's Game",
                "overview": "Molly Bloom, a young skier and former Olympic hopeful becomes a successful entrepreneur (and a target of an FBI investigation) when she establishes a high-stakes, international poker game.",
                "popularity": 5.7926,
                "poster_path": "/in43bQ7k0ttr666IPP94IlbQbTR.jpg",
                "release_date": "2017-12-07",
                "title": "Molly's Game",
                "video": false,
                "vote_average": 7.146,
                "vote_count": 3847,
                "character": "Mike Davidoff",
                "credit_id": "5fba1bae8ec4ab003d79a301",
                "order": 67
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "George Tchortov was born June 27, 1980, in Niagara Falls, Ontario.\n\nAt the age of 4 his mother Milica relocated the family to Toronto, the city George has proudly called home ever since. He attended Sir Wilfrid Laurier Collegiate and was a regular fixture in school plays, talent shows, and the voice of morning announcements.\n\nAfter working as a stunt performer for several years, George decided to pursue his true passion for acting, leading him to New York City, where in 2007 he graduated from the Stella Adler Conservatory of Acting.\n\nOnce back in Toronto George made a hard shift into acting with swift and relative success landing a slew of principal roles which led to his first guest star on the hit series Covert Affairs, opposite Piper Perabo. Some other guest roles include HBO Canada's Living In Your Car, Warehouse 13, Heartland, Rookie Blue, The Listener, CTV's Motive, CW's hit series Arrow, and Syfy's new series Killjoys.\n\nIn 2010 George was honoured and thrilled to join the cast of the Canadian Box Office smash hit comedy GOON, penned by Canadian Legend Jay Baruchel, and directed by Canada's own Michael Dowse. Other film roles include the TIFF Award winning Antiviral, David Hayter's Wolves, and the recent short film Honor Code by Pascal Trottier.\n\nKnown for his character work and physicality, George is a funny and light hearted guy, who shows no sign of slowing down.\n\n- IMDb Mini Biography By: GT",
        "birthday": "1980-06-27",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1179445,
        "imdb_id": "nm0853478",
        "known_for_department": "Acting",
        "name": "George Tchortov",
        "place_of_birth": "Niagara Falls, Ontario, Canada",
        "popularity": 0.2728,
        "profile_path": "/lr9LUSGAfdOMq88PjKgkQOEN44R.jpg"
    }
}