{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fYuWuPZyXSc3s0iPIZ4ZWpEremy.jpg",
                "genre_ids": [
                    18
                ],
                "id": 514439,
                "original_language": "en",
                "original_title": "Breakthrough",
                "overview": "Tragedy strikes when a woman named Joyce's son falls through the ice on a frozen lake and is trapped underwater for over 15 minutes. After being rushed to the hospital, the 14-year-old boy continues to fight for his life as Joyce, her husband and their pastor stay by his bedside and pray for a miracle.",
                "popularity": 5.1141,
                "poster_path": "/lUd2FNC8cMCcHyRMNZtVC48p3xH.jpg",
                "release_date": "2019-04-10",
                "title": "Breakthrough",
                "video": false,
                "vote_average": 7.647,
                "vote_count": 1121,
                "character": "Emma",
                "credit_id": "5ab9e409c3a36871dd00dc5a",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Alissa Dyck-Skovbye",
            "Ali Skovbye"
        ],
        "biography": "Alissa ‘Ali’ Skovbye was born in Vancouver, Canada. She comes from a Scandinavian background and most of her extended family resides in Sweden and Denmark. Although she did not initially take to acting like her older sister Tiera, she did eventually become curious around the age of four. Shortly after she booked her first commercial, a US National for Cadillac. At the age of five she booked a supporting role in the feature film Gemeinsam stärker – Personal Effects (2009) opposite Academy Award winner Kathy Bates, Academy Award nominee Michelle Pfeiffer, and Ashton Kutcher. A string of commercial and short film projects followed and in 2010 she booked a part in her first TV series playing the role of “Haley” in an episode of the long running series “Smallville”. The past year has seen Ali continue to book guest starring roles in such highly acclaimed shows as “Fringe”,” Supernatural”,” R.L Stine’s The Haunting Hour”,and ” Motive”. She also booked a recurring role as “Grace/Paige” on the new hit show for ABC “Once Upon a Time”,as well as the recurring role of “Emily” on the Steven Speilberg produced TNT show “Falling Skies”. Ali has developed a true passion for acting and has shown her ability to handle a diverse range of characters. Although she loves to play the comedic roles and enjoys the Disney shows and all of the typical “tween” fare,Ali has an uncanny ability to play the more disturbing and “flawed” characters and is excited by the challenges that these roles present!She is incredibly dedicated to her craft and continues to train privately as well as pursuing theatre and musical theatre. Despite her busy acting schedule. she still enjoys school where she participates in a number of activities including her favorite sport volleyball.Outside of school she enjoys singing,dancing and playing the guitar.",
        "birthday": "2002-05-16",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 117995,
        "imdb_id": "nm3309629",
        "known_for_department": "Acting",
        "name": "Alissa Skovbye",
        "place_of_birth": " Vancouver, British Columbia, Canada",
        "popularity": 0.9447,
        "profile_path": "/smnFa3aKNJyzwtYmGQThBsXHG4J.jpg"
    }
}