{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3zCPI4JFc54xvLaJ71oI2KoP3az.jpg",
                "genre_ids": [
                    80,
                    9648,
                    53
                ],
                "id": 1949,
                "original_language": "en",
                "original_title": "Zodiac",
                "overview": "The Zodiac murders cause the lives of Paul Avery, David Toschi and Robert Graysmith to intersect.",
                "popularity": 7.688,
                "poster_path": "/6YmeO4pB7XTh8P8F960O1uA14JO.jpg",
                "release_date": "2007-03-02",
                "title": "Zodiac",
                "video": false,
                "vote_average": 7.528,
                "vote_count": 11041,
                "character": "Zodiac 4",
                "credit_id": "56bc8e0e9251414c11001c94",
                "order": 16
            },
            {
                "adult": false,
                "backdrop_path": "/1pOp56fSV4XySjaGrhb6NPD2n4r.jpg",
                "genre_ids": [
                    18,
                    36,
                    28
                ],
                "id": 10423,
                "original_language": "en",
                "original_title": "Dragon: The Bruce Lee Story",
                "overview": "This film is a glimpse into the life, love and the unconquerable spirit of the legendary Bruce Lee. From a childhood of rigorous martial arts training, Lee realizes his dream of opening his own kung-fu school in America. Before long, he is discovered by a Hollywood producer and begins a meteoric rise to fame and an all too short reign as one the most charismatic action heroes in cinema history.",
                "popularity": 2.3731,
                "poster_path": "/lxhsdC8wuGgQf0gKCt8wyHHxGcQ.jpg",
                "release_date": "1993-05-07",
                "title": "Dragon: The Bruce Lee Story",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 768,
                "character": "Nunnemacher",
                "credit_id": "5968bc38c3a368791a01ce0b",
                "order": 22
            },
            {
                "adult": false,
                "backdrop_path": "/wfabrzHzfYTdCj3iSCY7OEQbND0.jpg",
                "genre_ids": [
                    18,
                    80,
                    36
                ],
                "id": 522212,
                "original_language": "en",
                "original_title": "Just Mercy",
                "overview": "The powerful true story of Harvard-educated lawyer Bryan Stevenson, who goes to Alabama to defend the disenfranchised and wrongly condemned — including Walter McMillian, a man sentenced to death despite evidence proving his innocence. Bryan fights tirelessly for Walter with the system stacked against them.",
                "popularity": 3.9626,
                "poster_path": "/2bDZl3PzFLFWe4gaFUQnnaslqT3.jpg",
                "release_date": "2019-12-25",
                "title": "Just Mercy",
                "video": false,
                "vote_average": 7.857,
                "vote_count": 2373,
                "character": "Bill",
                "credit_id": "5e1db22da24c5000130bc34d",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "John R. Lacy "
        ],
        "biography": "John Lacy (born August 29, 1965) is an American actor-director-writer living in Los Angeles. John was born in Iowa City where his father, the writer Robert Lacy, studied at the Iowa Writer's Workshop under the mentor-ship of Kurt Vonnegut and Richard Yates, alongside fellow students and notable writers, Andre Dubus, William Harrison, Theodore Weesner, and detective novelist James Crumley. The family settled in Minneapolis after Robert took a position working for the State Capitol as a speech writer for the late Senator Nick Coleman.\n\nJohn's mother, Lyn Ellen Lacy is an accomplished educator and published author, specializing in children's' visual literacy. His older brother, Peter Lacy, works as an innovator in corporate culture integration in Seattle, WA; and his older sister, Ruth Grim, is a museum curator in Daytona, Florida.\n\nJohn's acting career began in 1988, initially showing up in beer commercials and music videos. After extensive study, stage work, and commitment to the Meisner technique, his roles improved considerably, booking several guest starring roles on a handful of Miller/Boyett Production situation comedies. Then came John's first significant film role, cast as 'Fector' in Nancy Savoca's anti-war love story Dogfight. Since then, John's stock has risen steadily year after year, appearing in all of television's top rated programs while continuing a substantial and recognizable presence in television commercials, and supporting roles in several notable films, most recently, Just Mercy. His powerful performance as Howard Madson in the 2019 FX series American Crime Story: The Assassination of Gianni Versace drew considerable critical acclaim.\n\nJohn has also established a reputation as a career coach and motivational speaker for aspiring talent getting in to the entertainment business. His acting studio in Burbank, The Lacy Group Acting Studio, has been instrumental in developing and cultivating some of the most promising young actors in Hollywood.\n\nJohn has been married to Karin Lacy since 1994. They have three sons.\n\nJohn created the critically acclaimed Crime Noir web series The Reveal... using over 30 actors from his acting studio, The Lacy Group. He followed that up with another web series creation, The Adventures of Hollywood & Vine, a screwball comedy depicting a pair of struggling actor roommates' daily struggles. His feature film debut, Custody Road, won Best Editing at the Auckland International Film Festival and streamed on Amazon Prime, GooglePlay, iTunes. His second feature, Rosebud Lane, is scheduled for release in August, 2021.",
        "birthday": "1965-08-29",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1180860,
        "imdb_id": "nm0480381",
        "known_for_department": "Acting",
        "name": "John Lacy",
        "place_of_birth": "Iowa City - Iowa - USA",
        "popularity": 0.1691,
        "profile_path": "/9v2fOfR5UccdFbOuhn7UYmf4cRE.jpg"
    }
}