{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/i4Fp0AJsqAzbeVQyCoG0adRRfdh.jpg",
                "genre_ids": [
                    28,
                    53
                ],
                "id": 11474,
                "original_language": "en",
                "original_title": "The Warriors",
                "overview": "Prominent gang leader Cyrus calls a meeting of New York's gangs to set aside their turf wars and take over the city. At the meeting, a rival leader kills Cyrus, but a Coney Island gang called the Warriors is wrongly blamed for Cyrus' death. Before you know it, the cops and every gangbanger in town is hot on the Warriors' trail.",
                "popularity": 3.4154,
                "poster_path": "/fCDXAJcPvpsMd5CL1kBKkkNGW3X.jpg",
                "release_date": "1979-02-01",
                "title": "The Warriors",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 2251,
                "character": "Turnbull A.C.",
                "credit_id": "64a29048d400f3010c360260",
                "order": 28
            },
            {
                "adult": false,
                "backdrop_path": "/dfkE2LppPbJ1qUzi3tdND5iuMFp.jpg",
                "genre_ids": [
                    35,
                    80
                ],
                "id": 10607,
                "original_language": "en",
                "original_title": "Don't Be a Menace to South Central While Drinking Your Juice in the Hood",
                "overview": "When Ashtray moves to South Central L.A. to live with his father (who appears to be the same age he is) and grandmother (who likes to talk tough and smoke reefer), he falls in with his gang-banging cousin Loc Dog, who along with the requisite pistols and Uzi carries a thermo-nuclear warhead for self-defense. Will Ashtray be able to keep living the straight life?",
                "popularity": 7.3964,
                "poster_path": "/HZQBF7JDd2e9p4rPSbSHuWHaCC.jpg",
                "release_date": "1996-01-12",
                "title": "Don't Be a Menace to South Central While Drinking Your Juice in the Hood",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 1401,
                "character": "Detective Cliche",
                "credit_id": "674cd3094558dae4493dbcc2",
                "order": 61
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "J.W. Smith is a producer and actor with more than 40 years of entertainment experience in motion pictures and television. J.W. grew up in Cleveland, Ohio, where he began his acting career at The Karamu House Community Theater. In the early 1970s, J.W. moved to New York City where he became a student in Uta Hagen's acting class at HB Studio and at The Henry Street Playhouse. During his stint in New York City, J.W. met and became close friends with Morgan Freeman and Bill Duke. More than four decades later, J.W. remains close friends with both Morgan and Bill, often collaborating on scripts and potential projects.\n\nJ.W. spent several successful years performing on Broadway and Off Broadway in plays including, \"We Interrupt This Program,\" Public Theater's production of \"On the Goddam Lock-in,\" and \"So Nice, They Named It Twice.\" In addition to acting, J.W. produced shows in and around New York City for the Amas Repertory Theater Company.\n\nIn the early 1980s, J.W. moved to Los Angeles to pursue an acting career in film and television where he immediately landed his first job in television on \"Palmerstown, U.S.A.\" He was selected to be a part of Paramount Pictures Associate Producers Training Program, working on several ground-breaking series for television including, \"The Best of The West,\" \"Taxi,\" and \"Cheers.\" J.W. has also appeared in numerous television shows including, \"L.A. Law,\" \"Cagney and Lacey,\" \"Reno 911,\" \"The X-Files,\" and \"Hill Street Blues.\"\n\nShowing his range and depth of talent, J.W. has appeared in many popular feature films including, \"Red Heat\" (starring Arnold Schwarzenegger), \"Johnny Handsome\" (starring Mickey Rourke, Ellen Barkin, and Morgan Freeman), \"Undisputed\" (starring Wesley Snipes and Ving Rhames), \"Beetlejuice\" (starring Michael Keaton), \"Hoodlum\" (starring Laurence Fishburne, Tim Roth, and directed by Bill Duke), \"The Warriors\" (cult classic directed by Walter Hill), to name a few.\n\nJ.W. is President of 3000 Realms Entertainment, a production company he co-founded with friend and business partner, Bryan Behuniak. J.W.'s project in development with 3000 Realms Entertainment is \"Dead Wrong,\" executive produced by Morgan Freeman, with producers Bryan Behuniak, James Dyer, and writer Matt Benjamin.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 118069,
        "imdb_id": "nm0808541",
        "known_for_department": "Acting",
        "name": "J.W. Smith",
        "place_of_birth": null,
        "popularity": 0.1308,
        "profile_path": "/qTmN9WWFUQXCKk7ngJQoF2PzUd6.jpg"
    }
}