{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/80uHK2xWwjlOxmfJ1wQB09omAht.jpg",
                "genre_ids": [
                    10749,
                    35,
                    80,
                    14
                ],
                "id": 854,
                "original_language": "en",
                "original_title": "The Mask",
                "overview": "When timid bank clerk Stanley Ipkiss discovers a magical mask containing the spirit of the Norse god Loki, his entire life changes. While wearing the mask, Ipkiss becomes a supernatural playboy exuding charm and confidence which allows him to catch the eye of local nightclub singer Tina Carlyle. Unfortunately, under the mask's influence, Ipkiss also robs a bank, which angers junior crime lord Dorian Tyrell, whose goons get blamed for the heist.",
                "popularity": 12.9656,
                "poster_path": "/yd3wjLLeQHJ3oRDy4wwiNNFVyLW.jpg",
                "release_date": "1994-07-29",
                "title": "The Mask",
                "video": false,
                "vote_average": 6.969,
                "vote_count": 10731,
                "character": "Dorian Tyrrell",
                "credit_id": "52fe4282c3a36847f80247d9",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/suaEOtk1N1sgg2MTM7oZd2cfVp3.jpg",
                "genre_ids": [
                    53,
                    80,
                    35,
                    18
                ],
                "id": 680,
                "original_language": "en",
                "original_title": "Pulp Fiction",
                "overview": "A burger-loving hit man, his philosophical partner, a drug-addled gangster's moll and a washed-up boxer converge in this sprawling, comedic crime caper. Their adventures unfurl in three stories that ingeniously trip back and forth in time.",
                "popularity": 18.5743,
                "poster_path": "/vQWk5YBFWF4bZaofAbv0tShwBvQ.jpg",
                "release_date": "1994-09-10",
                "title": "Pulp Fiction",
                "video": false,
                "vote_average": 8.5,
                "vote_count": 29078,
                "character": "Zed",
                "credit_id": "52fe426ac3a36847f801cb17",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/nuO8o9ltxhI7AZQxePavEZ4TyHa.jpg",
                "genre_ids": [
                    28,
                    80,
                    18
                ],
                "id": 2034,
                "original_language": "en",
                "original_title": "Training Day",
                "overview": "On his first day on the job as a narcotics officer, a rookie cop works with a rogue detective who isn't what he appears.",
                "popularity": 7.3659,
                "poster_path": "/bUeiwBQdupBLQthMCHKV7zv56uv.jpg",
                "release_date": "2001-10-05",
                "title": "Training Day",
                "video": false,
                "vote_average": 7.506,
                "vote_count": 6241,
                "character": "Jeff (uncredited)",
                "credit_id": "5acb856f925141431101245c",
                "order": 38
            },
            {
                "adult": false,
                "backdrop_path": "/9jrHaaXWB37VcA4KGemP8iF7bFB.jpg",
                "genre_ids": [
                    18,
                    80,
                    53
                ],
                "id": 629,
                "original_language": "en",
                "original_title": "The Usual Suspects",
                "overview": "Held in an L.A. interrogation room, Verbal Kint attempts to convince the feds that a mythic crime lord, Keyser Soze, not only exists, but was also responsible for drawing him and his four partners into a multi-million dollar heist that ended with an explosion in San Pedro harbor – leaving few survivors. Verbal lures his interrogators with an incredible story of the crime lord's almost supernatural prowess.",
                "popularity": 10.6178,
                "poster_path": "/99X2SgyFunJFXGAYnDv3sb9pnUD.jpg",
                "release_date": "1995-07-19",
                "title": "The Usual Suspects",
                "video": false,
                "vote_average": 8.173,
                "vote_count": 10858,
                "character": "Redfoot the Fence (uncredited)",
                "credit_id": "5b534f200e0a26231c0128b6",
                "order": 32
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Питер Грин",
            "彼得·格林纳"
        ],
        "biography": "Peter Greene (born Peter Green; October 8, 1965) is an American character actor.\n\nA native of Montclair, New Jersey, Greene did not pursue a career in acting until his mid 20s. He initially landed several roles in cinema and television in the early 1990s.\n\nGreene's breakthrough came in 1994-1995 with a roles in Pulp Fiction, The Mask, Clean, Shaven, and The Usual Suspects. Greene is possibly best remembered for his role in Pulp Fiction, as Zed who rapes Marsellus Wallace. The Mask saw him play the villainous Dorian Tyrell opposite Jim Carrey and Cameron Diaz. Greene's most accomplished role was that of schizophrenic Peter Winter in Clean, Shaven. The Usual Suspects saw him play the small but memorable character, Redfoot. Greene often plays villains such as in Under Siege 2: Dark Territory, Training Day (as a corrupt narcotics officer) and martial arts/crime film Fist of the Warrior (opposite Ho-Sung Pak, Roger Guenveur Smith and Sherilyn Fenn).\n\nHe worked with one director, Jordan Alan, twice. Once on the film Kiss and Tell, a dark comic turn for the actor and then again 4 years later in The Gentleman Bandit (aka Gentleman B). After Greene's arrests in 1998 for drug related crimes, Alan had to put the actor through rehab to get him through the second film and eventually, after coming upon Greene doing heroine with Mike Starr, he was forced to replace Greene's voice because of the vocal problems caused by drugs. Despite these problems, Mr. Alan vouched for Greene to producer Tobe Jaffe for the movie Blue Streak.\n\nHe played Martin Lawrence's nemesis in Blue Streak.\n\nGreene has continued to mostly work as a character actor. He appeared in the short-lived television drama The Black Donnellys. He also appeared as a policeman in Prodigy of Mobb Deep's video for \"A,B,C's\", as well as the focal character in House of Pain's video for \"Fed Up\".\n\nGreene recently appeared in the opening scene of the premier of the new FX series Justified.\n\nDescription above from the Wikipedia article Peter Greene, licensed under CC-BY-SA, full list of contributors on Wikipedia​",
        "birthday": "1965-10-08",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 11803,
        "imdb_id": "nm0338886",
        "known_for_department": "Acting",
        "name": "Peter Greene",
        "place_of_birth": "Montclair, New Jersey, USA",
        "popularity": 1.7337,
        "profile_path": "/kPnF9rK6ULrIycK7n0ewYjInMZG.jpg"
    }
}