{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6N6VUUR1gzbCkiGpQzvRREv3Od1.jpg",
                "genre_ids": [
                    18
                ],
                "id": 8092,
                "original_language": "en",
                "original_title": "This Boy's Life",
                "overview": "When a son and mother move to Seattle in hopes for a better life, the mother meets a seemingly polite man. Things go south when the man turns out to be abusive, endangering their lives. As the mother struggles to maintain hope in an impossible situation, the son has plans to escape.",
                "popularity": 2.952,
                "poster_path": "/pRMSZfen1Cv1eqwDbtxCBpBqxnU.jpg",
                "release_date": "1993-04-09",
                "title": "This Boy's Life",
                "video": false,
                "vote_average": 7.126,
                "vote_count": 1025,
                "character": "Silver Sister #2",
                "credit_id": "5de17422a24c5000113303a0",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Morgan Brayton is a writer and performer who lives in Vancouver with her wife and an excessive number of cats. A Canadian Comedy Award nominee, she is one quarter of The Lady Show, winners of Best Variety Show at the Vancouver Comedy Awards and Pick of the Fringe at the Vancouver Fringe Festival. Morgan is the creator of the solo shows Give It Up, Raccoonery! and Girls Like Me. Her sketch comedy credits span decades and include Girl Parts, 30 Helens and The Crawford Twins and her theatre credits include the final tour of The Number 14. You can hear her on CBC Radio's The Debaters or see her on BC's Knowledge Network, her own show on OutTV, Morgan Brayton ...and Other People (2014), or in a wide range of memorable film & TV acting roles including Chubby Best Friend, Second Cashier, and Person with Face.",
        "birthday": "1970-06-26",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.morganbrayton.com/",
        "id": 1180002,
        "imdb_id": "nm0106299",
        "known_for_department": "Acting",
        "name": "Morgan Brayton",
        "place_of_birth": "Victoria, British Columbia, Canada",
        "popularity": 0.1564,
        "profile_path": "/vyvqIg5jVUYTecfHAlNhr2gmoYy.jpg"
    }
}