{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/i7n9u1SppzXcSO2EVgwEehzABzm.jpg",
                "genre_ids": [
                    37
                ],
                "id": 17529,
                "original_language": "en",
                "original_title": "True Grit",
                "overview": "The murder of her father sends a teenage tomboy on a mission of 'justice', which involves avenging her father's death. She recruits a tough old marshal, 'Rooster' Cogburn because he has 'true grit', and a reputation of getting the job done.",
                "popularity": 3.5697,
                "poster_path": "/9TjGjAD2deCtIG4ebi8LhIyFK6j.jpg",
                "release_date": "1969-06-11",
                "title": "True Grit",
                "video": false,
                "vote_average": 7.331,
                "vote_count": 818,
                "character": "\"Barlow\"",
                "credit_id": "52fe472f9251416c7509085d",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ralph Lewis Zink"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nDonald Woods (born Ralph Lewis Zink, December 2, 1906 – March 5, 1998) was a Canadian-American film and television actor whose career in Hollywood spanned six decades.\n\nBorn in Brandon, Manitoba, Woods moved with his family to California and was raised in Burbank. A son of William and Margaret Zink, Presbyterians of German descent. His younger brother, Clarence Russell Zink, also became an actor (Russ Conway).\n\nWoods graduated from the University of California, Berkeley, and made his film debut in 1928. His screen career was spent mostly in B movies, for example as lawyer Perry Mason in the 1937 film The Case of the Stuttering Bishop. He also occasionally played major roles in bigger feature films like A Tale of Two Cities (1935), Anthony Adverse (1936), Watch on the Rhine (1943), The Bridge of San Luis Rey (1944), and Roughly Speaking (1945).\n\nOf considerable importance to his acting career were several seasons as leading man with the Elitch Gardens Theatre Company in Denver, Colorado, where he performed in 1932, 1933, 1939, 1941, 1947, and 1948.\n\nIn the early days of television, Woods starred as the title character in the 1951 syndicated TV series Craig Kennedy, Criminologist, and he was the host of Damon Runyon Theater on CBS-TV. He played himself on the dramatic series Hotel Cosmopolitan, also on CBS, and he was one of three hosts of The Orchid Award on ABC-TV. He portrayed Walter Manning on Portia Faces Life on CBS.\n\nHe also appeared in such anthology series as The Philco Television Playhouse, Armstrong Circle Theatre, Robert Montgomery Presents, The United States Steel Hour, Crossroads, and General Electric Theater. On April 11, 1961, Woods appeared as \"Profesor Landfield\" in the episode \"Two for the Gallows\" on NBC's Laramie western series. Series character Slim Sherman (John Smith) is hired under false pretenses to take Landfield into the Badlands to seek gold. Landfield, however, is really Morgan Bennett, a member of the former Henry Plummer gang who has escaped from prison. Slim has no idea that Lanfield is seeking the loot that his gang had hidden away. Series character Jess Harper (Robert Fuller), Pete Dixon, played by Warren Oates, and Pete's younger brother soon come to Slim's aid. The title stems from the talk that the undisciplined Dixon brothers might eventually wind up on a hangman's noose.\n\nWoods later was a regular in the role of John Brent on the short-lived series Tammy and made guest appearances on Bat Masterson, Wagon Train, Ben Casey, 77 Sunset Strip, Hawaiian Eye, Stoney Burke, Bourbon Street Beat, Bonanza, Coronet Blue, Ironside, Alias Smith and Jones, The Wild Wild West and Owen Marshall: Counselor at Law, among many others before retiring from acting in 1976.\n\nBesides his film career, he also worked as a successful real estate broker in Palm Springs where he lived with his wife, childhood sweetheart Josephine Van der Horck. They were married from 1933 until his death and had two children, Linda and Conrad. He was interred at the Forest Lawn Cemetery in Cathedral City, California.",
        "birthday": "1906-12-02",
        "deathday": "1998-03-05",
        "gender": 2,
        "homepage": null,
        "id": 118022,
        "imdb_id": "nm0940579",
        "known_for_department": "Acting",
        "name": "Donald Woods",
        "place_of_birth": "Brandon, Manitoba, Canada",
        "popularity": 0.3103,
        "profile_path": "/qgTEj1k6BWRQVzBCan2kxZKsS6D.jpg"
    }
}