{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fMQGVBk0ZyzxMQOBGkUazCkvMMR.jpg",
                "genre_ids": [
                    35,
                    10749,
                    18
                ],
                "id": 38408,
                "original_language": "en",
                "original_title": "Life As We Know It",
                "overview": "After a disastrous first date for caterer Holly and network sports director Messer, all they have in common is a dislike for each other and their love for their goddaughter Sophie. But when they suddenly become all Sophie has in this world, Holly and Messer must set their differences aside. Juggling careers and social calendars, they'll have to find common ground while living under the same roof.",
                "popularity": 2.8541,
                "poster_path": "/zLzS2aOqKsS0QvEaY6SfBw4VBqh.jpg",
                "release_date": "2010-10-02",
                "title": "Life As We Know It",
                "video": false,
                "vote_average": 6.905,
                "vote_count": 3195,
                "character": "Lonnie",
                "credit_id": "588382b89251413edb008680",
                "order": 15
            },
            {
                "adult": false,
                "backdrop_path": "/lxCUDgZ54myV7goBrkpFoHRt9Ms.jpg",
                "genre_ids": [
                    28,
                    35,
                    80
                ],
                "id": 64688,
                "original_language": "en",
                "original_title": "21 Jump Street",
                "overview": "When cops Schmidt and Jenko join the secret Jump Street unit, they use their youthful appearances to go undercover as high school students. They trade in their guns and badges for backpacks, and set out to shut down a dangerous drug ring. But, as time goes on, Schmidt and Jenko discover that high school is nothing like it was just a few years earlier -- and, what's more, they must again confront the teenage terror and anxiety they thought they had left behind.",
                "popularity": 6.2334,
                "poster_path": "/8v3Sqv9UcIUC4ebmpKWROqPBINZ.jpg",
                "release_date": "2012-03-14",
                "title": "21 Jump Street",
                "video": false,
                "vote_average": 6.883,
                "vote_count": 10614,
                "character": "Domingo",
                "credit_id": "5ae9d73fc3a3683baf007d20",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "​Antwan DeRay Davis is an American stand-up comedian and actor best known for his role as Ray-Ray the Hustle Guy in Barbershop and Barbershop 2: Back in Business, Davis has also appeared in other films, including Semi-Pro (2008) and 21 Jump Street. His television roles and appearances include programs  BET's ComicView, MTV's Nick Cannon's Wild 'N Out and 'Short Circuitz, and HBO's Entourage.\n\nHe began his career in comedy clubs and shortly after moving to Los Angeles, he won the Comedy Central Laugh Riots Competition and was a standout on the Cedric the Entertainer Tour.  He voices for several skits on rapper Kanye West's albums The College Dropout and Late Registration, and also appeared in West's music video for \"Through the Wire.\" Other music video appearances for Davis include Lil' Flip's \"Game Over\", Chris Brown's \"Yo (Excuse Me Miss),\" and Three 6 Mafia's \"Doe Boy Fresh.\"\n\nDescription above from the Wikipedia article DeRay Davis  licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1982-02-26",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.deraydavis.com/",
        "id": 11827,
        "imdb_id": "nm1154986",
        "known_for_department": "Acting",
        "name": "DeRay Davis",
        "place_of_birth": "Chicago, Illinois, USA",
        "popularity": 0.6159,
        "profile_path": "/c1kNORRWnzOoBRTM0XLIMe2raGo.jpg"
    }
}