{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/997ToEZvF2Obp9zNZbY5ELVnmrW.jpg",
                "genre_ids": [
                    10749,
                    18
                ],
                "id": 537915,
                "original_language": "en",
                "original_title": "After",
                "overview": "Tessa Young is a dedicated student, dutiful daughter and loyal girlfriend to her high school sweetheart. Entering her first semester of college, Tessa's guarded world opens up when she meets Hardin Scott, a mysterious and brooding rebel who makes her question all she thought she knew about herself -- and what she wants out of life.",
                "popularity": 20.0008,
                "poster_path": "/u3B2YKUjWABcxXZ6Nm9h10hLUbh.jpg",
                "release_date": "2019-04-11",
                "title": "After",
                "video": false,
                "vote_average": 7.117,
                "vote_count": 8398,
                "character": "Carol Young",
                "credit_id": "5bd353bb9251410387003cde",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/6hgItrYQEG33y0I7yP2SRl2ei4w.jpg",
                "genre_ids": [
                    10749,
                    18
                ],
                "id": 613504,
                "original_language": "en",
                "original_title": "After We Collided",
                "overview": "Tessa finds herself struggling with her complicated relationship with Hardin; she faces a dilemma that could change their lives forever.",
                "popularity": 9.7088,
                "poster_path": "/kiX7UYfOpYrMFSAGbI6j1pFkLzQ.jpg",
                "release_date": "2020-09-02",
                "title": "After We Collided",
                "video": false,
                "vote_average": 7.162,
                "vote_count": 5397,
                "character": "Carol Young",
                "credit_id": "5d47efc7a0be280811a2f0ca",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Σέλμα Μπλερ",
            "셀마 블레어",
            "Сэльма Блэр",
            "Selma Blair Beitner",
            "莎瑪布萊兒 飾",
            "سلما بلر"
        ],
        "biography": "​Selma Blair Beitner (born June 23, 1972) is an American actress. She's known for her roles in the comedies Legally Blonde (2001) and The Sweetest Thing (2002), and achieved international fame with her portrayal of Liz Sherman in the big-budget fantasy films Hellboy (2004) and Hellboy II: The Golden Army (2008).\n\nAfter training at the Stella Adler Conservatory of Acting, Blair began acting in the mid-90s. Blair began her career with small roles and guest roles in various television series. Blair appeared with co-stars Sarah Michelle Gellar, and Ryan Phillippe in the 1999 film Cruel Intentions, for which Blair won an MTV Movie Award for Best Kiss - Lesbian Kiss between Blair and co-star Gellar.\n\nShe went on to star as Zoe Bean in two seasons of TV series Zoe, Duncan, Jack and Jane (1999-2000), She rejoined actress Reese Witherspoon in the comedy film Legally Blonde (2001).  She also starred opposite Cameron Diaz and Christina Applegate in The Sweetest Thing and in two independent films that garnered her much critical acclaim: Dana Lustig's Kill Me Later and Todd Solondz's controversial Storytelling, and one of her most recognized roles, Liz Sherman in Hellboy (2004) and its successful sequel released in 2008, Hellboy II: The Golden Army, based on the popular comic.\n\nHer films include The Deal, The Big Empty, and Ed Burn's Purple Violets. Her other notable film credits include Highway (2002), A Guy Thing (2003), A Dirty Shame (2004), The Fog (2005), WΔZ (2007), Feast of Love (2007), The Poker House (2008), Dark Horse (2011), In Their Skin (2012), Ordinary World  (2016), Mothers and Daughters (2016), Mom and Dad (2017), After (2019) and A Dark Foe (2020).\n\nShe starred opposite Molly Shannon in the TV series Kath & Kim, based on the Australian television series of the same name. She also starred as Kate Wales on the sitcom Anger Management (2012–2014); and as Kris Jenner in the first season of the FX drama series American Crime Story (2016). In 2010, Blair narrated the audiobook The Diary of Anne Frank, earning a nomination for the Grammy Award for Best Spoken Word Album for Children.\n\nShe can also be seen in the My Friend Steve 1998 music video Charmed. Her stage work includes the role of Kayleen in Rajiv Joseph's Gruesome Playground Injuries, which had its world premiere at Houston's Alley Theatre in October 2009.\n\nIn October 2018, Blair revealed that she had been diagnosed with multiple sclerosis in August of that year.",
        "birthday": "1972-06-23",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 11826,
        "imdb_id": "nm0004757",
        "known_for_department": "Acting",
        "name": "Selma Blair",
        "place_of_birth": "Southfield, Michigan. USA",
        "popularity": 1.1567,
        "profile_path": "/2rO5eN6hDB0JxMMZHxNKEuMRm1m.jpg"
    }
}