{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gz3rCM34UicmOxRY1T2SgiQZJoS.jpg",
                "genre_ids": [
                    18
                ],
                "id": 249164,
                "original_language": "en",
                "original_title": "If I Stay",
                "overview": "Mia Hall, a talented young cellist, thought the most difficult decision she would ever have to make would be whether to pursue her musical dreams at prestigious Juilliard or follow her heart to be with the love of her life, Adam, a rock singer/guitarist. However, a car wreck changes everything in an instant, and now Mia's life hangs in the balance. Suspended between life and death, Mia faces a choice that will decide her future.",
                "popularity": 3.8833,
                "poster_path": "/7Twh8h3Wh7GC9npTAEUThgkxkWL.jpg",
                "release_date": "2014-08-21",
                "title": "If I Stay",
                "video": false,
                "vote_average": 7.366,
                "vote_count": 4239,
                "character": "Surgeon",
                "credit_id": "542d5add0e0a2607a1001cd8",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "John Tracy",
            "John Emmett Tracy"
        ],
        "biography": "In over thirty years as an actor, John has worked extensively in theatre, film, television and voiceovers. He has performed on stages throughout the world, including Shakespeare's Globe Theatre in London, where he was selected as a company member of the Globe's International Actors' Fellowship, and in Japan, where he toured as the title role in Hamlet. He has appeared in over one hundred productions and is the recipient of the 2013 Jessie Richardson Theatre Award for Outstanding Performance by an Actor in a Lead Role for his work in Pi Theatre's production of Mark O'Rowe's Terminus. John is also the creator of The 24 Hour Shakespeare Project, for which he performed continuously for twenty-four straight hours in all thirty-eight of Shakespeare's plays to raise money for British Columbia Children's Hospital.\n\nHis film work includes appearances in Fifty Shades Freed, If I Stay, American Mary, Stagecoach: The Texas Jack Story and Steven Spielberg's The BFG. He has performed lead, recurring and supporting roles in many television shows, including Altered Carbon, iZombie, The Man in the High Castle, Supernatural, Smallville, When Calls the Heart, The Killing, Continuum, Girlfriends' Guide to Divorce and Sanctuary.\n\nJohn received his education and training at Rose Bruford College, where he earned a Bachelor's Degree in Theatre, as well as at the Royal Academy of Dramatic Art (RADA) in London and the National Shakespeare Conservatory in New York.\n\nHe has directed over thirty theatre productions and has been teaching for twenty years in colleges, conservatories and studios in Canada and the United States.",
        "birthday": "1969-07-02",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.johnemmettracy.com",
        "id": 1182657,
        "imdb_id": "nm1356757",
        "known_for_department": "Acting",
        "name": "John Emmet Tracy",
        "place_of_birth": "Chicago, Illinois, USA",
        "popularity": 0.2025,
        "profile_path": "/tJUSztVpizjsXLpqvEVwSq91isp.jpg"
    }
}