{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/d9ISNkCasZmkvL7YFw2J4ddQv3j.jpg",
                "genre_ids": [
                    28,
                    53
                ],
                "id": 8681,
                "original_language": "en",
                "original_title": "Taken",
                "overview": "Bryan Mills, a former government operative, is trying to reconnect with his teenage daughter Kim. After reluctantly agreeing with his ex-wife to let Kim go to Paris on vacation with a friend, his worst nightmare comes true. While on the phone with his daughter shortly after she arrives in Paris, she and her friend are abducted by a gang of human traffickers. Working against the clock, Bryan relies on his extensive training and skills to track down the ruthless gang that abducted her and launch a one-man war to rescue his daughter.",
                "popularity": 13.5759,
                "poster_path": "/y5Va1WXDX6nZElVirPrGxf6w99B.jpg",
                "release_date": "2008-02-18",
                "title": "Taken",
                "video": false,
                "vote_average": 7.398,
                "vote_count": 11656,
                "character": "Kim Mills",
                "credit_id": "52fe44b4c3a36847f80a54ab",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/zHkQEQzoLAJwlMif4QJP1jjbsky.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 330483,
                "original_language": "en",
                "original_title": "The Choice",
                "overview": "Travis and Gabby first meet as neighbors in a small coastal town and wind up in a relationship that is tested by life's most defining events.",
                "popularity": 3.0028,
                "poster_path": "/6MF3cdAasnF17SG9bmeamQ066iJ.jpg",
                "release_date": "2016-02-04",
                "title": "The Choice",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 1923,
                "character": "Stephanie Parker",
                "credit_id": "5503347bc3a3685b9b004826",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Margaret Grace Denig",
            "Maggie Denig",
            "Меггі Грейс",
            "مگی گریس",
            "مگی گِیس"
        ],
        "biography": "Margaret 'Maggie' Grace Denig (born September 21, 1983) is an American actress and model. She is known for her roles as Shannon Rutherford on the ABC television series Lost (2004–2006; 2010), Kim Mills in the Taken trilogy (2008–2014), Irina in The Twilight Saga (2011–2012), and Althea Szewczyk-Przygocki on Fear the Walking Dead (2018–2021).\n\nOriginally from Worthington, Ohio, she dropped out of high school to move to Los Angeles with her mother after her parents' divorce. While struggling financially, she landed her first role as the title character in the web-based video series Rachel's Room in 2001. She went on to earn a Young Artist Award nomination in 2002 with her portrayal of 15-year-old murder victim Martha Moxley in the television movie Murder in Greenwich.\n\nIn 2004, Grace was cast as Shannon Rutherford in the television series Lost, on which she was a main cast member for the first two seasons, winning a Screen Actors Guild Award shared with the ensemble cast. Leaving the series, Grace was keen to work more prominently in film having starred opposite Tom Welling in The Fog in 2005. She appeared in Suburban Girl, The Jane Austen Book Club (both 2007), and Taken (2008). She has the lead role of Alice in Malice in Wonderland, a modern take on Lewis Carroll's novel Alice's Adventures in Wonderland. Grace reprised the role of Shannon in two more episodes of Lost, including the series finale.",
        "birthday": "1983-09-21",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 11825,
        "imdb_id": "nm1192254",
        "known_for_department": "Acting",
        "name": "Maggie Grace",
        "place_of_birth": "Worthington, Columbus, Ohio, USA",
        "popularity": 1.7604,
        "profile_path": "/fEZSGno4ooPgFjuGzE7ogsWEHsh.jpg"
    }
}