{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wEXYJgW5l2IwwNdRVk9ixgKl8qu.jpg",
                "genre_ids": [
                    10749,
                    14
                ],
                "id": 465136,
                "original_language": "en",
                "original_title": "Every Day",
                "overview": "16-year old Rhiannon falls in love with a mysterious spirit named “A” that inhabits a different body every day. Feeling an unmatched connection, Rhiannon and “A” work each day to find each other, not knowing what the next day will bring.",
                "popularity": 5.0264,
                "poster_path": "/4UnME3icxSspwL0UoGZNSyyp7Xs.jpg",
                "release_date": "2018-02-22",
                "title": "Every Day",
                "video": false,
                "vote_average": 7.252,
                "vote_count": 2262,
                "character": "Megan / A",
                "credit_id": "5a32fc3bc3a3680b9d192854",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/gPW90IPq6Go8hlT0n7Es3cFl7ly.jpg",
                "genre_ids": [
                    18,
                    10770,
                    80
                ],
                "id": 550776,
                "original_language": "en",
                "original_title": "Believe Me: The Abduction of Lisa McVey",
                "overview": "On the night she plans on taking her own life, 17-year-old 'Lisa McVey' is kidnapped and finds herself fighting to stay alive and manages to be a victim of rape. She manages to talk her attacker into releasing her, but when she returns home, no one believes her story except for one detective, who suspects she was abducted by a serial killer. Based on horrifying true events.",
                "popularity": 3.9513,
                "poster_path": "/qbJEzCzEKDHPZDiRvSSBiYEKaAH.jpg",
                "release_date": "2018-09-30",
                "title": "Believe Me: The Abduction of Lisa McVey",
                "video": false,
                "vote_average": 8.056,
                "vote_count": 654,
                "character": "Lisa McVey",
                "credit_id": "5baf25959251410ca300083e",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Katie E. Douglas",
            "کیتی داگلاس",
            "کِیتی داگلاس",
            "Kathryn Emily Douglas"
        ],
        "biography": "Kathryn Emily Douglas (born October 19, 1998) is a Canadian actress. She is best known for her role as Abby Littman in the Netflix series Ginny & Georgia and as Jackie Sullivan in Pretty Hard Cases.\n\nShe had her first starring role in Spooksville as Sally Wilcox for 22 episodes. Since then she has had other lead roles in film and tv series such as Believe Me: The Abduction of Lisa McVey, The Girl Who Escaped: The Kara Robinson Story, and Level 16.  Douglas began her screen acting career at the age of six in F2: Forensic Factor. Douglas later played Sally Wilcox on Discovery Family’s fantasy action TV show Spooksville in 2013, but it only lasted one season. Douglas starred as Young Irisa on the science fiction action TV series Defiance: The Lost Ones which premiered on SyFy in March 2014. At the age of 15, Douglas was nominated for Outstanding Performer in a Children’s Series at the 41st Daytime Creative Arts Emmy Awards held in Los Angeles in 2014, for her role as Sally Wilcox in Spooksville.\n\nDouglas starred as Naomi Malik from 2017 to 2019 in the Global Network Canadian comedy and drama TV series Mary Kills People, working alongside Caroline Dhavernas. Douglas played a lead role as Vivien on the Danishka Esterhazy directed 2018 science fiction movie Level 16.\n\nIn 2019, Douglas was the protagonist in the drama film Believe Me: The Abduction of Lisa McVey, which recounts the true story of Lisa McVey who was abducted and raped for 26 hours by serial killer Bobby Joe Long in 1984. Douglas received an ACTRA Award nomination for her performance, eventually losing out to Amybeth McNulty.\n\nIn 2021, she starred as Abby, a friend of Ginny and part of the MANG group (Max, Abby, Norah and Ginny) in the Netflix comedy series Ginny and Georgia, alongside Brianne Howey, Antonia Gentry, Sara Waisglass, and Chelsea Clark (actress). Douglas starred in a main role as 18-year-old Jackie Sullivan in the first two series of the CBC Television female police comedy-drama television series Pretty Hard Cases from 2021 to 2022.\n\nIn 2022, Douglas stars as Kate Coughlin in the Daniel Adams directed police protection film The Walk in a cast which includes Justin Chatwin, Terrence Howard and Malcolm McDowell.\n\nIn 2023, she was the titular role in the film The Girl Who Escaped: The Kara Robinson Story, which portrays the true story of how a 15 year-old girl survived the trauma of abduction, incarceration and sexual assault for over 18 hours, until an opportunity to escape transpired.",
        "birthday": "1998-10-19",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1183993,
        "imdb_id": "nm3353780",
        "known_for_department": "Acting",
        "name": "Katie Douglas",
        "place_of_birth": "Burlington, Ontario, Canada",
        "popularity": 1.0624,
        "profile_path": "/jM1dCWdjt7aVhhPPTKJuy8Snwwc.jpg"
    }
}