{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ubICMSUij3ntP9BjnQsV3rTVnAF.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 783,
                "original_language": "en",
                "original_title": "Gandhi",
                "overview": "In the early years of the 20th century, Mohandas K. Gandhi, a British-trained lawyer, forsakes all worldly possessions to take up the cause of Indian independence. Faced with armed resistance from the British government, Gandhi adopts a policy of 'passive resistance', endeavouring to win freedom for his people without resorting to bloodshed.",
                "popularity": 4.3456,
                "poster_path": "/rOXftt7SluxskrFrvU7qFJa5zeN.jpg",
                "release_date": "1982-12-01",
                "title": "Gandhi",
                "video": false,
                "vote_average": 7.557,
                "vote_count": 2390,
                "character": "Kasturba Gandhi",
                "credit_id": "52fe4275c3a36847f8020625",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "रोहिणी हट्टंगड़ी"
        ],
        "biography": "Rohini Hattangadi (born 11 April 1955) is an Indian actress of film, theatre and television. She has won two Filmfare Awards, one National Film Award, and is the only Indian actress to win the BAFTA Award for Best Actress in a Supporting Role for her performance as Kasturba Gandhi in Gandhi (1982). An alumna of the National School of Drama of New Delhi, Hattangadi had worked mainly in theatre when she made her movie debut with Arvind Desai Ki Ajeeb Dastaan in 1978. Some of her noted cinematic roles were in such art films as Arth (1982), Party and Saaransh (1984). Hattangadi was mostly offered character roles in mainstream Hindi cinema after her portrayal in Gandhi, often typecast in mother roles much ahead of her years. Respected for her acting prowess, she has appeared in over 80 feature films, and is active in theatre and television.\n\nDescription above from the Wikipedia article Rohini Hattangadi, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1955-04-11",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 11849,
        "imdb_id": "nm0368990",
        "known_for_department": "Acting",
        "name": "Rohini Hattangadi",
        "place_of_birth": "New Delhi, India",
        "popularity": 0.405,
        "profile_path": "/ApgSi1vZg0b0tl9ir3fERHhZUIU.jpg"
    }
}