{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/y2BDd5QoOn73qSISWrg29sJD82n.jpg",
                "genre_ids": [
                    35
                ],
                "id": 425134,
                "original_language": "en",
                "original_title": "How to Be a Latin Lover",
                "overview": "An aging Latin lover gets dumped by his sugar mama and must fend for himself in a harsh world.",
                "popularity": 3.8207,
                "poster_path": "/tjCDa24gNZGhpsFRhKnN9x83rTj.jpg",
                "release_date": "2017-03-06",
                "title": "How to Be a Latin Lover",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 636,
                "character": "Hotel Valet",
                "credit_id": "65eb4be294d8a8017b8ffe8c",
                "order": 22
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Jaime Aymerich\n\nBio\n\nHis TV credits include Golden Globes nominated 'Weeds', Primetime Emmy nominated 'Workaholics', and Amazon Prime's hit Emmy-nominated series 'Bosch'. Born and raised in Mexico City, Jaime is a graduate of the Academy of Dramatic Arts (Mexico).\n\nJaime's acting skills and personal dynamics have been evident since childhood. On a day off from school, he took off without thinking and visited Televisa San Angel, Mexico's largest TV station, and asked for a job as an actor, which he got straight away. He went on to receive several television roles in the early 1990s and made a name for himself. He then pursued his acting career in theatre, earning many awards from the Dramatic Arts Center in Mexico. On stage, he starred in plays like \"El Tintero\" (The Inkman), \"El Fin\" (The End), \"Quiero Vivir\" (I Want to Live), and many others. Jaime further developed his acting career in sketch-comedy theatre in Mexico, receiving more awards from the Comedians' House.\n\nHe moved to Los Angeles to pursue his acting career and soon landed roles both in film and television. Jaime's first critically praised television performance was of his portrayal of a young Mexican Character \"Daniel\" in an American Soap Opera Acapulco Bay, a Televisa-Fox production. Jaime made his film debut in A Beautiful Secret sharing the screen with Golden Globe and Academy Award winner Katy Jurado. This film earned 11 prizes in several international festivals, marking a new level of success for Mexican cinematography.\n\nFor the next few years, his work would range from the Showtime series Fat Actress with Kirstie Alley to portraying a Mexican President in the action drama The Last Ship by Michael Bay. Some of his TV credits include East Los High and Prime Time Glick with Martin Short. He recently shot How to Be a Latin Lover with Salma Hayek and Raquel Welsh.\n\nWidely known within the Latin community, he stars in many Telenovelas like Amar de Nuevo, Historias de la Virgen Morena, La llamada, and El Poeta del Pueblo for Univision. Jaime is in the number one show of NBC / Telemundo - \"Betty en New York\" where he portrays the role of Charlie.\n\nHe performed as Jorge in \"The Laundromat\" directed by the Oscar winner Steven Soderberg; where he acts with Meryl Streep, Gary Oldman, and Antonio Banderas.\n\nHe portrayed the character of \"Satan\" in the series \"The Daughter of God\" written by successful writer Enrique Torres.\n\nJaime shot in Cancun the TV project where he was giving life to \"Pato\" in the Jeff Valdez show for HBO \"The Garcias\".\n\nJaime has done many animated series and movies giving his voice to different characters in projects like Bojack Horseman, Beverly Hills Chihuahua, Astroboy, Early Man, Little Rooster's Egg-cellent Adventure, etc.\n\nHe started his career as an Executive Producer with the Emmy Winner Netflix Show \"Julie and The Phantoms\" and is a partner of Aymerich Entertainment making Movies and TV Series in Hollywood and Latin America.\n\nJaime Aymerich stars in the movie \"Lo que Diga el Corazon\" the story of a father who dedicates his entire life to his autistic son, but suddenly faces an enormous challenge.\n\nJaime is currently filming the movie “Una Pareja de 4”, a comedy of affairs with a positive message to couples.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.jaimeaymerich.org",
        "id": 1184093,
        "imdb_id": "nm1198888",
        "known_for_department": "Acting",
        "name": "Jaime Aymerich",
        "place_of_birth": "Mexico City, Distrito Federal, Mexico",
        "popularity": 0.1436,
        "profile_path": "/A2zcuIun4c0IkopLcfcm04BjJD1.jpg"
    }
}