{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/a3eYLIK5eYSHAJTtOy9PdciVjxx.jpg",
                "genre_ids": [
                    18
                ],
                "id": 28580,
                "original_language": "en",
                "original_title": "The Lost Weekend",
                "overview": "Don Birnam, a long-time alcoholic, has been sober for ten days and appears to be over the worst... but his craving has just become more insidious. Evading a country weekend planned by his brother and girlfriend, he begins a four-day bender that just might be his last - one way or another.",
                "popularity": 2.7569,
                "poster_path": "/8ggIOoCzt8xT2ePl8DdlRtXgcOh.jpg",
                "release_date": "1945-11-29",
                "title": "The Lost Weekend",
                "video": false,
                "vote_average": 7.628,
                "vote_count": 629,
                "character": "Woman Before Pawn Shop (uncredited)",
                "credit_id": "55e735b39251416c22000360",
                "order": 57
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Isobel Withers",
            "Isabelle Withers"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nIsabel Withers (January 20, 1896 – September 3, 1968) was an American actress, who worked in theatre, film and television.\n\nIn her youth, Withers lived in Coffeyville, Kansas and Illinois. She attended school in Kansas City, Missouri. She later enrolled in a school of drama in Kansas City and joined a Chautauqua circuit repertoire company. At the time it was playing in Billings, Montana performing The Melting Pot, a play by Israel Zangwill. Following a route of tented colleges, Withers first appeared on the road in Little Women. She played the leading role in The Tailor Made Man after a season in stock theatre in Utica, New York. She performed in Cappy Ricks in Chicago.\n\nGeorge M. Cohan selected Withers for the lead feminine role, with Lowell Sherman, in the Chicago company of The Tavern. In New York City she appeared in Kempy at the Belmont Theater. While in New York Withers modeled for an exclusive gown shop during the day. Henry Duffy wired her to come to San Francisco, California to do Kempy just as she was on her way to visit her mother in Los Angeles. She made her way south acting in Love Em and Leave 'Em and Rain. Withers starred in Rain at the old Orpheum Theater, 12th Street, San Francisco, California, in November 1926. Drawing comparisons to actress Jeanne Eagels, she drew praise in the role of Sadie Thompson.\n\nWithers accumulated ninety-two screen and television credits, beginning with a role in the movie The Hot Spot (1931). Many of her screen appearances were uncredited parts. She was also in her share of B-movies. Two memorable movies in which she had uncredited parts were The Babe Ruth Story (1948) and Monkey Business (1952).\n\nShe performed on television during the 1950s in such shows as Four Star Playhouse (1955), Lassie (1956), The Millionaire (1957), and The Bob Cummings Show (1958).\n\nIsabel Withers died in 1968 in Hollywood, California, aged 72.",
        "birthday": "1896-01-20",
        "deathday": "1968-09-03",
        "gender": 1,
        "homepage": null,
        "id": 1185019,
        "imdb_id": "nm0936729",
        "known_for_department": "Acting",
        "name": "Isabel Withers",
        "place_of_birth": "Frankton, Indiana, USA",
        "popularity": 0.1138,
        "profile_path": null
    }
}