{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8rBBojmT5vwkuVh2hFWBkbWtlBX.jpg",
                "genre_ids": [
                    36,
                    18
                ],
                "id": 10139,
                "original_language": "en",
                "original_title": "Milk",
                "overview": "The true story of Harvey Milk, the first openly gay man ever elected to public office. In San Francisco in the late 1970s, Harvey Milk becomes an activist for gay rights and inspires others to join him in his fight for equal rights that should be available to all Americans.",
                "popularity": 4.1614,
                "poster_path": "/ot4ImF4b7QbS6XsTdMH3pWxNmX2.jpg",
                "release_date": "2008-11-05",
                "title": "Milk",
                "video": false,
                "vote_average": 7.239,
                "vote_count": 2294,
                "character": "Self (archive footage)",
                "credit_id": "62018d8da24232001b036f59",
                "order": 29
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Anita Jane Bryant"
        ],
        "biography": "Anita Jane Bryant (March 25, 1940 – December 16, 2024) was an American singer and political activist, known for anti-gay activism. She had three Top 20 hits in the United States in the early 1960s. She was the 1958 Miss Oklahoma beauty pageant winner, and a brand ambassador from 1969 to 1980 for the Florida Citrus Commission.\n\nIn the 1970s, Bryant became known as an outspoken opponent of gay rights in the U.S. In 1977, she ran the \"Save Our Children\" campaign to repeal a local ordinance in Miami-Dade County, Florida, that prohibited discrimination on the basis of sexual orientation. Her involvement with the campaign was condemned by gay rights activists. They were assisted by many other prominent figures in music, film, and television, and retaliated by boycotting the orange juice that she promoted. Though the campaign ended successfully with a 69% majority vote to repeal the ordinance on June 7, 1977 (Dade County restored the ordinance in 1998), it permanently damaged her public image, and her contract with the Florida Citrus Commission was terminated three years later. This, as well as her later divorce from Bob Green, damaged her financially. Bryant never regained her former prominence and filed for bankruptcy twice. She lives in her home state of Oklahoma, runs the Oklahoma City-based Anita Bryant Ministries International, and works with a host of charities and non-profits.",
        "birthday": "1940-03-25",
        "deathday": "2024-12-16",
        "gender": 1,
        "homepage": null,
        "id": 1185117,
        "imdb_id": "nm0117039",
        "known_for_department": "Acting",
        "name": "Anita Bryant",
        "place_of_birth": "Barnsdall, Oklahoma, USA",
        "popularity": 0.1098,
        "profile_path": "/yeykDpdyyZzHcqMVT7hfcYAc6g0.jpg"
    }
}