{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bYimqNnizPUCnL5HOdoCW02IGmH.jpg",
                "genre_ids": [
                    18,
                    35,
                    10749
                ],
                "id": 74643,
                "original_language": "fr",
                "original_title": "The Artist",
                "overview": "Hollywood, 1927: As silent movie star George Valentin wonders if the arrival of talking pictures will cause him to fade into oblivion, he sparks with Peppy Miller, a young dancer set for a big break.",
                "popularity": 3.1239,
                "poster_path": "/z68py0ZqPgeacGPG54AGVRbNBS7.jpg",
                "release_date": "2011-10-12",
                "title": "The Artist",
                "video": false,
                "vote_average": 7.45,
                "vote_count": 3366,
                "character": "Restaurant Manager (uncredited)",
                "credit_id": "575c3a44c3a36810a4000dbc",
                "order": 56
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Vincent de Paul",
            " Vincent DePaul ",
            "Vincent Depaul"
        ],
        "biography": "Vincent De Paul was born in Baltimore, Maryland. His father was a mortuary scientist and owned funeral homes in Maryland. His mother, a Maryland socialite, dedicated her time to Chairing committees for the March of Dimes, Children with Birth Defects and Relief to Earthquake victims in Naples. De Paul's acting career began with his first role as Beowolf, in one of the oldest Scandinavian epics. De Paul is a Miami, New York, Los Angeles bi-coastal film and television actor. He's been in the entertainment industry for more than 15 years. After graduating from Johns Hopkins University in Baltimore Maryland (Studying Epidemiology, Biomedical ethics and Bio statistics), Vincent De Paul moved to Miami Beach to work at Mt. Sinai Medical Center. While working at the Miami Beach Hospital he was discovered and began doing fashion shows for the late Gianni Versace . www.vincentdepaul1.com Represented by Wilhelmina Creative, Vincent has worked internationally and has appeared, and been interviewed in, numerous magazines including, GQ, Vogue (Spain), Cosmopolitan (Greece, Spain, Poland, Russia) 8 covers of  Men's Health (Peru, Ecuador, USA  edicion en  Espanol, Mexico, & Columbia), Men's Exercise, Vanidades, Complot and Metrosource magazine. Vincent has been featured in the following Campaigns worldwide, L'Oreal (France) w/Stephanie Seymour directed by  Patrick  Dermachelier, El Corte Inglese (Spain with Ricky Martin, Christian  Dior (Latin America) Oscar  De la Renta (Mexico) and FUJI (Mexico) Avon Campaign USA, Guy La Roche Campaign (USA & Canada). His film career spans more than a decade. The first feature film was Hairspray in which he played one of the original Corny Collins Dancers (Dir. John  Waters), Riding in Cars with Boys with Drew  Barrymore as a Line Backer directed by Penny Marshall. His TV career includes  appearances on West Wing, Frasier, Charmed, Sex in the City, HBO's Six Feet Under as a  Hollywood  junkie snorting the ashes of his best friend, and most recently appeared on NBC's Medical Investigation.  He has re-occurred for the last 4 years on As The World Turns as  Charlie the Bartender at the Metro. He has served on the Audrey Hepburn Red Rose Award committee with Sean Hepburn Ferrar.  He volunteers his time at the House of Camillus for battered  women.",
        "birthday": "1968-09-02",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.backstage.com/u/vincent-de-paul/",
        "id": 1185725,
        "imdb_id": "nm0210885",
        "known_for_department": "Acting",
        "name": "Vincent De Paul",
        "place_of_birth": "Baltimore, Maryland, USA",
        "popularity": 0.138,
        "profile_path": "/rXtyNgYJQojb8zzBBK07xGNil59.jpg"
    }
}