{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cq9N64ucEtfIc3eMxNr1VzY9LH9.jpg",
                "genre_ids": [
                    18
                ],
                "id": 37799,
                "original_language": "en",
                "original_title": "The Social Network",
                "overview": "In 2003, Harvard undergrad and computer programmer Mark Zuckerberg begins work on a new concept that eventually turns into the global social network known as Facebook. Six years later, Mark is one of the youngest billionaires ever, but his unprecedented success leads to both personal and legal complications when he ends up on the receiving end of two lawsuits, one involving his former friend.",
                "popularity": 8.1277,
                "poster_path": "/n0ybibhJtQ5icDqTp8eRytcIHJx.jpg",
                "release_date": "2010-10-01",
                "title": "The Social Network",
                "video": false,
                "vote_average": 7.37,
                "vote_count": 12636,
                "character": "Alice Cantwel",
                "credit_id": "52fe466f9251416c910546cf",
                "order": 48
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Malese Jow",
            "Elizabeth Melise Jow",
            "マレス・ジョー"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nMalese Jow (born Elizabeth Melise Jow; February 18, 1991) is an American actress and singer-songwriter. As an actress, she is known for her roles as Geena Fabiano on the Nickelodeon sitcom Unfabulous and Lucy Stone on the Nickelodeon musical sitcom Big Time Rush and as Anna, a teenage vampire on The CW's fantasy drama The Vampire Diaries. She starred as Julia Yeung in the short-lived CW science fiction romantic drama Star-Crossed. She also was cast in the recurring role of Linda Park in The CW series The Flash.\n\nDescription above from the Wikipedia Malese Jow licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1991-02-18",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 118544,
        "imdb_id": "nm1679802",
        "known_for_department": "Acting",
        "name": "Melise",
        "place_of_birth": "Tulsa, Oklahoma, USA",
        "popularity": 0.7686,
        "profile_path": "/1USFrxT2872quJ0KGUUs2Zur3fl.jpg"
    }
}