{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rjXK74vrvmFMN0vuFw3TViZ18Ha.jpg",
                "genre_ids": [
                    16,
                    10749,
                    12,
                    18,
                    14
                ],
                "id": 204436,
                "original_language": "fr",
                "original_title": "Jack et la mécanique du cœur",
                "overview": "In Scotland 1874, Jack is born on the coldest day ever. Because of the extreme cold, his heart stops beating. The responsible midwife in Edinburgh finds a way to save him by replacing his heart with a clock. So he lives and remains under the midwife's protective care. But he must not get angry or excited because that endangers his life by causing his clock to stop working. Worse than that, when he grows up, he has to face the fact he cannot fall in love because that too could stop his delicate heart.",
                "popularity": 2.3149,
                "poster_path": "/ZSrU2mvlzM5Jr30XtKCU1fziIj.jpg",
                "release_date": "2014-02-05",
                "title": "Jack and the Cuckoo-Clock Heart",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 738,
                "character": "Joe (voice)",
                "credit_id": "52fe4cf4c3a368484e1ced79",
                "order": 2
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/ls3wjiOmWk8FAcfSqVrwPGpMzxR.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 434616,
                "original_language": "fr",
                "original_title": "Patients",
                "overview": "After a serious sport accident in a swimming pool, Ben, now an incomplete quadriplegic, arrives in a rehabilitation center. He meets with other handicapped persons (tetraplegics, paraplegics, traumatized crania), all victims of accidents, as well as a handicapped since his early childhood. They go through impotence, despair and resignation, with their daily struggle to learn how to move a finger or to hold a fork. Some of them slowly find a little mobility while others receive the verdict of the handicap for life. Despite everything, hope and friendship help them endure their difficulties.",
                "popularity": 1.1293,
                "poster_path": "/sv2Xdpk4nzY2qKAg5oG2qZkTrY9.jpg",
                "release_date": "2017-03-01",
                "title": "Patients",
                "video": false,
                "vote_average": 7.441,
                "vote_count": 617,
                "credit_id": "58775e81c3a36850f20059d6",
                "department": "Directing",
                "job": "Director"
            },
            {
                "adult": false,
                "backdrop_path": "/ls3wjiOmWk8FAcfSqVrwPGpMzxR.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 434616,
                "original_language": "fr",
                "original_title": "Patients",
                "overview": "After a serious sport accident in a swimming pool, Ben, now an incomplete quadriplegic, arrives in a rehabilitation center. He meets with other handicapped persons (tetraplegics, paraplegics, traumatized crania), all victims of accidents, as well as a handicapped since his early childhood. They go through impotence, despair and resignation, with their daily struggle to learn how to move a finger or to hold a fork. Some of them slowly find a little mobility while others receive the verdict of the handicap for life. Despite everything, hope and friendship help them endure their difficulties.",
                "popularity": 1.1293,
                "poster_path": "/sv2Xdpk4nzY2qKAg5oG2qZkTrY9.jpg",
                "release_date": "2017-03-01",
                "title": "Patients",
                "video": false,
                "vote_average": 7.441,
                "vote_count": 617,
                "credit_id": "5a8d528a0e0a267c68005e69",
                "department": "Writing",
                "job": "Writer"
            },
            {
                "adult": false,
                "backdrop_path": "/9LyPD0Kk0xfEcT8iydKDm2xYyGS.jpg",
                "genre_ids": [
                    18,
                    35,
                    10751
                ],
                "id": 587301,
                "original_language": "fr",
                "original_title": "La Vie scolaire",
                "overview": "In one of the poorest areas of Paris, a school counselor devotes herself to working with disadvantaged students, while facing challenges of her own.",
                "popularity": 10.5034,
                "poster_path": "/m0EmaEJmB02iIBA1YWQZGYVLBjA.jpg",
                "release_date": "2019-08-28",
                "title": "School Life",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 790,
                "credit_id": "5c854c2cc3a36813c2d1153a",
                "department": "Directing",
                "job": "Director"
            },
            {
                "adult": false,
                "backdrop_path": "/9LyPD0Kk0xfEcT8iydKDm2xYyGS.jpg",
                "genre_ids": [
                    18,
                    35,
                    10751
                ],
                "id": 587301,
                "original_language": "fr",
                "original_title": "La Vie scolaire",
                "overview": "In one of the poorest areas of Paris, a school counselor devotes herself to working with disadvantaged students, while facing challenges of her own.",
                "popularity": 10.5034,
                "poster_path": "/m0EmaEJmB02iIBA1YWQZGYVLBjA.jpg",
                "release_date": "2019-08-28",
                "title": "School Life",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 790,
                "credit_id": "5d6d7531efcea959189a8432",
                "department": "Writing",
                "job": "Screenplay"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Fabien Marsaud"
        ],
        "biography": "Fabien Marsaud (born 31 July 1977), known professionally as Grand Corps Malade (GCM), is a French slam poet and lyricist. He has released seven studio albums so far, all of them reaching top-five status on the French SNEP chart. GCM started writing and performing a capella at slam events in 2003. Three years later, he signed with Universal's AZ affiliate and released his debut album Midi 20, which became a top-ten selling record of the year in France.\n\nGrand Corps Malade's follow-up album, Enfant de la ville (2008), and third album 3ème temps (2010), were less successful commercially. In 2013, he released his family-inspired Funambule album, while Il nous restera ça (2015) featured 11 collaborations with other musicians. His sixth album, Plan B (2018), reached number two on the SNEP album chart. In 2020, he released Mesdames (Ladies), featuring ten duets with women, which topped the French charts. Its lead single, \"Mais je t'aime\" (But I love you), a duet with Camille Lellouche, became his highest-ranking song on the French singles chart.\n\nGCM's accolades include three Victories of Music awarded by the French Ministry of Culture. His stage name means \"tall, sick body\" in French, a reference to his height (nearly 6'4\" or 1.94m) and to a spinal injury that forces him to walk with a crutch, due to a diving accident in 1997 that initially led doctors to tell him he would never walk again.\n\nMarsaud was born on 31 July 1977 in Le Blanc-Mesnil, Seine-Saint-Denis. His mother was a librarian. His father, Jacques Marsaud, was a regional civil servant, a general commune secretary in Noisy-le-Sec and Saint-Denis, later on a director general of services at Val-de-Marne's departmental council and then at the Plaine Commune agglomeration community (fr: EPT). The family lived in Saint-Denis. Marsaud excelled in his classes, particularly in literary courses; he wrote his first works aged 14–15. But sports won out, and at one point he was simultaneously part of tennis, athletics and basketball clubs; the latter would become his greatest passion. At 17, he was offered a chance to join the training center in Toulouse, but preferred to stay in Saint-Denis. After playing in JSF Nanterre and in Saint-Denis, Marsaud signed with a third-division-level team in Aubervilliers. He earned a DEUG degree, majoring in physical education.\n\nIn July 1997, during a sports camp where Marsaud was a supervisor, a diving accident in a swimming pool caused him to displace his spine; he was later told he would never walk again. However, in 1999, after a year of intensive treatment, he regained the ability to walk, although he usually has to use a crutch or cane. Marsaud continued studying and earned a DESS master's degree in sport management. He worked in marketing for the Stade de France between 2001 and 2005, but became disillusioned with the job. ...\n\nSource: Article \"Grand Corps Malade\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1977-07-31",
        "deathday": null,
        "gender": 2,
        "homepage": "https://grandcorpsmalade.fr",
        "id": 1186858,
        "imdb_id": "nm2120560",
        "known_for_department": "Acting",
        "name": "Grand Corps Malade",
        "place_of_birth": "Le Blanc-Mesnil, Seine-Saint-Denis, France",
        "popularity": 0.1287,
        "profile_path": "/nRyknEQkvfnwEVnOyQNeGC9u3GY.jpg"
    }
}