{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3CcO4QdasRCitq2dczOpx7CXgLM.jpg",
                "genre_ids": [
                    10751,
                    12,
                    18
                ],
                "id": 12837,
                "original_language": "en",
                "original_title": "The Secret Life of Bees",
                "overview": "Set in South Carolina in 1964, this is the tale of Lily Owens a 14 year-old girl who is haunted by the memory of her late mother. To escape her lonely life and troubled relationship with her father, Lily flees with Rosaleen, her caregiver and only friend, to a South Carolina town that holds the secret to her mother's past.",
                "popularity": 4.0251,
                "poster_path": "/m1LGEeoYfc6crbfG8WmTKg9SVqL.jpg",
                "release_date": "2008-09-17",
                "title": "The Secret Life of Bees",
                "video": false,
                "vote_average": 7.478,
                "vote_count": 548,
                "character": "Sugar Girl",
                "credit_id": "5f70b0b035039800378d2c19",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Jasmine Burke is an award-winning American Actress, Filmmaker, Singer, Author from Atlanta, Georgia. Attended Kennesaw State University on full scholarship as well as Harvard University. Jasmine grew up in musical theatre, performing in a myriad of stage productions at esteemed playhouses. Curious what film and television had to offer she transitioned enjoying feature roles in; The Secret Life of Bees, Tyler Perry's Meet The Browns, Army Wives, Ride Along, The Vampire Diaries, to name a few. After years of head work, Jasmine landed series regular roles in Bounce TV's #1 series Saints and Sinners playing the beautiful and mischievous Dr. Christie, and in Fox's hit series Star playing the lovable salon stylist Danielle. Jasmine continues to grow starring in the BET's romcom Angrily Ever After as well as starring in and producing TvOne's Skinned.\n\nExercising her many talents, in 2009 Jasmine wrote, executive produced and directed her first film, a comedy, Lucky Lotto. Lucky Lotto went on to become a winner at the 2010 Women in Film and Television International Short Film Showcase. Jasmine also won an achievement for directing Lucky Lotto at the 2010 WIFTA's.\n\nJasmine's philanthropy extends to global organizations such as The Boys&Girls Club of America, Girls Inc., The Miss Black Teen Atlanta Scholarship Pageant, C.A.S.A (Court Appointed Special Advocate), 500 Songs for Kids.",
        "birthday": "1983-08-13",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1187060,
        "imdb_id": "nm2532727",
        "known_for_department": "Acting",
        "name": "Jasmine Burke",
        "place_of_birth": "Atlanta, Georgia, USA",
        "popularity": 0.0993,
        "profile_path": "/tsq2fy9aUfUQdQvVtxUuDycaYtP.jpg"
    }
}