{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qxTw8OKJLRX1Xb5nR5CcIDnLKoq.jpg",
                "genre_ids": [
                    18,
                    53,
                    27
                ],
                "id": 44214,
                "original_language": "en",
                "original_title": "Black Swan",
                "overview": "The story of Nina, a ballerina in a New York City ballet company whose life, like all those in her profession, is completely consumed with dance. She lives with her retired ballerina mother Erica who zealously supports her daughter's professional ambition. When artistic director Thomas Leroy decides to replace prima ballerina Beth MacIntyre for the opening production of their new season, Swan Lake, Nina is his first choice.",
                "popularity": 7.3213,
                "poster_path": "/viWheBd44bouiLCHgNMvahLThqx.jpg",
                "release_date": "2010-12-03",
                "title": "Black Swan",
                "video": false,
                "vote_average": 7.688,
                "vote_count": 15010,
                "character": "Administrator Susie",
                "credit_id": "52fe467ec3a36847f8102179",
                "order": 19
            },
            {
                "adult": false,
                "backdrop_path": "/feQvRl67oc4AOWN4LhAwkrMWdX4.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 664300,
                "original_language": "en",
                "original_title": "Shiva Baby",
                "overview": "College student Danielle must cover her tracks when she unexpectedly runs into her sugar daddy at a shiva - with her parents, ex-girlfriend and family friends also in attendance.",
                "popularity": 2.3727,
                "poster_path": "/4sdqVsT6SHqtbCYZS7bhVoEftlL.jpg",
                "release_date": "2021-03-26",
                "title": "Shiva Baby",
                "video": false,
                "vote_average": 7.139,
                "vote_count": 705,
                "character": "Ellie",
                "credit_id": "5f3a6e6e22df2e00365e8275",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Offner was born in New York City in 1959. Her father was Mortimer Offner, a photographer, screenwriter, and TV and theatre director. He wrote many of Katharine Hepburn's early films, but he was blacklisted. Her mother, Pauline, was a photography editor and worked for the first medical photography journal Scope. She went to Sarah Lawrence College and NYU School of the Arts, and after graduating she continued to work in theatre on and off Broadway. She has since appeared in Act One at the Lincoln Center, and in film and television on Orange Is the New Black and in the comedy Top Five.\n\nShe also appeared in several Jonathan Kaplan films and TV series, including Project X, Immediate Family, Unlawful Entry, Love Field, ER and Law & Order: Special Victims Unit.\n\nDescription above from the Wikipedia article Deborah Offner, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1959-08-07",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 11872,
        "imdb_id": "nm0644418",
        "known_for_department": "Acting",
        "name": "Deborah Offner",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.1533,
        "profile_path": "/o4Pvhl0yG3mS3nVj9CEGoOuPjtc.jpg"
    }
}