{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xkaeirZBfs9nfz2TJoFHxyOLCcC.jpg",
                "genre_ids": [
                    18
                ],
                "id": 22683,
                "original_language": "en",
                "original_title": "Gifted Hands: The Ben Carson Story",
                "overview": "Gifted Hands: The Ben Carson Story is a movie based on the life story of world-renowned neurosurgeon Ben Carson from 1961 to 1987.",
                "popularity": 7.4794,
                "poster_path": "/4NxxtiqezjUmUxoDTOjO5FeJvFt.jpg",
                "release_date": "2009-02-07",
                "title": "Gifted Hands: The Ben Carson Story",
                "video": false,
                "vote_average": 7.8,
                "vote_count": 744,
                "character": "Psychiatrist",
                "credit_id": "5f32436b8ed03f0036f45967",
                "order": 24
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "John Hoogenaker",
            "John Winters Krass"
        ],
        "biography": "In 2021, acclaimed actor John Hoogenakker can be seen starring in Hulu's limited series \"Dopesick\" opposite Michael Keaton, Peter Sarsgaard, Kaitlyn Dever, and Rosario Dawson. Inspired by the New York Times bestselling book by Beth Macy, \"Dopesick\" takes viewers to the epicenter of America's struggle with opioid addiction, from the boardrooms of Purdue Pharma, to a distressed Virginia mining community, and to the hallways of the DEA. Hoogenakker shines as Randy Ramseyer, an assistant US Attorney prosecuting the infamous and ongoing Purdue Pharma case. \"Dopesick\" is slated to premiere in October 2021. In addition to \"Dopesick,\" Hoogenakker most recently recurred on the Hulu mystery series \"Castle Rock\" as Carl Wilkes, opposite Lizzy Caplan. He is perhaps best known however, for his role as black-ops CIA operator Matice in the hit Amazon series \"Tom Clancy's Jack Ryan\" opposite John Krasinski and Wendell Pierce. Additional credits include: \"A Very Harold and Kumar Christmas,\" \"Public Enemies\" opposite Marion Cotillard and Christian Bale, USA's \"Colony,\" STARZ's \"The Girlfriend Experience,\" and Fox's \"Empire,\" to name a few. Born and raised in Charlotte, North Carolina, Hoogenakker became an actor at an early age. As a two-time state and district high school debate champion in Humorous Interpretation, Hoogenakker went on to attend The Theatre School at DePaul University, in Chicago. He found his calling on stage, appearing in many of the city's illustrious houses including The Goodman, Writers' Theatre, Court Theatre, Chicago Shakespeare Theater, and the renowned Steppenwolf Garage. His varied stage work ranges from Chris Smith in Tracy Letts' Killer Joe to the role of Hamlet at The Illinois Shakespeare Festival. At the Brooklyn Academy of Music in New York, he received excellent reviews as the tragic alcohol-addled Willie Oban in the acclaimed remounting of \"The Iceman Cometh,\" alongside Nathan Lane and Brian Dennehy. One of his first on-camera credits came in the 2006 feature \"Flags of Our Fathers,\" under the esteemed direction of Clint Eastwood. While Hoogenakker holds an illustrious resume in film and TV, he has also appeared in millions of homes across the country on the commercial front. From Pepsi/NASCAR, Baskin-Robbins, Avocados of Mexico, Hyundai, to voicing campaigns for McDonald's, BMO Harris, Nintendo, Tyson and Sears, and even working with Robert De Niro for Santander, Hoogenakker has had a lucrative career commercially. His work as the Bud Light King helped introduce the nonsensical phrase 'Dilly Dilly' into the cultural lexicon, and he has been seen most recently with his sidekick Walter the cat, for Chevy. When Hoogenakker is not on sets around the world, he enjoys spending time with his family and being outside as much as possible.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1188193,
        "imdb_id": "nm2139624",
        "known_for_department": "Acting",
        "name": "John Hoogenakker",
        "place_of_birth": "Charlotte, North Carolina, USA",
        "popularity": 0.5295,
        "profile_path": "/wjA5d3Mcv0uqwQqKqEKbQtF7BuH.jpg"
    }
}