{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wMzToVniA09xWS0DXSRQiufVvpZ.jpg",
                "genre_ids": [
                    28,
                    16,
                    12,
                    35
                ],
                "id": 374205,
                "original_language": "ja",
                "original_title": "ワンピース　フィルム GOLD",
                "overview": "The glittering Gran Tesoro, a city of entertainment beyond the laws of the government, is a sanctuary for the world’s most infamous pirates, Marines, and filthy rich millionaires. Drawn by dreams of hitting the jackpot, Captain Luffy and his crew sail straight for the gold. But behind the gilded curtains lies a powerful king whose deep pockets and deeper ambitions spell disaster for the Straw Hats and the New World alike.",
                "popularity": 2.901,
                "poster_path": "/9PgiOFTLZXP7emlwcIt0yRasJ9h.jpg",
                "release_date": "2016-07-23",
                "title": "One Piece Film: GOLD",
                "video": false,
                "vote_average": 7.225,
                "vote_count": 507,
                "character": "Raise Max (voice)",
                "credit_id": "587faa82c3a36854f2001f01",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Kin'ya Kitaôji",
            "키타오지 킨야"
        ],
        "biography": "Early life:\n\nHe was born in Kyoto, son of jidaigeki film star Ichikawa Utaemon, and graduated from Waseda University School of Letters, Arts and Sciences Ⅱ in Tokyo.\n\nActing career:\n\nKin'ya made his debut with his father in the 1956 Toei film Oyakodaka in the role of Katsu Kaishū. He is a contemporary of, and was taken to be a rival of, Hiroki Matsukata, who was also the son of a famous actor (Jūshirō Konoe). In 1964, Kin'ya made his first appearance on stage in Cyrano de Bergerac.\n\nThe 1960s and 1970s saw him in many contemporary roles. He appeared in Battles Without Honor and Humanity: Deadly Fight in Hiroshima and Battles Without Honor and Humanity: Final Episode as well as Karei naru Ichizoku. The title role in the 1975 film Takehisa Yumeji was his.\n\nOn television, Kitaōji portrayed Miyamoto Musashi in the Nippon Television show of the same name. A major historical role was Sakamoto Ryōma in the year-long prime-time NHK Taiga drama Ryōma ga Yuku (1968). He landed the title role in the long-running cop show Zenigata Heiji, set in the Edo period. In the 1985 twelve-hour New Year special Fūun Yagyū Bugeichō, he played Yagyū Jūbei, and in the following year's special, he portrayed both Tokugawa Yoshimune and Yagyū Shinrokurō. The role of another shogun fell to him in the following new year as TV Tokyo tapped him to play Tokugawa Iemitsu. Kin'ya returned to NHK for the 1987 Taiga drama Dokuganryū Masamune as Date Terumune, father of title character Date Masamune.\n\nAnother role he took had been created by his father. Saotome Mondonosuke was the title character in the series Gozonji! Hatamoto Taikutsu Otoko. It ran from 1988 to 1994 on TV Asahi. His father, Ichikawa Utaemon, had appeared in numerous films as Mondonosuke.\n\nKin'ya reprised the part of Miyamoto Musashi in the 1990 New Year's special. Toshirō Mifune had portrayed Musashi in the earlier film, also based on the Eiji Yoshikawa story, that had won an Academy Award. He returned to the New Year's special in 1996, again as the famous swordsman, in Tokugawa Kengōden Sore kara no Musashi.\n\nHis first portrayal of Ōishi Kuranosuke was in the 1996 Chūshingura. He took up the role again in 2004 for the NHK Saigo no Chūshingura and in 2007, in the New Year special Chūshingura Yōzei-in no Inbō. Other historical roles from the Sengoku period include Azai Nagamasa, Saitō Dōsan, and Yamamoto Kansuke. In addition to historical parts, he appeared in fictional series. His portrayal of Ogami Ittō in the Lone Wolf and Cub ( Kozure 2) Which was a series for Asahi TV in Japan is representative of these appearances.\n\nIn 2008, Kitaōji revisited the role of Katsu Kaishū in the Taiga drama Atsuhime. He had portrayed Katsu in his 1956 debut.\n\nHe won the award for best actor at the 10th Hochi Film Award for Fire Festival and Haru no kane. Kitaōji played one of the lead roles in Hideo Nakata's psychological thriller film The Incite Mill.\n\nIn recent times, Kitaōji voices the Hokkaido-inu character of \"Father\" in SoftBank Mobile's White Family advertising campaign.",
        "birthday": "1943-02-23",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.horipro.co.jp/kitaoojikinya/",
        "id": 118982,
        "imdb_id": "nm0457586",
        "known_for_department": "Acting",
        "name": "Kinya Kitaoji",
        "place_of_birth": "Kyōto, Kyōto Prefecture, Japan",
        "popularity": 0.6588,
        "profile_path": "/dCm2nipPsxKqJv5fwVcaIBOFkTa.jpg"
    }
}