{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5BBwSVytssbFuSPZE4DtJVhROjN.jpg",
                "genre_ids": [
                    18,
                    53
                ],
                "id": 11878,
                "original_language": "ja",
                "original_title": "用心棒",
                "overview": "A nameless ronin, or samurai with no master, enters a small village in feudal Japan where two rival businessmen are struggling for control of the local gambling trade. Taking the name Sanjuro Kuwabatake, the ronin convinces both silk merchant Tazaemon and sake merchant Tokuemon to hire him as a personal bodyguard, then artfully sets in motion a full-scale gang war between the two ambitious and unscrupulous men.",
                "popularity": 4.3638,
                "poster_path": "/tN7kYPjRhDolpui9sc9Eq9n5b2O.jpg",
                "release_date": "1961-04-25",
                "title": "Yojimbo",
                "video": false,
                "vote_average": 8.092,
                "vote_count": 1573,
                "character": "First Samurai",
                "credit_id": "559054ee9251415a26001cd4",
                "order": 17
            },
            {
                "adult": false,
                "backdrop_path": "/nC3IjYhUgZWgfKfFX0ygMigFwgc.jpg",
                "genre_ids": [
                    28,
                    18,
                    36
                ],
                "id": 14537,
                "original_language": "ja",
                "original_title": "切腹",
                "overview": "Down-on-his-luck veteran Tsugumo Hanshirō enters the courtyard of the prosperous House of Iyi. Unemployed, and with no family, he hopes to find a place to commit seppuku—and a worthy second to deliver the coup de grâce in his suicide ritual. The senior counselor for the Iyi clan questions the ronin’s resolve and integrity, suspecting Hanshirō of seeking charity rather than an honorable end. What follows is a pair of interlocking stories which lay bare the difference between honor and respect, and promises to examine the legendary foundations of the Samurai code.",
                "popularity": 3.9948,
                "poster_path": "/5konZnIbcAxZjP616Cz5o9bKEfW.jpg",
                "release_date": "1962-09-15",
                "title": "Harakiri",
                "video": false,
                "vote_average": 8.433,
                "vote_count": 1114,
                "character": "Hayato Yazaki",
                "credit_id": "55d96f2ac3a36831fc003f8a",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Итиро Накатани"
        ],
        "biography": "Ichirō Nakatani (Japanese: 中谷 一郎, Hepburn: Nakatani Ichirō) was a Japanese actor. He attended Waseda University but withdrew before completing his degree and joining the Haiyuza Theatre Company. In 1959, Nakatani won Elan d'or Award for Newcomer of the Year. Nakatani was well known for his role as Ninja Kazaguruma no Yahichi in the jidaigeki drama Mito Kōmon.",
        "birthday": "1930-10-15",
        "deathday": "2004-04-01",
        "gender": 2,
        "homepage": null,
        "id": 118993,
        "imdb_id": "nm0368049",
        "known_for_department": "Acting",
        "name": "Ichirō Nakatani",
        "place_of_birth": "Sapporo, Hokkaido, Japan",
        "popularity": 0.2303,
        "profile_path": "/yGWAZguLnWvXW9xcAIE7Eo6VGfU.jpg"
    }
}