{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cLZxnkj75cGBK1tLTMyIudOZYZk.jpg",
                "genre_ids": [
                    99
                ],
                "id": 1777,
                "original_language": "en",
                "original_title": "Fahrenheit 9/11",
                "overview": "Michael Moore's view on how the Bush administration allegedly used the tragic events on 9/11 to push forward its agenda for unjust wars in Afghanistan and Iraq.",
                "popularity": 3.7204,
                "poster_path": "/1WQgOCJj22zF7Bsr0pIBgGBr71q.jpg",
                "release_date": "2004-06-25",
                "title": "Fahrenheit 9/11",
                "video": false,
                "vote_average": 7.084,
                "vote_count": 1460,
                "character": "Self (archive footage)",
                "credit_id": "52fe4314c3a36847f8038b6b",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Condoleezza \"Condi\" Rice",
            "Condi Rice",
            "康多莉扎·赖斯"
        ],
        "biography": "Condoleezza Rice (born November 14, 1954) is an American diplomat and political scientist who is the current director of the Hoover Institution at Stanford University. A member of the Republican Party, she previously served as the 66th United States secretary of state from 2005 to 2009 and as the 19th U.S. national security advisor from 2001 to 2005. Rice was the first female African-American secretary of state and the first woman to serve as national security advisor. Until the election of Barack Obama as president in 2008, Rice and her predecessor, Colin Powell, were the highest-ranking African Americans in the history of the federal executive branch (by virtue of the secretary of state standing fourth in the presidential line of succession). At the time of her appointment as Secretary of State, Rice was the highest-ranking woman in the history of the United States to be in the presidential line of succession.",
        "birthday": "1954-11-14",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1189929,
        "imdb_id": "nm1110666",
        "known_for_department": "Acting",
        "name": "Condoleezza Rice",
        "place_of_birth": "Birmingham, Alabama, USA",
        "popularity": 0.1203,
        "profile_path": "/66iXDVu5m64UfFMsBNyMK4BXY9d.jpg"
    }
}