{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/okAHapFqs7Gx9wI8avrMVXVRUzU.jpg",
                "genre_ids": [
                    18,
                    10752
                ],
                "id": 53457,
                "original_language": "fr",
                "original_title": "Elle s'appelait Sarah",
                "overview": "On the night of 16 July 1942, ten year old Sarah and her parents are being arrested and transported to the Velodrome d'Hiver in Paris where thousands of other jews are being sent to get deported. Sarah however managed to lock her little brother in a closet just before the police entered their apartment. Sixty years later, Julia Jarmond, an American journalist in Paris, gets the assignment to write an article about this raid, a black page in the history of France. She starts digging archives and through Sarah's file discovers a well kept secret about her own in-laws.",
                "popularity": 1.108,
                "poster_path": "/peGUaf6HrX7jSi1HifX64QJb7pm.jpg",
                "release_date": "2010-09-16",
                "title": "Sarah's Key",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 696,
                "character": "Mozart Cafe Waitress",
                "credit_id": "5eb2ae29bf0f63001d803dd2",
                "order": 50
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Alice St Clair-Erskine"
        ],
        "biography": "Lady Alice St Clair-Erskine (born 1989), also known by her stage name Alice St Clair, is an English actress known for playing Kate Middleton in William & Catherine: A Royal Romance and Flora Marshall in The Crimson Field.\n\nSt Clair was born in 1989, the eldest daughter of Peter St Clair-Erskine, 7th Earl of Rosslyn and Helen Watters. She was educated at Heathfield St Mary's School and Bedales School. St Clair is also a poet who works under the name of Alan Moon and a voice-over artist whose work includes Air B and B, BBC Radio 4's Homefront and BBC Radio 3's Words and Music.\n\nSt Clair spent her early years in Los Angeles, where she worked for Akiva Goldsman before moving to New York City and attending the New York Conservatory for Dramatic Arts on an acting scholarship. Her first film appearance was in 2010 in Sarah's Key.\n\nIn 2011, she appeared as Kate Middleton in the Hallmark Channel TV movie William & Catherine: A Royal Romance. In 2015, she played Flora Marshall in the BBC television drama series The Crimson Field. In 2018 St Clair starred as Catherine de Valois in The New Generation Festival's Henry V.\n\nSource: Article \"Alice St Clair\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1989-01-01",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1190988,
        "imdb_id": "nm4122818",
        "known_for_department": "Acting",
        "name": "Alice St. Clair",
        "place_of_birth": null,
        "popularity": 0.0764,
        "profile_path": "/s1Nyr5rsRYJxzQCaPRBjodZ2lwf.jpg"
    }
}