{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/n4S9IhJI3UTq5GQMFg7qwC3kcI3.jpg",
                "genre_ids": [
                    18,
                    9648
                ],
                "id": 37903,
                "original_language": "de",
                "original_title": "Das weiße Band - Eine deutsche Kindergeschichte",
                "overview": "An aged tailor recalls his life as the schoolteacher of a small village in Northern Germany that was struck by a series of strange events in the year leading up to WWI.",
                "popularity": 2.8708,
                "poster_path": "/54dlnGDexrwAFlDb8HWKfmmX4LB.jpg",
                "release_date": "2009-09-24",
                "title": "The White Ribbon",
                "video": false,
                "vote_average": 7.488,
                "vote_count": 1067,
                "character": "Eva",
                "credit_id": "52fe467c9251416c91055fd7",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/7RxhC2ntrglVl1nkKjAgNoO0XP.jpg",
                "genre_ids": [
                    18
                ],
                "id": 998022,
                "original_language": "de",
                "original_title": "Das Lehrerzimmer",
                "overview": "When one of her students is suspected of theft, teacher Carla Nowak decides to get to the bottom of the matter. Caught between her ideals and the school system, the consequences of her actions threaten to break her.",
                "popularity": 3.0872,
                "poster_path": "/kWXA6PfQ0PpZpoCXoeBFRciRrUw.jpg",
                "release_date": "2023-05-04",
                "title": "The Teachers' Lounge",
                "video": false,
                "vote_average": 7.234,
                "vote_count": 602,
                "character": "Carla Nowak",
                "credit_id": "62c9f5623d4d96005437a0a4",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Леони Бенеш",
            "Леоні Бенеш",
            "لیونی بنش"
        ],
        "biography": "Leonie Benesch (born April 22, 1991) is a German actress who has played roles in major productions including Babylon Berlin and The Crown, as well as Around the World in 80 Days. She is currently based in London.\n\nIn 2009, Benesch played the role of Eva in the film The White Ribbon, which won the Golden Palm. Film critics singled out her performance as \"a discovery\". She received the American \"Young Artist Award\" for her work, as well as a \"New Faces Award\". In 2010, she performed in Philip Koch's drama Picco and in Sophie Heldman's film Colors in the Dark (Satte Farben vor Schwarz), where she worked alongside Senta Berger and Bruno Ganz.\n\nIn 2017, Benesch performed in Babylon Berlin as Greta Overbeck, winning the \"German Acting Prize\". Benesch also performed in The Crown as the sister of Prince Philip, Princess Cecilie of Greece and Denmark. In 2020, she was cast in the BBC miniseries Around the World in 80 Days, alongside David Tennant as Phileas Fogg  and Ibrahim Koma as Passepartout.\n\nBenesch grew up in Tübingen, and attended the Freie Waldorfschule. She also attended the Guildhall School of Music and Drama in London. She is of French and Transylvanian descent.",
        "birthday": "1991-04-22",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 119065,
        "imdb_id": "nm2914059",
        "known_for_department": "Acting",
        "name": "Leonie Benesch",
        "place_of_birth": "Hamburg, Germany",
        "popularity": 1.1481,
        "profile_path": "/hIRRfgggHgz07HBLyEHVpCXldYX.jpg"
    }
}