{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/u218sykbUQIh6EWtTdJzguU5LcG.jpg",
                "genre_ids": [
                    18
                ],
                "id": 16858,
                "original_language": "en",
                "original_title": "All That Jazz",
                "overview": "Joe Gideon is at the top of the heap, one of the most successful directors and choreographers in musical theater. But he can feel his world slowly collapsing around him - his obsession with work has almost destroyed his personal life, and only his bottles of pills keep him going.",
                "popularity": 2.7853,
                "poster_path": "/culCEdj4srLljefgn4XKd6k3C5t.jpg",
                "release_date": "1979-12-16",
                "title": "All That Jazz",
                "video": false,
                "vote_average": 7.505,
                "vote_count": 544,
                "character": "Nurse Pierce",
                "credit_id": "61f1c6001ad93b00702a1ebe",
                "order": 50
            },
            {
                "adult": false,
                "backdrop_path": "/c7OeJd34rc9bI1DXqd4ucb1wVrf.jpg",
                "genre_ids": [
                    18,
                    36,
                    10752
                ],
                "id": 625,
                "original_language": "en",
                "original_title": "The Killing Fields",
                "overview": "New York Times reporter Sydney Schanberg is on assignment covering the Cambodian Civil War, with the help of local interpreter Dith Pran and American photojournalist Al Rockoff. When the U.S. Army pulls out amid escalating violence, Schanberg makes exit arrangements for Pran and his family. Pran, however, tells Schanberg he intends to stay in Cambodia to help cover the unfolding story — a decision he may regret as the Khmer Rouge rebels move in.",
                "popularity": 3.182,
                "poster_path": "/cX6Bv7natnZwQjsV9bLL8mmWjkS.jpg",
                "release_date": "1984-11-23",
                "title": "The Killing Fields",
                "video": false,
                "vote_average": 7.461,
                "vote_count": 781,
                "character": "Schanberg's Sister",
                "credit_id": "57f587769251413601000631",
                "order": 20
            },
            {
                "adult": false,
                "backdrop_path": "/3e3dVaVrla2GH6CWKbNRjTvk3s8.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 6844,
                "original_language": "en",
                "original_title": "The Ten Commandments",
                "overview": "Escaping death, a Hebrew infant is raised in a royal household to become a prince. Upon discovery of his true heritage, Moses embarks on a personal quest to reclaim his destiny as the leader and liberator of the Hebrew people.",
                "popularity": 10.66,
                "poster_path": "/3Ei59AR64x6dMZfWobPCkZjbqTL.jpg",
                "release_date": "1956-10-05",
                "title": "The Ten Commandments",
                "video": false,
                "vote_average": 7.769,
                "vote_count": 1743,
                "character": "Jethro's Daughter",
                "credit_id": "58aca6ddc3a3686f0d000569",
                "order": 24
            },
            {
                "adult": false,
                "backdrop_path": "/okAHapFqs7Gx9wI8avrMVXVRUzU.jpg",
                "genre_ids": [
                    18,
                    10752
                ],
                "id": 53457,
                "original_language": "fr",
                "original_title": "Elle s'appelait Sarah",
                "overview": "On the night of 16 July 1942, ten year old Sarah and her parents are being arrested and transported to the Velodrome d'Hiver in Paris where thousands of other jews are being sent to get deported. Sarah however managed to lock her little brother in a closet just before the police entered their apartment. Sixty years later, Julia Jarmond, an American journalist in Paris, gets the assignment to write an article about this raid, a black page in the history of France. She starts digging archives and through Sarah's file discovers a well kept secret about her own in-laws.",
                "popularity": 1.319,
                "poster_path": "/peGUaf6HrX7jSi1HifX64QJb7pm.jpg",
                "release_date": "2010-09-16",
                "title": "Sarah's Key",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 696,
                "character": "Mrs. Rainsferd",
                "credit_id": "5eb2a56ff74f5f001d95e569",
                "order": 20
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/mAxA5ltgqNXLXlm7PO5XrWSo9U1.jpg",
                "genre_ids": [
                    28,
                    35,
                    14,
                    12
                ],
                "id": 6978,
                "original_language": "en",
                "original_title": "Big Trouble in Little China",
                "overview": "Truck driver Jack Burton gets embroiled in a supernatural battle when his best friend Wang Chi's green-eyed fiancée is kidnapped by henchmen of the sorcerer Lo Pan, who must marry a girl with green eyes in order to return to the human realm.",
                "popularity": 5.8648,
                "poster_path": "/aeGy6SZua7eFXEZP9zAvrLkkbI2.jpg",
                "release_date": "1986-05-30",
                "title": "Big Trouble in Little China",
                "video": false,
                "vote_average": 7.212,
                "vote_count": 3162,
                "credit_id": "52fe446ec3a36847f80958db",
                "department": "Production",
                "job": "Casting"
            },
            {
                "adult": false,
                "backdrop_path": "/mTw4n5MYQMftHuGsSmBrgMu7C1H.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 746,
                "original_language": "en",
                "original_title": "The Last Emperor",
                "overview": "A dramatic history of Pu Yi, the last of the Emperors of China, from his lofty birth and brief reign in the Forbidden City, the object of worship by half a billion people; through his abdication, his decline and dissolute lifestyle; his exploitation by the invading Japanese, and finally to his obscure existence as just another peasant worker in the People's Republic.",
                "popularity": 3.8683,
                "poster_path": "/7TILJhdeJAaEyDiwvJZMo9SQBoe.jpg",
                "release_date": "1987-10-04",
                "title": "The Last Emperor",
                "video": false,
                "vote_average": 7.595,
                "vote_count": 1796,
                "credit_id": "580e43fc9251416e0d001869",
                "department": "Production",
                "job": "Casting"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Joann Ratner"
        ],
        "biography": "Joanna Merlin (born Joann Ratner; July 15, 1931) was an American actress and casting director who has worked with Stephen Sondheim and starred in the original Broadway production of Fiddler on the Roof. She has written two acting guides and is a faculty member of New York University's graduate acting program. In recent years, she has become known for her recurring role on Law & Order: Special Victims Unit as Judge Lena Petrovsky.\n\nJoann Ratner, who later took her mother's maiden name, was born in Chicago, Illinois, to Toni Merlin and Harry Ratner, a Jewish grocer. Her family also included her older sister Harriet Glickman (1926-2020) who would go on to gain recognition for having helped persuade Charles Schulz to add a black character to his Peanuts strip. Merlin first acted on stage at age 11,  joining a community theatre production, Too Many Marys. Merlin graduated from UCLA and later studied under Michael Chekhov, learning his world-renowned acting technique. She has been described as the last student of Michael Chekhov who is still alive and teaching.\n\nMerlin made her first screen appearance in Cecil B. DeMille's film The Ten Commandments in 1956. Five years later, she made her Broadway debut in Becket before playing Tzeitel in Harold Prince's production of Fiddler on the Roof. She left the cast of Fiddler on the Roof before the end of its tour to take care of her two small children but Harold Prince gave her the opportunity to become involved in casting with a more flexible schedule. Company was the first musical for which Merlin served as the casting director. She was also in charge of casting for such plays as Follies, Evita and Sweeney Todd.\n\nIn 1986, she served as casting director for the John Carpenter film, Big Trouble in Little China.\n\nAfter making appearances in several feature films, including the movie Fame, in which she played Miss Olivia Berg, a classical dance teacher; Merlin appeared in the NBC crime drama Law & Order in 1992 as a defense attorney. Like many actors from that show, she went on to play other characters in the Law & Order franchise - another defense attorney in the original show and a more recurring role as Judge Lena Petrovsky, a judge who was very stern, by-the-book, and has scolded or sanctioned, at various times, ADAs Casey Novak (Diane Neal) and Alexandra Cabot (Stephanie March) and Detective (now Lieutenant) Olivia Benson (Mariska Hargitay), in its first spin-off Law & Order: Special Victims Unit. In the latter role, she appeared in every season between the years 2000 and 2011.\n\nIn 2001, Joanna Merlin wrote Auditioning: An Actor-Friendly Guide and in 2007, shared her knowledge of the theatre industry in the instructional video Master Classes in the Michael Chekhov Technique. She teaches in New York University's graduate acting program at the Tisch School of the Arts and in 1999, founded the Michael Chekhov Association where she teaches acting workshops.\n\nSource: Article \"Joanna Merlin\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1931-07-16",
        "deathday": "2023-10-15",
        "gender": 1,
        "homepage": null,
        "id": 11903,
        "imdb_id": "nm0581008",
        "known_for_department": "Acting",
        "name": "Joanna Merlin",
        "place_of_birth": "Chicago, Illinois, USA",
        "popularity": 0.2752,
        "profile_path": "/6XmZtra49URbifNxnXo2NJsahRv.jpg"
    }
}