{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/d5HjGve67GkNC9lWpzZVKSotLlT.jpg",
                "genre_ids": [
                    18,
                    9648
                ],
                "id": 1939,
                "original_language": "en",
                "original_title": "Laura",
                "overview": "A police detective falls in love with the woman whose murder he's investigating.",
                "popularity": 1.8758,
                "poster_path": "/j0zEiFFrdbZnMXqD3piOtZBJeNB.jpg",
                "release_date": "1944-11-26",
                "title": "Laura",
                "video": false,
                "vote_average": 7.634,
                "vote_count": 853,
                "character": "Woman (uncredited)",
                "credit_id": "56da3a2ec3a3680c89000892",
                "order": 27
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Gloria MarlynTarte"
        ],
        "biography": "Gloria Marlen was a film actress back in the \"glory days of Hollywood.\" Two of her most notable roles include that of the female lead in Border Feud, one of western star Lash LaRue's last films, and as Sally Wright in the exploitation feature The Story of Bob and Sally.\n\nBorn in 1925, Gloria's father deserted her family soon after her birth, and she and her brother were raised through the Great Depression by their single mom in Miami. Gloria's mother, May Columbus Manon Tarte, with only an 8th grade education, was an inventor and a creative survivor. Her story of struggle, perseverance, and success is amazing in and of itself.\n\nGloria's \"rags to riches\" story of discovery in Hollywood as a newly arrived 17 year old, her incredible success in getting roles while maintaining her high moral values, her many relationships (including potential romantic ones) with the Big Stars of the day, her dramatic and romantic elopement with her first husband--WWII Air Force Lieutenant Malcolm deBrousse White--and her ultimate sacrifice of her rising career for the sake of her family, are all examples of \"the truth is better than fiction.\"\n\nNow in her late 80's, Gloria still possesses a dramatic Star Quality. She remarried after her husband's death and resides with her second husband near one of her daughters in Tucson, AZ.",
        "birthday": "1925-02-02",
        "deathday": "2017-07-07",
        "gender": 1,
        "homepage": null,
        "id": 1191208,
        "imdb_id": "nm0549097",
        "known_for_department": "Acting",
        "name": "Gloria Marlen",
        "place_of_birth": "Georgia, USA",
        "popularity": 0.0513,
        "profile_path": null
    }
}