{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1ufic9NSdolkgNkQSAVjlVp0uqn.jpg",
                "genre_ids": [
                    9648,
                    53,
                    18
                ],
                "id": 210577,
                "original_language": "en",
                "original_title": "Gone Girl",
                "overview": "With his wife's disappearance having become the focus of an intense media circus, a man sees the spotlight turned on him when it's suspected that he may not be innocent.",
                "popularity": 18.2364,
                "poster_path": "/ts996lKsxvjkO2yiYG0ht4qAicO.jpg",
                "release_date": "2014-10-01",
                "title": "Gone Girl",
                "video": false,
                "vote_average": 7.89,
                "vote_count": 19271,
                "character": "FBI",
                "credit_id": "5502f479c3a3685bab0043ed",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Mark Attebery"
        ],
        "biography": "Mark Atteberry was born and raised in Santa Rosa, California where he worked on the family dairy before moving to LA to become an award-winning actor, musician and photographer. He began his endeavors in the Entertainment Industry as a studio musician, playing trombone, tuba and keyboards. As such, he played in countless pit orchestras which is where the acting bug first bit.\n\nWhen he made the transition to acting, Mark studied with many of the top acting teachers including Roy London, Ivana Chubbuck, Larry Moss, Howard Fine and Vladimir Ilyin of the Moscow Art Theatre. Mark's film work ranges from blockbuster hits like David Fincher's \"Gone Girl\" and Ang Lee's \"The Hulk\" to notable indies like the \"The Future,\" \"Butterfly Circus\" and \"Stained,\" (for which he received his first Best Actor nomination). Mark's television work includes hit series like \"The Newsroom,\" \"Bones,\" \"Grey's Anatomy,\" \"Criminal Minds,\" \"Luck,\" \"Dexter,\" \"House, M.D.\" \"Rules of Engagement,\" \"The Closer,\" \"The Mentalist,\" \"Justified,\" \"Big Love,\" \"The Shield,\" \"The Young and the Restless,\" \"24,\" \"Nip/Tuck\" and more.\n\nAs a photographer, Mark is renown for his advertising, documentary and headshot work. His clients have included A&E, Bravo, CAA, ICM, WME, Venice Magazine, Big Lots and many more. When he first began shooting professionally, Mark was chosen as one of the \"Best Headshot Photographers in Los Angeles\" by BackStage West magazine. And, in 2010 he was honored by the Photography for Social Change Foundation as one of the \"World's Top 100 Documentary-Style Photographers.\"\n\nAs a result of his countless hours on both sides of the camera, Mark occasionally speaks and teaches on the subjects of \"Image and Type\" and \"Acting in LA.\" He has co-written several books on the topic of acting including \"The Working Actor's Guide to LA\" and \"The Stunt Guide.\" Mark is the founder of the \"Be A Working Actor Studios\" in Los Angeles.\n\n- IMDb Mini Biography By: Mark Atteberry",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.markatteberry.org/",
        "id": 1192412,
        "imdb_id": "nm0040992",
        "known_for_department": "Acting",
        "name": "Mark Atteberry",
        "place_of_birth": "Santa Rosa, California, USA",
        "popularity": 0.1158,
        "profile_path": "/nBwVnvrGNASEpLyctZst89TwTc1.jpg"
    }
}