{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4V1yIoAKPMRQwGBaSses8Bp2nsi.jpg",
                "genre_ids": [
                    28,
                    878
                ],
                "id": 137113,
                "original_language": "en",
                "original_title": "Edge of Tomorrow",
                "overview": "Major Bill Cage is an officer who has never seen a day of combat when he is unceremoniously demoted and dropped into combat. Cage is killed within minutes, managing to take an alpha alien down with him. He awakens back at the beginning of the same day and is forced to fight and die again... and again - as physical contact with the alien has thrown him into a time loop.",
                "popularity": 11.5152,
                "poster_path": "/nBM9MMa2WCwvMG4IJ3eiGUdbPe6.jpg",
                "release_date": "2014-05-27",
                "title": "Edge of Tomorrow",
                "video": false,
                "vote_average": 7.632,
                "vote_count": 14423,
                "character": "Skinner",
                "credit_id": "52fe4c27c3a368484e1aa219",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "William Jonas Armstrong is an English actor, best known for his role as Robin Hood in the BBC series of the same name. He has also starred in films such as Edge of Tomorrow, Book of Blood, and Walking with the Enemy.\n\nArmstrong was born in Dublin, Ireland, in 1981. He moved to England when he was 10 years old. He studied drama at the Royal Academy of Dramatic Art (RADA), graduating in 2003.\n\nArmstrong's first major television role came in 2004, when he was cast as Anthony Millington in the fourth series of the British television comedy-drama, Teachers. He then appeared in the crime drama series The Ghost Squad as Pete Maitland.\n\nIn 2006, Armstrong was cast as Robin Hood in the BBC series of the same name. The series was a critical and commercial success, and Armstrong's performance was praised by critics. He remained with the series for all four seasons, which aired from 2006 to 2010.\n\nSince then, Armstrong has starred in a number of films and television series, including Edge of Tomorrow, Book of Blood, and Walking with the Enemy. He has also appeared in the stage productions of \"The Crucible\" and \"Richard II.\"\n\nArmstrong is currently filming the upcoming television series After the Flood, a six-part mystery thriller series for ITV. He will play the role of Lee, a man who is trying to piece together his life after a devastating flood.",
        "birthday": "1981-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 119224,
        "imdb_id": "nm1765073",
        "known_for_department": "Acting",
        "name": "Jonas Armstrong",
        "place_of_birth": "Dublin, Ireland",
        "popularity": 0.5774,
        "profile_path": "/7Ia8Dfhqa2bH43NeKSZiPZ9wHAF.jpg"
    }
}