{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hwPnxzIgQFfXl5zP0Yh8bViCMzf.jpg",
                "genre_ids": [
                    14,
                    12,
                    28
                ],
                "id": 57158,
                "original_language": "en",
                "original_title": "The Hobbit: The Desolation of Smaug",
                "overview": "The Dwarves, Bilbo and Gandalf have successfully escaped the Misty Mountains, and Bilbo has gained the One Ring. They all continue their journey to get their gold back from the Dragon, Smaug.",
                "popularity": 12.9588,
                "poster_path": "/xQYiXsheRCDBA39DOrmaw1aSpbk.jpg",
                "release_date": "2013-12-11",
                "title": "The Hobbit: The Desolation of Smaug",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 13643,
                "character": "Bombur",
                "credit_id": "52fe4926c3a36847f818b7dd",
                "order": 22
            },
            {
                "adult": false,
                "backdrop_path": "/zn13a7U9eMTJq8sHthe3bCgsVm4.jpg",
                "genre_ids": [
                    28,
                    12,
                    14
                ],
                "id": 122917,
                "original_language": "en",
                "original_title": "The Hobbit: The Battle of the Five Armies",
                "overview": "Following Smaug's attack on Laketown, Bilbo and the dwarves try to defend Erebor's mountain of treasure from others who claim it: the men of the ruined Laketown and the elves of Mirkwood. Meanwhile an army of Orcs led by Azog the Defiler is marching on Erebor, fueled by the rise of the dark lord Sauron. Dwarves, elves and men must unite, and the hope for Middle-Earth falls into Bilbo's hands.",
                "popularity": 20.1277,
                "poster_path": "/xT98tLqatZPQApyRmlPL12LtiWp.jpg",
                "release_date": "2014-12-10",
                "title": "The Hobbit: The Battle of the Five Armies",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 14798,
                "character": "Bombur",
                "credit_id": "52fe4a88c3a368484e158bf7",
                "order": 27
            },
            {
                "adult": false,
                "backdrop_path": "/xyXmtuvsoM5J3yNad0nvcetpBdY.jpg",
                "genre_ids": [
                    12,
                    14,
                    28
                ],
                "id": 49051,
                "original_language": "en",
                "original_title": "The Hobbit: An Unexpected Journey",
                "overview": "Bilbo Baggins, a hobbit enjoying his quiet life, is swept into an epic quest by Gandalf the Grey and thirteen dwarves who seek to reclaim their mountain home from Smaug, the dragon.",
                "popularity": 15.9821,
                "poster_path": "/yHA9Fc37VmpUA5UncTxxo3rTGVA.jpg",
                "release_date": "2012-12-12",
                "title": "The Hobbit: An Unexpected Journey",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 18994,
                "character": "Bombur",
                "credit_id": "5540cdf9c3a3682a740012a3",
                "order": 16
            },
            {
                "adult": false,
                "backdrop_path": "/vwbmp3vvX4U0VjinaQktYOBt5kW.jpg",
                "genre_ids": [
                    18,
                    36,
                    53
                ],
                "id": 502425,
                "original_language": "en",
                "original_title": "Escape from Pretoria",
                "overview": "South Africa, 1978. Tim Jenkin and Stephen Lee, two white political activists from the African National Congress imprisoned by the apartheid regime, put a plan in motion to escape from the infamous Pretoria Prison.",
                "popularity": 4.2942,
                "poster_path": "/8GGS0jkFFCnmdStvZED6NL6V7gd.jpg",
                "release_date": "2020-03-06",
                "title": "Escape from Pretoria",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 1400,
                "character": "Peter",
                "credit_id": "5e9c16b7371097002247f0df",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Stephen Hunter was born in Wellington, New Zealand and was unwittingly  cast as \"the clown\" from a young age. The label clearly sat well with  Stephen, who quickly developed a great sense of comic timing, and a  reputation as the \"go to\" funny guy. Very early in his career the camera  beaconed. And after honing his skills on New Zealand Television,  Stephen headed for Australia.\n\nIt didn't take long for his talents  to be recognized - and not just for comedy. In 2006, after several  guest roles on both sides of the Tasman, Stephen landed the part of  Sharpie in the second series of the 2 time Logie Award winning drama  Love My Way. This was closely followed in 2008 by a leading guest role  on Channel 7's long running Australian medical drama All Saints, a role  that showed his depth and versatility as a dramatic actor.\n\nBut it  is his comedic ability that has Stephen in high demand on screen in  both New Zealand and Australia. Stints on Nickelodeans The GO Show and  ABC's Review with Miles Barlow only confirmed that status.\n\nHis  strong resonant voice has also seen Stephen become one of Australasia's  top Voice actors. These skills have been used to promote some of  Australia & New Zealand's top companies and products. And in 2009,  Stephen landed a lead role in the ABC animated series CJ the DJ, as the  lovable Si.\n\nBut it's on screen where his true passion lies - and of course he loves nothing more than making people laugh.",
        "birthday": "1968-10-28",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1193834,
        "imdb_id": "nm1053536",
        "known_for_department": "Acting",
        "name": "Stephen Hunter",
        "place_of_birth": "Wellington - New Zealand",
        "popularity": 0.1046,
        "profile_path": "/2B1lI5nwKPavixa0JBM0UFnSw4z.jpg"
    }
}