{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/pxL08w7Eq0vKrQ3mJzYp0VHGaKG.jpg",
                "genre_ids": [
                    28,
                    53,
                    878
                ],
                "id": 49530,
                "original_language": "en",
                "original_title": "In Time",
                "overview": "In the not-too-distant future, the aging gene has been switched off. To avoid overpopulation, time has become the currency and the way people pay for luxuries and necessities. The rich can live forever, while the rest struggle to negotiate for their immortality. A poor young man who suddenly comes into a fortune of time finds himself on the run from a corrupt police force known as the \"time keepers\".",
                "popularity": 9.8493,
                "poster_path": "/3Mwj2sIONQckOZP3YwsUXF7U5I4.jpg",
                "release_date": "2011-10-27",
                "title": "In Time",
                "video": false,
                "vote_average": 6.971,
                "vote_count": 11771,
                "character": "Dayton Citizen Leader (uncredited)",
                "credit_id": "615895b643d9b100952df500",
                "order": 64
            },
            {
                "adult": false,
                "backdrop_path": "/bgkFOoXEQMRjKkCvgoj7smdGbuh.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 157350,
                "original_language": "en",
                "original_title": "Divergent",
                "overview": "In a world divided into factions based on personality types, Tris learns that she's been classified as Divergent and won't fit in. When she discovers a plot to destroy Divergents, Tris and the mysterious Four must find out what makes Divergents dangerous before it's too late.",
                "popularity": 7.9056,
                "poster_path": "/aNh4Q3iuPKDMPi2SL7GgOpiLukX.jpg",
                "release_date": "2014-03-14",
                "title": "Divergent",
                "video": false,
                "vote_average": 6.91,
                "vote_count": 13105,
                "character": "Al",
                "credit_id": "55e6cfafc3a3685f9e002720",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Christian Madsen was born in 1990 in Los Angeles to actors Michael Madsenand Jeannine Bisignano. He began acting at the age of ten, when he appeared in a small role in one of his father's films, and spent time on the set of a number of other films, including Free Willy and The Getaway. His grandmother, filmmaker Elaine Madsen, encouraged him to pursue a career in acting after watching his performances in high school theater. His parents divorced when he was a child and he subsequently \"bounced around a lot\" between his parents' homes in Malibu, the San Fernando Valley, Santa Fe, and Montana. He eventually moved in with his grandmother when he was 17, and she took him to the Actors Studio and introduced him to the head of its Hollywood branch, Martin Landau.  Madsen's early film career consisted mainly of small roles with his father and independent films. He took on other jobs while continuing to audition for acting roles. He had been auditioning without any successes for over two years and was about to be evicted from his Los Angeles apartment when he won a role in Divergent, a film adaptation of Veronica Roth's young adult novel of the same name.  After filming Divergent, Madsen was cast in the lead role of the upcoming independent film Prism, in which he plays a young man who is reunited with his amnesiac father after 15 years. In 2014, he also appeared in Palo Alto, a drama film directed by Gia Coppola, and he has been cast in Jack Squared.",
        "birthday": "1990-02-08",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1193606,
        "imdb_id": "nm1399894",
        "known_for_department": "Acting",
        "name": "Christian Madsen",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 1.4491,
        "profile_path": "/3j8ZaqJktp2eRGB8hgiYqoFBxAW.jpg"
    }
}