{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bYimqNnizPUCnL5HOdoCW02IGmH.jpg",
                "genre_ids": [
                    18,
                    35,
                    10749
                ],
                "id": 74643,
                "original_language": "fr",
                "original_title": "The Artist",
                "overview": "Hollywood, 1927: As silent movie star George Valentin wonders if the arrival of talking pictures will cause him to fade into oblivion, he sparks with Peppy Miller, a young dancer set for a big break.",
                "popularity": 3.1239,
                "poster_path": "/z68py0ZqPgeacGPG54AGVRbNBS7.jpg",
                "release_date": "2011-10-12",
                "title": "The Artist",
                "video": false,
                "vote_average": 7.451,
                "vote_count": 3367,
                "character": "Peppy's Boyfriend",
                "credit_id": "52fe48d7c3a368484e10d957",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Nicholas Beau Nelson, most known as Beau Nelson was born on a Marine Base in Cherry Point, NC and soon relocated with his parents to Tampa, FL. While spending most of grade school in Tampa, his parent's divorce led to his relocation to Wisconsin with his mother. Growing up as a shy child, Beau had little intention or desire for the entertainment industry. Focusing on education, Beau studied honors classes in Law, Physics and Spanish, and ultimately led to his High Honors college degree in Computer Science.\n\nDuring his early adult years, Beau searched for a more creative way to express himself. With nearly no experience in the entertainment industry, Beau started traveling hundreds of miles to Chicago for short 5-minute auditions and landed his first lead role in a feature film 2 states away in Indiana. It was at that moment, Beau knew he was Los Angeles bound.\n\nComing to Los Angeles, Beau brought his Midwest morals and work-ethic and quickly hit the ground running. With over 20 feature films under his belt in the first 2 years, he was steadily making his way towards a career as an actor.\n\nNow turning to producing as well, Beau continues to create opportunities for his new creative and emotionally rewarding career.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://resumes.actorsaccess.com/beaunelson",
        "id": 1193414,
        "imdb_id": "nm3068259",
        "known_for_department": "Acting",
        "name": "Beau Nelson",
        "place_of_birth": "Marine Corps Air Station Cherry Point, North Carolina, United States",
        "popularity": 0.051,
        "profile_path": null
    }
}