{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2EfbAWLq8s2f1LxTAIuLGYpKETV.jpg",
                "genre_ids": [
                    12,
                    28,
                    14
                ],
                "id": 8009,
                "original_language": "en",
                "original_title": "Highlander",
                "overview": "He fought his first battle on the Scottish Highlands in 1536. He will fight his greatest battle on the streets of New York City in 1986. His name is Connor MacLeod. He is immortal.",
                "popularity": 6.3538,
                "poster_path": "/8Z8dptJEypuLoOQro1WugD855YE.jpg",
                "release_date": "1986-03-07",
                "title": "Highlander",
                "video": false,
                "vote_average": 6.872,
                "vote_count": 2745,
                "character": "Himself (uncredited)",
                "credit_id": "5a4a4e109251415c910106ea",
                "order": 36
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jim Brunzell",
            "\"Jumpin\" Jim Brunzell",
            "Killer Bees"
        ],
        "biography": "James Brunzell is a retired professional wrestler better known by his ring name \"Jumping\" Jim Brunzell. Known for his successful tag teams, Brunzell performed for various wrestling promotions over the course of approximately two decades.\n\nNational Wrestling Alliance:\n\nDuring the later half of the 1970s, he signed to wrestle for the Mid-Atlantic region and won the NWA Mid-Atlantic Heavyweight Championship twice, a significant singles title at the time.\n\nReturn to AWA:\n\nUpon returning to AWA, Brunzell reformed his tag team with Greg Gagne, known as the \"High Flyers\", and was elevated to main event status. The tandem of Brunzell and Gagne held the AWA World Tag Team Championship on two separate occasions, feuding with teams like Jesse Ventura and Adrian Adonis and Jerry Blackwell and Ken Patera. Brunzell remained with the AWA in both tag team and singles competition until 1985.\n\nWWE:\n\nBrunzell then signed to wrestle with WWE as they continued their national expansion. Here, he formed the popular tag team, The Killer Bees, with another WWE newcomer, B. Brian Blair. Apparently, Verne and Greg Gagne felt somewhat betrayed by the move. Gagne even expressed his displeasure during an AWA broadcast, making subtle references to Brunzell's departure and his new gimmick. Brunzell and Blair experienced moderate success while with WWE. The two feuded with the likes of The Hart Foundation as well as the Funks, Jimmy Jack Funk and Hoss Funk, who they faced in front of over 74,000 fans at The Big Event. Their stay was also highlighted by a match against Nikolai Volkoff and the Iron Sheik as part of WrestleMania III and a win at the inaugural Survivor Series on Thanksgiving Day 1987. The Killer Bees teamed together until Blair left the promotion in 1988. Brunzell continued in singles competition for a time, being used to put over newer talent like Curt Hennig and Damien Demento as late as a Raw episode in April 1993.\n\nIndependent circuit:\n\nHe left WWE in 1991 and competed on the independent circuit, primarily in the Chicago area. Brunzell also wrestled for Herb Abrams' Universal Wrestling Federation (UWF) in 1991. While there, he reunited with B. Brian Blair under the name Masked Confusion, winning the tag team title twice. After the UWF closed, Brunzell returned to the independent circuit and continued to wrestle until late 1999, when Brunzell faced fellow wrestler, The Hater.\n\nCurrently, Brunzell works as a financial planner for Focus Financial in the Minneapolis area, he is also active in his church and does charity work for children with diabetes.",
        "birthday": "1949-08-14",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1194948,
        "imdb_id": "nm0116652",
        "known_for_department": "Acting",
        "name": "Jim  Brunzell",
        "place_of_birth": "White Bear Lake, Minnesota, USA",
        "popularity": 0.0895,
        "profile_path": "/xHiRspls2IkqcKrNt9Ye07b8wii.jpg"
    }
}