{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/pxL08w7Eq0vKrQ3mJzYp0VHGaKG.jpg",
                "genre_ids": [
                    28,
                    53,
                    878
                ],
                "id": 49530,
                "original_language": "en",
                "original_title": "In Time",
                "overview": "In the not-too-distant future, the aging gene has been switched off. To avoid overpopulation, time has become the currency and the way people pay for luxuries and necessities. The rich can live forever, while the rest struggle to negotiate for their immortality. A poor young man who suddenly comes into a fortune of time finds himself on the run from a corrupt police force known as the \"time keepers\".",
                "popularity": 9.8493,
                "poster_path": "/3Mwj2sIONQckOZP3YwsUXF7U5I4.jpg",
                "release_date": "2011-10-27",
                "title": "In Time",
                "video": false,
                "vote_average": 6.971,
                "vote_count": 11771,
                "character": "Constantin",
                "credit_id": "5c3491970e0a2654d0d87ee3",
                "order": 34
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Ethan Gregory Peck is an American actor. He is the grandson of actor Gregory Peck and Greta Kukkonen, the elder Peck's first wife. In 2019, he played a young Spock in Star Trek: Discovery, a role he has reprised for the television series Star Trek: Strange New Worlds.\n\nPeck was born in Los Angeles, California, on March 2, 1986. He is the son of Stephen Peck, a former actor, documentary filmmaker, and Vietnam veteran who is president and CEO of U.S. Veterans Initiative, and abstract artist Francine Matarazzo. He is the grandson of actor Gregory Peck and his first wife, Finnish-born Greta Kukkonen. Peck attended private schools Campbell Hall and Harvard-Westlake in Studio City. He excelled in athletics and learned to play classical cello.\n\nPeck began his acting career as a child, appearing in television shows such as That '70s Show and Gossip Girl. He made his film debut in 1999 with a small role in the movie Passport to Paris. In 2008, he starred in the independent film Tennessee, opposite Mariah Carey. He also appeared in the films Adopt a Sailor (2009) and The Midnight Sky (2020).\n\nIn 2019, Peck was cast as a young Spock in the television series Star Trek: Discovery. He reprised the role in the spin-off series Star Trek: Strange New Worlds, which premiered in 2022. Peck's performance as Spock has been praised by critics and fans alike.\n\nIn addition to his work on Star Trek, Peck has also appeared in the films The Curse of La Llorona (2019) and The Good House (2021). He is currently filming the upcoming television series The Book of Boba Fett.",
        "birthday": "1986-03-02",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 119586,
        "imdb_id": "nm0669656",
        "known_for_department": "Acting",
        "name": "Ethan Peck",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.7354,
        "profile_path": "/9KaxSgpbx9Zj827xXLML3bWknNV.jpg"
    }
}