{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/j9QaQVuyQIEwckUbjHpAgA7E4jJ.jpg",
                "genre_ids": [
                    80,
                    18,
                    53
                ],
                "id": 50348,
                "original_language": "en",
                "original_title": "The Lincoln Lawyer",
                "overview": "Mick Haller is a charismatic defense attorney who does business out of his Lincoln Continental sedan. Mick spends most of his time defending petty crooks and other bottom-feeders, so it comes as quite a surprise when he lands the case of a lifetime: defending a Beverly Hills playboy who is accused of attempted murder. However, what Mick initially thinks is an open-and-shut case with a big monetary reward develops into something more sinister.",
                "popularity": 4.9158,
                "poster_path": "/gOn8Ve9Yi8fxjRkmLr5BZoOc7KV.jpg",
                "release_date": "2011-03-17",
                "title": "The Lincoln Lawyer",
                "video": false,
                "vote_average": 7.196,
                "vote_count": 3436,
                "character": "Judge Orton Powell",
                "credit_id": "5b7c9751c3a36858fa00132f",
                "order": 24
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Connor O'Farrell",
            "Conor O'Ferrell "
        ],
        "biography": "Conor O'Farrell is an American actor born on January 13, 1956, in Riverside County, California. He began taking acting classes in his early 20s in Los Angeles and later continued his studies in New York. O'Farrell has a diverse career spanning stage, television, and film. On stage, he has performed in plays such as \"Death of a Salesman,\" \"The Glass Menagerie,\" and \"Tartuffe.\"\n\nHe is well-known for his television roles, including the mob-connected Las Vegas undersheriff Jeffrey McKeen on CSI: Crime Scene Investigation. His TV appearances span popular shows like Buffy The Vampire Slayer, 24, Desperate Housewives, Medium, and True Blood. On film, he had a notable role opposite Kevin Bacon in Stir of Echoes (1999). O'Farrell also appeared in TV miniseries such as From the Earth to the Moon and The Pacific.\n\nHis career includes guest roles and recurring parts in numerous shows, making him a familiar face in television drama and crime series. He attended Edgewood High School in West Covina, California, where he played basketball with some notable athletes and actors.",
        "birthday": "1956-01-13",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 119521,
        "imdb_id": "nm0640970",
        "known_for_department": "Acting",
        "name": "Conor O'Farrell",
        "place_of_birth": "Riverside County, California, USA",
        "popularity": 0.2089,
        "profile_path": "/ieA8GBJTx0vGmZ0bcDvTOxYAIa0.jpg"
    }
}