{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1RWLMyC9KcFfcaoViMiJGSSZzzr.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 100402,
                "original_language": "en",
                "original_title": "Captain America: The Winter Soldier",
                "overview": "After the cataclysmic events in New York with The Avengers, Steve Rogers, aka Captain America is living quietly in Washington, D.C. and trying to adjust to the modern world. But when a S.H.I.E.L.D. colleague comes under attack, Steve becomes embroiled in a web of intrigue that threatens to put the world at risk. Joining forces with the Black Widow, Captain America struggles to expose the ever-widening conspiracy while fighting off professional assassins sent to silence him at every turn. When the full scope of the villainous plot is revealed, Captain America and the Black Widow enlist the help of a new ally, the Falcon. However, they soon find themselves up against an unexpected and formidable enemy—the Winter Soldier.",
                "popularity": 8.6751,
                "poster_path": "/tVFRpFw3xTedgPGqxW0AOI8Qhh0.jpg",
                "release_date": "2014-03-20",
                "title": "Captain America: The Winter Soldier",
                "video": false,
                "vote_average": 7.655,
                "vote_count": 19406,
                "character": "Apple Employee",
                "credit_id": "5897baa0c3a368770e000f18",
                "order": 32
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "DC Pierson"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nDC Pierson (born December 27, 1984) is an American comedian, author and actor. He is best known for his involvement in the sketch and improvisational comedy group Derrick Comedy.\n\nPierson was born in Phoenix, Arizona. He attended Mountain Pointe High School where he started acting and performing in a short-form improv group. He went on to attend NYU, joining the sketch comedy group Hammerkatz NYU in the fall of 2003. He worked as both assistant director and director during his 3 year tenure with the group. Pierson graduated from NYU's Dramatic Writing Department in 2007 with a degree in writing for television. He also made three brief appearances on NBC's Community, on which his Derrick Comedy costar plays a main character, and Pierson appeared as a Greendale Gazette member.\n\nDescription above from the Wikipedia article DC Pierson, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1984-12-27",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 119590,
        "imdb_id": "nm2272628",
        "known_for_department": "Acting",
        "name": "D.C. Pierson",
        "place_of_birth": null,
        "popularity": 0.1726,
        "profile_path": "/iFLtp81zcfpWEUr8Qcj4BOkJDXt.jpg"
    }
}