{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9IYyCLf5NNAQFK9pNtqzEU9HWzM.jpg",
                "genre_ids": [
                    35,
                    878
                ],
                "id": 68,
                "original_language": "en",
                "original_title": "Brazil",
                "overview": "Low-level bureaucrat Sam Lowry escapes the monotony of his day-to-day life through a recurring daydream of himself as a virtuous hero saving a beautiful damsel. Investigating a case that led to the wrongful arrest and eventual death of an innocent man instead of wanted terrorist Harry Tuttle, he meets the woman from his daydream, and in trying to help her gets caught in a web of mistaken identities, mindless bureaucracy and lies.",
                "popularity": 3.9345,
                "poster_path": "/aewan59WcFThBimkTVVoNf2o5Vb.jpg",
                "release_date": "1985-02-20",
                "title": "Brazil",
                "video": false,
                "vote_average": 7.67,
                "vote_count": 3484,
                "character": "Old Lady with Dog",
                "credit_id": "5e2d67e11685da0019e770ed",
                "order": 30
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Ann Way (14 November 1915 – 13 March 1993) was an English film and television character actress. Born in Wiveliscombe, Somerset, she began her career in repertory in Birmingham in the 1950s moving from there to the Dundee Rep.\n\nHer petite build and deep-set eyes saw her frequently typecast as a stereotypically dotty or timid and mouse-like spinster. She nonetheless appeared in a wide range of roles, including the television series Dr Finlay's Casebook, Emmerdale Farm where she played an aunt of publican and newspaper correspondent Amos Brearly, Fawlty Towers (where she memorably played the Colonel's wife inadvertently served the raw red mullet in \"Gourmet Night\") and Rumpole of the Bailey as Dodo Mackintosh. She played the vicar's wife in Last of the Summer Wine. She also read the Mrs. Pepperpot books on the children's series Jackanory.\n\nFilm roles included Carry On Loving (1970), Endless Night (1972) and Clockwise (1986) (in which she sang the Vivian Ellis standard This is my Lovely Day on the soundtrack and made comic use of the repeated line \"Aren't we all such lucky people\") and The Prime of Miss Jean Brodie (1969) (where she played the headmistress's secretary, Miss Gaunt). A more unusual role was the 1987 short film Unusual Ground Floor Conversion in which she played an old lady gradually driving her downstairs neighbour mad by throwing water out of her window every few minutes.\n\nWay died in London, England on 13 March 1993.",
        "birthday": "1915-11-14",
        "deathday": "1993-03-13",
        "gender": 1,
        "homepage": null,
        "id": 1197428,
        "imdb_id": "nm0915413",
        "known_for_department": "Acting",
        "name": "Ann Way",
        "place_of_birth": "Wiveliscombe, Somerset, England, UK",
        "popularity": 1.7161,
        "profile_path": null
    }
}