{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2EfbAWLq8s2f1LxTAIuLGYpKETV.jpg",
                "genre_ids": [
                    12,
                    28,
                    14
                ],
                "id": 8009,
                "original_language": "en",
                "original_title": "Highlander",
                "overview": "He fought his first battle on the Scottish Highlands in 1536. He will fight his greatest battle on the streets of New York City in 1986. His name is Connor MacLeod. He is immortal.",
                "popularity": 6.3538,
                "poster_path": "/8Z8dptJEypuLoOQro1WugD855YE.jpg",
                "release_date": "1986-03-07",
                "title": "Highlander",
                "video": false,
                "vote_average": 6.872,
                "vote_count": 2745,
                "character": "Terry Gordy (uncredited)",
                "credit_id": "627c333594d8a80af422f99d",
                "order": 39
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Terry Mecca",
            "Bam Bam",
            "Bamm Bamm",
            "The Executioner",
            "Freebirds",
            "The Fabulous Freebirds"
        ],
        "biography": "Terrance Ray Gordy Sr. was an American professional wrestler. Know by the nickname \"Bam Bam\", Gordy appeared in the United States with promotions such as Mid-South Wrestling, Georgia Championship Wrestling, World Class Championship Wrestling, Jim Crockett Promotions/World Championship Wrestling and the Universal Wrestling Federation as a member of The Fabulous Freebirds. He also appeared in Japan with All-Japan Pro Wrestling as one-half of The Miracle Violence Connection with \"Dr. Death\" Steve Williams. Gordy held many championships throughout the course of his career, including the Triple Crown Heavyweight Championship, AJPW World Tag Team Championship, WCW World Tag Team Championship, NWA World Tag Team Championship, UWF Heavyweight Championship and SMW Heavyweight Championship. He has been posthumously inducted into the Wrestling Observer, Professional Wrestling, and WWE Hall of Fame.",
        "birthday": "1961-04-23",
        "deathday": "2001-07-16",
        "gender": 2,
        "homepage": null,
        "id": 1197006,
        "imdb_id": "nm0330715",
        "known_for_department": "Acting",
        "name": "Terry Gordy",
        "place_of_birth": "Chattanooga, Tennessee, USA",
        "popularity": 0.1248,
        "profile_path": "/ky6BEzSVvo5z8xq2CYiGtkVAkpM.jpg"
    }
}