{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/80uHK2xWwjlOxmfJ1wQB09omAht.jpg",
                "genre_ids": [
                    10749,
                    35,
                    80,
                    14
                ],
                "id": 854,
                "original_language": "en",
                "original_title": "The Mask",
                "overview": "When timid bank clerk Stanley Ipkiss discovers a magical mask containing the spirit of the Norse god Loki, his entire life changes. While wearing the mask, Ipkiss becomes a supernatural playboy exuding charm and confidence which allows him to catch the eye of local nightclub singer Tina Carlyle. Unfortunately, under the mask's influence, Ipkiss also robs a bank, which angers junior crime lord Dorian Tyrell, whose goons get blamed for the heist.",
                "popularity": 10.4293,
                "poster_path": "/yd3wjLLeQHJ3oRDy4wwiNNFVyLW.jpg",
                "release_date": "1994-07-29",
                "title": "The Mask",
                "video": false,
                "vote_average": 6.969,
                "vote_count": 10735,
                "character": "The Figure",
                "credit_id": "5ded4397158c850013823988",
                "order": 31
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Bobby Reilly"
        ],
        "biography": "Robert O'Reilly (born March 25, 1950, in New York City) is an American film, stage, and television actor and director. He is best known for his role as Chancellor Gowron, the leader of the Klingon Empire, in the Star Trek franchise—particularly on Star Trek: The Next Generation and Star Trek: Deep Space Nine.\n\nO'Reilly’s career spans over 100 films and TV episodes, often portraying antagonistic or villainous characters. He appeared in series like Cheers, Knight Rider, MacGyver, NYPD Blue, and films such as The Mask. He has also performed on Broadway and at Carnegie Hall. Notably, he received a Drama-Logue Award in 1981 for directing the play Getting Out.\n\nHis first Star Trek appearance was in The Next Generation episode \"Manhunt,\" but he is most recognized for playing Gowron from the episode \"Reunion\" onward, across several Next Generation and Deep Space Nine episodes, and related media including video games. O'Reilly drew inspiration for Gowron from Shakespearean characters, notably Edmund from King Lear. He has reprised Gowron in various Star Trek-related events and conventions.\n\nIn theater, he has appeared in Broadway and off-Broadway productions, including The Tavern, The Promise, and played roles like Edmund in King Lear. He has been active with the Colony Theatre Company in Burbank, California, both as an actor and director.\n\nHe is married to Judy O'Reilly, with whom he has triplet sons. His hobbies include golf and baseball.\n\nRobert O'Reilly retired from acting but remains involved in the Star Trek community through conventions and voice roles",
        "birthday": "1950-03-25",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 119882,
        "imdb_id": "nm0642481",
        "known_for_department": "Acting",
        "name": "Robert O'Reilly",
        "place_of_birth": "New York, New York, USA",
        "popularity": 0.5205,
        "profile_path": "/kY5lTGYwmsMPJuZj8NDz1brGypV.jpg"
    }
}