{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cnl95VtUon66J1PLRPpsgYgwHF7.jpg",
                "genre_ids": [
                    99,
                    36
                ],
                "id": 803,
                "original_language": "fr",
                "original_title": "Nuit et Brouillard",
                "overview": "Filmmaker Alain Resnais documents the atrocities behind the walls of Hitler's concentration camps.",
                "popularity": 2.4796,
                "poster_path": "/2iWYQia8enOai7QEO3TvenleD7r.jpg",
                "release_date": "1959-04-27",
                "title": "Night and Fog",
                "video": false,
                "vote_average": 8.243,
                "vote_count": 522,
                "character": "Narrator (voice) (uncredited)",
                "credit_id": "52fe4278c3a36847f802146d",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Мишель Буке",
            "Michel Bouquet"
        ],
        "biography": "Michel Bouquet (6 November 1925 – 13 April 2022) was a French stage and film actor. He appeared in more than 100 films from 1947 to 2020. He won the Best Actor European Film Award for Toto the Hero in 1991 and two Best Actor Césars for How I Killed My Father (2001) and The Last Mitterrand (2005). He also received the Molière Award for Best Actor for Les côtelettes in 1998, then again for Exit the King in 2005. In 2014, he was awarded the Honorary Molière for the sum of his career. He received the Grand Cross of the Legion of Honor in 2018.\n\nMichel François Pierre Bouquet was born on 6 November 1925 in Paris. When he was seven years old, he was sent to a boarding school where he stayed until the age of 14. He aspired to become a doctor but had to quit school at the age of 15 after his father had been taken prisoner during World War II. Bouquet worked as a baker's apprentice, then a bank clerk, to provide for the family. After a short stay in Lyon, he returned with his mother to Paris. Marie Bouquet was passionate about theater, and that helped the young Bouquet to find his vocation. He took acting classes under the tutelage of Maurice Escande, a member of the Comédie Française, and made his stage debut in the play La première étape in 1944. Then he studied at the Conservatory of Dramatic Arts in Paris where he met Gérard Philippe.\n\nIn the mid-1940s Michel Bouquet began working with the playwright Jean Anouilh and director André Barsacq, who staged plays at the Théâtre de l'Atelier in Montmartre. In 1946, Anouilh gave Bouquet a part in Roméo and Jeannette, followed by The Rendez-vous of Senlis and The Invitation to the Castle in 1947. In the 1950s, the actor met another stage director, Jean Vilar, with whom he would frequently collaborate. Bouquet played many roles from the classical repertoire at the Festival d'Avignon, created by Vilar in 1947 (Henry IV in 1950, The Tragedy of King Richard II in 1953, and The Miser in 1962). Bouquet regularly worked with Anouilh until the early 1970s, then helped popularize in France the works of the British author Harold Pinter: The Collection in 1965, The Birthday Party in 1967 and No Man's Land in 1979.\n\nAt the same time, at the end of the 1970s, Michel Bouquet was appointed professor at the National Conservatory of Dramatic Arts and taught there until 1990. In the 1980s-1990s, he returned to the Théâtre de l'Atelier where he once began his career. In 1994, he played in Exit the King by Eugène Ionesco, the role he would perform many times until 2014. In 1998 he received the Molière Award for Best Actor for Bertrand Blier's Les côtelettes, then again for Exit the King in 2005. In 2014, he was awarded the Honorary Molière for the sum of his career. A year later, the actor received accolades for his performance in Taking Sides by the British playwright Ronald Harwood. Bouquet announced his retirement from stage in 2019. ...\n\nSource: Article \"Michel Bouquet\" from Wikipedia in English, licensed under CC-BY-SA.",
        "birthday": "1925-11-06",
        "deathday": "2022-04-13",
        "gender": 2,
        "homepage": null,
        "id": 11989,
        "imdb_id": "nm0099677",
        "known_for_department": "Acting",
        "name": "Michel Bouquet",
        "place_of_birth": "Paris, France",
        "popularity": 0.2283,
        "profile_path": "/gO5k3d51j7rvYatUUo3WvgvgACO.jpg"
    }
}