{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cnl95VtUon66J1PLRPpsgYgwHF7.jpg",
                "genre_ids": [
                    99,
                    36
                ],
                "id": 803,
                "original_language": "fr",
                "original_title": "Nuit et Brouillard",
                "overview": "Filmmaker Alain Resnais documents the atrocities behind the walls of Hitler's concentration camps.",
                "popularity": 2.4796,
                "poster_path": "/2iWYQia8enOai7QEO3TvenleD7r.jpg",
                "release_date": "1959-04-27",
                "title": "Night and Fog",
                "video": false,
                "vote_average": 8.243,
                "vote_count": 522,
                "character": "Self (archive footage) (uncredited)",
                "credit_id": "52fe4278c3a36847f8021475",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Heinrich Luitpold Himmler ( 7 October 1900 – 23 May 1945) was Reichsführer of the SS, a military commander, and a leading member of the Nazi Party. As Chief of the German Police and later the Minister of the Interior, Himmler oversaw all internal and external police and security forces, including the Gestapo (Secret State Police). Serving as Reichsführer and later as Commander of the Replacement (Home) Army and General Plenipotentiary for the entire Reich's administration (Generalbevollmächtigter für die Verwaltung), Himmler rose to become one of the most powerful men in Nazi Germany as well as one of the persons most directly responsible for the Holocaust. As overseer of the concentration camps, extermination camps, and Einsatzgruppen (literally: task forces, often used as killing squads), Himmler coordinated the killing of some six million Jews, between 200,000 and 500,000 Roma, many prisoners of war, and possibly another three to four million Poles, communists, or other groups whom the Nazis deemed unworthy to live or simply \"in the way\", including homosexuals, people with physical and mental disabilities, Jehovah's Witnesses and members of the Confessing Church. Shortly before the end of the war, he offered to surrender both Germany and himself to the Western Allies if he were spared prosecution. After being arrested by British forces, he committed suicide before he could be questioned.\n\nDescription above from the Wikipedia article Heinrich Himmler  licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1900-10-07",
        "deathday": "1945-05-23",
        "gender": 2,
        "homepage": null,
        "id": 11991,
        "imdb_id": "nm0385441",
        "known_for_department": "Acting",
        "name": "Heinrich Himmler",
        "place_of_birth": "München, Germany",
        "popularity": 0.173,
        "profile_path": "/Aljparz5AOPTPrgVFDFahutWBak.jpg"
    }
}