{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zoVeIgKzGJzpdG6Gwnr7iOYfIMU.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 11216,
                "original_language": "it",
                "original_title": "Nuovo Cinema Paradiso",
                "overview": "A filmmaker recalls his childhood, when he fell in love with the movies at his village's theater and formed a deep friendship with the theater's projectionist.",
                "popularity": 6.5115,
                "poster_path": "/gCI2AeMV4IHSewhJkzsur5MEp6R.jpg",
                "release_date": "1988-11-17",
                "title": "Cinema Paradiso",
                "video": false,
                "vote_average": 8.433,
                "vote_count": 4607,
                "character": "Ignazio, usher",
                "credit_id": "52fe44129251416c75027f45",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/lzSEhkipvwLLmL3PUIDreQCJdqs.jpg",
                "genre_ids": [
                    18,
                    35,
                    10749
                ],
                "id": 25846,
                "original_language": "it",
                "original_title": "Baarìa",
                "overview": "Giuseppe Tornatore traces three generations of a Sicilian family in in the Sicilian town of Bagheria (known as Baarìa in the local Sicilian dialect), from the 1930s to the 1980s, to tell the story of the loves, dreams and delusions of an unusual community.",
                "popularity": 2.4397,
                "poster_path": "/rmXfpOSsgX7uLzScCodIZP4Kcke.jpg",
                "release_date": "2009-09-25",
                "title": "Baaria",
                "video": false,
                "vote_average": 7.236,
                "vote_count": 649,
                "character": "Liborio",
                "credit_id": "52fe44e0c3a368484e03bdd9",
                "order": 22
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Leo",
            "Salvatore Leopoldo Gullotta"
        ],
        "biography": "Salvatore Leopoldo \"Leo\" Gullotta (born 9 January 1946) is an Italian actor, voice actor, comedian and writer.\n\nBorn in Catania and the last of six children, Gullotta started his career as an extra in Teatro Massimo Bellini. In his long career as actor, Gullotta has starred in about 100 films and has participated in numerous shows and drama series for television. In 1987 he won his first David di Donatello for Best Supporting Actor for his role in Il Camorrista by Giuseppe Tornatore, and later worked with Tornatore four more times. In 1997 and 2000 he won two more David di Donatello for Best Supporting Actor, for the Maurizio Zaccaro films Il carniere and Un uomo perbene. He has also won two Silver Ribbon for Best supporting Actor, in 1984 for Mi manda Picone by Nanni Loy and in 2001 for Vajont by Renzo Martinelli.\n\nGullotta has starred in many theatrical plays and dramas, and was part of the theater company \"Il Bagaglino\". He won the Flaiano Prize as stage actor of the year in 2010. He celebrated fifty years of activity that same year.\n\nGullotta is also a well known voice actor, among others. He was the Italian voice of Manny in the first three films of the Ice Age film series. He reprised this role in short films and video games. He also dubbed Burt Young in Rocky, Joe Pesci in Once Upon a Time in America, Moonwalker, My Cousin Vinny and The Irishman, and the robot Johnny 5 in Short Circuit. He also became the new Italian voice of Woody Allen after the death of Oreste Lionello in 2009.\n\nIn 1998 Gullotta debuted as writer with the book Mille fili d'erba (Di Renzo Editore, ISBN 88-86044-87-9).\n\nGullotta is openly gay. He did not reveal his sexuality to the public until 1995. In 2019, he married his partner of 32 years. Gullotta is discreet about the details of his husband.\n\nSource: Article \"Leo Gullotta\" from Wikipedia in english, licensed under CC-BY-SA 3.0.",
        "birthday": "1946-01-09",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 119992,
        "imdb_id": "nm0347842",
        "known_for_department": "Acting",
        "name": "Leo Gullotta",
        "place_of_birth": "Catania, Sicily, Italy",
        "popularity": 1.0376,
        "profile_path": "/wn9LQjKRZxrXm6a5zyfrLs71ChM.jpg"
    }
}