{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6f50k0bAekjxDvVvGC1SupJSzf4.jpg",
                "genre_ids": [
                    10749,
                    35,
                    18
                ],
                "id": 804,
                "original_language": "en",
                "original_title": "Roman Holiday",
                "overview": "Overwhelmed by her suffocating schedule, touring European princess Ann takes off for a night while in Rome. When a sedative she took from her doctor kicks in, however, she falls asleep on a park bench and is found by an American reporter, Joe Bradley, who takes her back to his apartment for safety. At work the next morning, Joe finds out Ann's regal identity and bets his editor he can get exclusive interview with her, but romance soon gets in the way.",
                "popularity": 5.7726,
                "poster_path": "/8lI9dmz1RH20FAqltkGelY1v4BE.jpg",
                "release_date": "1953-08-26",
                "title": "Roman Holiday",
                "video": false,
                "vote_average": 7.885,
                "vote_count": 2150,
                "character": "Charwoman",
                "credit_id": "52fe4279c3a36847f8021523",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/aRKEjGZEg3YwiuDVgyJpY6TUiE4.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 12548,
                "original_language": "it",
                "original_title": "I vitelloni",
                "overview": "Five young men dream of success as they drift lazily through life in a small Italian village. Fausto, the group's leader, is a womanizer; Riccardo craves fame; Alberto is a hopeless dreamer; Moraldo fantasizes about life in the city; and Leopoldo is an aspiring playwright. As Fausto chases a string of women, to the horror of his pregnant wife, the other four blunder their way from one uneventful experience to the next.",
                "popularity": 1.8352,
                "poster_path": "/boqcM6bhQICnNue4pkgmauj9JN3.jpg",
                "release_date": "1953-09-17",
                "title": "I Vitelloni",
                "video": false,
                "vote_average": 7.652,
                "vote_count": 705,
                "character": "Signora Rubini",
                "credit_id": "53551c480e0a26561d006276",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Italian film actress whose career spanned nine decades of cinema. She also made a substantial contribution to theatre.  She entered film in 1916 in the silent picture Jacobo Ortis directed by Giuseppe Sterni, and made over 80 film appearances between then and 1990.  Appearing in several silent films before 1921 she was absent from cinema for some 14 years during which time she made numerous stage appearances. She gained notoriety in 1925 when she appeared in a show as a mermaid exposing her breasts which she saw as natural in the role but caused considerable outrage at the time. She returned to the silver screen in 1936 in the Mario Mattoli film L' Uomo che sorride.  She went on to appear in films such as the Carlo Lizzani-directed film Ai margini della metropoli in 1952 in which she appeared alongside the main cast of Massimo Girotti, Marina Berti and Giulietta Masina. Between 1936 and 1956 her career was at its peak and her roles gradually became less numerous in the decades that followed, making a final appearance in the Giorgio Mosa filmBlue dolphin - l'avventura continua in 1990.  She died of a stroke aged 95 on 9 April 1995. (wikipedia)",
        "birthday": "1900-01-01",
        "deathday": "1995-04-09",
        "gender": 1,
        "homepage": null,
        "id": 12005,
        "imdb_id": "nm0095979",
        "known_for_department": "Acting",
        "name": "Paola Borboni",
        "place_of_birth": "Golese",
        "popularity": 0.5776,
        "profile_path": "/6UxbsxVBPQee2jPyXde8LzaV3U7.jpg"
    }
}