{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/t9N0AYD6j2d3dSPDdeOhhLmz1nb.jpg",
                "genre_ids": [
                    14,
                    35
                ],
                "id": 11687,
                "original_language": "fr",
                "original_title": "Les Visiteurs",
                "overview": "After a wizard's spell goes awry, 12th-century Gallic knight Godefroy de Papincourt, Count of Montmirail finds himself transported to 1993, along with his dimwitted servant, Jacquouille la Fripouille. Startled and perplexed by modern technology, the duo run amok, destroying cars and causing chaos until they meet Beatrice de Montmirail, an aristocratic descendant of the nobleman, who may be able to help them get back to 1123.",
                "popularity": 2.9618,
                "poster_path": "/hPCq0buG5PaXgKjzT2ktjrjlpbj.jpg",
                "release_date": "1993-01-27",
                "title": "The Visitors",
                "video": false,
                "vote_average": 7.122,
                "vote_count": 1991,
                "character": "Le facteur",
                "credit_id": "664e052149f1c1501cb997cf",
                "order": 34
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Mouss Théophile Sowie",
            "Théophile Moussa Sowie"
        ],
        "biography": "Moussa Théophile Sowie a suivi une formation notamment à l'Institut des études théâtrales Paris III Sorbonne Nouvelle et à l'Ecole d'art dramatique Jacques Lecoq à Paris. Il a joué au théâtre dans Chute et Jeanne au bûcher mise en scène Claude Régy Le chariot de terre cuite mise en scène Patrick Le Mauff, Tabataba et Combat de nègre et de chiens mise en scène M. Touré, Dans la solitude des champs de coton mis en scène Anita Picchiarini, 9 mm mis en scène Stéphanie Loïk, La voix du griot mise en scène Sotigui Kouyaté, L'île des esclaves mise en scène D. Lardenois?. Au cinéma il a joué Le postier dans \"Les visiteurs\" (Jean-Marie Poiré, France, 1993) et \"Les Couloirs du temps : Les visiteurs II\" (Jean-Marie Poiré, France, 1997) avec Christian Clavier et Jean Reno. Ou encore Maurice MPOLO dans \"Lumumba\" (Raoul Peck, Haïti, 2000), \"La note bleue\" d'Andrzej Zulawski, \"L'Afrance\" de Alain Gomis, \"Magnolia\" de I. Smidt, \"Moolaadé\" de Ousmane Sembene? A la télévision il a travaillé sous la direction de Yves Renier, P. Jamain, P. Roy, P. Lefebvre?",
        "birthday": "1960-07-15",
        "deathday": "2021-04-07",
        "gender": 2,
        "homepage": null,
        "id": 1200631,
        "imdb_id": "nm0816380",
        "known_for_department": "Acting",
        "name": "Théophile Sowié",
        "place_of_birth": null,
        "popularity": 0.0538,
        "profile_path": "/a408GGgCtKRsGWP8WfNZcscs129.jpg"
    }
}