{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wSiBXaJ2PtlxUGH2waIxQZjFPhg.jpg",
                "genre_ids": [
                    28,
                    12,
                    35,
                    80
                ],
                "id": 11576,
                "original_language": "en",
                "original_title": "It's a Mad, Mad, Mad, Mad World",
                "overview": "A group of strangers come across a man dying after a car crash who proceeds to tell them about the $350,000 he buried in California. What follows is the madcap adventures of those strangers as each attempts to claim the prize for himself.",
                "popularity": 7.5039,
                "poster_path": "/j4mWzOisSHFkaqIkq34l2mm8a5K.jpg",
                "release_date": "1963-11-07",
                "title": "It's a Mad, Mad, Mad, Mad World",
                "video": false,
                "vote_average": 6.97,
                "vote_count": 637,
                "character": "Spectator (uncredited)",
                "credit_id": "649db6df5aba3200ac18bb37",
                "order": 53
            },
            {
                "adult": false,
                "backdrop_path": "/rsI82F7DadIQcrZyPbuwmkhN5ty.jpg",
                "genre_ids": [
                    35
                ],
                "id": 3034,
                "original_language": "en",
                "original_title": "Young Frankenstein",
                "overview": "A young neurosurgeon inherits the castle of his grandfather, the famous Dr. Victor von Frankenstein. In the castle he finds a funny hunchback, a pretty lab assistant and the elderly housekeeper. Young Frankenstein believes that the work of his grandfather was delusional, but when he discovers the book where the mad doctor described his reanimation experiment, he suddenly changes his mind.",
                "popularity": 3.9553,
                "poster_path": "/c6335WJCZO8NK5wehHk5sA9Cypv.jpg",
                "release_date": "1974-12-15",
                "title": "Young Frankenstein",
                "video": false,
                "vote_average": 7.867,
                "vote_count": 3247,
                "character": "Villager",
                "credit_id": "649db66a091e62012d9e448f",
                "order": 38
            },
            {
                "adult": false,
                "backdrop_path": "/qszuXKhzYR24oRpsmh7eZaPbvL8.jpg",
                "genre_ids": [
                    18,
                    27,
                    53
                ],
                "id": 805,
                "original_language": "en",
                "original_title": "Rosemary's Baby",
                "overview": "A young couple, Rosemary and Guy, moves into an infamous New York apartment building, known by frightening legends and mysterious events, with the purpose of starting a family.",
                "popularity": 3.3933,
                "poster_path": "/uYgvlHceRFjAFbsNeMInYcLZLUb.jpg",
                "release_date": "1968-06-12",
                "title": "Rosemary's Baby",
                "video": false,
                "vote_average": 7.825,
                "vote_count": 4132,
                "character": "Man in Dream Sequence (uncredited)",
                "credit_id": "649db6a8c9dbf90107e12670",
                "order": 22
            },
            {
                "adult": false,
                "backdrop_path": "/i7n9u1SppzXcSO2EVgwEehzABzm.jpg",
                "genre_ids": [
                    37
                ],
                "id": 17529,
                "original_language": "en",
                "original_title": "True Grit",
                "overview": "The murder of her father sends a teenage tomboy on a mission of 'justice', which involves avenging her father's death. She recruits a tough old marshal, 'Rooster' Cogburn because he has 'true grit', and a reputation of getting the job done.",
                "popularity": 4.1273,
                "poster_path": "/9TjGjAD2deCtIG4ebi8LhIyFK6j.jpg",
                "release_date": "1969-06-11",
                "title": "True Grit",
                "video": false,
                "vote_average": 7.331,
                "vote_count": 818,
                "character": "Courtroom Spectator (uncredited)",
                "credit_id": "633710658f26bc00791ce232",
                "order": 44
            },
            {
                "adult": false,
                "backdrop_path": "/eMgflonfRY89Zj4LZykJKPpG4wg.jpg",
                "genre_ids": [
                    18
                ],
                "id": 596,
                "original_language": "en",
                "original_title": "The Grapes of Wrath",
                "overview": "Tom Joad returns to his home after a jail sentence to find his family kicked out of their farm due to foreclosure. He catches up with them on his Uncle’s farm, and joins them the next day as they head for California and a new life... Hopefully.",
                "popularity": 5.0306,
                "poster_path": "/eUcxMVBIA0Jg8l1RGUqycrc3eIQ.jpg",
                "release_date": "1940-03-15",
                "title": "The Grapes of Wrath",
                "video": false,
                "vote_average": 7.817,
                "vote_count": 1042,
                "character": "Guard (uncredited)",
                "credit_id": "55e501c1925141379d000874",
                "order": 70
            },
            {
                "adult": false,
                "backdrop_path": "/a3eYLIK5eYSHAJTtOy9PdciVjxx.jpg",
                "genre_ids": [
                    18
                ],
                "id": 28580,
                "original_language": "en",
                "original_title": "The Lost Weekend",
                "overview": "Don Birnam, a long-time alcoholic, has been sober for ten days and appears to be over the worst... but his craving has just become more insidious. Evading a country weekend planned by his brother and girlfriend, he begins a four-day bender that just might be his last - one way or another.",
                "popularity": 2.7953,
                "poster_path": "/8ggIOoCzt8xT2ePl8DdlRtXgcOh.jpg",
                "release_date": "1945-11-29",
                "title": "The Lost Weekend",
                "video": false,
                "vote_average": 7.628,
                "vote_count": 629,
                "character": "Mike (uncredited)",
                "credit_id": "55e734909251416c1600033b",
                "order": 51
            },
            {
                "adult": false,
                "backdrop_path": "/u7i1XtbOubq0xwRy2Zbgmox6g9W.jpg",
                "genre_ids": [
                    18
                ],
                "id": 220,
                "original_language": "en",
                "original_title": "East of Eden",
                "overview": "In the Salinas Valley in and around World War I, Cal Trask feels he must compete against overwhelming odds with his brother for the love of their father. Cal is frustrated at every turn, from his reaction to the war, how to get ahead in business and in life, and how to relate to his estranged mother.",
                "popularity": 4.8688,
                "poster_path": "/xv1MZVIop0SQqwLUymgE5eb2LFl.jpg",
                "release_date": "1955-04-10",
                "title": "East of Eden",
                "video": false,
                "vote_average": 7.55,
                "vote_count": 775,
                "character": "Workman (uncredited)",
                "credit_id": "63b1a390c56d2d0089b219fe",
                "order": 79
            },
            {
                "adult": false,
                "backdrop_path": "/3q35nBLCIdEbxYfsr7D5ocYQXKz.jpg",
                "genre_ids": [
                    18,
                    10751,
                    14
                ],
                "id": 1585,
                "original_language": "en",
                "original_title": "It's a Wonderful Life",
                "overview": "A holiday favourite for generations...  George Bailey has spent his entire life giving to the people of Bedford Falls.  All that prevents rich skinflint Mr. Potter from taking over the entire town is George's modest building and loan company.  But on Christmas Eve the business's $8,000 is lost and George's troubles begin.",
                "popularity": 6.3809,
                "poster_path": "/bSqt9rhDZx1Q7UZ86dBPKdNomp2.jpg",
                "release_date": "1946-12-20",
                "title": "It's a Wonderful Life",
                "video": false,
                "vote_average": 8.272,
                "vote_count": 4589,
                "character": "Cashier / Nick's Assistant Bouncer (uncredited)",
                "credit_id": "55ef178e9251413e3e01b208",
                "order": 113
            },
            {
                "adult": false,
                "backdrop_path": "/zP6pqpSRRiOCjjC5oWKZKkHqoSB.jpg",
                "genre_ids": [
                    18
                ],
                "id": 595,
                "original_language": "en",
                "original_title": "To Kill a Mockingbird",
                "overview": "Scout Finch, 6, and her older brother Jem live in sleepy Maycomb, Alabama, spending much of their time with their friend Dill and spying on their reclusive and mysterious neighbor, Boo Radley. When Atticus, their widowed father and a respected lawyer, defends a black man named Tom Robinson against fabricated rape charges, the trial and tangent events expose the children to evils of racism and stereotyping.",
                "popularity": 4.5981,
                "poster_path": "/gZycFUMLx2110dzK3nBNai7gfpM.jpg",
                "release_date": "1962-12-20",
                "title": "To Kill a Mockingbird",
                "video": false,
                "vote_average": 7.991,
                "vote_count": 2724,
                "character": "Courtroom Spectator (uncredited)",
                "credit_id": "55f30282c3a3686cfd0002d0",
                "order": 62
            },
            {
                "adult": false,
                "backdrop_path": "/h1vBJ0uN4QCbBb5WVKxmtfTrHoY.jpg",
                "genre_ids": [
                    37
                ],
                "id": 11697,
                "original_language": "en",
                "original_title": "The Man Who Shot Liberty Valance",
                "overview": "Questions arise when Senator Stoddard attends the funeral of a local man named Tom Doniphon in a small Western town. Flashing back, we learn Doniphon saved Stoddard, then a lawyer, when he was roughed up by a crew of outlaws terrorizing the town, led by Liberty Valance. As the territory's safety hung in the balance, Doniphon and Stoddard, two of the only people standing up to him, proved to be very important, but different, foes to Valance.",
                "popularity": 2.5409,
                "poster_path": "/4C1R0LEivLjbv3swAzJfzh0tzXl.jpg",
                "release_date": "1962-04-13",
                "title": "The Man Who Shot Liberty Valance",
                "video": false,
                "vote_average": 7.808,
                "vote_count": 1216,
                "character": "Townsman (uncredited)",
                "credit_id": "5700127e9251417647000906",
                "order": 38
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Maxwell Wagner"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nMax Wagner (November 28, 1901 – November 16, 1975) was a Mexican-born American film actor who specialized in playing small parts such as thugs, gangsters, sailors, henchmen, bodyguards, cab drivers and moving men, appearing more than 400 films in his career, most without receiving screen credit. Newspaper gossip columnists noted his rise from playing \"Gangster #4\", with no lines, and not carrying a gun, to \"Gangster #2\", with both lines and a gun.\n\nWagner was one of five children, all boys, of William Wallace Wagner, a railroad conductor, and Edith Wagner, a writer who provided dispatches for the Christian Science Monitor during the Mexican Revolution. When he was 10 years old, his father was killed by rebels and the family moved to Salinas, California, where he met John Steinbeck, who became a lifelong friend. Steinback based the character of the boy in his novel The Red Pony on Wagner.\n\nUnder the name \"Max Baron\", Wagner acted in many Spanish-language versions of English-language films, which studios made as a matter of course in the early days of sound films, He also served as a Spanish language coach for other actors, and appeared in many of the \"Mexican Spitfire\" films starring Lupe Vélez, where he also served to monitor Velez's Spanish ad-libs for profanity.\n\nOther series that Wagner appeared in include the Charlie Chan films, and Tom Mix serials, as well as others made by Mascot Pictures Corporation. In the 1940s, Wagner was part of Preston Sturges' unofficial \"stock company\" of character actors, appearing in six films written and directed by Sturges, beginning with The Palm Beach Story\n\nIn 1940 during the filming of \"The Mad Doctor\", Wagner was credited for driving 50,000 miles as an on-screen taxi driver on the studio back lots of Hollywood. Since his appearance as a cab driver in Charlie Chan in Shanghai (1935), producers often cast him as a wise-cracking or henchman taxi driver. \"I was cast as a taxi driver about five years ago\", Wagner told a reporter. \"And I was typed.\"\n\nIn 1952, Wagner began to appear on television, in episodes of such shows as The Cisco Kid, Zane Grey Theater and Perry Mason, playing much the same kind of parts he played in the movies.\n\nHe was a regular cast member on the western television series Gunsmoke, making nearly 80 appearances between 1959 and 1973. He also appeared in many episodes of The Rifleman, Bonanza, Cimarron Strip, The Wild Wild West and Maverick, including a guest-starring role in the 1959 Rifleman episode \"Blood Brother.\" He also had roles in the original Star Trek and The Twilight Zone series. He appeared in more than 200 television episodes between 1952 and 1974.\n\nNotable film roles for Wagner include a supporting role in the cult science fiction classic Invaders from Mars (1953), an actor playing a gangster in the film-within-a-film segment of Bullets or Ballots (1936), and the bull farm attendant in the Laurel and Hardy comedy The Bullfighters (1945).\n\nLate in his career, he appeared in To Kill a Mockingbird (1962) and The Man Who Shot Liberty Valance (1962). He also occasionally composed music, such as the Mexican folk ballad \"Pedro, Rudarte y Simon\" in the Western film The Last Trail (1933).\n\nWagner died of a heart attack in Hollywood in 1975.",
        "birthday": "1901-11-28",
        "deathday": "1975-11-16",
        "gender": 2,
        "homepage": null,
        "id": 120178,
        "imdb_id": "nm0906022",
        "known_for_department": "Acting",
        "name": "Max Wagner",
        "place_of_birth": "Torreon, Coahuila, Mexico",
        "popularity": 0.5388,
        "profile_path": null
    }
}