{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/oCC3rSccbJV9bxMDRedtqI6pnla.jpg",
                "genre_ids": [
                    35
                ],
                "id": 11030,
                "original_language": "en",
                "original_title": "Zelig",
                "overview": "Fictional documentary about the life of human chameleon Leonard Zelig, a man who becomes a celebrity in the 1920s due to his ability to look and act like whoever is around him. Clever editing places Zelig in real newsreel footage of Woodrow Wilson, Babe Ruth, and others.",
                "popularity": 3.1142,
                "poster_path": "/bfs67JaV4B5xVBvtXd3O4R7nk9G.jpg",
                "release_date": "1983-07-15",
                "title": "Zelig",
                "video": false,
                "vote_average": 7.425,
                "vote_count": 887,
                "character": "Saul Bellow - Contemporary Interviews",
                "credit_id": "566784949251417401000ada",
                "order": 30
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Saul Bellow (born Solomon Bellows; 10 June 1915 – 5 April 2005) was a Canadian-born American writer. For his literary work, Bellow was awarded the Pulitzer Prize, the Nobel Prize for Literature, and the National Medal of Arts. He is the only writer to win the National Book Award for Fiction three times and he received the National Book Foundation's lifetime Medal for Distinguished Contribution to American Letters in 1990.\n\nIn the words of the Swedish Nobel Committee, his writing exhibited \"the mixture of rich picaresque novel and subtle analysis of our culture, of entertaining adventure, drastic and tragic episodes in quick succession interspersed with philosophic conversation, all developed by a commentator with a witty tongue and penetrating insight into the outer and inner complications that drive us to act, or prevent us from acting, and that can be called the dilemma of our age.\" His best-known works include The Adventures of Augie March, Henderson the Rain King, Herzog, Mr. Sammler's Planet, Seize the Day, Humboldt's Gift and Ravelstein. Bellow was regarded as an important author of 20th century American literature.\n\nBellow said that of all his characters, Eugene Henderson, of Henderson the Rain King, was the one most like himself. Bellow grew up as an immigrant from Quebec. As Christopher Hitchens describes it, Bellow's fiction and principal characters reflect his own yearning for transcendence, a battle \"to overcome not just ghetto conditions but also ghetto psychoses.\" Bellow's protagonists, in one shape or another, all wrestle with what Albert Corde, the dean in The Dean's December, called \"the big-scale insanities of the 20th century.\" This transcendence of the \"unutterably dismal\" (a phrase from Dangling Man) is achieved, if it can be achieved at all, through a \"ferocious assimilation of learning\" (Hitchens) and an emphasis on nobility.\n\nFrom Wikipedia, the free encyclopedia.",
        "birthday": "1915-07-10",
        "deathday": "2005-04-05",
        "gender": 2,
        "homepage": null,
        "id": 1201850,
        "imdb_id": "nm0069231",
        "known_for_department": "Writing",
        "name": "Saul Bellow",
        "place_of_birth": "Lachine, Quebec, Canada",
        "popularity": 0.083,
        "profile_path": "/ooS7bADZ7cduKpyHZdhg2spk4Ei.jpg"
    }
}