{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fwxOQkzYtRVKs3kzcyukdbsyIuh.jpg",
                "genre_ids": [
                    14,
                    16,
                    10751,
                    12
                ],
                "id": 10150,
                "original_language": "en",
                "original_title": "The Last Unicorn",
                "overview": "From a riddle-speaking butterfly, a unicorn learns that she is supposedly the last of her kind, all the others having been herded away by the Red Bull. The unicorn sets out to discover the truth behind the butterfly's words. She is eventually joined on her quest by Schmendrick, a second-rate magician, and Molly Grue, a now middle-aged woman who dreamed all her life of seeing a unicorn. Their journey leads them far from home, all the way to the castle of King Haggard.",
                "popularity": 4.6738,
                "poster_path": "/2MhDPbadE2ha83qiFwUHPgmKLnV.jpg",
                "release_date": "1982-11-19",
                "title": "The Last Unicorn",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 545,
                "character": "Unicorn / Amalthea (voice)",
                "credit_id": "52fe43369251416c75007b01",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/qszuXKhzYR24oRpsmh7eZaPbvL8.jpg",
                "genre_ids": [
                    18,
                    27,
                    53
                ],
                "id": 805,
                "original_language": "en",
                "original_title": "Rosemary's Baby",
                "overview": "A young couple, Rosemary and Guy, moves into an infamous New York apartment building, known by frightening legends and mysterious events, with the purpose of starting a family.",
                "popularity": 3.2262,
                "poster_path": "/uYgvlHceRFjAFbsNeMInYcLZLUb.jpg",
                "release_date": "1968-06-12",
                "title": "Rosemary's Baby",
                "video": false,
                "vote_average": 7.825,
                "vote_count": 4132,
                "character": "Rosemary Woodhouse",
                "credit_id": "52fe4279c3a36847f80215b9",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/esdhJI8DcJuRJooQ7pAtK2ekNqE.jpg",
                "genre_ids": [
                    9648
                ],
                "id": 4192,
                "original_language": "en",
                "original_title": "Death on the Nile",
                "overview": "As Hercule Poirot enjoys a luxurious cruise down the Nile, a newlywed heiress is found murdered on board and every elegant passenger becomes a prime suspect.",
                "popularity": 3.9446,
                "poster_path": "/7qEymSp6wCT19AJxb7T3u6aKpi1.jpg",
                "release_date": "1978-09-29",
                "title": "Death on the Nile",
                "video": false,
                "vote_average": 7.137,
                "vote_count": 851,
                "character": "Jacqueline de Bellefort",
                "credit_id": "52fe43b1c3a36847f80682af",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/3wwMtp2F7CgmOl2EX9q1r2yjOEk.jpg",
                "genre_ids": [
                    14,
                    35,
                    10749
                ],
                "id": 10849,
                "original_language": "en",
                "original_title": "The Purple Rose of Cairo",
                "overview": "Cecilia is a waitress in New Jersey, living a dreary life during the Great Depression. Her only escape from her mundane reality is the movie theatre. After losing her job, Cecilia goes to see 'The Purple Rose of Cairo' in hopes of raising her spirits, where she watches dashing archaeologist Tom Baxter time and again.",
                "popularity": 4.2724,
                "poster_path": "/ccsint43E44B7NGceEhVimD93Yt.jpg",
                "release_date": "1985-03-01",
                "title": "The Purple Rose of Cairo",
                "video": false,
                "vote_average": 7.403,
                "vote_count": 1083,
                "character": "Cecilia",
                "credit_id": "52fe43c29251416c7501d0b3",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/oCC3rSccbJV9bxMDRedtqI6pnla.jpg",
                "genre_ids": [
                    35
                ],
                "id": 11030,
                "original_language": "en",
                "original_title": "Zelig",
                "overview": "Fictional documentary about the life of human chameleon Leonard Zelig, a man who becomes a celebrity in the 1920s due to his ability to look and act like whoever is around him. Clever editing places Zelig in real newsreel footage of Woodrow Wilson, Babe Ruth, and others.",
                "popularity": 3.3773,
                "poster_path": "/bfs67JaV4B5xVBvtXd3O4R7nk9G.jpg",
                "release_date": "1983-07-15",
                "title": "Zelig",
                "video": false,
                "vote_average": 7.432,
                "vote_count": 886,
                "character": "Dr. Eudora Nesbitt Fletcher",
                "credit_id": "52fe43e79251416c750227ed",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/jx6jUMCLhRWB05ngVjaGxPpLq5x.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 5143,
                "original_language": "en",
                "original_title": "Hannah and Her Sisters",
                "overview": "Between two Thanksgivings, Hannah's husband falls in love with her sister Lee, while her hypochondriac ex-husband rekindles his relationship with her sister Holly.",
                "popularity": 2.1681,
                "poster_path": "/gARgIRb2QFRFVrsziwWE389u1pK.jpg",
                "release_date": "1986-02-07",
                "title": "Hannah and Her Sisters",
                "video": false,
                "vote_average": 7.498,
                "vote_count": 1088,
                "character": "Hannah",
                "credit_id": "52fe43f6c3a36847f807aac3",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/xDPaSuwaOizRNPitEvNiuY7i6iE.jpg",
                "genre_ids": [
                    35,
                    18,
                    80
                ],
                "id": 11562,
                "original_language": "en",
                "original_title": "Crimes and Misdemeanors",
                "overview": "A renowned ophthalmologist is desperate to cut off an adulterous relationship…which ends up in murder; and a frustrated documentary filmmaker woos an attractive television producer while making a film about her insufferably self-centered boss.",
                "popularity": 2.1147,
                "poster_path": "/6vC6MLYUICH57MmEVi1UaNaj2Qs.jpg",
                "release_date": "1989-10-13",
                "title": "Crimes and Misdemeanors",
                "video": false,
                "vote_average": 7.419,
                "vote_count": 910,
                "character": "Halley Reed",
                "credit_id": "52fe445a9251416c75031c9b",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/rn3E4Kd7EUOGOF95Hsd0aOhQqZg.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 30890,
                "original_language": "en",
                "original_title": "Radio Days",
                "overview": "The Narrator tells us how the radio influenced his childhood in the days before TV. In the New York City of the late 1930s to the New Year's Eve 1944, this coming-of-age tale mixes the narrator's experiences with contemporary anecdotes and urban legends of the radio stars.",
                "popularity": 4.5524,
                "poster_path": "/ljZ3yyYznAiq1vF6nHITdJn6qXB.jpg",
                "release_date": "1987-01-30",
                "title": "Radio Days",
                "video": false,
                "vote_average": 7.056,
                "vote_count": 602,
                "character": "Sally White",
                "credit_id": "52fe44489251416c9100b35d",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "미아 패로우",
            "Maria de Lourdes Villiers Farrow",
            "Міа Ферроу"
        ],
        "biography": "María de Lourdes Villiers \"Mia\" Farrow (born February 9, 1945) is an American actress, activist, and former fashion model. Farrow has appeared in more than 50 films and won numerous awards, including a Golden Globe Award and three BAFTA Award nominations. Farrow is also known for her extensive work as a UNICEF Goodwill Ambassador, which includes humanitarian activities in Darfur, Chad, and the Central African Republic. In 2008, Time magazine named her one of the most influential people in the world.\n\nThe eldest daughter of Australian director John Farrow and Irish actress Maureen O'Sullivan, Farrow had a strict Catholic upbringing in Beverly Hills, California. After working as a fashion model during her teenage years, she first gained notice for her role as Allison MacKenzie in the television soap opera Peyton Place (1964–1966). Her credited feature film debut in Guns at Batasi (1964) earned her a Golden Globe Award for New Star of the Year, and she gained further recognition for her subsequent two-year marriage to Frank Sinatra, whom she married at age 21. Farrow's portrayal of Rosemary Woodhouse in the horror film Rosemary's Baby (1968) earned her a nomination for a BAFTA Award and a Golden Globe Award for Best Actress. She received a third Golden Globe nomination for her role in John and Mary (1969).\n\nIn 1971, Farrow became the first American actress in history to join the Royal Shakespeare Company, appearing as Joan of Arc in a production of Jeanne d'Arc au bûcher. This was followed by stage productions of Mary Rose (1972), Three Sisters (1973), and Ivanov (1976). Farrow also starred in several films throughout the 1970s, including the 1974 film adaptation of The Great Gatsby and Robert Altman's comedy A Wedding (1978).\n\nFarrow began a relationship with filmmaker Woody Allen in 1979, and over a decade-long period starred in 13 of his films, beginning with A Midsummer Night's Sex Comedy (1982). She received numerous critical accolades for her performances in several of Allen's films, including Golden Globe Award nominations for Broadway Danny Rose (1984), The Purple Rose of Cairo (1985), and Alice (1990), as well as a BAFTA nomination for Hannah and Her Sisters (1986). After separating from Allen in 1992, Farrow made public allegations that he sexually assaulted their seven-year-old adopted daughter, Dylan, which he has repeatedly denied. Farrow retained custody of Dylan. These claims received significant renewed public attention after Dylan recounted the alleged assault in a 2013 interview.\n\nSince the 2000s, Farrow has made occasional appearances on television, including a recurring role on Third Watch (2001–2003). She has also had supporting parts in films such as The Omen (2006), Be Kind Rewind (2008), and Dark Horse (2011). Farrow has dedicated significant periods to raising her adopted and biological children, and she has taken part in humanitarian efforts abroad, particularly human rights in African countries.\n\nDescription above from the Wikipedia article Mia Farrow, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1945-02-09",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.miafarrow.org/",
        "id": 12021,
        "imdb_id": "nm0001201",
        "known_for_department": "Acting",
        "name": "Mia Farrow",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.8699,
        "profile_path": "/m3lC1ZtKPvTeCBudSfEzqQNXEiO.jpg"
    }
}