{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5dg3woJqG7kNBCEMZNGPUauHSnK.jpg",
                "genre_ids": [
                    28,
                    80,
                    53
                ],
                "id": 180299,
                "original_language": "id",
                "original_title": "The Raid 2: Berandal",
                "overview": "After fighting his way through an apartment building populated by an army of dangerous criminals and escaping with his life, SWAT team member Rama goes undercover, joining a powerful Indonesian crime syndicate to protect his family and uncover corrupt members of his own force.",
                "popularity": 4.6939,
                "poster_path": "/olA39iaXISiKEkACdELgr0ZRvIF.jpg",
                "release_date": "2014-03-27",
                "title": "The Raid 2",
                "video": false,
                "vote_average": 7.604,
                "vote_count": 2457,
                "character": "Father",
                "credit_id": "5dc82e9a470ead001896b25a",
                "order": 20
            },
            {
                "adult": false,
                "backdrop_path": "/4zzWj2pVmkjN9yjsQesEEnNtlZ4.jpg",
                "genre_ids": [
                    28,
                    53,
                    80
                ],
                "id": 94329,
                "original_language": "id",
                "original_title": "Serbuan Maut",
                "overview": "Deep in the heart of Jakarta's slums lies an impenetrable safe house for the world's most dangerous killers and gangsters. Until now, the run-down apartment block has been considered untouchable to even the bravest of police. Cloaked under the cover of pre-dawn darkness and silence, an elite swat team is tasked with raiding the safe house in order to take down the notorious drug lord that runs it.  But when a chance encounter with a spotter blows their cover and news of their assault reaches the drug lord, the building's lights are cut and all the exits blocked. Stranded on the sixth floor with no way out, the unit must fight their way through the city's worst to survive their mission. Starring Indonesian martial arts sensation Iko Uwais.",
                "popularity": 4.1057,
                "poster_path": "/Abnm1Ws3JH0ReCfEhLMPwPcMcGO.jpg",
                "release_date": "2012-03-22",
                "title": "The Raid",
                "video": false,
                "vote_average": 7.405,
                "vote_count": 3642,
                "character": "Rama's Father",
                "credit_id": "5e46e5472da8460018048ae1",
                "order": 30
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Hengky Soelaiman",
            "Hengki Solaiman",
            "Hengky Sulaiman",
            "Ong Hian Kie"
        ],
        "biography": "Ong Hian Kie, better known as Henky Solaiman (August 30, 1941 – May 15, 2020), was an Indonesian actor, director, and screenwriter of Chinese descent. He was the father of Indonesian actor Verdi Solaiman.\n\nHe had a career in the film industry since the 1970s and was recognized as one of the best character actors in Indonesian cinema and television.\n\nHenky started his career in theater before transitioning to film. His debut film was Wadjah Seorang Laki-Laki (1971), directed by Teguh Karya. Since then, he had frequently appeared in various films, including Pengkhianatan G30S/PKI (1984), Ca Bau Kan (2002), and Love for Sale (2018).\n\nAside from films, Henky was also active in television series and was known for portraying fatherly or wise elder figures.\n\nHenky Solaiman gradually reduced his activities in the entertainment industry due to health issues, particularly cancer. He passed away on May 15, 2020, at the age of 78.\n\nKnown as a dedicated actor, Henky left a significant legacy in the Indonesian film industry.",
        "birthday": "1941-08-30",
        "deathday": "2020-05-15",
        "gender": 2,
        "homepage": null,
        "id": 1202655,
        "imdb_id": "nm1146299",
        "known_for_department": "Acting",
        "name": "Henky Solaiman",
        "place_of_birth": "Bandung, West Java, Dutch East Indies",
        "popularity": 0.0832,
        "profile_path": "/iSZy6QCYKepsrD3RfmevOgNakNe.jpg"
    }
}