{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7kURId6slyHNujYpCFm0Z1M3kRt.jpg",
                "genre_ids": [
                    28,
                    878,
                    12
                ],
                "id": 49538,
                "original_language": "en",
                "original_title": "X-Men: First Class",
                "overview": "Before Charles Xavier and Erik Lensherr took the names Professor X and Magneto, they were two young men discovering their powers for the first time. Before they were arch-enemies, they were closest of friends, working together with other mutants (some familiar, some new), to stop the greatest threat the world has ever known.",
                "popularity": 0.4264,
                "poster_path": "/hNEokmUke0dazoBhttFN0o3L7Xv.jpg",
                "release_date": "2011-06-01",
                "title": "X-Men: First Class",
                "video": false,
                "vote_average": 7.298,
                "vote_count": 13126,
                "character": "Russian Soldier No. 2",
                "credit_id": "5e3ea3b641465c0014c944b5",
                "order": 29
            },
            {
                "adult": false,
                "backdrop_path": "/m0ObOaJBerZ3Unc74l471ar8Iiy.jpg",
                "genre_ids": [
                    28,
                    14
                ],
                "id": 547016,
                "original_language": "en",
                "original_title": "The Old Guard",
                "overview": "Four undying warriors who've secretly protected humanity for centuries become targeted for their mysterious powers just as they discover a new immortal.",
                "popularity": 9.6389,
                "poster_path": "/cjr4NWURcVN3gW5FlHeabgBHLrY.jpg",
                "release_date": "2020-07-09",
                "title": "The Old Guard",
                "video": false,
                "vote_average": 7.123,
                "vote_count": 4553,
                "character": "Andrei",
                "credit_id": "5f0423cfd34eb30037a47336",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Andrei Zayats was born in Rostov-na-Donu, Russian Federation. He moved to Riga, Latvia, with his parents and became a naturalized EU citizen. Andrei lived and studied five years in France, before moving to UK, where he graduated from Birmingham School of Acting in 2008. He is currently living in London, UK.\n\nAndrei is fluent in Russian, English, Latvian and French. He is an actor, who works in Film, Theatre, Television and Voiceover and is a member of: EQUITY, BECTU, AFDAS\n\nAndrei Zayats has played a supporting lead role Kovanski in a French period drama \"Madame Solario\"(CANAL+), set on the shores of Lake of Como, Italy. The production was directed by Rene Feret and filmed in August and September 2011 in France and Italy.\n\nIn 2011, he appeared as a Russian soldier in \"X-Men:First Class\"(FOX); a Russian officer, Dimitri, in \"Mercenaries\"(ABC Films) and in 2010, he appeared as a Russian chess champion Viktor Viktorious in the BBC TV series \"Dani's House\".\n\nAndrei is a qualified teacher of stage combat with the British Academy of Stage and Screen Combat and is also a member of the Society of American Fight Directors.",
        "birthday": "1984-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.e-talenta.eu/members/profile/andrei-zayats",
        "id": 1202629,
        "imdb_id": "nm3507110",
        "known_for_department": "Acting",
        "name": "Andrei Zayats",
        "place_of_birth": "Rostov-na-Donu, Rostovskaya oblast, RSFSR, USSR [now Russia]",
        "popularity": 0.2382,
        "profile_path": "/prKzxaBNCNQp5LHqLFJpyF0Xvke.jpg"
    }
}