{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qszuXKhzYR24oRpsmh7eZaPbvL8.jpg",
                "genre_ids": [
                    18,
                    27,
                    53
                ],
                "id": 805,
                "original_language": "en",
                "original_title": "Rosemary's Baby",
                "overview": "A young couple, Rosemary and Guy, moves into an infamous New York apartment building, known by frightening legends and mysterious events, with the purpose of starting a family.",
                "popularity": 3.2262,
                "poster_path": "/uYgvlHceRFjAFbsNeMInYcLZLUb.jpg",
                "release_date": "1968-06-12",
                "title": "Rosemary's Baby",
                "video": false,
                "vote_average": 7.825,
                "vote_count": 4132,
                "character": "Roman Castevet",
                "credit_id": "52fe4279c3a36847f80215c5",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Sydney Blackmer",
            "S.A. Blackmer",
            "Sidney Alderman Blackmer"
        ],
        "biography": "Sidney Alderman Blackmer (13 July 1895 – 6 October 1973) was an American actor.\n\nBlackmer was born and raised in Salisbury, North Carolina. He started off in an insurance and financial business but gave up on it. While working as a builder's laborer on a new building, he saw a Pearl White serial being filmed and immediately decided to go into acting. Blackmer went to New York hoping to act on the stage. While in the city, he took jobs and extra work at various film studios at the then motion picture capital, Fort Lee, New Jersey, including a bit part in the highly popular serial, The Perils of Pauline (1914).\n\nHe made his Broadway debut in 1917, but his career was interrupted by service in the U.S. military in World War I. After the war, he returned to the theatre and in 1929 returned to motion pictures and went on to be a major character actor in more than 120 films. He won the 1950 Tony Award for Best Actor (Drama) for his role in the Broadway play, Come Back, Little Sheba.\n\nIn film, Blackmer is remembered for his more than a dozen portrayals of U.S. President Theodore Roosevelt and for his role in the Academy Award-winning 1968 Roman Polanski film about urban New York witches, Rosemary's Baby, in which he played an over-solicitous neighbor.\n\nA humanitarian, Blackmer served as the national vice president of the United States Muscular Dystrophy Association. In 1972, he was honored with the North Carolina Award in the Fine Arts category. It is the state of North Carolina's highest civilian award. On his passing in 1973, Blackmer was interred in the Chestnut Hill Cemetery in his hometown of Salisbury, North Carolina.\n\nDescription above from the Wikipedia article Sidney Blackmer, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1895-07-12",
        "deathday": "1973-10-06",
        "gender": 2,
        "homepage": null,
        "id": 12022,
        "imdb_id": "nm0085782",
        "known_for_department": "Acting",
        "name": "Sidney Blackmer",
        "place_of_birth": "Salisbury, North Carolina, USA",
        "popularity": 0.2763,
        "profile_path": "/2JzR0u8yvrkp3e0GB5cajCqGDjp.jpg"
    }
}