{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kSlO1pHpwQfPQdgVPr7dJiJNtJ8.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749
                ],
                "id": 3082,
                "original_language": "en",
                "original_title": "Modern Times",
                "overview": "A bumbling tramp desires to build a home with a young woman, yet is thwarted time and time again by his lack of experience and habit of being in the wrong place at the wrong time..",
                "popularity": 4.5373,
                "poster_path": "/7uoiKOEjxBBW0AgDGQWrlfGQ90w.jpg",
                "release_date": "1936-02-05",
                "title": "Modern Times",
                "video": false,
                "vote_average": 8.283,
                "vote_count": 3884,
                "character": "Gamin's Sister (uncredited)",
                "credit_id": "558ab29bc3a3680dfb00280b",
                "order": 22
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Gloria Mildred DeHaven",
            "Gloria De Haven"
        ],
        "biography": "Gloria Mildred DeHaven (July 23, 1925-July 30, 2016) was an American actress, singer and a former contract star for Metro-Goldwyn-Mayer.\n\nDeHaven was born in Los Angeles, California, the daughter of actor-director, Carter DeHaven, and actress, Flora Parker DeHaven, both former vaudeville performers.\n\nShe began her career as a child actor with a bit part in Charlie Chaplin's Modern Times (1936). She was signed to a contract with MGM. Despite featured roles in such films as Best Foot Forward, The Thin Man Goes Home (1944) and Summer Stock (1950), and being voted by exhibitors as the third most likely to be a \"star of tomorrow'\" in 1944, she did not achieve film stardom. She portrayed her own mother, Flora Parker DeHaven, in the Fred Astaire film Three Little Words (1950).\n\nDeHaven also appeared as a regular in the television series and soap operas As the World Turns, Mary Hartman, Mary Hartman and Ryan's Hope. She was one of the numerous celebrities enticed to appear in the all-star box office flop, Won Ton Ton, the Dog Who Saved Hollywood (1976), and has guest starred in such television series as Robert Montgomery Presents, Appointment with Adventure (episode entitled \"The Snow People\"), The Guy Mitchell Show, Johnny Ringo (as Rosemary Blake in \"Love Affair\"), The Rifleman, Wagon Train, The Lloyd Bridges Show, Marcus Welby, M.D., Gunsmoke, Mannix, Fantasy Island, Hart to Hart, The Love Boat, Mama's Family, Highway to Heaven, Murder, She Wrote and Touched by an Angel. She was also on five episodes of Match Game 75 along with Patti Deutsch and Buck Owens as guest panelists.\n\nGloria DeHaven died July 30, 2016 (age 91), in Las Vegas, Nevada, USA.\n\nFrom Wikipedia.",
        "birthday": "1925-07-23",
        "deathday": "2016-07-30",
        "gender": 1,
        "homepage": null,
        "id": 120306,
        "imdb_id": "nm0002038",
        "known_for_department": "Acting",
        "name": "Gloria DeHaven",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.7145,
        "profile_path": "/ij6RuBeiDE0ugrBgBFfiMF0RkdY.jpg"
    }
}