{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8Qsr8pvDL3s1jNZQ4HK1d1Xlvnh.jpg",
                "genre_ids": [
                    14,
                    12
                ],
                "id": 259316,
                "original_language": "en",
                "original_title": "Fantastic Beasts and Where to Find Them",
                "overview": "In 1926, Newt Scamander arrives at the Magical Congress of the United States of America with a magically expanded briefcase, which houses a number of dangerous creatures and their habitats. When the creatures escape from the briefcase, it sends the American wizarding authorities after Newt, and threatens to strain even further the state of magical and non-magical relations.",
                "popularity": 11.5444,
                "poster_path": "/h6NYfVUyM6CDURtZSnBpz647Ldd.jpg",
                "release_date": "2016-11-16",
                "title": "Fantastic Beasts and Where to Find Them",
                "video": false,
                "vote_average": 7.311,
                "vote_count": 19239,
                "character": "Mr. Abernathy",
                "credit_id": "5792d153925141690f003a16",
                "order": 18
            },
            {
                "adult": false,
                "backdrop_path": "/ddIkmH3TpR6XSc47jj0BrGK5Rbz.jpg",
                "genre_ids": [
                    10752,
                    28,
                    18
                ],
                "id": 374720,
                "original_language": "en",
                "original_title": "Dunkirk",
                "overview": "The story of the miraculous evacuation of Allied soldiers from Belgium, Britain, Canada and France, who were cut off and surrounded by the German army from the beaches and harbour of Dunkirk between May 26th and June 4th 1940 during World War II.",
                "popularity": 8.077,
                "poster_path": "/b4Oe15CGLL61Ped0RAS9JpqdmCt.jpg",
                "release_date": "2017-07-19",
                "title": "Dunkirk",
                "video": false,
                "vote_average": 7.449,
                "vote_count": 17006,
                "character": "Highlander 3",
                "credit_id": "58a000e69251412609001ac5",
                "order": 33
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Kevin Guthrie is a Scottish actor. His best known roles are Ally in Sunshine on Leith (2013), Ewan Tavendale in Terence Davies's Sunset Song (2015), and Abernathy in the first 2 Fantastic Beast films - Fantastic Beast and where to find them (2016), and Fantastic Beast: The Crimes of Grindelwald (2018). He also performed the lead role in Peter Pan at the King's Theatre, Glasgow, in 2011. In September 2020, Guthrie was charged with sexual assault. A trial before jury was set for January 2021 but was administratively adjourned due to the COVID-19 pandemic, and Guthrie remained on bail in the interim. On 16 April 2021, he was convicted following a four-day trial at Glasgow Sheriff Court of carrying out a sexual assault on a woman that took place at the residence of fellow actor Scott Reid in Kelvindale, Glasgow between 30 September and 1 October 2017. On 14 May 2021, he was sentenced to three years in prison and was placed on the sex offenders' register indefinitely. An attempted appeal of his conviction was rejected in November 2021. Guthrie was released from HM Prison Dumfries in May 2022, having had the term reduced to two years following a successful appeal to cut his prison time. He failed, however, in attempting to have his conviction quashed.",
        "birthday": "1988-03-21",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1204379,
        "imdb_id": "nm2295590",
        "known_for_department": "Acting",
        "name": "Kevin Guthrie",
        "place_of_birth": "Renfrewshire, Scotland, UK",
        "popularity": 0.2534,
        "profile_path": "/uT6ju0dmnA6GjukgRrbfZPUDMnL.jpg"
    }
}