{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/txXPooNu7fr4YhLwx7AlXkU0PnN.jpg",
                "genre_ids": [
                    10752,
                    18,
                    36
                ],
                "id": 11202,
                "original_language": "en",
                "original_title": "Patton",
                "overview": "\"Patton\" tells the tale of General George S. Patton, famous tank commander of World War II. The film begins with Patton's career in North Africa and progresses through the invasion of Germany and the fall of the Third Reich. Side plots also speak of Patton's numerous faults such his temper and habit towards insubordination.",
                "popularity": 3.6892,
                "poster_path": "/8IRufbzhMJSdlmD0cnTWERCtTN2.jpg",
                "release_date": "1970-01-25",
                "title": "Patton",
                "video": false,
                "vote_average": 7.48,
                "vote_count": 1147,
                "character": "Clergyman",
                "credit_id": "52fe440f9251416c750278c3",
                "order": 24
            },
            {
                "adult": false,
                "backdrop_path": "/92tb8mgjgL1S2KwrZezyPHPkQ3R.jpg",
                "genre_ids": [
                    12,
                    10751,
                    14
                ],
                "id": 13597,
                "original_language": "en",
                "original_title": "Labyrinth",
                "overview": "When Sarah is forced to babysit her half-brother Toby, she inadvertently summons the Goblin King who whisks Toby away to his castle at the center of a labyrinth. Sarah enters into a bargain with the Goblin King where she is given just thirteen hours to solve the labyrinth and rescue Toby, or else lose him forever.",
                "popularity": 5.6426,
                "poster_path": "/hbSdA1DmNA9IlfVoqJkIWYF2oYm.jpg",
                "release_date": "1986-06-27",
                "title": "Labyrinth",
                "video": false,
                "vote_average": 7.275,
                "vote_count": 2572,
                "character": "Right Door Knocker (voice)",
                "credit_id": "5de2da2a3faba000190b57ba",
                "order": 23
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "David Healey",
            "Dave Healey"
        ],
        "biography": "A rotund, jovial New Yorker, David Healy obligingly played every manner of stereotypical American in British films and on television for more than thirty years. The son of an Australian father and an American mother, he spent much of his youth in Texas. Studying at Southern Methodist University in Dallas, he majored in drama and befriended another young acting hopeful, named Larry Hagman. David first arrived in England as a member of the U.S. Air Force and soon wound up, along with Hagman, in the cast of a touring show written by John Briley. This later grew into The Airbase (1965), a 25-minute BBC sitcom (with David as Staff Sergeant Tillman Miller), which took a humorous look at British-American cultural differences at an RAF base.\n\nConsidering his job prospects to be rather more lucrative in Britain -- in keeping with the 'bigger fish, smaller pond' theory - David soon found himself in almost continuous demand for any part which required an affable or imperious American. His long gallery of characters included diplomats, businessmen, bureaucrats, spooks, military brass, and so on. There were rare occasions, when he acted against type and played 'Britishers' -- a notable point in case being a likeable Dr. Watson, opposite charismatic Ian Richardson as Sherlock Holmes, in The Sign of Four (1983). His comedic side was showcased in guest appearances with Dick Emery and Kenny Everett and a with couple of turns in Jeeves and Wooster (1990).\n\nThough married and settled in Surrey, David took job offers on both sides of the Atlantic. He was glimpsed as a cleric in Patton (1970) and in Robert Aldrich's doomsday thriller Twilight's Last Gleaming (1977); well-cast as Teddy Roosevelt in Eleanor and Franklin: The White House Years (1977); and he had recurring roles in TV's favourite soapie of the day, Dallas (1978). British TV audiences saw him guesting in just about every major crime series, from The Saint (1962) and Department S (1969), to The Persuaders! (1971). Simultaneously, from 1967, David pursued a successful career as a stage actor in classical plays with the Royal Shakespeare Company and the National Theatre. In 1975, he re-visited his roots, playing Falstaff at a Shakespeare festival in Dallas. Ever versatile, David found another calling in musicals, appearing in \"Kismet\", \"Call Me Madam\" and \"The Music Man\". He received much praise for his interpretation of Runyonesque gambler Nicely-Nicely Johnson (played definitively on screen by Stubby Kaye) in \"Guys and Dolls\", performing show-stopping encores of \"Sit Down, You're Rockin' the Boat\".\n\n- IMDb Mini Biography By: I.S.Mowis",
        "birthday": "1929-05-15",
        "deathday": "1995-10-25",
        "gender": 2,
        "homepage": null,
        "id": 120676,
        "imdb_id": "nm0372242",
        "known_for_department": "Acting",
        "name": "David Healy",
        "place_of_birth": "Manhattan, New York, USA",
        "popularity": 0.095,
        "profile_path": "/raDEMRIL0jSMtNdzpxAGy5woFaU.jpg"
    }
}