{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rRY5VgnpT1Pm9eYIlsboCbUgn5z.jpg",
                "genre_ids": [
                    35,
                    18,
                    37
                ],
                "id": 16563,
                "original_language": "en",
                "original_title": "Seven Brides for Seven Brothers",
                "overview": "In 1850 Oregon, when a backwoodsman brings a wife home to his farm, his six brothers decide that they want to get married too.",
                "popularity": 2.5557,
                "poster_path": "/8Z4W2oRQKkmt7lhqNPROcNru9yJ.jpg",
                "release_date": "1954-07-22",
                "title": "Seven Brides for Seven Brothers",
                "video": false,
                "vote_average": 7.148,
                "vote_count": 553,
                "character": "Father (uncredited)",
                "credit_id": "660db358d400f30131056056",
                "order": 51
            },
            {
                "adult": false,
                "backdrop_path": "/uChOlEWqFwxwJ3eZP9eQj2yqczd.jpg",
                "genre_ids": [
                    35,
                    10402,
                    10749
                ],
                "id": 13368,
                "original_language": "en",
                "original_title": "White Christmas",
                "overview": "Two talented song-and-dance men team up after the war to become one of the hottest acts in show business. In time they befriend and become romantically involved with the beautiful Haynes sisters who comprise a sister act.",
                "popularity": 2.4631,
                "poster_path": "/A5kBQsHKbIptxJyELEpHQJROCRj.jpg",
                "release_date": "1954-10-14",
                "title": "White Christmas",
                "video": false,
                "vote_average": 7.183,
                "vote_count": 540,
                "character": "Station Master (uncredited)",
                "credit_id": "5c2c6b2792514122a36df04a",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Isaac Stanford Jolley",
            "I. Stan Jolley",
            "I. Stan Jolly",
            "Stanford Jolley",
            "Stan Jolley",
            "Stan Jolly",
            "Stanford I. Jolley",
            "J. Stanford Jolley",
            "Norman Jolley"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nIsaac Stanford Jolley (October 24, 1900 – December 7, 1978) was an American character actor of film and television, primarily in western roles as cowboys, law-enforcement officers, or villains. Recognized by his slight build, narrow face, and pencil-thin moustache, Jolley appeared some five hundred times on the large or small screen.\n\nIsaac Stanford Jolley was born in a circus trailer in Elizabeth, New Jersey, while the circus owned by his father had a three-day stop there.[2] Jolley toured as a child with his father's traveling circus and worked in vaudeville. He was a student of the Edward Clark Academy Theater.\n\nTelevision roles\n\nFrom 1950 to 1953, Jolley first appeared on television with six castings in different role in the series, The Lone Ranger with Clayton Moore. He appeared twice in 1953 in the syndicated western series, The Range Rider. He made two appearances as Parker in Tales of the Texas Rangers, with series stars Willard Parker and Harry Lauter. Jolley guest starred as the henchman Walt, along with Clayton Moore and Darryl Hickman in the 1954 episode \"Annie Gets Her Man\" of the syndicated Western, Annie Oakley. He appeared as Sheriff Bascom in the 1954 episode \"Black Bart\" of Stories of the Century.\n\nJolley soon appeared multiple times on a wide range of other western series, including, The Adventures of Wild Bill Hickok (three times), The Cisco Kid (ten), Tales of the Texas Rangers (twice), Sergeant Preston of the Yukon (twice), The Roy Rogers Show (three), The Gene Autry Show (four), Sky King (four), Death Valley Days (five), 26 Men (five appearances, again with Tristram Coffin, the series star), Wanted Dead or Alive (two), Bronco (twice), Tales of Wells Fargo (twice), The Life and Legend of Wyatt Earp (six), Maverick (six), Lawman (six), Cheyenne (seven), Rawhide (five), Wagon Train (ten), The Virginian (two), Daniel Boone (two), Laredo (two), The Big Valley (three), Bonanza (eight), and Gunsmoke (nine).\n\nIn 1960, he guest starred as the Indian named Singing Arrow in the series finale, \"The Search,\" of the syndicated western, Pony Express, with Grant Sullivan. In 1962, he was cast as The Stranger in the episode \"Quarantine\" of the NBC western series, The Tall Man, starring Barry Sullivan, and Clu Gulager.\n\nIn 1965, Jolley appeared as Enos Scoggins in \"The Greatest Coward on Earth\" of the Chuck Connors series, Branded. He had also appeared with Connors on ABC's The Rifleman in one of the last episodes of the series in 1963 in the role of Joe Fogner in \"Hostages to Fortune\" (1963). He appeared four times in 1956 in archival footage on the children's western The Gabby Hayes Show.\n\nIn 1966, Jolley appeared on the show F Troop as Colonel Ferguson in the episode \"Survival of the Fittest\". Jolley's last Western roles were in 1976: as (1) a farmer in ABC's The Macahans, the pilot of James Arness's second western series, How the West Was Won, and (2) as a drunkard in the short-lived Tim Matheson and Kurt Russell series The Quest. CLR",
        "birthday": "1900-10-23",
        "deathday": "1978-12-07",
        "gender": 2,
        "homepage": null,
        "id": 120739,
        "imdb_id": "nm0427157",
        "known_for_department": "Acting",
        "name": "I. Stanford Jolley",
        "place_of_birth": "Elizabeth, New Jersey, USA",
        "popularity": 0.1904,
        "profile_path": "/aJQgLRwLuGXlWuTmIYWpqPeYXvI.jpg"
    }
}