{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wFbPbJ9uRDpjY7micBTeolgkOA4.jpg",
                "genre_ids": [
                    18,
                    27,
                    878
                ],
                "id": 3035,
                "original_language": "en",
                "original_title": "Frankenstein",
                "overview": "Tampering with life and death, Henry Frankenstein pieces together salvaged body parts to bring a human monster to life; the mad scientist's dreams are shattered by his creation's violent rage as the monster awakens to a world in which he is unwelcome.",
                "popularity": 5.2311,
                "poster_path": "/mu6wHwH0IwCCaEYtpqujuPJYat1.jpg",
                "release_date": "1931-11-21",
                "title": "Frankenstein",
                "video": false,
                "vote_average": 7.464,
                "vote_count": 1679,
                "character": "Bridesmaid (uncredited)",
                "credit_id": "55a31fdf925141297d004742",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Pauline Joless Love"
        ],
        "biography": "From Wikipedia\n\nPauline Moore (June 17, 1914 – December 7, 2001) was an American actress known for her roles in Western and B movies during the 1930s and 1940s.\n\nMoore was born Pauline Joless Love on June 17, 1914 in Harrisburg, Pennsylvania. After her father died during World War I, her mother remarried in 1925 and Moore took her stepfather's name. She began her career moving to Hollywood in the early 1930s, and also starred on Broadway and worked as a model.\n\nFrom the late 1930s through the early 1940s, Moore made twenty four films for 20th Century Fox, with whom she was contracted. She later worked for Republic Pictures, starring in four Roy Rogers westerns, as well as the film King of the Texas Rangers in 1940, starring football great Sammy Baugh. Moore starred in three Charlie Chan films, starring alongside Cesar Romero, Allan Lane, and Kane Richmond. She also starred alongside Shirley Temple in the 1937 film Heidi, and alongside Henry Fonda in the 1939 film Young Mr. Lincoln.\n\nShe was married to the cartoonist Jefferson Machamer from 1934 until his death in 1960. In the early 1940s she retired from acting, and became a mother of three children, but continued to act into the 1950s. From her first uncredited role in 1931 through to her last role in 1958 her career spanned a total of thirty films. She made a few television appearances in the 1950s, including a bit part in Spoilers of the Forrest in 1957 alongside Rod Cameron and Vera Ralston, but for the most part her acting career had ended, by her own choice. In 1962, she married Rev. Dodd Watkins, whose death in 1972 left her a widow for the second time. She died of Lou Gehrig's disease in 2001, at a nursing home in Sequim, Washington.",
        "birthday": "1914-06-14",
        "deathday": "2001-12-07",
        "gender": 1,
        "homepage": null,
        "id": 120759,
        "imdb_id": "nm0601733",
        "known_for_department": "Acting",
        "name": "Pauline Moore",
        "place_of_birth": "Harrisburg, Pennsylvania, USA",
        "popularity": 0.066,
        "profile_path": "/pbmzktN3whtsRuVcj9MDxyDTmG1.jpg"
    }
}