{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xMoQjqa3JUc2unO4nF9PmM1JTQu.jpg",
                "genre_ids": [
                    10402,
                    35,
                    10749
                ],
                "id": 11113,
                "original_language": "en",
                "original_title": "My Fair Lady",
                "overview": "A snobbish phonetics professor agrees to a wager that he can take a flower girl and make her presentable in high society.",
                "popularity": 4.1967,
                "poster_path": "/bTXVc29lGSNclf94VIZ49W4gGKl.jpg",
                "release_date": "1964-12-01",
                "title": "My Fair Lady",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 1368,
                "character": "Lady at Ball (uncredited)",
                "credit_id": "5ae5cdf192514177bb00644f",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Elizabeth Blythe Slaughter"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nBetty Blythe (born Elizabeth Blythe Slaughter, September 1, 1893 – April 7, 1972) was an American actress best known for her dramatic roles in exotic silent films such as The Queen of Sheba (1921). She appeared in 63 silent films and 56 talking pictures (known as talkies) over the course of her career.\n\nShe is famous for being one of the first actresses to appear on film in the nude, or nearly so, during the Roaring Twenties.\n\nShe is reported to have said, \"A director is the only man besides your husband who can tell you how much of your clothes to take off.\"\n\nBlythe began her stage work in such theatrical pieces as So Long Letty and The Peacock Princess. She worked in vaudeville as the \"California Nightingale\" singing songs such as \"Love Tales from Hoffman\".\n\nAfter touring Europe and the States, she entered films in 1918 at the Vitagraph Studios in Brooklyn, then she was brought to Hollywood's Fox studio as a replacement for actress Theda Bara.\n\nAs famous for her revealing costumes as for her dramatic skills, she became a star in such exotic films as The Queen of Sheba (1921) (in which she wore nothing above the waist except a string of beads), Chu-Chin-Chow (made in 1923; released by MGM in the US 1925) and She (1925).\n\nShe was also seen to good advantage in less revealing films like Nomads of the North (1920) with Lon Chaney and In Hollywood with Potash and Perlmutter (1924), produced by Samuel Goldwyn.\n\nOther roles were as an opera star, unbilled in Garbo's The Mysterious Lady. She continued to work as a character actress. One of her last roles was a small uncredited role in a crowd scene in 1964's My Fair Lady.\n\nBetty Blythe's name lives on through the Betty Blythe Vintage TeaRoom in West Kensington.",
        "birthday": "1893-08-31",
        "deathday": "1972-04-07",
        "gender": 1,
        "homepage": null,
        "id": 120740,
        "imdb_id": "nm0090029",
        "known_for_department": "Acting",
        "name": "Betty Blythe",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 2.4627,
        "profile_path": "/wBsngkobaiajyWu7k94ahOdzkNc.jpg"
    }
}