{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sGEqHTylawwS6hwKultk1mKUjdB.jpg",
                "genre_ids": [
                    10749,
                    35
                ],
                "id": 114,
                "original_language": "en",
                "original_title": "Pretty Woman",
                "overview": "While on a business trip in Los Angeles, Edward Lewis, a millionaire entrepreneur who makes a living buying and breaking up companies, picks up a prostitute, Vivian, while asking for directions; after, Edward hires Vivian to stay with him for the weekend to accompany him to a few social events, and the two get closer only to discover there are significant hurdles to overcome as they try to bridge the gap between their very different worlds.",
                "popularity": 8.5335,
                "poster_path": "/hVHUfT801LQATGd26VPzhorIYza.jpg",
                "release_date": "1990-03-23",
                "title": "Pretty Woman",
                "video": false,
                "vote_average": 7.46,
                "vote_count": 8618,
                "character": "James Morse",
                "credit_id": "52fe4219c3a36847f800405d",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/2pViauhiZLhAUb1lsY6wRir69SF.jpg",
                "genre_ids": [
                    35
                ],
                "id": 1621,
                "original_language": "en",
                "original_title": "Trading Places",
                "overview": "A snobbish investor and a wily street con-artist find their positions reversed as part of a bet by two callous millionaires.",
                "popularity": 6.9519,
                "poster_path": "/8mBuLCOcpWnmYtZc4aqtvDXslv6.jpg",
                "release_date": "1983-06-07",
                "title": "Trading Places",
                "video": false,
                "vote_average": 7.23,
                "vote_count": 3444,
                "character": "Randolph Duke",
                "credit_id": "52fe4305c3a36847f80347a9",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/qszuXKhzYR24oRpsmh7eZaPbvL8.jpg",
                "genre_ids": [
                    18,
                    27,
                    53
                ],
                "id": 805,
                "original_language": "en",
                "original_title": "Rosemary's Baby",
                "overview": "A young couple, Rosemary and Guy, moves into an infamous New York apartment building, known by frightening legends and mysterious events, with the purpose of starting a family.",
                "popularity": 3.2262,
                "poster_path": "/uYgvlHceRFjAFbsNeMInYcLZLUb.jpg",
                "release_date": "1968-06-12",
                "title": "Rosemary's Baby",
                "video": false,
                "vote_average": 7.825,
                "vote_count": 4132,
                "character": "Dr. Sapirstein",
                "credit_id": "52fe4279c3a36847f80215cd",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/ihoQaiMFAz4YCTAaSIsQjRknsNH.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 3085,
                "original_language": "en",
                "original_title": "His Girl Friday",
                "overview": "Walter Burns is an irresistibly conniving newspaper publisher desperate to woo back his paper’s star reporter, who also happens to be his estranged wife. She’s threatening to quit and settle down with a new beau, but, as Walter knows, she has a weakness: she can’t resist a juicy scoop.",
                "popularity": 3.8745,
                "poster_path": "/lu86Y9zTPH3neCiUzLzHCEFHf7f.jpg",
                "release_date": "1940-01-18",
                "title": "His Girl Friday",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 878,
                "character": "Bruce Baldwin",
                "credit_id": "52fe4384c3a36847f805a175",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/hwMWJ8G5173SGCHzrm0mVjvESaY.jpg",
                "genre_ids": [
                    27,
                    18
                ],
                "id": 13666,
                "original_language": "en",
                "original_title": "The Wolf Man",
                "overview": "After his brother's death, Larry Talbot returns home to his father and the family estate. Events soon take a turn for the worse when Larry is bitten by a werewolf.",
                "popularity": 1.2605,
                "poster_path": "/vG8fu5syTtQLzK1hQXyi3ugOPNF.jpg",
                "release_date": "1941-12-12",
                "title": "The Wolf Man",
                "video": false,
                "vote_average": 7.012,
                "vote_count": 645,
                "character": "Colonel Montford",
                "credit_id": "52fe45889251416c75059d09",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/vsCIw7ARCKQVPT2K2hkkFVl7yo5.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 9602,
                "original_language": "en",
                "original_title": "Coming to America",
                "overview": "An African prince decides it’s time for him to find a princess... and his mission leads him and his most loyal friend to Queens, New York. In disguise as an impoverished immigrant, the pampered prince quickly finds himself a new job, new friends, new digs, new enemies and lots of trouble.",
                "popularity": 10.2287,
                "poster_path": "/8YZiA1o264dk0cr1USyMdph6SZl.jpg",
                "release_date": "1988-06-29",
                "title": "Coming to America",
                "video": false,
                "vote_average": 6.878,
                "vote_count": 4539,
                "character": "Randolph Duke / Homeless Man #1 (uncredited)",
                "credit_id": "58aef1e3c3a368357a006c08",
                "order": 48
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ralph Rexford Bellamy",
            "رالف بلامی"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nRalph Rexford Bellamy (June 17, 1904 – November 29, 1991) was an American actor whose career spanned 62 years on stage, screen and television. During his career, he played leading roles as well as supporting roles, garnering acclaim and awards, including an Academy Award nomination for Best Supporting Actor for The Awful Truth (1937).\n\nHis film career began with The Secret Six (1931) starring Wallace Beery and featuring Jean Harlow and Clark Gable. By the end of 1933, he had already appeared in 22 movies, most notably Rebecca of Sunnybrook Farm (1932) and the second lead in the action film Picture Snatcher with James Cagney (1933). He played in seven more films in 1934 alone, including Woman in the Dark, based on a Dashiell Hammett story, in which Bellamy played the lead, second-billed under Fay Wray. Bellamy kept up the pace through the decade, receiving a nomination for the Academy Award for Best Supporting Actor for his role in The Awful Truth (1937) with Irene Dunne and Cary Grant, and played a similar part, that of a naive boyfriend competing with the sophisticated Grant character, in His Girl Friday (1940). He portrayed detective Ellery Queen in a few films during the 1940s, but as his film career did not progress, he returned to the stage, where he continued to perform throughout the 1950s. Bellamy appeared in other movies during this time, including Dance, Girl, Dance (1940) with Maureen O'Hara and Lucille Ball, and the horror classic The Wolf Man (1941) with Lon Chaney, Jr. and Evelyn Ankers. He also appeared in The Ghost of Frankenstein in 1942 with Chaney and Bela Lugosi.\n\nBellamy appeared in numerous television series. In 1949, Bellamy starred in the television noir private eye series Man Against Crime (also known as Follow That Man) on the DuMont Television Network; initially telecast live in its earliest seasons, the program lasted until 1956 and was simulcast for a season on Dumont and NBC, and ran on CBS during a different year. The lead role was taken by Frank Lovejoy in 1956, who subsequently starred in NBC's Meet McGraw detective series.\n\nAn Emmy Award nomination for the mini-series The Winds of War (1983) – in which Bellamy reprised his Sunrise at Campobello role of Franklin D. Roosevelt – brought him back into the spotlight.\n\nHighly regarded within the industry, Bellamy served as a four-term President of Actors' Equity from 1952–1964.  Description above from the Wikipedia article Ralph Bellamy, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1904-06-17",
        "deathday": "1991-11-29",
        "gender": 2,
        "homepage": null,
        "id": 1208,
        "imdb_id": "nm0000897",
        "known_for_department": "Acting",
        "name": "Ralph Bellamy",
        "place_of_birth": "Chicago, Illinois, USA",
        "popularity": 0.826,
        "profile_path": "/vC6cdrUUewgurTlVXt36eRAtQKb.jpg"
    }
}