{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/22l5YKpMHBeh0o4uHQ079Y19PPg.jpg",
                "genre_ids": [
                    10749,
                    18
                ],
                "id": 222935,
                "original_language": "en",
                "original_title": "The Fault in Our Stars",
                "overview": "Despite the tumor-shrinking medical miracle that has bought her a few years, Hazel has never been anything but terminal, her final chapter inscribed upon diagnosis. But when a patient named Augustus Waters suddenly appears at Cancer Kid Support Group, Hazel's story is about to be completely rewritten.",
                "popularity": 6.4118,
                "poster_path": "/kcVuktIlrn9SAN1uBmPDnocTQmF.jpg",
                "release_date": "2014-05-16",
                "title": "The Fault in Our Stars",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 11350,
                "character": "Little Girl's Father (uncredited)",
                "credit_id": "67c478d58bd7ecb12b4b22e2",
                "order": 39
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/22l5YKpMHBeh0o4uHQ079Y19PPg.jpg",
                "genre_ids": [
                    10749,
                    18
                ],
                "id": 222935,
                "original_language": "en",
                "original_title": "The Fault in Our Stars",
                "overview": "Despite the tumor-shrinking medical miracle that has bought her a few years, Hazel has never been anything but terminal, her final chapter inscribed upon diagnosis. But when a patient named Augustus Waters suddenly appears at Cancer Kid Support Group, Hazel's story is about to be completely rewritten.",
                "popularity": 6.4118,
                "poster_path": "/kcVuktIlrn9SAN1uBmPDnocTQmF.jpg",
                "release_date": "2014-05-16",
                "title": "The Fault in Our Stars",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 11350,
                "credit_id": "52fe4e019251416c75148437",
                "department": "Writing",
                "job": "Novel"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "John Michael Green (born August 24, 1977) is an American author, YouTube content creator, podcaster, and philanthropist. His books have more than 50 million copies in print worldwide, including The Fault in Our Stars (2012), which is one of the best-selling books of all time. Green's rapid rise to fame and idiosyncratic voice are credited with creating a major shift in the young adult fiction market. Green is also well known for his work in online video, most notably his YouTube ventures with his brother Hank Green.\n\nBorn in Indianapolis, Indiana, Green was raised in Orlando, Florida, before attending boarding school outside of Birmingham, Alabama. He attended Kenyon College, graduating with a double major in English and religious studies in 2000. Green then spent six months as a student chaplain at a children's hospital. He reconsidered his path and began working at Booklist in Chicago while writing his first novel. His debut novel Looking for Alaska (2005) was awarded the 2006 Michael L. Printz Award. While living in New York City, Green published his second novel, An Abundance of Katherines (2006). Starting on January 1, 2007, John and his brother Hank launched the Vlogbrothers YouTube channel, a series of vlogs submitted to one another on alternating weekdays; the videos spawned an active online-based community called Nerdfighteria and an annual telethon-style fundraiser called Project for Awesome, both of which have persisted and grown over time.\n\nJohn moved back to Indianapolis in 2007, and published three novels over the next three years: Let It Snow: Three Holiday Romances (2008, with Maureen Johnson and Lauren Myracle), his third solo novel, Paper Towns (2008), and Will Grayson, Will Grayson (2010, with David Levithan). From 2010 to 2013, John and Hank launched several online video projects, including VidCon, an annual conference for the online video community, and Crash Course (2011–present), a wide-ranging educational channel. Green's 2012 novel, The Fault in Our Stars, proved to be a massive success. The book created a passionate fan base of readers and debuted at number one on The New York Times Best Seller list for children's chapter books, remaining in the top ten for over two years. The 2014 film adaptation was also a commercial and critical success, leading to several other film and television adaptations of his work. That same year, Green was included in Time magazine's list of the 100 most influential people in the world.\n\nGreen's subsequent projects, his novel Turtles All the Way Down (2017) and The Anthropocene Reviewed (2018–2021), dealt more directly with his struggles with anxiety and obsessive–compulsive disorder. The Anthropocene Reviewed began as a podcast in January 2018, with Green reviewing different facets of the Anthropocene on a five-star scale. The podcast was later adapted into The Anthropocene Reviewed: Essays on a Human-Centered Planet (2021), his first nonfiction book. John has also collaborated with his wife, art curator Sarah Urist Green, on the video series The Art Assignment (2017–2020) and Ours Poetica (2019–present). Since the mid-2010s, John Green has been a prominent supporter, fundraiser, and later trustee for Partners In Health and their goal of reducing maternal mortality in Sierra Leone.",
        "birthday": "1977-08-24",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.johngreenbooks.com",
        "id": 1208353,
        "imdb_id": "nm1981261",
        "known_for_department": "Writing",
        "name": "John Green",
        "place_of_birth": "Indianapolis, Indiana, USA",
        "popularity": 0.2251,
        "profile_path": "/k5AOKSIe72G16yhrAhMOI5u5DB7.jpg"
    }
}