{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/u2bZhH3nTf0So0UIC1QxAqBvC07.jpg",
                "genre_ids": [
                    16,
                    10751,
                    12,
                    14
                ],
                "id": 109445,
                "original_language": "en",
                "original_title": "Frozen",
                "overview": "Young princess Anna of Arendelle dreams about finding true love at her sister Elsa’s coronation. Fate takes her on a dangerous journey in an attempt to end the eternal winter that has fallen over the kingdom. She's accompanied by ice delivery man Kristoff, his reindeer Sven, and snowman Olaf. On an adventure where she will find out what friendship, courage, family, and true love really means.",
                "popularity": 23.9417,
                "poster_path": "/itAKcobTYGpYT8Phwjd8c9hleTo.jpg",
                "release_date": "2013-11-20",
                "title": "Frozen",
                "video": false,
                "vote_average": 7.248,
                "vote_count": 17073,
                "character": "Girl Troll (voice)",
                "credit_id": "551868ce9251412c1e003106",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Annaleigh Amanda Ashford"
        ],
        "biography": "Annaleigh Amanda Ashford (born June 25, 1985) is an American actress, singer, and dancer. She is known for her work on Broadway as Glinda in Wicked (2005–2006; 2007–08), and Margot in Legally Blonde (2007), as well as for originating the role of Lauren in Kinky Boots (2013–14), a performance for which she received a 2013 Tony nomination. Ashford won the 2015 Tony Award for Best Featured Actress in a Play for her performance as Essie Carmichael in the revival of You Can't Take It with You (2014–15).\n\nIn 2017, she starred as Dot/Marie in the critically acclaimed, limited-run revival of Sunday in the Park with George. Additionally, she is known for portraying the role of Betty DiMello on the period drama television series Masters of Sex, which ran for four seasons on Showtime. In 2019, she starred as Jenny Aquila in Bad Education, and, in 2020, as Paula Jones in Impeachment: American Crime Story.",
        "birthday": "1985-06-25",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.annaleighashford.com/",
        "id": 120831,
        "imdb_id": "nm2807560",
        "known_for_department": "Acting",
        "name": "Annaleigh Ashford",
        "place_of_birth": "Denver, Colorado, USA",
        "popularity": 0.3987,
        "profile_path": "/AaMsrGdvvNeOzNUMUYOQlcejbfO.jpg"
    }
}