{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/D3eDUNEzJPBDG3TCJcR7RyRgTA.jpg",
                "genre_ids": [
                    18,
                    28
                ],
                "id": 96721,
                "original_language": "en",
                "original_title": "Rush",
                "overview": "In the 1970s, a rivalry propels race car drivers Niki Lauda and James Hunt to fame and glory — until a horrible accident threatens to end it all.",
                "popularity": 10.1157,
                "poster_path": "/cyfncP1YKDNcGb0agE7RQr6UOYr.jpg",
                "release_date": "2013-09-02",
                "title": "Rush",
                "video": false,
                "vote_average": 7.727,
                "vote_count": 7475,
                "character": "FIA Official",
                "credit_id": "5cbf926e9251412577faaa6b",
                "order": 47
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Alastair Caldwell, born in 1943 in New Zealand, is a renowned Formula 1 team manager and engineer best known for his work with McLaren during the 1970s. Caldwell began his career as a mechanic and quickly moved up through the ranks, joining McLaren in 1967. He became the team manager in 1974, leading McLaren to multiple successes, including their first Constructors' and Drivers' Championships with Emerson Fittipaldi in 1974 and James Hunt in 1976.\n\nCaldwell is celebrated for his meticulous approach to car performance, innovative problem-solving skills, and ability to motivate his team under high-stakes conditions. He played a key role in managing the famously competitive and challenging 1976 season, which saw Hunt win the championship in dramatic fashion, a story later depicted in the film Rush.\n\nAfter leaving McLaren, Caldwell worked with other teams, including Brabham, and later pursued business ventures outside of racing, including classic car restoration. His contributions to McLaren’s early successes and his charismatic style have left a lasting impact on Formula 1.",
        "birthday": "1943-03-12",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1209543,
        "imdb_id": "nm5800750",
        "known_for_department": "Acting",
        "name": "Alastair Caldwell",
        "place_of_birth": "Sheffield, England",
        "popularity": 0.0297,
        "profile_path": "/5ri5genVeDkVhCD9cAVfdRg8jxV.jpg"
    }
}