{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/nk87CtgZ7wd86W37oJHGYAJbmLz.jpg",
                "genre_ids": [
                    53,
                    9648,
                    80
                ],
                "id": 11644,
                "original_language": "en",
                "original_title": "Blow Out",
                "overview": "While recording sound effects for a slasher flick, Jack Terry stumbles upon a real-life horror: a car careening off a bridge and into a river. Jack jumps into the water and fishes out Sally from the car, but the other passenger is already dead — a governor intending to run for president. As Jack does some investigating of his tapes, and starts a perilous romance with Sally, he enters a tangled web of conspiracy that might leave him dead.",
                "popularity": 2.8983,
                "poster_path": "/weMW1wLzeagP3tw6BfmYf1iL7dz.jpg",
                "release_date": "1981-07-24",
                "title": "Blow Out",
                "video": false,
                "vote_average": 7.374,
                "vote_count": 1561,
                "character": "Train Passenger",
                "credit_id": "53d11023c3a368776a00a37b",
                "order": 15
            },
            {
                "adult": false,
                "backdrop_path": "/uy2trYgO8MOQfQXlvMaLhBnkUqg.jpg",
                "genre_ids": [
                    18,
                    28,
                    53
                ],
                "id": 7485,
                "original_language": "en",
                "original_title": "Shooter",
                "overview": "A top Marine sniper, Bob Lee Swagger, leaves the military after a mission goes horribly awry and disappears, living in seclusion. He is coaxed back into service after a high-profile government official convinces him to help thwart a plot to kill the President of the United States. Ultimately double-crossed and framed for the attempt, Swagger becomes the target of a nationwide manhunt. He goes on the run to track the real killer and find out who exactly set him up, and why, eventually seeking revenge against some of the most powerful and corrupt leaders in the free world.",
                "popularity": 8.6032,
                "poster_path": "/2aWGxo1E5polpBjPvtBRkWp7qaS.jpg",
                "release_date": "2007-03-22",
                "title": "Shooter",
                "video": false,
                "vote_average": 7.121,
                "vote_count": 5165,
                "character": "Assassination Witness",
                "credit_id": "53c9946ec3a368777e00012e",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Rob Lombardi"
        ],
        "biography": "Roberto Lombardi was born in Philadelphia, Pennsylvania (USA) and began his career at an early age, appearing on the Gene London Show at age 7, then began music lessons (drums) and showed a natural ability for music. He quickly moved on to other instruments (bass) in order to learn to not only play, but write his own songs, later taking voice lessons to handle lead vocals.\n\nAt age 16, an interest in acting resurfaced. He studied acting in high school and college, then found theater roles both in school and regionally, eventually landing extra / featured roles in several major motion pictures.\n\nAt this point music became the focus. He wrote, recorded and toured nationally with several bands, most notably April Fool, \"The End\", \"The Facts\", The Rage and Road Trip learning to play both keyboards and guitar in the process.\n\nIn 2004, Lombardi again became focused on acting, signed with several agencies and began modeling while taking additional acting classes. Since then he has appeared in many films, television shows and commercials in a variety of roles in films such as The Happening, Bazookas: The Movie, Masks, Stand Off, Perfect: Android Rising and The Cemetery, as well as the popular fan films Krueger: Another Tale from Elm Street, The Nightmare Ends on Halloween II (as the iconic Freddy Krueger), Escape from New Jersey and Mr. J . He also starred in the ensemble tv series Brotherhood of Silver, The Underground Kings and Phantom Faye.\n\nLombardi has worked behind the camera as well as in front with Actor, Producer and Assistant Director credits for Abduction and Paranormal Captivity. He is attached with Actor and Producer credit for the upcoming Extinction and directed the short film Masks: Facade. He has also been credited for Casting, Location Scout and Script Supervisor as well as doing Special FX Makeup and contributing music to Film Soundtracks.\n\nHis production company 'RTL Productions' focuses on the development, publicity and production of new film projects such as Just Like Me which he produced as well as acted in. The company also releases Lombardi's past and future music projects and licenses music for film soundtracks. Roberto Lombardi also wrote the screenplay for the supernatural crime drama Voosha Day. Lombardi is also a producer for Blinky Productions, Inc., but mainly concentrates on acting.\n\nWith John Orrichio Films, he worked as a Publicist, Assistant Director and Producer for many projects including the comedy spoof series Ghost Blunders which he also starred in and the ghost hunting reality series Ghost Chicks.\n\nWhen not on set he splits his time between the Philadelphia area, Los Angeles and New York City.",
        "birthday": "1963-12-31",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1209900,
        "imdb_id": "nm2287478",
        "known_for_department": "Acting",
        "name": "Roberto Lombardi",
        "place_of_birth": "Philadelphia, Pennsylvania, USA",
        "popularity": 0.0264,
        "profile_path": "/bvIqGEVBYYJi7jMTXW4cFbMYTfm.jpg"
    }
}