{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/D3eDUNEzJPBDG3TCJcR7RyRgTA.jpg",
                "genre_ids": [
                    18,
                    28
                ],
                "id": 96721,
                "original_language": "en",
                "original_title": "Rush",
                "overview": "In the 1970s, a rivalry propels race car drivers Niki Lauda and James Hunt to fame and glory — until a horrible accident threatens to end it all.",
                "popularity": 10.1157,
                "poster_path": "/cyfncP1YKDNcGb0agE7RQr6UOYr.jpg",
                "release_date": "2013-09-02",
                "title": "Rush",
                "video": false,
                "vote_average": 7.727,
                "vote_count": 7475,
                "character": "English Race Announcer",
                "credit_id": "5cbf8b99c3a368596a81c33a",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Simon Taylor was born on August 8, 1944. He is an actor and writer, known for Rush (2013), Steve McQueen: The Lost Movie (2021) and ITV - Formula One (1997). Simon Taylor has been immersed in motor sport for nearly 50 years as a journalist, commentator, publisher and historian. He joined the weekly magazine Autosport straight from university, and was its editor by the age of 23. He moved on to be a publisher for its proprietors, Haymarket Magazines, devising and launching other car magazines such as What Car? and Classic & Sports Car, and went on to be the company’s Managing Director and then its Chairman.\n\nHe was BBC Radio’s voice of motor racing for more than 20 years, reporting on Formula 1 from all over the world, and his TV commentary and presentation work includes being a member of ITV’s F1 team. He is the author of several books on car and motor racing history, and appeared in the Ron Howard movie Rush playing himself, as the BBC Radio commentator describing the James Hunt/Niki Lauda battles during the 1976 F1 season.\n\nHe has a small collection of classic cars, and competes in historic motor sport with his ex-Stirling Moss 1950 HWM sports-racing car.",
        "birthday": "1944-09-08",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1209556,
        "imdb_id": "nm2366861",
        "known_for_department": "Acting",
        "name": "Simon Taylor",
        "place_of_birth": null,
        "popularity": 0.0297,
        "profile_path": "/4DqTAWwaddWWEB0nxJE1rjzZVAB.jpg"
    }
}