{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sGEqHTylawwS6hwKultk1mKUjdB.jpg",
                "genre_ids": [
                    10749,
                    35
                ],
                "id": 114,
                "original_language": "en",
                "original_title": "Pretty Woman",
                "overview": "While on a business trip in Los Angeles, Edward Lewis, a millionaire entrepreneur who makes a living buying and breaking up companies, picks up a prostitute, Vivian, while asking for directions; after, Edward hires Vivian to stay with him for the weekend to accompany him to a few social events, and the two get closer only to discover there are significant hurdles to overcome as they try to bridge the gap between their very different worlds.",
                "popularity": 8.828,
                "poster_path": "/hVHUfT801LQATGd26VPzhorIYza.jpg",
                "release_date": "1990-03-23",
                "title": "Pretty Woman",
                "video": false,
                "vote_average": 7.46,
                "vote_count": 8618,
                "character": "Bridget",
                "credit_id": "52fe4219c3a36847f8004089",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Mary Eleanor Donahue"
        ],
        "biography": "Mary Eleanor Donahue (born April 19, 1937), credited as Elinor Donahue, is an American actress, best remembered today for playing the role of Betty Anderson, the eldest child of Robert Young and Jane Wyatt, on the 1950s American sitcom Father Knows Best.\n\nDonahue achieved stardom for her role as the elder daughter, Betty, on the television family series Father Knows Best. Her co-stars were Robert Young, Jane Wyatt, Billy Gray as her younger brother, James \"Bud\" Anderson, Jr., and Lauren Chapin as her younger sister, Kathy.\n\nDonahue was a musical judge in ABC's Jukebox Jury (1953–54). While in the first season of Father Knows Best she also appeared on The Ray Bolger Show, starring Ray Bolger as a song-and-dance man. Thereafter, she was cast with James Best, Ann Doran, and J. Carrol Naish in the 1956 episode \"The White Carnation\" of the religion anthology series, Crossroads. She guest starred on an episode of U.S. Marshal. She also appeared as a new bride in the George Burns and Gracie Allen Show episode titled \"The Newlyweds\" that aired April 2, 1956.\n\nShe played Georgiana Balanger in the episode \"Dennis and the Wedding\" (1960) on Dennis the Menace.[5] Donahue was also cast, in 1960, with Marion Ross in an episode (\"Duet\") of The Brothers Brannagan. She played Miriam Welby on ABC's The Odd Couple, Jane Mulligan on Mulligan's Stew, and Nurse Hunnicut on Days of Our Lives.\n\nShe was featured in 12 episodes of CBS's The Andy Griffith Show as pharmacist Ellie Walker, even getting a mention in the opening credits. The character was intended to be a love interest for Sheriff Andy Taylor, but after one season (1960–1961), Donahue decided to ask for a release from her three-year contract.[6]\n\nIn 1963, Donahue was cast in an episode of NBC's short-lived modern Western series, Redigo, with Richard Egan as the rancher Jim Redigo; then in 1964, she appeared as Melanie in \"The Secret in the Stone\" in the NBC medical drama dealing with psychiatry, The Eleventh Hour, starring Jack Ging and Ralph Bellamy.\n\nAdditionally, on February 9, 1963, she played Letty May in the episode \"The Burning Tree\" on Have Gun Will Travel.\n\nIn the 1964–65 season, Donahue costarred as Joan Randall, the daughter of Walter Burnley, played by John McGiver, on the CBS sitcom, Many Happy Returns about the complaint department of a fictitious Los Angeles department store. She guest-appeared on Star Trek in the second-season episode \"Metamorphosis\" (1967) as commissioner Nancy Hedford.\n\nIn 1966, she guest starred on the TV series A Man Called Shenandoah, episode 8, \"Town On Fire.\"",
        "birthday": "1937-04-19",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1209,
        "imdb_id": "nm0231942",
        "known_for_department": "Acting",
        "name": "Elinor Donahue",
        "place_of_birth": "Tacoma, Washington, USA",
        "popularity": 0.466,
        "profile_path": "/tymsy4obGAxB1cwjRwm8QAIgKlM.jpg"
    }
}