{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xwgBHC2FgoIrQitl8jZwXXdsR9u.jpg",
                "genre_ids": [
                    35,
                    18,
                    53
                ],
                "id": 466272,
                "original_language": "en",
                "original_title": "Once Upon a Time... in Hollywood",
                "overview": "Los Angeles, 1969. TV star Rick Dalton, a struggling actor specializing in westerns, and stuntman Cliff Booth, his best friend, try to survive in a constantly changing movie industry. Dalton is the neighbor of the young and promising actress and model Sharon Tate, who has just married the prestigious Polish director Roman Polanski…",
                "popularity": 14.1788,
                "poster_path": "/wQKeS2JrsRF8XSfd9zqflrc5gad.jpg",
                "release_date": "2019-07-24",
                "title": "Once Upon a Time... in Hollywood",
                "video": false,
                "vote_average": 7.427,
                "vote_count": 14154,
                "character": "Cop #1",
                "credit_id": "5de61c8a3faba00019117a9f",
                "order": 86
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Chad Ridgely is a stand-up comedian, actor, writer, producer, and director. Founder of Full Auto Films, he is a former police officer and celebrity bodyguard. A regular performer on the LA comedy circuit, Ridgely studied at The Groundlings Theatre, the improvisational company that spawned the careers of Will Ferrell, Phil Hartman, and Melissa McCarthy.\n\nBest known by horror fans for writing, starring, and producing the award-winning comedy horror films Massacre on Aisle 12 and 6:66 PM, Ridgely first gained attention in the comedy arena creating and starring in the FOX produced sketch-comedy series, The Chad Ridgely Show. He went on to garner millions of views creating digital comedy content and comedy music videos. Ridgely has appeared in numerous film and television projects, including Quentin Tarantino's Once Upon a Time in Hollywood, Weedjies: Halloweed Night, Red Letters, Ice: The Movie, Murder Eleven and Indican Pictures animated feature The Trouble with Terkel.\n\nRidgely is originally from Washington, D.C., U.S.A., and holds a Bachelor of Arts from the University of Maryland, College Park.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "http://chadridgely.com/",
        "id": 1210675,
        "imdb_id": "nm1797652",
        "known_for_department": "Acting",
        "name": "Chad Ridgely",
        "place_of_birth": "Washington, District of Columbia, USA",
        "popularity": 0.0746,
        "profile_path": "/1g663csevlwCEksyFLJHSqHPP6S.jpg"
    }
}