{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mNLonkdD4MtaZnHTifp8be8nJrm.jpg",
                "genre_ids": [
                    18
                ],
                "id": 374473,
                "original_language": "en",
                "original_title": "I, Daniel Blake",
                "overview": "A middle aged carpenter, who requires state welfare after injuring himself, is joined by a single mother in a similar scenario.",
                "popularity": 3.2663,
                "poster_path": "/nu3WVABXz2W85N6JXTZOT1aWS3b.jpg",
                "release_date": "2016-10-21",
                "title": "I, Daniel Blake",
                "video": false,
                "vote_average": 7.717,
                "vote_count": 1472,
                "character": "At the Sawmill",
                "credit_id": "58b58040c3a3685edf00a4de",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/uKb22E0nlzr914bA9KyA5CVCOlV.jpg",
                "genre_ids": [
                    18,
                    10749,
                    14
                ],
                "id": 402431,
                "original_language": "en",
                "original_title": "Wicked",
                "overview": "In the land of Oz, ostracized and misunderstood green-skinned Elphaba is forced to share a room with the popular aristocrat Glinda at Shiz University, and the two's unlikely friendship is tested as they begin to fulfill their respective destinies as Glinda the Good and the Wicked Witch of the West.",
                "popularity": 16.2701,
                "poster_path": "/xDGbZ0JJ3mYaGKy4Nzd9Kph6M9L.jpg",
                "release_date": "2024-11-20",
                "title": "Wicked",
                "video": false,
                "vote_average": 6.93,
                "vote_count": 2403,
                "character": "Shiz President",
                "credit_id": "675ab0191fc28a646b731ae8",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Shaun Prendergast (born 1958) is an English actor and writer, born in North Shields, educated at Collingwood School, Oswin terrace North Shields, Norham High and Tynemouth Sixth Form College and trained at Bretton Hall College (BA Hons). Predergast's first play Potter's Wheel, written when a student, won five awards at the 1980 National Student Drama Festival including Best New Play and was subsequently presented at the Old Vic as part of an NSDF showcase season. He is married to Niki Winterson (of Wintersons Talent Management) and has a stepson Domenic and a daughter, Molly. They live in London.\n\nHe was an actor and playwright in residence for Northumberland Theatre Company before joining the BBC Radio Drama Company, and subsequently became a founder member of Kenneth Branagh's newly formed Renaissance Theatre Company. Awards include a Sony Award, a Writers Guild Award and a Time Out Award.\n\nChristmas of 2010 saw Shaun play the role of Sarah the Cook in the pantomime Dick Whittington at the Lyric Theatre Hammersmith, directed by Steve Marmion.",
        "birthday": "1958-12-05",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1211929,
        "imdb_id": "nm0695970",
        "known_for_department": "Acting",
        "name": "Shaun Prendergast",
        "place_of_birth": "North Shields, Northumberland, England, UK",
        "popularity": 0.1195,
        "profile_path": "/3IMUCBXLXb7KRvRBWqH9MVVxupo.jpg"
    }
}