{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/aoQW8NH6yY2ioQke0iKt0JZxXgv.jpg",
                "genre_ids": [
                    14,
                    18
                ],
                "id": 7980,
                "original_language": "en",
                "original_title": "The Lovely Bones",
                "overview": "After being brutally murdered, 14-year-old Susie Salmon watches from heaven over her grief-stricken family -- and her killer. As she observes their daily lives, she must balance her thirst for revenge with her desire for her family to heal.",
                "popularity": 6.46,
                "poster_path": "/sn0iDphRxQ7I6aLd9igIgACITak.jpg",
                "release_date": "2009-12-26",
                "title": "The Lovely Bones",
                "video": false,
                "vote_average": 7.069,
                "vote_count": 4781,
                "character": "Samuel Heckler",
                "credit_id": "53a662e60e0a26143f002dce",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Andrew Allen"
        ],
        "biography": "Andrew James Allen was born in Redmond, Washington to Robert and Susan Allen. Susan is a retired radiology technician and his father Robert is an artist and environmentalist. Andrew James Allen has been acting since 9 years old, first appearing in commercials. Eventually at the age of 13 Andrew James Allen and his mother moved to Los Angeles where Andrew James Allen began working on various film and television projects. Andrew James Allen starred in the 2003 MGM Studios T.V movie Recipe For Disaster, alongside John Larroquette, Lesley Ann Warren, Margo harshman and Devon Werkheiser. Allen has also guest-starred on Ghost Whisperer, CSI: Miami, ER, Bones, Cold Case, Monk, Grey's Anatomy, Malcolm in the Middle, Reba, Charmed, 7th Heaven, and Make It or Break It among others. Allen was next seen in Peter Jackson's film adaption of The Lovely Bones, portraying Samuel Heckler.",
        "birthday": "1987-07-16",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1212194,
        "imdb_id": "nm0020264",
        "known_for_department": "Acting",
        "name": "Andrew James Allen",
        "place_of_birth": "Redmond, Washington, USA",
        "popularity": 0.2342,
        "profile_path": "/xqlTovYs8UZULjyIW75Rr9KaFjK.jpg"
    }
}