{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bAdIO0Jt886Ad1eY9bDXXeCpXsV.jpg",
                "genre_ids": [
                    10749,
                    35,
                    18
                ],
                "id": 2028,
                "original_language": "en",
                "original_title": "Say Anything...",
                "overview": "Lloyd, an eternal optimist, seeks to capture the heart of Diane, an unattainable high school beauty and straight-A student. He surprises just about everyone-including himself-when she returns the sentiment. But Diane's over-possessive, divorced Dad disapproves and it's going to take more than just the power of love to conquer all.",
                "popularity": 11.663,
                "poster_path": "/nkucKciFGSRalw6dJtsglWqOXMC.jpg",
                "release_date": "1989-04-14",
                "title": "Say Anything...",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 1044,
                "character": "Ray",
                "credit_id": "63061167b04228007f4a60f6",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Stephen Shortridge was born in Iowa and raised in Southern California. Stephen excelled in art throughout his schooling but had mainly studied commercial art. He took his first painting class while attending Idaho State University on a Water Polo Scholarship - Stephen was an All-American.\n\nStephen enjoyed acting but finds painting to be much more creatively satisfying - the feeling to be able to have that total freedom to create is exciting to him. His style results from the influence of the French Impressionists, Monet in particular. However, his full colors and bold strokes have established him as a unique America Romantic Impressionist. Stephen's collectors include Patty Duke, Donna Summer &amp; Rick Dees. While living in LA, he exhibited with fellow actor/artist, Peter Falk.\n\nStephen resumes includes over 50 commercials. Over a fifteen year period he has appeared in commercials such as Mennen, Speedstick, Coke, Certs and Head and Shoulders to name just a few. Stephen currently lives with his family in Idaho.",
        "birthday": "1951-10-23",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1212078,
        "imdb_id": "nm0795160",
        "known_for_department": "Acting",
        "name": "Stephen Shortridge",
        "place_of_birth": "Red Oak, Iowa, USA",
        "popularity": 0.3458,
        "profile_path": "/ewsJ29eNyuVjv9P1rxXPXf0v5mV.jpg"
    }
}