{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3i6H4cVfvWh55sN1iXyeb8Q50nY.jpg",
                "genre_ids": [
                    80,
                    28,
                    18
                ],
                "id": 877,
                "original_language": "en",
                "original_title": "Scarface",
                "overview": "In 1920s Chicago, Italian immigrant and notorious thug, Antonio 'Tony' Camonte, aka Scarface, shoots his way to the top of the mobs while trying to protect his sister from the criminal life.",
                "popularity": 3.0024,
                "poster_path": "/y4E5oRiHMTFkEB12IIcpbKbKzDW.jpg",
                "release_date": "1932-04-09",
                "title": "Scarface",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 634,
                "character": "Man Outside Theatre (uncredited)",
                "credit_id": "5e1299c7d8af670016bda9a8",
                "order": 22
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Wild Bill Elliott",
            "Gordon Nance",
            "Gordon Eliott",
            "'Wild' Bill Elliot",
            "Gordon Elliott",
            "William 'Wild Bill' Elliott",
            "William Elliott"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nWild Bill Elliott (October 16, 1904 – November 26, 1965) was an American film actor. He specialized in playing the rugged heroes of B Westerns, particularly the Red Ryder series of films.  By 1925, he was getting occasional extra work in films. He took classes at the Pasadena Playhouse and appeared in a few stage roles there. By 1927, he had made his first Western, The Arizona Wildcat, playing his first featured role. Several co-starring roles followed, and he renamed himself Gordon Elliott. But as the studios made the transition to sound films, he slipped back into roles as an extra and bit parts, as in Broadway Scandals, in 1929. For the next eight years, he appeared in over a hundred films for various studios, but almost always in unbilled parts as an extra.\n\nElliott began to be noticed in some minor B Westerns, enough so that Columbia Pictures offered him the title role in a serial, The Great Adventures of Wild Bill Hickok (1938). The serial was so successful, and Elliott so personable, that Columbia promoted him to starring in his own series of Western features, replacing Columbia's number-two cowboy star Robert \"Tex\" Allen. Henceforth Gordon Elliott would be known as Bill Elliott. Within two years, he was among the Motion Picture Herald's Top Ten Western Stars, where he would remain for the next 15 years.\n\nIn 1943, Elliott signed with Republic Pictures, which cast him in a series of Westerns alongside George \"Gabby\" Hayes. The first of these, Calling Wild Bill Elliott, gave Elliott the name by which he would be best known and by which he would be billed almost exclusively for the rest of his career.\n\nFollowing several films in which both actor and character shared the name Wild Bill Elliott, he took the role for which he would be best remembered, that of Red Ryder in a series of sixteen movies about the famous comic strip cowboy and his young Indian companion, Little Beaver (played in Elliott's films by Bobby Blake). Elliott played the role for only two years but would forever be associated with it. Elliott's trademark was a pair of six guns worn butt-forward in their holsters.\n\nElliott's career thrived during and after the Red Ryder films, and he continued making B Westerns into the early 1950s. He also had his own radio show during the late 1940s. His final contract as a Western star was with Monogram Pictures, where budgets declined as the B Western lost its audience to television. When Monogram became Allied Artists Pictures Corporation in 1953, it phased out its Western productions, and Elliott finished out his contract playing a homicide detective in a series of five modern police dramas, his first non-Westerns since 1938.\n\nElliott retired from films (except for a couple of TV Western pilots which were not picked up). He worked for a time as a spokesman for Viceroy cigarettes and hosted a local TV program in Las Vegas, Nevada, which featured many of his Western films.",
        "birthday": "1904-10-16",
        "deathday": "1965-11-26",
        "gender": 2,
        "homepage": null,
        "id": 121257,
        "imdb_id": "nm0254381",
        "known_for_department": "Acting",
        "name": "Bill Elliott",
        "place_of_birth": "Pattonsburg, Missouri, USA",
        "popularity": 1.7363,
        "profile_path": "/9Wafomp8j5p0CWnRXJWt6OlAg0m.jpg"
    }
}