{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6IFTmhNh9kmwd5ix53OdlSphPYl.jpg",
                "genre_ids": [
                    35,
                    80
                ],
                "id": 623,
                "original_language": "en",
                "original_title": "A Fish Called Wanda",
                "overview": "While a diamond advocate attempts to steal a collection of diamonds, troubles arise when he realises he’s not the only one after the collection.",
                "popularity": 5.4089,
                "poster_path": "/hkSGFNVfEEUXFCxRZDITFHVhUlu.jpg",
                "release_date": "1988-07-15",
                "title": "A Fish Called Wanda",
                "video": false,
                "vote_average": 7.204,
                "vote_count": 2298,
                "character": "Court Clerk",
                "credit_id": "64bc378d58efd300e2f1762c",
                "order": 27
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "David John Townsend (born 17 May 1943, Chippenham, Wiltshire), known professionally as David Simeon, is a British actor.\n\nDavid Simeon began his acting career after being accepted into RADA, the Rose Bruford College and the Guildhall School of Music and Drama. Ultimately he chose the latter and completed his training in 1964. After years working in Wiltshire rep and Birmingham rep, Simeon began working extensively in theatre and television from the late 1960s.\n\nHis first television role was as a murderer in Sexton Blake, which Simeon puts down to his honest face being the reason for his casting.[2] From this point he moved to London and continued working in theatre in between television roles, which by the early 1970s were becoming plentiful. Among these were small parts in the Doctor Who serials Inferno (1970) and The Dæmons (1971), which Simeon now says despite his vast experience, \"I’m now known as being in Doctor Who\".\n\nDuring the 1970s he secured guest roles in television series such as Paul Temple, Z-Cars, Fawlty Towers, The Pathfinders and The Liver Birds. In 1973 he starred in his first major regular role as Detective Constable Mickey Finn in Hunter's Walk, appearing in 38 episodes until 1976.\n\nFrom 1980 onwards he continued to gain further regular roles in television series End of Part One (1979–80) impersonating television personalities such as Frank Muir and Derek Batey, Vice Versa (1981) as Mr Blinkhorn, Coronation Street (December 1981) as sales rep Bobby Simpson - love interest of Bet Lynch & Mavis Riley, The New Adventures of Lucky Jim (1982) as Philip Lassiter, Jury (1983) as David Farrell. He also appeared in several episodes of the hospital drama Angels.\n\nIn 1988 he had a role in the hit John Cleese film A Fish Called Wanda. During the 1990s and 2000s he continued extensively in theatre and on television appearing in Coronation Street as Gareth Bird, a hospital consultant in July 1998 , Casualty, EastEnders and The Bill. He also secured another recurring role in Lucy Sullivan Is Getting Married as Ken Kennedy between 1999 and 2000.",
        "birthday": "1943-05-17",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1212163,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "David Simeon",
        "place_of_birth": "Chippenham, Wiltshire, England, UK",
        "popularity": 0.086,
        "profile_path": "/p7im1W2IaY5psSYtQ3EZOwKPpww.jpg"
    }
}