{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/40UqrWf4ncxWN71r2otCq9RxvSZ.jpg",
                "genre_ids": [
                    35
                ],
                "id": 11000,
                "original_language": "en",
                "original_title": "The Birdcage",
                "overview": "A gay cabaret owner and his drag queen partner agree to put up a false heterosexual front so that their son can introduce them to his fiancée's conservative parents.",
                "popularity": 2.8178,
                "poster_path": "/hU2XeckncHS61TWZKDtw1BrKmOO.jpg",
                "release_date": "1996-03-08",
                "title": "The Birdcage",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 1239,
                "character": "Senator Eli Jackson",
                "credit_id": "5f45e3130d11f20031b8907f",
                "order": 25
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "David Sage (born 13 July 1940; age 84) is the actor who played the role of Tarmin in the Star Trek: The Next Generation fifth season episode \"Violations\". He filmed his scenes between Tuesday 29 October 1991 and Friday 1 November 1991 and on Tuesday 5 November 1991 on Paramount Stage 8 and 9.\n\nSage is often seen playing the role of a judge. This was the case with his 1991 appearance on Quantum Leap, starring future Star Trek: Enterprise actors Scott Bakula and Dean Stockwell and guest-starring Richard Herd. It was also the case in a 1986 episode of L.A. Law which featured Bibi Besch, Denise Crosby, Anne Haney, and series regular Corbin Bernsen. Sage frequently plays political figures such as senators and mayors, including his role as Senator Walter on Dallas in 1988.\n\nCareer;\n\nHis earliest known television appearance was a 1983 episode of The Greatest American Hero, opposite Judson Scott. He was next seen in an episode of Hardcastle and McCormick, starring Brian Keith and Daniel Hugh Kelly in the title roles. In 1985, he appeared on St. Elsewhere, starring William Daniels, Chad Allen, Jeff Allin, Ed Begley, Jr., Ronny Cox, Norman Lloyd, Deborah May, France Nuyen, Christina Pickles, Jennifer Savidge, Brian Tochi, Alfre Woodard, and Jane Wyatt.\n\nSage appeared in two episodes of Falcon Crest: the first also featured his Next Generation co-star Jonathan Frakes; the second (in which he played a judge) guest-starred fellow Trek performers Leslie Bevis, Michael Ensign, Michael Ensign, Ellen Geer, Jeff Kober, Loren Lester, and Barbara J. Tarbuck. Jonathan Banks, Brett Cullen, and Robert Foxworth were regulars on the series.\n\nHis other TV credits include Hunter (with K Callan, Bruce Davison, and John McLiam), the 1980s remake of The Twilight Zone (with Andrew Robinson, Mark L. Taylor and Jerry Hardin), Hill Street Blues (with Barbara Bosson, Martha Hackett, and James B. Sikking), Murder, She Wrote (with Barbara Bosson and William Windom), Gabriel's Fire (with Phillip Glasser, Gregory Itzin, David Opatoshu, and Madge Sinclair), Seinfeld (with Jason Alexander, Stephen McHattie, and Heidi Swedberg), L.A. Law (with Corbin Bernsen, Ron Canada, and Larry Drake), Picket Fences (with Ray Walston), Babylon 5 (with Ian Abercrombie, Mary Kay Adams, Christopher Darga, Andreas Katsulas, Glenn Morshower and Bill Mumy), Lois & Clark: The New Adventures of Superman (with Erick Avari, K Callan, Teri Hatcher, and Charles Napier), JAG (with Kevin Conway and Javier Grajeda), The Practice (with Gregory Itzin and Bruce McGill), and the pilot episode of The West Wing.\n\nHis only feature film credits are a small role in Galaxies Are Colliding (1992, starring Kelsey Grammer), and a role as a senator in The Birdcage (1996, starring Robin Williams, featuring Ann Cusack, Lee Delano, James W. Jansen, Tim Kelleher, and Herschel Sparber).\n\nSage suffered a massive stroke early in 2002 which ended his career and he now lives in Van Nuys with his wife, Judy, and their three pets Louie, Annie, and Christopher",
        "birthday": "1940-07-13",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1212047,
        "imdb_id": "nm0756048",
        "known_for_department": "Acting",
        "name": "David Sage",
        "place_of_birth": null,
        "popularity": 0.1653,
        "profile_path": "/vH6jckatlKSJCbTkRcpm7FuxgTt.jpg"
    }
}