{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/i7n9u1SppzXcSO2EVgwEehzABzm.jpg",
                "genre_ids": [
                    37
                ],
                "id": 17529,
                "original_language": "en",
                "original_title": "True Grit",
                "overview": "The murder of her father sends a teenage tomboy on a mission of 'justice', which involves avenging her father's death. She recruits a tough old marshal, 'Rooster' Cogburn because he has 'true grit', and a reputation of getting the job done.",
                "popularity": 3.5697,
                "poster_path": "/9TjGjAD2deCtIG4ebi8LhIyFK6j.jpg",
                "release_date": "1969-06-11",
                "title": "True Grit",
                "video": false,
                "vote_average": 7.331,
                "vote_count": 818,
                "character": "Mrs. Ross",
                "credit_id": "5ce9900f925141522bb9a37f",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Betty Louise Foss"
        ],
        "biography": "Betty Louise Foss was born during the final days of World War I in Alameda, California as the country plagued by a flu epidemic. Within six weeks, her mother died, her father had a nervous breakdown, and relatives passed her care around. As babies were thought to draw the deadly flu, Betty was eventually placed in a San Francisco orphanage where she was later adopted by Scottish immigrants William and Jessie Harrower and raised in Berkeley and Los Angeles. During the Great Depression her adoptive father's salary was cut in half and her adoptive mother decided to take Betty out of school and off to Hollywood to begin an acting career. After trying out several alter egos in the hopes of making an impression on someone in the industry, Betty Foss eventually settled on the identity of Elizabeth Harrower. Elizabeth Harrower appeared in \"Becky Sharp (1935)\", the first feature-length color film in 1935. She would continue to appear in hundreds of radio, television, film and stage productions over the next decades, most notably \"True Grit (1969)\". In 1942, Harrower married Harry Seabold, an Air Force cadet she had met in fifth grade. Their daughter, actress Susan Seaforth Hayes, was born in 1943. Her husband was called into war even before that and the marriage subsequently did not last. By the 1970s Elizabeth Harrower had met soap opera scribe William J. Bell and she would eventually start her writing career and became head writer of \"Days of Our Lives (1965)\" from 1979-1980. She went on to write for Bell's \"The Young and the Restless (1973)\" in the 1980s. Her last writing stint was on the short-lived soap opera \"Generations (1989)\" in 1991. In 2003, already while taking chemotherapy she had a prominent limited run as Charlotte Ramsey on \"The Young and the Restless (1973)\". She died shortly thereafter at age 85.",
        "birthday": "1918-05-28",
        "deathday": "2003-12-10",
        "gender": 1,
        "homepage": null,
        "id": 1213208,
        "imdb_id": "nm0366035",
        "known_for_department": "Acting",
        "name": "Elizabeth Harrower",
        "place_of_birth": "Alameda, California, USA",
        "popularity": 0.1981,
        "profile_path": "/1vy8rEFvr9Szp3kfLaismBSDggR.jpg"
    }
}