{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ihIVjdiuvtVuFUaCqfNJwajIs3i.jpg",
                "genre_ids": [
                    14,
                    10402
                ],
                "id": 13192,
                "original_language": "en",
                "original_title": "Moonwalker",
                "overview": "Moonwalker is a 1988 American experimental anthology musical film starring Michael Jackson. Rather than featuring one continuous narrative, the film expresses the influence of fandom and innocence through a collection of short films about Jackson, some of which are long-form music videos from Jackson's 1987 album Bad. The film is named after his famous dance, \"the moonwalk\", which he originally learned as \"the backslide\" but perfected the dance into something no one had seen before. The movie's introduction is a type of music video for Jackson's \"Man in the Mirror\" but is not the official video for the song. The film then expresses a montage of Michael's career, which leads into a parody of his Bad video titled \"Badder\", followed by sections \"Speed Demon\" and \"Leave Me Alone\". What follows is the biggest section where Michael plays a hero with magical powers and saves three children from Mr. Big. This section is \"Smooth Criminal\" which leads into a performance of \"Come Together\".",
                "popularity": 2.7187,
                "poster_path": "/3GwTPQkAcgDeAirRpEuJG8HDdRz.jpg",
                "release_date": "1988-10-29",
                "title": "Moonwalker",
                "video": false,
                "vote_average": 6.977,
                "vote_count": 587,
                "character": "(segment \"Badder\")",
                "credit_id": "67c591b3564d2575d99209d0",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Cory Tyler (born Cory Lane Tyler, May 25, 1973), was born in Hollywood, California and began working as an actor at the age of 5. Tyler is the son of famed comedian and ventriloquist Willie Tyler (Willie Tyler &amp; Lester). Tyler has appeared in various commercials, television shows and movies which include Michael Jackson's Moonwalker in 1988 and Season 6 of Kids Incorporated. In 1989, Tyler co-hosted Wild &amp; Crazy Kids on Nickelodeon. In the 1990's Tyler appeared as Herbert Little on Beverly Hills, 90210 He is best known for the role of Terrence Taylor on the NBC sitcom A Different World.",
        "birthday": "1973-05-25",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1213336,
        "imdb_id": "nm0878798",
        "known_for_department": "Acting",
        "name": "Cory Tyler",
        "place_of_birth": "Hollywood, California, U.S.",
        "popularity": 0.5278,
        "profile_path": "/ipB2MZSBsPsqGirpzDFTc2aMmUT.jpg"
    }
}