{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dfkE2LppPbJ1qUzi3tdND5iuMFp.jpg",
                "genre_ids": [
                    35,
                    80
                ],
                "id": 10607,
                "original_language": "en",
                "original_title": "Don't Be a Menace to South Central While Drinking Your Juice in the Hood",
                "overview": "When Ashtray moves to South Central L.A. to live with his father (who appears to be the same age he is) and grandmother (who likes to talk tough and smoke reefer), he falls in with his gang-banging cousin Loc Dog, who along with the requisite pistols and Uzi carries a thermo-nuclear warhead for self-defense. Will Ashtray be able to keep living the straight life?",
                "popularity": 6.7019,
                "poster_path": "/HZQBF7JDd2e9p4rPSbSHuWHaCC.jpg",
                "release_date": "1996-01-12",
                "title": "Don't Be a Menace to South Central While Drinking Your Juice in the Hood",
                "video": false,
                "vote_average": 7.03,
                "vote_count": 1402,
                "character": "Crazy Legs",
                "credit_id": "54b836ed9251411d66002a5e",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Suli R. McCullough"
        ],
        "biography": "Suli McCullough is an American comic-actor and screenwriter. He is perhaps best known for his portrayal of \"Crazy Legs\" in the spoof movie Don't Be a Menace to South Central While Drinking Your Juice in the Hood, and for his recurring role as Dwayne \"Mouse\" Abercrombie on the WB sitcom The Jamie Foxx Show.\n\nMcCullough has also had several dramatic roles depicting real-life individuals. He portrayed Tina Turner's oldest biological son Craig Turner in the 1993 biopic What's Love Got to Do with It, as well as civil rights icon Terrence Roberts in the 1993 Disney Channel movie The Ernest Green Story. Additionally, he was a writer on The Tonight Show with Jay Leno and has been the head writer for ESPN's \"ESPY\" Awards.\n\nSuli has two children with ex-wife Donyell McCullough. The oldest daughter, Kennedy Rue is an up and coming actress and has been featured in various acting roles and commercials. His son, Nahzi Rue, is a successful child model.",
        "birthday": "1986-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1214127,
        "imdb_id": "nm0567239",
        "known_for_department": "Acting",
        "name": "Suli McCullough",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.1675,
        "profile_path": "/9kPnQhplaDi7xdDRteUGEvFkBLL.jpg"
    }
}