{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/28XFhXIlmeg19bSOpWKWaWFBEkQ.jpg",
                "genre_ids": [
                    18,
                    36,
                    10749
                ],
                "id": 18320,
                "original_language": "en",
                "original_title": "The Young Victoria",
                "overview": "As the only legitimate heir of England's King William, teenage Victoria gets caught up in the political machinations of her own family. Victoria's mother wants her to sign a regency order, while her Belgian uncle schemes to arrange a marriage between the future monarch and Prince Albert, the man who will become the love of her life.",
                "popularity": 2.5159,
                "poster_path": "/iGyuReyij3bPCtzJdSjTR8PR0pa.jpg",
                "release_date": "2009-03-04",
                "title": "The Young Victoria",
                "video": false,
                "vote_average": 7.166,
                "vote_count": 1039,
                "character": "Earl of Derby (as Johnnie Lyne-Perkis)",
                "credit_id": "679442e3c5081346f148516d",
                "order": 29
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Johnnie Lyne-Perkins",
            "Johnnie Lyne-Pirkis",
            "John Duval",
            "John Duvall"
        ],
        "biography": "John Pirkis was born John Simon Alexander Lyne-Pirkis in Guildford, Surrey, England and grew up in the neighboring market town of Godalming. His father was Dr. Richard Hugh Godfrey Lyne-Pirkis (Born of English Aristocracy; Earls of Liverpool), and his mother (born of Irish Aristocracy; Earls of Carysfort), Ellinor Bessie Maureen (Austin). Their blood runs thick with a healthy blend of Russian, French, German and Scandinavian.\n\nJohn was privately educated; first at Penthorpe preparatory school in Rudgewick, Sussex, and then Sutton Valence School in Kent, where he won several prizes for his writing and public narrative. He trained as an actor at The Bristol Old Vic Theatre School. Shortly after graduating, he took the unconventional step of joining a circus company, touring Mediaeval Jousting Tournaments around Great Britain and Europe as both the Earl Marshall ( Ring Master ), and various Combative Knights. For thirty years since, John appeared internationally on stage, and on screen. Featuring in many established British TV Dramas, including playing, Freddie Chalk Marshall opposite Hugh Laurie in two seasons of the award winning, Jeeves and Wooster. During those thirty years John resided in London.\n\nHe has featured in the Feature Films, National Treasure II and Young Victoria opposite Emily Blunt as her uncle, Duke of Cumberland/Earl of Derby, Swing Kids opposite Robert Sean Leonard, and has completed filming on Stephen Gaghan's Gold with Matthew McConaughy, Bryce Dallas Howard and Corey Stoll.\n\nHis theatre credits include Shakespeare, Chekhov, Oscar Wilde, Bertolt Brecht, Jean-Paul Sartre, Jean-Marie Besset and Nick Ward among others, on London's West End, and throughout Great Britain and Europe. John has also studied with the Meisner Centre in Los Angeles, and studied the Alba Emoting and Feldenkrais techniques at the Université De Montréal.\n\nIn 2002 John co-founded the multi-award winning, Theatre 503 in London, the home of cutting edge new writing, and afforded the title, 'Britain's most important little theatre' by Lynn Gardner of The Guardian (UK). For this, John received recognition as one of the top 100 people to have contributed the most to British theatre in the Twenty-first Century by The Stage. In 2010 Theatre 503 hit the headlines when their production of Katori Hall's The Mountaintop starring David Harewood, Lorraine Burroughs and directed by James Dacre won the Olivier for Best Play making Katori the first Black female writer to win this prestigious award. Following its successful transfer to the West End, it opened on Broadway in 2011 starring Samuel L. Jackson (his Broadway debut), Angela Bassett, and directed by Kenny Leon.\n\nIn 2011 John moved to Los Angeles, where he met and married the French actress and director, Cecile Delepiere. In 2014 they moved to New York with their two rescue cats, Harley Gingerson and Luther. They continue reside in Los Angeles where John continues his work as both actor and an ambassador for Theatre 503.",
        "birthday": "1960-06-12",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.johnpirkis.com/",
        "id": 1214788,
        "imdb_id": "nm0245041",
        "known_for_department": "Acting",
        "name": "John Pirkis",
        "place_of_birth": "Guildford, Surrey, England, UK",
        "popularity": 0.0558,
        "profile_path": "/kFq9r0fJjGcPU1amUt2FaPi9Ukx.jpg"
    }
}