{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bDsXa3PV3biQ8ZK1tQyK4vlkvCc.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 821,
                "original_language": "en",
                "original_title": "Judgment at Nuremberg",
                "overview": "In 1947, four German judges who served on the bench during the Nazi regime face a military tribunal to answer charges of crimes against humanity. Chief Justice Haywood hears evidence and testimony not only from lead defendant Ernst Janning and his defense attorney Hans Rolfe, but also from the widow of a Nazi general, an idealistic U.S. Army captain and reluctant witness Irene Wallner.",
                "popularity": 5.8267,
                "poster_path": "/b6vYatvui1EXeFYfpDX4rcbueuP.jpg",
                "release_date": "1961-12-18",
                "title": "Judgment at Nuremberg",
                "video": false,
                "vote_average": 8.025,
                "vote_count": 864,
                "character": "Dan Haywood",
                "credit_id": "52fe427bc3a36847f80224a1",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/yTKXKR9quKkH8N8szLjWLJ6TLBy.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 1879,
                "original_language": "en",
                "original_title": "Guess Who's Coming to Dinner",
                "overview": "A couple's attitudes are challenged when their daughter brings home a fiancé who is black.",
                "popularity": 4.2157,
                "poster_path": "/fkHeYWahNbhxhuLefaAg553lYo5.jpg",
                "release_date": "1967-12-11",
                "title": "Guess Who's Coming to Dinner",
                "video": false,
                "vote_average": 7.567,
                "vote_count": 876,
                "character": "Matt Drayton",
                "credit_id": "52fe431dc3a36847f803b531",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/wSiBXaJ2PtlxUGH2waIxQZjFPhg.jpg",
                "genre_ids": [
                    28,
                    12,
                    35,
                    80
                ],
                "id": 11576,
                "original_language": "en",
                "original_title": "It's a Mad, Mad, Mad, Mad World",
                "overview": "A group of strangers come across a man dying after a car crash who proceeds to tell them about the $350,000 he buried in California. What follows is the madcap adventures of those strangers as each attempts to claim the prize for himself.",
                "popularity": 7.5039,
                "poster_path": "/j4mWzOisSHFkaqIkq34l2mm8a5K.jpg",
                "release_date": "1963-11-07",
                "title": "It's a Mad, Mad, Mad, Mad World",
                "video": false,
                "vote_average": 6.97,
                "vote_count": 637,
                "character": "C. G. Culpepper",
                "credit_id": "52fe445f9251416c7503264b",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Spencer Bonaventure Tracy",
            "Спенсер Трэйси",
            "Спенсер Треси"
        ],
        "biography": "Spencer Bonaventure Tracy was an American actor, noted for his natural style and versatility. One of the major stars of Hollywood's Golden Age, Tracy won two Academy Awards for Best Actor from nine nominations, sharing the record for nominations in that category with Laurence Olivier.\n\nTracy first discovered his talent for acting while attending Ripon College, and he later received a scholarship for the American Academy of Dramatic Arts. He spent seven years in the theatre, working in a succession of stock companies and intermittently on Broadway. Tracy's breakthrough came in 1930, when his lead performance in The Last Mile caught the attention of Hollywood. After a successful film debut in John Ford's Up the River starring Tracy and Humphrey Bogart, he was signed to a contract with Fox Film Corporation. His five years with Fox featured one acting tour de force after another that were usually ignored at the box office, and he remained largely unknown to audiences after 25 films, almost all of them starring Tracy as the leading man. None of them were hits although The Power and the Glory (1933) features arguably his most acclaimed performance in retrospect.\n\nIn 1935, Tracy joined Metro-Goldwyn-Mayer, at the time Hollywood's most prestigious studio. His career flourished with a series of hit films, and in 1937 and 1938 he won consecutive Oscars for Captains Courageous and Boys Town. He made three smash hit films supporting Clark Gable, the studio's principal leading man, firmly fixing the notion of Gable and Tracy as a team in the public imagination. By the 1940s, Tracy was one of the studio's top stars. In 1942, he appeared with Katharine Hepburn in Woman of the Year, beginning another popular partnership that produced nine movies over 25 years. Tracy left MGM in 1955, and continued to work regularly as a freelance star, despite an increasing weariness as he aged. His personal life was troubled, with a lifelong struggle against severe alcoholism and guilt over his son's deafness. Tracy became estranged from his wife in the 1930s, but never divorced, conducting a long-term relationship with Katharine Hepburn in private. Towards the end of his life, Tracy worked almost exclusively for director Stanley Kramer. It was for Kramer that he made his last film, Guess Who's Coming to Dinner in 1967, completed just 17 days before his death.\n\nDuring his career, Tracy appeared in 75 films and developed a reputation among his peers as one of the screen's greatest actors. In 1999 the American Film Institute ranked Tracy as the 9th greatest male star of Classic Hollywood Cinema.",
        "birthday": "1900-04-05",
        "deathday": "1967-06-10",
        "gender": 2,
        "homepage": null,
        "id": 12147,
        "imdb_id": "nm0000075",
        "known_for_department": "Acting",
        "name": "Spencer Tracy",
        "place_of_birth": "Milwaukee, Wisconsin, USA",
        "popularity": 0.3925,
        "profile_path": "/aUZUlQjiWvl23stKXzxycb31sen.jpg"
    }
}