{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bDsXa3PV3biQ8ZK1tQyK4vlkvCc.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 821,
                "original_language": "en",
                "original_title": "Judgment at Nuremberg",
                "overview": "In 1947, four German judges who served on the bench during the Nazi regime face a military tribunal to answer charges of crimes against humanity. Chief Justice Haywood hears evidence and testimony not only from lead defendant Ernst Janning and his defense attorney Hans Rolfe, but also from the widow of a Nazi general, an idealistic U.S. Army captain and reluctant witness Irene Wallner.",
                "popularity": 5.8267,
                "poster_path": "/b6vYatvui1EXeFYfpDX4rcbueuP.jpg",
                "release_date": "1961-12-18",
                "title": "Judgment at Nuremberg",
                "video": false,
                "vote_average": 8.025,
                "vote_count": 864,
                "character": "Hugo Wallner",
                "credit_id": "52fe427bc3a36847f80224e1",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Howard Cohen"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nHoward Caine (January 2, 1928 – December 28, 1993), was a popular character actor, probably best known as Gestapo agent Major Wolfgang Hochstetter in the television series Hogan's Heroes.\n\nAt the age of 13 Howard Cohen moved with his family from his hometown of Nashville, Tennessee to New York City, where he began studying acting. Learning to erase his Southern accent, he went on to became a master of 32 foreign and American dialects. After serving in World War II- he joined the United States Navy fighting the Japanese in the Pacific theater - Caine continued his studies at The School of Drama, Columbia University, where he graduated summa cum laude.\n\nHe appeared on Broadway in Wonderful Town, Inherit the Wind, Lunatics and Lovers and Tiger at the Gates. He succeeded Ray Walston as \"Mr. Applegate\" in the original production of Damn Yankees. He was featured in such films as From the Terrace (1960), Pay or Die (1960), Judgment at Nuremberg (1961), Brushfire (1962), The Man from the Diner's Club (1963), Pressure Point (1962) and Alvarez Kelly (1966). He co-starred with Godfrey Cambridge and Estelle Parsons in Watermelon Man (1970). He was a member of the Academy of Motion Picture Arts and Science.\n\nHe acted in more than 750 live and filmed television programs, including the 1961 episode \"The Vials\" of the western series Two Faces West. He may be best-remembered as Major Hochstetter on Hogan's Heroes (1965). He was featured as \"Everett Scovill\", a thinly disguised portrait of Charles Manson's attorney Irving Kanarek, on Helter Skelter (1976).\n\nA native of Tennessee, Caine had always been fascinated with the Appalachian five-string banjo, and began mastering it in the mid-'60s. From the summer of 1970 until his death in 1993, he had taken trophies at 29 prominent banjo and fiddle contests in the Southland for both Best Traditional Banjo and Traditional Singing. He was also a popular folk singer and appeared at a number of prominent folk clubs and folk festivals.\n\nDescription above from the Wikipedia article Howard Caine, licensed under CC-BY-SA, full list of contributors on Wikipedia.\n\n​",
        "birthday": "1928-01-02",
        "deathday": "1993-12-28",
        "gender": 2,
        "homepage": null,
        "id": 12159,
        "imdb_id": "nm0128995",
        "known_for_department": "Acting",
        "name": "Howard Caine",
        "place_of_birth": "Nashville, Tennessee, U.S.",
        "popularity": 0.232,
        "profile_path": "/1AlBTHBDwK5yZCi6mXVhii6U0cI.jpg"
    }
}