{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/nrm4FH3Dl9D62B1Lj7dsQgkwXRa.jpg",
                "genre_ids": [
                    10402,
                    18
                ],
                "id": 12104,
                "original_language": "en",
                "original_title": "Pink Floyd: The Wall",
                "overview": "A troubled rock star descends into madness in the midst of his physical and social isolation from everyone.",
                "popularity": 3.2729,
                "poster_path": "/aElHyIdF5jmctFGhlhhaPFsbBJC.jpg",
                "release_date": "1982-07-14",
                "title": "Pink Floyd: The Wall",
                "video": false,
                "vote_average": 7.945,
                "vote_count": 1563,
                "character": "Man on Station",
                "credit_id": "5df6dc58a6d9310014da8b08",
                "order": 41
            },
            {
                "adult": false,
                "backdrop_path": "/7HOT2ECWeSjZkllpBKa2WfIcwO9.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 419743,
                "original_language": "en",
                "original_title": "Disobedience",
                "overview": "New York photographer Ronit flies to London after learning about the death of her estranged father. Ronit is returning to the same Orthodox Jewish community that shunned her decades earlier for her childhood attraction to Esti, a female friend. Their fortuitous and happy reunion soon reignites their burning passion as the two women explore the boundaries of faith and sexuality.",
                "popularity": 3.9686,
                "poster_path": "/skPT4ffWhlmmDOMNEdxOiP6Emfz.jpg",
                "release_date": "2018-04-24",
                "title": "Disobedience",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 1245,
                "character": "Yosef Kirschbaum",
                "credit_id": "5e87a64415376c0018e7f50f",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "David Fleeshman (born 11 July 1952) is a British actor, broadcaster, drama lecturer and theatre director with experience in film, radio, television, theatre and commercials.\n\nFleeshman was born on 11 July 1952 in Glasgow, Scotland, the son of Rosina and William Fleeshman. His family was Jewish. He trained at The Birmingham Theatre School making his stage debut was in 1973 with the Birmingham Repertory Theatre. In 1974 he took a position as actor/assistant stage manager at the Octagon Theatre, Bolton, and has also been an associate director of the Oldham Coliseum Theatre.\n\nIn 1978 he married actress Sue Jenkins, who played Gloria Todd on Coronation Street, 1985–1988, and Jackie Corkhill in the Channel 4 soap Brookside, 1991–2001. They have three children all currently working in the acting profession: Emily Fleeshman, Richard Fleeshman and Rosie Fleeshman.\n\nFleeshman has appeared in and directed numerous plays around the UK and abroad, including Arthur Miller's The Price, for which he won best actor in a supporting role at the Manchester Evening News Theatre Awards in 2005.\n\nAs a theatre director, he directed the European premiere of Neil Simon's Biloxi Blues, and the regional premiere of My Night With Reg, which won best production at the Manchester Evening News Theatre Awards.\n\nFleeshman's major television roles include Boys from the Blackstuff, Edge of Darkness, Silent Witness, and Trial & Retribution, comedy classics such as Only Fools and Horses and A Bit of a Do, as well as stints in Coronation Street, Brookside, Doctors, Emmerdale, and EastEnders. He has also recorded frequently for BBC Radio.\n\nFilmography includes Pink Floyd – The Wall and Unstoppable.\n\nFrom 2013 to 2015 he toured extensively with the Royal National Theatre's War Horse, which played to audiences at venues throughout the United Kingdom, Dublin and South Africa. During 2016 Fleeshman portrayed the judge in Channel 4's National Treasure and played the leading role Charlie Resnick in Darkness, Darkness at the Nottingham Playhouse. From 2016 to 2019, he directed the Christmas pantomimes Aladdin, Snow White and the Seven Dwarfs and Peter Pan (starring Cannon and Ball and Chico Slimani), performed at Crewe Lyceum Theatre.\n\nIn 2018 he was nominated by the Manchester Theatre Awards as best supporting actor for his role as Uncle Vanya.",
        "birthday": "1952-07-11",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1215335,
        "imdb_id": "nm0281418",
        "known_for_department": "Acting",
        "name": "David Fleeshman",
        "place_of_birth": "Glasgow, Scotland, UK",
        "popularity": 0.0944,
        "profile_path": "/2d87T5EVYJYCdOmMxkDcC8GlUPi.jpg"
    }
}