{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xBcuoZooxfrajF8312bSPWqvTMV.jpg",
                "genre_ids": [
                    35
                ],
                "id": 14367,
                "original_language": "en",
                "original_title": "Adventures in Babysitting",
                "overview": "When plans with her boyfriend fall through, high school senior Chris Parker ends up babysitting the Anderson kids, Brad and Sara. What should be a quiet night in, however, turns into a series of ridiculous exploits, starting when they leave the house to pick up Chris' friend Brenda. Soon, Brad's buddy Daryl is involved, and the group must contend with car thieves, blues musicians and much more.",
                "popularity": 2.1274,
                "poster_path": "/8QiAj0Xw2UMeZMIIfZKeNoIsszs.jpg",
                "release_date": "1987-07-01",
                "title": "Adventures in Babysitting",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 702,
                "character": "Drunk at Party",
                "credit_id": "61b0bd401684f7008b75d211",
                "order": 24
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "جان همفیل"
        ],
        "biography": "John Hemphill, born in 1953, is a multi-talented Canadian individual. He is not only an actor but also a writer, creator, and director. Hemphill has been associated with The Second City troupe's Toronto cast for a significant period of time. His writing contributions to SCTV brought him into contact with some of the biggest stars of Second City, including John Candy, Martin Short, Catherine O'Hara, Andrea Martin, and Eugene Levy. Hemphill's most notable on-screen contribution was Happy Marsden, the host of a children's show that broadcasts from a bar.  In addition to his impressive resume, Hemphill has made appearances in several television series such as RoboRoach, The Jane Show, Little Mosque on the Prairie, Maniac Mansion, and notably portrayed the character of Bob Currie in Schitt's Creek. Furthermore, he has also made his mark in television films like Hostage for a Day and Sodbusters.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1215427,
        "imdb_id": "nm0376159",
        "known_for_department": "Acting",
        "name": "John Hemphill",
        "place_of_birth": null,
        "popularity": 0.4171,
        "profile_path": null
    }
}