{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dwVF2gVQLfdbTLlDf2gteqa93gw.jpg",
                "genre_ids": [
                    10751,
                    18,
                    35
                ],
                "id": 340270,
                "original_language": "en",
                "original_title": "The Healer",
                "overview": "The film follows a man with an unwanted gift for healing who meets a teenager with cancer who helps him to find himself.",
                "popularity": 2.791,
                "poster_path": "/mwBsg7cFE7GwDPKP4Pv26w2Txmp.jpg",
                "release_date": "2017-02-17",
                "title": "The Healer",
                "video": false,
                "vote_average": 7.176,
                "vote_count": 522,
                "character": "Father Malloy",
                "credit_id": "587f36e2c3a3682ea2005433",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            " Jorge Fernando Garcia ",
            "خورخه گارسیا"
        ],
        "biography": "Jorge García (born April 28, 1973, height 5' 11½\" (1,82 m)) is an American actor and comedian. He first came to public attention with his performance as Hector Lopez on the television show Becker and later for his portrayal of Hugo \"Hurley\" Reyes in the television series Lost. Garcia also performs as a stand-up comedian. He most recently starred in the FOX television series Alcatraz, as well as playing a minor character on ABC's Once Upon a Time. García was born in Omaha, Nebraska. His mother, Dora Mesa, is a Cuban-born professor, and his father, Humberto Garcia, is a Chilean-born doctor. He grew up in Southern California and went to San Clemente High School. As a senior, he was selected by the faculty as \"Triton of the Year\", the highest award given to a graduating senior.\n\nGarcia graduated from the University of California Los Angeles (UCLA) in 1995 as a Communication Studies major.\n\nGarcía was the first actor to be cast on Lost after the producers saw him on Curb Your Enthusiasm the night before casting began, and created the character of Hugo Reyes specifically for him. García appeared in the second episode of the eighth season of Celebrity Poker Showdown, where he lost to Michael Ian Black. He was a contestant on an episode of Russian Roulette on Game Show Network. He missed a question about the Boxer Rebellion of 1900 and fell through the trap door.\n\nGarcia is scheduled to star in the movie When We Were Pirates due out in 2012. In the independent film, he will play a man named Jason, who along with a group of close friends, learn that their childhood love of playing pirates helps them overcome some of the difficulties they face later in their lives. He is also seen singing in the studio for the upcoming project on an officially released YouTube clip. During Lost's run, Garcia wrote a blog about the show called Dispatches from the Island. He also hosted a weekly podcast, Geronimo Jack's Beard, in which he discussed the script of Season 6 along with his then girlfriend Bethany Leigh Shady.\n\nGarcia is also featured on the front cover of Weezer's album Hurley, released on September 10, 2010. The album is named after his character from Lost. He performed as a guest vocalist at several Weezer concerts in 2010.\n\nOn 21 November 2010, Entertainment Weekly announced that Garcia was cast in the upcoming U.S. television series Alcatraz. On 23 November 2010, Garcia made a guest appearance on How I Met Your Mother's episode \"Blitzgiving\". In the episode references are made to Garcia's time on Lost. In 2011, Garcia appeared as a recurring character in Mr. Sunshine, portraying a caretaker at the Sunshine Center. Starting in January 2012, Garcia portrayed Dr. Diego Soto, an Alcatraz expert, in the FOX series, Alcatraz. The show was a mid-season replacement for Fox's Terra Nova. Despite an impressive start, the series was officially cancelled by Fox on May 9, 2012, due to dropping viewership throughout its run. Garcia appeared on The Nerdist podcast posted June 18, 2012. In 2013, Garcia played Steve Wozniak in the parody film, iSteve produced for the Funny or Die website.",
        "birthday": "1973-04-28",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1215525,
        "imdb_id": "nm0306201",
        "known_for_department": "Acting",
        "name": "Jorge Garcia",
        "place_of_birth": "Omaha, Nebraska, USA",
        "popularity": 0.6914,
        "profile_path": "/hIt31bI76cvwijImRZke3WCoEI4.jpg"
    }
}