{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zd3p7GKopxH4rIjGoDQ1ugalUtx.jpg",
                "genre_ids": [
                    16,
                    10751,
                    10770,
                    12
                ],
                "id": 13382,
                "original_language": "en",
                "original_title": "Rudolph the Red-Nosed Reindeer",
                "overview": "Sam the snowman tells us the story of a young red-nosed reindeer who, after being ousted from the reindeer games because of his glowing nose, teams up with Hermey, an elf who wants to be a dentist, and Yukon Cornelius, the prospector. They run into the Abominable Snowman and find a whole island of misfit toys. Rudolph vows to see if he can get Santa to help the toys, and he goes back to the North Pole on Christmas Eve. But Santa's sleigh is fogged in. But when Santa looks over Rudolph, he gets a very bright idea...",
                "popularity": 1.4632,
                "poster_path": "/xjAElUhXuc7zFJPj3qUHjcySNsE.jpg",
                "release_date": "1964-12-06",
                "title": "Rudolph the Red-Nosed Reindeer",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 619,
                "character": "Hermey (voice)",
                "credit_id": "52fe45629251416c750548f3",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nPaul Robert Soles (11 August 1930 - 26 May 2021) was a Canadian actor and television personality.  He was best known as the original voice of Hermey the misfit elf in Rankin/Bass' Rudolph the Red-Nosed Reindeer in 1964.\n\nSoles voiced the Bruce Banner character in the 1966 Incredible Hulk cartoon series. He also voiced fellow Marvel superhero Spider-Man in the animated television series also from the late 1960s, and he played \"The Lawbreaker\" on the CBC panel quiz show This Is the Law in the 1970s, and played Costas Stavros on the Canadian soap opera Riverdale. In 2001, he took over the role of Shylock the Jew in the Stratford Festival of Canada production of The Merchant of Venice after Al Waxman, who was originally scheduled to play the part, died. Soles played Stanley the pizza shop owner in The Incredible Hulk. He also played Danny, the Montréal Customs House janitor in the 2001 crime thriller, The Score.",
        "birthday": "1930-08-11",
        "deathday": "2021-05-26",
        "gender": 2,
        "homepage": null,
        "id": 1215283,
        "imdb_id": "nm0813015",
        "known_for_department": "Acting",
        "name": "Paul Soles",
        "place_of_birth": "Toronto, Ontario, Canada",
        "popularity": 0.2852,
        "profile_path": "/96fdxpuz3gUUMWhvpPQXrsiUGmh.jpg"
    }
}