{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uEoaOfvWibpvjBNxFoj4MxWn0OH.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 10377,
                "original_language": "en",
                "original_title": "My Cousin Vinny",
                "overview": "Two carefree pals from Brooklyn traveling through rural Alabama on their way back to college are mistakenly arrested, and charged with murder. Fortunately, one of them has a cousin who's a lawyer - Vincent Gambini, a former auto mechanic from Brooklyn who just passed his bar exam after his sixth try. When he arrives with his leather-clad girlfriend, to try his first case, it's a real shock - for him and the Deep South!",
                "popularity": 9.8034,
                "poster_path": "/iwSURa8nS2ujwrU3s1lfxxX7voH.jpg",
                "release_date": "1992-03-13",
                "title": "My Cousin Vinny",
                "video": false,
                "vote_average": 7.499,
                "vote_count": 1695,
                "character": "Guard #2",
                "credit_id": "61b280f2a1a9ba0043c3d3af",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Michael Genevie (born September 30, 1959) is an American stage, film and television actor who was the Executive and Artistic Director of the Abbeville Opera House, the official drama state theatre of South Carolina, from 1979 to 2018.\n\nGenevie was born and raised in West Virginia and graduated in 1976 from the Florida State University School of Theatre, where he earned an MFA in Directing. He began his professional acting and directing career immediately after an Internship at the renowned Actors Theatre of Louisville and has been the Director of the Abbeville Opera House for more than twenty five years.\n\nGenevie has been seen in over 75 feature films, television series and movies of the week.\n\nUnder Genevie's direction, the Abbeville Opera House has twice received the South Carolina Governors Travel Award for Tourism. He is listed in the Abbeville County Hall of Fame for his many contributions to the revitalization of the community. The Abbeville Opera House opened its doors in October 1908.",
        "birthday": "1959-09-30",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.michaelgenevie.com/",
        "id": 1215440,
        "imdb_id": "nm0312807",
        "known_for_department": "Acting",
        "name": "Michael Genevie",
        "place_of_birth": "Weston, West Virginia, USA",
        "popularity": 0.0338,
        "profile_path": null
    }
}