{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bDsXa3PV3biQ8ZK1tQyK4vlkvCc.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 821,
                "original_language": "en",
                "original_title": "Judgment at Nuremberg",
                "overview": "In 1947, four German judges who served on the bench during the Nazi regime face a military tribunal to answer charges of crimes against humanity. Chief Justice Haywood hears evidence and testimony not only from lead defendant Ernst Janning and his defense attorney Hans Rolfe, but also from the widow of a Nazi general, an idealistic U.S. Army captain and reluctant witness Irene Wallner.",
                "popularity": 5.8267,
                "poster_path": "/b6vYatvui1EXeFYfpDX4rcbueuP.jpg",
                "release_date": "1961-12-18",
                "title": "Judgment at Nuremberg",
                "video": false,
                "vote_average": 8.025,
                "vote_count": 864,
                "character": "Rudolph Petersen",
                "credit_id": "52fe427bc3a36847f80224b9",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/agUD7Wp6LAwpaB3phx6yiRmFoSY.jpg",
                "genre_ids": [
                    37
                ],
                "id": 3089,
                "original_language": "en",
                "original_title": "Red River",
                "overview": "Following the Civil War, headstrong rancher Thomas Dunson decides to lead a perilous cattle drive from Texas to Missouri. During the exhausting journey, his persistence becomes tyrannical in the eyes of Matthew Garth, his adopted son and protégé.",
                "popularity": 4.5863,
                "poster_path": "/jyNTsAzrIWB441OtvfbgKtx1kFS.jpg",
                "release_date": "1948-09-17",
                "title": "Red River",
                "video": false,
                "vote_average": 7.339,
                "vote_count": 558,
                "character": "Matthew Garth",
                "credit_id": "52fe4384c3a36847f805a499",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/kpTTUyVxWMTebmBkaxB2YAX8yyU.jpg",
                "genre_ids": [
                    10752,
                    10749,
                    18
                ],
                "id": 11426,
                "original_language": "en",
                "original_title": "From Here to Eternity",
                "overview": "In 1941 Hawaii, a private is cruelly punished for not boxing on his unit's team, while his captain's wife and second in command are falling in love.",
                "popularity": 3.2305,
                "poster_path": "/25Rm1YJSyhXAEu8abonZvW83aPL.jpg",
                "release_date": "1953-08-28",
                "title": "From Here to Eternity",
                "video": false,
                "vote_average": 7.283,
                "vote_count": 669,
                "character": "Pvt. Robert E. Lee 'Prew' Prewitt",
                "credit_id": "52fe443d9251416c7502dbd1",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Edward Montgomery Clift",
            "Monty Clift",
            "Монтгомери Клифт"
        ],
        "biography": "Edward Montgomery “Monty” Clift was an American actor of the Golden Age, known for often playing sensitive or conflicted outcast characters with realistic emotional depth and anxieties.\n\nClift, Marlon Brando and James Dean are the trio typically associated with the new wave of film acting, with Clift being the oldest and first to make his stage and screen debuts. Starting at age 14, he was a breakout talent on Broadway throughout 1935-1945. He finally accepted one of many Hollywood offers: starring in the Western “Red River” which was filmed in 1946 but delayed release for 2 years. Fred Zinnemann’s “The Search” preceded “Red River” as his first film in 1948 and first Academy Award nomination. Clift’s next major films were “The Heiress” (1949) and “A Place in the Sun” (1951), cementing his romantic lead status. At the time, audiences had rarely seen a type of masculinity softened with Clift’s vulnerability. Hollywood had also never seen a young actor control his career and instant stardom the way Clift did in the late 1940’s: notoriously selective, refusing the standard seven-year studio contracts and rewriting scripts to preserve his artistic freedom. In 1953, Zinnemann again directed Clift to an Academy Award nomination in war drama “From Here to Eternity.”\n\nAfter suffering a near-fatal car accident during “Raintree County” (1957) he starred in acclaimed 1960’s films \"Wild River,” \"The Misfits” and “Judgment at Nuremberg” for which he earned a fourth and final Academy Award nomination for his 12-minute scene. Despite a 4-year hiatus and mounting health problems, Clift was eager to make a comeback in \"Reflections in a Golden Eye,” secured by the insurance and insistence of co-star Elizabeth Taylor, but he tragically died of a heart attack at the age of 45 just weeks before shooting began.",
        "birthday": "1920-10-17",
        "deathday": "1966-07-23",
        "gender": 2,
        "homepage": "https://www.cmgww.com/stars/clift/",
        "id": 12151,
        "imdb_id": "nm0001050",
        "known_for_department": "Acting",
        "name": "Montgomery Clift",
        "place_of_birth": "Omaha, Nebraska, USA",
        "popularity": 0.5183,
        "profile_path": "/9dwtVaD3ybBNciTzWiNWNqFpFVj.jpg"
    }
}