{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bDsXa3PV3biQ8ZK1tQyK4vlkvCc.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 821,
                "original_language": "en",
                "original_title": "Judgment at Nuremberg",
                "overview": "In 1947, four German judges who served on the bench during the Nazi regime face a military tribunal to answer charges of crimes against humanity. Chief Justice Haywood hears evidence and testimony not only from lead defendant Ernst Janning and his defense attorney Hans Rolfe, but also from the widow of a Nazi general, an idealistic U.S. Army captain and reluctant witness Irene Wallner.",
                "popularity": 5.8267,
                "poster_path": "/b6vYatvui1EXeFYfpDX4rcbueuP.jpg",
                "release_date": "1961-12-18",
                "title": "Judgment at Nuremberg",
                "video": false,
                "vote_average": 8.025,
                "vote_count": 864,
                "character": "Karl Wieck",
                "credit_id": "52fe427bc3a36847f80224d9",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Emigrating to England in 1933 as the Nazis began their rise to power, Wengraf appeared unbilled in a couple of films there, as well as in some of the first BBC live-television shows ever presented but his career began to languish. In late 1941, however, he had the good fortune of appearing on Broadway with Helen Hayes in \"Candle in the Wind\" and decided to stay. The following year he headed west and settled permanently in the Los Angeles area. A dark, cold-eyed, thin-lipped player with a precise, meticulous air about him, he found himself invariably playing the very characters he detested. Some of his more nefarious nasties surfaced in such films as the Humphrey Bogart classic Sahara (1943/I), as well as The Boy from Stalingrad (1943), U-Boat Prisoner (1944) and Till We Meet Again (1944).  In postwar years, he was often spotted portraying ethnic professionals (scientists, doctors, professors, foreign royalty). Some of the more quality pictures he enhanced were Tomorrow Is Forever (1946); Count Von Papen in 5 Fingers (1952); and Ronchin in the Ethel Merman musical Call Me Madam (1953). Although Wengraf never made it to the very top of the Hollywood character ranks, he remained a throughly strong and reliable player. In the 1950s and 1960s he transferred his talents to TV, appearing on a number of dramatic showcases and on such popular programs as \"The Untouchables\" (1959), \"Hawaiian Eye\" (1959), \"The Man from U.N.C.L.E.\" (1964) and \"The Time Tunnel\" (1966). His last few films included minor roles in the war-themed Judgment at Nuremberg (1961), Hitler (1962) and Ship of Fools (1965). He retired in 1966, and died in Santa Barbara, California, at age 77, on May 4, 1974.",
        "birthday": "1897-04-22",
        "deathday": "1974-05-04",
        "gender": 2,
        "homepage": null,
        "id": 12157,
        "imdb_id": "nm0920987",
        "known_for_department": "Acting",
        "name": "John Wengraf",
        "place_of_birth": "Vienna, Austria-Hungary, now Austria",
        "popularity": 0.1165,
        "profile_path": "/lk8cPT3OgjlhUkud2y4wVMG3imE.jpg"
    }
}