{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bDsXa3PV3biQ8ZK1tQyK4vlkvCc.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 821,
                "original_language": "en",
                "original_title": "Judgment at Nuremberg",
                "overview": "In 1947, four German judges who served on the bench during the Nazi regime face a military tribunal to answer charges of crimes against humanity. Chief Justice Haywood hears evidence and testimony not only from lead defendant Ernst Janning and his defense attorney Hans Rolfe, but also from the widow of a Nazi general, an idealistic U.S. Army captain and reluctant witness Irene Wallner.",
                "popularity": 5.8267,
                "poster_path": "/b6vYatvui1EXeFYfpDX4rcbueuP.jpg",
                "release_date": "1961-12-18",
                "title": "Judgment at Nuremberg",
                "video": false,
                "vote_average": 8.025,
                "vote_count": 864,
                "character": "Hans Rolfe",
                "credit_id": "52fe427bc3a36847f80224b1",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/1oRug23GWxgyQmqQGbX7ke974lp.jpg",
                "genre_ids": [
                    18,
                    36,
                    10752
                ],
                "id": 5902,
                "original_language": "en",
                "original_title": "A Bridge Too Far",
                "overview": "The story of Operation Market Garden—a failed attempt by the allies in the latter stages of WWII to end the war quickly by securing three bridges in Holland allowing access over the Rhine into Germany. A combination of poor allied intelligence and the presence of two crack German panzer divisions meant that the final part of this operation (the bridge in Arnhem over the Rhine) was doomed to failure.",
                "popularity": 8.766,
                "poster_path": "/lszOk3Xmh7qpLaM9J4K9E6ADLk1.jpg",
                "release_date": "1977-06-15",
                "title": "A Bridge Too Far",
                "video": false,
                "vote_average": 7.226,
                "vote_count": 866,
                "character": "General der Waffen-SS Wilhelm Bittrich",
                "credit_id": "52fe442bc3a36847f808669d",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Максимилиан Шелл"
        ],
        "biography": "Maximilian Schell (8 December 1930 – 1 February 2014) was a Swiss actor. Born in Austria, his parents were involved in the arts and he grew up surrounded by performance and literature. While he was still a child, his family fled to Switzerland in 1938 when Austria was annexed by Nazi Germany, and they settled in Zürich. After World War II ended, Schell took up acting and directing full-time.\n\nSchell won the Academy Award for Best Actor for playing a lawyer in the legal drama Judgment at Nuremberg (1961). He was Oscar-nominated for playing a character with multiple identities in The Man in the Glass Booth (1975) and for playing a man resisting Nazism in Julia (1977). Fluent in both English and German, Schell earned top billing in a number of Nazi-era themed films. He acted in films such as Topkapi (1964), The Deadly Affair (1967), Counterpoint (1968), Simón Bolívar (1969), The Odessa File (1974), A Bridge Too Far (1977), and Deep Impact (1998).\n\nOn television, he received two Primetime Emmy Award nominations for the NBC film Miss Rose White and the HBO television film Stalin (1992), the later of which earned him the Golden Globe Award for Best Supporting Actor – Series, Miniseries or Television Film. He also portrayed Otto Frank in the TV film The Diary of Anne Frank (1980), the Russian emperor Peter the Great in the NBC series Peter the Great (1986), Frederick the Great in the British series Young Catherine (1991), and Brother Jean le Maistre in the miniseries Joan of Arc (1999).\n\nSchell also performed in a number of stage plays, including a celebrated performance as Prince Hamlet. Schell was an accomplished pianist and conductor, performing with Claudio Abbado and Leonard Bernstein, and with orchestras in Berlin and Vienna. His elder sister was the internationally noted actress Maria Schell; he produced the documentary tribute My Sister Maria in 2002.\n\nDescription above from the Wikipedia article Maximilian Schell, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1930-12-08",
        "deathday": "2014-02-01",
        "gender": 2,
        "homepage": null,
        "id": 12150,
        "imdb_id": "nm0001703",
        "known_for_department": "Acting",
        "name": "Maximilian Schell",
        "place_of_birth": "Vienna, Austria",
        "popularity": 0.4688,
        "profile_path": "/6WLkJ6Lj8bhO3MdV8EBx41ZWjbL.jpg"
    }
}