{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lAaAtQ5b8iX9JeG6QUq4RM1paKD.jpg",
                "genre_ids": [
                    18
                ],
                "id": 10435,
                "original_language": "en",
                "original_title": "Chaplin",
                "overview": "An aged Charlie Chaplin narrates his life to his autobiography's editor, including his rise to wealth and comedic fame from poverty, his turbulent personal life and his run-ins with the FBI.",
                "popularity": 2.9824,
                "poster_path": "/Aeltt5tl02zrEj4GoMynHc94lWG.jpg",
                "release_date": "1992-12-17",
                "title": "Chaplin",
                "video": false,
                "vote_average": 7.438,
                "vote_count": 1131,
                "character": "Yankee Doodle Dancer",
                "credit_id": "63808ffd6e938a00cd00f3ef",
                "order": 49
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "​From Wikipedia, the free encyclopedia\n\nLeonard was born in Blackpool, Lancashire, England, UK. She was a pupil at Greenlands High School in Blackpool. Leonard trained at the London Academy of Music and Dramatic Art and was the winner of the Michael Warre Award for Best Actress in 1988.  Leonard has been appearing on British television since the early 1990s. She has had roles in May to December in 1992, A Time to Dance in 1992, Inspector Morse in 1993 and Peak Practice 1993 to 1996, where she played Sarah Preston for four series. Following this she was cast as Lorraine Wicks in the BBC soap opera EastEnders, a role she played from 1996 to 1997. She took a year off work when she left EastEnders to move from London to Lancashire and care for her sick mother.\n\nDescription above from the Wikipedia article Jacqueline Leonard, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1965-11-28",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1215324,
        "imdb_id": "nm0502652",
        "known_for_department": "Acting",
        "name": "Jacqueline Leonard",
        "place_of_birth": "Blackpool, Lancashire, England, UK",
        "popularity": 0.0791,
        "profile_path": "/2aGtBfGhJTTCVaPdIO3JIRfeKhh.jpg"
    }
}