{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gEsBPNcGAuNBU5MGaOAlnm6uDe7.jpg",
                "genre_ids": [
                    10749,
                    18
                ],
                "id": 417261,
                "original_language": "en",
                "original_title": "Forever My Girl",
                "overview": "After being gone for a decade, a country star returns home to the love he left behind.",
                "popularity": 4.4848,
                "poster_path": "/bKqdggnIPeOI15VqtBZTkvh4hA9.jpg",
                "release_date": "2018-01-26",
                "title": "Forever My Girl",
                "video": false,
                "vote_average": 7.605,
                "vote_count": 1303,
                "character": "Sam",
                "credit_id": "57e2e2429251411d2400161a",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Peter was born in Houston, TX. He attended college at Wesleyan  University in Connecticut where he received a B.A. in English. Peter  then moved to New York to pursue a career in acting. After two years in  New York, he was accepted by The American Repertory Theatre's Institute  for Advanced Theatre Training at Harvard University and the Moscow Art  Theatre, where he received an M.F.A in Acting. Shortly after receiving  his M.F.A., Peter was cast in the Mark Taper Forum's production of The  Cherry Orchard starring Annette Bening and Alfred Molina in 2006. During  the production, a producer asked him to come and audition for the pilot  of ABC's Notes from the Underbelly, in which he was cast starring  opposite Jennifer Westfeldt. The series was picked up that summer, and  ran on ABC for two seasons. Peter was next cast in CBS's drama NCIS:Los  Angeles as Operations Psychologist Nate Getz. He still appears as Nate  as a recurring cast member. Peter recently starred in the TBS comedy  Wedding Band which aired in the fall of 2012. He just wrapped up  shooting the NBC pilot Assistance starring Krysten Ritter, Alfred  Molina, Zach Cregger, and Vinette Robinson.",
        "birthday": "1978-09-28",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1215805,
        "imdb_id": "nm1186775",
        "known_for_department": "Acting",
        "name": "Peter Cambor",
        "place_of_birth": "Houston, Texas, USA",
        "popularity": 0.4598,
        "profile_path": "/9mvUdSbOBdQdOAM5H2L0GVxBOV.jpg"
    }
}