{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/oG9dcGSSu13fjFp1Uly15ZXjRKV.jpg",
                "genre_ids": [
                    16,
                    10751,
                    14,
                    12,
                    35,
                    10749
                ],
                "id": 11970,
                "original_language": "en",
                "original_title": "Hercules",
                "overview": "Bestowed with superhuman strength, a young mortal named Hercules sets out to prove himself a hero in the eyes of his father, the great god Zeus. Along with his friends Pegasus, a flying horse, and Phil, a personal trainer, Hercules is tricked by the hilarious, hotheaded villain Hades, who's plotting to take over Mount Olympus!",
                "popularity": 9.7005,
                "poster_path": "/dK9rNoC97tgX3xXg5zdxFisdfcp.jpg",
                "release_date": "1997-06-13",
                "title": "Hercules",
                "video": false,
                "vote_average": 7.498,
                "vote_count": 7693,
                "character": "Alcmene (voice)",
                "credit_id": "52fe44ac9251416c7503d0d1",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/sm3ErHMXQLaNdo74vbIa1JRXIXS.jpg",
                "genre_ids": [
                    18,
                    37
                ],
                "id": 1712,
                "original_language": "en",
                "original_title": "Giant",
                "overview": "Wealthy rancher Bick Benedict and dirt-poor cowboy Jett Rink both woo Leslie Lynnton, a beautiful young woman from Maryland who is new to Texas. She marries Benedict, but she is shocked by the racial bigotry of the White Texans against the local people of Mexican descent. Rink discovers oil on a small plot of land, and while he uses his vast, new wealth to buy all the land surrounding the Benedict ranch, the Benedict's disagreement over prejudice fuels conflict that runs across generations.",
                "popularity": 3.9693,
                "poster_path": "/oQ1Arue52pFLSvvwfcNTy16hTCG.jpg",
                "release_date": "1956-11-08",
                "title": "Giant",
                "video": false,
                "vote_average": 7.614,
                "vote_count": 722,
                "character": "Mary Lou Decker",
                "credit_id": "594ac7e5c3a36832ad002266",
                "order": 30
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Барбара Барри",
            "Барбара Бэрри"
        ],
        "biography": "Barbara Barrie (born Barbara Ann Berman, May 23, 1931) is an American actress of film, stage and television. She is also an accomplished author.\n\nHer film breakthrough came in 1964 with her performance as Julie in the landmark film One Potato, Two Potato, for which she won the Best Actress Award at the Cannes Film Festival. She is best known for her role as Evelyn Stoller in Breaking Away, which brought her an Academy Award nomination for Best Supporting Actress in 1979 and an Emmy Award nomination in 1981 when she reprised the role in the television series based on the film.\n\nOn television she is perhaps best known for her portrayal, between 1975 and 1978, of the wife of the namesake captain in the detective sitcom Barney Miller. Barrie also is known for her extensive work in the theatre, receiving a Tony Award nomination for Best Featured Actress in a Musical in 1971 for originating the role of Sarah in Stephen Sondheim's Company.",
        "birthday": "1931-05-23",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1216876,
        "imdb_id": "nm0057363",
        "known_for_department": "Acting",
        "name": "Barbara Barrie",
        "place_of_birth": "Chicago, Illinois, USA",
        "popularity": 0.396,
        "profile_path": "/eUVrPjqoAKGFuF6ORUOEzfXgAhb.jpg"
    }
}