{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6MKr3KgOLmzOP6MSuZERO41Lpkt.jpg",
                "genre_ids": [
                    35,
                    80,
                    12
                ],
                "id": 337404,
                "original_language": "en",
                "original_title": "Cruella",
                "overview": "In 1970s London amidst the punk rock revolution, a young grifter named Estella is determined to make a name for herself with her designs. She befriends a pair of young thieves who appreciate her appetite for mischief, and together they are able to build a life for themselves on the London streets. One day, Estella’s flair for fashion catches the eye of the Baroness von Hellman, a fashion legend who is devastatingly chic and terrifyingly haute. But their relationship sets in motion a course of events and revelations that will cause Estella to embrace her wicked side and become the raucous, fashionable and revenge-bent Cruella.",
                "popularity": 11.2552,
                "poster_path": "/hjS9mH8KvRiGHgjk6VUZH7OT0Ng.jpg",
                "release_date": "2021-05-26",
                "title": "Cruella",
                "video": false,
                "vote_average": 7.987,
                "vote_count": 9720,
                "character": "Asthma Man",
                "credit_id": "651291fc3a4a120139578ff9",
                "order": 51
            },
            {
                "adult": false,
                "backdrop_path": "/upyQnoXc0RP4DXhPbijG7xDlSos.jpg",
                "genre_ids": [
                    18
                ],
                "id": 11159,
                "original_language": "en",
                "original_title": "Secrets & Lies",
                "overview": "After her adoptive mother dies, Hortense, a successful black optometrist, seeks out her birth mother. She's shocked when her research leads her to Cynthia, a working class white woman.",
                "popularity": 3.1581,
                "poster_path": "/zQBuRQ3hrLhkEsXcxteUxuxLrvs.jpg",
                "release_date": "1996-05-24",
                "title": "Secrets & Lies",
                "video": false,
                "vote_average": 7.552,
                "vote_count": 686,
                "character": "Hortense's Brother",
                "credit_id": "5431a0410e0a265915002471",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Trevor H. Laird",
            "Trevor H Laird"
        ],
        "biography": "Trevor Laird (born 11 July 1957, London, England) is a British actor.\n\nBorn in Islington, London in 1957, Laird trained at the Anna Scher Theatre. Early roles included a 1976 role in a TV adaptation of the Peter Prince novel Playthings, directed by Stephen Frears, and several Play For Todays: Victims of Apartheid by Tom Clarke (1978),Barrie Keeffe's Waterloo Sunset (1979) and The Vanishing Army by Robert Holles (1980).\n\nLaird was a founder member of the Black Theatre Co-operative (now NitroBeat) in 1978 and performed in its inaugural play Welcome Home Jacko by Mustapha Matura the following year. He then had breakthrough roles in the 1979 film Quadrophenia - as Ferdy, a drug supplier for the main character Jimmy - and in Franco Rosso's 1980 cult classic Babylon as Beefy. He played the boy under the car in The Long Good Friday (1980) and appeared in Menelik Shabazz's black British film Burning an Illusion.\n\nLater appearances include the 1986 Doctor Who serial Mindwarp as the guard commander Frax. He later returned to Doctor Who in the role of Clive Jones, father of the Tenth Doctor's companion Martha Jones.\n\nIn 1996 Laird played Hortense's brother in the Mike Leigh film Secrets & Lies. He played Wesley Carter in the TV series Undercover Heart, and Trevor in the British gangster film Love, Honour and Obey (2000). He played DI Mike Vedder “End of the Night”, S8:E4 of Waking the Dead (2009).\n\nIn 2015, Laird appeared as Vince Thuram in the BBC TV series Death in Paradise. In March 2021, he appeared in an episode of the BBC soap opera Doctors as Samuel Asante.",
        "birthday": "1957-07-11",
        "deathday": null,
        "gender": 2,
        "homepage": "https://riversidestudios.co.uk/our-story/riverside-reflections/trevor-laird/",
        "id": 1216607,
        "imdb_id": "nm0481994",
        "known_for_department": "Acting",
        "name": "Trevor Laird",
        "place_of_birth": "Islington, London, England",
        "popularity": 0.3053,
        "profile_path": "/naIxoiikITirsPBKX10YC2Tb490.jpg"
    }
}