{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sSN5agmiCE4NIuhWr2a58TRCz1t.jpg",
                "genre_ids": [
                    18
                ],
                "id": 244088,
                "original_language": "it",
                "original_title": "Il capitale umano",
                "overview": "The destinies of two families are irrevocably tied together after a cyclist is hit off the road by a jeep in the night before Christmas Eve.",
                "popularity": 3.433,
                "poster_path": "/nQxQ2N2wXksZnHa2ZzdwCbDtmkE.jpg",
                "release_date": "2013-12-03",
                "title": "Human Capital",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 923,
                "character": "Dino Ossola",
                "credit_id": "52fe4eebc3a36847f82b09b9",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/tAbDYp1b7zK2oOhJKcza63dUtOl.jpg",
                "genre_ids": [
                    35,
                    12
                ],
                "id": 636565,
                "original_language": "it",
                "original_title": "L'incredibile storia dell'Isola delle Rose",
                "overview": "In 1968, engineer Giorgio Rosa established the independent state called \"The Isle of Roses\" off the coast of Rimini, built on a platform outside the territorial waters, with Esperanto as the official language. The Italian authorities did not take it well because the micronation was seen as an expedient to not pay taxes on the revenues obtained thanks to the arrival of numerous tourists and curious people.",
                "popularity": 2.3373,
                "poster_path": "/fbmYUDOo6tNq3A1VWhhxE6pjNEB.jpg",
                "release_date": "2020-12-09",
                "title": "Rose Island",
                "video": false,
                "vote_average": 7.036,
                "vote_count": 1361,
                "character": "Franco Restivo",
                "credit_id": "5d970e602c6b7b00139431f5",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nFabrizio Bentivoglio (born January 4, 1957) is an Italian cinema and theatre actor and a screenwriter.\n\nFabrizio Bentivoglio was born in Milan (his father is Venetian). After only one season in the juvenile team of Inter, he left his sporting career because of an injury to his left knee and attended the school of the Piccolo Teatro in Milan. He debuted on stage acting in Timone d'Atene by William Shakespeare and also pursued his artistic career in cinema.\n\nContinuing his studies in medicine, he then moved to Rome. With Dario de Luca and in association with Studio Universal he founded the Tipota Movie Company.\n\nWith the band Piccola Orchestra Avion Travel he has staged the show La guerra vista dalla luna. He has also filmed the short film Típota (1999) and has completed a tour performing his own songs.\n\nThe soundtrack of Eternity and a Day (Italy/France/Greece, 1998) by Theo Angelopoulos contains the track The Poet, with Bentivoglio's voice.\n\nDescription above from the Wikipedia article Fabrizio Bentivoglio, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1957-01-04",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 121732,
        "imdb_id": "nm0072768",
        "known_for_department": "Acting",
        "name": "Fabrizio Bentivoglio",
        "place_of_birth": "Milan, Lombardy, Italy",
        "popularity": 0.1986,
        "profile_path": "/euq5Tt0lDF0kLlAtgSyuiO7OShR.jpg"
    }
}