{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6qOyw4yfzbzTp5YsCX26C28Do0S.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 872,
                "original_language": "en",
                "original_title": "Singin' in the Rain",
                "overview": "In 1927 Hollywood, a silent film star falls for a chorus girl just as he and his paranoid screen partner struggle to make the difficult transition to talking pictures.",
                "popularity": 4.2669,
                "poster_path": "/w03EiJVHP8Un77boQeE7hg9DVdU.jpg",
                "release_date": "1952-04-10",
                "title": "Singin' in the Rain",
                "video": false,
                "vote_average": 8.146,
                "vote_count": 3306,
                "character": "Lady-in-Waiting (uncredited)",
                "credit_id": "532b836fc3a3684ba400033f",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Elsy Steinberg"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nElaine Stewart was an American actress and model.\n\nStewart was born in Montclair, New Jersey as Elsy Steinberg. She was one of five children born into a German Jewish family. In 1961, nearing the end of her television career, she married actor Bill Carter. After her divorce from Carter, she married television producer Merrill Heatter on December 31, 1964. They had a son, Stewart, and a daughter, Gabrielle.\n\nStewart made her debut by winning Miss See in See Magazine in 1952, with measurements 34–25–36. She was in many magazines such as Playboy and Photoplay. She had a supporting role in The Bad and the Beautiful (1952), as Lila, a starlet who has a romantic fling with a producer played by Kirk Douglas. She was featured as the love interest of Sgt Ryan, played by Richard Widmark, in Take the High Ground! (1953) as Julie.\n\nShe appeared in other films, such as Brigadoon, Night Passage, Code Two, The Rise and Fall of Legs Diamond, and The Adventures of Hajji Baba. Stewart had a small but key role, as Anne Boleyn, in 1953's Young Bess. She co-starred with Jeff Chandler in the film noir The Tattered Dress (1957), with Victor Mature in the western Escort West (1958) and shared top billing with John Derek in a 1958 adventure film, High Hell before turning to television.\n\nStewart guest-starred in TV series such as Bat Masterson and Burke's Law, both starring Gene Barry. In her last acting appearance on TV, she played Irene Grey in the Perry Mason episode \"The Case of the Capering Camera\" in 1964. Stewart was a co-hostess on two 1970s game shows, Gambit with Wink Martindale and the nighttime edition of High Rollers with Alex Trebek, both produced by her husband, Merrill Heatter.\n\nStewart died on June 27, 2011, at the age of 81.",
        "birthday": "1930-05-31",
        "deathday": "2011-06-27",
        "gender": 1,
        "homepage": null,
        "id": 121765,
        "imdb_id": "nm0829359",
        "known_for_department": "Acting",
        "name": "Elaine Stewart",
        "place_of_birth": " Montclair, New Jersey, USA",
        "popularity": 0.3157,
        "profile_path": "/rbMTE2NitqDD3fsfxxvS1O1xsP9.jpg"
    }
}