{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5rARlA8beRAVXPYzSaF2NoS8Ry5.jpg",
                "genre_ids": [
                    16,
                    35,
                    10751,
                    14
                ],
                "id": 76492,
                "original_language": "en",
                "original_title": "Hotel Transylvania",
                "overview": "Welcome to Hotel Transylvania, Dracula's lavish five-stake resort, where monsters and their families can live it up and no humans are allowed. One special weekend, Dracula has invited all his best friends to celebrate his beloved daughter Mavis's 118th birthday. For Dracula catering to all of these legendary monsters is no problem but the party really starts when one ordinary guy stumbles into the hotel and changes everything!",
                "popularity": 11.4196,
                "poster_path": "/eJGvzGrsfe2sqTUPv5IwLWXjVuR.jpg",
                "release_date": "2012-09-20",
                "title": "Hotel Transylvania",
                "video": false,
                "vote_average": 6.963,
                "vote_count": 8886,
                "character": "Additional Voices (voice)",
                "credit_id": "5da8c7c9e92d8300189a390b",
                "order": 29
            },
            {
                "adult": false,
                "backdrop_path": "/bVSOgrxasVJF6V71T7v2KfBRSzu.jpg",
                "genre_ids": [
                    18,
                    27,
                    878
                ],
                "id": 933260,
                "original_language": "en",
                "original_title": "The Substance",
                "overview": "A fading celebrity decides to use a black market drug, a cell-replicating substance that temporarily creates a younger, better version of herself.",
                "popularity": 27.9805,
                "poster_path": "/lqoMzCcZYEFK729d6qzt349fB4o.jpg",
                "release_date": "2024-09-07",
                "title": "The Substance",
                "video": false,
                "vote_average": 7.152,
                "vote_count": 5074,
                "character": "Additional Voices (voice)",
                "credit_id": "670f141d7a22bf3607f27048",
                "order": 80
            },
            {
                "adult": false,
                "backdrop_path": "/cXPOtGdWhx9MNMOOQCIFjnKBPoi.jpg",
                "genre_ids": [
                    10751,
                    16,
                    12,
                    35
                ],
                "id": 77174,
                "original_language": "en",
                "original_title": "ParaNorman",
                "overview": "In the town of Blithe Hollow, Norman Babcock can speak to the dead, but no one other than his eccentric new friend believes his ability is real. One day, Norman's eccentric uncle tells him of a ritual he must perform to protect the town from a curse cast by a witch centuries ago.",
                "popularity": 7.6105,
                "poster_path": "/9DZPtuYTKYxt6vzHvZ5FLThG4fl.jpg",
                "release_date": "2012-08-03",
                "title": "ParaNorman",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 2633,
                "character": "Movie Zombie (voice)",
                "credit_id": "68482be949572790b630200c",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Michael Corbett began his career on Broadway, and then quickly made the transition to Television. In his 16 years starring on daytime television, Michael Corbett was voted \"Daytime's Most Lovable Cad\" by People magazine, for his red-hot starring roles in three different soap operas. He first starred for three years on Ryan's Hope for ABC, next for four years on Search for Tomorrow for NBC, and then nine years playing David Kimble on the CBS number-one daytime ratings grabber in the United States, Canada, and Europe, The Young and the Restless. He starred in several movies, Broadway shows and numerous guest star roles.\n\nMichael Corbett is the Real Estate and Lifestyle Host of NBC's number-one-rated national news magazine show Extra. And is host and producer of NBC's Extra's Mansions & Millionaires! Corbett is now the very popular resident real estate expert for five major television shows - ABC's The View, CNN's Newsroom, NBC's Extra, and his weekly Friday morning real estate segments on FOX AND FRIENDS. His real estate expertise even reaches as far as The Today Show Australia. He is also Trulia.com's real estate expert with real estate tips and content syndicated nationally\n\nMichael also regularly appears on CBS News, HGTV, Discovery Channel and had a long run as the featured real estate expert for Larry King Live! His real estate expertise and advice has been featured in all major nation publications including New York Times, Los Angeles Times, Miami Herald, Newsweek, Wall Street Journal, Forbes, Newsweek, Smart Money, Huffington Post, People Magazine, Yahoo Real Estate and Business Week.",
        "birthday": "1956-06-20",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1217688,
        "imdb_id": "nm0179182",
        "known_for_department": "Acting",
        "name": "Michael Corbett",
        "place_of_birth": "Philadelphia, Pennsylvania, USA",
        "popularity": 0.1251,
        "profile_path": "/AfaPGnHtlyt9uEUgY7jzSZ1FvkF.jpg"
    }
}