{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/p2U4wScUValTXnvikXy7kfQNDsH.jpg",
                "genre_ids": [
                    18,
                    9648,
                    53
                ],
                "id": 891,
                "original_language": "en",
                "original_title": "All the President's Men",
                "overview": "During the 1972 elections, two reporters' investigation sheds light on the controversial Watergate scandal that compels President Nixon to resign from his post.",
                "popularity": 9.3472,
                "poster_path": "/qwdcIdiTAk8iANsJEK2JmrYQx5o.jpg",
                "release_date": "1976-04-09",
                "title": "All the President's Men",
                "video": false,
                "vote_average": 7.656,
                "vote_count": 1927,
                "character": "Al Lewis",
                "credit_id": "63a04e53da10f01c8d7dec3d",
                "order": 39
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Joshua Shelley (born Joshua Kurzweil; January 27, 1920 – February 16, 1990) was one of the actors blacklisted by movie studios as a result of the House Un-American Activities Committee's (HUAC) investigation of the Communist Party in Hollywood in 1952. He did not begin to again work regularly in Hollywood until 1973 when his career restarted.\n\nA member of The Actors Studio from its inception in 1947, Shelley worked frequently on stage, both on and off Broadway, during his Hollywood exile. Shelley's onscreen work, both pre- and post-blacklist, was confined primarily to television. Nonetheless, two career highlights remain Shelley's enthusiastically received 1949 feature film debut in City Across the River, as well as the blacklist-related 1976 film, The Front, notable for reuniting Shelley with several fellow blacklistees, including cast members Zero Mostel, Herschel Bernardi, and Lloyd Gough, screenwriter Walter Bernstein and director Martin Ritt, the latter also a fellow Actors Studio member.\n\nFrom Wikipedia, the free encyclopedia.",
        "birthday": "1920-01-27",
        "deathday": "1990-02-16",
        "gender": 2,
        "homepage": null,
        "id": 1217165,
        "imdb_id": "nm0791206",
        "known_for_department": "Acting",
        "name": "Joshua Shelley",
        "place_of_birth": "New York, New York, USA",
        "popularity": 0.1791,
        "profile_path": "/4isJWSpw4auLbAnfjAkvzkRRu5j.jpg"
    }
}