{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9vJ57nbL4hWJrmsyjKTxiGXqrBU.jpg",
                "genre_ids": [
                    80,
                    18,
                    9648
                ],
                "id": 11929,
                "original_language": "en",
                "original_title": "Dolores Claiborne",
                "overview": "Dolores Claiborne was accused of killing her abusive husband twenty years ago, but the court's findings were inconclusive and she was allowed to walk free. Now she has been accused of killing her employer, Vera Donovan, and this time there is a witness who can place her at the scene of the crime. Things look bad for Dolores when her daughter Selena, a successful Manhattan magazine writer, returns to cover the story.",
                "popularity": 4.4851,
                "poster_path": "/r1Yt0Mls43K2bzFONdaqDtTRTKM.jpg",
                "release_date": "1995-03-24",
                "title": "Dolores Claiborne",
                "video": false,
                "vote_average": 7.27,
                "vote_count": 815,
                "character": "Young Selena",
                "credit_id": "544a64b10e0a26748c004181",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ellen Anna Muth",
            "Elle"
        ],
        "biography": "Ellen Muth (born March 6, 1981) is a retired American actress best known for her role as Georgia \"George\" Lass in Showtime's series Dead Like Me (2003–2004 series, 2009 film). Muth was born in Milford, Connecticut, to Eric (a military veteran) and Rachel Muth\n\nAs of 2004, Muth was a member of Intertel and Mensa, high-IQ societies. She attended the Skip Barber Racing Schoo and the Lee Strasberg Theatre and Film Institute.\n\nAfter a brief stint as a model with Ford Models and Rascal's Agency, Muth pursued a career in acting, studying at the Lee Strasberg Theatre and Film Institute in New York City, and getting her first professional experience doing commercials in 1993. Her first major role was in the 1995 film Dolores Claiborne. She followed that with a role in the eighth-season premiere of Law & Order. Muth's appearance as the daughter in the 1999 film The Young Girl and the Monsoon earned praise from Stephen Holden of The New York Times for her range in portraying a character \"who one minute can be as clinging as a baby and the next delights in cruelly demolishing the nearest grownup with laser-like sarcasm\" and her chemistry \"whenever Constance (who narrates the film) is on the screen with her father Hank (Terry Kinney)\"\n\nMuth starred in the 2003–04 Showtime television series Dead Like Me in the role of Georgia \"George\" Lass, the protagonist and one of a team of grim reapers. After some delay, Dead Like Me: Life After Death, a film directed by Stephen Herek based on Dead Like Me and featuring many members of the show's cast, including Muth, was released direct-to-video in March 2009.\n\nIn 2012, Muth returned to the big screen in the romantic comedy Margarine Wars alongside Robert Loggia and Doris Roberts. The film debuted in Los Angeles on March 29, 2012\n\nIn 2013, Muth made a guest appearance in two episodes of the first season of the TV series Hannibal, produced by Bryan Fuller, the creator of Dead Like Me. In a 2015 interview, Muth confirmed that she had \"hit the pause button on the acting\" part of her life.",
        "birthday": "1981-03-06",
        "deathday": null,
        "gender": 1,
        "homepage": "https://muthrosten.weebly.com/",
        "id": 1218072,
        "imdb_id": "nm0616091",
        "known_for_department": "Acting",
        "name": "Ellen Muth",
        "place_of_birth": "New Milford, Connecticut, USA",
        "popularity": 0.3459,
        "profile_path": "/gdp6IFmpnkgHtOvZvGMvNNr3qmV.jpg"
    }
}