{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/96WHK0TiIslmM8rGVIejMtMtaPG.jpg",
                "genre_ids": [
                    12,
                    28,
                    53,
                    878
                ],
                "id": 604,
                "original_language": "en",
                "original_title": "The Matrix Reloaded",
                "overview": "The Resistance builds in numbers as humans are freed from the Matrix and brought to the city of Zion. Neo discovers his superpowers, including the ability to see the code inside the Matrix. With machine sentinels digging to Zion in 72 hours, Neo, Morpheus and Trinity must find the Keymaker to ultimately reach the Source.",
                "popularity": 9.6725,
                "poster_path": "/9TGHDvWrqKBzwDxDodHYXEmOE6J.jpg",
                "release_date": "2003-05-15",
                "title": "The Matrix Reloaded",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 11450,
                "character": "Priestess",
                "credit_id": "52fe425cc3a36847f80183cd",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Valerie Berry is an actor, performance maker and theatre educator. Throughout her practice, she has focused on collaborative and interdisciplinary processes.\n\nShe has worked with, National Theatre of Parramatta (Swallow, 2016. Dir: Kate Champion), Cake Industries (Sydney Festival 2016, Robotronica Festival 2015/2017, Fun4Kids Festival 2017), Polyglot Theatre (Paper Planet: Sydney and Norway), Blacktown Arts Centre, Theatre Kantanka, Urban Theatre Projects, Belvoir, Version 1.0, Branch Nebula, Performance Space, Sydney Theatre Company, Performing Lines (Tour Germany and Adelaide Festival, Ur/Faust; and National tour of The Folding Wife), Bell Shakespeare/Canute Productions (Sadako and the Thousand Paper Cranes), and Campbelltown Arts Centre.\n\nShe co- directed/facilitated Shopfront Theatre’s 2015 Junior Ensemble show, Chasing your Shadow (Shopfront 2015 and Way Out West Festival, 2016).\n\nValerie is one of the mentors and facilitator for CuriousWork’s Beyond Refuge program (working with writers and film makers with migrant, Refugee and recent settler backgrounds), and a guest facilitator for Beyond The Square, Access Program, Riverside Theatres. Now based in Adelaide, Valerie has worked with Vitalstatistix (Border Crossers, Adhocracy 2017) and with Paul Gazzola(OSCA) for the SUE Project.\n\nValerie has had an on going collaborative partnership with multimedia artists, Anino Shadowplay Collective (Manila)  and Paschal Daantos Berry, since 2005: The Folding Wife; Within and Without;  Arkipelago (Jakarta, Indonesia); Arkipelago2: Intima-sea (Yogyakarta, Indonesia), and This here.Land, for Performance Space’s award winning, Liveworks Festival 2017 program.\n\nValerie’s film and television credits include, The Matrix Reloaded, The Great Raid, (award winning independent film) Supposed the Night Tasted Like Sugar, Rope Burns, Spirited, Big Sky and A Difficult Woman. Valerie’s radio drama credits for ABC Radio National include, The Folding Wife, Conversations through the Wall, Ancestry of my eyes, Rita’s Lullaby, Season to Taste and Lotus War.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "http://actnowtheatre.org.au/valerie-berry/",
        "id": 1218802,
        "imdb_id": "nm0077688",
        "known_for_department": "Acting",
        "name": "Valerie Berry",
        "place_of_birth": null,
        "popularity": 0.0362,
        "profile_path": "/vE5RjLdmXIo2hxn8GlpDXvaTC4e.jpg"
    }
}