{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/nvxrQQspxmSblCYDtvDAbVFX8Jt.jpg",
                "genre_ids": [
                    35,
                    878
                ],
                "id": 646380,
                "original_language": "en",
                "original_title": "Don't Look Up",
                "overview": "Two astronomers go on a media tour to warn humankind of a planet-killing comet hurtling toward Earth. The response from a distracted world: Meh.",
                "popularity": 8.3244,
                "poster_path": "/th4E1yqsE8DGpAseLiUrI60Hf8V.jpg",
                "release_date": "2021-12-08",
                "title": "Don't Look Up",
                "video": false,
                "vote_average": 7.068,
                "vote_count": 8788,
                "character": "Dr. Calder",
                "credit_id": "61c58cceaaec710062825a9a",
                "order": 22
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Hetienne Park"
        ],
        "biography": "Hettienne Park is an American actress and writer, having played roles in Young Adult (2011), Bride Wars (2009), Blindspot (2018), and The Outsider (2020), with her most notable role being Beverly Katz on the psychological horror television series Hannibal (2013–14). Park was born in Boston and raised in Wayland, Massachusetts, and is of South Korean descent. She received her Bachelor of Arts in Religion and Economics from the University of Rochester in Rochester, New York. Park studied classical flute and piano at the New England Conservatory of Music in Boston and studied acting for 2 years at the William Esper Studio in Manhattan, New York City.\n\nPark's first role as an actress was in a junior high school production of Cats. Her screen debut was in the 2007 movie Year of the Fish. Park is known for supporting roles in such films as Don't Look Up, Bride Wars and Young Adult. She starred as Special Agent Beverly Katz, a crime-scene investigator specializing in fiber analysis, in the television series Hannibal, alongside Mads Mikkelsen who plays Hannibal Lecter, and Hugh Dancy. Park starred as Tamika Collins in Stephen King's The Outsider on HBO.\n\nPark was a recipient of the 68th Theatre World Award for Outstanding Broadway and Off-Broadway debuts for Theresa Rebeck's Seminar and The Intelligent Homosexual's Guide to Capitalism and Socialism with a Key to the Scriptures by Tony Kushner.",
        "birthday": "1983-03-07",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1218184,
        "imdb_id": "nm1782292",
        "known_for_department": "Acting",
        "name": "Hettienne Park",
        "place_of_birth": "Boston, Massachusetts, USA",
        "popularity": 0.2608,
        "profile_path": "/c5fZeiKZ6magmPWbLJkSjKm5oUX.jpg"
    }
}