{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/scQf03Fm3jeyv4FH04qvi4fp4wh.jpg",
                "genre_ids": [
                    80,
                    35,
                    28
                ],
                "id": 402900,
                "original_language": "en",
                "original_title": "Ocean's Eight",
                "overview": "Debbie Ocean, a criminal mastermind, gathers a crew of female thieves to pull off the heist of the century at New York's annual Met Gala.",
                "popularity": 8.6805,
                "poster_path": "/MvYpKlpFukTivnlBhizGbkAe3v.jpg",
                "release_date": "2018-06-07",
                "title": "Ocean's Eight",
                "video": false,
                "vote_average": 6.968,
                "vote_count": 8525,
                "character": "Maria Sharapova",
                "credit_id": "5886c3e692514119770017db",
                "order": 112
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "ماریا شاراپووا"
        ],
        "biography": "Maria Sharapova is a world-class tennis champion, author, entrepreneur and founder of candy line, Sugarpova. Her passion for craftsmanship and detail is reflected in everything she does—both on and off the tennis court. After moving to the United States from Russia at age 6 to pursue her tennis career, Sharapova turned professional at age 14. She won Wimbledon at age 17—the first of her five career Grand Slam titles—and has been ranked No. 1 in the world by the WTA on five separate occasions. Sharapova was also the seventh female player in the open era to complete the career Grand Slam and the first female athlete to serve as the Olympic flag bearer for the Russian delegation. She chronicles much of her tennis career in her 2017 New York Times bestseller, Unstoppable: My Life so Far. Outside of tennis, Sharapova is an active founder, CEO and business investor.  In 2012, she founded her premium candy line, Sugarpova, and has artfully designed and scaled all aspects of the company. Sharapova oversees the day-to-day decision-making and growth of the business—from creative branding and packaging to product R&D and retail expansion. She is also passionate about supporting the next generation of entrepreneurs—investing in several companies and participating in mentorship programs for women in business. Most recently, Sharapova mentored seven female business owners working across a wide range of industries through a program with the National Association of Women Business Owners (NAWBO). Sharapova has taken courses at Harvard Business School and is collaborating with architect Dan Meis on a new concept for boutique wellness centers. Sharapova brings a creative and hands-on approach to all of her projects, spanning tennis, business, design and more.",
        "birthday": "1987-04-19",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1218644,
        "imdb_id": "nm1682495",
        "known_for_department": "Acting",
        "name": "Maria Sharapova",
        "place_of_birth": "Nyagan, Russia",
        "popularity": 0.2036,
        "profile_path": "/iL1xRYy05e1hfdXLLFGkgCcD4vX.jpg"
    }
}