{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ncWUcY7ihZ2co7vqUCHqwF6t9us.jpg",
                "genre_ids": [
                    53,
                    18
                ],
                "id": 296098,
                "original_language": "en",
                "original_title": "Bridge of Spies",
                "overview": "During the Cold War, the Soviet Union captures U.S. pilot Francis Gary Powers after shooting down his U-2 spy plane. Sentenced to 10 years in prison, Powers' only hope is New York lawyer James Donovan, recruited by a CIA operative to negotiate his release. Donovan boards a plane to Berlin, hoping to win the young man's freedom through a prisoner exchange. If all goes well, the Russians would get Rudolf Abel, the convicted spy who Donovan defended in court.",
                "popularity": 5.9643,
                "poster_path": "/fmOOjHAQzxr0c1sfcY4qkiSRBH6.jpg",
                "release_date": "2015-10-15",
                "title": "Bridge of Spies",
                "video": false,
                "vote_average": 7.236,
                "vote_count": 7031,
                "character": "Partner at Watters Law Firm",
                "credit_id": "56bf5ab0925141398a000319",
                "order": 43
            },
            {
                "adult": false,
                "backdrop_path": "/h5jqLrIv1tlszezv2UEWq9KBuoj.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 446354,
                "original_language": "en",
                "original_title": "The Post",
                "overview": "A cover-up that spanned four U.S. Presidents pushed the country's first female newspaper publisher and a hard-driving editor to join an unprecedented battle between journalist and government. Inspired by true events.",
                "popularity": 5.2786,
                "poster_path": "/h4XG3g6uMMPIBPjAoQhC2QIMdkl.jpg",
                "release_date": "2017-12-22",
                "title": "The Post",
                "video": false,
                "vote_average": 7.004,
                "vote_count": 4753,
                "character": "Lazard Banker",
                "credit_id": "5a97359892514128aa0059cd",
                "order": 45
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "John Henry Cox was born December 18, 1951. He is an actor, known for  West New York (1996), My Own Love Song (2010), and House of Cards  (2014).\n\nHis parents, Lois and Henry Cox, were a teacher and a  Southern Baptist minister, descended from generations of Irish and  Danish farmers.\n\nWhile attending high school in Casa Grande, Arizona, Cox played football and acted in nearly every play the school put on.\n\nAt  University of Arizona in Tucson, he started in pre-med, majoring in  Biology, but he went to see Mourning Becomes Electra at the university  theater, and a week later he changed his major to Theater/Performance  Option. Classical training ensued.\n\nWhile at U of A, he was hired  by Leonard Katzman to play a Comanchero in an episode of \"Gunsmoke\"  being shot at Old Tucson. The SAG card from that made him eligible to  audition for Lee Phillips, who cast him as The Lieutenant in the film  for television of \"The Red Badge of Courage\" with Richard Thomas as The  Youth. That was followed by several guest star roles on the series  \"Petrocelli\" produced by Leonard Katzman.\n\nAfter two years in  California performing in plays at Company of Angels and doing roles in  episodics and miniseries, Cox moved to New York in the late 1970s. He  has done many theater productions, including Shakespeare plays on  Broadway and in Central Park, and continues to work in television and  film.",
        "birthday": "1951-12-18",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1218217,
        "imdb_id": "nm0185099",
        "known_for_department": "Acting",
        "name": "John Henry Cox",
        "place_of_birth": null,
        "popularity": 0.0948,
        "profile_path": "/vF72i1AFVMRWNS2kdgPquWGTT9.jpg"
    }
}