{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9T8sj5io4SGCBTHsk5H8LGcfKVe.jpg",
                "genre_ids": [
                    10749,
                    18
                ],
                "id": 419478,
                "original_language": "en",
                "original_title": "Midnight Sun",
                "overview": "Katie, a 17-year-old, has been sheltered since childhood and confined to her house during the day by a rare disease that makes even the smallest amount of sunlight deadly. Fate intervenes when she meets Charlie and they embark on a summer romance.",
                "popularity": 4.4215,
                "poster_path": "/vPG2zEKPXhovPW9S91SRnwr5JM1.jpg",
                "release_date": "2018-03-22",
                "title": "Midnight Sun",
                "video": false,
                "vote_average": 7.816,
                "vote_count": 3498,
                "character": "Dr. Paula Fleming",
                "credit_id": "5a97e4ff92514128a700eb0c",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Sue Mathew",
            "Sue Matthews",
            "Sue Matthew",
            "Suleka Mathews",
            "Sue Mathews"
        ],
        "biography": "Suleka \"Sue\" Mathew is a Canadian actress, known for her portrayal of Dr. Sunita Ramen on the Canadian television series Da Vinci's Inquest.\n\nShe was born in India and raised in Vancouver, Canada, since the age of two. Her most recent work was in Men in Trees playing the character Sara Jackson. She was playing a nurse named Bobbie Jackson in the TNT series Hawthorne,  which began in 2009. After three successful seasons the show will not  be returning for a fourth. She currently plays Dina Tomlin on the U.S.  TV series, Red Widow.\n\nTelevision audiences know Mathew for her role as Dr. Sunita \"Sunny\" Ramen on the acclaimed and award-winning Canadian dramatic series, \"Da Vinci's Inquest.\" She earned three Leo Award nominations for Best Actress for her role. An international hit, the series recently made its syndicated debut in the United States.\n\nMathew also had a recurring role, on the Emmy Award-winning \"The West Wing,\" as well as Stephen King's \"Dead Zone,\" and co-starred in Hallmark Entertainment's sci-fi miniseries \"Final Days of the Planet Earth.\" In addition she has appeared on such series as \"The X-Files,\" \"Stargate SG-1,\" \"The Crow,\" \"Highlander\" and \"MacGyver.\"\n\nHer feature film credits include a starring role in the Sundance Festival hit, \"Touch of Pink,\" directed by Ian Iqbal Rashid. Mathew appeared in the independent film \"The Score,\" which was screened at the 2005 Vancouver International Film Festival, and worked with esteemed director Deepa Mehta in her romantic comedy, \"Republic of Love.\"\n\nMathew currently lives in Vancouver.",
        "birthday": "1984-05-11",
        "deathday": null,
        "gender": 1,
        "homepage": "https://dbpedia.org/page/Suleka_Mathew",
        "id": 1219536,
        "imdb_id": "nm0558598",
        "known_for_department": "Acting",
        "name": "Suleka Mathew",
        "place_of_birth": "Kerala - India",
        "popularity": 0.6718,
        "profile_path": "/rLxXR4hqNRBQn86vjfZHSyJilJK.jpg"
    }
}