{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wDLgGI6Rswo30YkWoM6TGq0VWVy.jpg",
                "genre_ids": [
                    35,
                    18,
                    14,
                    10749
                ],
                "id": 13198,
                "original_language": "en",
                "original_title": "Wristcutters: A Love Story",
                "overview": "Zia, distraught over breaking up with his girlfriend, decides to end it all. Unfortunately, he discovers that there is no real ending, only a run-down afterlife that is strikingly similar to his old one, just a bit worse. Discovering that his ex-girlfriend has also \"offed\" herself, he sets out on a road trip to find her.",
                "popularity": 4.1179,
                "poster_path": "/qModiIR60IMLP28ruGZluQOtsOj.jpg",
                "release_date": "2007-10-19",
                "title": "Wristcutters: A Love Story",
                "video": false,
                "vote_average": 6.966,
                "vote_count": 580,
                "character": "Transvestite",
                "credit_id": "65cfbf30d96c3c0164817e27",
                "order": 54
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Nichcalo D. Crayton",
            "Jazzmun Nichcalo"
        ],
        "biography": "Originally from San Diego, California, Jazzmun made her first  national television appearance on the 1980s talent variety show Puttin' on the Hits  (1984), in which she split her body half in male drag and half in female  drag, lip-synching as a \"duet\". Finding work immediately after that  appearance for her theatrical and modeling talents, she moved to Los  Angeles and secured an agent. Since then Jazzmun has performed all over  the world as her stage character \"Jazzmun\", her  trademark \"Whitney Houston\", \"Grace Jones\", or any number of other characters. Drag  icon RuPaul hired Jazzmun to perform in his music video \"A Little Bit Of  Love\", which spoofed drag queens as aliens out to conquer the world. Jazzmun has proven to be a consummate performer and, when not appearing  on television or stage, can be seen in a variety of Los Angeles nightclubs promoting her talents in a variety of ways.",
        "birthday": "1969-02-10",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1219117,
        "imdb_id": "nm0419807",
        "known_for_department": "Acting",
        "name": "Jazzmun",
        "place_of_birth": "San Diego, California, USA",
        "popularity": 0.0749,
        "profile_path": "/wRAZ7DGJ4vy40tiKQxKtvHVc0Hd.jpg"
    }
}