{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/41ZWAGMttCr74dq7sAeh44QSJTQ.jpg",
                "genre_ids": [
                    28,
                    18,
                    36,
                    10752
                ],
                "id": 14433,
                "original_language": "en",
                "original_title": "Zulu",
                "overview": "In 1879, during the Anglo-Zulu War, man-of-the-people Lt. Chard and snooty Lt. Bromhead are in charge of defending the isolated and vastly outnumbered Natal outpost of Rorke's Drift from tribal hordes.",
                "popularity": 2.6628,
                "poster_path": "/9V7tl1kIb67ZPRRNlUdy3JvqEiA.jpg",
                "release_date": "1964-01-22",
                "title": "Zulu",
                "video": false,
                "vote_average": 7.389,
                "vote_count": 540,
                "character": "Private 593 Jones",
                "credit_id": "5831b1df92514162d2025986",
                "order": 24
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Dennis Wilfred Davies, known professionally as Richard Davies (25 January 1926 – 8 October 2015), was a Welsh actor.He was probably best known for his performance as the exasperated schoolmaster Mr. Price in the popular LWT situation comedy Please Sir! He used a broad Welsh accent for much of his work, but had used other accents to play a wide range of characters, in addition to several Welsh stereotypes\n\nDavies was born in Dowlais, near Merthyr Tydfil, Glamorgan, the son of a railway guard. He played Idris Hopkins in Coronation Street between 1974 and 1975, and appeared in several science-fiction series, among them Robert's Robots, Out of the Unknown, and a well-received performance as Burton in the 1987 Doctor Who story Delta and the Bannermen. He played Mr. White in the Fawlty Towers episode \"The Kipper and the Corpse\" and also appeared in Yes Minister, Wyatt's Watchdogs, May to December, Whoops Apocalypse, 2point4 Children and One Foot in the Grave. In 1970, he appeared in an episode of Two in Clover as Victor Spinetti's character's brother when Spinetti was unavailable. His other main role was in the comedy series Oh No It's Selwyn Froggitt where he played Clive.\n\nDavies had a recurring role as Jim Sloan in Z-Cars between 1962 and 1965, returning to the series playing different characters in 1968 and in its spin-off Softly, Softly. He also appeared in Dixon of Dock Green, The Sweeney and Van der Valk. He impersonated Clive Jenkins in a spoof edition of Question Time in a sketch on Not the Nine O'Clock News. He appeared in the Please Sir! spin-off series The Fenn Street Gang. In 1951, he made an uncredited appearance in the Ealing Studios comedy The Lavender Hill Mob. He had appeared in films such as Zulu (1964), the film adaptation of Please Sir! (1971), and Under Milk Wood (1972). In 1988, he played the schoolteacher in Queen Sacrifice. He died on 8 October 2015 at the age of 89, survived by his wife and two children, and a son from his first marriage after a battle against Alzheimer's disease.",
        "birthday": "1926-01-25",
        "deathday": "2015-10-08",
        "gender": 2,
        "homepage": null,
        "id": 1219994,
        "imdb_id": "nm0203928",
        "known_for_department": "Acting",
        "name": "Richard Davies",
        "place_of_birth": "Dowlais, Wales, UK",
        "popularity": 0.1614,
        "profile_path": "/lBfq02hYIZCyyzcZEZpLrN49dfz.jpg"
    }
}