{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/80uHK2xWwjlOxmfJ1wQB09omAht.jpg",
                "genre_ids": [
                    10749,
                    35,
                    80,
                    14
                ],
                "id": 854,
                "original_language": "en",
                "original_title": "The Mask",
                "overview": "When timid bank clerk Stanley Ipkiss discovers a magical mask containing the spirit of the Norse god Loki, his entire life changes. While wearing the mask, Ipkiss becomes a supernatural playboy exuding charm and confidence which allows him to catch the eye of local nightclub singer Tina Carlyle. Unfortunately, under the mask's influence, Ipkiss also robs a bank, which angers junior crime lord Dorian Tyrell, whose goons get blamed for the heist.",
                "popularity": 10.4293,
                "poster_path": "/yd3wjLLeQHJ3oRDy4wwiNNFVyLW.jpg",
                "release_date": "1994-07-29",
                "title": "The Mask",
                "video": false,
                "vote_average": 6.969,
                "vote_count": 10735,
                "character": "Doyle",
                "credit_id": "55ee88a69251413e32018207",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nJames \"Jim\" Francis Doughan (born August 2, 1959) is an American character actor, teacher and writer. He is best known for his roles as Detective Doyle in The Mask (1994) and Detective Allen as well as the voice of Lucky the Cat in Stuart Little (1999) and the head coach for the soccer team Stuart and his human brother, George Little, play for in Stuart Little 2 (2002). To date he has 52 credits in film and television to his name. He is currently a performing arts teacher at Harvard-Westlake School in Los Angeles, California.\n\nDescription above from the Wikipedia article Jim Doughan, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1959-08-02",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1219157,
        "imdb_id": "nm0234810",
        "known_for_department": "Acting",
        "name": "Jim Doughan",
        "place_of_birth": "Manhattan, New York, USA",
        "popularity": 0.5499,
        "profile_path": "/oPn0LX43yvJ5qGuNpQRQryHX7lu.jpg"
    }
}