{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sGEqHTylawwS6hwKultk1mKUjdB.jpg",
                "genre_ids": [
                    10749,
                    35
                ],
                "id": 114,
                "original_language": "en",
                "original_title": "Pretty Woman",
                "overview": "While on a business trip in Los Angeles, Edward Lewis, a millionaire entrepreneur who makes a living buying and breaking up companies, picks up a prostitute, Vivian, while asking for directions; after, Edward hires Vivian to stay with him for the weekend to accompany him to a few social events, and the two get closer only to discover there are significant hurdles to overcome as they try to bridge the gap between their very different worlds.",
                "popularity": 8.828,
                "poster_path": "/hVHUfT801LQATGd26VPzhorIYza.jpg",
                "release_date": "1990-03-23",
                "title": "Pretty Woman",
                "video": false,
                "vote_average": 7.46,
                "vote_count": 8618,
                "character": "Elizabeth Stuckey",
                "credit_id": "52fe4219c3a36847f800408d",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/80uHK2xWwjlOxmfJ1wQB09omAht.jpg",
                "genre_ids": [
                    10749,
                    35,
                    80,
                    14
                ],
                "id": 854,
                "original_language": "en",
                "original_title": "The Mask",
                "overview": "When timid bank clerk Stanley Ipkiss discovers a magical mask containing the spirit of the Norse god Loki, his entire life changes. While wearing the mask, Ipkiss becomes a supernatural playboy exuding charm and confidence which allows him to catch the eye of local nightclub singer Tina Carlyle. Unfortunately, under the mask's influence, Ipkiss also robs a bank, which angers junior crime lord Dorian Tyrell, whose goons get blamed for the heist.",
                "popularity": 11.3523,
                "poster_path": "/yd3wjLLeQHJ3oRDy4wwiNNFVyLW.jpg",
                "release_date": "1994-07-29",
                "title": "The Mask",
                "video": false,
                "vote_average": 6.969,
                "vote_count": 10734,
                "character": "Peggy Brandt",
                "credit_id": "52fe4282c3a36847f80247dd",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Amy Marie Yasbeck",
            "エイミー・ヤスベック",
            "امی یاسبک"
        ],
        "biography": "Amy Marie Yasbeck (born September 12, 1962) is an American actress. She is best known for her role as Casey Chappel Davenport on the sitcom Wings from 1994 to 1997, and for having played the mermaid Madison in the television film Splash Too, in 1988 (the role originated by Daryl Hannah in the film Splash).\n\nYasbeck was born in Blue Ash, Ohio, and graduated from The Summit Country Day School in Cincinnati. She then attended the University of Detroit Mercy, where she studied theater. After graduating, she moved to Los Angeles to pursue an acting career.\n\nYasbeck's early acting credits include guest roles on such television shows as Dallas, Spies, Werewolf, J.J. Starbuck, Magnum, P.I., China Beach, and Murphy Brown. She also played Olivia Reed for four months between 1986 and 1987 on the long-running daytime soap opera Days of Our Lives.\n\nIn 1988, Yasbeck starred in the Disney television film Splash, Too. She then went on to appear in a number of films, including House II: The Second Story (1989), Pretty Woman (1990), Problem Child (1990), Problem Child 2 (1991), The Mask (1994), Robin Hood: Men in Tights (1993), and Dracula: Dead and Loving It (1995).\n\nFrom 1994 to 1997, Yasbeck starred as Casey Chappel Davenport on the sitcom Wings. She was nominated for a Golden Globe Award for Best Actress – Television Series Musical or Comedy for her performance.\n\nIn 1999, Yasbeck married actor John Ritter. They had one son together, Noah, who was born in 1998. Ritter died suddenly of an aortic dissection in 2003.\n\nSince Ritter's death, Yasbeck has continued to work in film and television shows as Two and a Half Men, The Middle, and Modern Family.\n\nYasbeck is also a writer and producer. She wrote the book With Love and Laughter, John Ritter, which was published in 2005. She also produced the documentary John Ritter: A Celebration of His Life, which aired on the Hallmark Channel in 2004.\n\nYasbeck is a strong advocate for heart health awareness. She is a member of the board of directors of the John Ritter Foundation, which was founded in 2003 to raise money for heart research.",
        "birthday": "1962-09-12",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1219,
        "imdb_id": "nm0001865",
        "known_for_department": "Acting",
        "name": "Amy Yasbeck",
        "place_of_birth": "Cincinnati, Ohio, USA",
        "popularity": 0.6142,
        "profile_path": "/5BbyiBjp5T8pKUcauVTweRcvLJJ.jpg"
    }
}