{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2WuR3EaBj8X2WR4fvqa449tnNLn.jpg",
                "genre_ids": [
                    16,
                    18,
                    10749,
                    53,
                    878
                ],
                "id": 823,
                "original_language": "ja",
                "original_title": "人狼 JIN-ROH",
                "overview": "A member of an elite paramilitary counter-terrorism unit becomes traumatized after witnessing the suicide bombing of a young girl and is forced to undergo retraining. However, unbeknownst to him, he becomes a key player in a dispute between rival police divisions, as he finds himself increasingly involved with the sister of the girl he saw die.",
                "popularity": 3.2428,
                "poster_path": "/iyLKFR339GCzTKUtrVO4hbeEhub.jpg",
                "release_date": "1999-11-17",
                "title": "Jin-Roh: The Wolf Brigade",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 516,
                "character": "Kazuki Fuse (voice)",
                "credit_id": "52fe427cc3a36847f80225df",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Yoshikatsu Fujiki is a Japanese actor and voice actor born on January 20, 1964, in Toyama, Japan. Standing at 190 cm, he is recognized for his roles in Mamoru Oshii’s Kerberos Saga, most notably as the voice of Kazuki Fuse in the 1999 anime film Jin-Roh: The Wolf Brigade, where he portrayed a conflicted paramilitary officer in a dystopian postwar Japan. Fujiki also appeared as Inui in StrayDog: Kerberos Panzer Cops (1991) and Chuichi Koshiramaru in Tachiguishi-Retsuden (2006), both within the same saga. His other credits include Assault Girls (2009), Kamen Rider Black RX (1988), The Next Generation Patlabor: Tokyo War, and Black Angel. Fujiki’s performances are marked by his ability to bring depth to action and dystopian roles across anime and live-action formats.",
        "birthday": "1964-01-20",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 12190,
        "imdb_id": "nm0297740",
        "known_for_department": "Acting",
        "name": "Yoshikatsu Fujiki",
        "place_of_birth": "Toyama, Japan",
        "popularity": 1.167,
        "profile_path": "/iRPQnuXhAaMiRgQg72Jmh2FodAA.jpg"
    }
}