{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zzzoRNVSaUv6e1hpADjUDeM3EvY.jpg",
                "genre_ids": [
                    878,
                    28,
                    12
                ],
                "id": 13475,
                "original_language": "en",
                "original_title": "Star Trek",
                "overview": "The fate of the galaxy rests in the hands of bitter rivals. One, James Kirk, is a delinquent, thrill-seeking Iowa farm boy. The other, Spock, a Vulcan, was raised in a logic-based society that rejects all emotion. As fiery instinct clashes with calm reason, their unlikely but powerful partnership is the only thing capable of leading their crew through unimaginable danger, boldly going where no one has gone before. The human adventure has begun again.",
                "popularity": 9.3534,
                "poster_path": "/lV5OpzAss1z06YNagOVap1I35mH.jpg",
                "release_date": "2009-05-06",
                "title": "Star Trek",
                "video": false,
                "vote_average": 7.425,
                "vote_count": 10142,
                "character": "Shuttle Pilot (uncredited)",
                "credit_id": "52fe456e9251416c750563fb",
                "order": 87
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Born in Tennessee and raised in Alabama, Ronnie Steadman began his acting career after college, where he began as a math major but realized that he wanted a different path. He didn't figure that path out until after graduating when he got the rare (at that time) opportunity to work on a Hollywood film shooting in Alabama. He was hired as a driver for the late, great Walter Matthau, whose winning personality, along with his illustrious career, inspired Ronnie to give it a go. After that, he quickly exhausted the resources available in Chattanooga, TN where he resided at the time. After moving back to Alabama for year to live with his mother after his father's death, he moved to Los Angeles. It was there he got his basic training at the Joanne Baron/DW Brown studio, a two year Meisner program. He excelled there and began to do theater shortly after, where he most notable played John Merrick aka \"The Elephant Man\" to rave reviews. Along the way, he has starred in many other theater productions as well as numerous television shows and movies.\n\nHe was married to the actress, Lori Rom, in 2003 with whom has two children, Mackenzie and Elliot",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 121905,
        "imdb_id": "nm0824124",
        "known_for_department": "Acting",
        "name": "Ronnie Steadman",
        "place_of_birth": null,
        "popularity": 0.0331,
        "profile_path": "/uS8MkzPV6ExxJGEnbO0et85Vy7R.jpg"
    }
}