{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/AoSZyb37ljMAxw0RdeQEBHKtgcc.jpg",
                "genre_ids": [
                    10751,
                    16,
                    12,
                    35,
                    14
                ],
                "id": 330457,
                "original_language": "en",
                "original_title": "Frozen II",
                "overview": "Elsa, Anna, Kristoff and Olaf head far into the forest to learn the truth about an ancient mystery of their kingdom.",
                "popularity": 10.443,
                "poster_path": "/mINJaa34MtknCYl5AjtNJzWj8cD.jpg",
                "release_date": "2019-11-20",
                "title": "Frozen II",
                "video": false,
                "vote_average": 7.244,
                "vote_count": 10023,
                "character": "Additional Voices (voice)",
                "credit_id": "5e7a44412f3b17001455855a",
                "order": 45
            },
            {
                "adult": false,
                "backdrop_path": "/620hnMVLu6RSZW6a5rwO8gqpt0t.jpg",
                "genre_ids": [
                    16,
                    35,
                    14,
                    12,
                    10751
                ],
                "id": 508943,
                "original_language": "en",
                "original_title": "Luca",
                "overview": "Luca and his best friend Alberto experience an unforgettable summer on the Italian Riviera. But all the fun is threatened by a deeply-held secret: they are sea monsters from another world just below the water’s surface.",
                "popularity": 9.2167,
                "poster_path": "/9x4i9uKGXt8IiiIF5Ey0DIoY738.jpg",
                "release_date": "2021-06-17",
                "title": "Luca",
                "video": false,
                "vote_average": 7.795,
                "vote_count": 8667,
                "character": "Pinuccia Aragosta (voice)",
                "credit_id": "60cd925f2d37210071354f8c",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Mimi Saffian Maynard",
            "Mimi Maynard",
            "咪咪·梅纳德"
        ],
        "biography": "Mimi Maynard has spent the last 15 years as a Producer, Casting and Voice Director of Animated Features. Her credits include Fly Me To The Moon, the first stereoscopic 3D animated feature, Sammy's Adventures: A Turtle's Tale grossing over 100 million dollars and nominated for Best Animated Feature -European Film Awards, won for Best Feature Film Cartoon Movies 2010 and Trophee du Film European, A Turtle's Tale Escape From Paradise (sequel to Sammy's Adventure), Turtle Vision 3D Animated Ride Attraction, Sammy and Ray 3D Animated Ride Attraction, Fly Me To The Moon 3D Animated Ride Attraction, Thunder and The House of Magic, The Wild Life aka Robinson Crusoe and The Legend of Big Foot all in 3D Stereoscopic Animation. Mimi and her Partner, Paulette Lifton, are currently adapting, casting and voice directing for various independent animation companies all over the world. Ms Maynard and Ms Lifton are developing an animated series with Nancy Cartwright and Spotted Cow Entertainment.\n\nMs. Maynard along with Ms. Lifton have Cast and Directed numerous projects for both animation and live action including dubbing for many International Companies over the last 15 years.\n\nPrior to her animation credits, Mimi worked on many TV and Film projects as an Actress as well Sound Design and ADR and Voice Over. Her dubbing experience includes, scheduling, casting, celebrity casting, voice directing, and hiring the talent for translating, transcribing, writing, music lyricist singers, conductor, and music lyric replacement.\n\nOn the production side, she was co-owner of various production companies recruiting talent and developing projects for Management, Television and Motion Pictures. She produced and oversaw development of the Japanese television series Gundam into an American made-for-television movie.",
        "birthday": "1949-01-05",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1219797,
        "imdb_id": "nm0562775",
        "known_for_department": "Acting",
        "name": "Mimi Maynard",
        "place_of_birth": null,
        "popularity": 0.1189,
        "profile_path": "/qcxzpi9ly4AsmtjqYmobDkAifbR.jpg"
    }
}