{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ekppa3eJm51s389jBX6dgt7CjYc.jpg",
                "genre_ids": [
                    16,
                    878,
                    28,
                    12,
                    10751
                ],
                "id": 1857,
                "original_language": "en",
                "original_title": "The Transformers: The Movie",
                "overview": "The Autobots must stop a colossal planet-consuming robot who goes after the Autobot Matrix of Leadership. At the same time, they must defend themselves against an all-out attack from the Decepticons.",
                "popularity": 2.5128,
                "poster_path": "/j4HTorvJdGOuIgGyE56fMCLmcCg.jpg",
                "release_date": "1986-08-08",
                "title": "The Transformers: The Movie",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 558,
                "character": "Cyclonus / Quintesson Leader (voice)",
                "credit_id": "5986ed17c3a368371900a98f",
                "order": 23
            },
            {
                "adult": false,
                "backdrop_path": "/fONtQBk12LGjQo4q6bXDROVQmTy.jpg",
                "genre_ids": [
                    53,
                    12
                ],
                "id": 213,
                "original_language": "en",
                "original_title": "North by Northwest",
                "overview": "Advertising man Roger Thornhill is mistaken for a spy, triggering a deadly cross-country chase.",
                "popularity": 3.6101,
                "poster_path": "/kNOFPQrel9YFCVzI0DF8FnCEpCw.jpg",
                "release_date": "1959-08-06",
                "title": "North by Northwest",
                "video": false,
                "vote_average": 7.982,
                "vote_count": 4292,
                "character": "Tall Man in Crowd (uncredited)",
                "credit_id": "67c617dba3277ab4a1e791d4",
                "order": 92
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "​From Wikipedia, the free encyclopedia.  \n\nRoger Charles Carmel (September 27, 1932, Brooklyn, New York – November 11, 1986, Hollywood, California) was an American actor.\n\nOf his hundreds of roles, he is best remembered for playing the flamboyant and hapless criminal Harry Mudd on the original Star Trek. Other memorable roles include the accountant Doug Wesley on The Dick Van Dyke Show and Colonel Gumm on Batman. He also appeared in roles on Patty Duke Show, I Spy, Hogan's Heroes, Banacek. The Man from U.N.C.L.E., The Munsters, Hawaii Five-O, and many other shows. He also appeared in such movie classics as Alfred Hitchcock\"s North by Northwest. Carmel was also the voice of Smokey Bear in fire safety advertisements, as well as Decepticon Lieutenant Cyclonus, amongst others in the second and third seasons of the popular Transformers animated series. In the TV commercials for the Naugles chain of Mexican fast-food restaurants, he played the character of Señor Naugles. He also appeared in Jerry Lewis's comeback 1981 film, Hardly Working.\n\nCarmel starred as Roger Buell in the 1967 NBC sitcom The Mothers-in-Law, but was replaced by Richard Deacon. Officially, Carmel had a salary dispute with producer Desi Arnaz, although, according to rumors, he was fired because his drug use interfered with production.\n\nCarmel was slated to reprise his role as Harry Mudd in the Star Trek: The Next Generation first season finale episode, The Neutral Zone, but died before filming could commence. He died in Hollywood, California, of congestive heart failure due to an enlarged heart muscle. Carmel is interred in New Mount Carmel Cemetery in Glendale, Queens, New York.\n\nDescription above from the Wikipedia article Roger C. Carmel, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1932-09-27",
        "deathday": "1986-11-11",
        "gender": 2,
        "homepage": null,
        "id": 122004,
        "imdb_id": "nm0138354",
        "known_for_department": "Acting",
        "name": "Roger C. Carmel",
        "place_of_birth": "Brooklyn, New York City, New York, USA",
        "popularity": 0.2321,
        "profile_path": "/6JZgOpDoYmjAomrfmvF5bfNoJbk.jpg"
    }
}