{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bk2fTuIhQIvdAA3RbnrnvLvuaTc.jpg",
                "genre_ids": [
                    10402,
                    35,
                    28,
                    80
                ],
                "id": 525,
                "original_language": "en",
                "original_title": "The Blues Brothers",
                "overview": "Jake Blues, just released from prison, puts his old band back together to save the Catholic home where he and his brother Elwood were raised.",
                "popularity": 6.6755,
                "poster_path": "/rhYJKOt6UrQq7JQgLyQcSWW5R86.jpg",
                "release_date": "1980-06-16",
                "title": "The Blues Brothers",
                "video": false,
                "vote_average": 7.727,
                "vote_count": 4373,
                "character": "Choir Soloist",
                "credit_id": "52fe424dc3a36847f8013b5d",
                "order": 23
            },
            {
                "adult": false,
                "backdrop_path": "/fFdOJxmG2U7IYYlkFKtDk1nGPhF.jpg",
                "genre_ids": [
                    10751,
                    35,
                    18
                ],
                "id": 508570,
                "original_language": "en",
                "original_title": "The One and Only Ivan",
                "overview": "A gorilla named Ivan who’s living in a suburban shopping mall tries to piece together his past, with the help of other animals, as they hatch a plan to escape from captivity.",
                "popularity": 3.1391,
                "poster_path": "/wDOyGAiTaXvjKGmnmXsoFO7zItt.jpg",
                "release_date": "2020-08-21",
                "title": "The One and Only Ivan",
                "video": false,
                "vote_average": 7.358,
                "vote_count": 608,
                "character": "Henrietta (voice)",
                "credit_id": "5f0ef9710f36550037e3694d",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Yvette Marie Stevens"
        ],
        "biography": "Yvette Marie Stevens (born March 23, 1953), better known by her stage name Chaka Khan (/ˈʃɑːkə ˈkɑːn/ SHAH-kə KAHN), is an American singer and songwriter. Known as the \"Queen of Funk\", her career has spanned more than five decades beginning in the early 1970s as the lead vocalist of the funk band Rufus. With the band she recorded the notable hits \"Tell Me Something Good,\" \"Sweet Thing,\" \"Do You Love What You Feel,\" and the platinum-certified \"Ain't Nobody.\" Her debut solo album featured the number-one R&B hit \"I'm Every Woman\" (which became a pop hit for Whitney Houston). Khan scored another R&B charts hit with \"What Cha' Gonna Do for Me\" before becoming the first R&B artist to have a crossover hit featuring a rapper, with her 1984 cover of Prince's \"I Feel for You.\" More of Khan's hits include \"Through the Fire\" and a 1986 collaboration with Steve Winwood that produced a number-one hit on the Billboard Hot 100, \"Higher Love.\"\n\nKhan has won ten Grammy Awards.With Rufus, she achieved three gold singles, one platinum single, four gold albums, and two platinum albums. In the course of her solo career, Khan achieved three gold singles, three gold albums, and one platinum album with I Feel for You. She has also worked with Whitney Houston, Ry Cooder, Robert Palmer, Ray Charles, Quincy Jones, Miles Davis, Chick Corea, Guru, Chicago, Joni Mitchell, Gladys Knight, De La Soul, Mary J. Blige, Ariana Grande, and Sia. In December 2016, Billboard magazine ranked her as the 65th most successful dance club artist of all time. She was ranked at No. 17 in VH1's original list of the 100 Greatest Women of Rock & Roll. Khan has been nominated for induction into the Rock and Roll Hall of Fame three times as a solo artist and four times as a member of Rufus featuring Chaka Khan, the first time in 2012 as a member of Rufus. In 2023, Khan was picked as an inductee in the Musical Excellence category.\n\nDescription above from the Wikipedia article Chaka Khan, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1953-03-23",
        "deathday": null,
        "gender": 1,
        "homepage": "https://chakakhan.com/",
        "id": 122099,
        "imdb_id": "nm0451193",
        "known_for_department": "Acting",
        "name": "Chaka Khan",
        "place_of_birth": "Chicago, Illinois, USA",
        "popularity": 0.2156,
        "profile_path": "/qTrSlB1oOtEFI8VsivF1JuZgcRT.jpg"
    }
}