{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jBP00fK8DfAhmmc2d6y1nUkhdjY.jpg",
                "genre_ids": [
                    35,
                    14
                ],
                "id": 27670,
                "original_language": "it",
                "original_title": "Non ci resta che piangere",
                "overview": "Two 20th-century friends accidentally stumble into the year 1492, where they meet a charming teen and try to alter history.",
                "popularity": 1.1938,
                "poster_path": "/cnhfXiqrJppDvo6nc5QgOAtRp2z.jpg",
                "release_date": "1984-12-20",
                "title": "Nothing Left to Do But Cry",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 1155,
                "character": "Vitellozzo",
                "credit_id": "59d766fd925141252c00c006",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Carl Money"
        ],
        "biography": "Ha esordito con spettacoli nei locali e nelle feste paesane della sua zona. In tali occasioni ha avuto la possibilità di incontrare Roberto Benigni, col quale ha stretto un lungo sodalizio artistico ed umano.  Nel 1976 Monni e Benigni fanno \"il grande salto\" di notorietà approdando sulla seconda rete: i due comici fingono di disturbare le frequenze della RAI con una fantasiosa tv, Onda Libera, che trasmette da \"una stalla di Capalle\" (e la scenografia contempla anche alcune mucche). Nel 1978 è nel programma di Roberto Benigni, Vita da Cioni. Da questo anno in poi è chiamato a recitare in diversi film di stampo toscano che gli daranno la notorietà. Continua a presenziare a spettacoli pubblici (ormai oltre 100) e nel 1998 contribuisce al successo dello spettacolo di Massimo Ceccherini Fermi tutti questo è uno spettacolo le cui repliche continuano ancora oggi.  Nonostante questo successo, come da lui espresso durante una poesia nello spettacolo di Ceccherini, Carlo Monni ama dedicarsi al verseggiare libero, nella tradizione della sua terra natia, che preferisce alla popolarità della TV.",
        "birthday": "1943-10-23",
        "deathday": "2013-05-19",
        "gender": 2,
        "homepage": null,
        "id": 122023,
        "imdb_id": "nm0598350",
        "known_for_department": "Acting",
        "name": "Carlo Monni",
        "place_of_birth": "Campi Bisenzio, Tuscany, Italy",
        "popularity": 0.1144,
        "profile_path": "/6C0tacc6pgcUicO4Blqfua6oL8a.jpg"
    }
}