{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7mmXWuBeNJiBO0NIOUWOuFve4Tb.jpg",
                "genre_ids": [
                    10402,
                    18
                ],
                "id": 424694,
                "original_language": "en",
                "original_title": "Bohemian Rhapsody",
                "overview": "Singer Freddie Mercury, guitarist Brian May, drummer Roger Taylor and bass guitarist John Deacon take the music world by storm when they form the rock 'n' roll band Queen in 1970. Hit songs become instant classics. When Mercury's increasingly wild lifestyle starts to spiral out of control, Queen soon faces its greatest challenge yet – finding a way to keep the band together amid the success and excess.",
                "popularity": 7.4737,
                "poster_path": "/lHu1wtNaczFPGFDTrjCSzeLPTKN.jpg",
                "release_date": "2018-10-24",
                "title": "Bohemian Rhapsody",
                "video": false,
                "vote_average": 7.968,
                "vote_count": 17296,
                "character": "Brian May",
                "credit_id": "599b3986c3a3681d4b003825",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Gwilym Lee (born 24 November 1983) is a Welsh actor. He is best known for his film roles in Bohemian Rhapsody (2018) and Top End Wedding (2019). He is also known for his TV roles in Midsomer Murders (2013-2015), Jamestown (2017), and The Great (2020).\n\nHis first starring role was in the 1997-1998 television adaptation of the Animal Ark books. Aged 16, he started working on Richard III with the Royal Shakespeare Company. He appeared in a leading role in the final series of Land Girls (2011) and had several guest roles on television (including Ashes to Ashes (2009), Henry V (2012), Fresh Meat (2012), and Monroe (2012)).\n\nHe was commended in the 2008 Ian Charleson Awards for his appearance in the National Theatre's production of Oedipus and in 2009 played Laertes in the Donmar West End season. He won the first prize of the 2011 Ian Charleson Award for his role as Edgar in the 2010 King Lear production at the Donmar Warehouse. In 2012, he starred in Aleksei Arbuzov's The Promise, and, in 2013, he began a television starring role as DCI Barnaby's new sergeant, DS Charlie Nelson, in the 16th series of Midsomer Murders.\n\nHe played guitarist Brian May in the Queen biopic Bohemian Rhapsody (2018), for which earned him a nomination for Outstanding Performance by a Cast in a Motion Picture at the 25th Screen Actors Guild Awards.\n\nDescription above is from the Wikipedia article Gwilym Lee, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1983-11-24",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1220123,
        "imdb_id": "nm3152605",
        "known_for_department": "Acting",
        "name": "Gwilym Lee",
        "place_of_birth": "Bristol, England, UK",
        "popularity": 0.5183,
        "profile_path": "/bHSmjJLJyrg5Q0tC0W2FFreuOnO.jpg"
    }
}