{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sBB39VMtByFltGGGW2c5N6LOAvj.jpg",
                "genre_ids": [
                    18,
                    53,
                    80
                ],
                "id": 8470,
                "original_language": "en",
                "original_title": "John Q",
                "overview": "John Quincy Archibald is a father and husband whose son is diagnosed with an enlarged heart and then finds out he cannot receive a transplant because HMO insurance will not cover it. Therefore, he decides to take a hospital full of patients hostage until the hospital puts his son's name on the donor's list.",
                "popularity": 4.3211,
                "poster_path": "/xEE91LvXiqgs7Hmdl44LCzHtFf6.jpg",
                "release_date": "2002-02-15",
                "title": "John Q",
                "video": false,
                "vote_average": 7.136,
                "vote_count": 2486,
                "character": "Wife of Heart Transplant Patient",
                "credit_id": "533bb72bc3a36844ed000d4a",
                "order": 33
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Шира Дениз"
        ],
        "biography": "Shera Danese (born October 9, 1949, height 5' 7\" (1,70 m)) is an American actress and the widow of actor Peter Falk.\n\nBiography\n\nDanese was born in Hartsdale, New York. Her acting career began in 1976 with a part in one episode of One Day at a Time. Her other television credits include roles on Serpico, Baretta, Three's Company, Kojak, Family, Hart to Hart, Starsky and Hutch and Charlie's Angels. In one of her few roles on the big screen, she played a prostitute named Vicky in Risky Business, the 1983 film starring Tom Cruise and Rebecca De Mornay.\n\nDanese had a major role in three of the six Columbo episodes in which she appeared. She was never the killer, but she helped plan the murder in the episode: A Trace of Murder - 25th Anniversary Movie. She has the distinction of having acted in more episodes of Columbo than any other actress (but not actor). She met star Peter Falk on the show, and became his second wife on December 7, 1977. They were married for nearly 34 years until June 23, 2011, when Falk died at the age of 83.",
        "birthday": "1949-10-09",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1220746,
        "imdb_id": "nm0199418",
        "known_for_department": "Acting",
        "name": "Shera Danese",
        "place_of_birth": "Hartsdale - New York - USA",
        "popularity": 1.0841,
        "profile_path": "/dUWMUzQl8ALNKTixMPtfkxd6IA.jpg"
    }
}