{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1yFmxvVYgVrFKL2ksFzgX0MrWOM.jpg",
                "genre_ids": [
                    99,
                    80
                ],
                "id": 44639,
                "original_language": "en",
                "original_title": "Inside Job",
                "overview": "A film that exposes the shocking truth behind the economic crisis of 2008. The global financial meltdown, at a cost of over $20 trillion, resulted in millions of people losing their homes and jobs. Through extensive research and interviews with major financial insiders, politicians and journalists, Inside Job traces the rise of a rogue industry and unveils the corrosive relationships which have corrupted politics, regulation and academia.",
                "popularity": 2.1123,
                "poster_path": "/7yXXIWec24htucjsZS1sDuPLqw8.jpg",
                "release_date": "2010-10-08",
                "title": "Inside Job",
                "video": false,
                "vote_average": 7.695,
                "vote_count": 986,
                "character": "Self - Finance Minister, France",
                "credit_id": "57cf3c5b92514134a000334b",
                "order": 3
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/xVEBLD278GuFZoPFskpD3dvdJlV.jpg",
                "genre_ids": [
                    10751,
                    35,
                    16
                ],
                "id": 20352,
                "original_language": "en",
                "original_title": "Despicable Me",
                "overview": "Villainous Gru lives up to his reputation as a despicable, deplorable and downright unlikable guy when he hatches a plan to steal the moon from the sky. But he has a tough time staying on task after three orphans land in his care.",
                "popularity": 12.614,
                "poster_path": "/9lOloREsAhBu0pEtU0BgeR1rHyo.jpg",
                "release_date": "2010-07-08",
                "title": "Despicable Me",
                "video": false,
                "vote_average": 7.252,
                "vote_count": 15587,
                "credit_id": "5aae97420e0a2678210277d7",
                "department": "Crew",
                "job": "Thanks"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Christine Madeleine Odette Lagarde (born 1 January 1956) is a French politician and lawyer who has served as President of the European Central Bank since 2019. She previously served as the 11th Managing Director of the International Monetary Fund (IMF) from 2011 to 2019. Lagarde had also served in the Government of France, most prominently as Minister of the Economy, Finance and Industry from 2007 until 2011. She is the first woman to hold each of those posts.\n\nBorn and raised in Paris, Lagarde graduated from law school at Paris Nanterre University and obtained a Master's degree from Sciences Po Aix. After being admitted to the Paris Bar, she joined the international law firm Baker & McKenzie as an associate in 1981, specializing in labor and anti-trust, as well as mergers and acquisitions. Rising through the ranks, she was a member of the executive committee of the firm from 1995 until 1999, before being elevated to its Chair between 1999 and 2004; she was the first woman in both positions. She held the top post until she decided to go into public service.\n\nLagarde returned to France when appointed Minister of Foreign Trade from 2005 to 2007, then briefly served as Minister of Agriculture and Fisheries from May to June 2007, and finally, as Minister of Finance from 2007 to 2011, making her the first female to hold the finance portfolio of any Group of Eight economy. During her tenure, Lagarde oversaw the government response to the late 2000s financial crisis, for which the Financial Times ranked her the best finance minister in the Eurozone.\n\nOn 5 July 2011, she was elected to replace Dominique Strauss-Kahn as managing director of the IMF for a five-year term. Her appointment was the 11th consecutive appointment of a European to head the IMF. She was selected by consensus for a second five-year term, starting 5 July 2016, being the only candidate nominated for the post. In December 2016, a French court convicted her of negligence relating to her role in the Bernard Tapie arbitration, but did not impose a penalty. Lagarde resigned from the IMF following her nomination as president of the ECB.\n\nIn 2019 and again in 2020, Forbes ranked her number two on its World's 100 Most Powerful Women list.\n\nChristine Lagarde was born in Paris, France, into a family of teachers. Her father, Robert Lallouette, \"was born to a Jewish mother and a non-religious father.\", was an English teacher; her mother, Nicole (Carré), was a Latin, Greek and French literature teacher. Lagarde and her three younger brothers spent their childhood in Le Havre. There she attended the Lycée François 1er (where her father taught) and Lycée Claude Monet. ...\n\nSource: Article \"Christine Lagarde\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1956-01-01",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1220627,
        "imdb_id": "nm1756660",
        "known_for_department": "Acting",
        "name": "Christine Lagarde",
        "place_of_birth": "Paris, France",
        "popularity": 0.0563,
        "profile_path": "/9ou1fse0iUSNxhtkNohGypMycdG.jpg"
    }
}