{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/s5PP0ryxAo12jzvPntSEybahpCw.jpg",
                "genre_ids": [
                    18,
                    80,
                    53
                ],
                "id": 9516,
                "original_language": "en",
                "original_title": "Menace II Society",
                "overview": "A young street hustler attempts to escape the rigors and temptations of the ghetto in a quest for a better life.",
                "popularity": 6.1828,
                "poster_path": "/nS7yqmSVeNoH22VXj69JoFCxW1h.jpg",
                "release_date": "1993-05-26",
                "title": "Menace II Society",
                "video": false,
                "vote_average": 7.502,
                "vote_count": 815,
                "character": "Basehead",
                "credit_id": "5a628179c3a3687f7d000f24",
                "order": 28
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "  Dwayne Barnes "
        ],
        "biography": "Dwayne Barnes was born and reared in Detroit, Michigan where he witnessed some of life's harsh realities, which has consequently affected and transformed him as an artist and human being. In his senior year in high school, Barnes, voted \"Most Likely to Succeed,\" won a citywide acting competition and was awarded a scholarship to attend Eastern Michigan University. However, after a few years of collegiate life, Barnes heard the call of his destiny and chose to immediately set his sights on moving to Los Angeles and stardom.\n\nNot just an actor, Barnes is also blessed with vocal talent and just two years after moving to Los Angeles, his performance in Robert Townsend's, \"The Five Heartbeats: The Musical,\" was nominated BEST ACTOR for an NAACP Theater Award. Barnes also starred in the musicals, \"Letters from Nam\", which was written and produced by Emmy award-winning director, Paris Barclay, and \"Dorian,\" which The Denver Daily New said, Barnes \"gave a knockout performance.\" Barnes' musical talents also led to a contract with Capitol Records, where he recorded an album with the group H20. The group disbanded before the album was released.\n\nBarnes has guest-starred in over 30 different episodic shows, including such hit shows as C.S.I., E.R., and Cold Case. Other network guest appearances include, \"Without a Trace\", \"Angel\", \"Judging Amy\", \"Numbers\", \"The Shield\" and \"Six Feet Under.\" Following in the shoes of such greats as, Samuel L. Jackson, Halle Berry (Jungle Fever) and Chris Rock (New Jack City), Barnes' haunting portrayal of the cheeseburger loving crack addict in the urban classic Menace II Society has garnered him critical acclaim throughout Hollywood.",
        "birthday": "1970-11-26",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1220725,
        "imdb_id": "nm0055578",
        "known_for_department": "Acting",
        "name": "Dwayne L. Barnes",
        "place_of_birth": "Detroit, Michigan, USA",
        "popularity": 0.1156,
        "profile_path": "/A44DvPA2nCkDvLhZcaN4YsTwTTe.jpg"
    }
}