{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/vcUvothl49FIx2a8bt4IChW3k32.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 211954,
                "original_language": "es",
                "original_title": "No se aceptan devoluciones",
                "overview": "Valentin is Acapulco's resident playboy, until a former fling leaves a baby on his doorstep and him heading with her out of Mexico.",
                "popularity": 3.0784,
                "poster_path": "/4f0qaU7cWmO9kYEkr3QGdA7KNFR.jpg",
                "release_date": "2013-07-20",
                "title": "Instructions Not Included",
                "video": false,
                "vote_average": 7.752,
                "vote_count": 931,
                "character": "Mesero",
                "credit_id": "553cb42cc3a3685cf80072eb",
                "order": 36
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Franklin Rirvehl",
            "Dr. Franklin Ruehl",
            "Dr. Ruehl",
            "Franklin Ruehl Ph.D."
        ],
        "biography": "Franklin Ruehl is an American ufologist and cryptozoologist. He holds a Ph.D. in theoretical nuclear physics from UCLA. He has appeared on such shows as Jimmy Kimmel Live!, The Roseanne Show and Tom Green Live among others. Ruehl's own show, Mysteries from Beyond the Other Dominion, started on a public-access television cable TV channel in the Los Angeles area in the late 1980s, and then the Sci Fi Channel in the early '90s. In 2006, He hosted several new episodes of the show on TomGreen.com. Ruehl was rejected on an America's Got Talent audition with an act that encompassed sticking straws into a potato. In 2010, he appeared on several episodes of 1000 Ways to Die, as an expert, portraying a Cryptozoologist, a Conspiracy Expert and a Deathologist/Thanatologist. His show Professor Weird debuted at 9pm on August 18, 2012 on the Science Channel. Ruehl has a series of videos entitled The Realm of Bizarre News, which can be viewed here.",
        "birthday": "1950-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1221701,
        "imdb_id": "nm1432981",
        "known_for_department": "Acting",
        "name": "Franklin Ruehl",
        "place_of_birth": "Philadelphia, Pennsylvania, USA",
        "popularity": 0.1884,
        "profile_path": "/ljINbhe5AXa0Xx6aFGoSIFmMFuI.jpg"
    }
}