{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kpBl6nGmRaUKmvASc1S3hB9F71q.jpg",
                "genre_ids": [
                    18
                ],
                "id": 177945,
                "original_language": "ja",
                "original_title": "そして父になる",
                "overview": "Ryota Nonomiya is a successful businessman driven by money. He learns that his biological son was switched with another child after birth. He must make a life-changing decision and choose his true son or the boy he raised as his own.",
                "popularity": 4.0419,
                "poster_path": "/r0nejXOf6e4leWhnLuEQOmC5hrX.jpg",
                "release_date": "2013-09-24",
                "title": "Like Father, Like Son",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 759,
                "character": "Shoko Miyazaki",
                "credit_id": "58ef3fbdc3a368265e009afd",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Sung Yu-Ri",
            "なかむら ゆり",
            "成友理",
            "성우리",
            "Son Yuri",
            "Yoo-Ri Sung"
        ],
        "biography": "Born in Osaka, Japan as Sung Yu-Ri to a South Korean mother and a Japanese father of Korean descent in 1982. Yuri became active in the entertainment industry in 1998. She was accepted at TV Tokyo's Asayan audition in 1996 and formed the musical duo YuriMari with Izawa Mari, which made its debut in 1998. They broke up a year later. With the help of Avex Management she began acting in 2003 first on the small screen and subsequently on the silver one. She won the Rookie Award at the third Osaka Cinema Festival in 2008 for her role in Pacchigi! Love & Peace of 2007. She transferred to Alpha Agency from Avex Management in early 2013. Yuri also hosted a NHK documentary, called The World On A Bicycle: Uzbekistan, which was released in 2014. She has been pushing corporate products and services since the beginning of the century as well. She likes to travel.",
        "birthday": "1982-03-15",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 122157,
        "imdb_id": "nm1157364",
        "known_for_department": "Acting",
        "name": "Yuri Nakamura",
        "place_of_birth": "Neyagawa, Osaka, Japan",
        "popularity": 0.3805,
        "profile_path": "/cb8sW4IeBjVf1CbZbPzIEqKgRgd.jpg"
    }
}