{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ft8WRF2xqEwwGWa59naDUybKTAx.jpg",
                "genre_ids": [
                    18,
                    10752,
                    10749
                ],
                "id": 770,
                "original_language": "en",
                "original_title": "Gone with the Wind",
                "overview": "The spoiled daughter of a Georgia plantation owner conducts a tumultuous romance with a cynical profiteer during the American Civil War and Reconstruction Era.",
                "popularity": 7.332,
                "poster_path": "/lNz2Ow0wGCAvzckW7EOjE03KcYv.jpg",
                "release_date": "1939-12-15",
                "title": "Gone with the Wind",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 4191,
                "character": "Frank Kennedy",
                "credit_id": "52fe4274c3a36847f801feb1",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nRobert Carroll Nye (October 4, 1901 – March 17, 1974) was an American film actor. He appeared in 58 films between 1925 and 1944.  His mother, Myra Nye, worked for the Los Angeles Times. Carroll was educated at the University of California and later became a reporter and radio editor with the Times like his mother. However, he went into film business in 1924. At the beginning of his career he had a score of leading man roles in Hollywood opposite such silent screen stars as Anita Page and Corinne Griffith. In his late career, he played usually small roles, perhaps most memorably as Frank Kennedy, Scarlett's second husband, in Gone with the Wind (1939). His film career ended in 1944 with an uncredited role in Wilson. Nye also worked with Groucho Marx at CBS.\n\nAfter his film career, Nye served as a Hollywood newscaster and publicity man. He was married to actress Helen Lynch since 1928, but the marriage ended in divorce. He later married a woman named Dorothy, mentioned on his gravestone at Forest Lawn Memorial Park, Hollywood Hills. His brother was respected Hollywood makeup artist Ben Nye.",
        "birthday": "1901-10-04",
        "deathday": "1974-03-17",
        "gender": 2,
        "homepage": null,
        "id": 122148,
        "imdb_id": "nm0638560",
        "known_for_department": "Acting",
        "name": "Carroll Nye",
        "place_of_birth": "Akron, Ohio, USA",
        "popularity": 0.0826,
        "profile_path": "/aqmO4fOxFyruLGTiCimr8vzsXuS.jpg"
    }
}