{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8uw6OCa4ofQ6A9xz5ldtgnEVPDr.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 8438,
                "original_language": "en",
                "original_title": "Murder in the First",
                "overview": "A young, inexperienced public defender is assigned to defend an inmate accused of committing murder while behind bars.",
                "popularity": 2.9513,
                "poster_path": "/sU37ONoL9qUyYXUhubJSYH9tEoc.jpg",
                "release_date": "1995-01-20",
                "title": "Murder in the First",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 585,
                "character": "Jury Foreman",
                "credit_id": "660795a60d417e016304fa10",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ritchie Allan",
            "Richie Allen"
        ],
        "biography": "Richie Allan has been the voice and face of hundreds of radio and television commercials, as well as guest and starring roles in TV and Film. A recent appearance includes Amazon's Golden Globe award-winning \"The Marvelous Mrs. Maisel.\" On film Richie has been seen in \"Alto,\" \"Meet Dave,\" \"Pink Cadillac,\" \"Murder In The First,\" \"The Dennis Byrd Story,\" and \"A League Of Their Own.\" TV appearances include: \"Law and Order: SVU,\" \"E.R.,\" \"China Beach,\" \"JAG,\" \"Seinfeld,\" \"Married with Children,\" \"Growing Pains\" and many others. He had recurring and featured roles in \"Santa Barbara,\" \"All My Children,\" \"General Hospital,\" \"As the World Turns,\" and \"Guiding Light.\"\n\nHis theatre career includes the west coast premier of \"Home Games\" (White Fire Theater), and David Mamet's world premier of \"The Disappearance of the Jews,\" as well as regional and off-Broadway musical theatre roles in \"Guys and Dolls,\" \"Kiss Me Kate,\" \"Damn Yankees,\" and \"Chicago.\"\n\nRichie's Short film \"Knucks,\" won three film festivals in NYC, L.A., and London. Based on this success, he is expanding it into a full-length feature.\n\nRichie recently appeared as William Rickerson in Part 6 of the Showtime mini-series \"Escape at Dannemora,\" directed by Ben Stiller, with Benico Del Torro, Paul Dano and Patricia Arquette. He recently completed principal photography on Max Hechtman Films' 2019 narrative short film, \"Abigail.\"",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.richieallan.com",
        "id": 1221154,
        "imdb_id": "nm0020006",
        "known_for_department": "Acting",
        "name": "Richie Allan",
        "place_of_birth": null,
        "popularity": 0.045,
        "profile_path": "/viv9cfOxrRfhHwbIeni99FzL7SE.jpg"
    }
}