{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/i3pONuqGZSR3UYOOdBeU2CiQnxj.jpg",
                "genre_ids": [
                    10751,
                    18,
                    10402
                ],
                "id": 5123,
                "original_language": "en",
                "original_title": "August Rush",
                "overview": "Lyla and Louis, a singer and a musician, fall in love, but are soon compelled to separate. Lyla is forced to give up her newborn but unknown to her, he grows up to become a musical genius.",
                "popularity": 5.187,
                "poster_path": "/oA6ZeICPINiS6YtD5WZeBaGVmuT.jpg",
                "release_date": "2007-11-21",
                "title": "August Rush",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 2764,
                "character": "Jennifer",
                "credit_id": "52fe43f5c3a36847f807a62b",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Becky Newton",
            "碧姬·紐頓"
        ],
        "biography": "Rebecca Sara \"Becki\" Newton (born July 4, 1978) is an American actress best known for her roles as Amanda Tanen on the television series Ugly Betty and Quinn on How I Met Your Mother.\n\nBorn in New Haven, Connecticut, Becki Newton was raised in Guilford, Connecticut. She is of English and Czech descent and began performing musicals and plays at local theaters, and studied at the University of Pennsylvania, where she graduated with a B.A. in European History. At Penn, Newton was a member of the Alpha Chi Omega sorority.\n\nAfter graduation, Newton then moved to New York City and landed several roles in television commercials for such companies as the Olive Garden.\n\nNewton portrayed the character Amanda Tanen in the comedy-drama series Ugly Betty from 2006 to 2010. With co-star Michael Urie, Newton co-hosted the Official Ugly Betty Podcast. She also appeared in ABC.com's Mode After Hours webisode series. Ugly Betty was canceled in 2010 after four successful seasons allowing the show to receive a proper series finale.\n\nIn late 2009, Newton performed at a New York City Center Encores! presentation of the Gershwin musical Girl Crazy, which was directed by Jerry Zaks. She portrayed Molly Gray and performed opposite real-life husband Chris Diamantopoulos.\n\nNewton starred in the television series Love Bites. The hour-long romantic comedy was created by executive producer Cindy Chupack, who worked on Sex and the City. NBC announced the pick up of the series in May 2010.However, with Newton announcing her pregnancy, co-star Jordana Spiro contractually obligated to stay with her other show My Boys (which was later cancelled) and Chupack's desire to leave the show, Love Bites was pushed back to midseason. Love Bites aired in summer 2011 on NBC and was cancelled after eight episodes. In November 2011, Newton was cast on CBS's How I Met Your Mother as Quinn, a love interest for Neil Patrick Harris's character Barney Stinson. She currently stars in the Fox mid-season TV series The Goodwin Games.\n\nNewton met her husband, Chris Diamantopoulos, in a subway station in New York, and they married on 12 May 2005. It was announced on July 1, 2010 that Newton and Diamantopolous were expecting their first child. She gave birth to a son in early Nov 2010.\n\nHer older brother, Matt Newton, is also an actor. He guest starred as the boyfriend of Ugly Betty character Marc St. James. Her mother, Jennifer, is an award-winning artist, and her aunt, Stephanie Chase is a classical violinist.\n\nFrom Wikipedia, the free encyclopedia.",
        "birthday": "1978-07-04",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1222175,
        "imdb_id": "nm1182048",
        "known_for_department": "Acting",
        "name": "Becki Newton",
        "place_of_birth": "New Haven, Connecticut, USA",
        "popularity": 1.1143,
        "profile_path": "/zHz9UTFISg3U7gs3BsELijbB0sA.jpg"
    }
}