{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8BTsTfln4jlQrLXUBquXJ0ASQy9.jpg",
                "genre_ids": [
                    12,
                    28,
                    878
                ],
                "id": 140607,
                "original_language": "en",
                "original_title": "Star Wars: The Force Awakens",
                "overview": "Thirty years after defeating the Galactic Empire, Han Solo and his allies face a new threat from the evil Kylo Ren and his army of Stormtroopers.",
                "popularity": 11.7739,
                "poster_path": "/wqnLdwVXoBjKibFRR5U3y0aDUhs.jpg",
                "release_date": "2015-12-15",
                "title": "Star Wars: The Force Awakens",
                "video": false,
                "vote_average": 7.256,
                "vote_count": 19968,
                "character": "Resistance Engineer (uncredited)",
                "credit_id": "5eca66a58e2e00607410b046",
                "order": 104
            },
            {
                "adult": false,
                "backdrop_path": "/4XM8DUTQb3lhLemJC51Jx4a2EuA.jpg",
                "genre_ids": [
                    28,
                    80,
                    53,
                    12,
                    9648
                ],
                "id": 385687,
                "original_language": "en",
                "original_title": "Fast X",
                "overview": "Over many missions and against impossible odds, Dom Toretto and his family have outsmarted, out-nerved and outdriven every foe in their path. Now, they confront the most lethal opponent they've ever faced: A terrifying threat emerging from the shadows of the past who's fueled by blood revenge, and who is determined to shatter this family and destroy everything—and everyone—that Dom loves, forever.",
                "popularity": 30.3928,
                "poster_path": "/fiVW06jE7z9YnO4trhaMEdclSiC.jpg",
                "release_date": "2023-05-17",
                "title": "Fast X",
                "video": false,
                "vote_average": 7.025,
                "vote_count": 6040,
                "character": "Tuner Party Gents (uncredited)",
                "credit_id": "67c335465fddabe3eb3f79d8",
                "order": 43
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Chen Yi Ru",
            "辰亦儒 ",
            "Chen Yiru",
            "陈奕儒",
            "辰亦儒"
        ],
        "biography": "Calvin Chen Is a multi-talented actor, singer and comedian. He's seen as \"Kajiklub\" In Lucas Film \"Star Wars\" Episode VII - The Force Awakens, directed by J.J. Abrams.\n\nStudied English at the University of Oxford, Chen trained at the double-award winning drama school, \"Identity School of Acting\".\n\nCalvin appeared In \"Teen Spirit,\" directed by Max Minghella. Starring Elle Fanning, the film is based on violet who dreams of escaping her small town In pursuing her passion to sing, a stylish spin on the Cinderella story. Calvin plays \"TET.\"\n\nChen was seen in \"Fanta's\" 'Big News' directed by Clay Weiner, \"Biscuit film works,\" a group of teenagers who transforms Into key CEO's in Fanta's headquarters. Calvin plays aka 'The Cool Kid', a boy unconventionally cool in a way all the popular executives wish they were, production by \"TwentyFour-Seven.\"\n\nCalvin resides in London, England, His father is Taiwanese-Korean and his mother, who is born In the Philippines, was adopted from a \"Spanish\" family.\n\nCalvin is a trained Boxer at 'Elorde' boxing gym In Manila, Elorde is Home to Boxing Legend, 'Manny Pacquiao'. Chen trains broadly In the \"Martial Arts.\"\n\nCalvin speaks fluent Mandarin, Korean, English & Filipino.\n\nChen is in production on \"Death On The Nile,\" directed by Kenneth Branagh. Starring Gal Gadot, Twentieth Century FOX is set to release the film in October 2020.",
        "birthday": "1980-11-10",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1222314,
        "imdb_id": "nm3323300",
        "known_for_department": "Acting",
        "name": "Calvin Chen",
        "place_of_birth": "中国,台湾",
        "popularity": 0.357,
        "profile_path": "/aietcQ6zNDWRJNSFqWlQLXMMIPX.jpg"
    }
}