{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/insPcjOIWFf6Uc9DR0ORgXATqSM.jpg",
                "genre_ids": [
                    18
                ],
                "id": 4960,
                "original_language": "en",
                "original_title": "Synecdoche, New York",
                "overview": "A theater director struggles with his work, and the women in his life, as he attempts to create a life-size replica of New York inside a warehouse as part of his new play.",
                "popularity": 2.8503,
                "poster_path": "/5UwdhrjXhUgsiDhe1dpS9z4yj7q.jpg",
                "release_date": "2008-10-24",
                "title": "Synecdoche, New York",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 1496,
                "character": "Soap Actress Nurse",
                "credit_id": "64d2925617792c00c5a7434e",
                "order": 45
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nAmy Spanger is an Americanactress, singer and dancer.\n\nBorn in Newbury, Massachusetts, Spanger made her Broadway debut in 1995 in the musical Sunset Boulevard, following a half-year run in the pre-Broadway national tour of Jekyll & Hyde. She originated the role of Lois Lane (Bianca) in the Broadway revival of Kiss Me, Kate. In Chicago she played Roxie Hart, and in Urinetown as Hope Cladwell. In 2006 she originated the role of Holly in The Wedding Singer.\n\nSpanger also appeared in the national touring companies of Rent and Chicago. She originated the role of Susan in the off-Broadway production of the Jonathan Larson musical tick, tick... BOOM!. Other stage credits include: Lunch, and Feeling Electric, which later became Next to Normal, in which she co-starred with actor Anthony Rapp.\n\nShe originated the role of Sherrie in the Broadway musical Rock of Ages,  but took an extended leave from the production in early June 2009 for  vocal rest before permanently departing the production on June 29 for  \"personal reasons.\"\n\nShe more recently originated the role of Jovie in the stage musical adaption of Will Ferrell's Christmas comedy, Elf, that ran on Broadway for nine weeks at the Al Hirschfeld Theater and closed on January 2, 2011.",
        "birthday": "1971-08-24",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1222822,
        "imdb_id": "nm1690665",
        "known_for_department": "Acting",
        "name": "Amy Spanger",
        "place_of_birth": "Newbury - Massachusetts - USA",
        "popularity": 0.6021,
        "profile_path": "/dV2tx31b8WBwXrAhukaMDmL6Khe.jpg"
    }
}