{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/j9QaQVuyQIEwckUbjHpAgA7E4jJ.jpg",
                "genre_ids": [
                    80,
                    18,
                    53
                ],
                "id": 50348,
                "original_language": "en",
                "original_title": "The Lincoln Lawyer",
                "overview": "Mick Haller is a charismatic defense attorney who does business out of his Lincoln Continental sedan. Mick spends most of his time defending petty crooks and other bottom-feeders, so it comes as quite a surprise when he lands the case of a lifetime: defending a Beverly Hills playboy who is accused of attempted murder. However, what Mick initially thinks is an open-and-shut case with a big monetary reward develops into something more sinister.",
                "popularity": 4.9158,
                "poster_path": "/gOn8Ve9Yi8fxjRkmLr5BZoOc7KV.jpg",
                "release_date": "2011-03-17",
                "title": "The Lincoln Lawyer",
                "video": false,
                "vote_average": 7.196,
                "vote_count": 3436,
                "character": "Detective Heidi Sobel",
                "credit_id": "52fe47c4c3a36847f814716d",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "米凱拉·考林"
        ],
        "biography": "​From Wikipedia, the free encyclopedia.\n\nMichaela Conlin (born June 9, 1978, height 5' 8\" (1,73 m)) is an American stage and television actress, best known for her work on the Fox TV series, Bones as Angela Montenegro. Conlin was born and raised in Allentown, Pennsylvania. She was born to a Chinese-American mother and an Irish-American father.\n\nShe performed in her first play at the age of six and continued to appear on stage in numerous Pennsylvania community and regional productions. Following her graduation from Parkland High School, Conlin moved to New York City to study acting and was accepted into New York University's Tisch School of the Arts. While working toward her B.F.A. in Theater, she appeared in several productions at the Atlantic Theater Company and the Playwrights Horizons Theater School, and traveled to Amsterdam to study with the Experimental Theatre Wing's International Training Program.\n\nFollowing her graduation from NYU, Conlin was chosen to be a part of the cable documentary series The It Factor, which focused on the lives of young actors in New York City. Soon after, she relocated to Los Angeles, California, where she landed her first starring role in the series MDs, playing an idealistic young intern taken under the wing of the hospital's two renegade doctors, played by William Fichtner and John Hannah. She followed that with a leading role in the drama series The D.A., playing an outspoken political consultant to Steven Weber's district attorney.",
        "birthday": "1978-06-09",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 122237,
        "imdb_id": "nm0174819",
        "known_for_department": "Acting",
        "name": "Michaela Conlin",
        "place_of_birth": "Allentown, Pennsylvania, USA ",
        "popularity": 0.9386,
        "profile_path": "/5Qv7KNTMDbdO7m5p1wIic5kVKr8.jpg"
    }
}