{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sGKUhw88FMH5gfz0E6BK2YOZ5se.jpg",
                "genre_ids": [
                    36,
                    18
                ],
                "id": 82695,
                "original_language": "en",
                "original_title": "Les Misérables",
                "overview": "An adaptation of the successful stage musical based on Victor Hugo's classic novel set in 19th-century France. Jean Valjean, a man imprisoned for stealing bread, must flee a relentless policeman named Javert. The pursuit consumes both men's lives, and soon Valjean finds himself in the midst of the student revolutions in France.",
                "popularity": 6.5933,
                "poster_path": "/6CuzBs2Lb8At7qQr64mLXg2RYRb.jpg",
                "release_date": "2012-12-18",
                "title": "Les Misérables",
                "video": false,
                "vote_average": 7.315,
                "vote_count": 5417,
                "character": "Ensemble Paris Beggars",
                "credit_id": "52fe486e9251416c9108c331",
                "order": 168
            },
            {
                "adult": false,
                "backdrop_path": "/kvdy0Ijjo2r9qsnWV4Dzx07qwnc.jpg",
                "genre_ids": [
                    80,
                    14,
                    18
                ],
                "id": 1427,
                "original_language": "en",
                "original_title": "Perfume: The Story of a Murderer",
                "overview": "Jean-Baptiste Grenouille, born in the stench of 18th century Paris, develops a superior olfactory sense, which he uses to create the world's finest perfumes. However, his work takes a dark turn as he tries to preserve scents in the search for the ultimate perfume.",
                "popularity": 7.9304,
                "poster_path": "/2wrFrUej8ri5EpjgIkjKTAnr686.jpg",
                "release_date": "2006-09-13",
                "title": "Perfume: The Story of a Murderer",
                "video": false,
                "vote_average": 7.369,
                "vote_count": 4762,
                "character": "Marcel",
                "credit_id": "5ef66967c8113d00375fe673",
                "order": 30
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Perry Millward (born 24 October 1992) is an English actor primarily known for his work on stage (especially in London's West End), and with a number of film and television credits. Millward was born in Sidcup, London.  Thanks to an Emma Priest Scholarship he received for his singing, Millward became a full-time pupil with the Sylvia Young Theatre School. He was one of the students featured in the 2004 television series \"When Will I Be Famous?\", which gave a behind-the-scenes look at the famous theatre school.\n\nMillward starred as Jeremy Potts in the musical Chitty Chitty Bang Bang, as Michael Banks in Mary Poppins,  and as Gavroche in Les Misérables.\n\nIn 2006 he performed the role of Noah in the musical Caroline, or Change at the National Theatre, London, He played the role of David in Menier Chocolate Factory's production of Torch Song Trilogy in 2012.\n\nMillward's first television appearance was playing a character, Warren, in an episode of The Bill in 2003; he returned to the long-running series in 2008, playing the character Joey Tomlinson. He also portrayed The Artful Dodger in a televised stage production hosted by Shane Ritchie called Celebrate 'Oliver!' on 26 December 2005 alongside Ron Moody (Fagin) and Joseph McManners (Oliver) in which the cast sang the biggest hits from the West End production.\n\nOn 7 July 2006 he starred as Mike in the one-hour television film drama That Summer Day broadcast on CBBC, about the bombings of the London public transport system that occurred a year earlier. In the same year he achieved a small role (Marcel) in his first feature film, Perfume: The Story of a Murderer.\n\nIn 2008, he played Jacob West in The Sarah Jane Adventures story The Mark of the Berserker. In 2009 he appeared in an episode of the British drama Ashes to Ashes, and also appeared as Nathan Harris in two episodes of television series Casualty, in which he had portrayed a minor character three years previously. Although his role was a minor one, he was cast as a newspaper delivery boy in the highly successful 2010 ITV television series Downton Abbey.\n\nIn 2011 Millward began appearances in the role of Nick Monroe in the television series Monroe; his character is a family member of the lead character of the series.\n\nFollowing his minor parts in the 2006 films That Summer Day and Perfume: The Story of a Murderer, Millward was cast in a significant supporting role in the 2011 television film Christopher and His Kind, produced by the BBC, and based on the autobiographical novel by Christopher Isherwood. Millward played Richard Isherwood, younger brother of Christopher, against Matt Smith's lead role. During 2011 Millward also completed filming of a supporting role in the science-fiction feature film John Carter of Mars",
        "birthday": "1992-10-24",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1222373,
        "imdb_id": "nm1599985",
        "known_for_department": "Acting",
        "name": "Perry Millward",
        "place_of_birth": "Sidcup, Kent, England",
        "popularity": 0.0457,
        "profile_path": null
    }
}