{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yFkUPqBuUnbhYbQL8VFpTrAT9za.jpg",
                "genre_ids": [
                    18,
                    878,
                    9648
                ],
                "id": 686,
                "original_language": "en",
                "original_title": "Contact",
                "overview": "A radio astronomer receives the first extraterrestrial radio signal ever picked up on Earth. As the world powers scramble to decipher the message and decide upon a course of action, she must make some difficult decisions between her beliefs, the truth, and reality.",
                "popularity": 6.2788,
                "poster_path": "/bCpMIywuNZeWt3i5UMLEIc0VSwM.jpg",
                "release_date": "1997-07-11",
                "title": "Contact",
                "video": false,
                "vote_average": 7.435,
                "vote_count": 4709,
                "character": "Bryant Gumbel",
                "credit_id": "645fdd9a6e0d72017b304853",
                "order": 48
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Bryant Charles Gumbel (born September 29, 1948) is an American television journalist and sportscaster, best known for his 15 years as co-host of NBC's Today. He is the younger brother of sportscaster Greg Gumbel. Since 1995, he has hosted HBO's acclaimed investigative series Real Sports with Bryant Gumbel, which has been rated as \"flat out TV's best sports program\" by the Los Angeles Times. It won a Peabody Award in 2012.\n\nGumbel was hired by NBC Sports in the fall of 1975 as co-host of its National Football League pre-game show GrandStand with Jack Buck. From 1975 until January 1982 (when he left to do The Today Show), he hosted numerous sporting events for NBC including Major League Baseball, college basketball and the National Football League. He returned to sportscasting for NBC when he hosted the prime time coverage of the 1988 Summer Olympics from Seoul and the PGA Tour in 1990.\n\nNBC News made Gumbel the principal anchor of Today beginning September 27, 1982, and broadcast from Vietnam, Vatican City, Europe, South America, and much of the United States followed between 1984 and 1989. Gumbel's work on Today earned him several Emmys and a large fanbase. He is the third longest serving co-host of Today, after former hosts Matt Lauer and Katie Couric. He stepped down from the show on January 3, 1997, after 15 years.\n\nGumbel moved to CBS, where he hosted various shows before becoming co-host of the network's morning show The Early Show on November 1, 1999. Gumbel was hosting The Early Show on the morning of September 11, 2001. He was the first to announce the September 11 attacks to CBS viewers. Gumbel left CBS and The Early Show on May 17, 2002.\n\nFrom Wikipedia, the free encyclopedia.",
        "birthday": "1948-09-29",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1223819,
        "imdb_id": "nm0347910",
        "known_for_department": "Acting",
        "name": "Bryant Gumbel",
        "place_of_birth": "New Orleans, Louisiana, USA",
        "popularity": 0.2173,
        "profile_path": "/g0y8ZEY3H6u64ksYVefV1oQCx0D.jpg"
    }
}