{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3WK7p9EdZmmvB1IbB2Vw9Rf4lXH.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 296096,
                "original_language": "en",
                "original_title": "Me Before You",
                "overview": "A small town girl is caught between dead-end jobs. A high-profile, successful man becomes wheelchair bound following an accident. The man decides his life is not worth living until the girl is hired for six months to be his new caretaker. Worlds apart and trapped together by circumstance, the two get off to a rocky start. But the girl becomes determined to prove to the man that life is worth living and as they embark on a series of adventures together, each finds their world changing in ways neither of them could begin to imagine.",
                "popularity": 14.9446,
                "poster_path": "/Ia3dzj5LnCj1ZBdlVeJrbKJQxG.jpg",
                "release_date": "2016-06-01",
                "title": "Me Before You",
                "video": false,
                "vote_average": 7.928,
                "vote_count": 12829,
                "character": "Louisa 'Lou' Clark",
                "credit_id": "54304aeec3a36831b5001016",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/qIjyBgsMDbpeEO3CJx7vxVn4KO8.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 549053,
                "original_language": "en",
                "original_title": "Last Christmas",
                "overview": "Kate is a young woman who has a habit of making bad decisions, and her last date with disaster occurs after she accepts work as Santa's elf for a department store. However, after she meets Tom there, her life takes a new turn.",
                "popularity": 3.257,
                "poster_path": "/kDEjffiKgjuGo2DRzsqfjvW0CQh.jpg",
                "release_date": "2019-11-07",
                "title": "Last Christmas",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 2478,
                "character": "Kate  Andrich",
                "credit_id": "5ba17fec92514110840004e5",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Αιμιλία Κλαρκ",
            "Emilia Isobel Euphemia Rose Clarke",
            "Emilia Clarková",
            "Emilia Clarkeová",
            "امیلیا کلارک"
        ],
        "biography": "Emilia Isobel Euphemia Rose Clarke, MBE (born 23 October 1986), is an English actress. She is best known for her role as Daenerys Targaryen in the HBO fantasy series Game of Thrones (2011–2019), for which she received nominations for four Primetime Emmy Awards. She is also known for playing Sarah Connor in the science fiction film Terminator: Genisys (2015) and Qi'ra in the Star Wars film Solo: A Star Wars Story (2018), as well as starring in the romantic dramas Me Before You (2016) and Last Christmas (2019).\n\nClarke studied at Drama Centre London, appearing in a number of stage productions. Her television debut was a guest appearance in the 2009 BBC One medical soap opera Doctors, at age 22. Clarke made her Broadway debut as Holly Golightly in the play Breakfast at Tiffany's (2013) and played Nina in a West End production of The Seagull that was suspended due to the COVID-19 lockdowns. She also had a role named G'iah in the Marvel Cinematic Universe miniseries, Secret Invasion (2023).\n\nDescription above from the Wikipedia article Emilia Clarke, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1986-10-23",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1223786,
        "imdb_id": "nm3592338",
        "known_for_department": "Acting",
        "name": "Emilia Clarke",
        "place_of_birth": "London, England, UK",
        "popularity": 2.1846,
        "profile_path": "/58ZhsLDVFgxx6fePJQ2K8RVpc1s.jpg"
    }
}