{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kbOB9DGl8qwhDRcXOmXfmcmadeD.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 645886,
                "original_language": "en",
                "original_title": "The Unforgivable",
                "overview": "A woman is released from prison after serving a sentence for a violent crime and re-enters a society that refuses to forgive her past.",
                "popularity": 6.4782,
                "poster_path": "/1b3dNFDuE7i05TJlXrIC571yR01.jpg",
                "release_date": "2021-11-24",
                "title": "The Unforgivable",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 1910,
                "character": "Stan",
                "credit_id": "61b46b8c894ed6001ce15219",
                "order": 23
            },
            {
                "adult": false,
                "backdrop_path": "/gz3rCM34UicmOxRY1T2SgiQZJoS.jpg",
                "genre_ids": [
                    18
                ],
                "id": 249164,
                "original_language": "en",
                "original_title": "If I Stay",
                "overview": "Mia Hall, a talented young cellist, thought the most difficult decision she would ever have to make would be whether to pursue her musical dreams at prestigious Juilliard or follow her heart to be with the love of her life, Adam, a rock singer/guitarist. However, a car wreck changes everything in an instant, and now Mia's life hangs in the balance. Suspended between life and death, Mia faces a choice that will decide her future.",
                "popularity": 3.7143,
                "poster_path": "/7Twh8h3Wh7GC9npTAEUThgkxkWL.jpg",
                "release_date": "2014-08-21",
                "title": "If I Stay",
                "video": false,
                "vote_average": 7.366,
                "vote_count": 4239,
                "character": "Mosh Pit Oaf",
                "credit_id": "54a272ff9251411d5300921f",
                "order": 25
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Described as “a happy Hagrid” (for his more than passing resemblance to the Harry Potter chum) comedian Toby Hargrave shares the character’s imposing physical presence as well as his colossal warmth. Audiences are drawn in (if never completely put at ease) by Hargrave’s humble charm and unwaveringly honest comedy.   A gifted storyteller with an absurd ability to pinpoint the unseen hilarity of life, Hargrave has captivated audiences for over 20 years. Credits include appearances at the Just for LaughsComedy Festival in Montreal, Atomic Comedy Festival in Washington State, Whistler & Edmonton Comedy Festivals, Vancouver International Comedy Festival, where he was award title of “Funniest Comedian in Vancouver”.  Starting in his home town of Edmonton Alberta, Toby has performed at The Comedy Store, Improv, Laugh Shop, Yuk Yuks, Hermosa Comedy Magic Club, Jon Lovitz Comedy Club and continues to enthrall audiences across North American with his incredible ability to connect with diverse crowds and relate his unique comedic perspective.",
        "birthday": "1974-09-26",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.seetobylive.com/",
        "id": 1223435,
        "imdb_id": "nm2834049",
        "known_for_department": "Acting",
        "name": "Toby Hargrave",
        "place_of_birth": "Edmonton - Alberta - Canada",
        "popularity": 0.7812,
        "profile_path": "/a9ILcnXk4dGRmpuGRoc3HSytLn0.jpg"
    }
}