{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/43BEez1EGdmNpg8rcPUFToujlii.jpg",
                "genre_ids": [
                    53,
                    80
                ],
                "id": 161,
                "original_language": "en",
                "original_title": "Ocean's Eleven",
                "overview": "Less than 24 hours into his parole, charismatic thief Danny Ocean is already rolling out his next plan: In one night, Danny's hand-picked crew of specialists will attempt to steal more than $150 million from three Las Vegas casinos. But to score the cash, Danny risks his chances of reconciling with ex-wife, Tess.",
                "popularity": 9.4093,
                "poster_path": "/hQQCdZrsHtZyR6NbKH2YyCqd2fR.jpg",
                "release_date": "2001-12-07",
                "title": "Ocean's Eleven",
                "video": false,
                "vote_average": 7.451,
                "vote_count": 12045,
                "character": "Eydie Gormé",
                "credit_id": "5eb5afb3ccb15f0022870610",
                "order": 43
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Eydie Gorme"
        ],
        "biography": "Eydie Gormé (born Edith Garmezano) was an American singer who had hits on the pop and Latin pop charts. She sang solo and with her husband, Steve Lawrence, on albums, television, Broadway, and in Las Vegas.  Gormé signed as a solo act with Coral Records in 1952 and released her first single, \"That Night of Heaven\". She was hired by The Tonight Show in its early days with Steve Allen and formed a duo with another one of its staff singers, Steve Lawrence. As The Tonight Show was beginning to broadcast across the country in 1954, the duo released their first single, \"Make Yourself Comfortable/I've Gotta Crow\".\n\nIn 1957 Gormé and Lawrence were married, and several months later they hosted Steve Allen Presents the Steve Lawrence-Eydie Gormé Show after Allen retired from The Tonight Show.\n\nSteve and Eydie moved on to Broadway, starring in the musical Golden Rainbow based on the play A Hole in the Head. \"How Could I Be So Wrong\" by Gormé, which was performed in the musical, was a hit on the Easy Listening chart. The musical had a successful one year run.\n\nSteve and Eydie performed a tribute to George Gershwin on a their television special Our Love Is Here to Stay, which won an Emmy Award for Outstanding Variety Music or Comedy Special. Two years later they sang on Steve and Eydie Celebrate Irving Berlin and again won an Emmy Award for Outstanding Variety Music or Comedy Special.",
        "birthday": "1928-08-16",
        "deathday": "2013-08-10",
        "gender": 1,
        "homepage": null,
        "id": 1224635,
        "imdb_id": "nm0331171",
        "known_for_department": "Acting",
        "name": "Eydie Gormé",
        "place_of_birth": "The Bronx, New York City, New York, USA",
        "popularity": 0.1459,
        "profile_path": "/gxoaJQ2U5CrwkhXUgIYVAPO2P7c.jpg"
    }
}