{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/L7DIiAdP8DnNqOh7454ZrTYspR.jpg",
                "genre_ids": [
                    10402,
                    18,
                    10749
                ],
                "id": 630566,
                "original_language": "en",
                "original_title": "Clouds",
                "overview": "Young musician Zach Sobiech discovers his cancer has spread, leaving him just a few months to live. With limited time, he follows his dream and makes an album, unaware that it will soon be a viral music phenomenon.",
                "popularity": 3.4632,
                "poster_path": "/d0OdD1I8qAfETvE9Rp9Voq7R8LR.jpg",
                "release_date": "2020-10-09",
                "title": "Clouds",
                "video": false,
                "vote_average": 8.25,
                "vote_count": 1033,
                "character": "Jason Mraz",
                "credit_id": "5f8c0bfecb80280039061acf",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia.\n\nJason Thomas Mraz (born June 23, 1977) is an American singer-songwriter, born and raised in Mechanicsville, Virginia. Mraz's stylistic influences include reggae, pop, rock, folk, jazz, bossa nova and hip hop.\n\nMraz released his debut album, Waiting for My Rocket to Come, which contained the hit single \"The Remedy (I Won't Worry)\", in 2002, but it was not until the release of his second album, Mr. A-Z that Mraz achieved major commercial success. The album peaked at number five on the Billboard 200 and sold over 100,000 copies in the US. In 2008, Mraz released his third studio album, We Sing. We Dance. We Steal Things. The album debuted at number three on the Billboard 200 and was a commercial success worldwide, peaking in the top ten of many international charts.\n\nMraz's international breakthrough came with the release of the single \"I'm Yours\" from the album, We Sing. We Dance. We Steal Things. The single peaked at number six on the Billboard Hot 100, giving Mraz his first top ten single. The song was on the Hot 100 for 76 weeks, beating the previous record of 69 weeks held by LeAnn Rimes' \"How Do I Live\". The song was a huge commercial success in the US, receiving a 5x platinum certification from the RIAA for sales of over five million. The song was successful internationally, topping the charts in New Zealand and Norway and peaking in the top ten of multiple international charts.\n\nDescription above from the Wikipedia article Jason Mraz, licensed under CC-BY-SA, full list of contributors on Wikipedia.​",
        "birthday": "1977-06-23",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 122474,
        "imdb_id": "nm0610669",
        "known_for_department": "Acting",
        "name": "Jason Mraz",
        "place_of_birth": "Mechanicsville, Virginia US",
        "popularity": 0.2022,
        "profile_path": "/iXPXZmPRwptlhHqjV558rDi8ZOP.jpg"
    }
}