{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zp5bc23EPflpLhkCObsFFOL3psw.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 74534,
                "original_language": "en",
                "original_title": "The Best Exotic Marigold Hotel",
                "overview": "British retirees travel to India to take up residence in what they believe is a newly restored hotel. Less luxurious than its advertisements, the Marigold Hotel nevertheless slowly begins to charm in unexpected ways as the residents find new purpose in their old age.",
                "popularity": 2.3375,
                "poster_path": "/gNWiOKTWDvPTpr7QfPWk18gLftz.jpg",
                "release_date": "2012-02-23",
                "title": "The Best Exotic Marigold Hotel",
                "video": false,
                "vote_average": 6.956,
                "vote_count": 1395,
                "character": "Judith",
                "credit_id": "5738e405c3a3686c900002dc",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Lucy Jane Robinson (born 1966) is a British actress working mostly in television.\n\nHer television roles include Louisa Hurst in Pride and Prejudice (1995), Robyn Duff in the fifth, sixth, seventh, eighth and ninth series of Cold Feet, Mayoress Christabel Wickham in the second series of The Thin Blue Line and Pam Draper in Suburban Shootout. She has also played Fran Clovis, secretary to the Duke of Manhattan, in the Doctor Who episode \"New Earth\" and Mrs. Elton in the 1996 TV adaptation of Emma. She also appeared in a single episode of The IT Crowd as a prospective employer to Jen. She had a role as Harriet Burgess in EastEnders, and appeared in a single episode of BBC TV children's series Powers. In 2006 she played the part of Louise Mallory in 'Expiation', the final episode of the first series of Lewis. She has also appeared in ITV drama William and Mary as Mrs Rick, alongside Martin Clunes and Julie Graham. She has more recently worked alongside Clunes in Doc Martin, in which she played cellist Holly.\n\nOn the big screen she played Janey in Bridget Jones: The Edge of Reason, and Judith in The Best Exotic Marigold Hotel. On stage, in 2014, she played the part of 'Liz', (the younger of two versions of Queen Elizabeth II) in the Moira Buffini play Handbagged. Robinson's roles as a voice actor include Lydia Gwilt in Wilkie Collins' Armadale.\n\nHer father was the journalist and presenter Robert Robinson. She is married to the actor Nicholas Murchie.",
        "birthday": "1966-09-07",
        "deathday": null,
        "gender": 1,
        "homepage": "https://qvoice.co.uk/voice-artists/index.php?profile=lucy-robinson",
        "id": 1224727,
        "imdb_id": "nm0732867",
        "known_for_department": "Acting",
        "name": "Lucy Robinson",
        "place_of_birth": "Lewisham, London, England, UK",
        "popularity": 0.1663,
        "profile_path": "/mVQ3G3uBKtu7wJZbYR41kZZUEID.jpg"
    }
}