{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wvBx1Q1FcQE1BPLfBbgA3y9aaS1.jpg",
                "genre_ids": [
                    27
                ],
                "id": 30497,
                "original_language": "en",
                "original_title": "The Texas Chain Saw Massacre",
                "overview": "Five friends head out to rural Texas to visit the grave of a grandfather. On the way they stumble across what appears to be a deserted house, only to discover something sinister within. Something armed with a chainsaw.",
                "popularity": 4.6125,
                "poster_path": "/mpgkRPH1GNkMCgdPk2OMyHzAks7.jpg",
                "release_date": "1974-10-11",
                "title": "The Texas Chain Saw Massacre",
                "video": false,
                "vote_average": 7.282,
                "vote_count": 3566,
                "character": "Pam",
                "credit_id": "52fe44209251416c91005c5f",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Born in Houston, Texas. After graduating from high school, Teri studied and worked at The Dallas Theatre Center, in Dallas, Texas. Moving to Austin, Texas, in 1971, the young actress attended the University of Texas and St. Edwards University. It was in Austin, where she was discovered by director Tobe Hooper and producer Kim Henkel, after seeing an article about her in the local newspaper. After auditioning, Teri was chosen for the part by Hooper and Henkel, and offered her the role of \"Pam\" in their film project, Massacre à la tronçonneuse (1974). It was a hot, grueling shoot, fraught with all the wrinkles low budget films incur, twice shutting down filming entirely. Simultaneously, Teri worked in local theater. After the film's 1974 release, she studied acting in Los Angeles and New York. Doors opened as a leg and foot model in commercials and print work, while continuing stage work.  - IMDb Mini Biography",
        "birthday": "1951-08-18",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 122457,
        "imdb_id": "nm0573374",
        "known_for_department": "Acting",
        "name": "Teri McMinn",
        "place_of_birth": "Houston, Texas, USA",
        "popularity": 0.1005,
        "profile_path": "/4XUT1qyy0jif14Mtn9Egx3nBFiT.jpg"
    }
}