{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/EcQKZcVYZ8EjK3eN1quPvkMrL9.jpg",
                "genre_ids": [
                    18,
                    36,
                    10752
                ],
                "id": 826,
                "original_language": "en",
                "original_title": "The Bridge on the River Kwai",
                "overview": "The classic story of English POWs in Burma forced to build a bridge to aid the war effort of their Japanese captors. British and American intelligence officers conspire to blow up the structure, but Col. Nicholson, the commander who supervised the bridge's construction, has acquired a sense of pride in his creation and tries to foil their plans.",
                "popularity": 4.3162,
                "poster_path": "/7paXMt2e3Tr5dLmEZOGgFEn2Vo7.jpg",
                "release_date": "1957-10-11",
                "title": "The Bridge on the River Kwai",
                "video": false,
                "vote_average": 7.818,
                "vote_count": 2229,
                "character": "Col. Saito",
                "credit_id": "52fe427dc3a36847f8022ab1",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "早川雪洲",
            "Kintarō Hayakawa",
            "早川 金太郎"
        ],
        "biography": "Sessue Hayakawa (June 10, 1889 – November 23, 1973) was a Japanese and American Issei (Japanese immigrant) actor who starred in American, Japanese, French, German, and British films. Hayakawa was the first and one of the few Asian actors to find stardom in the United States as well as Europe. Between the mid-1910s and the late 1920s, he was as well known as actors Charlie Chaplin and Douglas Fairbanks. He was one of the highest paid stars of his time; making $5,000 a week in 1915, and $2 million a year via his own production company during the 1920s. He starred in over 80 movies and has two films in the U.S. National Film Registry. His international stardom transitioned both silent films and talkies.\n\nOf his English-language films, Hayakawa is probably best known for his role as Colonel Saito in the film The Bridge on the River Kwai, for which he received a nomination for Academy Award Best Supporting Actor in 1957. He also appeared as the pirate leader in Disney's Swiss Family Robinson in 1960. In addition to his film acting career, Hayakawa was a theatre actor, film and theatre producer, film director, screenwriter, novelist, martial artist, and an ordained Zen master.   Description above from the Wikipedia article Sessue Hayakawa, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1889-06-10",
        "deathday": "1973-11-23",
        "gender": 2,
        "homepage": null,
        "id": 12249,
        "imdb_id": "nm0370564",
        "known_for_department": "Acting",
        "name": "Sessue Hayakawa",
        "place_of_birth": "Nanaura, Chiba, Japan",
        "popularity": 0.1568,
        "profile_path": "/juDoFtoIEMaKZMRL9Ipexkgqw81.jpg"
    }
}