{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bKzwMAh5MYOw8uH2SEPZgzUUjqy.jpg",
                "genre_ids": [
                    18
                ],
                "id": 38810,
                "original_language": "el",
                "original_title": "Κυνόδοντας",
                "overview": "Three teenagers are confined to an isolated country estate that could very well be on another planet. The trio spend their days listening to endless homemade tapes that teach them a whole new vocabulary. Any word that comes from beyond their family abode is instantly assigned a new meaning. Hence 'the sea' refers to a large armchair and 'zombies' are little yellow flowers. Having invented a brother whom they claim to have ostracized for his disobedience, the uber-controlling parents terrorize their offspring into submission.",
                "popularity": 5.1839,
                "poster_path": "/7nLuUGlH12cegPfR84QX4xIIH9k.jpg",
                "release_date": "2009-10-22",
                "title": "Dogtooth",
                "video": false,
                "vote_average": 7.059,
                "vote_count": 2475,
                "character": "Older Daughter",
                "credit_id": "52fe46e29251416c91062fc7",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/2wiMb1RBskEW9Uml5bGDEUHFbv8.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749
                ],
                "id": 254320,
                "original_language": "en",
                "original_title": "The Lobster",
                "overview": "In a dystopian near future, single people, according to the laws of The City, are taken to The Hotel, where they are obliged to find a romantic partner in forty-five days or are transformed into animals and sent off into The Woods.",
                "popularity": 5.0077,
                "poster_path": "/7Y9ILV1unpW9mLpGcqyGQU72LUy.jpg",
                "release_date": "2015-10-15",
                "title": "The Lobster",
                "video": false,
                "vote_average": 7.042,
                "vote_count": 6549,
                "character": "Heartless Woman",
                "credit_id": "5548de2892514155f400229d",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Aggeliki Papoulia"
        ],
        "biography": "Angeliki Papoulia was born in Athens, Greece. She graduated from Athens University (Theatre Studies) and the \"Empros\" Theatre Drama School in 2000. She speaks English and French. She has starred in the following films: Matchbox (Kiki) Dir. Yiannis Economides 2002. Dogtooth (Older daughter) Dir. Yorgos Lanthimos which won the \"Prix Un Certain Regard\" at the 2009 Cannes Film Festival and was nominated for an Academy Award (Best Foreign Language Film) at the 83rd Academy Awards in 2011. Alps (Nurse) Dir. Yorgos Lanthimos which won the Osella for Best Screenplay at the 68th Venice International Film Festival in 2011. A Blast (Maria) Dir. Syllas Tzoumerkas which had its premiere in Locarno Film Festival in 2014. The Lobster (Heartless Woman) Dir. Yorgos Lanthimos which won The Jury Prize at the 2015 Cannes Film Festival and was nominated for Best Original Screenplay at the 89th Academy Awards. The miracle of the Sargasso Sea (Elisabeth) Dir. Syllas Tzoumerkas which had its premiere at the Berlinale 2019 Film Festival. Amulet (woman) Dir. Romola Garai will have its premiere at Sundance Film Festival 2020. Green Sea (Anna) Dir. Angeliki Antoniou 2018. For her role in Dogtooth, she was awarded with Heart of Sarajevo for Best Actress at the Sarajevo Film Festival 2009. In 2004, she co-founded the blitz theatre group (www.theblitz.gr). She has written, directed and acted in all the group's performances until the most recent in 2017. The group has presented its performances in various important Festivals and Theatres in France (Festival d'Avignon, Theatre de la Ville, La Comedie de Reims), The Netherlands, Germany (Schaubuhne Theatre, Thalia Theatre), Italy, Belgium, Poland, Austria, Norway, Greece (Athens and Epidaurus Festival, Onassis Cultural Center), Turkey, Lebanon. Lately she has co-directed theatre performances at Luzerner Theater in Luzern / Switzerland with Christos Passalis. She has also appeared in performances directed by Michael Marmarinos, Lefteris Vogiatzis, as well as Greek National Theatre productions directed by Yorgos Houvardas and Yorgos Lanthimos.",
        "birthday": "1974-12-31",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 122426,
        "imdb_id": "nm1465326",
        "known_for_department": "Acting",
        "name": "Angeliki Papoulia",
        "place_of_birth": "Athens, Greece",
        "popularity": 1.9501,
        "profile_path": "/59vmhblokh20zXL19Velo0ri1jA.jpg"
    }
}