{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/EcQKZcVYZ8EjK3eN1quPvkMrL9.jpg",
                "genre_ids": [
                    18,
                    36,
                    10752
                ],
                "id": 826,
                "original_language": "en",
                "original_title": "The Bridge on the River Kwai",
                "overview": "The classic story of English POWs in Burma forced to build a bridge to aid the war effort of their Japanese captors. British and American intelligence officers conspire to blow up the structure, but Col. Nicholson, the commander who supervised the bridge's construction, has acquired a sense of pride in his creation and tries to foil their plans.",
                "popularity": 3.9469,
                "poster_path": "/7paXMt2e3Tr5dLmEZOGgFEn2Vo7.jpg",
                "release_date": "1957-10-11",
                "title": "The Bridge on the River Kwai",
                "video": false,
                "vote_average": 7.818,
                "vote_count": 2229,
                "character": "Lt. Joyce",
                "credit_id": "52fe427dc3a36847f8022ab9",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Geoffrey Horne is an American actor and acting teacher known for his work in both film and theatre. Born on August 22, 1933, in New York City, Horne grew up in a family of artists, with his mother being a ballet dancer and his father being a painter.\n\nHorne developed an interest in acting at a young age and began taking classes at the Neighborhood Playhouse School of the Theatre in New York City. He made his Broadway debut in 1952 in the play \"The Happiest Millionaire\" and soon after was discovered by director Elia Kazan, who cast him in the film \"The Bridge on the River Kwai\" (1957).\n\nHorne's performance in \"The Bridge on the River Kwai\" earned him critical acclaim and led to more film roles, including \"Bonjour Tristesse\" (1958) and \"Two Living, One Dead\" (1961). He also continued to work in theatre, appearing in productions of \"The Caretaker\" and \"A View from the Bridge,\" among others.\n\nIn the 1960s, Horne moved to Italy and began working in Italian cinema, appearing in films such as \"Il Posto\" (1961) and \"La lunga notte del '43\" (1960). He also studied with the legendary acting teacher Lee Strasberg and later became an acting teacher himself, founding the HB Studio in Rome.\n\nHorne continued to work in both film and theatre throughout his career, and in 2007 he was honored with a lifetime achievement award by the Rome Film Fest. Today, he lives in Italy and continues to teach acting.\n\nThe story of Geoffrey Horne is a testament to the power of following one's passions and pursuing a life in the arts. His dedication to his craft and his willingness to take risks and explore new opportunities have made him a beloved figure in the world of acting and a respected teacher of the craft.",
        "birthday": "1933-08-22",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 12251,
        "imdb_id": "nm0395012",
        "known_for_department": "Acting",
        "name": "Geoffrey Horne",
        "place_of_birth": "Buenos Aires, Argentina",
        "popularity": 0.5263,
        "profile_path": "/fhFnWrevffCyaOGUCTgdjVTY3ac.jpg"
    }
}