{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7Mnj6if9FUC7yTZaeAgoDNQnnwn.jpg",
                "genre_ids": [
                    18,
                    10752
                ],
                "id": 19067,
                "original_language": "en",
                "original_title": "The Duellists",
                "overview": "In 1800, as Napoleon Bonaparte rises to power in France, a rivalry erupts between Armand and Gabriel, two lieutenants in the French Army, over a perceived insult. For over a decade, they engage in a series of duels amidst larger conflicts, including the failed French invasion of Russia in 1812, and shifts in the political and social systems of Europe.",
                "popularity": 3.4843,
                "poster_path": "/s9sPhcfD4LtrIGwix11bKtl9VLR.jpg",
                "release_date": "1977-08-31",
                "title": "The Duellists",
                "video": false,
                "vote_average": 7.256,
                "vote_count": 584,
                "character": "Tall Second",
                "credit_id": "54d4bc359251417c2300a221",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Roger Middleton"
        ],
        "biography": "Maurice Colbourne (24 September 1939 – 4 August 1989) was a British stage and television actor who specialised in playing villains and hard men until 1985, when he took the key role of Tom Howard in the BBC Television serial, Howards' Way. Colbourne was born Roger Middleton but took his stage name after reading about the death of actor Maurice Colbourne who shared the same birthday as he did. Colbourne's biggest success in the 1970s was as the lead in the crime drama series Gangsters. In the 80s he starred in Johnny Jarvis and the acclaimed adaptation of John Wyndham's classic sci-fi novel, The Day of the Triffids. Staying with sci-fi, he had a recurring guest role in Doctor Who as the mercenary Lytton, playing opposite the fifth and sixth doctors (Peter Davison and Colin Baker) in adventures featuring the timelords deadliest foes; the Daleks and the Cybermen.  But it was the leading role in Howards' Way that he will perhaps best be remembered for. He played Tom Howard until 1989, when he died suddenly aged 49 from a heart attack. The show ended a year later.",
        "birthday": "1939-09-24",
        "deathday": "1989-08-04",
        "gender": 2,
        "homepage": null,
        "id": 1225040,
        "imdb_id": "nm0170324",
        "known_for_department": "Acting",
        "name": "Maurice Colbourne",
        "place_of_birth": "Sheffield, South Yorkshire, England, UK",
        "popularity": 0.1371,
        "profile_path": "/1agvdjSzvQPkHtD3DLS57IA7S1z.jpg"
    }
}