{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/92tb8mgjgL1S2KwrZezyPHPkQ3R.jpg",
                "genre_ids": [
                    12,
                    10751,
                    14
                ],
                "id": 13597,
                "original_language": "en",
                "original_title": "Labyrinth",
                "overview": "When Sarah is forced to babysit her half-brother Toby, she inadvertently summons the Goblin King who whisks Toby away to his castle at the center of a labyrinth. Sarah enters into a bargain with the Goblin King where she is given just thirteen hours to solve the labyrinth and rescue Toby, or else lose him forever.",
                "popularity": 5.6745,
                "poster_path": "/hbSdA1DmNA9IlfVoqJkIWYF2oYm.jpg",
                "release_date": "1986-06-27",
                "title": "Labyrinth",
                "video": false,
                "vote_average": 7.277,
                "vote_count": 2573,
                "character": "The Junk Lady (voice)",
                "credit_id": "5ba84960c3a3680e6103a743",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Denise Bryer (born 5 January 1928) is an English voice actress.\n\nBest remembered in her UK homeland for her work on the Gerry Anderson series, Terrahawks, where she voiced both the main villain Zelda and the heroic Capt. Mary Falconer, Bryer became well known in the United States when she voiced Billina in Disney's 1985 film Return to Oz, as well as The Junk Lady in the 1986 movie Labyrinth, and many other films. In addition to her work voice acting in film and television she also worked extensively on UK radio and children's recordings. She was the first wife of Nicholas Parsons.\n\nBryer first came to public attention when she voiced Twizzle in Gerry Anderson's The Adventures of Twizzle and would go on to voice in Anderson's later series Four Feather Falls as Ma Jones and Little Jake. She also voiced Kiki The Frog in Hector's House and Noddy on the eponymous television show. She dubbed the voice of Commander Makara in the Japanese puppet series Star Fleet around the same time as Terrahawks. In Big Finish's Doctor Who audio dramas The Reaping and The Gathering, she provided the voice of Dominique Van Gyseghem.\n\nFrom Wikipedia, the free encyclopedia",
        "birthday": "1928-01-05",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1225208,
        "imdb_id": "nm0117350",
        "known_for_department": "Acting",
        "name": "Denise Bryer",
        "place_of_birth": "Kensington, London, England, UK",
        "popularity": 0.1046,
        "profile_path": "/oNXh8dOvqxks7X851E2eKoCqWeX.jpg"
    }
}