{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/w2rWEjAMYErpNfoK2Z0GFh1LFhN.jpg",
                "genre_ids": [
                    80,
                    18,
                    53
                ],
                "id": 819,
                "original_language": "en",
                "original_title": "Sleepers",
                "overview": "Two gangsters seek revenge on the state jail worker who during their stay at a youth prison sexually abused them. A sensational court hearing takes place to charge him for the crimes.",
                "popularity": 4.044,
                "poster_path": "/yUpiEk2EojS9ZEXb3nIQonQCYYF.jpg",
                "release_date": "1996-10-18",
                "title": "Sleepers",
                "video": false,
                "vote_average": 7.602,
                "vote_count": 3677,
                "character": "King Benny",
                "credit_id": "52fe427bc3a36847f802228f",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/uUrV5KSjnZx47Dq7e6STr73iN4N.jpg",
                "genre_ids": [
                    18,
                    35,
                    12
                ],
                "id": 24188,
                "original_language": "it",
                "original_title": "Il sorpasso",
                "overview": "Roberto, a shy law student in Rome, meets Bruno, a forty-year-old exuberant, capricious man, who takes him for a drive through the Roman and Tuscany countries in the summer. When their journey starts to blend into their daily lives though, the pair’s newfound friendship is tested.",
                "popularity": 1.1728,
                "poster_path": "/4h1ckrJQVcQYjeOkqS8i9BqZ9MI.jpg",
                "release_date": "1962-12-05",
                "title": "Il Sorpasso",
                "video": false,
                "vote_average": 8.2,
                "vote_count": 805,
                "character": "Bruno Cortona",
                "credit_id": "52fe4489c3a368484e028533",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/ryoWP1kvNcwPif6uNbuZwQfrJPy.jpg",
                "genre_ids": [
                    35,
                    80
                ],
                "id": 24382,
                "original_language": "it",
                "original_title": "I soliti ignoti",
                "overview": "Best friends Peppe and Mario are thieves, but they're not very good at it. Still, Peppe thinks that he's finally devised a master heist that will make them rich. With the help of some fellow criminals, he plans to dig a tunnel from a rented apartment to the pawnshop next door, where they can rob the safe. But his plan is far from foolproof, and the fact that no one in the group has any experience digging tunnels proves to be the least of their problems.",
                "popularity": 1.6895,
                "poster_path": "/f5OxD8Nl0pR3DcYHtYhHRfpsmjl.jpg",
                "release_date": "1958-07-26",
                "title": "Big Deal on Madonna Street",
                "video": false,
                "vote_average": 8.099,
                "vote_count": 740,
                "character": "Peppe il pantera",
                "credit_id": "52fe4493c3a368484e02a8c9",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/2Kkqmy3EpXqBDqv1vvsNXX3pwww.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 42269,
                "original_language": "it",
                "original_title": "C'eravamo tanto amati",
                "overview": "Three partisans bound by a strong friendship return home after the war, but the clash with everyday reality puts a strain on their bond.",
                "popularity": 1.7523,
                "poster_path": "/zGGWYpiKNwjpKxelPxOMqJnUgDs.jpg",
                "release_date": "1974-12-21",
                "title": "We All Loved Each Other So Much",
                "video": false,
                "vote_average": 8.3,
                "vote_count": 619,
                "character": "Gianni Perego",
                "credit_id": "52fe45f8c3a36847f80e50a9",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Vittorio Gassmann ",
            "Витторио Гассман",
            "Вітторіо Ґассман",
            "Витторио Гасман"
        ],
        "biography": "Vittorio Gassman Knight Grand Cross OMRI (Italian pronunciation: [vitˈtɔːrjo ˈɡazman]; born Gassmann; 1 September 1922 – 29 June 2000), popularly known as Il Mattatore, was an Italian actor, director and screenwriter.\n\nHe is considered one of the greatest Italian actors, whose career includes both important productions as well as dozens of divertissements.\n\nGassman's debut was in Milan, in 1942, with Alda Borelli in Niccodemi's La Nemica (theatre). He then moved to Rome and acted at the Teatro Eliseo joining Tino Carraro and Ernesto Calindri in a team that remained famous for some time; with them he acted in a range of plays from bourgeois comedy to sophisticated intellectual theatre. In 1946, he made his film debut in Preludio d'amore, while only one year later he appeared in five films. In 1948 he played in Riso amaro.\n\nIt was with Luchino Visconti's company that Gassman achieved his mature successes, together with Paolo Stoppa, Rina Morelli and Paola Borboni. He played Stanley Kowalski in Tennessee Williams' Un tram che si chiama desiderio (A Streetcar Named Desire), as well as in Come vi piace (As You Like It) by Shakespeare and Oreste (by Vittorio Alfieri). He joined the Teatro Nazionale with Tommaso Salvini, Massimo Girotti, Arnoldo Foà to create a successful Peer Gynt (by Henrik Ibsen). With Luigi Squarzina in 1952 he co-founded and co-directed the Teatro d'Arte Italiano, producing the first complete version of Hamlet in Italy, followed by rare works such as Seneca's Thyestes and Aeschylus's The Persians.\n\nIn cinema, he worked frequently both in Italy and abroad. He met and fell in love with American actress Shelley Winters while she was touring Europe with fiancé Farley Granger. When Winters was forced to return to Hollywood to fulfill contractual obligations, he followed her there and married her. With his natural charisma and his fluency in English he scored a number of roles in Hollywood, including Rhapsody with Elizabeth Taylor and The Glass Wall before returning to Italy and the theatre.\n\nOn 29 June 2000, Gassman died of a heart attack in his sleep at his home in Rome at the age of 77. He was buried at Campo Verano.\n\nDescription above from the Wikipedia article Vittorio Gassman, licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": "1922-09-01",
        "deathday": "2000-06-29",
        "gender": 2,
        "homepage": null,
        "id": 12259,
        "imdb_id": "nm0002094",
        "known_for_department": "Acting",
        "name": "Vittorio Gassman",
        "place_of_birth": "Genoa, Liguria, Italy",
        "popularity": 0.5193,
        "profile_path": "/eIcPpL8OlAMlIr9ZMvFTY7ni7LX.jpg"
    }
}