{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/EcQKZcVYZ8EjK3eN1quPvkMrL9.jpg",
                "genre_ids": [
                    18,
                    36,
                    10752
                ],
                "id": 826,
                "original_language": "en",
                "original_title": "The Bridge on the River Kwai",
                "overview": "The classic story of English POWs in Burma forced to build a bridge to aid the war effort of their Japanese captors. British and American intelligence officers conspire to blow up the structure, but Col. Nicholson, the commander who supervised the bridge's construction, has acquired a sense of pride in his creation and tries to foil their plans.",
                "popularity": 4.3162,
                "poster_path": "/7paXMt2e3Tr5dLmEZOGgFEn2Vo7.jpg",
                "release_date": "1957-10-11",
                "title": "The Bridge on the River Kwai",
                "video": false,
                "vote_average": 7.818,
                "vote_count": 2229,
                "character": "Maj. Clipton",
                "credit_id": "52fe427dc3a36847f8022ab5",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/ih30cG9OGlJ7zyzhG3G5Bd3YGa9.jpg",
                "genre_ids": [
                    12,
                    18,
                    10752
                ],
                "id": 5925,
                "original_language": "en",
                "original_title": "The Great Escape",
                "overview": "The Nazis, exasperated at the number of escapes from their prison camps by a relatively small number of Allied prisoners, relocate them to a high-security 'escape-proof' camp to sit out the remainder of the war. Undaunted, the prisoners plan one of the most ambitious escape attempts of World War II. Based on a true story.",
                "popularity": 6.4156,
                "poster_path": "/gBH4H8UMFxl139HaLz6lRuvsel8.jpg",
                "release_date": "1963-07-03",
                "title": "The Great Escape",
                "video": false,
                "vote_average": 7.943,
                "vote_count": 2678,
                "character": "Ramsey 'The SBO'",
                "credit_id": "52fe442ec3a36847f80871b7",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Джеймс Дональд"
        ],
        "biography": "​From Wikipedia, the free encyclopedia\n\nJames Donald (18 May 1917 - 3 August 1993) was a Scottish actor. Tall and gaunt, he specialised in playing authority figures; military officers, doctors or scientists. Donald was born in Aberdeen, and made his first professional stage appearance sometime in the late-1930s, having been educated at Rossall School on Lancashire's Fylde coast. During World War II he appeared in minor roles in such propaganda classics as In Which We Serve (1942), Went the Day Well? (1942) and The Way Ahead (1944), and he played Mr. Winkle in the 1952 film version of The Pickwick Papers. However, leading roles eluded him until Lust for Life (1956), in which he played Theo Van Gogh. His work in the theatre included Noël Coward's Present Laughter (1943) which starred Coward himself, and The Eagle with Two Heads (1947), You Never Can Tell (1948), and The Heiress (1949) with Ralph Richardson, Peggy Ashcroft and Donald Sinden. He memorably portrayed Major Clipton, the doctor who expresses grave doubts about the sanity of Col. Nicholson's (Alec Guinness) efforts to build the bridge in order to show up his Japanese captors, in the film The Bridge on the River Kwai (1957). The final words are his: \"Madness!, Madness!\" He also played Group Captain Ramsey, the Senior British Officer in The Great Escape (1963), as well as supporting roles in other notable films both in Britain and the United States, including The Vikings (1958), King Rat (1965), Cast a Giant Shadow (1966), and Quatermass and the Pit (1967). Donald starred in a 1960 television adaptation of A. J. Cronin's The Citadel and appeared regularly in many other television dramas in the UK and USA, as well as on stage. In 1961, he played Prince Albert opposite Julie Harris's Queen Victoria, in the Hallmark Hall of Fame production of Laurence Housman's play Victoria Regina.\n\nDescription above from the Wikipedia article James Donald, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1917-05-18",
        "deathday": "1993-08-03",
        "gender": 2,
        "homepage": null,
        "id": 12250,
        "imdb_id": "nm0232019",
        "known_for_department": "Acting",
        "name": "James Donald",
        "place_of_birth": "Aberdeen, Aberdeenshire, Scotland, UK",
        "popularity": 0.3314,
        "profile_path": "/c1Uc1I8jRw1tdJk1gRG49XY5xKF.jpg"
    }
}