{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mGr18hk6oDQyGjaSpbF7o5epoJV.jpg",
                "genre_ids": [
                    28,
                    16,
                    878
                ],
                "id": 39104,
                "original_language": "ja",
                "original_title": "ドラゴンボールＺ 極限バトル！三大超サイヤ人",
                "overview": "Dr. Gero's Androids #13, #14, and #15 are awakened by the laboratory computers and immediately head to the mall where Goku is shopping. After Goku, Trunks, and Vegeta defeat #14 and #15, #13 absorbs their inner computers and becomes a super being greater than the original three separately were. Now it is up to Goku to stop him.",
                "popularity": 5.3782,
                "poster_path": "/pIwjWaEuCcT3QVBd9Ng9wG3kbpU.jpg",
                "release_date": "1992-07-11",
                "title": "Dragon Ball Z: Super Android 13!",
                "video": false,
                "vote_average": 6.905,
                "vote_count": 584,
                "character": "Dr. Gero (voice)",
                "credit_id": "52fe46f99251416c91066095",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Kôji Yada ",
            "矢田 耕司",
            "Kouji Yada"
        ],
        "biography": "Koji Yada (矢田 耕司) was a renowned Japanese voice actor, celebrated for his extensive work in anime, video games, and dubbing. He was born on April 15, 1933, in Tokyo, Japan, and passed away on May 1, 2014. Yada was affiliated with the voice talent agency Haikyo (Tokyo Actor's Consumer's Cooperative Society) during his career.\n\nCareer Highlights\n\nKoji Yada was best known for his unique voice, often used to portray villainous, eccentric, or mysterious characters in various iconic anime series and films. His career spanned several decades, and he became a well-known name in the industry.\n\nNotable Roles\n\nSome of his most memorable roles include:\n\nDr. Gero (Dragon Ball Z): The sinister scientist and creator of the Androids and Cell, Yada's voice perfectly captured the calculating and vengeful nature of the character.\n\nNezumi Otoko (GeGeGe no Kitaro): A recurring character in this classic supernatural anime series, often portrayed as sly and mischievous.\n\nPaptimus Scirocco (Mobile Suit Zeta Gundam): The ambitious and manipulative antagonist of the series, a role that showcased Yada's versatility in playing complex villains.\n\nKing Bradley (Fullmetal Alchemist, 2003 version): Voicing the original King Bradley in the earlier adaptation of the series.\n\nLegacy\n\nKoji Yada’s distinct voice and ability to bring depth to his characters left a significant impact on the anime industry. Even after his passing, his roles remain cherished by fans around the world. His work continues to inspire both audiences and aspiring voice actors.",
        "birthday": "1933-04-15",
        "deathday": "2014-05-01",
        "gender": 2,
        "homepage": "https://www.aoni.co.jp/search/yada-koji.html",
        "id": 122656,
        "imdb_id": "nm0946692",
        "known_for_department": "Acting",
        "name": "Koji Yada",
        "place_of_birth": "Tokyo, Japan",
        "popularity": 0.8025,
        "profile_path": "/oR0vyZHFBYPMsYebb0Lk8FKc9lU.jpg"
    }
}