{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2cBCFvMDLZowXKvMaCGot5dmHUz.jpg",
                "genre_ids": [
                    99,
                    80,
                    36
                ],
                "id": 22074,
                "original_language": "en",
                "original_title": "Capitalism: A Love Story",
                "overview": "Michael Moore comes home to the issue he's been examining throughout his career: the disastrous impact of corporate dominance on the everyday lives of Americans (and by default, the rest of the world).",
                "popularity": 2.9629,
                "poster_path": "/zJBkIPakBXdu3cEgGqKCPHUNXVE.jpg",
                "release_date": "2009-09-06",
                "title": "Capitalism: A Love Story",
                "video": false,
                "vote_average": 7.091,
                "vote_count": 545,
                "character": "Self (archive footage)",
                "credit_id": "64fa823b43494f08c6eefee3",
                "order": 24
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Christopher John Dodd (born May 27, 1944) is an American lobbyist, lawyer, and Democratic Party politician who served as a United States senator from Connecticut from 1981 to 2011. Dodd is the longest-serving senator in Connecticut's history. He served in the United States House of Representatives from 1975 to 1981.\n\nDodd is a Connecticut native and a graduate of Georgetown Preparatory School in Bethesda, Maryland, and Providence College. His father, Thomas J. Dodd, was also a United States Senator from 1959 to 1971. Chris Dodd served in the Peace Corps for two years prior to entering the University of Louisville School of Law, and during law school concurrently served in the United States Army Reserve.\n\nDodd returned to Connecticut, winning election in 1974 to the U.S. House of Representatives from Connecticut's 2nd congressional district and was reelected in 1976 and 1978. He was elected to the United States Senate in 1980. Dodd served as general chairman of the Democratic National Committee from 1995 to 1997. He served as Chairman of the Senate Banking Committee from 2007 until his retirement from politics. In 2006, Dodd decided to run for the Democratic nomination for President of the United States, but eventually withdrew after running behind several other competitors.\n\nIn January 2010, Dodd announced that he would not run for re-election. Dodd was succeeded by fellow Democrat Richard Blumenthal. Dodd then served as chairman and chief lobbyist for the Motion Picture Association of America (MPAA) from 2011 to 2017. In 2018, Dodd returned to the practice of law, joining the firm Arnold & Porter. In addition to being a member of the ReFormers Caucus of Issue One, Dodd is a close advisor to President Joe Biden and served on his vice presidential selection committee.",
        "birthday": "1944-05-27",
        "deathday": null,
        "gender": 2,
        "homepage": "http://chrisdodd.com",
        "id": 1226886,
        "imdb_id": "nm0230067",
        "known_for_department": "Acting",
        "name": "Chris Dodd",
        "place_of_birth": "Willimantic, Connecticut, USA",
        "popularity": 0.0453,
        "profile_path": "/it0DYKvtX58PS9IcMlCArHfrSzp.jpg"
    }
}