{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rcEUuRtr0dFL078bNeXL8pQqrMK.jpg",
                "genre_ids": [
                    53,
                    9648
                ],
                "id": 827,
                "original_language": "fr",
                "original_title": "Les Diaboliques",
                "overview": "The cruel and abusive headmaster of a boarding school, Michel Delassalle, is murdered by an unlikely duo -- his meek wife and the mistress he brazenly flaunts. The women become increasingly unhinged by a series of odd occurrences after Delassalle's corpse mysteriously disappears.",
                "popularity": 1.5504,
                "poster_path": "/jE8ygUYBUGyUcM4sR6iinPqYeDK.jpg",
                "release_date": "1955-01-29",
                "title": "Diabolique",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 1029,
                "character": "Mr. Raymond",
                "credit_id": "52fe427dc3a36847f8022b7b",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/5ChBhGXIX7RgOMSjIlXgBp6UjMf.jpg",
                "genre_ids": [
                    18,
                    10752,
                    10749,
                    36
                ],
                "id": 11661,
                "original_language": "fr",
                "original_title": "Joyeux Noël",
                "overview": "France, 1914, during World War I. On Christmas Eve, an extraordinary event takes place in the bloody no man's land that the French and the Scots dispute with the Germans…",
                "popularity": 4.1381,
                "poster_path": "/9Ka8lKCIiWjnZiMslPQeakS5UhW.jpg",
                "release_date": "2005-11-09",
                "title": "Joyeux Noel",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 886,
                "character": "The Castle Keeper",
                "credit_id": "5e087cb39bcd0f0017142ed5",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Michel Lucien Serrault",
            "Мишель Серро"
        ],
        "biography": "Michel Serrault (24 January 1928 – 29 July 2007) was a French stage and film actor who appeared from 1954 until 2007 in more than 130 films.\n\nHis first professional job was in a touring production in Germany of Molière's Les Fourberies de Scapin.\n\nIn 1948, he began his career in the theatre with Robert Dhéry in Les Branquignols. His first film was Ah! Les belles bacchantes, starring Robert Dhéry, Colette Brosset (Dhéry's then-wife), and Louis de Funès; directed by Jean Loubignac in 1954. Serrault played in the 1955 suspense thriller Les diaboliques, starring Simone Signoret and directed by Henri-Georges Clouzot.\n\nFrom February 1973 through 1978, he portrayed the role of Albin/Zaza opposite Jean Poiret in the play La cage aux folles, written by Poiret. He recreated the role for the film version of the play, which was released in 1978. In 1977-1978 he played the composer Jacques Offenbach in a six-part series of one-hour episodes about the musician's life, each one focusing on a specific aspect or work.\n\nSerrault died from relapsing polychondritis at his home in Équemauville on 29 July 2007 at age 79. He was buried in Sainte-Catherine's cemetery in Honfleur and was transferred in 2009 to the cemetery of Neuilly-sur-Seine near his wife Juanita Saint-Peyron and daughter Caroline, who died in 1977. He had another daughter, actress Nathalie Serrault.\n\nSource: Article \"Michel Serrault\" from Wikipedia in English, licensed under CC-BY-SA.",
        "birthday": "1928-01-24",
        "deathday": "2007-07-29",
        "gender": 2,
        "homepage": null,
        "id": 12270,
        "imdb_id": "nm0785664",
        "known_for_department": "Acting",
        "name": "Michel Serrault",
        "place_of_birth": "Brunoy, Essonne, France",
        "popularity": 0.3481,
        "profile_path": "/aaSFvOVwf5tQObbRfdh2mmJuFLQ.jpg"
    }
}