{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/r2IOBOeg5wLfLtyOnT5Pur6Tl4q.jpg",
                "genre_ids": [
                    12,
                    28,
                    878
                ],
                "id": 1892,
                "original_language": "en",
                "original_title": "Return of the Jedi",
                "overview": "Luke Skywalker leads a mission to rescue his friend Han Solo from the clutches of Jabba the Hutt, while the Emperor seeks to destroy the Rebellion once and for all with a second dreaded Death Star.",
                "popularity": 8.3835,
                "poster_path": "/jQYlydvHm3kUix1f8prMucrplhm.jpg",
                "release_date": "1983-05-25",
                "title": "Return of the Jedi",
                "video": false,
                "vote_average": 7.905,
                "vote_count": 16311,
                "character": "Geezum - Member of Jabba's Gang (uncredited)",
                "credit_id": "5ec53fb4ae2811002039ebc6",
                "order": 122
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Peter Richard Woolnough"
        ],
        "biography": "Peter Allen (born Peter Richard Woolnough; 10 February 1944 – 18 June 1992) was an Australian singer-songwriter, musician and entertainer, known for his flamboyant stage persona, boundless energy, and lavish costumes. His songs were made popular by many recording artists, including Elkie Brooks, Melissa Manchester and Olivia Newton-John, including Newton-John's first chart topping hit \"I Honestly Love You\", and the chart topping and Academy Award winning \"Arthur's Theme (Best That You Can Do)\" by Christopher Cross. In addition to recording many albums, he enjoyed a cabaret and concert career, including appearances at the Radio City Music Hall riding a camel. His patriotic song \"I Still Call Australia Home\", has been used extensively in advertising campaigns, and was added to the National Film and Sound Archive's Sounds of Australia registry in 2013.\n\nAllen was the first husband of Liza Minnelli. They married on 3 March 1967, separated on 9 April 1970, and were divorced on 24 July 1974. He had a long-term partner, model Gregory Connell (1949–1984). They were together from 1974 until Connell's death in 1984. Allen and Connell died from AIDS-related illnesses eight years apart, with Allen becoming one of the first well-known Australians to die from AIDS. Allen remained ambiguous about his sexuality in that he did not pretend to be straight after divorcing Minnelli, but never publicly came out as gay either. He explained, \"I was as out as a not-out celebrity could be then.\" Despite Allen's outgoing persona, he was an intensely private man who shared little about his personal life even with those close to him. Few people knew he had HIV/AIDS, partly in fear of alienating his conservative, heterosexual fans and thinking audiences would not want to see a performer they knew was sick.\n\nDescription above from the Wikipedia article Peter Allen, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1944-02-10",
        "deathday": "1992-06-18",
        "gender": 2,
        "homepage": null,
        "id": 1227911,
        "imdb_id": "nm0020899",
        "known_for_department": "Acting",
        "name": "Peter Allen",
        "place_of_birth": "Tenterfield, New South Wales, Australia",
        "popularity": 0.0546,
        "profile_path": "/tN2G5sPmPzMKZZypwwbr90yeZyT.jpg"
    }
}