{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rcEUuRtr0dFL078bNeXL8pQqrMK.jpg",
                "genre_ids": [
                    53,
                    9648
                ],
                "id": 827,
                "original_language": "fr",
                "original_title": "Les Diaboliques",
                "overview": "The cruel and abusive headmaster of a boarding school, Michel Delassalle, is murdered by an unlikely duo -- his meek wife and the mistress he brazenly flaunts. The women become increasingly unhinged by a series of odd occurrences after Delassalle's corpse mysteriously disappears.",
                "popularity": 1.5504,
                "poster_path": "/jE8ygUYBUGyUcM4sR6iinPqYeDK.jpg",
                "release_date": "1955-01-29",
                "title": "Diabolique",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 1029,
                "character": "Mrs. Herboux",
                "credit_id": "52fe427dc3a36847f8022b7f",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Therèse Dorny",
            "Thérèse Jeanne Longo-Dorni "
        ],
        "biography": "Thérèse Dorny (born Thérèse Jeanne Longo-Dorni; 18 September 1891 - 14 March 1976) was a French film and stage actress.\n\nThérèse Jeanne Longo-Dorni was born on 18 September 1891 in Paris, Île-de-France, France, the only child to Gaudence Jean Baptiste Marie Longo-Dorni (born 1859) and Marie Antonia Longo-Dorni (née Junghaans, born 1865).\n\nShe began her career as a stage actress in 1913, and made her debut as a film actress in the 1930 film The Sweetness of Loving. She was best known for her roles in Cognasse (1932) and Les Diaboliques (1955).\n\nDorny married the French painter and graphic artist André Dunoyer de Segonzac on 19 December 1964 in Viroflay, Île-de-France, France, who she remained with until his death in 1974.\n\nDorny died on 14 March 1976 in Saint-Tropez, Var, France.\n\nSource: Article \"Thérèse Dorny\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1891-09-18",
        "deathday": "1976-03-14",
        "gender": 1,
        "homepage": null,
        "id": 12271,
        "imdb_id": "nm0233937",
        "known_for_department": "Acting",
        "name": "Thérèse Dorny",
        "place_of_birth": "Paris, France",
        "popularity": 0.0338,
        "profile_path": "/uLMBZRnz1bnPQ3H1susmMwug0L2.jpg"
    }
}