{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/pxkQAIhC7LXN5s5B23lnvCMgva5.jpg",
                "genre_ids": [
                    80,
                    18,
                    10749
                ],
                "id": 654,
                "original_language": "en",
                "original_title": "On the Waterfront",
                "overview": "A prizefighter-turned-longshoreman with a conscience goes up against labor leaders to expose corruption, extortion, and murder among the union ranks.",
                "popularity": 5.1767,
                "poster_path": "/fKjLZy9W8VxMOp5OoyWojmLVCQw.jpg",
                "release_date": "1954-06-22",
                "title": "On the Waterfront",
                "video": false,
                "vote_average": 7.882,
                "vote_count": 1669,
                "character": "Longshoreman's Mother (uncredited)",
                "credit_id": "640202b9699fb7008f9cda48",
                "order": 22
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Scottie MacGregor"
        ],
        "biography": "Katherine \"Scottie\" MacGregor (born Dorlee Deane McGregor; January 12, 1925 – November 14, 2018) was an American actress, best known for her role as Harriet Oleson in Little House on the Prairie.\n\nKatherine MacGregor was born Dorlee Deane McGregor on January 12, 1925, in Glendale, California, to Ralph S. McGregor and Beatrice E. Willard. When Katherine was a child, her mother Beatrice moved the family to Fort Collins, Colorado, where they lived most of Katherine's early life. She graduated from Northwestern University with a major in drama and moved to New York City in 1949. She was hired by the Arthur Murray Dance Studios as a dance instructor. She studied acting under N. Richard Nash, Sanford Meisner, and Stella Adler. She did summer stock in Lebanon, Pennsylvania as Dorlee Deane McGregor but switched to using the stage name Scottie MacGregor as her acting career advanced. When she adopted the use of Katherine as her given name is unclear but she switched from using ‘Scottie’ as she matured in age on the advice of her manager.\n\nBeginning in the 1950s, as Scottie MacGregor, she worked in theatre on and off Broadway in New York City and other locations in plays such as The Seven Year Itch and Handful of Fire, and won such uncredited parts as \"a longshoreman's mother\" (On the Waterfront); \"Alice Thorn\" (The Traveling Executioner), and \"Miss Boswell\" (The Student Nurses). She appeared in numerous episodes of various television series: Love of Life (1956), The Secret Storm, The Nurses, Play of the Week (1959), East Side/West Side (1963), Mannix (1970–71), Emergency! (1972), Ironside (1972, 1974), and All in the Family (1973), as well as the two 1981 \"Heroes vs. Villains\" episodes of Family Feud hosted by Richard Dawson. She had roles in the TV movies, The Death of Me Yet (1971), The Girls of Huntington House (1973), and Tell Me Where It Hurts (1974).\n\nMacGregor's best-known role was from 1974 to 1983 in NBC's Little House on the Prairie as Harriet Oleson, the general store owner's wife and a comedic part. MacGregor's favorite description of her character in Little House came in a fan letter from Minnesota in the 1970s, in which Mrs. Oleson was described as \"the touch of pepper in the sweetness of the show\". In 1979, due to the popularity of Little House in Spain, MacGregor was invited to Madrid, Spain, and appeared on RTVE's 625 Lineas and Ding Dong La Cocina programs.\n\nAfter Little House on the Prairie, she withdrew from screen productions in favor of local theater. She dedicated herself to the Hindu religion, and to teaching acting to children at the Wee Hollywood Vedanta Players, before finally retiring in the early 2000s. In 2014, she did an in-depth interview about her life and career for the book Prairie Memories by Patrick Loubatiere.\n\nShe was married to actor Bert Remsen from 1949 to 1950 and to actor, director, and teacher Edward G. Kaye-Martin, 14 years her junior, from August 1969 to October 1970. She had no children.\n\nWhile recovering from alcoholism, MacGregor converted to Hinduism. She was unable to appear in the series finale of Little House on the Prairie, because she was on a pilgrimage to India at the time of the episode's filming.\n\nMacGregor died on November 14, 2018, at the age of 93, at the Motion Picture & Television Country House and Hospital in Woodland Hills, California. No cause was given.",
        "birthday": "1925-01-12",
        "deathday": "2018-11-13",
        "gender": 1,
        "homepage": null,
        "id": 1227199,
        "imdb_id": "nm0532339",
        "known_for_department": "Acting",
        "name": "Katherine MacGregor",
        "place_of_birth": "Glendale, California, USA",
        "popularity": 0.2252,
        "profile_path": "/gR1W13KRLkyzP7Kd776lo599na5.jpg"
    }
}