{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qwZRvb0DJ5IwDoRuKDRCBuHWzkw.jpg",
                "genre_ids": [
                    878,
                    53,
                    18
                ],
                "id": 828,
                "original_language": "en",
                "original_title": "The Day the Earth Stood Still",
                "overview": "An alien and a robot land on Earth after World War II and tell mankind to be peaceful or face destruction.",
                "popularity": 2.0036,
                "poster_path": "/eslDNzf0LF1m9GsgUXlmyfTcC6Y.jpg",
                "release_date": "1951-09-28",
                "title": "The Day the Earth Stood Still",
                "video": false,
                "vote_average": 7.448,
                "vote_count": 1169,
                "character": "Klaatu, alias Mr. Carpenter",
                "credit_id": "52fe427dc3a36847f8022c0f",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Eric Alexander Rennie"
        ],
        "biography": "Michael Rennie (born August 1909 – June 10, 1971) was an English actor best known for his role as Klaatu in the science fiction classic The Day the Earth Stood Still (1951). He enjoyed a successful career spanning film, television, and theater, gaining fame for his dignified and often authoritative roles.\n\nMichael Rennie was born Eric Alexander Rennie in Ilford, Essex, England. His early interest in acting led him to the Royal Academy of Dramatic Art (RADA), where he trained and developed his skills as a performer. He worked initially in British theater before transitioning to film.\n\nRennie’s early career included several roles in British films, but it was his move to Hollywood in the 1940s that helped him gain more widespread recognition. He appeared in a series of films, often portraying dignified or authoritative characters, with his tall stature, smooth voice, and good looks making him a natural fit for leading roles.\n\nHis breakthrough came with the science fiction film The Day the Earth Stood Still (1951), where he portrayed the alien visitor Klaatu. The film is considered one of the most influential sci-fi movies of all time, and Rennie’s portrayal of the calm and rational Klaatu became iconic. The film's message of peace, tolerance, and warning against militarism resonated with audiences, and Rennie’s performance as the alien ambassador remains one of his most famous and enduring roles.\n\nFollowing The Day the Earth Stood Still, Rennie continued to appear in a variety of films, often in roles of authority or leadership. Some notable films he starred in include The Lost World (1960), The 27th Day (1957), and Journey to the Center of the Earth (1959), where he appeared alongside actors like James Mason and Pat Boone.\n\nRennie also appeared in numerous television series, including The Twilight Zone, The Outer Limits, and The Invaders. In the 1960s, he had roles in various TV shows, further establishing his presence in the science fiction and adventure genres.\n\nRennie was married twice. His first marriage was to actress Dorothy Dandridge in 1959, but they eventually divorced. Later, he married Shirley Sutherland, with whom he remained until his death.\n\nDespite his fame, Rennie led a relatively private life and was known to be a gentleman both on and off screen. He had a reputation for being reserved and professional, a trait that made him well-suited to the types of roles he was often cast in.\n\nMichael Rennie passed away on June 10, 1971, at the age of 61, from a heart attack while vacationing in Spain. His death marked the end of a distinguished career in film and television.\n\nRennie’s most enduring legacy is his portrayal of Klaatu in The Day the Earth Stood Still, which remains a staple of science fiction cinema. His calm, authoritative presence in the film and his portrayal of an alien visitor with a message of peace continue to resonate with audiences and are considered a high point in 1950s science fiction. Throughout his career, he brought dignity and depth to the roles he played, earning him a place in cinematic history, particularly within the science fiction genre.",
        "birthday": "1909-08-25",
        "deathday": "1971-06-10",
        "gender": 2,
        "homepage": null,
        "id": 12282,
        "imdb_id": "nm0719692",
        "known_for_department": "Acting",
        "name": "Michael Rennie",
        "place_of_birth": "Bradford, Yorkshire, England",
        "popularity": 0.4835,
        "profile_path": "/gDEqpcYQDuKp35AF0ZrEfNwEujV.jpg"
    }
}