{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qwZRvb0DJ5IwDoRuKDRCBuHWzkw.jpg",
                "genre_ids": [
                    878,
                    53,
                    18
                ],
                "id": 828,
                "original_language": "en",
                "original_title": "The Day the Earth Stood Still",
                "overview": "An alien and a robot land on Earth after World War II and tell mankind to be peaceful or face destruction.",
                "popularity": 2.0036,
                "poster_path": "/eslDNzf0LF1m9GsgUXlmyfTcC6Y.jpg",
                "release_date": "1951-09-28",
                "title": "The Day the Earth Stood Still",
                "video": false,
                "vote_average": 7.448,
                "vote_count": 1169,
                "character": "Mrs. Barley, boarder",
                "credit_id": "52fe427dc3a36847f8022c23",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Frances Elizabeth Bavier"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nFrances Elizabeth Bavier (December 14, 1902 – December 6, 1989) was an American stage and television actress. Originally from New York theatre, Bavier worked in film and television from the 1950s. She is best known for her role of Aunt Bee on The Andy Griffith Show and Mayberry R.F.D. from 1960–70. Aunt Bee logged more Mayberry years (ten) than any other character. She won an Emmy Award for Outstanding Supporting Comedy Actress for the role in 1967.\n\nBavier had roles in more than a dozen films, as well as playing a range of supporting roles on television. Career highlights include her turn as Mrs. Barley in the classic 1951 film The Day the Earth Stood Still. In 1955, she played the rough and tough \"Aunt Maggie\" Sawtelle, a frontier Ma Barker-type character, in the Lone Ranger episode \"Sawtelle's Saga End\". In the episode, she fights with Tonto while the Lone Ranger battles with her nephew. At the conclusion, Tonto says that he would like to trade opponents next time. In 1957, she played Nora Martin, mother to Eve Arden's character on The Eve Arden Show, despite the fact that Arden was only 6 or 7 years younger than Bavier. That same year, Bavier guest-starred in the eighth episode of Perry Mason as Louise Marlow in \"The Case of the Crimson Kiss\".\n\nShe was in an episode of Make Room for Daddy, which featured Andy Griffith as Andy Taylor and Ron Howard as Opie Taylor. She played a character named Henrietta Perkins. The episode led to The Andy Griffith Show, and Bavier was cast in the new role of Aunt Bee. Bavier had a love-hate relationship with her famous role during the run of the show. As a New York City actress, she felt her dramatic talents were being overlooked, yet after playing Bee for eight seasons, she was the only original cast member to remain with the series in the spin-off, Mayberry R.F.D., for two additional seasons.",
        "birthday": "1902-12-14",
        "deathday": "1989-12-06",
        "gender": 1,
        "homepage": null,
        "id": 12283,
        "imdb_id": "nm0062592",
        "known_for_department": "Acting",
        "name": "Frances Bavier",
        "place_of_birth": "Manhattan, New York, USA",
        "popularity": 0.7714,
        "profile_path": "/63YVmylTMJkLsDUvbsJdE58sGcD.jpg"
    }
}