{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/12fvZHskx57kQfNEUXJ3v0flWYQ.jpg",
                "genre_ids": [
                    12,
                    28
                ],
                "id": 89,
                "original_language": "en",
                "original_title": "Indiana Jones and the Last Crusade",
                "overview": "In 1938, an art collector appeals to eminent archaeologist Dr. Indiana Jones to embark on a search for the Holy Grail. Indy learns that a medieval historian has vanished while searching for it, and the missing man is his own father, Dr. Henry Jones Sr.. He sets out to rescue his father by following clues in the old man's notebook, which his father had mailed to him before he went missing. Indy arrives in Venice, where he enlists the help of a beautiful academic, Dr. Elsa Schneider, along with Marcus Brody and Sallah. Together they must stop the Nazis from recovering the power of eternal life and taking over the world!",
                "popularity": 7.0651,
                "poster_path": "/sizg1AU8f8JDZX4QIgE4pjUMBvx.jpg",
                "release_date": "1989-05-24",
                "title": "Indiana Jones and the Last Crusade",
                "video": false,
                "vote_average": 7.847,
                "vote_count": 10606,
                "character": "Henchman (uncredited)",
                "credit_id": "64009e569653f600894f1505",
                "order": 48
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Graham Cole OBE (born Graham Coleman-Smith on 16 March 1952) is an English actor. Cole was born in Willesden, Middlesex in 1952 to Victor and Freda Coleman-Smith (née Coleman), the youngest of three children.\n\nHe appeared in numerous episodes of Doctor Who in the early 1980s, often in uncredited roles, such as Marshman and then a Cyberman in Earthshock. He has also played Melkur in The Keeper of Traken and finally a Jacondan in The Twin Dilemma. He also made a guest appearance in the final series of Sooty and Co as a detective called Maurice and in Only Fools and Horses as a Spanish customs official. His first film appearance was in the James Bond film The Living Daylights in 1987. Cole then appeared in Indiana Jones and the Last Crusade as one of Walter Donovan's henchmen, who escort Indiana Jones to their boss's New York apartment.\n\nHe is best known as PC Tony Stamp in the ITV police drama The Bill, a role he played initially as a recurring character from 1984, and then as a regular from 1988 until 2009. Cole appeared in more episodes of the programme than any other actor, appearing in 1,202 episodes. He had previously spent 12 years in Repertory Theatre, and musicals.\n\nHe presented and narrated the police video programme Police Stop!. He appeared regularly on Noel's House Party in sketches with Andrew Paul. Cole has also made a guest appearance in ITV series Law & Order: UK as a barman in one episode.\n\nCole in costume after appearing in a pantomime in Lichfield in 2015\n\nIn his early career in the late 1970s Cole appeared as the Emperor of China in a season of Aladdin at the Grand Theatre in Swansea. Other pantomime appearances have included the role of \"Beast\" in Beauty & The Beast at the Woodville Halls in Gravesend, Kent. He played Scrooge at Garrick Theatre, Lichfield in 2012 and Abanazer for Theater Royal, Norwich, 2013–2014. He played General Waverley in Irving Berlin's White Christmas at The Festival Theatre, Edinburgh. He later returned to the role at The Dominion Theatre, London.\n\nCole starred in the gangster-horror film Evil Never Dies in 2014, as DI David Bracken, a film that also starred Katy Manning, P.H. Moriarty and former The Bill colleague Tony Scannell. Cole made appearances in Doctors (2015) and Holby City (2018), before starring in the romantic-drama film 23 Walks in 2020 with Alison Steadman.",
        "birthday": "1952-03-16",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1229007,
        "imdb_id": "nm0170559",
        "known_for_department": "Acting",
        "name": "Graham Cole",
        "place_of_birth": "Willesden, Middlesex, England, UK",
        "popularity": 0.0586,
        "profile_path": "/faoDdo4qnmsCRiAIfQFhQdxd3Is.jpg"
    }
}