{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sj5R5SGor3YMFBuabMj8gPbyBmh.jpg",
                "genre_ids": [
                    12,
                    18,
                    37
                ],
                "id": 3090,
                "original_language": "en",
                "original_title": "The Treasure of the Sierra Madre",
                "overview": "Two jobless Americans convince a prospector to travel to the mountains of Mexico with them in search of gold. But the hostile wilderness, local bandits, and greed all get in the way of their journey.",
                "popularity": 2.4311,
                "poster_path": "/pWcst7zVbi8Z8W6GFrdNE7HHRxL.jpg",
                "release_date": "1948-01-15",
                "title": "The Treasure of the Sierra Madre",
                "video": false,
                "vote_average": 8.0,
                "vote_count": 1264,
                "character": "Indian Guide at Pier (uncredited)",
                "credit_id": "545f2185c3a3685362007f90",
                "order": 18
            },
            {
                "adult": false,
                "backdrop_path": "/i7n9u1SppzXcSO2EVgwEehzABzm.jpg",
                "genre_ids": [
                    37
                ],
                "id": 17529,
                "original_language": "en",
                "original_title": "True Grit",
                "overview": "The murder of her father sends a teenage tomboy on a mission of 'justice', which involves avenging her father's death. She recruits a tough old marshal, 'Rooster' Cogburn because he has 'true grit', and a reputation of getting the job done.",
                "popularity": 4.1273,
                "poster_path": "/9TjGjAD2deCtIG4ebi8LhIyFK6j.jpg",
                "release_date": "1969-06-11",
                "title": "True Grit",
                "video": false,
                "vote_average": 7.331,
                "vote_count": 818,
                "character": "Condemned Man at Hanging (uncredited)",
                "credit_id": "633710190d11f2007f50be13",
                "order": 41
            },
            {
                "adult": false,
                "backdrop_path": "/m2SXRnAd0d5N6qH2cbgluRgMX4z.jpg",
                "genre_ids": [
                    80,
                    53
                ],
                "id": 11016,
                "original_language": "en",
                "original_title": "Key Largo",
                "overview": "A hurricane swells outside, but it's nothing compared to the storm within the hotel at Key Largo. There, sadistic mobster Johnny Rocco holes up - and holds at gunpoint hotel owner James Temple, his widowed daughter-in-law Nora, and ex-GI Frank McCloud.",
                "popularity": 4.4886,
                "poster_path": "/rySfmQQZhS7RswOiJcJrww6FcHy.jpg",
                "release_date": "1948-07-16",
                "title": "Key Largo",
                "video": false,
                "vote_average": 7.459,
                "vote_count": 554,
                "character": "Tom Osceola (uncredited)",
                "credit_id": "56eaee35c3a36806b3000213",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Harold J. Smith",
            "Harry Silversmith",
            "Harry Smith"
        ],
        "biography": "Jay Silverheels was born on a reservation in Canada to a Mohawk chief.  He was a star lacrosse player and a boxer before he entered films as a  stuntman in 1938. He worked in a number of films though the 1940s before  he gained some notice as the Osceola brother in Humphrey Bogart's film Key Largo (1948). Most of his roles consisted of bit parts as \"Indian.\" In 1949, he would work in a movie called The Cowboy and the Indians (1949) with another \"B movie\" actor named Clayton Moore. It was later that same year that Jay would be hired to play the faithful Indian companion, Tonto, in the television series \"The Lone Ranger\"  (1949). This role, while still playing the \"Indian,\" would bring Jay  the fame that his motion picture career never did. As Tonto, on his  horse Scout, Jay could show up where the Ranger could not and some of  the time he would be shot at or beat up for his trouble. Jay would play  Tonto in all the episodes except for those that he missed when he had  his heart attack. In those episodes, he was replaced by the Ranger's  nephew, Dan. However, Clayton Moore would miss the third season when he was replaced by John Hart. Jay would reprise the role of Tonto in two big-screen color movies with Moore, The Lone Ranger (1956) and The Lone Ranger and the Lost City of Gold  (1958). After the series ended in 1957, Jay could not escape the  typecasting of Tonto. He would continue to appear in an occasional film  and television show, but he would become a spokesman to improve the  portrayal of Indians on TV.",
        "birthday": "1912-05-26",
        "deathday": "1980-03-05",
        "gender": 2,
        "homepage": null,
        "id": 1229431,
        "imdb_id": "nm0798855",
        "known_for_department": "Acting",
        "name": "Jay Silverheels",
        "place_of_birth": "Six Nations Reservation, Brantford, Ontario, Canada",
        "popularity": 0.3209,
        "profile_path": "/rrHuwINW4UtYEurYd6jmg7cO9QM.jpg"
    }
}