{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/eJ6kPtua2rEvjxHdCtnIobXJZSf.jpg",
                "genre_ids": [
                    80,
                    18,
                    9648,
                    53
                ],
                "id": 829,
                "original_language": "en",
                "original_title": "Chinatown",
                "overview": "Private eye Jake Gittes lives off of the murky moral climate of sunbaked, pre-World War II Southern California. Hired by a beautiful socialite to investigate her husband's extra-marital affair, Gittes is swept into a maelstrom of double dealings and deadly deceits, uncovering a web of personal and political scandals that come crashing together.",
                "popularity": 4.8392,
                "poster_path": "/kZRSP3FmOcq0xnBulqpUQngJUXY.jpg",
                "release_date": "1974-06-20",
                "title": "Chinatown",
                "video": false,
                "vote_average": 7.92,
                "vote_count": 4019,
                "character": "Lieutenant Lou Escobar",
                "credit_id": "52fe427dc3a36847f8022d09",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/3w2YSii9wQZsKKucAYwVxzOwm7s.jpg",
                "genre_ids": [
                    12,
                    35,
                    10752
                ],
                "id": 11589,
                "original_language": "en",
                "original_title": "Kelly's Heroes",
                "overview": "A misfit group of World War II American soldiers goes AWOL to rob a bank behind German lines.",
                "popularity": 3.9217,
                "poster_path": "/hleMxFKSC42yT0TClS4G29HV11n.jpg",
                "release_date": "1970-06-22",
                "title": "Kelly's Heroes",
                "video": false,
                "vote_average": 7.344,
                "vote_count": 757,
                "character": "Pvt. Petuko",
                "credit_id": "52fe44619251416c75032bb5",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Julio César Lopez",
            "Перрі Лопес"
        ],
        "biography": "​From Wikipedia, the free encyclopedia.  \n\nPerry Lopez (July 22, 1929 - February 14, 2008) was an American film and television actor. His acting career lasted over 40 years before his death in 2008.\n\nLopez was born in New York City. Lopez began his acting career on in theater, based in New York. He was signed to a contract at Warner Bros. Studios in 1955. Lopez appeared in a number of B-movies and Westerns early on in his career, including the Creature from the Black Lagoon, Young Guns and The Lone Ranger.\n\nLopez was, perhaps, best known as Lieutenant Lou Escobar in the 1974 film Chinatown, which he starred in opposite Jack Nicholson and Faye Dunaway. He reprised the role sixteen years later (with Escobar promoted to Captain) in The Two Jakes in 1990.\n\nAmong his many television appearances, one of his more well-known roles is that of Esteban Rodriguez in the classic Star Trek episode \"Shore Leave\". Lopez also appeared in an episode of Bonanza, as the cold-blooded outlaw Duke Miller, who kills a man over being first in line to get a haircut. He was Joaquín Castañeda, a mestizo that fought to free his people, on El Zorro, starring Guy Williams. Lopez also appeared in episode 14, \"Night Of The Long Knives\" originally airing December 16, 1966 of The Time Tunnel television series, in the Voyage to the Bottom of the Sea -episode \"Savage Jungle\" and played Pvt. Petuko in Kelly's Heroes (1970).\n\nLopez died of lung cancer in at The Rehabilitation Centre of Beverly Hills in Beverly Hills, California at age 78. He was survived by several nieces and nephews.\n\nDescription above from the Wikipedia article   licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1929-07-22",
        "deathday": "2008-02-14",
        "gender": 2,
        "homepage": null,
        "id": 12295,
        "imdb_id": "nm0520164",
        "known_for_department": "Acting",
        "name": "Perry Lopez",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.2788,
        "profile_path": "/rQXvA13yB182uYVZ1ziHDe6ECV0.jpg"
    }
}