{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tcx15vswrQJCGET5lGxESQ4J5LG.jpg",
                "genre_ids": [
                    10752,
                    36,
                    12
                ],
                "id": 57212,
                "original_language": "en",
                "original_title": "War Horse",
                "overview": "On the brink of the First World War, Albert's beloved horse Joey is sold to the Cavalry by his father. Against the backdrop of the Great War, Joey begins an odyssey full of danger, joy, and sorrow, and he transforms everyone he meets along the way. Meanwhile, Albert, unable to forget his equine friend, searches the battlefields of France to find Joey and bring him home.",
                "popularity": 4.9635,
                "poster_path": "/3aRHhvvngFPJFy5uAjo7GVr3PhL.jpg",
                "release_date": "2011-12-25",
                "title": "War Horse",
                "video": false,
                "vote_average": 7.296,
                "vote_count": 3519,
                "character": "Sgt. Martin",
                "credit_id": "5475a688c3a368364c0025dd",
                "order": 23
            },
            {
                "adult": false,
                "backdrop_path": "/6t8ES1d12OzWyCGxBeDYLHoaDrT.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 330459,
                "original_language": "en",
                "original_title": "Rogue One: A Star Wars Story",
                "overview": "A rogue band of resistance fighters unite for a mission to steal the Death Star plans and bring a new hope to the galaxy.",
                "popularity": 6.8029,
                "poster_path": "/i0yw1mFbB7sNGHCs7EXZPzFkdA1.jpg",
                "release_date": "2016-12-14",
                "title": "Rogue One: A Star Wars Story",
                "video": false,
                "vote_average": 7.502,
                "vote_count": 15865,
                "character": "Captain Pterro",
                "credit_id": "588ffa28c3a3681af5001768",
                "order": 35
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Tony Pitts is an actor, screenwriter and playwright. Born in Sheffield, Pitts originally intended to become a physician but ended up working as a car mechanic in his early career. During his time at Stannington College, Sheffield Barry Hines paid a visit looking for extras for his upcoming drama Looks and Smiles. Pitts was cast and soon upgraded to a bigger role in the production. He decided to follow his ambition to become an actor in 1983, landing the role of Archie Brooks in the long running ITV soap Emmerdale. He remained in the show for a total of ten years, when the character was killed off in the infamous plane crash episode of 30th December 1993. Since then, Pitts has worked in TV, film, radio and theatre including War Horse, Lilyhammer and Peaky Blinders. In 2018, Pitts wrote, produced and starred in the film Funny Cow - the story of a female stand up comedian (played by his friend Maxine Peake) on the northern club circuit in the 1970s. In 2021, Pitts and actress Katherine Kelly set up the production company Make Me Films. They released their first short, Let Her Go, in 2022. It was written by Pitts and marked his directorial debut. He is also the host, alongside John Bishop, of the podcast Three Little Words.",
        "birthday": "1962-10-10",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1229255,
        "imdb_id": "nm0686029",
        "known_for_department": "Acting",
        "name": "Tony Pitts",
        "place_of_birth": "Sheffield, Yorkshire, England",
        "popularity": 0.3965,
        "profile_path": "/yKxag5eLZJ2Oex5bj8RXWIR3LnC.jpg"
    }
}