{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cLZxnkj75cGBK1tLTMyIudOZYZk.jpg",
                "genre_ids": [
                    99
                ],
                "id": 1777,
                "original_language": "en",
                "original_title": "Fahrenheit 9/11",
                "overview": "Michael Moore's view on how the Bush administration allegedly used the tragic events on 9/11 to push forward its agenda for unjust wars in Afghanistan and Iraq.",
                "popularity": 4.0646,
                "poster_path": "/1WQgOCJj22zF7Bsr0pIBgGBr71q.jpg",
                "release_date": "2004-06-25",
                "title": "Fahrenheit 9/11",
                "video": false,
                "vote_average": 7.083,
                "vote_count": 1459,
                "character": "Self (archive footage)",
                "credit_id": "64a596ea5a991500e3c886ab",
                "order": 46
            },
            {
                "adult": false,
                "backdrop_path": "/70uUnpfe7en9x011UjpZoub101l.jpg",
                "genre_ids": [
                    99,
                    18,
                    80
                ],
                "id": 1430,
                "original_language": "en",
                "original_title": "Bowling for Columbine",
                "overview": "This is not a film about gun control. It is a film about the fearful heart and soul of the United States, and the 280 million Americans lucky enough to have the right to a constitutionally protected Uzi. From a look at the Columbine High School security camera tapes to the home of Oscar-winning NRA President Charlton Heston, from a young man who makes homemade napalm with The Anarchist's Cookbook to the murder of a six-year-old girl by another six-year-old. Bowling for Columbine is a journey through the US, through our past, hoping to discover why our pursuit of happiness is so riddled with violence.",
                "popularity": 5.1555,
                "poster_path": "/5AlgeysilsfLdEwlTlYO7fqgsLn.jpg",
                "release_date": "2002-10-09",
                "title": "Bowling for Columbine",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 1614,
                "character": "Self (archive footage)",
                "credit_id": "686f4daaff31a41a48e807b1",
                "order": 33
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Byron Leslie Dorgan (born May 14, 1942) is an American author, businessman and former politician who served as a United States Representative (1981–1992) and United States Senator (1992–2011) from North Dakota. He is a member of the Democratic Party.\n\nAs of 2011, he serves as a senior policy advisor for the Washington, DC law firm Arent Fox LLP. He was a member of the Senate Democratic leadership for 16 years, first as Assistant Democratic Floor Leader and then as Chairman of the Democratic Policy Committee and Chairman of the Committee on Indian Affairs. Dorgan announced that he would not seek re-election in 2010.\n\nIn addition to his work at Arent Fox, Dorgan serves as a senior fellow at the Bipartisan Policy Center, where he focuses on energy policy issues as co-chair of BPC's Energy Project and is also a member of the ReFormers Caucus of Issue One. He is an adjunct professor at Georgetown University; he also serves on several boards of directors, including the Board of Governors of Argonne National Laboratory and on the National Advisory Board of the Center for Arms Control and Non-Proliferation.\n\nDorgan is also a New York Times best-selling author of five books, including two on economic and political issues, two novels described as eco-thrillers and the latest book titled “The Girl in the Photograph” a true story about a Native American girl living on an Indian Reservation.",
        "birthday": "1942-05-14",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1229123,
        "imdb_id": "nm1658809",
        "known_for_department": "Acting",
        "name": "Byron Dorgan",
        "place_of_birth": "Dickinson, North Dakota, USA",
        "popularity": 0.0472,
        "profile_path": "/qVOymx3s1adtKODc1MZ8rxzDqAy.jpg"
    }
}