{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/waOYBThLihaTKUFOAzjvhPjBmrS.jpg",
                "genre_ids": [
                    18
                ],
                "id": 14047,
                "original_language": "en",
                "original_title": "The Great Debaters",
                "overview": "The true story of a brilliant but politically radical debate team coach who uses the power of words to transform a group of underdog African-American college students into a historical powerhouse that took on the Harvard elite.",
                "popularity": 4.3451,
                "poster_path": "/szx0sWq0pgvgfRX7g72cWBYoOjf.jpg",
                "release_date": "2007-12-25",
                "title": "The Great Debaters",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 663,
                "character": "Harland Osbourne",
                "credit_id": "547d863bc3a3685afd0050c8",
                "order": 15
            },
            {
                "adult": false,
                "backdrop_path": "/yPXW7E4Tu1Eltb5lxQSwHNLEzlx.jpg",
                "genre_ids": [
                    28,
                    35,
                    80,
                    18
                ],
                "id": 337170,
                "original_language": "en",
                "original_title": "American Made",
                "overview": "The true story of pilot Barry Seal, who transported contraband for the CIA and the Medellin cartel in the 1980s.",
                "popularity": 7.8645,
                "poster_path": "/23ILgoPSO5ShKcTZOuiTVfqFAUB.jpg",
                "release_date": "2017-08-18",
                "title": "American Made",
                "video": false,
                "vote_average": 6.897,
                "vote_count": 4740,
                "character": "DEA Agent Winter",
                "credit_id": "55ed284dc3a3682c62013a2e",
                "order": 37
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Justice Adam Leak"
        ],
        "biography": "Justice Leak was born and raised in Montgomery, Alabama. His father, George, a former police officer, named his daughter, Liberty and son, Justice after vowing to do so while a young soldier in Vietnam. \"My Dad said if he made it back home, he'd give us these names after his love for his country.\"  During his childhood, Justice was anything but fond of his name. \"As a kid, you don't want to stick out. And when I was introduced to people, my name was (and still is) a conversation starter, which for me was a nightmare.\" Leak said. \"But as you get older, you realize that it's good to have something that makes you different from everyone else.\"  Leak was a shy kid who \"could easily blend into the walls.\" His quiet nature, however, made him a keen observer of human behavior, a skill that has served him well.  \"All my life's experiences -- the good, the bad and the ugly -- have been preparing me to do this thing (acting). That's why I'm so thankful that I wasn't a popular kid!\"  His first stint in the spotlight came during his senior year at Jefferson Davis High School. He was chosen to lead the marching band, and recalls his experience as drum major as the \"best of both worlds in terms of performing and music.\"  \"For the first time, I was in a leadership position,\" Leak said. \"I couldn't hide behind anybody else, and looking back, that was the beginning point for me coming out of my shell.\"  After graduation, Leak attended college in Texas and later Auburn University. While there, he became involved in the drama department, mainly working behind the scenes. But that all changed when he helped a classmate with an audition.  \"I told the director that I wasn't auditioning and was only helping,\" Leak said. \"Afterwards, he stepped up and said, 'Why aren't you auditioning? You would be great in one of the leads.'\"  His first role was the lead in Arthur Miller's, \"The Crucible.\" During his senior year, he starred in every main stage play produced at Auburn and earned two Irene Ryan Award nominations. He was also named \"best actor\" by the university's faculty and students.  After earning a degree in theatre arts, Leak moved to Atlanta and was signed to the agency, People Store. He began doing commercials for companies such as Verizon Wireless, and later, had small roles in TV shows and independent films.  His agent felt he could do more and sent his resume to the casting directors for \"The Great Debaters,\" a career changing moment.  As the buzz of The Great Debaters crossed the country, so did Justice, making his move from the east to the west coast; capitalizing on the momentum of this success. Once in Los Angeles, he was quickly signed by two leading agencies and booked back to back to back guest starring roles on three major network shows within a month's time - and the momentum shows no signs of slowing anytime soon.  Leak plans to remain humble, no matter how successful he becomes.  \"I want to be known as a good soul with a kind heart, and a great artist who had the chance to make a difference in this world for the better and succeeded.\"",
        "birthday": "1979-09-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1229689,
        "imdb_id": "nm1495175",
        "known_for_department": "Acting",
        "name": "Justice Leak",
        "place_of_birth": "Montgomery, Alabama, USA",
        "popularity": 0.3523,
        "profile_path": "/55Fc5iVquRcyZVqmBHdu76nkmq.jpg"
    }
}