{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gqrnQA6Xppdl8vIb2eJc58VC1tW.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 76341,
                "original_language": "en",
                "original_title": "Mad Max: Fury Road",
                "overview": "An apocalyptic story set in the furthest reaches of our planet, in a stark desert landscape where humanity is broken, and most everyone is crazed fighting for the necessities of life. Within this world exist two rebels on the run who just might be able to restore order.",
                "popularity": 13.0052,
                "poster_path": "/hA2ple9q4qnwxp3hKVNhroipsir.jpg",
                "release_date": "2015-05-13",
                "title": "Mad Max: Fury Road",
                "video": false,
                "vote_average": 7.626,
                "vote_count": 23369,
                "character": "The Vuvalini",
                "credit_id": "562a69e9c3a3681b5c0025e9",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Joy Smithers (born 15 July 1963) is an Australian actress, best known for her acting performances on television, and her role as a television news presenter, such as with MTV Australia in the late 1980s.\n\nHer credits include: All The Way, Bangkok Hilton, The Flying Doctors, Home and Away, Lorca and the Outlaws, Wildside and All Saints. For a short time she was co-host of Good Morning Australia. In September 2008 Smithers made a return to acting, as Bridget Simmons in Home and Away.\n\nSmithers appeared in the 2008 Australian surfing film Newcastle, as well as the 2015 action film Mad Max: Fury Road. At the age of 15, Smithers was offered the role of Max Rockatansky's wife, Jessie, in the original 1979 Mad Max, but was forced to decline after her parents would not let her travel to Adelaide for production.",
        "birthday": "1963-07-15",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1229667,
        "imdb_id": "nm0810456",
        "known_for_department": "Acting",
        "name": "Joy Smithers",
        "place_of_birth": "Sydney, New South Wales, Australia",
        "popularity": 0.2422,
        "profile_path": "/tlRvIGz7AX9wMy8vPQacCiAajQp.jpg"
    }
}