{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qHXdyDBgetOyetVkWGzHYGp7L72.jpg",
                "genre_ids": [
                    12,
                    18,
                    36
                ],
                "id": 7305,
                "original_language": "en",
                "original_title": "Alive",
                "overview": "The amazing true story of a Uruguayan rugby team's plane that crashed in the middle of the Andes mountains, and their immense will to survive and pull through alive, forced to do anything and everything they could to stay alive on meager rations and through the freezing cold.",
                "popularity": 3.4042,
                "poster_path": "/uQACcCZqd7WCTRin9xRIW5gr1bd.jpg",
                "release_date": "1993-01-15",
                "title": "Alive",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 1513,
                "character": "Mrs. Alfonsín",
                "credit_id": "59988da4c3a36821c8013a29",
                "order": 31
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Dina Barrington",
            "Дина Баррингтон"
        ],
        "biography": "Diana Barrington is a British actress. She studied drama at the Royal Academy of Dramatic Art. She was married to Canadian actor Ken Pogue until his death in 2015. Barrington worked at the Birmingham Repertory Theatre in 1957, and was part of the York repertory company from 1961-1962. In 1962 she appeared in Alastair Dennett's play Fit to Print, as part of the Peter Haddon Company then resident at the Wimbledon Theatre. In 1963 Barrington was part of the Alexandra Repertory Company at The Alexandra, Birmingham; she appeared in plays including Fish Out of Water by Derek Benfield, Noël Coward's Hay Fever, Jean Anouilh's Becket and W. Somerset Maugham's The Constant Wife. In 1964 she appeared at the Royal Court Theatre in Edgar Wallace's On The Spot. Later in the year she appeared in Elmer Blaney Harris's Johnny Belinda at the Theatre Royal, Bath. In 1965 she was in GC Brown's A Summer Game, with the Repertory Players at the Savoy Theatre. In 1971 Barrington played Hippolyta / Titania in A Midsummer Night's Dream at the Neptune Theatre, Halifax, Nova Scotia. In 1978, Barrington appeared as Mary, Queen of Scots in Schiller's Mary Stuart. In the same year, she played Fanny Wilton in Ibsen's John Gabriel Borkman. In 1981, Barrington played two roles in the Shakespeare Festival at Stratford-upon-Avon. In 1982 she was in The Elephant Man at Theatre Calgary in Alberta, Canada. In 1989, Jay Scott raved about her performance in The Top of His Head. Some time before 1996, Barrington notified Equity that she was taking a break from acting, and as of 2005 she had not returned to the profession.",
        "birthday": "1939-03-06",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1230529,
        "imdb_id": "nm0057478",
        "known_for_department": "Acting",
        "name": "Diana Barrington",
        "place_of_birth": "Canada ",
        "popularity": 0.0722,
        "profile_path": "/vL0RiInRrv3pvQJG5So2nzFv43H.jpg"
    }
}