{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/pWd09ohdwOSNF4IWG8a25qORc2O.jpg",
                "genre_ids": [
                    10751,
                    16,
                    12,
                    35
                ],
                "id": 9487,
                "original_language": "en",
                "original_title": "A Bug's Life",
                "overview": "On behalf of \"oppressed bugs everywhere,\" an inventive ant named Flik hires a troupe of warrior bugs to defend his bustling colony from a horde of freeloading grasshoppers led by the evil-minded Hopper.",
                "popularity": 8.9703,
                "poster_path": "/Ah3J9OJVc2CNCuH2zMydXy9fmIC.jpg",
                "release_date": "1998-11-25",
                "title": "A Bug's Life",
                "video": false,
                "vote_average": 6.973,
                "vote_count": 9457,
                "character": "Manny (voice)",
                "credit_id": "52fe44fec3a36847f80b651f",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/tPK1kSevALeVGPfDFv1pwyHnoJ9.jpg",
                "genre_ids": [
                    16,
                    35,
                    10751
                ],
                "id": 863,
                "original_language": "en",
                "original_title": "Toy Story 2",
                "overview": "Andy heads off to Cowboy Camp, leaving his toys to their own devices. Things shift into high gear when an obsessive toy collector named Al McWhiggen, owner of Al's Toy Barn kidnaps Woody. Andy's toys mount a daring rescue mission, Buzz Lightyear meets his match and Woody has to decide where he and his heart truly belong.",
                "popularity": 20.3119,
                "poster_path": "/yFWQkz2ynjwsazT6xQiIXEUsyuh.jpg",
                "release_date": "1999-10-30",
                "title": "Toy Story 2",
                "video": false,
                "vote_average": 7.603,
                "vote_count": 14366,
                "character": "The Cleaner (voice)",
                "credit_id": "55f99947c3a3686782002df3",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jonathan Smith",
            "Jonathan Daniel Charasuchin",
            "جاناتان هریس"
        ],
        "biography": "Jonathan Harris (born Jonathan Daniel Charasuchin; November 6, 1914 - November 3, 2002) was an American character actor whose career included more than 500 television and movie appearances, as well as voiceovers. Two of his best-known roles were as the timid accountant Bradford Webster in the television version of The Third Man and the fussy villain, Dr. Zachary Smith, of the 1960s science-fiction series Lost in Space. Near the end of his career, he provided voices for the animated features A Bug's Life and Toy Story 2.\n\nActing was Harris's first love. At age 24, he prepared a fake résumé and tried out for a repertory company at the Millpond Playhouse in Long Island, New York and appeared in several of this troupe's plays, prior to landing a spot in the company. In 1942, Harris won the leading role of a Polish officer in the Broadway play The Heart of a City. Adopting a Polish accent, he advised the producers that his parents were originally from Poland. In 1946, he starred in A Flag Is Born, opposite Quentin Reynolds and Marlon Brando.\n\nIn 1990, Harris reunited with the cast of Lost in Space in a filmed celebration of the 25th anniversary of the series' debut, at an event attended by more than 30,000 fans. Harris made a number of other convention appearances with other cast members of Lost in Space, including a 1996 appearance at Disney World.",
        "birthday": "1914-11-06",
        "deathday": "2002-11-03",
        "gender": 2,
        "homepage": null,
        "id": 123037,
        "imdb_id": "nm0364893",
        "known_for_department": "Acting",
        "name": "Jonathan Harris",
        "place_of_birth": "The Bronx, New York, USA",
        "popularity": 1.019,
        "profile_path": "/6UFydJAV96p3h3LLpq8xP4S8sh1.jpg"
    }
}