{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yFkUPqBuUnbhYbQL8VFpTrAT9za.jpg",
                "genre_ids": [
                    18,
                    878,
                    9648
                ],
                "id": 686,
                "original_language": "en",
                "original_title": "Contact",
                "overview": "A radio astronomer receives the first extraterrestrial radio signal ever picked up on Earth. As the world powers scramble to decipher the message and decide upon a course of action, she must make some difficult decisions between her beliefs, the truth, and reality.",
                "popularity": 6.2788,
                "poster_path": "/bCpMIywuNZeWt3i5UMLEIc0VSwM.jpg",
                "release_date": "1997-07-11",
                "title": "Contact",
                "video": false,
                "vote_average": 7.435,
                "vote_count": 4708,
                "character": "Geraldine A. Ferraro",
                "credit_id": "645fdbdfe3fa2f0166209f91",
                "order": 35
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Geraldine Anne Ferraro (August 26, 1935 – March 26, 2011) was an American politician, diplomat, and attorney. She served in the United States House of Representatives from 1979 to 1985, and was the Democratic Party's nominee for vice president in the 1984 presidential election, running alongside Walter Mondale; this made her the first female vice-presidential nominee representing a major American political party. She was also a journalist, author, and businesswoman.\n\nFerraro grew up in New York City and worked as a public school teacher before training as a lawyer. She joined the Queens County District Attorney's Office in 1974, heading the new Special Victims Bureau that dealt with sex crimes, child abuse, and domestic violence. In 1978 she was elected to the U.S. House of Representatives, where she rose rapidly in the party hierarchy while focusing on legislation to bring equity for women in the areas of wages, pensions, and retirement plans.\n\nIn 1984, former vice president and presidential candidate Walter Mondale, seen as an underdog, selected Ferraro to be his running mate in the upcoming election. In doing so Ferraro also became the first widely recognized Italian American to be a major-party national nominee. The positive polling the Mondale-Ferraro ticket received when she joined soon faded, as damaging questions arose about her and her businessman husband's finances and wealth and her congressional disclosure statements. In the general election, Mondale and Ferraro were defeated in a landslide by incumbent President Ronald Reagan and Vice President George H. W. Bush.\n\nFerraro twice ran campaigns for a seat in the United States Senate from New York, in 1992 and in 1998, both times starting as the front-runner for her party's nomination before losing in the primary election. She served as the Ambassador to the United Nations Commission on Human Rights from 1993 until 1996 during the presidential administration of Bill Clinton. She also continued her career as a journalist, author, and businesswoman, and served in the 2008 presidential campaign of Senator Hillary Clinton. Ferraro died in 2011 from multiple myeloma, 12 years after being diagnosed.\n\nDescription above from the Wikipedia article Geraldine Ferraro licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1935-08-26",
        "deathday": "2011-03-26",
        "gender": 1,
        "homepage": null,
        "id": 1230085,
        "imdb_id": "nm0274170",
        "known_for_department": "Acting",
        "name": "Geraldine A. Ferraro",
        "place_of_birth": "Newburgh, New York, USA",
        "popularity": 0.0168,
        "profile_path": "/biyoAvePAupa1mw1raKiL23BG12.jpg"
    }
}