{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3WK7p9EdZmmvB1IbB2Vw9Rf4lXH.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 296096,
                "original_language": "en",
                "original_title": "Me Before You",
                "overview": "A small town girl is caught between dead-end jobs. A high-profile, successful man becomes wheelchair bound following an accident. The man decides his life is not worth living until the girl is hired for six months to be his new caretaker. Worlds apart and trapped together by circumstance, the two get off to a rocky start. But the girl becomes determined to prove to the man that life is worth living and as they embark on a series of adventures together, each finds their world changing in ways neither of them could begin to imagine.",
                "popularity": 14.9446,
                "poster_path": "/Ia3dzj5LnCj1ZBdlVeJrbKJQxG.jpg",
                "release_date": "2016-06-01",
                "title": "Me Before You",
                "video": false,
                "vote_average": 7.928,
                "vote_count": 12828,
                "character": "Nathan",
                "credit_id": "5674053dc3a3685ee2001f5d",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Steve Peacocke"
        ],
        "biography": "Stephen's best known for his role as 'Brax' in the long running Australian serial drama, 'Home & Away'. He's appeared in various other Australian Film, Television and Theatre productions and most recently worked on Brett Ratner's, 'Hercules', along side Dwayne Johnson, John Hurt and Ian McShane. Stephen grew up in Dubbo in Central Western New South Wales, worked as a Jackaroo on a large scale sheep & cattle station west of Bourke and graduated from the University of Newcastle with a degree in Communications. His passion before acting was Rugby Union where he played at First Grade and Representative levels throughout his schooling, university and adult life.",
        "birthday": "1981-10-30",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1231106,
        "imdb_id": "nm2913856",
        "known_for_department": "Acting",
        "name": "Stephen Peacocke",
        "place_of_birth": "Dubbo, New South Wales, Australia",
        "popularity": 0.2432,
        "profile_path": "/1I1ZLJ8UQAlcg1dJn1ptwMVV71i.jpg"
    }
}