{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fe5a9dB8tylKUpcXq88ioXpNSsm.jpg",
                "genre_ids": [
                    18,
                    35,
                    10749
                ],
                "id": 11971,
                "original_language": "en",
                "original_title": "Much Ado About Nothing",
                "overview": "In this Shakespearean farce, Hero and her groom-to-be, Claudio, team up with Claudio's commanding officer, Don Pedro, the week before their wedding to hatch a matchmaking scheme. Their targets are sharp-witted duo Benedick and Beatrice -- a tough task indeed, considering their corresponding distaste for love and each other. Meanwhile, meddling Don John plots to ruin the wedding.",
                "popularity": 2.2771,
                "poster_path": "/tvltGP6vYOkHdURag0jPSjhPUAV.jpg",
                "release_date": "1993-05-07",
                "title": "Much Ado About Nothing",
                "video": false,
                "vote_average": 6.937,
                "vote_count": 764,
                "character": "Messenger",
                "credit_id": "5ff2c4375507e9003e0c9cbc",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Alex Lowe (born 15 January 1968) is an English actor, comedian and voice artist. He is the creator and performer of the characters Barry from Watford on Steve Wright's BBC Radio 2 show and Iain Lee's shows, and the character Clinton Baptiste, originally seen in Phoenix Nights, as whom he has since toured.\n\nLowe made his TV debut in 1981 in Thames Television's Theatre Box. On stage, he played Wharton in \"Another Country\" at the Queen's Theatre, Shaftesbury Avenue, London. In 1983 he played Young Edmond Bertram in BBC 1's Mansfield Park. His career has included diverse roles from serious drama to character comedy. He has worked as both a writer and actor in many different areas of media.\n\nIn 1990, Lowe appeared in The Hypochondriac at the Edinburgh Fringe Festival and won a First.\n\nIn 1991, having trained at The Studio School in North London and Leicester School of Performing Arts, he played PC Corman in Minder alongside George Cole. Lowe has appeared in a variety of different television programmes, including, Three Men in A Boat, The Rise and Fall of Rome, The Fast Show, Fun at the Funeral Parlour, The Big Impression Christmas Special, and Bremner, Bird and Fortune. He appeared in four episodes of Simon Day's comedy series Grass as precocious child star Crispin Winterville's father Roland. He played Clinton Baptiste in Peter Kay's Phoenix Nights and Sparky in That Peter Kay Thing. He starred with Lee on The 11 O'Clock Show on Channel Four in the late 1990s, usually appearing as a reporter. In 2007, he wrote and performed for Ronni Ancona and Co. for BBC One and performed in The Peter Serafinowicz Show on BBC 2.\n\nIn the cinema, Lowe played Paul in Peter's Friends, The Messenger in Much Ado About Nothing and Simon Merriel in Haunted.\n\nOn radio, Lowe has appeared on Absolute Power, 15 Minute Musical, Not Today, Thank You, The Laxian Key and The Scarifyers; he plays Brian in Clare in the Community for BBC Radio 4. Lowe has also appeared twice on Loose Ends on BBC Radio 4 with Iain Lee, Big Brother's Big Mouth and Sam Delaney's Stupid Telly (as Barry from Watford). From 2001 to 2003 he hosted Download This for XFM London on Sunday mornings from 10 am to midday.",
        "birthday": "1968-01-15",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.independenttalent.com/actors/alex-lowe/",
        "id": 1231909,
        "imdb_id": "nm0522877",
        "known_for_department": "Acting",
        "name": "Alex Lowe",
        "place_of_birth": "Brent, Middlesex, England, UK",
        "popularity": 0.0869,
        "profile_path": "/y9WSfz5ad7LyQWxcxARMPLnQKtp.jpg"
    }
}