{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9Cw5fOWLfHwFHjg88dC5oBZEmL4.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 24684,
                "original_language": "en",
                "original_title": "An Education",
                "overview": "Despite her sheltered upbringing, Jenny is a teen with a bright future; she's smart, pretty, and has aspirations of attending Oxford University. When David, a charming but much older suitor, motors into her life in a shiny automobile, Jenny gets a taste of adult life that she won't soon forget.",
                "popularity": 4.7661,
                "poster_path": "/gLIvvUdlocGjm8XVLxhWHAKWrRq.jpg",
                "release_date": "2009-10-29",
                "title": "An Education",
                "video": false,
                "vote_average": 6.946,
                "vote_count": 1359,
                "character": "Latin Teacher",
                "credit_id": "598dc109c3a36875a2012333",
                "order": 28
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Kate Duchene"
        ],
        "biography": "Kate Duchêne (born Catherine Anne Purves Duchêne, 5 July 1959) is an English actress best known for her role as the teacher Miss Hardbroom in the adaptation of the children's books The Worst Witch.\n\nDuchêne started to act at the age of 14. She studied French and Spanish at Trinity College, Cambridge in the 1980s, where she became a member of the Footlights theatre group, writing and performing her own material. She also acted with the Cambridge Mummers, appearing in such plays as Measure For Measure (as Isabella) in Cambridge and the Edinburgh Fringe. In the 1980s she joined the Traverse Theatre in Edinburgh, appearing in the premiere productions of Losing Venice and The White Rose. Since 2000 she has appeared frequently at the National Theatre in London, frequently working with director Katie Mitchell.\n\nShe briefly went to Spain, teaching English to children, and returned in 1986.\n\nDuchêne is best known for her work as Miss Constance Hardbroom, the strict \"deputy head and potions teacher\" on the popular TV series The Worst Witch. She stayed with the programme for its three-year run, and appeared in the first episode of its 2001 spinoff Weirdsister College but did not return for the second spinoff, The New Worst Witch (2005–2006). Later projects included Afterlife, a paranormal drama series, and extensive theatre work.\n\nRadio\n\nFrom October 1987 to July 1991, Duchêne played Alex Parker in BBC Radio 4's drama series Citizens. In 2013 she guest-starred in the final Series 4 episode of Cabin Pressure, playing a captain in the service of a Zurich-based airline.\n\nDuchêne spent her infancy in France, and was brought back to England permanently in 1962, residing in the seaside town of Brighton. Her partner is Robert Hickson. As of 2010, they have 2 children.\n\nSource: Article \"Kate Duchêne\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1959-01-05",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1231952,
        "imdb_id": "nm0239870",
        "known_for_department": "Acting",
        "name": "Kate Duchêne",
        "place_of_birth": "West Ham, London, England, UK",
        "popularity": 0.0596,
        "profile_path": "/3aDgYj5FqqVSUKKq7PtnkMjow6z.jpg"
    }
}