{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9EUmwXS6EbY5djAhLtBGzUbBwNV.jpg",
                "genre_ids": [
                    878,
                    12
                ],
                "id": 830,
                "original_language": "en",
                "original_title": "Forbidden Planet",
                "overview": "Starship C57D travels to planet Altair 4 in search of the crew of spaceship \"Bellerophon,\" a scientific expedition that has been missing for twenty years. They find themselves unwelcome by the expedition's lone survivor and warned of destruction by an invisible force if they don't turn back immediately.",
                "popularity": 3.2734,
                "poster_path": "/aq0OQfRS7hDDI8vyD0ICbH9eguC.jpg",
                "release_date": "1956-03-23",
                "title": "Forbidden Planet",
                "video": false,
                "vote_average": 7.253,
                "vote_count": 988,
                "character": "Lt. 'Doc' Ostrow",
                "credit_id": "52fe427dc3a36847f8022e0b",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Warren Albert Stevens"
        ],
        "biography": "Warren Albert Stevens was an American stage, screen, and television actor.  A founding member of The Actor's Studio in New York, Stevens received notice on Broadway in the late 1940s, and thereafter was offered a Hollywood contract at 20th Century Fox. His first Broadway role was in The Life of Galileo; his first movie role followed in The Frogmen. As a young studio contract player, Stevens had little choice of material, and he appeared in films that included Phone Call from a Stranger, Wait Till the Sun Shines, Nellie, and Gorilla at Large. A memorable movie role was that of the ill-fated \"Doc\" Ostrow in the science fiction film Forbidden Planet. He also had supporting roles in The Barefoot Contessa  with Humphrey Bogart and Intent to Kill.\n\nDespite occasional parts in big films, Stevens was unable to break out consistently into A-list movies, so he carved out a career in television as a journeyman dramatic actor.\n\nHe co-starred as Lt. William Storm in Tales of the 77th Bengal Lancers, a prime time adventure series set in India. Stevens also provided the voice of John Bracken in season one of Bracken's World. He played the role of Elliot Carson in the daytime series Return to Peyton Place during its two-year run.\n\nHe appeared in over 150 prime time shows from the 1950s to the early 1980s, including:\n\nGolden Age anthology series (Actors Studio, Campbell Playhouse, The Web, Justice, Philco Television Playhouse, Studio One, The United States Steel Hour, Bob Hope Presents the Chrysler Theatre, Route 66,\n\nMysteries Hawaiian Eye, Perry Mason, The Untouchables, Climax!, Checkmate, Surfside 6, 77 Sunset Strip, Behind Closed Doors, I Spy, The Man from U.N.C.L.E., Ironside, The Mod Squad, Mannix, Cannon, Griff, and Mission: Impossible, as well as Alfred Hitchcock Presents, The Twilight Zone, One Step Beyond,  and Mission: Impossible.  He also starred in a variety of Westerns:  Laramie, The Rebel, The Man Called Shenandoah), Wagon Train, The Alaskans, Gunsmoke, Bonanza, Daniel Boone, The Virginian Rawhide, and Have Gun, Will Travel, as well as Tombstone Territory and Stoney Burke. In 1970, he appeared as Paul Carson on \"The Men From Shiloh\" (rebranded name for The Virginian in the episode titled \"Hannah.\")\n\nStevens' appearance in the 1955 movie Robbers' Roost introduced him to Richard Boone, who hired him for a continuing television role on The Richard Boone Show, an award-winning NBC anthology series which lasted for the 1963–1964 season.\n\nIn his later years, Stevens' appearances were infrequent. He guest-starred in ER in March 2006 and had two roles in 2007.",
        "birthday": "1919-11-02",
        "deathday": "2012-03-27",
        "gender": 2,
        "homepage": null,
        "id": 12310,
        "imdb_id": "nm0828838",
        "known_for_department": "Acting",
        "name": "Warren Stevens",
        "place_of_birth": "Clark's Summit, Pennsylvania, USA",
        "popularity": 0.5379,
        "profile_path": "/tq3EULJdG5G9dHnsQp4zFi2Jugt.jpg"
    }
}