{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ouMbyjN1WJKyRqgvwovGl58e4eR.jpg",
                "genre_ids": [
                    18
                ],
                "id": 33511,
                "original_language": "en",
                "original_title": "Nowhere Boy",
                "overview": "A rebellious teenager, future Beatle John Lennon lives with his Aunt Mimi in working-class mid-1950s Liverpool, England. Mimi's husband suddenly dies, and John spies his mother Julia at the funeral. Despite Mimi's misgivings, John intends to have a real relationship with his mother. Julia introduces him to popular music and the banjo and, though a family conflict looms, young John is inspired to form his own band.",
                "popularity": 3.8807,
                "poster_path": "/1rFcosLtBnGL2ru0IPtwx3QSeKK.jpg",
                "release_date": "2009-12-25",
                "title": "Nowhere Boy",
                "video": false,
                "vote_average": 7.175,
                "vote_count": 834,
                "character": "Guitar Shop Guy",
                "credit_id": "5b01856a92514109b4009216",
                "order": 24
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Simon Lowe is a British actor who, among other titles, has played series regulars in Bodies (Dr. Tim Sibley), and The Grimleys (Shane Titley), both of which were written by Jed Mercurio. He also played Derek Evans in EastEnders. In April 2022, he began appearing in the BBC soap opera Doctors as Brian Kiernan. Prior to this, he played Sgt. James Collins in Doctors.\n\nAs a teenager at the end of the 1980s, he had a regular role in the Central Independent Television soap opera Crossroads, playing Jason Grice. In 2007, he portrayed the survivor of the Hindenburg disaster, Joseph Spah, in the drama from Channel 4, Hindenburg: The Untold Story, directed by Sean Grundy. In 2010, in Channel 4's Bloody Foreigners, he played the role of Jan Zumbach, of 303 squadron. In 2011, he made a single appearance in HBO's Game of Thrones as a wine merchant, and he has portrayed Mr. Bell in the 4 O'Clock Club from 2013 to 2020. He also played Sir Cumference in the \"A Knight's Tail\" section of Hacker Time. Theatre work includes the portrayal of Dudley Moore in the show, Pete and Dud: Come Again that successfully toured United Kingdom in 2007, alongside actor Gareth Tunley playing Peter Cook. In 2013, Lowe appeared as the monk in Bryan Singer's Jack the Giant Slayer, as Dr. Quentin in the adaptation of The Big Four, for the final series of Agatha Christie's Poirot, and as a snobbish maître d' in an episode of Downton Abbey.",
        "birthday": "1973-10-30",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1231158,
        "imdb_id": "nm0523047",
        "known_for_department": "Acting",
        "name": "Simon Lowe",
        "place_of_birth": "England, UK",
        "popularity": 0.1851,
        "profile_path": "/hpNN9d3MZn2PsqZywS6SH0EPd5.jpg"
    }
}