{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jniabJVBSW3EqLlyhjxWCZjVkiE.jpg",
                "genre_ids": [
                    12,
                    28,
                    878
                ],
                "id": 1895,
                "original_language": "en",
                "original_title": "Star Wars: Episode III - Revenge of the Sith",
                "overview": "The evil Darth Sidious enacts his final plan for unlimited power – and the heroic Jedi Anakin Skywalker must choose a side.",
                "popularity": 8.2385,
                "poster_path": "/xfSAoBEm9MNBjmlNcDYLvLSMlnq.jpg",
                "release_date": "2005-05-17",
                "title": "Star Wars: Episode III - Revenge of the Sith",
                "video": false,
                "vote_average": 7.452,
                "vote_count": 14350,
                "character": "Moteé",
                "credit_id": "54e383ffc3a368486f0016b4",
                "order": 45
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Kristy Wright (born 14 July 1978; name also erroneously given as Kirsty Wright) is an Australian actress.  Wright was born in Sydney, Australia, the oldest child in her family, with three stepbrothers and two half-sisters. Hoping to win a contest for acting lessons, she sent in her photograph and ended up with a full year's paid tuition. Her first part was a guest role in Police Rescue. From 1995 until 1999 she played the part of Chloe Richards in the Australian soap opera Home and Away and briefly returned to this role in December 2005, when her character died from an embolism resulting from a car accident.  Following Home and Away she starred in Chuck Finn, Above the Law and Something in the Air. She went on to feature inCrash Palace as well as a political satire called Corridors of Power. Following this success she was picked up to feature in an American TV show, Beastmaster as a ninja warrior. She also appeared in a short film, Sweet Dreams.  She worked on an episode of Sir Arthur Conan Doyle's – The Lost World, and has also featured in the Australian drama,The Alice. She had a minor role as the hand maiden Moteé in Star Wars Episode III: Revenge of the Sith.  She moved to Los Angeles in 2005 or 2006 and quit acting in 2011 and worked in event management. On August 8, 2013, she gave birth to Jai Jacoby, during her 27th week of pregnacy. Jai weighed in at only 2 lbs 4 oz and 14 1/2 inches long. Her partner is Michaelis Jacoby.",
        "birthday": "1978-07-14",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1231126,
        "imdb_id": "nm0942578",
        "known_for_department": "Acting",
        "name": "Kristy Wright",
        "place_of_birth": "Sydney - Australia",
        "popularity": 0.204,
        "profile_path": "/aeLn0lqd5KlIgP6NfDKxIh89tCb.jpg"
    }
}