{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/acvE3RWjDLgvbL2RtcyzkrsAyNV.jpg",
                "genre_ids": [
                    80,
                    36,
                    18
                ],
                "id": 466420,
                "original_language": "en",
                "original_title": "Killers of the Flower Moon",
                "overview": "When oil is discovered in 1920s Oklahoma under Osage Nation land, the Osage people are murdered one by one—until the FBI steps in to unravel the mystery.",
                "popularity": 10.9118,
                "poster_path": "/dB6Krk806zeqd0YNp2ngQ9zXteH.jpg",
                "release_date": "2023-10-18",
                "title": "Killers of the Flower Moon",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 3761,
                "character": "Acie Kirby",
                "credit_id": "64a5b0135a991500adf88911",
                "order": 38
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Peter Joseph Yorn"
        ],
        "biography": "Peter Joseph Yorn (born July 27, 1974) is an American singer, songwriter, and musician. He first gained international recognition after his debut record, Musicforthemorningafter, was released to critical and commercial acclaim in 2001. He is known for playing the bulk of the instruments on his records. Spin magazine, in a career retrospective article dated March 26, 2021, recognized Yorn as one of his generation's best songwriters. Yorn’s 10th full length album, Hawaii, was released on June 17, 2022. His latest single, “Real Good Love”, was released on June 28, 2024.  Yorn was born in Pompton Plains, New Jersey, and raised Jewish in Montville, New Jersey, the son of Joan, a former school teacher and real estate agent, and Lawrence K. Yorn, a retired dentist and former Captain in the United States Army. Yorn attended Montville Township High School. Yorn graduated from Syracuse University in 1996. His brother Rick is a major talent manager in Hollywood and was responsible for teaching nine-year-old Pete to play the drums. His eldest brother Kevin Yorn is an entertainment lawyer.\n\nYorn mentions the Nova Scotia-based band Sloan as one with great influence on him, even admitting after seeing them live in 1999, he was so blown away by their talent that he wondered whether it would be worth continuing to even pursue his debut album. Sloan would later tour with Yorn in the US in 2002.\n\nYorn composed the score for Me, Myself & Irene in 2000. His songs \"Strange Condition\" and \"Just Another\" appeared in the film.",
        "birthday": "1974-07-27",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.peteyorn.com",
        "id": 1231742,
        "imdb_id": "nm0948832",
        "known_for_department": "Acting",
        "name": "Pete Yorn",
        "place_of_birth": "Pompton Plains, New Jersey, USA",
        "popularity": 0.1015,
        "profile_path": "/78nYQL17SyBi8BwWL04tu16F9TK.jpg"
    }
}