{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5rbPwIdEZTyLTkpAgvGdacgCr7T.jpg",
                "genre_ids": [
                    18,
                    53,
                    27
                ],
                "id": 11481,
                "original_language": "en",
                "original_title": "Repulsion",
                "overview": "Beautiful young manicurist Carole suffers from androphobia (the pathological fear of interaction with men). When her sister and roommate, Helen, leaves their London flat to go on an Italian holiday with her married boyfriend, Carole withdraws into her apartment. She begins to experience frightful hallucinations, her fear gradually mutating into madness.",
                "popularity": 2.0055,
                "poster_path": "/dtyCKEPLqv9wxyVazL4b843vtUb.jpg",
                "release_date": "1965-06-01",
                "title": "Repulsion",
                "video": false,
                "vote_average": 7.405,
                "vote_count": 1043,
                "character": "Reggie",
                "credit_id": "575ac9839251410aa7000e25",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Hugh Futcher (born 29 October 1937) is an English actor in theatre, television and film. He was a member of the stock company of the Carry On films, with notable parts in Carry On Spying, Carry On at Your Convenience, and Carry On Behind. Other films include Roman Polanski's Repulsion (as Colin's pubmate Reggie) and the Herman's Hermits musical Mrs. Brown, You've Got a Lovely Daughter.\n\nIn television, Futcher had a recurring role in the adventure series Orlando as \"Hedgehog.\" He has also appeared on The Saint, Z-Cars, The Sweeney, Minder, and Casualty. In 1972, he appeared in the Doctor Who serial The Sea Devils, and Six Days of Justice, in the episode \"A Private Nuisance\", with Earl Cameron and Mollie Sugden. Fifteen years later he was considered for the role of the Seventh Doctor, but accepted other work that precluded taking the part. He appeared with Brian Murphy and Maureen Lipman in the 1985 television drama On Your Way, Riley. In 2011, he appeared in episode 5 of series 5 of MI High as George.",
        "birthday": "1937-10-29",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1231171,
        "imdb_id": "nm0299412",
        "known_for_department": "Acting",
        "name": "Hugh Futcher",
        "place_of_birth": "Portsmouth, Hampshire, England, UK",
        "popularity": 0.2155,
        "profile_path": null
    }
}