{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mrfbeWcjgSaZ9NEb0xJMR9xzSeB.jpg",
                "genre_ids": [
                    18
                ],
                "id": 380,
                "original_language": "en",
                "original_title": "Rain Man",
                "overview": "When car dealer Charlie Babbitt learns that his estranged father has died, he returns home to Cincinnati, where he discovers that he has a savant older brother named Raymond and that his father's $3 million fortune is being left to the mental institution in which Raymond lives. Motivated by his father's money, Charlie checks Raymond out of the facility in order to return with him to Los Angeles. The brothers' cross-country trip ends up changing both their lives.",
                "popularity": 8.5861,
                "poster_path": "/iTNHwO896WKkaoPtpMMS74d8VNi.jpg",
                "release_date": "1988-12-12",
                "title": "Rain Man",
                "video": false,
                "vote_average": 7.751,
                "vote_count": 6688,
                "character": "(voice)",
                "credit_id": "63b6c4b98ee49c007e348aeb",
                "order": 54
            },
            {
                "adult": false,
                "backdrop_path": "/xdofxnT2FADbSFOJflOTLnCoZe9.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 838,
                "original_language": "en",
                "original_title": "American Graffiti",
                "overview": "A couple of high school graduates spend one final night cruising the strip with their buddies before they go off to college.",
                "popularity": 5.8727,
                "poster_path": "/1tjLivPad2PX8FAzWko7FPIb8d2.jpg",
                "release_date": "1973-08-11",
                "title": "American Graffiti",
                "video": false,
                "vote_average": 7.04,
                "vote_count": 1509,
                "character": "Bobbie",
                "credit_id": "59010dc592514155d200207f",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Lynne Stewart",
            "Lynn Marie Stewart"
        ],
        "biography": "Lynne Marie Stewart (December 14, 1946 – February 21, 2025) was an American film and television actress, best known for her performance as Miss Yvonne, the Most Beautiful Woman in Puppet Land. She originated the role in the 1981 stage show The Pee-wee Herman Show and on the CBS television show Pee Wee's Playhouse. She returned to the role in the 2010 Los Angeles stage revival and returned again to play the role in the Broadway production which opened in November 2010 at the Stephen Sondheim Theatre. She played several different nurses on the television series MAS*H. She appeared on an episode of the television series Night Court as Vanna Anders and as Squiggy's two-timing girlfriend Barbara on Laverne & Shirley. She has also played roles on Pee-wee's Big Adventure, Big Top Pee-wee, Night Stand with Dick Dietrick and Son of the Beach. Most recently, she appeared in Law & Order SVU and Arrested Development. She also has a recurring role as Charlie's mom on It's Always Sunny in Philadelphia. Lynne Marie Stewart also appeared on a Biography profile of her best friend Cindy Williams.\n\nDescription above from the Wikipedia article Lynne Marie Stewart, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1946-12-14",
        "deathday": "2025-02-21",
        "gender": 1,
        "homepage": null,
        "id": 1232417,
        "imdb_id": "nm0829620",
        "known_for_department": "Acting",
        "name": "Lynne Marie Stewart",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.2599,
        "profile_path": "/yVUrboiJ4Mqz7M4bqvUjwV8alf7.jpg"
    }
}