{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gXIuss4Ajlex0E6iJPjkSTR8Qip.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 389015,
                "original_language": "en",
                "original_title": "I, Tonya",
                "overview": "Competitive ice skater Tonya Harding rises amongst the ranks at the U.S. Figure Skating Championships, but her future in the sport is thrown into doubt when her ex-husband intervenes.",
                "popularity": 3.2345,
                "poster_path": "/6gNXwSHxaksR1PjVZRqNapmkgj3.jpg",
                "release_date": "2017-12-07",
                "title": "I, Tonya",
                "video": false,
                "vote_average": 7.478,
                "vote_count": 5981,
                "character": "Self (archive footage)",
                "credit_id": "67f73745d3ab7d7a8bad2618",
                "order": 41
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Tonya Maxene Price"
        ],
        "biography": "Tonya Maxene Price (née Harding; born November 12, 1970) is an American former figure skater and boxer, and reality television personality.\n\nBorn in Portland, Oregon, Harding was raised by her mother, who enrolled her in ice skating lessons when Tonya was 3 years old. Harding spent much of her early life training, eventually dropping out of high school to devote her time to the sport. After climbing the ranks in the U.S. Figure Skating Championships between 1986 and 1989, Harding won the 1989 Skate America competition. She was the 1991 and 1994 U.S. champion, and 1991 World silver medalist. In 1991, she became the first American woman and the second woman in history (after Midori Ito) to successfully land a triple Axel in an international competition. Harding is a two-time Olympian and a two-time Skate America Champion.\n\nIn January 1994, Harding became embroiled in controversy when her ex-husband, Jeff Gillooly, orchestrated an attack on her fellow U.S. skating rival Nancy Kerrigan. On March 16, 1994, Harding accepted a plea bargain in which she pled guilty to conspiracy to hinder prosecution. As a result of her involvement in the aftermath of the assault, the United States Figure Skating Association banned her for life on June 30, 1994; she was stripped of her 1994 title.\n\nFrom 2003 to 2004, Harding competed as a professional boxer. Her life has been the subject of many books, films, documentaries, and academic studies. In 2014, two television documentaries were made about Harding's life and skating career (Nancy & Tonya and The Price of Gold), inspiring Steven Rogers to write the film I, Tonya in 2017, for which Australian star Margot Robbie portrayed Harding, and also produced the film.",
        "birthday": "1970-11-12",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1233580,
        "imdb_id": "nm0002125",
        "known_for_department": "Acting",
        "name": "Tonya Harding",
        "place_of_birth": "Portland, Oregon, USA",
        "popularity": 0.1998,
        "profile_path": "/qKsQNNIzjZnAifvhFmrATdFW1s9.jpg"
    }
}