{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2T4bqHgYfzXNQoALJsvhW40kDTg.jpg",
                "genre_ids": [
                    10749,
                    18,
                    36
                ],
                "id": 167073,
                "original_language": "en",
                "original_title": "Brooklyn",
                "overview": "In 1950s Ireland and New York, young Eilis Lacey has to choose between two men and two countries.",
                "popularity": 2.46,
                "poster_path": "/cs7W8j5lI7qzRW6tKSj9p1Q0Ze7.jpg",
                "release_date": "2015-10-20",
                "title": "Brooklyn",
                "video": false,
                "vote_average": 7.312,
                "vote_count": 3168,
                "character": "Mrs. Byrne",
                "credit_id": "55e7d740c3a3682c6700124a",
                "order": 43
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Áine Ní Mhuirí"
        ],
        "biography": "Áine Ní Mhuirí (born Dublin, Ireland) is an Irish actress. She began her career at the Damer Theatre, later working in the Abbey Theatre in Dublin, Ireland. Áine is a fluent Irish language speaker. In 1975, she appeared in a play by Irish playwright Teresa Deevy called \"Katie Roche\" where she played the part of Margaret Drybone. She appeared in the 1987 film, The Lonely Passion of Judith Hearne based on the novel by Brian Moore. In 1989 she played Masie Madigan in the London National Theatre production of Juno and the Paycock.\n\nShe played Lily in the Irish Soap Opera Fair City on RTÉ One.\n\nIn 2001, Mhuirí won the CFT Excellence Award for Best Actress in a Television Series for her role as Kathleen Hendley in Ballykissangel. She appeared in 53 episodes, from 1996 to 2001. In 2012, Áine appeared in Pan Pan Theatre Company's production of Ibsen's A Doll House at Smock Alley Theatre.\n\nShe played Mrs. Taylor in several of the Jack Taylor, an Irish television drama based on a series of novels by Ken Bruen including \"The Magdalen Martyrs\" (2011), and \"The Dramatist\" (2013).\n\nÁine Ní Mhuirí is scheduled to play in Embers, a theatricalized presentation of a radio play by Samuel Beckett, staged by the Pan Pan Theatre Company at the Brooklyn Academy of Music in September 2015.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1233821,
        "imdb_id": "nm0583908",
        "known_for_department": "Acting",
        "name": "Áine Ní Mhuirí",
        "place_of_birth": "Dublin, Ireland",
        "popularity": 0.083,
        "profile_path": null
    }
}