{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/pdSSDEVXjE5DZxFdX3kpjZywNrv.jpg",
                "genre_ids": [
                    18,
                    35,
                    10749
                ],
                "id": 12225,
                "original_language": "en",
                "original_title": "Cashback",
                "overview": "After a painful breakup, Ben develops insomnia. To kill time, he starts working the late night shift at the local supermarket, where his artistic imagination runs wild.",
                "popularity": 3.3185,
                "poster_path": "/9KlMglIBYxreQTEXxHJWiSrYPD2.jpg",
                "release_date": "2007-01-17",
                "title": "Cashback",
                "video": false,
                "vote_average": 6.961,
                "vote_count": 1313,
                "character": "Football Referee",
                "credit_id": "5f8d4e5ace9e910036464c54",
                "order": 39
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Howard has taken leading roles at the Royal Shakespeare Company, the National Theatre, the Royal Exchange Theatre, the Royal Court Theatre, The Almeida, Shakespeare’s Globe Theatre, Hampstead and Headlong. Howard’s versatility means he is used for a huge variety of voice projects from cartoons to documentaries.\n\nHoward has been in the original cast of Warhorse, The Curious Incident of the Dog in the Night-time, and Oslo, all which originated at the National Theatre, and then transferred to the West End. He was also in the original cast of the multi award winning musical London Road at the National Theatre which was subsequently made into a movie.\n\nHe has worked extensively on television, playing Sergeant Willis for two series of Downton Abbey, the Mayor of Weatherfield in Coronation Street, several appearances on EastEnders, Casualty, Holby City, and Doctors. He appeared opposite Martin Clunes in Manhunt, as well as roles in Midsomer Murders and Little Boy Blue.\n\nHoward has appeared in over 50 productions for BBC Radio including two guest appearances on The Archers, and has produced 2 x 90 minute plays for Radio 4 including the Sony award nominated, The Taxman.\n\nHe is a regular voice over on TV and radio, having fronted many campaigns including a Nike commercial, which was awarded second place in Campaign magazine’s top ten radio ads. He voiced one of the main characters in the children’s animated series, Underground Ernie (starring Gary Lineker) and he has narrated several series for National Geographic, Discovery Channel and Channel 4.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.eamonnbedford.com/howardward/",
        "id": 1233153,
        "imdb_id": "nm0911575",
        "known_for_department": "Acting",
        "name": "Howard Ward",
        "place_of_birth": null,
        "popularity": 0.4473,
        "profile_path": "/4hzgn1zrbXs652QQepFAKtb8HVR.jpg"
    }
}