{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/oaRdRdqahtSvHK6VkOphVwGtPRN.jpg",
                "genre_ids": [
                    18
                ],
                "id": 221,
                "original_language": "en",
                "original_title": "Rebel Without a Cause",
                "overview": "After moving to a new town, troublemaking teen Jim Stark is supposed to have a clean slate, although being the new kid in town brings its own problems. While searching for some stability, Stark forms a bond with a disturbed classmate, Plato, and falls for local girl Judy. However, Judy is the girlfriend of neighborhood tough, Buzz. When Buzz violently confronts Jim and challenges him to a drag race, the new kid's real troubles begin.",
                "popularity": 5.1783,
                "poster_path": "/yHStsC8rRRfIjqRN38BQsLh6S7k.jpg",
                "release_date": "1955-10-27",
                "title": "Rebel Without a Cause",
                "video": false,
                "vote_average": 7.518,
                "vote_count": 1681,
                "character": "Nurse (uncredited)",
                "credit_id": "55ee1c679251413e4501634c",
                "order": 24
            },
            {
                "adult": false,
                "backdrop_path": "/2L8U8rUyWeFTb6n1egTNeJsEsvj.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749
                ],
                "id": 284,
                "original_language": "en",
                "original_title": "The Apartment",
                "overview": "Bud Baxter is a minor clerk in a huge New York insurance company, until he discovers a quick way to climb the corporate ladder. He lends out his apartment to the executives as a place to take their mistresses. Although he often has to deal with the aftermath of their visits, one night he's left with a major problem to solve.",
                "popularity": 4.4619,
                "poster_path": "/2nt8Z54Bce74ycithkzlSNkgXJB.jpg",
                "release_date": "1960-06-21",
                "title": "The Apartment",
                "video": false,
                "vote_average": 8.2,
                "vote_count": 2472,
                "character": "Office Worker (uncredited)",
                "credit_id": "5676fcca92514179e30062b8",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Dorothy E. Abbott"
        ],
        "biography": "Perennial starlet Dorothy Abbott was a sexy, vivacious, wide-smiling  model, showgirl and actress who could brighten up a room. Unfortunately,  her cinematic offerings wound up being pretty minimal and her last  years were marred by depression and, ultimately, a tragic end.\n\nShe was born Dorothy E. Abbott on December 16, 1920, in Kansas City, Missouri and started her career off as a chorine with Earl Carroll  and his Los Angeles-based revues and in Las Vegas showrooms where she  was dubbed the rather mystifying title of \"The Girl with the Golden  Arm\". Paramount Studios perked up on the lovely blonde with the Betty  Page-like bangs and gave her a starting contract at $150 a week. Groomed  in dozens of decorative \"good time girl\" bits -- dancers, chorus girls,  waitresses, stewardesses, party girls, nurses and models -- she was at  the same time promoted as a cheesecake pinup, \"winning\" such dubious  titles as \"Miss Wilshire Club,\" \"Miss Los Angeles Transit\" and \"Miss Oil  Cans\". The dusky-voiced Dorothy was usually briefly seen and not heard in such dramatic and lightweight fare as The Razor's Edge (1946), Road to Rio (1947), Night Has a Thousand Eyes (1948) (in which she has her first speaking role as a maid), Words and Music (1948), Take Me Out to the Ball Game (1949), Little Women (1949), Neptune's Daughter (1949), Annie Get Your Gun (1950), His Kind of Woman (1951), Aaron Slick from Punkin Crick (1952), _The Las Vegas Story (1952)_, The Caddy (1953), There's No Business Like Show Business (1954), Love Me or Leave Me (1955), Rebel Without a Cause (1955), Gunfight at the O.K. Corral (1957), Jailhouse Rock (1957), South Pacific (1958), The Apartment (1960), That Touch of Mink (1962), A Gathering of Eagles (1963) and Dear Heart (1964). Her one starring role came early in the exploitative, lowbudget potboiler A Virgin in Hollywood (1953) as a star reporter out to get a seamy Hollywood story, but she was unable to capitalize on it. Working  bit parts at the studio during the days, she would often perform on  stage in little theatre shows at night. On the sly, when work was  meager, she became a real estate agent in the 1950s in order to help  supplement her income. TV chores included guest roles in \"Leave It to  Beaver\" and \"Ozzie and Harriet\". She also had a recurring part for one  season as Jack Webb 's girlfriend on the Dragnet (1954) series.\n\nDorothy  married LAPD narcotics squad officer-turned homicide detective Adolph  Rudy Diaz in 1949. Diaz, who was of Native American (Apache) descent,  eventually retired as a cop in order to pursue acting. By this time, the  marriage was in trouble and the couple separated. Going by the stage  name of Rudy Diaz in 1967, he began to get work and was seen out in public with other  women. The divorce was finalized in 1968, but Dorothy took it hard and  never seemed to get over it. On December 15, 1968, she committed suicide  at her Los Angeles home -- one day before her 48th birthday. She was  interred (as Dorothy E. Diaz) at Rose Hills Memorial Park, Whittier, Los  Angeles County, California, Plot: Valley Lawn, Lot 2939.",
        "birthday": "1920-12-16",
        "deathday": "1968-12-15",
        "gender": 1,
        "homepage": null,
        "id": 1234545,
        "imdb_id": "nm0007961",
        "known_for_department": "Acting",
        "name": "Dorothy Abbott",
        "place_of_birth": "Kansas City, Missouri",
        "popularity": 0.0416,
        "profile_path": "/bheDciblNfOsKTvRNRyWJ5BNUJS.jpg"
    }
}