{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/y1giivdsGLyo1LCvlsL6mLKyTZ7.jpg",
                "genre_ids": [
                    53,
                    18,
                    9648
                ],
                "id": 1018,
                "original_language": "en",
                "original_title": "Mulholland Drive",
                "overview": "Blonde Betty Elms has only just arrived in Hollywood to become a movie star when she meets an enigmatic brunette with amnesia. Meanwhile, as the two set off to solve the second woman's identity, filmmaker Adam Kesher runs into ominous trouble while casting his latest project.",
                "popularity": 9.3955,
                "poster_path": "/x7A59t6ySylr1L7aubOQEA480vM.jpg",
                "release_date": "2001-06-06",
                "title": "Mulholland Drive",
                "video": false,
                "vote_average": 7.808,
                "vote_count": 6652,
                "character": "Mr. Roque",
                "credit_id": "52fe42e5c3a36847f802af3b",
                "order": 24
            },
            {
                "adult": false,
                "backdrop_path": "/g5G19q0xgkzWEvfcGo1KcL8nQOk.jpg",
                "genre_ids": [
                    18,
                    9648,
                    27
                ],
                "id": 1923,
                "original_language": "en",
                "original_title": "Twin Peaks: Fire Walk with Me",
                "overview": "In the questionable town of Deer Meadow, Washington, FBI Agent Desmond inexplicably disappears while hunting for the man who murdered a teen girl. The killer is never apprehended, and, after experiencing dark visions and supernatural encounters, Agent Dale Cooper chillingly predicts that the culprit will claim another life. Meanwhile, in the more cozy town of Twin Peaks, hedonistic beauty Laura Palmer hangs with lowlifes and seems destined for a grisly fate.",
                "popularity": 9.8063,
                "poster_path": "/rol5H6loAojd6tH2VXQYEXzGQk1.jpg",
                "release_date": "1992-06-03",
                "title": "Twin Peaks: Fire Walk with Me",
                "video": false,
                "vote_average": 7.392,
                "vote_count": 2083,
                "character": "Man From Another Place",
                "credit_id": "596bc98f9251413b3d004238",
                "order": 23
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Little Mike Anderson",
            "Michael John Anderson",
            "Michael Anderson",
            "Mike Anderson"
        ],
        "biography": "Michael Anderson was born in Huron, South Dakota, at 10:30 P.M., on Halloween night. Subject to a genetic anomaly known as Osteogenesis Imperfecta, he grew up in a wheelchair. After graduating high school, he traveled America, singing for tips and living in his car. For six years, he attended the University of Colorado where he majored in numerous subjects ranging from philosophy to microbiology. After college, he began working for Martin Marietta, trouble-shooting the N.A.S.A. computers in the ground-support system of the space shuttle. During this time, he made the documentary \"Little Mike,\" which won a silver medal in the International Film and Television Awards. Soon thereafter, he moved to New York City, where his film and television career began. For many years, Anderson was most well-known among fans of director David Lynch for his work as a backwards-talking dream figure on the cult favorite T.V. series Twin Peaks (1990). Anderson also worked with Lynch for the experimental performance piece Industrial Symphony No. 1: The Dream of the Brokenhearted (1990) and the T.V.-pilot-turned-feature film Mulholland Drive (2001). Anderson gained further recognition and success in recent years for his work on the H.B.O. series Carnivàle (2003).",
        "birthday": "1953-10-31",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 123517,
        "imdb_id": "nm0027199",
        "known_for_department": "Acting",
        "name": "Michael J. Anderson",
        "place_of_birth": "Denver, Colorado, USA",
        "popularity": 0.2012,
        "profile_path": "/gCd9WbrN1KcLiws9En6v9Z2k6RO.jpg"
    }
}