{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/f5XOH9b9oV7yzIqhKDEXtDx0uz9.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 16553,
                "original_language": "en",
                "original_title": "Little Manhattan",
                "overview": "Ten-year-old Gabe was just a normal kid growing up in Manhattan until Rosemary Telesco walked into his life, actually into his karate class. But before Gabe can tell Rosemary how he feels, she tells him she will not be going to public school any more. Gabe has a lot more to learn about life, love, and girls.",
                "popularity": 1.8491,
                "poster_path": "/z0RNI1NMtsvLsuTo1rWZfNHVs1z.jpg",
                "release_date": "2005-09-26",
                "title": "Little Manhattan",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 730,
                "character": "Mickey Telesco",
                "credit_id": "52fe46da9251416c75085b97",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nJohn Dossett is an American actor and singer.\n\nDossett's interest in a theatrical career began at Mount Pleasant High School in Wilmington, Delaware, where he appeared in student productions and was involved with the school's radio station, WMPH.\n\nDossett made his Broadway debut in 1979 in a short-lived musical entitled the King of Schnorrers. In 1982 he joined the cast of Fifth of July, after which the bulk of his work was in off-Broadway productions and on television. He was a member of the off-Broadway Circle Repertory Company, performing in many plays between 1980-1994.\n\nHe later achieved success in two popular musicals, Ragtime (1998) and the 2003 revival of Gypsy opposite Bernadette Peters. His performance in the latter garnered him both Tony Award and Drama Desk Award nominations as Outstanding Featured Actor in a Musical. His most significant screen credit is the 1990 AIDS drama, Longtime Companion. He was re-united with his Gypsy co-star Peters in a one-night only benefit reading of Love Letters in September 2007.\n\nHe appeared in the world premiere of Michael John LaChiusa's musical Giant, at the Signature Theatre, Arlington, Virginia through May 31, 2009. He also played the role of \"Aaron\" in the new musical of The First Wives Club, starting in July 2009 at the Old Globe, San Diego, California.\n\nDossett is married to actress Michele Pawk. The couple met while working together in an off-Broadway musical, Hello Again. They have a son, Jack, born in 2000. They worked together in the musical Mamma Mia! in 2005. The couple have moved to South Orange, New Jersey.\n\nAs of September 2009, Dossett has returned to the Broadway musical Mamma Mia! in the role of Sam Carmichael opposite Tony Award winner Beth Leavel and later Lisa Brescia.",
        "birthday": "1958-04-15",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 123557,
        "imdb_id": "nm0234440",
        "known_for_department": "Acting",
        "name": "John Dossett",
        "place_of_birth": "Louisville, Kentucky, USA",
        "popularity": 0.1308,
        "profile_path": "/4CRJwVXygIZ1FAI4RoCmabs92py.jpg"
    }
}