{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kdkCTC6Cl20TJSf4B1eIJXAFeXl.jpg",
                "genre_ids": [
                    18,
                    10402
                ],
                "id": 86829,
                "original_language": "en",
                "original_title": "Inside Llewyn Davis",
                "overview": "In Greenwich Village in the early 1960s, gifted but volatile folk musician Llewyn Davis struggles with money, relationships, and his uncertain future.",
                "popularity": 2.7765,
                "poster_path": "/nNxK3pC3DMpPpWKMvo2p3liREVT.jpg",
                "release_date": "2013-10-18",
                "title": "Inside Llewyn Davis",
                "video": false,
                "vote_average": 7.192,
                "vote_count": 2792,
                "character": "Marty Green",
                "credit_id": "52fe49a39251416c910b3bbd",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "알렉스 카르포브스키",
            "알렉스 카포브스키"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nAlex Karpovsky is an American director, actor, screenwriter, producer and editor.\n\nAlex Karpovsky's first feature-length film, The Hole Story, was completed in 2006. The critically acclaimed dark comedy garnered numerous awards on the festival circuit before being released theatrically by Indiepix. Karpovsky's follow-up feature, Woodpecker premiered at the 2008 South by Southwest Film Festival and was released by Carnivalesque Films in September 2009. Alex's most recent film, Trust Us, This Is All Made Up, premiered at the 2009 South by Southwest Film Festival and was released by B-Side Entertainment in February 2010 before the company folded a few days later (the film was subsequently released by the New Video Group and continues to air regularly on The Documentary Channel).\n\nAs an actor, Karpovsky recently played the male lead in Beeswax which premiered at the 2009 Berlin International Film Festival; the voices of several Russian gangsters in the video game Grand Theft Auto IV; Mean Man Mike in Harmony and Me, which premiered at the 2009 New Directors/New Films Series; Paul Lucas in Lovers of Hate, which premiered at the 2010 Sundance Film Festival; Vlad in Bass Ackwards, which also premiered at the 2010 Sundance Film Festival; Jed in Tiny Furniture, which premiered at the 2010 South by Southwest Film Festival, where it won the Narrative Jury Prize for Best Feature Film; Paul in The Grownups, which screened at the 2010 Cannes Film Festival, Rookie Agent in Codependent Lesbian Space Alien Seeks Same, which premiered at the 2011 Sundance Film Festival, and Wally Combs in Wuss, which is set to premiere at the 2011 SXSW Film Festival.\n\nKarpovsky also recently acted or is committed to act in the following films, set to be released later in 2011: Almost in Love, Home, Incredibly Small, The Third Day, Marvin Seth and Stanley, and Seven Chinese Brothers. This fall Karpovsky will also appear as Ray in the HBO comedy series Girls.\n\nDescription above from the Wikipedia article Alex Karpovsky, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 123515,
        "imdb_id": "nm1493163",
        "known_for_department": "Acting",
        "name": "Alex Karpovsky",
        "place_of_birth": null,
        "popularity": 0.903,
        "profile_path": "/hz1eUWI0s2SrHbj46BTBsQf9fFA.jpg"
    }
}