{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9EUmwXS6EbY5djAhLtBGzUbBwNV.jpg",
                "genre_ids": [
                    878,
                    12
                ],
                "id": 830,
                "original_language": "en",
                "original_title": "Forbidden Planet",
                "overview": "Starship C57D travels to planet Altair 4 in search of the crew of spaceship \"Bellerophon,\" a scientific expedition that has been missing for twenty years. They find themselves unwelcome by the expedition's lone survivor and warned of destruction by an invisible force if they don't turn back immediately.",
                "popularity": 3.2734,
                "poster_path": "/aq0OQfRS7hDDI8vyD0ICbH9eguC.jpg",
                "release_date": "1956-03-23",
                "title": "Forbidden Planet",
                "video": false,
                "vote_average": 7.253,
                "vote_count": 988,
                "character": "Crewman Strong",
                "credit_id": "5489866ac3a3686f4a001563",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/ctzKCslTsMRsOJNvAm1Mw8ytiHY.jpg",
                "genre_ids": [
                    28,
                    12,
                    35,
                    18,
                    37
                ],
                "id": 9359,
                "original_language": "en",
                "original_title": "Maverick",
                "overview": "Bret Maverick is a gambler who would rather con someone than fight them, and needs an additional $3k in order to enter a winner-takes-all poker game beginning in a few days. He joins forces with a woman with a marvelous Southern accent, and the two try and enter the game.",
                "popularity": 4.5071,
                "poster_path": "/mTVbGGi5PIexmxVzeyFd2RYKwfM.jpg",
                "release_date": "1994-05-20",
                "title": "Maverick",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 1661,
                "character": "Riverboat Poker Player (uncredited)",
                "credit_id": "639fed24223e2000c981be45",
                "order": 62
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "James Child Drury Jr."
        ],
        "biography": "James Child Drury Jr. (April 18, 1934 – April 6, 2020) was an American actor. He is best known for having played the title role in the 90-minute weekly Western television series The Virginian, which was broadcast on NBC from 1962 to 1971.\n\nDrury was born in New York City, the son of James Child Drury and Beatrice Crawford Drury. His father was a New York University professor of marketing.  He grew up between New York City and Salem, Oregon, where his mother owned a farm.  Drury contracted polio at the age of 10.\n\nHe studied drama at New York University and took additional classes at UCLA to complete his degree after he began acting in films at MGM.\n\nOn February 7, 1957, Drury married Cristall Othones, and fathered two sons, Timothy and James III. The couple divorced on November 23, 1964 and on April 27, 1968, he married Phyllis Jacqueline Mitchell; the marriage ended in divorce on January 30, 1979. His third marriage was to Carl Ann Head on July 30, 1979; it lasted until her death on August 25, 2019. Drury had three stepchildren from his previous marriages, a stepdaughter, Rhonda Brown, and two stepsons, Frederick Drury and Gary Schero.  Drury died from natural causes on April 6, 2020.",
        "birthday": "1934-04-18",
        "deathday": "2020-04-06",
        "gender": 2,
        "homepage": null,
        "id": 123524,
        "imdb_id": "nm0238628",
        "known_for_department": "Acting",
        "name": "James Drury",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.4974,
        "profile_path": "/qrGLnFmYsF8F4jsDU0zDegbN57M.jpg"
    }
}