{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tEcojg2mgUe0WS7OLnbOP69h6w.jpg",
                "genre_ids": [
                    53,
                    9648
                ],
                "id": 11963,
                "original_language": "en",
                "original_title": "Three Days of the Condor",
                "overview": "When bookish CIA researcher Joe Turner finds all his co-workers dead, he, together with a woman he has kidnapped, must work together to outwit those responsible until he determines who he can really trust.",
                "popularity": 10.7434,
                "poster_path": "/zinwtZqdb7gnc4zMu8dfkK1fMN3.jpg",
                "release_date": "1975-09-24",
                "title": "Three Days of the Condor",
                "video": false,
                "vote_average": 7.282,
                "vote_count": 1249,
                "character": "Intelligence Officer at Briefing (uncredited)",
                "credit_id": "5ceff04d0e0a266b1dcab4eb",
                "order": 47
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Russell D. Johnson",
            "Russ Johnson"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nRussell David Johnson (November 10, 1924 – January 16, 2014) was an American actor, best known for his role as Professor Roy Hinkley in Gilligan's Island.  Military career\n\nAfter graduating from high school, Johnson enlisted in the United States Army Air Forces as an aviation cadet. On completing his training, he was commissioned a second lieutenant. He flew 44 combat missions in the Pacific Theater during World War II as a bombardier in B-25 twin-engined medium bombers.\n\nOn March 4, 1945, while flying as a navigator in a B-25 with the 100th Bombardment Squadron, 42nd Bombardment Group, 13th Air Force, his B-25 and two others were shot down during a low-level bombing and strafing run against Japanese military targets in the Philippine Islands. The B-25s encountered heavy anti-aircraft fire, and all three had to ditch in the sea off Zamboanga. Johnson broke both ankles in the landing, and his bomber's co-pilot was killed. Johnson received a Purple Heart for his injuries. He was also awarded the Air Medal, the Asiatic-Pacific Campaign Medal with three campaign stars, the Philippine Liberation Ribbon with one campaign star, and the World War II Victory Medal.\n\nAfter Japan's surrender, Johnson was honorably discharged as a first lieutenant on November 22, 1945. He joined the United States Air Force Reserve  and used the G.I. Bill to pay for his acting studies at the Actors' Lab in Hollywood. While there, he met actress Kay Cousins (1923–1980), whom he married in 1949.\n\nHis early roles were primarily in Westerns such as Rancho Notorious (1952, starring Marlene Dietrich), Seminole (1953), Law and Order (1953, opposite Ronald Reagan), and Badman's Country (1958), and science fiction films such as It Came from Outer Space (1953), This Island Earth (1955), Attack of the Crab Monsters (1956), and The Space Children (1958). He also appeared in a Ma and Pa Kettle vehicle, Ma and Pa Kettle at Waikiki (1955), as well as in Roger Corman's rock-'n'-roll crime drama Rock All Night (1957). In 1955, he had a role in Many Rivers to Cross along with Alan Hale Jr., later as the Skipper from Gilligan's Island.\n\n\"The Professor\" on Gilligan's Island\n\nJohnson was best known for playing Professor Roy Hinkley (usually called the \"Professor\"), the very knowledgeable polymath who could build all sorts of inventions out of the most rudimentary materials available on the island. As Johnson himself pointed out, though, he could not fix the hole in the boat. In the first episode of the show, the radio announcer describes the Professor as a research scientist and well-known scoutmaster. Gilligan's Island aired from 1964-67, but has been shown in reruns continuously ever since.  CLR",
        "birthday": "1924-11-10",
        "deathday": "2014-01-16",
        "gender": 2,
        "homepage": null,
        "id": 12355,
        "imdb_id": "nm0426157",
        "known_for_department": "Acting",
        "name": "Russell Johnson",
        "place_of_birth": "Ashley, Pennsylvania, USA",
        "popularity": 0.4988,
        "profile_path": "/lDPl3KlE61o9ROvjsEfeJWYkFhl.jpg"
    }
}