{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mPzUzA0iK50gBdMuux4Dojb7VQL.jpg",
                "genre_ids": [
                    18,
                    37
                ],
                "id": 3110,
                "original_language": "en",
                "original_title": "Shane",
                "overview": "A weary gunfighter attempts to settle down with a homestead family, but a smouldering settler and rancher conflict forces him to act.",
                "popularity": 4.4288,
                "poster_path": "/svr5ADpjXTCOQv8hmuJnB7I14Qv.jpg",
                "release_date": "1953-04-23",
                "title": "Shane",
                "video": false,
                "vote_average": 7.358,
                "vote_count": 649,
                "character": "Axel 'Swede' Shipstead",
                "credit_id": "52fe4387c3a36847f805b1c9",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/a3eYLIK5eYSHAJTtOy9PdciVjxx.jpg",
                "genre_ids": [
                    18
                ],
                "id": 28580,
                "original_language": "en",
                "original_title": "The Lost Weekend",
                "overview": "Don Birnam, a long-time alcoholic, has been sober for ten days and appears to be over the worst... but his craving has just become more insidious. Evading a country weekend planned by his brother and girlfriend, he begins a four-day bender that just might be his last - one way or another.",
                "popularity": 2.7953,
                "poster_path": "/8ggIOoCzt8xT2ePl8DdlRtXgcOh.jpg",
                "release_date": "1945-11-29",
                "title": "The Lost Weekend",
                "video": false,
                "vote_average": 7.628,
                "vote_count": 629,
                "character": "Hospital Patient Seeing Imaginary Beetles (uncredited)",
                "credit_id": "52fe45a3c3a368484e06668b",
                "order": 45
            },
            {
                "adult": false,
                "backdrop_path": "/byQdu1nzQLI9t1VeoP1xuQfru3L.jpg",
                "genre_ids": [
                    80,
                    53
                ],
                "id": 996,
                "original_language": "en",
                "original_title": "Double Indemnity",
                "overview": "A seductive housewife draws an insurance salesman into a plot of adultery and crime to collect on her husband's life insurance.",
                "popularity": 3.5639,
                "poster_path": "/rVNYZZgfhwqVMMWlBmxOfWqnwCj.jpg",
                "release_date": "1944-07-06",
                "title": "Double Indemnity",
                "video": false,
                "vote_average": 8.106,
                "vote_count": 1902,
                "character": "Lou Schwartz (uncredited)",
                "credit_id": "549d356dc3a3682f230057d5",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "William Henry Mesenkop"
        ],
        "biography": "Douglas Spencer (born July 4, 1910 – March 5, 1960) was an American actor, best known for his roles in classic science fiction films and film noirs during the 1940s and 1950s.\n\nSpencer was born in Baltimore, Maryland. He was drawn to the entertainment industry early on and began his career in theater before transitioning to films. He often played characters with a tough, no-nonsense edge, making him a popular choice for a variety of roles in films of the time.\n\nSpencer's big break came when he landed a role in the influential science fiction film *The Thing from Another World* (1951), directed by Christian Nyby and produced by Howard Hawks. In the film, Spencer played the role of a reporter named Ned Scott, who is among the group of scientists and military personnel investigating a mysterious alien threat in the Arctic. *The Thing from Another World* became a classic of the genre and remains one of Spencer’s most memorable roles.\n\nIn addition to his work in science fiction, Spencer appeared in several other films across a range of genres. He was frequently cast in supporting roles in film noirs, thrillers, and dramas, and his distinctive, gravelly voice and sharp screen presence made him a recognizable face in Hollywood.\n\nOther notable films he appeared in include *The Big Clock* (1948), a crime thriller directed by John Farrow, and *The Green Glove* (1952), a suspenseful drama.\n\nDouglas Spencer was married to actress *Ann Wedgeworth*, and their marriage lasted for several years. After the height of his film career, Spencer continued working in television and on stage, although he never achieved the same level of fame as some of his contemporaries.\n\nSpencer’s career was cut short when he died from cancer at the age of 49, on March 5, 1960. Despite his relatively brief career, he remains fondly remembered by fans of classic sci-fi and noir films.\n\nDouglas Spencer's legacy is primarily tied to his memorable performance in *The Thing from Another World*, but his work across various genres helped solidify him as a dependable and versatile character actor in Hollywood during the 1940s and 1950s. His contributions to the sci-fi and noir genres continue to be appreciated by film enthusiasts today.",
        "birthday": "1910-02-10",
        "deathday": "1960-10-06",
        "gender": 2,
        "homepage": null,
        "id": 12356,
        "imdb_id": "nm0817930",
        "known_for_department": "Acting",
        "name": "Douglas Spencer",
        "place_of_birth": "Princeton, Illinois, USA",
        "popularity": 0.3616,
        "profile_path": "/mQA73ta5CoYSM5CiNYe6EHPEoDT.jpg"
    }
}