{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5mct2hhoprq2dLTy7NHyGJNgaud.jpg",
                "genre_ids": [
                    18,
                    35,
                    10749
                ],
                "id": 1544,
                "original_language": "en",
                "original_title": "Imagine Me & You",
                "overview": "During her wedding ceremony, Rachel notices Luce in the audience and feels instantly drawn to her. The two women become close friends, and when Rachel learns that Luce is a lesbian, she realizes that despite her happy marriage to Heck, she is falling for Luce. As she questions her sexual orientation, Rachel must decide between her stable relationship with Heck and her exhilarating new romance with Luce.",
                "popularity": 4.3575,
                "poster_path": "/oF0wgVKumU52W7nBR6oHJb5FqSa.jpg",
                "release_date": "2006-01-27",
                "title": "Imagine Me & You",
                "video": false,
                "vote_average": 7.579,
                "vote_count": 1068,
                "character": "David Steele",
                "credit_id": "5e45c8f80c2710001885ee4c",
                "order": 20
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/utChUdMhCEWKjHTc8DO5aK8dUVS.jpg",
                "genre_ids": [
                    10751,
                    16,
                    12,
                    35
                ],
                "id": 520758,
                "original_language": "en",
                "original_title": "Chicken Run: Dawn of the Nugget",
                "overview": "A band of fearless chickens flock together to save poultry-kind from an unsettling new threat: a nearby farm that's cooking up something suspicious.",
                "popularity": 6.1053,
                "poster_path": "/exNtEY8QUuQh9e23wSQjkPxKIU3.jpg",
                "release_date": "2023-12-08",
                "title": "Chicken Run: Dawn of the Nugget",
                "video": false,
                "vote_average": 6.947,
                "vote_count": 825,
                "credit_id": "657d04a5cf48a103cf9999ed",
                "department": "Crew",
                "job": "Additional Writing"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Benjamin Thomas Willbond (born 18 January 1973) is an English actor and screenwriter. He is best known for his numerous roles in a  children’s program Horrible Histories (2009–2013), as well as Yonderland (2013–2016), where he also played various different roles, and Ghosts (2019–) where he played The Captain. He is also known for appearing in movies such as St. Trinian's (2007), Bill (2015), and Bridget Jones's Baby (2016).\n\nHe was part of the comedy duo \"Ben & Arn\", for which he won Perrier Award for \"Best Newcomer\" in 1999, and formed the self-proclaimed \"thinking man's French pop duo\" Priorité à Gauche. He then went on to perform his solo character shows at several Edinburgh Fringe Festivals.\n\nHe is best known for his regular role in CBBC's Horrible Histories, in which he played a wide variety of historical figures, most memorably recurring roles as Henry VIII and Alexander the Great. He is also the co-creator, -writer and -star of Yonderland, a family fantasy comedy series that premiered on SkyOne on 10 November 2013. In addition, he is the co-writer of Bill, a BBC-produced comedy film based loosely around the early life of William Shakespeare. Other notable television work includes the recurring roles of Steve Warwick in the BBC comedy Rev, Adam Kenyon in BBC Four's The Thick of It and as a television director in the movie-length final episode of the Ricky Gervais comedy Extras (BBC Two). He has also appeared in Katy Brand's Big Ass Show for ITV2 and Mayo for BBC One.\n\nHis 2010 short film Tooty's Wedding, which he co-wrote with Solon, won numerous international comedy awards and was screened as part of the 2012 Sundance Film Festival. Other notable film work includes the movie Starter for 10 (2006). In 2007, and he had a short appearance in St Trinian's as a nervous school inspector.\n\nDescription above is from the Wikipedia article Ben Willbond, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1973-01-18",
        "deathday": null,
        "gender": 2,
        "homepage": "https://benwillbond.com/",
        "id": 1236982,
        "imdb_id": "nm1941093",
        "known_for_department": "Acting",
        "name": "Ben Willbond",
        "place_of_birth": "Buckinghamshire, England, UK",
        "popularity": 0.1957,
        "profile_path": "/lPbG2095GBoUkmpw6A2IbiyEnjV.jpg"
    }
}