{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2vq5GTJOahE03mNYZGxIynlHcWr.jpg",
                "genre_ids": [
                    18,
                    28,
                    36
                ],
                "id": 359724,
                "original_language": "en",
                "original_title": "Ford v Ferrari",
                "overview": "American car designer Carroll Shelby and the British-born driver Ken Miles work together to battle corporate interference, the laws of physics, and their own personal demons to build a revolutionary race car for Ford Motor Company and take on the dominating race cars of Enzo Ferrari at the 24 Hours of Le Mans in France in 1966.",
                "popularity": 13.8559,
                "poster_path": "/dR1Ju50iudrOh3YgfwkAU1g2HZe.jpg",
                "release_date": "2019-11-13",
                "title": "Ford v Ferrari",
                "video": false,
                "vote_average": 8.007,
                "vote_count": 8493,
                "character": "Denny Hulme",
                "credit_id": "5e0500d6d1a893001994ddbc",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "The Stig",
            "Ben 'The Stig' Collins"
        ],
        "biography": "Benjamin Lievesley Collins (born February 13, 1975) is a racing driver from Bristol, UK. He has competed in motor racing since 1994 in many categories, from Formula Three and Indy Lights to sportscars, GT racing and stock cars.\n\nCollins was placed second in the Marlboro Masters Formula 3 championship event in 2000. He set the pace at the 2001 Le Mans 24 hours race in his first season for approximately four hours during the rain at night. After winning the European Stock Car Championship in 2003 ASCAR stock car racing he was signed by PDM Racing to do selected rounds of the 2004 Indy Racing League, but the car never appeared. In 2005, he competed in the British GT Championship in a Porsche 996 GT3, winning races on the way before moving up to the FIA GT Series with Ascari where he led races and scored several pole positions.\n\nIn addition to racing, Collins' company Collins Autosport Limited provides precision and stunt driving services, particularly for BBC Television, including Top Gear and Top Gear Live, as well as for the film industry, such as driving James Bond's car in Quantum of Solace and Casino Royale, and Eve Moneypenny's car in Skyfall.",
        "birthday": "1975-02-13",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1236941,
        "imdb_id": "nm3480266",
        "known_for_department": "Acting",
        "name": "Ben Collins",
        "place_of_birth": "Bristol, Avon, England, UK",
        "popularity": 0.0538,
        "profile_path": "/wD2YERFOIqmZlf5KRxyTR6GFAWa.jpg"
    }
}