{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5fxTB08O7CW1hAcN2MWOKodp1h1.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 615777,
                "original_language": "en",
                "original_title": "Babylon",
                "overview": "A tale of outsized ambition and outrageous excess, tracing the rise and fall of multiple characters in an era of unbridled decadence and depravity during Hollywood's transition from silent films to sound films in the late 1920s.",
                "popularity": 10.7094,
                "poster_path": "/wjOHjWCUE0YzDiEzKv8AfqHj3ir.jpg",
                "release_date": "2022-12-22",
                "title": "Babylon",
                "video": false,
                "vote_average": 7.38,
                "vote_count": 3486,
                "character": "Fan (Autograph)",
                "credit_id": "6377d37e0284200075e31b23",
                "order": 58
            },
            {
                "adult": false,
                "backdrop_path": "/xKtWcQD2yugIKz49LvZNHdLM09T.jpg",
                "genre_ids": [
                    35,
                    18,
                    10752
                ],
                "id": 256962,
                "original_language": "en",
                "original_title": "Little Boy",
                "overview": "An eight-year-old boy is willing to do whatever it takes to end World War II so he can bring his father home. The story reveals the indescribable love a father has for his little boy and the love a son has for his father.",
                "popularity": 2.9389,
                "poster_path": "/lAU9pgq3niI6sFemcKm4FGGmrnW.jpg",
                "release_date": "2015-04-23",
                "title": "Little Boy",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 544,
                "character": "Sir Pent",
                "credit_id": "55fe1c5292514152a200205b",
                "order": 19
            },
            {
                "adult": false,
                "backdrop_path": "/adM7v1IbTXRKuE4AlQ5VyM5GQpt.jpg",
                "genre_ids": [
                    35,
                    10751,
                    14,
                    10402
                ],
                "id": 407655,
                "original_language": "en",
                "original_title": "A Cinderella Story: If the Shoe Fits",
                "overview": "A contemporary musical version of the classic Cinderella story in which the servant step daughter hope to compete in a musical competition for a famous pop star.",
                "popularity": 3.7509,
                "poster_path": "/qtxOA6Sb8lK1PfRiwduxYVuzaEv.jpg",
                "release_date": "2016-08-02",
                "title": "A Cinderella Story: If the Shoe Fits",
                "video": false,
                "vote_average": 7.181,
                "vote_count": 847,
                "character": "Freddie Marks",
                "credit_id": "5b91b9b8c3a3681bea000a96",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/uozb2VeD87YmhoUP1RrGWfzuCrr.jpg",
                "genre_ids": [
                    28,
                    80
                ],
                "id": 495764,
                "original_language": "en",
                "original_title": "Birds of Prey (and the Fantabulous Emancipation of One Harley Quinn)",
                "overview": "Harley Quinn joins forces with a singer, an assassin and a police detective to help a young girl who had a hit placed on her after she stole a rare diamond from a crime lord.",
                "popularity": 10.1076,
                "poster_path": "/h4VB6m0RwcicVEZvzftYZyKXs6K.jpg",
                "release_date": "2020-02-05",
                "title": "Birds of Prey (and the Fantabulous Emancipation of One Harley Quinn)",
                "video": false,
                "vote_average": 6.893,
                "vote_count": 10528,
                "character": "Sleazy Breeder",
                "credit_id": "5f885f1ae33f83003afdcd74",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "David Brian Ury (born September 30, 1973) is an American actor, stand-up comedian, YouTuber, and Japanese translation specialist.\n\nUry was born and raised in Sonoma, California. He graduated from Sonoma Valley High School, where he acted in theatre productions. He earned a bachelor's degree in linguistics at Evergreen State College in Olympia, Washington and studied abroad in Japan, where he became fluent in Japanese. Ury is a descendant of German Jewish impressionist painter Lesser Ury.\n\nSince studying abroad in Tokyo, Ury and has worked as a translator in film, television, and manga and currently (As of May 2011) translates and writes English adaptations for manga. Ury moved to Los Angeles in August 2001 where he began performing stand-up comedy. Cartoonist Keith Knight, a neighbor of his, described Ury's acting career as \"Spooge man\" and \"a cavalcade of reprobates, sleazeballs, derelicts, & weirdos.\"\n\nUry has made several film and television appearances, including an episode of Tim Kring's Crossing Jordan and in Shoot 'Em Up. He also appeared in Heroes, Malcolm in the Middle, Life, Without a Trace, Breaking Bad, Better Call Saul, Zeke and Luther, and The Librarians. In March 2015, Ury was cast for Rob Zombie's slasher film 31 as Schizo-Head. A character actor, Ury has died on screen in almost every role he has portrayed.\n\nUry also has several YouTube channels/accounts/personalities and alter-egos, which include Karaoke Steve and Ken Tanaka, the fictional adopted twin brother of David Ury. Tanaka is described as an Ashkenazi Jewish man adopted as an infant by Japanese parents Hideo and Mari Tanaka, and raised in Shimane Prefecture of Japan; he returns to Los Angeles to find his birth parents Jonathan and Linda Smith.",
        "birthday": "1973-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1237876,
        "imdb_id": "nm1352845",
        "known_for_department": "Acting",
        "name": "David Ury",
        "place_of_birth": null,
        "popularity": 0.5569,
        "profile_path": "/7PxPrnttpomJ9FuX4iSUwapRqR3.jpg"
    }
}