{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yvPbncYhMu9FfTjDhq0N5lgnVkO.jpg",
                "genre_ids": [
                    35,
                    10749,
                    18
                ],
                "id": 4951,
                "original_language": "en",
                "original_title": "10 Things I Hate About You",
                "overview": "On the first day at his new school, Cameron instantly falls for Bianca, the gorgeous girl of his dreams. The only problem is that Bianca is forbidden to date until her ill-tempered, completely un-dateable older sister Kat goes out, too. In an attempt to solve his problem, Cameron singles out the only guy who could possibly be a match for Kat: a mysterious bad boy with a nasty reputation of his own.",
                "popularity": 11.6305,
                "poster_path": "/ujERk3aKABXU3NDXOAxEQYTHe9A.jpg",
                "release_date": "1999-03-30",
                "title": "10 Things I Hate About You",
                "video": false,
                "vote_average": 7.595,
                "vote_count": 8523,
                "character": "Letters To Cleo Singer",
                "credit_id": "54f9d9419251414392001c6d",
                "order": 42
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/yvPbncYhMu9FfTjDhq0N5lgnVkO.jpg",
                "genre_ids": [
                    35,
                    10749,
                    18
                ],
                "id": 4951,
                "original_language": "en",
                "original_title": "10 Things I Hate About You",
                "overview": "On the first day at his new school, Cameron instantly falls for Bianca, the gorgeous girl of his dreams. The only problem is that Bianca is forbidden to date until her ill-tempered, completely un-dateable older sister Kat goes out, too. In an attempt to solve his problem, Cameron singles out the only guy who could possibly be a match for Kat: a mysterious bad boy with a nasty reputation of his own.",
                "popularity": 11.6305,
                "poster_path": "/ujERk3aKABXU3NDXOAxEQYTHe9A.jpg",
                "release_date": "1999-03-30",
                "title": "10 Things I Hate About You",
                "video": false,
                "vote_average": 7.595,
                "vote_count": 8523,
                "credit_id": "659382a64f9a997447780d8b",
                "department": "Sound",
                "job": "Songs"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Kay Hanley began her career in music as the lead singer of Boston-based alternative rock band Letters to Cleo, releasing 3 acclaimed albums between 1990-2000, and spawning such hits as Awake and Here and Now. After a 16-year hiatus, Letters To Cleo reunited in 2016 to release new music and embark on several sold-out US tours and beginning work on their 4th full length studio album. In the late 90's, Ms. Hanley began expanding her work as a singer and songwriter into the TV and film world, writing songs for WB's animated series Generation O, providing the singing voice for Rachael Leigh Cook's character Josie in Universal Pictures' feature film Josie and the Pussycats and performing cover versions of Nick Lowe's Cruel to be Kind and Cheap Trick's I Want You To Want Me in Touchstone Pictures' hit film, 10 Things I Hate About You. In 2016 she appeared as herself on NBC's Park and Recreation and performed at the fictional Pawnee/Eagleton Unity Concert. Hanley is a Peabody Award winning songwriter for animated television, penning original songs for shows like Disney Junior's hit series Vampirina and Doc McStuffins, Dreamworks' Harvey Street Kids, WB/Cartoon Network's DC Super Hero Girls Netflix series, Ada Twist, Scientist. Ms. Hanley is co-executive director of Songwriters Of North America (SONA), a non-profit advocacy organization that fights to protect the value of songs and songwriters in a rapidly changing music business. As a result of her advocacy work, Hanley was chosen to represent songwriters on the Mechanical Licensing Collective, serving as vice-chair of the Unclaimed Royalties Oversight Committee.",
        "birthday": "1968-09-11",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1238557,
        "imdb_id": "nm0360089",
        "known_for_department": "Acting",
        "name": "Kay Hanley",
        "place_of_birth": "Dorchester, Massachusetts, USA",
        "popularity": 0.5321,
        "profile_path": "/whtOHcoRrGwzWGj3baEvF5Edt7m.jpg"
    }
}