{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hgESQ2sK21j22Yode4w99jfwj44.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 491418,
                "original_language": "en",
                "original_title": "Instant Family",
                "overview": "When Pete and Ellie decide to start a family, they stumble into the world of foster care adoption. They hope to take in one small child but when they meet three siblings, including a rebellious 15 year old girl, they find themselves speeding from zero to three kids overnight.",
                "popularity": 4.4738,
                "poster_path": "/xYV1mODz99w7AjKDSQ7h2mzZhVe.jpg",
                "release_date": "2018-11-13",
                "title": "Instant Family",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 3099,
                "character": "Russ",
                "credit_id": "5aea280492514172ae00101a",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Tom Segura (born April 16, 1979) is an American comedian from Cincinnati, Ohio. He currently lives in Los Angeles, California.\n\nSegura was born April 16, 1979 and originally lived in Dayton, Ohio. He also lived in Minneapolis, Milwaukee, and Vero Beach, Florida. He has been performing as a comedian since shortly after he graduated from Lenoir-Rhyne University. Segura has performed at the Melbourne International Comedy Festival, The Comedy Festival, the Global Comedy Festival in Vancouver, Just For Laughs Comedy Festival, the South Beach Comedy Festival. Tom was also a San Francisco regional finalist on Last Comic Standing 2.\n\nSegura is a member of the Deathsquad Network of standup comedians.\n\nWhen he was 18, Segura overdosed on GHB and fell into a short coma.\n\nHe has two sisters.\n\nSegura is married to comedian Christina Pazsitzky. In 2015, they had their first child together. Tom also speaks Spanish fluently.",
        "birthday": "1979-04-16",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1238012,
        "imdb_id": "nm2660044",
        "known_for_department": "Acting",
        "name": "Tom Segura",
        "place_of_birth": "Cincinnati, Ohio, USA",
        "popularity": 0.4807,
        "profile_path": "/pTZX2QXdUeJ1bvEWqKYsCF2HKkS.jpg"
    }
}