{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6OpluXPGIE8hfVrhpeygR7p4XwR.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 7350,
                "original_language": "en",
                "original_title": "The Bucket List",
                "overview": "Corporate billionaire Edward Cole and working class mechanic Carter Chambers are worlds apart. At a crossroads in their lives, they share a hospital room and discover they have two things in common: a desire to spend the time they have left doing everything they ever wanted to do and an unrealized need to come to terms with who they are. Together they embark on the road trip of a lifetime, becoming friends along the way and learning to live life to the fullest, with insight and humor.",
                "popularity": 6.6812,
                "poster_path": "/idbNSe8zsYKQL97dJApfOrDSdya.jpg",
                "release_date": "2007-12-25",
                "title": "The Bucket List",
                "video": false,
                "vote_average": 7.191,
                "vote_count": 3910,
                "character": "Instructor",
                "credit_id": "52fe447bc3a36847f8098ce1",
                "order": 12
            },
            {
                "adult": false,
                "backdrop_path": "/iuRVt8tFiXDPGgzavhuSa3QHRxD.jpg",
                "genre_ids": [
                    35
                ],
                "id": 18785,
                "original_language": "en",
                "original_title": "The Hangover",
                "overview": "When three friends finally come to after a raucous night of bachelor-party revelry, they find a baby in the closet and a tiger in the bathroom. But they can't seem to locate their best friend, Doug – who's supposed to be tying the knot. Launching a frantic search for Doug, the trio perseveres through a nasty hangover to try to make it to the church on time.",
                "popularity": 20.2069,
                "poster_path": "/A0uS9rHR56FeBtpjVki16M5xxSW.jpg",
                "release_date": "2009-06-02",
                "title": "The Hangover",
                "video": false,
                "vote_average": 7.327,
                "vote_count": 17494,
                "character": "Chow's #1",
                "credit_id": "5451f4dc0e0a263a18006040",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "ایان آنتونی دیل"
        ],
        "biography": "Ian Anthony Dale (born July 3, 1978) is an American actor. Born in Saint Paul, Minnesota, he attended school in Madison, Wisconsin. He is of Japanese, French and English descent. Dale currently stars as Simon Lee on The Event, and was previously known for playing Davis Lee on Surface and his recurring role on Charmed as Avatar Gamma. He has also appeared on shows such as Las Vegas, JAG, Day Break, CSI: Crime Scene Investigation, Criminal Minds, in 2007 he appeared in 24 as the minor character Zhou and is well known for playing Kazuya Mishima in Tekken.\n\nDescription above from the Wikipedia article Ian Anthony Dale, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1978-07-03",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 123813,
        "imdb_id": "nm1406333",
        "known_for_department": "Acting",
        "name": "Ian Anthony Dale",
        "place_of_birth": "St. Paul, Minnesota, USA",
        "popularity": 1.1946,
        "profile_path": "/x5ePN7j7C4ZmytO5VoUOpiPEyRm.jpg"
    }
}