{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6n53UI4mX9QMfe2S0Pgt8mGebY1.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 194,
                "original_language": "fr",
                "original_title": "Le Fabuleux Destin d'Amélie Poulain",
                "overview": "At a tiny Parisian café, the adorable yet painfully shy Amélie accidentally discovers a gift for helping others. Soon Amelie is spending her days as a matchmaker, guardian angel, and all-around do-gooder. But when she bumps into a handsome stranger, will she find the courage to become the star of her very own love story?",
                "popularity": 9.2209,
                "poster_path": "/nSxDa3M9aMvGVLoItzWTepQ5h5d.jpg",
                "release_date": "2001-04-25",
                "title": "Amélie",
                "video": false,
                "vote_average": 7.913,
                "vote_count": 11932,
                "character": "Frédéric Mitterrand (voice)",
                "credit_id": "56042deb92514122cd0061ad",
                "order": 67
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/6n53UI4mX9QMfe2S0Pgt8mGebY1.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 194,
                "original_language": "fr",
                "original_title": "Le Fabuleux Destin d'Amélie Poulain",
                "overview": "At a tiny Parisian café, the adorable yet painfully shy Amélie accidentally discovers a gift for helping others. Soon Amelie is spending her days as a matchmaker, guardian angel, and all-around do-gooder. But when she bumps into a handsome stranger, will she find the courage to become the star of her very own love story?",
                "popularity": 9.2209,
                "poster_path": "/nSxDa3M9aMvGVLoItzWTepQ5h5d.jpg",
                "release_date": "2001-04-25",
                "title": "Amélie",
                "video": false,
                "vote_average": 7.913,
                "vote_count": 11932,
                "credit_id": "5603603392514122c0003554",
                "department": "Crew",
                "job": "Thanks"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Frédéric Mitterrand (born 21 August 1947) is a French politician who served as Minister of Culture and Communication of France from 2009 to 2012 under President Nicolas Sarkozy. Throughout his career, he has been an actor, screenwriter, television presenter, writer, producer and director.\n\nBorn in Paris, he is the nephew of François Mitterrand, who was the president of France from 1981 to 1995, and the son of engineer Robert Mitterrand (1915–2002) and Edith Cahier, the niece of Eugène Deloncle, the co-founder of \"La Cagoule\".\n\nHe attended the Lycée Janson de Sailly in Paris and studied history and geography at the Paris West University Nanterre La Défense, and political science at Sciences Po. He taught economics, history and geography at EABJM from 1968 to 1971. In 1978, he was a film critic at J'informe. From 1971 to 1986, he ran several art film cinemas in Paris (Olympic Palace, Entrepôt and Olympic-Entrepôt). He also had roles in a number of films, and in the 1980s was active as a producer and director in TV productions.\n\nIn June 2008, Mitterrand was appointed as the director of the French Academy in Rome by President Nicolas Sarkozy.\n\nA year later, on 23 June 2009, Mitterrand was appointed to the French government as the Minister of Culture and Communications until May 2012.\n\nMitterrand, who is openly bisexual, writes a monthly column for Têtu.\n\nMitterrand's autobiographical novel The Bad Life (French: La mauvaise vie) was a best seller in 2005. In the book he details his \"delight\" whilst visiting the male brothels of Bangkok, and writes, \"I got into the habit of paying for boys ... The profusion of young, very attractive and immediately available boys put me in a state of desire I no longer needed to restrain or hide.\" At the time of its release Mitterrand was applauded for his honesty, but he has had to defend his writings after he publicly defended Roman Polanski when Polanski was detained in Switzerland on an American request for extradition for raping a thirteen-year-old girl.\n\nOn 5 October 2009, Marine Le Pen of the French National Front Party quoted sections of the book on French television, accusing him of having sex with underage boys and engaging in \"sex tourism\", demanding that Mitterrand resign his position as culture minister. Amongst others he was also criticised by the Socialist Party spokesman Benoît Hamon, who stated: \"As a minister of culture he has drawn attention to himself by defending a film maker and he has written a book where he said he took advantage of sexual tourism. To say the least, I find it shocking.\" On the other hand, some conservatives supported Mitterrand, and a close aide to Nicolas Sarkozy said the French President backed his Culture Minister, describing the controversy around him as \"pathetic\". ...\n\nSource: Article \"Frédéric Mitterrand\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1947-08-21",
        "deathday": "2024-03-21",
        "gender": 2,
        "homepage": null,
        "id": 123827,
        "imdb_id": "nm0594158",
        "known_for_department": "Acting",
        "name": "Frédéric Mitterrand",
        "place_of_birth": "Paris, France",
        "popularity": 0.0513,
        "profile_path": "/fWKLZgrkI6QGNimrssOJmiykZw9.jpg"
    }
}