{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/stiGp1XzkLSYdUUEWTyQOZRkr49.jpg",
                "genre_ids": [
                    18
                ],
                "id": 3782,
                "original_language": "ja",
                "original_title": "生きる",
                "overview": "Kanji Watanabe is a middle-aged man who has worked in the same monotonous bureaucratic position for decades. Learning he has cancer, he starts to look for the meaning of his life.",
                "popularity": 4.3494,
                "poster_path": "/dgNTS4EQDDVfkzJI5msKuHu2Ei3.jpg",
                "release_date": "1952-10-09",
                "title": "Ikiru",
                "video": false,
                "vote_average": 8.305,
                "vote_count": 1234,
                "character": "Tatsu Watanabe",
                "credit_id": "558b1d5bc3a3687e5600020b",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "浦邊粂子"
        ],
        "biography": "Kumeko Urabe (Japanese: 浦辺粂子), born Kimura Kume ((木村 くめ)), (October 5, 1902 – October 26, 1989) was a Japanese movie actress, one of the first in the country. She worked on stage and in film and television. Urabe was born in a rural part of the Shizuoka Prefecture. She lived in several homes while growing up, as she relocated with her father, a Buddhist priest, among the temples to which he was assigned. Urabe completed her education in Numazu, and left school in 1919 to join a theatre company, touring under various stage names as an actor and dancer.\n\nIn 1923, Urabe auditioned at the film studio Nikkatsu, and adopted the name Kumeko Urabe, by which she was known for the rest of her life. She appeared in her first film the following year, and continued to act until 1987. She worked with such directors as Kenji Mizoguchi and Mikio Naruse, and performed in over 320 films, including Ikiru, Older Brother, Younger Sister, Portrait of Madame Yuki, She Was Like a Wild Chrysanthemum, and Street of Shame. She also starred in television dramas, including thirteen episodes of Toshiba Sunday Theatre between 1958 and 1980. In the following decade, she carved a niche as a Grandma idol, until her death in 1989.",
        "birthday": "1902-10-05",
        "deathday": "1989-10-26",
        "gender": 1,
        "homepage": null,
        "id": 123858,
        "imdb_id": "nm0881540",
        "known_for_department": "Acting",
        "name": "Kumeko Urabe",
        "place_of_birth": "Shizuoka, Shizuoka Prefecture, Japan",
        "popularity": 0.2751,
        "profile_path": "/ouqaV2IjEgBoBLgz62S47NEezT.jpg"
    }
}