{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2aGtsMLVOiBiAUwQmCqYgau5AJF.jpg",
                "genre_ids": [
                    27,
                    35
                ],
                "id": 10779,
                "original_language": "en",
                "original_title": "The Frighteners",
                "overview": "Once an architect, Frank Bannister now passes himself off as an exorcist of evil spirits. To bolster his facade, he claims his \"special\" gift is the result of a car accident that killed his wife. But what he does not count on is more people dying in the small town where he lives. As he tries to piece together the supernatural mystery of these killings, he falls in love with the wife of one of the victims and deals with a crazy FBI agent.",
                "popularity": 3.0831,
                "poster_path": "/zcJbCMwFLJdn5OLjhYwMVaSB32R.jpg",
                "release_date": "1996-07-18",
                "title": "The Frighteners",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 1618,
                "character": "Dr. Kamins",
                "credit_id": "6419a3e8e004a600b8a66c44",
                "order": 25
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Atreus"
        ],
        "biography": "Kenneth Colster Blackburn MNZM (born 1935) is a New Zealand actor and writer. He has worked in film, television, radio and theatre in New Zealand, Australia, and the United Kingdom since 1972.\n\nIn an impressively wide-ranging career spanning more than 40 years Ken has worked in film, television, radio and theatre.  Ken has appeared in many of New Zealand’s most iconic TV shows including Xena: Warrior Princess, Farscape, Close To Home, Gliding On and Shortland Street.  His film credits include pioneering feature Skin Deep, The Frighteners, King Kong and Rest for the Wicked. Ken’s stage credits are also extensive. In 1999 his performance as Vladimir in Waiting for Godot earned him the Best Actor award at the Chapman Tripp Theatre Awards. In 2005 he was awarded the Queen's Birthday Honours List for Services to the Performing Arts. Ken most recently performed in Circa Theatre’s 2017 production of Three Days in the Country. As well as his successful career as an actor in New Zealand, the UK and Australia, Ken has also directed stage, film, television and radio productions. His autobiographical book Blitz Kids was published by the BBC in 1995.",
        "birthday": "1935-06-06",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.aucklandactors.co.nz/actors/details/ken-blackburn",
        "id": 1239572,
        "imdb_id": "nm0085612",
        "known_for_department": "Acting",
        "name": "Ken Blackburn",
        "place_of_birth": "Horfield, Bristol, England, UK",
        "popularity": 0.0736,
        "profile_path": "/nc2QPYu59vWv35w7GGm23vix5Cg.jpg"
    }
}