{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mBh3NXCkSCasZGovzAuc9UlFCru.jpg",
                "genre_ids": [
                    14,
                    12,
                    35
                ],
                "id": 14506,
                "original_language": "en",
                "original_title": "The Adventures of Baron Munchausen",
                "overview": "An account of Baron Munchausen's supposed travels and fantastical experiences with his band of misfits.",
                "popularity": 3.778,
                "poster_path": "/oiOwGRqwrKpg1EMUlPgRjVC49bn.jpg",
                "release_date": "1988-12-07",
                "title": "The Adventures of Baron Munchausen",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 947,
                "character": "Gunner",
                "credit_id": "6290b738ecbde90b60ff6f2f",
                "order": 24
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Michael Polley is the Anglo-Canadian actor best known for his connection to the actress-director Sarah Polley, the offspring of his late wife, Diane Polley. Michael Polley was born in England in 1933 and studied acting during the 1950s; one of his classmates was Albert Finney, who compared the profession of acting to that of bricklaying. Polley emigrated to Canada, settling in the Toronto metropolitan area, and practiced his craft on the stage. He married the former Diane MacMillian and the couple had four children, including the actor Mark Polley and producer John Buchan (their other children are a lawyer and a university professor), before Sarah entered the world when both were in their forties. Although Diane Polley was a professional actress, she made a name for herself as a casting director, and it was in that capacity that she launched her daughter Sarah's career when the precocious tyke was four (brother Mark had been a child actor, also). Both Michael and Diane objected to her pursuit of an acting career at so tender an age, but the young Sarah insisted and they relented. Michael Polley supported his family as an insurance agent, but when young Sarah's career took off, he was there for her, acting as a guardian for her on sets, such as Terry Gilliam's The Adventures of Baron Munchausen (1988), in which he had a bit part. Michael is best-known as an actor for his recurring role as the town doctor on his daughter's TV series Avonlea (1990). Still acting in his seventies, Michael recently was cast in a major part in Sarah's TV-series directorial debut, The Shields Stories (2004).",
        "birthday": "1933-01-01",
        "deathday": "2018-03-30",
        "gender": 2,
        "homepage": null,
        "id": 1239390,
        "imdb_id": "nm0689574",
        "known_for_department": "Acting",
        "name": "Michael Polley",
        "place_of_birth": "Bath, Somerset, England",
        "popularity": 0.0939,
        "profile_path": null
    }
}