{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cAZ87S5bONxKMMAlPxK8LZvdOcm.jpg",
                "genre_ids": [
                    18,
                    53,
                    9648
                ],
                "id": 345,
                "original_language": "en",
                "original_title": "Eyes Wide Shut",
                "overview": "After Dr. Bill Harford's wife, Alice, admits to having sexual fantasies about a man she met, Bill becomes obsessed with having a sexual encounter. He discovers an underground sexual group and attends one of their meetings -- and quickly discovers that he is in over his head.",
                "popularity": 9.3248,
                "poster_path": "/knEIz1eNGl5MQDbrEAVWA7iRqF9.jpg",
                "release_date": "1999-07-16",
                "title": "Eyes Wide Shut",
                "video": false,
                "vote_average": 7.483,
                "vote_count": 6576,
                "character": "Masked Party Principal",
                "credit_id": "62f8f4f6e323f30080d0ef38",
                "order": 48
            }
        ],
        "crew": []
    },
    "details": {
        "adult": true,
        "also_known_as": [
            "Tony De Sergio",
            "Tony Disergio",
            "Allen",
            "Paul Skinback",
            "Toni D.",
            "Tony DeSergio",
            "Toni De Sergio",
            "Jay Alexander",
            "Tony Desergio",
            "Toni DeSergio",
            "Tony D'Sergio"
        ],
        "biography": "Recognized as one of the adult film industry's most consistent performers, Tony De Sergio has etched a incredibly impressive legacy in the business during his over-a-decade-long career. Born in England on July 19, 1966, Tony also spent 6 years, raised in Spain. More importantly is the career he began in the adult entertainment field which started around 1993 where he established his supremacy on the European level. Around the new millennium period, namely 2005 marked the big move for De Sergio, crossing over from Europe over to the heart of erotic filming world: California. Much like the success he experienced in Europe and the United Kingdom, De Sergio extended his successful career on an American capacity. As with previous work in his career, De Sergio has been associated with top production companies both in the UK and European circuits and of course in the United States. He has been easily favored for his physique (maintained by a regimen of 5-day work-out sessions) and endowment quality as well as his overall skill as a performer. De Sergio mentions his favorite cast mates include Bree Olson, Veronica Rayne, Stormy Daniels, Tori Black, Shyla Stylez, Eva Angelina and Roxy Jezel. He describes himself as being Funny, real, lascivious, flirtatious, British, down to earth. With such a vast knowledge, rich with varied experiences on the industry, De Sergio is perhaps one of the most honest stars one could ever talk to in relation to what life and work is like in the adult film world.",
        "birthday": "1966-07-19",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 124044,
        "imdb_id": "nm0221127",
        "known_for_department": "Acting",
        "name": "Tony De Sergio",
        "place_of_birth": "Leicester, England, UK",
        "popularity": 1.4,
        "profile_path": "/aAhCj3zyTKDwXJFbjyPMj2CLD1d.jpg"
    }
}