{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jynfI114q3kOAbIiVjVfFFmttU2.jpg",
                "genre_ids": [
                    80,
                    18,
                    28
                ],
                "id": 101,
                "original_language": "fr",
                "original_title": "Léon",
                "overview": "Léon, the top hit man in New York, has earned a rep as an effective \"cleaner\". But when his next-door neighbors are wiped out by a loose-cannon DEA agent, he becomes the unwilling custodian of 12-year-old Mathilda. Before long, Mathilda's thoughts turn to revenge, and she considers following in Léon's footsteps.",
                "popularity": 11.642,
                "poster_path": "/bxB2q91nKYp8JNzqE7t7TWBVupB.jpg",
                "release_date": "1994-09-14",
                "title": "Léon: The Professional",
                "video": false,
                "vote_average": 8.301,
                "vote_count": 15445,
                "character": "Bodyguard",
                "credit_id": "5ec6a1d63d3557001eee3b42",
                "order": 39
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Jeff McBride (born September 11, 1959), also known as \"Magnus\", is an American magician and magic instructor. He is known for his sleight of hand skills and specializes in the manipulation of playing cards, coins, and other small objects. His stage performances blend elements of kabuki, a Japanese theater form, with traditional conjuring. He has been recognized by the Academy of Magical Arts, the Society of American Magicians, and the International Federation of Magic Societies. He has also has set several Guinness World Records.\n\nIn 1991, he established the McBride Magic & Mystery School to teach the art of stage magic.\n\nMcBride is based in Las Vegas, Nevada. He established the McBride Magic & Mystery School to teach the art of stage magic. McBride's Magic & Mystery School is world-renowned and is recognized as the foremost magical teaching institution available today. Eugene Burger was the Dean of the School until his death in 2017. Guest faculty have included Teller, Lance Burton, Johnny Thompson and other magicians from all over the world. McBride was a star performer for years in Caesars Palace's Magical Empire. He created and performed at the World Magic Festival at Brushwood Folklore Center in Sherman, New York in 1993 and 1994. He performs worldwide, and has produced several instructional books and videos on the subjects of coin and card manipulation, and has presented lectures on magic and theater for such groups as the Smithsonian Institution, the Society of American Magicians, and the International Brotherhood of Magicians. In 1994, he appeared on the cover of The Linking Ring magazine.\n\nIn 1994, McBride appeared in the Star Trek: Deep Space Nine episode 'Equilibrium' as Joran Belar.\n\nIn 1995, McBride was a featured performer on \"World's Greatest Magic II\" on NBC, hosted by Alan Thicke. He was featured in a one-hour documentary entitled A Magickal Life: Jeff McBride, produced and broadcast by Canada's VisionTV, as an episode of their series Enigma True-Life Stories in January 2006. The documentary soundtrack featured music by Vegas Vortex event production collaborators Zingaia and Gary Stadler, as well as McBride's wife (married 2001) and partner, Abbi Spinner.\n\nMcBride has appeared twice on Criss Angel's show MindFreak. He was one of the celebrity judges on the 2008 reality celebrity-magic show Celebracadabra, produced by VH-1.\n\nHe appeared on the show Penn & Teller: Fool Us in September 2017, where he successfully fooled the hosts using an original water bowls effect.\n\nMcBride is active in the American Neopagan movement and he has organized events based on his research into \"Alchemical Fire Rituals\", such as Mysterium and Fires Rising. He has been instrumental in the development of the eclectic Neopagan organization in Las Vegas known as the Vegas Vortex, which is described as a \"thriving magical community, dedicated to creating events which celebrate and educate in the sacred arts of magic, theater, music and dance.\" He has appeared as a speaker, performer, and ritual leader at several Neopagan festivals and events. ...\n\nSource: Article \"Jeff McBride\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1959-09-11",
        "deathday": null,
        "gender": 2,
        "homepage": "https://mcbridemagic.com/",
        "id": 1240453,
        "imdb_id": "nm0564315",
        "known_for_department": "Acting",
        "name": "Jeff McBride",
        "place_of_birth": "Monticello, New York, USA",
        "popularity": 0.0817,
        "profile_path": "/jbFaHLJN2movuhBZgiif4CRsnqS.jpg"
    }
}