{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bwgjIlMoSyU1Iw0IhNIFUeSbNDy.jpg",
                "genre_ids": [
                    18
                ],
                "id": 68722,
                "original_language": "en",
                "original_title": "The Master",
                "overview": "Freddie, a volatile, heavy-drinking veteran who suffers from post-traumatic stress disorder, finds some semblance of a family when he stumbles onto the ship of Lancaster Dodd, the charismatic leader of a new \"religion\" he forms after World War II.",
                "popularity": 5.597,
                "poster_path": "/tvhE7TWGzLPgN82bBDuX1XtH5oE.jpg",
                "release_date": "2012-09-14",
                "title": "The Master",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 3107,
                "character": "Cliff Boyd",
                "credit_id": "59883cd3c3a368328702b63a",
                "order": 21
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/bPm5kQLlc2KypdYkUxGbrGfLJ82.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 147773,
                "original_language": "en",
                "original_title": "The Way Way Back",
                "overview": "Shy 14-year-old Duncan goes on summer vacation with his mother, her overbearing boyfriend, and her boyfriend's daughter. Having a rough time fitting in, Duncan finds an unexpected friend in Owen, manager of the Water Wizz water park.",
                "popularity": 3.2239,
                "poster_path": "/4DgA0EDDVv37C8xISc3Vv0rhxlL.jpg",
                "release_date": "2013-06-06",
                "title": "The Way Way Back",
                "video": false,
                "vote_average": 7.137,
                "vote_count": 1861,
                "credit_id": "52fe4bb39251416c7510b3e3",
                "department": "Production",
                "job": "Producer"
            },
            {
                "adult": false,
                "backdrop_path": "/fjk4eE8Ypke4YLv5A3ArDH4GzYH.jpg",
                "genre_ids": [
                    18
                ],
                "id": 334541,
                "original_language": "en",
                "original_title": "Manchester by the Sea",
                "overview": "After his older brother passes away, Lee Chandler is forced to return home to care for his 16-year-old nephew. There he is compelled to deal with a tragic past that separated him from his family and the community where he was born and raised.",
                "popularity": 7.6657,
                "poster_path": "/o9VXYOuaJxCEKOxbA86xqtwmqYn.jpg",
                "release_date": "2016-11-17",
                "title": "Manchester by the Sea",
                "video": false,
                "vote_average": 7.545,
                "vote_count": 6122,
                "credit_id": "58ba9dc3c3a36851cd001e80",
                "department": "Production",
                "job": "Producer"
            },
            {
                "adult": false,
                "backdrop_path": "/4BOgSGwEEHZuDhiHUOsrXaJBqoc.jpg",
                "genre_ids": [
                    36,
                    18,
                    28
                ],
                "id": 617653,
                "original_language": "en",
                "original_title": "The Last Duel",
                "overview": "King Charles VI declares that Knight Jean de Carrouges settle his dispute with his squire, Jacques Le Gris, by challenging him to a duel.",
                "popularity": 5.2011,
                "poster_path": "/zjrJE0fpzPvX8saJXj8VNfcjBoU.jpg",
                "release_date": "2021-10-13",
                "title": "The Last Duel",
                "video": false,
                "vote_average": 7.421,
                "vote_count": 3612,
                "credit_id": "5d3674b560c51d001280ba8d",
                "department": "Production",
                "job": "Producer"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Kevin J. Walsh is an American film and TV producer. Walsh is best known for producing the critically acclaimed film Manchester by the Sea, in which he earned an Academy Award nomination for Best Picture with Matt Damon, Kimberly Steward, Chris Moore, and Lauren Beck. The film received 18 major award nominations and won two Academy Awards.\n\nIn 2022, Walsh began a multi-year deal with Apple TV+ to produce film and television for the studio under his banner, The Walsh Company. His first films to be released for Apple TV+ will be Napoleon, directed by Ridley Scott and starring Joaquin Phoenix and Vanessa Kirby; The Instigators directed by Doug Liman and starring Matt Damon, Casey Affleck and Hong Chau; and Echo Valley, directed by Michael Pearce starring Julianne Moore and Sydney Sweeney.\n\nPrior to his deal with Apple TV+, Walsh was the President of Scott Free Productions, a film and television production company established by Ridley Scott and Tony Scott in 1995. At Scott Free, Walsh produced a dozen films in the six years that he oversaw the film group, including Boston Strangler, Death on the Nile, House of Gucci, The Last Duel, Earthquake Bird, Our Friend, American Woman and All the Money in the World.\n\nWalsh got his start in the film business working as an assistant to Scott Rudin on seven films including Zoolander, The Hours, and The Royal Tenenbaums. He later worked for Steven Spielberg on multiple films including Munich, The Adventures of Tintin, and War of the Worlds. Walsh was also cast as an actor in The Master.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1242110,
        "imdb_id": "nm1016966",
        "known_for_department": "Production",
        "name": "Kevin J. Walsh",
        "place_of_birth": null,
        "popularity": 0.0454,
        "profile_path": "/huPBnjbZmjuvnDENzCFzDRiU66C.jpg"
    }
}