{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rcEDPOOOUTLFxLLQJggfLffbofe.jpg",
                "genre_ids": [
                    16,
                    28,
                    14
                ],
                "id": 810693,
                "original_language": "ja",
                "original_title": "劇場版 呪術廻戦 0",
                "overview": "Yuta Okkotsu is a nervous high school student who is suffering from a serious problem—his childhood friend Rika has turned into a curse and won't leave him alone. Since Rika is no ordinary curse, his plight is noticed by Satoru Gojo, a teacher at Jujutsu High, a school where fledgling exorcists learn how to combat curses. Gojo convinces Yuta to enroll, but can he learn enough in time to confront the curse that haunts him?",
                "popularity": 9.5946,
                "poster_path": "/23oJaeBh0FDk2mQ2P240PU9Xxfh.jpg",
                "release_date": "2021-12-24",
                "title": "Jujutsu Kaisen 0",
                "video": false,
                "vote_average": 8.121,
                "vote_count": 1549,
                "character": "Maki's Mother (voice)",
                "credit_id": "6329f6c8ef9d72007e342583",
                "order": 30
            },
            {
                "adult": false,
                "backdrop_path": "/l8ubUlfzlB5R2j9cJ3CN7tj0gmd.jpg",
                "genre_ids": [
                    28,
                    10749,
                    16
                ],
                "id": 317442,
                "original_language": "ja",
                "original_title": "THE LAST -NARUTO THE MOVIE-",
                "overview": "Two years after the events of the Fourth Great Ninja War, the moon that Hagoromo Otsutsuki created long ago to seal away the Gedo Statue begins to descend towards the world, threatening to become a meteor that would destroy everything on impact. Amidst this crisis, a direct descendant of Kaguya Otsutsuki named Toneri Otsutsuki attempts to kidnap Hinata Hyuga but ends up abducting her younger sister Hanabi. Naruto and his allies now mount a rescue mission before finding themselves embroiled in a final battle to decide the fate of everything.",
                "popularity": 5.9826,
                "poster_path": "/bAQ8O5Uw6FedtlCbJTutenzPVKd.jpg",
                "release_date": "2014-12-06",
                "title": "The Last: Naruto the Movie",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 2336,
                "character": "Mei Teriumî, The Fifth Mizukage (voice)",
                "credit_id": "5659efffc3a3680ab800076d",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "ひの ゆりか"
        ],
        "biography": "Yurika Hino (日野 由利加, Hino Yurika, January 16, 1963) is a Japanese actress and voice actress affiliated with Office PAC.\n\nAfter graduating from the Bunka Gakuin Literature Department Drama Course, she joined the Theater Company Subaru in 1987 after working at the Drama School, and left the group in December 2011. In recent years, in addition to acting activities, she has been focusing on teaching younger generations who aim to become voice actors.\n\nIn the voice acting business, she mainly dubbs Western movies of various genres, including the dubbing of Famke Janssen, Winona Ryder, and Carrie-Anne Moss. In anime and game works, she often plays the role of an adult woman or mother. She is also active as a stage actor.",
        "birthday": "1963-01-16",
        "deathday": null,
        "gender": 1,
        "homepage": "https://hinoyurika.com/",
        "id": 1243044,
        "imdb_id": "nm1385449",
        "known_for_department": "Acting",
        "name": "Yurika Hino",
        "place_of_birth": "Yokohama, Kanagawa Prefecture, Japan",
        "popularity": 0.2074,
        "profile_path": "/e48vixguxAWWFabwXHVMwxaPULV.jpg"
    }
}