{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/djRD1jAXkUEQIFnG6fFFQAh9LD4.jpg",
                "genre_ids": [
                    53,
                    80,
                    18,
                    28
                ],
                "id": 10518,
                "original_language": "en",
                "original_title": "Marathon Man",
                "overview": "A graduate student and obsessive runner in New York is drawn into a mysterious plot involving his brother, a member of the secretive Division.",
                "popularity": 2.7391,
                "poster_path": "/uPNgubSiri2yvBQRPtP77ViYjN.jpg",
                "release_date": "1976-10-08",
                "title": "Marathon Man",
                "video": false,
                "vote_average": 7.175,
                "vote_count": 1146,
                "character": "Plainclothesman",
                "credit_id": "5cf3b5fd92514167e8b9518c",
                "order": 27
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Richard Carrott",
            "Ric Carrot"
        ],
        "biography": "Ric Carrott was an American actor, active during the 1970s.\n\nYouthful-looking and handsome, Carrott's only regular television series role was as Captain Chris Gentry, on the Saturday morning children's series Space Academy, but he made guest appearances on numerous popular shows of the decade. These included Nanny and the Professor, The Partridge Family, Love American Style, Dirty Sally, The Bob Newhart Show, The Odd Couple, The Blue Knight, The Streets of San Francisco, Lucas Tanner, S.W.A.T., Cannon, and later The Rockford Files, Starsky and Hutch, Barnaby Jones, Fantasy Island and Three's Company.\n\nCarrott originated the role of Chuck Cunningham, in the pilot for Happy Days (which aired as a segment of Love, American Style, \"Love and the Happy Days\"), later played by Gavan O'Herlihy in the series.\n\nHis film work includes roles in The Swinging Cheerleaders (also known as Locker Room Girls), Earthquake, Slashed Dreams, Mother, Jugs & Speed, Marathon Man, and the television movies A Summer Without Boys, Hurricane, SST: Death Flight, and When Hell was in Session.",
        "birthday": "1949-02-05",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1243102,
        "imdb_id": "nm0141057",
        "known_for_department": "Acting",
        "name": "Ric Carrott",
        "place_of_birth": "USA",
        "popularity": 0.139,
        "profile_path": "/clCa02cu4oT3ebbA5ULxRxv13mj.jpg"
    }
}