{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gGeoc8rFfPRIakXNttoFU85YVwv.jpg",
                "genre_ids": [
                    80,
                    18,
                    9648,
                    53,
                    10770
                ],
                "id": 379170,
                "original_language": "en",
                "original_title": "Sherlock: The Abominable Bride",
                "overview": "Sherlock Holmes and Dr. Watson find themselves in 1890s London in this holiday special.",
                "popularity": 5.4747,
                "poster_path": "/hibE8cyZs2Bm0o4WaWd1pppvjO2.jpg",
                "release_date": "2016-01-01",
                "title": "Sherlock: The Abominable Bride",
                "video": false,
                "vote_average": 7.8,
                "vote_count": 2290,
                "character": "Molly Hooper",
                "credit_id": "56a530b19251417207007bdd",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/zp5bc23EPflpLhkCObsFFOL3psw.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 74534,
                "original_language": "en",
                "original_title": "The Best Exotic Marigold Hotel",
                "overview": "British retirees travel to India to take up residence in what they believe is a newly restored hotel. Less luxurious than its advertisements, the Marigold Hotel nevertheless slowly begins to charm in unexpected ways as the residents find new purpose in their old age.",
                "popularity": 2.3372,
                "poster_path": "/gNWiOKTWDvPTpr7QfPWk18gLftz.jpg",
                "release_date": "2012-02-23",
                "title": "The Best Exotic Marigold Hotel",
                "video": false,
                "vote_average": 6.956,
                "vote_count": 1395,
                "character": "Hairdresser",
                "credit_id": "58986047c3a3687709007f0c",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "露易丝·布瑞丽",
            "Loo Brealey",
            "Лу Брили"
        ],
        "biography": "Louise Brealey (born 27 March 1979) is an English actress, writer and journalist. She played Molly Hooper in Sherlock (2010–), Cass in Back (2017), Scottish professor Jude McDermid in Clique (2017), Gillian Chamberlain in A Discovery of Witches (2018) and Donna Harman in Death in Paradise (2020).\n\nShe made her TV debut as Nurse Roxanne Bird in two series of BBC drama Casualty (2002–2004) before playing Judy Smallweed in Bleak House (2005). Brealey plays pathologist Molly Hooper in all four series of Steven Moffat and Mark Gatiss's television drama, Sherlock.\n\nShe has also made her name as an accomplished stage actress. Her stage debut was at London's Royal Court in 2001 as 14-year-old Sophie in Max Stafford-Clark's production of Judy Upton's Sliding With Suzanne. She portrayed child prodigy Thomasina in the Bristol Old Vic production of Tom Stoppard's Arcadia in 2005. In 2011, she was the short-frocked daughter of Julian Barratt and Doon Mackichan at the Young Vic in Richard Jones's Government Inspector. She next played three lead roles – Cassandra, Andromache and Helen of Troy – in Caroline Bird's sold-out production of The Trojan Women at London's Gate Theatre. In February 2014, she starred as Julie in August Strindberg's Miss Julie at the Citizens Theatre in Glasgow.\n\nShe won Best Actress at the Manchester Theatre Awards for her role as Marianne in Constellations, directed by Michael Longhurst and played the lead alongside Anne Marie Duff in Marianne Elliott's Husbands and Sons at the National Theatre.\n\nDescription above is from the Wikipedia article Louise Brealey, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1979-03-27",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1244469,
        "imdb_id": "nm1154764",
        "known_for_department": "Acting",
        "name": "Louise Brealey",
        "place_of_birth": "Bozeat, Northamptonshire, England",
        "popularity": 0.5858,
        "profile_path": "/vP9TPYijmF68VzNawWKkLpCoIb7.jpg"
    }
}