{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/utChUdMhCEWKjHTc8DO5aK8dUVS.jpg",
                "genre_ids": [
                    10751,
                    16,
                    12,
                    35
                ],
                "id": 520758,
                "original_language": "en",
                "original_title": "Chicken Run: Dawn of the Nugget",
                "overview": "A band of fearless chickens flock together to save poultry-kind from an unsettling new threat: a nearby farm that's cooking up something suspicious.",
                "popularity": 5.3667,
                "poster_path": "/exNtEY8QUuQh9e23wSQjkPxKIU3.jpg",
                "release_date": "2023-12-08",
                "title": "Chicken Run: Dawn of the Nugget",
                "video": false,
                "vote_average": 6.947,
                "vote_count": 826,
                "character": "Biscuit Chicken / Female Guards (voice)",
                "credit_id": "657c73d27ecd280101d39204",
                "order": 18
            },
            {
                "adult": false,
                "backdrop_path": "/sQbpfYoGiEBUnr8tBjHP51heNNT.jpg",
                "genre_ids": [
                    10751,
                    16,
                    35,
                    12
                ],
                "id": 263109,
                "original_language": "en",
                "original_title": "Shaun the Sheep Movie",
                "overview": "When Shaun decides to take the day off and have some fun, he gets a little more action than he bargained for. A mix up with the Farmer, a caravan and a very steep hill lead them all to the Big City and it's up to Shaun and the flock to return everyone safely to the green grass of home.",
                "popularity": 3.0717,
                "poster_path": "/1GMvKNy2Ht5QwI0oV0ycYnxzWdC.jpg",
                "release_date": "2015-02-05",
                "title": "Shaun the Sheep Movie",
                "video": false,
                "vote_average": 6.971,
                "vote_count": 1448,
                "character": "Timmy's Mum / Meryl (voice)",
                "credit_id": "54d7a7ffc3a3683b92006c27",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/AgYlP6g4vrNn1sVsAIvflW3TfJU.jpg",
                "genre_ids": [
                    10751,
                    16,
                    12,
                    35,
                    878
                ],
                "id": 422803,
                "original_language": "en",
                "original_title": "A Shaun the Sheep Movie: Farmageddon",
                "overview": "When an alien with amazing powers crash-lands near Mossy Bottom Farm, Shaun the Sheep goes on a mission to shepherd the intergalactic visitor home before a sinister organization can capture her.",
                "popularity": 1.7631,
                "poster_path": "/p08FoXVFgcRm5QZBaGj0VKa2W2Y.jpg",
                "release_date": "2019-09-26",
                "title": "A Shaun the Sheep Movie: Farmageddon",
                "video": false,
                "vote_average": 6.923,
                "vote_count": 558,
                "character": "Agent Red / Timmy's Mum (voice)",
                "credit_id": "5d51d6dd0102c9496575fec9",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Born in 1971, I grew up in a lovely village called Nether Heyford. I started dancing at the age of 4 and was often involved in performances at the school or local fete. One of my favourite memories is singing ‘Halfway up the Stairs’ in front of my class, with my Kermit the Frog hand puppet. From that little performance came my ever increasing fascination with ‘The Muppet Show’.\n\nAt 8, I started at the Arts Educational School in Tring, where my main focus was ballet. My love of Theatre was born, when at 12 I was cast as “first mouse” for the Royal Festival Ballets “Nutcracker” at the Royal Festival Hall to approximately 2000 people per show !\n\nI then attended The Central School of Ballet which was founded and run by the late Christopher Gable. In the 3rd year I toured with the school’s company in their “World on Fire” production. Touring was a great experience, but I will never forget locking myself out of my digs in Warminster! I was too busy chatting to the local Ghurkhas’ over a pint or 3. Having shinned up the back gate and jumped down through the open window, I realised I had entered the bedroom of the rather shocked Headmasters wife. She was remarkably calm though, as I made my sincere apologies and attempted to exit through her wardrobe!\n\nMy first professional stage job was the back end of Maggie the Cow at Watford Palace. Always good to start at the bottom and work your way up! Then I joined the NYMT for a season at the Edinburgh Festival. This was when I discovered my granny voice!! I played opposite Jonny Lee Miller in Bertolt Brechts Caucasian Chalk Circle, playing Granny Grusinia and other parts. The NYMT also produced “Joseph and his amazing Technicolor Dream Coat” that year, featuring Jude Law!\n\nI have had the privilege of working with some amazing and talented people in theatre .Not least when I was cast in Cameron Macintosh’s “Oliver” directed by Sam Mendes. Working with the different “Fagins” and all those “Nancy’s”! I then swapped my corset for another Cameron show, “Martin Guerre”. My lasting memory of this though was the look on Craig-Revel Horwood’s face as I tried to perfect his choreography in hob nail boots!",
        "birthday": "1971-04-15",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.kateharbour.com/",
        "id": 124557,
        "imdb_id": "nm0361957",
        "known_for_department": "Acting",
        "name": "Kate Harbour",
        "place_of_birth": "London, England, UK",
        "popularity": 0.2147,
        "profile_path": "/9jqX2oO6Eho43x6Q9dWOI93YJnm.jpg"
    }
}