{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xGiqZw1AJJ6BZRNUT1XVBMBofnr.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 802,
                "original_language": "en",
                "original_title": "Lolita",
                "overview": "Humbert Humbert is a middle-aged British novelist who is both appalled by and attracted to the vulgarity of American culture. When he comes to stay at the boarding house run by Charlotte Haze, he soon becomes obsessed with Lolita, the woman's teenaged daughter.",
                "popularity": 4.6978,
                "poster_path": "/8Puqbeh0D95DpXFWep1rmH78btu.jpg",
                "release_date": "1962-06-13",
                "title": "Lolita",
                "video": false,
                "vote_average": 7.316,
                "vote_count": 2152,
                "character": "Mrs. Starch",
                "credit_id": "52fe4278c3a36847f8021423",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/n3QtJ6tqE0fnf4Qaxb0iujBk0lH.jpg",
                "genre_ids": [
                    53,
                    27
                ],
                "id": 9540,
                "original_language": "en",
                "original_title": "Dead Ringers",
                "overview": "Elliot, a successful gynecologist, works at the same practice as his identical twin, Beverly. Elliot is attracted to many of his patients and has affairs with them. When he inevitably loses interest, he will give the woman over to Beverly, the meeker of the two, without the woman knowing the difference. Beverly falls hard for one of the patients, Claire, but when she inadvertently deceives him, he slips into a state of madness.",
                "popularity": 2.3745,
                "poster_path": "/ofXwDfM8uYAaftD7cBPcIWdCpMn.jpg",
                "release_date": "1988-09-23",
                "title": "Dead Ringers",
                "video": false,
                "vote_average": 7.128,
                "vote_count": 939,
                "character": "Laura",
                "credit_id": "52fe4506c3a36847f80b7f7d",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Shirley Douglas, with a start in church drama and music, pursued acting seriously from a young age. After studies in London, she acted in British theatre and TV. Her marriage to Donald Sutherland bore twins, Kiefer and Rachel Sutherland. Engaging in American protest movements in the late '60s and '70s, she advocated for various causes, eventually returning to Canada in 1977. Her career flourished in film, TV, and theatre, embodying strong characters like Hagar Shipley in \"The Stone Angel\" and Marilla in \"Anne of Green Gables.\" Known for her activism, she ardently supported Canada's healthcare system, advocating for its accessibility. Notably, she won a Gemini Award for \"Shadow Lake\" in 2000 and received an honorary doctorate from Ryerson Polytechnic University and the Diamond Award from the Variety Club. Shirley's father was Tommy Douglas, renowned for founding Canada’s healthcare system.",
        "birthday": "1934-04-02",
        "deathday": "2020-04-05",
        "gender": 1,
        "homepage": null,
        "id": 12452,
        "imdb_id": "nm0235250",
        "known_for_department": "Acting",
        "name": "Shirley Douglas",
        "place_of_birth": "Weyburn, Saskatchewan, Canada",
        "popularity": 0.2207,
        "profile_path": "/iysfZKbv4Ehdg3nDkwoGTkFp7Yk.jpg"
    }
}