{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cvq9cRMDJIGzNpHaPVGFftqPcLj.jpg",
                "genre_ids": [
                    878,
                    53
                ],
                "id": 206487,
                "original_language": "en",
                "original_title": "Predestination",
                "overview": "Predestination chronicles the life of a Temporal Agent sent on an intricate series of time-travel journeys designed to prevent future killers from committing their crimes. Now, on his final assignment, the Agent must stop the one criminal that has eluded him throughout time and prevent a devastating attack in which thousands of lives will be lost.",
                "popularity": 5.1957,
                "poster_path": "/38Xr1JnV1ZcLQ55zmdSp6n475cZ.jpg",
                "release_date": "2014-08-28",
                "title": "Predestination",
                "video": false,
                "vote_average": 7.424,
                "vote_count": 6752,
                "character": "Physical Fitness Trainer",
                "credit_id": "54c0f183c3a3686c61010a92",
                "order": 49
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Kristie Jandric is an Australian actress and model. She appeared in Network Ten's soap opera Neighbours from April 2007 for a three-week guest role. Jandric previously appeared on the show in a minor role in 1999. Jandric appeared on Fox Footy's \"Living With Footballers\" in 2003. Her photograph appeared in the cover of the June 2005 edition of Inside Sport. In 2007, Jandric played the role of \"Rosie\" in the new Australian drama show \"Satisfaction\", which aired on Showtime on Foxtel. With the success of the show she was asked to come back for the second season in 2008 and third season in 2009. Kristie Jandric features in the upcoming feature film \"Big Mamas Boy\", an Australian romantic comedy about an Italian man who lives with his mother. Kristie Jandric is also showing off her culinary skills as a Celebrity Chef on the new series on Channel 31/Digital 44 called \"Kidz in the Kitchen\" as she attempts some of Gabriel Gate's famous recipes with the kids.",
        "birthday": null,
        "deathday": null,
        "gender": 0,
        "homepage": null,
        "id": 1245746,
        "imdb_id": "nm2591084",
        "known_for_department": "Acting",
        "name": "Kristie Jandric",
        "place_of_birth": null,
        "popularity": 0.0357,
        "profile_path": null
    }
}