{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/r17jFHAemzcWPPtoO0UxjIX0xas.jpg",
                "genre_ids": [
                    28,
                    53,
                    80
                ],
                "id": 324552,
                "original_language": "en",
                "original_title": "John Wick: Chapter 2",
                "overview": "John Wick is forced out of retirement by a former associate looking to seize control of a shadowy international assassins’ guild. Bound by a blood oath to aid him, Wick travels to Rome and does battle against some of the world’s most dangerous killers.",
                "popularity": 15.3196,
                "poster_path": "/hXWBc0ioZP3cN4zCu6SN3YHXZVO.jpg",
                "release_date": "2017-02-08",
                "title": "John Wick: Chapter 2",
                "video": false,
                "vote_average": 7.339,
                "vote_count": 13683,
                "character": "Ares",
                "credit_id": "56cf3b959251413e5f002d6d",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ruby Rose Langenheim",
            "روبی رز"
        ],
        "biography": "Ruby Rose Langenheim (born 20 March 1986), better known as Ruby Rose, is an Australian model, DJ, recording artist, actress, television presenter, and former MTV VJ. Rose emerged in the media spotlight as a presenter on MTV Australia, followed by several high-profile modelling gigs, notably as the face of Maybelline New York in Australia. In addition to her modelling career, she has co-hosted various television shows, namely Australia's Next Top Model and The Project on Network Ten.\n\nRose pursued a career in acting from 2008 onwards, with her debut performance in the Australian film Suite for Fleur. In 2013, she had a small role in the drama Around the Block. She appeared in seasons three and four of the Netflix series Orange Is the New Black, and received praise for her work. Her personal life has also received attention.",
        "birthday": "1986-03-20",
        "deathday": null,
        "gender": 3,
        "homepage": null,
        "id": 1246972,
        "imdb_id": "nm3199307",
        "known_for_department": "Acting",
        "name": "Ruby Rose",
        "place_of_birth": "Melbourne, Victoria, Australia",
        "popularity": 1.6371,
        "profile_path": "/djhT0A2hZxpYKPnCeRtim8qUdPi.jpg"
    }
}