{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/oyK2a8tMn6cmzilaUmKWYqNXzay.jpg",
                "genre_ids": [
                    35,
                    10751,
                    14
                ],
                "id": 787699,
                "original_language": "en",
                "original_title": "Wonka",
                "overview": "Willy Wonka – chock-full of ideas and determined to change the world one delectable bite at a time – is proof that the best things in life begin with a dream, and if you’re lucky enough to meet Willy Wonka, anything is possible.",
                "popularity": 10.1092,
                "poster_path": "/qhb1qOilapbapxWQn9jtRCMwXJF.jpg",
                "release_date": "2023-12-06",
                "title": "Wonka",
                "video": false,
                "vote_average": 7.059,
                "vote_count": 4040,
                "character": "Ficklegruber",
                "credit_id": "6231b9a9c3bffe001c4ce8ad",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Mathew John Baynton (born 18 November 1980) is an English actor, writer, comedian, singer, and musician. He is best known for his numerous roles in a children’s program Horrible Histories (2009-2013), as well as Yonderland (2013-2016), where he also played various different roles, and Ghosts (2019-) where he plays Thomas Thorne; other TV series he is popular by are You, Me and the Apocalypse (2015), The Wrong Mans (2013-2014). He is also known for appearing in films such as The Falling (2015) and Bill (2015).\n\nHe is familiar as one of the stars of the hit children's television series Horrible Histories, appearing over-all five series as a singer, actor, and occasional writer. He is the creator, writer, and star of Yonderland, an eight-part family fantasy comedy series that premiered on Sky1 on 10 November 2013. He starred with the same troupe in Bill, a BBC family comedy film based loosely around the early life of William Shakespeare. The troupe also reunited in 2019 to create the BBC series Ghosts, with him appearing as a romantic poet named Thomas Thorne. He teamed with James Corden to create, write, and star in The Wrong Mans (2013–2014), a comedy-thriller for BBC Two that premiered in autumn 2013.\n\nOther notable TV comedy roles include the recurring character of Deano in Gavin & Stacey (2008–2009); co-starring as Chris in the Darren Boyd sitcom vehicle Spy (2011–2012); and William in the 2017 black comedy series Quacks. In late 2015, Baynton starred in science fiction comedy-drama miniseries You, Me and the Apocalypse.\n\nDescription above is from the Wikipedia article Mathew Baynton, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1980-11-18",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1246784,
        "imdb_id": "nm2719406",
        "known_for_department": "Acting",
        "name": "Mathew Baynton",
        "place_of_birth": "Southend-on-Sea, Essex, England, UK",
        "popularity": 0.6574,
        "profile_path": "/g3FnkjMKL5bsGQc0sEpuXFYK4u4.jpg"
    }
}