{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mAUfGMmYmsBeKRHlBdaj7YUe1Ow.jpg",
                "genre_ids": [
                    14,
                    12,
                    10751
                ],
                "id": 258230,
                "original_language": "en",
                "original_title": "A Monster Calls",
                "overview": "12-year-old Conor encounters an ancient tree monster who proceeds to help him cope with his mother's terminal illness and being bullied in school.",
                "popularity": 4.1116,
                "poster_path": "/vNzWJwVqjszWwXrA7ZfsrJmhgV9.jpg",
                "release_date": "2016-10-07",
                "title": "A Monster Calls",
                "video": false,
                "vote_average": 7.287,
                "vote_count": 3447,
                "character": "Female Nurse",
                "credit_id": "5c12df2e0e0a26037f3b1ae1",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Wanda Opalinska is an English-Polish actress, known for playing the part of Polish immigrant and Underworld factory worker Wiki Dankowska in the ITV soap opera Coronation Street.\n\nOpalinska went to drama school before studying English at the University of Birmingham from 1988 to 1991. She then qualified as an English teacher and taught in South London. She was a teacher of English and Drama at St Thomas More R.C. Secondary School, (Sloane Square, London), before leaving to further her teaching career at Whitgift School (South Croydon). There she was appointed first House Mistress (Ellis's) in the schools 400-year history. During her time at Whitgift her critique of George Orwell's Animal Farm was published by Longman as part of their acclaimed York Notes series.\n\nOpalinska joined Coronation Street as a seamstress at the Underworld factory. Opalinska's first on-screen appearance as Wiki was on 26 February 2007. Wiki worked for Underworld manager Carla Connor (Alison King), and witnessed her friend Kasia Barowicz (Irena Rodic) die as she fell down the steps of the Underworld factory. She has appeared in ITV's The Sitcom Trials and the BBC's The Last Laugh. Opalinska then appeared in Waterloo Road in the episode first broadcast on BBC1 on 28 October 2010. (Series 6, Episode 10) Other television appearances include Doctors (BBC One) where she played Sue Pruce and Jackie Reynolds,[ Law and Order UK (ITV) where she played Marta, and Some Girls (BBC Three) where she played the part of Marie (Series One, Episode Three).\n\nOn 28 February 2013, Opalinska appeared in her first episode of the BBC soap opera EastEnders as Magda Bakowska, the carer for Patrick Trueman (Rudolph Walker). Opalinska made her final appearance as Magda on 4 March 2013. For theatre, Opalinska was recently in the Royal Court production of Truth and Reconciliation by Debbie Tucker Green.\n\nIn 2022 she played the roles of Nadia and Marcella in All of Us at the Royal National Theatre.",
        "birthday": "1970-01-01",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.berlinassociates.com/client-list/wanda-opali%C5%84ska-2",
        "id": 1247016,
        "imdb_id": "nm2571603",
        "known_for_department": "Acting",
        "name": "Wanda Opalinska",
        "place_of_birth": "Birmingham, West Midlands, England, UK",
        "popularity": 0.1373,
        "profile_path": "/eLGyl7X7scB77BV7ltsEmtTxghx.jpg"
    }
}