{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/oZibPrp183EI5yjKvVFZ1lhA3Pj.jpg",
                "genre_ids": [
                    18,
                    10751
                ],
                "id": 630220,
                "original_language": "it",
                "original_title": "18 regali",
                "overview": "Elisa is only forty when an incurable disease takes her from her husband and their daughter. Before her heart stops, Elisa finds a way to stay close to her: a gift for every birthday up to her adult age, 18 gifts to try to accompany her child's growth year after year.",
                "popularity": 2.4125,
                "poster_path": "/lS7lqDT3NF2LcSPdxXNJY9pMxZ6.jpg",
                "release_date": "2020-01-02",
                "title": "18 Presents",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 698,
                "character": "Carla",
                "credit_id": "5df60658d1a8930014794f6a",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "사라 라자로"
        ],
        "biography": "Sara Lazzaro was born in a small town in the hills of northern Italy to an Italian father and American mother. Sara is a bilingual actress. She is of Italian, German, Irish, English and French descent. Sara spent her earlier childhood between Italy (Padua) and the United States (Carmel, CA). She obtained a B.A. in Visual and Performing Arts at I.U.A.V. (Istituto Universitario di Architettura di Venezia), the University of Architecture in Venice, Italy. She then decided to pursue her acting interests professionally and at a more international level by moving to London and training there. She graduated from Drama Centre London with an M.A. in Performance (with a specialization in screen acting). Sara works both in theatre and film between Italy, UK and U.S.A.",
        "birthday": "1984-09-15",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 124760,
        "imdb_id": "nm3322537",
        "known_for_department": "Acting",
        "name": "Sara Lazzaro",
        "place_of_birth": "Rovolon, Padua, Veneto, Italy",
        "popularity": 0.4397,
        "profile_path": null
    }
}