{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yFZG86Zvdy6JuIlMW9eHxlVkct5.jpg",
                "genre_ids": [
                    16,
                    28,
                    12,
                    14,
                    878
                ],
                "id": 413594,
                "original_language": "ja",
                "original_title": "劇場版 ソードアート・オンライン -オーディナル・スケール-",
                "overview": "In 2026, four years after the infamous Sword Art Online incident, a revolutionary new form of technology has emerged: the Augma, a device that utilizes an Augmented Reality system. Unlike the Virtual Reality of the NerveGear and the Amusphere, it is perfectly safe and allows players to use it while they are conscious, creating an instant hit on the market. The most popular application for the Augma is the game Ordinal Scale, which immerses players in a fantasy role-playing game with player rankings and rewards.  Following the new craze, Kirito's friends dive into the game, and despite his reservations about the system, Kirito eventually joins them. While at first it appears to be just fun and games, they soon find out that the game is not all that it seems...",
                "popularity": 4.319,
                "poster_path": "/2szdEK0Mr0RG0nWGFVTseNQHbnP.jpg",
                "release_date": "2017-02-18",
                "title": "Sword Art Online: The Movie – Ordinal Scale",
                "video": false,
                "vote_average": 7.695,
                "vote_count": 711,
                "character": "Asuna Yūki (voice)",
                "credit_id": "57e58a2bc3a3681bd8001563",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/e6CnfsN7wnhZEMqh5EnCfTDXQ7g.jpg",
                "genre_ids": [
                    28,
                    12,
                    14,
                    16
                ],
                "id": 507569,
                "original_language": "ja",
                "original_title": "劇場版 七つの大罪 天空の囚われ人",
                "overview": "Traveling in search of the rare ingredient, “sky fish”  Meliodas and Hawk arrive at a palace that floats above the clouds. The people there are busy preparing a ceremony, meant to protect their home from a ferocious beast that awakens once every 3,000 years. But before the ritual is complete, the Six Knights of Black—a Demon Clan army—removes the seal on the beast, threatening the lives of everyone in the Sky Palace.",
                "popularity": 0.9105,
                "poster_path": "/63NOOAkaZAK8h93Sg7Ucq6XLJGP.jpg",
                "release_date": "2018-08-18",
                "title": "The Seven Deadly Sins: Prisoners of the Sky",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 1054,
                "character": "Erlatte (voice)",
                "credit_id": "5c967d7c9251416b30f359f9",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Sphere",
            "とまつ はるか",
            "スフィア",
            "户松遥",
            "토마츠 하루카",
            "戶松遙",
            "戸松 遥",
            "هاروکا توماتسو"
        ],
        "biography": "Haruka Tomatsu (戸松 遥, Tomatsu Haruka, February 4, 1990) is a Japanese actress, voice actress and singer, affiliated with Music Ray'n. She is a member of the J-pop idol unit Sphere.",
        "birthday": "1990-02-04",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.tomatsuharuka.com",
        "id": 1248340,
        "imdb_id": "nm2955927",
        "known_for_department": "Acting",
        "name": "Haruka Tomatsu",
        "place_of_birth": "Ichinomiya, Aichi, Japan",
        "popularity": 0.8448,
        "profile_path": "/geVvuA2zMGE5xzfc20aDelJSelu.jpg"
    }
}