{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2riY7AHpnOmViEymORvtG4KZqDc.jpg",
                "genre_ids": [
                    27,
                    878,
                    9648
                ],
                "id": 837,
                "original_language": "en",
                "original_title": "Videodrome",
                "overview": "As the president of a trashy TV channel, Max Renn is desperate for new programming to attract viewers. When he happens upon \"Videodrome,\" a TV show dedicated to gratuitous torture and punishment, Max sees a potential hit and broadcasts the show on his channel. However, after his girlfriend auditions for the show and never returns, Max investigates the truth behind Videodrome and discovers that the graphic violence may not be as fake as he thought.",
                "popularity": 2.6637,
                "poster_path": "/qqqkiZSU9EBGZ1KiDmfn07S7qvv.jpg",
                "release_date": "1983-02-04",
                "title": "Videodrome",
                "video": false,
                "vote_average": 7.264,
                "vote_count": 2330,
                "character": "Bianca O'Blivion",
                "credit_id": "52fe427ec3a36847f802321f",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Sonja Smits is a Canadian actress recognized for her versatile performances across film, television, and theatre. She gained prominence for her role as Sara Fraser in the acclaimed Canadian television series \"Street Legal.\" Smits' portrayal of the determined and skilled lawyer showcased her acting prowess and earned her critical acclaim. Additionally, she has been the lead in two other TV series, Traders and the Eleventh Hour, as well as many TV movies such as Margret Lawrence's The Diviners. Her feature films, include David Cronenberg's cult classic, \"Videodrome\" and \"Owning Mahoney\" with Philip Seymour Hoffman. Sonja has received numerous honours and awards for her work including a Gemini Award-Best Actress, TWFT- Outstanding Achievement Award and ACTRA Award of Excellence. She was the first artist named as President of Harbourfront Centre Board, was a founding member of ACTRA Women's Caucus and served as Chair at Toronto Artscape Foundation. Sonja is the co-owner of Closson Chase Vineyards, a pioneer in the creation of the viticulture region of Prince Edward County.",
        "birthday": "1958-09-08",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 12482,
        "imdb_id": "nm0810500",
        "known_for_department": "Acting",
        "name": "Sonja Smits",
        "place_of_birth": "Ottawa Valley, Ontario, Canada",
        "popularity": 0.4782,
        "profile_path": "/ryv2Bx75BnqetyCdPB2G9UATJy.jpg"
    }
}