{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3HmLKhahTxX2ALTWlagr92pZrU7.jpg",
                "genre_ids": [
                    18
                ],
                "id": 462,
                "original_language": "en",
                "original_title": "Erin Brockovich",
                "overview": "A twice-divorced mother of three who sees an injustice, takes on the bad guy and wins -- with a little help from her push-up bra. Erin goes to work for an attorney and comes across medical records describing illnesses clustered in one nearby town. She starts investigating and soon exposes a monumental cover-up.",
                "popularity": 4.5699,
                "poster_path": "/jEMvWBWVjndZT0vJnLrRWi9ajea.jpg",
                "release_date": "2000-03-17",
                "title": "Erin Brockovich",
                "video": false,
                "vote_average": 7.442,
                "vote_count": 3425,
                "character": "Waitress",
                "credit_id": "5f4f047e39756100375ac45b",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Erin Brockovich",
            "Erin Brockovich-Ellis"
        ],
        "biography": "Erin Brockovich (née Pattee; born June 22, 1960) is an American legal clerk, whistleblower, consumer advocate, and environmental activist who, despite her lack of education in the law, was instrumental in building a case against Pacific Gas & Electric Company (PG&E) involving groundwater contamination in Hinkley, California with the help of attorney Ed Masry in 1993. Their successful lawsuit was the subject of the Oscar-winning film, Erin Brockovich (2000), starring Julia Roberts as Brockovich and Albert Finney as Masry. Since then, Brockovich has become a media personality as well, hosting the TV series Challenge America with Erin Brockovich on ABC and Final Justice on Zone Reality. She is the president of Brockovich Research & Consulting. She also works as a consultant for the New York law firm of Weitz & Luxenberg,[1] which has a focus on personal injury claims for asbestos exposure, and Shine Lawyers in Australia.[2] She worked as a consultant for the now-defunct California law firm Girardi & Keese.[3][4]\n\nFrom Wikipedia, The Free Encyclopedia",
        "birthday": "1960-06-22",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.brockovich.com",
        "id": 1248986,
        "imdb_id": "nm0004777",
        "known_for_department": "Acting",
        "name": "Erin Brockovich",
        "place_of_birth": "Lawrence, Kansas, USA",
        "popularity": 0.1144,
        "profile_path": "/wDvf7Kmaq0HrizJKYKTfCciCFRu.jpg"
    }
}