{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9xzVKUGbVKrrgwlmshJ8SxI5mL7.jpg",
                "genre_ids": [
                    9648,
                    80,
                    53
                ],
                "id": 963,
                "original_language": "en",
                "original_title": "The Maltese Falcon",
                "overview": "A private detective takes on a case that involves him with three eccentric criminals, a beautiful liar, and their quest for a priceless statuette.",
                "popularity": 5.616,
                "poster_path": "/bf4o6Uzw5wqLjdKwRuiDrN1xyvl.jpg",
                "release_date": "1941-10-18",
                "title": "The Maltese Falcon",
                "video": false,
                "vote_average": 7.712,
                "vote_count": 1775,
                "character": "Ship's Mate (uncredited)",
                "credit_id": "532104fa9251411f89001eaa",
                "order": 21
            },
            {
                "adult": false,
                "backdrop_path": "/ftNimlo6fP4WKRMWnF1ghX4fPUy.jpg",
                "genre_ids": [
                    35,
                    10749,
                    18
                ],
                "id": 6620,
                "original_language": "en",
                "original_title": "Sabrina",
                "overview": "Linus and David Larrabee are the two sons of a very wealthy family. Linus is all work – busily running the family corporate empire, he has no time for a wife and family. David is all play – technically he is employed by the family business, but never shows up for work, spends all his time entertaining, and has been married and divorced three times. Meanwhile, Sabrina Fairchild is the young, shy, and awkward daughter of the household chauffeur, who goes away to Paris for two years, and returns to capture David's attention, while falling in love with Linus.",
                "popularity": 3.8978,
                "poster_path": "/86ix9wBxiMAaISt4HpmXQm6Mlym.jpg",
                "release_date": "1954-09-01",
                "title": "Sabrina",
                "video": false,
                "vote_average": 7.505,
                "vote_count": 1294,
                "character": "Charles",
                "credit_id": "535d4dae0e0a264fde0050ae",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/1rSF7UoY6aU8i7yJOLovZv8AYwX.jpg",
                "genre_ids": [
                    53
                ],
                "id": 31997,
                "original_language": "en",
                "original_title": "Saboteur",
                "overview": "Aircraft factory worker Barry Kane flees across the United States after he is wrongly accused of starting the fire that killed his best friend.",
                "popularity": 3.589,
                "poster_path": "/iDKOOTymUZg0WAWPcbdP6nPZEFF.jpg",
                "release_date": "1942-04-24",
                "title": "Saboteur",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 518,
                "character": "Henry - Husband in Movie (uncredited)",
                "credit_id": "664fa8b076e4fb6e32ec19ee",
                "order": 82
            },
            {
                "adult": false,
                "backdrop_path": "/8yE0aOQoZSSl2CuuPvjxdHuQl4P.jpg",
                "genre_ids": [
                    878,
                    53
                ],
                "id": 10514,
                "original_language": "en",
                "original_title": "The Andromeda Strain",
                "overview": "When virtually all of the residents of Piedmont, New Mexico, are found dead after the return to Earth of a space satellite, the head of the US Air Force's Project Scoop declares an emergency. A group of eminent scientists led by Dr. Jeremy Stone scramble to a secure laboratory and try to first isolate the life form while determining why two people from Piedmont - an old alcoholic and a six-month-old baby - survived. The scientists methodically study the alien life form unaware that it has already mutated and presents a far greater danger in the lab, which is equipped with a nuclear self-destruct device designed to prevent the escape of dangerous biological agents.",
                "popularity": 4.281,
                "poster_path": "/4FBSFz8wLpxd4o6hnvKOJJ8WSIz.jpg",
                "release_date": "1971-03-12",
                "title": "The Andromeda Strain",
                "video": false,
                "vote_average": 7.054,
                "vote_count": 736,
                "character": "Pete 'Old Doughboy' Arnold (uncredited)",
                "credit_id": "5e772c302f3b17001952e749",
                "order": 28
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Emery Parnell",
            "Emery Parnel",
            "Emory Parnel",
            "The Big Swede"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nEmory Parnell (December 29, 1892 – June 22, 1979) was an American vaudeville performer and actor who appeared in over 250 films in his 36-year career. He was nicknamed \"The Big Swede\" and was sometimes credited as \"Emery\" or \"Parnel\".\n\nSeeking better opportunities in Hollywood, Parnell and his wife moved to Los Angeles, California, where, helped by his red-faced Irish look of frustration, he immediately began to appear in films in a variety of role, such as policemen, doormen, landlords, and small town businessmen. One of his first films was Doctor Rhythm (1938).\n\nAlthough his appearances were often in \"B\" films, such as the Ma and Pa Kettle series, he also made credible showings in \"A\" films as well. One notable part was as a Paramount studio executive who sang about avoiding libel suits to open 1941's Louisiana Purchase. Parnell was also part of writer-director Preston Sturges' unofficial \"stock company\" of character actors in the 1940s, appearing in five of Sturges' films, including The Miracle of Morgan's Creek, where he played the crooked banker, \"Mr. Tuerck\", the chief antagonist of William Demarest's \"Constable Kockenlocker\". He also made a memorable appearance as grumpy socialite Ajax Bullion in the Three Stooges short subject All the World's a Stooge.",
        "birthday": "1892-12-28",
        "deathday": "1979-06-22",
        "gender": 2,
        "homepage": null,
        "id": 124875,
        "imdb_id": "nm0663183",
        "known_for_department": "Acting",
        "name": "Emory Parnell",
        "place_of_birth": "Saint Paul, Minnesota, USA",
        "popularity": 0.2156,
        "profile_path": "/eI6HoBY4IK8NP1k9gJKicLhIekv.jpg"
    }
}