{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/D3eDUNEzJPBDG3TCJcR7RyRgTA.jpg",
                "genre_ids": [
                    18,
                    28
                ],
                "id": 96721,
                "original_language": "en",
                "original_title": "Rush",
                "overview": "In the 1970s, a rivalry propels race car drivers Niki Lauda and James Hunt to fame and glory — until a horrible accident threatens to end it all.",
                "popularity": 10.1157,
                "poster_path": "/cyfncP1YKDNcGb0agE7RQr6UOYr.jpg",
                "release_date": "2013-09-02",
                "title": "Rush",
                "video": false,
                "vote_average": 7.727,
                "vote_count": 7475,
                "character": "Self (archive footage) (uncredited)",
                "credit_id": "659348a7f5f1c5763301d1d3",
                "order": 78
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "James Simon Wallis Hunt "
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nJames Simon Wallis Hunt (29 August 1947 – 15 June 1993) was a British racing driver who won the Formula One World Championship in 1976. After retiring from racing in 1979, Hunt became a media commentator and businessman.\n\nBeginning his racing career in touring car racing, Hunt progressed into Formula Three where he attracted the attention of the Hesketh Racing team and was soon taken under their wing. Hunt's often action-packed exploits on track earned him the nickname \"Hunt the Shunt.\" Hunt entered Formula One in 1973, driving a March 731 entered by the Hesketh Racing team. He went on to win for Hesketh, driving their own Hesketh 308 car, in both World Championship and non-Championship races, before joining the McLaren team at the end of 1975. In his first year with McLaren, Hunt won the 1976 World Drivers' Championship, and he remained with the team for a further two years, although with less success, before moving to the Wolf team in early 1979. Following a string of races in which he failed to finish, Hunt retired from driving halfway through the 1979 season.\n\nAfter retiring from motor racing, he established a career commentating on Grands Prix for the BBC. He was known for his knowledge, insights, dry sense of humour and his criticism of drivers who, he believed, were not trying hard enough, which in the process brought him a whole new fanbase. Hunt died from a heart attack aged 45. He was inducted into the Motor Sport Hall of Fame on January 29, 2014.",
        "birthday": "1947-08-29",
        "deathday": "1993-06-15",
        "gender": 2,
        "homepage": null,
        "id": 1249590,
        "imdb_id": "nm0402481",
        "known_for_department": "Acting",
        "name": "James Hunt",
        "place_of_birth": "Belmont - England - UK",
        "popularity": 0.1047,
        "profile_path": "/hRXu8iNe44ZZI2xlB6B0S9q0zPx.jpg"
    }
}