{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/v7GQxa9ZmdMZjt4JwZF54mvAiTv.jpg",
                "genre_ids": [
                    16,
                    28,
                    12,
                    14
                ],
                "id": 113082,
                "original_language": "ja",
                "original_title": "ベルセルク 黄金時代篇I 覇王の卵",
                "overview": "Guts, an immensely strong sword-for-hire, has little direction in his life, simply fighting one battle after the next. However, this all changes suddenly when he meets and is bested by Griffith, a beautiful and charismatic young man who leads the Band of the Hawk mercenary army. After Guts joins the Band and the relationship between the two men begins to blossom, Casca, the tough, lone swordswoman in the Band of the Hawk, struggles to accept Guts and the influence he has on the world around her.  While the two men begin to fight together, Griffith continues to rise to power, all seemingly in order to reach his mysterious, prophesied goals. What lengths will Guts and Griffith go to in order to reach these goals, and where will fate take the two men?",
                "popularity": 3.9648,
                "poster_path": "/vES8WAzjowrMT8gwnoEaCioZXXk.jpg",
                "release_date": "2012-02-04",
                "title": "Berserk: The Golden Age Arc I - The Egg of the King",
                "video": false,
                "vote_average": 7.239,
                "vote_count": 511,
                "character": "Rickert (voice)",
                "credit_id": "53e10a93c3a3683b57001b2a",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/iRB6VKJuFd88bk20hvLqlDzi4kP.jpg",
                "genre_ids": [
                    16,
                    10749,
                    18
                ],
                "id": 513347,
                "original_language": "zh",
                "original_title": "肆式青春",
                "overview": "The rigorous city life of China, while bustling and unforgiving, contains the everlasting memories of days past. Three stories told in three different cities, follow the loss of youth and the daunting realization of adulthood. Though reality may seem ever changing, unchangeable are the short-lived moments of one's childhood days. A plentiful bowl of noodles, the beauty of family and the trials of first love endure the inevitable flow of time, as three different characters explore the strength of bonds and the warmth of cherished memories. Within the disorder of the present world, witness these quaint stories recognize the comfort of the past, and attempt to revive the neglected flavors of youth.",
                "popularity": 2.7448,
                "poster_path": "/ueHeH5ergeHx27L4SCI9qlmwczA.jpg",
                "release_date": "2018-08-04",
                "title": "Flavors of Youth",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 568,
                "character": "Yi Lin (voice)",
                "credit_id": "5b71b848925141404f163ea3",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/eHTZoXmB4vnDqANZXPZcdAiYQo5.jpg",
                "genre_ids": [
                    16,
                    18,
                    10749,
                    14
                ],
                "id": 667520,
                "original_language": "ja",
                "original_title": "泣きたい私は猫をかぶる",
                "overview": "A peculiar girl transforms into a cat to catch her crush's attention. But before she realizes it, the line between human and animal starts to blur.",
                "popularity": 4.5102,
                "poster_path": "/6inkRM1XGBG5vRhclCPWfMenp7N.jpg",
                "release_date": "2020-06-18",
                "title": "A Whisker Away",
                "video": false,
                "vote_average": 7.882,
                "vote_count": 1439,
                "character": "Yoriko Fukase (voice)",
                "credit_id": "5e82c971c0ae3600128b1e23",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Котобуки Минако",
            "Sphere",
            "寿美奈子",
            "ことぶき みなこ",
            "スフィア",
            "寿 美菜子",
            "میناکو کوتوبوکی"
        ],
        "biography": "Minako Kotobuki (寿 美菜子 Kotobuki Minako, born September 17, 1991) is a Japanese actress, voice actress and singer. She is best known for her role as Tsumugi Kotobuki in the anime series K-On! about a high school girl band. The show launched her music career as she performed the opening and ending themes and joined three other voice actresses as the music group Sphere.\n\nShe is a member of the J-pop idol unit Sphere.\n\nFrom Wikipedia, the free encyclopedia",
        "birthday": "1991-09-17",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.kotobukiminako.com",
        "id": 1249310,
        "imdb_id": "nm2964162",
        "known_for_department": "Acting",
        "name": "Minako Kotobuki",
        "place_of_birth": "Kobe, Hyogo, Japan",
        "popularity": 0.4736,
        "profile_path": "/puocmMfvql6X1AvhFTolaV6Vh2r.jpg"
    }
}