{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qhNc8goJdGVRsrS9VoexTNi3Zxd.jpg",
                "genre_ids": [
                    10749,
                    18
                ],
                "id": 428493,
                "original_language": "en",
                "original_title": "God's Own Country",
                "overview": "A young farmer in rural Yorkshire numbs his daily frustrations with binge drinking and casual sex, until the arrival of a Romanian migrant worker.",
                "popularity": 2.5697,
                "poster_path": "/hKJz8Moim43P1f1kGrM9Gh0c0rf.jpg",
                "release_date": "2017-08-31",
                "title": "God's Own Country",
                "video": false,
                "vote_average": 7.76,
                "vote_count": 946,
                "character": "Gloria",
                "credit_id": "591f7a1b9251414990039701",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Sarah Melanie Jean Kilburn is an English actress, known for portraying the role of Laura Bryant in the ITV police drama series The Bill. She also played the part of Sandra Conway, wife of CI Derek Conway in earlier episodes of The Bill. Her career began in 1983 when she starred as Maureen in The Company Car. She was in an episode of Casualty in 1990 (series 5). She played Eve Elliott in Coronation Street in 2001.\n\nKilburn rose to prominence as Jill in three series of the BBC's Making Out, and as Carol Anderson in Soldier Soldier.\n\nKilburn also starred as Sandra in Where the Heart Is throughout 1999, and played the regular role of Liz in Peak Practice during the series which aired in 2000.\n\nIn 2017, she starred as in God's own Country, alongside Josh O'Connor and Ian Hart. In 2019, Kilburn started in an episode of Brassic.[2] In 2020, she started in the reboot of All Creatures Great and Small.\n\nFrom 2017 to 2018, and again since 2022, Kilburn has appeared as Reverend Irene Mills in the BBC soap opera EastEnders. In 2021, she appeared in an episode of the BBC soap opera Doctors as Mavis Gregg.",
        "birthday": "1956-01-01",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.eamonnbedford.com/melaniekilburn/",
        "id": 1250099,
        "imdb_id": "nm0452950",
        "known_for_department": "Acting",
        "name": "Melanie Kilburn",
        "place_of_birth": "Bradford, West Yorkshire, England, UK ",
        "popularity": 0.1576,
        "profile_path": "/bSevkJEldWbFBJLQaOarjTMeZt8.jpg"
    }
}