{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8Tnn2UOlecCKNLKG8ZK5Mu6bK94.jpg",
                "genre_ids": [
                    80,
                    53
                ],
                "id": 845,
                "original_language": "en",
                "original_title": "Strangers on a Train",
                "overview": "Having met on a train, a smooth-talking psychotic socialite shares his theory on how two complete strangers can get away with murder to an amateur tennis player — a theory he plans to test out.",
                "popularity": 3.6336,
                "poster_path": "/ihC083U7ef56Ui4x0P0dobojrZ1.jpg",
                "release_date": "1951-06-27",
                "title": "Strangers on a Train",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 1775,
                "character": "Mr. Antony",
                "credit_id": "615cbcd6bb10570089e8c7ee",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/d7YwLX0PnX8vsaaQq9bz93jczGw.jpg",
                "genre_ids": [
                    35,
                    10402
                ],
                "id": 37719,
                "original_language": "en",
                "original_title": "A Night at the Opera",
                "overview": "The Marx Brothers take on high society and the opera world to bring two lovers together. A sly business manager and two wacky friends of two opera singers help them achieve success while humiliating their stuffy and snobbish enemies.",
                "popularity": 2.2813,
                "poster_path": "/A4YDGfJwaG7aMxDVrVJsOHJ7ufK.jpg",
                "release_date": "1935-11-15",
                "title": "A Night at the Opera",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 519,
                "character": "The Stage Manager (uncredited)",
                "credit_id": "59c562299251415b6e02e248",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jonathan Hale Jr.",
            "John Hale",
            "Jonathan Hatley"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nJonathan Hale (born Jonathan Hatley, March 21, 1891 – February 28, 1966) was a Canadian-born film and television actor.\n\nHale was born in Hamilton, Ontario, Canada. Before his acting career, Hale worked in the Diplomatic Corps. Hale is most well known as Dagwood Bumstead's boss, Julius Caesar Dithers, in the Blondie film series in the 1940s. He is also notable for playing Inspector Fernack in various The Saint films by RKO Pictures.\n\nIn 1950 he made two appearances in The Cisco Kid as Barry Owens. He also appeared in two different episodes of Adventures of Superman: \"The Evil Three\", in which he played a murderous \"Southern Colonel\"-type character, and \"Panic in the Sky\", one of the most famous episodes, in which he played the lead astronomer at the Metropolis Observatory, actually a California observatory.\n\nAmong the relatively few television programs on which Hale appeared are the religion anthology series Crossroads, The Loretta Young Show, Brave Eagle, Schlitz Playhouse, The Joey Bishop Show, and Walt Disney Presents: \"A Tribute to Joel Chandler Harris\".\n\nHale committed suicide on February 28, 1966. He was found dead that evening in his room at the Motion Picture & Television Country House and Hospital in Woodland Hills, California. Hale had taken his own life with a .38 caliber pistol, which was found near his body. He was 74. Hale was interred at Valhalla Memorial Park Cemetery in North Hollywood, California. Sadly, Hale's grave went unmarked for more than four decades, until a proper headstone was erected by donations from the \"Dearly Departed\" fan-based group in 2013; he is now honored with the inscription, \"We Remembered You\".",
        "birthday": "1891-03-20",
        "deathday": "1966-02-28",
        "gender": 2,
        "homepage": null,
        "id": 12502,
        "imdb_id": "nm0354947",
        "known_for_department": "Acting",
        "name": "Jonathan Hale",
        "place_of_birth": "Hamilton, Ontario, Canada",
        "popularity": 0.2197,
        "profile_path": "/6slWYX9NChUonIPcybOaFLDKjl9.jpg"
    }
}