{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8Tnn2UOlecCKNLKG8ZK5Mu6bK94.jpg",
                "genre_ids": [
                    80,
                    53
                ],
                "id": 845,
                "original_language": "en",
                "original_title": "Strangers on a Train",
                "overview": "Having met on a train, a smooth-talking psychotic socialite shares his theory on how two complete strangers can get away with murder to an amateur tennis player — a theory he plans to test out.",
                "popularity": 3.6336,
                "poster_path": "/ihC083U7ef56Ui4x0P0dobojrZ1.jpg",
                "release_date": "1951-06-27",
                "title": "Strangers on a Train",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 1775,
                "character": "Miriam Haines",
                "credit_id": "615cbcb8a33612006121459a",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Laura Elliott",
            "Casey Rogers Williams",
            "Laura Elliot",
            "Josie Imogene Rogers"
        ],
        "biography": "Kasey Rogers (born Josie Imogene Rogers; December 15, 1925 – July 6, 2006) was an American actress, memoirist and writer, best known for playing the second Louise Tate in the popular U.S. television sitcom Bewitched.\n\nRogers was born Josie Imogene Rogers. She moved with her family to California at the age of two. As a child, her prowess at the game of baseball led her friends to nickname her Casey (after the famous poem \"Casey at the Bat\"). While under contract to Paramount, she used the stage name Laura Elliot. In 1955, she began working with a press agent in Hollywood, Walter Winslow Lewis III (aka \"Bud\"). It was Bud who suggested that she use the nickname with her maiden name and changed the \"C\" to a \"K\". They later married and had four children.\n\nRogers began work under the names Laura Elliott and Laura Elliot for Paramount Pictures. She appeared in movies such as Special Agent, Samson and Delilah, Silver City, Paid in Full, Two Lost Worlds, and, in perhaps her best-known film role, Alfred Hitchcock's Strangers on a Train, playing Miriam, the scheming, adulterous wife of Guy Haines (Farley Granger).\n\nIn the mid-1950s, Rogers began working on television. She guest-starred on various series, such as Sergeant Preston, Stage 7, The Restless Gun, The Lone Ranger, Bat Masterson, Maverick, Yancy Derringer, Perry Mason, as Francie Keene in the Wanted: Dead or Alive episode \"Railroaded\", and many other programs. In 1964 she landed a starring role on Peyton Place, portraying the character Julie Anderson, the mother of Betty Anderson (Barbara Parkins). She left the series in 1966 to replace Irene Vernon in the role of Louise Tate on Bewitched. In 1972, she performed as Louise Tate for the final time in the episode \"Serena's Youth Pill\". She then retired from acting, appearing in only a few guest television spots and making appearances on the Bewitched edition of E! True Hollywood Story.",
        "birthday": "1925-12-15",
        "deathday": "2006-07-06",
        "gender": 1,
        "homepage": null,
        "id": 12505,
        "imdb_id": "nm0736990",
        "known_for_department": "Acting",
        "name": "Kasey Rogers",
        "place_of_birth": "Morehouse, Missouri, USA",
        "popularity": 0.2652,
        "profile_path": "/qWZnZoFHBUaMLNKnlDaNYrb7xQV.jpg"
    }
}