{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tyWnJeMatQGLsiLfLsxBV0pp9nk.jpg",
                "genre_ids": [
                    18
                ],
                "id": 6619,
                "original_language": "it",
                "original_title": "Morte a Venezia",
                "overview": "Composer Gustav von Aschenbach travels to Venice for health reasons. There, he becomes obsessed with the stunning beauty of an adolescent Polish boy named Tadzio who is staying with his family at the same Grand Hôtel des Bains on the Lido as Aschenbach.",
                "popularity": 1.5969,
                "poster_path": "/s81SuFBSqY8T5Lrn5R8ucX8LKxi.jpg",
                "release_date": "1971-03-05",
                "title": "Death in Venice",
                "video": false,
                "vote_average": 7.279,
                "vote_count": 509,
                "character": "Tadzio's Mother",
                "credit_id": "52fe445ec3a36847f8091f4b",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "실바나 망가노",
            "실바나 만가노",
            "Сильвана Мангано"
        ],
        "biography": "Silvana Mangano (21 April 1930 – 16 December 1989) was an Italian film actress. She was one of a generation of thespians who arose from the neorealist movement, and went on to become a major female star, regarded as a sex symbol in the 1950s and 1960s. She won the David di Donatello for Best Actress three times - for The Verona Trial (1963), The Witches (1967), and The Scientific Cardplayer (1973) – and the Nastro d'Argento for Best Actress twice.\n\nRaised in poverty during World War II, Mangano trained as a dancer and worked as a model before winning a Miss Rome beauty pageant in 1946. This led to work in films; she achieved success in Bitter Rice (1949) and went on to forge a successful career in films, working with many notable directors like Pier Paolo Pasolini, Luchino Visconti, Alberto Lattuada, and Vittorio De Sica. Her career continued well into her 50s, with supporting roles in David Lynch's Dune (1984) and Nikita Mikhalkov Dark Eyes (1987).\n\nMangano was the wife of international film producer Dino De Laurentiis and had four children with him, including Veronica De Laurentiis and Raffaella De Laurentiis.\n\nDescription above from the Wikipedia article Silvana Mangano, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1930-04-21",
        "deathday": "1989-12-16",
        "gender": 1,
        "homepage": null,
        "id": 12520,
        "imdb_id": "nm0542146",
        "known_for_department": "Acting",
        "name": "Silvana Mangano",
        "place_of_birth": "Rome, Latium, Italy",
        "popularity": 0.4053,
        "profile_path": "/zw7mPNjAGL24vKuFLaaFqQogHS.jpg"
    }
}