{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5nkKy7eEDsXqsxFLJy3GxZhE90J.jpg",
                "genre_ids": [
                    16,
                    14,
                    18,
                    12
                ],
                "id": 476292,
                "original_language": "ja",
                "original_title": "さよならの朝に約束の花をかざろう",
                "overview": "Maquia is a member of a special race called the Iorph who can live for hundreds of years. However, Maquia has always felt lonely despite being surrounded by her people, as she was orphaned from a young age. She daydreams about the outside world, but dares not travel from her home due to the warnings of the clan's chief.  One day the kingdom of Mezarte invades her homeland. They already have what is left of the giant dragons, the Renato, under their control, and now their king wishes to add the immortality to his bloodline.  They ravage the Iorph homeland and kill most of its inhabitants. Caught in the midst of the attack, Maquia is carried off by one of the Renato. It soon dies, and she is left deserted in a forest, now truly alone save for the cries of a single baby off in the distance. Maquia finds the baby in a destroyed village and decides to raise him as her own, naming him Ariel. Although she knows nothing of the human world, how to raise a child that ages much faster than her.",
                "popularity": 2.59,
                "poster_path": "/hL3NqRE2ccR4Y2sYSJTrmalRjrz.jpg",
                "release_date": "2018-02-24",
                "title": "Maquia: When the Promised Flower Blooms",
                "video": false,
                "vote_average": 8.183,
                "vote_count": 667,
                "character": "King of Baiera (voice)",
                "credit_id": "646f7a7de22d2816ab2fe33b",
                "order": 22
            },
            {
                "adult": false,
                "backdrop_path": "/i1GT0e6Crg6UezT3ibXnMS3pBAd.jpg",
                "genre_ids": [
                    16,
                    18,
                    10749
                ],
                "id": 652837,
                "original_language": "ja",
                "original_title": "ジョゼと虎と魚たち",
                "overview": "With dreams of diving abroad, Tsuneo gets a job assisting Josee, an artist whose imagination takes her far beyond her wheelchair. But when the tide turns against them, they push each other to places they never thought possible, and inspire a love fit for a storybook.",
                "popularity": 4.8739,
                "poster_path": "/lNpZWdXC4HtXQ8nVo21gg7T9D6N.jpg",
                "release_date": "2020-12-25",
                "title": "Josee, the Tiger and the Fish",
                "video": false,
                "vote_average": 8.318,
                "vote_count": 536,
                "character": "Mizushima (voice)",
                "credit_id": "648ef357c3c891010ca55bd3",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/wghKvEjM7UzQzQcKnGbDjOyQO13.jpg",
                "genre_ids": [
                    16,
                    12,
                    28,
                    14,
                    10402
                ],
                "id": 900667,
                "original_language": "ja",
                "original_title": "ONE PIECE FILM RED",
                "overview": "Uta — the most beloved singer in the world. Her voice, which she sings with while concealing her true identity, has been described as “otherworldly.” She will appear in public for the first time at a live concert. As the venue fills with all kinds of Uta fans — excited pirates, the Navy watching closely, and the Straw Hats led by Luffy who simply came to enjoy her sonorous performance — the voice that the whole world has been waiting for is about to resound.",
                "popularity": 5.578,
                "poster_path": "/m80kPdrmmtEh9wlLroCp0bwUGH0.jpg",
                "release_date": "2022-08-06",
                "title": "One Piece Film Red",
                "video": false,
                "vote_average": 7.195,
                "vote_count": 1080,
                "character": "Charlotte Perospero (voice)",
                "credit_id": "636867b21684f7008aeb5b60",
                "order": 51
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Yûya Uchida",
            "Hidekazu Uchida",
            "内田秀和",
            "Yuya Uchida",
            "Yūya Uchida",
            "内田 夕夜"
        ],
        "biography": "Yūya Uchida is a Japanese actor and voice actor who is a member of the Haiyuza Theatre Company. He is the best known dubbing roles for James McAvoy, as well in X-Men film series, Cillian Murphy, Ryan Gosling, Feng Shaofeng, Daniel Brühl, Ha Jung-woo, Shin Ha-kyun and many more.",
        "birthday": "1965-12-03",
        "deathday": null,
        "gender": 2,
        "homepage": "https://haikyo.co.jp/profile/profile.php?ActorID=13040",
        "id": 1252998,
        "imdb_id": "nm8095190",
        "known_for_department": "Acting",
        "name": "Yuuya Uchida",
        "place_of_birth": "Saitama, Japan",
        "popularity": 0.4307,
        "profile_path": "/4xLLQGEDWtmLWUapo0UnfvCdsXp.jpg"
    }
}