{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dwVF2gVQLfdbTLlDf2gteqa93gw.jpg",
                "genre_ids": [
                    10751,
                    18,
                    35
                ],
                "id": 340270,
                "original_language": "en",
                "original_title": "The Healer",
                "overview": "The film follows a man with an unwanted gift for healing who meets a teenager with cancer who helps him to find himself.",
                "popularity": 2.791,
                "poster_path": "/mwBsg7cFE7GwDPKP4Pv26w2Txmp.jpg",
                "release_date": "2017-02-17",
                "title": "The Healer",
                "video": false,
                "vote_average": 7.176,
                "vote_count": 522,
                "character": "William",
                "credit_id": "59fdbdb992514146f5018321",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Glenn Lefchak"
        ],
        "biography": "Glenn Lefchak grew up in Tunkhannock, a small town in northeastern Pennsylvania. He attended the BFA theatre program at Penn State University's main campus. While there, he was the recipient of Penn State's \"Above and Beyond Award\" for co-founding the off-campus theatre, \"Graffiti Basement\". Glenn lived in New York City for several years before relocating to Nova Scotia, Canada with his wife. Here he shifted his focus to T.V., film, and voice work. He won two lead roles in Teletoon's \"Oliver's Adventures\", a Gemini award-winning cartoon. Glenn has since had the good fortune of working with many talented actors such as; Pierce Brosnan, Christina Ricci, Tom Selleck, Jason Priestley, Corey Monteith, Oliver Jackson Cohen, and Sam Elliott. One of the many highlights of Glenn's career was playing the recurring character of Stan Bannerman on Sy-Fy's hit series, \"Haven\", for five seasons., Glenn continues to enjoy life on Nova Scotia's eastern shore with his wife Kristin, daughter Anneke-Rose, his son Indio, and his many canine companions.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1252215,
        "imdb_id": "nm1473878",
        "known_for_department": "Acting",
        "name": "Glen Lefchak",
        "place_of_birth": "Tunkhannock, Pennsylvania, USA",
        "popularity": 0.0858,
        "profile_path": "/sAszLwVV3F9BxRmkrjewjkbrLYX.jpg"
    }
}