{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yFZG86Zvdy6JuIlMW9eHxlVkct5.jpg",
                "genre_ids": [
                    16,
                    28,
                    12,
                    14,
                    878
                ],
                "id": 413594,
                "original_language": "ja",
                "original_title": "劇場版 ソードアート・オンライン -オーディナル・スケール-",
                "overview": "In 2026, four years after the infamous Sword Art Online incident, a revolutionary new form of technology has emerged: the Augma, a device that utilizes an Augmented Reality system. Unlike the Virtual Reality of the NerveGear and the Amusphere, it is perfectly safe and allows players to use it while they are conscious, creating an instant hit on the market. The most popular application for the Augma is the game Ordinal Scale, which immerses players in a fantasy role-playing game with player rankings and rewards.  Following the new craze, Kirito's friends dive into the game, and despite his reservations about the system, Kirito eventually joins them. While at first it appears to be just fun and games, they soon find out that the game is not all that it seems...",
                "popularity": 4.319,
                "poster_path": "/2szdEK0Mr0RG0nWGFVTseNQHbnP.jpg",
                "release_date": "2017-02-18",
                "title": "Sword Art Online: The Movie – Ordinal Scale",
                "video": false,
                "vote_average": 7.695,
                "vote_count": 711,
                "character": "Siune (voice)",
                "credit_id": "64656cecd1857201402f1afe",
                "order": 22
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "嶋村 侑",
            "Yuu Shimamura",
            "Yū Shimamura"
        ],
        "biography": "Yu Shimamura (嶋村 侑, Shimamura Yū) is a Japanese voice actress from Tokyo, Japan. She was formerly affiliated with Office Kaoru from 2005–08 and is now affiliated with Ken Production. She has had main roles in several anime shows including as Akiko in Bungo Stray Dogs, Haruka Haruno / Cure Flora in Go! Princess PreCure, Toru Takagami in Our Home's Fox Deity, and Faylin in Tanken Driland Sennen no Maho. She provides supporting character voices for Annie Leonhart in Attack on Titan, Kaoru in Aldnoah.Zero, and Aida in Gundam Reconguista in G. Her work in video games includes voicing Princess Zelda in The Legend of Zelda: Skyward Sword and The Legend of Zelda: Breath of the Wild.",
        "birthday": "1985-04-18",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.kenproduction.co.jp/talent/43",
        "id": 1253896,
        "imdb_id": "nm2944513",
        "known_for_department": "Acting",
        "name": "Yu Shimamura",
        "place_of_birth": "Tokyo, Japan",
        "popularity": 0.3014,
        "profile_path": "/uwfGYR10w70RLH8z00eqWIx5YOY.jpg"
    }
}