{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yjlg8Gq3TAWlFSUxh7Icey8uM4P.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 10653,
                "original_language": "en",
                "original_title": "The Seven Year Itch",
                "overview": "With his family away for their annual summer holiday, a publishing executive decides to live a bachelor's life. The beautiful but ditzy blonde from the apartment above catches his eye and they soon start spending time together—maybe a little too much time!",
                "popularity": 1.7389,
                "poster_path": "/4oLqx0QbjWFzWtkxRmDLGH47CUJ.jpg",
                "release_date": "1955-06-03",
                "title": "The Seven Year Itch",
                "video": false,
                "vote_average": 7.063,
                "vote_count": 934,
                "character": "Plumber",
                "credit_id": "52fe439c9251416c75017309",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Victor Fred Moore"
        ],
        "biography": "Victor Moore was born on February 24, 1876 in Hammonton, New Jersey, USA as Victor Frederick Moore. He was an actor, known for Swing Time (1936), Make Way for Tomorrow (1937) and The Seven Year Itch (1955). He was married to Shirley Paige and Emma Littlefield. He died on July 24, 1962 in East Islip, Long Island, New York, USA.\n\nMoore and his first wife were a vaudeville team for several decades before her death. Moore did not announce his marriage to Shirley Paige until they had been married for a year and a half. At the time of the announcement he was 67 and she was 22.\n\nMoore, or his family, was into buying real estate. A building in the Jackson Heights section of Queens is named after him. The Victor Moore Arcade is bounded by Roosevelt Ave., Broadway (Queens' Broadway) and 75th St. It houses stores, offices, a bus terminal and two entrances to a subway station. The Victor Moore Arcade was actually seen in a movie. Henry Fonda exits from the subway at this building at the start of Alfred Hitchcock's The Wrong Man (1956).",
        "birthday": "1876-02-23",
        "deathday": "1962-07-24",
        "gender": 2,
        "homepage": null,
        "id": 125364,
        "imdb_id": "nm0602005",
        "known_for_department": "Acting",
        "name": "Victor Moore",
        "place_of_birth": "Hammonton, New Jersey, United States",
        "popularity": 1.8994,
        "profile_path": "/qDoKZ77Pmq1RebbJiQHEmwpUyia.jpg"
    }
}