{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/k5SLaqFAEdDLlMv6KaNOj5eL0SA.jpg",
                "genre_ids": [
                    18,
                    53
                ],
                "id": 14637,
                "original_language": "en",
                "original_title": "Nothing But the Truth",
                "overview": "When reporter Rachel Armstrong writes a story that reveals the identity of a covert CIA operative, the government demands that Rachel reveal her source. She defies the special prosecutor and is thrown in jail. Meanwhile, her attorney, Albert Burnside argues her case all the way to the U.S. Supreme Court.",
                "popularity": 3.9479,
                "poster_path": "/ueJXKG3PFoDPEhcKtIjP52fCRQ5.jpg",
                "release_date": "2008-12-19",
                "title": "Nothing But the Truth",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 510,
                "character": "Celia",
                "credit_id": "52fe460b9251416c7506b1ff",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Мерл Дэндридж"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nMerle Dandridge is a Japanese-American actress who was born in Okinawa, Japan. Dandridge is primarily a stage actress, but has had several roles in television. She has gained a wider audience as the voice of Alyx Vance in the award-winning action game Half-Life 2 and its sequels, Episode One, Episode Two.\n\nHer father was an African-American US serviceman from Memphis and her mother was a local Okinawan of Korean and Japanese descent. As well as Okinawa, Dandridge has lived in Sacramento, California, at Beale Air Force Base, and later at Offutt Air Force Base (home to the then-Strategic Air Command) in Bellevue, Nebraska, where she spent the majority of her childhood. She attended Papillion La Vista High School and participated in the play production class and theater department there.\n\nShe then attended the Theatre Conservatory at Roosevelt University (currently called the Chicago College of Performing Arts) with a scholarship that she earned at the International Thespian Festival.",
        "birthday": "1975-05-31",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.merledandridge.com/",
        "id": 1253388,
        "imdb_id": "nm1617568",
        "known_for_department": "Acting",
        "name": "Merle Dandridge",
        "place_of_birth": "Okinawa - Japan",
        "popularity": 0.3383,
        "profile_path": "/qoPX7VpSPl4GVuwnBPdfJ39Jt46.jpg"
    }
}