{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/q9HocL5f8WwPldwpvmpk8ZaNZkC.jpg",
                "genre_ids": [
                    28,
                    53,
                    878
                ],
                "id": 500664,
                "original_language": "en",
                "original_title": "Upgrade",
                "overview": "A brutal mugging leaves Grey Trace paralyzed in the hospital and his beloved wife dead. A billionaire inventor soon offers Trace a cure — an artificial intelligence implant called STEM that will enhance his body. Now able to walk, Grey finds that he also has superhuman strength and agility — skills he uses to seek revenge against the thugs who destroyed his life.",
                "popularity": 5.9109,
                "poster_path": "/5f28TXtvHioXirX2n1XH8EJ314v.jpg",
                "release_date": "2018-05-31",
                "title": "Upgrade",
                "video": false,
                "vote_average": 7.495,
                "vote_count": 4683,
                "character": "Serk",
                "credit_id": "5b0602d8c3a3684c98005a48",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Australian actor Richard Cawthorne was born in Hong Kong in 1976, the youngest of two, his mother Zelda was a journalist for the South China Morning Post, and his father Russell, a Marketing Executive for Hong Kong film company Golden Harvest Studios.  After spending his final year of education boarding in the UK, Richard moved to Australia in the mid 90's.  Training initially at St Martins Youth Arts Centre, Richard then went on to study at Melbourne's National Theatre where he graduated in 1999.  Early guest appearances on Australian television paved the way to Richard earning his first semi regular role as 'Ruban 'Roo' Hausman' on the popular Australia soap\n\nNeighbours (1985) (2004/2005).  In 2003 Richard was cast as the lead in the independent feature \n\nRazor Eaters (2003), though the film was not a commercial success, Richards work won both critical praise and a subsequent Best Actor Award at the Shreikfest Film festival (Los Angeles) in 2005.  In 2012 Richard won the Australian Academy of Cinema and Television Arts Award (AACTA), for his critically acclaimed portrayal of notorious Australian underworld figure Dennis Allan in the prime time drama \n\nKilling Time (2010).",
        "birthday": "1976-12-03",
        "deathday": null,
        "gender": 2,
        "homepage": "http://imcompany.com.au/actors/richard-cawthorne/",
        "id": 1255064,
        "imdb_id": "nm1010852",
        "known_for_department": "Acting",
        "name": "Richard Cawthorne",
        "place_of_birth": "Hong Kong",
        "popularity": 0.1681,
        "profile_path": "/vHiIRRxFOdB0jKbBL9Xdf4Umj20.jpg"
    }
}