{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/i1GT0e6Crg6UezT3ibXnMS3pBAd.jpg",
                "genre_ids": [
                    16,
                    18,
                    10749
                ],
                "id": 652837,
                "original_language": "ja",
                "original_title": "ジョゼと虎と魚たち",
                "overview": "With dreams of diving abroad, Tsuneo gets a job assisting Josee, an artist whose imagination takes her far beyond her wheelchair. But when the tide turns against them, they push each other to places they never thought possible, and inspire a love fit for a storybook.",
                "popularity": 4.8739,
                "poster_path": "/lNpZWdXC4HtXQ8nVo21gg7T9D6N.jpg",
                "release_date": "2020-12-25",
                "title": "Josee, the Tiger and the Fish",
                "video": false,
                "vote_average": 8.318,
                "vote_count": 536,
                "character": "Tsuneo Suzukawa (voice)",
                "credit_id": "5f34464922af3e00375fad97",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "中川 大志"
        ],
        "biography": "Taishi Nakagawa is a Japanese actor, host, and model. He is best known for his leading role as Yuiji Kira in the live action Closest Love to Heaven, and as Tenma Hase in the second season of Hana Yori Dango. Nakagawa originally started as a child actor but because of his sudden growth spurt he was given roles that were much older than his real age. He debuted in 2009 when he portrayed the young Ikki Sawamura in a drama re-enactment of TV documentary “When I Was a Child” which features Japanese actors and actresses in their childhood.\n\nHe is also a regular performer in “The Comedy of Life”, a comedy skit show that depicts the joys and sorrows of life which is presented in an omnibus format since 2018 but have been guesting on the show since 2017.",
        "birthday": "1998-06-14",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.stardust.co.jp/talent/section3/nakagawataishi/",
        "id": 1255318,
        "imdb_id": "nm4667834",
        "known_for_department": "Acting",
        "name": "Taishi Nakagawa",
        "place_of_birth": "Tokyo, Japan",
        "popularity": 1.1894,
        "profile_path": "/gvUJ1Ge1ERLnYwqb4cJVCXQQIYA.jpg"
    }
}