{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jFK8BOPL6ZeWyjMVWX8ajsTTinp.jpg",
                "genre_ids": [
                    16,
                    18,
                    14,
                    10749
                ],
                "id": 568160,
                "original_language": "ja",
                "original_title": "天気の子",
                "overview": "The summer of his high school freshman year, Hodaka runs away from his remote island home to Tokyo, and quickly finds himself pushed to his financial and personal limits. The weather is unusually gloomy and rainy every day, as if taking its cue from his life. After many days of solitude, he finally finds work as a freelance writer for a mysterious occult magazine. Then, one day, Hodaka meets Hina on a busy street corner. This bright and strong-willed girl possesses a strange and wonderful ability: the power to stop the rain and clear the sky.",
                "popularity": 7.0809,
                "poster_path": "/qgrk7r1fV4IjuoeiGS5HOhXNdLJ.jpg",
                "release_date": "2019-06-19",
                "title": "Weathering with You",
                "video": false,
                "vote_average": 8.0,
                "vote_count": 2463,
                "character": "Natsumi Suga (voice)",
                "credit_id": "5d1a6a7aaf95900021cd3f66",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "ซึบาสะ ฮอนดะ",
            "توباسا هوندا"
        ],
        "biography": "Tsubasa Honda is a Japanese actress and model.  In mid-2006, Honda entered the entertainment industry after being scouted by seven different people on the same day. She then debuted as an exclusive model for the magazine Seventeen in the same year. In 2007, she switched magazines, being an exclusive model for Love Berry. From January 2010 onwards, she switched again to Non-no.  From April 2012 to May 2013, she was the assistant of the TBS talk show A-Studio hosted by Shōfukutei Tsurube II. In November 2012, she made her film debut by starring in the film Fashion Story: Model. In July 2013, she appeared as an MC on the late-night music show Music Dragon aired on NTV. She played the heroine in the Fuji TV getsuku drama Koinaka in July 2015.",
        "birthday": "1992-06-27",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.stardust.co.jp/section1/profile/hondatsubasa.html",
        "id": 1255487,
        "imdb_id": "nm4836118",
        "known_for_department": "Acting",
        "name": "Tsubasa Honda",
        "place_of_birth": "Tokyo, Japan",
        "popularity": 0.8487,
        "profile_path": "/1xdR7FXHc3zeRrMyy5qHlDQr9Ou.jpg"
    }
}