{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/eVFfdrBbDX1B3y1yIxoRjrGM24i.jpg",
                "genre_ids": [
                    10749,
                    35
                ],
                "id": 656563,
                "original_language": "pt",
                "original_title": "Ricos de Amor",
                "overview": "Working incognito at his rich dad's company to test his own merits, Teto falls for Paula and tells her he grew up poor, a lie that spins out of control.",
                "popularity": 1.8751,
                "poster_path": "/dVqRATKlpCoWy96lfxiHc9TY9An.jpg",
                "release_date": "2020-04-30",
                "title": "Rich in Love",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 624,
                "character": "Paula",
                "credit_id": "5e8f11bdd35dea001373323f",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Giovanna Lancellotti Roxo is a Brazilian actress. Giovanna was born in Ribeirão Preto and raised in São João da Boa Vista, in the interior of São Paulo. In 2008, she left the city where she grew up to live in the capital, with the intention of studying theater. At the age of 16, she was emancipated by her parents, who didn't have time to keep up with her testing routine.\n\nOne of Caio Castro's best friends, the actress and the actor got the same tattoo in Arabic to seal the strong relationship they have. However, shortly afterwards they discovered that the expression, which should be \"muse\" and \"muso\" (nicknames between the two), was wrong. In fact, the meaning etched into the duo's skin was: \"They're watching you.\" The duo took it in humour.\n\nIn October 2010, Giovanna started a relationship with Pe Lanza, leader of the teen band Restart. The couple conquered a legion of teenage fans, but the romance came to an end in September of the following year, with the announcement of the end on Twitter. In August 2012, she started dating Rebeldes band member Arthur Aguiar. The relationship came to an end in October 2013.\n\nIn early 2016, she started a relationship with the artist Gian Lucca Ewbank, brother of Giovanna Ewbank. In December 2017, through a note released by her press office, the actress commented on the end: “Our friendship, affection and admiration remain”.",
        "birthday": "1993-05-21",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1255197,
        "imdb_id": "nm4535489",
        "known_for_department": "Acting",
        "name": "Giovanna Lancellotti",
        "place_of_birth": "Ribeirão Preto, São Paulo, Brazil",
        "popularity": 0.6945,
        "profile_path": "/9OP9V5kd9AULhghKwaJCBSpHsMM.jpg"
    }
}