{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lXSJETt0cbiemixfHuBpopAg8pT.jpg",
                "genre_ids": [
                    18
                ],
                "id": 472674,
                "original_language": "en",
                "original_title": "The Goldfinch",
                "overview": "A boy in New York is taken in by a wealthy family after his mother is killed in a bombing at the Metropolitan Museum of Art. In a rush of panic, he steals 'The Goldfinch', a painting that eventually draws him into a world of crime.",
                "popularity": 4.0378,
                "poster_path": "/5Jx9VyVPiK9GQ7ouKLkTUYnZSQ4.jpg",
                "release_date": "2019-09-12",
                "title": "The Goldfinch",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 904,
                "character": "Pippa",
                "credit_id": "5a4315550e0a2620e005f9b8",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Ashleigh Cummings (born 11 November 1992) is an Australian actress. She is known for her roles in the films Tomorrow, When the War Began (2010), Puberty Blues (2012), Miss Fisher's Murder Mysteries (2012–2015), Hounds of Love (2016), NOS4A2 (2019), and Citadel (2022–present). Cummings was born in Jeddah, Saudi Arabia, to Australian parents. She moved to Australia with her family when she was 12 years old. She began her acting career in the early 2000s, appearing in a number of television commercials and short films. In 2007, she made her feature film debut in Razzle Dazzle. Cummings' breakthrough role came in 2010, when she starred in the film Tomorrow, When the War Began. The film was a critical and commercial success, and Cummings was nominated for Best Young Actor at the 2010 Australian Film Institute Awards. Since then, Cummings has starred in a number of films and television series, including Puberty Blues, Miss Fisher's Murder Mysteries, Hounds of Love, NOS4A2, and Citadel. She is known for her versatility and her ability to bring complex characters to life. Cummings has won numerous awards for her work, including the Australian Film Institute Award for Best Young Actor (2010), the Logie Award for Most Outstanding New Talent (2013), and the AACTA Award for Best Lead Actress in a Television Drama (2019). Cummings is a talented actress with a bright future ahead of her. She is known for her versatility and her ability to bring complex characters to life.",
        "birthday": "1992-11-11",
        "deathday": null,
        "gender": 1,
        "homepage": "https://lmcm.com.au/actors/#/actors/36185",
        "id": 1255846,
        "imdb_id": "nm2913280",
        "known_for_department": "Acting",
        "name": "Ashleigh Cummings",
        "place_of_birth": "Yidda, Saudi Arabia",
        "popularity": 0.7086,
        "profile_path": "/yyU5YaJBJFxE1WfREe5SujJukYW.jpg"
    }
}