{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/aT3sRVqgpkyCo23fp9myVfKPWbA.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 964980,
                "original_language": "en",
                "original_title": "Air",
                "overview": "Discover the game-changing partnership between a then undiscovered Michael Jordan and Nike's fledgling basketball division which revolutionized the world of sports and culture with the Air Jordan brand.",
                "popularity": 11.3509,
                "poster_path": "/76AKQPdH3M8cvsFR9K8JsOzVlY5.jpg",
                "release_date": "2023-04-05",
                "title": "Air",
                "video": false,
                "vote_average": 7.31,
                "vote_count": 2148,
                "character": "Katrina Sainz",
                "credit_id": "635538e543250f007d048d47",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jessica Lauren Green",
            "Джессика Лорен Грин"
        ],
        "biography": "Jessica Green, was born on February 11, 1993, in Tasmania, Australia. With her striking blue eyes and a height of 5’9\" (1.75 m), she has made a significant impact in the entertainment industry.  In her early career, she appeared in minor roles in films such as Peter Pan (Universal Pictures) and Aqua Marine (Fox). However, her breakthrough came in 2013 when she secured the lead role of “KIKI” in the Jonathon M. Shiff production LIGHTNING POINT (also known as Alien Surf Girls). This role required her to surf and ride horses, showcasing her versatility.\n\nJessica continued to make her mark in the industry with film appearances. Notably, she played ‘Rebecca’ in the Australian action-thriller RED BILLABONG (Sparke Films) in 2016. Her talent and dedication also led her to a role in PIRATES OF THE CARIBBEAN: Dead Men Tell No Tales (Disney).\n\nIn 2017, Jessica portrayed Cleopatra in ROMAN EMPIRE (Netflix) and Lexx in ASH VS EVIL DEAD (Starz), further establishing her presence on the international stage.\n\nHowever, her most iconic role to date is that of ‘TALON’ in THE OUTPOST, a fantasy adventure series that aired on The CW Network and NBCU SYFY channels. Jessica performed her own stunts, including wire work, demonstrating her mixed martial arts, horse riding, and weapon skills.",
        "birthday": "1993-02-11",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1255055,
        "imdb_id": "nm4880301",
        "known_for_department": "Acting",
        "name": "Jessica Green",
        "place_of_birth": "Tasmania, Australia",
        "popularity": 1.5783,
        "profile_path": "/4JSodEaThdJfbJVYOdW6IvWLQZ6.jpg"
    }
}