{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jpFcZH2eyh6gcoxCa637TrGe4bT.jpg",
                "genre_ids": [
                    28,
                    878
                ],
                "id": 2048,
                "original_language": "en",
                "original_title": "I, Robot",
                "overview": "In 2035, where robots are commonplace and abide by the three laws of robotics, a technophobic cop investigates an apparent suicide. Suspecting that a robot may be responsible for the death, his investigation leads him to believe that humanity may be in danger.",
                "popularity": 7.5859,
                "poster_path": "/efwv6F2lGaghjPpBRSINHtoEiZB.jpg",
                "release_date": "2004-07-15",
                "title": "I, Robot",
                "video": false,
                "vote_average": 6.956,
                "vote_count": 12214,
                "character": "Mob Woman",
                "credit_id": "56af2fc79251417e2900bd24",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Tiffany Knight"
        ],
        "biography": "Canadian-born and Australian-bred, Tiffany Lyndall Knight is at home on both stage and screen. Nominated for four Jessie Theatre Richardson awards, her theatre credits span eight seasons with Vancouver's Bard on the Beach Shakespeare Festival. Highlights include \"Ariel\" in \"The Tempest\", \"Olivia\" in \"Twelfth Night\", \"Helena\" in \"A Midsummer Night's Dream\" and \"Regan\" in \"King Lear\".\n\nA graduate of Toronto's acclaimed George Brown Theatre School, Tiffany has taught and created theatre with young people throughout her career. She has developed programs for Bard on the Beach's education division, was a founder of the Gateway Academy of Performing Arts at the Gateway Theatre in Richmond BC, and has taught at the William Davis Centre for Performing Arts, the University of British Columbia, Adelaide Centre for the Arts, and Flinders University Drama Centre, South Australia. On screen, she has appeared in many lead and recurring roles, including the popular television series,Battlestar Galactica\n\n (2004), Da Vinci's City Hall (2005), Stargate SG-1 (1997) andSupernatural (2005). She was a co-creator and actor in the feature film,Mothers&amp;Daughters (2008), which screened at the Toronto International Film Festival and won Most Popular Canadian Film at the Vancouver International Film Festival in 2008. - IMDb Mini Biography",
        "birthday": "1972-10-17",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.tiffanylyndallknight.com/",
        "id": 125581,
        "imdb_id": "nm0461101",
        "known_for_department": "Acting",
        "name": "Tiffany Lyndall-Knight",
        "place_of_birth": "Toronto, Ontario, Canada",
        "popularity": 0.2022,
        "profile_path": "/hCPsCvuaA5cupinxmZ65pk3PhAM.jpg"
    }
}