{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9g8UsxDTkzlVyjBJBRJT3zDceTC.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 376660,
                "original_language": "en",
                "original_title": "The Edge of Seventeen",
                "overview": "Two high school girls are best friends until one dates the other's older brother, who is totally his sister's nemesis.",
                "popularity": 7.8552,
                "poster_path": "/1LyFay8CGf8mhPRDrMe0ljWw9GK.jpg",
                "release_date": "2016-11-18",
                "title": "The Edge of Seventeen",
                "video": false,
                "vote_average": 7.161,
                "vote_count": 4131,
                "character": "Little Darian",
                "credit_id": "5690c9c2c3a3686b44001dd2",
                "order": 12
            },
            {
                "adult": false,
                "backdrop_path": "/xXhta1NIKn09IXy0mfp68cabdWS.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 466282,
                "original_language": "en",
                "original_title": "To All the Boys I've Loved Before",
                "overview": "Lara Jean's love life goes from imaginary to out of control when her secret letters to every boy she's ever fallen for are mysteriously mailed out.",
                "popularity": 7.1335,
                "poster_path": "/hKHZhUbIyUAjcSrqJThFGYIR6kI.jpg",
                "release_date": "2018-08-17",
                "title": "To All the Boys I've Loved Before",
                "video": false,
                "vote_average": 7.599,
                "vote_count": 8578,
                "character": "Young Josh",
                "credit_id": "5ad8f8f69251412ced0025f9",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "A dedicated performer, Christian Michael Cooper has worked in the industry since his debut commercial at thirteen months. Residing in British Columbia, Christian's list of accomplishments include commercials, films, and reoccurring roles on popular series including Cult, The Crossing, and The Order. His performance in Life on the Line found Christian working alongside John Travolta, Kate Bosworth, and Devon Sawa. At the age of nine he landed his breakout role as Mike Scofield, the son of Michael (Wentworth Miller) and Sara Scofield (Sarah Wayne Callies) in the popular Fox series, Prison Break.\n\nEntering his sixth season, Christian returns to the role of Timmy Lawson on Hallmark Channel's original series, When Calls the Heart. In this same year, he appears as young Sam in the fifteenth and final season of the longstanding series, Supernatural.\n\nChristian's talent has been recognized with a number of nominations or wins for his performances. Working alongside Josh Dallas, Emily Bett Rickards, and Tom Cavanagh, Christian enjoyed his role as a superhero in the short film, Sidekick. He was awarded a Young Entertainer Award for Best Young Actor 11 & Under, as well as a Young Artist Award for Best Performance in a Short Film - Young Actor. His work in All The Boys I've Loved Before, Cooking With Love, and as the son of Benjamin Ayres in Falling For Love, also resulted in nominations or wins from the Young Entertainer Awards, Young Artist Awards, and the Joey Awards.\n\nWhen Christian isn't sharpening his acting skills, he enjoys time with his family, which includes his sister and fellow actor, Ava Grace Cooper, as well as his friends, and beloved dog Jake. Other interests include soccer, and spending time outdoors, especially mountain biking and fishing.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1256296,
        "imdb_id": "nm5031540",
        "known_for_department": "Acting",
        "name": "Christian Michael Cooper",
        "place_of_birth": null,
        "popularity": 1.1385,
        "profile_path": "/v0aG9THfELyBmwjhmL3eiWfHIB6.jpg"
    }
}