{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fXmaCa7bE5mp9AMkVT8cKaI5GMK.jpg",
                "genre_ids": [
                    53,
                    9648,
                    10749
                ],
                "id": 705996,
                "original_language": "ko",
                "original_title": "헤어질 결심",
                "overview": "From a mountain peak in South Korea, a man plummets to his death. Did he jump, or was he pushed? When detective Hae-joon arrives on the scene, he begins to suspect the dead man’s wife Seo-rae. But as he digs deeper into the investigation, he finds himself trapped in a web of deception and desire.",
                "popularity": 5.9561,
                "poster_path": "/TDaXKGBqJUSbCQ9XjkrJs8GYuU.jpg",
                "release_date": "2022-06-29",
                "title": "Decision to Leave",
                "video": false,
                "vote_average": 7.337,
                "vote_count": 1344,
                "character": "Soo-wan",
                "credit_id": "5f697af9a0b69000393e26e3",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ko Kyung-pyo",
            "Go Kyung-pyo",
            "Ko Gyung-pyo",
            "Go Gyeong-pyo",
            "گو کیونگ پیو"
        ],
        "biography": "Go Kyung-pyo (Korean: 고경표; born June 11, 1990) is a South Korean actor and comedian. He gained recognition for his role in the television series Reply 1988 (2015–16) and has since starred in Don't Dare to Dream (2016) and Chicago Typewriter (2017). Go starred in his first leading role in KBS2's Strongest Deliveryman in August 2017.\n\nGo made his acting debut in 2010, and became a cast member of the live sketch comedy show Saturday Night Live Korea for its first three seasons. Since then, he has featured in the sitcom Standby (2012) and dramas My Cute Guys (2013) and Naeil's Cantabile (2014).\n\nGo gained wider recognition with his roles in Reply 1988 (2015) and Don't Dare to Dream (2016). He received the \"New Star Award\" at the 2016 SBS Drama Awards for his role in the latter.\n\nIn 2017, Go starred in tvN's fantasy-romance drama Chicago Typewriter alongside Yoo Ah-in and Im Soo-jung. The same year, he was cast in his first leading role in KBS's drama Strongest Deliveryman alongside Chae Soo-bin. He then starred in the medical thriller drama Cross which premiered in January 2018.\n\nIn 2020, Go is set to make his comeback in the JTBC drama Private Lives as an imposter alongside Girls' Generation's Seohyun.",
        "birthday": "1990-06-11",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1257601,
        "imdb_id": "nm5963347",
        "known_for_department": "Acting",
        "name": "Go Kyung-pyo",
        "place_of_birth": "Seoul, South Korea",
        "popularity": 0.7766,
        "profile_path": "/71ey2m4Ono5wHYAl4cUjJvYwrzP.jpg"
    }
}