{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4V1yIoAKPMRQwGBaSses8Bp2nsi.jpg",
                "genre_ids": [
                    28,
                    878
                ],
                "id": 137113,
                "original_language": "en",
                "original_title": "Edge of Tomorrow",
                "overview": "Major Bill Cage is an officer who has never seen a day of combat when he is unceremoniously demoted and dropped into combat. Cage is killed within minutes, managing to take an alpha alien down with him. He awakens back at the beginning of the same day and is forced to fight and die again... and again - as physical contact with the alien has thrown him into a time loop.",
                "popularity": 11.5152,
                "poster_path": "/nBM9MMa2WCwvMG4IJ3eiGUdbPe6.jpg",
                "release_date": "2014-05-27",
                "title": "Edge of Tomorrow",
                "video": false,
                "vote_average": 7.632,
                "vote_count": 14423,
                "character": "Kuntz",
                "credit_id": "52fe4c27c3a368484e1aa225",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Dragomir 'Gago' Mrsic"
        ],
        "biography": "Dragomir Mrsic (born 2 October 1969), nicknamed Gago  is a Serbian-Swedish actor, sports consultant and sports leader.\n\nMrsic was born in the Rasavci village near Prijedor, SR Bosnia and Herzegovina, Yugoslavia, to father Momir and mother Radojka. His father got a job in Sweden in the late 1960s. Dragomir moved with his mother and two older siblings to Sweden aged a month and a half, and was brought up in Fittja, a suburb of southern Stockholm. His father worked as a chef at Grand Hôtel in the city, his mother as a cleaner at the local school. His father was a functioning alcoholic. At 14 years of age he witnessed his brother's friend's suicide by jumping. His two siblings, sister Ranka and brother Radomir \"Rajko\", died due to drug usage.\n\nHe has been trained in Taekwondo since his youth, and has a black belt. His childhood idol was Bruce Lee. At 18 years of age, in 1987, he became the Nordic Champion in taekwondo. In 1990, he and his friend Liam Norberg were involved in the robbery of bank Götabanken; he stood guard some hundred meters away. He was arrested and sentenced to three years and six months in prison for the robbery, and served his sentence at Hall Prison. He studied Buddhism in prison. After serving his sentence, he entered into a sports college. He then started a gym, and became a sports consultant. He was a top program trainer in the Swedish Olympics Committee from 2000 to 2004.\n\nAfter a few minor acting roles, such as in the Wallander film Kuriren (2009), he got his big break out in 2010 as Mrado, in the critically acclaimed film Easy Money (2010).\n\nIn 2014, he co-starred in the Tom Cruise film, Edge of Tomorrow.\n\nIn January 2015, he gave his voice and likeness to Dragan in the video game Payday 2. Mrsic is the only cast member in the game who has previously been involved in illegal activities.\n\nIn his gym, \"Extreme Training\", he has trained sportspeople such as Martina Navratilova, Helen Alfredsson and Douglas Murray and actors such as Rooney Mara.\n\nHe also starred in Stjärnorna på slottet in seasons 2019/2020.\n\nMrsic is cohabitation with the PT coach Isabel Alonso. They met in 1992 and have a daughter and a son together.",
        "birthday": "1969-10-02",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 125740,
        "imdb_id": "nm2800616",
        "known_for_department": "Acting",
        "name": "Dragomir Mrsic",
        "place_of_birth": "Prijedor, Bosnia and Herzegovina, Yugoslavia",
        "popularity": 0.1917,
        "profile_path": "/wREVLKdcNQpkTD9EOgukp2hmZLL.jpg"
    }
}