{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uc8FwdCQi3eD7JIbyiZuzo5n6Jv.jpg",
                "genre_ids": [
                    18,
                    28,
                    80
                ],
                "id": 18533,
                "original_language": "en",
                "original_title": "Bronson",
                "overview": "A young man who was sentenced to 7 years in prison for robbing a post office ends up spending 30 years in solitary confinement. During this time, his own personality is supplanted by his alter ego, Charles Bronson.",
                "popularity": 2.2856,
                "poster_path": "/6diyyGIbBNiANsdIaCGtyv4IofR.jpg",
                "release_date": "2009-03-13",
                "title": "Bronson",
                "video": false,
                "vote_average": 6.973,
                "vote_count": 2557,
                "character": "Irene",
                "credit_id": "52fe47849251416c7509c3f7",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "켈리 애덤스",
            "凯莉·亚当斯"
        ],
        "biography": "Kelly Adams (born 16 October 1979 in Lincoln, Lincolnshire) is an English actress.\n\nA pupil of North Kesteven School in North Hykeham, Adams trained at the Mountview Academy of Theatre Arts in Wood Green, London. Initially playing Tara Palmer-Tomkinson in a docu-soap about Prince William, she later appeared in Doctors before playing Mickie Hendrie in Holby City from 2004 to 2006. Her ambitious character left for Newcastle Medical school to study to be a doctor.\n\nAdams has since appeared as the servant Eve in the Robin Hood episode \"A Thing or Two About Loyalty\", and is currently[when?] co-starring with Adrian Edmondson on the BBC Radio 2 comedy show, Teenage Kicks.\n\nIn 2009 Adams joined the cast of long-running BBC1 drama series Hustle for its fifth season, playing the role of Emma Kennedy, a new member of Mickey Bricks' crew of con artists. She has continued in the role of Emma for two further seasons of the drama, the most recent of which (Season 7) aired from 7 January 2011. In an episode of Series 6 Adams plays the role of Kylie Minogue as a parody of Adams striking resemblance to the Australian singer.\n\nIn 2010 Adams appeared in the movie My Last Five Girlfriends as Wendy. She also had a small role in the 2009 biographical film Bronson, about the notorious prisoner Charles Bronson, and in a British science fiction thriller Beacon77, which was shown at the 2009 Cannes Film Festival.\n\nAdams married long term partner, fashion photographer Chris Kennedy, in a ceremony at Hackney Town Hall in February 2011, after proposing to him on a trip to Bruges.\n\nDescription above from the Wikipedia article Kelly Adams, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1979-10-16",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 125718,
        "imdb_id": "nm1433549",
        "known_for_department": "Acting",
        "name": "Kelly Adams",
        "place_of_birth": "Lincoln, Lincolnshire, England",
        "popularity": 0.6443,
        "profile_path": "/aVRV5X7ybuukICtuixfw1XI4h7O.jpg"
    }
}