{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3nx1jkMcWlcjmlDgEDFzW1Tykv0.jpg",
                "genre_ids": [
                    18,
                    10752
                ],
                "id": 2604,
                "original_language": "en",
                "original_title": "Born on the Fourth of July",
                "overview": "Paralyzed in the Vietnam war, Ron Kovic becomes an anti-war and pro-human rights political activist after feeling betrayed by the country he fought for.",
                "popularity": 7.567,
                "poster_path": "/c5gSie6ZA90iBs62yNM5MV4y9R7.jpg",
                "release_date": "1989-12-20",
                "title": "Born on the Fourth of July",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 1790,
                "character": "Maria Elena",
                "credit_id": "54cef394c3a3687f8c00727c",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Cordelia González Buitrago"
        ],
        "biography": "Cordelia González is a movie and theatre Actress, Master of Ceremonies, Voice and Broadcast Media professional born in San Juan, Puerto Rico.Mrs. González has a Bachelor's Degree in Drama / Theatre Arts and Stagecraft from the University of Puerto Rico, Río Piedras Campus and also a Master of Fine Arts (M.F.A.) in acting from the Yale School of Drama, Yale University, New Haven, CT. She is best known for her roles in the Hollywood movies \"Born on the Fourth of July\" (1989), under the direction of Academy Award Winner Oliver Stone, and \"The Mambo Kings\" (1992) where she appeared next to Armand Assante and Antonio Banderas. Mrs. González has appeared in many other movies like \"La Gran Fiesta\" (1986), where she starred next to Raúl Juliá and her latest one \"Antes Que Cante El Gallo\" (2016).Her works in theatre include the Broadway play \"Serious Money\" (1988), where she starred next to Alec Baldwin. Also, an European Tour thru cities like Edinburgh, Scotland and Salzburg, Austria where she performed in \"Ajax\" and \"The Persians\" (1993) under the direction of the renowned Peter Sellars. She has appeared in many t.v. series like \"Kojak\", \"The Equalizer\" and \"Law and Order\". Right now, Cordelia has a very active and successful career in Puerto Rico's local theatre productions and movies, also she is the voice for television and radio for international and local brands like Marshalls and Banco Popular de Puerto Rico.",
        "birthday": "1957-08-11",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 126096,
        "imdb_id": "nm0328105",
        "known_for_department": "Acting",
        "name": "Cordelia González",
        "place_of_birth": "San Juan, Puerto Rico",
        "popularity": 0.1285,
        "profile_path": "/aYHaWKZv40VIBX0v2bGfzOusftv.jpg"
    }
}