{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rOJb0yQOCny0bPjg8bCLw8DyAD7.jpg",
                "genre_ids": [
                    35,
                    12,
                    878
                ],
                "id": 550988,
                "original_language": "en",
                "original_title": "Free Guy",
                "overview": "A bank teller discovers he is actually a background player in an open-world video game, and decides to become the hero of his own story. Now, in a world where there are no limits, he is determined to be the guy who saves his world his way before it's too late.",
                "popularity": 11.4114,
                "poster_path": "/6PFJrMvoQwBxQITLYHj09VeJ37q.jpg",
                "release_date": "2021-08-11",
                "title": "Free Guy",
                "video": false,
                "vote_average": 7.471,
                "vote_count": 9270,
                "character": "Quad-Screen Gamer",
                "credit_id": "60efa2c3d18fb9007d81d269",
                "order": 46
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Raj Jawa is an accomplished actor and producer from Los Angeles, recognized for his roles in Free Guy (Disney), My Crazy Ex (Lifetime), and Deep Undercover (Netflix). With a diverse portfolio spanning over 70 principal and supporting roles, Raj has built a reputation as a reliable and versatile performer. His work covers a broad range of genres, showcasing his ability to adapt to various character types and storytelling styles.\n\nIn addition to his acting work, Raj has also made significant strides as a producer. He is the executive producer and a key actor in the independent feature The Seductress from Hell (2025), a project that exemplifies his commitment to creating and contributing to unique narratives. His ability to collaborate across different areas of production has made him a sought-after talent in both independent films and mainstream projects.\n\nRaj's journey as an actor has been shaped by a passion for both performance and storytelling. He approaches each project with a dedicated work ethic and a collaborative attitude, making him a valued presence on set. Beyond his notable on-screen credits, Raj continues to hone his craft through continuous training and industry involvement, demonstrating his commitment to growth and excellence in every role he takes on.",
        "birthday": "1986-08-06",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.rajjawa.com",
        "id": 1262631,
        "imdb_id": "nm3240293",
        "known_for_department": "Acting",
        "name": "Raj Jawa",
        "place_of_birth": "Culver City, Los Angeles, California, USA",
        "popularity": 0.7364,
        "profile_path": "/dSzTcTmybFF7dhEogckag00azMC.jpg"
    }
}