{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lyQSifurKvWmqWzouVe50JFoI35.jpg",
                "genre_ids": [
                    10751,
                    16,
                    35,
                    12
                ],
                "id": 9385,
                "original_language": "fr",
                "original_title": "Les 12 travaux d'Astérix",
                "overview": "Asterix and Obelix depart on an adventure to complete twelve impossible tasks to prove to Caesar that they are as strong as the Gods. You'll roar with laughter as they outwit, outrun, and generally outrage the very people who are trying to prove them \"only human\".",
                "popularity": 3.2232,
                "poster_path": "/7cZQZOYZFJcLjZnxWjO5PcUtmDZ.jpg",
                "release_date": "1976-06-26",
                "title": "The Twelve Tasks of Asterix",
                "video": false,
                "vote_average": 7.334,
                "vote_count": 1295,
                "character": "Sénateur / Centurion (voice)",
                "credit_id": "5d0e93fcc3a3681682237239",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Claude Bertrand (24 March 1919 – 14 December 1986) was a French film, television and voice over actor.\n\nIn a career that has spanned four decades, Bertrand was best known in French film and television as a voice over actor. He was the French dub for Roger Moore, Charles Bronson, John Wayne, Bud Spencer and Burt Lancaster. He also shared his voice in animation, he provided the voice of Baloo in the French version of The Jungle Book, O'Malley in The Aristocats and Little John in Robin Hood. He also voiced Captain Haddock in Tintin and the Temple of the Sun and Tintin and the Lake of Sharks.\n\nHe also dubbed Roger Moore into French in the James Bond series between 1973 and 1985.\n\nBertrand died in 1986 after suffering from cancer.\n\nSource: Article \"Claude Bertrand (actor)\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1919-03-24",
        "deathday": "1986-12-14",
        "gender": 2,
        "homepage": null,
        "id": 126232,
        "imdb_id": "nm0078355",
        "known_for_department": "Acting",
        "name": "Claude Bertrand",
        "place_of_birth": "Greasque, Bouches-du-Rhône, France",
        "popularity": 0.165,
        "profile_path": "/7rcs2aRrOf9GDy3eZOxwP07KfmC.jpg"
    }
}