{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jBkKw0GSAOTBsnar5RstD7MzkmL.jpg",
                "genre_ids": [
                    35,
                    18,
                    9648
                ],
                "id": 171372,
                "original_language": "en",
                "original_title": "Frank",
                "overview": "A young wannabe musician discovers he has bitten off more than he can chew when he joins an eccentric pop band led by the mysterious and enigmatic Frank.",
                "popularity": 5.3005,
                "poster_path": "/mGzqs4CHW8LomreoPATnyrTXk7j.jpg",
                "release_date": "2014-05-09",
                "title": "Frank",
                "video": false,
                "vote_average": 6.868,
                "vote_count": 1659,
                "character": "German Mother",
                "credit_id": "5e7aa1c6fea0d70016c764e3",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Rosalind has been an actress for over 30 years, appearing in West End runs, national tours, radio plays, corporate videos, stand-up comedy and TV series for Channel 4, LWT and the BBC. She graduated from Cambridge University (M.A. in Modern and Mediaeval languages) and then trained as an actress for three years at The Drama Centre. In 1997 she gained a Postgraduate Diploma in Voice Studies at the Central School of Speech and Drama. She has been in several TV shows and also the film ‘Frank’ with Michael Fassbender and Domhnall Gleeson. As a writer she best enjoys addressing important topics with a light touch.  Her one-woman multi-charactered play ‘Jubilate!’ was a Times Critics' Choice at The Pleasance, Edinburgh in 2012 (“I'm so glad I came; I was so impressed”- Barry Humphries). Two fairy-tale-based playlets written by her played in a showcase of six at the Museum of Comedy in London in January 2015. She also writes screenplays, one of the latest is called WSM (Wicked Stepmother).",
        "birthday": "1961-04-01",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.rosadler.com/",
        "id": 1263044,
        "imdb_id": "nm0012233",
        "known_for_department": "Acting",
        "name": "Rosalind Adler",
        "place_of_birth": "Finchley, London, England, UK",
        "popularity": 0.0676,
        "profile_path": "/A5Dllockt2rq1yOuAbOvZaDsk5U.jpg"
    }
}