{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/y2DB71C4nyIdMrANijz8mzvQtk6.jpg",
                "genre_ids": [
                    28,
                    80,
                    18,
                    53
                ],
                "id": 49026,
                "original_language": "en",
                "original_title": "The Dark Knight Rises",
                "overview": "Following the death of District Attorney Harvey Dent, Batman assumes responsibility for Dent's crimes to protect the late attorney's reputation and is subsequently hunted by the Gotham City Police Department. Eight years later, Batman encounters the mysterious Selina Kyle and the villainous Bane, a new terrorist leader who overwhelms Gotham's finest. The Dark Knight resurfaces to protect a city that has branded him an enemy.",
                "popularity": 18.3339,
                "poster_path": "/hr0L2aueqlP2BYUblTTjmtn0hw4.jpg",
                "release_date": "2012-07-17",
                "title": "The Dark Knight Rises",
                "video": false,
                "vote_average": 7.8,
                "vote_count": 23539,
                "character": "Wall Street Broker (uncredited)",
                "credit_id": "5629768a9251412845000609",
                "order": 123
            },
            {
                "adult": false,
                "backdrop_path": "/pzMrxeP9XkKOtQVUBPTq5yk4ck5.jpg",
                "genre_ids": [
                    12,
                    35,
                    18,
                    14
                ],
                "id": 116745,
                "original_language": "en",
                "original_title": "The Secret Life of Walter Mitty",
                "overview": "A timid magazine photo manager who lives life vicariously through daydreams embarks on a true-life adventure when a negative goes missing.",
                "popularity": 5.9298,
                "poster_path": "/tY6ypjKOOtujhxiSwTmvA4OZ5IE.jpg",
                "release_date": "2013-12-18",
                "title": "The Secret Life of Walter Mitty",
                "video": false,
                "vote_average": 7.205,
                "vote_count": 7907,
                "character": "Time Life Employee (uncredited)",
                "credit_id": "5ee5a447cb71b8001eb4cc23",
                "order": 80
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Alex M. Kruz"
        ],
        "biography": "Alex Kruz is an American actor known for roles in television, theater and film. He was born in New Jersey, his father is a Native American Indian of the Kañari (Quichua) Nation, and Alex is a recognized warrior of the Mescalero Apache Shadow Wolf Clan. Alex is multi-ethnic and multi-lingual, playing multiple ethnicities seamlessly across media in several languages having worked in film/tv in France, Italy, Brazil, Sweden, Israel, Germany, and Japan.  He is best known for his role in the film “Red Cloud: Deliverance” as Jake Red Cloud and “Tom in America”. He has received Best Actor awards from the Mexico International Film Festival, Bare Bones International Film Festival, DC Independent Film Festival, Amiens International Film Festival, and nominated for best performance by the Maverick Movie Awards.  Outside of his acting credits, Alex has worked on behalf of several charities and causes which benefit children and aid those affected by human trafficking. In addition to the charities he helps run, he has produced documentary features and shorts which help make the world aware of issues touching children without voices against war, female circumcision, and other issues from which the West is usually removed from such as “Godka Cirka” (Sundance Premiere), “Madina’s Dream” (SXSW Premiere), and “Fight Church” acquired by LionsGate Films and available on Netflix.",
        "birthday": "1978-11-30",
        "deathday": null,
        "gender": 0,
        "homepage": null,
        "id": 1264686,
        "imdb_id": "nm4330314",
        "known_for_department": "Acting",
        "name": "Alex Kruz",
        "place_of_birth": "Jersey City, New Jersey, USA",
        "popularity": 0.0662,
        "profile_path": "/6nnrOMzR5DgAoxdkNf7BG3pAJq8.jpg"
    }
}