{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/am9WwUTZuUDuinVcyST4OxJ8vFs.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 38684,
                "original_language": "en",
                "original_title": "Jane Eyre",
                "overview": "After a bleak childhood, Jane Eyre goes out into the world to become a governess. As she lives happily in her new position at Thornfield Hall, she meet the dark, cold, and abrupt master of the house, Mr. Rochester. Jane and her employer grow close in friendship and she soon finds herself falling in love with him. Happiness seems to have found Jane at last, but could Mr. Rochester's terrible secret be about to destroy it forever?",
                "popularity": 5.6809,
                "poster_path": "/3Cn7D0wEaxnvm8kTta1osNu3QJv.jpg",
                "release_date": "2011-03-11",
                "title": "Jane Eyre",
                "video": false,
                "vote_average": 7.204,
                "vote_count": 1510,
                "character": "Lord Ingram",
                "credit_id": "52fe46d19251416c91060a69",
                "order": 28
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Joseph Antony Bernays is an English singer, drummer and actor who works under the pseudonyms Joe van Moyland and Joe Lean. He was frontman in the band Joe Lean and the Jing Jang Jong and previously drummed for The Pipettes. As an actor, he was best known for his role as Thomas Tallis on The Tudors.\n\nBernays appeared in a number of television shows, most notably in The Tudors, where he played composer Thomas Tallis. He also appeared in Peep Show as Sophie's brother Jamie, Nathan Barley as Mudd, and three episodes of the Channel 4 drama Fresh Meat as well as minor roles in Waking The Dead, Simon Schama's Power of Art and Fortysomething. His film appearances included Starter for Ten, Colour Me Kubrick: A True...ish Story and Brothers of the Head. He left acting after 2011, aside from a small role in Star Wars: The Last Jedi in 2017.",
        "birthday": "1983-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 126458,
        "imdb_id": "nm1404324",
        "known_for_department": "Acting",
        "name": "Joe Van Moyland",
        "place_of_birth": "Shipley, Yorkshire, England, UK",
        "popularity": 0.1815,
        "profile_path": "/vflCYQcArHDFE30AyL9H4IaifeV.jpg"
    }
}