{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2YIzEKCMfexbLIoeVUkR8MPayB2.jpg",
                "genre_ids": [
                    9648,
                    878,
                    53
                ],
                "id": 846,
                "original_language": "en",
                "original_title": "The X-Files",
                "overview": "Mulder and Scully, now taken off the FBI's X Files cases, must find a way to fight the shadowy elements of the government to find out the truth about a conspiracy that might mean the alien colonization of Earth.",
                "popularity": 5.7062,
                "poster_path": "/yLIw6shz2WC3W3iI0jROsF4B2ha.jpg",
                "release_date": "1998-06-19",
                "title": "The X-Files",
                "video": false,
                "vote_average": 6.887,
                "vote_count": 1692,
                "character": "The Cigarette-Smoking Man",
                "credit_id": "52fe4281c3a36847f802417b",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/icvgQHxrKEDx92VQ5WHiEmEAUKH.jpg",
                "genre_ids": [
                    53,
                    27,
                    878
                ],
                "id": 11336,
                "original_language": "en",
                "original_title": "The Dead Zone",
                "overview": "Johnny Smith is a schoolteacher with his whole life ahead of him but, after leaving his fiancee's home one night, is involved in a car crash which leaves him in a coma for 5 years. When he wakes, he discovers he has an ability to see into the past, present and future life of anyone with whom he comes into physical contact.",
                "popularity": 2.3666,
                "poster_path": "/9yTVaeS8eIkOpbwIycVFm7EQrgF.jpg",
                "release_date": "1983-10-21",
                "title": "The Dead Zone",
                "video": false,
                "vote_average": 7.013,
                "vote_count": 1720,
                "character": "Ambulance Driver",
                "credit_id": "616c0e77d43f010091e436e0",
                "order": 33
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Bill Davis",
            "William Davis"
        ],
        "biography": "William Bruce Davis (born January 13, 1938) is a Canadian actor, known for his role as The Smoking Man on The X-Files. He has also appeared in Stargate SG-1 as Damaris, a Prior of the Ori and as Mayor Tate on Smallville. Most recently he has appeared in FOX's Human Target as an aging mobster.\n\nDavis was born in Toronto, Ontario, to an attorney father and psychologist mother. In 1959, he graduated from the University of Toronto with a B.A. in philosophy. Afterwards, he went on to become a drama professor at Bishop's University. He is also the founder of the William Davis Centre for Actors Study acting school in Vancouver, British Columbia. He is also a former national champion water skier. Despite being known for his smoking character, Davis actually quit smoking in the 1970s; when The X-Files started up, he was given a choice between herbal cigarettes and actual cigarettes. At first he chose the actual cigarettes, but switched to herbal shortly after for fear of becoming addicted again while playing the Cigarette Smoking Man.\n\nHe voiced the antagonist Colonel Whitley of the game The Thing. Davis had a co-starring role in a 2001 episode of The Outer Limits revival series, playing the ruthless director of a secret scientific project, in an episode entitled \"Worlds Within.\"\n\nDavis also hosts and narrates the series Critical Eye on the Science Channel. In 2011, he will also co-star in The Tall Man.\n\n​From Wikipedia, the free encyclopedia",
        "birthday": "1938-01-13",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 12643,
        "imdb_id": "nm0205657",
        "known_for_department": "Acting",
        "name": "William B. Davis",
        "place_of_birth": "Toronto, Ontario, Canada",
        "popularity": 0.505,
        "profile_path": "/b4imZtShd4kK6xFu2ccuPd0fqXA.jpg"
    }
}