{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zJDnqXtGNHUmexiaWNa52Vslve5.jpg",
                "genre_ids": [
                    18,
                    10749,
                    36
                ],
                "id": 1904,
                "original_language": "en",
                "original_title": "Memoirs of a Geisha",
                "overview": "In the years before World War II, a penniless Japanese child is torn from her family to work as a maid in a geisha house.",
                "popularity": 4.2618,
                "poster_path": "/9twKlPKD5Qd2EXX8lohW4zL8zQ8.jpg",
                "release_date": "2005-12-06",
                "title": "Memoirs of a Geisha",
                "video": false,
                "vote_average": 7.656,
                "vote_count": 3199,
                "character": "Spring Festival Dancer",
                "credit_id": "5f3380a1eb64f100370e28e1",
                "order": 57
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Mitsuyo Miyazaki",
            " Kiyoka Miyazaki",
            "宮崎光代"
        ],
        "biography": "Originally from Osaka, Japan, HIKARI, also known as Mitsuyo Miyazaki is an award-winning writer, director and producer. Her debut short film Tsuyako (Drama, 2011) visited over 100 film festivals worldwide receiving 50 awards including DGA Student Award for the Best Female Filmmaker and the film was qualified for the Oscar in 2012 and 2013. In 2013, she was one of the 5 directors to create a short film for the first annual Lexus Short Films, produced by The Weinstein Company. Her live action/animated short film A Better Tomorrow (Fantasy Adventure, 2013) premiered at Festival de Cannes, special screening hosted by TWC and Lexus International. Her latest dance short film Where We Begin (Drama, 2015) premiered at Tribeca Film Festival and received 8 awards at festivals nationwide. Most recently she had participated at Sundance Institute/NHK Screenwriting Workshop in Tokyo as well as Film Independent’s Screenwriting Lab with her feature script Cantering. HIKARI holds an MFA in Film and TV production from USC School of Cinematic Arts and currently represented by Paradigm Talent Agency. She believes in the power of visual communication, and that it changes society and the minds of the people.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.hikarifilms.com/",
        "id": 1264682,
        "imdb_id": "nm1586248",
        "known_for_department": "Directing",
        "name": "HIKARI",
        "place_of_birth": "Osaka, Japan",
        "popularity": 0.0959,
        "profile_path": "/eYKRrci0yRi4c4pIvLcILJd8GQr.jpg"
    }
}