{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9j3gGPnnsBGXaj6FgN2wS8zsOFP.jpg",
                "genre_ids": [
                    80,
                    18,
                    53
                ],
                "id": 339692,
                "original_language": "en",
                "original_title": "Shot Caller",
                "overview": "A newly-released prison gangster is forced by the leaders of his gang to orchestrate a major crime with a brutal rival gang on the streets of Southern California.",
                "popularity": 5.4707,
                "poster_path": "/qLmLz2wtyYvmW8Ult3l2ngOnW8v.jpg",
                "release_date": "2017-07-07",
                "title": "Shot Caller",
                "video": false,
                "vote_average": 6.961,
                "vote_count": 2126,
                "character": "Lola Gomez",
                "credit_id": "5979483bc3a3686831006391",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Monique Kathleen Candelaria"
        ],
        "biography": "Monique Kathleen Candelaria was born February 11th in Albuquerque, New Mexico to Carla Bernadette Castillo and David Robert Candelaria. Soon after she was born her father joined the army and they moved to Bremerhaven, Germany where her brother, David A. Candelaria, was born. Monique also has 2 half brothers (twins), Ivan and Nathan Del Curto, which are a year younger than her.\n\nAfter her father suffered from a brain aneurysm, making him a 100% disabled veteran, her family returned to New Mexico and her love for the arts began to flourish. As a child around the age of 7 she began singing in weddings and funerals. Realizing that singing is her security blanket she never pursued music as a career but kept it in her life as a passionate hobby. At 15 years old she became a dancer for a local television show in Albuquerque called, \"Dance, Dance, Dance it's a Teen Thing\". In 2009 she graduated from the University of New Mexico with a B.A. in Theatre emphasis in Acting.\n\nThe first film she was officially cast in was a 1940's New Mexican period piece called Bless me, Ultima (2013)_ directed by 'Carl Franklin'_ in 2010. Her most recognizable role was Lucy, the Denny's waitress from \"Breaking Bad\" {Live Free or Die (#501} (2012-2013) (TV)_. However, her 1st lead role was in a feature film was The Control Group (2014) starring Brad Dourif. A couple of years later she was cast in her 2nd lead role in the film Cents (2016)_ as the character Angela Baca who struggles with being a single mother raising a mathematical genius.",
        "birthday": "1987-02-11",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1264845,
        "imdb_id": "nm3156214",
        "known_for_department": "Acting",
        "name": "Monique Candelaria",
        "place_of_birth": "Albuquerque, New Mexico, USA",
        "popularity": 0.2408,
        "profile_path": "/jndsq3PlaIGmRExZHKrfvrMS3Uj.jpg"
    }
}