{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3sF6AibdbTTkswfSRxXEGCt5w6s.jpg",
                "genre_ids": [
                    14,
                    12,
                    28
                ],
                "id": 847,
                "original_language": "en",
                "original_title": "Willow",
                "overview": "The evil Queen Bavmorda hunts the newborn princess Elora Danan, a child prophesied to bring about her downfall. When the royal infant is found by Willow, a timid farmer and aspiring sorcerer, he's entrusted with delivering her from evil.",
                "popularity": 2.7154,
                "poster_path": "/pAIRGMIdN7ZdZhflazdV2ezuJ9f.jpg",
                "release_date": "1988-05-20",
                "title": "Willow",
                "video": false,
                "vote_average": 7.009,
                "vote_count": 2039,
                "character": "Airk",
                "credit_id": "52fe4281c3a36847f8024279",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Gavan O'Herlihy (6' 2½\" | 1.89 m) an Irish actor, was born on April 29, 1954 (Taurus) in Dublin, Ireland, the son of Elsa Bennett and Irish actor Dan O'Herlihy. He has a Brother, Cormac O'Herlihy and a sister, Patricia O'Herlihy. He is the brother-in-law of Cornelia Hayes O'Herlihy, nephew of Michael O'Herlihy, and Uncle of Micaela O'Herlihy and Colin O'Herlihy. In his youth, he was an avid tennis player, and even became Irish National Tennis Champion. He is known for Willow (1988), Never Say Never Again (1983) and The Descent: Part 2 (2009), but has over thirty screen credits to his name, most of them having cast him in villainous or antagonistic roles such as Death Wish 3, Never Say Never Again, Superman III, and Tales From The Crypt. His role as Airk Thaughbaer in the 1988 fantasy Willow is one of the few heroic roles the burly, fair-haired Gavan has managed to get, as well as the dashing American officer Captain Leroy in Sharpe's Eagle. He also played the lost jock son \"Chuck Cunningham\" in the first season of Happy Days (1974). Is actually younger (by about two months) than Ron Howard, who played his \"younger\" brother on the show, but it was not a very big part and he was eventually written out by being sent to college and then disappeared with no mention. He did not want to get stuck in television, preferring the film medium. Gavan appeared in the pilot episode of Star Trek: Voyager entitled \"Caretaker\" as the Kazon First Maje, Jabin. He has a son named Rogan and a daughter named Misty.",
        "birthday": "1954-04-29",
        "deathday": "2021-10-14",
        "gender": 2,
        "homepage": null,
        "id": 12660,
        "imdb_id": "nm0641398",
        "known_for_department": "Acting",
        "name": "Gavan O'Herlihy",
        "place_of_birth": "Dublin, Ireland",
        "popularity": 0.3022,
        "profile_path": "/eMSGX3288RWuxTaENQRg8NBXmb9.jpg"
    }
}