{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ihdFypo7MyfJvDSjK7Sbnsjhu8H.jpg",
                "genre_ids": [
                    28,
                    18,
                    53
                ],
                "id": 109424,
                "original_language": "en",
                "original_title": "Captain Phillips",
                "overview": "The true story of Captain Richard Phillips and the 2009 hijacking by Somali pirates of the US-flagged MV Maersk Alabama, the first American cargo ship to be hijacked in two hundred years.",
                "popularity": 5.8353,
                "poster_path": "/2x8ida0rHokUv80Ah4eBNb2eXas.jpg",
                "release_date": "2013-10-10",
                "title": "Captain Phillips",
                "video": false,
                "vote_average": 7.538,
                "vote_count": 7173,
                "character": "Bilal",
                "credit_id": "52fe4ab5c3a36847f81dd54d",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Originally born in the city of Galkayo, a city located in the north-central region of Somalia. Barkhad lived most of his life in the Cedar-Riverside neighborhood, in the south side of Minneapolis. Emerging from a predominantly low-income East African immigrant community, Barkhad was actively exposed to an environment that is rich and abundant in many forms of arts across a spectrum of many cultures. The Cedar-Riverside neighborhood houses the highest concentration of Somalis. The Somali Diaspora's manifestation in the arts of poetry has given them the name the nation of poets. A Stray, an independent film shot in the heart of Cedar-Riverside, starting Barkhad himself, gives viewers a glimpse of his actual background. His film credits range from his role in Captain Philips, a 2013 Sony production, A Stray, a 2016 production, to his recently Oscar nominated film Watu Wote: All of us.",
        "birthday": "1994-06-05",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1266859,
        "imdb_id": "nm5831543",
        "known_for_department": "Acting",
        "name": "Barkhad Abdirahman",
        "place_of_birth": "Galkayo, Somalia",
        "popularity": 0.0784,
        "profile_path": "/o5K3tGiClerpgpCOpqFZGJ5cd28.jpg"
    }
}