{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3sF6AibdbTTkswfSRxXEGCt5w6s.jpg",
                "genre_ids": [
                    14,
                    12,
                    28
                ],
                "id": 847,
                "original_language": "en",
                "original_title": "Willow",
                "overview": "The evil Queen Bavmorda hunts the newborn princess Elora Danan, a child prophesied to bring about her downfall. When the royal infant is found by Willow, a timid farmer and aspiring sorcerer, he's entrusted with delivering her from evil.",
                "popularity": 3.5609,
                "poster_path": "/pAIRGMIdN7ZdZhflazdV2ezuJ9f.jpg",
                "release_date": "1988-05-20",
                "title": "Willow",
                "video": false,
                "vote_average": 7.009,
                "vote_count": 2039,
                "character": "Vohnkar",
                "credit_id": "52fe4281c3a36847f8024281",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/r2IOBOeg5wLfLtyOnT5Pur6Tl4q.jpg",
                "genre_ids": [
                    12,
                    28,
                    878
                ],
                "id": 1892,
                "original_language": "en",
                "original_title": "Return of the Jedi",
                "overview": "Luke Skywalker leads a mission to rescue his friend Han Solo from the clutches of Jabba the Hutt, while the Emperor seeks to destroy the Rebellion once and for all with a second dreaded Death Star.",
                "popularity": 8.3835,
                "poster_path": "/jQYlydvHm3kUix1f8prMucrplhm.jpg",
                "release_date": "1983-05-25",
                "title": "Return of the Jedi",
                "video": false,
                "vote_average": 7.905,
                "vote_count": 16311,
                "character": "Ewok",
                "credit_id": "54eb30f09251412ebd00698b",
                "order": 57
            },
            {
                "adult": false,
                "backdrop_path": "/kGlEhkmFaGUvhBvLvhhq9i9OOXX.jpg",
                "genre_ids": [
                    10402,
                    18,
                    36
                ],
                "id": 10537,
                "original_language": "en",
                "original_title": "The Doors",
                "overview": "The story of the famous and influential 1960s rock band and its lead singer and composer, Jim Morrison.",
                "popularity": 3.8617,
                "poster_path": "/x1LM3dzGuG6xOz0aT2e71o11vhu.jpg",
                "release_date": "1991-03-01",
                "title": "The Doors",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 1506,
                "character": "Man at Birthday Party",
                "credit_id": "55a5cf3b9251410996000691",
                "order": 25
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "H.G. Golas",
            "Phil Fondicaro"
        ],
        "biography": "Phil Fondacaro (born November 8, 1958) is an American actor. A dwarf actor at 3 feet 6 inches (1.07 m), Fondacaro began acting in 1981, with the film Under the Rainbow.\n\nFondacaro appeared in 1983's Star Wars Episode VI: Return of the Jedi, the third Star Wars film, as an Ewok, the only one to have a death scene. In 1986, he portrayed the invisible friend of a young Michael Gerber in the Disney Sunday Movie Fuzz Bucket, and also appeared in the fantasy film Troll. In 1987, he portrayed \"Sir Nigel Pennyweight\" in the cult horror film Ghoulies II. His performance is frequently praised, and he has been called the best actor in the film. In the same year, he appeared as \"Greaser Greg\" in The Garbage Pail Kids Movie, a theatrical adaptation of the popular trading cards. In 1988's Willow, he appeared alongside Warwick Davis, one of his Jedi co-stars, who, thanks in large part to his Willow role, became one of the most famous dwarf actors in the film industry.\n\nOther prominent roles of Fondacaro's include \"Hooded dwarf\" in Phantasm II, Cousin Itt in Addams Family Reunion, and a dramatic turn as a dwarf with an average-sized son in \"A Clown's Prayer\", an episode of Touched by an Angel. He also played a dwarf with an average-sized daughter in the CSI episode, \"A Little Murder\". He also had a recurring role on Sabrina, the Teenage Witch as \"Roland\".\n\nFondacaro is married to Elena Bertagnolli, manager of another famous dwarf actor, Verne Troyer, and is represented by his wife's company, Fonolli Management. Fondacaro's brother Sal is also an actor, having appeared in Under the Rainbow, Return of the Jedi, and Invaders from Mars, all with his brother.\n\nDescription above from the Wikipedia article Phil Fondacaro, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1958-11-08",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 12662,
        "imdb_id": "nm0284496",
        "known_for_department": "Acting",
        "name": "Phil Fondacaro",
        "place_of_birth": "New Orleans, Louisiana, USA",
        "popularity": 0.2777,
        "profile_path": "/vJbPx90IzOdE6L1maYu1HIJayjG.jpg"
    }
}