{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/u9ZLyLvqHY5VDjn0Rs4LKAklsAV.jpg",
                "genre_ids": [
                    878,
                    18
                ],
                "id": 840,
                "original_language": "en",
                "original_title": "Close Encounters of the Third Kind",
                "overview": "After an encounter with UFOs, an electricity linesman feels undeniably drawn to an isolated area in the wilderness where something spectacular is about to happen.",
                "popularity": 5.3436,
                "poster_path": "/yaPx3cK9zGFX3SbcKwxWM1QIbUh.jpg",
                "release_date": "1977-12-14",
                "title": "Close Encounters of the Third Kind",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 4401,
                "character": "Returnee #2 Flt. 19",
                "credit_id": "52fe427fc3a36847f8023527",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Hal Barwood is an American game designer and game producer best known for his work on games based on the Indiana Jones license.\n\nBorn in Hanover, New Hampshire, he studied art at Brown University and later attended the University of Southern California's School of Cinema-Television, where he met and became friends with George Lucas. Along with other film students such as Walter Murch, John Milius, and Howard Kazanjian, the group, known as The Dirty Dozen, went on to degrees of success in the film industry.\n\nHis film credits include Steven Spielberg's first theatrical feature film, The Sugarland Express, writing on Close Encounters of the Third Kind (for which he was not publicly credited), and producing and co-writing Dragonslayer. In the 1970s, he also co-wrote an unproduced screenplay with his frequent co-worker Matthew Robbins called Star Dancing, for which Ralph McQuarrie was contracted to do a series of conceptual paintings.\n\nHe later worked as a script writer, producer and director for LucasArts. He is probably best known as the project leader and co-designer of the 1992 adventure game Indiana Jones and the Fate of Atlantis. In August 1999, PC Gamer magazine designated him as one of the top 25 game designers in the United States.\n\nIn 2008-2009, he served as the lead designer for Mata Hari an adventure game developed by German studio Cranberry Production.\n\nDescription above from the Wikipedia article Hal Barwood, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 12678,
        "imdb_id": "nm0059493",
        "known_for_department": "Writing",
        "name": "Hal Barwood",
        "place_of_birth": "Hanover, New Hampshire, USA",
        "popularity": 0.0764,
        "profile_path": null
    }
}