{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/adnSTomHU9YyqV2lx38CgM0UxLS.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749
                ],
                "id": 696,
                "original_language": "en",
                "original_title": "Manhattan",
                "overview": "Manhattan explores how the life of a middle-aged television writer dating a teenage girl is further complicated when he falls in love with his best friend's mistress.",
                "popularity": 3.0294,
                "poster_path": "/k4eT3EvfxW1L9Wmt04UqJqCvCR6.jpg",
                "release_date": "1979-04-25",
                "title": "Manhattan",
                "video": false,
                "vote_average": 7.724,
                "vote_count": 2497,
                "character": "Guest of Honor",
                "credit_id": "5e93274bd55e4d001a195c86",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Bella Savitzky Abzug (July 24, 1920 – March 31, 1998), nicknamed \"Battling Bella\", was an American lawyer, U.S. Representative, social activist and a leader in the women's movement. In 1971, Abzug joined other leading feminists such as Gloria Steinem, Shirley Chisholm, and Betty Friedan to found the National Women's Political Caucus. She was known as a leading figure in what came to be known as eco-feminism.\n\nIn 1970, Abzug's first campaign slogan was, \"This woman's place is in the House—the House of Representatives.\" She was later appointed to co-chair the National Commission on the Observance of International Women's Year created by President Gerald Ford's executive order, presided over the 1977 National Women's Conference, and led President Jimmy Carter's National Advisory Commission for Women. Abzug was a founder of the Commission for Women’s Equality of the American Jewish Congress.\n\nDescription above from the Wikipedia article Bella Abzug, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1920-07-24",
        "deathday": "1998-03-31",
        "gender": 1,
        "homepage": null,
        "id": 1267159,
        "imdb_id": "nm0009538",
        "known_for_department": "Acting",
        "name": "Bella Abzug",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.0407,
        "profile_path": "/6MzsHguDUNgLzLk10RELEnFWv3r.jpg"
    }
}