{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4Bb1kMIfrT2tYRZ9M6Jhqy6gkeF.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 76203,
                "original_language": "en",
                "original_title": "12 Years a Slave",
                "overview": "In the pre-Civil War United States, Solomon Northup, a free black man from upstate New York, is abducted and sold into slavery. Facing cruelty as well as unexpected kindnesses Solomon struggles not only to stay alive, but to retain his dignity. In the twelfth year of his unforgettable odyssey, Solomon’s chance meeting with a Canadian abolitionist will forever alter his life.",
                "popularity": 7.0513,
                "poster_path": "/xdANQijuNrJaw1HA61rDccME4Tm.jpg",
                "release_date": "2013-10-18",
                "title": "12 Years a Slave",
                "video": false,
                "vote_average": 7.938,
                "vote_count": 11592,
                "character": "Patsey",
                "credit_id": "52fe492cc3a368484e11dff5",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/8BTsTfln4jlQrLXUBquXJ0ASQy9.jpg",
                "genre_ids": [
                    12,
                    28,
                    878
                ],
                "id": 140607,
                "original_language": "en",
                "original_title": "Star Wars: The Force Awakens",
                "overview": "Thirty years after defeating the Galactic Empire, Han Solo and his allies face a new threat from the evil Kylo Ren and his army of Stormtroopers.",
                "popularity": 12.8263,
                "poster_path": "/wqnLdwVXoBjKibFRR5U3y0aDUhs.jpg",
                "release_date": "2015-12-15",
                "title": "Star Wars: The Force Awakens",
                "video": false,
                "vote_average": 7.256,
                "vote_count": 19962,
                "character": "Maz Kanata",
                "credit_id": "538cf1210e0a266718004d03",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/1pmXyN3sKeYoUhu5VBZiDU4BX21.jpg",
                "genre_ids": [
                    16,
                    878,
                    10751
                ],
                "id": 1184918,
                "original_language": "en",
                "original_title": "The Wild Robot",
                "overview": "After a shipwreck, an intelligent robot called Roz is stranded on an uninhabited island. To survive the harsh environment, Roz bonds with the island's animals and cares for an orphaned baby goose.",
                "popularity": 22.1036,
                "poster_path": "/wTnV3PCVW5O92JMrFvvrRcV39RU.jpg",
                "release_date": "2024-09-12",
                "title": "The Wild Robot",
                "video": false,
                "vote_average": 8.316,
                "vote_count": 5354,
                "character": "Roz / Rummage (voice)",
                "credit_id": "65c03d8ffc65380163eaf41c",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/b6ZJZHUdMEFECvGiDpJjlfUWela.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 284054,
                "original_language": "en",
                "original_title": "Black Panther",
                "overview": "King T'Challa returns home to the reclusive, technologically advanced African nation of Wakanda to serve as his country's new leader. However, T'Challa soon finds that he is challenged for the throne by factions within his own country as well as without. Using powers reserved to Wakandan kings, T'Challa assumes the Black Panther mantle to join with ex-girlfriend Nakia, the queen-mother, his princess-kid sister, members of the Dora Milaje (the Wakandan 'special forces') and an American secret agent, to prevent Wakanda from being dragged into a world war.",
                "popularity": 11.0085,
                "poster_path": "/uxzzxijgPIY7slzFvMotPv8wjKA.jpg",
                "release_date": "2018-02-13",
                "title": "Black Panther",
                "video": false,
                "vote_average": 7.369,
                "vote_count": 22812,
                "character": "Nakia",
                "credit_id": "57374f77c3a3680516000c67",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/1GU0jS5ZG5MhfdDrpj8s9XxbgJJ.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 505642,
                "original_language": "en",
                "original_title": "Black Panther: Wakanda Forever",
                "overview": "Queen Ramonda, Shuri, M’Baku, Okoye and the Dora Milaje fight to protect their nation from intervening world powers in the wake of King T’Challa’s death.  As the Wakandans strive to embrace their next chapter, the heroes must band together with the help of War Dog Nakia and Everett Ross and forge a new path for the kingdom of Wakanda.",
                "popularity": 15.4925,
                "poster_path": "/sv1xJUazXeYqALzczSZ3O6nkH75.jpg",
                "release_date": "2022-11-09",
                "title": "Black Panther: Wakanda Forever",
                "video": false,
                "vote_average": 7.038,
                "vote_count": 7015,
                "character": "Nakia",
                "credit_id": "5a95b9070e0a262f07004ee6",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/sC0b8iPUHfZdD8kseLiHw3N8gkp.jpg",
                "genre_ids": [
                    27,
                    9648,
                    53
                ],
                "id": 458723,
                "original_language": "en",
                "original_title": "Us",
                "overview": "Husband and wife Gabe and Adelaide Wilson take their kids to their beach house expecting to unplug and unwind with friends. But as night descends, their serenity turns to tension and chaos when some shocking visitors arrive uninvited.",
                "popularity": 8.0562,
                "poster_path": "/ux2dU1jQ2ACIMShzB3yP93Udpzc.jpg",
                "release_date": "2019-03-14",
                "title": "Us",
                "video": false,
                "vote_average": 6.955,
                "vote_count": 7730,
                "character": "Adelaide Wilson / Red",
                "credit_id": "5c6d89ca925141250a103106",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Lupita Amondi Nyong'o",
            "露琵塔·尼詠歐",
            "לופיטה ניאנג'ו",
            "לופיטה ניונג'ו",
            "لوپیتا نیونگو"
        ],
        "biography": "Lupita Amondi Nyong'o (born 1 March 1983) is a Kenyan-Mexican actress and author. She began her career in Hollywood as a production assistant. In 2008, she made her acting debut with the short film East River and subsequently returned to Kenya to star in the television series Shuga (2009–2012). In 2009, she wrote, produced and directed the documentary In My Genes. She then pursued a master's degree in acting from the Yale School of Drama.\n\nShe had her first feature film role as Patsey in 12 Years a Slave (2013), for which she received critical acclaim and won several awards, including the Academy Award for Best Supporting Actress. She became the first Kenyan and Mexican actress to win an Academy Award. She made her Broadway debut as a teenage orphan in the play Eclipsed (2015), for which she was nominated for a Tony Award for Best Actress in a Play. She went on to perform a motion capture role as Maz Kanata in the Star Wars sequel trilogy (2015–2019) and a lead voice role as Raksha in The Jungle Book (2016). Her career progressed with her role as Nakia in the Marvel Cinematic Universe superhero film Black Panther (2018) and her starring role in Jordan Peele's critically acclaimed horror film Us (2019).\n\nIn addition to acting, she supports historic preservation. She is vocal about preventing sexual harassment and working for women's and animal rights. In 2014, she was named the most beautiful woman by People. She has also written a children's book named Sulwe (2019), which became a number-one New York Times Best-Seller. Also in 2019, she narrated the Discovery Channel docu-series Serengeti, which earned her a Primetime Emmy Award nomination for Outstanding Narrator. She was named among Africa's \"50 Most Powerful Women\" by Forbes in 2020.\n\nDescription above is from the Wikipedia article Lupita Nyong'o, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1983-03-01",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1267329,
        "imdb_id": "nm2143282",
        "known_for_department": "Acting",
        "name": "Lupita Nyong'o",
        "place_of_birth": "Mexico City, Mexico",
        "popularity": 1.3931,
        "profile_path": "/y40Wu1T742kynOqtwXASc5Qgm49.jpg"
    }
}