{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ctMserH8g2SeOAnCw5gFjdQF8mo.jpg",
                "genre_ids": [
                    35,
                    12
                ],
                "id": 346698,
                "original_language": "en",
                "original_title": "Barbie",
                "overview": "Barbie and Ken are having the time of their lives in the colorful and seemingly perfect world of Barbie Land. However, when they get a chance to go to the real world, they soon discover the joys and perils of living among humans.",
                "popularity": 15.5781,
                "poster_path": "/iuFNMS8U5cb6xfzi51Dbkovj7vM.jpg",
                "release_date": "2023-07-19",
                "title": "Barbie",
                "video": false,
                "vote_average": 6.955,
                "vote_count": 10314,
                "character": "Barbie",
                "credit_id": "642c22219cc67b05bf708567",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "니콜라 커그랜",
            "尼古拉·考夫蘭",
            "ニコラ・コークラン",
            "니컬라 코클런",
            "尼古拉·歌芙蘭",
            "Нікола Коглан",
            "Нікола Коглен",
            "Нікола Коґлан",
            "ניקולה קוקלן",
            "نيكولا كوفلان",
            "نیکولا کافلان"
        ],
        "biography": "Nicola Mary Coughlan is an Irish actress. She is known for her roles as Clare Devlin in the Channel 4 sitcom Derry Girls and Penelope Featherington in the Netflix period drama Bridgerton. She earned a Screen Actors Guild Awards nomination for playing the lead role of Penelope Featherington in the third season of Bridgerton. Coughlan earned a British Academy Television Awards nomination for her role as Maggie Donovan in Big Mood (2024–present).\n\nCoughlan was born on 9 January 1987 in Galway, Ireland, and grew up in Oranmore. The youngest of three siblings, her father served in the Irish Army before passing away in 2016, and her mother was a stay-at-home parent.\n\nAt the age of five, while watching her sister perform in a school play, Coughlan decided she wanted to become an actress. She attended Scoil Mhuire Primary School and Calasanctius College. She graduated with a degree in English and Classical Civilisation from the National University of Ireland, Galway. She then went on to train in England at the Oxford School of Drama and Birmingham School of Acting.",
        "birthday": "1987-01-09",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.curtisbrown.co.uk/client/nicola-coughlan",
        "id": 1267240,
        "imdb_id": "nm1965552",
        "known_for_department": "Acting",
        "name": "Nicola Coughlan",
        "place_of_birth": "Galway, Ireland",
        "popularity": 0.7224,
        "profile_path": "/shSN86O3qckxcO7YXVtaNy9ksSU.jpg"
    }
}