{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uiUpvnv8zgA2pm1J7tT8DPLxh84.jpg",
                "genre_ids": [
                    18,
                    10749,
                    10752
                ],
                "id": 15764,
                "original_language": "en",
                "original_title": "Sophie's Choice",
                "overview": "Stingo, a young writer, moves to Brooklyn in 1947 to begin work on his first novel. As he becomes friendly with Sophie and her lover Nathan, he learns that she is a Holocaust survivor. Flashbacks reveal her harrowing story, from pre-war prosperity to Auschwitz. In the present, Sophie and Nathan's relationship increasingly unravels as Stingo grows closer to Sophie and Nathan's fragile mental state becomes ever more apparent.",
                "popularity": 3.1968,
                "poster_path": "/rZDPbPTFwuKgr5b9jixGFNYkGYt.jpg",
                "release_date": "1982-12-08",
                "title": "Sophie's Choice",
                "video": false,
                "vote_average": 7.344,
                "vote_count": 891,
                "character": "Stingo",
                "credit_id": "52fe467a9251416c750799fd",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/sZhTfYouKM1iV3rVbgIVEQFQogA.jpg",
                "genre_ids": [
                    35,
                    10751,
                    14
                ],
                "id": 2758,
                "original_language": "en",
                "original_title": "Addams Family Values",
                "overview": "Siblings Wednesday and Pugsley Addams will stop at nothing to get rid of Pubert, the new baby boy adored by parents Gomez and Morticia. Things go from bad to worse when the new \"black widow\" nanny, Debbie Jellinsky, launches her plan to add Fester to her collection of dead husbands.",
                "popularity": 10.0334,
                "poster_path": "/sdxT2VjVSx9DRicwnuECUdBHeE7.jpg",
                "release_date": "1993-11-19",
                "title": "Addams Family Values",
                "video": false,
                "vote_average": 6.969,
                "vote_count": 3165,
                "character": "Gary Granger",
                "credit_id": "54dfb357925141194b004179",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Peter MacNicol is an American actor. He received a Theatre World Award for his 1981 Broadway debut in the play Crimes of the Heart. His film roles include Galen in Dragonslayer (1981), Stingo in Sophie's Choice (1982), Janosz Poha in Ghostbusters II (1989), camp counselor Gary Granger in Addams Family Values (1993), and David Langley in Bean (1997).\n\nMacNicol was born in Dallas, Texas, on April 10, 1954. He attended the University of Dallas and the University of Minnesota, where he studied theater. After graduating, he moved to New York City to pursue an acting career.\n\nMacNicol made his Broadway debut in 1981 in the play Crimes of the Heart. He won a Theatre World Award for his performance. He went on to appear in a number of other Broadway productions, including The Real Thing (1984), The Crucible (1996), and The Pillowman (2005).\n\nMacNicol has also had a successful career in film and television. He has appeared in a number of films, including Sophie's Choice (1982), Ghostbusters II (1989), Addams Family Values (1993), and Bean (1997). He is best known for his role as the eccentric lawyer John Cage in the FOX comedy-drama Ally McBeal (1997–2002), for which he won a Primetime Emmy Award for Outstanding Supporting Actor in a Comedy Series in 2001.\n\nMacNicol has also appeared in a number of other television shows, including 24 (2001), Numbers (2005), and Veep (2012-2019). He is a versatile actor who has shown his range in a variety of roles.\n\nMacNicol is married to Martha Cumming, and they have two children. He is a member of the Actors' Equity Association and the Screen Actors Guild.",
        "birthday": "1954-04-10",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 12688,
        "imdb_id": "nm0001493",
        "known_for_department": "Acting",
        "name": "Peter MacNicol",
        "place_of_birth": "Dallas, Texas, USA",
        "popularity": 0.9108,
        "profile_path": "/8gizugTP8hykdfBkOY0Qg0aqpiP.jpg"
    }
}