{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rrCc7dONpjAt8N8VO0dGpdIXCVU.jpg",
                "genre_ids": [
                    12,
                    14,
                    28
                ],
                "id": 22,
                "original_language": "en",
                "original_title": "Pirates of the Caribbean: The Curse of the Black Pearl",
                "overview": "After Port Royal is attacked and pillaged by a mysterious pirate crew, capturing the governor's daughter Elizabeth Swann in the process, William Turner asks free-willing pirate Jack Sparrow to help him locate the crew's ship—The Black Pearl—so that he can rescue the woman he loves.",
                "popularity": 22.25,
                "poster_path": "/z8onk7LV9Mmw6zKz4hT6pzzvmvl.jpg",
                "release_date": "2003-07-09",
                "title": "Pirates of the Caribbean: The Curse of the Black Pearl",
                "video": false,
                "vote_average": 7.814,
                "vote_count": 21434,
                "character": "Pirate (uncredited)",
                "credit_id": "52fe4210c3a36847f8000ff3",
                "order": 65
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Gregory Alosio",
            "Gregory R Alosio",
            "Greg Ryan"
        ],
        "biography": "Gregory Alosio is an award winning American director & producer.  He is known for his documentary short film Death & Life which won several awards.  Accolade Global Film Competition awards in May 2016:  Award of Recognition.  Long Beach Indie Film Festival: Best Documentary Short Film.  Canada Shorts Canadian and International Short Film Festival: Award of Commendation.  Hollywood International Independent Documentary Award: Award of Recognition.  Impact Docs Award: Award of Merit.  Reel Madness Film Festival: People’s Choice Award.\n\nMr. Alosio has also directed several country music videos including the European award winning Suspicious Minds for country star Dwight Yoakam, and most recently Liar also by Dwight Yoakam.\n\nIn 2013 Mr. Alosio directed the family film The Christmas Colt",
        "birthday": "1980-01-07",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1269612,
        "imdb_id": "nm0003731",
        "known_for_department": "Acting",
        "name": "Gregory Ryan Alosio",
        "place_of_birth": "Los Angeles, U.S.A",
        "popularity": 0.0338,
        "profile_path": "/pap40viuzNnkoD2EwriLYOkdgf4.jpg"
    }
}