{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zVJWPKbyv8ZPIbO6qcjE19dTgyn.jpg",
                "genre_ids": [
                    18
                ],
                "id": 25364,
                "original_language": "en",
                "original_title": "Ace in the Hole",
                "overview": "An arrogant reporter exploits a story about a man trapped in a cave to revitalize his career.",
                "popularity": 1.7291,
                "poster_path": "/gPVPzHEsJBX02HtBtIQgYnfeqNQ.jpg",
                "release_date": "1951-06-29",
                "title": "Ace in the Hole",
                "video": false,
                "vote_average": 7.866,
                "vote_count": 703,
                "character": "Indian Copy Boy (uncredited)",
                "credit_id": "57890c23c3a36836c0002199",
                "order": 21
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/2lfDV3DCNumvNyEhgsIGsrB19fs.jpg",
                "genre_ids": [
                    37,
                    12
                ],
                "id": 995,
                "original_language": "en",
                "original_title": "Stagecoach",
                "overview": "A group of people traveling on a stagecoach find their journey complicated by the threat of Geronimo, and learn something about each other in the process.",
                "popularity": 3.4391,
                "poster_path": "/zgMnfnwWZ3nkx4t0bUDEKtW24O8.jpg",
                "release_date": "1939-03-02",
                "title": "Stagecoach",
                "video": false,
                "vote_average": 7.625,
                "vote_count": 1172,
                "credit_id": "562589c19251413bda000aef",
                "department": "Crew",
                "job": "Stunts"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Iron Eyes",
            "The Crying Indian (nickname)",
            "Espera Oscar de Corti"
        ],
        "biography": "Iron Eyes Cody (born Espera Oscar de Corti), was an Italian-American actor. He portrayed Native Americans in Hollywood films, famously as Chief Iron Eyes in Bob Hope's The Paleface. He also played a Native American shedding a tear about litter in one of the country's most well-known television public service announcements, \"Keep America Beautiful\".  Cody began acting in the early 1930s. He worked in film and television until his death. Cody claimed his father was Cherokee (and his mother Cree), also naming several different tribes, and frequently changing his claimed place of birth. To those unfamiliar with Indigenous American or First Nations cultures and people, he gave the appearance of living \"as if\" he were Native American, fulfilling the stereotypical expectations by wearing his film wardrobe as daily clothing—including braided wig, fringed leathers and beaded moccasins—at least when photographers were visiting, and in other ways continuing to play the same Hollywood-scripted roles off-screen as well as on.\n\nHe appeared in more than 200 films, including The Big Trail  with John Wayne; The Scarlet Letter, with Colleen Moore; Sitting Bull, as Crazy Horse; The Light in the Forest as Cuyloga; The Great Sioux Massacre, with Joseph Cotten; Nevada Smith, with Steve McQueen; A Man Called Horse, with Richard Harris; and Ernest Goes to Camp as Chief St. Cloud, with Jim Varney.\n\nIn 1953, he appeared twice in Duncan Renaldo's syndicated television series, The Cisco Kid as Chief Sky Eagle. He guest starred on the NBC western series, The Restless Gun, starring John Payne, and The Tall Man, with Barry Sullivan and Clu Gulager. In 1961, he played the title role in \"The Burying of Sammy Hart\" on the ABC western series, The Rebel, starring Nick Adams. A close friend of Walt Disney, Cody appeared in a Disney studio serial titled The First Americans, and in episodes of The Mountain Man, Davy Crockett and Daniel Boone. In 1964 Cody appeared as Chief Black Feather on The Virginian in the episode \"The Intruders.\" He also appeared in a 1968 episode of Mister Rogers' Neighborhood featuring Native American dancers.\n\nCody was widely seen as the \"Crying Indian\" in the \"Keep America Beautiful\" public service announcements (PSA) in the early 1970s.The environmental commercial showed Cody in costume, shedding a tear after trash is thrown from the window of a car and it lands at his feet. The announcer, William Conrad, says: \"People start pollution; people can stop it.\"\n\nThe Joni Mitchell song \"Lakota\", from the 1988 album, Chalk Mark in a Rainstorm, features Cody's chanting. He made a cameo appearance in the 1990 film Spirit of '76.\n\nLiving in Hollywood, he began to insist, even in his private life, that he was Native American, over time claiming membership in several different tribes. In 1996, Cody's half-sister said that he was of Italian ancestry, but he denied it. After his death, it was revealed that he was of Sicilian parentage, and not Native American at all.\n\nCody, at age 94, died of mesothelioma at his home in Los Angeles on January 4, 1999.",
        "birthday": "1907-04-03",
        "deathday": "1999-01-03",
        "gender": 2,
        "homepage": null,
        "id": 127032,
        "imdb_id": "nm0002014",
        "known_for_department": "Acting",
        "name": "Iron Eyes Cody",
        "place_of_birth": "Gueydan, Louisiana, USA",
        "popularity": 0.351,
        "profile_path": "/23h9CuvnyzjJGYsodDTXbiaBuA.jpg"
    }
}