{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zoz4vZPe95m0RiUZtMyGeto5L02.jpg",
                "genre_ids": [
                    9648,
                    53
                ],
                "id": 179826,
                "original_language": "en",
                "original_title": "Odd Thomas",
                "overview": "In a California desert town, a short-order cook with clairvoyant abilities encounters a mysterious man with a link to dark, threatening forces.",
                "popularity": 6.1255,
                "poster_path": "/skBMhQjHLTU1rp4gutxHp0JuY1C.jpg",
                "release_date": "2013-01-29",
                "title": "Odd Thomas",
                "video": false,
                "vote_average": 6.938,
                "vote_count": 1394,
                "character": "Simon Varner",
                "credit_id": "52fe4dacc3a36847f826dff7",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "نیکو تورتورلا"
        ],
        "biography": "Nico Tortorella is an actor native of Chicago, Illinois. They started out in professional theatre when they were in seventh grade. They were offered a contract with Ford Models when they stopped by an open call in 2007. In 2009, they played the character Razor in ABC Family's \"Make It or Break It\". They then went on to act in the short lived CW drama \"The Beautiful Life\". In 2010, they had a small role in the Joel Schumacher's films \"Twelve\" and \"Trespass\". They were also cast as Trevor Sheldon in the horror film \"Scream 4\" written by Kevin Williamson. In 2013, they portrayed a police officer in the \"Odd Thomas\" movie. That year, they also appeared on the FOX serial killer drama \"The Following\" created by Kevin Williamson. In 2014, they were cast as Josh, Sutton Foster's character Liza's younger lover, in the TV Land comedy-drama \"Younger\" created by Darren Star.",
        "birthday": "1988-07-30",
        "deathday": null,
        "gender": 3,
        "homepage": null,
        "id": 127128,
        "imdb_id": "nm3380171",
        "known_for_department": "Acting",
        "name": "Nico Tortorella",
        "place_of_birth": "Wilmette, Illinois, USA",
        "popularity": 0.4069,
        "profile_path": "/nYgS6myBXjMSwR7CsThjxtL9B3w.jpg"
    }
}