{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/l2iY1AgqQ8dEa3FtWkN5TQ5aVbU.jpg",
                "genre_ids": [
                    53,
                    9648
                ],
                "id": 1092,
                "original_language": "en",
                "original_title": "The Third Man",
                "overview": "In postwar Vienna, Austria, Holly Martins, a writer of pulp Westerns, arrives penniless as a guest of his childhood chum Harry Lime, only to learn he has died. Martins develops a conspiracy theory after learning of a \"third man\" present at the time of Harry's death, running into interference from British officer Major Calloway, and falling head-over-heels for Harry's grief-stricken lover, Anna.",
                "popularity": 3.5645,
                "poster_path": "/rO2Fq0AZZx9obs52KJdx4mRE8p5.jpg",
                "release_date": "1949-08-31",
                "title": "The Third Man",
                "video": false,
                "vote_average": 7.915,
                "vote_count": 1989,
                "character": "Major Calloway",
                "credit_id": "52fe42e7c3a36847f802bac9",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/ubICMSUij3ntP9BjnQsV3rTVnAF.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 783,
                "original_language": "en",
                "original_title": "Gandhi",
                "overview": "In the early years of the 20th century, Mohandas K. Gandhi, a British-trained lawyer, forsakes all worldly possessions to take up the cause of Indian independence. Faced with armed resistance from the British government, Gandhi adopts a policy of 'passive resistance', endeavouring to win freedom for his people without resorting to bloodshed.",
                "popularity": 4.2391,
                "poster_path": "/rOXftt7SluxskrFrvU7qFJa5zeN.jpg",
                "release_date": "1982-12-01",
                "title": "Gandhi",
                "video": false,
                "vote_average": 7.557,
                "vote_count": 2389,
                "character": "Judge Broomfield",
                "credit_id": "52fe4275c3a36847f8020659",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/vKvoOlhhaZCsiGQDvaZQqyGq1oA.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 851,
                "original_language": "en",
                "original_title": "Brief Encounter",
                "overview": "Returning home from a shopping trip to a nearby town, bored suburban housewife Laura Jesson is thrown by happenstance into an acquaintance with virtuous doctor Alec Harvey. Their casual friendship soon develops during their weekly visits into something more emotionally fulfilling than either expected, and they must wrestle with the potential havoc their deepening relationship would have on their lives and the lives of those they love.",
                "popularity": 2.4942,
                "poster_path": "/jC9EwLJcGhYMSQAHu2LxkKN5v7O.jpg",
                "release_date": "1945-11-24",
                "title": "Brief Encounter",
                "video": false,
                "vote_average": 7.702,
                "vote_count": 660,
                "character": "Dr. Alec Harvey",
                "credit_id": "52fe4282c3a36847f8024529",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/5PfHGXosySGs0l1JfeREspy3v6G.jpg",
                "genre_ids": [
                    878,
                    28,
                    12
                ],
                "id": 1924,
                "original_language": "en",
                "original_title": "Superman",
                "overview": "Mild-mannered Clark Kent works as a reporter at the Daily Planet alongside his crush, Lois Lane. Clark must summon his superhero alter-ego when the nefarious Lex Luthor launches a plan to take over the world.",
                "popularity": 10.0533,
                "poster_path": "/d7px1FQxW4tngdACVRsCSaZq0Xl.jpg",
                "release_date": "1978-12-14",
                "title": "Superman",
                "video": false,
                "vote_average": 7.155,
                "vote_count": 4063,
                "character": "1st Elder",
                "credit_id": "52fe4322c3a36847f803ce2d",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Trevor Wallace Howard-Smith"
        ],
        "biography": "Howard was born in Cliftonville, Kent, England, the son of Mabel Grey (Wallace) and Arthur John Howard. He was educated at Clifton College (to which he left in his will a substantial legacy for a drama scholarship) and at the Royal Academy of Dramatic Art (RADA), acting on the London stage for several years before World War II. His first paid work was in the play Revolt in a Reformatory (1934), before he left RADA in 1935 to take small roles.\n\nAlthough stories of his courageous wartime service in the British Army's Royal Corps of Signals earned him much respect among fellow actors and fans alike, files held in the Public Record Office reveal that he had actually been discharged from the British Army in 1943 for mental instability and having a \"psychopathic personality\". The story, which surfaced in Terence Pettigrew's biography of the actor, published by Peter Owen in 2001, was initially denied by Howard's widow, actress Helen Cherry. Later, confronted with official records, she told the Daily Telegraph (24 June 2001) that his mother had claimed he was a holder of the Military Cross. She added that Howard had an honourable military record and \"had nothing to be ashamed of\".",
        "birthday": "1913-09-29",
        "deathday": "1988-01-07",
        "gender": 2,
        "homepage": null,
        "id": 12726,
        "imdb_id": "nm0002145",
        "known_for_department": "Acting",
        "name": "Trevor Howard",
        "place_of_birth": "Cliftonville, Kent, England, UK",
        "popularity": 0.6074,
        "profile_path": "/6HDJGXcedqyHx7oCPtUdCXn4z76.jpg"
    }
}