{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5rbPwIdEZTyLTkpAgvGdacgCr7T.jpg",
                "genre_ids": [
                    18,
                    53,
                    27
                ],
                "id": 11481,
                "original_language": "en",
                "original_title": "Repulsion",
                "overview": "Beautiful young manicurist Carole suffers from androphobia (the pathological fear of interaction with men). When her sister and roommate, Helen, leaves their London flat to go on an Italian holiday with her married boyfriend, Carole withdraws into her apartment. She begins to experience frightful hallucinations, her fear gradually mutating into madness.",
                "popularity": 2.0055,
                "poster_path": "/dtyCKEPLqv9wxyVazL4b843vtUb.jpg",
                "release_date": "1965-06-01",
                "title": "Repulsion",
                "video": false,
                "vote_average": 7.405,
                "vote_count": 1043,
                "character": "Workman",
                "credit_id": "575ac9d5c3a3686ad8001e7f",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Mike Pratt was a British actor, musician, songwriter and screenwriter. He commenced his career in showbusiness during the skiffle boom of the 1950s, playing and writing music alongside friends Tommy Steele and Lionel Bart.  Bart and Pratt received the 1957 Ivor Novello Award for Best Song Musically and Lyrically for Steele's hit Little White Bull, and Pratt won his second Ivor Novello for a Handful of Songs, which he co-wrote with Steele. Despite several big screen and theatre credits including a stint with the RSC, Pratt was (and remains) best known for his role as Jeff Randall in the late 1960s ITC detective series Randall and Hopkirk (Deceased) alongside Kenneth Cope and Annette Andre. Mike Pratt died from lung cancer in July 1976, aged 45. His son is Guy Pratt,  a session bass guitarist best known for his live performances with Pink Floyd (since 1987) and offshoot solo projects with David Gilmour and Nick Mason.",
        "birthday": "1931-06-07",
        "deathday": "1976-07-10",
        "gender": 2,
        "homepage": null,
        "id": 127261,
        "imdb_id": "nm0695511",
        "known_for_department": "Acting",
        "name": "Mike Pratt",
        "place_of_birth": "London, England, UK",
        "popularity": 1.1905,
        "profile_path": "/zacjIwPuTjhgP2A4otRNJnx9VOM.jpg"
    }
}