{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8WIufsaJgm7VWgAc5ALWdJ8v2kB.jpg",
                "genre_ids": [
                    14,
                    27,
                    35
                ],
                "id": 766,
                "original_language": "en",
                "original_title": "Army of Darkness",
                "overview": "Ash, a handsome, shotgun-toting, chainsaw-armed department store clerk, is time warped backwards into England's Dark Ages, where he romances a beauty and faces legions of the undead.",
                "popularity": 4.8105,
                "poster_path": "/xsgTuAtR2zSH8Umg3jWZcZjlDpe.jpg",
                "release_date": "1992-10-31",
                "title": "Army of Darkness",
                "video": false,
                "vote_average": 7.255,
                "vote_count": 3336,
                "character": "Fake Shemp",
                "credit_id": "5f809b42175051003790f673",
                "order": 37
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Ron Zwang is a Screenwriter, Comedy Writer, Songwriter and Producer. Ron started his professional writing career while still in High School when Joan Rivers would perform his one-liners in her monologues while hosting The Tonight Show. Produced feature films he's written include:  Doin’ Time - Warner Brothers Screenplay & Story\n\nFree Ride - Moustapha Akkad, Producer Screenplay & Story\n\nNutty Nut - Capella Films - co-written with Sam Raimi & Scott Spiegel\n\nAfter viewing the last two films he chose to take pseudonyms.\n\nZwang then went on to produce Naked Obsession for Roger Corman and Concorde. A spate of rewrites and assignments followed for the likes of Sam Raimi/Rob Tapert, Paul Maslansky, George Zaloom and Charles Roven. Then there was that period where he Created/Wrote/Developed reality shows for Fremantle, Granada TV, GRB Ent., Dave Bell Assoc., Merv Griffin Ent. among others.\n\nThrough their company Retarded Genius Music, Zwang and his brilliant musical partner Rick Novak, have fallen into the musical niche of writing and providing finished recordings that are evocative of songs that productions can’t afford. So far they been hired to ape an eclectic group of songs -- Five For Fighting, Gimme Some Lovin’, Little Green Bag, Jimi Hendrix, Marlene Dietrich, a ‘60s Bond Theme song, Abba among many others. Their work can be heard regularly on HBO. They also supplied the songs for an out and out film musical “Emmanuelle In Wonderland.” The IFC series “Bullet In The Face” commissioned the team for two songs. In answer to fans’ requests, one of the songs is now selling all over the net.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1272250,
        "imdb_id": "nm0958964",
        "known_for_department": "Writing",
        "name": "Ron Zwang",
        "place_of_birth": "Los Angeles, California, U.S",
        "popularity": 0.0382,
        "profile_path": null
    }
}