{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/oM5mMTGBqsmMJO3l5tkQdQ0Xujm.jpg",
                "genre_ids": [
                    16,
                    35,
                    10751,
                    12
                ],
                "id": 10112,
                "original_language": "en",
                "original_title": "The Aristocats",
                "overview": "When Madame Adelaide Bonfamille leaves her fortune to Duchess and her children—Bonfamille’s beloved family of cats—the butler plots to steal the money and kidnaps the legatees, leaving them out on a country road. All seems lost until the wily Thomas O’Malley Cat and his jazz-playing alley cats come to the aristocats’ rescue.",
                "popularity": 6.7864,
                "poster_path": "/1BVOSmQUhphMgnTxnXyfQ9tL1Sc.jpg",
                "release_date": "1970-12-24",
                "title": "The Aristocats",
                "video": false,
                "vote_average": 7.293,
                "vote_count": 5222,
                "character": "Butler (voice)",
                "credit_id": "6191ef81c99826008c663166",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Roderick A. Maude-Roxby (born 2 April 1930) is a retired English actor. He has appeared in numerous films, such as Walt Disney's The Aristocats, where he voiced the greedy butler Edgar Balthazar (his only voice role); Unconditional Love; and Clint Eastwood's White Hunter Black Heart, playing Thompson.\n\nAn early innovator at the Royal College of Art, RCA, alongside David Hockney and Peter Blake, he was one of the UK's first performance artists, before it was a recognized art form. At the RCA he edited ARK magazine in 1958 and was president of the college's Theatre Group. He had a joint exhibition with Blake at the Portal Gallery in 1960. He also collaborated in a pre-Monty Python series with Michael Palin and Terry Jones, called The Complete and Utter History of Britain. He also made theatrical and television appearances in, among other shows, The Goodies, Rowan and Martin's Laugh In, Not Only... But Also and The Establishment. He won the Theatre of the Year Award for Best Comic New York in 1968 for his work as a stand-up comedian.\n\nFrom Wikipedia, the free encyclopedia",
        "birthday": "1930-04-02",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 127264,
        "imdb_id": "nm0560795",
        "known_for_department": "Acting",
        "name": "Roddy Maude-Roxby",
        "place_of_birth": "London, England, UK",
        "popularity": 0.0766,
        "profile_path": "/h7Htic9qJiqDMoABvqQYmJYEX6N.jpg"
    }
}