{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/g5haoqEqt5VwVwQKEkoXY9zqSxb.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 232672,
                "original_language": "en",
                "original_title": "Blended",
                "overview": "Recently divorced mom Lauren and widowed dad Jim let their friends push them into a blind date, which goes disastrously wrong. Unsurprisingly, neither wants to see the other ever again. However, fate intervenes when both Jim and Lauren, unbeknownst to each other, purchase one-half of the same vacation package at a South African resort for families, during spring break. They and their children are forced to share the same romantic suite and participate in a slew of family activities together.",
                "popularity": 8.1389,
                "poster_path": "/o2YrH9jS7CAfWjETHFeL0tth79E.jpg",
                "release_date": "2014-05-21",
                "title": "Blended",
                "video": false,
                "vote_average": 6.891,
                "vote_count": 3669,
                "character": "Tyler",
                "credit_id": "52fe4e07c3a36847f827a229",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Kyle Red Silverstein is a film and television actor who's been setting screens ablaze with his recent powerhouse performances.\n\nIn 2023, Kyle is in the hit TV series \"Yellowstone,\" where he delivered an explosive portrayal as Young Rip. His presence in the ninth episode, \"A Knife and No Coin,\" had fans on the edge of their seats.\n\nIn 2021, he plunged headfirst into the spine-tingling world of \"American Horror Stories.\" His chilling guest appearance as Quinn in the pulse-pounding episode \"Drive In\" sent shock-waves through viewers and left them clamoring for more.\n\nIn 2014, Kyle Red Silverstein played the unforgettable character Tyler in the blockbuster sensation, \"Blended.\" Teaming up with Hollywood heavyweights Adam Sandler and Drew Barrymore, Kyle's performance in \"Blended\" was nothing short of sensational. The film, with its $128 million worldwide gross, was a colossal hit that had audiences rolling in the aisles with laughter and reaching for the tissues in heartfelt moments. Kyle's comedic timing, charm, and on-screen chemistry with the two iconic stars made him a standout in this cinematic triumph.\n\nBeyond his impressive film and television career, Kyle's dedication to wildlife conservation stands as a testament to his commitment as a responsible global citizen. He actively supports the Los Angeles Zookeepers Association and supports their annual \"Bowling for Rhinos\" event, raising essential funds to protect endangered African rhinos.\n\nWith each project, Kyle continues to evolve as a respected actor in the entertainment industry. His recent roles and unwavering commitment to important causes make him an inspirational figure, both on and off the screen.",
        "birthday": "2002-05-21",
        "deathday": null,
        "gender": 2,
        "homepage": "https://kylered.com",
        "id": 1274511,
        "imdb_id": "nm2417490",
        "known_for_department": "Acting",
        "name": "Kyle Red Silverstein",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.8939,
        "profile_path": "/o5kTkt1u2a53cRJX702XO6mGk7k.jpg"
    }
}