{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/AIVsBK1BSPzh6FKxnHbKCQQmBo.jpg",
                "genre_ids": [
                    35
                ],
                "id": 239563,
                "original_language": "en",
                "original_title": "St. Vincent",
                "overview": "A young boy whose parents just divorced finds an unlikely friend and mentor in the misanthropic, bawdy, hedonistic, war veteran who lives next door.",
                "popularity": 3.6359,
                "poster_path": "/1bb7MTHCIPhpKZFysDpxNaNrdMk.jpg",
                "release_date": "2014-10-09",
                "title": "St. Vincent",
                "video": false,
                "vote_average": 7.117,
                "vote_count": 1968,
                "character": "Oliver Bronstein",
                "credit_id": "5464ce110e0a2629460020b1",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/sYnrdolxonyMucMezj8PMVBRlVr.jpg",
                "genre_ids": [
                    18,
                    80,
                    53
                ],
                "id": 382614,
                "original_language": "en",
                "original_title": "The Book of Henry",
                "overview": "Susan, a single mother of two, works as a waitress in a small town. Her son, Henry, is an 11-year-old genius who not only manages the family finances but acts as emotional support for his mother and younger brother. When Henry discovers that the girl next door has a terrible secret, he implores Susan to take matters into her own hands.",
                "popularity": 4.5355,
                "poster_path": "/suLFg4UjvM5BoDipg2Wu3gZ802T.jpg",
                "release_date": "2017-06-16",
                "title": "The Book of Henry",
                "video": false,
                "vote_average": 7.51,
                "vote_count": 1317,
                "character": "Henry Carpenter",
                "credit_id": "56c00410c3a36817e4002fa5",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/rAQcPrEaPzDRVNX7XX5TWyxCGFN.jpg",
                "genre_ids": [
                    27,
                    53
                ],
                "id": 346364,
                "original_language": "en",
                "original_title": "It",
                "overview": "In a small town in Maine, seven children known as The Losers Club come face to face with life problems, bullies and a monster that takes the shape of a clown called Pennywise.",
                "popularity": 12.3979,
                "poster_path": "/9E2y5Q7WlCVNEhP5GiVTjhEhx1o.jpg",
                "release_date": "2017-09-06",
                "title": "It",
                "video": false,
                "vote_average": 7.237,
                "vote_count": 19553,
                "character": "Bill Denbrough",
                "credit_id": "57739eda925141251d00058d",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/4HWAQu28e2yaWrtupFPGFkdNU7V.jpg",
                "genre_ids": [
                    35,
                    80,
                    9648
                ],
                "id": 546554,
                "original_language": "en",
                "original_title": "Knives Out",
                "overview": "When renowned crime novelist Harlan Thrombey is found dead at his estate just after his 85th birthday, the inquisitive and debonair Detective Benoit Blanc is mysteriously enlisted to investigate. From Harlan's dysfunctional family to his devoted staff, Blanc sifts through a web of red herrings and self-serving lies to uncover the truth behind Harlan's untimely death.",
                "popularity": 9.8244,
                "poster_path": "/pThyQovXQrw2m0s9x82twj48Jq4.jpg",
                "release_date": "2019-11-27",
                "title": "Knives Out",
                "video": false,
                "vote_average": 7.843,
                "vote_count": 13116,
                "character": "Jacob Thrombey",
                "credit_id": "5be32eaa0e0a2614b3019421",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/nj1sc2adxEk7fseElV8RIuCaoZD.jpg",
                "genre_ids": [
                    35,
                    18,
                    10402
                ],
                "id": 739993,
                "original_language": "en",
                "original_title": "Metal Lords",
                "overview": "For teenage misfits Hunter and Kevin, the path to glory is clear: Devote themselves to metal. Win Battle of the Bands. And be worshipped like gods.",
                "popularity": 4.7185,
                "poster_path": "/r97txZRmBb75SGsIAWqmplWJnO3.jpg",
                "release_date": "2022-04-08",
                "title": "Metal Lords",
                "video": false,
                "vote_average": 6.903,
                "vote_count": 705,
                "character": "Kevin Schlieb",
                "credit_id": "6037fdb4255dba003e9d8fa5",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "ג'יידן ליברהר",
            "Jaeden Lieberher",
            "제이든 마텔",
            "جیدن مارتل"
        ],
        "biography": "Jaeden Martell (born January 4, 2003) is an American actor. He first gained recognition for his role as Bill Denbrough in the 2017 film adaptation of Stephen King's novel It (2017) and reprised this character in the sequel It Chapter Two (2019) . His other notable work includes the mystery film Knives Out (2019) and the miniseries Defending Jacob (2020).  He is the son of Wes Lieberher, a Los Angeles-based executive chef, and Angela Teresa Martell. He has Korean heritage through his maternal grandmother, Chisun Martell. Initially growing up in South Philadelphia, he moved to Los Angeles at the age of eight in 2011. For the first six years of his career, he was credited under his family name, Lieberher, but in 2019, he adopted his mother's maiden name, Martell.\n\nJaeden's acting career began with a commercial for Hot Wheels and expanded to include various other advertisements for brands such as Google, Moneysupermarket.com, Liberty Mutual, Hyundai (for the 2013 Super Bowl), Verizon Fios, and General Electric. His first significant film role was in St. Vincent (2014) (2014), where he starred alongside Bill Murray. Murray later recommended Martell to Cameron Crowe, which led to his role in the 2015 film Aloha (2015) . He played the title character in The Book of Henry (2017) , further cementing his position as a talented young actor.\n\nIn addition to his early successes, Martell joined the cast of the Apple miniseries Defending Jacob (2020-2020) in March 2019, based on the novel by William Landay. He also confirmed his participation in the film Tunnels (????) as Grayson Mitchell during an Instagram Live interview with Teen Vogue on April 30, 2020; however, this film has yet to be released. In September 2021, he portrayed Morty Smith in promotional interstitials for the two-part fifth season finale of Rick and Morty (2013-) . In October 2021, he was cast as Craig in the Netflix film Men (2022) , directed by John Lee Hancock and based on the novella from Stephen King's Mr. Harrigan's Phone (2022) .\n\nContinuing to expand his filmography, Jaeden Martell appeared in Y2K (2024) and Arcadian (2024) in 2024. Both films showcase his versatility and commitment to developing complex characters. Through these roles and his consistent presence in both independent and major studio projects, Martell continues to establish himself as one of the most promising actors of his generation.\n\n- IMDb Mini Biography By: yusufpiskin",
        "birthday": "2003-01-04",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1274508,
        "imdb_id": "nm5897057",
        "known_for_department": "Acting",
        "name": "Jaeden Martell",
        "place_of_birth": "Philadelphia, Pennsylvania, USA",
        "popularity": 1.9148,
        "profile_path": "/29lQhfMR4nLUJROKq76x93NXPw1.jpg"
    }
}