{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/b2NxliGN77rdu78HQv5peZBmkw4.jpg",
                "genre_ids": [
                    28,
                    80,
                    18,
                    53
                ],
                "id": 8982,
                "original_language": "th",
                "original_title": "ต้มยำกุ้ง",
                "overview": "A young fighter named Kham must go to Australia to retrieve his stolen elephant. With the help of a Thai-born Australian detective, Kham must take on all comers, including a gang led by an evil woman and her two deadly bodyguards.",
                "popularity": 6.8126,
                "poster_path": "/uKE9BxgtT5g2pE3ZKC7MnzsAbTZ.jpg",
                "release_date": "2005-08-11",
                "title": "The Protector",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 886,
                "character": "Johnny",
                "credit_id": "52fe44cec3a36847f80ab0fb",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/sGDXh6QU6CRqHVXfoYOBwqEnBVO.jpg",
                "genre_ids": [
                    28,
                    36,
                    10752
                ],
                "id": 10590,
                "original_language": "en",
                "original_title": "We Were Soldiers",
                "overview": "The story of the first major battle of the American phase of the Vietnam War and the soldiers on both sides that fought it.",
                "popularity": 3.285,
                "poster_path": "/d5uupBAORxnFNbkNQ2G0Bi2cpY8.jpg",
                "release_date": "2002-03-01",
                "title": "We Were Soldiers",
                "video": false,
                "vote_average": 7.142,
                "vote_count": 2147,
                "character": "Young NVA Lieutenant (uncredited)",
                "credit_id": "55d215e1c3a36812a7000008",
                "order": 81
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Johnny Trí Nguyễn",
            "阮明智"
        ],
        "biography": "Johnny Tri Nguyen (born February 16, 1974 in Binh Duong Province, South Vietnam) is a Vietnamese American film and television actor, stunt double, and martial artist. He left Vietnam at the age of 8 with his family, mother, father, older brother, and older sister and moved to Los Angeles, CA. He is half Vietnamese and half Chinese, with his mother being Chinese.\n\nJohnny Nguyen comes from a family involved in the Vietnamese entertainment industry. His uncle is Nguyen Chanh Tin, a Vietnamese actor, and his older brother is Charlie Nguyen, who directed The Rebel.\n\nHis acting roles include the martial arts films Tom-Yum-Goong and Cradle 2 the Grave and he well known for his portrayal as the antagonist, Dong Lee in 7 Aum Arivu (7th Sense) in India. His work as a stunt double includes the role of Spider-Man in Spider-Man 2 and as the Green Goblin in the first feature film. He practices lien feng kwon (which was founded by his grandfather), wushu, tae kwon do, tai chi, aikido, and vovinam.\n\nJohnny has been working in the Vietnamese film industry to produce The Rebel, a period action drama set in 1920s French-colonial Vietnam, which he also co-directed, co-wrote and stars in.",
        "birthday": "1974-02-16",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 127451,
        "imdb_id": "nm1248798",
        "known_for_department": "Acting",
        "name": "Johnny Nguyen",
        "place_of_birth": "Bình Dương, Việt Nam",
        "popularity": 1.1793,
        "profile_path": "/jm5FUULyRkqL587mHi8OlvyepTD.jpg"
    }
}