{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xga9dXEIJHAjNLGMjw4VDPH7LJB.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 9090,
                "original_language": "en",
                "original_title": "To Wong Foo, Thanks for Everything! Julie Newmar",
                "overview": "Manhattan drag queens Vida Boheme and Noxeema Jackson impress regional judges in competition, securing berths in the Nationals in Los Angeles. When the two meet pathetic drag novice Chi-Chi Rodriguez — one of the losers that evening — the charmed Vida and Noxeema agree to take the hopeless youngster under their joined wing. Soon the three set off on a madcap road trip across America and struggle to make it to Los Angeles in time.",
                "popularity": 2.777,
                "poster_path": "/xlRhO3TzTxCFn2s9LEcVi7s582t.jpg",
                "release_date": "1995-09-08",
                "title": "To Wong Foo, Thanks for Everything! Julie Newmar",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 708,
                "character": "Hedda Lettuce",
                "credit_id": "5e0f3ac1681888001259bc06",
                "order": 56
            }
        ],
        "crew": []
    },
    "details": {
        "adult": true,
        "also_known_as": [
            "Hedda Lettuce"
        ],
        "biography": "Hedda Lettuce is an American drag queen, comedian and singer who lives and works in New York City.[1][2] The New York actor Steven Polito debuted his character Hedda Lettuce in 1991 on the Manhattan Cable TV show The Brenda and Glennda Show. Lettuce's appearances include MTV, Comedy Central, The People's Court and a cameo on Sex and the City as Samantha's ex-beau turned Bingo Drag impersonator. Lettuce's film appearances include To Wong Foo, Thanks for Everything! Julie Newmar; Cruise Control; The Look; Red Lipstick, and Musical Chairs.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.heddalettuce.com/",
        "id": 1276888,
        "imdb_id": "nm0504835",
        "known_for_department": "Acting",
        "name": "Steven Polito",
        "place_of_birth": "New York, New York, U.S.A.",
        "popularity": 0.6,
        "profile_path": "/cccQZJKDAMiCrJllwmYEEjtpsbT.jpg"
    }
}