{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3e3dVaVrla2GH6CWKbNRjTvk3s8.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 6844,
                "original_language": "en",
                "original_title": "The Ten Commandments",
                "overview": "Escaping death, a Hebrew infant is raised in a royal household to become a prince. Upon discovery of his true heritage, Moses embarks on a personal quest to reclaim his destiny as the leader and liberator of the Hebrew people.",
                "popularity": 10.66,
                "poster_path": "/3Ei59AR64x6dMZfWobPCkZjbqTL.jpg",
                "release_date": "1956-10-05",
                "title": "The Ten Commandments",
                "video": false,
                "vote_average": 7.769,
                "vote_count": 1743,
                "character": "Bit Part (uncredited)",
                "credit_id": "647dad07cf4b8b00c3d32f5d",
                "order": 100
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Rex Ingram (October 20, 1895 – September 19, 1969) was an American stage, film, and television actor.\n\nIngram graduated from the Northwestern University medical school in 1919 and was the first African-American man to receive a Phi Beta Kappa key from there. He went to Hollywood as a young man where he was literally discovered on a street corner by the casting director for Tarzan of the Apes (1918), starring Elmo Lincoln. He made his (uncredited) screen debut in that film and had many other small roles, usually as a generic black native, such as in the Tarzan films.\n\nWith the arrival of sound, his presence and powerful voice became an asset and he went on to memorable roles in The Green Pastures (1936), The Adventures of Huckleberry Finn (the 1939 MGM version), The Thief of Bagdad (1940—perhaps his best-known film appearance—as the genie), The Talk of the Town (1942), and Sahara (1943).\n\nFrom 1929, he also appeared on stage, making his debut on Broadway. He appeared in more than a dozen Broadway productions, with his final role coming in Kwamina in 1961. He was in the original cast of Haiti (1938), Cabin in the Sky (1940), and St. Louis Woman (1946). He is one of the few actors to have played both God (in The Green Pastures) and the Devil (in Cabin in the Sky). In 1966 he played Tee-Tot in the movie Your Cheatin' Heart.\n\nIngram was arrested for violating the Mann Act in 1948. Pleading guilty to the charge of transporting a teenage girl to New York for immoral purposes, he was sentenced to eighteen months in jail. He served just ten months of his sentence, but the incident had a serious effect on his career for the next six years.\n\nIn 1962, he became the first African-American actor to be hired for a contract role on a soap opera, when he appeared on The Brighter Day. He had other work in television in the 1950s and 1960s.\n\nRex Ingram died of a heart attack at the age of 73.\n\n[biography (excerpted) from Wikipedia]",
        "birthday": "1895-10-20",
        "deathday": "1969-09-19",
        "gender": 2,
        "homepage": null,
        "id": 1276503,
        "imdb_id": "nm0002270",
        "known_for_department": "Acting",
        "name": "Rex Ingram",
        "place_of_birth": "Cairo, Illinois, USA",
        "popularity": 0.1269,
        "profile_path": "/gYkV6lbIBJygBMzdaeV9h70F8iG.jpg"
    }
}