{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rniS6AOKTOr5PV7Xok6m7QSzlXg.jpg",
                "genre_ids": [
                    12,
                    18
                ],
                "id": 937746,
                "original_language": "it",
                "original_title": "Io capitano",
                "overview": "Longing for a brighter future, two Senegalese teenagers embark on a journey from West Africa to Italy. However, between their dreams and reality lies a labyrinth of checkpoints, the Sahara Desert, and the vast waters of the Mediterranean.",
                "popularity": 3.0654,
                "poster_path": "/kGlZFwUQI5gAUdySNFfqGIkAF9n.jpg",
                "release_date": "2023-09-07",
                "title": "Io Capitano",
                "video": false,
                "vote_average": 7.801,
                "vote_count": 767,
                "character": "Woman in Boat",
                "credit_id": "65827279880551171027562e",
                "order": 24
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Mariam Kaba (born 9 August 1961) is a French-Guinean actress.\n\nKaba was born in Kankan, Guinea, the daughter of Mohamed Ba Kaba, a diplomat and the author of several books on Islam. She moved to France in the early 1980s. After receiving her baccalaureate, Kaba enrolled at École des nouveaux métiers de la communication largely at the behest of her father. She only attended the school for a year and spent the money her father sent her on acting lessons, studying under Isabelle Sadoyan.\n\nKaba's first stage role was as the wife of Toussaint Louverture, alongside Benjamin Jules-Rosette, director of the Théâtre noir in Paris. Soon thereafter, she landed a role in the TV series Marc and Sophie. In 1989, Kaba made her film debut in Périgord noir, directed by Nicolas Ribowski. She played Maina, a young woman who came to work in the Périgord region. In 1992, she starred in her first African film, Blanc d'ébène. A World War II epic directed by Cheik Doukouré, she played a nurse engaged to the teacher Lancéi Kanté. Later in the year, Kaba appeared in Idrissa Ouedraogo's Samba Traoré. She collaborated with Doukouré again in 1994, in Le Ballon d'or.\n\nHer son was born in 1999. In 2000, Kaba played Pauline Lumumba, wife of the politician Patrice Lumumba, in Raoul Peck's Lumumba. Kaba had known his son, Roland, in her youth but did not want to meet Pauline in advance of the role. She fought for the role because she was interested in the history.\n\nKaba has appeared in more than 15 French TV shows and TV films, such as Navarro, Villa mon rêve, l'Avocate, Quatre cent suspects and Justice de femmes. Her most controversial performance was in the 2002 TV films Fatou la Malienne and Fatou l'Espoir, directed by Daniel Vigne. Kaba played the mother of Fatou, forcing her into an unwilling marriage. It sparked outcry in Mali and led to her being heckled on the street. Kaba explains that she read the script before meeting the real Fatou, and would never allow her husband to do a similar thing to her daughter.\n\nSource: Article \"Mariam Kaba\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1961-08-09",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1276305,
        "imdb_id": "nm0434002",
        "known_for_department": "Acting",
        "name": "Mariam Kaba",
        "place_of_birth": "Beyla, Guinea",
        "popularity": 0.0409,
        "profile_path": "/a9BlraKrKwfk73ven0dkaK1NEJd.jpg"
    }
}