{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lXSJETt0cbiemixfHuBpopAg8pT.jpg",
                "genre_ids": [
                    18
                ],
                "id": 472674,
                "original_language": "en",
                "original_title": "The Goldfinch",
                "overview": "A boy in New York is taken in by a wealthy family after his mother is killed in a bombing at the Metropolitan Museum of Art. In a rush of panic, he steals 'The Goldfinch', a painting that eventually draws him into a world of crime.",
                "popularity": 4.0378,
                "poster_path": "/5Jx9VyVPiK9GQ7ouKLkTUYnZSQ4.jpg",
                "release_date": "2019-09-12",
                "title": "The Goldfinch",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 904,
                "character": "Gyuri",
                "credit_id": "5c8ec98fc3a3682ece49f320",
                "order": 32
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Matteo van der Grijn completed his education in 2007 at the Theatre School Arnhem. After his education, Matteo started his career in the performance Hamlet, by the Theater Company, directed by Theu Boermans. In addition, he appeared in various productions of the National Theater: Levende Doden, De Prooi and A midsummer night's dream. In the 2010/2011 season Matteo was the first actor to play the title role in the musical Soldier of Orange directed by Theu Boermans and in 2014/2015 he played at the National Theater in Blauwdruk Voor Een Nog Beter Leven directed by Johan Doesburg. He was also the lead in Fatal Attraction and Indecent Proposal, among others. In addition, Matteo appeared in many television series such as Levenslied, Nieuwe Buren, Adem in - Adem uit, Klem, Celblok H, De Mannen van Dokter Anne, Keizersvrouwen, DNA and Oogappels. He also played various guest roles in Het Klokhuis. Matteo also played in many films including Tuscany Wedding, Daglicht, Of Ik Gek Ben, Mannenharten, The Resistance Banker, Kapsalon Romy, Hartenstrijd and Gek Van Geluk. Matteo played a beautiful role in the international series Ted Lasso. The New York Times wrote about him: \"I found the scenes between Matteo van der Grijn and Hannah Waddingham to be perhaps the best of the entire season\". He also appeared in Tribes of Europa and the international film The Goldfinch. He recently appeared in the film Zwanger & Co and in the series Hockeyvaders, Golden Hour and Het Herriehofje.\n\nIn addition to his work for the camera or on stage, Matteo is in demand as a voice actor. He is the regular voice of Lexus and Gilette, has spoken in various cartoons including Sing 2, The Croods, Lightyear (voice: Buzz Lightyear), Lyle Lyle Crocodile and also speaks audio books and audio tours (including Amsterdam Light Festival 2022).",
        "birthday": "1981-02-23",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.e-talenta.eu/members/profile/matteo-vandergrijn",
        "id": 1277255,
        "imdb_id": "nm2114593",
        "known_for_department": "Acting",
        "name": "Matteo van der Grijn",
        "place_of_birth": "Amsterdam, Netherlands",
        "popularity": 0.1835,
        "profile_path": "/lhPJPGv73Hl3qCbcykzuV4KD0tE.jpg"
    }
}