{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sGKUhw88FMH5gfz0E6BK2YOZ5se.jpg",
                "genre_ids": [
                    36,
                    18
                ],
                "id": 82695,
                "original_language": "en",
                "original_title": "Les Misérables",
                "overview": "An adaptation of the successful stage musical based on Victor Hugo's classic novel set in 19th-century France. Jean Valjean, a man imprisoned for stealing bread, must flee a relentless policeman named Javert. The pursuit consumes both men's lives, and soon Valjean finds himself in the midst of the student revolutions in France.",
                "popularity": 6.8937,
                "poster_path": "/6CuzBs2Lb8At7qQr64mLXg2RYRb.jpg",
                "release_date": "2012-12-18",
                "title": "Les Misérables",
                "video": false,
                "vote_average": 7.315,
                "vote_count": 5417,
                "character": "Ensemble Factory Women",
                "credit_id": "52fe486d9251416c9108c261",
                "order": 117
            },
            {
                "adult": false,
                "backdrop_path": "/p3P0eTh8AnqauhRZg0wgoBFvcjF.jpg",
                "genre_ids": [
                    53,
                    18,
                    10749
                ],
                "id": 9833,
                "original_language": "en",
                "original_title": "The Phantom of the Opera",
                "overview": "A young soprano becomes the obsession of a disfigured and murderous musical genius who lives beneath the Paris Opera House.",
                "popularity": 3.6763,
                "poster_path": "/pFf1Xxzgxo6ffxAJeSkAb5b0P4S.jpg",
                "release_date": "2004-12-08",
                "title": "The Phantom of the Opera",
                "video": false,
                "vote_average": 7.26,
                "vote_count": 1692,
                "character": "Female Ensemble",
                "credit_id": "5f56cc2b90cf510033a6744e",
                "order": 47
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Tricia trained at London University.\n\nTheatre credits include: Annie in The House on Cold Hill (UK Tour), Shirley Landels in Rumpy Pumpy (Theatre Royal, Windsor & New Union Theatre), Mum in Astronaut (St James Studio, London), Rosa in Midnight Tango (UK Tour & West End), Miss Mitford/Miss Tesman in Recording Hedda (London), Jack's Mum in Into The Woods (London), Agnes in Gypsy (Leicester Haymarket and Coventry Belgrade), Grandma Rosie in The Wedding Singer (UK Tour), Noreen Biggs in Bad Girls (West Yorkshire Playhouse), u/s Grandma Gellman in Caroline Or Change (Royal National Theatre), Rowena in Salad Days (Leicester Haymarket), Molly McGregor u/s Jeanette in The Full Monty (West End & UK Tour), Old Sal/Mrs Sowerberry in Oliver! (London Palladium), Widow Corney in Oliver! (York), Mrs Sowerberry/Old Sal in Oliver! (Sheffield Crucible Theatre), Yente in Fiddler On The Roof (West Yorkshire Playhouse), Mrs Slater in Dear Departed (London), Therese in The Bakers Wife (West End), Hair Crone/1st u/s Madam Thenardier in Les Miserables (West End), Patient Griselda/Nell/Jeanine in Top Girls (Lancaster Dukes Playhouse), Jenny in Company (Lancaster Dukes Playhouse), Beggar Woman in Sweeney Todd (Lancaster Dukes Playhouse), Mrs Kendall in The Elephant Man (UK Tour), Paulina in The Winters Tale (Lancaster Dukes Playhouse), Calamity Jane in Calamity Jane (UK Tour), Jimmy Williamson in Lil Jimmy Williamson (UK Tour), Diaphanta in The Changeling (Lancaster Dukes Playhouse), Old Woman in The Duchess of Malfi (Lancaster Dukes Playhouse) u/s Katisha in The Mikado (West End), Mrs Rose in Hello Dolly (Birmingham Rep & West End), Alison in Canterbury Tales (West End), Rose in Drakes Dream (West End), By My Side in Godspell (UK Tour & West End), Dulcie in The Boyfriend (Far & Middle East Tour) & Ensemble u/s Paquette in Candide (Edinburgh International Festival). Tricia has also appeared in numerous pantomimes and cabarets across the UK.\n\nFilm/TV credits include: Elderly Lady in Whitsable Pearl (Acorn TV); Gran in Halfbreed (Channel 4); Pearl in Timewasters (ITV); Pam in Radio (Short Film); Irate woman in Blessed (ITV); Blind Woman/Ensemble in Les Miserables (Feature Film); Featured Ensemble in The Phantom of the Opera (Feature Film); Land Lady in The Bill (Thames TV); Seamstress in The House of Elliot (BBC); The Full Monty & Hello Dolly! in The Royal Variety Show (Television); Midnight Tango Performance on Strictly Come Dancing (BBC); Diamond Lil in Old Ivy (Soho, Bridewell & Radio 4), as well as other various Pantomimes, Concerts and Recordings.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1278549,
        "imdb_id": "nm1546107",
        "known_for_department": "Acting",
        "name": "Tricia Deighton",
        "place_of_birth": "Shipley, Yorkshire, England, UK",
        "popularity": 0.0143,
        "profile_path": null
    }
}