{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/g6QPI70Kzt91Q0lGyLfsVqZAwlJ.jpg",
                "genre_ids": [
                    10752,
                    28,
                    18
                ],
                "id": 193756,
                "original_language": "en",
                "original_title": "Lone Survivor",
                "overview": "Four Navy SEALs on a covert mission to neutralize a high-level Taliban operative must make an impossible moral decision in the mountains of Afghanistan that leads them into an enemy ambush. As they confront unthinkable odds, the SEALs must find reserves of strength and resilience to fight to the finish.",
                "popularity": 6.8759,
                "poster_path": "/zaBIrloyhGK7iNTZMb3f9SARsl8.jpg",
                "release_date": "2013-12-24",
                "title": "Lone Survivor",
                "video": false,
                "vote_average": 7.434,
                "vote_count": 4524,
                "character": "Healy",
                "credit_id": "52fe4cd89251416c91101fe7",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/9vAoubhoZE8aSkUZoSfxs3UWZhO.jpg",
                "genre_ids": [
                    53,
                    28,
                    80
                ],
                "id": 156022,
                "original_language": "en",
                "original_title": "The Equalizer",
                "overview": "McCall believes he has put his mysterious past behind him and dedicated himself to beginning a new, quiet life. But when he meets Teri, a young girl under the control of ultra-violent Russian gangsters, he can’t stand idly by – he has to help her. Armed with hidden skills that allow him to serve vengeance against anyone who would brutalize the helpless, McCall comes out of his self-imposed retirement and finds his desire for justice reawakened. If someone has a problem, if the odds are stacked against them, if they have nowhere else to turn, McCall will help. He is The Equalizer.",
                "popularity": 13.6595,
                "poster_path": "/9u4yW7yPA0BQ2pv9XwiNzItwvp8.jpg",
                "release_date": "2014-09-24",
                "title": "The Equalizer",
                "video": false,
                "vote_average": 7.281,
                "vote_count": 9489,
                "character": "Teddy's Guy",
                "credit_id": "54fa060b9251414a1100017d",
                "order": 34
            },
            {
                "adult": false,
                "backdrop_path": "/oNoprEND25zXR6Fns8cIZUkuoMc.jpg",
                "genre_ids": [
                    35,
                    80,
                    18
                ],
                "id": 308266,
                "original_language": "en",
                "original_title": "War Dogs",
                "overview": "Based on the true story of two young men, David Packouz and Efraim Diveroli, who won a $300 million contract from the Pentagon to arm America's allies in Afghanistan.",
                "popularity": 6.6258,
                "poster_path": "/mDcPRjZC1bb6LavFU3gwsWdVfCM.jpg",
                "release_date": "2016-08-18",
                "title": "War Dogs",
                "video": false,
                "vote_average": 6.926,
                "vote_count": 5187,
                "character": "Dan Bilzerian",
                "credit_id": "587654c892514179f2009432",
                "order": 28
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "The King Of Instagram"
        ],
        "biography": "Dan Brandon Bilzerian is an American actor, poker player and trust fund beneficiary. In late 2013 he became a social media sensation for posting pictures of his lavish lifestyle on Instagram. He is known for Kings of the Internet (2022), Blitz TV,  Top 22 Internet Millionaires (2022), Greatest Social Stars, Success TV with Forbes Riley, Jet Set (2007 TV Series), and Icons, Idols and Influencers.\n\nBilzerian has been crowned “The King Of Instagram” and has been featured in series alongside many other celebrity entrepreneurs, authors and actors including Andrew “Cobra” Tate, Iman Gadzhi, Josh King Madrid/JetSetFly, Tristan Tate, Logan Paul, Jake Paul, GaryVee, Patrick Bet-David, Justin Guerra, Branden Condy, Alex Hormozi , Andy Frisella, Ed Mylett, Lewis Howes, Anthony Morrison, Grant Cardone, Gary Cardone, Leila Hormozi, TheBlondeJon, Jay Shetty, Adin Ross, Sneako, Lewis Howes, Dan Pena, Jordan Welch, Dan Lok and Sebastian Ghiorghiu.",
        "birthday": "1980-12-07",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.danbilzerian.com/",
        "id": 1278777,
        "imdb_id": "nm3626447",
        "known_for_department": "Acting",
        "name": "Dan Bilzerian",
        "place_of_birth": "Tampa - Florida - USA",
        "popularity": 0.2259,
        "profile_path": "/9UKqkVEVMaNa6RpfFKeoeuQILxw.jpg"
    }
}