{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/vkr2KGu10vCHbK1SM5q2AtWA4TM.jpg",
                "genre_ids": [
                    18,
                    10749,
                    10751,
                    10770
                ],
                "id": 245473,
                "original_language": "en",
                "original_title": "Cloud 9",
                "overview": "Set high atop snow-capped mountains in the adrenaline-fueled world of competitive snowboarding, the Disney Channel Original Movie “Cloud 9″ tells the inspiring story of two snowboarders who must overcome self-doubt to learn that achieving their dreams is possible.",
                "popularity": 3.1457,
                "poster_path": "/1BD3erCSl1mh0VrTBg0g34wOWsQ.jpg",
                "release_date": "2014-01-17",
                "title": "Cloud 9",
                "video": false,
                "vote_average": 6.908,
                "vote_count": 531,
                "character": "Mike Lamb",
                "credit_id": "52fe4f05c3a36847f82b7b79",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Colton Tran's journey to a career in film began when he was mentored in the language of Final Cut Pro at the age of 12. He was instantly hooked on the filmmaking process and quickly became fluent.\n\nAs his passion for film continued to grow, Tran directed, produced and edited all of his own independent films. After graduating from high school in his hometown of Layton, Utah, Tran directed a short film titled \"Monstrosity\" that toured the nation in the film festival circuit and gained recognition from managers and agents in Los Angeles. This recognition prompted Tran to move to Hollywood, California with his producing partner Laura Young.\n\nTwo months later Tran was signed by a manager and was introduced to his agent at Creative Artists Agency (CAA). In 2014, he landed a role in the Disney Channel original movie \"Cloud 9.\" Being on the other side of the camera helped him grow as a director on the technical side and also in how to direct actors more effectively.\n\nSince arriving in Hollywood, Tran has made his mark on many projects. He directed and edited a four episode web-series for Jennette McCurdy titled \"What's Next For Sarah.\" He also directed and produced several music videos for The Girl and The Dreamcatcher (Dove Cameron & Ryan McCartan), which all premiered on Disney Channel. He later collaborated with Awesomeness TV and directed an episode of their horror anthology series \"Sleep Tight\" before being cast in a horror film titled \"Nocturne,\" which premiered on Showtime.\n\nMost recently, Tran debuted his new mini-series \"Scarytale Ending\" with a teaser of his first episode, a short film titled \"Cruella.\" He directed and edited \"Killer Date,\" an award-winning short film on the festival circuit and he also directed a music video for Todrick Hall's \"I Like Boys.\" As an actor, Tran was cast in the most recent seasons of Freeform's \"Grownish\" and Netflix's \"GLOW.\"\n\nToday, Tran continues to carve out work as a filmmaker and creator. \"8 Bodies,\" a dark horror comedy, is a feature film scheduled to begin production soon. Tran is also spearheading a second feature film, a stylized slasher titled \"Spook,\" expected to begin production next year.",
        "birthday": "1989-01-24",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.coltontran.com",
        "id": 1280880,
        "imdb_id": "nm2466936",
        "known_for_department": "Acting",
        "name": "Colton Tran",
        "place_of_birth": "USA",
        "popularity": 0.1034,
        "profile_path": "/eZwqo7PSMCagpV6vbDm7szEvX8r.jpg"
    }
}