{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cLZxnkj75cGBK1tLTMyIudOZYZk.jpg",
                "genre_ids": [
                    99
                ],
                "id": 1777,
                "original_language": "en",
                "original_title": "Fahrenheit 9/11",
                "overview": "Michael Moore's view on how the Bush administration allegedly used the tragic events on 9/11 to push forward its agenda for unjust wars in Afghanistan and Iraq.",
                "popularity": 3.7204,
                "poster_path": "/1WQgOCJj22zF7Bsr0pIBgGBr71q.jpg",
                "release_date": "2004-06-25",
                "title": "Fahrenheit 9/11",
                "video": false,
                "vote_average": 7.084,
                "vote_count": 1460,
                "character": "Self (archive footage)",
                "credit_id": "52fe4314c3a36847f8038b45",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "瑞奇·马丁",
            "瑞奇·馬丁",
            "Enrique Martín Morales"
        ],
        "biography": "Enrique \"Ricky\" Martín Morales (born December 24, 1971) is a Puerto Rican singer, songwriter and actor. He is known for his musical versatility, with his discography incorporating a wide variety of many elements, such as Latin pop, dance, reggaeton, salsa, and other genres. Born in San Juan, Martin began appearing in television commercials at age nine and began his musical career at twelve, as a member of Puerto Rican boy band Menudo. He began his solo career in 1991 while in Sony Music Mexico, gaining recognition in Latin America with the release of his first two studio albums, Ricky Martin (1991) and Me Amaras (1993), both of which were focused on ballads.\n\nMartin's third album, A Medio Vivir (1995), helped him rise to prominence in European countries. The chart-topping single \"María\" incorporated a mixture of Latin music genres and became his first international hit. His international success was further solidified with his fourth album, Vuelve (1998). The album, which earned Martin his first Grammy Award, spawned songs \"Vuelve\" and \"La Copa de la Vida\". Martin performed the latter at the 41st Annual Grammy Awards. His first English album, Ricky Martin (1999) became his first US Billboard 200 number one. The lead single \"Livin' la Vida Loca\" topped both the Billboard Hot 100 and the UK Singles Chart. Martin's success in the late 1990s is generally seen as the beginning of the \"Latin explosion\". He has been credited for propelling the Latin pop music genre to mainstream recognition, paving the way for a large number of Latin artists to achieve global success.\n\nMartin has since released several successful albums, including Almas del Silencio (2003) and MTV Unplugged (2006), as well as Grammy Award winner A Quien Quiera Escuchar (2015). Notable singles in this period include \"She Bangs\", \"Nobody Wants to Be Lonely\", \"Tal Vez\", \"Tu Recuerdo\", \"La Mordidita\", \"Vente Pa' Ca\", and \"Canción Bonita\". As an actor, Martin took a role in the hit soap opera General Hospital (1994–1996), while his portrayal of Antonio D'Amico in The Assassination of Gianni Versace: American Crime Story (2018) garnered him an Emmy nomination. He also starred as Ché in the Broadway revival of the musical Evita in 2012.\n\nMartin is one of the best-selling Latin music artists of all time, having sold over 70 million records worldwide. He has scored 11 Billboard Hot Latin Songs number-one songs, and won two Grammy Awards, five Latin Grammy Awards, five MTV Video Music Awards, two American Music Awards, three Latin American Music Awards, three Billboard Music Awards, nine Billboard Latin Music Awards, eight World Music Awards, fourteen Lo Nuestro Awards, a Guinness World Record, and a star on the Hollywood Walk of Fame. His philanthropy and activism focus on LGBT rights and fighting against human trafficking; in 2004, he founded The Ricky Martin Foundation, a non-profit, non-governmental organization that focuses on denouncing human trafficking and educating about the crime's existence. ...\n\nSource: Article \"Ricky Martin\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1971-12-24",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 128057,
        "imdb_id": "nm0005193",
        "known_for_department": "Acting",
        "name": "Ricky Martin",
        "place_of_birth": "San Juan, Puerto Rico",
        "popularity": 0.5377,
        "profile_path": "/mAkdpTplDii6otg5fWli74K44o5.jpg"
    }
}