{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mgDv2dDihyetAcENxyf2tpXY245.jpg",
                "genre_ids": [
                    10402,
                    18
                ],
                "id": 1407,
                "original_language": "fr",
                "original_title": "La Môme",
                "overview": "From the mean streets of the Belleville district of Paris to the dazzling limelight of New York's most famous concert halls, Edith Piaf's life was a constant battle to sing and survive, to live and love. Raised in her grandmother's brothel, Piaf was discovered in 1935 by nightclub owner Louis Leplee, who persuaded her to sing despite her extreme nervousness. Piaf became one of France's immortal icons, her voice one of the indelible signatures of the 20th century.",
                "popularity": 2.9969,
                "poster_path": "/3b9DAONAsFRhJKu25R33PE3VwDh.jpg",
                "release_date": "2007-02-14",
                "title": "La Vie en Rose",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 1667,
                "character": "American journalist",
                "credit_id": "52fe42f4c3a36847f802f5e9",
                "order": 49
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Paulina Nemcová",
            "Pavlína Nemcová",
            "Nemcova Pavlina",
            "Paulina Rocio",
            "Paulína Němcová",
            "Pavlína Němcová-Bakarová",
            "Paulína Němcová-Bakarová",
            "Paulína Nemcová-Bakarová",
            "Paulina Nemcova",
            "Paulina Němcová"
        ],
        "biography": "Pavlína Němcová (born 18 February 1972 in Děčín, Czechoslovak Socialist Republic) is a Czech model, actress and producer.\n\nNěmcová enrolled into the Actors Studio in New York, taking Jack Waltzer’s classes for one year. After acting in a few American independent film projects, such as Salome’s Kiss and Damaged, and playing small parts in European films like Colditz and Modern Love, Němcová obtained the role of the American journalist who interviews Edith Piaf/Marion Cotillard in La Vie en Rose. She was then cast as Olga in La Guerre des Miss – The War of the Beauty Queens, released in France in January 2009. An Italian drama from Roberto Faenza filmed in English immediately followed: The Case of Unfaithfull Klara.\n\nSource: Article \"Pavlína Němcová\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1972-02-18",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.pavlinanemcova.com/",
        "id": 128083,
        "imdb_id": "nm1117521",
        "known_for_department": "Acting",
        "name": "Paulina Němcová",
        "place_of_birth": "Děčín, Czechoslovakia [now Czech Republic]",
        "popularity": 0.0411,
        "profile_path": "/qXwzKeObj24JTNYzSrJpe3vbvZw.jpg"
    }
}