{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sfoaAbgEQlQI8dBFJsiIdXiLI7x.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 595975,
                "original_language": "fr",
                "original_title": "La Belle Époque",
                "overview": "Victor, a disillusioned 60-something whose marriage is on the rocks, opts to relive the week of his life when, 40 years earlier, he met his true love through a company that allows customers to return to the time period of their choosing.",
                "popularity": 1.8531,
                "poster_path": "/eHojoVxYRyqGABgoiTYyfkYqTra.jpg",
                "release_date": "2019-11-06",
                "title": "La Belle Époque",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 1036,
                "character": "Margot",
                "credit_id": "5cc71edec3a368467783b4d7",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Doria Tillier (born 27 March 1986) is a French actress.\n\nShe was born to a mathematician father and a mother who restores paintings, and she was a student in one of the oldest and most prestigious French high schools, Lycée Condorcet, in Paris. After she graduated, she worked as a waitress.\n\nFrom 2008 to 2010, Tillier studied acting at the Laboratoire de l'acteur-Hélène Zidi with Hélène Zidi. She later played in short films as well as in commercials, including Nina Ricci's perfume Mademoiselle Ricci. In 2008, she appeared as a coroner in the thriller Bloody Flowers directed by Richard J. Thomson and starring Amanda Lear. In 2009, she played in the series Action spéciale douanes aired on France 2.\n\nIn September 2012, she became a witty weather girl on a famous access prime time TV show called Le Grand Journal on Canal+, succeeding Solweig Rediger-Lizlow. She left the program in June 2014.\n\nDuring the same period, Tillier also appeared in the second version of the sketch show Le Débarquement on Canal+ in December 2013. She was the mistress of ceremonies of the thirtieth anniversary of Canal+ in November 2014. In June 2015, on the occasion of the ten years of the popular TV show Salut les Terriens!, she performed a song in homage to the star presenter Thierry Ardisson with music by Barbara, written by Nicolas Bedos who accompanied with the piano.\n\nIn March 2017, Tillier starred in the leading role in the film M. & Mme Adelman, directed and co-starred by her companion Nicolas Bedos, with a screenplay written by them both.\n\nSource: Article \"Doria Tillier\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1986-03-27",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1280476,
        "imdb_id": "nm3723133",
        "known_for_department": "Acting",
        "name": "Doria Tillier",
        "place_of_birth": "Paris, France",
        "popularity": 0.3375,
        "profile_path": "/kCS73s2jtUY7dV7eDVKOAZjvgVS.jpg"
    }
}