{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kVd3a9YeLGkoeR50jGEXM6EqseS.jpg",
                "genre_ids": [
                    16,
                    28,
                    12,
                    878
                ],
                "id": 569094,
                "original_language": "en",
                "original_title": "Spider-Man: Across the Spider-Verse",
                "overview": "After reuniting with Gwen Stacy, Brooklyn’s full-time, friendly neighborhood Spider-Man is catapulted across the Multiverse, where he encounters the Spider Society, a team of Spider-People charged with protecting the Multiverse’s very existence. But when the heroes clash on how to handle a new threat, Miles finds himself pitted against the other Spiders and must set out on his own to save those he loves most.",
                "popularity": 19.881,
                "poster_path": "/8Vt6mWEReuy4Of61Lnj5Xj704m8.jpg",
                "release_date": "2023-05-31",
                "title": "Spider-Man: Across the Spider-Verse",
                "video": false,
                "vote_average": 8.341,
                "vote_count": 7889,
                "character": "Additional Voices (voice)",
                "credit_id": "647a45e5caef2d0119bf0c59",
                "order": 39
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ishmail Bashey"
        ],
        "biography": "Ismail originally hails from Bombay, India where he began his acting career at a fairly young age, taking an active part in every school production from Shakespeare to Moliere. He began performing on stage professionally in Musical Theatre in productions such as Grease; They Are Playing our Song and Best of Broadway. He has trained extensively in jazz ballet under the guidance of Karla Singh and Shiamak Davar. He then moved to New York and began his acting career in the Big Apple. He trained at the Lee Strasberg theater Institute in New York for 3 years. During that time he was working on the local south Asian cable channels such as ITV and ATN as a TV host introducing Music videos and Bollywood tidbits. He then began the auditioning circuit around that time and landed some guest roles in independent features such as the Tic Code (starring Gregory Hines). He also began acting on the popular Zee TV drama Mausam that was filmed in New York and Bombay. He was recently seen in the independent feature film Wings of Hope for which he won Best Actor at the Cinevue International film festival.",
        "birthday": "1970-04-25",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.ismailbashey.com/Welcome.html",
        "id": 128154,
        "imdb_id": "nm0059779",
        "known_for_department": "Acting",
        "name": "Ismail Bashey",
        "place_of_birth": "Bombay, India",
        "popularity": 0.0666,
        "profile_path": "/8siTb4IKjtbPinJvVygWlShdr0A.jpg"
    }
}