{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/51UDa3IuGyiKGe2MgMcLGvJE2Fm.jpg",
                "genre_ids": [
                    53,
                    80,
                    18
                ],
                "id": 1213,
                "original_language": "en",
                "original_title": "The Talented Mr. Ripley",
                "overview": "Tom Ripley is a calculating young man who believes it's better to be a fake somebody than a real nobody. Opportunity knocks in the form of a wealthy U.S. shipbuilder who hires Tom to travel to Italy to bring back his playboy son, Dickie. Ripley worms his way into the idyllic lives of Dickie and his girlfriend, plunging into a daring scheme of duplicity, lies and murder.",
                "popularity": 5.7442,
                "poster_path": "/6ojHgqtIR41O2qLKa7LFUVj0cZa.jpg",
                "release_date": "1999-12-25",
                "title": "The Talented Mr. Ripley",
                "video": false,
                "vote_average": 7.195,
                "vote_count": 3935,
                "character": "Immigration Officer",
                "credit_id": "5459369dc3a36839ac00202c",
                "order": 25
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Massimo Reale nasce a Firenze il 29 giugno 1966 comincia a recitare a soli nove anni con il maestro Dino Parretti che realizza spettacoli per ragazzi con attori giovanissimi. Nel 1986, dopo aver frequentato il gruppo MiM diretto da Orazio Costa Giovangigli si trasferisce a Roma ed entra all’Accademia d’Arte Drammatica “Silvio d’Amico”  che frequenta per due anni.    Nel 1987 prende parte alla sua prima serie televisiva e nel  1989 e comincia a girare “Classe di Ferro” che vincerà il telegatto 1990 come migliore serie tv italiana. Negli anni successivi porta avanti in parallelo l’attività teatrale e quella cinematografica e televisiva prendendo parte  a molte fiction e lavorando accanto ad attori come: Renzo Montagnani (Don Fumino), Nino Manfredi ( Le Ragioni del Cuore), Lino Banfi (Un posto tranquillo 1 e 2), Beppe Fiorello ( Salvo D’acquisto), Paolo Ferrari (Orgoglio), Terence Hill (Don Matteo 7).    Nel 1983 avvia con il regista Walter Pagliaro una lunga collaborazione che porta alla realizzazione di  11 spettacoli accanto ad attori come Micaela Esdra, Lucilla Morlacchi, Roberto Herlitzka, Luca Lazzareschi, Piero di Iorio. Nel 1994 lavora con Luca Zingaretti allo spettacolo “Prigionieri di Guerra” con il quale recita nuovamente nel 2000 nello spettacolo di David Mamet “Perversioni Sessuali a Chicago” insieme a Valentina Cervi. Nel 1995 collabora con Ninni Bruschetta negli spettacoli “I Carabinieri” di Beniamino Joppolo e “Brutus” tratto dal Giulio Cesare di Shakespeare. In ambito cinematografico nel 2001 prende parte al film “Nemmeno in un sogno” di Gianluca Greco  con  Roberto De Francesco e Giuseppe Battiston    e nel 2002 a “4 4 2” di Roan  Johnson con Valerio Mastandrea. Nell’anno 2000 comincia a studiare canto con la Maestra Adriana Giunta  e nel 2003 partecipa, come protagonista maschile, allo spettacolo  sulla grande cantante nera Billie Holyday “Lady Day” di Massimo Romeo Piparo con Amii Stewart. Nello stesso periodo realizza con il fotografo Marco Delogu sei libri nei quali alterna il ruolo di curatore di testi a quello di autore.   Nel 2006 vince il premio per il miglior soggetto per documentario al Festival  “HAIVISTO MAI?”  e nel 2007 lo realizza, cedendolo all’emittente La7, nello stesso anno prende parte alle rappresentazioni tragiche del Teatro Greco di Siracusa recitando nelle “Trachinie” al fianco di Micaela Esdra e Paolo Graziosi con la regia di Walter Pagliaro e in “Eracle” con la regia di Luca De Fusco  recitando con Ugo Pagliai. Nel settembre 2007 Luca De Fusco lo coinvolge nuovamente nella realizzazione di “Elettra” con Lina Sastri per il Teatro Stabile del Veneto.   Alla fine del 2007 fonda, con il drammaturgo Sergio Pierattini, l’Associazione Culturale Valdez Essedi Arte, per la quale produce e interpreta  lo spettacolo “Il caso K” con la regia di Sergio Pierattini e il documentario sul lavoro dell’attore “L’Arte del Comico” nel quale è produttore esecutivo e regista.  Nel 2008 recita al teatro di  Tindari nel “Giulio Cesare” di Shakespeare con Edoardo Siravo, Leandro Amato, Renato Campese con la regia di Maurizio Panici. Nel 2009 recita nell’Elettra di Euripide con Manuela Mandracchia e la regia di Walter Manfrè e ne “Le Troiane” di Euripide con Ivana Monti con la regia di Federico San Lio.",
        "birthday": "1966-06-29",
        "deathday": null,
        "gender": 0,
        "homepage": "http://www.massimoreale.it/massimoreale/home.html",
        "id": 1281192,
        "imdb_id": "nm0714040",
        "known_for_department": "Acting",
        "name": "Massimo Reale",
        "place_of_birth": "Florence - Tuscany - Italy",
        "popularity": 0.1112,
        "profile_path": "/aVBeEg1v4OOhn1Op2A8X6lkmnCb.jpg"
    }
}