{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zHkQEQzoLAJwlMif4QJP1jjbsky.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 330483,
                "original_language": "en",
                "original_title": "The Choice",
                "overview": "Travis and Gabby first meet as neighbors in a small coastal town and wind up in a relationship that is tested by life's most defining events.",
                "popularity": 2.4939,
                "poster_path": "/6MF3cdAasnF17SG9bmeamQ066iJ.jpg",
                "release_date": "2016-02-04",
                "title": "The Choice",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 1923,
                "character": "Jackie",
                "credit_id": "57baf3f5c3a3682959000e54",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Lady Di"
        ],
        "biography": "This explosive actress, whose work has been described as breathtaking and soulful, is originally from St. Petersburg, Florida and is the youngest child of Henry and Minnie Sellers, who strongly encouraged education, music and artistic creativity. In St. Petersburg, Diane attended Azalea Middle School and Dixie Hollins High School, where she performed in numerous stage productions and sang in many talent shows. She knew she was destined for a career as a performer when her sister, Dolores, escorted her to her first professional audition, a touring stage musical titled Sights and Sounds, wherein Diane was described as the cast's \"triple threat,\" as an actress, singer and dancer. After graduating from St. Petersburg College (and after a short, less than memorable stint as a flight attendant), she relocated to Atlanta, Georgia, where she began her professional acting career. Diane has performed on-stage in Florida, Little Rock, Arkansas, Atlanta and Los Angeles. After receiving critical acclaim for her performance with Sharon Stone in the feature film \"Last Dance,\" Diane relocated to Los Angeles, where she continues to work in film, television and on stage.",
        "birthday": "1958-10-08",
        "deathday": null,
        "gender": 1,
        "homepage": "https://in.bookmyshow.com/person/diane-sellers/1061648",
        "id": 128205,
        "imdb_id": "nm0783343",
        "known_for_department": "Acting",
        "name": "Diane Sellers",
        "place_of_birth": "St. Petersburg, Florida, USA",
        "popularity": 0.1362,
        "profile_path": "/2e00pN04z7GnhVtxdAa2XpFmnN5.jpg"
    }
}