{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/udIE8Cdon9wnYmVIOFYrBPfA2Mq.jpg",
                "genre_ids": [
                    14,
                    16,
                    35,
                    80
                ],
                "id": 856,
                "original_language": "en",
                "original_title": "Who Framed Roger Rabbit",
                "overview": "'Toon star Roger is worried that his wife Jessica is playing pattycake with someone else, so the studio hires detective Eddie Valiant to snoop on her. But the stakes are quickly raised when Marvin Acme is found dead and Roger is the prime suspect.",
                "popularity": 5.972,
                "poster_path": "/lYfRc57Kx9VgLZ48iulu0HKnM15.jpg",
                "release_date": "1988-06-22",
                "title": "Who Framed Roger Rabbit",
                "video": false,
                "vote_average": 7.531,
                "vote_count": 5937,
                "character": "Jessica's Performance Model",
                "credit_id": "52fe4283c3a36847f8024a27",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/aQ2ZbNqIaecoQsryNe33UmDtms.jpg",
                "genre_ids": [
                    12,
                    10751,
                    14,
                    35,
                    10749
                ],
                "id": 2493,
                "original_language": "en",
                "original_title": "The Princess Bride",
                "overview": "In this enchantingly cracked fairy tale, the beautiful Princess Buttercup and the dashing Westley must overcome staggering odds to find happiness amid six-fingered swordsmen, murderous princes, Sicilians and rodents of unusual size. But even death can't stop these true lovebirds from triumphing.",
                "popularity": 5.8117,
                "poster_path": "/dvjqlp2sAhUeFjUOfQDgqwpphHj.jpg",
                "release_date": "1987-09-25",
                "title": "The Princess Bride",
                "video": false,
                "vote_average": 7.685,
                "vote_count": 4809,
                "character": "The Mother",
                "credit_id": "55e84046c3a3682c64002020",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Betsey Brantley",
            "Elizabeth Jeanne Brantley"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nBetsy Brantley (born September 20, 1955) is an American actress.\n\nBrantley was born Rutherfordton, North Carolina. She is the older sister of producer/screenwriter Duncan Brantley, and formerly married to Simon Dutton and Steven Soderbergh.\n\nBetsy studied acting at the Central School of Speech and Drama in the United Kingdom. It was there that she was discovered to film a movie with Sean Connery titled, Five Days One Summer. Like Five Days One Summer, most of her films are based in Europe. Her most famous role, perhaps, is her portrayal of Neely Pritt in the cult classic Shock Treatment. She also played alongside Pierce Brosnan and Michael Caine in the film version of \"The Fourth Protocol\" and enjoyed a cameo in the Ashley Judd movie \"Double Jeopardy\". Brantley was also the body double for Jessica Rabbit in Who Framed Roger Rabbit?.\n\nAlong with several other films, Betsy has been a cast member in quite a few television shows. These shows include Tour of Duty and Second Noah. On Tour of Duty, she played the role of Dr. Jennifer Seymour (later \"Major Jennifer Seymour\"). On Second Noah, she played Jesse Beckett, a veterinarian and the mother of eight adopted children.\n\nBrantley played Dolph Lundgren's girlfriend in Dark Angel (retitled I Come in Peace in America).\n\nShe has also appeared as Elsie Cubitt in the Granada Television production of 'The Dancing Men', from The Adventures of Sherlock Holmes by Sir Arthur Conan Doyle.\n\nDescription above from the Wikipedia article Betsy Brantley, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1955-09-20",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 12831,
        "imdb_id": "nm0105280",
        "known_for_department": "Acting",
        "name": "Betsy Brantley",
        "place_of_birth": "Rutherfordton, North Carolina, USA",
        "popularity": 1.0509,
        "profile_path": "/dGSROHU3THDWRJzCywWNj0G9mqq.jpg"
    }
}