{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/udIE8Cdon9wnYmVIOFYrBPfA2Mq.jpg",
                "genre_ids": [
                    14,
                    16,
                    35,
                    80
                ],
                "id": 856,
                "original_language": "en",
                "original_title": "Who Framed Roger Rabbit",
                "overview": "'Toon star Roger is worried that his wife Jessica is playing pattycake with someone else, so the studio hires detective Eddie Valiant to snoop on her. But the stakes are quickly raised when Marvin Acme is found dead and Roger is the prime suspect.",
                "popularity": 5.972,
                "poster_path": "/lYfRc57Kx9VgLZ48iulu0HKnM15.jpg",
                "release_date": "1988-06-22",
                "title": "Who Framed Roger Rabbit",
                "video": false,
                "vote_average": 7.531,
                "vote_count": 5937,
                "character": "Baby Herman (voice)",
                "credit_id": "52fe4283c3a36847f8024a23",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nLou Hirsch is an actor, born and raised in Brooklyn, New York, and currently based in the United Kingdom. He studied at the University of Miami and The Guildhall School of Music &amp; Drama in London, UK, with future Star Trek actress Marina Sirtis. He has an extensive list of credits in film, TV, and theater going back over 20 years, and his most recent film role was as Headmaster Widdlesome in Thunderbirds. He also appeared as Arnie Kowalski in the BBC comedy My Hero from 2000 to 2006. He is probably best known as the off-screen voice of Baby Herman in the 1988 film Who Framed Roger Rabbit. Hirsch has recently been seen in the new British American sitcom Episodes as Wallace, the security guard at the complex where the main characters live.\n\nHirsch's first significant television appearance was as Hymie in the 1982 series We'll Meet Again.\n\nHe specialises in playing Americans in English television programmes.\n\nDescription above from the Wikipedia article Lou Hirsch, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1955-02-27",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 12830,
        "imdb_id": "nm0386516",
        "known_for_department": "Acting",
        "name": "Lou Hirsch",
        "place_of_birth": "Brooklyn, New York, USA",
        "popularity": 0.3523,
        "profile_path": "/dxRykRWGwgODBcpzNKVMBJVnFk9.jpg"
    }
}