{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zlU8BIkgY7E6SMfD3USTWC6bchL.jpg",
                "genre_ids": [
                    878,
                    28,
                    18,
                    53
                ],
                "id": 119450,
                "original_language": "en",
                "original_title": "Dawn of the Planet of the Apes",
                "overview": "A group of scientists in San Francisco struggle to stay alive in the aftermath of a plague that is wiping out humanity, while Caesar tries to maintain dominance over his community of intelligent apes.",
                "popularity": 13.9596,
                "poster_path": "/kScdQEwS9jPEdnO23XjGAtaoRcT.jpg",
                "release_date": "2014-07-08",
                "title": "Dawn of the Planet of the Apes",
                "video": false,
                "vote_average": 7.334,
                "vote_count": 11824,
                "character": "Captured Human (uncredited)",
                "credit_id": "64595d986aa8e000e4bceb3a",
                "order": 41
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Angela Kerecz is an American born actress and writer. Originally from the small town of Waynesboro, MS, Angela was always very involved in the arts through years of dance, piano, and clarinet training. In high school, she enjoyed participating in the drama club and was director of the school's play during her senior year. Angela went on to attend the University of Southern Mississippi where she received a Bachelor's Degree in Polymer Science and a minor in Chemistry. She then moved to Jackson, TN and worked as a paint chemist, pharmaceutical sales representative, and later became a licensed realtor. In 2009, she met Bobby Kerecz, who was the lead singer for Chippendales at the time. A relationship soon turned into a marriage to Bobby on 10-10-10 on the beach in Hawaii. Bobby, a true entertainer at heart, reawakened the performer side of Angela, and they began pursuing an acting career together. Angela's first gig was as a featured extra on the TV show, \"Nashville\", which films in Tennessee. Being on a big set was a stimulus for Angela to know this was what she wanted to pursue. She used her analytical skills to study the business and develop her acting. Angela began to get noticed, and was offered a featured spot in a scene with Arnold Schwarzenegger for the film, \"Sabotage\", and was featured in the opening scene of \"Scary Movie 5\". She was also given a recurring feature as a waitress for 23 episodes of \"Nashville.\" On the set of \"Last Vegas\", she was given some personal advice by Morgan Freeman, one of her favorite actors and a fellow Mississippian, who told her, \"Every job is your last one until you get the next one.\" Inspired to keep following her dreams and work hard, she soon began acting in several independent films, where she landed strong supporting and lead roles in films such as \"Shark Exorcist\", \"Hope\", \"The Cellular Effect\" and many more which would help her move to the next level in her acting. Recently, Angela was in LA working where she had a supporting role in the film \"One More Round\", which stars Kevin Sorbo, among others. Angela is a diverse actress who has been cast in roles ranging from lawyer, counselor, seductress, mom, to the lead as a female superhero in a web series. Angela also does occasional modeling and commercial work. Together with her husband, Bobby, they wrote and produced \"Souls Collide\" - a short which they filmed in 2013. \"Souls Collide\" also gave Angela the opportunity to put her director's hat back on, which she truly enjoyed. This project then became the launch pad to the screenplay they have just written, \"S.O.U.L.\", a bio-pic of how they met and struggles they have faced - a story of Searching, Obsessions, Understanding, and Love - a story of redemption. \"S.O.U.L.\" is in pre-production, and Angela and Bobby will star as themselves in this very personal project.  - IMDb Mini Biography By: 7 Souls Productions",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1285499,
        "imdb_id": "nm5579586",
        "known_for_department": "Acting",
        "name": "Angela Kerecz",
        "place_of_birth": null,
        "popularity": 0.0955,
        "profile_path": "/9LSuUt7EePTEHlUD3VwERFEQkY2.jpg"
    }
}