{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bSvUW4JQ6g4QiKvwejcfcPRd4Ke.jpg",
                "genre_ids": [
                    12,
                    35,
                    10751,
                    14
                ],
                "id": 118,
                "original_language": "en",
                "original_title": "Charlie and the Chocolate Factory",
                "overview": "A young boy wins a tour through the most magnificent chocolate factory in the world, led by the world's most unusual candy maker.",
                "popularity": 15.2762,
                "poster_path": "/iKP6wg3c6COUe8gYutoGG7qcPnO.jpg",
                "release_date": "2005-07-13",
                "title": "Charlie and the Chocolate Factory",
                "video": false,
                "vote_average": 7.042,
                "vote_count": 15656,
                "character": "Violet Beauregarde",
                "credit_id": "52fe421ac3a36847f8004313",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/jfxTTQqb9FRUPDLMn5BUWVvVsKf.jpg",
                "genre_ids": [
                    12,
                    18,
                    10751
                ],
                "id": 1265,
                "original_language": "en",
                "original_title": "Bridge to Terabithia",
                "overview": "Jesse Aarons trained all summer to become the fastest runner in school. So he's very upset when newcomer Leslie Burke outruns him and everyone else. Despite this and other differences including that she's rich, he's poor, she's a city girl, and he's a country boy the two become fast friends. Together they create Terabithia, a land of monsters, trolls, ogres, and giants where they rule as king and queen.",
                "popularity": 9.3012,
                "poster_path": "/3xFxGodKPMFLheS8rujFSmLfcq4.jpg",
                "release_date": "2007-02-15",
                "title": "Bridge to Terabithia",
                "video": false,
                "vote_average": 7.307,
                "vote_count": 5004,
                "character": "Leslie Burke",
                "credit_id": "52fe42ebc3a36847f802cea9",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/vAsFwNkxV0cHJWRJXkshg76rJRQ.jpg",
                "genre_ids": [
                    10751,
                    18
                ],
                "id": 43959,
                "original_language": "en",
                "original_title": "Soul Surfer",
                "overview": "The true story of teen surfer Bethany Hamilton, who lost her arm in a shark attack and courageously overcame all odds to become a champion again, through her sheer determination and unwavering faith.",
                "popularity": 3.1506,
                "poster_path": "/cvgRxrEupUFeJ0xzUExJo4dMXbL.jpg",
                "release_date": "2011-04-08",
                "title": "Soul Surfer",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 1196,
                "character": "Bethany Hamilton",
                "credit_id": "52fe466dc3a36847f80fe91d",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/bPm5kQLlc2KypdYkUxGbrGfLJ82.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 147773,
                "original_language": "en",
                "original_title": "The Way Way Back",
                "overview": "Shy 14-year-old Duncan goes on summer vacation with his mother, her overbearing boyfriend, and her boyfriend's daughter. Having a rough time fitting in, Duncan finds an unexpected friend in Owen, manager of the Water Wizz water park.",
                "popularity": 3.5895,
                "poster_path": "/4DgA0EDDVv37C8xISc3Vv0rhxlL.jpg",
                "release_date": "2013-06-06",
                "title": "The Way Way Back",
                "video": false,
                "vote_average": 7.137,
                "vote_count": 1857,
                "character": "Susanna Thompson",
                "credit_id": "52fe4bb39251416c7510b39f",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/vftMyaxyKlNKU5kdsKRlQLc57hY.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 523781,
                "original_language": "en",
                "original_title": "Words on Bathroom Walls",
                "overview": "Diagnosed with a mental illness halfway through his senior year of high school, a witty, introspective teen struggles to keep it a secret while falling in love with a brilliant classmate who inspires him to open his heart and not be defined by his condition.",
                "popularity": 3.0963,
                "poster_path": "/sTtcwfTjE9jaU0928xjUXNtmmyr.jpg",
                "release_date": "2020-08-21",
                "title": "Words on Bathroom Walls",
                "video": false,
                "vote_average": 7.8,
                "vote_count": 633,
                "character": "Rebecca",
                "credit_id": "5f0fa1ec47721500387282e3",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/cyKH7pDFlxIXluqRyNoHHEpxSDX.jpg",
                "genre_ids": [
                    80,
                    28,
                    53
                ],
                "id": 646097,
                "original_language": "en",
                "original_title": "Rebel Ridge",
                "overview": "A former Marine confronts corruption in a small town when local law enforcement unjustly seizes the bag of cash he needs to post his cousin's bail.",
                "popularity": 16.9802,
                "poster_path": "/xEt2GSz9z5rSVpIHMiGdtf0czyf.jpg",
                "release_date": "2024-08-27",
                "title": "Rebel Ridge",
                "video": false,
                "vote_average": 6.988,
                "vote_count": 1418,
                "character": "Summer McBride",
                "credit_id": "6080c59d65e0a200298f63a8",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Anna Sophia Robb",
            "안나소피아 롭",
            "آناسوفیا راب",
            "آنا سوفیا راب"
        ],
        "biography": "AnnaSophia Robb is an American actress and model, born on December 8, 1993, in Denver, Colorado, USA. The only child of Janet Robb, an interior designer, and David Robb, an architect, AnnaSophia showed an interest in the arts from an early age. She began her artistic career as a child, participating in local theater productions, until at the age of eight, she decided to pursue acting professionally. Shortly afterward, she moved to Los Angeles, where she landed her first commercial roles, including a notable one for the McDonald's chain.\n\nHer acting career began with her leading debut in Samantha: An American Girl Holiday (2004), a TV movie based on the famous American Girl book series. The following year, in 2005, she starred in Because of Winn-Dixie, where she portrayed the title character, a young girl who forms a special bond with a dog and learns valuable life lessons, and gained worldwide recognition for playing Violet Beauregarde in Tim Burton's adaptation of Charlie and the Chocolate Factory.\n\nIn 2007, AnnaSophia solidified her position as a talented actress when she starred in Bridge to Terabithia, a well-received adaptation of the famous children’s book that was praised for its emotional depth and sensitivity. Over the next years, she demonstrated her versatility in a variety of roles, including films such as The Reaping (2007), Jumper (2008), Sleepwalking (2008), Spy School (2008), Race to Witch Mountain (2009), The Space Between (2010), and Soul Surfer (2011), based on the true story of surfer Bethany Hamilton, who lost her arm in a shark attack. Her performance in Soul Surfer was widely praised by critics.\n\nIn 2013, AnnaSophia starred in the critically acclaimed independent film The Way, Way Back, alongside Steve Carell and Toni Collette. In 2017, she starred in Freak Show, produced by Drew Barrymore. She also found success on television, where she had notable roles. She gained fame for portraying the young Carrie Bradshaw in The Carrie Diaries (2013–2014), the prequel to Sex and the City. The following year, she appeared in the historical miniseries Mercy Street (2017), produced by Ridley Scott, and in 2019, she starred in the acclaimed Hulu series The Act, based on a shocking real-life story.\n\nAdditionally, AnnaSophia starred in The Expecting, a horror series for Quibi, and appeared in Little Fires Everywhere (2020), where she played the younger version of Reese Witherspoon’s character. In 2021, she was one of the leads in Dr. Death, a miniseries on Peacock, and also starred in the biographical film Lansky, alongside Harvey Keitel and Sam Worthington.\n\nMore recently, AnnaSophia starred in the action thriller Rebel Ridge for Netflix, directed by Jeremy Saulnier, and was part of the main cast of the NBC series Grosse Pointe Garden Society.\n\nAlongside her acting career, AnnaSophia Robb graduated from New York University (NYU) and is recognized for her involvement in humanitarian and environmental causes. With a career that began at a young age and a trajectory marked by strong and varied roles, Robb continues to be a respected presence in both film and television.",
        "birthday": "1993-12-08",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.annasophiarobb.com/",
        "id": 1285,
        "imdb_id": "nm1455681",
        "known_for_department": "Acting",
        "name": "AnnaSophia Robb",
        "place_of_birth": "Denver, Colorado, USA",
        "popularity": 1.6584,
        "profile_path": "/tWlnAuyQeFidHcAo2zUVxNv0G0T.jpg"
    }
}