{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qtamfYGFfDLfGRcucx1zNwohRts.jpg",
                "genre_ids": [
                    53,
                    878,
                    18
                ],
                "id": 860,
                "original_language": "en",
                "original_title": "WarGames",
                "overview": "High school student David Lightman has a talent for hacking. But while trying to hack into a computer system to play unreleased video games, he unwittingly taps into the Department of Defense's war computer and initiates a confrontation of global proportions. Together with his friend and a wizardly computer genius, David must race against time to outwit his opponent and prevent a nuclear Armageddon.",
                "popularity": 4.9437,
                "poster_path": "/zZ1rN4LoPxKNfAp67Xl300WxVeD.jpg",
                "release_date": "1983-06-03",
                "title": "WarGames",
                "video": false,
                "vote_average": 7.072,
                "vote_count": 2008,
                "character": "Pat Healy",
                "credit_id": "52fe4283c3a36847f8024d77",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "​From Wikipedia, the free encyclopedia\n\nJuanin Clay (born Juanin Clay de Zalduondo; November 26, 1949 - March 12, 1995) was an American actress who appeared in the 1983 drama-thriller film WarGames. She was one of the contenders for the role of Wilma Deering in the Buck Rogers in the 25th Century TV series, but lost the role when Erin Gray returned to reprise her role from the theatrical release. Clay later guest starred in the Buck Rogers episode \"Vegas in Space\", playing a character very similar to Deering named Marla Landers, who is briefly partnered with Rogers.\n\nClay also appeared as a guest star on a number of TV series including Father Murphy, L.A. Law, and The Edge of Night (she originated the role of Raven Alexander, before Sharon Gabet took over the role). In 1985, she played Jacqueline Kennedy in the mini-series Robert Kennedy & His Times. She also had a minor role in the film WarGames.\n\nClay attended The Ethel Walker School, in Simsbury, Connecticut. She graduated from Smith College, then earned a Master's in Education from Harvard University.\n\nThe cause of her death is disputed. Some sources say she died of breast cancer, however the user-edited Internet Movie Database site says her death was caused by a heart ailment.\n\nDescription above from the Wikipedia article Juanin Clay, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1949-11-26",
        "deathday": "1995-03-12",
        "gender": 1,
        "homepage": null,
        "id": 12853,
        "imdb_id": "nm0165536",
        "known_for_department": "Acting",
        "name": "Juanin Clay",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.1517,
        "profile_path": "/44LAsJqXWo90omrgRhFtYwKNup8.jpg"
    }
}