{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gz3rCM34UicmOxRY1T2SgiQZJoS.jpg",
                "genre_ids": [
                    18
                ],
                "id": 249164,
                "original_language": "en",
                "original_title": "If I Stay",
                "overview": "Mia Hall, a talented young cellist, thought the most difficult decision she would ever have to make would be whether to pursue her musical dreams at prestigious Juilliard or follow her heart to be with the love of her life, Adam, a rock singer/guitarist. However, a car wreck changes everything in an instant, and now Mia's life hangs in the balance. Suspended between life and death, Mia faces a choice that will decide her future.",
                "popularity": 3.8833,
                "poster_path": "/7Twh8h3Wh7GC9npTAEUThgkxkWL.jpg",
                "release_date": "2014-08-21",
                "title": "If I Stay",
                "video": false,
                "vote_average": 7.366,
                "vote_count": 4239,
                "character": "Male EMT",
                "credit_id": "54a260c1925141236b0059f9",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Willaim Vaughn",
            "William C. Vaughan",
            "William C. Vaughn"
        ],
        "biography": "William C. Vaughan was born in Halifax, Nova Scotia in a hospital that has since been demolished. Some would say it's because William broke the mold, but that's impossible to confirm. He took to acting at a young age, playing the role of the ethereal Santa Claus in his Grade Primary Christmas Concert. Will spent eight weeks with a dialect coach developing his German accent for the part. Four years later he had the most lines in the musical Shortstop in which he played the calculated Carlton. Time constraints allowed only two days of baseball training, but Will proved to be a natural. The next year Will played a rapping toucan. He then closed-out his Elementary School acting career the way he began; again playing the white-bearded giver of joy at his Grade Six Christmas Concert.\n\nWill then took a break from acting to concentrate on his first love of playing the tuba. He got back in the swing of acting in High School, having one line in West Side Story, where he underwent an immense prosthetic and make-up procedure to play a Puerto Rican. From there, Will worked at a video store for some years while making short films with his friends to satiate his acting appetite. After becoming bored with movie-making and clam-baking, Will set his sights for the West Coast and the (occasional) sun of Vancouver, where he attended Vancouver Film School. Upon graduating (with honours), Will found his agent and started his professional career with a shot of the back of his head in I Love You Beth Cooper. From there he appeared in the Emmy-Nominated web series Battlestar Galactica: The Face of the Enemy. He then watched his friends blast off into space in the ABC/CTV/BBC series Defying Gravity.\n\nWill's latest series is CBC's Men With Brooms, based on the Paul Gross film of the same name. Will plays the dim-witted, but kind-hearted Curler, Matt.\n\n- IMDb Mini Biography",
        "birthday": "1984-09-26",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1287152,
        "imdb_id": "nm3505635",
        "known_for_department": "Acting",
        "name": "William Vaughan",
        "place_of_birth": "Cole Harbour - Nova Scotia - Canada",
        "popularity": 0.09,
        "profile_path": "/4KFaIOMfsadrHQkRSQhjs1ZGzvZ.jpg"
    }
}