{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3PYjmY1OiOq2LQ8ZvvLxzwbqIq.jpg",
                "genre_ids": [
                    53,
                    27
                ],
                "id": 11206,
                "original_language": "en",
                "original_title": "Wait Until Dark",
                "overview": "After a flight back home, Sam Hendrix returns with a doll he innocently acquired along the way. As it turns out, the doll is actually stuffed with heroin, and a group of criminals led by the ruthless Roat has followed Hendrix back to his place to retrieve it. When Hendrix leaves for business, the crooks make their move -- and find his blind wife, Susy, alone in the apartment. Soon, a life-threatening game begins between Susy and the thugs.",
                "popularity": 3.7455,
                "poster_path": "/cNW3ewCB52KkxzSE47PcE5Bqvmr.jpg",
                "release_date": "1967-10-26",
                "title": "Wait Until Dark",
                "video": false,
                "vote_average": 7.351,
                "vote_count": 562,
                "character": "BG with Dog (uncredited)",
                "credit_id": "52fe44109251416c75027ab9",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/hTc55dlCPMP4oqrUU66GjKjSblp.jpg",
                "genre_ids": [
                    18
                ],
                "id": 64685,
                "original_language": "en",
                "original_title": "Extremely Loud & Incredibly Close",
                "overview": "A year after his father's death, Oskar, a troubled young boy, discovers a mysterious key he believes was left for him by his father and embarks on a scavenger hunt to find the matching lock.",
                "popularity": 3.4532,
                "poster_path": "/6pszViNvKr1r31pP7gJNYDHEx5P.jpg",
                "release_date": "2011-12-25",
                "title": "Extremely Loud & Incredibly Close",
                "video": false,
                "vote_average": 6.98,
                "vote_count": 2066,
                "character": "Homeless Man (uncredited)",
                "credit_id": "62480429713ea600a1e2dab3",
                "order": 58
            },
            {
                "adult": false,
                "backdrop_path": "/wcJmFsz8RqIhozMwvU81hreTX4i.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 12163,
                "original_language": "en",
                "original_title": "The Wrestler",
                "overview": "Aging wrestler Randy \"The Ram\" Robinson is long past his prime but still ready and rarin' to go on the pro-wrestling circuit. After a particularly brutal beating, however, Randy hangs up his tights, pursues a serious relationship with a long-in-the-tooth stripper, and tries to reconnect with his estranged daughter. But he can't resist the lure of the ring and readies himself for a comeback.",
                "popularity": 3.5185,
                "poster_path": "/6OTR8dSoNGjWohJNo3UhIGd3Tj.jpg",
                "release_date": "2008-09-07",
                "title": "The Wrestler",
                "video": false,
                "vote_average": 7.532,
                "vote_count": 3809,
                "character": "Wrestling Fan (uncredited)",
                "credit_id": "57c4d5bf925141129b002b2a",
                "order": 92
            },
            {
                "adult": false,
                "backdrop_path": "/mRVzzlXswVmXWqCPni9JIla5fmj.jpg",
                "genre_ids": [
                    18
                ],
                "id": 3116,
                "original_language": "en",
                "original_title": "Midnight Cowboy",
                "overview": "Joe Buck is a wide-eyed hustler from Texas hoping to score big with wealthy New York City women; he finds a companion in Enrico \"Ratso\" Rizzo, an ailing swindler with a bum leg and a quixotic fantasy of escaping to Florida.",
                "popularity": 4.8818,
                "poster_path": "/f7YLzOxwWzeEdo7RhAlPSBTYa8.jpg",
                "release_date": "1969-05-25",
                "title": "Midnight Cowboy",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 1512,
                "character": "St. Bernard Owner (uncredited)",
                "credit_id": "595aa468c3a36828fc03e397",
                "order": 44
            },
            {
                "adult": false,
                "backdrop_path": "/r17jFHAemzcWPPtoO0UxjIX0xas.jpg",
                "genre_ids": [
                    28,
                    53,
                    80
                ],
                "id": 324552,
                "original_language": "en",
                "original_title": "John Wick: Chapter 2",
                "overview": "John Wick is forced out of retirement by a former associate looking to seize control of a shadowy international assassins’ guild. Bound by a blood oath to aid him, Wick travels to Rome and does battle against some of the world’s most dangerous killers.",
                "popularity": 16.213,
                "poster_path": "/hXWBc0ioZP3cN4zCu6SN3YHXZVO.jpg",
                "release_date": "2017-02-08",
                "title": "John Wick: Chapter 2",
                "video": false,
                "vote_average": 7.339,
                "vote_count": 13680,
                "character": "Homeless Man in Chinatown (uncredited)",
                "credit_id": "60bb2ad218b751004287df31",
                "order": 44
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "William Albert Walters"
        ],
        "biography": "Born in Columbus, Ohio in 1937, Bill attended Grandview Heights High  School and the Ohio State University where he majored in fine arts  hoping to get into advertising or cartooning. Among his many mementos  are a sheaf of rejection slips from The New Yorker and Playboy. He was  introduced to the theatre by volunteering to design the set for a  friend's student production. He worked on the art staff of the OSU  Motion Pictures Department and the University TV station, WOSU. In 1963,  after the usual summer stock assignments, he arrived in New York City,  where he worked at NBC as a page and as a production assistant. He  became a backstage jack-of-all-trades with The New York Shakespeare  Festival, The Playhouse of the Ridiculous, and many other regional and  off-Broadway theater groups.\n\nIn 1966 he was hired by Peter  Schickele as the stage manager for PDQ Bach, and became known to  thousands of concert goers in New York and around the country as the  irascible and irritable but always efficient apologist for Schickele's  satiric presentations of the infamous \"Evening of Musical Madness\".  Despite his crusty on-stage persona, Bill was for 46 years the technical  coordinator, production manager, road manager, and the REAL stage  manager of the series of concerts that had its first public performance  in 1965 at Town Hall in New York. He once said that he felt like Sky  Masterson, the gambler-hero of \"Guys and Dolls\", who noted that: \"There  are two things that have been in every hotel room in America: Sky  Masterson and the Gideon Bible.\"\n\nWalters continues to work in  concerts, theatre, dabbles in background work in movies and TV, writes  lots of unproduced plays and film scripts, and teaches film-making and  video with kids. He also works for Gray Line New York Sightseeing as a  tour guide riding around on the top of a double-decker bus telling lies  about New York City to gullible and unwary tourists.\n\nHe is married to the actress Donegal Browne. Their daughter Samantha Browne-Walters is also an actress.",
        "birthday": "1937-12-11",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1290726,
        "imdb_id": "nm2450269",
        "known_for_department": "Acting",
        "name": "Bill Walters",
        "place_of_birth": "Columbus, Ohio, USA",
        "popularity": 0.1104,
        "profile_path": "/jkkutFGkL4HPPTSRRenoRcAt4XL.jpg"
    }
}