{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xmWBhzDODSmYKON4HMmB0UyQknc.jpg",
                "genre_ids": [
                    80,
                    27,
                    53
                ],
                "id": 11454,
                "original_language": "en",
                "original_title": "Manhunter",
                "overview": "FBI Agent Will Graham, who retired after catching Hannibal Lecter, returns to duty to engage in a risky cat-and-mouse game with Lecter to capture a new killer.",
                "popularity": 0.1472,
                "poster_path": "/6rb24x39vV8n5301IelC8rCPJTH.jpg",
                "release_date": "1986-08-14",
                "title": "Manhunter",
                "video": false,
                "vote_average": 7.015,
                "vote_count": 1439,
                "character": "Springfield",
                "credit_id": "58cded83c3a36850fb0144a9",
                "order": 30
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Norman Snow is an American actor who is probably best known for his role as the evil tyrant Xur in the science fiction film The Last Starfighter (1984).\n\nSnow is acknowledged in the acting community as an accomplished character actor, with the vast majority of his work being roles in television series since the late 1970s, in series such as Man from Atlantis, Quantum Leap, L.A. Law and Beverly Hills, 90210. A highlight of Snow's television career is the role of Torin in an episode of Star Trek: The Next Generation called \"Rightful Heir\" during the series' sixth season.\n\nHis film career has been more sporadic with roles ranging from the aforementioned The Last Starfighter in 1984, to the FBI agent Springfield in the 1986 Michael Mann 'Hannibal Lecktor' thriller Manhunter. Snow returned to cinema screens in 2001 in the film Moonbeams and is slated to be next seen in The Last Starfighter sequel, Starfighter, reuniting Snow with the film's original director Nick Castle.",
        "birthday": "1950-03-29",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 129088,
        "imdb_id": "nm0811302",
        "known_for_department": "Acting",
        "name": "Norman Snow",
        "place_of_birth": "Little Rock, Arkansas, USA",
        "popularity": 0.1777,
        "profile_path": "/dX1Z038fU3b2biawc27hPNK7FOV.jpg"
    }
}