{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/f0QGUAdHs2eDMuUXO9GhViYe1bj.jpg",
                "genre_ids": [
                    18
                ],
                "id": 8832,
                "original_language": "it",
                "original_title": "Il Divo",
                "overview": "Italy, early '90s. Calm, clever and inscrutable, politician Giulio Andreotti has been synonymous with power for decades. He has survived everything: electoral battles, terrorist massacres, loss of friends, slanderous accusations; but now certain repentant mobsters implicate him in the crimes of Cosa Nostra.",
                "popularity": 4.5052,
                "poster_path": "/g1bgM34ZGldqcGkucmaGZe4pMBu.jpg",
                "release_date": "2008-05-28",
                "title": "Il Divo",
                "video": false,
                "vote_average": 7.62,
                "vote_count": 1147,
                "character": "Caterina Stagno (uncredited)",
                "credit_id": "599882559251410ec8013a9b",
                "order": 76
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Cristina Serafini was born in Turin, Italy, the only child of a housewife and a pizza maker. She soon decided to pursue an acting career and won a scholarship to attend the prestigious Scuola del Teatro Stabile di Torino (Union of the Theatres of Europe), founded by the Italian director Luca Ronconi. She speaks Italian, English, French and Spanish.\n\nSerafini has appeared in 29 films and television series since the early 2000s (decade), including: Il Divo (film), Colpo d'occhio, Il bene e il male, Il peccato e la vergogna and Valzer, which was screened at the 64th Venice International Film Festival.\n\nSerafini made her film début in the 2006 film Sono tornato al nord. Serafini's first significant role came in Roberto Cuzzillo's Senza fine (2009) as a young homosexual - winning her critical and commercial recognition, as well as the Best Actress in a Leading Role Award at 2009 Chieti Film Festival directed by Roberto Faenza.\n\nIn 2011 Serafini was selected for four lead roles. She played the role of Alessandro Gassman's fiancée in Natale per due and received the Best Rising Italian Actress Award at Premio Internazionale Euro-Mediterraneo, Rome, Italy.\n\nSerafini, who has often been photographed by paparazzi with American actor and director Sean Penn, always refuses to comment about her private life.\n\nSerafini can most recently be seen starring in the CBS soap opera The Young and the Restless.",
        "birthday": "1978-09-22",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1291220,
        "imdb_id": "nm2866606",
        "known_for_department": "Acting",
        "name": "Cristina Serafini",
        "place_of_birth": "Turin, Italy",
        "popularity": 0.2494,
        "profile_path": "/x1te68FEwh9Z5eAidtlFDeNae6e.jpg"
    }
}