{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/n2eUT4zQA2yYcKOgAFidgOyiFoH.jpg",
                "genre_ids": [
                    18,
                    37
                ],
                "id": 68718,
                "original_language": "en",
                "original_title": "Django Unchained",
                "overview": "With the help of a German bounty hunter, a freed slave sets out to rescue his wife from a brutal Mississippi plantation owner.",
                "popularity": 12.4836,
                "poster_path": "/7oWY8VDWW7thTzWh3OKYRkWUlD5.jpg",
                "release_date": "2012-12-25",
                "title": "Django Unchained",
                "video": false,
                "vote_average": 8.184,
                "vote_count": 27058,
                "character": "Daughtrey Rifleman (uncredited)",
                "credit_id": "5703ed11c3a3686972000049",
                "order": 91
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jimmy Lee Gill",
            "Jimmy Gill",
            "Jim Gill",
            "Сет Бэйли",
            "Джимми Ли Джилл"
        ],
        "biography": "Real name: Jimmy Lee Gill (pseudonym: Seth Bailey). He has been a performing clown almost his entire life. Early 1950's, as a pre-school child Jimmy's Grandfather, the former world renowned circus clown Seth Walter Bailey also and better known as \"Bill Bailey\" would make-up and costumed Jimmy as a clown then take the miniature clown along on gigs. Late 1960's, Jimmy began his professional career at the age of 16 with summer employment at the Memphis Zoological Garden as a clown for its daily one-ring circus. Tommy O'Brian, the former world renowned circus animal trainer, directed this two-shows-a-day gig. Jimmy used Grandpa Bailey's make-up kit and costume. He did a bald Whiteface 2-piece clown suit and tie entity. Early 1970's, Jimmy became a member of the Al Chymia Shriners' Clown Unit in Memphis, Tennessee. He continued to use Grandpa Bailey's make-up kit and costume. He did a red mop wigged Whiteface ragged Andy type entity. All of the Clown Unit's gigs were for charitable causes. One May they dressed for 20 events. One Memorial Day weekend, they raised over $6,500 for the \"Muscular Dystrophy Association's Telethon\" by collecting change from passing motorists at a major Memphis street intersection. Late 1998, Jimmy was asked if he could duplicate John Wayne Gacy's \"Pogo the Clown\" entity for the feature television film titled Люди в белом (1998). An Internet search provided a color image of Gacy's sinister clown entity which Jimmy did duplicate as requested. Early 2000, Jimmy volunteered to help the \"Make-A-Wish Foundation of Greater Los Angeles\" grant a terminally ill young boy's wish of having a clown host his birthday party. Jimmy worked the party of family and friends as Auguste 03 with: balloon sculptures, comedic stich, face painting, juggling, and magic (both stage and close-up). Efern's face beamed joy and his excitement was contagious! This sadly, turned out to be Efern's last birthday as he succumbed to leukemia. Jimmy's still on-call for Make-A-Wish. Mid 2000, Jimmy's voluntarily worked several fund-raisers for the \"Starlight Children's Foundation\". Jimmy's also still on-call for Starlight. Jimmy continues working gigs for charitable causes, AFTRA and SAG. He now additionally offers his services for corporate events, i.e. a specially designed iconic entity, spokesman, grand openings, annual parties, etc. He has worked one Hollywood Studio Producer's Christmas Party as Mime 07. He is a professional clown in both appearance and entertainment quality.",
        "birthday": "1946-08-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1292480,
        "imdb_id": "nm2220002",
        "known_for_department": "Acting",
        "name": "Seth Bailey",
        "place_of_birth": "Memphis, Tennessee, USA",
        "popularity": 0.1445,
        "profile_path": null
    }
}