{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/euxYhuuJjChU755u2YHj0ZPjww3.jpg",
                "genre_ids": [
                    35,
                    80,
                    18
                ],
                "id": 1574,
                "original_language": "en",
                "original_title": "Chicago",
                "overview": "Murderesses Velma Kelly and Roxie Hart find themselves on death row together and fight for the fame that will keep them from the gallows in 1920s Chicago.",
                "popularity": 3.9445,
                "poster_path": "/3ED8cWCXY9zkx77Sd0N5qMbsdDP.jpg",
                "release_date": "2002-12-10",
                "title": "Chicago",
                "video": false,
                "vote_average": 7.12,
                "vote_count": 2750,
                "character": "Wilbur",
                "credit_id": "6229cefaa579f9001c7dcbce",
                "order": 26
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Kenneth Ard",
            "Kenneth D. Ard"
        ],
        "biography": "Ken Ard is an American dancer, choreographer, actor and singer.\n\nBorn in Oakland, California in 1960, he grew up in a home visited by a large number of jazz greats. Joe Williams was a personal friend of his father, while bassist Paul Chambers his uncle, Carmen McRae a close friend of his aunt, and Ard would assist Nina Simone with her performances when she would appear in Oakland.\n\nHis mother exposed him to jazz through frequent visits to musical in San Francisco and Oakland. Ard also proved to be an especially good gymnast, winning the California youth gymnastics championship at 16.\n\nAt the age of 17, dancing at the Oakland and San Francisco Ballet, he was approached by Jon Hendricks of Lambert, Hendricks & Ross for a lead role in his show, Evolution of the Blues, to be presented in the historical Golden Gate Theatre in San Francisco.\n\nArd was asked to choreograph for shows in Hawaii. When Alvin Ailey came to Hawaii, he asked Ard to dance in his American Dance Theater. But after a few months, Ard missed the dynamic of the combination of song and dance, and auditioned for a Broadway show for which he was selected, Cats (musical), Starlight Express, Song and Dance, Jelly's Last Jam and Smokey Joe's Cafe.\n\nAs an actor Ken played the role of Wilbur as one of the murdered husbands in the Film Chicago (2002 film), with Anthony Quinn the European cultfilm Seven Servants created, written and directed by Daryush Shokof (1996) and many American TV series and commercials.\n\nWith Holland as his base Ken has collaborated with many of Europe's notable jazz artists. The beginning of 2009 marked the release of \"Ballads, Blues & Cocktails\", Ken's first jazz CD, and he is performing in the 2009/2010 season of Holland's renowned Jazz Impuls Theater concert series with the Goodman/Hampton sextet 4BEAT6. Ken has performed for many dignitaries, the most recent being the American ambassador to Moldova in the capital, Chisinau. Ken Ard returned to the US in 2014, and resides back in New York City, teaching at Alvin Ailey Ballet company, NYC.",
        "birthday": "1960-06-30",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1293295,
        "imdb_id": "nm0033907",
        "known_for_department": "Acting",
        "name": "Ken Ard",
        "place_of_birth": "Oakland, California, USA",
        "popularity": 0.2562,
        "profile_path": "/31RrjxehbKzwjsHujzh0t1EOZYw.jpg"
    }
}