{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uj4vPPQBsD4HXoltTgPysfhm4Qn.jpg",
                "genre_ids": [
                    27,
                    9648,
                    53
                ],
                "id": 20345,
                "original_language": "it",
                "original_title": "L'uccello dalle piume di cristallo",
                "overview": "An American writer living in Rome witnesses an attempted murder that is connected to an ongoing killing spree in the city and conducts his own investigation, despite he and his girlfriend being targeted by the killer.",
                "popularity": 1.7218,
                "poster_path": "/dpALRkwodEIT7TGX9SqTgwVNn0i.jpg",
                "release_date": "1970-02-27",
                "title": "The Bird with the Crystal Plumage",
                "video": false,
                "vote_average": 7.146,
                "vote_count": 796,
                "character": "Monica Ranieri",
                "credit_id": "52fe43e2c3a368484e003d57",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Tall, blonde, busty and radiant, Eva Renzi created a sensation when she rose to stardom in her native West Germany in the mid-60s. Born to a 17-year-old French mother and a 49-year-old Danish father, Eva's childhood was everything but happy. Her parents got divorced when she was three, and her mother put her into an orphanage run by nuns. Eva was 14 when she returned to live with her abusive father. She later claimed that \"he beat the daylights out of me on a daily basis\". Living with her father proved to be so difficult that Eva tried to kill herself twice before she eventually left home at the tender age of 17 to pursue a career in acting. Famous drama coach Else Bongers took her under her wing, and the beautiful teenager supported herself as a model, a phone operator, and a waitress before making her debut on stage in late 1961. She became a member of the Freie Volksbühne Berlin in 1964 when renowned director Erwin Piscator hired her as \"Electra\".",
        "birthday": "1944-11-03",
        "deathday": "2005-08-16",
        "gender": 1,
        "homepage": null,
        "id": 129431,
        "imdb_id": "nm0719960",
        "known_for_department": "Acting",
        "name": "Eva Renzi",
        "place_of_birth": "Berlin, Germany",
        "popularity": 0.2417,
        "profile_path": "/nxlKaNIGjLDX59iY3khKOgVgfHG.jpg"
    }
}