{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rXP1DHEk2pnSCnwe3qT1Vp1lps3.jpg",
                "genre_ids": [
                    16,
                    10751,
                    12,
                    9648
                ],
                "id": 9994,
                "original_language": "en",
                "original_title": "The Great Mouse Detective",
                "overview": "When the diabolical Professor Ratigan kidnaps London's master toymaker, the brilliant master of disguise Basil of Baker Street and his trusted sidekick Dawson try to elude the ultimate trap and foil the perfect crime.",
                "popularity": 5.4816,
                "poster_path": "/9uDr7vfjCFr39KGCcqrk44Cg7fQ.jpg",
                "release_date": "1986-07-02",
                "title": "The Great Mouse Detective",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 1731,
                "character": "Lady Mouse (voice)",
                "credit_id": "5b52c3e20e0a26231200910a",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nShani Wallis (born 14 April 1933) is an English actress and singer, who released several records in the 1950s.\n\nWallis was born in Tottenham, London. Making her first stage appearance at the age of four, she later studied at the Royal Academy of Dramatic Art (RADA) on a scholarship. Wallis went on to play many leading roles in the West End, but she is best known for the role of Nancy in Carol Reed's 1968 film production of Lionel Bart's musical Oliver! which co-starred Ron Moody, Harry Secombe, Oliver Reed, Jack Wild and Mark Lester. Wallis has appeared with Liberace, Jack Benny, Dean Martin and Jerry Lewis.\n\nWallis is a naturalized citizen of the United States, where she has lived for many years. She married her agent/manager Bernie Rich on Friday 13 September 1968. Asked, \"Why on that day?\" she replied, \"Everything good has happened to me on Friday 13th and Shani means 'lucky jewel'. The couple have one child, Rebecca, and two granddaughters. She is also the sister of jazz drummer Leon Roy.\n\nWallis is an Honorary Patron of The Music Hall Guild of Great Britain and America.\n\nDescription above from the Wikipedia article Shani Wallis, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1933-04-14",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 129437,
        "imdb_id": "nm0908861",
        "known_for_department": "Acting",
        "name": "Shani Wallis",
        "place_of_birth": "Tottenham, London, England, UK",
        "popularity": 0.1943,
        "profile_path": "/jKtibUuRMT044OmNV6DBXSVSPP8.jpg"
    }
}