{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/37dC684Q6a4o83oAx8KEyNSuBV3.jpg",
                "genre_ids": [
                    53,
                    18
                ],
                "id": 390497,
                "original_language": "ko",
                "original_title": "터널",
                "overview": "A man is on his way home when the poorly constructed tunnel he is driving through collapses, leaving him trapped leaving himself for the unexpected whilst emergency services struggle to help.",
                "popularity": 3.4067,
                "poster_path": "/rLTYM8HeUo4YhgAlU888XEU8LMS.jpg",
                "release_date": "2016-08-10",
                "title": "Tunnel",
                "video": false,
                "vote_average": 7.301,
                "vote_count": 615,
                "character": "Drilling Company Executive",
                "credit_id": "6123f4a25346610028ca4907",
                "order": 28
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Kim Jong-su",
            "Jong-soo Kim",
            "Jong-su Kim",
            "Kim Jong-soo"
        ],
        "biography": "Kim Jong-soo (김종수) is a South Korean actor. His acting career began in 1985 when he took on the role of Alan in the play Equus. He gained recognition through his performances in various theatrical productions in Ulsan, earning him several awards. In 1996, he was honored with the Gyeongnam Theater Award for Best Actor, followed by the Outstanding Acting Award at the Ulsan Theater Festival in 2000 and the Mayor's Achievement Award at the Ulsan Arts Festival in 2002. Moreover, he also held the position of president in the Ulsan Actors Association.\n\nIn 2007, Kim Jong-Soo made his film debut with an appearance in Secret Sunshine, directed by Lee Chang-dong. Subsequently, he appeared in movies like No Forgiveness, Wish, War on Crime, Home Sweet Home, The King of Flattery, Man in Love, Legendary Fist and Minority Opinion. Kim has been recognized through his supporting roles in television dramas such as Six Flying Dragons, The Producers, Three Days, Misaeng: Incomplete Life, Pied Piper, Kingdom, The Emperor: Owner of the Mask, and Snowdrop.\n\nStarting from 2016, he embarked on a series of film projects, starring in The Prosecutor's Abduction, Seondal: The Man Who Sells the River, Asura: The City of Madness, Tunnel, Horror Stories 3, One Way Trip, The Map Against the World and Insane.",
        "birthday": "1964-11-30",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.artistcompany.co.kr/portfolio-item/kim-jong-soo/",
        "id": 1295417,
        "imdb_id": "nm4535657",
        "known_for_department": "Acting",
        "name": "Kim Jong-soo",
        "place_of_birth": "Busan, South Korea",
        "popularity": 0.4112,
        "profile_path": "/bcZLy3t0EXvRY4EWsD5BoEt3xOM.jpg"
    }
}