{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4Bb1kMIfrT2tYRZ9M6Jhqy6gkeF.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 76203,
                "original_language": "en",
                "original_title": "12 Years a Slave",
                "overview": "In the pre-Civil War United States, Solomon Northup, a free black man from upstate New York, is abducted and sold into slavery. Facing cruelty as well as unexpected kindnesses Solomon struggles not only to stay alive, but to retain his dignity. In the twelfth year of his unforgettable odyssey, Solomon’s chance meeting with a Canadian abolitionist will forever alter his life.",
                "popularity": 7.0513,
                "poster_path": "/xdANQijuNrJaw1HA61rDccME4Tm.jpg",
                "release_date": "2013-10-18",
                "title": "12 Years a Slave",
                "video": false,
                "vote_average": 7.938,
                "vote_count": 11592,
                "character": "Patroller",
                "credit_id": "53cc7ea9c3a3687767002040",
                "order": 46
            },
            {
                "adult": false,
                "backdrop_path": "/57dG6BzU2RcPtLgoA3oyHUIb2rI.jpg",
                "genre_ids": [
                    18,
                    37,
                    12
                ],
                "id": 581032,
                "original_language": "en",
                "original_title": "News of the World",
                "overview": "A Texan traveling across the wild West bringing the news of the world to local townspeople, agrees to help rescue a young girl who was kidnapped.",
                "popularity": 2.6328,
                "poster_path": "/fYQCgVRsQTEfUrP7cW5iAFVYOlh.jpg",
                "release_date": "2020-12-25",
                "title": "News of the World",
                "video": false,
                "vote_average": 6.951,
                "vote_count": 1831,
                "character": "Mr. Farley",
                "credit_id": "5d8ab241d9f4a6001850692b",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/cWWM1TTGnOoglZKLpVERGtQ6HJ4.jpg",
                "genre_ids": [
                    10749,
                    35,
                    80
                ],
                "id": 256591,
                "original_language": "en",
                "original_title": "Focus",
                "overview": "Nicky, an accomplished con artist, gets romantically involved with his disciple Jess but later ends their relationship. Years later, she returns as a femme fatale to spoil his plans.",
                "popularity": 5.8306,
                "poster_path": "/lOzGWjceYTd0kd5HyX7Ch46O9kh.jpg",
                "release_date": "2015-02-25",
                "title": "Focus",
                "video": false,
                "vote_average": 6.874,
                "vote_count": 8042,
                "character": "Hustler",
                "credit_id": "606b267d124c8d00575fcd93",
                "order": 39
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Tom Francis Murphy"
        ],
        "biography": "Thomas Francis Murphy was born in Dayton, Ohio in 1953. Early on in his adult life he made his living in dairy barns and on factory floors. He has trained as a hard hat diver, an ambulance driver, worked as a social worker, and freelance theatre critic. In his thirties, while living in Little Rock, AR, Murphy decided to take an acting class. The class changed his direction in life and acting suddenly filled the void. He spent over 20 years on the East Coast with a paintbrush in one hand and a script in the other while pursuing a career in the theatre. He trained with Shakespeare& Co of Lenox, MA and spent years performing in off off Broadway houses in New York where his work in the plays of Sam Shepard garnered high praise in the New York Times and several other publications.\n\nMurphy moved to New Orleans in 2013 and has worked across from many of Hollywood's A-list actors including Woody Harrelson in True Detective, Chiwetel Ejiofor in 12 Years a Slave, and Keanu Reeves in The Whole Truth. Murphy also had principle roles in the soon to be released, Free State Of Jones, with Mathew McConaughey and Same Kind of Different As Me, with Greg Kinnear and Renee Zellweger, and as a somewhat series regular on Salem. He has appeared on American Horror, and a host of other projects.",
        "birthday": "1953-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1295668,
        "imdb_id": "nm2958419",
        "known_for_department": "Acting",
        "name": "Thomas Francis Murphy",
        "place_of_birth": " Dayton, Ohio, USA",
        "popularity": 0.1825,
        "profile_path": "/e7xbhH1ha1g98EPAx5lAilYwxAu.jpg"
    }
}