{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9uoZrTXUiByDECmWopkIJhZxSzw.jpg",
                "genre_ids": [
                    28,
                    80,
                    53
                ],
                "id": 449992,
                "original_language": "id",
                "original_title": "The Night Comes for Us",
                "overview": "After sparing a girl's life during a massacre, an elite Triad assassin is targeted by an onslaught of murderous gangsters.",
                "popularity": 4.8988,
                "poster_path": "/8lI1p5cPqgXN2qrKZrmI3mhKBfs.jpg",
                "release_date": "2018-10-05",
                "title": "The Night Comes for Us",
                "video": false,
                "vote_average": 6.887,
                "vote_count": 746,
                "character": "Chien Wu",
                "credit_id": "5b7647229251411d9101caa2",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "馮推守",
            "冯推守"
        ],
        "biography": "Sunny is a character actor with good screen presence. He is also an accomplished martial artist, MMA (Mixed Martial Arts) coach, Action Director and Fight Choreographer. He has appeared in numerous short films and TV serials (including the highly successful Code of Law on Mediacorp Ch5).\n\nHe has an impressive list of movie credits that include Call If You Need Me, One Last Dance, The Maid and Perth. His most recent feature films projects have seen him take on leading-roles and main cast roles. These include the Indonesian movie Headshot (opposite Iko Uwais as the main antagonist “Lee”).; Malaysian movies Petaling Street Warriors and The Collector; and local Singapore movies Siew Lap (Sam Loh) and “re: solve”. 2015 has seen him putting on the Action Director’s hat for TV productions such as 2025 and Premonition! He will also be appearing in upcoming movies such as Buffalo Boys (Mike Wiluan).",
        "birthday": "1982-11-02",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1297561,
        "imdb_id": "nm1837651",
        "known_for_department": "Acting",
        "name": "Sunny Pang",
        "place_of_birth": "Singapore",
        "popularity": 0.5562,
        "profile_path": "/tEhFEmOLwnoHcX0PJhzSLWr0Dw2.jpg"
    }
}