{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gVw5NVGsGDhEeYUS1DeFWeLdQ16.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 859,
                "original_language": "en",
                "original_title": "Dangerous Liaisons",
                "overview": "In 18th century France, Marquise de Merteuil asks her ex-lover Vicomte de Valmont to seduce the future wife of another ex-lover of hers in return for one last night with her. Yet things don’t go as planned.",
                "popularity": 4.7706,
                "poster_path": "/7etDozwd9Pf5oCcyo4h1Hki6U13.jpg",
                "release_date": "1988-12-21",
                "title": "Dangerous Liaisons",
                "video": false,
                "vote_average": 7.193,
                "vote_count": 1217,
                "character": "Julie",
                "credit_id": "52fe4283c3a36847f8024c99",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia.\n\nValerie Gogan was born in Scotland and left her native Glasgow in the 1980s to train at LAMDA , since leaving she has become one of a small number of Scottish actresses familiar to film and television audiences in th UK. Gogan made her big screen debut in Stephen Frears's film 'Dangerous Liasions' alongside Michelle Pfeiffer, John Malcovitch, Glen Close, and Peter Capaldi. Later moving on to star in ‘One more Kiss’ opposite Gerrard Butler. Her distinctive looks and voice are also well-known on TV, Her break through lead role coming in ‘Heart of The High Country’, also starring in the BBC series 'Hamish MacBeth' in which she played opposite Robert Carlyle. She is also known for principle roles in ‘Waking the Dead’, ‘The Bill’, Doctors, Peak Practice, David Copperfield, Waiting for Elvis and Arrividerci Millwall, to name but a few. As well as her extensive TV and film career, Gogan has always been drawn to classical roles in the theatre and her work with The Royal Shakespeare Company, The Royal national Theatre and in Londons West End. Her plays include: A Dolls House, Dangerous Liason, The Rehearsal,Worlds Apart and Secret Rapture. Gogan has worked with many of the UK's leading film, TV and theatre directors, including Katie Mitchell,Stephen Frears, Ian Mcdiarmid, Anna Makmin, Howard Davies, James MacDonald, Simon Usher, Nick Hamm, Tinge Krishnan and Charles McDougall.\n\nDescription above from the Wikipedia article Valerie Gogan, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 12984,
        "imdb_id": "nm0324636",
        "known_for_department": "Acting",
        "name": "Valerie Gogan",
        "place_of_birth": "Glasgow, Scotland, UK",
        "popularity": 0.2287,
        "profile_path": "/6Be5iZxrrZHoADiOdmdDk85Xdgt.jpg"
    }
}