{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lz6Cy1JgOR72AilU2ghDvLKbgqT.jpg",
                "genre_ids": [
                    35
                ],
                "id": 813,
                "original_language": "en",
                "original_title": "Airplane!",
                "overview": "An ex-fighter pilot forced to take over the controls of an airliner when the flight crew succumbs to food poisoning.",
                "popularity": 8.7172,
                "poster_path": "/7Q3efxd3AF1vQjlSxnlerSA7RzN.jpg",
                "release_date": "1980-06-27",
                "title": "Airplane!",
                "video": false,
                "vote_average": 7.306,
                "vote_count": 4780,
                "character": "Newscaster",
                "credit_id": "609b84f48dbc3300408278cb",
                "order": 41
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Michael Laurence\u2028is an award-winning actor and writer.\n\nHe is known for his recurring roles as Curtis 'Caddie' DeVille on NBC’s Shades of Blue (opposite Jennifer Lopez), the eco-terrorist Maddox Beck on NBC’s The Blacklist, Cutter the Vet on the cult hit The Heartshe Holler on Adult Swim, and the mysterious Barry the Homeless Man on FX’s Damages, among many other TV and film credits.  He has performed leading roles on Broadway and Off-Broadway, in top regional theaters, and internationally.\n\n\u2028\u2028He is the playwright of the acclaimed Off-Broadway plays Krapp,39 (Drama Desk Award nomination, Soho Playhouse/London/Dublin/Edinburgh), Hamlet in Bed (Rattlestick Playwrights Theater, Pleasance Theatre/Edinburgh), and the upcoming Cincinnatus. \u2028\n\nHe is the co-creator (with playwright-performer Edgar Oliver) of Chop Off Your Ear and the writer/director of the feature film Escape Artists.  \u2028Other screenplays include Hamlet in Bed and the feature adaptation of Murakami’s Kafka on the Shore.\u2028\u2028  He has guest-starred on Prodigal Son, Evil, The Good Wife, Elementary, Person Of Interest, Hit & Run, Law & Order: SVU, Third Watch, Johnny Zero, FX, GhostStories, As the World Turns, and Jonathan Ames’ What’s Not To Love? for SHOWTIME.  Film acting credits include The Last Thing Mary Saw (upcoming), Can You Ever Forgive Me?, One For the Money (w/ Katharine Heigl), Man On A Ledge (w/ Sam Worthington & Ed Harris), A Walk In The Park (directed by Amos Poe), The Operator, Follow Me Outside, Room314, Escape Artists, Claire Dolan, Torte Blume, Tell Me The Truth, The Chase, Standing In the Current, Love God, The Minister’s Black Veil, Particles of Truth, and other indies.\u2028\u2028",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://michaellaurence.net/bio",
        "id": 1299570,
        "imdb_id": "nm0491136",
        "known_for_department": "Acting",
        "name": "Michael Laurence",
        "place_of_birth": "Cincinatti, OH, USA",
        "popularity": 0.1363,
        "profile_path": "/vlP9ZPscnR59mAHaYGzxzS4VfAJ.jpg"
    }
}