{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/utghtkDDOhwEDS7r9hhRhn7Wneg.jpg",
                "genre_ids": [
                    53,
                    878
                ],
                "id": 220289,
                "original_language": "en",
                "original_title": "Coherence",
                "overview": "Four couples gather for dinner the night a mysterious and powerful comet passes overhead.",
                "popularity": 6.2446,
                "poster_path": "/ezUtb9m5DeLwL2gxi4gktzNCvQv.jpg",
                "release_date": "2013-09-19",
                "title": "Coherence",
                "video": false,
                "vote_average": 7.215,
                "vote_count": 3163,
                "character": "Extra",
                "credit_id": "61c203d78b959e0043420ab8",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/cGnaZm6EQOJESde3Vv4v53Zk4gN.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 626735,
                "original_language": "en",
                "original_title": "Dog",
                "overview": "An army ranger and his dog embark on a road trip along the Pacific Coast Highway to attend a friend's funeral.",
                "popularity": 3.9482,
                "poster_path": "/zHQy4h36WwuCetKS7C3wcT1hkgA.jpg",
                "release_date": "2022-02-17",
                "title": "Dog",
                "video": false,
                "vote_average": 7.309,
                "vote_count": 1671,
                "character": "Callan",
                "credit_id": "606a799d699fb7006fc75c73",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "With training in theatre arts, improvisation, &amp; creative writing, Aqueela holds a degree in Human Development from the University of Long Beach, California.\n\nHaving studied with Inner Circle Theatre, The Improv Space, Sarah Underwood, Craig Anton, and many others she has found success in her entertainment career as an actress, model, &amp; host. Her driven inspiration for film &amp; vibrant work ethic has landed Aqueela working with Liev Schreiber (X-Men Origins: Wolverine 2009), Jamie Marshall (Warrior 2011, Twilight 2008), James Byrkit (Coherence 2013, Rango 2011, Pirates of the Caribbean 2003), and Emily Baldoni (Ghosts of Girlfriends Past) among many others.\n\nFilm &amp; television are where Aqueela's hunger peaks, yet as a young woman fascinated with all creative sides to the business she has also found success modeling with brands such as Adidas, ASCIS, Harley Davidson, Rockstar, &amp; JVC. Her natural presence on camera has complimented hosting for major companies such as ACER, Honda, &amp; Rumchata. Believing training never ceases, she is constantly redefining her strengths &amp; craft. She is well rounded in beginning level French, acoustic guitar, quantum physics &amp; the Krav Maga martial arts. She's well versed in psychology, anatomy, &amp; physiology. As an actress, she views an intelligent mind as the creative mind's best companion, &amp; vice versa. Aqueela's journey as an actress has been an inspiring adventure so far. Having recently returned from filming in the UK, you'll see Aqueela as a lead role in Fox Home Entertainment's Wrong Turn 6.  - IMDb Mini Biography",
        "birthday": "1988-12-17",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1300637,
        "imdb_id": "nm5032019",
        "known_for_department": "Acting",
        "name": "Aqueela Zoll",
        "place_of_birth": null,
        "popularity": 0.5513,
        "profile_path": "/cvN1Bg4uEoBzCA03jjyHPtbzkNg.jpg"
    }
}