{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/40Rl5nZRxXQ4kHV4Lhghj5iQZZN.jpg",
                "genre_ids": [
                    53,
                    10749,
                    9648
                ],
                "id": 303,
                "original_language": "en",
                "original_title": "Notorious",
                "overview": "In order to help bring Nazis to justice, U.S. government agent T.R. Devlin recruits Alicia Huberman, the American daughter of a convicted German war criminal, as a spy. As they begin to fall for one another, Alicia is instructed to win the affections of Alexander Sebastian, a Nazi hiding out in Brazil. When Sebastian becomes serious about his relationship with Alicia, the stakes get higher, and Devlin must watch her slip further undercover.",
                "popularity": 3.9227,
                "poster_path": "/4RERYb1NIQrJHYY5e8nUlYM7t2z.jpg",
                "release_date": "1946-08-21",
                "title": "Notorious",
                "video": false,
                "vote_average": 7.742,
                "vote_count": 1664,
                "character": "Horsewoman with Sebastian (uncredited)",
                "credit_id": "56d4891492514157b5007f3d",
                "order": 56
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Lenore Ulrich"
        ],
        "biography": "From Wikipedia\n\nLenore Ulric (July 21, 1892 – December 30, 1970) was a star of the Broadway stage and Hollywood films of the silent-film and early sound era. Her father, Franz Xavier Ulrich, was a United States Army hospital steward. He reportedly named his daughter Lenore due to his fondness for the Edgar Allan Poe poem, \"The Raven\". She later dropped the \"h\" from her surname, using the name Lenore Ulric as her acting name.\n\nShe worked briefly as a film actress for Essanay Studios and joined another stock company in Schenectady, New York. She found work in The First Man (1911), A Polished Burglar (1911), Kilmeny (1915), and The Better Woman (1915). In 1915 she went to work for Pallas Pictures starring in several pictures that survive today at the Library of Congress.\n\nLenore came to Hollywood in 1929 and appeared in Frozen Justice and South Sea Rose. She signed with Fox Film Corporation to make several films with an approximate salary of $650,000. Frozen Justice was directed by Allan Dwan. Some of the scenes were filmed in Alaska. She was successful in a supporting role in Camille, which starred Greta Garbo. Ulric returned to Broadway in 1940, acting in The Fifth Column by Ernest Hemingway and again in 1947, in a revival of Antony and Cleopatra.",
        "birthday": "1892-07-21",
        "deathday": "1970-12-30",
        "gender": 1,
        "homepage": null,
        "id": 130220,
        "imdb_id": "nm0880646",
        "known_for_department": "Acting",
        "name": "Lenore Ulric",
        "place_of_birth": "New Ulm, Minnesota, USA",
        "popularity": 0.5256,
        "profile_path": "/dPahoyLQvMCp6zjrwP7E4wgJIF5.jpg"
    }
}