{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/pzMrxeP9XkKOtQVUBPTq5yk4ck5.jpg",
                "genre_ids": [
                    12,
                    35,
                    18,
                    14
                ],
                "id": 116745,
                "original_language": "en",
                "original_title": "The Secret Life of Walter Mitty",
                "overview": "A timid magazine photo manager who lives life vicariously through daydreams embarks on a true-life adventure when a negative goes missing.",
                "popularity": 6.7989,
                "poster_path": "/tY6ypjKOOtujhxiSwTmvA4OZ5IE.jpg",
                "release_date": "2013-12-18",
                "title": "The Secret Life of Walter Mitty",
                "video": false,
                "vote_average": 7.204,
                "vote_count": 7911,
                "character": "Soccer Playing Sherpa",
                "credit_id": "5ee5a2583ff2df002168511c",
                "order": 59
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Sonam Sherpa"
        ],
        "biography": "Sherpa is the name of Sonam, it is also that of his ethnic group. Because the Sherpas are not only porters, guides as is often believed. They are first of all one of the 105 ethnic groups that populate the foothills of the Nepalese Himalayas, above the town of Lukla, gateway to the Everest trails. It was there, in Pangom, perched at 2,800 meters, that he was born in a stone house, with a wooden shingle roof, without running water or electricity.\n\nAt school, Sonam Sherpa learned to read, write, count and speak Nepali – not just Sherpa anymore. Nothing predestined him for his exceptional career. At 16, after the premature death of his father, he fled Pangom on foot, in hiding from his family. \" I did not have money. Fortunately, a neighbor helped me. I discovered, at that time, that in town everything is paid for! At the beginning, in Kathmandu, he misunderstands everything he sees. He first worked for a trekking agency set up by his older sister, took English, cooking and French lessons, stood on his own two feet, came to France, worked there, found new clients there. Very quickly, Thamserku, his trekking agency, gained momentum, made famous by the organization of expeditions for professional mountaineers. It has become the most important in Nepal, while showing concern for the respect of local populations, their culture and the environment. Working as a family, he also owns lodges and two airlines, Yeti Airlines (16 planes) and Tara Air (55% of the domestic flight market).\n\nThis rise was made despite the tragedies. After the death of his elder brother carried away by an avalanche, after that of his father, Sonam had to face the death of his first wife, Pasang Lhamu, Sherpani like him, with whom he had had three children. To show that Nepalese women could inscribe their name in history and be the equals of men, she had, after several attempts, conquered Everest in the spring of 1993. A storm took her on the way back: she was elevated to the rank of \"light of Nepal\", and children learn her story in schools. First devastated by grief, Sonam Sherpa eventually recovered: his children and his business needed him. Then he remarried Anita, had a fourth child. There is something incredible about this success of a Nepalese peasant son, but it is neither haphazard nor undeserved. Sonam created a foundation that helps the widows of Sherpas, he created a pension fund for porters, a hospital in Lukla, then a kind of social security, he is working to electrify his native village, to install running water... He works in the heart of Nepal where you have to negotiate with the royalists, the Maoists, the conservatives. He sometimes works in the middle of a battlefield that has claimed ten thousand lives in ten years, and has rubbed shoulders with the greats for years: Messner, Lafaille, Escoffier, Kammerlander, Dacher, Habeler, Kaltenbrunner...",
        "birthday": "1961-02-11",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1304681,
        "imdb_id": "nm2877066",
        "known_for_department": "Acting",
        "name": "Lhakpa Sonam Sherpa",
        "place_of_birth": "Namche Bazar, Népal",
        "popularity": 0.0491,
        "profile_path": "/dGOkuoy5g1XD6CxRwHDNL0Wb47F.jpg"
    }
}