{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1HzL603WOer58xtnrRYdSIL5K04.jpg",
                "genre_ids": [
                    35,
                    12
                ],
                "id": 912908,
                "original_language": "en",
                "original_title": "Strays",
                "overview": "When Reggie is abandoned on the mean city streets by his lowlife owner, Doug, Reggie is certain that his beloved owner would never leave him on purpose. But once Reggie falls in with Bug, a fast-talking, foul-mouthed stray who loves his freedom and believes that owners are for suckers, Reggie finally realizes he was in a toxic relationship and begins to see Doug for the heartless sleazeball that he is.",
                "popularity": 4.6015,
                "poster_path": "/n1hqbSCtyBAxaXEl1Dj3ipXJAJG.jpg",
                "release_date": "2023-08-17",
                "title": "Strays",
                "video": false,
                "vote_average": 7.232,
                "vote_count": 932,
                "character": "Finn the Rottweiler (voice)",
                "credit_id": "64df5a18b77d4b11425f9ca3",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/5rwcd24GGltKiqdPT4G2dmchLr9.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 579583,
                "original_language": "en",
                "original_title": "The King of Staten Island",
                "overview": "Scott has been a case of arrested development ever since his firefighter father died when he was seven. He's now reached his mid-20s having achieved little, chasing a dream of becoming a tattoo artist that seems far out of reach. As his ambitious younger sister heads off to college, Scott is still living with his exhausted ER nurse mother and spends his days smoking weed, hanging with the guys — Oscar, Igor and Richie — and secretly hooking up with his childhood friend Kelsey. But when his mother starts dating a loudmouth firefighter named Ray, it sets off a chain of events that will force Scott to grapple with his grief and take his first tentative steps toward moving forward in life.",
                "popularity": 6.276,
                "poster_path": "/zQFjMmE3K9AX5QrBL1SXIxYQ9jz.jpg",
                "release_date": "2020-07-22",
                "title": "The King of Staten Island",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 1067,
                "character": "Firefighter Savage",
                "credit_id": "5d1c575894d8a855393c6db8",
                "order": 29
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "James Tatro",
            "جیمی تاترو"
        ],
        "biography": "James Richard Tatro is an American actor, comedian, writer and YouTube personality. He is the creator and star of the YouTube channel LifeAccordingToJimmy, which has over 3.4 million subscribers and over 728 million video views. Tatro writes, produces and directs each of his video sketches with his friend, Christian A. Pierce.\n\nTatro has appeared in Grown Ups 2, 22 Jump Street, Blue Mountain State: The Rise of Thadland, Boo! A Madea Halloween, and Stuber, as well as the music video for the Lil Dicky song \"Freaky Friday\". He also starred in the first season of the true-crime mockumentary American Vandal as Dylan Maxwell, which garnered him critical acclaim and a Critics Choice Award nomination. From 2021 to 2023, Tatro had a leading role as Connor on the ABC sitcom Home Economics.\n\nDescription above from the Wikipedia article Jimmy Tatro, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1992-02-16",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1304335,
        "imdb_id": "nm5555161",
        "known_for_department": "Acting",
        "name": "Jimmy Tatro",
        "place_of_birth": "California, USA",
        "popularity": 0.7456,
        "profile_path": "/xehT2IK65qXKSctcYChrWLE04pI.jpg"
    }
}