{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/maDBFV1ZpL9eJ2yRMEv4xw0pcwX.jpg",
                "genre_ids": [
                    18,
                    10752
                ],
                "id": 424488,
                "original_language": "en",
                "original_title": "Megan Leavey",
                "overview": "The true story of Marine Corporal Megan Leavey, who forms a powerful bond with an aggressive combat dog, Rex. While deployed in Iraq, the two complete more than 100 missions and save countless lives, until an IED explosion puts their faithfulness to the test.",
                "popularity": 3.808,
                "poster_path": "/yq66hYkXFaj2DDqCkF6T2wT7VxQ.jpg",
                "release_date": "2017-06-09",
                "title": "Megan Leavey",
                "video": false,
                "vote_average": 7.277,
                "vote_count": 802,
                "character": "Barb",
                "credit_id": "59ab682dc3a3682bf001cb9d",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/um7DVcGyLvImgAdn5JGpjIudYSV.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 454652,
                "original_language": "en",
                "original_title": "Colette",
                "overview": "After marrying a successful Parisian writer known commonly as Willy, Sidonie-Gabrielle Colette is transplanted from her childhood home in rural France to the intellectual and artistic splendor of Paris. Soon after, Willy convinces Colette to ghostwrite for him. She pens a semi-autobiographical novel about a witty and brazen country girl named Claudine, sparking a bestseller and a cultural sensation. After its success, Colette and Willy become the talk of Paris and their adventures inspire additional Claudine novels.",
                "popularity": 2.995,
                "poster_path": "/z73Wer1DgObAwWnqZlOyeI33ROY.jpg",
                "release_date": "2018-09-21",
                "title": "Colette",
                "video": false,
                "vote_average": 6.881,
                "vote_count": 923,
                "character": "Meg",
                "credit_id": "5a3bc7c4925141032c22aab8",
                "order": 24
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Shannon Tarbet (born 27 October 1991) is a British actress who has transitioned from an extensive career in theatre to feature film with main roles in Love Is Blind (2019) and Love Sarah (2020), and on television with recurring roles in Genius and in Rellik (2017) and as Amber Peel in Killing Eve (2019).\n\nTarbet was born and lived her early years in Brighton, East Sussex,  and attended Greenfields School in Forest Row. Tarbet studied acting at the K-Bis Theatre School in Brighton. From there, Tarbet was working in telesales attempting to save enough money to apply for drama school, when she successfully auditioned at the Royal Court Theatre, igniting her acting career.\n\nTarbet made her professional stage debut in 2010 as Delilah Evans in the Anya Reiss play Spur of the Moment at the Royal Court Theatre, for which, she was shortlisted for the Evening Standard Outstanding Newcomer in 2010. In 2011, she made a guest appearance in the BBC's Inspector George Gently.  In 2012, she appeared as Jane Clairmont in Helen Edmundson's play, Mary Shelley. The same year, Tarbet played a voice role in Nell Leyshon's radio drama Jess's Story, for Children in need, aired on BBC Radio 4 in November 2012, concerning students with mental health issues.\n\nIn 2013, Tarbet appeared in the short film Woodland and won the best actor award at the Underwire Film Festival. In 2015, Tarbet was nominated for an Offie award for best female for her performance the play, The Edge of our Bodies at the Gate Theatre (London). In 2017, Tarbet starred alongside Geoffrey Rush in the Ron Howard directed Genius. The same year Tarbet played sixteen year-old Hannah Markham in the BBC drama TV series Rellik.\n\nIn 2019, Tarbet starred alongside Matthew Broderick in the dark comedy-drama film Love is Blind.\n\nIn 2020, Tarbet played the leading role of Clarissa in Love Sarah, directed by Eliza Schroeder.\n\nIn 2022, Tarbet starred in an interactive film, the first of its kind in Europe, The Gallery",
        "birthday": "1991-10-27",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.unitedagents.co.uk/shannon-tarbet",
        "id": 1305924,
        "imdb_id": "nm4381014",
        "known_for_department": "Acting",
        "name": "Shannon Tarbet",
        "place_of_birth": "Brighton, England, UK",
        "popularity": 0.4001,
        "profile_path": "/7NkO1KyK2kIxBTqpq5sxIcuMjtk.jpg"
    }
}