{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tb0uo01w2kDHiQwTszsLlSusAm4.jpg",
                "genre_ids": [
                    28,
                    878,
                    27
                ],
                "id": 315011,
                "original_language": "ja",
                "original_title": "シン・ゴジラ",
                "overview": "When a massive, gilled monster emerges from the deep and tears through the city, the government scrambles to save its citizens.  A rag-tag team of volunteers cuts through a web of red tape to uncover the monster's weakness and its mysterious ties to a foreign superpower.  But time is not on their side - the greatest catastrophe to ever befall the world is about to evolve right before their very eyes.",
                "popularity": 7.8766,
                "poster_path": "/jPNShaWZMpVF0iQ7j1dvTuZLD20.jpg",
                "release_date": "2016-07-29",
                "title": "Shin Godzilla",
                "video": false,
                "vote_average": 7.218,
                "vote_count": 1449,
                "character": "Hiromi Ogashira : Ministry of the Environment Nature",
                "credit_id": "570f2de292514102af001c87",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "市川実日子",
            "이치카와 미카코"
        ],
        "biography": "Mikako Ichikawa, a celebrated Japanese actress and model, hails from Tokyo, Japan. Her career began as an exclusive model for \"Olive,\" a Japanese fashion magazine, in 1994. She held this role until 1998, and subsequently graced the pages of several other magazines including \"CUTiE,\" \"Zipper,\" \"Spoon,\" \"Soen,\" and \"GINZA.\" In addition to her modeling career, Ichikawa made her acting debut in the short film \"How to Jujitsu.\"\n\nIchikawa's acting prowess has earned her numerous accolades, including the Best Actress Award at the 24th Moscow International Film Festival in 2003 for her performance in \"Blue.\" More recently, in 2016, she received the Mainichi Film Award for Best Supporting Actress and the 40th Japan Academy Award for Outstanding Supporting Actress for her role in \"Shin Godzilla.\"",
        "birthday": "1978-06-13",
        "deathday": null,
        "gender": 1,
        "homepage": "http://suurkiitos.com/mikako_ichikawa",
        "id": 130654,
        "imdb_id": "nm0406732",
        "known_for_department": "Acting",
        "name": "Mikako Ichikawa",
        "place_of_birth": "Tokyo, Japan",
        "popularity": 1.2474,
        "profile_path": "/w6NoHlcq3OrNqb3Dh0bT1c7fej9.jpg"
    }
}