{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3CcO4QdasRCitq2dczOpx7CXgLM.jpg",
                "genre_ids": [
                    10751,
                    12,
                    18
                ],
                "id": 12837,
                "original_language": "en",
                "original_title": "The Secret Life of Bees",
                "overview": "Set in South Carolina in 1964, this is the tale of Lily Owens a 14 year-old girl who is haunted by the memory of her late mother. To escape her lonely life and troubled relationship with her father, Lily flees with Rosaleen, her caregiver and only friend, to a South Carolina town that holds the secret to her mother's past.",
                "popularity": 4.0251,
                "poster_path": "/m1LGEeoYfc6crbfG8WmTKg9SVqL.jpg",
                "release_date": "2008-09-17",
                "title": "The Secret Life of Bees",
                "video": false,
                "vote_average": 7.478,
                "vote_count": 549,
                "character": "Sheriff Gaston",
                "credit_id": "5f70b1b9e4b5760039e87a2f",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Bill"
        ],
        "biography": "Bill Oberst Jr. is an American actor known for his disturbing onscreen presence, often playing dark and conflicted characters on film and television. \n\nOberst is a veteran stage actor who came to Hollywood in 2008 and quickly began to be cast in horror and thriller films. Notable exceptions were the 2011 Hallmark Channel TV-movie THE SHUNNING and its 2012 sequel THE CONFESSION (in which director Michael Landon Jr. cast Oberst in the film's male lead role of an Amish farmer) and an award-winning turn as General William Tecumseh Sherman in the History Channel's docudrama SHERMAN'S MARCH. Oberst has also toured theatrically in a first-person stage recreation of the teachings of Jesus Of Nazareth and in a string of one-man shows whose subjects included President John F. Kennedy, Mark Twain and humorist Lewis Grizzard. He remains best known as a horror genre actor, however.\n\nBill Oberst Jr.'s trademark piercing star and rough-hewn face have led him to be cast as monsters, murderers, vampires and cannibals, often in minimal wardrobe. His oddly shaped torso and partially-exposed ribcage are almost as recognizable to genre fans as his face. Oberst is often quoted as saying that he believes the human body's capacity to disturb on film is just as strong as its capacity to entice. In 2011, Oberst was seen by over 60 million internet viewers worldwide as the cyber stalker in the Facebook application TAKE THIS LOLLIPOP, (http://www.takethislollipop.com) which broke records to become the fastest-growing application in Facebook history and the most popular horror-themed application in internet history. \n\nIn person, his quiet demeanor and interest in things spiritual seem sharply at odds with the roles he plays. A native Southerner, Oberst is a fulltime actor living in Los Angeles. \n\nFrom Wikipedia, the free encyclopedia",
        "birthday": "1965-11-21",
        "deathday": null,
        "gender": 2,
        "homepage": "http://billoberst.com",
        "id": 130768,
        "imdb_id": "nm2454994",
        "known_for_department": "Acting",
        "name": "Bill Oberst Jr.",
        "place_of_birth": "South Carolina, USA",
        "popularity": 0.1124,
        "profile_path": "/m8XSyHqKGxOWXZaLpyapFfu2PJx.jpg"
    }
}