{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6van4BavoNXaZhCPdzLHNQ4Uc8H.jpg",
                "genre_ids": [
                    53,
                    28
                ],
                "id": 1087891,
                "original_language": "en",
                "original_title": "The Amateur",
                "overview": "After his life is turned upside down when his wife is killed in a London terrorist attack, a brilliant but introverted CIA decoder takes matters into his own hands when his supervisors refuse to take action.",
                "popularity": 23.6517,
                "poster_path": "/SNEoUInCa5fAgwuEBMIMBGvkkh.jpg",
                "release_date": "2025-04-09",
                "title": "The Amateur",
                "video": false,
                "vote_average": 6.984,
                "vote_count": 1196,
                "character": "Federal Official",
                "credit_id": "67e5fa6fa6dd9b0808005fd1",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Lanna Joffrey is an Iranian actress, writer, and spoken word performer who has established herself as a versatile artist working across theater, film, and literary performance in both the United States and United Kingdom. Originating from Iran, Joffrey pursued her higher education at Syracuse University, where she graduated in 2000, before furthering her training in acting at the prestigious Royal Central School of Speech and Drama in London, where she received her MA in Acting with Distinction. Her educational journey between American and British institutions provided her with a unique trans-Atlantic perspective that would later influence her professional work and distinctive vocal qualities. Following her formal training, Joffrey established herself in London, where she has built a multifaceted career that spans traditional acting, innovative theatrical projects, and spoken word poetry.\n\nHer professional development has been marked by notable collaborations with respected theater companies and venues, including performances at Shakespeare's Globe Theatre in productions such as Muse of Fire and Sonnet Walks, as well as work at The Factory at The Willow Globe in Timon of Athens. Beyond traditional theater, Joffrey has distinguished herself as a creator of original works, most notably through her critically acclaimed verbatim docudrama Valiant, which has toured throughout both the UK and US. This project exemplifies her commitment to using performance as a vehicle for meaningful storytelling and social commentary. Her artistic practice extends into film and television, with screen credits that include The Amateur (2025), Fishing Naked (2015), and The Murder Plans (2011), demonstrating her versatility across mediums.\n\nAs a spoken word performer and writer, Joffrey has contributed to literary publications and online platforms, with her spoken word work being published in both print and digital formats. Her artistic identity is deeply connected to her Iranian heritage and her experience as a performer working between cultures, which informs both her creative output and her professional philosophy. Recognized as an award-winning artist, Joffrey has also expanded her professional repertoire to include voice work and coaching, utilizing her trans-Atlantic accent and authoritative voice quality in various audio projects. Her continued residence in London positions her at the center of both British and international theater communities, where she maintains active involvement in contemporary dramatic works and experimental performance projects that bridge her background in classical training with modern storytelling approaches.",
        "birthday": "1977-09-09",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.lannajoffrey.com/",
        "id": 1308199,
        "imdb_id": "nm1371045",
        "known_for_department": "Acting",
        "name": "Lanna Joffrey",
        "place_of_birth": "Teheran, Iran",
        "popularity": 2.2647,
        "profile_path": "/19tE0fB29r3jSIlCDa78P4MPytn.jpg"
    }
}