{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wNk223rTAxXlwdBeyVs0WdMPyX2.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 192136,
                "original_language": "en",
                "original_title": "Mandela: Long Walk to Freedom",
                "overview": "A chronicle of Nelson Mandela's life journey from his childhood in a rural village through to his inauguration as the first democratically elected president of South Africa.",
                "popularity": 0.9262,
                "poster_path": "/nzjwDSwLbalv7bCXnFbkAuIxXLx.jpg",
                "release_date": "2013-11-28",
                "title": "Mandela: Long Walk to Freedom",
                "video": false,
                "vote_average": 6.885,
                "vote_count": 551,
                "character": "Militant Prisoner",
                "credit_id": "6837588b73fc3a0939b6c677",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Presley Chweneyagae (October 19, 1984 — May 27, 2025) was a South African actor best known for his breakthrough lead role in Tsotsi (2005).\n\nChweneyagae went into acting at an early age, taking acting classes from the age of 10. His first major role proved to be a history-making one, securing the part of David, aka Tsotsi, in Gavin Hood’s searing 2005 crime drama Tsotsi. In the film, set in a Johannesburg township, Chweneyagae plays a small-time hoodlum who steals a car, only to discover a baby in the back seat that causes him to change his ways.\n\nTsotsi was a huge hit with critics, with praise especially for Chweneyagae’s performance. The film was nominated for a Golden Globe and an Academy Award for best foreign language film, becoming the first South African film to win an Oscar. The success of Tsotsi secured Chweneyagae's place as one of the best known South African actors.\n\nAs well as features, Chweneyagae’s found great success on domestic television, and was arguably better known in South Africa for his lead role in the popular telenovela The River (2028–24). In the Pretoria-set show, which takes place in the diamond mining industry, Chweneyagae’s scheming, villainous and charismatic Thuso ‘Cobra’ Mokoena became a fan favorite, and he received his own spin-off series, Cobrizi. The River won Chweneyagae a South African Film and Television Award in 2019, and helped Chweneyagae become a streaming star outside South Africa as the series became popular in other parts of Africa.\n\nAs well as film and TV, Chweneyagae was deeply involved in theater, boasting extensive credits and starring in several Shakespeare productions. Chweneyagae also wrote and directed plays. He co-wrote, with Paul Grootboom, the acclaimed stage play Relativity and directed the award-winning production CELL NO 4.\n\nChweneyagae died from natural causes on May 27, 2025, at the age of 40.",
        "birthday": "1984-10-19",
        "deathday": "2025-05-27",
        "gender": 2,
        "homepage": null,
        "id": 13091,
        "imdb_id": "nm1970113",
        "known_for_department": "Acting",
        "name": "Presley Chweneyagae",
        "place_of_birth": "Soweto, Transvaal, South Africa",
        "popularity": 0.834,
        "profile_path": "/gG2Vqcn1yFXZE5sNCfJcN81Xp4I.jpg"
    }
}