{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9guoVF7zayiiUq5ulKQpt375VIy.jpg",
                "genre_ids": [
                    16,
                    28,
                    14,
                    12
                ],
                "id": 592350,
                "original_language": "ja",
                "original_title": "僕のヒーローアカデミア THE MOVIE ヒーローズ：ライジング",
                "overview": "Class 1-A visits Nabu Island where they finally get to do some real hero work. The place is so peaceful that it's more like a vacation... until they're attacked by a villain with an unfathomable Quirk! His power is eerily familiar, and it looks like Shigaraki had a hand in the plan. But with All Might retired and citizens' lives on the line, there's no time for questions. Deku and his friends are the next generation of heroes, and they're the island's only hope.",
                "popularity": 4.0235,
                "poster_path": "/kpWsIkfXrnQ1pmR79qAHHq7DPxc.jpg",
                "release_date": "2019-12-20",
                "title": "My Hero Academia: Heroes Rising",
                "video": false,
                "vote_average": 8.2,
                "vote_count": 1226,
                "character": "Mahoro (voice)",
                "credit_id": "5e1b48f16c19ea001592b759",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Kurosawa Tomoyo",
            "黒沢 ともよ",
            "くろさわ ともよ",
            "U149",
            "تومویو کوروساوا"
        ],
        "biography": "Tomoyo Kurosawa (黒沢 ともよ, born April 10, 1996) is a Japanese actress, voice actress and singer from Chichibu, Saitama who is affiliated with Toho Entertainment. Her major voice acting roles in anime are in Yuki Yuna Is a Hero as Itsuki Inubozaki, Sound! Euphonium as Kumiko Oumae and Land of the Lustrous as Phosphophyllite.\n\nKurosawa began studying acting at the age of 3. In 2000, she began appearing in TV dramas, commercials and stage performances.\n\nKurosawa became a support member of Sound Horizon in 2008, appearing in their sixth CD story \"Moira\" that same year, and in Sound Horizon's seventh CD story \"Märchen\", released in 2010. Kurosawa made her voice acting debut as Natsuki Koyama in the 2010 anime film Welcome to the Space Show. In 2012, she moved from Space Craft to Mausu Promotion.\n\nOn March 3, 2018, she won the 12th Seiyu Awards Best Actress in a Leading Role.\n\nShe graduated from Hosei University in 2019. On August 1, 2021, she announced her transfer from Mausu Promotion to Toho Entertainment.\n\nSource: Wikipedia",
        "birthday": "1996-04-10",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.toho-ent.co.jp/actor/42200",
        "id": 1309253,
        "imdb_id": "nm3961240",
        "known_for_department": "Acting",
        "name": "Tomoyo Kurosawa",
        "place_of_birth": "Saitama, Japan",
        "popularity": 1.5667,
        "profile_path": "/eSRnva88YVcUXlDHdVrhier2SGU.jpg"
    }
}