{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3YDuN1mhQpYtCym4QatX0gkHahL.jpg",
                "genre_ids": [
                    10751,
                    18
                ],
                "id": 404378,
                "original_language": "en",
                "original_title": "A Street Cat Named Bob",
                "overview": "James Bowen, a homeless busker and recovering drug addict, has his life transformed when he meets a stray ginger cat.",
                "popularity": 10.2153,
                "poster_path": "/nBYG0D2FcbL1m926sIj7RN4m0sb.jpg",
                "release_date": "2016-11-04",
                "title": "A Street Cat Named Bob",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 1495,
                "character": "Val",
                "credit_id": "57758d2dc3a3686f9f00038e",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/iGm4RpRv5zEsdUPGZRems4KYFgg.jpg",
                "genre_ids": [
                    10749,
                    18
                ],
                "id": 332283,
                "original_language": "en",
                "original_title": "Mary Shelley",
                "overview": "The love affair between poet Percy Shelley and Mary Wollstonecraft Godwin resulted in the creation of an immortal novel, “Frankenstein; or, The Modern Prometheus.”",
                "popularity": 4.3562,
                "poster_path": "/gKHJTsrfxJtfFNPQJn2hDNEMtFf.jpg",
                "release_date": "2017-08-06",
                "title": "Mary Shelley",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 1019,
                "character": "Mary Jane Clairmont",
                "credit_id": "57ccc2e3c3a36830a5005fa0",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/lgQQ6n1vPw40buW7QGc1DxDzQS9.jpg",
                "genre_ids": [
                    18,
                    10749,
                    36
                ],
                "id": 535544,
                "original_language": "en",
                "original_title": "Downton Abbey",
                "overview": "The beloved Crawleys and their intrepid staff prepare for the most important moment of their lives. A royal visit from the King and Queen of England will unleash scandal, romance and intrigue that will leave the future of Downton hanging in the balance.",
                "popularity": 5.2434,
                "poster_path": "/pWt1iRuhNpeVDNP2QiUT2C5OiBt.jpg",
                "release_date": "2019-09-12",
                "title": "Downton Abbey",
                "video": false,
                "vote_average": 7.152,
                "vote_count": 1193,
                "character": "Anna Bates",
                "credit_id": "5b48ba07c3a3684533008333",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/nBHKT3pm5DmidZd5VS4bD5Hc2S3.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 820446,
                "original_language": "en",
                "original_title": "Downton Abbey: A New Era",
                "overview": "The Crawley family goes on a grand journey to the south of France to uncover the mystery of the dowager countess's newly inherited villa. Meanwhile, a Hollywood director seeks to film his latest production at Downton.",
                "popularity": 8.4976,
                "poster_path": "/r5n4CLoIjUcnT3shWDi6MHdJ25a.jpg",
                "release_date": "2022-04-27",
                "title": "Downton Abbey: A New Era",
                "video": false,
                "vote_average": 7.236,
                "vote_count": 540,
                "character": "Anna Bates",
                "credit_id": "607da2ba43d9b10029076949",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Джоанн Фроггатт",
            "جوآن فروگات"
        ],
        "biography": "Joanne Froggatt is a British actress. From 2010 to 2015, she portrayed Anna Bates in the ITV period drama series Downton Abbey, for which she received three Emmy nominations and won the 2014 Golden Globe Award for Best Supporting Actress. From 2017 to 2020, she starred as Laura Nielson in the ITV/Sundance drama series Liar.\n\nFroggatt rose to prominence with her portrayal of Zoe Tattersall on the soap opera Coronation Street (1997–1998). She played Ruth Tyler, Sam Tyler's mother in original UK version of the fantasy police drama Life on Mars (British TV series) (2006). She went on to star in the television films Danielle Cable: Eyewitness (2003), See No Evil: The Moors Murders (2006), and Murder in the Outback (2007), before winning the British Independent Film Award for Most Promising Newcomer for her leading role in In Our Name (2010). Other film credits include Filth (2013), A Street Cat Named Bob (2016), Mary Shelley (2017), and Downton Abbey (2019).\n\nFroggatt was born and brought up in the village of Littlebeck in North Yorkshire. Her parents, Ann and Keith Froggatt, having run a corner shop, next started a rare-breed sheep farm on a smallholding near Whitby. Froggatt has likened her childhood setting to the backdrop of Emily Brontë's classic novel Wuthering Heights. Froggatt initially joined a drama group in Scarborough, and then left her family home at the age of 13 to attend the Redroofs Theatre School in Maidenhead, Berkshire.\n\nIn 1996, Froggatt made her TV debut in the long-running ITV drama The Bill, and shortly afterwards landed the role of teenage mother Zoe Tattersall in Coronation Street. She left the programme in 1998, when her character was written out. In 1999, she appeared in the first four episodes of the first series of prison drama Bad Girls, portraying teenage mother Rachel Hicks.\n\nIn 2003, Froggatt played the leading role in the controversial one-off drama Danielle Cable: Eyewitness, based on the true story of a teenage girl who witnessed the murder of her boyfriend in a reputed road rage attack. While researching the role, she met Cable, who later contacted her to commend her on her portrayal. The film earned a BAFTA TV Award nomination for Best Single Drama.\n\nIn 2022, she starred in Last Light, an apocalyptic thriller TV series on Peacock.",
        "birthday": "1980-08-23",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.conwayvangeldergrant.com/actors/joanne-froggatt/",
        "id": 130977,
        "imdb_id": "nm0296219",
        "known_for_department": "Acting",
        "name": "Joanne Froggatt",
        "place_of_birth": "Littlebeck, North Yorkshire, England, UK",
        "popularity": 1.572,
        "profile_path": "/vT9YPjgqJ2CRAkhvsbZlI0i5h4M.jpg"
    }
}