{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1GU0jS5ZG5MhfdDrpj8s9XxbgJJ.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 505642,
                "original_language": "en",
                "original_title": "Black Panther: Wakanda Forever",
                "overview": "Queen Ramonda, Shuri, M’Baku, Okoye and the Dora Milaje fight to protect their nation from intervening world powers in the wake of King T’Challa’s death.  As the Wakandans strive to embrace their next chapter, the heroes must band together with the help of War Dog Nakia and Everett Ross and forge a new path for the kingdom of Wakanda.",
                "popularity": 13.3307,
                "poster_path": "/sv1xJUazXeYqALzczSZ3O6nkH75.jpg",
                "release_date": "2022-11-09",
                "title": "Black Panther: Wakanda Forever",
                "video": false,
                "vote_average": 7.036,
                "vote_count": 7020,
                "character": "Griot (voice)",
                "credit_id": "636c38cdf14dad00f2737d57",
                "order": 20
            },
            {
                "adult": false,
                "backdrop_path": "/b6ZJZHUdMEFECvGiDpJjlfUWela.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 284054,
                "original_language": "en",
                "original_title": "Black Panther",
                "overview": "King T'Challa returns home to the reclusive, technologically advanced African nation of Wakanda to serve as his country's new leader. However, T'Challa soon finds that he is challenged for the throne by factions within his own country as well as without. Using powers reserved to Wakandan kings, T'Challa assumes the Black Panther mantle to join with ex-girlfriend Nakia, the queen-mother, his princess-kid sister, members of the Dora Milaje (the Wakandan 'special forces') and an American secret agent, to prevent Wakanda from being dragged into a world war.",
                "popularity": 10.6294,
                "poster_path": "/uxzzxijgPIY7slzFvMotPv8wjKA.jpg",
                "release_date": "2018-02-13",
                "title": "Black Panther",
                "video": false,
                "vote_average": 7.369,
                "vote_count": 22817,
                "character": "Griot (voice)",
                "credit_id": "5b0af817c3a3684b280078c7",
                "order": 63
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "تريفور نواه",
            "ট্রেভর নোয়া",
            "ترور نوآ",
            "טרוור נואה",
            "トレバー・ノア",
            "Ной, Тревор",
            "Тревор Ноа",
            "特雷弗·諾亞",
            "Τρέβορ Νόα"
        ],
        "biography": "​Trevor Noah is a South African actor, presenter, comedian and radio DJ who began his career with a cameo role on the SABC3 soapie Isidingo, in 2002.  After his stint on the show he spent two years years hosting an educational show for SABC2 during which time he started hosting his own radio show on Yfm called Noah's Ark.  At Yfm his show was called Trevor Noah and was on between 00h00 and 03h00. He is also very involved in the South African comedy circuit and has performed at various comedy festivals.  On television he hosted the SABC1 celebrity gossip show The Real Goboza in 2007 and also hosted SABC's sports show Siyadlala.  In 2008 he was the runner-up on SABC2's reality dance competition Strictly Come Dancing 4, losing to actor Emmanuel Castis in the grand finale. His professional dance partner was Hayley Hammond.  From May to August 2008 he was the co-host (with Pabi Moloi) of the SABC1 interactive dating game show The Amazing Date.  He hosted the 3rd annual SAFTA Awards at the State Theatre in Pretoria on Saturday 7 February, 2009.  Trevor was the host (along with Eugene Khoza) of the e.tv reality competition series The AXE Sweet Life from March to May, 2009.  He hosted the 15th annual South African Music Awards (SAMAs) at the Sun City Superbowl on 2 May, 2009. He was invited back to host the SAMAs in 2010.  Trevor began hosting his own talk show on M-Net in August 2010, entitled Tonight with Trevor Noah, based on international shows such as The Tonight Show with Jay Leno, The Late Show with Conan O'Brien and satirical fare like The Daily Show with Jon Stewart.  The show moved to DStv's Mzansi Magic channel for it second season, which premiered on 5 November, 2010",
        "birthday": "1984-02-20",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.trevornoah.co.za",
        "id": 131133,
        "imdb_id": "nm3696388",
        "known_for_department": "Acting",
        "name": "Trevor Noah",
        "place_of_birth": "Johannesburg, South Africa",
        "popularity": 0.6556,
        "profile_path": "/aieKi9QnuEjBV2j46UR4NIIqa0K.jpg"
    }
}