{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/pR3v192B20nFtsHY1jZQS4AkN0a.jpg",
                "genre_ids": [
                    36,
                    53
                ],
                "id": 11973,
                "original_language": "en",
                "original_title": "Thirteen Days",
                "overview": "The story of the Cuban Missile Crisis in 1962—the nuclear standoff with the USSR sparked by the discovery by the Americans of missile bases established on the Soviet-allied island of Cuba.",
                "popularity": 5.329,
                "poster_path": "/aLx9UXH9fK2v6NDMvMyW4X88K3u.jpg",
                "release_date": "2000-12-25",
                "title": "Thirteen Days",
                "video": false,
                "vote_average": 7.002,
                "vote_count": 787,
                "character": "RF-8 Pilot",
                "credit_id": "5f4bd5aaeec4f30037d453f3",
                "order": 44
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ben Koldyke"
        ],
        "biography": "Benjamin Koldyke (born March 27, 1968) is an American actor. He is best known for playing Don Frank on How I Met Your Mother (2009–2010), Lee Standish in Work It (2012), and Greg Gibbon on Gortimer Gibbon's Life On Normal Street (2014–2016).\n\nKoldyke was born in Chicago, Illinois, and grew up in nearby Kenilworth. His father, Martin J. \"Mike\" Koldyke, is a former investment banker who founded Frontenac Company in Chicago and is a life trustee of Northwestern University; through his mother, Patricia Blunt Koldyke, he is a member of the family that controls Laird Norton Company, an investment company with roots in the timber industry of the Pacific Northwest.\n\nAfter graduating from high school, he did a post-graduate year at Choate Rosemary Hall. He graduated in 1991 from Dartmouth College, where he earned a bachelor's degree in English and was a quarterback for the football team.\n\nKoldyke worked as a high school English teacher and football coach in Chicago. His acting career received a jump start after a chance encounter with It's Always Sunny in Philadelphia creator-star, Rob McElhenney. Regulars at the same Venice cafe, he covered Rob's tab with a note that said he \"thought his show was fantastic,\" and this exchange led to Koldyke's first TV pilot, Boldly Going Nowhere for Fox, a few years later.\n\nAfter Boldly was not picked up, Koldyke went on to recur as Dale Tomasson in the HBO series Big Love and as Don Frank in How I Met Your Mother for CBS. n 2012, Koldyke starred as the lead character in the short-lived ABC comedy series Work It and later guest starred in HBO's The Newsroom 2013 saw him star in another ABC sitcom, Back in the Game, opposite James Caan and Maggie Lawson. He had a significant arc on Showtime's Masters of Sex as teacher and football coach Paul Edley, and played male chauvinist Brent throughout the final season of The Good Place. In 2021 he had a recurring role on season 1 of Peacock sitcom Rutherford Falls\n\nKoldyke was seen on the big screen in 2016 in a supporting role for Disney's The Finest Hours alongside Chris Pine, Casey Affleck, Eric Bana, and Ben Foster.",
        "birthday": "1968-03-27",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 13138,
        "imdb_id": "nm0463993",
        "known_for_department": "Acting",
        "name": "Benjamin Koldyke",
        "place_of_birth": "Chicago, Illinois, USA",
        "popularity": 0.6619,
        "profile_path": "/eTJs8eQIBhOpTFL5Wcdgb7FNzhi.jpg"
    }
}