{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dS8AcMrQfC1PQA7njdFECCPkMvd.jpg",
                "genre_ids": [
                    16,
                    878
                ],
                "id": 16306,
                "original_language": "fr",
                "original_title": "La Planète sauvage",
                "overview": "On the planet Ygam, the Draags, extremely technologically and spiritually advanced blue humanoids, consider the tiny Oms, human beings descendants of Terra's inhabitants, as ignorant animals. Those who live in slavery are treated as simple pets and used to entertain Draag children; those who live hidden in the hostile wilderness of the planet are periodically hunted and ruthlessly slaughtered as if they were vermin.",
                "popularity": 1.6022,
                "poster_path": "/prq0j1S0K07UjwLZLF6oMGflRUI.jpg",
                "release_date": "1973-12-01",
                "title": "Fantastic Planet",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 1021,
                "character": "Master Taj (voice)",
                "credit_id": "52fe46c39251416c75082aad",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/lyQSifurKvWmqWzouVe50JFoI35.jpg",
                "genre_ids": [
                    10751,
                    16,
                    35,
                    12
                ],
                "id": 9385,
                "original_language": "fr",
                "original_title": "Les 12 travaux d'Astérix",
                "overview": "Asterix and Obelix depart on an adventure to complete twelve impossible tasks to prove to Caesar that they are as strong as the Gods. You'll roar with laughter as they outwit, outrun, and generally outrage the very people who are trying to prove them \"only human\".",
                "popularity": 3.2826,
                "poster_path": "/7cZQZOYZFJcLjZnxWjO5PcUtmDZ.jpg",
                "release_date": "1976-06-26",
                "title": "The Twelve Tasks of Asterix",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1294,
                "character": "Vénérable du sommet (voice)",
                "credit_id": "5d0e93040e0a263dddcf2571",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/f72GEQF2lKsdmEULSI9bWCbQylH.jpg",
                "genre_ids": [
                    18,
                    53,
                    80
                ],
                "id": 29259,
                "original_language": "fr",
                "original_title": "Le Trou",
                "overview": "Four prison inmates have been hatching a plan to literally dig out of jail when another prisoner, Claude Gaspard, is moved into their cell. They take a risk and share their plan with the newcomer. Over the course of three days, the prisoners and friends break through the concrete floor using a bed post and begin to make their way through the sewer system -- yet their escape is anything but assured.",
                "popularity": 3.8355,
                "poster_path": "/xyZhiOz5NHVBUKlpioxjwajy7pm.jpg",
                "release_date": "1960-03-18",
                "title": "Le Trou",
                "video": false,
                "vote_average": 8.249,
                "vote_count": 520,
                "character": "Le détenu à l'infirmerie",
                "credit_id": "5e1e72355c071b001162ed11",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Gerard Hernandez",
            "Gérard Hernández",
            "Julio Gerardo Hernández"
        ],
        "biography": "Julio Gerardo \"Gérard\" Hernandez (born 20 January 1933) is a Spanish-French actor.\n\nHernandez was born in Valladolid, Spain and was naturalized French only in 1975. He is mostly famous for his mustache and for having voiced several live-action/cartoon characters, including Gonzo in the French dubbed version of The Muppet Show, Professor Moriarty in the French dubbed version of Sherlock Hound, Papa Smurf and Grouchy Smurf in the French dubbed version of The Smurfs (1981) and the film of the same name.\n\nIn films, he only had supporting roles. He is famous for his collaboration with Jean-Pierre Marielle and Philippe Noiret in the French film Coup de Torchon (1981) directed by Bertrand Tavernier.\n\nHe was famous on television in the 1970s and 1980s, where he was a regular guest in game shows like Les Jeux de 20 heures on FR3 and L'Académie des neuf on Antenne 2. He also hosted the game show Les Affaires sont les Affaires on Canal+ in the mid-1980s.\n\nHe has also voiced Franz Sanchez (Robert Davi) in the French dubbed version of James Bond film Licence to Kill (1989).\n\nHe portrays the regular role of Commissaire Perret in the French TV series Père et Maire from 2002 to 2009. He plays Raymond in the sitcom Scènes de Ménages since 2009 on M6.\n\n Source: Article \"Gérard Hernandez\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1933-01-20",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 131380,
        "imdb_id": "nm0379587",
        "known_for_department": "Acting",
        "name": "Gérard Hernandez",
        "place_of_birth": "Valladolid, Castilla y León, Spain",
        "popularity": 0.1274,
        "profile_path": "/uTFlCgZva7PMNCIRHnbTvJKbXKb.jpg"
    }
}