{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lYfHa1AtkUMtplrKx7SRLHpwonW.jpg",
                "genre_ids": [
                    12,
                    14,
                    27
                ],
                "id": 244,
                "original_language": "en",
                "original_title": "King Kong",
                "overview": "Adventurous filmmaker Carl Denham sets out to produce a motion picture unlike anything the world has seen before. Alongside his leading lady Ann Darrow and his first mate Jack Driscoll, they arrive on an island and discover a legendary creature said to be neither beast nor man. Denham captures the monster to be displayed on Broadway as King Kong, the eighth wonder of the world.",
                "popularity": 3.0442,
                "poster_path": "/lHlnxKL5GbgRibyRFI7n1Ey850i.jpg",
                "release_date": "1933-03-15",
                "title": "King Kong",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 1544,
                "character": "Warrior (uncredited)",
                "credit_id": "66bc35238cac19d05ac34e9f",
                "order": 36
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ernest A. Conley ",
            "Onest Conly"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nBorn in Evanston, Illinois, his mother was the pioneering African-American film actress Madame Sul-Te-Wan (née Nellie Crawford) and his father was Robert Reed Conley. He had two brothers; Odel and Otto. His father abandoned the family shortly after Conley's birth, leaving his actress mother to raise the three boys. Like his mother, Onest Conley gravitated toward the acting profession and began taking bit parts in films. His first film appearance was a minor role in the 1926 Frank Borzage-directed The Dixie Merchant, a film adaptation of the Barry Benefield novel The Chicken-Wagon Family. The film starred Jack Mulhall and Madge Bellamy.\n\nDespite limitations for African-American actors within the film industry during the 1920s and 1930s, Onest Conley appeared in films during the era, often typecast in stereotypical roles as \"natives\" and \"shoeshine boys\". Conley appeared alongside his brother Odel as \"warriors\" in the 1933 box-office hit King Kong, in which their mother also appeared in an uncredited role as a \"native handmaiden\". Conley also appeared alongside his mother in the 1930 Richard Thorpe-directed film The Thoroughbred as the character Ham Tolliver.\n\nHis most recognizable roles include George Harris in the 1933 Cecil B. DeMille-directed crime-drama This Day and Age, Neptune in the 1935 John S. Robertson-directed romantic drama Grand Old Girl and Mose in the 1935 Sam Newfield-directed adventure film Racing Luck.\n\nBy the early 1940s, however, Conley's career faltered and he received fewer and fewer roles. His last appearance as an actor was on an episode of the 1950s television series Soldiers of Fortune as a \"voodoo drummer\".",
        "birthday": "1906-12-25",
        "deathday": "1989-10-08",
        "gender": 2,
        "homepage": null,
        "id": 1313142,
        "imdb_id": "nm0174796",
        "known_for_department": "Acting",
        "name": "Onest Conley",
        "place_of_birth": "Evanston, Illinois, USA",
        "popularity": 1.0515,
        "profile_path": "/zdaIcoTJ1DaUTGl4BmrVvwkgvaw.jpg"
    }
}