{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2Fk3AB8E9dYIBc2ywJkxk8BTyhc.jpg",
                "genre_ids": [
                    878,
                    53,
                    28
                ],
                "id": 524047,
                "original_language": "en",
                "original_title": "Greenland",
                "overview": "John Garrity, his estranged wife and their young son embark on a perilous journey to find sanctuary as a planet-killing comet hurtles toward Earth. Amid terrifying accounts of cities getting levelled, the Garritys experience the best and worst in humanity. As the countdown to the global apocalypse approaches zero, their incredible trek culminates in a desperate and last-minute flight to a possible safe haven.",
                "popularity": 9.6553,
                "poster_path": "/bNo2mcvSwIvnx8K6y1euAc1TLVq.jpg",
                "release_date": "2020-07-29",
                "title": "Greenland",
                "video": false,
                "vote_average": 7.126,
                "vote_count": 4773,
                "character": "Dr. Byrd",
                "credit_id": "5ef4df7dc3bffe00346e3ec3",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            " 마이크 가사웨이 "
        ],
        "biography": "    ​Mike Gassaway was one of Oklahoma's most successful and famous Attorneys and represented Governors, Congressmen, Doctors, Lawyers and others charged with high profile crimes. He obtained more million dollar verdicts against Police forces for Civil Rights violations than any other Lawyer in Oklahoma history, resulting in Rosa Parks selecting him for the National Civil Rights \"Wall of Tolerance\". He was a Golden Gloves Boxing Champion, was a factory race car driver for Porsche in the World Endurance Racing Championships and has held two World Land Speed Records on motorcycles.     He retired to Austin, Texas and began working as an actor appearing in films by Oliver Stone, Robert Rodriquez and many other prominent Directors. He is represented by Acclaim Talent in Austin.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 131421,
        "imdb_id": "nm1096816",
        "known_for_department": "Acting",
        "name": "Mike Gassaway",
        "place_of_birth": null,
        "popularity": 2.1355,
        "profile_path": "/xkalRZmZbwhzYwbkmkgP2RW1vok.jpg"
    }
}