{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/w2uGvCpMtvRqZg6waC1hvLyZoJa.jpg",
                "genre_ids": [
                    10749,
                    18
                ],
                "id": 696374,
                "original_language": "en",
                "original_title": "Gabriel's Inferno",
                "overview": "An intriguing and sinful exploration of seduction, forbidden love, and redemption, Gabriel's Inferno is a captivating and wildly passionate tale of one man's escape from his own personal hell as he tries to earn the impossible--forgiveness and love.",
                "popularity": 3.0904,
                "poster_path": "/oyG9TL7FcRP4EZ9Vid6uKzwdndz.jpg",
                "release_date": "2020-05-29",
                "title": "Gabriel's Inferno",
                "video": false,
                "vote_average": 8.408,
                "vote_count": 2432,
                "character": "Dr. Ling",
                "credit_id": "67fc019ea04f530b5c9998f7",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Vanessa Kwong"
        ],
        "biography": "VANESSA KAI is best known for her work in CW's hit series \"Kung Fu\".\n\nMost recently, you can find Vanessa in a recurring role as Gisela Mott on \"Elsbeth\" starring Carrie Preston on CBS.  In theater, Vanessa Kai was nominated for a Lucille Lortel Award for Outstanding Featured Actress in a Musical for her performance as \"Ruby\" in the world premiere of \"KPOP,\" an Off-Broadway, immersive musical event produced by Ars Nova. Other notable credits include the world premieres of \"The Pain of My Belligerence\" at Playwrights Horizons, \"Somebody's Daughter\" at Second Stage and \"The Architecture of Becoming\" at New York's City Center.\n\nVanessa's breakthrough role came in 2020 when she was cast as Pei-Ling Zhang in CW's hit series \"Kung Fu\", produced by Warner Bros. Her powerful portrayal of the mysterious and wise mentor to the show's protagonist, Nicky Shen (Olivia Liang), has been praised for its depth and nuance that quickly made her a fan favorite.\n\nBefore \"Kung Fu\", Vanessa appeared in a number of other television series and films, including \"New Amsterdam\", \"Orange Is the New Black\", \"The Mysteries of Laura\", \"The Blacklist\", \"Law & Order: Special Victims Unit\", and \"Madam Secretary\".\n\nA champion of new works Kai is much sought after for her collaborative spirit and her love of world building, and has helped to develop new plays at New York Stage & Film, Public Theater, SoHo Rep., Roundabout Theater Company, Manhattan Theatre Club, Steppenwolf Theatre, Eugene O’Neill Theatre, Two River Theater, The New Group, The Lark Play Development Center, Baltimore Center Stage, Playwrights Realm, New Dramatists, and many others.\n\nVanessa is a native New Yorker and a first generation Chinese American.",
        "birthday": "1982-09-18",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.vanessakai.com/media",
        "id": 1314554,
        "imdb_id": "nm2872286",
        "known_for_department": "Acting",
        "name": "Vanessa Kai",
        "place_of_birth": "Brooklyn, New York, U.S.",
        "popularity": 0.1076,
        "profile_path": "/dhOphvlGOJKwh8jfg33QlmXbc44.jpg"
    }
}