{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jVzoKlWUpsKV3y5oLafLQhEvgX6.jpg",
                "genre_ids": [
                    14,
                    18,
                    9648
                ],
                "id": 5961,
                "original_language": "sv",
                "original_title": "Fanny och Alexander",
                "overview": "As children in the loving Ekdahl family, Fanny and Alexander enjoy a happy life with their parents, who run a theater company. After their father dies unexpectedly, however, the siblings end up in a joyless home when their mother, Emilie, marries a stern bishop. The bleak situation gradually grows worse as the bishop becomes more controlling, but dedicated relatives make a valiant attempt to aid Emilie, Fanny and Alexander.",
                "popularity": 2.4226,
                "poster_path": "/q8jlA3Wc1Z987hNKRFA44g5OugC.jpg",
                "release_date": "1982-12-17",
                "title": "Fanny and Alexander",
                "video": false,
                "vote_average": 7.8,
                "vote_count": 817,
                "character": "Aunt Anna von Bohlen",
                "credit_id": "5c226951c3a3683782e8f02a",
                "order": 32
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Käbi Alma Laretei (July 14, 1922 – October 31, 2014) was an Estonian-Swedish concert pianist.\n\nHer father Heinrich Laretei was a diplomat in the service of the Republic of Estonia as ambassador to Sweden; when the Soviet Union occupied Estonia in 1940, the family did not return to Estonia. Her piano teacher was Maria-Luisa Strub-Moresco, who had an indirect influence on the artistic choices of Laretei's later husband, Ingmar Bergman. Laretei had a long and distinguished career as a pianist, and in the 1960s she played to packed halls in the United Kingdom, Sweden, West Germany, and the United States, including Carnegie Hall.\n\nFrom 1950 to 1959, Laretei was married to Gunnar Staern, with whom she had a daughter, Linda (born 1955). Laretei is also known for her marriage to and professional collaborations with film director Ingmar Bergman; Laretei was his fourth wife. They met in the late 1950s, and were married in 1959. She introduced Bergman to a variety of music, some of which he would use in film scores. They divorced in 1969, though the marriage was effectively over by 1966. His 1961 film Through a Glass Darkly is dedicated to Laretei. They had a son, Daniel Bergman (born 1962), who is also a film director. Laretei worked with Igor Stravinsky and Paul Hindemith.\n\nShe continued to play in concert and give musical consultations on the set of some of her former husband's films and even appears playing the piano in a scene of Fanny and Alexander. She recorded piano passages that appear diegetically in Bergman's films, such as Autumn Sonata and The Magic Flute. She took an early interest in the TV medium, hosted many programmes on literature and music on Swedish TV and, starting with En bit jord (1976; \"A lump of earth\"), published a number of books on life and music, the last being Såsom i en översättning (2004; \"As in a translation\", the title being a paraphrase on \"Through a Glass Darkly\" (Såsom i en spegel)). Moreover, she has been the subject of numerous television and film documentaries.\n\nShe was awarded Estonia's Order of the National Coat of Arms, 3rd Class in 1998.",
        "birthday": "1922-07-14",
        "deathday": "2014-10-31",
        "gender": 1,
        "homepage": null,
        "id": 1316759,
        "imdb_id": "nm0488097",
        "known_for_department": "Acting",
        "name": "Käbi Laretei",
        "place_of_birth": "Tartu, Estonia",
        "popularity": 0.0789,
        "profile_path": "/9KTBlrRRDsrwpDwd2J6i4XOAfAS.jpg"
    }
}