{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ieux01445tYkzGdAukUFiYZiDNn.jpg",
                "genre_ids": [
                    18,
                    36,
                    10752
                ],
                "id": 41411,
                "original_language": "fr",
                "original_title": "La Rafle",
                "overview": "A faithful retelling of the 1942 \"Vel' d'Hiv Roundup\" and the events surrounding it.",
                "popularity": 3.512,
                "poster_path": "/9osPoGTddZZfMUzFDs82n57y2wQ.jpg",
                "release_date": "2010-03-10",
                "title": "The Round Up",
                "video": false,
                "vote_average": 7.546,
                "vote_count": 1025,
                "character": "Rachel Weismann",
                "credit_id": "52fe45c7c3a36847f80d9fd9",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ρεμπέκα Μαρντέρ",
            "레베카 마더"
        ],
        "biography": "Rebecca Marder (born 10 April 1995) is a French film and stage actress.\n\nRebecca Marder was born on 10 April 1995 in Paris, France. Marder is the daughter of American musician Marc Marder and French journalist and theatre critic Mathilde de La Bardonnie, who worked for Le Monde and later Libération. Her father is Jewish and her mother Catholic. Marder grew up in France and is a dual citizen of France and the United States.\n\nBetween 2008 and 2011, Marder was trained at the Conservatoire à rayonnement communal du 13e arrondissement de Paris. She later studied literature and cinema but interrupted her studies in September 2014 to join the drama school of the National Theatre of Strasbourg, where she studied for ten months.\n\nMarder began her acting career at the age of five. She appeared as Charlotte in the Rodolphe Marconi film Ceci est mon corps (2001). In 2007, she starred in Demandez la permission aux enfants alongside Pascal Légitimus and Sandrine Bonnaire. In 2010, she starred in The Round Up together with Jean Reno and Mélanie Laurent. In 2012, she received the Prix du jeune espoir féminin at the Festival de la fiction TV de La Rochelle for her performance in Alain Tasma's television film Emma.\n\nMarder was discovered by Éric Ruf, general administrator of the Comédie-Française, and chosen after a collective audition. She signed her contract on 19 June 2015, becoming a salaried actress (pensionnaire) of the Comédie-Française troupe. At 20 years old, she became one the youngest pensionnaires in its history, and the youngest of the troupe's then 59 actors. She debuted in the role of Lucietta in Carlo Goldoni's Les Rustres. She regularly appeared on stage there in classical roles, including as Claudine in Molière's George Dandin ou le Mari confondu and La Jalousie du Barbouillé, Atalide in Jean Racine's Bajazet and Hermione in Euripides' Electra and Orestes. In 2022, Marder announced her resignation from the Comédie-Française.\n\nIn 2020, Marder was a narrator of the Cambodian documentary film Irradiated, which competed for the Golden Bear in the main competition section at the 70th Berlin International Film Festival. Marder's father composed the film's score. In 2021, Marder appeared in the lead role of Sandrine Kiberlain's feature directorial debut A Radiant Girl, in which she plays a Jewish girl who aspires to become an actress in Paris during the German occupation in 1942. The film premiered in the Critics' Week section of the 2021 Cannes Film Festival, where it competed for the Caméra d'Or. For her performance, Marder received nominations for the César Award for Most Promising Actress and Lumières Award for Best Female Revelation.\n\nIn 2022, Marder portrayed a young Simone Veil in Olivier Dahan's biographical drama Simone Veil, A Woman of the Century. That same year, she starred in Sylvain Desclous's Grand Expectations, for which she received a second César nomination for Most Promising Actress. In 2023, Marder appeared opposite Nadia Tereszkiewicz in François Ozon's crime comedy The Crime Is Mine. Set in the 1930s, Marder portrays a lawyer who works to acquit her young actress roommate on grounds of self-defense after she is accused of murdering a wealthy producer.\n\nSource: Article \"Rebecca Marder\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1995-04-10",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 131607,
        "imdb_id": "nm2406198",
        "known_for_department": "Acting",
        "name": "Rebecca Marder",
        "place_of_birth": "Paris, France",
        "popularity": 1.9548,
        "profile_path": "/nVjmGILgh0CLMMmMaphCOnTZ34X.jpg"
    }
}