{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yPXW7E4Tu1Eltb5lxQSwHNLEzlx.jpg",
                "genre_ids": [
                    28,
                    35,
                    80,
                    18
                ],
                "id": 337170,
                "original_language": "en",
                "original_title": "American Made",
                "overview": "The true story of pilot Barry Seal, who transported contraband for the CIA and the Medellin cartel in the 1980s.",
                "popularity": 8.2425,
                "poster_path": "/23ILgoPSO5ShKcTZOuiTVfqFAUB.jpg",
                "release_date": "2017-08-18",
                "title": "American Made",
                "video": false,
                "vote_average": 6.896,
                "vote_count": 4741,
                "character": "Lucy Seal",
                "credit_id": "55ed2eab9251413e2f012d25",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Sarah Wright Olsen",
            "Sarah Mason",
            "萨拉·赖特"
        ],
        "biography": "Sarah was involved with local drama as a child, and became a model at age 14. Her big break came when she was discovered by organizers from the 1999 Mossimo model search contest. She attended LeGrande Elementary and Hart County High School before moving to Louisville to finish her high school career.\n\nSarah played the character of Paige Chase in the sitcom Quintuplets. She co-starred in the sitcom The Loop as Lizzy in Season 1. She also guest-starred in Season 11 of the CW series 7th Heaven as Jane, a best friend of Andrea Morris's character Margaret. She appeared as Sarah Mason, one of the girls with whom Patrick Dempsey's character has a one-night stand in the 2008 film Made of Honor.\n\nIn 2011, Wright began a recurring role in the CBS mid-season replacement comedy series Mad Love, and maintained a small recurring role as Millicent Gergich on the NBC show Parks and Recreation.[1]\n\nIn 2014, she co-starred alongside Casey Wilson and Ken Marino in the short-lived NBC sitcom Marry Me.\n\nShe co-founded a parenting website called Your Zen Mama with fellow actress Teresa Palmer.",
        "birthday": "1983-09-28",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 131723,
        "imdb_id": "nm0942792",
        "known_for_department": "Acting",
        "name": "Sarah Wright",
        "place_of_birth": "Louisville, Kentucky, USA",
        "popularity": 0.6346,
        "profile_path": "/kdD4FLJdoe0qpQPSOJCYhfUW72x.jpg"
    }
}