{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yGtoR1fi3e2xU7N91cb2DKJjtyL.jpg",
                "genre_ids": [
                    99
                ],
                "id": 39452,
                "original_language": "en",
                "original_title": "Exit Through the Gift Shop",
                "overview": "Banksy is a graffiti artist with a global reputation whose work can be seen on walls from post-hurricane New Orleans to the separation barrier on the Palestinian West Bank. Fiercely guarding his anonymity to avoid prosecution, Banksy has so far resisted all attempts to be captured on film. Exit Through the Gift Shop tells the incredible true story of how an eccentric French shop keeper turned documentary maker attempted to locate and befriend Banksy, only to have the artist turn the camera back on its owner.",
                "popularity": 0.8431,
                "poster_path": "/ruM5ehUQlHC1Kx3SF18d6klfrAx.jpg",
                "release_date": "2010-03-05",
                "title": "Exit Through the Gift Shop",
                "video": false,
                "vote_average": 7.543,
                "vote_count": 910,
                "character": "Self",
                "credit_id": "52fe471a9251416c9106a19d",
                "order": 1
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/yGtoR1fi3e2xU7N91cb2DKJjtyL.jpg",
                "genre_ids": [
                    99
                ],
                "id": 39452,
                "original_language": "en",
                "original_title": "Exit Through the Gift Shop",
                "overview": "Banksy is a graffiti artist with a global reputation whose work can be seen on walls from post-hurricane New Orleans to the separation barrier on the Palestinian West Bank. Fiercely guarding his anonymity to avoid prosecution, Banksy has so far resisted all attempts to be captured on film. Exit Through the Gift Shop tells the incredible true story of how an eccentric French shop keeper turned documentary maker attempted to locate and befriend Banksy, only to have the artist turn the camera back on its owner.",
                "popularity": 0.8431,
                "poster_path": "/ruM5ehUQlHC1Kx3SF18d6klfrAx.jpg",
                "release_date": "2010-03-05",
                "title": "Exit Through the Gift Shop",
                "video": false,
                "vote_average": 7.543,
                "vote_count": 910,
                "credit_id": "6794720a5dd2531e8b48616f",
                "department": "Camera",
                "job": "Camera Operator"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Mr. Brainwash"
        ],
        "biography": "​From Wikipedia, the free encyclopedia\n\nMr. Brainwash (\"MBW\") is a pseudonym for Thierry Guetta in the film Exit Through the Gift Shop, directed by Banksy. Guetta is presented in the 2010 film as a French citizen who now lives in Los Angeles, having been a proprietor of a clothing store and videographer who evolved into a street artist and gallery artist, influenced by the street artists he documented through video over the years. According to the film, Guetta was first introduced to street art by his cousin, the French street artist, Invader. The film includes authentic documentation of Space Invader, Shepard Fairey, Banksy and other well-known street artists at work on the streets, and is directed by Banksy with significant participation from Fairey.\n\nThe artwork attributed to Guetta strongly emulates the styles and artistic concepts of well-known street artists including Banksy and Shepard Fairey. Like Banksy, Guetta employs famous artistic and historic images, many of which are copyrighted, and amends the originals in slight or significant ways. Unlike Banksy, who is shown in the film creating his own work, Guetta states in the film that his work largely consists of \"scanning and photoshopping,\" acts which are carried out by hired assistants. Guetta further admits in Exit Through The Gift Shop that most of the actual artistic process is carried out by hired graphic designers to whom he describes his ideas. In the film, he is not shown creating much artwork himself.\n\nGuetta's first show Life is Beautiful opened in Los Angeles June 18, 2008. In 2009, Guetta created the cover art for Madonna's Celebration album. On February 14, 2010, his second show ICONS opened in New York City.\n\nDescription above from the Wikipedia article Mr. Brainwash, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://mrbrainwash.com",
        "id": 131830,
        "imdb_id": "nm3205630",
        "known_for_department": "Directing",
        "name": "Thierry Guetta",
        "place_of_birth": "Garges-lès-Gonesse, France",
        "popularity": 0.0388,
        "profile_path": null
    }
}