{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/42gqGeyXh4caHP19Tqf8DMRgc7r.jpg",
                "genre_ids": [
                    35,
                    10749,
                    18
                ],
                "id": 556678,
                "original_language": "en",
                "original_title": "Emma.",
                "overview": "In 1800s England, a well-meaning but selfish young woman meddles in the love lives of her friends.",
                "popularity": 3.7723,
                "poster_path": "/uHpHzbHLSsVmAuuGuQSpyVDZmDc.jpg",
                "release_date": "2020-02-13",
                "title": "Emma.",
                "video": false,
                "vote_average": 7.019,
                "vote_count": 1848,
                "character": "Mrs. Goddard",
                "credit_id": "5e48517d676ce20015fdffc5",
                "order": 24
            },
            {
                "adult": false,
                "backdrop_path": "/6van4BavoNXaZhCPdzLHNQ4Uc8H.jpg",
                "genre_ids": [
                    53,
                    28
                ],
                "id": 1087891,
                "original_language": "en",
                "original_title": "The Amateur",
                "overview": "After his life is turned upside down when his wife is killed in a London terrorist attack, a brilliant but introverted CIA decoder takes matters into his own hands when his supervisors refuse to take action.",
                "popularity": 25.6368,
                "poster_path": "/SNEoUInCa5fAgwuEBMIMBGvkkh.jpg",
                "release_date": "2025-04-09",
                "title": "The Amateur",
                "video": false,
                "vote_average": 6.984,
                "vote_count": 1196,
                "character": "Anita Garrison",
                "credit_id": "67e5fa8c14bba6ae31002025",
                "order": 22
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Anna Francolini (born 30 October 1973) is an English actress.\n\nFrancolini was born in Chertsey, Surrey, attended Bristol Grammar School and studied theatre at the University of Warwick. She also trained as a member of the National Youth Theatre.\n\nAfter appearances in Godspell and Oliver during the early part of her career, Francolini appeared in two acclaimed musical productions at the Donmar Warehouse – Company (1995) and Merrily We Roll Along (2000), both by Stephen Sondheim. She also played the Baker's Wife in the Royal Opera House production of Sondheim's Into the Woods in 2007. She won the 2009 TMA Award for Best Performance in a Play with her portrayal of Jean Brodie in Muriel Spark's The Prime of Miss Jean Brodie, which was staged at the Royal & Derngate in Northampton. During the period from December 1997 to December 2004 Anna Francolini was a mainstay of London's tiny but influential Bridewell Theatre during the latter part of its decade as a professional venue. In December 1997 to January 1998 she played lead role Helen in the historic fully staged premiere of Stephen Sondheim's Saturday Night. This was to be followed in 1999 by Floyd Collins and later on during 2000-1 Anna appeared in revue shows created from the work of Jason Robert Brown, Adam Guettel and John La Chiusa, one of which, The Cutting Edge transferred to the Donmar Warehouse in 2002. Further Bridewell Theatre work included There's Always A Woman (2002); The Ballard of Little Jo (2003) and an appearance at the venue's 10th Anniversary Farewell Concert on 12 December 2004. Following the demise of the Bridewell Theatre as a professional venue, Anna's other appearances included Caroline, or Change at the National Theatre (2006), Three Sisters on Hope Street at the Liverpool Everyman (2008) and Wolves at the Window at the Arcola Theatre during the same year, which gave her a New York debut at 59E59 in 2009.\n\nIn 2010, she played the role of Maria Callas in Martin Sherman's play Onassis at the Novello Theatre. During the following year, Anna played the role of Beatrice in Arthur Miller's A View from the Bridge at Manchester's Royal Exchange, a venue to which she was to return in 2014 as Enid in That Day We Sang. 2012 saw her take the lead role in Victor/Victoria at Southwark Playhouse and in February 2015 she made an appearance in Stephen Sondheim's Assassins at the Menier Chocolate Factory. July 2015, she was part of the premiere cast of Damon Albarn's new musical Wonder.land at the Manchester International Festival which transferred to the National Theatre later during the same year. 25 October 2015 saw Anna make an appearance in Stephen Sondheim's 85th Birthday Tribute Hey Old Friends. In 2016 she appeared as a female Captain Hook at the National Theatre in Peter Pan. From March to October 2018 she appeared in Strictly Ballroom at the Piccadilly Theatre. In April 2023 she appeared in Tom Fool at Richmond's Orange Tree Theatre and in May-June 2024 she played Olivia in Twelfth Night at Regent's Park Open Air Theatre. Her screen credits include the movies Topsy-Turvy and Solo: A Star Wars Story and the TV series Rome, New Tricks and Vera. In 2019, she voiced Gina on Thomas & Friends in the US/UK versions.",
        "birthday": "1973-10-30",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.unitedagents.co.uk/anna-francolini",
        "id": 1320746,
        "imdb_id": "nm0290693",
        "known_for_department": "Acting",
        "name": "Anna Francolini",
        "place_of_birth": "Chertsey, Surrey, England, UK",
        "popularity": 0.6499,
        "profile_path": "/zkfIJehMXE8jSzbClQsILZqddM5.jpg"
    }
}