{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/syapU4X3vYBCdARyAOtz3g90hMt.jpg",
                "genre_ids": [
                    53,
                    18,
                    80
                ],
                "id": 1900,
                "original_language": "en",
                "original_title": "Traffic",
                "overview": "An exploration of the United States of America's war on drugs from multiple perspectives. For the new head of the Office of National Drug Control Policy, the war becomes personal when he discovers his well-educated daughter is abusing cocaine within their comfortable suburban home. In Mexico, a flawed, but noble policeman agrees to testify against a powerful general in league with a cartel, and in San Diego, a drug kingpin's sheltered trophy wife must learn her husband's ruthless business after he is arrested, endangering her luxurious lifestyle.",
                "popularity": 4.9867,
                "poster_path": "/v6YrfR1e2OUAYbXrJ7hv3EiGNcg.jpg",
                "release_date": "2000-12-27",
                "title": "Traffic",
                "video": false,
                "vote_average": 7.081,
                "vote_count": 2261,
                "character": "Senator Charles Grassley",
                "credit_id": "5f846f7e6082eb0036efb689",
                "order": 73
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Charles Grassley"
        ],
        "biography": "Charles Ernest Grassley (born September 17, 1933) is an American politician serving as the president pro tempore of the United States Senate since 2025, a role he also held from 2019 to 2021. A member of the Republican Party, Grassley is the senior United States senator from Iowa, serving since 1981. He is the dean of the United States Senate.\n\nBefore becoming a senator, Grassley served eight terms in the Iowa House of Representatives (1959–1975) and three terms in the United States House of Representatives (1975–1981). He has served three stints as Senate Finance Committee chairman during periods of Republican Senate majority. Upon the retirement of Orrin Hatch on January 3, 2019, Grassley became the Senate's most senior Republican and its president pro tempore. Upon Patrick Leahy's retirement in January 2023, Grassley became the most senior member of the Senate.\n\nAt 91 years, 9 months and 16 days old, Grassley is the oldest sitting United States senator, the longest-serving Republican in congressional history, and the sixth-longest-serving U.S. senator in history. He served as president pro tempore emeritus of the Senate from 2021 to 2025. During his four decades in the Senate, Grassley has chaired the Senate Finance Committee, the Senate Narcotics Caucus, the Senate Judiciary Committee, and the Senate Aging Committee.",
        "birthday": "1933-09-17",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1320273,
        "imdb_id": "nm0335948",
        "known_for_department": "Acting",
        "name": "Chuck Grassley",
        "place_of_birth": "New Hartford, Iowa",
        "popularity": 0.0387,
        "profile_path": "/zObJ649TGonscotXjd87UpcR0pr.jpg"
    }
}