{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bQEIYntlPba76NN41uWxIzUmzBb.jpg",
                "genre_ids": [
                    18
                ],
                "id": 4995,
                "original_language": "en",
                "original_title": "Boogie Nights",
                "overview": "Set in 1977, back when sex was safe, pleasure was a business and business was booming, idealistic porn producer Jack Horner aspires to elevate his craft to an art form. Horner discovers Eddie Adams, a hot young talent working as a busboy in a nightclub, and welcomes him into the extended family of movie-makers, misfits and hangers-on that are always around. Adams' rise from nobody to a celebrity adult entertainer is meteoric, and soon the whole world seems to know his porn alter ego, \"Dirk Diggler\". Now, when disco and drugs are in vogue, fashion is in flux and the party never seems to stop, Adams' dreams of turning sex into stardom are about to collide with cold, hard reality.",
                "popularity": 11.9692,
                "poster_path": "/wnE24UPCPQsQnbBOu4zVE2qaDNm.jpg",
                "release_date": "1997-10-10",
                "title": "Boogie Nights",
                "video": false,
                "vote_average": 7.634,
                "vote_count": 3315,
                "character": "New Year's Eve Young Stud",
                "credit_id": "5890e49292514103f0009980",
                "order": 52
            }
        ],
        "crew": []
    },
    "details": {
        "adult": true,
        "also_known_as": [
            " Tony T.",
            "Tony Tedeci",
            "Tony Tedesci",
            "Toni Tedeshi",
            "Tony Tedeshi",
            "Tony Tedischi",
            "Toni Tedishi",
            "Tony"
        ],
        "biography": "Tony Tedeschi (born April 11, 1964) is an American pornographic film actor. Before his pornography career, he worked as a deejay at the Foxy Lady strip club in Providence. He was spotted by Britt Morgan, who was performing there at the time, and later shot his first scenes with her in 1990. Tedeschi appeared in nearly 1,300 films between 1990 and 2012. He was married to fellow porn star Tina Tyler from 1993 to 1994.\n\nIn 2003, Tedeschi was inducted into the AVN Hall of Fame. As of October of 2019 he was working as a chef at a restaurant called \"Little Devil Catering\" in the Los Angeles area.",
        "birthday": "1964-04-11",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 132095,
        "imdb_id": "nm0845794",
        "known_for_department": "Acting",
        "name": "Tony Tedeschi",
        "place_of_birth": "Providence, Rhode Island, USA",
        "popularity": 2.878,
        "profile_path": "/uMs3i7dOwGhG6tOEmrHK5OzLz9Z.jpg"
    }
}