{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/vGZTyglSEzL7evznmyIAoubsKiM.jpg",
                "genre_ids": [
                    18,
                    80,
                    10752
                ],
                "id": 430424,
                "original_language": "fr",
                "original_title": "Au revoir là-haut",
                "overview": "In November 1918, a few days before the Armistice, when Lieutenant Pradelle orders a senseless attack, he causes a useless disaster; but his outrageous act also binds the lives of two soldiers who have nothing more in common than the battlefield: Édouard saves Albert, although at a high cost. They become companions in misfortune who will attempt to survive in a changing world. Pradelle, in his own way, does the same.",
                "popularity": 1.6429,
                "poster_path": "/pkO5YoznMR9neuHVzhxHK9JJpAj.jpg",
                "release_date": "2017-10-25",
                "title": "See You Up There",
                "video": false,
                "vote_average": 7.846,
                "vote_count": 1314,
                "character": "Dupré",
                "credit_id": "5c383a370e0a267d5321bdcc",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/sBtBtQ7DigbXx4o1rqp80Pzr1qa.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 651881,
                "original_language": "fr",
                "original_title": "Adieu les cons",
                "overview": "When 43-year-old hairdresser Suze Trappet finds out that she's seriously ill, she decides to go looking for a child she was forced to abandon when she was only 15. On her madcap bureaucratic quest she crosses paths with JB, a 50-year-old man in the middle of a burnout, and Mr. Blin, a blind archivist prone to overenthusiasm. The unlikely trio set off on a hilarious and poignant helterskelter journey across the city in search of Suze's long-lost child.",
                "popularity": 1.762,
                "poster_path": "/iEzAKYpwdfFprRV39B7GxJoz9LV.jpg",
                "release_date": "2020-10-21",
                "title": "Bye Bye Morons",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 920,
                "character": "Dr. Lint's doctor",
                "credit_id": "5f040b09a097dc0037c57b72",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/P82NAcEsLIYgQtrtn36tYsj41m.jpg",
                "genre_ids": [
                    10751,
                    35,
                    12,
                    16
                ],
                "id": 748783,
                "original_language": "en",
                "original_title": "The Garfield Movie",
                "overview": "Garfield, the world-famous, Monday-hating, lasagna-loving indoor cat, is about to have a wild outdoor adventure! After an unexpected reunion with his long-lost father – scruffy street cat Vic – Garfield and his canine friend Odie are forced from their perfectly pampered life into joining Vic in a hilarious, high-stakes heist.",
                "popularity": 14.6439,
                "poster_path": "/xYduFGuch9OwbCOEUiamml18ZoB.jpg",
                "release_date": "2024-04-30",
                "title": "The Garfield Movie",
                "video": false,
                "vote_average": 7.037,
                "vote_count": 1325,
                "character": "(voice) (uncredited)",
                "credit_id": "68c895633e81a959c0e51931",
                "order": 31
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Kyan Khojandi (born 29 August 1982 in Reims, France) is a French comedian, actor and screenwriter born to a French mother and an Iranian father. He is best known for playing the main character in the television series Bref, which was broadcast on Canal+ from 2011 to 2012.\n\nHe has one brother, Keyvan Khojandi, who plays the role of Kyan's brother in the Bref series.\n\nAt 6 years old, Kyan entered the Music conservatory of Reims where he learned to play viola. He then entered the Cours Simon in Paris in 2004 where he studied theatre to become a professional comedian. He wrote his first texts in 2006, then started open stages and played in artists' opening shows.\n\nFrom March 2008 to February 2010, he appeared in the show La Bande-annonce de ma vie. Yassine Belattar gave him an opportunity to act in his shows \"Le Belattar Show\" and \"On achève bien l'info\" on France 4, which made him popular. He finalised his solo programme by playing small roles on the Parisian scene.\n\nFrom August 29, 2011 to July 12, 2012, he played the main character in the \"Bref\" series, which was broadcast 3 times per week at 8.30 pm as part of the French Canal+ show \"Le grand journal\".\n\nHe also appeared in a few ads for French car parts and service station chain Norauto.\n\nSource: Article \"Kyan Khojandi\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1982-08-29",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.kyan.fr/",
        "id": 1321014,
        "imdb_id": "nm4595016",
        "known_for_department": "Acting",
        "name": "Kyan Khojandi",
        "place_of_birth": "Reims, Marne, France",
        "popularity": 0.1341,
        "profile_path": "/e2XcdnMz6hCVz4skEZXjsEr9A72.jpg"
    }
}