{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ryoWP1kvNcwPif6uNbuZwQfrJPy.jpg",
                "genre_ids": [
                    35,
                    80
                ],
                "id": 24382,
                "original_language": "it",
                "original_title": "I soliti ignoti",
                "overview": "Best friends Peppe and Mario are thieves, but they're not very good at it. Still, Peppe thinks that he's finally devised a master heist that will make them rich. With the help of some fellow criminals, he plans to dig a tunnel from a rented apartment to the pawnshop next door, where they can rob the safe. But his plan is far from foolproof, and the fact that no one in the group has any experience digging tunnels proves to be the least of their problems.",
                "popularity": 1.6895,
                "poster_path": "/f5OxD8Nl0pR3DcYHtYhHRfpsmjl.jpg",
                "release_date": "1958-07-26",
                "title": "Big Deal on Madonna Street",
                "video": false,
                "vote_average": 8.099,
                "vote_count": 740,
                "character": "Dante Cruciani",
                "credit_id": "52fe4493c3a368484e02a905",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Antonio Griffo Focas Flavio Angelo Ducas Comneno Porfirogenito Gagliardi De Curtis di Bisanzio",
            "Antonio De Curtis",
            "Antonio Vincenzo Stefano Clemente",
            "Тото",
            "Антоніо Де Куртіс"
        ],
        "biography": "Totò was born Antonio Clemente in a poor district of Naples, the illegitimate son of Anna Clemente from Sicily and Marquis Giuseppe De Curtis from Naples. Nicknamed “il principe della risata’ (the prince of laughter), he was an Italian comedian, film and theatre actor, writer, singer and songwriter, and widely considered one of the greatest Italian artists of the 20th century.  While he first gained his popularity as a comic actor, his dramatic roles, poetry, and songs are all of cultural import; his style and a number of his recurring jokes and gestures have become universally known memes in Italy.\n\nAs a comic actor, Totò is classified as an heir of the Commedia dell'Arte tradition, and has been compared to such figures as Buster Keaton and Charlie Chaplin.  At the age of 15, he was already acting as a comedian in small theatres, under the pseudonym \"Clerment\". His early repertoire mostly consisted in imitations of Gustavo De Marco's characters. He served in the army during World War I and then went back to acting to develop the trademarks of his style.   \n\nIn 1937, he appeared in his first movie \"Fermo con le mani\", and later starred in 96 more films, many of which are still frequently broadcast on Italian television. In his vast cinematographic career, Totò had the opportunity to act side by side with virtually all major Italian actors of the time. Totò's unmistakable figure, with his peculiarly irregular face (due to an accident in his teen years), and his unique trademark ability to disarticulate his body like a marionette, soon became very popular and his comic gags became part of the Italian culture. Totò died at the age of 69 in Rome after a series of heart attacks. Due to overwhelming popularity there were three funeral services: the first in Rome, and the second and third in Naples. Totò's birth home has been recently opened to the public as a museum.",
        "birthday": "1898-02-14",
        "deathday": "1967-04-15",
        "gender": 2,
        "homepage": null,
        "id": 132190,
        "imdb_id": "nm0869451",
        "known_for_department": "Acting",
        "name": "Totò",
        "place_of_birth": "Naples, Campania, Italy",
        "popularity": 0.4066,
        "profile_path": "/x8sM4HlITfhAoXJ2FZrQA7wFgXg.jpg"
    }
}