{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bwgjIlMoSyU1Iw0IhNIFUeSbNDy.jpg",
                "genre_ids": [
                    18
                ],
                "id": 68722,
                "original_language": "en",
                "original_title": "The Master",
                "overview": "Freddie, a volatile, heavy-drinking veteran who suffers from post-traumatic stress disorder, finds some semblance of a family when he stumbles onto the ship of Lancaster Dodd, the charismatic leader of a new \"religion\" he forms after World War II.",
                "popularity": 5.8235,
                "poster_path": "/jjVGdNt4fYb3T2hjISGZ2qnCuaV.jpg",
                "release_date": "2012-09-14",
                "title": "The Master",
                "video": false,
                "vote_average": 7.113,
                "vote_count": 3105,
                "character": "Dancer",
                "credit_id": "6158e35481c7be0025de2a88",
                "order": 64
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Baily Hopkins is an award-winning actor and violinist. She has worked with many of the film industry's top names including Emmanuel Lubezki, Paul Thomas Anderson, Barry Jenkins, Joe Robert Cole, and the Oscar-nominated directing duo Mihal Brezis & Oded Binnun. She's had her work featured in the San Francisco Green Film Festival, and had films premiere at film festivals all over the world including the Venice Film Festival, the San Francisco International Film Festival, the Mill Valley Film Festival, the Federation Internationale Cinema Television Sportifs in Milan, Cinequest, the FiveTen Film Festival, the Portland Comedy Film Festival, and the Livermore Valley Film Fest. Baily has also appeared in national campaigns for many major brands. On the musical side of things, Baily has played the violin for over 20 years in all sorts of settings; from Carnegie Hall, to Burning Man, to Oakland's Fox Theatre.",
        "birthday": "1986-01-27",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1321222,
        "imdb_id": "nm2087072",
        "known_for_department": "Acting",
        "name": "Baily Hopkins",
        "place_of_birth": "Berkeley, California, USA",
        "popularity": 0.1146,
        "profile_path": "/m8acwaXqm1szMiDTK6XXbfPsn4K.jpg"
    }
}