{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ti6kJ80ZB8RZTiDIzPkhaCJMoqq.jpg",
                "genre_ids": [
                    35,
                    80
                ],
                "id": 115,
                "original_language": "en",
                "original_title": "The Big Lebowski",
                "overview": "Jeffrey 'The Dude' Lebowski, a Los Angeles slacker who only wants to bowl and drink White Russians, is mistaken for another Jeffrey Lebowski, a wheelchair-bound millionaire, and finds himself dragged into a strange series of events involving nihilists, adult film producers, ferrets, errant toes, and large sums of money.",
                "popularity": 11.5453,
                "poster_path": "/9mprbw31MGdd66LR0AQKoDMoFRv.jpg",
                "release_date": "1998-03-06",
                "title": "The Big Lebowski",
                "video": false,
                "vote_average": 7.84,
                "vote_count": 11679,
                "character": "Sherry in 'Logjammin' (uncredited)",
                "credit_id": "568efdde9251416b47003c18",
                "order": 41
            }
        ],
        "crew": []
    },
    "details": {
        "adult": true,
        "also_known_as": [
            "Asia",
            "Jessica Andrea Steinhauser",
            "Jessica Bennett"
        ],
        "biography": "Asia Carrera's stunning curves can be seen in more than 250 hardcore movies. Her looks combine delicate Asian features with voluptuous silicone breasts. Her fans not only admire her mouth-watering body but also her brains--a self-taught web designer, she is also a member of MENSA.  At the tender age of 13 this daughter of a German father and a Japanese mother already was already playing music by \n\nJohann Sebastian Bach on the piano in Carnegie Hall. Thanks to a federal grant she was able to study Japanese language and Economics at New Jersey's Rutgers University, but this was only after she had run away from home as a teenager because of the pressure her demanding parents put on her. By the age of 17 she was homeless. To get through her studies at the university she turned to stripping. After becoming one of New Jersey's best-paid exotic dancers she decided to devote her life to getting richer and richer; she never wanted to live out on the street again. When she heard about girls making thousands of dollars in the porn biz, she moved to Los Angeles. A mutual friend introduced her to director Bud Lee, who instantly put her in one of his feature films. The rest, as they say, is history.  Asia has retired from making adult movies and only returns to do the occasional big-budget flick. She runs her own website and spends her time chatting with fans via email or day trading shares on the stock exchange.",
        "birthday": "1973-08-06",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 132232,
        "imdb_id": "nm0006562",
        "known_for_department": "Acting",
        "name": "Asia Carrera",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 22.411,
        "profile_path": "/xHVg6dLbksRJ3nhSTezez3ZekzR.jpg"
    }
}