{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qzUIOTk0E3F1zjvYjcBRTKUTgf9.jpg",
                "genre_ids": [
                    80,
                    35,
                    28,
                    12
                ],
                "id": 207703,
                "original_language": "en",
                "original_title": "Kingsman: The Secret Service",
                "overview": "The story of a super-secret spy organization that recruits an unrefined but promising street kid into the agency's ultra-competitive training program just as a global threat emerges from a twisted tech genius.",
                "popularity": 9.5408,
                "poster_path": "/r6q9wZK5a2K51KFj4LWVID6Ja1r.jpg",
                "release_date": "2015-01-24",
                "title": "Kingsman: The Secret Service",
                "video": false,
                "vote_average": 7.623,
                "vote_count": 17276,
                "character": "Rottweiler",
                "credit_id": "55da259792514143f00054a9",
                "order": 20
            },
            {
                "adult": false,
                "backdrop_path": "/mYzmWGhy9PZ6xUo0D4i3bBRdX2u.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 245168,
                "original_language": "en",
                "original_title": "Suffragette",
                "overview": "Based on true events about the foot soldiers of the early feminist movement, women who were forced underground to pursue a dangerous game of cat and mouse with an increasingly brutal State.",
                "popularity": 1.7248,
                "poster_path": "/y706qec117bN2S7XgCs2Yz8jEfv.jpg",
                "release_date": "2015-10-16",
                "title": "Suffragette",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 1642,
                "character": "Detective Malcolm Walsop",
                "credit_id": "56c4533bc3a368720a001cae",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Morgan Watkins is an English film, television and stage actor.  He studied acting at the Royal Academy of Dramatic Art (RADA) in London where he was awarded a BA in Acting degree in 2009.\n\nHe has worked extensively in Theatre, TV and Film. His screen work includes Kingsman The Secret Service, The Hour, Chicken, Small City, The Limehouse Golem, Noughts and Crosses and A Very English Scandal. He has performed in plays at the National Theatre, Almeida Theatre and The Lyric Hammersmith where he played Len in a revival of Edward Bond’s Saved. He is represented in acting by Oliver Slinger at Independent Talent.\n\nHe has taught lessons, courses and workshops at various institutions including Guildhall, University of East London, City Academy, LMA and RADA. He has worked in various roles with Synergy Theatre Group and teach acting workshops to young offenders and prisoners.\n\nIn 2023 he founded The Base Creates with Oliver Bennett. They stage readings of fascinating plays from the western cannon with responses from renowned and exciting thinkers. They have launched The Agon, a new writing competition looking for fearless voices. They hosted the first competition in September 2024 and will launch it again in 2025. They also have a drop-in drama academy with the hope of beginning a drive back towards excellence and host a podcast discussing great ideas with fascinating dramatists and philosophers.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://morganwatkins.co.uk/acting/",
        "id": 1322313,
        "imdb_id": "nm2744497",
        "known_for_department": "Acting",
        "name": "Morgan Watkins",
        "place_of_birth": "Camden, London, England, UK",
        "popularity": 0.1163,
        "profile_path": "/9uVJgLyyQewhlsLyVJdyIP0T0Bd.jpg"
    }
}