{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/MMSI9WzRmOdqXarevQ3Kqnytrx.jpg",
                "genre_ids": [
                    12,
                    28,
                    53,
                    878
                ],
                "id": 8810,
                "original_language": "en",
                "original_title": "Mad Max 2",
                "overview": "Max Rockatansky returns as the heroic loner who drives the dusty roads of a postapocalyptic Australian Outback in an unending search for gasoline. Arrayed against him and the other scraggly defendants of a fuel-depot encampment are the bizarre warriors commanded by the charismatic Lord Humungus, a violent leader whose scruples are as barren as the surrounding landscape.",
                "popularity": 6.5059,
                "poster_path": "/l1KVEhkGDpWRzQ0VqIhZqDDuOim.jpg",
                "release_date": "1981-12-24",
                "title": "Mad Max 2",
                "video": false,
                "vote_average": 7.387,
                "vote_count": 3964,
                "character": "Voice of Narrator",
                "credit_id": "6450241372c13e0140468f49",
                "order": 24
            },
            {
                "adult": false,
                "backdrop_path": "/kcK6wlt4TT1ETgr8mJhXgUg3HYE.jpg",
                "genre_ids": [
                    10752,
                    36,
                    18
                ],
                "id": 11646,
                "original_language": "en",
                "original_title": "Gallipoli",
                "overview": "Two Australian sprinters face the brutal realities of war when they are sent to fight in the Gallipoli campaign in the Ottoman Empire during World War I.",
                "popularity": 1.8327,
                "poster_path": "/un7VCqTmjrq3u75mQ204a8tofD4.jpg",
                "release_date": "1981-08-13",
                "title": "Gallipoli",
                "video": false,
                "vote_average": 7.05,
                "vote_count": 505,
                "character": "Camel Driver",
                "credit_id": "5f4480cdcee4810037a3ce65",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Harold Verdun Baigent (16 November 1916 – 9 March 1996), known as 'Baige', was a New Zealand theatre director, actor and arts manager. He trained as an actor in the USA at Yale University Drama School, and acted in Broadway and London stage productions, before returning to New Zealand in the late 1940s, where he founded his own drama company and worked as a drama tutor and stage manager. In the 1960s he settled in Melbourne, Australia. As director of the Emerald Hill Theatre Company and the Victorian Travelling Theatre, he was an influential figure in the Victorian theatrical scene, and played a significant role in promoting the arts in regional Victoria and South Australia. He was associated with the Warrandyte Arts Association Drama Group and performed in many productions including Twelfth Night (1964) as Malvolio, and as director of Salad Days (1968).\n\nAs an actor, Baigent was known for many parts on Australian film and television, including roles in the film Gallipoli and the television series The Flying Doctors, and a memorable introductory monologue at the beginning of the film Mad Max 2. He was director of the Council of Adult Education in Adelaide, South Australia for many years, and founded the Arts Train, an innovative travelling arts project that toured small towns throughout South Australia and Victoria. He retired to the Heathcote area in the 1980s, but continued to be actively involved in theatre and the arts there until his death in 1996.",
        "birthday": "1916-11-16",
        "deathday": "1996-03-09",
        "gender": 0,
        "homepage": null,
        "id": 1322176,
        "imdb_id": "nm0047077",
        "known_for_department": "Acting",
        "name": "Harold Baigent",
        "place_of_birth": "Christchurch, Canterbury, New Zealand",
        "popularity": 0.0256,
        "profile_path": "/ibnElml3ckct5VVoz4yU5bNTUz6.jpg"
    }
}