{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qzUIOTk0E3F1zjvYjcBRTKUTgf9.jpg",
                "genre_ids": [
                    80,
                    35,
                    28,
                    12
                ],
                "id": 207703,
                "original_language": "en",
                "original_title": "Kingsman: The Secret Service",
                "overview": "The story of a super-secret spy organization that recruits an unrefined but promising street kid into the agency's ultra-competitive training program just as a global threat emerges from a twisted tech genius.",
                "popularity": 9.5408,
                "poster_path": "/r6q9wZK5a2K51KFj4LWVID6Ja1r.jpg",
                "release_date": "2015-01-24",
                "title": "Kingsman: The Secret Service",
                "video": false,
                "vote_average": 7.623,
                "vote_count": 17275,
                "character": "Charlie",
                "credit_id": "55da253dc3a36831fa005937",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/eVHVwP71el20fofkCHo78ebQv7Q.jpg",
                "genre_ids": [
                    28,
                    12,
                    35,
                    80
                ],
                "id": 343668,
                "original_language": "en",
                "original_title": "Kingsman: The Golden Circle",
                "overview": "When an attack on the Kingsman headquarters takes place and a new villain rises, Eggsy and Merlin are forced to work together with the American agency known as the Statesman to save the world.",
                "popularity": 8.0513,
                "poster_path": "/34xBL6BXNYFqtHO9zhcgoakS4aP.jpg",
                "release_date": "2017-09-20",
                "title": "Kingsman: The Golden Circle",
                "video": false,
                "vote_average": 6.954,
                "vote_count": 10745,
                "character": "Charlie",
                "credit_id": "57068b07c3a36865570001d6",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Edward Patrick Holcroft is an English film, television, and stage actor. He is best known for his roles in the Kingsman film franchise and in the television series Wolf Hall (2015), London Spy (2015), and Alias Grace (2017).\n\nHolcroft is the second of three sons born to Lt. Col. Patrick Holcroft, a soldier and Kathleen \"Annie\" Holcroft (née Roberts), a former publisher at Condé Nast. His elder brother, Oliver Holcroft, is a former soldier who served with the Grenadier Guards in Afghanistan. Edward was sent to boarding school at age 8, first attending prep school at Summer Fields School in Oxford and then to a Roman Catholic school, Ampleforth College, in North Yorkshire.\n\nHe initially wanted to become a professional drummer, having attended music school, but switched to acting after appearing in a play at Oxford Brookes University. He then undertook post-graduate studies in acting at the Drama Centre London of Central Saint Martins, University of the Arts London, graduating in 2012.\n\nHolcroft is best known for his roles as Charlie Hesketh in the film Kingsman: The Secret Service and its sequel Kingsman: The Golden Circle; as George Boleyn in the British drama series Wolf Hall; and as Alex Turner in the BBC drama series London Spy. In 2017, he appeared in the historical miniseries Gunpowder on the BBC and Alias Grace on Netflix and the CBC. Holcroft acted with Dominic West and Janet McTeer in Les Liaisons Dangereuses at the Donmar Warehouse.",
        "birthday": "1987-06-23",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1322314,
        "imdb_id": "nm5685205",
        "known_for_department": "Acting",
        "name": "Edward Holcroft",
        "place_of_birth": "London, England",
        "popularity": 0.5143,
        "profile_path": "/hLsZyePiRMTrqlHalPh8f5dLRIE.jpg"
    }
}