{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9UAhRDffrWkOwxqzqAF6ls1iEZ8.jpg",
                "genre_ids": [
                    18,
                    53,
                    10752
                ],
                "id": 12162,
                "original_language": "en",
                "original_title": "The Hurt Locker",
                "overview": "During the Iraq War, a Sergeant recently assigned to an army bomb squad is put at odds with his squad mates due to his maverick way of handling his work.",
                "popularity": 7.245,
                "poster_path": "/m2duGsKjBOl3BB8uFOTnRUzdEhg.jpg",
                "release_date": "2008-10-10",
                "title": "The Hurt Locker",
                "video": false,
                "vote_average": 7.256,
                "vote_count": 5855,
                "character": "Sergeant Foster",
                "credit_id": "5a8f97bbc3a3682dc9007e6a",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            " Malcolm I. Barrett",
            "Verbal the Rapper"
        ],
        "biography": "Malcolm Barrett (born 1980) is an American actor known for playing the role of scientist and time traveler Rufus Carlin in Timeless on NBC.\n\nHe was born and raised in Brooklyn, NY and attended Stuyvesant High School in Manhattan. He has appeared as a series regular on Fox's The Sketch Show and Luis.\n\nBarrett played the character \"Dr. Lem Hewitt\" on the ABC television show, Better Off Ted and was a supporting character in the Academy Award-winning The Hurt Locker.\n\nBarrett has had recurring appearances on the New York-based Law & Order franchise. He was featured as a squatter and drug dealer in an episode of The Sopranos and also guest starred in the pilot episode of It's Always Sunny in Philadelphia, the series finale of The Office as one of Dunder/Mifflin's new employees, and in an episode of Monk as a lottery fanatic. He also had a small role in the movie Larry Crowne, as one of Tom Hanks' character's classmates. He has also appeared in several television commercials, including national spots for Hummer and AT&T. The AT&T spot, which features Barrett shooting baskets in a sports bar, received frequent airplay during the 2008 NCAA Men's Division I Basketball Tournament. Barrett began playing the role of Rufus Carlin in the Fall of 2016 in the NBC series, Timeless.\n\nBarrett is a spoken word artist and hip hop performer who has recorded under the aliases \"Tourette's,\" \"Verbal,\" and \"The Velvet Rope.\" He appeared on the 2002 EP Timber, by electronic recording artist M Pinto. He is currently working on his debut album entitled The Backpacker's Guide to the Galaxy.",
        "birthday": "1980-04-22",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 132355,
        "imdb_id": "nm0057217",
        "known_for_department": "Acting",
        "name": "Malcolm Barrett",
        "place_of_birth": "Brooklyn, New York City, New York, USA",
        "popularity": 0.2933,
        "profile_path": "/pKIBvaQsShrT9mXk7xUCQQ5TAvY.jpg"
    }
}