{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/scQf03Fm3jeyv4FH04qvi4fp4wh.jpg",
                "genre_ids": [
                    80,
                    35,
                    28
                ],
                "id": 402900,
                "original_language": "en",
                "original_title": "Ocean's Eight",
                "overview": "Debbie Ocean, a criminal mastermind, gathers a crew of female thieves to pull off the heist of the century at New York's annual Met Gala.",
                "popularity": 8.6805,
                "poster_path": "/MvYpKlpFukTivnlBhizGbkAe3v.jpg",
                "release_date": "2018-06-07",
                "title": "Ocean's Eight",
                "video": false,
                "vote_average": 6.968,
                "vote_count": 8525,
                "character": "Press Conference Reporter",
                "credit_id": "5eb7faf9cc277c00206b5d71",
                "order": 27
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Sas Goldberg is an American actor, writer, and producer known for her work in television and theatre. She first attracted major attention in theatre, making her Broadway debut in 2017 playing the role of “Kiki” in Significant Other by Josh Harmon, after having originated the role off‑Broadway. She also performed in the off‑Broadway production Moscow, Moscow, Moscow, Moscow! at MCC Theater in 2019.\n\nIn television, Goldberg has appeared in a number of series. She had a recurring role on American Princess (2019). She appears in Search Party (HBO Max), Odd Mom Out (Bravo), and You’re the Worst (FX). She is also part of The Shrink Next Door (2021), in which she not only appears on screen but was on staff as a writer. In Life & Beth (2022), she plays Jess. Goldberg has made guest appearances on Only Murders in the Building (2021) and has contributed off-screen to its production.\n\nGoldberg’s identity and cultural background are part of her creative voice; she speaks about her Jewish upbringing and how it informs her work. As a writer, she has developed pilots for various networks, including HBO, FX, NBC, FOX, Freeform, Warner Bros., and Bravo, and has collaborated with producers such as Lee Eisenberg, The Lonely Island, and Will Gluck.\n\nIn terms of honours, Sas Goldberg is a 2024 nominee for the Primetime Emmy Award for Outstanding Comedy Series for Only Murders in the Building (shared with producers). She also received nominations in 2024 from the Producers Guild of America (Outstanding Producer of Episodic Television, Comedy) and from the Writers Guild of America for Comedy Series, again for Only Murders in the Building.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1323566,
        "imdb_id": "nm4581341",
        "known_for_department": "Acting",
        "name": "Sas Goldberg",
        "place_of_birth": null,
        "popularity": 0.1089,
        "profile_path": "/vittrEB80rZjQNDYMQzdt1cVLux.jpg"
    }
}