{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zvNMZl0l2qYq0x0ntq8sILiIpLw.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 9040,
                "original_language": "en",
                "original_title": "Serpico",
                "overview": "New York cop Frank Serpico blows the whistle on the rampant corruption in the force only to have his comrades turn against him.",
                "popularity": 4.2719,
                "poster_path": "/pRagfd10PPWryFRSzLPIivfAXHJ.jpg",
                "release_date": "1973-12-18",
                "title": "Serpico",
                "video": false,
                "vote_average": 7.534,
                "vote_count": 2057,
                "character": "Mr. Serpico",
                "credit_id": "58b4642c92514177d101b8d2",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Born in New York, Sal Carollo served in World War 2 in the Army Air Force in Europe as well as Iwo Jima, retiring 26 years later at the rank of Lt. Colonel. While in the military, he organized several stage acts and brought his love of acting to stages in New York, later joining the Screen Actors' Guild. Carollo was involved in retired serviceman's affairs and also the Italian Cultural Arts and produced and acted in several plays with other Italian Americans. He had small roles in several notable pictures all through this era, particularly SERPICO as Al Pacino's father. He also worked with several visiting Italian directors including Umberto Lenzi and Lucio Fulci, scoring brief uncredited parts in both FROM CORLEONE TO BROOKLYN and THE NEW YORK RIPPER. Carollo later moved to Miami where he was active in local theater and television production. He then moved to Maryland to be closer to his family where he passed away in 2008.",
        "birthday": "1916-09-20",
        "deathday": "2008-03-14",
        "gender": 2,
        "homepage": null,
        "id": 1325672,
        "imdb_id": "nm0139067",
        "known_for_department": "Acting",
        "name": "Sal Carollo",
        "place_of_birth": "Manhasset, New York, USA",
        "popularity": 0.4332,
        "profile_path": "/dYyaImBcHAOMxVP9xzhKEiNUtuK.jpg"
    }
}