{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yjnfM8QmrXQkWl8dUimsDGl73el.jpg",
                "genre_ids": [
                    12,
                    10749,
                    36
                ],
                "id": 10907,
                "original_language": "en",
                "original_title": "The Adventures of Robin Hood",
                "overview": "Robin Hood fights nobly for justice against the evil Sir Guy of Gisbourne while striving to win the hand of the beautiful Maid Marian.",
                "popularity": 2.6754,
                "poster_path": "/4mazyXEMkmLw5h6076yyNSm9uv0.jpg",
                "release_date": "1938-05-13",
                "title": "The Adventures of Robin Hood",
                "video": false,
                "vote_average": 7.484,
                "vote_count": 800,
                "character": "Proprietor of Kent Road Tavern (uncredited)",
                "credit_id": "56fecf5b9251412a50003311",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ivan Freebody Simpson",
            "Ivan Simpson",
            "Ivan Sampson",
            "I. F. Simpson"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nIvan F. Simpson (8 February 1875 – 12 October 1951) was a Scottish film and stage actor.\n\nIvan Simpson was born in Scotland and went as a young man to New York City, where he worked for four decades on Broadway from 1906 until his death. In 1915 he started his film silent career and starred in notable silent films like The Green Goddess from 1923, where he played the role of Mister Watkins. He also replied in this role seven years later in the sound film version of The Green Goddess. In 1929 he portrayed Hugh Myers in Disraeli, where he played along his close friend George Arliss. Arliss and Simpson appeared together in a total of nine films.\n\nEspecially in the 1930s, Simpson was a successful character actor in supporting and bit parts and appeared in many classics. He often played servants, like in MGM's literature adaption David Copperfield as Littimer and the horror movie Mark of the Vampire. He also portrayed priests like in Little Lord Fauntleroy and Random Harvest, judges like in This Land Is Mine or doctors like in They All Kissed the Bride. Simpson was also a frequent actor in the Errol Flynn movies, he appeared in The Adventures of Robin Hood, The Prince and the Pauper and Captain Blood.\n\nIvan F. Simpson starred in over 100 Hollywood films, his last was My Girl Tisa from 1948. He died three years later at the age of 76 years and was buried in Kensico Cemetery. His daughter was actress Pamela Simpson (1905-2002).",
        "birthday": "1875-02-04",
        "deathday": "1951-10-12",
        "gender": 2,
        "homepage": null,
        "id": 132536,
        "imdb_id": "nm0801034",
        "known_for_department": "Acting",
        "name": "Ivan F. Simpson",
        "place_of_birth": "Glasgow, Scotland, UK",
        "popularity": 0.1495,
        "profile_path": "/mCp0eD2J5vrbaHUZTnbYuANkXe.jpg"
    }
}