{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mVLZvSe1Aa8CFKx0cInTamVZJrW.jpg",
                "genre_ids": [
                    10751,
                    16,
                    14
                ],
                "id": 110416,
                "original_language": "en",
                "original_title": "Song of the Sea",
                "overview": "The story of the last Seal Child’s journey home. After their mother’s disappearance, Ben and Saoirse are sent to live with Granny in the city. When they resolve to return to their home by the sea, their journey becomes a race against time as they are drawn into a world Ben knows only from his mother’s folktales. But this is no bedtime story; these fairy folk have been in our world far too long. It soon becomes clear to Ben that Saoirse is the key to their survival.",
                "popularity": 3.4417,
                "poster_path": "/16LQC6zpqB0l74mVWb93a2oMFnX.jpg",
                "release_date": "2014-06-23",
                "title": "Song of the Sea",
                "video": false,
                "vote_average": 8.003,
                "vote_count": 1498,
                "character": "Ben (voice)",
                "credit_id": "538b56da0e0a26670e00204a",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "David Rawle (born 16 October 2000) is an Irish actor from Carrigallen, County Leitrim. He is best known for starring in the Irish sitcom Moone Boy, co-written by and co-starring Chris O'Dowd. His first audition for acting was for Santa Claus. In 2012, he was nominated at the British Comedy Awards for Best Comedy Breakthrough Artist.\n\nBetween 2012 and 2015, David played Martin Moone in Moone Boy, an Irish sitcom on Sky One. In the series, which is set in the early 1990s, he had an imaginary friend called Seán; he is the youngest child of a family living in rural Boyle, County Roscommon. Martin, aided by his imaginary friend, has a unique perspective on life. His imagination comes into play both in his childish drawings, which come alive through animation, and in the ridiculous schemes he comes up with, against Seán's better judgement. With Seán's help, Martin negotiates life as the youngest in a chaotic, scatter-brained Irish family.\n\nHe also provides the voice of Ben in the 2014 film, Song of the Sea. Since September 2011, he has been a member of the Leitrim Youth Theatre in Carrigallen. In January 2013, he (along with Moone Boy co-star Ian O'Reilly) appeared in Bressie's music video for his single Show Me Love.",
        "birthday": "2000-10-16",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1326568,
        "imdb_id": "nm5146515",
        "known_for_department": "Acting",
        "name": "David Rawle",
        "place_of_birth": null,
        "popularity": 0.0551,
        "profile_path": "/fRTWSfCj1z4Qy2G6ZxjE58q3zo.jpg"
    }
}