{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3O5tanjVJGo8sgxC0Y8A1ecFB6d.jpg",
                "genre_ids": [
                    12,
                    35,
                    10751,
                    14
                ],
                "id": 420814,
                "original_language": "en",
                "original_title": "Christopher Robin",
                "overview": "Christopher Robin, the boy who had countless adventures in the Hundred Acre Wood, has grown up and lost his way. Now it’s up to his spirited and loveable stuffed animals, Winnie The Pooh, Tigger, Piglet, and the rest of the gang, to rekindle their friendship and remind him of endless days of childlike wonder and make-believe, when doing nothing was the very best something.",
                "popularity": 2.6729,
                "poster_path": "/i6Ytex4d3CdfIKJFxB5v5vh24vb.jpg",
                "release_date": "2018-08-01",
                "title": "Christopher Robin",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 2821,
                "character": "Train Passenger",
                "credit_id": "67a136816b609118d1264b5c",
                "order": 43
            },
            {
                "adult": false,
                "backdrop_path": "/ygiO8LyMEcHa8dwg0aLCpybPlP0.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 290762,
                "original_language": "en",
                "original_title": "Miss You Already",
                "overview": "The friendship between two life-long girlfriends is put to the test when one starts a family and the other falls ill.",
                "popularity": 1.7865,
                "poster_path": "/eQ9ra8OrZML5w9A4yib8tscgDbY.jpg",
                "release_date": "2015-09-12",
                "title": "Miss You Already",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 676,
                "character": "Staff at Charity Gala",
                "credit_id": "67c4730b89afff9e324e2d89",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Kumud Pant is an actor,model,director and film producer. Currently, he is living in Aldershot Hampshire UK.He was born 13 May 1971 in Dang district of Nepal.Having born in a small village of Nepal, near the boundary of Himalayas.In the initial days of his career, he acted in films in his hometown.He has also acted in TV series, commercials, music videos and taken part in Modeling. He took up modeling assignments in Nepal, but his career there was short-lived. He then migrated to the UK and started his modeling and acting career. His luck smiled in the UK and he began progressing in his career which he had dreamed. After his short stint in Nepali movies, he shifted to the UK and became a successful business in the entertainment industry. Currently he is running Kumud Entertainment.His father and mother were teacher.From a young age, he was very interested in acting & modeling.He lived and grew up in Dang's Teraute village.He received his school education from Rajhena High School dang Nepal and higher education from Mahendra Multiple Campus Dang.He moved to Kathmandu.In 1995 he got his first modeling job in Nepali magazine Satya Katha and he got his first movie break in a Janma Janma as a supporting role.In 1998 he moved in UK.",
        "birthday": "1971-05-13",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.kumudpant.com",
        "id": 1326945,
        "imdb_id": "nm5126893",
        "known_for_department": "Acting",
        "name": "Kumud Pant",
        "place_of_birth": "Dang Nepal",
        "popularity": 0.1199,
        "profile_path": "/6qYgWw2lI6SnzpMk6Nt7loaH7yy.jpg"
    }
}