{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hO1on1VXIPxpv1G3Z8jzGkFdeKY.jpg",
                "genre_ids": [
                    35,
                    14,
                    27
                ],
                "id": 25623,
                "original_language": "ja",
                "original_title": "ハウス",
                "overview": "Hoping to find a sense of connection to her late mother, Gorgeous takes a trip with her friends to visit her aunt's ancestral house in the countryside. The girls soon discover that there is more to the old house than meets the eye.",
                "popularity": 3.4355,
                "poster_path": "/tXlEgAJkGQuE9Vm6ppYERUBmdDM.jpg",
                "release_date": "1977-08-26",
                "title": "House",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 716,
                "character": "Hausu Karei",
                "credit_id": "5a91be34925141417700f9c5",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Yoko Kitada",
            "Yoko Minamida",
            "Youko Minamida",
            "Ёко Минамида",
            "یوکو مینامیدا"
        ],
        "biography": "Yōko Minamida (南田 洋子, Minamida Yōko, March 1, 1933 – October 21, 2009) was a Japanese actress. Born in Tokyo, Minamida made her screen debut in 1953 for the Daiei studio and quickly rose to stardom, working with Kenji Mizoguchi on two films: “A Story from Chikamatsu” and “Princess Yang Kwei-fei.”  In 1955, she moved to the Nikkatsu studio, where she starred in Takumi Furukawa’s “Season of the Sun” (1956), a smash hit that launched the so-called “Sun Tribe” boom for films about rebellious youth looking for sex and kicks on Shonan Beach — Japan’s nearest equivalent to Malibu. Minamida acted in dozens of movies for Nikkatsu, working with Shohei Imamura, Seijun Suzuki, and other directors.  In 1961 she married her co-star on “Season of the Sun,” Hiroyuki Nagato. As she acted in fewer movies after the mid-1960s, Minamida made a smooth and successful transition to TV as both an actress and MC. She also continued to appear occasionally in movies, with the last being Nobuhiko Obayashi’s “Song of Goodbye” in 2006.\n\nShe was diagnosed with Alzheimer's in November 2008, and a TV documentary was made about her condition and the efforts of her husband to care for her. She died in Tokyo.",
        "birthday": "1933-03-01",
        "deathday": "2009-10-21",
        "gender": 1,
        "homepage": null,
        "id": 132767,
        "imdb_id": "nm0590940",
        "known_for_department": "Acting",
        "name": "Yōko Minamida",
        "place_of_birth": "Tokyo, Japan",
        "popularity": 0.6076,
        "profile_path": "/pSLAagXDtvX35HbmYQh0hO7ljTN.jpg"
    }
}