{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qKWQ9IEDkMawD7sgKnIGCdFAhct.jpg",
                "genre_ids": [
                    53,
                    28,
                    18,
                    10752
                ],
                "id": 8963,
                "original_language": "en",
                "original_title": "Crimson Tide",
                "overview": "After the Cold War, a breakaway Russian republic with nuclear warheads becomes a possible worldwide threat. U.S. submarine Capt. Frank Ramsey signs on a relatively green but highly recommended Lt. Cmdr. Ron Hunter to the USS Alabama, which may be the only ship able to stop a possible Armageddon. When Ramsey insists that the Alabama must act aggressively, Hunter, fearing they will start rather than stop a disaster, leads a potential mutiny to stop him.",
                "popularity": 4.8617,
                "poster_path": "/21nqRJ6ofEgVvEl68J4O9V26Xzy.jpg",
                "release_date": "1995-05-12",
                "title": "Crimson Tide",
                "video": false,
                "vote_average": 7.181,
                "vote_count": 1871,
                "character": "Bennefield",
                "credit_id": "52fe44ccc3a36847f80aa835",
                "order": 12
            },
            {
                "adult": false,
                "backdrop_path": "/zYM9IbF08gB1Ip3Qee19HPvNY8T.jpg",
                "genre_ids": [
                    28,
                    18,
                    53,
                    80,
                    9648
                ],
                "id": 9386,
                "original_language": "en",
                "original_title": "In the Line of Fire",
                "overview": "Veteran Secret Service agent Frank Horrigan is a man haunted by his failure to save President Kennedy while serving protection detail in Dallas. Thirty years later, a man calling himself \"Booth\" threatens the life of the current President, forcing Horrigan to come back to protection detail to confront the ghosts from his past.",
                "popularity": 4.6359,
                "poster_path": "/3NvOFpmyECI3DNExYMtFIRcGMsu.jpg",
                "release_date": "1993-07-08",
                "title": "In the Line of Fire",
                "video": false,
                "vote_average": 6.965,
                "vote_count": 1685,
                "character": "Young Agent",
                "credit_id": "55e644eac3a3685f9e000b76",
                "order": 22
            },
            {
                "adult": false,
                "backdrop_path": "/1pOp56fSV4XySjaGrhb6NPD2n4r.jpg",
                "genre_ids": [
                    18,
                    36,
                    28
                ],
                "id": 10423,
                "original_language": "en",
                "original_title": "Dragon: The Bruce Lee Story",
                "overview": "This film is a glimpse into the life, love and the unconquerable spirit of the legendary Bruce Lee. From a childhood of rigorous martial arts training, Lee realizes his dream of opening his own kung-fu school in America. Before long, he is discovered by a Hollywood producer and begins a meteoric rise to fame and an all too short reign as one the most charismatic action heroes in cinema history.",
                "popularity": 2.7371,
                "poster_path": "/lxhsdC8wuGgQf0gKCt8wyHHxGcQ.jpg",
                "release_date": "1993-05-07",
                "title": "Dragon: The Bruce Lee Story",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 768,
                "character": "Joe Henderson",
                "credit_id": "5968bab7c3a368794901c8de",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/etiP3Mu3ze2j9m3FEAAyOKFYlH0.jpg",
                "genre_ids": [
                    12,
                    28,
                    53,
                    878
                ],
                "id": 563,
                "original_language": "en",
                "original_title": "Starship Troopers",
                "overview": "Set in the future, the story follows a young soldier named Johnny Rico and his exploits in the Mobile Infantry. Rico's military career progresses from recruit to non-commissioned officer and finally to officer against the backdrop of an interstellar war between mankind and an arachnoid species known as \"the Bugs.\"",
                "popularity": 7.8634,
                "poster_path": "/cxCmv23O7p3hyHwqoktHYkZcGsY.jpg",
                "release_date": "1997-11-07",
                "title": "Starship Troopers",
                "video": false,
                "vote_average": 7.089,
                "vote_count": 5185,
                "character": "Breckinridge",
                "credit_id": "5bb633520e0a2633970112af",
                "order": 21
            },
            {
                "adult": false,
                "backdrop_path": "/orSiH0y4r0BwFxNdWhNKkgPocQx.jpg",
                "genre_ids": [
                    18,
                    35,
                    10749
                ],
                "id": 12919,
                "original_language": "en",
                "original_title": "Can't Buy Me Love",
                "overview": "Nerdy high schooler Ronald Miller rescues cheerleader Cindy Mancini from parental punishment after she accidentally destroys her mother's designer clothes. Ronald agrees to pay for the $1,000 outfit on one condition: that she will act as though they're a couple for an entire month. As the days pass, however, Cindy grows fond of Ronald, making him popular. But when Ronald's former best friend gets left behind, he realizes that social success isn't everything.",
                "popularity": 3.1713,
                "poster_path": "/qK3yiqo84U3twOOKOx81c407Hpr.jpg",
                "release_date": "1987-08-14",
                "title": "Can't Buy Me Love",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 686,
                "character": "Big John",
                "credit_id": "60388dc409ed8f00426c57c1",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Big, brawny, blond-haired Eric Bruskotter owns an equally sizable and extensive acting career that transcends well over 20 years. Bruskotter, who was born on March 22, 1966 in Fort Wayne, Indiana, originally appeared most commonly in television. His first acting gig came in the form of an episode of Amazing Stories (1985). He did a few other television appearances before landing a more consistent role on the series Tour of Duty (1987), playing a member of a platoon set in the backdrop of the Vietnam War. This series lasted from 1987 up until 1989; however, Bruskotter managed to stay busy with each year as time spiraled into the 1990s. His film roles at that point in time included Dragon: The Bruce Lee Story (1993), playing an arrogant gym bully, opposite Jason Scott Lee as the lead role of martial artist Bruce Lee. 1997 would see the return of Bruskotter in a familiar soldier-type role, when he appeared in the science fiction cult movie Starship Troopers (1997). In this he played an unlucky trooper who lost his life during a training course accident. Other acting roles in his impressive resume include episodes on Walker, Texas Ranger (1993), JAG (1995), Angel (1999), 24 (2001) and Law & Order: LA (2010).",
        "birthday": "1966-03-22",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 132729,
        "imdb_id": "nm0116717",
        "known_for_department": "Acting",
        "name": "Eric Bruskotter",
        "place_of_birth": "Fort Wayne, Indiana, USA",
        "popularity": 0.5224,
        "profile_path": "/70SWj82kx9KQGdybGPvShDXJ8Er.jpg"
    }
}