{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hO1on1VXIPxpv1G3Z8jzGkFdeKY.jpg",
                "genre_ids": [
                    35,
                    14,
                    27
                ],
                "id": 25623,
                "original_language": "ja",
                "original_title": "ハウス",
                "overview": "Hoping to find a sense of connection to her late mother, Gorgeous takes a trip with her friends to visit her aunt's ancestral house in the countryside. The girls soon discover that there is more to the old house than meets the eye.",
                "popularity": 3.4355,
                "poster_path": "/tXlEgAJkGQuE9Vm6ppYERUBmdDM.jpg",
                "release_date": "1977-08-26",
                "title": "House",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 716,
                "character": "Gorgeous / Gorgeous' Mother",
                "credit_id": "5a91bcb60e0a2616c00105bb",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "کیمیکو ایکه‌گامی"
        ],
        "biography": "Kimiko Ikegami (born January 16, 1959) is a Japanese actress. Born in Manhattan, New York City, she moved to Kyoto at age 3. Kimiko graduated from Horikoshi High School in Nakano, Tokyo and subsequently attended Tamagawa University. She is closely related to the Bandō Mitsugorō kabuki actors: her grandfather was the eighth, her uncle the ninth (later Bandō Minosuke VII), her cousin (Bandō Yasosuke V) the tenth to take that name. With the encouragement of that cousin, Kimiko turned to acting.\n\nShe made her television debut in 1975 in the NHK show Maboroshi no Pen Friend, and in that year also appeared in Ai to Makoto on TV Tokyo. Her entry into film came in 1975, when she appeared in Hadashi no Seishun (Shochiku). In Taiga drama series, Kimiko portrayed Ōhime Kusa Moeru (1979) Chacha (later named Yodo-Dono) in the 1981 Onna Taikō-ki, Lady Tsukiyama (the wife of the title character) in Tokugawa Ieyasu (1983), and Eri (Lady Aburakawa, concubine of the title character) in Takeda Shingen. Other jidaigeki roles have included Sumi in the 1988 NHK Miyamoto Musashi Okon in Tōyama no Kin-san (1989), and Nami in the 2003 TV Tokyo Chūshingura: Ketsudan no Toki. Contemporary roles include the yakuza in Gokudō no Onna-tachi Revenge (the thirteenth in the series) and the female lead in Shiroi Kyotō (TV Asahi, 1990). She appears frequently as a guest star on television series such as Mito Kōmon.\n\nKimiko also recorded a song, Nagasarete, on the Victor Entertainment label. The 1984 release (as of 2006, out of print) was the theme song for the show Kiryūin Hanako no Shōgai.\n\nHer honors include the 1990 Japan Jewellery Association Best Dresser Award.\n\nDescription above from the Wikipedia article Kimiko Ikegami, licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": "1959-01-16",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 132765,
        "imdb_id": "nm0407475",
        "known_for_department": "Acting",
        "name": "Kimiko Ikegami",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 1.3962,
        "profile_path": "/unbBKgKpbm4hgv936WzxBBiVoio.jpg"
    }
}