{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6qOyw4yfzbzTp5YsCX26C28Do0S.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 872,
                "original_language": "en",
                "original_title": "Singin' in the Rain",
                "overview": "In 1927 Hollywood, a silent film star falls for a chorus girl just as he and his paranoid screen partner struggle to make the difficult transition to talking pictures.",
                "popularity": 4.2669,
                "poster_path": "/w03EiJVHP8Un77boQeE7hg9DVdU.jpg",
                "release_date": "1952-04-10",
                "title": "Singin' in the Rain",
                "video": false,
                "vote_average": 8.146,
                "vote_count": 3306,
                "character": "Lina Lamont",
                "credit_id": "52fe4285c3a36847f8025705",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/pDGkMdMHkl1qRAYmQjdLKVx3euQ.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 16958,
                "original_language": "en",
                "original_title": "The Asphalt Jungle",
                "overview": "Recently paroled from prison, legendary burglar \"Doc\" Riedenschneider, with funding from Alonzo Emmerich, a crooked lawyer, gathers a small group of veteran criminals together in the Midwest for a big jewel heist.",
                "popularity": 5.2891,
                "poster_path": "/8xsUnT0P2fJWQv9jGDhs3i9Zx2l.jpg",
                "release_date": "1950-05-12",
                "title": "The Asphalt Jungle",
                "video": false,
                "vote_average": 7.493,
                "vote_count": 504,
                "character": "Doll Conovan",
                "credit_id": "52fe46f99251416c75089ce3",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jean Shirley Verhagen",
            "Jean Verhagen"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nJean Hagen (born Jean Shirley Verhagen, August 3, 1923 – August 29, 1977) was an American actress best known for her role as Lina Lamont in Singin' in the Rain (1952), for which she was nominated for an Academy Award for Best Supporting Actress. Hagen was also nominated three times for an Emmy Award for Best Supporting Actress in a Comedy Series for her role as Margaret Williams (1953–56) on the television series Make Room For Daddy.\n\nHer film debut was as a comical femme fatale in the Spencer Tracy and Katharine Hepburn 1949 classic Adam's Rib, directed by George Cukor. The Asphalt Jungle (1950) provided Hagen with her first starring role alongside Sterling Hayden. Hagen received excellent reviews playing \"Doll\" Conover, a woman who sticks by criminal Dix's side until the bitter end. She appeared too in the film noir Side Street (1950) playing a gangster's sincere but none-too-bright nightclub-singer girlfriend.\n\nHagen is best remembered for her comic performance in Singin' in the Rain as the vain and talentless silent movie star Lina Lamont. She received an Academy Award nomination for Best Supporting Actress for this memorable performance.\n\nBy 1953, she had joined the cast of the television sitcom Make Room for Daddy. For her portrayal as the first wife of Danny Thomas, Hagen received three Emmy Award nominations, but after three seasons, she grew dissatisfied with the role and left the series. Thomas, who also produced the show, reportedly did not appreciate Hagen's departing the successful series, and her character was killed off rather than recast. This was the first TV character to be killed off in a family sitcom. Marjorie Lord was cast a year later as Danny's second wife and played opposite Thomas successfully for the remainder of the series.\n\nIn 1957 Hagen co-starred in an episode of Alfred Hitchcock Presents titled \"Enough Rope for Two\", portraying a woman who accompanies two thieves trying to retrieve stolen money from a desert mine shaft. She then appeared as Elizabeth in the 1960 episode \"Once Upon a Knight\" on CBS's anthology series The DuPont Show with June Allyson; and the following year she guest-starred on The Andy Griffith Show in the episode \"Andy and the Woman Speeder\".\n\nAlthough she made frequent guest appearances in various television series, Hagen was unable to successfully resume her film career in starring roles. After appearing with Fred MacMurray in the Disney comedy The Shaggy Dog (1959), Hagen for the remainder of her career played supporting roles, such as Marguerite LeHand, personal secretary to Franklin Delano Roosevelt in Sunrise at Campobello (1960), and the friend of Bette Davis in Dead Ringer (1964). In the 1960s, Hagen's health began to decline and she spent many years hospitalized or under medical care. Much later, in 1976, she made a comeback of sorts playing character roles in episodes of the television series Starsky and Hutch and The Streets of San Francisco. She, however, made her final acting appearance the next year in the television movie Alexander: The Other Side of Dawn.",
        "birthday": "1923-08-03",
        "deathday": "1977-08-29",
        "gender": 1,
        "homepage": null,
        "id": 13296,
        "imdb_id": "nm0353405",
        "known_for_department": "Acting",
        "name": "Jean Hagen",
        "place_of_birth": "Chicago, Illinois, USA",
        "popularity": 0.2808,
        "profile_path": "/nNhtN5Kk7JiwwP2qpxmzyqUyXVi.jpg"
    }
}