{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6qOyw4yfzbzTp5YsCX26C28Do0S.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 872,
                "original_language": "en",
                "original_title": "Singin' in the Rain",
                "overview": "In 1927 Hollywood, a silent film star falls for a chorus girl just as he and his paranoid screen partner struggle to make the difficult transition to talking pictures.",
                "popularity": 4.2669,
                "poster_path": "/w03EiJVHP8Un77boQeE7hg9DVdU.jpg",
                "release_date": "1952-04-10",
                "title": "Singin' in the Rain",
                "video": false,
                "vote_average": 8.146,
                "vote_count": 3306,
                "character": "R.F. Simpson",
                "credit_id": "52fe4285c3a36847f8025709",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia.\n\nMillard Mitchell (August 14, 1903 – October 13, 1953) was an American character actor whose credits include roughly thirty feature films and two television appearances.\n\nBorn in Havana, Cuba, Mitchell appeared as a bit player in eight films between 1931 and 1936. He returned to film work in 1942 after a six-year absence. Between 1942 and 1953, Mitchell was a successful supporting actor.\n\nFor his performance in the 1952 film, My Six Convicts, Millard Mitchell won the Golden Globe Award for Best Supporting Actor. Mitchell is also known for his role as Col. Rufus Plummer in Billy Wilder's A Foreign Affair (1948), as Gregory Peck's commanding officer in the war drama Twelve O'Clock High (1949), and as movie mogul \"R. F. Simpson\" in the musical comedy Singin' in the Rain (1952).\n\nMitchell died at the age of fifty from lung cancer in Santa Monica, California and was interred in the Holy Cross Cemetery in Culver City, California.\n\nDescription above from the Wikipedia article Millard Mitchell, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1903-08-14",
        "deathday": "1953-10-13",
        "gender": 2,
        "homepage": null,
        "id": 13297,
        "imdb_id": "nm0593612",
        "known_for_department": "Acting",
        "name": "Millard Mitchell",
        "place_of_birth": "Havana, Cuba",
        "popularity": 2.0982,
        "profile_path": "/elMhz4DvHUu5OK8hdC3cpzPwGEk.jpg"
    }
}