{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tupgjqhWx5oieQrdyesO3aclUX9.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 597,
                "original_language": "en",
                "original_title": "Titanic",
                "overview": "101-year-old Rose DeWitt Bukater tells the story of her life aboard the Titanic, 84 years later. A young Rose boards the ship with her mother and fiancé. Meanwhile, Jack Dawson and Fabrizio De Rossi win third-class tickets aboard the ship. Rose tells the whole story from Titanic's departure through to its death—on its first and last voyage—on April 15, 1912.",
                "popularity": 23.0816,
                "poster_path": "/9xjZS2rlVxm8SFx8kPC3aIGCOYQ.jpg",
                "release_date": "1997-11-18",
                "title": "Titanic",
                "video": false,
                "vote_average": 7.906,
                "vote_count": 26321,
                "character": "Steward Barnes",
                "credit_id": "5880c766c3a368310600c142",
                "order": 72
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "John Page"
        ],
        "biography": "Oliver Page is an accomplished English actor known for his work in both live-action and voice acting. Trained at the prestigious Webber Douglas Academy of Dramatic Arts in London, he has built a versatile career spanning film, television, and voice-over roles.\n\nHe gained recognition for his portrayal of Steward Barnes in James Cameron's iconic Titanic (1997). Additionally, he has contributed his voice talents to numerous projects with Saban Entertainment and Bandai Entertainment, including roles in the Power Rangers and Gundam series.\n\nOriginally born Jon Page on May 26, 1960, he adopted the name Oliver Page upon joining the Screen Actors Guild.\n\nLooking ahead, his narration of H.G. Wells’ The War of the Worlds, adapted from the original 1898 edition, is set for release in 2025 as both an audio and visual book.\n\nOliver resides on the south coast of England in Brighton with his partner Melody and their beloved black Labrador, Barney Baroni, who has become a local sensation for his enthusiastic skateboarding skills.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1330728,
        "imdb_id": "nm0656297",
        "known_for_department": "Acting",
        "name": "Oliver Page",
        "place_of_birth": null,
        "popularity": 0.6414,
        "profile_path": "/9kXbWxFJSG7m0URJfZqCjIQXeaU.jpg"
    }
}