{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lh6MbyxwCribn3hdAo81xLdPGoV.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 873,
                "original_language": "en",
                "original_title": "The Color Purple",
                "overview": "An epic tale spanning forty years in the life of Celie, an African-American woman living in the South who survives incredible abuse and bigotry. After Celie's abusive father marries her off to the equally debasing 'Mister' Albert Johnson, things go from bad to worse, leaving Celie to find companionship anywhere she can. She perseveres, holding on to her dream of one day being reunited with her sister in Africa.",
                "popularity": 2.9875,
                "poster_path": "/6bvxkcTAXyqxGRwo38mxw92D6Xr.jpg",
                "release_date": "1985-12-18",
                "title": "The Color Purple",
                "video": false,
                "vote_average": 7.75,
                "vote_count": 1880,
                "character": "Squeak",
                "credit_id": "52fe4285c3a36847f8025827",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/5l3Xb2WQR0nXiVhbj5rAv0z4xsZ.jpg",
                "genre_ids": [
                    12,
                    18
                ],
                "id": 62204,
                "original_language": "fr",
                "original_title": "La Guerre du feu",
                "overview": "In the prehistoric world, a Cro-Magnon tribe depends on an ever-burning source of fire, which eventually extinguishes. Lacking the knowledge to start a new fire, the tribe sends three warriors on a quest for more. With the tribe's future at stake, the warriors make their way across a treacherous landscape full of hostile tribes and monstrous beasts. On their journey, they encounter Ika, a woman who has the knowledge they seek.",
                "popularity": 2.6316,
                "poster_path": "/tyzW1M00xfHKNtmTlT6wJ3F4pNr.jpg",
                "release_date": "1981-12-16",
                "title": "Quest for Fire",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 539,
                "character": "Ika",
                "credit_id": "52fe4675c3a368484e091cf1",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "ری داون چونگ"
        ],
        "biography": "Rae Dawn Chong, a Canadian-American actress, has graced screens for decades. Born in Edmonton in 1961, the daughter of comedian Tommy Chong, her heritage reflects a rich mix of African-American, Native American, Asian, and Scottish-Irish ancestry. After her debut in the 1978 film \"Stony Island,\" Chong's breakthrough came in 1981 with \"Quest for Fire,\" which earned her a prestigious Genie Award for Best Actress. Throughout the 80s, she thrived with diverse roles in films like \"Beat Street,\" \"The Color Purple,\" \"Commando,\" and \"Soul Man,\" showcasing her versatility across comedies, dramas, and thrillers. Continuing to act in the 90s and beyond, Chong has also been a philanthropist, supporting charities and even discovering a future star (Chris Pratt) during his early days as a waiter. With her impactful performances, Rae Dawn Chong remains a remarkable figure in the entertainment industry.",
        "birthday": "1961-02-28",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 13312,
        "imdb_id": "nm0001044",
        "known_for_department": "Acting",
        "name": "Rae Dawn Chong",
        "place_of_birth": "Edmonton, Alberta, Canada",
        "popularity": 0.8613,
        "profile_path": "/aj9fFFKH3QZX2FSJsj81I4y12M7.jpg"
    }
}