{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kpBl6nGmRaUKmvASc1S3hB9F71q.jpg",
                "genre_ids": [
                    18
                ],
                "id": 177945,
                "original_language": "ja",
                "original_title": "そして父になる",
                "overview": "Ryota Nonomiya is a successful businessman driven by money. He learns that his biological son was switched with another child after birth. He must make a life-changing decision and choose his true son or the boy he raised as his own.",
                "popularity": 4.0419,
                "poster_path": "/r0nejXOf6e4leWhnLuEQOmC5hrX.jpg",
                "release_date": "2013-09-24",
                "title": "Like Father, Like Son",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 759,
                "character": "",
                "credit_id": "5d87dd455a469000219d454f",
                "order": 43
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Keiji Nakazawa was born in Hiroshima, Japan in 1939. His father was opposed to Japan being involved in a war that they would lose and that it was a reckless war. But when he was six years old, the first nuclear weapon has detonated above his home of Hiroshima, killing his father sister, and little brother. He and his mother had to struggle for survival in the chaotic aftermath. Even the most basic information on radiation and it's effects were classified until 1957 and those who were victims had to hide their origins, or face discrimination, as many outsiders thought they carried disease or even a curse.\n\nKeiji became an artist in Tokyo, publishing his first work in 1963, his first creations being boys' adventure stories such as \"Spark One\" and \"Space Giraffe\". But in 1966 he rushed home for his mother's funeral and was angered by the fact that there were so few bone fragments left of his mother's cremated remains. When he had dug his father and siblings out of the ruins, their skulls were in tact, so he felt that in his mother's case, the bomb had deprived her of even her bones, after surviving 21 years on. He vowed never to endure wars and atomic bombs, returned to Tokyo and risked pariah status by openly discussing his experiences of the bomb and then writing of them, with the first of his \"Black\" series, \"Beneath The Black Rain\".\n\nIn 1972 the boys' magazine \"Shonen Jump\" began running stories about the lives of manga artists, Keiji used it as a platform to publish \"I Saw It\", an account of Hiroshima, which eventually formed the opening chapters of his ten-volume series \"Hadashi no Gen\" (aka Barefoot Gen). It was published at the height of the cold war and shortly after student demonstrations over Japan's \"Security Treaty\" with the US. Large publishers had previously refused to publish it out of fear of finding themselves on CIA blacklists. The family saga was not completed until 1987.\n\nLater volumes (two of which became the basis for Barefoot Gen 2 (1986) detail the attempts of the survivors to stay alive in the ruins and were told in a cartoon-ish style that was popular in comics in the 1970s. A group of Americans including Jared Cook and Frederik L. Schodt acquired copies of Barefoot Gen and began \"Project Gen\". The group was formed by a group of students from Japan, USA and Russian that sought to translate the manga series into several languages and distribute them worldwide as an attempt to spread an anti war/nuclear weapons message. The story was also adapted into live action films (the first of which won Best Screenplay at the Czech Film Festival in 1977) and two animated versions. Keiji is credited as screenwriter for the 1st anime, but had no direct involvement in the 2nd.\n\nKeiji went on to write many more manga, including some more that involved the Japanese experience surrounding the second world war, such as \"Okonomi Ha-chan\" which was turned into a live action movie (Okonomi Hatchan (1999)), with Keiji writing and directing.",
        "birthday": "1939-03-14",
        "deathday": "2012-12-19",
        "gender": 2,
        "homepage": null,
        "id": 133117,
        "imdb_id": "nm0620451",
        "known_for_department": "Writing",
        "name": "Keiji Nakazawa",
        "place_of_birth": "Hiroshima, Japan",
        "popularity": 0.1692,
        "profile_path": null
    }
}