{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rl95VDEP3nsUQmGzE0S1S7y6T0N.jpg",
                "genre_ids": [
                    10752,
                    28
                ],
                "id": 190859,
                "original_language": "en",
                "original_title": "American Sniper",
                "overview": "U.S. Navy SEAL Chris Kyle takes his sole mission—protect his comrades—to heart and becomes one of the most lethal snipers in American history. His pinpoint accuracy not only saves countless lives but also makes him a prime target of insurgents. Despite grave danger and his struggle to be a good husband and father to his family back in the States, Kyle serves four tours of duty in Iraq. However, when he finally returns home, he finds that he cannot leave the war behind.",
                "popularity": 8.8358,
                "poster_path": "/i1U46OwMc6vlm7OoSUKfqUH615e.jpg",
                "release_date": "2014-12-25",
                "title": "American Sniper",
                "video": false,
                "vote_average": 7.418,
                "vote_count": 13266,
                "character": "MRAP Gunner",
                "credit_id": "5636aaa3c3a3681b5c01d5ce",
                "order": 41
            }
        ],
        "crew": []
    },
    "details": {
        "adult": true,
        "also_known_as": [
            "David Taylor"
        ],
        "biography": "Greg Duke is an American actor, model, and former adult gay pornographic actor under the name David Taylor. Duke got his early break in gay porn with websites like Jake Cruise and Cocksure Men, where he could sometimes be found in bareback scenes. He was then snapped up as an exclusive by Raging Stallion and named its joint 2010 Man of the Year. Duke, who stands well over 6ft tall, was born in San Diego, California, was raised in the mid-west, and was a keen athlete in college. After spending time in the Marines, he modeled and acted back in California - appearing in such TV shows and films as General Hospital, Bewitched, CSI Miami, and Alias. He also appeared in soft-core porn before hardcore came along. Duke, who describes himself as bisexual, was born under the sign of Leo.",
        "birthday": "1978-08-06",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1331135,
        "imdb_id": "nm3209548",
        "known_for_department": "Acting",
        "name": "Greg Duke",
        "place_of_birth": "San Diego, California, USA",
        "popularity": 4.212,
        "profile_path": "/spfa6mkeKDHXkS9Soimo29B1Za7.jpg"
    }
}