{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/R5yzaNz6IE2107lcmnzBSerCBP.jpg",
                "genre_ids": [
                    36,
                    18,
                    9648
                ],
                "id": 11450,
                "original_language": "en",
                "original_title": "Quiz Show",
                "overview": "Herbert Stempel's transformation into an unexpected television personality unfolds as he secures victory on the cherished American game show, 'Twenty-One.' However, when the show introduces the highly skilled contestant Charles Van Doren to replace Stempel, it compels Stempel to let out his frustrations and call out the show as rigged. Lawyer Richard Goodwin steps in and attempts to uncover the orchestrated deception behind the scenes.",
                "popularity": 3.0698,
                "poster_path": "/yoGJo1h3Hl2exXPVcG9UXWDENtX.jpg",
                "release_date": "1994-08-25",
                "title": "Quiz Show",
                "video": false,
                "vote_average": 7.263,
                "vote_count": 939,
                "character": "Mark Van Doren",
                "credit_id": "52fe44429251416c7502e647",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "David Paul Scofield CH CBE (21 January 1922 – 19 March 2008) was an English actor. During a seven-decade career, Scofield achieved the Triple Crown of Acting, winning an Academy Award, Emmy, and Tony for his work. He won the three awards in a seven-year span, the fastest of any performer to accomplish the feat.\n\nScofield received Best Performance by a Leading Actor in a Play at the 1962 Tony Awards for portraying Sir Thomas More in the Broadway production of A Man for All Seasons. Four years later, he won the Academy Award for Best Actor when he reprised the role in the 1966 film adaptation, making him one of nine to receive a Tony and Academy Award for the same role. His Emmy Award for Outstanding Lead Actor in a Miniseries or a Movie was achieved for the 1969 television film Male of the Species.\n\nPreferring the stage to the screen and putting his family before his career, Scofield nonetheless established a reputation as one of the greatest Shakespearean performers. Among other accolades, his performance as Mark Van Doren in Quiz Show (1994) earned him an Academy Award nomination for Best Supporting Actor and he won Best Actor in a Supporting Role at the BAFTA Awards for portraying Thomas Danforth in The Crucible (1996). Scofield declined the honour of a knighthood, but was appointed CBE in 1956 and became a Companion of Honour in 2001.\n\nDescription above from the Wikipedia article Paul Scofield, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1922-01-21",
        "deathday": "2008-03-19",
        "gender": 2,
        "homepage": null,
        "id": 13324,
        "imdb_id": "nm0006890",
        "known_for_department": "Acting",
        "name": "Paul Scofield",
        "place_of_birth": "Hurstpierpoint, West Sussex, England, UK",
        "popularity": 0.2486,
        "profile_path": "/c9GUKYC5Ew14jUBL70i2gdGRuMp.jpg"
    }
}