{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bz7pwNGCbV576COsDcYN9MbEACC.jpg",
                "genre_ids": [
                    28,
                    53,
                    12
                ],
                "id": 370172,
                "original_language": "en",
                "original_title": "No Time to Die",
                "overview": "Bond has left active service and is enjoying a tranquil life in Jamaica. His peace is short-lived when his old friend Felix Leiter from the CIA turns up asking for help. The mission to rescue a kidnapped scientist turns out to be far more treacherous than expected, leading Bond onto the trail of a mysterious villain armed with dangerous new technology.",
                "popularity": 8.5332,
                "poster_path": "/iUgygt3fscRoKWCV1d0C7FbM9TP.jpg",
                "release_date": "2021-09-29",
                "title": "No Time to Die",
                "video": false,
                "vote_average": 7.356,
                "vote_count": 6662,
                "character": "MI6 Security Guard",
                "credit_id": "615b026e172d7f00453888bb",
                "order": 22
            },
            {
                "adult": false,
                "backdrop_path": "/6MKr3KgOLmzOP6MSuZERO41Lpkt.jpg",
                "genre_ids": [
                    35,
                    80,
                    12
                ],
                "id": 337404,
                "original_language": "en",
                "original_title": "Cruella",
                "overview": "In 1970s London amidst the punk rock revolution, a young grifter named Estella is determined to make a name for herself with her designs. She befriends a pair of young thieves who appreciate her appetite for mischief, and together they are able to build a life for themselves on the London streets. One day, Estella’s flair for fashion catches the eye of the Baroness von Hellman, a fashion legend who is devastatingly chic and terrifyingly haute. But their relationship sets in motion a course of events and revelations that will cause Estella to embrace her wicked side and become the raucous, fashionable and revenge-bent Cruella.",
                "popularity": 11.2552,
                "poster_path": "/hjS9mH8KvRiGHgjk6VUZH7OT0Ng.jpg",
                "release_date": "2021-05-26",
                "title": "Cruella",
                "video": false,
                "vote_average": 7.987,
                "vote_count": 9719,
                "character": "Ipswich Manor Security Guard",
                "credit_id": "60b1619c72d855004072b39b",
                "order": 26
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Javone Prince-Keaton"
        ],
        "biography": "Javone Prince is a British comedian and actor. He has appeared in many British comedy television shows, such as Horrible Histories, Sorry, I've Got No Head and Little Miss Jocelyn. He also Featured in The Dumping Ground as the character Lethal G. Prince is best known for starring as Jerwayne in PhoneShop. Prince also appears in several theatre productions including, Measure for Measure, Titus Andronicus and Richard III. He trained at LAMDA and is currently a member of the National Theatre.",
        "birthday": "1975-07-03",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1333631,
        "imdb_id": "nm1574883",
        "known_for_department": "Acting",
        "name": "Javone Prince",
        "place_of_birth": "London, England, UK",
        "popularity": 0.1636,
        "profile_path": "/byUv4ce1zA2irZlitzlGUbtOS86.jpg"
    }
}