{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mDCUbXd8P3EntOG2JYq7JhpZTTV.jpg",
                "genre_ids": [
                    18,
                    80,
                    53
                ],
                "id": 22803,
                "original_language": "en",
                "original_title": "Law Abiding Citizen",
                "overview": "A frustrated man decides to take justice into his own hands after a plea bargain sets one of his family's killers free. He targets not only the killer but also the district attorney and others involved in the deal.",
                "popularity": 7.3381,
                "poster_path": "/fcEXcip7v0O1ndV4VUdFqJSqbOg.jpg",
                "release_date": "2009-10-15",
                "title": "Law Abiding Citizen",
                "video": false,
                "vote_average": 7.389,
                "vote_count": 5402,
                "character": "Nick's Security Detail (uncredited)",
                "credit_id": "65f8c537a3144001313639dd",
                "order": 46
            },
            {
                "adult": false,
                "backdrop_path": "/2Xe9lISpwXKhvKiHttbFfVRERQX.jpg",
                "genre_ids": [
                    18,
                    35,
                    36
                ],
                "id": 490132,
                "original_language": "en",
                "original_title": "Green Book",
                "overview": "Tony Lip, a bouncer in 1962, is hired to drive pianist Don Shirley on a tour through the Deep South in the days when African Americans, forced to find alternate accommodations and services due to segregation laws below the Mason-Dixon Line, relied on a guide called The Negro Motorist Green Book.",
                "popularity": 15.5623,
                "poster_path": "/7BsvSuDQuoqhWmU2fL7W2GOcZHU.jpg",
                "release_date": "2018-11-16",
                "title": "Green Book",
                "video": false,
                "vote_average": 8.226,
                "vote_count": 12249,
                "character": "Macon Cop #2",
                "credit_id": "600d1852813cb600417e74cd",
                "order": 52
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Brian Distance is an American film and television actor known for his portrayals as the \"tough-yet-honest\" law enforcement officer. He has appeared in numerous film, television and off-Broadway productions. Brian Distance is known for his recurring role on NCIS: New Orleans (CBS) as New Orleans Police Department Sergeant Gordon, and co-star appearances on Billions (Showtime), Bull (CBS), Blindspot (NBC), Daredevil (Netflix), The Mysteries of Laura (NBC), House of Cards (Netflix), 30 Rock (NBC), and a host of other movies and television shows.\n\nBrian Distance was born in Baltimore, Maryland. At a very young age, he cultivated his love for theatre and the performing arts by appearing in several grade school and high school plays.\n\nAfter witnessing first-hand the September 11th terrorist attacks in the Financial District in New York City, Brian left his job as an investment bank finance attorney to return to his true passion, acting. To further hone his acting chops, Brian graduated from the prestigious William Esper Studio (NYC) Two-Year Professional Actor Training Program. Since then, Brian has appeared in countless feature films, network and cable television programs, and off-Broadway productions.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.BrianDistance.com",
        "id": 1334324,
        "imdb_id": "nm3309592",
        "known_for_department": "Acting",
        "name": "Brian Distance",
        "place_of_birth": "Baltimore, Maryland, USA",
        "popularity": 0.0831,
        "profile_path": "/xBl5YijUuWN1PK2OYUB3h435kbC.jpg"
    }
}