{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wSiBXaJ2PtlxUGH2waIxQZjFPhg.jpg",
                "genre_ids": [
                    28,
                    12,
                    35,
                    80
                ],
                "id": 11576,
                "original_language": "en",
                "original_title": "It's a Mad, Mad, Mad, Mad World",
                "overview": "A group of strangers come across a man dying after a car crash who proceeds to tell them about the $350,000 he buried in California. What follows is the madcap adventures of those strangers as each attempts to claim the prize for himself.",
                "popularity": 7.3665,
                "poster_path": "/j4mWzOisSHFkaqIkq34l2mm8a5K.jpg",
                "release_date": "1963-11-07",
                "title": "It's a Mad, Mad, Mad, Mad World",
                "video": false,
                "vote_average": 6.97,
                "vote_count": 637,
                "character": "Reporter (uncredited)",
                "credit_id": "61d0b4f4a275020041e278b2",
                "order": 52
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Stanislaw Klimowicz"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nStanley Clements (July 16, 1926 – October 16, 1981) was an American actor and comedian.\n\nStanley Clements was born Stanislaw Klimowicz in Long Island, New York. Young Stan realized that he wanted a show-business career while he was in grammar school, and when he graduated from college he toured in vaudeville for two years. He then joined the touring company of the Major Bowes Amateur Hour. In 1941, he was signed to a contract by 20th Century Fox and appeared in several B films for the studio.\n\nAfter a short stint with the East Side Kids, he set out on his own again, this time landing roles in more prestigious pictures. He was featured in the Bing Crosby hit Going My Way, and scored a great success as a jockey in the Alan Ladd feature Salty O'Rourke. His career was interrupted by military service in World War II, and when he returned, he began appearing in lower-budgeted films, including Johnny Holiday (cast against type as a psychopath). He starred in a series of action/detective pictures at Allied Artists for producer Ben Schwalb and director Edward Bernds.\n\nSchwalb soon became staff producer for The Bowery Boys, and when he needed a replacement for Leo Gorcey in 1956, he asked Clements to step in. Clements comfortably settled into the role of Huntz Hall's sidekick, beginning with Fighting Trouble, and co-starred in the final seven Bowery Boys comedies.\n\nThe series finally ended in 1958, and Clements went on to a steady career of supporting roles in film and TV until his death from emphysema in 1981. One of his last jobs was an appearance in a nationally advertised commercial for Pringle's potato chips.\n\nStanley Clements died of emphysema in Pasadena, California, and is buried at Riverside National Cemetery in Riverside, California.\n\nDescription above from the Wikipedia article Stanley Clements,licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1926-07-16",
        "deathday": "1981-10-16",
        "gender": 2,
        "homepage": null,
        "id": 133436,
        "imdb_id": "nm0166265",
        "known_for_department": "Acting",
        "name": "Stanley Clements",
        "place_of_birth": "Long Island, New York, USA",
        "popularity": 0.3267,
        "profile_path": "/gZTuaIB3WAFlgjeSG5CatqWNlWf.jpg"
    }
}