{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3i6H4cVfvWh55sN1iXyeb8Q50nY.jpg",
                "genre_ids": [
                    80,
                    28,
                    18
                ],
                "id": 877,
                "original_language": "en",
                "original_title": "Scarface",
                "overview": "In 1920s Chicago, Italian immigrant and notorious thug, Antonio 'Tony' Camonte, aka Scarface, shoots his way to the top of the mobs while trying to protect his sister from the criminal life.",
                "popularity": 3.0024,
                "poster_path": "/y4E5oRiHMTFkEB12IIcpbKbKzDW.jpg",
                "release_date": "1932-04-09",
                "title": "Scarface",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 634,
                "character": "Antonio 'Tony' Camonte",
                "credit_id": "52fe4286c3a36847f8025af9",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Пол Муни",
            "Meshilem Meier Weisenfreund",
            "Frederich Meshilem Meier Weisenfreund"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nPaul Muni (born Meshilem Meier Weisenfreund, September 22, 1895 – August 25, 1967) was an Austrian-Hungarian-born American stage and film actor. During the 1930s, he was considered the most prestigious actor at Warner Brothers studios, and one of the rare actors who was given the privilege of choosing which parts he wanted.\n\nHis acting quality, usually playing a powerful character, such as Scarface, was partly a result of his intense preparation for his parts, often immersing himself in study of the real character's traits and mannerisms. He was also highly skilled in using makeup techniques, a talent he learned from his parents, who were also actors, and from his early years on stage with the Yiddish Theater, in New York. At the age of 12, he played the stage role of an 80-year-old man; in one of his films, Seven Faces, he played seven different characters.\n\nHe was nominated six times for an Oscar, winning once as Best Actor in The Story of Louis Pasteur.\n\nDescription above from the Wikipedia article Paul Muni, licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": "1895-09-21",
        "deathday": "1967-08-25",
        "gender": 2,
        "homepage": null,
        "id": 13352,
        "imdb_id": "nm0612847",
        "known_for_department": "Acting",
        "name": "Paul Muni",
        "place_of_birth": "Lemberg, Galicia, Austria-Hungary [now Lviv, Ukraine]",
        "popularity": 0.4019,
        "profile_path": "/zBWkurrylrxKRmcOmN7bI9XlmBn.jpg"
    }
}