{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3i6H4cVfvWh55sN1iXyeb8Q50nY.jpg",
                "genre_ids": [
                    80,
                    28,
                    18
                ],
                "id": 877,
                "original_language": "en",
                "original_title": "Scarface",
                "overview": "In 1920s Chicago, Italian immigrant and notorious thug, Antonio 'Tony' Camonte, aka Scarface, shoots his way to the top of the mobs while trying to protect his sister from the criminal life.",
                "popularity": 3.0024,
                "poster_path": "/y4E5oRiHMTFkEB12IIcpbKbKzDW.jpg",
                "release_date": "1932-04-09",
                "title": "Scarface",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 634,
                "character": "Francesca 'Cesca' Camonte",
                "credit_id": "52fe4286c3a36847f8025afd",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Anna McKim",
            "Ann McKim",
            "Baby Anna Lehr",
            "Anna Lehr"
        ],
        "biography": "Ann Dvorak (born Anna McKim; August 2, 1911 – December 10, 1979) was an American stage and film actress. Asked how to pronounce her adopted surname, she told The Literary Digest: \"My fake name is properly pronounced vor'shack. The D remains silent.\"\n\nDvorak was the daughter and only child of silent film actress Anna Lehr and director Edwin McKim. While in New York, she attended St. Catherine's Convent. After moving to California, she attended Page School for Girls in Hollywood.\n\nShe made her film debut when she was five years old in the silent film version of Ramona (1916), credited as \"Baby Anna Lehr\". She continued in children's roles in The Man Hater (1917) and Five Dollar Plate (1920), but then stopped acting in films. Her parents separated in 1916 and divorced in 1920; she did not see her father again until 13 years later, when she made a public plea to the press to help her find him.\n\nIn the late 1920s, Dvorak worked as a dance instructor and gradually began to appear on film as a chorus girl. Her friend, actress Karen Morley, introduced her to billionaire movie producer Howard Hughes, who groomed her as a dramatic actress. She was a success in such pre-Code films as Scarface (1932) as Paul Muni's sister; in Three on a Match (1932) with Bette Davis and Joan Blondell as the doomed, unstable Vivian; in The Crowd Roars (1932) with James Cagney; and in Sky Devils (1932) opposite Spencer Tracy. Known for her style and elegance, she was a popular leading lady for Warner Bros. during the 1930s, and appeared in numerous contemporary romances and melodramas.  At age 19, Dvorak eloped with Leslie Fenton, her English co-star from The Strange Love of Molly Louvain (1932), and they married on March 17, 1932. They left for a year-long honeymoon in spite of her contractual obligations to the studio, which led to a period of litigation and pay disputes during which she discovered she was making the same amount of money as the boy who played her son in Three on a Match. She completed her contract on permanent suspension, then worked as a freelancer. Although she worked regularly, the quality of her scripts declined sharply.  She appeared as secretary Della Street to Donald Woods' Perry Mason in The Case of the Stuttering Bishop (1937). With her then-husband, Leslie Fenton, Dvorak traveled to England where she supported the war effort by working as an ambulance driver and acted in several British films. She appeared as a saloon singer in Abilene Town with Randolph Scott and Edgar Buchanan, released in 1946. The following year she adeptly handled comedy by giving an assured performance in Out of the Blue (1947). In 1948, Dvorak gave her only performance on Broadway in The Respectful Prostitute.\n\nDvorak's marriage to Fenton ended in divorce in 1946. In 1947, she married Igor Dega, a Russian dancer who danced with her briefly in The Bachelor's Daughters. The marriage ended two years later.\n\nDvorak retired from the screen in 1951, when she married her third and last husband, Nicholas Wade, to whom she remained married until his death in 1975. She had no children.",
        "birthday": "1911-08-02",
        "deathday": "1979-12-10",
        "gender": 1,
        "homepage": null,
        "id": 13353,
        "imdb_id": "nm0245304",
        "known_for_department": "Acting",
        "name": "Ann Dvorak",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.19,
        "profile_path": "/w7AIhoCgeruXUzz9UCVWHA3Ztx0.jpg"
    }
}