{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hX3kteYoGqvoPpSlqg6nryFL6xR.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749,
                    10751
                ],
                "id": 382748,
                "original_language": "en",
                "original_title": "Stargirl",
                "overview": "An unassuming high schooler finds himself inexplicably drawn to the free-spirited new girl, whose unconventional ways change how they see themselves…and their world.",
                "popularity": 3.4706,
                "poster_path": "/gwsrtzSrr7G6xjxsa7IwaAMHpEF.jpg",
                "release_date": "2020-03-10",
                "title": "Stargirl",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 561,
                "character": "Alan Ferko",
                "credit_id": "5d55ad8fbc86574b372c8496",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Oklahoma native Juliocesar Chavez was destined to be in the limelight from an early age with his quick wit, infectious humor and precocious charm. At age four, he made his television debut as \"Oklahoma City's Youngest Sports Reporter\" interviewing local athletes, wowing both the players and fans alike with his incisive and often outrageous questions. After relocating to Los Angeles, Juliocesar quickly caught the attention of Nickelodeon executives who selected him along with seven other kids to participate in an intensive comedy workshop with the renowned Los Angeles comedy troupe The Groundlings. Juliocesar's breakout performance was in comedy sensation Gabriel Iglesias's stand-up special, THE FLUFFY MOVIE: UNITY THROUGH LAUGHTER in 2014. In the film's opening sequence, Juliocesar portrays young Gabe, introducing the audience to the origins of the comedian's \"Fluffy\" routine. The film was released theatrically by Open Road and has become a fan favorite on comedy channels worldwide.\n\nJuliocesar is of Guatemalan and Mexican heritage and currently resides in Los Angeles, CA with his mother, father, and his younger sister Belen. He is fluent in both English and Spanish and enjoys playing soccer, the guitar and the ukulele.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1337544,
        "imdb_id": "nm5411105",
        "known_for_department": "Acting",
        "name": "Juliocesar Chavez",
        "place_of_birth": null,
        "popularity": 0.0723,
        "profile_path": null
    }
}