{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1nR9mCsJD02j13wet0yAnVhEG6Y.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 71157,
                "original_language": "fr",
                "original_title": "Polisse",
                "overview": "Paris, France. Fred and his colleagues, members of the BPM, the Police Child Protection Unit, dedicated to pursuing all sorts of offenses committed against the weakest, must endure the scrutiny of Melissa, a photographer commissioned to graphically document the daily routine of the team.",
                "popularity": 2.378,
                "poster_path": "/cKs3XSFVbFeZcH3g9geAvr6ApOl.jpg",
                "release_date": "2011-10-06",
                "title": "Polisse",
                "video": false,
                "vote_average": 7.781,
                "vote_count": 1268,
                "character": "Melissa's Mother",
                "credit_id": "52fe4826c3a368484e0eb7a9",
                "order": 53
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Amina was born in a music family. Her father is Tunisian and her mother is French. Her grandmother was a musician and one of her uncles was involved in the in setting up the Tabarka Festival in Tunisia, so Amina got the chance to see a number of music stars, going along to concerts byJoan Baez, James Brown and the famous Algerian diva Warda. It was at the Tabarka music festival that Amina would get to meet the young Senegalese star Wasis Diop. They became friends and they had the opportunity to work together some years later. In 1975 Amina and her mother, a talented musician and composer, moved together in Paris.  Three years later Amina formed her own group, after showing her talent in singing and dancing a variety of music styles, from soul to traditional aigypt songs. The group made appearances in many local schools but it was in 1982 when Amina started to build her solo career. By that time she got involved with Radio Nova, Paris' leading radio station in world music. One of the producers of the station was Martin Meissonnier. He started to work with Amina and soon they became a couple—their daughter was born in 1986. In 1983 she won a music contest with a rap song, \"Shehérazade\", influenced by Arab rhythms. It was released as a CD single. Amina began performing in Paris around this time.",
        "birthday": "1962-03-05",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 133732,
        "imdb_id": "nm0030251",
        "known_for_department": "Acting",
        "name": "Amina Annabi",
        "place_of_birth": " Carthage, Tunisia",
        "popularity": 0.0731,
        "profile_path": "/9jc703d5CeB0mBUqpXd1SHh1RIP.jpg"
    }
}