{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/eyjWwMOgkq4nh0wMtyW8XPJ749H.jpg",
                "genre_ids": [
                    18
                ],
                "id": 109410,
                "original_language": "en",
                "original_title": "42",
                "overview": "In 1946, Branch Rickey, owner of the Brooklyn Dodgers, took a stand against Major League Baseball's infamous color line when he signed Jackie Robinson  to the team. The deal put both men in the crosshairs of the public, the press and even other players. Facing unabashed racism from every side, Robinson was forced to demonstrate tremendous courage and let his talent on the field wins over fans and his teammates – silencing his critics and forever changing the world by changing the game of baseball.",
                "popularity": 5.3153,
                "poster_path": "/iZ7jVGQWj3eBUdqwAPUlKk0BaS2.jpg",
                "release_date": "2013-04-12",
                "title": "42",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 1882,
                "character": "Bobby Bragan",
                "credit_id": "5f8e733afed597003647b5e0",
                "order": 19
            },
            {
                "adult": false,
                "backdrop_path": "/4gWUlxECoziJ9TrGNfymNYxZf6Z.jpg",
                "genre_ids": [
                    16,
                    878,
                    14,
                    28
                ],
                "id": 831405,
                "original_language": "en",
                "original_title": "Injustice",
                "overview": "When Lois Lane is killed, an unhinged Superman decides to take control of the Earth. Determined to stop him, Batman creates a team of freedom-fighting heroes. But when superheroes go to war, can the world survive?",
                "popularity": 3.981,
                "poster_path": "/rzrSeqqpm1BwJ3tcTznztBtLLSD.jpg",
                "release_date": "2021-10-09",
                "title": "Injustice",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 812,
                "character": "Dick Grayson / Nightwing / Arthur Curry / Aquaman (voice)",
                "credit_id": "60f8ad06e24b93005f99bb1a",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/fnbWrDx8w8Reau4F1tFqoGuGmDZ.jpg",
                "genre_ids": [
                    53,
                    18,
                    80
                ],
                "id": 1426776,
                "original_language": "en",
                "original_title": "STRAW",
                "overview": "What will be her last straw? A devastatingly bad day pushes a hardworking single mother to the breaking point — and into a shocking act of desperation.",
                "popularity": 19.6708,
                "poster_path": "/t3cmnXYtxJb9vVL1ThvT2CWSe1n.jpg",
                "release_date": "2025-06-05",
                "title": "STRAW",
                "video": false,
                "vote_average": 7.859,
                "vote_count": 821,
                "character": "Agent Bryce",
                "credit_id": "6846bfa0e9ca8a7b3c3fc86a",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "デレク・フィリップス"
        ],
        "biography": "Film and stage actor Derek Phillips was born in Miami, Florida on April 18, 1976, and attended Baylor University where he received a BFA in acting. Upon graduation Derek moved to New York and began acting professionally in both television and regional theatre performing throughout the country in numerous plays including \"The Winter's Tale\" (Baltimore Center Stage), \"Of Mice and Men\" (Dallas Theater Center), \"The Glass Menagerie\" (Virginia Stage Company), and \"King o' The Moon\" (Capital Repertory Theatre). After years of regional theatre and recurring roles on \"The Guiding Light\", \"As the World Turns\", and \"All My Children\" Derek finally got his break playing the emotionally charged role of Billy Riggins on the critically acclaimed NBC television show \"Friday Night Lights.\" Derek is also an associate producer, assistant director and resident actor for the award-winning, ensemble based theatre company Second Thought Theatre, where he has performed as an actor in the regional premiere of Eric Bogosian's \"Humpty Dumpty\", Douglas Post's \"Earth and Sky\", and the world premiere of Steven Walters \"Pluck the Day.\"",
        "birthday": "1976-04-18",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 134012,
        "imdb_id": "nm2208749",
        "known_for_department": "Acting",
        "name": "Derek Phillips",
        "place_of_birth": "Miami, Florida, USA",
        "popularity": 0.4407,
        "profile_path": "/r8ylzYKi1mdOanR14899kTzD76x.jpg"
    }
}