{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/u2bZhH3nTf0So0UIC1QxAqBvC07.jpg",
                "genre_ids": [
                    16,
                    10751,
                    12,
                    14
                ],
                "id": 109445,
                "original_language": "en",
                "original_title": "Frozen",
                "overview": "Young princess Anna of Arendelle dreams about finding true love at her sister Elsa’s coronation. Fate takes her on a dangerous journey in an attempt to end the eternal winter that has fallen over the kingdom. She's accompanied by ice delivery man Kristoff, his reindeer Sven, and snowman Olaf. On an adventure where she will find out what friendship, courage, family, and true love really means.",
                "popularity": 23.9417,
                "poster_path": "/itAKcobTYGpYT8Phwjd8c9hleTo.jpg",
                "release_date": "2013-11-20",
                "title": "Frozen",
                "video": false,
                "vote_average": 7.248,
                "vote_count": 17073,
                "character": "Additional Voices (voice)",
                "credit_id": "53c09b180e0a261585007a68",
                "order": 31
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Lewis Cleale is an American theatre actor and singer from Houlton, Maine. A graduate of the University of Miami's Frost School of Music, where he has been named Distinguished Alumnus, and of the Burt Reynolds Dinner Theatre, Cleale's big break came when he was cast in a European tour of Oklahoma!, in which he was noticed by Mary Rodgers, who recommended him for a Los Angeles production of State Fair.  Cleale made his Broadway debut in the 1995 Johnny Burke revue Swinging on a Star, for which he received a Drama Desk Award nomination as Outstanding Featured Actor in a Musical. Additional Broadway credits include the 1996 revival of Once Upon a Mattress with Sarah Jessica Parker, the ill-fated 2002 Michel Legrand musical Amour, and the 2005 hit Spamalot. Cleale also appeared in the popular revue I Love New York which was done at the Rainbows and Stars room along with Bryan Batt, Janet Metz and Heather MacRae. Off-Broadway, he has appeared in Call Me Madam opposite Tyne Daly and A New Brain with Malcolm Gets and Kristin Chenoweth for Lincoln Center Theater. He is known for Frozen (2013), BrainDead (2016) and Elementary (2012).",
        "birthday": "1967-08-08",
        "deathday": null,
        "gender": 2,
        "homepage": "https://playbill.com/person/lewis-cleale-vault-0000089242",
        "id": 1340673,
        "imdb_id": "nm5642326",
        "known_for_department": "Acting",
        "name": "Lewis Cleale",
        "place_of_birth": "Houlton - Maine - USA",
        "popularity": 0.0168,
        "profile_path": null
    }
}