{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/oSogG5fpITtg11UGz8tfRNfuMeA.jpg",
                "genre_ids": [
                    16,
                    9648,
                    28,
                    80
                ],
                "id": 736074,
                "original_language": "en",
                "original_title": "Batman: The Long Halloween, Part Two",
                "overview": "As Gotham City's young vigilante, the Batman, struggles to pursue a brutal serial killer, district attorney Harvey Dent gets caught in a feud involving the criminal family of the Falcones.",
                "popularity": 2.4679,
                "poster_path": "/5X1n5q08mZ7NpNpxehMFODxfNYq.jpg",
                "release_date": "2021-07-26",
                "title": "Batman: The Long Halloween, Part Two",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 550,
                "character": "Renee Montoya (voice)",
                "credit_id": "610077cb38e5100045d0d009",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Alyssa Elaine Diaz",
            "艾莉莎·狄亞",
            "آلیسا دیاز"
        ],
        "biography": "Alyssa Diaz was born on September 7, 1985, in the city of Northridge  (California), in the United States. Colombian and Mexican -  American descent, Alyssa studied at Bishop Alemany High School. She began acting at the beginning of the new millennium, participating in some episodes of various series such as \"CSI: Miami\" and \"The Brothers Garcia\",  \"American Family\". In 2005, she won the role of Celia Ortega on the popular soap opera \"As the World Turns\", in which she played for over 56 episodes.  She later had some recurring roles, such as the Mercedes Moretta on the television series \"Southland\" and was a guest artist at shows,  which include \"The Unit\", \"Greek\", \"CSI: New York\", \"Three Rivers\", \"Lie to me\" or \"law & order: Los Angeles (Law & Order: Los  Angeles)\". Alyssa is currently working on \"The Nine Lives of Chloe King\"  series which is broadcast by the ABC Family sign, and which plays the role of Jasmine, cousin of the protagonist Chloe King (Skyler Samuels),  who discovers that she belongs to an ancient race call the Mai, and has powers similar to the of a feline, including their nine lives. Alyssa,  that also filmed some short films and telefilms, participated in her first feature film in 2005, integrating the cast of the comedy \"How the  Garcia Girls Spent Their Summer\" starring America Ferrera. More recently filmed the horror 'Shark Night 3D' movie (2011) which co-starred along with Sara Paxton and Dustin Milligan. Her latest work for this medium was in the action movie \"Red Dawn\", whose filming was completed recently and which has the lead of Chris Hemsworth,  Isabel Lucas, and Josh Hutcherson.",
        "birthday": "1985-09-07",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 134180,
        "imdb_id": "nm1595801",
        "known_for_department": "Acting",
        "name": "Alyssa Diaz",
        "place_of_birth": "Northridge, Los Angeles, California, USA",
        "popularity": 2.0675,
        "profile_path": "/ihLNjM4E1Fjx5h4l8EL6r3iDRTa.jpg"
    }
}