{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qpjuVCGZvNsbDa4UyxrbAa4Dno3.jpg",
                "genre_ids": [
                    35,
                    80
                ],
                "id": 37136,
                "original_language": "en",
                "original_title": "The Naked Gun: From the Files of Police Squad!",
                "overview": "When the bumbling Lieutenant Frank Drebin investigates events following the shooting of his partner, he stumbles upon an attempt to assassinate Queen Elizabeth II.",
                "popularity": 10.3578,
                "poster_path": "/zT0mhZqZQJE1gSY5Eg9qcGP4NYo.jpg",
                "release_date": "1988-12-02",
                "title": "The Naked Gun: From the Files of Police Squad!",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 4116,
                "character": "Pahpshmir",
                "credit_id": "52fe462c9251416c9104bb77",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/6rgiRuLHn65d3qalkc7YjrtmDQW.jpg",
                "genre_ids": [
                    18
                ],
                "id": 9701,
                "original_language": "en",
                "original_title": "North Country",
                "overview": "A fictionalized account of the first major successful sexual harassment case in the United States — Jenson vs. Eveleth Mines, where a woman who endured a range of abuse while working as a miner filed and won the landmark 1984 lawsuit.",
                "popularity": 2.8644,
                "poster_path": "/upxUN4zmX79o49mBW9htKZDeNq7.jpg",
                "release_date": "2005-02-12",
                "title": "North Country",
                "video": false,
                "vote_average": 7.259,
                "vote_count": 692,
                "character": "Tom Motel Clerk",
                "credit_id": "67c17b951f3f81b607a2338e",
                "order": 41
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ray Birk"
        ],
        "biography": "Raye Birk (born May 27, 1943, Flint, Michigan) is an American film and television actor best known for playing the role of Pahpshmir in the first and last of the Naked Gun movies. He was the main villain in Naked Gun 33​1⁄3: The Final Insult. He has also starred in Due South as the terrorist Francis Bolt in the Episodes \"All the Queens Horses\", \"Red, White and Blue\", \"Call of the Wild Part One\" and \"Call of the Wild Part Two\". He also had roles in the X-Files and Babylon 5. His other film credits include roles in Best Defense (1984), Amazon Women on the Moon (1987), Throw Momma from the Train (1987), Doc Hollywood (1991) and Star Trek: Insurrection (1998).\n\nIn addition to these roles, he had a frequently occurring role as the assistant principal on The Wonder Years; starting with the pilot episode, when he had a conference with Kevin Arnold's parents for throwing food in the cafeteria. While generally antagonist, a more sympathetic role on the show was seen in the award winning episode \"Goodbye\" where he confides in Kevin that he is Kevin's new math teacher as Kevin's hardnosed algebra teacher has just died. He was also on a pair of Home Improvement episodes as one of Tim's poker buddies. Raye appeared in several episodes on the TV series Night Court. He appeared twice on The Golden Girls, both times playing a wedding caterer.\n\nFurthermore, in 1985, 1986 and 1992, he appeared on three episodes of Cheers as Walt Twitchell, a mailman who got into minor altercations with Cliff Clavin. Birk reprised the role of Twitchell in a 2002 episode of the Cheers spinoff series, Frasier, in which the title character (played by Kelsey Grammer) returned to Boston and re-acquainted himself with old friends from the bar. He played a recurring role on Coach as university band director Riley Pringle from 1989 to 1993. He also appeared in an episode of Mr. Belvedere as an accordion player.\n\nIn 2004–2008, he played Ebenezer Scrooge in A Christmas Carol at the Guthrie Theater in Minneapolis.\n\nRaye has been married to his wife Candace Barrett for 41 years. They have one son, Joshua, who is a professor of medieval history.",
        "birthday": "1943-05-27",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 13422,
        "imdb_id": "nm0083541",
        "known_for_department": "Acting",
        "name": "Raye Birk",
        "place_of_birth": "Flint, Michigan, USA ",
        "popularity": 0.1664,
        "profile_path": "/tirG60WMTFflgfBDn8DNSBTJfqD.jpg"
    }
}