{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8aTHhowlxO3nBQjianlIyns1ZIt.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 156700,
                "original_language": "en",
                "original_title": "The Kings of Summer",
                "overview": "Joe Toy, on the verge of adolescence, finds himself increasingly frustrated by his single father, Frank's attempts to manage his life. Declaring his freedom once and for all, he escapes to a clearing in the woods with his best friend, Patrick, and a strange kid named Biaggio. He announces that they are going to build a house there, free from responsibility and parents. Once their makeshift abode is finished, the three young men find themselves masters of their own destiny, alone in the woods.",
                "popularity": 2.4639,
                "poster_path": "/6dcIbwJuxlEnzLe0EaGFvsh4ZdS.jpg",
                "release_date": "2013-01-19",
                "title": "The Kings of Summer",
                "video": false,
                "vote_average": 6.982,
                "vote_count": 1177,
                "character": "Paul",
                "credit_id": "52fe4baa9251416c910e1e09",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Keyes was born in Washington, D.C., to Holly and Dale Gumke, but raised in York, Pennsylvania with younger brother Chris. When he was seven, he wrote, produced, directed and acted in a play based on The Tailor of Gloucester. He played his first stage role when he was eleven, and went on to star in theatrical roles such as Romeo, in Romeo and Juliet, the Scarecrow in The Wizard of Oz, the Emcee in Cabaret, and Albert in Bye, Bye Birdie. He also starred in Bang Bang, You're Dead, a play about school violence, presented in high schools in York County, Pennsylvania. Keyes attended York Suburban High School. In 2000, he founded the pop band \"As 1\", performing in more than seventy-five concerts throughout the northeast.",
        "birthday": "1985-11-28",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 134397,
        "imdb_id": "nm2227646",
        "known_for_department": "Acting",
        "name": "Nathan Keyes",
        "place_of_birth": "Washington, D.C.",
        "popularity": 0.1695,
        "profile_path": "/dAsWY6IQfeL8KdTKqN2uCHyC61S.jpg"
    }
}