{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9BBTo63ANSmhC4e6r62OJFuK2GL.jpg",
                "genre_ids": [
                    878,
                    28,
                    12
                ],
                "id": 24428,
                "original_language": "en",
                "original_title": "The Avengers",
                "overview": "When an unexpected enemy emerges and threatens global safety and security, Nick Fury, director of the international peacekeeping agency known as S.H.I.E.L.D., finds himself in need of a team to pull the world back from the brink of disaster. Spanning the globe, a daring recruitment effort begins!",
                "popularity": 42.9973,
                "poster_path": "/RYMX2wcKCBAr24UyPD7xwmjaTn.jpg",
                "release_date": "2012-04-25",
                "title": "The Avengers",
                "video": false,
                "vote_average": 7.805,
                "vote_count": 33062,
                "character": "Shield Agent (uncredited)",
                "credit_id": "57ca1eef92514127950011e3",
                "order": 107
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Andrea-Nichole Marvin"
        ],
        "biography": "Andrea-Nichole was born in Phoenix, Arizona to Mother Darlene Olivas. At a young age Andrea-Nichole and her mother moved to San Diego, California; it was there that she knew, that she wanted to be an actress. Starring in little productions, tap dancing and ballet classes at the age of 4. Continuing on quite a few years and moves later, Andrea-Nichole and her mother ended back in Phoenix, Arizona. It was in her hometown that she started broadening her acting skills on more of a serious level. In the year 2007 Andrea-Nichole moved to Los Angeles, California- it was there that she began TV/film acting. Sadly enough Andrea-Nichole's mother Darlene passed away after a long battle to Non-Hodgkins Lymphoma in May of 2010. Only a month after her mother passed, Andrea-Nichole was offered a part in a PSA \"Stand Up To Cancer\". She has continued acting and adding roles to her resume such as \"Sirk\", \"Incest: The Musical\", and other Blinky Production movies.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1343164,
        "imdb_id": "nm4478605",
        "known_for_department": "Acting",
        "name": "Andrea-Nichole Olivas",
        "place_of_birth": "Phoenix, Arizona, USA",
        "popularity": 0.0261,
        "profile_path": "/RWuJ15lDLFDK0XX182cSytDwEC.jpg"
    }
}