{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7g5v2zXedkwiFqDlWqcoRUUQYD6.jpg",
                "genre_ids": [
                    18,
                    28,
                    35
                ],
                "id": 11712,
                "original_language": "ja",
                "original_title": "椿三十郎",
                "overview": "Toshiro Mifune swaggers and snarls to brilliant comic effect in Kurosawa's tightly paced, beautifully composed \"Sanjuro.\" In this companion piece and sequel to \"Yojimbo,\" jaded samurai Sanjuro helps an idealistic group of young warriors weed out their clan's evil influences, and in the process turns their image of a proper samurai on its ear.",
                "popularity": 3.2847,
                "poster_path": "/zW47oIH3bc3ggmmmzTvKqM4Fqjk.jpg",
                "release_date": "1962-01-01",
                "title": "Sanjuro",
                "video": false,
                "vote_average": 8.0,
                "vote_count": 661,
                "character": "Mutsuta's wife",
                "credit_id": "52fe447f9251416c75036d35",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Такако Ириэ"
        ],
        "biography": "Takako Irie (入江 たか子 Irie Takako, 7 February 1911 – 12 January 1995) was a Japanese film actress. Born in Tokyo into the aristocratic Higashibōjō family (her birth name was Hideko Higashibōjō (東坊城 英子 Higashibōjō Hideko)), she graduated from Bunka Gakuin before debuting as an actress at Nikkatsu in 1927. She became a major star, even starting her own production company, Irie Productions, in 1932. One of Kenji Mizoguchi's silent film masterpieces, The Water Magician, was produced at that company with Irie starring. She appeared in many advertisements, as well as on fans and other commercial goods. Irie was also the subject of a folding screen painting by Nihonga artist Nakamura Daizaburō, which appeared in the 1930 Teiten (Imperial Exhibition), and which is today in the collection of the Honolulu Museum of Art; toy dolls were also produced based on this image.\n\nIn the postwar period, Irie became known as a \"ghost cat actress\" (bakeneko joyū) for appearing in a series of kaidan (ghost story) movies. One of her late memorable roles was in Akira Kurosawa's Sanjuro, where she plays Mutsuta's wife, the lady who warns Sanjuro (Toshirō Mifune) that \"the best sword stays in its scabbard\".",
        "birthday": "1911-02-07",
        "deathday": "1995-01-12",
        "gender": 1,
        "homepage": null,
        "id": 134351,
        "imdb_id": "nm0409960",
        "known_for_department": "Acting",
        "name": "Takako Irie",
        "place_of_birth": "Tokyo, Japan",
        "popularity": 1.4908,
        "profile_path": "/iqD3lh1wWQEEbgXcVC8oAU2n8TR.jpg"
    }
}