{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hVvW015x8cD2X0KthGovw27EpF2.jpg",
                "genre_ids": [
                    10402,
                    10749,
                    35
                ],
                "id": 2769,
                "original_language": "en",
                "original_title": "An American in Paris",
                "overview": "Jerry Mulligan is an exuberant American expatriate in Paris trying to make a reputation as a painter. His friend Adam is a struggling concert pianist who's a long time associate of a famous French singer, Henri Baurel. A lonely society woman, Milo Roberts, takes Jerry under her wing and supports him, but is interested in more than his art.",
                "popularity": 4.1978,
                "poster_path": "/lyDXkvG53ldz6Cf7dbjJl7TaoP5.jpg",
                "release_date": "1951-09-26",
                "title": "An American in Paris",
                "video": false,
                "vote_average": 7.026,
                "vote_count": 606,
                "character": "Dancing G.I. (uncredited)",
                "credit_id": "63a7ff50aaec7100a112a5fc",
                "order": 114
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/gkXL5ka6ciU4A4KYSvLIAXtvh7k.jpg",
                "genre_ids": [
                    53,
                    18,
                    27
                ],
                "id": 10242,
                "original_language": "en",
                "original_title": "What Ever Happened to Baby Jane?",
                "overview": "A former child star torments her paraplegic sister in their decaying Hollywood mansion.",
                "popularity": 1.5557,
                "poster_path": "/msGYzyWwtjAaA3DScdgmvJ5MReG.jpg",
                "release_date": "1962-10-31",
                "title": "What Ever Happened to Baby Jane?",
                "video": false,
                "vote_average": 7.904,
                "vote_count": 1103,
                "credit_id": "5a44afef0e0a2620e0079f10",
                "department": "Crew",
                "job": "Choreographer"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Alex Romero, born Alexander Bernard Quiroga in San Antonio, Texas, was the son of a Mexican general and politician. His family fled to the United States during the Mexican Revolution after his father and many brothers were killed. Raised in a family of performers, Alex initially had no formal dance training but learned tap by observing Black dancers in vaudeville acts. At fifteen, he joined his brothers’ Spanish dance troupe, adopting the stage name Romero, and toured extensively across the U.S. and Europe.\n\nIn 1936, while on tour in Norway, he married Faun, and the couple returned to the U.S. in 1939 as World War II began. Romero soon joined Jack Cole’s dance team at Columbia Pictures and transitioned into film choreography. He worked with legendary figures like Gene Kelly, Fred Astaire, Busby Berkeley, and Michael Kidd, contributing to iconic films such as An American in Paris, On the Town, and Seven Brides for Seven Brothers. His solo choreography debut came in Words and Music (1948), where he created standout numbers like “Thou Swell” and “Lady is a Tramp.”\n\nRomero became known for his inventive, humorous style and masterful use of props and camera angles. He choreographed for stars including Doris Day, Debbie Reynolds, Bob Fosse, and Russ Tamblyn, and created the unforgettable “Jailhouse Rock” number for Elvis Presley, with whom he developed a close friendship. His work extended to television, Broadway, and nightclubs, with credits on The Perry Como Show, Fantasy Island, and the musical Happy Hunting starring Ethel Merman.\n\nA founding member of the Professional Dancers Society, Romero was honored with a Lifetime Achievement Award by Jazz Dance LA Foundation in 2001. He was celebrated not only for his artistic contributions but also for mentoring young dancers and choreographers. Alex Romero passed away peacefully in 2007 at the age of 94, leaving behind a legacy that helped shape the future of dance in film and television.",
        "birthday": "1913-08-20",
        "deathday": "2007-09-08",
        "gender": 2,
        "homepage": null,
        "id": 1344750,
        "imdb_id": "nm0739327",
        "known_for_department": "Crew",
        "name": "Alex Romero",
        "place_of_birth": "San Antonio, Texas, USA",
        "popularity": 0.0828,
        "profile_path": "/oNCtY87R30V9NPQsYrtc4e3TMtx.jpg"
    }
}