{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4Bb1kMIfrT2tYRZ9M6Jhqy6gkeF.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 76203,
                "original_language": "en",
                "original_title": "12 Years a Slave",
                "overview": "In the pre-Civil War United States, Solomon Northup, a free black man from upstate New York, is abducted and sold into slavery. Facing cruelty as well as unexpected kindnesses Solomon struggles not only to stay alive, but to retain his dignity. In the twelfth year of his unforgettable odyssey, Solomon’s chance meeting with a Canadian abolitionist will forever alter his life.",
                "popularity": 7.0513,
                "poster_path": "/xdANQijuNrJaw1HA61rDccME4Tm.jpg",
                "release_date": "2013-10-18",
                "title": "12 Years a Slave",
                "video": false,
                "vote_average": 7.938,
                "vote_count": 11592,
                "character": "Mulatto Woman",
                "credit_id": "53cc7a600e0a265e01002f48",
                "order": 30
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "비비안 플레밍-알바레즈"
        ],
        "biography": "Vivian Fleming-Alvarez was born Vivian Celeste Fleming in Tampa Florida. Her interest in the arts was first discovered when she spontaneously decided at age 15 to try-out for her high school cheerleading squad. After she failed to make the squad, Vivian was approached by the school's baseball coach who said, \"Sorry you didn't make the squad, but I heard your dance routine was awesome...you should try-out for the dance squad\". So she did...and she made the squad! Sparking her love of dance and performing. After graduating from high school, Vivian continued performing through dance as an NFL Football Cheerleader for the Tampa Bay Buccaneers for 4 years. Both experiences were precursors to her acting career. Vivian has held her own in many industries and has earned the admiration and respect of her family, friends and peers alike. There is no limit for Vivian, who is very focused, determined and has a sense of humor to balance. Be sure to stay tuned! Vivian studies (ongoing) at Performer's Studio Workshop (PSW) in Tampa Florida.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1344345,
        "imdb_id": "nm3868449",
        "known_for_department": "Acting",
        "name": "Vivian Fleming-Alvarez",
        "place_of_birth": "Tampa, Florida",
        "popularity": 0.0579,
        "profile_path": "/5BY7Mtg5IVDUxF8NdDEfGIp9FdO.jpg"
    }
}