{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6N6VUUR1gzbCkiGpQzvRREv3Od1.jpg",
                "genre_ids": [
                    18
                ],
                "id": 8092,
                "original_language": "en",
                "original_title": "This Boy's Life",
                "overview": "When a son and mother move to Seattle in hopes for a better life, the mother meets a seemingly polite man. Things go south when the man turns out to be abusive, endangering their lives. As the mother struggles to maintain hope in an impossible situation, the son has plans to escape.",
                "popularity": 2.7042,
                "poster_path": "/pRMSZfen1Cv1eqwDbtxCBpBqxnU.jpg",
                "release_date": "1993-04-09",
                "title": "This Boy's Life",
                "video": false,
                "vote_average": 7.126,
                "vote_count": 1025,
                "character": "Pearl",
                "credit_id": "52fe4493c3a36847f809dd27",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/jRZ3joUcg8YDCQYl4Tog5xhY6wk.jpg",
                "genre_ids": [
                    28,
                    53
                ],
                "id": 36955,
                "original_language": "en",
                "original_title": "True Lies",
                "overview": "A fearless, globe-trotting, terrorist-battling secret agent has his life turned upside down when he discovers his wife might be having an affair with a used car salesman while terrorists smuggle nuclear war heads into the United States.",
                "popularity": 6.7212,
                "poster_path": "/pweFTnzzTfGK68woSVkiTgjLzWm.jpg",
                "release_date": "1994-07-15",
                "title": "True Lies",
                "video": false,
                "vote_average": 7.085,
                "vote_count": 4320,
                "character": "Dana Tasker",
                "credit_id": "52fe461d9251416c91049917",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/bNMw3onveTYU7PpLQRK0HQK8JRb.jpg",
                "genre_ids": [
                    28,
                    16,
                    80,
                    53
                ],
                "id": 69735,
                "original_language": "en",
                "original_title": "Batman: Year One",
                "overview": "A wealthy playboy named Bruce Wayne and a Chicago cop named Jim Gordon both return to Gotham City where their lives unexpectedly intersect.",
                "popularity": 2.8046,
                "poster_path": "/mLZRhulJcDsxZWTdfx0trtk6y07.jpg",
                "release_date": "2011-09-27",
                "title": "Batman: Year One",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1007,
                "character": "Selina (voice)",
                "credit_id": "52fe47d9c3a368484e0dcc59",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Eliza Patricia Dushku",
            "Еліза Душку",
            "Элиза Душку",
            "الیزا دوشکو"
        ],
        "biography": "Eliza Dushku (born December 30, 1980) is an American actress and producer, known for her versatile talent and captivating performances across film and television.\n\nDushku's acting career began at a young age when she landed her first major role as the troubled teenage daughter, Faith, on the hit television series \"Buffy the Vampire Slayer\" (1998-2003). Her portrayal of the complex and rebellious character garnered critical acclaim and a strong fan following. Following her success on \"Buffy,\" Dushku went on to star in the spin-off series \"Angel\" (2000-2003), where she continued to develop her character, Faith, in a more prominent role. Her ability to bring depth and vulnerability to her performances earned her further recognition in the industry.\n\nDushku's talent extended beyond television, as she made a successful transition to the big screen. She appeared in several notable films, including \"Bring It On\" (2000), \"The New Guy\" (2002), and \"Wrong Turn\" (2003), where she showcased her range as an actress and solidified her presence in the film industry.\n\nIn addition to her acting career, Dushku has also been involved in producing projects. She co-produced and starred in the short-lived series \"Tru Calling\" (2003-2005), further demonstrating her passion for storytelling and her desire to contribute to the creative process behind the camera.\n\nThroughout her career, Dushku has consistently taken on challenging and complex roles, showcasing her versatility as an actress. She has also been praised for her commitment to portraying strong female characters who defy stereotypes and challenge societal norms.\n\nBeyond her acting pursuits, Dushku is also known for her philanthropic efforts. She has been involved in various charitable organizations, particularly focusing on empowering young women and combating sexual violence.\n\nEliza Dushku continues to be a respected and admired figure in the entertainment industry, captivating audiences with her talent, authenticity, and dedication to her craft. Her contributions to both television and film have left a lasting impact, and she remains an influential presence in the industry.",
        "birthday": "1980-12-30",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 13446,
        "imdb_id": "nm0244630",
        "known_for_department": "Acting",
        "name": "Eliza Dushku",
        "place_of_birth": "Boston, Massachusetts, USA",
        "popularity": 1.7905,
        "profile_path": "/lvu4Vo9GL7uOjtU59MDiy3QDPAZ.jpg"
    }
}