{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fozq5WDVQQZ8C1K3rrvgB6IM5O9.jpg",
                "genre_ids": [
                    18
                ],
                "id": 489418,
                "original_language": "fr",
                "original_title": "Pupille",
                "overview": "Théo is given up for adoption by his biological mother on the very day he is born. After this anonymous birth, the mother has two months to change her mind… Or not. The child welfare services and adoption service spring into action… The former have to take care of the baby and support it during this limbo-like time, this period of uncertainty, while the latter must find a woman to become his adoptive mother. She is called Alice, and she has spent the last ten years fighting to have a child.",
                "popularity": 3.2158,
                "poster_path": "/andgp8cnHZPAwx3zPUDaZ0pn6Go.jpg",
                "release_date": "2018-12-05",
                "title": "In Safe Hands",
                "video": false,
                "vote_average": 7.429,
                "vote_count": 520,
                "character": "Woman with emaciated face",
                "credit_id": "6307a4ceb04228007f4af66d",
                "order": 32
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "سارا مورتنسن"
        ],
        "biography": "Sara Mortensen is a French actress born on December 10, 1979, in Paris. Her mother, Elisabeth Mortensen, is a Norwegian actress, teacher, and director. Sara is fluent in French, Norwegian, and English. She studied at the École Internationale Bilingue and later earned a master's degree in history. She then attended the Cours Florent drama school from 2001 to 2004. Sara is known for her roles in TV series such as Plus belle la vie, Astrid et Raphaëlle, and Les Mystères de..., as well as appearances in several other series, TV movies, and films.",
        "birthday": "1979-12-10",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1345053,
        "imdb_id": "nm2826995",
        "known_for_department": "Acting",
        "name": "Sara Mortensen",
        "place_of_birth": "Paris, France",
        "popularity": 5.0367,
        "profile_path": "/yTjkP5agK9B3iylbYmDaSKMCx14.jpg"
    }
}