{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fGjqCsoJttbTxkrcWfupuT1xLQx.jpg",
                "genre_ids": [
                    80,
                    18,
                    53
                ],
                "id": 356296,
                "original_language": "it",
                "original_title": "Suburra",
                "overview": "A gangster known as \"Samurai\" wants to turn the waterfront of Rome into a new Las Vegas. All the local mob bosses have agreed to work for this common goal. But peace is not to last long.",
                "popularity": 2.6086,
                "poster_path": "/ml6iNvTVrWxDusMhbizphQjCHPw.jpg",
                "release_date": "2015-10-14",
                "title": "Suburra",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1284,
                "character": "Padre di Sebastiano",
                "credit_id": "55dde2d7c3a3681761002660",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/psOtyMIfeSJebpeKiDUR1M6wto2.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 14375,
                "original_language": "it",
                "original_title": "Romanzo criminale",
                "overview": "After serving prison time for a juvenile offense, Freddo gathers his old buddies Libano and Dandi and embarks on a crime spree that makes the trio the most powerful gangsters in Rome. Libano loves their new status, and seeks to spread their influence throughout the underworld, while the other two pursue more fleshly desires. For decades, their gang perpetrates extravagant crimes, until paranoia threatens to split the friends apart.",
                "popularity": 1.3324,
                "poster_path": "/jd06ZOSBpjfKEthqli5O2urO0nm.jpg",
                "release_date": "2005-09-30",
                "title": "Romanzo Criminale",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 664,
                "character": "Ciro Buffoni",
                "credit_id": "59a45df4c3a3680ad5001689",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "​Figlio di Osvaldo Fassari e di Adriana Gambardella, si è diplomato all'Accademia Nazionale d'Arte Drammatica Silvio D'Amico di Roma nel 1975. Parallelamente alla sua attività teatrale ha affiancato quella televisiva e radiofonica con partecipazioni a sceneggiati e varietà tra cui: Avanzi, Anni '50, Al di là delle frontiere e I Cesaroni. Nel 1984 incide una canzone rap dal titolo \"Romadinotte\", di cui scrive il testo, con base elaborata da Lele Marchitelli, Danilo Rea e Pasquale Minieri. Per la radiolavora allo sceneggiato I tre moschettieri. Nel 1992 si è sposato con Maria Fano e ha avuto una figlia di nome Flaminia, nata nel 1988. Nel luglio 2004 ha messo in scena e interpretato La ricotta diPier Paolo Pasolini al festival di Todi. Si è cimentato anche come regista cinematografico con il filmIl segreto del giaguaro (2000), interpretato da Er Piotta. Nel 2005 ha interpretato nel film Romanzo criminale il personaggio di Ciro Buffoni.",
        "birthday": "1952-10-04",
        "deathday": "2025-04-05",
        "gender": 2,
        "homepage": null,
        "id": 134538,
        "imdb_id": "nm0268724",
        "known_for_department": "Acting",
        "name": "Antonello Fassari",
        "place_of_birth": "Roma, Italy",
        "popularity": 0.1795,
        "profile_path": "/3gAf0fsY9Pn1YxAeQ8jDrIWZqoN.jpg"
    }
}