{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bwgjIlMoSyU1Iw0IhNIFUeSbNDy.jpg",
                "genre_ids": [
                    18
                ],
                "id": 68722,
                "original_language": "en",
                "original_title": "The Master",
                "overview": "Freddie, a volatile, heavy-drinking veteran who suffers from post-traumatic stress disorder, finds some semblance of a family when he stumbles onto the ship of Lancaster Dodd, the charismatic leader of a new \"religion\" he forms after World War II.",
                "popularity": 5.8235,
                "poster_path": "/jjVGdNt4fYb3T2hjISGZ2qnCuaV.jpg",
                "release_date": "2012-09-14",
                "title": "The Master",
                "video": false,
                "vote_average": 7.113,
                "vote_count": 3105,
                "character": "Jail Bird",
                "credit_id": "64c67de9d7a70a011c77c316",
                "order": 71
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ted Crisell"
        ],
        "biography": "Ted Crisell, known to friends around the globe as THEO, is a former child actor having grown up in Hollywood. THEO was raised in a talented family, mother played violin, sang and danced. At an early age (age7) THEO had private acting, dance and singing lessons. He worked in many films and television shows and performed with John Wayne, Walter Brennan, Donna Reid, Lucille Ball, Ernie Kovacks, Richard Carlson, Broderick Crawford, and many, many other name actors. He appeared later in shows with Whoopy Goldberg, Rodney Dangerfield and recently in films with Dustin Hoffman, Joanquin Phoenix and Phillip Seymour Hoffman.\n\nAs an adult THEO found he could not get cast in the character parts he wanted nd began producing, directing and writing his own films and webisodes.\n\nIn the last few years he has acted in and produced the horror films TRAPPED, GIRLS ON A BOAT, and DEMONS along with the comedy feature film WOMEN and two amazing and well received shorts which will be soon turned into Features, UNCLE ZORBA and DINNER WITH THE DONS.\n\nOver the last two years THEO has appeared in over 100 film projects nd various characters and has appeared four times in various shorts with Funny Or Die.\n\nTHEO also continues to produce Web series through his three production companies he founded, CGP, Crisell Global Productions, Crisell World Vortex, Crisell TV.\n\n- IMDb Mini Biography By: THEO Crisell",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1347586,
        "imdb_id": "nm4055891",
        "known_for_department": "Acting",
        "name": "Theo Crisell",
        "place_of_birth": null,
        "popularity": 0.0389,
        "profile_path": null
    }
}