{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/okRY6YHbakM9cQz08EfcaLfzDoX.jpg",
                "genre_ids": [
                    28,
                    12,
                    16,
                    878,
                    14
                ],
                "id": 30061,
                "original_language": "en",
                "original_title": "Justice League: Crisis on Two Earths",
                "overview": "A heroic version of Lex Luthor from an alternate universe appears to recruit the Justice League to help save his Earth from the Crime Syndicate, an evil version of the League. What ensues is the ultimate battle of good versus evil in a war that threatens both planets and, through a devious plan launched by Batman's counterpart Owlman, puts the balance of all existence in peril.",
                "popularity": 2.2368,
                "poster_path": "/5Cjrxbv0BIxzgKFC9PYcgmPtnMV.jpg",
                "release_date": "2010-02-23",
                "title": "Justice League: Crisis on Two Earths",
                "video": false,
                "vote_average": 7.317,
                "vote_count": 744,
                "character": "J'Onn J'Onzz (voice)",
                "credit_id": "52fe43f99251416c91000cd5",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/bRCP3D2QuR1UiFue6DCyznmRnyc.jpg",
                "genre_ids": [
                    878,
                    16,
                    12,
                    18
                ],
                "id": 22855,
                "original_language": "en",
                "original_title": "Superman/Batman: Public Enemies",
                "overview": "United States President Lex Luthor uses the oncoming trajectory of a Kryptonite meteor to frame Superman and declare a $1 billion bounty on the heads of the Man of Steel and his ‘partner in crime’, Batman. Heroes and villains alike launch a relentless pursuit of Superman and Batman, who must unite—and recruit help—to try and stave off the action-packed onslaught, stop the meteor Luthors plot.",
                "popularity": 3.5437,
                "poster_path": "/izvMc22ywSLFWUXZEIuJJ8dms75.jpg",
                "release_date": "2009-09-29",
                "title": "Superman/Batman: Public Enemies",
                "video": false,
                "vote_average": 7.068,
                "vote_count": 680,
                "character": "General (voice) (uncredited)",
                "credit_id": "52fe4452c3a368484e01c833",
                "order": 18
            },
            {
                "adult": false,
                "backdrop_path": "/4fLZUr1e65hKPPVw0R3PmKFKxj1.jpg",
                "genre_ids": [
                    16,
                    35,
                    10751,
                    14,
                    10749
                ],
                "id": 976573,
                "original_language": "en",
                "original_title": "Elemental",
                "overview": "In a city where fire, water, land and air residents live together, a fiery young woman and a go-with-the-flow guy will discover something elemental: how much they have in common.",
                "popularity": 13.222,
                "poster_path": "/4Y1WNkd88JXmGfhtWR7dmDAo1T2.jpg",
                "release_date": "2023-06-14",
                "title": "Elemental",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 4958,
                "character": "Flarry (voice)",
                "credit_id": "64f4248677d23b00cb877cab",
                "order": 15
            },
            {
                "adult": false,
                "backdrop_path": "/dSD9aSZtgFthuMQ78GD1QOQf54V.jpg",
                "genre_ids": [
                    878,
                    16,
                    28,
                    18,
                    14
                ],
                "id": 487670,
                "original_language": "en",
                "original_title": "The Death of Superman",
                "overview": "When a hulking monster arrives on Earth and begins a mindless rampage, the Justice League is quickly called in to stop it. But it soon becomes apparent that only Superman can stand against the monstrosity.",
                "popularity": 2.7322,
                "poster_path": "/y0uxSHaSFmt6XaBJgjkeLqe7aM.jpg",
                "release_date": "2018-07-24",
                "title": "The Death of Superman",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 792,
                "character": "Mayor (voice)",
                "credit_id": "5b2981b99251410fe00000bb",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Jonathan Adams (born July 16, 1967) is an American actor and voice actor. He is best known for playing Chuck Larabee on the sitcom Last Man Standing and Dr. Daniel Goodman during the first season of the crime drama Bones.\n\nHe has been a series regular on NBC's American Dreams (2002–05), and in the short-lived ABC crime drama Women's Murder Club. He's had recurring roles on The American Embassy (2002) and Dark Winds (2022). He has appeared on many other TV shows including Crossing Jordan, NCIS, NCIS: LA, Frasier, Felicity, The Unit, One Tree Hill, Medium, Boston Legal, 24, Numb3rs, Desperate Housewives, The Glades, The Closer, Drop Dead Diva, Castle, Nikita, Masters of Sex, Designated Survivor, Burn Notice, Harry's Law, Up All Night, Revenge, Once Upon a Time, Man with a Plan, The Orville, All Rise, Bob Hearts Abishola, and more.\n\nHe portrayed Dr. Daniel Goodman in the first season of the Fox series Bones. At the start of season 2, his character appointed Dr. Camille Saroyan (Tamara Taylor) to be the Jeffersonian's first head of forensics (immediate boss of Temperance Brennan). Although he was supposed to have left on a short sabbatical, his character did not return.\n\nHis role of Chuck Larrabee on the sitcom Last Man Standing started out as a recurring role and eventually became a series regular.\n\nHe has voiced several characters including Ronan the Accuser on the animated series Marvel's Guardians of the Galaxy and again in the animated special LEGO Marvel Super Heroes - Guardians of the Galaxy: The Thanos Threat. He voiced Atrocitus in Green Lantern: The Animated Series and again in the animated special LEGO DC Super Heroes - Aquaman: Rage of Atlantis. He also voiced the Mayor in the animated specials The Death of Superman and again in The Death and Return of Superman.\n\nAlso, he has voiced characters on video games including Tyrael on Diablo III, Diablo III: Reaper of Souls, and Diablo III: Wrath. He also voiced for World of Warcraft: Mists of Pandaria, World of Warcraft: Legion, Hearthstone: Heroes of Warcraft, Heroes of the Storm, and Starcraft II: Legacy of the Void.\n\nHe was a narrator on the History Channel's docuseries America's Book of Secrets and a few documentaries.\n\nHe also appeared in the feature film Black Panther as well as a couple of Hallmark movies.",
        "birthday": "1967-07-16",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 13477,
        "imdb_id": "nm0011095",
        "known_for_department": "Acting",
        "name": "Jonathan Adams",
        "place_of_birth": "Pittsburgh, Pennsylvania, USA",
        "popularity": 0.7158,
        "profile_path": "/mkgyl2MciZ14wsYi6zedyj6hnR8.jpg"
    }
}