{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sdL37sfUBth7mdkAolI83bXAl7L.jpg",
                "genre_ids": [
                    16,
                    878,
                    10751,
                    35
                ],
                "id": 482321,
                "original_language": "en",
                "original_title": "Ron's Gone Wrong",
                "overview": "In a world where walking, talking, digitally connected bots have become children's best friends, an 11-year-old finds that his robot buddy doesn't quite work the same as the others do.",
                "popularity": 3.5223,
                "poster_path": "/plzgQAXIEHm4Y92ktxU6fedUc0x.jpg",
                "release_date": "2021-10-14",
                "title": "Ron's Gone Wrong",
                "video": false,
                "vote_average": 7.883,
                "vote_count": 1938,
                "character": "Alex (voice)",
                "credit_id": "61a97d90d6819b00644201d8",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "ماركوس سكريبنر",
            "馬庫斯·史克里布納",
            "马库斯·斯克里布纳",
            "मार्कस स्क्रीबनर",
            "Μάρκους Σκράιμπνερ",
            "מרקוס סקריבנר",
            "マーカス・スクリブナー",
            "Маркус Скрибнер",
            "Маркус Скрібнер",
            "มาร์คัส สคริบเนอร์"
        ],
        "biography": "A fourth generation Los Angeles native, Marcus Scribner marked his arrival on January 7th in Cedars-Sinai, the same hospital his mother was born.\n\nLegacy has always ran strong in his family. Beginning with his name. His father Troy garnered his name through his father's love of Greek and Roman history and mythology. He continued this tradition with his own children, Marcus and his sister Athena. At age 10, when Marcus booked his first big guest star on the television show \"Castle\" he celebrated by getting his first puppy, a feisty beagle, he named Zeus.\n\nIn September 2014, he landed his first series regular playing Andre Jr on ABC's \"black-ish.\" The show went on to become the highest rated new comedy of the season.\n\nMarcus has garnered an NAACP Image Award for the show. And it has been honored with the prestigious \"Peabody Award,\" multiple \"NAACP\" Awards, and \"Emmy\" nominations.\n\nHe has always loved animation. It was his dream come true to the rambunctious dinosaur Buck in Pixar's \"The Good Dinosaur.\" And to become a part of the DreamWorks family in the animated series \"Home: Adventures with Tip & Oh\" airing on Netflix.\n\nAlways the proponent for a positive message, he is excited to be one of the leads in the upcoming feature in the upcoming teen feature \"Alexander IRL.\"\n\nOn his hiatus, Marcus can be found traveling the globe doing humanitarian work. The Beaches Resorts and Sandals Foundation just named him their first Youth Ambassador. He has visited several islands in the Caribbean helping to bring a higher education to children. He is also the Chief Youth Innovator for Reserve Protection Agency in South Africa who help to protect Africa's beautiful animals.\n\nAn honor student, he is working diligently towards his dream of attending one of the great Pac-12 Universities. Stanford and UCLA being his top choice.",
        "birthday": "2000-01-07",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1348591,
        "imdb_id": "nm3851090",
        "known_for_department": "Acting",
        "name": "Marcus Scribner",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.1856,
        "profile_path": "/mm7f9MssRDDAphGPp2OJE6Ial01.jpg"
    }
}