{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2va32apQP97gvUxaMnL5wYt4CRB.jpg",
                "genre_ids": [
                    14,
                    28,
                    80
                ],
                "id": 268,
                "original_language": "en",
                "original_title": "Batman",
                "overview": "Having witnessed his parents' brutal murder as a child, millionaire philanthropist Bruce Wayne fights crime in Gotham City disguised as Batman, a costumed hero who strikes fear into the hearts of villains. But when a deformed madman known as 'The Joker' seizes control of Gotham's criminal underworld, Batman must face his most ruthless nemesis ever while protecting both his identity and his love interest, reporter Vicki Vale.",
                "popularity": 10.8046,
                "poster_path": "/cij4dd21v2Rk2YtUQbV5kW69WB2.jpg",
                "release_date": "1989-06-21",
                "title": "Batman",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 8200,
                "character": "Ricorso",
                "credit_id": "5bbea0bc0e0a262366004bcf",
                "order": 22
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "John Dair (3 March 1933 – 25 November 2005) was a Scottish actor who was best known for his role as Harry Grout’s bodyguard \"Crusher\" in the sitcom Porridge and as Charlie Dawson in the drama Our Friends in the North.\n\nAlthough born in Dundee, Scotland, Dair was a resident of London, England, for many years.\n\nHe drove mobile cranes and bulldozers on building sites and then worked as a singer, until he was offered the part in Porridge whilst performing at the Lyceum Theatre, London. He appeared in one of the most memorable scenes in the sitcom in which his character displays a \"sense of humour failure\" when a joke is repeated to him. He also had small parts in films, the most memorable of which was in Batman as crime boss Vinnie Ricorso, who is fatally stabbed in the throat with a quill pen by the Joker.\n\nIn 1984, he appeared in the iconic music video for the Frankie Goes to Hollywood song \"Relax\" as a man dressed as a Roman emperor in a gay nightclub, and also had a part as a gambler in their No.1 selling single \"Two Tribes\" video directed by Godley & Creme. He also appeared in commercials including the acclaimed 1985 advertisement for Levi Strauss & Co. jeans with Nick Kamen that was set in a Laundromat. Dair died of lung cancer in 2005.",
        "birthday": "1933-03-03",
        "deathday": "2005-11-25",
        "gender": 2,
        "homepage": null,
        "id": 1348858,
        "imdb_id": "nm0197419",
        "known_for_department": "Acting",
        "name": "John Dair",
        "place_of_birth": "Dundee, Scotland, UK",
        "popularity": 0.0716,
        "profile_path": null
    }
}