{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/nrm4FH3Dl9D62B1Lj7dsQgkwXRa.jpg",
                "genre_ids": [
                    10402,
                    18
                ],
                "id": 12104,
                "original_language": "en",
                "original_title": "Pink Floyd: The Wall",
                "overview": "A troubled rock star descends into madness in the midst of his physical and social isolation from everyone.",
                "popularity": 3.2729,
                "poster_path": "/aElHyIdF5jmctFGhlhhaPFsbBJC.jpg",
                "release_date": "1982-07-14",
                "title": "Pink Floyd: The Wall",
                "video": false,
                "vote_average": 7.945,
                "vote_count": 1563,
                "character": "Lover",
                "credit_id": "52fe44b59251416c7503e4a9",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "British actor James Hazeldine was a well-known face both on British Television and on Stage. Best known for his role as Mike \"Bayleaf\" Wilson in the ITV drama, London's Burning (1988), many real-life firefighters thought Bayleaf was the character who closely and accurately portrayed your average real-life firefighter, a credit to his acting abilities. A meticulous performer, he was well-known for researching every part he played, and firmly believed that by accurately portraying a character the audience would feel much more involved in and enveloped by the performance. He played the role continuously for seven years from the serial's inception in 1988. (The character's sobriquet stemmed from a culinary bent for complex recipes).\n\nIn a career spanning three decades, he also guested in such series as 'Boon' and 'Miss Marple', and, in the late 1980s, played the manager of the electrics company in Central's early-evening situation comedy, Young, Gifted and Broke (1989). In 1995, Hazeldine's character was written out of London's Burning of the actor's own volition, but he remained with the programme as a director. In years to come, he expanded his directing talents to encompass other UK drama serials, among them TV's The Knock (1994) and Heartbeat (1992). His acting CV also included sporadic film appearances, such as Pink Floyd: The Wall (1982). Although renowned as a television performer, he was also a respected stage actor, having trained with the Royal Shakespeare Company and, at one time, acted on Broadway alongside Glenda Jackson. He was rehearsing for his role as Sigmund Freud in a new stage play, 'The Talking Cure', when he became ill. In 2002 he appeared in the controversial drama, Shipman, which re-enacted events surrounding the murderous killing spree of Dr Harold Shipman, Britain's most prolific serial killer. Hazeldine assumed the role of Detective Inspector Stan Egerton, the man charged with leading the investigation into the deranged doctor's crimes.\n\nDetermined that the dramatization should be as authentic as possible, Hazeldine even met with the retired policeman to ensure a realistic portrayal of the diligent law enforcer. Ironically, while the Shipman drama was in production, the real-life Mr. Egerton died suddenly and prematurely of a coronary disorder. James Hazeldine died on 18 December 2002, aged 55. There will never be anyone quite like him again, British Television mourned the loss of a truly great actor, director and personality.",
        "birthday": "1947-04-04",
        "deathday": "2002-12-17",
        "gender": 2,
        "homepage": null,
        "id": 135101,
        "imdb_id": "nm0371951",
        "known_for_department": "Acting",
        "name": "James Hazeldine",
        "place_of_birth": "Salford, Lancashire, England",
        "popularity": 0.1862,
        "profile_path": "/tRJGeDPhISXc6jCr34pcQ10CYgV.jpg"
    }
}