{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/npLwIeUobjVCM4fLfdeLqQhAoey.jpg",
                "genre_ids": [
                    28
                ],
                "id": 9461,
                "original_language": "en",
                "original_title": "Enter the Dragon",
                "overview": "A martial artist agrees to spy on a reclusive crime lord using his invitation to a tournament there as cover.",
                "popularity": 6.8884,
                "poster_path": "/fyrh2ULEcmLpGTVLPQqFW45hqr5.jpg",
                "release_date": "1973-08-17",
                "title": "Enter the Dragon",
                "video": false,
                "vote_average": 7.419,
                "vote_count": 1987,
                "character": "Parsons",
                "credit_id": "5b6b9c72925141034102a87c",
                "order": 23
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Peter Archer (1943-2000) was an Australian entrepreneur, martial arts champion, and actor. He was best known for his role as Parsons in the 1973 martial arts film Enter the Dragon, starring Bruce Lee.\n\nArcher was born in Queensland, Australia, in 1943. He grew up on a farm and developed a down-to-earth personality. He was also a skilled athlete and martial artist, holding black belts in both Goju-ryu and Shotokan karate.\n\nIn the early 1970s, Archer moved to Hong Kong to pursue a career in acting. He landed his first major role in Enter the Dragon, in which he played a sadistic karate student who is defeated by Lee. Archer's performance was well-received, and he went on to appear in several other martial arts films, including Bruce Lee and Kung Fu Mania (1992) and Bruce Lee: The Intercepting Fist (1999).\n\nIn addition to his acting career, Archer was also a successful businessman. He started a company called Jackel Australia, which marketed and distributed baby products and dye products.\n\nArcher died of cancer in Sydney, Australia, in 2000. He was 56 years old.",
        "birthday": "1943-07-08",
        "deathday": "2000-04-13",
        "gender": 2,
        "homepage": null,
        "id": 135178,
        "imdb_id": "nm0033717",
        "known_for_department": "Acting",
        "name": "Peter Archer",
        "place_of_birth": "Queensland, Australia",
        "popularity": 0.2029,
        "profile_path": "/78RDeqHeTgWoUZo6Fe9GLHiJIAG.jpg"
    }
}