{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/flqONlzGNUkGCJr9BfBhGNLYo6B.jpg",
                "genre_ids": [
                    35,
                    36
                ],
                "id": 544510,
                "original_language": "fr",
                "original_title": "Edmond",
                "overview": "Paris, France, December 1897. The young playwright Edmond Rostand feels like a failure. Inspiration has abandoned him. Married and father of two children, desperate and penniless, he persuades the great actor Constant Coquelin to perform the main role in his new play. But there is a problem: Coquelin wants to premiere it at Christmas and Edmond has not written a single word.",
                "popularity": 1.918,
                "poster_path": "/9Y1VxSfJdu8fqQqgX0x6OObxvUw.jpg",
                "release_date": "2018-11-10",
                "title": "Cyrano, My Love",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 516,
                "character": "Léo",
                "credit_id": "5b812a0bc3a368656000d526",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/nvW0QfRJ7ga9TK8DKwBfAPA8ywP.jpg",
                "genre_ids": [
                    28,
                    18,
                    80
                ],
                "id": 944401,
                "original_language": "fr",
                "original_title": "Dogman",
                "overview": "A boy, bruised by life, finds his salvation through the love of his dogs.",
                "popularity": 9.9999,
                "poster_path": "/5RuUD7J4vO0El7TRL9guZIik0I0.jpg",
                "release_date": "2023-09-27",
                "title": "Dogman",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 1238,
                "character": "Bradley",
                "credit_id": "672798f99e0877d1d8af9c98",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Том Ліб"
        ],
        "biography": "Tom Leeb (born 21 March, 1989) is a French actor, singer and comedian. He would have represented France in the Eurovision Song Contest 2020 at Rotterdam, the Netherlands, with the song  \"Mon alliée (The Best in Me)\".\n\nLeeb is the son of humorist Michel Leeb and journalist Béatrice Malicet, Tom Leeb was born in Paris in 1989. He is the youngest in the family, after Fanny (born in 1986) and Elsa (born in 1988).\n\nIn 2003, he played in the theater with his father in Madame Doubtfire. He studied theater, cinema, singing and dance in New York for five years.\n\nIn 2013, he was chosen for the role of Tom in the series Sous le soleil de Saint-Tropez, then played the role of Adrien in an episode Section de recherches. The same year, he played in the film Paroles.\n\nHe appeared in the film Avis de mistral, with Jean Reno in 2014. The same year, he formed a comic duet with the actor Kevin Levy and together they created their first show Kevin et Tom. The two comedians were the opening act of Gad Elmaleh at the Olympia then went on tour on Parisian stages. In parallel with their show, they launched a new format, mini-video sequences of around 3 minutes entitled: \"How ...\".\n\nIn March 2018, he released his first single \"Are We Too Late\" under the Roy Music label. He is inspired by artists like John Mayer, Matt Corby or even Ben Howard.\n\nOn 14 January 2020, the public national television channel France 2 announced that it has selected Tom Leeb to represent France at the Eurovision Song Contest 2020, scheduled for May 16, with his song Mon alliée (The Best in Me). The competition was cancelled on March 18, however, due to the Covid-19 pandemic. On June 19, 2020, Leeb confirmed that he would not represent France in the Eurovision Song Contest 2021.\n\nSource: Article \"Tom Leeb\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1990-03-21",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1351944,
        "imdb_id": "nm1861637",
        "known_for_department": "Acting",
        "name": "Tom Leeb",
        "place_of_birth": "Paris, France",
        "popularity": 0.4306,
        "profile_path": "/rklBhngEhZxUmsZ1aWLxPamnIoi.jpg"
    }
}