{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/scQf03Fm3jeyv4FH04qvi4fp4wh.jpg",
                "genre_ids": [
                    80,
                    35,
                    28
                ],
                "id": 402900,
                "original_language": "en",
                "original_title": "Ocean's Eight",
                "overview": "Debbie Ocean, a criminal mastermind, gathers a crew of female thieves to pull off the heist of the century at New York's annual Met Gala.",
                "popularity": 8.6805,
                "poster_path": "/MvYpKlpFukTivnlBhizGbkAe3v.jpg",
                "release_date": "2018-06-07",
                "title": "Ocean's Eight",
                "video": false,
                "vote_average": 6.968,
                "vote_count": 8525,
                "character": "Cara",
                "credit_id": "5c842c2692514127631fa34a",
                "order": 25
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Charlotte Sophie Kirk"
        ],
        "biography": "Charlotte Sophie Kirk was born in Kent, England. Her passion for acting began at the age of 11 when she fell in love with the stage. She has since performed in Greek dramas and plays such as \"Agamemnon,\" \"Arturo Ui,\" \"A Christmas Carol,\" \"Oliver Twist,\" and \"Hairspray.\" Having attended the prestigious Italia Conti School of Acting in London, her skills were further refined at The Miskin Theatre and Jigsaw Performing Arts. While studying theatre arts, she appeared in commercials for Nintendo Wii and UK Orange Telecom.\n\nCharlotte also became sought after and was photographed for magazines internationally, in particular by renowned Vogue photographer Patrick Demarchelier.\n\nIn early 2015, Charlotte Kirk landed a starring role in \"Vice\" opposite Bruce Willis and Thomas Jane, a sci-fi futuristic thriller. Charlotte has completed seven feature films, including \"Black Dog Red Dog\" with James Franco, \"Fractured\" with Vinnie Jones, \"Seduced and Abandoned,\" directed by James Toback, and \"Tekken: Kazuya's Revenge,\" where she plays a female assassin.\n\nShe will also be starring as Nicole Brown Simpson in the upcoming feature film \"An American Mystery\".\n\n\"Gone With The Wind\" is her all-time favorite film, as she admires strong heroines. Charlotte presently resides in Los Angeles and is managed by Endorse Management Group and Headline Talent Agency.",
        "birthday": "1992-06-16",
        "deathday": null,
        "gender": 1,
        "homepage": "https://charlottekirk.com",
        "id": 1352662,
        "imdb_id": "nm5016840",
        "known_for_department": "Acting",
        "name": "Charlotte Kirk",
        "place_of_birth": "Kent, England, UK",
        "popularity": 1.0626,
        "profile_path": "/n5ojGnmoHpQZnlPcMY0ahVTeoFp.jpg"
    }
}