{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xQyGkQ8ICa4lgifGr3oZjkm3AJ2.jpg",
                "genre_ids": [
                    18
                ],
                "id": 804095,
                "original_language": "en",
                "original_title": "The Fabelmans",
                "overview": "Growing up in post-World War II era Arizona, young Sammy Fabelman aspires to become a filmmaker as he reaches adolescence, but soon discovers a shattering family secret and explores how the power of films can help him see the truth.",
                "popularity": 5.3526,
                "poster_path": "/h7llKkqkkJtJrTOaDLuVeUYDQ7I.jpg",
                "release_date": "2022-11-11",
                "title": "The Fabelmans",
                "video": false,
                "vote_average": 7.584,
                "vote_count": 2551,
                "character": "Roger",
                "credit_id": "6282a4ce87a27a0051051bee",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Gabriel Michael Bateman",
            "Γκάμπριελ Μπέιτμαν",
            "گابریل بیتمن"
        ],
        "biography": "Gabriel Michael Bateman (born September 10, 2004) is an American actor. He is best known for starring in numerous horror films, including as Robert in Annabelle (2014), Martin Wells in Lights Out (2016), Andy Barclay in Child's Play (2019), and Kyle Hunter in Unhinged (2020).  Bateman made his acting debut in 2012, appearing in the film George Biddle, CPA. In 2014, he had a supporting role as Robert in the supernatural horror film Annabelle, a spin-off of the acclaimed horror film The Conjuring. From 2014 to 2015, he starred as Ethan Taylor in the CBS drama thriller series Stalker.\n\nIn November 2014, he was cast in Robert Kirkman's Cinemax horror drama series Outcast. He appeared in the series as Joshua Austin from 2016 to 2017. In 2015, he had guest roles in various television series, including Your Family or Mine, Wicked City, and Code Black. In 2016, Bateman played a leading role, alongside Teresa Palmer, in the supernatural horror film Lights Out, which was produced by James Wan. Also that year, he starred as Jack Hawthorne in the CBS mystery drama series American Gothic, which ran for one season. In 2018, he starred as Carter Hughes in the Netflix family comedy film Benji. He also starred as Wyatt McKenna in the Prime Video comedy drama series The Dangerous Book for Boys.\n\nBateman starred in commercials for Staples, Frigidaire, Energizer EcoAdvanced Recycled Batteries, Iams, and the Cadillac CTS Sedan. He also appeared in two music videos (\"It's a Job\" and \"A New Beginning\") for the album I Remembered But Then I Forgot by Wolfie's Just Fine, a folk music side project of Jon Lajoie.\n\nIn 2019, Bateman received further recognition for starring as Andy Barclay in the horror film Child's Play, alongside Aubrey Plaza. The film was a critical and commercial success. Also that year, he starred as Charlie Brenner in the musical adventure film Playmobil: The Movie and as Scott in the historical war film Robert the Bruce. In 2020, he starred as Oliver Reed in the family film Think Like a Dog and as Kyle Hunter in the thriller film Unhinged, alongside Russell Crowe.",
        "birthday": "2004-09-10",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1352028,
        "imdb_id": "nm5145655",
        "known_for_department": "Acting",
        "name": "Gabriel Bateman",
        "place_of_birth": "Turlock, California, USA",
        "popularity": 0.6798,
        "profile_path": "/6qNrduicWPPaMR2Vst2BJL4XyQb.jpg"
    }
}