{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/nLLYm9qPtE6WwFSzDOHMUUfytcx.jpg",
                "genre_ids": [
                    35,
                    10402,
                    18
                ],
                "id": 304410,
                "original_language": "fr",
                "original_title": "La Famille Bélier",
                "overview": "The whole Bélier family is deaf, except for sixteen year old Paula who is the important translator in her parents' day to day life especially when it comes to matters concerning the family farm. When her music teacher discovers she has a fantastic singing voice and she gets an opportunity to enter a big Radio France contest the whole family's future is set up for big changes.",
                "popularity": 3.0656,
                "poster_path": "/kAQeZUZ1pMTSjSF3d6eBZClFGgN.jpg",
                "release_date": "2014-12-17",
                "title": "The Bélier Family",
                "video": false,
                "vote_average": 6.933,
                "vote_count": 2405,
                "character": "Paula Bélier",
                "credit_id": "546cc5e9c3a368097400193c",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "루안 에머라",
            "루안",
            "Anne Peichert",
            "Louane Emera"
        ],
        "biography": "Anne Peichert (born 26 November 1996), known by her stage name Louane Emera or simply Louane, is a French singer and actress.\n\nShe is best known for being a semi-finalist in the second season of The Voice: la plus belle voix in France with Louis Bertignac as a coach. She later got a role in La Famille Bélier which won her a César Award.\n\nAnne Peichert grew up in the French department of Pas-de-Calais, with her four sisters and her only brother Bach. Louane's father, Jean-Pierre Peichert, was French, son of a Polish mother and German father. Her mother, Isabel Pinto dos Santos, was Portuguese, the daughter of a Portuguese father and a Brazilian mother.\n\nIn 2008, Louane Emera took part in L'École des stars, a French music competition broadcast on channel Direct 8.\n\nLouane is an orphan - her rendition of \"Imagine\" was dedicated to her father who had died just three months prior to her appearance in The Voice and her mother died in 2014 after a lengthy illness. Louane Emera said that her parents often had to punish her due to her hyperactivity, but that she has learned a lot about discipline from them and that they always treated her with love. She regularly gives them credit for her success.\n\nIn 2013, her first real breakthrough came with her taking part in The Voice: la plus belle voix's second season. She auditioned with \"Un homme heureux\" by William Sheller with all four coaches Florent Pagny, Jenifer, Louis Bertignac and Garou turning their chairs. She opted to be part of Team Louis Bertignac. Her \"blind audition\" episode was broadcast on 16 February 2013.\n\n23 March 2013, during the Musical Battles round, she was picked by Bertignac against her rival Diana Espir, after both interpreted \"Torn\" by Natalie Imbruglia. During the live rounds, she sang \"Les moulins de mon cœur\" by Michel Legrand and was saved by public vote. On 27 April 2013 she performed \"Call Me Maybe\" by Carly Rae Jepsen and was saved by her mentor coach to go through. With Lennon's \"Imagine\" dedicated to her deceased father, she was saved yet again by public vote. But her luck ended in the semi-finals after her rendition of \"Quelqu'un m'a dit\" by Carla Bruni. She had a cumulative score of 74 while the other Team Bertignac semi-finalist Loïs had a composite score of 76. Accordingly, Louane was eliminated finishing 5th to 8th.\n\nAll semi-finalists and finalists, including Louane, took part in an after-season tour throughout France.\n\nAfter her appearance in The Voice, Éric Lartigau noticed her and cast her for his movie La Famille Bélier in which she played the role of Paula, a 16-year-old who is the only hearing person in a family of deaf people. The character sings a number of Michel Sardou songs, most notably \"Je vole\". As a result, she won the \"Most Promising Actresses\" at the 40th ceremony of the Césars.\n\nOn 5 February 2015, she served as an opening act for Jessie J's showcase in Paris.\n\nHer debut studio album, Chambre 12, was released on 2 March 2015, to great success. Her single \"Avenir\" also topped the French charts.\n\nIn 2017, she provided vocals for the track, \"It Won't Kill Ya,\" from The Chainsmokers' debut album, Memories...Do Not Open.\n\nSource: Article \"Louane (singer)\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1996-11-26",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1352046,
        "imdb_id": "nm6303670",
        "known_for_department": "Acting",
        "name": "Louane",
        "place_of_birth": "Hénin-Beaumont, Pas-de-Calais, France",
        "popularity": 0.738,
        "profile_path": "/49YovTlB8ywgwe3XSwbAmgoVm5i.jpg"
    }
}