{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/titl6uMe5u974sLAA2Zy1kFi4sC.jpg",
                "genre_ids": [
                    18,
                    28,
                    36,
                    53
                ],
                "id": 612,
                "original_language": "en",
                "original_title": "Munich",
                "overview": "During the 1972 Olympic Games in Munich, eleven Israeli athletes are taken hostage and murdered by a Palestinian terrorist group known as Black September. In retaliation, the Israeli government recruits a group of Mossad agents to track down and execute those responsible for the attack.",
                "popularity": 4.4464,
                "poster_path": "/iUekaw96QLInZpsNwRTlRKrZgwm.jpg",
                "release_date": "2005-12-23",
                "title": "Munich",
                "video": false,
                "vote_average": 7.143,
                "vote_count": 2805,
                "character": "Aida Refugee Camp Woman",
                "credit_id": "624a532b8c7b0f009a14560a",
                "order": 96
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            " Fettouma Ousliha-Bouamari",
            " Fettouma Ousliha",
            "Fattouma Ousliha Bouamari",
            "فتومة أوسليحة",
            "Fettouma Bouamari "
        ],
        "biography": "Fettouma Ousliha-Bouamari born in Algiers, is an Algerian actress, musician and singer.\n\nFettouma Ousliha is the daughter of a docker father, a worker mother... and a daughter of the revolution as she defines herself \"I was a teenager during the war of national liberation; I grew up in the middle of the battle of Algiers\". In these conditions, there was no question of studying to become an actress, of going through conservatories: \"My parents did not have the means to allow me to continue school; my father, at the port, did not bring in tokens every days: I wanted to find work to help my parents. I started as a typist, says Fettouma, but, from my childhood, my goal was to do theater, and I wanted to deepen my cultural level for that.\" Here she is, a singer; Mustapha Kateb, then director of the Algerian National Theater, encouraged him; and also the playwrights Kaki and Abdelkader Sefiri. She debuted on stage in \"L'Oiseau Vert\", in 1963, an adaptation of Gozzi's play; secondly, it is a creation of a social nature. “Two Rooms Kitchen”; then “The Caucasian Chalk Circle”, by Brecht, and “The Man with the Rubber Sandals”, by Kateb Yacine; finally, two other creations: “The Blood of the Righteous” (on the armed revolution) and a “Revizor”, inspired by Gogol, on bureaucracy. All these shows were performed in dialect Arabic.\n\nThe film \"Premier Pas\" by Mohamed Bouamari (1979) earned the actress Fettouma Ousliha-Bouamari, his partner in life, the Interpretation prize at Carthage 1980.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.spla.pro/fr/fiche.personnes.spla.9847.html",
        "id": 1352883,
        "imdb_id": "nm0653638",
        "known_for_department": "Acting",
        "name": "Fettouma Ousliha-Bouamari",
        "place_of_birth": "Alger, Algérie",
        "popularity": 0.6316,
        "profile_path": "/get3DVtSlroKev8gRW4mQ18eZnh.jpg"
    }
}