{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gOgBpD5NivnWIqZYTBFSmAtziuJ.jpg",
                "genre_ids": [
                    18,
                    80,
                    53,
                    35
                ],
                "id": 455714,
                "original_language": "th",
                "original_title": "ฉลาดเกมส์โกง",
                "overview": "Lynn, a brilliant student, after helping her friends to get the grades they need, develops the idea of starting a much bigger exam-cheating business.",
                "popularity": 4.1879,
                "poster_path": "/mgyvwqn5SYKhfg5kofZDfgH8R0q.jpg",
                "release_date": "2017-05-03",
                "title": "Bad Genius",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 810,
                "character": "Bank",
                "credit_id": "590968fe9251411cde00819a",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Non Chanon Santinatornkul",
            "查农·桑提纳同库",
            "Nonkul Chanon Santinatornkul",
            "นนกุล ชานน สันตินธรกุล"
        ],
        "biography": "Chanon Santinatornkul, nicknamed Nonkul or Non, is an actor born in Bangkok. He graduated from school from Bangkok Christian College, and completed undergraduate education in film production at Mahidol University International College.\n\nNonkul first appeared in the 2014 indie gay romance 'Love's Coming' as a supporting character, although his first acting role was in 'Patcha is Sexy', a short film and reproductive health campaign sponsored by the Ministry of Public Health. He went on to join the roster of Nadao Bangkok, a talent management company and subsidiary of the production company GTH (now GDH 559). He became widely noticed for his role as Net, a minor character in the hit TV series 'Hormones'.\n\nChanon's role as Bank in the 2017 hit thriller 'Bad Genius' brought him international fame, especially in China. He has since appeared in the Chinese TV series 'Blowing in the Wind'. He did not renew his contract with Nadao Bangkok when it expired in 2018, and is now working independently.",
        "birthday": "1996-06-06",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1353678,
        "imdb_id": "nm7081087",
        "known_for_department": "Acting",
        "name": "Chanon Santinatornkul",
        "place_of_birth": "Bangkok, Thailand",
        "popularity": 0.2104,
        "profile_path": "/osG0qvkXtpO0DPiZKlSllAVjTlE.jpg"
    }
}