{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hoyAALgfmjMEK7O1wZ4r8wT91RP.jpg",
                "genre_ids": [
                    18,
                    53,
                    80
                ],
                "id": 64690,
                "original_language": "en",
                "original_title": "Drive",
                "overview": "Driver is a skilled Hollywood stuntman who moonlights as a getaway driver for criminals. Though he projects an icy exterior, lately he's been warming up to a pretty neighbor named Irene and her young son, Benicio. When Irene's husband gets out of jail, he enlists Driver's help in a million-dollar heist. The job goes horribly wrong, and Driver must risk his life to protect Irene and Benicio from the vengeful masterminds behind the robbery.",
                "popularity": 8.9588,
                "poster_path": "/602vevIURmpDfzbnv5Ubi6wIkQm.jpg",
                "release_date": "2011-09-15",
                "title": "Drive",
                "video": false,
                "vote_average": 7.584,
                "vote_count": 13070,
                "character": "Stripper",
                "credit_id": "52fe46e4c3a368484e0a9b5b",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": true,
        "also_known_as": [
            "Andi Love",
            "Inked Andi",
            "Rock Christina",
            "Andi Crush",
            "Andie San Dimas",
            "Sarah Joelle Hildebrand",
            "安迪·圣迪玛丝"
        ],
        "biography": "Andy San Dimas was born Sarah Joelle Hildebrand on October 3, 1986 in Baltimore, Maryland. She's of mixed German and Native American descent. Andy originally wanted to be a ventriloquist. At age 18 Dimas got a job at an adult video store in Frederick, Maryland. After seeing several ads for adult filmmaker Eon McKai's movies in magazines sold at the store, Andy decided to contact McKai on the Internet by sending him a nude photo of herself in a MySpace private message. Dimas subsequently moved to Los Angeles, California to pursue a career in the porn industry and appeared in her first explicit hardcore movie in 2007. She resides in Los Angeles, California.",
        "birthday": "1986-10-03",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 135461,
        "imdb_id": "nm2872008",
        "known_for_department": "Acting",
        "name": "Andy San Dimas",
        "place_of_birth": "Baltimore, Maryland, USA",
        "popularity": 4.984,
        "profile_path": "/5rhVhqM47MuyjDloNGPeukrr4nn.jpg"
    }
}