{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/j82SfPOqas5rvHbAHAPq7OgaSir.jpg",
                "genre_ids": [
                    18,
                    10749,
                    10752
                ],
                "id": 271674,
                "original_language": "en",
                "original_title": "Suite Française",
                "overview": "France, 1940. In the first days of occupation, beautiful Lucile Angellier is trapped in a stifled existence with her controlling mother-in-law as they both await news of her husband: a prisoner of war. Parisian refugees start to pour into their small town, soon followed by a regiment of German soldiers who take up residence in the villagers' own homes. Lucile initially tries to ignore Bruno von Falk, the handsome and refined German officer staying with them. But soon, a powerful love draws them together and leads them into the tragedy of war.",
                "popularity": 5.0991,
                "poster_path": "/mPgijY9f79FfD7K8MmzsynXpq0R.jpg",
                "release_date": "2015-03-12",
                "title": "Suite Française",
                "video": false,
                "vote_average": 7.258,
                "vote_count": 1123,
                "character": "Madame Joseph",
                "credit_id": "554f59dbc3a3682254003c5f",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Deborah Findley",
            "Deborah Finlay"
        ],
        "biography": "Deborah Findlay is an English actress.\n\nHer TV credits include the recurring character Greer Thornton in 4 of the 6 episodes of State of Play, and in the episode The French Drop (2004) in Foyle's War. She also appeared in 4 episodes of the 2001 series of The Armstrong and Miller Show. In Autumn 2007 she appeared with Judi Dench, Imelda Staunton and Francesca Annis in the BBC1 costume drama series Cranford playing the role of the endless spinster Miss Augusta Tompkinson as well as in Wilfred Owen: A Remembrance Tale. She portrayed Home Secretary Denise Riley in Torchwood's 2009 third series Children of Earth, and featured as lawyer Gemma King in one episode of the BBC1 series Silent Witness in January 2010.\n\nIn 2008 she starred in the US premiere of Vincent River by Philip Ridley. In 2009 she appeared, again alongside Judi Dench in a Donmar West End revival of Madame de Sade, and reprised her (in this case more prominent) role as Augusta Tompkinson in the two-part Christmas special Return to Cranford.\n\nShe also played Gillian in the acclaimed 1999 ITV Drama The Last Train\n\nShe won the 1997 Outer Critics' Circle Award for Outstanding Featured Actress in a Play (sharing the award with Allison Janney and Celia Weston) as well as the Olivier Award for her formance in Stanley.\n\nDescription above from the Wikipedia article Deborah Findlay, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1947-12-31",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 135420,
        "imdb_id": "nm0277525",
        "known_for_department": "Acting",
        "name": "Deborah Findlay",
        "place_of_birth": "Leatherhead, Surrey, England, UK",
        "popularity": 0.6846,
        "profile_path": "/4FbdygLj08dfo63hNCZNc36FEr1.jpg"
    }
}