{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cq9N64ucEtfIc3eMxNr1VzY9LH9.jpg",
                "genre_ids": [
                    18
                ],
                "id": 37799,
                "original_language": "en",
                "original_title": "The Social Network",
                "overview": "In 2003, Harvard undergrad and computer programmer Mark Zuckerberg begins work on a new concept that eventually turns into the global social network known as Facebook. Six years later, Mark is one of the youngest billionaires ever, but his unprecedented success leads to both personal and legal complications when he ends up on the receiving end of two lawsuits, one involving his former friend.",
                "popularity": 8.1277,
                "poster_path": "/n0ybibhJtQ5icDqTp8eRytcIHJx.jpg",
                "release_date": "2010-10-01",
                "title": "The Social Network",
                "video": false,
                "vote_average": 7.37,
                "vote_count": 12636,
                "character": "Dorm Room Guy #2 (uncredited)",
                "credit_id": "56462c5b9251413ad50002af",
                "order": 126
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Jeff Rosick is an Actor, Music Composer, Producer, Writer and Graphic Designer from Portland, Oregon. Shortly after moving to Los Angeles, Jeff became known for his role as Buddy Garrity Jr. on the Emmy Award winning television show Friday Night Lights. Later, he played a stoic young hit man in the TV pilot Metro, under the direction of Academy Award winner Stephen Gaghan, and went on to work opposite David Duchovny in NBC's Aquarius as Officer Colin McInerny. While recurring on NBC's Parenthood, Jeff played a high school bully opposite Craig T. Nelson and Miles Heizer, and then guest starred on FOX's Bones as Darrell Taggert - a good guy having a good time, in the wrong place at the wrong time. On the set of the NYTVF-nominated television pilot Camp Abercorn, Jeff reunited as a Boy Scout camp staff member opposite his Friday Night Lights father Buddy Garrity, played by actor Brad Leland. Jeff went on to score original music to the pilot, as well.\n\nAfter attending Loyola University Chicago and Gonzaga University, Jeff earned his B.A. in Theatre. Shortly after graduating, he landed his first film role in the indie feature Norman, starring Dan Byrd, Richard Jenkins and Adam Goldberg. Future collaborations led Jeff into writing, producing, starring in and scoring films like The Massacre at Black Divide and Constant.\n\nHe has studied with top acting coaches that include Katt Shea, Rod Rowland, and UCB in Los Angeles.\n\nJeff is constantly working in the entertainment industry, whether as an Actor, Music Composer, Graphic Designer or one of his various other creative roles. He is a classically trained pianist, plays the guitar and sings (bari-tenor).",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.jeffrosick.com",
        "id": 1354417,
        "imdb_id": "nm3592005",
        "known_for_department": "Acting",
        "name": "Jeff Rosick",
        "place_of_birth": null,
        "popularity": 0.0143,
        "profile_path": "/sDNDmyZirNE3kFzgSDvG9pK3NQw.jpg"
    }
}