{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6MKr3KgOLmzOP6MSuZERO41Lpkt.jpg",
                "genre_ids": [
                    35,
                    80,
                    12
                ],
                "id": 337404,
                "original_language": "en",
                "original_title": "Cruella",
                "overview": "In 1970s London amidst the punk rock revolution, a young grifter named Estella is determined to make a name for herself with her designs. She befriends a pair of young thieves who appreciate her appetite for mischief, and together they are able to build a life for themselves on the London streets. One day, Estella’s flair for fashion catches the eye of the Baroness von Hellman, a fashion legend who is devastatingly chic and terrifyingly haute. But their relationship sets in motion a course of events and revelations that will cause Estella to embrace her wicked side and become the raucous, fashionable and revenge-bent Cruella.",
                "popularity": 11.2552,
                "poster_path": "/hjS9mH8KvRiGHgjk6VUZH7OT0Ng.jpg",
                "release_date": "2021-05-26",
                "title": "Cruella",
                "video": false,
                "vote_average": 7.987,
                "vote_count": 9719,
                "character": "Beehive Lady",
                "credit_id": "60b260fac490480040f9d7bb",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Сара Кроуден"
        ],
        "biography": "Born in Edinburgh in 1955 to acting parents Graham Crowden and Phyllida Hewat, Sara Crowden is a British character actress who works extensively in film, TV and theatre. She is also a professional writer, contributing to the literary quarterly Slightly Foxed and has reviewed books for The Lady, TLS, Geographical and Literary Review amongst others, and performs stand-up comedy under the alias of Dame Theresa Thompson's-Gazelle. She has a Bachelor of Arts degree and a Diploma in Literature from The Open University and, in 2010, was awarded a Foundation Certificate in Bricklaying.",
        "birthday": "1955-01-01",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1356007,
        "imdb_id": "nm0189562",
        "known_for_department": "Acting",
        "name": "Sarah Crowden",
        "place_of_birth": "Edinburgh, Scotland, UK",
        "popularity": 0.3018,
        "profile_path": "/3mc7xMh0hGsHPuxCKjJtHQ7viYH.jpg"
    }
}