{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/v8Nf6Y1qL1Q3PWTBezXNPPaXqza.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 556984,
                "original_language": "en",
                "original_title": "The Trial of the Chicago 7",
                "overview": "What was supposed to be a peaceful protest turned into a violent clash with the police. What followed was one of the most notorious trials in history.",
                "popularity": 3.4892,
                "poster_path": "/ahf5cVdooMAlDRiJOZQNuLqa1Is.jpg",
                "release_date": "2020-09-25",
                "title": "The Trial of the Chicago 7",
                "video": false,
                "vote_average": 7.677,
                "vote_count": 3175,
                "character": "Bernadine",
                "credit_id": "5d9e556a48333a00416c556e",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "愛麗絲·克雷梅伯格"
        ],
        "biography": "Alice Kremelberg is a film, television and theater actor born and raised in New York. Alice has most recently starred in the final season of The Sinner as Percy Muldoon, and played Bernadine in Aaron Sorkin's Oscar nominated The Trial of the Chicago 7 for Netflix/Dreamworks.  She recurred as Nicole Eckelcamp on the last two seasons of Jenji Kohan's Orange is the New Black for Netflix. Alice was nominated for an Emmy for their performance as Kat in The Feels, which they both co-wrote and acted in. Upcoming, Alice will be playing Abby in Monsterland for Hulu/Annapurna, and Duff in the independent film Bleecker. They can also be seen as Sorrell in Doomsday (ITV Fest, Brooklyn Web Fest + HollyWeb Fest winner). Her other film and television credits include New Amsterdam, The Taking of Pelham 123, NCIS, Nurse Jackie, Blue Bloods, The Big C, Smash, Law and Order: SVU, and 30 Rock.",
        "birthday": "1990-02-28",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1357037,
        "imdb_id": "nm2450512",
        "known_for_department": "Acting",
        "name": "Alice Kremelberg",
        "place_of_birth": "Long Island, New York, USA",
        "popularity": 0.8201,
        "profile_path": "/l82uQGCwzJ5AaotsoH7tRxIFsTR.jpg"
    }
}