{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/nCl5KzxUs4rVVlAdixDf4r5AbbZ.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 887,
                "original_language": "en",
                "original_title": "The Best Years of Our Lives",
                "overview": "It's the hope that sustains the spirit of every GI: the dream of the day when he will finally return home. For three WWII veterans, the day has arrived. But for each man, the dream is about to become a nightmare.",
                "popularity": 5.3127,
                "poster_path": "/gd5EoAU4MM57sW3vlWxJ0NMM8cV.jpg",
                "release_date": "1946-12-25",
                "title": "The Best Years of Our Lives",
                "video": false,
                "vote_average": 7.79,
                "vote_count": 694,
                "character": "Milly Stephenson",
                "credit_id": "52fe4287c3a36847f80261bf",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Мирна Лой",
            "میرنا لوی"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nMyrna Loy (August 2, 1905 – December 14, 1993) was an American actress. Trained as a dancer, she devoted herself fully to an acting career following a few minor roles in silent films. Originally typecast in exotic roles, often as a vamp or a woman of Asian descent, her career prospects improved following her portrayal of Nora Charles in The Thin Man (1934). Her successful pairing with William Powell resulted in 14 films together, including five subsequent Thin Man films.\n\nAlthough Loy was never nominated for a competitive Academy Award, in March 1991 she was presented with an Honorary Academy Award with the inscription \"In recognition of her extraordinary qualities both on screen and off, with appreciation for a lifetime's worth of indelible performances.\"\n\nDuring World War II, Loy served as assistant to the director of military and naval welfare for the Red Cross. She was later appointed a member-at-large of the U.S. Commission to UNESCO. Her acting career by no means ended in the 1940s. She continued to actively pursue stage and television appearances in addition to films in subsequent decades.",
        "birthday": "1905-08-02",
        "deathday": "1993-12-14",
        "gender": 1,
        "homepage": null,
        "id": 13577,
        "imdb_id": "nm0001485",
        "known_for_department": "Acting",
        "name": "Myrna Loy",
        "place_of_birth": "Radersburg, Montana, USA",
        "popularity": 0.4351,
        "profile_path": "/dMGhZpDSgZUHL7yH06hj7Snb1o4.jpg"
    }
}