{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qegwTsiVjrNY9nwkwzLJQ5r4204.jpg",
                "genre_ids": [
                    35,
                    14,
                    878
                ],
                "id": 416494,
                "original_language": "en",
                "original_title": "Status Update",
                "overview": "After being uprooted by his parents' separation and unable to fit into his new hometown, a teenager stumbles upon a magical app that causes his social media updates to come true.",
                "popularity": 2.7445,
                "poster_path": "/E4twRNScyq3g6tRpvK6X8LdD1z.jpg",
                "release_date": "2018-02-09",
                "title": "Status Update",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 553,
                "character": "Teacher",
                "credit_id": "57ddddca9251417853003e69",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Maria J. Cruz is a born and raised Vancouver, BC actor. She booked her first professional theatre gig while attending her final year of the University of British Columbia's Theatre program. As \"Tina\", in 'Tony 'n' Tina's Wedding', Vancouver's longest running stage play, she was married hundreds of times to over a half a dozen different \"Tony's\" and has gone onto play the independent stages of Vancouver and Toronto, including the iconic Second City. She lives best in acerbic comedic roles and the Classics - having had several favourable reviews in Restoration plays.\n\nTaking some time off shortly after the new millennium to obtain her Masters degree in Museum studies, she returned to her first love of acting over 6 years ago and plans to \"stay on the bus\". She has had not one, but two recurring roles as a nanny - on 1999's NBC remake 'Cold Feet' and on the upcoming 'Girlfriend's Guide to Divorce', Bravo TV's first even scripted series.\n\nThis year Maria had the opportunity to perform her one-woman stage play (in her native Portuguese and English) in the middle of the Atlantic at the 'Azores International Fringe Festival'. She is looking forward to taking on the role of creator, producer and actor in SMAK!Productions independent Feature Film, 'The Parties'.\n\n- IMDb Mini Biography",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "http://mariajcruz.workbooklive.com/",
        "id": 1358989,
        "imdb_id": "nm1043259",
        "known_for_department": "Acting",
        "name": "Maria J. Cruz",
        "place_of_birth": " Vancouver, British Columbia, Canada",
        "popularity": 0.0588,
        "profile_path": null
    }
}