{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9vAoubhoZE8aSkUZoSfxs3UWZhO.jpg",
                "genre_ids": [
                    53,
                    28,
                    80
                ],
                "id": 156022,
                "original_language": "en",
                "original_title": "The Equalizer",
                "overview": "McCall believes he has put his mysterious past behind him and dedicated himself to beginning a new, quiet life. But when he meets Teri, a young girl under the control of ultra-violent Russian gangsters, he can’t stand idly by – he has to help her. Armed with hidden skills that allow him to serve vengeance against anyone who would brutalize the helpless, McCall comes out of his self-imposed retirement and finds his desire for justice reawakened. If someone has a problem, if the odds are stacked against them, if they have nowhere else to turn, McCall will help. He is The Equalizer.",
                "popularity": 13.9945,
                "poster_path": "/9u4yW7yPA0BQ2pv9XwiNzItwvp8.jpg",
                "release_date": "2014-09-24",
                "title": "The Equalizer",
                "video": false,
                "vote_average": 7.281,
                "vote_count": 9488,
                "character": "Laborer",
                "credit_id": "54f9fe93c3a36811cf000087",
                "order": 29
            },
            {
                "adult": false,
                "backdrop_path": "/7b5R8FfGUzlxfhOkPpL3xyIeuyF.jpg",
                "genre_ids": [
                    18,
                    10402
                ],
                "id": 502033,
                "original_language": "en",
                "original_title": "Sound of Metal",
                "overview": "Metal drummer Ruben begins to lose his hearing. When a doctor tells him his condition will worsen, he thinks his career and life is over. His girlfriend Lou checks the former addict into a rehab for the deaf hoping it will prevent a relapse and help him adapt to his new life. After being welcomed and accepted just as he is, Ruben must choose between his new normal and the life he once knew.",
                "popularity": 3.7378,
                "poster_path": "/3178oOJKKPDeQ2legWQvMPpllv.jpg",
                "release_date": "2020-11-20",
                "title": "Sound of Metal",
                "video": false,
                "vote_average": 7.711,
                "vote_count": 2665,
                "character": "Michael's Father",
                "credit_id": "5fda81849d592c003da826be",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "William Xifaras was born in raised in Massachusetts; primarily the city of New Bedford, and later Boston. The son of Beatrice Keshian of Medford, MA and Michael Xifaras of New Bedford, MA.\n\nHe began film acting after his release from Massachusetts state prison system in 2005 (after having served 5 years for Intimidation). Bill spent many years learning through a variety of classes including: improv, acting on film, character development and scene study. Simultaneously he volunteered his time to talk to at-risk youth about the importance of education and goals.\n\nPrincipal roles include: 20th Century Fox's The Heat, Sony Pictures' The Equalizer, Universals' Ted 2, Netflix's Wheelman, Hulu series Castle Rock, Caviar's Sound of Metal, Artina Films' By the Gun, Paramount Picture's Defending Jacob, AMC's Kevin Can F**k Himself, Showtime's Dexter, Thug, and Align's Love, Weddings, and Other Disasters. Director's he's worked with include Morten Tyldum, Dennis Dugan, Ben Affleck, Paul Feig, Antoine Fuqua, Seth MacFarlane, Jeremy Rush, Kevin Hooks, Darius Marder, Hans Petter Moland, James Mottern, Sanford Bookstaver and Richard Duque-Henao.\n\nActor's he's worked with include: Liam Neeson, Chris Evans, Michelle Dockery, Jaeden Martell, Cherry Jones, Annie Murphy, John Hamm, Sandra Bullock, Harvey Keitel, Denzel Washington, Betty Gabriel, Seth MacFarlane, Frank Grillo, Scott Glenn, Julia Jones and Riz Ahmed.\n\nUpon request, Bill donates his time talking to public schools, after-school groups, and social programs aimed at youth's in crisis. Causes such as child welfare, education, homelessness, and children in foster care, have been and continue to be, a priority for him.",
        "birthday": "1964-01-26",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.stage32.com/lounge/acting/From-Prison-to-Major-Motion-Pictures",
        "id": 1360002,
        "imdb_id": "nm3899420",
        "known_for_department": "Acting",
        "name": "William Xifaras",
        "place_of_birth": "New Bedford, Massachusetts, USA",
        "popularity": 0.6163,
        "profile_path": "/laxmuLJVUl0vUPt2sQdWFSEk7ut.jpg"
    }
}