{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qzUIOTk0E3F1zjvYjcBRTKUTgf9.jpg",
                "genre_ids": [
                    80,
                    35,
                    28,
                    12
                ],
                "id": 207703,
                "original_language": "en",
                "original_title": "Kingsman: The Secret Service",
                "overview": "The story of a super-secret spy organization that recruits an unrefined but promising street kid into the agency's ultra-competitive training program just as a global threat emerges from a twisted tech genius.",
                "popularity": 9.5408,
                "poster_path": "/r6q9wZK5a2K51KFj4LWVID6Ja1r.jpg",
                "release_date": "2015-01-24",
                "title": "Kingsman: The Secret Service",
                "video": false,
                "vote_average": 7.623,
                "vote_count": 17275,
                "character": "Hugo",
                "credit_id": "540d49a2c3a368799f0051b6",
                "order": 27
            },
            {
                "adult": false,
                "backdrop_path": "/ke3lanTAgCqPMpOyutIfXzYih2s.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 266856,
                "original_language": "en",
                "original_title": "The Theory of Everything",
                "overview": "The Theory of Everything is the extraordinary story of one of the world’s greatest living minds, the renowned astrophysicist Stephen Hawking, who falls deeply in love with fellow Cambridge student Jane Wilde.",
                "popularity": 5.8625,
                "poster_path": "/kJuL37NTE51zVP3eG5aGMyKAIlh.jpg",
                "release_date": "2014-11-07",
                "title": "The Theory of Everything",
                "video": false,
                "vote_average": 7.839,
                "vote_count": 10824,
                "character": "Robert Hawking (Age 17)",
                "credit_id": "546e733192514112eb0000e6",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Actor, writer and producer, Tom Prior, is known for his work on both the screen and stage.\n\nTom trained at the Royal Academy of Dramatic Art (RADA) graduating in 2012. His acting work includes; The Theory of Everything (2014 / Working Title) playing Eddie Redmayne's son Robert Hawking. Kingsman: The Secret Service (2014 / Twentieth Century Fox, Marv Films) and Endeavour (2014) series for ITV.\n\nTom co-wrote Firebird (2020), a touching love story, based on true events, set in the Soviet Air Force, during the Cold War - in which he plays the lead role. He also produced the film. He recently completed his latest acting role playing Private Love, in Just Noise (2020), telling the true story of the British Government's cover up of military intervention during the struggle for independence in Malta.\n\nTom has starred in London's West End productions of Tory Boyz (by James Graham), Prince of Denmark, and Romeo & Juliet. Tom was selected to train with the National Youth Theatre REP Company, he was one of 15 actors selected from around the UK; working in collaboration with the National Theatre, BBC, Royal Shakespeare Company. He wrote his first short film Breaking the Circle in 2014.",
        "birthday": "1990-12-02",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1361963,
        "imdb_id": "nm4350114",
        "known_for_department": "Acting",
        "name": "Tom Prior",
        "place_of_birth": "England, UK",
        "popularity": 0.2081,
        "profile_path": "/mGRicaxPpzbgjGO6abUerm6XWGr.jpg"
    }
}