{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6q6iWqADBkXmOG7IJ3FgQxPzRNE.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 883,
                "original_language": "en",
                "original_title": "Coffee and Cigarettes",
                "overview": "An anthology of eleven vignettes featuring star-studded casts of extremely unique individuals who all share the common activities of conversing while drinking coffee and smoking cigarettes.",
                "popularity": 1.5019,
                "poster_path": "/pfG02QCsutx3PIxFS8UY4iM9AsS.jpg",
                "release_date": "2004-03-12",
                "title": "Coffee and Cigarettes",
                "video": false,
                "vote_average": 6.91,
                "vote_count": 983,
                "character": "Jack (segment \"Jack Shows Meg His Tesla Coil\")",
                "credit_id": "52fe4287c3a36847f8025f4b",
                "order": 16
            },
            {
                "adult": false,
                "backdrop_path": "/xjJz025MAPrSeNj18LPjcyu4xFM.jpg",
                "genre_ids": [
                    10752,
                    36,
                    12,
                    10749
                ],
                "id": 2289,
                "original_language": "en",
                "original_title": "Cold Mountain",
                "overview": "In this classic story of love and devotion set against the backdrop of the American Civil War, a wounded Confederate soldier named W.P. Inman deserts his unit and travels across the South, aiming to return to his young wife, Ada, who he left behind to tend their farm. As Inman makes his perilous journey home, Ada struggles to keep their home intact with the assistance of Ruby, a mysterious drifter sent to help her by a kindly neighbor.",
                "popularity": 6.5828,
                "poster_path": "/j0AJeeR5CQPDFh0otyWyCWREHO8.jpg",
                "release_date": "2003-12-24",
                "title": "Cold Mountain",
                "video": false,
                "vote_average": 6.929,
                "vote_count": 1860,
                "character": "Georgia",
                "credit_id": "52fe434ac3a36847f80490b3",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/acvE3RWjDLgvbL2RtcyzkrsAyNV.jpg",
                "genre_ids": [
                    80,
                    36,
                    18
                ],
                "id": 466420,
                "original_language": "en",
                "original_title": "Killers of the Flower Moon",
                "overview": "When oil is discovered in 1920s Oklahoma under Osage Nation land, the Osage people are murdered one by one—until the FBI steps in to unravel the mystery.",
                "popularity": 10.9118,
                "poster_path": "/dB6Krk806zeqd0YNp2ngQ9zXteH.jpg",
                "release_date": "2023-10-18",
                "title": "Killers of the Flower Moon",
                "video": false,
                "vote_average": 7.415,
                "vote_count": 3762,
                "character": "Radio Show Actor",
                "credit_id": "636731a3bd588b007c9dc56b",
                "order": 29
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jack White III",
            "John Anthony Gillis",
            "The White Stripes"
        ],
        "biography": "John Anthony White (né Gillis; born July 9, 1975) is an American singer, songwriter, multi-instrumentalist and producer. He is best known as the lead singer and guitarist of the duo the White Stripes. He has won 12 Grammy Awards, and three of his solo albums have reached number one on the Billboard charts. White founded the White Stripes with fellow Detroit native and then-wife Meg White in 1997. Their 2001 breakthrough album, White Blood Cells, brought them international fame with the hit single and accompanying music video \"Fell in Love with a Girl\". In 2005, White founded the Raconteurs with Brendan Benson, and in 2009 founded the Dead Weather with Alison Mosshart of the Kills. In 2008, he recorded \"Another Way to Die\" (the title song for the 2008 James Bond film Quantum of Solace) with Alicia Keys, making them the only duet to perform a Bond song.  White has also had a minor acting career. He appeared in the 2003 film, Cold Mountain, as a character named Georgia and performed five songs for the Cold Mountain soundtrack. The 2003 Jim Jarmusch film Coffee and Cigarettes featured both Jack and Meg in the segment \"Jack Shows Meg His Tesla Coil\". He also played Elvis Presley in the 2007 satire Walk Hard. In June 2017, White appeared in the award-winning documentary film The American Epic Sessions and was an executive producer of the film.",
        "birthday": "1975-07-09",
        "deathday": null,
        "gender": 2,
        "homepage": "https://jackwhiteiii.com/",
        "id": 13611,
        "imdb_id": "nm1226421",
        "known_for_department": "Acting",
        "name": "Jack White",
        "place_of_birth": "Detroit, Michigan, USA",
        "popularity": 0.3309,
        "profile_path": "/6PqErDcEyAWR4kfjyBSuiQTNqYu.jpg"
    }
}