{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/exk2xDI2YT5UHs5Bow79AVRGOnP.jpg",
                "genre_ids": [
                    53,
                    9648,
                    10749
                ],
                "id": 506,
                "original_language": "en",
                "original_title": "Marnie",
                "overview": "Marnie is a thief, a liar, and a cheat. When her new boss, Mark Rutland, catches on to her routine kleptomania, she finds herself being blackmailed.",
                "popularity": 2.8616,
                "poster_path": "/nRRy4VO2A3Py7wiZBPz11PAlogp.jpg",
                "release_date": "1964-07-17",
                "title": "Marnie",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 1176,
                "character": "Dr. Gilliat (uncredited)",
                "credit_id": "61e10784b9a0bd004259098c",
                "order": 22
            },
            {
                "adult": false,
                "backdrop_path": "/3e3dVaVrla2GH6CWKbNRjTvk3s8.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 6844,
                "original_language": "en",
                "original_title": "The Ten Commandments",
                "overview": "Escaping death, a Hebrew infant is raised in a royal household to become a prince. Upon discovery of his true heritage, Moses embarks on a personal quest to reclaim his destiny as the leader and liberator of the Hebrew people.",
                "popularity": 10.66,
                "poster_path": "/3Ei59AR64x6dMZfWobPCkZjbqTL.jpg",
                "release_date": "1956-10-05",
                "title": "The Ten Commandments",
                "video": false,
                "vote_average": 7.769,
                "vote_count": 1743,
                "character": "Cretan Ambassador (uncredited)",
                "credit_id": "647dad30caef2d00aa438f12",
                "order": 97
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Johnny Hart",
            "John Hilton"
        ],
        "biography": "John Lewis Hart, also credited as John Hilton was an American film and television actor. In his early career, Hart appeared mostly in Westerns. Although Hart played mostly minor roles in some fairly well known films, he was probably best known for having replaced Clayton Moore in 1952 in the television series, The Lone Ranger for one season from 1952 until 1953.\n\nHart began his screen career in 1937 with a bit part in Daughter of Shanghai. He continued in a variety of B pictures such as Prison Farm and King of Alcatraz before appearing in two of Cecil B. DeMille's films The Buccaneer and North West Mounted Police. In 1941, Hart's acting career was interrupted when he was drafted into the United States Army. He rose to the rank of first sergeant in the Coast Artillery and eventually served in the Philippines. Following his military service, Hart worked frequently for Sam Katzman; he was given the lead role in the Jack Armstrong film serial. Hart did stunt work and acted in numerous Westerns\n\nHart was eventually offered the opportunity to replace Clayton Moore on The Lone Ranger television series. Based on the assumption that the masked character, rather than the actor, was the true star of The Lone Ranger, the program's producers fired Moore (presumably over salary differences) and replaced him with Hart, who was of a similar build and had a comparable background in Westerns. However, the public never truly accepted Hart as the Lone Ranger, and by 1954 the producers returned Moore to the role. According to Clayton Moore's autobiography I Was That Masked Man, Moore never knew why he was replaced by Hart, and also stated that he had not sought a pay increase. Hart acted in minor roles in two episodes of The Lone Ranger before being asked to replace Clayton Moore for the entire third season. The episodes were \"Rifles and Renegades\" (#34) and \"Sheriff at Gunstock\" (#46).\n\nHart continued to act in films for more than two decades, appearing in films of several genres, almost always in supporting roles. Hart appeared twice in on the TV series I Love Lucy as Lucy's old boyfriend and again in the Hollywood episodes as a lifeguard at the hotel pool. In 1955, Hart starred in The Adventures of Captain Africa, which was originally intended to be a new movie about famous comic book hero The Phantom. However, licensing issues forced Columbia Pictures re-film the entire serial and re-christen the hero \"Captain Africa.\" Hart also had numerous supporting roles in the Highway Patrol TV series.  In 1965 Hart made two brief appearances on the TV series Perry Mason, including the role of title character and murder victim Jamison Selff in \"The Case of the Wrathful Wraith.\" In the 1970 film The Phynx, Hart played the Lone Ranger alongside Jay Silverheels as Tonto, spoofing their characters. Hart's last theatrical film appearance was in 1981's The Legend of the Lone Ranger in which he appeared as a newspaper editor. He appeared in the television series Happy Days as the Lone Ranger in the episode \"Hi Yo, Fonzie Away\". In this episode Fonzie, played by Henry Winkler, meets his childhood hero, the Lone Ranger, for his birthday. Hart's other major late appearance was in an episode of The Greatest American Hero, My Heroes Have Always Been Cowboys, where Hart gives the title character an inspiring speech about heroism.",
        "birthday": "1917-12-13",
        "deathday": "2009-09-20",
        "gender": 2,
        "homepage": null,
        "id": 1362785,
        "imdb_id": "nm0366359",
        "known_for_department": "Acting",
        "name": "John Hart",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.1401,
        "profile_path": "/gBaLoPRCu2QmOsnz2NdLc65ydyH.jpg"
    }
}