{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lBgIZ6SkDOz95aex524hVRkTaEM.jpg",
                "genre_ids": [
                    18
                ],
                "id": 509364,
                "original_language": "fr",
                "original_title": "Grâce à Dieu",
                "overview": "Alexandre, a man in his 40s living in Lyon with his wife and children, discovers that the priest who abused him decades ago continues to work with children. He joins forces with others victims of the priest, to bring justice and “lift the burden of silence” about what they endured.",
                "popularity": 4.2961,
                "poster_path": "/qbwcnAdBkfGBIbQ1xdQZtiUg2lf.jpg",
                "release_date": "2019-02-20",
                "title": "By the Grace of God",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 577,
                "character": "Aline Debord, François' Wife",
                "credit_id": "5d6f3977d5ffcb00122c440a",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Julie Duclos (born 10 July) is a French director and actress, founder of the theater company L'In-quarto. She is the daughter of an actor Philippe Duclos.\n\nShe attended at the National Academy of Dramatic Arts (CNSAD) in Paris (2010 promotion) with Dominique Valadié and Alain Françon. She created her first show there in 2009, A Lover's Discourse: Fragments, adapted from the essay by Roland Barthes, which was then resumed at La Loge (Paris) in 2011, then at the MESS Festival in Sarajevo in 2012.\n\nWith the same group of actors from CNSAD, in 2012 she created the show Masculin/Féminin, a laboratory of theatrical creation between reality and fiction then Nos Serments at the Théâtre national de la Colline, in collaboration with Guy-Patrick Sainderichin, very freely inspired by the film The Mother and the Whore of Jean Eustache. This show is adapted as part of a radio fiction about France Culture, entitled A force de rêve tout bas.\n\nShe again collaborates with the Théâtre national de la Colline for MayDay, a play by Dorothée Zumstein, inspired by the news story Mary Bell, found guilty of the murder of 2 young children at the age of 10.\n\nAs part of the Avignon Festival 2019, she stages Pelléas et Mélisande by Maeterlinck at la Fabrica. The modern set design and the subtle use of the video include critically acclaimed, as well as the acting Alix Riemer, Matthew Sampeur, Philippe Duclos and Vincent Dissez.\n\nJulie Duclos is currently associated with the National Theater of Brittany (TNB) directed by Arthur Nauzycie and is part of the teaching team of the school of TNB.\n\nActress of theater and cinema, she plays in particular in By the Grace of God by François Ozon.\n\nSource: Article \"Julie Duclos\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1363811,
        "imdb_id": "nm1348346",
        "known_for_department": "Acting",
        "name": "Julie Duclos",
        "place_of_birth": null,
        "popularity": 0.0256,
        "profile_path": "/7DAr0v9q7epTWATqHIJdcjzHQyW.jpg"
    }
}