{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ll1d1AXoQganpzphgUVuWGo3Nmi.jpg",
                "genre_ids": [
                    35
                ],
                "id": 112198,
                "original_language": "fr",
                "original_title": "Le Prénom",
                "overview": "Vincent, a wealthy real estate agent, is invited to dinner by his sister Elizabeth and her husband Peter, both professors in Paris. Claude, a childhood friend and trombonist in a symphony orchestra, is also present. Vincent brings news from the prenatal examination of his and his wife Anna's unborn son.  The name chosen by the soon-to-be parents strongly offends the others for many reasons. The dispute between the guests quickly escalates and before long the resurgence of old grudges and hidden secrets is unavoidable ...",
                "popularity": 2.4527,
                "poster_path": "/5xKkDkv506CiSp99SxmHLsnaoFs.jpg",
                "release_date": "2012-04-25",
                "title": "What's in a Name",
                "video": false,
                "vote_average": 7.32,
                "vote_count": 1738,
                "character": "Élisabeth",
                "credit_id": "52fe4b11c3a36847f81f09d3",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/vGtICaExlrMmQwMPlzt6HLiRKV1.jpg",
                "genre_ids": [
                    18
                ],
                "id": 8841,
                "original_language": "fr",
                "original_title": "Entre les murs",
                "overview": "Teacher and novelist François Bégaudeau plays a version of himself as he negotiates a year with his racially mixed students from a tough Parisian neighborhood.",
                "popularity": 1.0249,
                "poster_path": "/8yFgK1YgfrnbsRXTg4Hko98nIUt.jpg",
                "release_date": "2008-09-24",
                "title": "The Class",
                "video": false,
                "vote_average": 6.989,
                "vote_count": 686,
                "character": "",
                "credit_id": "60a3eb8acb75d1003f6c9c74",
                "order": 33
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Valérie Benguigui (8 July 1961 – 2 September 2013) was a French actress and theater director. Born in Oran, Algeria, she took acting courses at the Cours Florent and the National Chaillot Theatre School. Her first film role was in Francis Huster's On a volé Charlie Spencer (1986).\n\nHer most successful television role was in the series Avocats et associés, in which she appeared from 2000 to 2005. She also produced and directed several plays at this time. In 2012, she portrayed Élisabeth in the film What's in a Name? (Le Prénom), which earned her a César Award for Best Supporting Actress, as well as a Molière Award nomination for Best Supporting Actress.\n\nBenguigui was married to actor and restaurant manager Eric Wapler, whom she met while studying at Cours Florent. They had two children.\n\nBenguigui died from breast cancer, aged 52, on 2 September 2013 in Paris. She battled the disease for three years. Benguigui was buried at Montparnasse Cemetery.\n\nSource: Article \"Valérie Benguigui\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1965-11-06",
        "deathday": "2013-09-02",
        "gender": 1,
        "homepage": null,
        "id": 136489,
        "imdb_id": "nm0071116",
        "known_for_department": "Acting",
        "name": "Valérie Benguigui",
        "place_of_birth": "Oran, Algeria",
        "popularity": 0.125,
        "profile_path": "/34p0SqBWArDGgrRMZvTdHh1P2BC.jpg"
    }
}