{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cru4rjGcdHGhnPyjNXvW82jOrif.jpg",
                "genre_ids": [
                    10749,
                    35,
                    18
                ],
                "id": 986280,
                "original_language": "fi",
                "original_title": "Kuolleet lehdet",
                "overview": "In modern-day Helsinki, two lonely souls in search of love meet by chance in a karaoke bar. However, their path to happiness is beset by obstacles – from lost phone numbers to mistaken addresses, alcoholism, and a charming stray dog.",
                "popularity": 1.923,
                "poster_path": "/9ayYOpeqHhxfHHUoyt3kXzznECO.jpg",
                "release_date": "2023-09-14",
                "title": "Fallen Leaves",
                "video": false,
                "vote_average": 7.151,
                "vote_count": 651,
                "character": "Karaoke Pub Patron (uncredited)",
                "credit_id": "64f1dd2997a4e600ac3ee33b",
                "order": 40
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Юхо Куосманен",
            "유호 쿠오스마넨"
        ],
        "biography": "Juho Kuosmanen (born 1979) is a Finnish film director and screenwriter.  His first feature film The Happiest Day in the Life of Olli Mäki was screened in the Un Certain Regard section at the 2016 Cannes Film Festival, where it won the top prize. In 2021, his second feature film Compartment No. 6 shared the Cannes Grand Prix (the festival's second prize) together with Asghar Farhadi's A Hero.\n\nKuosmanen graduated from Aalto University in 2014. His graduation film The Painting Sellers was nominated for five Jussi Awards (Finnish premier film industry award). The Painting Sellers won the first prize in Cinéfondation in Cannes Film Festival in 2010.  Kuosmanen worked as an actor in Leea Klemola's arctic trilogy in Tampere Theatre in Kokkola and New Karleby Kuosmanen has also directed opera with conductors Sakari Oramo and Santtu-Matias Rouvali.",
        "birthday": "1979-09-30",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1364534,
        "imdb_id": "nm3123366",
        "known_for_department": "Directing",
        "name": "Juho Kuosmanen",
        "place_of_birth": "Kokkola, Finland",
        "popularity": 0.1135,
        "profile_path": "/6U38u9nsQPEISeyRP5qBKeHo1L6.jpg"
    }
}