{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/vo9MRyCMBAdSqZgkI70AfVg8ISI.jpg",
                "genre_ids": [
                    12,
                    10751,
                    18
                ],
                "id": 754067,
                "original_language": "fr",
                "original_title": "Mystère",
                "overview": "Stéphane decides to move to the beautiful mountains of Cantal in order to reconnect with his 8-year-old daughter, Victoria, who has been silent since her mother's disappearance. During a walk in the forest, a shepherd gives Victoria a puppy named \"Mystery\" who will gradually give her a taste for life. But very quickly, Stéphane discovers that the animal is in reality a wolf… Despite the warnings and the danger of this situation, he cannot bring himself to separate his daughter from this seemingly harmless ball of hair.",
                "popularity": 2.955,
                "poster_path": "/xXZ4yhyss7DGrp7a1EVHaAStfwr.jpg",
                "release_date": "2021-12-15",
                "title": "Vicky and Her Mystery",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 508,
                "character": "Jean-Paul",
                "credit_id": "62321af1447f9c0046b3c4ad",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/5kgm1kubnGUwhd8oEqKa9lfW2hY.jpg",
                "genre_ids": [
                    18,
                    53
                ],
                "id": 322125,
                "original_language": "fr",
                "original_title": "Un Homme idéal",
                "overview": "A struggling writer finds a shortcut to fame, but a blackmailer threatens to ruin his perfect life.",
                "popularity": 1.7754,
                "poster_path": "/dgmgPPPI3APwLHXRvxaGCWGf3FE.jpg",
                "release_date": "2015-03-18",
                "title": "A Perfect Man",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 680,
                "character": "Police officer",
                "credit_id": "550d1a4f925141469c004e83",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/7hcoMi2AMRvPC7YnGm41k3Wcgvy.jpg",
                "genre_ids": [
                    18,
                    53,
                    80,
                    9648
                ],
                "id": 10795,
                "original_language": "fr",
                "original_title": "Ne le dis à personne",
                "overview": "A man receives a mysterious email appearing to be from his wife, who was murdered years earlier. As he frantically tries to find out whether she's alive, he finds himself being implicated in her death.",
                "popularity": 4.9671,
                "poster_path": "/fr2wEeO1H8dzx6EDfzYTRBIvZaE.jpg",
                "release_date": "2006-11-01",
                "title": "Tell No One",
                "video": false,
                "vote_average": 7.229,
                "vote_count": 1450,
                "character": "Prosecutor",
                "credit_id": "593bce4c92514105b700bc22",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Éric Savin"
        ],
        "biography": "Éric Savin (born Dijon, 14 November 1964) is a French film and TV actor.\n\nSavin comes from a rugby family, which meant he was more interested in a sports career. But a strong conviction led him to Paris to try a career as an actor. He was a hospital agent at the Bichat hospital in Paris from 1985 to 1988, and then passed the (Drama school) Cours Florent free class competition. It was during an audition that he met Xavier Durringer (playwright , screenwriter and filmmaker) with whom he still works today.\n\nHe made his stage debut in 1989 in Lorenzaccio (written by Alfred de Musset) directed by Francis Huster. Bertrand Tavernier entrusted him with his first cinema role in 1992, as Inspector Lefort in L.627. He then alternated between theater, television and cinema. His first theatre successes came with Durringer's shows like La Petite Entaille in 1991, or Sureur in 1997, presented at the Avignon Festival.\n\nIn 1993, he starred with actress Karin Viard in La nage indienne (the Indian Swim), in the first feature film by Durringer. Then he had several supporting roles including Giordano in Emmène-moi (Take me) by Michel Spinosa, distinguished at the Berlin International Film Festival and Captain Conan again with Tavernier in 1996, followed by I Hate Love (J'ai horreur de l'amour) by Laurence Ferreira Barbosa in 1997 then in 1998 social film Une minute de silence ('One minute of silence') the first film of Florent Emilio Siri. He returned to work with Durringer on J'irai au paradis car l'enfer est ici (I'll go to heaven because hell is here) in 1997, film is about gangsters.\n\nHe gets a nomination to the Sept d'or for his portrayal of a divorced father who kidnaps his daughter in the TV movie Vacances volées (or Stolen Vacation), it was directed by Olivier Panchot. He also accompanies many filmmakers and directors from short to feature film, such as Laurent Firode (Les astres (The Stars) in 1998, Happenstance (The Butterfly's Wing Flapping) in 2000), with Pierre-Erwan Guillaume in Bonne résistance à la douleur, (Good resistance to pain) in 1999 and L'Ennemi naturel (The Natural Enemy) in 2004. Then with Lyčče Boukhitine for which he takes the character in her short film La Vielle barrière (The old barrier), which won a 'jury prize' at the festival of Clermont-Ferrand in 1998. Finally in 2002, he plays in the famous short film Squash directed by Lionel Bailliu, which was multi-award-winning in several festivals around the world, including the interpretation prize in Clermont-Ferrand. Lionel Bailliu won an Oscar nomination in 2004 for Best Live Action Short Film. This performance leads Éric Savin to take the leading role of the compulsive domineering boss in the feature film adaptation in 2006 entitled Fair Play where he shares the poster with Marion Cotillard and Benoît Magimel. ...\n\nSource: Article \"Éric Savin\" from Wikipedia in English, licensed under CC-BY-SA.",
        "birthday": "1964-11-14",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 136438,
        "imdb_id": "nm0767710",
        "known_for_department": "Acting",
        "name": "Eric Savin",
        "place_of_birth": "Dijon, Côte-d'Or, France",
        "popularity": 0.3023,
        "profile_path": "/kqFxXjJs4LX1SwtNzRsSEffr4xr.jpg"
    }
}