{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/g9ROrZey0JYp7kf8DoAyZtKnObj.jpg",
                "genre_ids": [
                    27
                ],
                "id": 377,
                "original_language": "en",
                "original_title": "A Nightmare on Elm Street",
                "overview": "Teenagers in a small town are dropping like flies, apparently in the grip of mass hysteria causing their suicides. A cop's daughter, Nancy Thompson, traces the cause to child molester Fred Krueger, who was burned alive by angry parents many years before. Krueger has now come back in the dreams of his killers' children, claiming their lives as his revenge. Nancy and her boyfriend, Glen, must devise a plan to lure the monster out of the realm of nightmares and into the real world...",
                "popularity": 9.8159,
                "poster_path": "/wGTpGGRMZmyFCcrY2YoxVTIBlli.jpg",
                "release_date": "1984-11-09",
                "title": "A Nightmare on Elm Street",
                "video": false,
                "vote_average": 7.34,
                "vote_count": 5424,
                "character": "Marge Thompson",
                "credit_id": "52fe423cc3a36847f800e5d9",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ronnie Blake",
            "Roneé Blakley"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nRonee Blakley (born August 24, 1945) is an American entertainer. Though an accomplished singer, songwriter, composer, producer and director, she is perhaps best known as an actress. Her most famous role was as the fictional country superstar Barbara Jean in Robert Altman's 1975 film Nashville, for which she won a National Board of Review Award for Best Supporting Actress and was nominated for an Academy Award. She also had a notable role in A Nightmare on Elm Street (1984).\n\nDescription above from the Wikipedia article Ronee Blakley, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1945-08-24",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 13652,
        "imdb_id": "nm0086867",
        "known_for_department": "Acting",
        "name": "Ronee Blakley",
        "place_of_birth": "Nampa, Idaho, USA",
        "popularity": 0.2409,
        "profile_path": "/fLdnGFUv9bpT0Tk1iqKBV1k1TH0.jpg"
    }
}