{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/eBmIaAm1CkBuuyIUQYorhQKzTTg.jpg",
                "genre_ids": [
                    80,
                    18,
                    9648
                ],
                "id": 3580,
                "original_language": "en",
                "original_title": "Changeling",
                "overview": "Los Angeles, 1928. When single mother Christine Collins leaves for work, her son vanishes without a trace. Five months later, the police reunite mother and son. But when Christine suspects that the boy returned to her isn't her child, her quest for truth exposes a world of corruption.",
                "popularity": 4.1584,
                "poster_path": "/y9Qi39dL3PceGCH8afyC7QrhbhI.jpg",
                "release_date": "2008-10-24",
                "title": "Changeling",
                "video": false,
                "vote_average": 7.584,
                "vote_count": 4314,
                "character": "LA City Councilman (uncredited)",
                "credit_id": "56cc9c709251410a34000235",
                "order": 88
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "ADRENALINE MAN"
        ],
        "biography": "USA RELENTLESS is Andre Alexsen’s real life journey from a Hollywood stuntman/ stunt coordinator/ actor hitting bottom using drugs and alcohol ending up on the streets, then being delivered and becoming sober only by the grace of God. He makes a come back and works with the US Military Special Ops, Seal teams ,Dillon Minigun, AZ Border Patrol, Law Enforcement, and undercover with LAPD. ex DoD contractor , He also trains with living legends in Self Defense and Martial Arts; Grand Master Sensei Gokor Chivichyan, Sensei Benny “the Jet” Urquidez to Uncle Judo Gene LeBell. It includes many near death experiences from parachute malfunctions, wild animal attacks, prison riots to inside Vegas crime families, major auto wrecks, stunts gone wrong, beating a terminal cancer battle, and working with the biggest names from Speilberg to Ron Howard to Clint Eastwood. And now becoming the Adrenaline Man most extreme TV show host ever real live stunts .He also exposes the dirty workings of Hollywood and the modern day globalist madness that is here and around the world from President Trump, Q, Deep State takedown, Globalists gone wild , fake news, California fires, weather manipulation, satanic pedophiles , attempted gun grabs ,active shooter set ups, civil wars coming soon,training and preparing for it, E.O.P.G. And much more life and soul saving info.",
        "birthday": "1961-03-18",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.theadrenalineman.com",
        "id": 1367102,
        "imdb_id": "nm3411754",
        "known_for_department": "Acting",
        "name": "Andre Alexsen",
        "place_of_birth": "Hollywood, California, USA",
        "popularity": 0.0683,
        "profile_path": "/y0OevKw6ILaIxiASchxwDa9QPg3.jpg"
    }
}