{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/w7MsyOpP003FYhsiTgVHa3rNsrz.jpg",
                "genre_ids": [
                    18,
                    12,
                    10751
                ],
                "id": 508763,
                "original_language": "en",
                "original_title": "A Dog's Way Home",
                "overview": "The adventure of Bella, a dog who embarks on an epic 400-mile journey home after she is separated from her beloved human.",
                "popularity": 3.7866,
                "poster_path": "/pZn87R7gtmMCGGO8KeaAfZDhXLg.jpg",
                "release_date": "2019-01-10",
                "title": "A Dog's Way Home",
                "video": false,
                "vote_average": 7.387,
                "vote_count": 1153,
                "character": "Boy 1 at River (Rick)",
                "credit_id": "5a99b65492514128af00f6f6",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Spencer's acting career started in the first grade when, at the suggestion of his teacher, he started to go out for auditions. A natural performer with a great memory and work ethic, he quickly booked commercials spots for Target, Applebee's, Armstrong Cheese and others. But when Spencer picked up a small role in the second chapter of the Wimpy Kid franchise, everything changed. Spencer knew he wanted to do more... and more he did, working with onscreen talent such as Drea De Matteo, Valerie Harper, Martin Freeman and more. For many young performers, this type of commitment comes at the expense of other things: school, sports, even a childhood. For Spencer's parents, however, creating the next child star has never been a goal. Maintaining a healthy balance for Spencer has meant that sometimes the hockey game takes priority over the audition. Personal commitments, he has learned, are just as important as professional ones. As a result, Spencer has continued to book larger and larger roles while continuing to enjoy ice hockey, skateboarding and sometimes, even school.",
        "birthday": "2003-08-30",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1368800,
        "imdb_id": "nm4204744",
        "known_for_department": "Acting",
        "name": "Spencer Drever",
        "place_of_birth": "Vancouver, Canada",
        "popularity": 0.2064,
        "profile_path": "/uE4i21CHaa7aMI1kDNwawVpy0s7.jpg"
    }
}