{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mLihPIodzSenkZtiUauDy4e9hRs.jpg",
                "genre_ids": [
                    10751,
                    14,
                    10770,
                    12,
                    10402
                ],
                "id": 417320,
                "original_language": "en",
                "original_title": "Descendants 2",
                "overview": "When the pressure to be royal becomes too much for Mal, she returns to the Isle of the Lost where her archenemy Uma, Ursula's daughter, has taken her spot as self-proclaimed queen.",
                "popularity": 6.8455,
                "poster_path": "/qoNlGfQmFZ37Gf5fRBaCTLlOZtx.jpg",
                "release_date": "2017-07-21",
                "title": "Descendants 2",
                "video": false,
                "vote_average": 7.347,
                "vote_count": 1724,
                "character": "Lonnie",
                "credit_id": "57e3b5f8925141123c0046db",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/y0ludgr1EvyXcT1lv2M0m621LQ6.jpg",
                "genre_ids": [
                    10751,
                    12,
                    14,
                    10770,
                    10402
                ],
                "id": 277217,
                "original_language": "en",
                "original_title": "Descendants",
                "overview": "A present-day idyllic kingdom where the benevolent teenage son of King Adam and Queen Belle offers a chance of redemption for the troublemaking offspring of Disney's classic villains: Cruella De Vil (Carlos), Maleficent (Mal), the Evil Queen (Evie) and Jafar (Jay).",
                "popularity": 5.9713,
                "poster_path": "/65DkgHPSLVjgr6IYkpY9Aqqqid5.jpg",
                "release_date": "2015-07-31",
                "title": "Descendants",
                "video": false,
                "vote_average": 7.146,
                "vote_count": 2434,
                "character": "Lonnie",
                "credit_id": "5a21a3b30e0a264cca0a6e1d",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "دیان دوآن",
            "دایان دوآن"
        ],
        "biography": "Dianne Doan is a Canadian actress of Vietnamese descent. She was born on September 8, 1990 in Abbotsford, British Columbia. She first developed an interest in acting in the 9th grade when she took drama classes as an elective. She started technical training in dance at the age of 10.\n\nDoan has a background in dance and has performed as a dancer at the 2010 Winter Olympics opening ceremony and as a back-up dancer for Michael Bublé. She has also worked as a dancer in music videos for other recording artists like Big Time Rush and Marianas Trench.\n\nDoan's first major acting role was in the Disney Channel Original Movie Descendants as Lonnie, the daughter of Mulan and Li Shang. She reprised her role in the sequel Descendants 2. She has also had recurring roles on the television series Vikings and Guidance.\n\nIn 2017, Doan joined the cast of the Cinemax series Warrior as Mai Ling. The series is produced by filmmaker Justin Lin and based on an original concept by the late Bruce Lee.\n\nDoan is currently filming the upcoming television series The Boys Presents: Varsity, a spin-off of the Amazon Prime Video series The Boys. She will play the role of Nyla, a powerful superhero.",
        "birthday": "1990-09-08",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1368794,
        "imdb_id": "nm3999319",
        "known_for_department": "Acting",
        "name": "Dianne Doan",
        "place_of_birth": "Abbotsford, British Columbia, Canada",
        "popularity": 0.8245,
        "profile_path": "/nmFSZYW3RsnhvJEchnQZU9hKw4b.jpg"
    }
}