{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kBSSbN1sOiJtXjAGVZXxHJR9Kox.jpg",
                "genre_ids": [
                    28,
                    18
                ],
                "id": 361743,
                "original_language": "en",
                "original_title": "Top Gun: Maverick",
                "overview": "After more than thirty years of service as one of the Navy’s top aviators, and dodging the advancement in rank that would ground him, Pete “Maverick” Mitchell finds himself training a detachment of TOP GUN graduates for a specialized mission the likes of which no living pilot has ever seen.",
                "popularity": 19.095,
                "poster_path": "/62HCnUTziyWcpDaBO2i1DX17ljH.jpg",
                "release_date": "2022-05-21",
                "title": "Top Gun: Maverick",
                "video": false,
                "vote_average": 8.2,
                "vote_count": 10180,
                "character": "Lt. Billy 'Fritz' Avalone",
                "credit_id": "5bae87c4c3a3683a9c066ff5",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "매니 자신토",
            "Manuel Luis Jacinto",
            "مانی جاسینتو"
        ],
        "biography": "Manny Jacinto (born August 19, 1987) is a Canadian actor of Filipino descent. He was born in Manila, Philippines, and moved to Canada with his family when he was about three years old. He grew up in Richmond, British Columbia, and initially pursued a degree in civil engineering at the University of British Columbia before transitioning to acting.\n\nJacinto started his career with small roles in television series such as Once Upon a Time, Supernatural, and iZombie. His breakout role came in 2016 when he was cast as Jason Mendoza in the NBC sitcom The Good Place, where he gained widespread recognition for his comedic performance.\n\nHe has also appeared in films like Bad Times at the El Royale (2018) and Top Gun: Maverick (2022). In 2024, he portrayed Qimir in the Star Wars series The Acolyte. Additionally, he provided the voice of Scott Denoga in the Disney Channel animated series Hailey's On It! (2023–2024).\n\nIn 2019, he announced his engagement to actress Dianne Doan.",
        "birthday": "1987-08-19",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1368795,
        "imdb_id": "nm3254274",
        "known_for_department": "Acting",
        "name": "Manny Jacinto",
        "place_of_birth": "Manila, Philippines",
        "popularity": 1.3505,
        "profile_path": "/8PENhKW8wG7LwBaJfGvskOXtlKR.jpg"
    }
}