{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mshaKLtPUxcDBhzau6qiObEblhL.jpg",
                "genre_ids": [
                    12,
                    14,
                    28
                ],
                "id": 121,
                "original_language": "en",
                "original_title": "The Lord of the Rings: The Two Towers",
                "overview": "Frodo Baggins and the other members of the Fellowship continue on their sacred quest to destroy the One Ring--but on separate paths. Their destinies lie at two towers--Orthanc Tower in Isengard, where the corrupt wizard Saruman awaits, and Sauron's fortress at Barad-dur, deep within the dark lands of Mordor. Frodo and Sam are trekking to Mordor to destroy the One Ring of Power while Gimli, Legolas and Aragorn search for the orc-captured Merry and Pippin. All along, nefarious wizard Saruman awaits the Fellowship members at the Orthanc Tower in Isengard.",
                "popularity": 17.4636,
                "poster_path": "/5VTN0pR8gcqV3EPUHHfMGnJYN9L.jpg",
                "release_date": "2002-12-18",
                "title": "The Lord of the Rings: The Two Towers",
                "video": false,
                "vote_average": 8.409,
                "vote_count": 22912,
                "character": "Théoden",
                "credit_id": "52fe421ac3a36847f80045b9",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/2u7zbn8EudG6kLlBzUYqP8RyFU4.jpg",
                "genre_ids": [
                    12,
                    14,
                    28
                ],
                "id": 122,
                "original_language": "en",
                "original_title": "The Lord of the Rings: The Return of the King",
                "overview": "As armies mass for a final battle that will decide the fate of the world--and powerful, ancient forces of Light and Dark compete to determine the outcome--one member of the Fellowship of the Ring is revealed as the noble heir to the throne of the Kings of Men. Yet, the sole hope for triumph over evil lies with a brave hobbit, Frodo, who, accompanied by his loyal friend Sam and the hideous, wretched Gollum, ventures deep into the very dark heart of Mordor on his seemingly impossible quest to destroy the Ring of Power.​",
                "popularity": 23.019,
                "poster_path": "/rCzpDGLbOoPwLjy3OAm5NUPOTrC.jpg",
                "release_date": "2003-12-17",
                "title": "The Lord of the Rings: The Return of the King",
                "video": false,
                "vote_average": 8.489,
                "vote_count": 25451,
                "character": "Théoden",
                "credit_id": "52fe421bc3a36847f800471f",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/cXPOtGdWhx9MNMOOQCIFjnKBPoi.jpg",
                "genre_ids": [
                    10751,
                    16,
                    12,
                    35
                ],
                "id": 77174,
                "original_language": "en",
                "original_title": "ParaNorman",
                "overview": "In the town of Blithe Hollow, Norman Babcock can speak to the dead, but no one other than his eccentric new friend believes his ability is real. One day, Norman's eccentric uncle tells him of a ritual he must perform to protect the town from a curse cast by a witch centuries ago.",
                "popularity": 8.3558,
                "poster_path": "/9DZPtuYTKYxt6vzHvZ5FLThG4fl.jpg",
                "release_date": "2012-08-03",
                "title": "ParaNorman",
                "video": false,
                "vote_average": 7.004,
                "vote_count": 2630,
                "character": "Judge Hopkins (voice)",
                "credit_id": "52fe4961c3a368484e128501",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/ubICMSUij3ntP9BjnQsV3rTVnAF.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 783,
                "original_language": "en",
                "original_title": "Gandhi",
                "overview": "In the early years of the 20th century, Mohandas K. Gandhi, a British-trained lawyer, forsakes all worldly possessions to take up the cause of Indian independence. Faced with armed resistance from the British government, Gandhi adopts a policy of 'passive resistance', endeavouring to win freedom for his people without resorting to bloodshed.",
                "popularity": 4.2391,
                "poster_path": "/rOXftt7SluxskrFrvU7qFJa5zeN.jpg",
                "release_date": "1982-12-01",
                "title": "Gandhi",
                "video": false,
                "vote_average": 7.557,
                "vote_count": 2389,
                "character": "Sergeant Putnam",
                "credit_id": "55f76668c3a3685c9c0004e1",
                "order": 80
            },
            {
                "adult": false,
                "backdrop_path": "/h1bNQ2MZzKLuKa7N0nOuSXlgMwT.jpg",
                "genre_ids": [
                    18,
                    53,
                    10752
                ],
                "id": 2253,
                "original_language": "en",
                "original_title": "Valkyrie",
                "overview": "Wounded in Africa during World War II, Nazi Col. Claus von Stauffenberg returns to his native Germany and joins the Resistance in a daring plan to create a shadow government and assassinate Adolf Hitler. When events unfold so that he becomes a central player, he finds himself tasked with both leading the coup and personally killing the Führer.",
                "popularity": 4.8292,
                "poster_path": "/8eoRtXswC8IQDsqW7iJWO56NhAv.jpg",
                "release_date": "2008-12-25",
                "title": "Valkyrie",
                "video": false,
                "vote_average": 6.945,
                "vote_count": 3877,
                "character": "General - Desert Sequence",
                "credit_id": "585333cf9251416fad0283e1",
                "order": 17
            },
            {
                "adult": false,
                "backdrop_path": "/tupgjqhWx5oieQrdyesO3aclUX9.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 597,
                "original_language": "en",
                "original_title": "Titanic",
                "overview": "101-year-old Rose DeWitt Bukater tells the story of her life aboard the Titanic, 84 years later. A young Rose boards the ship with her mother and fiancé. Meanwhile, Jack Dawson and Fabrizio De Rossi win third-class tickets aboard the ship. Rose tells the whole story from Titanic's departure through to its death—on its first and last voyage—on April 15, 1912.",
                "popularity": 23.0816,
                "poster_path": "/9xjZS2rlVxm8SFx8kPC3aIGCOYQ.jpg",
                "release_date": "1997-11-18",
                "title": "Titanic",
                "video": false,
                "vote_average": 7.906,
                "vote_count": 26321,
                "character": "Captain Smith",
                "credit_id": "675afe6bc7d3f2f93e131eff",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "برنارد هیل"
        ],
        "biography": "Bernard Hill was an English actor. He was known as a character actor of film, stage and television, having acted in nearly 130 projects. He is best known to British television viewers for playing Yosser Hughes in the groundbreaking 1982 TV series Boys from the Blackstuff. On film he has played Captain Edward John Smith in Titanic, King Théoden in The Lord of the Rings film trilogy, and the Warden of San Quentin Prison in the Clint Eastwood film True Crime. Hill is the only actor to have appeared in more than one of the three films awarded 11 Oscars, and one of only three actors to have starred in more than one film grossing more than $1 billion USD, namely: Titanic and The Return of the King (the others being Orlando Bloom who also starred in The Return of the King, as well as Pirates of the Caribbean and Johnny Depp who also starred in Pirates of the Caribbean, as well as Alice in Wonderland). Hill has appeared in three films which have won Best Picture: Gandhi, Titanic, and The Return of the King. Hill died on 5th May 2024 at the age of 79.",
        "birthday": "1944-12-17",
        "deathday": "2024-05-05",
        "gender": 2,
        "homepage": null,
        "id": 1369,
        "imdb_id": "nm0384060",
        "known_for_department": "Acting",
        "name": "Bernard Hill",
        "place_of_birth": "Blackley, Manchester, England, UK",
        "popularity": 0.8649,
        "profile_path": "/5i8bj2nsTrFU2ddSynleOjapxor.jpg"
    }
}