{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jqha8JCXm0aJ5SJ03Jd0JmGgWRs.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 895,
                "original_language": "ru",
                "original_title": "Андрей Рублёв",
                "overview": "An expansive Russian drama, this film focuses on the life of revered religious icon painter Andrei Rublev. Drifting from place to place in a tumultuous era, the peace-seeking monk eventually gains a reputation for his art. But after Rublev witnesses a brutal battle and unintentionally becomes involved, he takes a vow of silence and spends time away from his work. As he begins to ease his troubled soul, he takes steps towards becoming a painter once again.",
                "popularity": 5.3321,
                "poster_path": "/910xRIUmNJrWH2hkQifBJtoPp5R.jpg",
                "release_date": "1966-12-16",
                "title": "Andrei Rublev",
                "video": false,
                "vote_average": 8.0,
                "vote_count": 884,
                "character": "God's Fool",
                "credit_id": "52fe4289c3a36847f8026867",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/jOulpNwtoJP5fF1LJX1ojw6BxBq.jpg",
                "genre_ids": [
                    18,
                    10752
                ],
                "id": 31442,
                "original_language": "ru",
                "original_title": "Иваново детство",
                "overview": "In WW2, twelve year old Soviet orphan Ivan Bondarev works for the Soviet army as a scout behind the German lines and strikes a friendship with three sympathetic Soviet officers.",
                "popularity": 2.3805,
                "poster_path": "/vmRWSLP1DE9WTta0hfzIafJ0dID.jpg",
                "release_date": "1962-05-09",
                "title": "Ivan's Childhood",
                "video": false,
                "vote_average": 7.8,
                "vote_count": 779,
                "character": "Ivan's Mother",
                "credit_id": "52fe447e9251416c910129af",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Irma Raush",
            "Ирина Тарковская",
            "Irina Tarkovskaya",
            "Ирма Рауш",
            "Irina Yakovleva",
            "Ирма Яковлевна Рауш",
            "И. Рауш"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nIrma Yakovlevna Raush (Russian: Ирма Яковлевна Рауш; born 21 April 1938) (aka Irina Yakovleva and Irina Tarkovskaya) is a Russian actress and the first wife of film director Andrei Tarkovsky. She is best known for her role as Durochka in Andrei Rublev and as Ivan's mother in Ivan's Childhood.\n\nIrma Raush was born in Saratov on 21 April 1938 into a Volga German family. In 1954 she began to study at the State Institute of Cinematography (VGIK) under Mikhail Romm. She was in the same class as Andrei Tarkovsky, whom she married in April 1957. On 30 September 1962 their son Arseny Tarkovsky was born. They divorced in June 1970.\n\nIrma Raush played several roles in Tarkovsky's early films. She played Ivan's mother in Ivan's Childhood in 1962 and Durochka in Andrei Rublev. For the latter role she was awarded the Étoile de Cristal in 1970 for best foreign actress. The Étoile de Cristal was a French film award and predecessor to the César Award. In 1970 she became a film director for the Gorky Film Studio. After finishing her film career she began to write children's books.",
        "birthday": "1938-04-21",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 13708,
        "imdb_id": "nm0712173",
        "known_for_department": "Directing",
        "name": "Irma Raush",
        "place_of_birth": "Saratov, Russia",
        "popularity": 0.2913,
        "profile_path": "/y4OrVv64rB5ffIZKuiSgCbkGDWd.jpg"
    }
}