{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7Nwnmyzrtd0FkcRyPqmdzTPppQa.jpg",
                "genre_ids": [
                    80,
                    18,
                    35
                ],
                "id": 106646,
                "original_language": "en",
                "original_title": "The Wolf of Wall Street",
                "overview": "A New York stockbroker refuses to cooperate in a large securities fraud case involving corruption on Wall Street, corporate banking world and mob infiltration. Based on Jordan Belfort's autobiography.",
                "popularity": 27.2678,
                "poster_path": "/kW9LmvYHAaS9iA0tHmZVq8hQYoq.jpg",
                "release_date": "2013-12-25",
                "title": "The Wolf of Wall Street",
                "video": false,
                "vote_average": 8.028,
                "vote_count": 24976,
                "character": "Call Girl (uncredited)",
                "credit_id": "567ca58cc3a3684bc90058f3",
                "order": 169
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Madeleine Lindley",
            "Madeline Lindley",
            "马德琳·韦"
        ],
        "biography": "Madeleine was born in Lampertheim, Germany to German parents. Her mother died of cancer when Madeleine was a little girl and she was subsequently raised by her aunt and uncle. She grew up primarily overseas, having lived in Europe, the Middle East and Asia. She began modeling in Korea and Japan after being scouted by an agent at the age of 15. She moved to the United States after graduating from high school and continued modeling. She had her daughter Miranda when she was 19 years old before deciding to embark on an acting career once her daughter started elementary school. She worked as a burlesque performer, and with her background in ballet, has parlayed that skill into frequently being cast as a dancer in movies, music videos, commercials and television.\n\nShe is known for playing both sexy and crazy characters, exuding an unconventional vulnerability in many roles. Her favorite roles to play are the type of characters that really get under your skin. She transitioned to writing and produced and starred in the occult horror movie \"Blood Craft\", her first screen play. She also starred in and executive produced the film \"Rideshare\". She is writing another script and looking forward to producing more films in the future.",
        "birthday": "1978-11-21",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1371769,
        "imdb_id": "nm0511983",
        "known_for_department": "Acting",
        "name": "Madeleine Wade",
        "place_of_birth": "Lampertheim, Hesse, Germany",
        "popularity": 0.4372,
        "profile_path": "/n8SePV247HYcqAj81J9Aadrs1lg.jpg"
    }
}