{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ddIkmH3TpR6XSc47jj0BrGK5Rbz.jpg",
                "genre_ids": [
                    10752,
                    28,
                    18
                ],
                "id": 374720,
                "original_language": "en",
                "original_title": "Dunkirk",
                "overview": "The story of the miraculous evacuation of Allied soldiers from Belgium, Britain, Canada and France, who were cut off and surrounded by the German army from the beaches and harbour of Dunkirk between May 26th and June 4th 1940 during World War II.",
                "popularity": 8.077,
                "poster_path": "/b4Oe15CGLL61Ped0RAS9JpqdmCt.jpg",
                "release_date": "2017-07-19",
                "title": "Dunkirk",
                "video": false,
                "vote_average": 7.449,
                "vote_count": 17006,
                "character": "Petty Officer",
                "credit_id": "5988f9ef9251414bd100568e",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Билли Хоул"
        ],
        "biography": "Billy Howle was born in Stoke-on-Trent, England, to a schoolteacher mother and a father who teaches at Kent University, the second of four sons. His older brother, Sam, is a graphic designer. Despite his parents' academic backgrounds, Billy has said that he was not interested in further education, and worked instead at the local Stephen Joseph theater, in community-based projects involving dance and acting. After a year at drama school, he enrolled at the prestigious Bristol Old Vic Theatre School, graduating in 2013. Having appeared at Bristol in 'The Little Mermaid,' his next stage appearance was in New York at the Brooklyn Academy of Music, opposite Lesley Manville in Richard Eyre's production of Henrik Ibsen's 'Ghosts' and a year later was reunited with Bristol Old Vic, the director, and Ms. Manville in a scorching production of 'Long Day's Journey Into Night' alongside Jeremy Irons - another Bristol Old Vic alumnus - Hadley Fraser, and Jessica Regan, more than holding his own with his older, more experienced co-stars. After a couple of small roles in television drama, Billy's first substantial lead came in the youth-oriented murder mystery Glue (2014) in 2014, opening the first scene in memorable style as he rolled nude down stacks of grain in a barn. In 2016, he was in another murder mystery, The Witness for the Prosecution (2016), as the defendant accused of killing his wealthy benefactress, by which time he had filmed his first forays into cinema: On Chesil Beach (2017) and Anton Chekhov's The Seagull (2018), both with Saoirse Ronan, and The Sense of an Ending (2017).",
        "birthday": "1989-11-09",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1371049,
        "imdb_id": "nm6247071",
        "known_for_department": "Acting",
        "name": "Billy Howle",
        "place_of_birth": "Stoke-on-Trent, Staffordshire, England, UK",
        "popularity": 1.5532,
        "profile_path": "/oThU8PRDz0YvsINvN6YD2qAoKy3.jpg"
    }
}