{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8r9RoGfwGmn1pn0G3sbvHHemSWF.jpg",
                "genre_ids": [
                    18,
                    10402,
                    36
                ],
                "id": 277216,
                "original_language": "en",
                "original_title": "Straight Outta Compton",
                "overview": "In 1987, five young men, using brutally honest rhymes and hardcore beats, put their frustration and anger about life in the most dangerous place in America into the most powerful weapon they had: their music.  Taking us back to where it all began, Straight Outta Compton tells the true story of how these cultural rebels—armed only with their lyrics, swagger, bravado and raw talent—stood up to the authorities that meant to keep them down and formed the world’s most dangerous group, N.W.A.  And as they spoke the truth that no one had before and exposed life in the hood, their voice ignited a social revolution that is still reverberating today.",
                "popularity": 5.6597,
                "poster_path": "/1CiLJx8Xtv3TbbFj6k7BboSmKgC.jpg",
                "release_date": "2015-08-11",
                "title": "Straight Outta Compton",
                "video": false,
                "vote_average": 7.787,
                "vote_count": 4041,
                "character": "Suge Knight",
                "credit_id": "543193b60e0a265915002360",
                "order": 12
            },
            {
                "adult": false,
                "backdrop_path": "/oVD3ClJBoomSQHtnJPAlMfes8YD.jpg",
                "genre_ids": [
                    28,
                    80
                ],
                "id": 339403,
                "original_language": "en",
                "original_title": "Baby Driver",
                "overview": "After being coerced into working for a crime boss, a young getaway driver finds himself taking part in a heist doomed to fail.",
                "popularity": 10.2244,
                "poster_path": "/tYzFuYXmT8LOYASlFCkaPiAFAl0.jpg",
                "release_date": "2017-06-28",
                "title": "Baby Driver",
                "video": false,
                "vote_average": 7.446,
                "vote_count": 16254,
                "character": "Armie",
                "credit_id": "575ed26e925141703f0022c5",
                "order": 27
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "R. Marcus Taylor",
            "Kick You In The Head",
            "Richard Marcos Taylor"
        ],
        "biography": "R. Marcos Taylor (born September 16, 1976) is an American actor and stuntman, best known for his portrayal of Suge Knight in Straight Out of Compton (2015).\n\nAt five years old, all Taylor wanted to become was Superman. When he realized that couldn't happen, he decided taking Karate lessons was the next best thing. He went on to earn a black belt in Karate, but along the way he began developing a love for various martial art forms. In addition to Karate, Marcus began intensive training in: Taekwondo, Muay Thai, Capoeira, and Hapkido, and has more than twenty years of training in these forms. Marcus holds the rank of Kru in Muay Thai. Marcus also trains in several other martial art forms including: Kung Fu, Boxing, Judo, Ninjitsu, Gracie Jui Jitsu, etc. He has fought in tournaments and won titles including: the NJ StateTaekwondo Champion 1994, YB Choi Taekwondo Invitational Champion 1995, and the Muay Thai Warriors Cup Super-Heavy Weight Champion 2010. He has also worked as a certified personal trainer, gym owner, professional fighter, bodyguard, and has taught martial arts and self-defense locally and internationally for the last twenty-four years.  Taylor also works as an actor and stuntman, where his strongest areas are fight scenes, stunt doubling, choreography, and stunt falls. Although being Superman was unrealistic, he's found that being a student of martial arts was far more rewarding. Marcus has over 30 years of experience in martial arts and is hoping for many more years of learning and teaching the art form he came.",
        "birthday": "1976-09-16",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1371397,
        "imdb_id": "nm3976974",
        "known_for_department": "Acting",
        "name": "R. Marcos Taylor",
        "place_of_birth": "Plainfield, New Jersey, USA",
        "popularity": 0.1274,
        "profile_path": "/buImCfOC1veR0EScUqemuDPIcOf.jpg"
    }
}