{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jqha8JCXm0aJ5SJ03Jd0JmGgWRs.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 895,
                "original_language": "ru",
                "original_title": "Андрей Рублёв",
                "overview": "An expansive Russian drama, this film focuses on the life of revered religious icon painter Andrei Rublev. Drifting from place to place in a tumultuous era, the peace-seeking monk eventually gains a reputation for his art. But after Rublev witnesses a brutal battle and unintentionally becomes involved, he takes a vow of silence and spends time away from his work. As he begins to ease his troubled soul, he takes steps towards becoming a painter once again.",
                "popularity": 5.3321,
                "poster_path": "/910xRIUmNJrWH2hkQifBJtoPp5R.jpg",
                "release_date": "1966-12-16",
                "title": "Andrei Rublev",
                "video": false,
                "vote_average": 8.0,
                "vote_count": 884,
                "character": "Foma",
                "credit_id": "52fe4289c3a36847f8026877",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Михаил Иванович Кононов",
            "М. Кононов"
        ],
        "biography": "Honored Artist of the RSFSR (04.17.1989). People's Artist of Russia (11/22/1999). In 1963 he graduated from the Shchepkin Theater School and was accepted into the troupe of the Maly Theater. From August 1, 1963 to April 16, 1968 - actor of the Academic Maly Theater. Since 1968 - actor of the Gorky film studio. The actor played his first role, while still a student, in 1961 he made his debut in the film by Ivan Pyryev \"Our mutual friend\", where Kononov got the role of Vitka. The type played by him for a long time determined the role of the actor - \"a guy from the people\", charming and unsophisticated. Kononov did not work out with the theater. After graduating from the Shchepkin College in 1963, Mikhail Kononov came to the Maly Theater. At first, he seemed to fit into the theatrical environment. However, in the future, the attitude of the leadership of the Maly Theater to the young actor changed - there were rumors that the masters did not like that Kononov was making a career in cinema. Five years later, the actor left the theatrical stage forever. In 1969, the actor married a girl named Natalya. The couple lived 38 years in marriage, they did not have children. Natalia passed away in 2011. In 1997, Mikhail Ivanovich had to sell an apartment in the center of Moscow in order to buy a house in the Istra district, in the village of Butyrki (near Mozhaisk). For eight years, the building was being renovated at the end of the 19th century. So the Kononovs lived all this time, one might say, at a construction site and for the money from the sale of vegetables grown in his garden. A year before the death of Mikhail Kononov, they returned to Moscow. Since the late 1980s, the actor has appeared less and less on the screen. Often refused offers, with the new generation in the cinema he was not fundamentally friendly and rarely appeared in public. After returning to Moscow, he worked as the head of the marketing department. He wrote scripts, and in his own words, \"looked for himself.\" The actor did not like those works that brought him popularity among the audience - “The Head of Chukotka”, “Big Break” or “Guest from the Future”. “If we talk about recognition in professional circles,” said the actor, “then Thomas’s small role in the film“ Andrei Rublev ”brought me greater success. One of his last works is that of Gleb Panfilov’s film“ In the First Circle ”(2006). he was filming when he was already very sick. \"Misha said there so that his every word pierced his heart, but, unfortunately, none of the film critics noticed or noted this,\" says Inna Churikova, of whom Kononov was a partner in such legendary films like “Beginning” and “There is no ford in the fire.” Before his death, he wrote a book that he had nothing to publish. Despite his grave condition, in the last days of his life, the popularly beloved actor tried not to lose his presence of spirit. Mikhail Ivanovich Kononov He died on July 16, 2007 at 10:10 in the cardiopulmonary resuscitation unit of Moscow Clinical Hospital No. 20. \"My friends and I raised a small amount to buy medicine for Mikhail Ivanovich,\" Kononova’s neighbor in the ward says. But it was too late, we were unable to save him. \"The actor was buried in the columbarium of the Vagankovsky cemetery in Moscow (plot No. 1).",
        "birthday": "1940-04-25",
        "deathday": "2007-07-16",
        "gender": 2,
        "homepage": null,
        "id": 13713,
        "imdb_id": "nm0465244",
        "known_for_department": "Acting",
        "name": "Mikhail Kononov",
        "place_of_birth": "Moscow, RSFSR, USSR",
        "popularity": 0.2281,
        "profile_path": "/grUCdVdcGESmiuv8cx1GOJSQarC.jpg"
    }
}