{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/r2IOBOeg5wLfLtyOnT5Pur6Tl4q.jpg",
                "genre_ids": [
                    12,
                    28,
                    878
                ],
                "id": 1892,
                "original_language": "en",
                "original_title": "Return of the Jedi",
                "overview": "Luke Skywalker leads a mission to rescue his friend Han Solo from the clutches of Jabba the Hutt, while the Emperor seeks to destroy the Rebellion once and for all with a second dreaded Death Star.",
                "popularity": 8.3835,
                "poster_path": "/jQYlydvHm3kUix1f8prMucrplhm.jpg",
                "release_date": "1983-05-25",
                "title": "Return of the Jedi",
                "video": false,
                "vote_average": 7.905,
                "vote_count": 16311,
                "character": "Oola",
                "credit_id": "54e9f1219251412eb1004102",
                "order": 22
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Femi Taylor is a British dancer and actress best known for portraying Jabba the Hutt's Twi'lek slave dancer Oola in the 1983 motion picture Star Wars Episode VI: Return of the Jedi. She reprised the part fourteen years later, filming new scenes for the 1997 Special Edition rerelease, and was the only performer from the original to do so. Because of this role, she appears at science fiction and Star Wars conventions around the world. Taylor was cast as Tantomile in the 1981 original London production of the musical Cats, during which she learned she had been cast as Oola for Return of the Jedi. She appeared in the 1998 TV movie version of Cats as Exotica, a character that was created specially for her and exclusively for the film. Her brother, Benedict Taylor, played fighter pilot Bravo 2 in Star Wars Episode I: The Phantom Menace. Femi is married and has two children.",
        "birthday": "1961-02-08",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 137295,
        "imdb_id": "nm0852361",
        "known_for_department": "Acting",
        "name": "Femi Taylor",
        "place_of_birth": "Niger",
        "popularity": 0.1404,
        "profile_path": "/6Qxf5WIQDSF96hNvPv6f2T67kW5.jpg"
    }
}