{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/y9zcjxEilWr44c4vJbEaLTgE0Uw.jpg",
                "genre_ids": [
                    878,
                    18,
                    10749
                ],
                "id": 31011,
                "original_language": "en",
                "original_title": "Mr. Nobody",
                "overview": "Nemo Nobody leads an ordinary existence with his wife and 3 children; one day, he wakes up as a mortal centenarian in the year 2092.",
                "popularity": 4.162,
                "poster_path": "/qNkIONc4Rgmzo23ph7qWp9QfVnW.jpg",
                "release_date": "2009-11-06",
                "title": "Mr. Nobody",
                "video": false,
                "vote_average": 7.804,
                "vote_count": 6003,
                "character": "Thug 1",
                "credit_id": "543c2d21c3a368198c0060e6",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "David Schall"
        ],
        "biography": "From Wikipedia, the free encyclopedia.   David Schaal (born 27 May 1963 in Albuquerque, New Mexico) is an English actor best known for playing the roles of \"Taffy\" in The Office and \"Terry Cartwright\" in The Inbetweeners.\n\nSchaal studied Theatre Arts at Rose Bruford College of Speech and Drama (1985–1988) and has worked in television, film and theatre. His television credits include Missing, Casualty, The Wrong Door, Beautiful People, Hancock and Joan, Ashes To Ashes, The IT Crowd, Deceit, Doc Martin, Peak Practice, Silent Witness and Dangerfield. His film credits include Kidulthood, Mr. Nobody, Clubbed and Dirty Weekend.\n\nSchaal also appeared as \"Norm\", Shirley Carter's seedy landlord, in EastEnders and played troubled father \"Tom Hargreaves\" in Grange Hill. Other notable credits include playing \"DS Bevan\" in Paul Greengrass' The Murder of Stephen Lawrence, playing opposite William Baldwin in the film Relative Values, and appearing in Philip Davis' English football hooligan film I.D. Schaal also played \"Eric\" in Ben Wheatley's domestic British gangster film Down Terrace.\n\nSchaal wrote the short films Poppy's Present (directed by Chris Jury) and Half Time (directed by Duncan Roe). He also co-wrote the play Reality Chokes and appeared in it as \"Rob\" in London and directed a production of the play at the Edinburgh Festival in 2010.  Other writing credits include the plays Shame, No Hiding Place, The Legacy of Colonel Ash and Baby Blue.\n\nDescription above from the Wikipedia article David Schaal  , licensed under CC-BY-SA,full list of contributors on Wikipedia.",
        "birthday": "1963-05-27",
        "deathday": null,
        "gender": 2,
        "homepage": "https://cam.co.uk/talent/david-schaal/",
        "id": 137472,
        "imdb_id": "nm0769442",
        "known_for_department": "Acting",
        "name": "David Schaal",
        "place_of_birth": "Albuquerque, New Mexico",
        "popularity": 0.1158,
        "profile_path": "/sJvYPUN5mv2LDqnf5mG3nBxCulx.jpg"
    }
}