{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7a4WHNllmX5ZGR0MfYJDPhV69eM.jpg",
                "genre_ids": [
                    16,
                    878
                ],
                "id": 55931,
                "original_language": "en",
                "original_title": "The Animatrix",
                "overview": "Straight from the creators of the groundbreaking Matrix trilogy, this collection of short animated films from the world's leading anime directors fuses computer graphics and Japanese anime to provide the background of the Matrix universe and the conflict between man and machines. The shorts include Final Flight of the Osiris, The Second Renaissance, Kid's Story, Program, World Record, Beyond, A Detective Story and Matriculated.",
                "popularity": 4.3083,
                "poster_path": "/g52SOsTvdjzY8oPIn5znLJMzLHG.jpg",
                "release_date": "2003-05-09",
                "title": "The Animatrix",
                "video": false,
                "vote_average": 7.197,
                "vote_count": 1666,
                "character": "Reporter (\"World Record\")",
                "credit_id": "53651e8c0e0a2647ce001713",
                "order": 23
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Allison Smith's career started on Broadway at the age of nine, in the original production of \"Evita\", quickly followed by her landing the title role of \"Annie\" on Broadway in the musical \"Annie\" at the age of ten. She was the longest-running and youngest star of a Broadway musical at that time, playing the role for over 1,000 performances; nearly 3 years. She's given vocal performances at Carnegie Hall, The Kennedy Center, Radio City Music Hall, and The White House. After \"Annie\", she was cast on \"Kate and Allie\", playing the role of \"Jennie Lowell\" on CBS for six seasons. Allison recurred in all seven seasons of NBC's The West Wing (1999) as \"Mallory O'Brien\", the chief of staff's daughter / Sam Seaborn's (Rob Lowe's) love interest. She was in the CBS miniseries Helter Skelter (2004), in which she portrayed real-life Charles Manson murderess Patricia Krenwinkel, and gave a stellar performance starring as the guest in the pilot of The Closer (2005). She has starred in several regular television series: Buddy Faro (1998), Spy Game (1997). She played the lead in the independent feature, A Reason to Believe (1995), and supporting roles in such features as Holes (2003) and Switchback (1997). Other theater work includes starring in the L.A. premiere production of David Mamet's \"Oleanna\", \"QED\" opposite Alan Alda at the Mark Taper Forum and with Randy Newman in his musical \"The Education of Randy Newman\", at South Coast Rep, for which her vocal performance got rave reviews. Also a writer, she was born in New York City and raised in Bergen County, New Jersey.",
        "birthday": "1969-12-09",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 137410,
        "imdb_id": "nm0807278",
        "known_for_department": "Acting",
        "name": "Allison Smith",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.5986,
        "profile_path": "/wptcGWqgSCVzIm2GilAxHDlfqWK.jpg"
    }
}