{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/q5vgDhmDS4EoYWrk9f9nqYZGDOw.jpg",
                "genre_ids": [
                    10749,
                    18,
                    10402
                ],
                "id": 28971,
                "original_language": "en",
                "original_title": "Limelight",
                "overview": "A fading music hall comedian tries to help a despondent ballet dancer learn to walk and to again feel confident about life.",
                "popularity": 2.8236,
                "poster_path": "/tDD11x3ZWCXXXwdpbGEU9uU4kh1.jpg",
                "release_date": "1952-10-16",
                "title": "Limelight",
                "video": false,
                "vote_average": 7.908,
                "vote_count": 562,
                "character": "Newsboy (uncredited)",
                "credit_id": "6473c672be2d4900f9944959",
                "order": 42
            },
            {
                "adult": false,
                "backdrop_path": "/lYfHa1AtkUMtplrKx7SRLHpwonW.jpg",
                "genre_ids": [
                    12,
                    14,
                    27
                ],
                "id": 244,
                "original_language": "en",
                "original_title": "King Kong",
                "overview": "Adventurous filmmaker Carl Denham sets out to produce a motion picture unlike anything the world has seen before. Alongside his leading lady Ann Darrow and his first mate Jack Driscoll, they arrive on an island and discover a legendary creature said to be neither beast nor man. Denham captures the monster to be displayed on Broadway as King Kong, the eighth wonder of the world.",
                "popularity": 3.0805,
                "poster_path": "/lHlnxKL5GbgRibyRFI7n1Ey850i.jpg",
                "release_date": "1933-03-15",
                "title": "King Kong",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 1544,
                "character": "Member of Ship's Crew (uncredited)",
                "credit_id": "5dc777976905fb0011fef16c",
                "order": 22
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            " Charles Hall ",
            "Charley Hall ",
            "Charles Hill"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nCharlie Hall (19 August 1899 – 7 December 1959) was an English film actor. He is best known as the \"Little Nemesis\" of Laurel and Hardy and appeared in nearly 50 films with them, so that Hall was the most frequent supporting actor of their films.\n\nHall was born in Ward End, Birmingham, Warwickshire, and learned carpentry as a trade, but as a teenager, he became a member of the Fred Karno troupe of stage comedians. In his late teens, he visited his sister in New York and stayed there, finding employment as a stagehand. While working behind the scenes, he met the comic actor Bobby Dunn and they became friends; Dunn convinced Hall to take a stab again at acting, which he did. By the mid-1920s, Hall was working for Hal Roach. Stan Laurel, one of Roach's comedy stars, was also a graduate of the Karno troupe.\n\nAs an actor, Hall worked with such comedians as Buster Keaton and Charley Chase, but is best remembered as a comic foil for Laurel and Hardy. He appeared in nearly 50 of their films, sometimes in bit parts, but often as a mean landlord or opponent in many of their memorable tit-for-tat sequences. Unlike the usual villains in Laurel and Hardy films, who were big and burly, Charlie Hall (billed as \"Charley\" Hall in the Roach comedies) was of short stature, standing 5 ft 5 in tall. His height and slight English accent allowed him to be convincingly cast as a college student, despite being 40 years old, in Laurel and Hardy's A Chump at Oxford.\n\nHall almost never played starring roles; the exception was in 1941, when he was teamed with character comedian Frank Faylen by Monogram Pictures. Hall continued to play bits and supporting roles in short subjects and features through the 1940s and 1950s, occasionally on TV, appearing very briefly in Charlie Chaplin's final American film, Limelight (1952).\n\nIn 1956 he played a small but important part in the TV show Cheyenne, season 1, episode 11, \"Quicksand\", starring Clint Walker, with Dennis Hopper, John Alderson, Wright King and Peggy Webber. His last role was in a Joe McDoakes short film starring George O'Hanlon, So You Want to Play the Piano, in 1956.\n\nHall died in North Hollywood, California, on 7 December 1959. A J D Wetherspoon's public house in Erdington, is named The Charlie Hall as a tribute to him.",
        "birthday": "1899-08-18",
        "deathday": "1959-12-07",
        "gender": 2,
        "homepage": null,
        "id": 137404,
        "imdb_id": "nm0355408",
        "known_for_department": "Acting",
        "name": "Charlie Hall",
        "place_of_birth": "Birmingham, Warwickshire, England, UK",
        "popularity": 0.0916,
        "profile_path": "/huLPhEhh8pO9v0gSJb7HVB76GRZ.jpg"
    }
}