{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yY76zq9XSuJ4nWyPDuwkdV7Wt0c.jpg",
                "genre_ids": [
                    28,
                    53,
                    878
                ],
                "id": 577922,
                "original_language": "en",
                "original_title": "Tenet",
                "overview": "Armed with only one word - Tenet - and fighting for the survival of the entire world, the Protagonist journeys through a twilight world of international espionage on a mission that will unfold in something beyond real time.",
                "popularity": 9.6077,
                "poster_path": "/aCIFMriQh8rvhxpN1IWGgvH0Tlg.jpg",
                "release_date": "2020-08-22",
                "title": "Tenet",
                "video": false,
                "vote_average": 7.174,
                "vote_count": 10484,
                "character": "Uniformed Official",
                "credit_id": "64ba6685ab684900ad8d17ef",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Ivo Uukkivi (born October 11, 1965 in Tallinn) is an Estonian stage, film, radio, and television actor, television producer and, under the nickname Munk, founder of and singer with the punk band Velikije Luki. He was born in Tallinn and was one of two siblings\n\nHe is a 1980 graduate of Tallinn 2nd Secondary School (now, Tallinn Secondary School of Science). Afterward, he attended Tallinn Polytechnic School, graduating in 1984. He is a 1992 graduate of the Tallinn Conservatory's (now, the Estonian Academy of Music and Theatre) Performing Arts Department. Uukkivi's diploma production roles include Snug in William Shakespeare's A Midsummer Night's Dream and Man in Purple in Mati Unt's Emperor Nero's Private Life. Among his graduating classmates were Merle Palmiste, Kristel Leesmend, Andres Raag, Kaili Närep, Jaanus Rohumaa, Üllar Saaremäe, Dan Põldroos, Sten Zupping, Tiina Mälberg and Garmen Tabor.\n\nIvo Uukkivi has appeared in a number of feature-length films. His first substantial role was as Moppe in the 1993 Pekka Karjalainen-directed comedy film Hysteria. This was followed by the starring role of Toivo in the Ilkka Järvi-Laturi-directed satirical political thriller Tallinn pimeduses (City Unplugged) the same year. The following year he appeared in the Jaan Kolberg-directed biographical drama film Jüri Rumm about the 19th-century Estonian folk hero, itinerant, thief and robber Rummu Jüri. In 1998, he played a small role in the Rao Heidmets-directed comedy-family film Kallis härra Q.\n\nIn 2003, he appeared in a small role in the Sulev Keedus-directed period drama Somnambuul. The following year, he played the role of Kuldar in the Ilmar Taska-directed thriller Täna öösel me ei maga for Taska Film. Täna öösel me ei maga (English release title: Set Point) is notable for Estonian model Carmen Kass appearing in a starring role. In 2007, he appeared in three films; as Laura's boyfriend in the Veiko Õunpuu-directed drama Sügisball (Autumn Ball); which was an adaptation of the 1979 Mati Unt novel of the same name; as Ants in the Rainer Sarnet-directed teen drama Kuhu põgenevad hinged (Where Souls Go); and a minor voice role for the Åke Lindman and Sakari Kirjavainen-directed Finnish World War II drama Tali-Ihantala 1944.\n\nIn 2012, Uukkivi appeared as a tough crook in the Andres Kõpper and Arun Tamm-directed dark comedy-crime film Vasaku jala reede. In 2015, he played role of Rudolf Kask in the Elmo Nüganen-directed World War II drama film 1944. The film is set in the year 1944 and is shown through the eyes of Estonian soldiers who had to choose sides and thus fight against their fellow countrymen. 1944 was selected as the Estonian entry for the Best Foreign Language Film at the 88th Academy Awards but it was not nominated.\n\nIn 2016, Uukkivi appeared in three films; a small role in the Anu Aun-directed drama Polaarpoiss (The Polar Boy); as Lembit in the Toomas Hussar-directed political thriller Luuraja ja Luuletaja (The Spy and The Poet); and a starring role as Andres in the Mart Kivastik-directed romantic drama Õnn tuleb magades (When You Least Expect It) opposite actress Katariina Unt. In 2020, he had a prominent role as Governor in the Rasmus Merivoo directed dark comedy-fantasy film Kratt.\n\nIn addition to feature films, Uukkivi has also appeared in a number of short films.",
        "birthday": "1965-10-11",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 137447,
        "imdb_id": "nm0882616",
        "known_for_department": "Acting",
        "name": "Ivo Uukkivi",
        "place_of_birth": "Tallinn, Harju County, Estonian SSR, USSR [now Estonia]",
        "popularity": 0.0311,
        "profile_path": "/8h9I11SItpFHuFVKiAIYitlKP02.jpg"
    }
}