{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mgDv2dDihyetAcENxyf2tpXY245.jpg",
                "genre_ids": [
                    10402,
                    18
                ],
                "id": 1407,
                "original_language": "fr",
                "original_title": "La Môme",
                "overview": "From the mean streets of the Belleville district of Paris to the dazzling limelight of New York's most famous concert halls, Edith Piaf's life was a constant battle to sing and survive, to live and love. Raised in her grandmother's brothel, Piaf was discovered in 1935 by nightclub owner Louis Leplee, who persuaded her to sing despite her extreme nervousness. Piaf became one of France's immortal icons, her voice one of the indelible signatures of the 20th century.",
                "popularity": 2.9969,
                "poster_path": "/3b9DAONAsFRhJKu25R33PE3VwDh.jpg",
                "release_date": "2007-02-14",
                "title": "La Vie en Rose",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 1667,
                "character": "Aïcha",
                "credit_id": "5f088b77e10f460037378634",
                "order": 46
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "فريدة عمروش"
        ],
        "biography": "Farida Amrouche (Arabic: فريدة عمروش‎) is an Algerian actress.\n\nComing from a family of artists, she was trained over the years 60 at the Algerian conservatory by Allel El Mouhib. She then acted as an actress at the Algerian National Theater, then directed by Mustapha Kateb, for thirty years, and in 1967 she won the 1st Prize for interpretation at the Timgad Festival. She will then appear in cinema and television on both shores of the Mediterranean, in Algeria and France. In 1978 she married the director Farouk Mezouane.\n\nDuring the dark decade in Algeria in the 1990s, she was forced into exile, after the assassination of numerous artists. She took refuge in France, where she did odd food jobs, and joined the Théâtre du Soleil directed by Ariane Mnouchkine and was able to continue what drives her above all else, theater.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "https://tna.dz/fr/?s=Farida+Amrouche",
        "id": 1376335,
        "imdb_id": "nm1113321",
        "known_for_department": "Acting",
        "name": "Farida Amrouche",
        "place_of_birth": "Alger, Algérie",
        "popularity": 0.0683,
        "profile_path": "/p1hEBP1tpYUDCAzH2napvuIK4cd.jpg"
    }
}