{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/nCzfXkipK6LCg9JAPkrYw2QA0GO.jpg",
                "genre_ids": [
                    18
                ],
                "id": 15487,
                "original_language": "en",
                "original_title": "The Greatest Game Ever Played",
                "overview": "A biopic of 20-year-old Francis Ouimet who defeated his golfing idol and 1900 US Open Champion, Harry Vardon.",
                "popularity": 3.8833,
                "poster_path": "/kh4vd6wKa6j9xVFzxhQrsT0p2YN.jpg",
                "release_date": "2005-09-30",
                "title": "The Greatest Game Ever Played",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 509,
                "character": "Soprano",
                "credit_id": "5fb17f8ba22d3e003e05926e",
                "order": 33
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Dawn Upshaw (born July 17, 1960) is an American soprano. She is the recipient of several Grammy Awards and has released a number of Edison Award-winning discs; she performs both opera and art song, and her repertoire spans Baroque to contemporary. Many composers, including Henri Dutilleux, Osvaldo Golijov, John Harbison, Esa-Pekka Salonen, John Adams, and Kaija Saariaho, have written for her. In 2007, she was awarded a MacArthur Fellowship.\n\nDawn Upshaw was born in Nashville, Tennessee. She began singing while attending Rich East High School in Park Forest, Illinois and was the only female ever promoted to the top choir (the Singing Rockets) as a sophomore, according to choir director Douglas Ulreich. She received a B.A. in 1982 from Illinois Wesleyan University, where she studied voice with Dr. David Nott. She went on to study voice with Ellen Faull at the Manhattan School of Music in New York City, earning her M.M. in 1984. She also attended courses given by Jan DeGaetani at the Aspen Music School. She was a winner of the Young Concert Artists International Auditions (1984) and the Walter M. Naumburg Competition (1985), and was a member of the Metropolitan Opera Young Artists Development Program. Since her start in 1984, Upshaw has made more than 300 appearances at the Metropolitan Opera.\n\nUpshaw came to international fame with her performance on the million-selling recording (1992), with David Zinman, of Symphony No 3 by Henryk Górecki, known as the Symphony of Sorrowful Songs (Symfonia pieśni żałosnych).\n\nShe has premiered more than twenty-five new works, notably Henri Dutilleux's song-cycle Correspondances, and has embraced several pieces created for her, including the Grawemeyer Award-winning opera L'Amour de Loin by Kaija Saariaho, The Great Gatsby by John Harbison, the nativity oratorio El Niño by John Adams, and Osvaldo Golijov's highly acclaimed chamber opera Ainadamar and song cycle Ayre. In 2009, she premiered David Bruce's song cycle The North Wind was a Woman at the gala opening of the Chamber Music Society of the Lincoln Centre's season.\n\nIn addition to her operatic recordings, she has also sung the title role in the first complete recording of the score of Gershwin's Oh, Kay!. She has also recorded albums of songs by Vernon Duke and Rodgers and Hart. Upshaw was a guest of President of the United States Bill Clinton and Mrs. Clinton on the NBC special Christmas in Washington. The BBC presented a prime-time telecast of her 1996 London Proms Concert, Dawn at Dusk, in which she performed songs from American musical theater. Her engagements with James Levine over many years led to a 1997 recording of Claude Debussy songs.\n\nUpshaw appears on an album of Christmas music in association with the male vocal ensemble Chanticleer titled Christmas with Chanticleer featuring special guest Dawn Upshaw for Teldec Classics. ...\n\nSource: Article \"Dawn Upshaw\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1960-07-17",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1377824,
        "imdb_id": "nm0881471",
        "known_for_department": "Acting",
        "name": "Dawn Upshaw",
        "place_of_birth": "Nashville, Tennessee, USA",
        "popularity": 0.1137,
        "profile_path": "/mUlN5pht2BRJ9mvm5sKDc4HEKYE.jpg"
    }
}