{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/51UDa3IuGyiKGe2MgMcLGvJE2Fm.jpg",
                "genre_ids": [
                    53,
                    80,
                    18
                ],
                "id": 1213,
                "original_language": "en",
                "original_title": "The Talented Mr. Ripley",
                "overview": "Tom Ripley is a calculating young man who believes it's better to be a fake somebody than a real nobody. Opportunity knocks in the form of a wealthy U.S. shipbuilder who hires Tom to travel to Italy to bring back his playboy son, Dickie. Ripley worms his way into the idyllic lives of Dickie and his girlfriend, plunging into a daring scheme of duplicity, lies and murder.",
                "popularity": 5.7442,
                "poster_path": "/6ojHgqtIR41O2qLKa7LFUVj0cZa.jpg",
                "release_date": "1999-12-25",
                "title": "The Talented Mr. Ripley",
                "video": false,
                "vote_average": 7.195,
                "vote_count": 3935,
                "character": "Policeman",
                "credit_id": "545b375d0e0a26042c001135",
                "order": 61
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Pierpaolo Lovino nasce a Roma nel 1967, si diploma presso l'Emilia Romagna Teatro nel corso Superiore per attori professionisti. Continua i suoi studi con Geraldine Baron\n\n della quale sarà l’assistente per tre anni e con Michael Margotta. E’ tra i fondatori dell’Actor’s Center di Roma del quale è tutt’ora membro.  Tra il 1999 e il 2000 è scelto da Mario Martone, all’epoca direttore del teatro di Roma, per uno stage con il regista americano Arthur Penn, all’epoca presidente dell’Actor’s Studio.  In teatro ha lavorato con Giancarlo Cobelli nel Troilio e Cressida di William Shakespeare e nell’Edoardo II di Christopher Marlow. Ha lavorato tra gli altri con Memè Perlini, Imogen Kush, Reza Keradman, e Beatrice Bracco nell’acclamato sacco e Vanzetti di Mauricio Kartun.  Debutta al cinema con Margarethe Von Trotta ne Il lungo Silenzio. Tra alcuni dei film che ha interpretato: Il Vestito della sposa di Fiorella Infascelli, Ultimo Stadio di Ivano De Matteo, Il Talento di Mr Ripley di Antony Minghella. Attualmente è in uscita con l’opera prima di Antonio Morabito Il Venditore di medicine. Per la televisione, tra i lavori che lo hanno visto interprete: la Buona Battaglia di Gianfranco Albano, miniserie in due puntate per Rai1, la serie Sospetti 2 per la regia di Gianni Lepre su Rai1, la serie Il Peccato e la vergogna per Canale5,Don Matteo e Medicina Generale per Rai1. Nella stagione 2012 ha lavorato alla miniserie di Rai1 Walter Chiari fino all’ultima risata per la regia di Enzo Monteleone. Per il cinema la sua ultima interpretazione è stata nel film Il venditore di medicine di Antonio Morabito presentato al Festival Internazionale di Roma 2013.",
        "birthday": "1967-01-01",
        "deathday": null,
        "gender": 0,
        "homepage": null,
        "id": 137810,
        "imdb_id": "nm0522737",
        "known_for_department": "Acting",
        "name": "Pierpaolo Lovino",
        "place_of_birth": "Rome - Italy",
        "popularity": 0.0357,
        "profile_path": "/gyPtSS5pBX9UqRgJdtdccGRR9dy.jpg"
    }
}