{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bBiZN1epQTu3F8iFLBuMhc4TRzr.jpg",
                "genre_ids": [
                    18
                ],
                "id": 10997,
                "original_language": "zh",
                "original_title": "霸王别姬",
                "overview": "Two boys meet at an opera training school in Peking in 1924. Their resulting friendship will span nearly 70 years and endure some of the most troublesome times in China's history.",
                "popularity": 4.1331,
                "poster_path": "/ySf9I93w6kJiaEb2T4zpoQjY8PR.jpg",
                "release_date": "1993-01-01",
                "title": "Farewell My Concubine",
                "video": false,
                "vote_average": 8.0,
                "vote_count": 627,
                "character": "Douzi's Mother",
                "credit_id": "64687c3ba5046e00e5b61077",
                "order": 14
            },
            {
                "adult": false,
                "backdrop_path": "/eLqQ6RleEKUBbqsxQvfJK2iOuVy.jpg",
                "genre_ids": [
                    28,
                    35,
                    53
                ],
                "id": 457332,
                "original_language": "en",
                "original_title": "Hidden Strike",
                "overview": "Two elite soldiers must escort civilians through a gauntlet of gunfire and explosions.",
                "popularity": 4.616,
                "poster_path": "/zsbolOkw8RhTU4DKOrpf4M7KCmi.jpg",
                "release_date": "2023-07-06",
                "title": "Hidden Strike",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 1022,
                "character": "Professor Cheng",
                "credit_id": "60f82941c439c0005c2bb967",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jiang Wen-Li",
            "Wenli Jiang",
            "蒋雯丽"
        ],
        "biography": "Jiang Wenli was born in a highbrow family. Her father was a railroad engineer, her mother was a railroad telephone operator, and her parents love literature and art. Since Wenli was a little girl, her father taught her to read famous book and painting, and listen to famous songs. When she was 5 years old, she dreamt about being a gymnast, so her mother sent her to study dance and gymnastics. However, since her stature didn’t fit the standard of a gymnast, the coach of Bengbu city gymnastic team refused to regard her as a formal team member. After that, she spent five years to practice as an informal team member of the gymnastic team. At the age of 17, she took the college entrance examination and regard going to normal university as her goal. However, she got accepted by a water conservation secondary school because her score was five points lower than the acceptance line of the normal university. In 1986, she graduated from the secondary school and starts to work in Bengbu City Water Company. Her job was to design ways of water transportation for residents. Nevertheless, she was not satisfied with her current life and decided to go to Beijing in 1988 and start her new life.\n\nWithout any preparation, she got accepted by Beijing Film Academy. After become a student of film academy, there were countless film companies inviting her to play role in their films. Her first role was a nursery school teacher in a TV series named The Lily on Cliff, and this TV series won the Feitian TV Awards of that year. Also, she was a candidate for Best Supporting Actress Reward. After this, she played Shuixiu in a movie named Li Li Yuan Shang Cao, and this film won the award from French film festival. The last film of her college period was The Story of Xing Hua, and she played the girl named Xing Hua. After graduate from college, she went to America for a long time and then returned to China to continue her career.\n\nAfter came back to China, she played a role in Miaomiao Liu’s movie *Who you think you are. In 1993, she played an important role which is Chengyi’s mother in movie Farewell My Concubine，and this movie won the Best Movie Award at French Cannes Film Festival of that year. In 1999, she played a 20 episode TV series named Lead by the Hand, and this helped her won the highest honor of Chinese TV industry, Best actress from both Golden Eagle Awards and Feitian TV Awards. In 2000, based on the outstanding performance in film Team Spirit，she won the best actress from Huabiao Film Awards. In 2001, movie The treatment made her career even more successful. In 2011, the TV series When Happiness Knocks became a huge success in her career. This TV series is broadcasting on CCTV-1, which is the most important channel in China. Also, the average audience rating was 3%, which is on the top of other TV series in the whole country.",
        "birthday": "1969-06-20",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 137917,
        "imdb_id": "nm0422639",
        "known_for_department": "Acting",
        "name": "Jiang Wenli",
        "place_of_birth": "Bengbu, Anhui Province, China",
        "popularity": 0.602,
        "profile_path": "/rs57IbWZp4J9kCJtuhWGlAyLufd.jpg"
    }
}