{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sDiGcjWhSu42dCw0jQmBInAkDZ9.jpg",
                "genre_ids": [
                    28,
                    53,
                    80
                ],
                "id": 379149,
                "original_language": "en",
                "original_title": "The Foreigner",
                "overview": "Quan is a humble London businessman whose long-buried past erupts in a revenge-fueled vendetta when the only person left for him to love – his teenage daughter – dies in an Irish Republican Army car bombing. His relentless search to find the terrorists leads to a cat-and-mouse conflict with a British government official whose own past may hold the clues to the identities of the elusive killers.",
                "popularity": 7.4398,
                "poster_path": "/rwM4hzrmc5HiWfQD9ls9DL4QgGl.jpg",
                "release_date": "2017-09-28",
                "title": "The Foreigner",
                "video": false,
                "vote_average": 6.97,
                "vote_count": 2771,
                "character": "Hennessy Guard (uncredited)",
                "credit_id": "58730d87c3a36817700060b3",
                "order": 38
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Glen Stanway is an Actor, Author and Martial Artist known for Guardians of the Galaxy (2014), The Fades (2011) and Ibiza Dark (2022). Glen took up training in martial arts and gymnastics in 1995, in order to recover from a debilitating car accident, something doctors had failed to achieve. He began coaching gymnastics, martial arts and kickboxing, full time in London schools and gyms in 1997 to pass on the benefits of his training to others.\n\nHe made his first of many visits to Malaysia and Singapore in 1998 to learn Chin Woo kung fu under the supervision of Master Teng Wie Yoo.\n\nCalling on his wealth of knowledge of physical preparation, Glen has coached athletes of disciplines as diverse as gymnastics, martial arts, tennis and dancing, at regional, national and international level. He has also officiated as a judge and referee at national martial arts championships.\n\nIn competition, Glen himself has won medals in the Combat Magazine International Open, IMAF World Forms Championships, Combat Magazine European Open, BCCMA Open Wushu Festival, and BCCMA SE England Kung Fu Championships.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://gmax.me.uk/",
        "id": 1379269,
        "imdb_id": "nm3491228",
        "known_for_department": "Acting",
        "name": "Glen Stanway",
        "place_of_birth": "Stevenage, Hertfordshire, England, UK",
        "popularity": 0.0416,
        "profile_path": null
    }
}