{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mDfJG3LC3Dqb67AZ52x3Z0jU0uB.jpg",
                "genre_ids": [
                    12,
                    28,
                    878
                ],
                "id": 299536,
                "original_language": "en",
                "original_title": "Avengers: Infinity War",
                "overview": "As the Avengers and their allies have continued to protect the world from threats too large for any one hero to handle, a new danger has emerged from the cosmic shadows: Thanos. A despot of intergalactic infamy, his goal is to collect all six Infinity Stones, artifacts of unimaginable power, and use them to inflict his twisted will on all of reality. Everything the Avengers have fought for has led up to this moment - the fate of Earth and existence itself has never been more uncertain.",
                "popularity": 29.705,
                "poster_path": "/7WsyChQLEftFiDOVTGkv3hFpyyt.jpg",
                "release_date": "2018-04-25",
                "title": "Avengers: Infinity War",
                "video": false,
                "vote_average": 8.235,
                "vote_count": 30938,
                "character": "Corvus Glaive",
                "credit_id": "5add658e0e0a264371004f62",
                "order": 34
            },
            {
                "adult": false,
                "backdrop_path": "/7RyHsO4yDXtBv1zUU3mTpHeQ0d5.jpg",
                "genre_ids": [
                    12,
                    878,
                    28
                ],
                "id": 299534,
                "original_language": "en",
                "original_title": "Avengers: Endgame",
                "overview": "After the devastating events of Avengers: Infinity War, the universe is in ruins due to the efforts of the Mad Titan, Thanos. With the help of remaining allies, the Avengers must assemble once more in order to undo Thanos' actions and restore order to the universe once and for all, no matter what consequences may be in store.",
                "popularity": 16.7585,
                "poster_path": "/ulzhLuWrPK07P1YkdWQLZnQh1JL.jpg",
                "release_date": "2019-04-24",
                "title": "Avengers: Endgame",
                "video": false,
                "vote_average": 8.237,
                "vote_count": 26720,
                "character": "Corvus Glaive",
                "credit_id": "5e85d9193344c600154103f8",
                "order": 58
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Michael Shaw"
        ],
        "biography": "Michael James Shaw (born September 16, 1986) is an American actor and writer from New York City. He is best known for his recurring role as FBI Agent Daryl/\"Mike\" in the TV series Limitless. Shaw has also had a recurring role in Constantine as Papa Midnite and had a role in several shorts like Don-o-mite and Today _ _ cks. He also had a small role in Roots as Marcellus. Shaw portrayed Corvus Glaive in the Marvel Cinematic Universe films Avengers: Infinity War and Avengers: Endgame.\n\nShaw's very first starring role was as the Big Bad Wolf in his kindergarten production of The Three Piggy Opera at Madison Street School of Basics Plus in Ocala, Florida. Shaw graduated from Vanguard High School in 2005. Upon graduating from high school, Shaw spent his undergraduate years at Howard University. He then took a master's program at Juilliard School.\n\nDescription above from the Wikipedia article Michael James Shaw, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1986-09-16",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1379821,
        "imdb_id": "nm4473692",
        "known_for_department": "Acting",
        "name": "Michael James Shaw",
        "place_of_birth": "New York, New York, USA",
        "popularity": 0.6027,
        "profile_path": "/djaWcSCBpXBV2wirtH4YX6t0YqT.jpg"
    }
}