{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wTvDGO0xGMmnScqjuiDeWU7PkcB.jpg",
                "genre_ids": [
                    10749,
                    14,
                    18
                ],
                "id": 293863,
                "original_language": "en",
                "original_title": "The Age of Adaline",
                "overview": "After 29-year-old Adaline recovers from a nearly lethal accident, she inexplicably stops growing older. As the years stretch on and on, Adaline keeps her secret to herself  until she meets a man who changes her life.",
                "popularity": 5.2512,
                "poster_path": "/MbILysGhjAbnZi1Okae9wYqLMx.jpg",
                "release_date": "2015-04-16",
                "title": "The Age of Adaline",
                "video": false,
                "vote_average": 7.479,
                "vote_count": 6890,
                "character": "Paramedic #1",
                "credit_id": "553c9188c3a3683e55005083",
                "order": 32
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Alison Wandzura is a Canadian actress from Calgary, Alberta, where she earned her Bachelor's Degrees in Theatre and Commerce. After honing her craft on stage, she relocated to Vancouver, British Columbia to shift her focus toward film and television.  Equally at home in comedy and drama, Alison has brought a wide range of characters to life in guest roles across networks and streaming platforms including Netflix, ABC, CBS, Nat Geo, The CW, Hallmark, and Lifetime. In addition to her on-camera work, Alison is a seasoned voiceover artist in both commercial and animated projects, and has written and produced several short films. She is of Ukrainian and Polish heritage, her maternal grandparents having immigrated from Poland to Canada after World War ll. She volunteers on an ongoing basis for women's crisis relief and is an advocate for women's equality.",
        "birthday": "1984-02-14",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.havenactingstudio.com/alisonwandzura",
        "id": 1381542,
        "imdb_id": "nm3004926",
        "known_for_department": "Acting",
        "name": "Alison Wandzura",
        "place_of_birth": "Calgary, Alberta, Canada",
        "popularity": 0.3206,
        "profile_path": "/5zSFLbqMtBLBEBp8E4OuomZJLK7.jpg"
    }
}