{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gHz4ZQytRs8YGrqFMwB3Vrr8pig.jpg",
                "genre_ids": [
                    18,
                    10749,
                    878
                ],
                "id": 274870,
                "original_language": "en",
                "original_title": "Passengers",
                "overview": "A spacecraft traveling to a distant colony planet and transporting thousands of people has a malfunction in its sleep chambers. As a result, two passengers are awakened 90 years early.",
                "popularity": 11.27,
                "poster_path": "/jK9S6HANSf2no64v1x1HxfcpmcA.jpg",
                "release_date": "2016-12-21",
                "title": "Passengers",
                "video": false,
                "vote_average": 6.953,
                "vote_count": 13749,
                "character": "Communications Officer",
                "credit_id": "62e5a62946e75f005cdc677a",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Kara Flowers"
        ],
        "biography": "Born and raised in Lyons, Kansas, growing up an athlete, an artist, and a serious tomboy. Her favorite childhood memories come from summering at Lake Wilson with her family. Her mother and father are both Kansas natives. Kara discovered performance art after watching the movie SLAM, starring poet Saul Williams and started writing and performing poetry at the age of 13. She gave up sports to spent her high school career as a Debate and Speech & Drama (Forensics) competitor. Earning five State titles, and two National Semi-Finalist titles (National Forensic League), she attended Kansas State University and continued to compete with the Collegiate Speech Team. Her most important mentor as a youth, was her high school debate coach, Mr. Troyer. Kara moved to Atlanta, Georgia in 2006, and attended law school in 2010. Kara works as a film, television, and commercial actor, a model, and spokesperson.  - IMDb Mini Biography By: Kara",
        "birthday": "1984-12-28",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1381473,
        "imdb_id": "nm5700607",
        "known_for_department": "Acting",
        "name": "Kara Flowers",
        "place_of_birth": "Lyons, Kansas, USA",
        "popularity": 0.122,
        "profile_path": "/AoQwSI9mCJJkeUVEGBpKiPLgJ1g.jpg"
    }
}