{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bQEIYntlPba76NN41uWxIzUmzBb.jpg",
                "genre_ids": [
                    18
                ],
                "id": 4995,
                "original_language": "en",
                "original_title": "Boogie Nights",
                "overview": "Set in 1977, back when sex was safe, pleasure was a business and business was booming, idealistic porn producer Jack Horner aspires to elevate his craft to an art form. Horner discovers Eddie Adams, a hot young talent working as a busboy in a nightclub, and welcomes him into the extended family of movie-makers, misfits and hangers-on that are always around. Adams' rise from nobody to a celebrity adult entertainer is meteoric, and soon the whole world seems to know his porn alter ego, \"Dirk Diggler\". Now, when disco and drugs are in vogue, fashion is in flux and the party never seems to stop, Adams' dreams of turning sex into stardom are about to collide with cold, hard reality.",
                "popularity": 11.9692,
                "poster_path": "/wnE24UPCPQsQnbBOu4zVE2qaDNm.jpg",
                "release_date": "1997-10-10",
                "title": "Boogie Nights",
                "video": false,
                "vote_average": 7.634,
                "vote_count": 3315,
                "character": "Skye - Jacuzzi Girl",
                "credit_id": "5890e55292514103fd0095c5",
                "order": 57
            }
        ],
        "crew": []
    },
    "details": {
        "adult": true,
        "also_known_as": [
            "Sky West"
        ],
        "biography": "Skye Blue is an American pornographic director, adult model, and former porn actress. She is President and CEO of the adult-film company, Platinum Blue Productions and is an AVN Hall of Fame inductee. Skye has been directing adult films since the late 1990s and has over 300 movie credits as director.\n\nSkye Blue started dancing in 1988 in Las Vegas at the Palomino Club. She was actually the DJ and light tech. On a dare, Skye got up to do the amateur contest and won, going from behind the lights to center stage. She attended her first AVN Show in 1991 and met several people in the adult movie industry and her career began as a porn actress. Skye’s first video was Love & The Dancer Too, after which she went on to do over 100 other adult films in the course of her career, but she only ever performed in girl/girl or solo scenes.\n\nIn 1994, Skye Blue met with the newcomer adult film actress Summer Cummings, and the two became involved in a long term relationship, which lasted for a number of years. The two frequently performed on-camera together during that time as part of the duo \"Breast Wishes.\" She has also dabbled in mainstream feature films, and makes a cameo appearance with Summer Cummings in Paul Thomas Anderson's well-received 1997 film, Boogie Nights.",
        "birthday": "1967-07-30",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 138182,
        "imdb_id": "nm0089537",
        "known_for_department": "Directing",
        "name": "Skye Blue",
        "place_of_birth": "Morristown, New Jersey, USA",
        "popularity": 2.262,
        "profile_path": "/ufvOPzRFn36jVOGYd7bmSyBKYls.jpg"
    }
}