{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fzJgCQh2NBnUYlms8EGyr4bPNz3.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 900,
                "original_language": "en",
                "original_title": "Bringing Up Baby",
                "overview": "David Huxley is waiting to get a bone he needs for his museum collection. Through a series of strange circumstances, he meets Susan Vance, and the duo have a series of misadventures which include a leopard called Baby.",
                "popularity": 3.6146,
                "poster_path": "/vTNNOtemaYmtx3k2NpsLMRJKEwZ.jpg",
                "release_date": "1938-02-18",
                "title": "Bringing Up Baby",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 1022,
                "character": "Fritz Lehman",
                "credit_id": "52fe428ac3a36847f8026b61",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/nY103Y9P6yMgk4Vr7H0PHOpNf1Z.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 17887,
                "original_language": "en",
                "original_title": "Barefoot in the Park",
                "overview": "In this film based on a Neil Simon play, newlyweds Corie, a free spirit, and Paul Bratter, an uptight lawyer, share a sixth-floor apartment in Greenwich Village. Soon after their marriage, Corie tries to find a companion for mother, Ethel, who is now alone, and sets up Ethel with neighbor Victor. Inappropriate behavior on a double date causes conflict, and the young couple considers divorce.",
                "popularity": 5.5106,
                "poster_path": "/qh64tAOmbQNoYMLTETkhmBQgSbu.jpg",
                "release_date": "1967-05-25",
                "title": "Barefoot in the Park",
                "video": false,
                "vote_average": 7.125,
                "vote_count": 587,
                "character": "Restaurant Proprietor",
                "credit_id": "54b689249251414edc000065",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Fritz Feilchenfeld"
        ],
        "biography": "Fritz Feld was born on October 15, 1900 in Berlin, Germany as Fritz Feilchenfeld. He is known for his work on Bringing Up Baby (1938), Barefoot in the Park (1967) and Hello, Dolly! (1969). He was married to Virginia Christine. He died on November 18, 1993 in Los Angeles, California, USA.\n\nBorn in Berlin, Germany, Feld began his acting career in Germany in 1917, making his screen debut in Der Golem und die Tänzerin (The Golem and the Dancing Girl). Feld filmed the sound sequences of the Cecil B. DeMille film The Godless Girl, released by Pathé, without DeMille's supervision since DeMille had already broken his contract with Pathé, and signed with Metro-Goldwyn-Mayer.\n\nHe developed a characterization that came to define him. His trademark was to slap his mouth with the palm of his hand to create a \"pop!\" sound that indicated both his superiority and his annoyance. The first use of the \"pop\" sound was in If You Knew Susie.\n\nFeld often played the part of a maître d', but also a variety of aristocrats and eccentrics; his characters were indeterminately European, sometimes French and sometimes Belgian but always with his particular mannerisms. In the 1938 screwball comedy Bringing Up Baby he played the role of Dr. Lehman. In 1939 he appeared with the Marx Brothers in At The Circus in the small but memorable role of French orchestra conductor Jardinet. In one 1967 episode of The Man from U.N.C.L.E., \"The Napoleon's Tomb Affair\", Feld played a banker, a beatnik, a diplomat and a waiter. The episode also featured Ted Cassidy from The Addams Family. In his later years, Feld appeared in several Walt Disney films and also played an uncharacteristically dramatic role in Barfly. In addition to films, he acted in numerous television series in guest roles, including the recurring role of \"Zumdish\", the manager of the intergalactic Celestial Department Store on Lost In Space, in two Season 2 episodes, The Android Machine and The Toymaker. Zumdish returned in the Season 3 episode Two Weeks In Space, where he has been brainwashed by bank robbers into believing he is a tour director taking the robbers on holiday. He also portrayed one of the Harmonia Gardens waiters in the movie Hello Dolly!\n\nFeld made his final film appearance in 1989.",
        "birthday": "1900-10-14",
        "deathday": "1993-11-18",
        "gender": 2,
        "homepage": null,
        "id": 13821,
        "imdb_id": "nm0270915",
        "known_for_department": "Acting",
        "name": "Fritz Feld",
        "place_of_birth": "Berlin, Germany",
        "popularity": 0.3302,
        "profile_path": "/yVT0Gv9O4K9UHU8jBx8D01lZjYZ.jpg"
    }
}