{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fzJgCQh2NBnUYlms8EGyr4bPNz3.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 900,
                "original_language": "en",
                "original_title": "Bringing Up Baby",
                "overview": "David Huxley is waiting to get a bone he needs for his museum collection. Through a series of strange circumstances, he meets Susan Vance, and the duo have a series of misadventures which include a leopard called Baby.",
                "popularity": 3.6146,
                "poster_path": "/vTNNOtemaYmtx3k2NpsLMRJKEwZ.jpg",
                "release_date": "1938-02-18",
                "title": "Bringing Up Baby",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 1022,
                "character": "Aloysius Gogarty",
                "credit_id": "52fe428ac3a36847f8026b59",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/5vuQnRJURp6rZoEEnhW0HC7DBQc.jpg",
                "genre_ids": [
                    10749,
                    35,
                    18
                ],
                "id": 3109,
                "original_language": "en",
                "original_title": "The Quiet Man",
                "overview": "An American man returns to the village of his birth in Ireland, where he finds love and conflict.",
                "popularity": 2.5225,
                "poster_path": "/u3B1hVKHE56yBRoxF3Nk9uxHdYN.jpg",
                "release_date": "1952-07-21",
                "title": "The Quiet Man",
                "video": false,
                "vote_average": 7.321,
                "vote_count": 564,
                "character": "Michaleen Oge Flynn",
                "credit_id": "52fe4387c3a36847f805b0cf",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "William Joseph Shields",
            "Барри Фитцджеральд"
        ],
        "biography": "Brother of actor Arthur Shields, with whom he performed in several films, most notably John Ford's The Quiet Man (1952). One of the very few character actors ever to achieve star status.\n\nFitzgerald was the only player ever nominated for the Academy Award for both Best Actor and Best Supporting Actor in the same year for the same role. The recognition was for Going My Way (1944). After he received this double nomination, the Academy immediately changed their rules to prevent this from happening again, rules which have remained unchanged to this day.\n\nOne of Hollywood's finest character actors and most accomplished scene  stealers, Barry Fitzgerald was born William Joseph Shields in 1888 in  Dublin, Ireland. Educated to enter the banking business, the diminutive  Irishman with the irresistible brogue was bitten by the acting bug in  the 1920s and joined Dublin's world-famous Abbey Players. He  subsequently starred in the Abbey Theatre production of Sean O'Casey's Juno And The Paycock, a role that he recreated in his film debut for director Alfred Hitchcock in 1930. He was coaxed to the U.S. in 1935 by John Ford to appear in Ford's film adaptation of another O'Casey masterpiece, The Plough and the Stars (1936). Fitzgerald took up residence in Hollywood and went on to give outstanding performances in such films as The Long Voyage Home (1940), How Green Was My Valley (1941), None But the Lonely Heart (1944), And Then There Were None (1945), Two Years Before the Mast (1946) and what is probably the role for which he is most fondly remembered, The Quiet Man (1952). He won the Academy Award For Best Supporting Actor for his portrayal of gruff, aging Father Fitzgibbon in Going My Way  (1944). He was also nominated for the Best Actor Oscar for the same  role and was the only actor to ever be so honored. Barry Fitzgerald died  in his beloved Dublin in 1961.",
        "birthday": "1888-03-09",
        "deathday": "1961-01-14",
        "gender": 2,
        "homepage": null,
        "id": 13820,
        "imdb_id": "nm0280178",
        "known_for_department": "Acting",
        "name": "Barry Fitzgerald",
        "place_of_birth": "Dublin, Ireland",
        "popularity": 0.2667,
        "profile_path": "/z8opHNghuygzMWsVOpG1Ln3ahmG.jpg"
    }
}