{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kb2FuXGruaPA6ErjOpcifpCyPyY.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 11287,
                "original_language": "en",
                "original_title": "A League of Their Own",
                "overview": "As America's stock of athletic young men is depleted during World War II, a professional all-female baseball league springs up in the Midwest, funded by publicity-hungry candy maker Walter Harvey. Competitive sisters Dottie Hinson and Kit Keller spar with each other, scout Ernie Capadino and grumpy has-been coach Jimmy Dugan on their way to fame.",
                "popularity": 4.1677,
                "poster_path": "/7xpFXAOjgzFPE3vyVerFGfrXhFK.jpg",
                "release_date": "1992-07-01",
                "title": "A League of Their Own",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 1461,
                "character": "Alice Gaspers (LF/C)",
                "credit_id": "52fe441f9251416c75029817",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Renée Coleman (born January 8, 1962) is a Canadian actress who has appeared in several TV shows and movies. She is best known for her role in the NBC TV series Quantum Leap, in which she played the role of Alia, the \"evil leaper.\" Coleman is also known for her role in the 1992 box office hit A League of Their Own as left-fielder and substitute catcher Alice Gaspers,[1] and in Who's Harry Crumb?, as kidnapping-victim Jennifer Downing. Coleman appeared in several more films through the mid-'90s, including Pentathlon (one of her last domestic roles), the Mexican film El Jardín del Edén (1994), the Polish film Gracze (1995), and the Swiss film Waiting for Michelangelo (1995). In 1995, Coleman left the film business and returned to school, where she earned her Mythological Studies doctorate (with an emphasis on Depth Psychology) at Pacifica Graduate Institute in 2002. She currently lives with her husband and their four children in Santa Clarita, California, where she works in a private practice as a certified DreamTender. In August 2012, Coleman's first book, Icons of a Dreaming Heart - The Art and Practice of Dream-Centered Living, was published.",
        "birthday": "1962-01-08",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 138241,
        "imdb_id": "nm0171187",
        "known_for_department": "Acting",
        "name": "Renée Coleman",
        "place_of_birth": "Saskatoon, Saskatchewan, Canada",
        "popularity": 0.1181,
        "profile_path": "/nQGUAn6SWOXVROGVvgUfAFUvsPX.jpg"
    }
}