{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/51UDa3IuGyiKGe2MgMcLGvJE2Fm.jpg",
                "genre_ids": [
                    53,
                    80,
                    18
                ],
                "id": 1213,
                "original_language": "en",
                "original_title": "The Talented Mr. Ripley",
                "overview": "Tom Ripley is a calculating young man who believes it's better to be a fake somebody than a real nobody. Opportunity knocks in the form of a wealthy U.S. shipbuilder who hires Tom to travel to Italy to bring back his playboy son, Dickie. Ripley worms his way into the idyllic lives of Dickie and his girlfriend, plunging into a daring scheme of duplicity, lies and murder.",
                "popularity": 5.7442,
                "poster_path": "/6ojHgqtIR41O2qLKa7LFUVj0cZa.jpg",
                "release_date": "1999-12-25",
                "title": "The Talented Mr. Ripley",
                "video": false,
                "vote_average": 7.195,
                "vote_count": 3935,
                "character": "Cornet (San Remo Jazz Sextet)",
                "credit_id": "545a96e6c3a36825f9000ac8",
                "order": 40
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Byron Wallen is \"one of the most innovative, exciting and original trumpet players alive\" (Jazzwise Magazine). Widely recognised as a seminal figure in world jazz, he is constantly travelling the world recording, teaching and performing. “Byron's always absorbing music genuinely draws in the disparate elements of African and Eastern cultures, while retaining true jazz spirit … ” Byron was raised in a musical environment and started learning his first instrument, the piano, at an early age. He then went on to study the trumpet with Jimmy Owens, Donald Byrd and Jon Faddis in New York. His early music career was forged while he was studying for a degree in Psychology, Philosophy and Maths at Sussex University (he graduated in 1992). During this period he recorded for Loose Ends and Cleveland Watkiss, and played trumpet with the likes of Mervyn Africa, The Style Council, Charles Earland, Courtney Pine and Jean Toussaint.",
        "birthday": "1969-07-17",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.byronwallen.co.uk",
        "id": 1382124,
        "imdb_id": "nm0908981",
        "known_for_department": "Acting",
        "name": "Byron Wallen",
        "place_of_birth": "London, England, UK",
        "popularity": 0.0071,
        "profile_path": null
    }
}