{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/eVHVwP71el20fofkCHo78ebQv7Q.jpg",
                "genre_ids": [
                    28,
                    12,
                    35,
                    80
                ],
                "id": 343668,
                "original_language": "en",
                "original_title": "Kingsman: The Golden Circle",
                "overview": "When an attack on the Kingsman headquarters takes place and a new villain rises, Eggsy and Merlin are forced to work together with the American agency known as the Statesman to save the world.",
                "popularity": 6.4548,
                "poster_path": "/34xBL6BXNYFqtHO9zhcgoakS4aP.jpg",
                "release_date": "2017-09-20",
                "title": "Kingsman: The Golden Circle",
                "video": false,
                "vote_average": 6.954,
                "vote_count": 10748,
                "character": "Hotel Receptionist",
                "credit_id": "5f9fc64d7614210035f3524b",
                "order": 26
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Grant Gillespie’s an actor, novelist, and screenwriter living in the West End of London.\n\nOnscreen, he’s appeared in numerous productions, including: Kingsman 2, Florence Foster Jenkins, Will, Catastrophe, Siblings, The Crown, George Gently, Victoria and Cast Offs. On stage, he’s worked with the celebrated directors Jamie Lloyd, Michael Grandage, Stephen Unwin and Erica Whyman. He’s done MOCAP work at The Imaginarium (Squadron 42) and voices for computer games Bloodborne and Dark Souls.\n\nHis novel, The Cuckoo Boy, was described as ‘an emotionally visceral debut’ (Guardian). ‘Through James and David, Gillespie explores the chasm between how children and adults perceive the world, and the devastating consequences of falling through this gap. The Cuckoo Boy is a savage indictment of hypocrisy and forced social convention.’ (Observer). His short story, The Upper Hand, published by Simon Schuster (in He Played For His Wife and Other Stories) also features Poet Laureate, Carol Ann Duffy.\n\nGrant also writes screen/theatre and radio plays. Harvest – co-written with Kate Ashfield – is on the slate at Kate Lewis and Julia Walsh’s production company, Neon Ink.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "http://grantgillespie.com",
        "id": 1383570,
        "imdb_id": "nm0318937",
        "known_for_department": "Acting",
        "name": "Grant Gillespie",
        "place_of_birth": null,
        "popularity": 0.0502,
        "profile_path": "/sAwlRgxHgcDqC7dGDaaxVlAa65q.jpg"
    }
}