{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xS0rl1YrVt51ztzjRf6qoIPZ7TA.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 542178,
                "original_language": "en",
                "original_title": "The French Dispatch",
                "overview": "The staff of an American magazine based in France puts out its last issue, with stories featuring an artist sentenced to life imprisonment, student riots, and a kidnapping resolved by a chef.",
                "popularity": 4.9015,
                "poster_path": "/6JXR3KJH5roiBCjWFt09xfgxHZc.jpg",
                "release_date": "2021-10-21",
                "title": "The French Dispatch",
                "video": false,
                "vote_average": 7.026,
                "vote_count": 2787,
                "character": "Communications Specialist",
                "credit_id": "5e4459d3596a91001501af96",
                "order": 29
            },
            {
                "adult": false,
                "backdrop_path": "/ks3WTeuEaenmMiizxXba65Rxpu1.jpg",
                "genre_ids": [
                    80,
                    18,
                    53
                ],
                "id": 823951,
                "original_language": "fr",
                "original_title": "Novembre",
                "overview": "In November 2015, a series of unprecedented and deadly attacks hits Paris. The anti-terrorist police led by Heloise and her chief commander Fred - face an unprecedented level of pressure: in a race against the clock, they must find the perpetrators of the attacks as quickly as possible before they can strike again, travelling across Europe and beyond in one of the biggest manhunts in history.",
                "popularity": 3.0414,
                "poster_path": "/A5wae5M81jLTuv3WbCJfORxapRA.jpg",
                "release_date": "2022-10-05",
                "title": "November",
                "video": false,
                "vote_average": 7.071,
                "vote_count": 823,
                "character": "Djibril",
                "credit_id": "6120d2be2dc44e007e52c6cc",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "斯特凡纳·巴克"
        ],
        "biography": "Stéphane Bak (born 19 September 1996) is a Franco-Congolese actor and comedian. He was showcased as \"The youngest comedian in France,\" in 2012. As an actor his most notable film roles include Christopher Barratier's Team Spirit, David Moreau's Alone, and Paul Verhoeven’s award-winning Elle. More recently, Bak has starred in André Téchiné’s Farewell to the Night and Joël Karekezi’s The Mercy of the Jungle.\n\nBak was born in Le Blanc-Mesnil, Seine-Saint-Denis. Bak is of Congolese origin; his father is a delivery driver and his mother is a receptionist, and he has four brothers and sisters. In 2011, he was expelled from high school and forced to take correspondence courses. He was authorised by the French Department of Social Affairs to start working at the age of 14.\n\nBak started his career as a stand-up comedian in December 2010, performing in the small clubs of Paris, most notably at Le Palace and at Théâtre Trévise.\n\nIn 2011, he participated in the Montreux Comedy Festival alongside the comedic duo Les Chevaliers du fiel. In September 2012, he performed at Grand Rex as part of the evening \"Rire ensemble contre le racisme\", broadcast on France 2 in prime time before two million viewers. He also appeared at Casino de Paris for \"Le Concert solidaire\" organized in September 2012 for the 30th anniversary of the organization Handicap International.\n\nSpotted by the creators of the show Bref who took him under their wing, he participated in the episode \"Bref. J'ai eu 30 ans\", alongside Kyan Khojandi. In 2013, he played the part of a dealer in the film Les gamins; he also appeared in Pierre-François Martin-Laval, Serial Teachers.\n\nBak has participated in several television shows. During the 2012 Cannes Film Festival, he intervened every day to present a minisketch for the show Grand Journal of Canal+.\n\nIn 2014, he had a segment in the show L'Émission pour tous presented by Laurent Ruquier on France 2. That same year he played the role of Max in Once in a Lifetime. He is the main actor of the music video The Girl Is Mine by 99 Souls featuring Destiny's Child and Brandy. Released in November 2015, the video was nominated at the 2016 MTV Video Music Awards in the \"Best Electronic Video\" category.\n\nIn 2016, he appeared as Omar in Paul Verhoeven's Elle, and as Jules in Christophe Barratier's Team Spirit. In 2017, he played Dodji in David Moreau's Alone.\n\nIn 2018, Bak had his first lead role as Private Faustin, in Joel Karekezi's The Mercy of the Jungle, which had its debut at the Toronto International Film Festival on September 8. Bak was selected as one of eight rising stars at the festival, through the yearly \"TIFF Rising Star\" programme. He also voiced Miles Morales / Spider-Man for the French dub of Peter Ramsey's Spider-Man: Into the Spider-Verse.\n\nIn 2019, he appeared as Bilal in André Téchiné's drama Farewell to the Night, which premiered at the Berlin International Film Festival on 12 February. That same year Bak starred alongside Fionn Whitehead in Sebastian Schipper's film Roads, which was previously known as Caravan. The film had its world premiere at the 2019 Tribeca Film Festival.\n\nSource: Article \"Stéphane Bak\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1996-09-10",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1383898,
        "imdb_id": "nm5255211",
        "known_for_department": "Acting",
        "name": "Stéphane Bak",
        "place_of_birth": "Le Blanc-Mesnil, Seine-Saint-Denis, France",
        "popularity": 0.1355,
        "profile_path": "/eDiflbTzXwkjVO5F8rQT17exIE3.jpg"
    }
}