{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ke3lanTAgCqPMpOyutIfXzYih2s.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 266856,
                "original_language": "en",
                "original_title": "The Theory of Everything",
                "overview": "The Theory of Everything is the extraordinary story of one of the world’s greatest living minds, the renowned astrophysicist Stephen Hawking, who falls deeply in love with fellow Cambridge student Jane Wilde.",
                "popularity": 6.154,
                "poster_path": "/kJuL37NTE51zVP3eG5aGMyKAIlh.jpg",
                "release_date": "2014-11-07",
                "title": "The Theory of Everything",
                "video": false,
                "vote_average": 7.839,
                "vote_count": 10824,
                "character": "Swiss Doctor",
                "credit_id": "5550743492514161b3000934",
                "order": 37
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Franck Leboeuf"
        ],
        "biography": "Franck Alain James Leboeuf (born 22 January 1968), typically anglicised as Frank Leboeuf, is a French actor, sports commentator and former footballer who played as a centre-back. With the France national team, Leboeuf won the 1998 FIFA World Cup and 2000 European Championship as well as a number of domestic trophies, most famously during his five years at Chelsea. Since the conclusion of his playing career, Leboeuf has transitioned to acting, appearing in stage and film productions.\n\nLeboeuf was born in Marseille and raised in Saint-Cyr-sur-Mer. He was introduced to football by his father, a former Rennes coach, who trained children in the sport. After starting his career in 1986 in the lower divisions of the French leagues, Leboeuf moved to Laval in 1988. In 1991, he moved to Strasbourg and played there until 1996, when he made a switch to English club Chelsea for £2.5m.\n\nHe played over 200 games for the club and scored 24 goals, mainly from penalties and set pieces. With Chelsea, he won two FA Cups, one League Cup and one Cup Winners' Cup. He left in 2001 for club Marseille, before finishing out his career in Qatar. Despite his numerous accolades, Leboeuf never won a first-division title in Europe or the UEFA Champions League.\n\nFor France, Leboeuf was capped 50 times, scoring four goals. His first two came on 6 September 1995 in a Euro 96 qualifier at home to Azerbaijan, contributing to a 10–0 win that remains France's record. Although he was mainly a substitute in the 1998 World Cup (Played 3, Started 2, DNP 4), he stepped in for red carded Laurent Blanc to play in the final, a 3–0 win against Brazil, a match in which he man-marked the highly rated striker Ronaldo.\n\nIn a Euro 2000 qualifier on 9 June 1999, Leboeuf scored the only goal from the penalty spot with five minutes to go as world champions France struggled away to amateurs Andorra. He received a winner's medal at the finals in Belgium and the Netherlands, though Blanc and Marcel Desailly were the preferred defensive partnership, including in the final.\n\nHe scored a late winner against co-hosts South Korea on 26 May ahead of the 2002 FIFA World Cup (3–2). Holders France were eliminated in the group stage in a shock, and he retired from the team.\n\nA cultured centre-back, Leboeuf was noted for his long range passing ability and also for his consistent penalty-taking throughout his career. He took 15 penalties in competitive games for Chelsea, missing just 2 times.\n\nIn 2001, whilst still playing football for Chelsea, Leboeuf had made his first acting appearance in the film Taking Sides.\n\nFollowing his retirement from competitive football, Leboeuf spent two years living in Los Angeles. During this time he played for amateur team Hollywood United, alongside celebrity team-mates such as Vinnie Jones, Steve Jones and Anthony LaPaglia. Leboeuf studied at the Lee Strasberg Institute in West Hollywood, keeping a low profile, and won his first acting work as a TV commentator, for a pay cheque totalling $100, which he keeps as a memento. ...\n\nSource: Article \"Frank Leboeuf\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1968-01-22",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1384501,
        "imdb_id": "nm0495797",
        "known_for_department": "Acting",
        "name": "Frank Lebœuf",
        "place_of_birth": "Marseille, Bouches-du-Rhône, France",
        "popularity": 0.1214,
        "profile_path": "/tC4l4Ig9NvHd12NKvXiZpKDPdAk.jpg"
    }
}