{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/Ma7mQsldFCaQpsZbm8zolgLfmV.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749
                ],
                "id": 901,
                "original_language": "en",
                "original_title": "City Lights",
                "overview": "A tramp falls in love with a beautiful blind flower girl. His on-and-off friendship with a wealthy man allows him to be the girl's benefactor and suitor.",
                "popularity": 3.4158,
                "poster_path": "/ugmakEL5y294I5bXgiBqApuZpwc.jpg",
                "release_date": "1931-02-06",
                "title": "City Lights",
                "video": false,
                "vote_average": 8.265,
                "vote_count": 2318,
                "character": "A Blind Girl",
                "credit_id": "52fe428ac3a36847f8026bd9",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "​From Wikipedia, the free encyclopedia.  \n\nVirginia Cherrill (April 12, 1908 - November 14, 1996) was an American actress best known for her role as the blind flower girl in Charlie Chaplin's City Lights (1931). She married an English earl in the 1940s, and is also known as Virginia Child-Villiers, Countess of Jersey. Virginia Cherrill was born on a farm in rural Carthage, Illinois, to James E. and Blanche (née Wilcox) Cherrill. She was a Chicago society girl with no thoughts of a film career when she went to Hollywood for a visit and met Charlie Chaplin when he sat next to her at a boxing match. He had failed to find the girl he wanted for his film but decided she would do and cast her in City Lights in which she gave the performance for which she is remembered, although her working relationship with Chaplin on the film was often strained. As indicated in the documentary Unknown Chaplin, Cherrill was in fact fired from the film at one point and Chaplin planned to refilm all her scenes with Georgia Hale, but ultimately realized too much money had already been spent on the picture; as Cherrill recalls in the documentary, close friend Marion Davies suggested Cherrill hold out for more money when Chaplin asked her to return to the film, and she did. She appeared in a few other films subsequently, including the 1931 Gershwin musical Delicious with Janet Gaynor, but gave up her movie career in 1936 after Troubled Waters. Cherrill married four times; her second husband was actor Cary Grant (from 1934 to 1935), and her third was George Child-Villiers, 9th Earl of Jersey (from 1937 to 1946). Her longest marriage was to Florian Martini, with whom she lived in Santa Barbara, California from 1948 until her death at age 88; she had no children. She is a part of stars of Hollywood Walk of Fame in 1545 Vine Street.\n\nDescription above from the Wikipedia article Virginia Cherrill   licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1908-04-12",
        "deathday": "1996-11-14",
        "gender": 1,
        "homepage": null,
        "id": 13852,
        "imdb_id": "nm0156039",
        "known_for_department": "Acting",
        "name": "Virginia Cherrill",
        "place_of_birth": "Carthage, Illinois, USA",
        "popularity": 0.9975,
        "profile_path": "/dUesDEOkQGsCK0FXQSjRW6QayMw.jpg"
    }
}