{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4i3Amppd6eW5Qkhjv4gdHk3CCoE.jpg",
                "genre_ids": [
                    36,
                    10402,
                    18
                ],
                "id": 279,
                "original_language": "en",
                "original_title": "Amadeus",
                "overview": "Disciplined Italian composer Antonio Salieri becomes consumed by jealousy and resentment towards the hedonistic and remarkably talented young Salzburger composer Wolfgang Amadeus Mozart.",
                "popularity": 5.9174,
                "poster_path": "/1n5VUlCqgmVax1adxGZm8oCFaKc.jpg",
                "release_date": "1984-09-19",
                "title": "Amadeus",
                "video": false,
                "vote_average": 8.026,
                "vote_count": 4488,
                "character": "Queen of the Night in 'The Magic Flute' (singing voice)",
                "credit_id": "57d1914fc3a3684b3e009033",
                "order": 58
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "June Anderson is a Grammy Award-winning American coloratura soprano. Originally known for bel canto performances of Rossini, Donizetti, and Vincenzo Bellini, she was the first non-Italian ever to win the prestigious Bellini d'Oro prize. Subsequently, she has extended her repertoire to include a wide variety of other roles, including those from the Russian repertoire and works by Richard Strauss. In 2008, Anderson was elevated to \"Commandeur\" of the Ordre des Arts et des Lettres by the French Government and in 2007 received a \"Victoire d'honneur\" at the \"Victoires de la Musique Classique\" in Paris.\n\nAnderson has performed in noted opera houses including La Scala, Covent Garden, La Fenice, Metropolitan Opera, San Francisco Opera, Lyric Opera of Chicago and Colón Theater. She has collaborated with conductors Leonard Bernstein, James Levine, Charles Dutoit, Zubin Mehta, Riccardo Muti, Seiji Ozawa, Giuseppe Sinopoli, Kent Nagano and Michael Tilson Thomas, and has sung opposite Luciano Pavarotti, Alfredo Kraus, Plácido Domingo, José Carreras, Carlo Bergonzi, Roberto Alagna, Rockwell Blake, Jerry Hadley and Salvatore Fisichella. Anderson has had an extensive recording career, dating from the 1980s to the present.",
        "birthday": "1952-12-30",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1386029,
        "imdb_id": "nm0026984",
        "known_for_department": "Acting",
        "name": "June Anderson",
        "place_of_birth": "Boston, Massachusetts, USA",
        "popularity": 0.1283,
        "profile_path": null
    }
}