{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/t35dVtLN4H12XXtipJfIDEy2h7Y.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 3291,
                "original_language": "en",
                "original_title": "Good Night, and Good Luck.",
                "overview": "The story of journalist Edward R. Murrow's stand against Senator Joseph McCarthy's anti-communist witch-hunts in the early 1950s.",
                "popularity": 1.882,
                "poster_path": "/w4QSEno2xxHqMtSr3mPUhJpO3F2.jpg",
                "release_date": "2005-09-16",
                "title": "Good Night, and Good Luck.",
                "video": false,
                "vote_average": 7.078,
                "vote_count": 1044,
                "character": "Self (archive footage) (uncredited)",
                "credit_id": "63c7fce570b44400e95a2d15",
                "order": 41
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Joseph Raymond McCarthy",
            "Джозеф Рэймонд Маккарти",
            "Джозеф Маккарти"
        ],
        "biography": "Joseph Raymond McCarthy (November 14, 1908 – May 2, 1957) was an American politician who served as a Republican U.S. Senator from the state of Wisconsin from 1947 until his death at age 48 in 1957. Beginning in 1950, McCarthy became the most visible public face of a period in the United States in which Cold War tensions fueled fears of widespread communist subversion. He alleged that numerous communists and Soviet spies and sympathizers had infiltrated the United States federal government, universities, film industry, and elsewhere. Ultimately he was censured by the Senate in 1954 for refusing to cooperate with and abusing members of the committee established to investigate whether or not he should be censured. The term \"McCarthyism\", coined in 1950 in reference to McCarthy's practices, was soon applied to similar anti-communist activities. Today the term is used more broadly to mean demagogic, reckless, and unsubstantiated accusations, as well as public attacks on the character or patriotism of political opponents.",
        "birthday": "1908-11-14",
        "deathday": "1957-05-02",
        "gender": 2,
        "homepage": null,
        "id": 1386798,
        "imdb_id": "nm0565191",
        "known_for_department": "Acting",
        "name": "Joseph McCarthy",
        "place_of_birth": "Grand Chute, Wisconsin, USA",
        "popularity": 0.072,
        "profile_path": "/wvTdKOIOmAXDLXG636BCorLh5kj.jpg"
    }
}