{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/76J14zgwVWyOciri7X7F3DGP3TA.jpg",
                "genre_ids": [
                    27,
                    878,
                    53
                ],
                "id": 5876,
                "original_language": "en",
                "original_title": "The Mist",
                "overview": "After a violent storm, a dense cloud of mist envelops a small Maine town, trapping David Drayton and his five-year-old son in a local grocery store with other local residents. They soon discover that the mist conceals deadly horrors that threaten their lives, and worse, their sanity.",
                "popularity": 5.3978,
                "poster_path": "/1CvJ6diBACKPVGOpcWuY4XPQdqX.jpg",
                "release_date": "2007-11-21",
                "title": "The Mist",
                "video": false,
                "vote_average": 6.939,
                "vote_count": 5524,
                "character": "Screaming Woman",
                "credit_id": "56bcca3ec3a36860e4003cf1",
                "order": 33
            },
            {
                "adult": false,
                "backdrop_path": "/6M2IeELPSKZZ4iAPz2w0i7wdm6X.jpg",
                "genre_ids": [
                    80,
                    53
                ],
                "id": 3432,
                "original_language": "en",
                "original_title": "Mr. Brooks",
                "overview": "A psychological thriller about a man who is sometimes controlled by his murder-and-mayhem-loving alter ego.",
                "popularity": 2.5607,
                "poster_path": "/yYleq0qmb67Ig2ViY3hFmUOrH77.jpg",
                "release_date": "2007-05-31",
                "title": "Mr. Brooks",
                "video": false,
                "vote_average": 6.935,
                "vote_count": 1774,
                "character": "Police Officer",
                "credit_id": "5e1e0730e194b00016ba9446",
                "order": 30
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Dodie Brown, an American actress hailing from Louisiana, is the youngest among her three siblings. From a tender age, her passion for the arts was evident, particularly when she performed in musicals such as \"Oklahoma,\" \"Oliver,\" and \"The Music Man\" with the Richland Players Theatre Group. Dodie completed her education at Northeast Louisiana University in 1994 and cheered both for her university and the Shreveport Mudbugs professional hockey team. In a notable moment in 2006, she was cast by Director Frank Darabont for Stephen King's \"The Mist\", sharing the screen with her then six-year-old daughter, Taylor. Dodie's acting career has been thriving, especially in the Southeast. Besides acting, she has a penchant for coaching, casting, and producing. Her ability to wholly immerse herself in her roles is a hallmark of her talent. In the personal realm, Dodie tied the knot with Dr. Alan Brown in 1998, and they are proud parents to two daughters, Taylor and Gabrielle. Outside her professional sphere, she cherishes family moments, globetrotting, and indulging in gardening.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 138608,
        "imdb_id": "nm2281637",
        "known_for_department": "Acting",
        "name": "Dodie Brown",
        "place_of_birth": "Louisiana, USA",
        "popularity": 1.2357,
        "profile_path": "/lrVWeHuliFgT8YbZlseuMynMw0n.jpg"
    }
}