{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9TDi0FPOSAePfVLZXAUgFZhiMLf.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 903,
                "original_language": "en",
                "original_title": "Cool Hand Luke",
                "overview": "When petty criminal Luke Jackson is sentenced to two years in a Florida prison farm, he doesn't play by the rules of either the sadistic warden or the yard's resident heavy, Dragline, who ends up admiring the new guy's unbreakable will. Luke's bravado, even in the face of repeated stints in the prison's dreaded solitary confinement cell, \"the box,\" make him a rebel hero to his fellow convicts and a thorn in the side of the prison officers.",
                "popularity": 2.5158,
                "poster_path": "/4ykzTiHKLamh3eZJ8orVICtU2Jp.jpg",
                "release_date": "1967-11-01",
                "title": "Cool Hand Luke",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 1506,
                "character": "Koko",
                "credit_id": "52fe428ac3a36847f8026dc7",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia.  Lou Antonio (born January 23, 1934) is an American actor and TV director best known for performing in the films Cool Hand Luke and America, America. He also starred in two short-lived TV series, Dog and Cat, and Makin' It.  Antonio's only recurring TV guest role character was on Here Come the Brides, but he made multiple appearances as different characters on 1960s and 1970s series like The Rookies, Mission: Impossible, Gunsmoke, The Fugitive, Twelve O'Clock High, Star Trek (in the memorable episode \"Let That Be Your Last Battlefield\", in which he played the half-white, half-black alien pursued by the oppositely half-black, half-white alien played by Frank Gorshin), I Dream of Jeannie, and The Defenders. Antonio also played the human version of a chimpanzee turned human on an episode of the supernatural sitcom Bewitched.  As a director, he has mostly worked on TV movies such as Mayflower Madam, and TV series such as The Rockford Files, Dawson's Creek, CSI: Crime Scene Investigation, and The West Wing.  Antonio was married to fellow actor Lane Bradbury, and his brother, Jim Antonio, is also an actor. He was born in Oklahoma City, Oklahoma, U.S..  Description above from the Wikipedia article Lou Antonio, licensed under CC-BY-SA, full list of contributors on Wikipedia.​",
        "birthday": "1934-01-23",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 13871,
        "imdb_id": "nm0031398",
        "known_for_department": "Directing",
        "name": "Lou Antonio",
        "place_of_birth": null,
        "popularity": 0.3963,
        "profile_path": "/haFl4RA0SBghwq7uf9qpF3jbqRj.jpg"
    }
}