{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9TDi0FPOSAePfVLZXAUgFZhiMLf.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 903,
                "original_language": "en",
                "original_title": "Cool Hand Luke",
                "overview": "When petty criminal Luke Jackson is sentenced to two years in a Florida prison farm, he doesn't play by the rules of either the sadistic warden or the yard's resident heavy, Dragline, who ends up admiring the new guy's unbreakable will. Luke's bravado, even in the face of repeated stints in the prison's dreaded solitary confinement cell, \"the box,\" make him a rebel hero to his fellow convicts and a thorn in the side of the prison officers.",
                "popularity": 2.5158,
                "poster_path": "/4ykzTiHKLamh3eZJ8orVICtU2Jp.jpg",
                "release_date": "1967-11-01",
                "title": "Cool Hand Luke",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 1506,
                "character": "Loudmouth Steve",
                "credit_id": "52fe428ac3a36847f8026dcb",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "​From Wikipedia, the free encyclopedia.  \n\nRobert Drivas (November 21, 1938 – June 29, 1986) was an American actor and theatre director.\n\nDrivas was born Robert Choromokos in Chicago, Illinois, the son of Hariklia (née Cunningham-Wright) and James Peter Choromokos. Drivas studied at the University of Chicago and the University of Miami. After further training at the Greek Playhouse in Athens, Greece and with the Coconut Grove Playhouse in Miami Beach, he made his New York City debut in the role of Rameses in 1958 in the play The Firstborn, starring Anthony Quayle as Moses. He continued to perform on stage with One More River (1960), The Wall (1960), The Irregular Verb to Love (1963), and And Things That Go Bump in the Night (1965), which he also directed. In 1963 he won a Theatre World Award for his performance in Mrs. Dally Has a Lover (opposite Estelle Parsons).\n\nDrivas was associated with many well-known theatrical figures of his time. These included playwrights Terrence McNally, whose play The Ritz he directed in 1975, and Edward Albee, who directed Drivas in the 1983 premiere of Albee's harshly received play The Man Who Had Three Arms. Other directing credits include Bad Habits, for which he won an Obie Award, Legend, Cheaters, It Had to Be You, a revival of the musical Little Me, and Peg, a musical biography of songstress Peggy Lee, with lyrics and book by the star herself.\n\nConcurrent with his theater work, Drivas appeared in television, beginning in 1958, on such crime shows and dramas as Route 66, N.Y.P.D., The Defenders, The Fugitive, 12 O-Clock High (TV series), and The F.B.I..\n\nDrivas' first theatrical film appearance was in the role of \"Loudmouth Steve\" in the classic prison drama Cool Hand Luke (1967). This debut led to more film work, in The Illustrated Man (1969) and Where It's At (1969).\n\nDescription above from the Wikipedia article Robert Drivas, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1938-11-21",
        "deathday": "1986-06-29",
        "gender": 2,
        "homepage": null,
        "id": 13872,
        "imdb_id": "nm0238105",
        "known_for_department": "Acting",
        "name": "Robert Drivas",
        "place_of_birth": "Chicago, Illinois, U.S.",
        "popularity": 0.1114,
        "profile_path": "/bi1ivZ8DphZRk11MT614ovekmUE.jpg"
    }
}