{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mgDv2dDihyetAcENxyf2tpXY245.jpg",
                "genre_ids": [
                    10402,
                    18
                ],
                "id": 1407,
                "original_language": "fr",
                "original_title": "La Môme",
                "overview": "From the mean streets of the Belleville district of Paris to the dazzling limelight of New York's most famous concert halls, Edith Piaf's life was a constant battle to sing and survive, to live and love. Raised in her grandmother's brothel, Piaf was discovered in 1935 by nightclub owner Louis Leplee, who persuaded her to sing despite her extreme nervousness. Piaf became one of France's immortal icons, her voice one of the indelible signatures of the 20th century.",
                "popularity": 2.9969,
                "poster_path": "/3b9DAONAsFRhJKu25R33PE3VwDh.jpg",
                "release_date": "2007-02-14",
                "title": "La Vie en Rose",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 1667,
                "character": "Street spectator",
                "credit_id": "5f08fae5d5ffcb00348685b1",
                "order": 72
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Po studiu herectví na JAMU v Brně (absolvoval v roce 1986) působil v letech 1986–91 v brněnském Divadle Na provázku, kde se výrazně podílel na řadě představení – hrál mimo jiné: Hraběte z Hvězdy v Katynce z Heilbronnu, Huga v Zahradní slavnosti, Poutníka v Labyrintu světa a Lusthausu srdce, Uie v Baletu makábr, Rašína v Rozrazilu, několik shakespearovských rolí vytvořil v inscenacích Shakespearománie I. a II., v Tanečních hodinách hrál postavu pojmenovanou On I. atd. Další jeho angažmá bylo v letech 1993–96 v pražském Činoherním klubu (z rolí např.: Andrew v Sexu noci svatojánské, Figaro ve Figarově svatbě, Liboveský ve Vodním družstvu, Aston ve Správcovi aj.). Jeho jméno se od tohoto období objevuje i v dalších divadlech, kde občas hostuje (Divadlo Archa, Viola, Divadlo v Řeznické, Divadlo v Dlouhé ad.). Členem činohry Národního divadla se stal v roce1999. Předcházelo tomu hostování ve dvou inscenacích (hrál Františka v adaptaci Hrubínovy Romance pro křídlovku a několik rolí v přepisu Hrabalovy prózy Obsluhoval jsem anglického krále). Z dalších rolí, které v Národním divadle nastudoval a hrál: titulní Shakespearův Hamlet, titulní Klicperův Hadrián z Římsů, Kníže Myškin v adaptaci Dostojevského Idiota, Kotrlý v Havlově Pokoušení, Pěstoun, Muž z baru a Číšník v benefici Luby Skořepové Prospaný život, Václav v Tylových Krvavých křtinách, Mistr Šimon v Molierově Lakomci, Kuťápka ve Šrámkových Zvonech, Bratr Lorenzo v Shakespearově Romeovi a Julii, Snake v Sheridanově Škole pomluv, Neprosil ve Štechově komedii David a Goliáš aj. V roce 2009 se rozhodl své angažmá v Národním divadle ukončit. V současném repertoáru činohry ND však ještě hraje Dobčinského v Gogolově Revizorovi, Prince, Loupežníka a Soba ve Sněhové královně (podle Andersena) Malého Charlese Aikena v Lettsově Srpnu v zemi indiánů, Dr. Hronce ve Stodolově Čaji u pana senátora a Muže s hůlkou v Čapkově Věci Makropulos. Má na svém kontě asi padesát filmových a televizních rolí (např. Největší z pierotů, Báječná léta pod psa aj.).",
        "birthday": "1962-05-02",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 138828,
        "imdb_id": "nm0419522",
        "known_for_department": "Acting",
        "name": "Vladimír Javorský",
        "place_of_birth": "Ostrava,  Czechoslovakia [now Czech Republic]",
        "popularity": 0.0618,
        "profile_path": "/i8o9nZHcRiwK9RVOKEMmaM8RILG.jpg"
    }
}