{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8YiAnbmo8ARHNVt25Cp5fVt4rNd.jpg",
                "genre_ids": [
                    99,
                    10402
                ],
                "id": 331781,
                "original_language": "en",
                "original_title": "Amy",
                "overview": "A documentary on the life of Amy Winehouse, the immensely talented yet doomed songstress. We see her from her teen years, where she already showed her singing abilities, to her finding success and then her downward spiral into alcoholism and drugs.",
                "popularity": 0.9667,
                "poster_path": "/qL0RepWSNUuZoeDXfyhqowVYhrn.jpg",
                "release_date": "2015-07-02",
                "title": "Amy",
                "video": false,
                "vote_average": 7.586,
                "vote_count": 1281,
                "character": "Self",
                "credit_id": "55885a12c3a368052f00071c",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/5TVSZotk3mjNjlDUQ1NBtO1Hu2H.jpg",
                "genre_ids": [
                    10402,
                    99
                ],
                "id": 472424,
                "original_language": "en",
                "original_title": "Gaga: Five Foot Two",
                "overview": "Follow pop provocateur Lady Gaga as she releases a new album, preps for her Super Bowl halftime show, and confronts physical and emotional struggles.",
                "popularity": 1.034,
                "poster_path": "/g0NONcnzzvWoASFjFoDqXZUW6SV.jpg",
                "release_date": "2017-09-21",
                "title": "Gaga: Five Foot Two",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 590,
                "character": "Self",
                "credit_id": "5baff7900e0a263a170076c9",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Tony Bennet ",
            "Anthony Dominick Benedetto ",
            "Joe Bari"
        ],
        "biography": "Anthony Dominick Benedetto (August 3, 1926 - July 21, 2023), known professionally as Tony Bennett, was an American singer of popular music, standards, show tunes, and jazz.\n\nRaised in New York City, Bennett began singing at an early age. He fought in the final stages of World War II as an infantryman with the U.S. Army in the European Theatre. Afterwards, he developed his singing technique, signed with Columbia Records, and had his first number one popular song with \"Because of You\" in 1951. Several top hits such as \"Rags to Riches\" followed in the early 1950s. Bennett then further refined his approach to encompass jazz singing. He reached an artistic peak in the late 1950s with albums such as The Beat of My Heart and Basie Swings, Bennett Sings. In 1962, Bennett recorded his signature song, \"I Left My Heart in San Francisco\". His career and his personal life then suffered an extended downturn during the height of the rock music era.\n\nBennett staged a remarkable comeback in the late 1980s and 1990s, putting out gold record albums again and expanding his audience to the MTV Generation while keeping his musical style intact. He remains a popular and critically praised recording artist and concert performer in the 2000s. Bennett has won fifteen Grammy Awards, two Emmy Awards, been named an NEA Jazz Master and a Kennedy Center Honoree. He has sold over 50 million records worldwide. Bennett is also a serious and accomplished painter, creating works under the name Benedetto that are on permanent public display in several institutions. He is also the founder of Frank Sinatra School of the Arts in Astoria, Queens.",
        "birthday": "1926-08-03",
        "deathday": "2023-07-21",
        "gender": 2,
        "homepage": null,
        "id": 138986,
        "imdb_id": "nm0004746",
        "known_for_department": "Acting",
        "name": "Tony Bennett",
        "place_of_birth": "Astoria, Queens, New York City, New York, USA",
        "popularity": 0.2825,
        "profile_path": "/gcbLJMKNsbhkvOobTDOT7DfdDZF.jpg"
    }
}