{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/eTlcNXGv32zkVI7ZDHhfeaKHXKQ.jpg",
                "genre_ids": [
                    28,
                    9648,
                    878,
                    53
                ],
                "id": 198663,
                "original_language": "en",
                "original_title": "The Maze Runner",
                "overview": "A teenager with no memory of his past finds himself among a group of boys living in a walled enclosure surrounded by a massive, ever-changing maze. As he struggles to adapt to their rules and society, he begins to uncover clues that may lead to escape and the truth behind their confinement.",
                "popularity": 23.2679,
                "poster_path": "/ode14q7WtDugFDp78fo9lCsmay9.jpg",
                "release_date": "2014-09-10",
                "title": "The Maze Runner",
                "video": false,
                "vote_average": 7.192,
                "vote_count": 17558,
                "character": "Chuck",
                "credit_id": "5474ea4ac3a3686bf3000e60",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Blake Cooper (born in 2001) is an American actor, best known for playing the role of Chuck in The Maze Runner. Born in Atlanta, Georgia on a small animal farm, Blake grew up as a Boy Scout and was well acquainted with animal training. Blake was signed to J Pervis Talent Agency by Joy Pervis when he was 10, after being seen performing at a local event. Immediately after signing, Blake auditioned and landed his first co-star on BET's The Game. Shortly thereafter, he got a callback for the character of Ethan on USA Network'sNecessary Roughness where he impressed the room and had them laughing out loud, which led to booking the role. In April 2013, when Blake was 12, he landed the lead role of Chuck in 20th Century Fox's The Maze Runner. After reading James Dashner's international bestselling adventure story, The Maze Runner, Blake related so well to the character of 'Chuck' that upon discovering a big screen adaptation in the works, he contacted Wes Ball through Twitter for the role.",
        "birthday": "2001-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1389339,
        "imdb_id": "nm4948500",
        "known_for_department": "Acting",
        "name": "Blake Cooper",
        "place_of_birth": "Atlanta, Georgia, USA",
        "popularity": 0.341,
        "profile_path": "/mFGnJZk83mOEF7duAi4uiaCcYvw.jpg"
    }
}