{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gklkxY0veMajdCiGe6ggsh07VG2.jpg",
                "genre_ids": [
                    10751,
                    35,
                    12,
                    16
                ],
                "id": 940551,
                "original_language": "en",
                "original_title": "Migration",
                "overview": "After a migrating duck family alights on their pond with thrilling tales of far-flung places, the Mallard family embarks on a family road trip, from New England, to New York City, to tropical Jamaica.",
                "popularity": 11.5847,
                "poster_path": "/dpXxBDi0ut5svjh5fbAqLoaJSq8.jpg",
                "release_date": "2023-12-06",
                "title": "Migration",
                "video": false,
                "vote_average": 7.38,
                "vote_count": 2097,
                "character": "GooGoo (voice)",
                "credit_id": "6449b9ddf794ad02fb3c99f7",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "David James Stuart Mitchell"
        ],
        "biography": "David James Stuart Mitchell (born 14 July 1974) is a British comedian, actor and writer. Mitchell rose to prominence alongside Robert Webb as part of the comedy duo Mitchell and Webb. The duo starred in the Channel 4 sitcom Peep Show, in which Mitchell plays Mark Corrigan. He won the British Academy Television Award for Best Comedy Performance in 2009 for his performance. Mitchell and Webb have written and starred in several sketch shows including Bruiser, The Mitchell and Webb Situation, That Mitchell and Webb Sound and That Mitchell and Webb Look. They have also starred in the British version of Apple's \"Get a Mac\" ad campaign. Their first film, Magicians, was released in 2007. They starred in the short-lived TV series Ambassadors in 2013, and in the Channel 4 comedy-drama Back from 2017 to 2021.\n\nMitchell starred as Owen in the BBC Radio 4 sitcom Think the Unthinkable and as William Shakespeare in the BBC Two historical comedy Upstart Crow. He has starred in the BBC One detective comedy-drama Ludwig since 2024. He is a frequent participant on British panel shows, being a team captain on Would I Lie to You?, the host of The Unbelievable Truth on BBC Radio 4 and the former host of The Bubble and Was It Something I Said?, as well as guesting on other panel shows including QI, The Big Fat Quiz of the Year, Mock the Week, 8 Out of 10 Cats Does Countdown and Have I Got News for You. He was also a co-host of the comedy news show 10 O'Clock Live. As a writer, he contributes opinion pieces to British newspapers The Observer and The Guardian.",
        "birthday": "1974-07-14",
        "deathday": null,
        "gender": 2,
        "homepage": "https://mmbcreative.com/clients/david-mitchell",
        "id": 139075,
        "imdb_id": "nm0593267",
        "known_for_department": "Acting",
        "name": "David Mitchell",
        "place_of_birth": "Salisbury, Wiltshire, England, UK",
        "popularity": 0.4739,
        "profile_path": "/mHN2NWjBsXseWqq7Zg8K31NS91n.jpg"
    }
}