{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yz8QL8WFD8yj0LA5zIlNOgcHvZK.jpg",
                "genre_ids": [
                    12,
                    35,
                    878
                ],
                "id": 105,
                "original_language": "en",
                "original_title": "Back to the Future",
                "overview": "Eighties teenager Marty McFly is accidentally sent back in time to 1955, inadvertently disrupting his parents' first meeting and attracting his mother's romantic interest. Marty must repair the damage to history by rekindling his parents' romance and - with the help of his eccentric inventor friend Doc Brown - return to 1985.",
                "popularity": 15.739,
                "poster_path": "/vN5B5WgYscRGcQpVhHl6p9DDTP0.jpg",
                "release_date": "1985-07-03",
                "title": "Back to the Future",
                "video": false,
                "vote_average": 8.321,
                "vote_count": 20869,
                "character": "Sally Baines",
                "credit_id": "52fe4218c3a36847f8003a73",
                "order": 24
            },
            {
                "adult": false,
                "backdrop_path": "/xBcuoZooxfrajF8312bSPWqvTMV.jpg",
                "genre_ids": [
                    35
                ],
                "id": 14367,
                "original_language": "en",
                "original_title": "Adventures in Babysitting",
                "overview": "When plans with her boyfriend fall through, high school senior Chris Parker ends up babysitting the Anderson kids, Brad and Sara. What should be a quiet night in, however, turns into a series of ridiculous exploits, starting when they leave the house to pick up Chris' friend Brenda. Soon, Brad's buddy Daryl is involved, and the group must contend with car thieves, blues musicians and much more.",
                "popularity": 2.0881,
                "poster_path": "/8QiAj0Xw2UMeZMIIfZKeNoIsszs.jpg",
                "release_date": "1987-07-01",
                "title": "Adventures in Babysitting",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 702,
                "character": "Sara Anderson",
                "credit_id": "52fe45ea9251416c75066dfb",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Maia Luisa Brewton"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nMaia Luisa Brewton (born September 30, 1977) is an American actress who enjoyed success in the late 1980s and early 1990s.\n\nBrewton was born in Los Angeles, California. She is probably best known as the Mighty Thor-obsessed kid, Sara Anderson, in Adventures in Babysitting, and as Shelly Lewis on one of the Fox Network's earliest shows, Parker Lewis Can't Lose.\n\nIn addition to these more prominent roles, Brewton starred in the movies Sky Trackers with Pamela Sue Martin and A Family for Joe with Robert Mitchum. She also co-starred in the hit film Back to the Future as Sally Baines, the younger sister of Lorraine Baines played by Lea Thompson.\n\nHer television credits include 21 Jump Street, Highway to Heaven, Trapper John, M.D. and The Wonder Years. She also played Margaret Ann Culver in the short-lived television series, Lime Street with co-stars Robert Wagner and Samantha Smith.\n\nApart from her film and television roles, Maia Brewton acted in various theatre productions, most notably at the City Garage Theatre in Santa Monica, California.\n\nDescription above from the Wikipedia article Maia Brewton, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1977-09-30",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 139044,
        "imdb_id": "nm0108315",
        "known_for_department": "Acting",
        "name": "Maia Brewton",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.4031,
        "profile_path": "/iZuTaNx6rV0ga2n8XCQq4wUSKws.jpg"
    }
}