{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/waOYBThLihaTKUFOAzjvhPjBmrS.jpg",
                "genre_ids": [
                    18
                ],
                "id": 14047,
                "original_language": "en",
                "original_title": "The Great Debaters",
                "overview": "The true story of a brilliant but politically radical debate team coach who uses the power of words to transform a group of underdog African-American college students into a historical powerhouse that took on the Harvard elite.",
                "popularity": 4.4686,
                "poster_path": "/szx0sWq0pgvgfRX7g72cWBYoOjf.jpg",
                "release_date": "2007-12-25",
                "title": "The Great Debaters",
                "video": false,
                "vote_average": 7.248,
                "vote_count": 663,
                "character": "Lila",
                "credit_id": "547d875bc3a3685aed005779",
                "order": 33
            },
            {
                "adult": false,
                "backdrop_path": "/7Nwnmyzrtd0FkcRyPqmdzTPppQa.jpg",
                "genre_ids": [
                    80,
                    18,
                    35
                ],
                "id": 106646,
                "original_language": "en",
                "original_title": "The Wolf of Wall Street",
                "overview": "A New York stockbroker refuses to cooperate in a large securities fraud case involving corruption on Wall Street, corporate banking world and mob infiltration. Based on Jordan Belfort's autobiography.",
                "popularity": 27.2678,
                "poster_path": "/kW9LmvYHAaS9iA0tHmZVq8hQYoq.jpg",
                "release_date": "2013-12-25",
                "title": "The Wolf of Wall Street",
                "video": false,
                "vote_average": 8.028,
                "vote_count": 24976,
                "character": "Wedding Singer #1",
                "credit_id": "567aee529251417def0002cc",
                "order": 97
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/yTweHAwEokqAgZg1Io8e0zCJQvt.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 22947,
                "original_language": "en",
                "original_title": "Up in the Air",
                "overview": "Corporate downsizing expert Ryan Bingham spends his life in planes, airports, and hotels, but just as he’s about to reach a milestone of ten million frequent flyer miles, he meets a woman who causes him to rethink his transient life.",
                "popularity": 4.9527,
                "poster_path": "/f4PpmOZHFWSJBTF0kX4cOW5TLiK.jpg",
                "release_date": "2009-12-04",
                "title": "Up in the Air",
                "video": false,
                "vote_average": 6.882,
                "vote_count": 3778,
                "credit_id": "684a0b874a3e44cf68293cb9",
                "department": "Sound",
                "job": "Music"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Born Sharon Lafaye Jones in Augusta, Georgia, she moved to New York City at an early age. With a gifted voice, performing gospel songs in Church, since childhood, she has only recently received acclaim by the public and her peers in the areas of Soul, Funk and Rhythm and Blues. Until the late 90s she was still employed at her \"day Job\" as a Correction Officer at NYC's Rikers Island. Initially a backup session singer, she impressed Record Executives and - Producers Gabriel Roth and Philip Lehman, when she was the only one to show up for a recording session, and demonstrated her ability to sing on several different backup tracks. \"Sharon Jones and The Dap Kings\" were formed In 2002. They were comprised of Sharon Jones backed by members from three bands.From \"The Soul Providers\", Bosco Mann on bass, guitarist Binky Griptite, percussionist Fernando Velez, trumpet player Anda Szilagyi and organist Earl Maxton. They were joined by \"The Mighty Imperials\"s saxophonist Leon Michels and drummer Homer Steinweiss plus Neal Sugarman from \"Sugarman 3\". As \"Sharon Jones and The Dap Kings\", the band has released several critically acclaimed albums including \"Naturally\" (2005) and \"I Learned the Hard Way (2010). A milestone in her career occurred in 2007 when she appeared in the film, \"The Great Debaters\", where she played \"Lila\" and sang \"That's What My Baby Likes\". Additioanlly, in the film's soundtrack, Sharon performs the Gospel classics \"Up Above My Head\" and \"Two Wings\". This film appearance along with the soundtrack music introduced Sharon to a much larger audience. Her subsequent TV appearances with The Dap Kings include a spirited mini concert on \"Austin City Limits\"(2008), as well as appearances on \"Late Night With David Letterman\" (2010) and \"The Conan O'Brien Show\" on TBS (2010).",
        "birthday": "1956-05-04",
        "deathday": "2016-11-18",
        "gender": 1,
        "homepage": null,
        "id": 1392605,
        "imdb_id": "nm1392716",
        "known_for_department": "Acting",
        "name": "Sharon Jones",
        "place_of_birth": "Augusta, Georgia, USA",
        "popularity": 0.0977,
        "profile_path": null
    }
}