{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jOWgFmD1H5t6nL7ChbmX8oDFUZl.jpg",
                "genre_ids": [
                    10749,
                    35
                ],
                "id": 520172,
                "original_language": "en",
                "original_title": "Happiest Season",
                "overview": "A young woman's plans to propose to her girlfriend while at her family's annual holiday party are upended when she discovers her partner hasn't yet come out to her conservative parents.",
                "popularity": 3.759,
                "poster_path": "/vzec9kkOSE93tygyfOktedkeOQ.jpg",
                "release_date": "2020-11-26",
                "title": "Happiest Season",
                "video": false,
                "vote_average": 7.138,
                "vote_count": 1263,
                "character": "John",
                "credit_id": "5e79c328d18b240017832ab6",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Daniel Joseph Levy",
            "Daniel Levy",
            "Dan Levy (VII)",
            "Dan 'Tony' Levy",
            "ダニエル・レヴィ",
            "Дэниэл Леви",
            "Деніел Леві",
            "دانييل لافي",
            "Ντάνιελ Λέβι",
            "דניאל לוי",
            "대니얼 레비",
            "丹尼爾·里維"
        ],
        "biography": "Dan Levy began his television career as a co-host of MTV Canada's flagship show MTV Live and later co-wrote, co-hosted, and co-produced the critically acclaimed ratings hit The After Show and its various incarnations including The Hills: The After Show and The City: Live After Show. Levy also wrote, produced, and starred in his own Christmas Special for MTV, Daniel Levy's Holi-Do's & Don'ts for MTV and co-hosted the MTV Movie Awards Red Carpet, the X-Factor pre-show, and national coverage of the Vancouver Olympic Games for CTV. Levy's acting roles include the Canadian TV series Degrassi: The Next Generation and the thriller Off Line. He made his film debut opposite Tina Fey in Admission.\n\nIn 2013, Levy formed Not A Real Company Productions (with his father Eugene Levy and principals Andrew Barnsley and Fred Levy) to produce Schitt's Creek, a half-hour single cam comedy for CBC/ITV. Levy is the co-creator, co-executive producer, and writer of Schitt's Creek and stars alongside Eugene Levy, Catherine O'Hara, and Chris Elliott.",
        "birthday": "1983-08-09",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1392152,
        "imdb_id": "nm2391794",
        "known_for_department": "Acting",
        "name": "Dan Levy",
        "place_of_birth": "Toronto, Ontario, Canada",
        "popularity": 0.4134,
        "profile_path": "/2O9KqgCLHHMw5xmUpNexfWr2QVA.jpg"
    }
}