{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1l1013J6IQIipxN7KHTWipVngT0.jpg",
                "genre_ids": [
                    35,
                    16,
                    10751
                ],
                "id": 227973,
                "original_language": "en",
                "original_title": "The Peanuts Movie",
                "overview": "Snoopy embarks upon his greatest mission as he and his team take to the skies to pursue their arch-nemesis, while his best pal Charlie Brown begins his own epic quest.",
                "popularity": 6.0905,
                "poster_path": "/aiwdwnl7RFs1vcBanOKr13ye3wE.jpg",
                "release_date": "2015-11-05",
                "title": "The Peanuts Movie",
                "video": false,
                "vote_average": 6.936,
                "vote_count": 1724,
                "character": "Linus (voice)",
                "credit_id": "547e5a69c3a3682573000102",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Alexander Garfin"
        ],
        "biography": "Alex Garfin stars as the complex and captivating son of Clark Kent and Lois Lane in the hit series Superman & Lois. Like his older brother, Max Garfin, Alex honed his craft at NYC's prestigious Fiorello H. LaGuardia High School of Music & Art and Performing Arts, known as Fame High School. Alex is a multi-talented artist who also sings, plays piano, and speaks Japanese! Alex is a dedicated advocate working closely with the United Nations on significant global initiatives. In November 2022, Alex made headlines as one of the select few performers invited to COP27 in Sharm el-Sheikh, Egypt, where he passionately supported crucial environmental and youth focused causes. When he's not on set or advocating for change, you can find Alex exploring new cultures and adventures through travel.\n\nAlexander Garfin had someone to share his experiences with as he embarked on his professional acting career before he had even entered kindergarten: his brother, Maximilian Garfin, was also a young, aspiring actor, and the two pursued their careers as child performers concurrently. The first break for the Manhattan-born Garfin came at the age of three, when he appeared in a number of video releases for the kids network Nickelodeon. By five, he was playing a very young Russian spy in training in the Angelina Jolie movie \"Salt\" (2010) for which the five-year-old actor had his hair and eyebrows dyed blonde.\n\nIn 2013, at nine years old, Garfin made his first appearance on an Equity stage, appearing in a production of the Joel Grey play \"On Borrowed Time\" with the Two River Theater Company in Red Bank, NJ. He also booked a number of prominent commercials around this time. In 2014, it was announced that Garfin would be providing the voice of Linus for the big screen adaptation of the comic strip \"Peanuts\" (2015).",
        "birthday": "2003-09-23",
        "deathday": null,
        "gender": 2,
        "homepage": "https://alexgarfin.com/",
        "id": 1393181,
        "imdb_id": "nm3476372",
        "known_for_department": "Acting",
        "name": "Alex Garfin",
        "place_of_birth": "Manhattan, New York, USA",
        "popularity": 0.2882,
        "profile_path": "/j6gCiAUjfFSmnF38ZcrcX7YiqsH.jpg"
    }
}