{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3sRj3VnrSUYhp6j1V43LXgKKdux.jpg",
                "genre_ids": [
                    18,
                    10752
                ],
                "id": 227306,
                "original_language": "en",
                "original_title": "Unbroken",
                "overview": "A chronicle of the life of Louis Zamperini, an Olympic runner who was taken prisoner by Japanese forces during World War II.",
                "popularity": 5.3619,
                "poster_path": "/vAlHUjHwLWMV5mg4epGR9WSIfiy.jpg",
                "release_date": "2014-12-25",
                "title": "Unbroken",
                "video": false,
                "vote_average": 7.428,
                "vote_count": 4223,
                "character": "Young Louis",
                "credit_id": "54808638c3a36829b5003599",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "CJ Valleroy"
        ],
        "biography": "C.J. Valleroy's love for acting was ignited at age six watching Angelina Jolie and Brad Pitt's kitchen combat scene in the film Mr & Mrs Smith. As fate would have it, eight years later C.J. was cast in the role of the incorrigible, young Louie Zamperini in the Angelina Jolie directed feature, Unbroken, which was released worldwide on Christmas Day, 2014.\n\nBorn in Oklahoma City, C.J. and his family moved to Altamonte Springs, Florida when he was six months old. He began modeling and dancing at age 10, and at 14 moved out to Los Angeles in hopes of pursuing a career in the entertainment industry.\n\nWithin his first year in Los Angeles, C.J. made his 2013 television debut as Max in Nickelodeon's Deadtime Stories. 2014 marked C.J.'s film debut in Unbroken, the astonishing true story of Louis Zamperini, a troubled youth who channeled his defiance into running, and became an international track star at the Berlin Olympics. As World War II broke out, Zamperini enlisted as an airman where he survived a plane crash, and several Japanese prisoner of war camps. Most recently, CJ was cast as Charlie Drake in Amblin Entertainment/TNT's 2015 pilot Lumen, the story of a boy (Charlie) who accidentally transports his entire family into the world of a writer's creation.",
        "birthday": "1999-01-11",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1394425,
        "imdb_id": "nm5521130",
        "known_for_department": "Acting",
        "name": "C.J. Valleroy",
        "place_of_birth": "Oklahoma City, Oklahoma, USA",
        "popularity": 0.4523,
        "profile_path": "/vsuWPmCFanrTh8dXY7ruRfnYe7I.jpg"
    }
}