{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/x7y8ezKtU1vRInk0dmbvDoKgJ8u.jpg",
                "genre_ids": [
                    18,
                    35,
                    10749
                ],
                "id": 2898,
                "original_language": "en",
                "original_title": "As Good as It Gets",
                "overview": "Melvin Udall, a cranky, bigoted, obsessive-compulsive writer of romantic fiction, is rude to everyone he meets, including his gay neighbor, Simon. After Simon is brutally attacked and hospitalized, Melvin finds his life turned upside down when he has to look after Simon's dog. In addition, Carol, the only waitress at the local diner who will tolerate him, leaves work to care for her chronically ill son, making it impossible for Melvin to eat breakfast.",
                "popularity": 5.5237,
                "poster_path": "/xXxuJPNUDZ0vjsAXca0O5p3leVB.jpg",
                "release_date": "1997-12-19",
                "title": "As Good as It Gets",
                "video": false,
                "vote_average": 7.397,
                "vote_count": 3930,
                "character": "Publisher",
                "credit_id": "55c8da819251415bad00174f",
                "order": 43
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Linda Gehringer most recently appeared at the Goodman in The Crowd You're in With during the the 2008/2009 Season. Her New York credits include The Atlantic Theater Company productions of 10x20 and Rolin Jones’ The Intelligent Design of Jenny Chow which she originated at South Coast Repertory. Other South Coast Repertory credits include the world premieres of Julia Cho’s The Piano Teacher, Horton Foote’s Getting Frankie Married—and Afterwards, Keith Reddin’s But Not For Me, Richard Greenberg’s The Naked Girl on the Appian Way, Annie Weisman’s Hold Please and the West Coast premieres of The Retreat from Moscow, Peter Hedges’ Good as New, as well asDoubt, Hamlet and All My Sons, among others. Regional credits include roles in productions at La Jolla Playhouse, Mark Taper Forum, The Old Globe Theater, Arena Stage, Centerstage, Huntington Theatre Company, New York Stage and Film, Berkshire Theatre Festival and seven seasons at Dallas Theatre Center. Ms. Gehringer’s television credits include Weeds, Without a Trace, Gilmore Girls, Cold Case, The West Wing, Frasier, Ally McBeal, The Practice, The Larry Sanders Show, Law & Order: Criminal Intent and four seasons on Evening Shade. Film credits include As Good as It Gets. She has received numerous critical awards and holds an MFA from The University of Minnesota.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1394788,
        "imdb_id": "nm0311816",
        "known_for_department": "Acting",
        "name": "Linda Gehringer",
        "place_of_birth": null,
        "popularity": 0.477,
        "profile_path": "/nqAnL7rOHO2c5Htc4IgdiZESmdp.jpg"
    }
}