{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3sRj3VnrSUYhp6j1V43LXgKKdux.jpg",
                "genre_ids": [
                    18,
                    10752
                ],
                "id": 227306,
                "original_language": "en",
                "original_title": "Unbroken",
                "overview": "A chronicle of the life of Louis Zamperini, an Olympic runner who was taken prisoner by Japanese forces during World War II.",
                "popularity": 5.3619,
                "poster_path": "/vAlHUjHwLWMV5mg4epGR9WSIfiy.jpg",
                "release_date": "2014-12-25",
                "title": "Unbroken",
                "video": false,
                "vote_average": 7.428,
                "vote_count": 4223,
                "character": "Olympic spectator / Japanese Olympic team member (uncredited)",
                "credit_id": "54808983c3a368299f0023f8",
                "order": 75
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Numse",
            "Kentle"
        ],
        "biography": "Kent Lee's need to satisfy his creative desires saw him join the ever-challenging world of acting. In this time he has been involved in a number of diverse projects, such as working as an extra on international blockbuster feature films 'San Andreas' starring Hollywood superstar The Rock, and Angelina Jolie's 'Unbroken'.\n\nKent has appeared in popular television series 'Mako: Island of Secrets', a number of short films including Purryburry Productions' 'Gifted\", a Chinese tourism campaign for Rumba Beach Resort, a promotional video for Welcome Fresh Foods, a webisode (S-Unit Australia), and in a series of projects for Global Wrestling Entertainment. He is trained and represented by Vox Talent Management, has received additional acting training from Bud Hopes, Tom McSweeney and Alison Telford, plus weapons training with Michael Bates in conjunction with Armsco.\n\nLooking to do more and do better, Kent eagerly anticipates working with talented and creative minds both new and old. He is keen to add more experience to his growing resume and strives to seek opportunities that broaden and challenge his emotional and physical skills.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1394477,
        "imdb_id": "nm6752643",
        "known_for_department": "Acting",
        "name": "Kent Lee",
        "place_of_birth": null,
        "popularity": 0.1908,
        "profile_path": "/1nthCWyw31OpPxNiTSiwX7XnrGQ.jpg"
    }
}