{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gz3rCM34UicmOxRY1T2SgiQZJoS.jpg",
                "genre_ids": [
                    18
                ],
                "id": 249164,
                "original_language": "en",
                "original_title": "If I Stay",
                "overview": "Mia Hall, a talented young cellist, thought the most difficult decision she would ever have to make would be whether to pursue her musical dreams at prestigious Juilliard or follow her heart to be with the love of her life, Adam, a rock singer/guitarist. However, a car wreck changes everything in an instant, and now Mia's life hangs in the balance. Suspended between life and death, Mia faces a choice that will decide her future.",
                "popularity": 3.8833,
                "poster_path": "/7Twh8h3Wh7GC9npTAEUThgkxkWL.jpg",
                "release_date": "2014-08-21",
                "title": "If I Stay",
                "video": false,
                "vote_average": 7.366,
                "vote_count": 4239,
                "character": "Teddy Hall",
                "credit_id": "542d5a5a0e0a26079e001e77",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Jakob Davies is a Canadian born Actor. He began acting in 2009 and was featured in several National and International Commercials. Jakob quickly transitioned to Television and Movies where he has been cast in 19 productions to date. He has been fortunate to portray iconic characters such as \"Lex Luther\" (Smallville) and the recurring role of \"Pinocchio\" on ABC's \"Once Upon a Time\". He has worked with \"Martyrs\" Director Pascal Laugier on \"The Tall Man\" and has just completed filming: \"The Young and Prodigious Spivet with Director Jean-Pierre Jeunet(Amelie). Despite his acting credits Jakob remains grounded attending public school were he enjoys spending time with his friends.He participates in team sports (Football) and Dance (Hip Hop). He continues to love acting and strives to be his best in each and every project put before him.  - IMDb Mini Biography",
        "birthday": "2003-01-29",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 139618,
        "imdb_id": "nm3240434",
        "known_for_department": "Acting",
        "name": "Jakob Davies",
        "place_of_birth": "White Rock, British Columbia, Canada",
        "popularity": 0.2086,
        "profile_path": "/7jOdMFsrjiCjVgkKXBAGV5mxC0A.jpg"
    }
}