{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/96WHK0TiIslmM8rGVIejMtMtaPG.jpg",
                "genre_ids": [
                    12,
                    28,
                    53,
                    878
                ],
                "id": 604,
                "original_language": "en",
                "original_title": "The Matrix Reloaded",
                "overview": "The Resistance builds in numbers as humans are freed from the Matrix and brought to the city of Zion. Neo discovers his superpowers, including the ability to see the code inside the Matrix. With machine sentinels digging to Zion in 72 hours, Neo, Morpheus and Trinity must find the Keymaker to ultimately reach the Source.",
                "popularity": 10.1559,
                "poster_path": "/9TGHDvWrqKBzwDxDodHYXEmOE6J.jpg",
                "release_date": "2003-05-15",
                "title": "The Matrix Reloaded",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 11443,
                "character": "Officer Wirtz",
                "credit_id": "52fe425cc3a36847f8018449",
                "order": 57
            },
            {
                "adult": false,
                "backdrop_path": "/jniabJVBSW3EqLlyhjxWCZjVkiE.jpg",
                "genre_ids": [
                    12,
                    28,
                    878
                ],
                "id": 1895,
                "original_language": "en",
                "original_title": "Star Wars: Episode III - Revenge of the Sith",
                "overview": "The evil Darth Sidious enacts his final plan for unlimited power – and the heroic Jedi Anakin Skywalker must choose a side.",
                "popularity": 8.2385,
                "poster_path": "/xfSAoBEm9MNBjmlNcDYLvLSMlnq.jpg",
                "release_date": "2005-05-17",
                "title": "Star Wars: Episode III - Revenge of the Sith",
                "video": false,
                "vote_average": 7.453,
                "vote_count": 14346,
                "character": "Mon Mothma",
                "credit_id": "54e363729251412c8e003760",
                "order": 39
            },
            {
                "adult": false,
                "backdrop_path": "/28XFhXIlmeg19bSOpWKWaWFBEkQ.jpg",
                "genre_ids": [
                    18,
                    36,
                    10749
                ],
                "id": 18320,
                "original_language": "en",
                "original_title": "The Young Victoria",
                "overview": "As the only legitimate heir of England's King William, teenage Victoria gets caught up in the political machinations of her own family. Victoria's mother wants her to sign a regency order, while her Belgian uncle schemes to arrange a marriage between the future monarch and Prince Albert, the man who will become the love of her life.",
                "popularity": 2.5527,
                "poster_path": "/iGyuReyij3bPCtzJdSjTR8PR0pa.jpg",
                "release_date": "2009-03-04",
                "title": "The Young Victoria",
                "video": false,
                "vote_average": 7.166,
                "vote_count": 1039,
                "character": "Lady Flora Hastings",
                "credit_id": "5692a660c3a3684d04002b76",
                "order": 14
            },
            {
                "adult": false,
                "backdrop_path": "/6t8ES1d12OzWyCGxBeDYLHoaDrT.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 330459,
                "original_language": "en",
                "original_title": "Rogue One: A Star Wars Story",
                "overview": "A rogue band of resistance fighters unite for a mission to steal the Death Star plans and bring a new hope to the galaxy.",
                "popularity": 6.8029,
                "poster_path": "/i0yw1mFbB7sNGHCs7EXZPzFkdA1.jpg",
                "release_date": "2016-12-14",
                "title": "Rogue One: A Star Wars Story",
                "video": false,
                "vote_average": 7.502,
                "vote_count": 15864,
                "character": "Mon Mothma",
                "credit_id": "570767e09251412b0700229e",
                "order": 12
            },
            {
                "adult": false,
                "backdrop_path": "/4HXiEsWUEMzJNFwjJv6oUaocqJU.jpg",
                "genre_ids": [
                    10752,
                    18,
                    10749
                ],
                "id": 468224,
                "original_language": "en",
                "original_title": "Tolkien",
                "overview": "England, early 20th century. The future writer and philologist John Ronald Reuel Tolkien (1892-1973) and three of his schoolmates create a strong bond between them as they share the same passion for literature and art, a true fellowship that strengthens as they grow up, but the outbreak of World War I threatens to shatter it.",
                "popularity": 5.7813,
                "poster_path": "/A7eYO3t7oZQdfJj5KlJBI7GhT9H.jpg",
                "release_date": "2019-05-03",
                "title": "Tolkien",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 1469,
                "character": "Mrs. Smith",
                "credit_id": "5a0abdfcc3a368218a017efd",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Genevieve O'Reilly",
            "جنيفيف أوريلي",
            "吉娜薇·欧瑞丽"
        ],
        "biography": "Genevieve O'Reilly is an Irish actress known for her versatility, having earned recognition for her performances across stage and screen. Most recently, Genevieve reprised her groundbreaking and legacy role of 'Mon Mothma' in the second and final season of Andor (2022), the Star Wars series on Disney+ described in 2025 by Vanity Fair as \"the best television of the year so far.\"\n\nHer performance has been widely acclaimed: Variety praised her \"excellent supporting turn,\" The Playlist highlighted her portrayal as \"one of the finest seen from any actor on any screen,\" and Screen Rant called it \"essentially flawless... eloquence and vulnerability.\" The second season has become the highest-rated live-action Star Wars series on Rotten Tomatoes to date. The first season was nominated for Outstanding Drama Series at the 2024 Emmy Awards, won a Peabody Award for Entertainment, and Genevieve was nominated for Supporting Actress - Drama at the 2023 IFTA Awards.\n\nFor film, Genevieve was nominated as Best Lead Actress in Film at the AACTA Awards for her role in The Dry (2020), the adaptation of Jane Harper's multi-award-winning novel. The film opened at the top of the Australian box office on New Year's Day and achieved the fifth-highest opening day for a local film in history. Released by IFC Films in the US, The Dry (2020) garnered similar acclaim and was announced as runner-up for Best Narrative Feature at the San Francisco International Film Festival. Her other notable film appearances include Tolkien (2019), the biopic of the iconic author J.R.R. Tolkien. The film explored Tolkien's formative years against the brutal backdrop of the First World War. Additionally, Genevieve appeared in the acclaimed films The Legend of Tarzan (2016) and The Young Victoria (2009).\n\nGenevieve is also known for her leading role in Tin Star (2017), Her portrayal of Angela Worth earned her an Irish Film and Television Award nomination. The series, a significant success for the channel, accumulated more than 17 million downloads and views during its first season. Genevieve's further television credits include Episodes with Matt LeBlanc, the Peabody Award-winning drama The Honorable Woman (2014) alongside Maggie Gyllenhaal, the BAFTA-nominated The Secret for ITV, BBC's Spooks and The Snowman with Michael Fassbender.\n\nOn stage, Genevieve delivered a powerful performance as Mary Carney in Jez Butterworth's The Ferryman, first at the Royal Court Theatre and later in London's West End. She reprised the role on Broadway following the production's record-breaking, sold-out run. Directed by Sam Mendes, the play won three Olivier Awards, Evening Standard Awards, and a UK Critics' Circle Award for Best New Play. The New York Times called the production 'fiercely gripping,' and The Hollywood Reporter praised Genevieve's performance, noting her 'gorgeous speech,' which 'spills out full of conflicting impulses of hurt and compassion.' Genevieve's additional theatre credits include Ibsen's epic Emperor and Galilean as Helena, wife to Andrew Scott's emperor Julian, and Mike Bartlett's 13 at the National Theatre, Splendour by Abi Morgan at the Donmar Warehouse, Richard II at the Old Vic, The Way of the World with the Sydney Theatre Company, and The Weir at the Gate Theatre Dublin.",
        "birthday": "1977-01-06",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 139654,
        "imdb_id": "nm0642444",
        "known_for_department": "Acting",
        "name": "Genevieve O'Reilly",
        "place_of_birth": "Dublin, Ireland",
        "popularity": 0.6977,
        "profile_path": "/xXPoflf99SEkK8yRpZPssH6y6S2.jpg"
    }
}