{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8Qsr8pvDL3s1jNZQ4HK1d1Xlvnh.jpg",
                "genre_ids": [
                    14,
                    12
                ],
                "id": 259316,
                "original_language": "en",
                "original_title": "Fantastic Beasts and Where to Find Them",
                "overview": "In 1926, Newt Scamander arrives at the Magical Congress of the United States of America with a magically expanded briefcase, which houses a number of dangerous creatures and their habitats. When the creatures escape from the briefcase, it sends the American wizarding authorities after Newt, and threatens to strain even further the state of magical and non-magical relations.",
                "popularity": 11.2281,
                "poster_path": "/h6NYfVUyM6CDURtZSnBpz647Ldd.jpg",
                "release_date": "2016-11-16",
                "title": "Fantastic Beasts and Where to Find Them",
                "video": false,
                "vote_average": 7.311,
                "vote_count": 19242,
                "character": "Criminal on 'Wanted' Poster (uncredited)",
                "credit_id": "5794e8a392514142a40024d5",
                "order": 92
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Anick was born in the French side of Switzerland on February 8, 1969.\n\nHer father was an engraver and her mother is an accountant. Her younger sister is a radio journalist.\n\nAnick was educated at la Chaux-de-Fonds where she also studied architecture for four years before graduating as an architectural technician. She worked in that profession for over 15 years.\n\nAt the age of 19, she started working with a theatre company. First season, backstage, dealing with sets, props and costumes before she left the wings to move to the stage.\n\nShe lived in Berlin for a short period of time.\n\nShe came to England to study theatre design and briefly worked as wardrobe assistant at the Royal Court Theatre and Pimlico Opera, where she worked on a production of West Side Story with the inmates of Wandsworth Prison.\n\nAnick began to work as a supporting actress after meeting with Mark Jones, a southern England based film director. She was first featured in Holy Flying Circus directed by Owen Harris. She appeared in Hacks, directed by Guy Jenkins then in New Tricks and Midsomer Murders.\n\nShe recently worked on the new Edgar Wright's film The World's End.\n\nWhen she is not filming, Anick teaches French to primary school children.\n\n- IMDb Mini Biography",
        "birthday": "1969-02-08",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1396600,
        "imdb_id": "nm5359722",
        "known_for_department": "Acting",
        "name": "Anick Wiget",
        "place_of_birth": null,
        "popularity": 0.0193,
        "profile_path": null
    }
}