{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xEY0MV2jSQBz9iOJfCFvLTiPGMA.jpg",
                "genre_ids": [
                    53,
                    80
                ],
                "id": 75656,
                "original_language": "en",
                "original_title": "Now You See Me",
                "overview": "An FBI agent and an Interpol detective track a team of illusionists who pull off bank heists during their performances and reward their audiences with the money.",
                "popularity": 10.6001,
                "poster_path": "/tWsNYbrqy1p1w6K9zRk0mSchztT.jpg",
                "release_date": "2013-05-29",
                "title": "Now You See Me",
                "video": false,
                "vote_average": 7.333,
                "vote_count": 16014,
                "character": "Willy Mears",
                "credit_id": "650fb0cca3e4ba011bb73f20",
                "order": 19
            },
            {
                "adult": false,
                "backdrop_path": "/yZP6GyrgzdpjH1AxPHlb8ACLkiA.jpg",
                "genre_ids": [
                    27,
                    53
                ],
                "id": 49018,
                "original_language": "en",
                "original_title": "Insidious",
                "overview": "A family discovers that dark spirits have invaded their home after their son inexplicably falls into an endless sleep. When they reach out to a professional for help, they learn things are a lot more personal than they thought.",
                "popularity": 10.6364,
                "poster_path": "/tmlDFIUpGRKiuWm9Ixc6CYDk4y0.jpg",
                "release_date": "2011-03-31",
                "title": "Insidious",
                "video": false,
                "vote_average": 6.943,
                "vote_count": 7050,
                "character": "Long Haired Fiend",
                "credit_id": "59686a07925141329c013223",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "J LaRose",
            "J. Larose",
            "J Larose"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nJ. Adam Larose, who uses the professional name J. LaRose, is an American actor.\n\nHe has worked with Saw director, Darren Lynn Bousman, on five projects: Identity Lost, Butterfly Dreams, Saw III, Repo! The Genetic Opera, and Fear Itself episode \"New Year's Day\"). Two of which were Bousman's first short films, Repo! was a short directed by Bousman to promote a feature film to Lionsgate. It successfully did and after Saw IV, Bousman directed a full-length feature film version of Repo! The Genetic Opera, in which Larose played the Vanity and Vein reporter who interviews Rotti Largo about Zydrate addiction. Larose played the lead in each - Butterfly Dreams and Identity Lost. However, he made his Hollywood film debut in a much smaller role as a helpless victim of Jigsaw, known as Troy in Saw III. A new commentary track with Darren Lynn Bousman and Larose is included on the Director's Cut DVD of Saw III.\n\nDescription above from the Wikipedia article J. Larose, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 139631,
        "imdb_id": "nm0488493",
        "known_for_department": "Acting",
        "name": "J. LaRose",
        "place_of_birth": null,
        "popularity": 0.2712,
        "profile_path": "/eZHglMF2O4KtXZAQtlQ4Vf2taTW.jpg"
    }
}