{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ubICMSUij3ntP9BjnQsV3rTVnAF.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 783,
                "original_language": "en",
                "original_title": "Gandhi",
                "overview": "In the early years of the 20th century, Mohandas K. Gandhi, a British-trained lawyer, forsakes all worldly possessions to take up the cause of Indian independence. Faced with armed resistance from the British government, Gandhi adopts a policy of 'passive resistance', endeavouring to win freedom for his people without resorting to bloodshed.",
                "popularity": 4.3456,
                "poster_path": "/rOXftt7SluxskrFrvU7qFJa5zeN.jpg",
                "release_date": "1982-12-01",
                "title": "Gandhi",
                "video": false,
                "vote_average": 7.557,
                "vote_count": 2390,
                "character": "Lord Hunter",
                "credit_id": "57fba28fc3a36874670005d9",
                "order": 99
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ernest William Clark"
        ],
        "biography": "A distinguished stage actor, Ernest Clark was best known to British television viewers for his role as the crusty \"Sir Geoffrey Loftus\" in the long running \"Doctor\" comedy series during the 1970s.\n\nBorn in Maida Vale, Clark was the son of a master builder and was educated at Marylebone Grammar School. His first job was as a reporter on a local newspaper and he was also a keen amateur actor.\n\nHe made his first professional appearance at the Festival Theatre, Cambridge in 1937 and, throughout the 1930s and 40s, was rarely off the West End stage. In New York in 1950, he garnered rave reviews for his appearance in T.S. Eliot's \"The Cocktail Party\".\n\nA prolific screen character actor, he was usually cast in cold, tight-lipped roles in British war films.\n\nHe was vice-president of Equity, the British actor's union, from 1964-69 and president from 1970-73. An articulate, outspoken and often witty commentator for the acting profession, he always argued on the side of regulated entry into what he described as \"an overcrowded industry\".\n\nClark's first two marriages were dissolved. His third wife was 'Julia Lockwood', the daughter of the British film star Margaret Lockwood.\n\n- IMDb Mini Biography By: Patrick Newley",
        "birthday": "1912-02-12",
        "deathday": "1994-11-11",
        "gender": 2,
        "homepage": null,
        "id": 139765,
        "imdb_id": "nm0163919",
        "known_for_department": "Acting",
        "name": "Ernest Clark",
        "place_of_birth": "Paddington, London, England, UK",
        "popularity": 0.1546,
        "profile_path": "/rZ4gWYzAsQPYjfaXGT3ga3GaVwc.jpg"
    }
}