{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wWLUUGtemgrRyH24v8lAkSR58US.jpg",
                "genre_ids": [
                    10751,
                    10770,
                    12,
                    14
                ],
                "id": 506574,
                "original_language": "en",
                "original_title": "Descendants 3",
                "overview": "The teenagers of Disney's most infamous villains return to the Isle of the Lost to recruit a new batch of villainous offspring to join them at Auradon Prep.",
                "popularity": 5.579,
                "poster_path": "/7IRy0iHdaS0JI3ng4ZYlk5gLSFn.jpg",
                "release_date": "2019-08-02",
                "title": "Descendants 3",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 1570,
                "character": "Dancer / Chorus Performer",
                "credit_id": "6686f3fbac0ee0006a73550b",
                "order": 60
            },
            {
                "adult": false,
                "backdrop_path": "/y0ludgr1EvyXcT1lv2M0m621LQ6.jpg",
                "genre_ids": [
                    10751,
                    12,
                    14,
                    10770,
                    10402
                ],
                "id": 277217,
                "original_language": "en",
                "original_title": "Descendants",
                "overview": "A present-day idyllic kingdom where the benevolent teenage son of King Adam and Queen Belle offers a chance of redemption for the troublemaking offspring of Disney's classic villains: Cruella De Vil (Carlos), Maleficent (Mal), the Evil Queen (Evie) and Jafar (Jay).",
                "popularity": 6.1949,
                "poster_path": "/65DkgHPSLVjgr6IYkpY9Aqqqid5.jpg",
                "release_date": "2015-07-31",
                "title": "Descendants",
                "video": false,
                "vote_average": 7.146,
                "vote_count": 2434,
                "character": "Dancer and Chorus Performer",
                "credit_id": "600f74059af171003ea3e0dc",
                "order": 61
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Originally from Canada, Mackenzie Green has always had a tremendous amount of love and passion for dance. Having gained a strong foundation in Jazz, Ballet, Contemporary, Lyrical, Acrobatics, Hip-Hop, Musical Theatre and Tap, Mackenzie’s versatility as a dancer has led him to his success and imprint in the entertainment industry.\n\nGreen currently resides in Los Angeles, California, where he has worked on many Film/TV productions such as, Netflix’s “Julie & The Phantoms”, Disney’s “Descendants” Trilogy, NBC’s “Zoey’s Extraordinary Playlist,” Showtime’s “Penny Dreadful: City of Angels,” FOX’s “9-1-1: Lonestar,” ABC’s “The Middle,” FOX’s “Glee,” “Step Up 5,” ABC’s “Once Upon a Time,” and FOX’s “Witches of East End.” Green has also performed on the Grammy Awards, Dancing with the Stars, The Voice, America’s Got Talent, Emmy Awards, Latin Grammy Awards, Lip Sync Battle, MTV Awards, Pan American Games, and Rupaul’s Drag Race.\n\nAs a highlight, Mackenzie toured throughout Europe with one of Germany’s top artists Helene Fischer, produced by 45degrees, a division of Cirque Du Soleil. Other artists include; Paula Abdul, Katy Perry, Meghan Trainor, Keke Palmer, Jeremih, Betty Who, Nelly Furtado, Tom Odell, Grimes, and many more. Green has also performed on Art on Ice’s European tours and Cheryl Burke’s “Love On The Floor.” Mackenzie has also worked for companies which include; Nike, BeachBody, AVON, LG Electronics, and Mary Kay.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1398063,
        "imdb_id": "nm4718900",
        "known_for_department": "Acting",
        "name": "Mackenzie Green",
        "place_of_birth": null,
        "popularity": 0.5581,
        "profile_path": "/mHJvAXuNGlkuc9HMPl4PsmaFMBh.jpg"
    }
}