{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9xzVKUGbVKrrgwlmshJ8SxI5mL7.jpg",
                "genre_ids": [
                    9648,
                    80,
                    53
                ],
                "id": 963,
                "original_language": "en",
                "original_title": "The Maltese Falcon",
                "overview": "A private detective takes on a case that involves him with three eccentric criminals, a beautiful liar, and their quest for a priceless statuette.",
                "popularity": 5.616,
                "poster_path": "/bf4o6Uzw5wqLjdKwRuiDrN1xyvl.jpg",
                "release_date": "1941-10-18",
                "title": "The Maltese Falcon",
                "video": false,
                "vote_average": 7.712,
                "vote_count": 1775,
                "character": "Brigid O'Shaughnessy",
                "credit_id": "52fe4294c3a36847f8029a2f",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Μαίρη Άστορ",
            "Lucile Vasconcellos Langhanke"
        ],
        "biography": "Mary Astor (May 3, 1906 - September 25, 1987) was an American actress. Most remembered for her role as Brigid O'Shaughnessy in The Maltese Falcon (1941) with Humphrey Bogart, Astor began her long motion picture career as a teenager in the silent movies of the early 1920s. She eventually made a successful transition to talkies, but almost saw her career destroyed due to public scandal in the mid-1930s. She was sued for support by her parents and was later branded an adulterous wife by her ex-husband during a custody fight over her daughter.\n\nOvercoming these stumbling blocks in her private life, Astor went on to even greater success on the screen, eventually winning the Academy Award for Best Supporting Actress for her portrayal of Sandra Kovak in The Great Lie (1941). She was an MGM contract player through most of the 1940s and continued to act in movies, on television and on stage until her retirement from the screen in 1964.\n\nAstor was the author of five novels. Her autobiography became a bestseller, as did her later book, A Life on Film, which was specifically about her career. Director Lindsay Anderson wrote of her in 1990: \"...(W)hen two or three who love the cinema are gathered together, the name of Mary Astor always comes up, and everybody agrees that she was an actress of special attraction, whose qualities of depth and reality always seemed to illuminate the parts she played.\"\n\nDescription above from the Wikipedia article Mary Astor, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1906-05-03",
        "deathday": "1987-09-25",
        "gender": 1,
        "homepage": "http://themaryastorcollection.com/",
        "id": 13992,
        "imdb_id": "nm0000802",
        "known_for_department": "Acting",
        "name": "Mary Astor",
        "place_of_birth": "Quincy, Illinois, USA",
        "popularity": 0.2853,
        "profile_path": "/g5iKOHKkpTAQUNOodgCEInrmtiU.jpg"
    }
}