{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/eCynaAOgYYiw5yN5lBwz3IxqvaW.jpg",
                "genre_ids": [
                    16,
                    10751
                ],
                "id": 12,
                "original_language": "en",
                "original_title": "Finding Nemo",
                "overview": "Nemo, an adventurous young clownfish, is unexpectedly taken from his Great Barrier Reef home to a dentist's office aquarium. It's up to his worrisome father Marlin and a friendly but forgetful fish Dory to bring Nemo home -- meeting vegetarian sharks, surfer dude turtles, hypnotic jellyfish, hungry seagulls, and more along the way.",
                "popularity": 12.7855,
                "poster_path": "/eHuGQ10FUzK1mdOY69wF5pGgEf5.jpg",
                "release_date": "2003-05-30",
                "title": "Finding Nemo",
                "video": false,
                "vote_average": 7.817,
                "vote_count": 19911,
                "character": "Dory (voice)",
                "credit_id": "52fe420ec3a36847f800067d",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/o11rDwFa7nZMVI57Mm3C44YwmmF.jpg",
                "genre_ids": [
                    12,
                    16,
                    35,
                    10751
                ],
                "id": 127380,
                "original_language": "en",
                "original_title": "Finding Dory",
                "overview": "Dory is reunited with her friends Nemo and Marlin in the search for answers about her past. What can she remember? Who are her parents? And where did she learn to speak Whale?",
                "popularity": 8.0357,
                "poster_path": "/3UVe8NL1E2ZdUZ9EDlKGJY5UzE.jpg",
                "release_date": "2016-06-16",
                "title": "Finding Dory",
                "video": false,
                "vote_average": 7.041,
                "vote_count": 12360,
                "character": "Dory (voice)",
                "credit_id": "52fe4af8c3a368484e1707ab",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ellen Lee DeGeneres",
            "엘런 드제너러스"
        ],
        "biography": "Ellen DeGeneres is an American stand-up comic, television host, and actress. She hosts the syndicated talk show The Ellen DeGeneres Show, and was also a judge on American Idol for one year, having joined the show in its ninth season.\n\nDeGeneres has hosted both the Academy Awards and the Primetime Emmys. As a film actress, she starred in Mr. Wrong, appeared in EDtv and The Love Letter, and provided the voice of Dory in the Disney-Pixar animated film Finding Nemo, for which she was awarded a Saturn Award for Best Supporting Actress, the first and only time a voice performance won a Saturn Award.\n\nShe also starred in two television sitcoms, Ellen from 1994 to 1998 and The Ellen Show from 2001 to 2002. During the fourth season of Ellen in 1997, DeGeneres came out publicly as a lesbian in an appearance on The Oprah Winfrey Show. Shortly afterwards, her character Ellen Morgan also came out to a therapist played by Winfrey, and the series went on to explore various LGBT issues including the coming out process.\n\nShe has won twelve Emmys and numerous other awards for her work and charitable efforts.",
        "birthday": "1958-01-26",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.ellentube.com",
        "id": 14,
        "imdb_id": "nm0001122",
        "known_for_department": "Acting",
        "name": "Ellen DeGeneres",
        "place_of_birth": "Metairie, Louisiana, USA",
        "popularity": 0.5257,
        "profile_path": "/z8IEEid4z63CBlJtxrTKEfsW7NA.jpg"
    }
}