{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sm3ErHMXQLaNdo74vbIa1JRXIXS.jpg",
                "genre_ids": [
                    18,
                    37
                ],
                "id": 1712,
                "original_language": "en",
                "original_title": "Giant",
                "overview": "Wealthy rancher Bick Benedict and dirt-poor cowboy Jett Rink both woo Leslie Lynnton, a beautiful young woman from Maryland who is new to Texas. She marries Benedict, but she is shocked by the racial bigotry of the White Texans against the local people of Mexican descent. Rink discovers oil on a small plot of land, and while he uses his vast, new wealth to buy all the land surrounding the Benedict ranch, the Benedict's disagreement over prejudice fuels conflict that runs across generations.",
                "popularity": 3.9693,
                "poster_path": "/oQ1Arue52pFLSvvwfcNTy16hTCG.jpg",
                "release_date": "1956-11-08",
                "title": "Giant",
                "video": false,
                "vote_average": 7.614,
                "vote_count": 722,
                "character": "Uncle Bawley",
                "credit_id": "52fe430ec3a36847f80373d7",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Theodore Childress Wills"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nChill Theodore Wills (July 18, 1902 – December 15, 1978) was an American film actor, and a singer in the Avalon Boys Quartet.\n\nHe was a performer from early childhood, forming and leading the Avalon Boys singing group in the 1930s. After appearing in a few westerns he disbanded the group in 1938, and struck out on a solo acting career.\n\nOne of his more memorable roles was that of the distinctive voice of Francis the Mule in a series of popular films. Wills' deep, rough voice, with its Western twang, was matched to the personality of the cynical, sardonic mule. As was customary at the time, Wills was given no billing for his vocal work, though he was featured prominently on-screen as blustery General Ben Kaye in the fourth entry, Francis Joins the WACS. He provided the deep voice for Stan Laurel's performance of \"The Trail of the Lonesome Pine\" in Way Out West (1937), in which the Avalon Boys Quartet appeared.\n\nWills was cast in numerous serious film roles, including as \"the city of Chicago\" as personified by a phantom police sergeant in the film noir City That Never Sleeps (1953), and that of Uncle Bawley in Giant (1956), which also features Rock Hudson, Elizabeth Taylor and James Dean. Wills was nominated for the Academy Award for Best Supporting Actor, for his role as Davy Crockett's companion \"Beekeeper\" in the film The Alamo (1960). However, his aggressive campaign for the award was considered tasteless by many, including the film's star/director/producer John Wayne, who publicly apologized for Wills. Wills' publicity agent, W.S. \"Bow-Wow\" Wojciechowicz, accepted blame for the ill-advised effort, claiming that Wills had known nothing about it. The Oscar was instead won by Peter Ustinov for his role as Lentulus Batiatus in Spartacus.\n\nIn Rory Calhoun's CBS western series The Texan, Wills appeared in the lead role in the 1960 episode entitled \"The Eyes of Captain Wylie\".\n\nWills starred in the short-run series Frontier Circus which aired for only one season (1961–62) on CBS. In 1966, he was cast in the role of a shady Texas rancher, Jim Ed Love, in the short-lived ABC comedy/western series The Rounders (reprising his role in the 1965 film The Rounders, starring Henry Fonda), with co-stars Ron Hayes, Patrick Wayne and Walker Edmiston.\n\nin 1963-64, Wills joined William Lundigan, Walter Brennan and Efrem Zimbalist Jr. in making appearances on behalf of U.S. Senator Barry Goldwater, the Republican nominee in the campaign against U.S. President Lyndon B. Johnson.\n\nIn 1968, Wills refused to support Richard Nixon for the presidency and served as master of ceremonies for George C. Wallace, former governor of Alabama, for the California campaign stops in Wallace's presidential campaign.[5] Wills was among the few Hollywood celebrities to endorse Wallace's bid against Nixon and Hubert H. Humphrey; another was Walter Brennan.\n\nAlso in 1968, he starred in the Gunsmoke episode \"A Noose for Dobie Price\", where he played Elihu Gorman, a former outlaw who joins forces with Marshal Matt Dillon, played by James Arness, to track down a member of his former gang who has escaped jail. His last role was in 1978, as a janitor in Stubby Pringle's Christmas. CLR\n\nDescription above from the Wikipedia article Chill Wills, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1902-07-18",
        "deathday": "1978-12-15",
        "gender": 2,
        "homepage": null,
        "id": 14001,
        "imdb_id": "nm0932629",
        "known_for_department": "Acting",
        "name": "Chill Wills",
        "place_of_birth": "Seagoville, Texas, USA",
        "popularity": 0.3776,
        "profile_path": "/uk1BljEiYkzSd7ihp7SJIpBVI3u.jpg"
    }
}