{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zh6IdheEYinU4TPtorWsjx6qPQE.jpg",
                "genre_ids": [
                    878,
                    10749,
                    35
                ],
                "id": 792307,
                "original_language": "en",
                "original_title": "Poor Things",
                "overview": "Brought back to life by an unorthodox scientist, a young woman runs off with a lawyer on a whirlwind adventure across the continents. Free from the prejudices of her times, she grows steadfast in her purpose to stand for equality and liberation.",
                "popularity": 12.5032,
                "poster_path": "/kCGlIMHnOm8JPXq3rXM6c5wMxcT.jpg",
                "release_date": "2023-12-07",
                "title": "Poor Things",
                "video": false,
                "vote_average": 7.671,
                "vote_count": 4949,
                "character": "Harry Astley",
                "credit_id": "62eb090f48333a005e9e1f31",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/1hdorswm5HPxb81xq84H9gqveUq.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 371638,
                "original_language": "en",
                "original_title": "The Disaster Artist",
                "overview": "An aspiring actor in Hollywood meets an enigmatic stranger by the name of Tommy Wiseau, the meeting leads the actor down a path nobody could have predicted; creating the worst movie ever made.",
                "popularity": 2.3112,
                "poster_path": "/2HuLGiyH0TPYxnCvYHAxc8K738o.jpg",
                "release_date": "2017-03-12",
                "title": "The Disaster Artist",
                "video": false,
                "vote_average": 7.107,
                "vote_count": 3617,
                "character": "Actor Friend",
                "credit_id": "589b55c0c3a3680c6b000219",
                "order": 32
            },
            {
                "adult": false,
                "backdrop_path": "/sTOhZruocNubL0HxjvdouwCEL9I.jpg",
                "genre_ids": [
                    16,
                    10751,
                    12,
                    35
                ],
                "id": 364689,
                "original_language": "en",
                "original_title": "Ferdinand",
                "overview": "Ferdinand, a little bull, prefers sitting quietly under a cork tree just smelling the flowers versus jumping around, snorting, and butting heads with other bulls. As Ferdinand grows big and strong, his temperament remains mellow, but one day five men come to choose the \"biggest, fastest, roughest bull\" for the bullfights in Madrid and Ferdinand is mistakenly chosen.  Based on the classic 1936 children's book by Munro Leaf.",
                "popularity": 6.1819,
                "poster_path": "/rMm94JsRfcOPiPVsTRcBiiVBOhz.jpg",
                "release_date": "2017-12-09",
                "title": "Ferdinand",
                "video": false,
                "vote_average": 7.222,
                "vote_count": 2975,
                "character": "Paco (voice)",
                "credit_id": "58dbe037c3a3687d3100d24e",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/BOeORWljjIPGuCwUgLls24ctF3.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 437586,
                "original_language": "en",
                "original_title": "mid90s",
                "overview": "In 1990s Los Angeles, a 13-year-old spends his summer navigating between a troubled home life and a crew of new friends he meets at a skate shop.",
                "popularity": 4.2091,
                "poster_path": "/9Tw0Y3DK5kGIU9X1yw3Q9gCkOlb.jpg",
                "release_date": "2018-10-19",
                "title": "mid90s",
                "video": false,
                "vote_average": 7.487,
                "vote_count": 1698,
                "character": "Security Guard (uncredited)",
                "credit_id": "5ab1cd340e0a261da600096f",
                "order": 25
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Rothaniel Jerrod Carmichael"
        ],
        "biography": "Rothaniel Jerrod Carmichael (born June 22, 1987) is an American stand-up comedian, actor, and writer. Carmichael created and starred in the semi-biographical NBC sitcom The Carmichael Show.\n\nAt the age of 20, Carmichael moved to Los Angeles to pursue his dream of being a stand-up comic, before he had ever tried stand-up. His first time doing stand-up was an open-mic night at The Comedy Store in West Hollywood. Working his way up through the clubs, Carmichael appeared in the \"New Faces\" showcase at the 2011 Just for Laughs Festival in Montreal. Carmichael's breakout role was in the 2014 film Neighbors. He was also on the TV show The Goodwin Games.\n\nHe has released three stand-up HBO comedy specials. The first, Jerrod Carmichael: Love at the Store, was released in 2014. It was directed by Spike Lee and filmed at The Comedy Store, where Carmichael had first performed stand-up. The second, Jerrod Carmichael: 8, was released on March 11, 2017. It was filmed in the New York Masonic Hall's Grand Lodge Room and directed by comedian Bo Burnham. The latest, Jerrod Carmichael: Rothaniel, also directed by Burnham, won him his first Primetime Emmy Award, and was notable for featuring the moment he came out as gay to the public.\n\nHis eponymous NBC sitcom, on which he starred in and produced, has been well-received and is notable for its envelope-pushing approach to topical subjects like Black Lives Matter, LGBT issues, gun rights, politics, and the reality of being African American in the United States. The show is semi-autobiographical.\n\nCarmichael made an appearance on Tyler, the Creator's fifth album Igor in 2019, narrating the album using short phrases to find logic in the title character Igor's state of mind. In the same year, he was hired by Quentin Tarantino to co-write a film adaptation based on the Django/Zorro crossover comic book series. He created, directed, produced, and starred in the HBO documentaries Home Videos and Sermon on the Mount which are autobiographical. He starred in the comedy thriller film On the Count of Three in 2021, which was also his feature directorial debut. In 2022, Carmichael hosted Saturday Night Live for the first time, and hosted the 80th Golden Globe Awards.\n\nIn 2023 Carmichael starred in Academy Award-winning film Poor Things, directed by Yorgos Lanthimos. In 2024, Carmichael will star in the Jerrod Carmichael Reality Show, a documentary series revolving around his life.",
        "birthday": "1987-06-22",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1400880,
        "imdb_id": "nm4273797",
        "known_for_department": "Acting",
        "name": "Jerrod Carmichael",
        "place_of_birth": "Winston-Salem, North Carolina, USA",
        "popularity": 0.3191,
        "profile_path": "/v1i5xodXbPw3blXYg4v0HmH3PGK.jpg"
    }
}