{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/iteE4cNHQm8PWmWDuKcCCnMLhS3.jpg",
                "genre_ids": [
                    18,
                    10749,
                    35
                ],
                "id": 9441,
                "original_language": "en",
                "original_title": "Stepmom",
                "overview": "Jackie is a divorced mother of two. Isabel is the career minded girlfriend of Jackie’s ex-husband Luke, forced into the role of unwelcome stepmother to their children. But when Jackie discovers she is ill, both women realise they must put aside their differences to find a common ground and celebrate life to the fullest, while they have the chance.",
                "popularity": 3.9855,
                "poster_path": "/wMPv2Yz6QDzv6YhSbaqM48Medl1.jpg",
                "release_date": "1998-12-25",
                "title": "Stepmom",
                "video": false,
                "vote_average": 7.151,
                "vote_count": 1490,
                "character": "Ad Executive",
                "credit_id": "5ead5c491a934f001ee8b0a3",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Sal completed work on an Independent film tentatively titled \"Building Girl\" and another entitled \"Immaculate Misconception\" He recreated his role of Pirelli in the top notch production of Sweeney Todd at Seattle's 5TH Avenue Theatre. David Armstrong, the Artisitic Director, staged this critically lauded and audience pleasing gem. It was part of the Halloween season and as it had never been seen in Seattle the reaction was effusively enthusiastic. He played John Tedesco, the Law firm partner to John Rubinstein's George Simon, in Off-Broadway's Counsellor At Law by Elmer Rice at the St. Clement Theatre. This classic 1930's play received great audience and critical support along with two Lucille Lortel Awards. It garnered the Best Revival for the play and Best Actor award for John Rubinstein's insightful and moving portrayal. Dan Wackerman, the director, received the coveted Obie Award for his work. Sal shot a Law & Order episode entitled \"Fluency\" appearing with Dennis Farina and Jesse Martin and did a Third Watch episode \"In The Family Way\" as Lawyer Alexander Sapp. In the Law & Order, \"Acts of Contrition\" episode he was seen as yet another lawyer named Wright. He was Coordinating/Aritistic Director last season for the Sutton Place Synagogue's (the UN's Synagogue) first Spring Sing Cabaret/Concert: Sutton 'Ly Spring. Gathered for this event were Broadway veteran's Karen Mason (Mamma Mia/Sunset Blvd),Nat Chandler (Scarlet Pimpernel), Wayne Scherzer (Les Miserables), Patricia Parker (Doll's Life) and Beth Glover (Counsellor At Law) as well as the talented Cabaret singer Julie Reyburn. Sal sang his \"signature\" song \"On This Night Of A Thousand Stars\" from his role as Magaldi in the Broadway and First National companies of Evita. He has also enjoys volunteer singing for the Vocal Ease Organization.  - IMDb Mini Biography By: Sal Mistretta",
        "birthday": "1945-01-09",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1400907,
        "imdb_id": "nm0592984",
        "known_for_department": "Acting",
        "name": "Sal Mistretta",
        "place_of_birth": "Brooklyn, New York,  USA",
        "popularity": 0.2703,
        "profile_path": null
    }
}