{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rgy1Nf2kf7UodG4BI6awfQqttac.jpg",
                "genre_ids": [
                    18,
                    10749,
                    10752
                ],
                "id": 907,
                "original_language": "en",
                "original_title": "Doctor Zhivago",
                "overview": "The life of a Russian physician and poet who, although married to another, falls in love with a political activist's wife and experiences hardship during World War I and then the October Revolution.",
                "popularity": 4.3851,
                "poster_path": "/r0Iv2BiCFYDnzc6uU1q3AJ56igT.jpg",
                "release_date": "1965-12-22",
                "title": "Doctor Zhivago",
                "video": false,
                "vote_average": 7.542,
                "vote_count": 1206,
                "character": "Anna",
                "credit_id": "52fe428bc3a36847f8026ff3",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Siobhán Giollamhuire Nic Cionnaith"
        ],
        "biography": "Siobhán McKenna (1923-1986) was an acclaimed Irish actress known for her captivating stage and screen performances. Born in Belfast, Northern Ireland, McKenna developed a passion for acting from a young age and went on to become one of Ireland's most celebrated thespians.\n\nAfter graduating from University College Dublin, McKenna began her professional acting career on the Irish stage, earning critical acclaim for her powerful interpretations of classic roles such as Pegeen Mike in J.M. Synge's \"The Playboy of the Western World\" and Nora Clitheroe in Sean O'Casey's \"The Plough and the Stars.\" Her talent and natural stage presence soon caught the attention of film directors, and she transitioned to the silver screen, delivering memorable performances in movies like \"Ryan's Daughter\" and \"The Playboy of the Western World.\"\n\nThroughout her career, McKenna was recognized with numerous accolades, including three Irish Film and Television Awards and a BAFTA. She was also honored with a prestigious CBE in 1977 for her contributions to the arts. Beyond her acting work, McKenna was deeply committed to preserving and promoting Irish culture and was an outspoken advocate for human rights and social justice causes.",
        "birthday": "1923-05-24",
        "deathday": "1986-11-16",
        "gender": 1,
        "homepage": null,
        "id": 14012,
        "imdb_id": "nm0571430",
        "known_for_department": "Acting",
        "name": "Siobhán McKenna",
        "place_of_birth": "Belfast, Northern Ireland, UK",
        "popularity": 0.1184,
        "profile_path": "/hBWTNcFzhvtdBKd54JnlCJWf8HO.jpg"
    }
}