{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/w7Z4BVMin49voNN61IUWyN9DopV.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 86837,
                "original_language": "fr",
                "original_title": "Amour",
                "overview": "Georges and Anne are in their eighties. They are cultivated, retired music teachers. Their daughter, who is also a musician, lives abroad with her family. One day, Anne has a stroke, and the couple's bond of love is severely tested.",
                "popularity": 3.2873,
                "poster_path": "/19hyCudualHxCD0GrEngqsi0wBF.jpg",
                "release_date": "2012-09-20",
                "title": "Amour",
                "video": false,
                "vote_average": 7.756,
                "vote_count": 1690,
                "character": "Geoff",
                "credit_id": "52fe49a49251416c910b3d7d",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "William Shimell (born Brentwood, Essex, 23 September 1952) is an English baritone who has had an active international career performing in opera and on the concert platform since the 1980s, and more recently has appeared in non-singing roles in films.\n\nShimell studied at the Guildhall School of Music and Drama and at the National Opera Studio. For his student performance at the Guildhall the Opera critic noted \"William Shimells's Figaro stood out from all the others. His is a rich, full-toned baritone voice, and he used it to great musical and dramatic effect.\"\n\nHe joined the chorus of Kent Opera in 1978 and sang an usher in Rigoletto with them in 1980 and Venus and Adonis in the UK and Venice. At Sadler's Wells in 1981 he appeared as Young Scrooge in Musgrave's Christmas Carol.\n\nHe sang Masetto in Don Giovanni in February 1980 at London Coliseum for English National Opera, going on to sing Gregory in the new production of Romeo and Juliet in March 1981 and a Herald in the new production of Otello in September 1981, and other roles subsequently with the company. He made his debut at Glyndebourne Opera in May 1984 as Count Almaviva, and at La Scala in 1991 was Baron Dourlinski in Lodoïska. Other opera companies with which he appeared in the earlier part of his career include San Francisco Opera (1988), Frankfurt Opera (1988), Grand Theatre Geneva (1989), Vienna State Opera (1990), Lyric Opera Chicago (1991).\n\nAt Covent Garden he made his debut as Schaunard in La bohème in 1985, going on to sing in Così fan tutte (1986 and 1992 – as Guglielmo), Werther (1987 – Albert), Capriccio (1991 – Olivier), La bohème (1996 – Marcello), The Rake's Progress (2010 – Nick Shadow), Così fan tutte (2010 – Don Alfonso), and Manon (2010 - De Brétigny). At the Metropolitan Opera in New York Shimell made his debut in La bohème in 1996 as Marcello, continuing with Così fan tutte (1996 and 2010 – Don Alfonso), Madama Butterfly (2000 – Sharpless), Manon (2005 – De Brétigny) and Iphigénie en Tauride (2007 – Thoas).\n\nWith major companies, Shimell has sung the title roles in Le nozze di Figaro and Don Giovanni, Papageno, Dandini, and Malatesta.\n\nIn 1983 Shimell won the Shell International Opera Prize and he sang at the Last Night of the Proms in 1984.\n\nIn 2008 Shimell was working with Iranian director Abbas Kiarostami in a production of Così fan tutte at the Aix-en-Provence Festival, when Kiarostami offered him a non-singing role in a film. Shimell had very little knowledge of cinema, but his fluency in French and Italian helped during filming (the initial script had been translated from Persian to French to English). The film, Certified Copy (Copie conforme), was released in 2010. Shimell then took a role in the film Amour (2012).\n\nHe has appeared on a few audio recordings, including the title role in Don Giovanni under Riccardo Muti, A Sea Symphony by Vaughan Williams, Royal Liverpool Philharmonic Orchestra, Vernon Handley, Mass in B minor BWV232 by JS Bach, Summer's last will and testament by Lambert, Funeral cantata on the death of Emperor Joseph II, and Pulcinella.\n\nSource: Article \"William Shimell\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1952-09-23",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 140238,
        "imdb_id": "nm1468516",
        "known_for_department": "Acting",
        "name": "William Shimell",
        "place_of_birth": "Brentwood, Essex, England, UK",
        "popularity": 0.6666,
        "profile_path": "/w5LOSXe2Wtul1sUWVWpw8d7WHP6.jpg"
    }
}