{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/92tLofRwuX0mdqcybPz03xhpIgS.jpg",
                "genre_ids": [
                    9648,
                    53,
                    18
                ],
                "id": 663260,
                "original_language": "fr",
                "original_title": "Boîte noire",
                "overview": "Mathieu is a young and talented black box analyst on a mission to solve the reason behind the deadly crash of a brand new aircraft. Yet, when the case is closed by authorities, Mathieu cannot help but sense there is something wrong with the evidence. As he listens to the tracks again, he starts detecting some seriously disturbing details. Could the tape have been modified? Going against his boss' orders, Mathieu begins his own rogue investigation - an obsessional and dangerous quest for truth that will quickly threaten far more than his career...",
                "popularity": 3.2567,
                "poster_path": "/nNY5YnqCsMEggz2Z0kCl4Fclc1N.jpg",
                "release_date": "2021-09-08",
                "title": "Black Box",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1342,
                "character": "Pauline",
                "credit_id": "61362f941b7294002aba2a5b",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Marie Dompnier is a French actress, singer and director born in 1980 in Toulouse, Haute-Garonne, in France, best known both in France and internationally for her role as Lieutenant Sandra Winckler in the TV series Witnesses (Les Témoins).\n\nFrom 2000 to 2002, Dompnier took professional training as an actor in the Ateliers du Sapajou in Paris, Marie furthered her education in 2003, at the Centre Dramatique National in Poitiers. From 2002 to 2004, she also studied at the Conservatoire National Superieur d'Art Dramatique, 5th arrondissement of Paris. Dompnier joined the L’École régionale d’acteurs de Cannes in 2004, graduating in 2007.\n\nDompnier spent most of her early acting career performing in classical and contemporary works in the theatre. Dompnier was part of the company Artéria in residence at the Théâtre du Soleil until 2004. Then Marie joined the collective \"La Vie brief\", with whom she played Robert Plankett in 2011, in a staging of Jeanne Candel. In 2014, Dompnier was part of the taste of fake and other songs, in Jeanne Candel. In 2012, she appeared for the first time in the cinema in Dante Desarthe's Je fais feu de tout bois, before securing a small role in the television series Caïn in 2012 and Détectives in 2013.\n\nIn 2014, she played the role of Charlotte Poussin in the film Les Gazelles alongside myriad actresses including Camille Chamoux, also co-writer. She befriended the latter and staged her show, born under Giscard.\n\nDompnier was spotted during a \"face camera\" staging, by director Hervé Hadmar, and offered her the main role of his TV series Witnesses on France 2 alongside Thierry Lhermitte in 2015. At the time, Dompnier was unknown to the general public and the channel was hesitant to accept the casting, but the creators confirm their choice. Thanks to this role of Lieutenant Sandra Winckler, she obtained the Golden FIPA of female interpretation at the Festival International des programmes audiovisuals of Biarritz 2015. The British TV company Channel 4 secured rights to air the first series of French crime TV series Witnesses in 2015, and the BBC acquired rights to broadcast series 2 of Witnesses on BBC 4 and I-Player in late 2017.\n\nIn 2019, Dompnier starred in the disaster TV miniseries La Dernière Vague (The Last Wave), for France 2. In 2021, Dompnier starred in the Rodolphe Tissot directed television film Clèves, and as La directrice d'enquête in the French feature film Les Choses humaines (En. The Accusation).\n\nSource: Article \"Marie Dompnier\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1980-09-19",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1402606,
        "imdb_id": "nm5095015",
        "known_for_department": "Acting",
        "name": "Marie Dompnier",
        "place_of_birth": "Toulouse, HauteGaronne, France",
        "popularity": 0.4038,
        "profile_path": "/vvi3ICP4lHjRCIzngD8RtpoGMSD.jpg"
    }
}