{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/f133nWlU6yUkZqqwcCXCbTEJWHr.jpg",
                "genre_ids": [
                    12,
                    28
                ],
                "id": 87,
                "original_language": "en",
                "original_title": "Indiana Jones and the Temple of Doom",
                "overview": "After arriving in India, Indiana Jones is asked by a desperate village to find a mystical stone. He agrees – and stumbles upon a secret cult plotting a terrible plan in the catacombs of an ancient palace.",
                "popularity": 8.1711,
                "poster_path": "/gpdVNUaa4LhRMLfJOPj1AZdhAZ3.jpg",
                "release_date": "1984-05-23",
                "title": "Indiana Jones and the Temple of Doom",
                "video": false,
                "vote_average": 7.303,
                "vote_count": 9703,
                "character": "Village Woman",
                "credit_id": "5496f6d89251416e2b0067ac",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Denawaka Hamine",
            "D.M. Denawake",
            "Dona Georgiana Meraya Denawaka"
        ],
        "biography": "Kalasuri Dona Meraya Denawaka was a Sri Lankan actress. \"The grand old lady\" was known for portraying elderly characters. Hamine was born 20 February 1906 in Imbulgoda, Gampaha. She was by profession a school teacher until a chance encounter with G. D. L. Perera when she accompanied a young actress to a theatrical audition, led to her winning the role of an elderly mother in Perera's play Kandulu. Due to her masterful performance in the role, Perera brought Hamine into his drama group Kala Pela; she would play in Kala Pela productions like Manamalayo, Sakkarawattang and Sama and was honored with a merit award at the 1964 Arts Council Drama Festival for her role in Totupola. Hamine's debut film role was in the film adaption of Sama by Perera reprising the role she had popularized in the play. In Sath Samudura she played the mother of two fishermen to much critical rave. She was presented a Best Character Actress Award for the role by a special government council. It was delivered on stage by the then Sri Lankan prime minister Dudley Senanayake. In the 1970s, Hamine had major roles in Tun Man Handiya, Desa Nisa Kolomba Sanniya and Matara Achchi. ",
        "birthday": "1906-02-20",
        "deathday": "2002-12-09",
        "gender": 1,
        "homepage": null,
        "id": 1402263,
        "imdb_id": "nm0358232",
        "known_for_department": "Acting",
        "name": "Denavaka Hamine",
        "place_of_birth": "Gampaha - Sri Lanka",
        "popularity": 0.2553,
        "profile_path": "/7X4IyYKLEw0TwbMHGXjTPxcErOd.jpg"
    }
}