{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xQRh7hSPdtEE0aUmuY8EdifrXPK.jpg",
                "genre_ids": [
                    10402,
                    18
                ],
                "id": 12545,
                "original_language": "en",
                "original_title": "Jesus Christ Superstar",
                "overview": "As played out by a theatre troupe, the last days of Jesus Christ are depicted from the perspective of Judas Iscariot, his betrayer. As Jesus' following increases, Judas begins to worry that Jesus is falling for his own hype, forgetting the principles of his teachings and growing too close to the prostitute Mary Magdalene.",
                "popularity": 3.2474,
                "poster_path": "/p5LGgKCVGGVZKTkwKzpBDIesydj.jpg",
                "release_date": "1973-08-15",
                "title": "Jesus Christ Superstar",
                "video": false,
                "vote_average": 7.091,
                "vote_count": 580,
                "character": "Woman",
                "credit_id": "549af4ec9251414bb200043a",
                "order": 25
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Denise Pence-Boockvor"
        ],
        "biography": "Denise Pence is an American actress, who began her career on Broadway as a gypsy dancer in the Michael Kidd production of The Rothschilds and Pippin, directed by Bob Fosse. She and her husband, Director, Steve Boockvor, were immortalized in A Chorus Line as \"Al\" and \"Kristine\" Pence went on to appear in the film, Jesus Christ Superstar directed by Norman Jewison, appeared briefly in Threesome, a movie of the week for CBS. Born in Texas, Pence moved to New York to pursue a career as an actress and dancer. She moved into the Rehearsal Club and lived there for a number of years before receiving her first big break. Pence is probably best known for her role as \"Katie Parker,\" R.N., on the soap opera Guiding Light appearing as a contract player from June 1977 through April 1985. She subsequently went on to appear in Irma La Douce at the now defunct Darien Dinner Theater. Other roles include: \"Connie\" in Come Blow Your Horn opposite Lyle Waggoner, \"Lina Lamont\" in Singing in the Rain at Theater by the Sea, RI, and \"Ms Cratchett\" and \"Tesse Tura\" in Gypsy, directed by Stephen Schwartz at Candlewood Playhouse, CT.",
        "birthday": "1949-01-01",
        "deathday": null,
        "gender": 0,
        "homepage": null,
        "id": 1403597,
        "imdb_id": "nm0671623",
        "known_for_department": "Acting",
        "name": "Denise Pence",
        "place_of_birth": "Rapid City - USA",
        "popularity": 1.2267,
        "profile_path": null
    }
}