{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xQRh7hSPdtEE0aUmuY8EdifrXPK.jpg",
                "genre_ids": [
                    10402,
                    18
                ],
                "id": 12545,
                "original_language": "en",
                "original_title": "Jesus Christ Superstar",
                "overview": "As played out by a theatre troupe, the last days of Jesus Christ are depicted from the perspective of Judas Iscariot, his betrayer. As Jesus' following increases, Judas begins to worry that Jesus is falling for his own hype, forgetting the principles of his teachings and growing too close to the prostitute Mary Magdalene.",
                "popularity": 3.2474,
                "poster_path": "/p5LGgKCVGGVZKTkwKzpBDIesydj.jpg",
                "release_date": "1973-08-15",
                "title": "Jesus Christ Superstar",
                "video": false,
                "vote_average": 7.091,
                "vote_count": 580,
                "character": "Woman",
                "credit_id": "549aeb6cc3a3682f23001e48",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Darcel Leonard Wynne",
            "Darcel"
        ],
        "biography": "Darcel Leonard Wynne, sometimes credited as simply Darcel, is an African-American dancer, choreographer, author and producer, best known for heading the \"Solid Gold Dancers\" on the syndicated 1980s music series Solid Gold. Darcel started dancing professionally at the age of 13. She danced in films, on television, performed on Broadway, and choreographed and performed for shows in Las Vegas. Darcel also staged and toured the United States with her own one-woman production. Darcel danced and toured with the legendary Temptations. As her popularity grew, so did her exposure in the entertainment world and she soon appeared in the films Xanadu, Jesus Christ Superstar, Night Shift, The Girl, the Gold Watch and Dynamite, The Last Married Couple in America, Mame, Scrooged, Funny Girl and Funny Lady. Darcel was also featured in the Kool & the Gang video for their single \"Fresh\". Some of Darcel’s television credits include The Sammy Davis Jr. Show, NBC Follies, Redd Foxx Show, Leslie Uggams Show, Pearl Bailey Show, The Sonny & Cher Comedy Hour and the Carol Burnett Show.",
        "birthday": "1953-06-13",
        "deathday": null,
        "gender": 0,
        "homepage": null,
        "id": 1403589,
        "imdb_id": "nm0944020",
        "known_for_department": "Acting",
        "name": "Darcel Wynne",
        "place_of_birth": "Pittsburgh, Pennsylvania, USA",
        "popularity": 0.0538,
        "profile_path": null
    }
}