{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/c8Pi8F1FzpNebtgXcSjC9nWCdSW.jpg",
                "genre_ids": [
                    35,
                    10752
                ],
                "id": 914,
                "original_language": "en",
                "original_title": "The Great Dictator",
                "overview": "Dictator Adenoid Hynkel tries to expand his empire while a poor Jewish barber tries to avoid persecution from Hynkel's regime.",
                "popularity": 4.0004,
                "poster_path": "/nhMXB8GTdswYMCL9nepDZymJCOr.jpg",
                "release_date": "1940-10-15",
                "title": "The Great Dictator",
                "video": false,
                "vote_average": 8.292,
                "vote_count": 3523,
                "character": "Mrs. Jaeckel",
                "credit_id": "52fe428cc3a36847f802748f",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nEmma Dunn (26 February 1875 – 14 December 1966) was an English character actress on the stage and in motion pictures.\n\nEmma Dunn appeared onstage in her early teens, graduating to the London stage for several years and later became a noted Broadway actress. She appeared in the first American production of Ibsen's Peer Gynt (1906) with Richard Mansfield as Peer. She played Peer's mother, Ase, even though she was, in real life, 20 years younger than Mansfield. She appeared in three productions for theatre impresario David Belasco: The Warrens of Virginia (1907), The Easiest Way (1909) and The Governor's Lady (1912). In The Easiest Way, Dunn portrayed Annie, who was black, in blackface. In 1913 Dunn appeared in vaudeville.\n\nDunn made her first film in 1914, a silent film of her 1910 stage success, Mother, directed by Maurice Tourneur. This was Tourneur's first American film. Dunn's second film was 1920's Old Lady 31, reprising the role she played in the 1916 Broadway play of the same name. One more silent film followed in 1924, Pied Piper Malone, before she made her talkie debut in Side Street, co-starring the Moore brothers, Matt, Owen and Tom as her sons.\n\nDunn wrote two books on elocution and speech: Thought Quality in the Voice (1933) and You Can Do It (1947).\n\nEmma Dunn was born 26 February 1875, in Birkenhead, England, although she sometimes gave her year of birth as 1883.\n\nDunn married Harry Beresford, an actor who was then known professionally as Harry J. Morgan, in Chicago on 4 October 1897. They divorced on 10 February 1909, in New York City. She was awarded sole custody of their young daughter, Dorothy. On 19 May 1909, Dunn married John W. Stokes (John W. S. Sullivan), an actor, playwright and theatrical manager. They subsequently adopted a second daughter, Helen. The couple divorced sometime between 1923 and Stokes' death in 1931.\n\nAfter suffering a heart attack some months before, Dunn died 14 December 1966, in Los Angeles, California, aged 91.",
        "birthday": "1874-02-24",
        "deathday": "1966-12-14",
        "gender": 1,
        "homepage": null,
        "id": 14033,
        "imdb_id": "nm0242562",
        "known_for_department": "Acting",
        "name": "Emma Dunn",
        "place_of_birth": "Birkenhead, Cheshire, England, UK",
        "popularity": 0.0995,
        "profile_path": "/gg8SC7cBPYWzGqjYSJ3qWcpy0vI.jpg"
    }
}