{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1Cuaush5VwesuZJzJRy2ptfalCh.jpg",
                "genre_ids": [
                    10751,
                    14,
                    35,
                    12
                ],
                "id": 2899,
                "original_language": "fr",
                "original_title": "Astérix & Obélix : Mission Cléopâtre",
                "overview": "History's favorite Gauls assist Queen Cleopatra when she wagers that the Egyptian people can build a palace for Julius Caesar in just three months.",
                "popularity": 5.6606,
                "poster_path": "/5gMmVSkY7RAxb5xRk7ej7JVhXyl.jpg",
                "release_date": "2002-01-30",
                "title": "Asterix & Obelix: Mission Cleopatra",
                "video": false,
                "vote_average": 7.373,
                "vote_count": 3654,
                "character": "Caius Céplus",
                "credit_id": "54fdb513c3a3681638004502",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Dieudonné M'Bala",
            "Dieudonné M'Bala M'Bala",
            "Dieudonné Mbala Mbala"
        ],
        "biography": "Dieudonné M'bala M'bala, generally known by his stage name Dieudonné, is a French comedian, actor, and political activist. His father is from Cameroon; his mother is from France. Dieudonné initially achieved success with a Jewish comedian, Élie Semoun, humorously exploiting racial stereotypes. He campaigned against racism and was a candidate in the 1997 and 2001 legislative elections in Dreux against the National Front, the French far-right political party that he perceived as racist. On 1 December 2003, Dieudonné performed a sketch on a TV show about an Israeli settler whom he depicted as a Nazi. Some critics argued that he had \"crossed the limits of antisemitism\" and several organizations sued him for incitement to racial hatred. Dieudonné refused to apologize and denounced Zionism and the Jewish lobby. Dieudonné approached Jean-Marie Le Pen, leader of the National Front political party that he had fought earlier, and the men became political allies and friends. Holocaust denier Robert Faurisson appeared in one of his shows in 2008. Dieudonné described Holocaust remembrance as \"memorial pornography\". Dieudonné was convicted in court eight times on antisemitism charges. Dieudonné subsequently found himself with increasing frequency banned from mainstream media, and many of his shows were cancelled by local authorities. Active on the internet and in his Paris theater, Dieudonné has continued to have a following. His quenelle signature gesture became notorious in 2013, particularly after footballer Nicolas Anelka used the gesture during a match in December 2013. His recent appearances and videos are often rants in which the \"Jewish lobby\" and \"Israel lobby\" are characterised as controlling things. After Dieudonné was recorded during a performance mocking a Jewish journalist, suggesting it was a pity that he was not sent to the gas chambers, French Interior Minister Manuel Valls stated that Dieudonné was \"no longer a comedian\" but was rather an \"anti-Semite and racist\" and that he would seek to ban all Dieudonné's public gatherings as a public safety risk. The ban on his shows has been upheld by French courts. Dieudonné has also been known to associate with Mahmoud Ahmadinejad (President of Iran from 2005 to 2013), who has himself been accused of describing the Holocaust as a myth. On 25 February 2015 Ahmadinejad Tweeted \"Visiting an old friend, a great artist.\" the tweet included photographs of himself and Dieudonné, arms around each other, smiling. The two also met in 2009 during a visit by Dieudonné to the Islamic Republic of Iran where they reportedly discussed their shared anti-Zionist views.\n\nsource wikipedia",
        "birthday": "1966-02-11",
        "deathday": null,
        "gender": 2,
        "homepage": "https://dieudosphere.com/",
        "id": 140457,
        "imdb_id": "nm0226386",
        "known_for_department": "Acting",
        "name": "Dieudonné",
        "place_of_birth": "Fontenay-aux-Roses, Paris, France",
        "popularity": 0.1715,
        "profile_path": "/hcAXaCmKECdvW3pXZYseJs9JJBG.jpg"
    }
}