{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5YZbUmjbMa3ClvSW1Wj3D6XGolb.jpg",
                "genre_ids": [
                    878,
                    12,
                    28,
                    35
                ],
                "id": 447365,
                "original_language": "en",
                "original_title": "Guardians of the Galaxy Vol. 3",
                "overview": "Peter Quill, still reeling from the loss of Gamora, must rally his team around him to defend the universe along with protecting one of their own. A mission that, if not completed successfully, could quite possibly lead to the end of the Guardians as we know them.",
                "popularity": 16.4234,
                "poster_path": "/r2J02Z2OpNTctfOSN1Ydgii51I3.jpg",
                "release_date": "2023-05-03",
                "title": "Guardians of the Galaxy Vol. 3",
                "video": false,
                "vote_average": 7.931,
                "vote_count": 7651,
                "character": "Orgocorp Host Friniki",
                "credit_id": "64508022e942ee00e5e45fde",
                "order": 39
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Tiffany Marie Smith"
        ],
        "biography": "Tiffany Smith has appeared on The CW's Supernatural and Jane The Virgin, the McG FOX pilot Behind Enemy Lines, and the recent psychological thriller, House of Demons. She is also an On-Camera Host, Actress, Influencer and go-to Geek Gal. From cons and carpets to set visits and #setlife, Tiffany succeeds in various live and on-camera roles, in all realms of media. She has hosted network/cable TV shows and specials (AMC's Geeking Out, CW Fan Feast, G4's Attack of The Show!); digitally live-streamed premiere and award show red carpets (WB, CW, NBCU, Syfy/Syfy Wire, DCE, IGN, Oxygen, Disney, Netflix, E!, Focus Features, Marvel, Sony Pictures) and con/expo coverage (SDCC, NYCC, C2E2, WonderCon, E3); and multiple digital/new media series' (CW Fan Talk: The Flash, Collider Jedi Council, DC All Access, Syfy's Krypton Trivia Series, Fandango Movie3Some and Weekend Ticket, Screenvision, Nerdist, The Chive, Crafting Comics, AT&T U-Verse Buzz). She has also appeared as a film/TV expert and correspondent on Dr. Drew On Call, Michaela HLN, E!'s ATT Live 360 and HLN's The Daily Share, to name a few. Her collective social following of 150k+ and ability to reach millions across her platforms, has landed her branded digital and social media partnerships with Dairy Queen/Marvel, Warner Bros., Hershey's, Delta, Xbox, Cricket Wireless and Ford.",
        "birthday": "1982-11-29",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1404452,
        "imdb_id": "nm4227751",
        "known_for_department": "Acting",
        "name": "Tiffany Smith",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.2394,
        "profile_path": "/7kPvIwIEJ5WuoQgOnrxjngyl3Sp.jpg"
    }
}