{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ki5RnA0xNOEd3R0RohXqJt9R6Om.jpg",
                "genre_ids": [
                    28,
                    12
                ],
                "id": 177677,
                "original_language": "en",
                "original_title": "Mission: Impossible - Rogue Nation",
                "overview": "Ethan and team take on their most impossible mission yet—eradicating 'The Syndicate', an International and highly-skilled rogue organization committed to destroying the IMF.",
                "popularity": 10.1938,
                "poster_path": "/jwqL7croP7JMVfz0l9o7V4yJsJO.jpg",
                "release_date": "2015-07-28",
                "title": "Mission: Impossible - Rogue Nation",
                "video": false,
                "vote_average": 7.218,
                "vote_count": 9300,
                "character": "Chairman",
                "credit_id": "5633fb66c3a3681b5c016103",
                "order": 15
            },
            {
                "adult": false,
                "backdrop_path": "/fOzPQKNcMzraCh2YGeJVx4zEKtF.jpg",
                "genre_ids": [
                    10402,
                    10749,
                    18
                ],
                "id": 382399,
                "original_language": "en",
                "original_title": "High Strung",
                "overview": "When a hip hop violinist busking in the New York subway encounters a classical dancer on scholarship at the Manhattan Conservatory of the Arts, sparks fly. With the help of a hip hop dance crew they must find a common ground while preparing for a competition that could change their lives forever.",
                "popularity": 3.7205,
                "poster_path": "/xfj4Vomg8h3I1hBHj4GfpduUfkv.jpg",
                "release_date": "2016-04-08",
                "title": "High Strung",
                "video": false,
                "vote_average": 7.05,
                "vote_count": 921,
                "character": "Peterson",
                "credit_id": "5d0cc1d7c3a368168220a89e",
                "order": 24
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Nigel is an American actor based in London England. He has worked as a professional actor and voice over artist since 1968, when he joined AEA. He is also a member of British Equity, SAG and AFTRA. Nigel has worked on stage (Drama and Musical Theatre) in Film, Television and Radio, as well as a Commercial Print and Voice Over artist. Nigel has just completed, 2014, shooting the features 'Firequake', playing the male lead 'Declan Glas' staring opposite Alexandra Paul, 'High Strung' a Michael Damian film, with Jane Seymour and Paul Freeman, as well as 'Lake Placid 5', playing the 'Mayor', directed by Stephan Faust. This year, 2014, Nigel appeared as 'Frank' in the world premier of 'A Hard Rain', directed by Tricia Thorns, for Above The Stag in London and was in the original cast of 'The Bodyguard -The Musical', at the Adelphi Theatre, West End, London. Nigel appeared as the lead, 'James Arthur Ray' in the world premier of 'Hearts On Fire', being short listed for best performance at the Edinburgh Festival. \"The brilliant Nigel Barber as Ray speaks with a passionate, glazed-eyed delusion whose effects are frightening to behold\" Broadway Baby. \"Nigel Barber, believable, powerful and terrifying\". US military service. American and British passport holder. Extensive Green Screen experience. Extensive Voice Over experience. Training: Certificate Program in Professional Acting, Pacific Conservatory of the Performing Arts. Advanced Acting Technique, The Actors Workshop - Los Angeles. Adler Technique - Level III, Stella Adler Academy of Acting and Theatre - Los Angeles. Sal Dano Actors Workshop - Los Angeles. The Actors Centre - London. Nathan Osgood Actors Studio - London.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1404403,
        "imdb_id": "nm0053443",
        "known_for_department": "Acting",
        "name": "Nigel Barber",
        "place_of_birth": null,
        "popularity": 0.1465,
        "profile_path": "/x28iFuA9LUBMxpWatTdUFPEXSIC.jpg"
    }
}