{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gOK4jq0xG464aBMaPeWaTISnTZK.jpg",
                "genre_ids": [
                    18,
                    53,
                    9648
                ],
                "id": 54186,
                "original_language": "ja",
                "original_title": "告白",
                "overview": "Devastated at the death of her four-year-old daughter, a grieving middle school teacher is horrified to discover that her students aren't as innocent as she thinks.",
                "popularity": 3.1148,
                "poster_path": "/xQcnx6jMuPRCeidotgVy6YIls6p.jpg",
                "release_date": "2010-06-04",
                "title": "Confessions",
                "video": false,
                "vote_average": 7.581,
                "vote_count": 923,
                "character": "Shuka Kiritani",
                "credit_id": "563d72f992514129fe01b1a7",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/bh5jnK2SeUw7iTbg9QHIi24S01Q.jpg",
                "genre_ids": [
                    18,
                    16,
                    10749,
                    10752,
                    36
                ],
                "id": 378108,
                "original_language": "ja",
                "original_title": "この世界の片隅に",
                "overview": "Japan, 1943, during World War II. Young Suzu leaves her village near Hiroshima to marry and live with her in-laws in Kure, a military harbor. Her creativity to overcome deprivation quickly makes her indispensable at home. Inhabited by an ancestral wisdom, Suzu impregnates the simple gestures of everyday life with poetry and beauty. The many hardships, the loss of loved ones, the frequent air raids of the enemy, nothing alters her enthusiasm…",
                "popularity": 3.731,
                "poster_path": "/9Z4H4M2F8OQTB04YC1Opds8MFBb.jpg",
                "release_date": "2016-11-12",
                "title": "In This Corner of the World",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 587,
                "character": "Suzu Hojo (voice)",
                "credit_id": "599c5b1e92514126ae00fa84",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Rena Nônen",
            "Rena Nounen",
            "노넨 레나"
        ],
        "biography": "Rena Nounen is a Japanese actress and fashion model from Kamikawa, Hyogo Prefecture. She is best known for her lead roles on the NHK drama series Amachan (2013).\n\nShe debuted as a fashion model in 2006 and was selected as the eleventh image character for Calpis in 2012. In 2012 she was chosen in an audition of 1953 women to play the heroine in the 2013 NHK Asadora Amachan, in which she plays a high school girl who decides to become an ama, or female shell diver, as well as an idol. Amachan was a rating success, earning an average 20.6% rating over the span of the series, second amongst Asadora only to Umechan Sensei (at 20.7%) in the last decade. Nounen served as the \"PR Ambassador\" for the 2013 Kohaku Uta Gassen and was a featured performer on the show, singing and leading the band.\n\nIn July 2016, it was announced that she changed her stage name to \"Non\". In August 2017, she started up the music label “KAIWA(RE)CORD” and will begin producing full-fledged music.",
        "birthday": "1993-07-13",
        "deathday": null,
        "gender": 1,
        "homepage": "https://nondesu.jp",
        "id": 1405924,
        "imdb_id": "nm3945531",
        "known_for_department": "Acting",
        "name": "Non",
        "place_of_birth": "Kamikawa, Hyogo, Japan",
        "popularity": 1.6022,
        "profile_path": "/yBiPy9oeHZSZLuGuTUgGk0PONbd.jpg"
    }
}