{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gz3rCM34UicmOxRY1T2SgiQZJoS.jpg",
                "genre_ids": [
                    18
                ],
                "id": 249164,
                "original_language": "en",
                "original_title": "If I Stay",
                "overview": "Mia Hall, a talented young cellist, thought the most difficult decision she would ever have to make would be whether to pursue her musical dreams at prestigious Juilliard or follow her heart to be with the love of her life, Adam, a rock singer/guitarist. However, a car wreck changes everything in an instant, and now Mia's life hangs in the balance. Suspended between life and death, Mia faces a choice that will decide her future.",
                "popularity": 3.7143,
                "poster_path": "/7Twh8h3Wh7GC9npTAEUThgkxkWL.jpg",
                "release_date": "2014-08-21",
                "title": "If I Stay",
                "video": false,
                "vote_average": 7.366,
                "vote_count": 4239,
                "character": "Skeleton",
                "credit_id": "54a28227c3a3682f1b00ebc6",
                "order": 29
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "JamesonTrenholm"
        ],
        "biography": "Jameson Trenholm is a professional actor and ACTRA member residing in Vancouver, British Columbia. Represented by Sara Parker at Principals Talent, Jameson was recently featured on the CW network's series \"Supernatural\" and \"Cult\".  Jameson got his first taste of acting while attending the Alberta High School of Fine Arts. During this time, he signed on with his first agent and gained the lead role in \"Superhero Wannabe\" followed by a principal role in MTV's \"Man in the Mirror\". Jameson attended both the Theatre Studies Program and Motion Picture Arts Program at Red Deer College. There, he had the opportunity to play Tiger in \"The Bundle\" and the Scarecrow in the college's largest production ever; \"The Wizard of Oz\". Highlights of Jameson's career include a principlal role alongside Samuel L. Jackson and Josh Hartnett in \"Resurrecting the Champ\", and playing the Hippy with Tom Green and Crispin Glover in \"Freezer Burn\" which premiered at the Calgary International Film Festival. ",
        "birthday": null,
        "deathday": null,
        "gender": 0,
        "homepage": "http://www.jamesontrenholm.com/#!",
        "id": 1406094,
        "imdb_id": "nm2464194",
        "known_for_department": "Acting",
        "name": "Jameson Trenholm",
        "place_of_birth": null,
        "popularity": 0.0239,
        "profile_path": null
    }
}