{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uIUhGW2PMMlxr3GccdMdOMcqsIa.jpg",
                "genre_ids": [
                    10749,
                    10402,
                    18
                ],
                "id": 440298,
                "original_language": "pl",
                "original_title": "Zimna wojna",
                "overview": "A man and a woman meet in the ruins of post-war Poland. With vastly different backgrounds and temperaments, they are fatally mismatched and yet drawn to each other.",
                "popularity": 2.1999,
                "poster_path": "/6rbS8oPIgUMhQgIX8oGVTtlNgLR.jpg",
                "release_date": "2018-06-08",
                "title": "Cold War",
                "video": false,
                "vote_average": 7.444,
                "vote_count": 1525,
                "character": "Wiktor Warski",
                "credit_id": "599972089251413ff60116a6",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Tomasz Kot (born 21 April 1977) is a Polish actor. He gained great popularity by portraying singer Ryszard Riedel in Jan Kidawa Błoński's 2005 film \"Destined for Blues\" as well as for his role as Zbigniew Religa in Łukasz Palkowski's 2014 film \"Gods\". In 2015, he was awarded the Medal for Merit to Culture – Gloria Artis.  Most recently, Kot has received award-season buzz for his starring role as Wiktor in Paweł Pawlikowski’s feature \"Cold War\". The project has earned him a nomination for best actor by the European Film Awards and the movie has been recognized by the Critics' Choice Movie Awards, New York Film Critics Circle, and the National Board of Review in the best foreign language film category.  In 2018 Kot appeared in Agnieszka Holland’s \"Spoor\" and had a starring role in Jaroslaw Marszewski’s “Bikini Blue,” the latter earning him the award for best lead actor at the Milan Film Festival. In 2019 Kot starred in BBC One series \"World on Fire\" opposite Brian J. Smith, Julia Brown, and Helen Hunt.",
        "birthday": "1977-04-21",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 140652,
        "imdb_id": "nm1682799",
        "known_for_department": "Acting",
        "name": "Tomasz Kot",
        "place_of_birth": "Legnica, Poland",
        "popularity": 0.2218,
        "profile_path": "/k4LgSV1p2FI8xhFwNOzBcDcEX7s.jpg"
    }
}