{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7gH1lRzboLTBxiqTwscrkOeaaau.jpg",
                "genre_ids": [
                    28,
                    80,
                    53,
                    10749,
                    18
                ],
                "id": 916,
                "original_language": "en",
                "original_title": "Bullitt",
                "overview": "Senator Walter Chalmers is aiming to take down mob boss Pete Ross with the help of testimony from the criminal's hothead brother Johnny, who is in protective custody in San Francisco under the watch of police lieutenant Frank Bullitt. When a pair of mob hitmen enter the scene, Bullitt follows their trail through a maze of complications and double-crosses. This thriller includes one of the most famous car chases ever filmed.",
                "popularity": 4.7202,
                "poster_path": "/2ffzF1WmeXtH420fSUoCrecFvDA.jpg",
                "release_date": "1968-10-17",
                "title": "Bullitt",
                "video": false,
                "vote_average": 7.155,
                "vote_count": 1213,
                "character": "Dr. Willard",
                "credit_id": "52fe428cc3a36847f8027571",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/jXPrGgk6PypAsv8IPq8NqlQi6ts.jpg",
                "genre_ids": [
                    35,
                    80,
                    10749
                ],
                "id": 3001,
                "original_language": "en",
                "original_title": "How to Steal a Million",
                "overview": "A woman must steal a statue from a Paris museum to help conceal her father's art forgeries.",
                "popularity": 5.0699,
                "poster_path": "/xaf3pwmITJvfz9Ab8DiGM8OOtBC.jpg",
                "release_date": "1966-07-13",
                "title": "How to Steal a Million",
                "video": false,
                "vote_average": 7.489,
                "vote_count": 623,
                "character": "Waiter (uncredited)",
                "credit_id": "5da889d3a2423200177be826",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia.\n\nGeorg Stanford Brown (born June 24, 1943 in Havana, Cuba) is a Cuban-American actor and director, perhaps best known as one of the stars of the ABC police television series The Rookies from 1972–76. On the show, Brown played the character of Officer Terry Webster.\n\nDuring the 1960s, Brown had a variety of roles in television and film, including a portrayal of Henri Philipot in 1967's The Comedians, and playing Dr. Willard in 1968's Bullitt. In 1972 Brown starred in Wild in the Sky, co-starring Brandon De Wilde, as anti-war, anti-establishment guerrillas, who devise a scheme to destroy Fort Knox with an atomic bomb.\n\nBrown later played Tom Harvey (son of Chicken George, great grandson of Kunta Kinte, and great grandfather of Alex Haley) in the 1977 television miniseries Roots, and 1979's Roots: The Next Generations.\n\nIn 1980, he starred in the highly successful Stir Crazy opposite Gene Wilder and Richard Pryor. He then went on to a supporting role in yet another miniseries North & South in 1985 as a character named Grady.\n\nBrown also directed several second-season episodes of the television series Hill Street Blues.\n\nMore recently, Brown had a recurring role on the FX drama series Nip/Tuck.\n\nDescription above from the Wikipedia article Georg Stanford Brown, licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": "1943-06-24",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 14065,
        "imdb_id": "nm0113617",
        "known_for_department": "Acting",
        "name": "Georg Stanford Brown",
        "place_of_birth": "Havana, Cuba",
        "popularity": 0.3551,
        "profile_path": "/hTd8786Av81F8Slb5HIkuyfy3BI.jpg"
    }
}