{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kVGUdR1CXKAyCFj5Tt4uyR2bpFx.jpg",
                "genre_ids": [
                    36,
                    18
                ],
                "id": 273895,
                "original_language": "en",
                "original_title": "Selma",
                "overview": "\"Selma,\" as in Alabama, the place where segregation in the South was at its worst, leading to a march that ended in violence, forcing a famous statement by President Lyndon B. Johnson that ultimately led to the signing of the Voting Rights Act.",
                "popularity": 4.6138,
                "poster_path": "/wq4lhMc4BuOyQqe1ZGzhxLyy3Uk.jpg",
                "release_date": "2014-12-25",
                "title": "Selma",
                "video": false,
                "vote_average": 7.389,
                "vote_count": 2258,
                "character": "James Forman",
                "credit_id": "54b0aa8e9251416fe10008b7",
                "order": 27
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Trai Byers is an American actor and singer known for playing Andre Lyon in the Fox music-industry prime time drama Empire. During the October 7, 2015 episode of the daytime talk show, FABLife, Byers's costar Grace Gealey confirmed that they were engaged. He and Gealey married on Grand Cayman Island on April 14, 2016. Trai Byers was born in Kansas City, Kansas. After high school in Kansas City, he completed his high-school education in Georgia. Byers then graduated from the University of Kansas with a Bachelor's degree in communications. He also attended the American Musical and Dramatic Academy in Los Angeles, and the Yale School of Drama. In 2011, Byers made his television debut with the recurring role on the ABC daytime soap opera, All My Children, and the following year had role in The CW teen soap,90210. He played civil rights activist James Forman in the 2014 historical epic film, Selma.",
        "birthday": "1983-07-19",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1407308,
        "imdb_id": "nm1784293",
        "known_for_department": "Acting",
        "name": "Trai Byers",
        "place_of_birth": "Kansas City, Kansas, USA",
        "popularity": 0.2073,
        "profile_path": "/rtRiBU4RTXhHGan7cpaGHg89iUg.jpg"
    }
}