{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lO5c0zG8s1dBPHcRparpNlNGWU9.jpg",
                "genre_ids": [
                    18
                ],
                "id": 394117,
                "original_language": "en",
                "original_title": "The Florida Project",
                "overview": "The story of a precocious six year-old and her ragtag group of friends whose summer break is filled with childhood wonder, possibility and a sense of adventure while the adults around them struggle with hard times.",
                "popularity": 3.6,
                "poster_path": "/bnSTP1PY2fDyat0eUa4QouuGV7F.jpg",
                "release_date": "2017-10-06",
                "title": "The Florida Project",
                "video": false,
                "vote_average": 7.429,
                "vote_count": 2947,
                "character": "DCF Investigator",
                "credit_id": "5923a2aa92514105220067ca",
                "order": 41
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Lauren O'Quinn is an award-winning actor, teacher, director, and producer. Born and raised in a small town in middle GA, she discovered her passion for acting early on through church plays and the high school drama club. She attended The University of Georgia before moving to Orlando, FL. Since that time, she has appeared in over 200 national and regional commercials, and numerous films and television shows. Her love for the craft of acting is solidly split between her own pursuits in front of the camera - and mentoring other actors. She's been a sought-after teacher and private acting coach since 1999. She owns a successful acting studio in Orlando called ClassAct Studios where she encourages her students to \"ride the roller coaster\" and is so happy to be able to follow her bliss on a daily basis. She's married to fellow actor/entertainer, Chris Burns, and is the proud mother to 2 beautiful girls.  - IMDb Mini Biography By: Lauren O'Quinn",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1408786,
        "imdb_id": "nm2766663",
        "known_for_department": "Acting",
        "name": "Lauren O'Quinn",
        "place_of_birth": "Georgia, USA",
        "popularity": 1.0215,
        "profile_path": "/to7mUgK6KGIGPch8zftjiujG8NW.jpg"
    }
}