{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ubICMSUij3ntP9BjnQsV3rTVnAF.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 783,
                "original_language": "en",
                "original_title": "Gandhi",
                "overview": "In the early years of the 20th century, Mohandas K. Gandhi, a British-trained lawyer, forsakes all worldly possessions to take up the cause of Indian independence. Faced with armed resistance from the British government, Gandhi adopts a policy of 'passive resistance', endeavouring to win freedom for his people without resorting to bloodshed.",
                "popularity": 4.3456,
                "poster_path": "/rOXftt7SluxskrFrvU7qFJa5zeN.jpg",
                "release_date": "1982-12-01",
                "title": "Gandhi",
                "video": false,
                "vote_average": 7.557,
                "vote_count": 2390,
                "character": "Suhrawardy",
                "credit_id": "55f777aa9251410f3e00155b",
                "order": 141
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Shekhar Chatterjee"
        ],
        "biography": "Shekhar Chatterjee (1924–1990) was an Indian actor and film director. Chatterjee was born in Kolkata in 1924. He began his career in the Bengali theatre in the 1950s. He was associated with several leftist theatre groups, including the Communist Party's Indian People's Theatre Association, Utpal Dutt's Little Theatre Group, and Joan Littlewood's Theatre Workshop, as well as his own group, Theatre Unit, which he formed in 1958. As a stage actor, he was well known for his Shakespearean roles and for playing Shardul Singh in Dutt's 1965 play Kallol.  His directorial work focused on works by German-language playwrights Bertold Brecht, Friedrich Dürrenmatt, Peter Handke, and Franz Xaver Kroetz. Chatterjee's Brecht productions were rarely adapted to a local setting, and while critics unanimously praised this approach as \"authentic\", his colleague Dutt attacked it for failing to communicate Brecht's political symbolism to an Indian audience.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1409833,
        "imdb_id": "nm0154161",
        "known_for_department": "Acting",
        "name": "Shekhar Chattopadhyay",
        "place_of_birth": "Calcutta, Bengal Presidency, British India [now India]",
        "popularity": 0.2725,
        "profile_path": "/ublgR8XmQyctYFVD4AKjPNrsccf.jpg"
    }
}