{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kIBBeb94FbNfLSljeFUxUoszflb.jpg",
                "genre_ids": [
                    18,
                    10752,
                    36
                ],
                "id": 17295,
                "original_language": "it",
                "original_title": "La battaglia di Algeri",
                "overview": "Paratrooper commander Colonel Mathieu, a former French Resistance fighter during World War II, is sent to Algeria to reinforce efforts to squelch the uprisings of the Algerian War. There he faces Ali la Pointe, a former petty criminal who, as the leader of the Algerian Front de Liberation Nationale, directs terror strategies against the colonial French government occupation. As each side resorts to ever-increasing brutality, no violent act is too unthinkable.",
                "popularity": 2.1462,
                "poster_path": "/2p3AFtOHFvP6OeVMqlnL1zLKOqL.jpg",
                "release_date": "1966-09-08",
                "title": "The Battle of Algiers",
                "video": false,
                "vote_average": 7.872,
                "vote_count": 826,
                "character": "Ali La Pointe",
                "credit_id": "52fe47169251416c7508d547",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Brahim Haggiag",
            "إبراهيم حجاج",
            "Brahim Hajjaj",
            "Брахим Хаджадж"
        ],
        "biography": "Brahim Hadjadj (إبراهيم حجاج) (January 31, 1934 - March 8, 1996) was an Algerian actor. His career began with the film \"The Battle of Algiers\" (1966), directed by the Italian Gillo Pontecorvo. The 32-year-old actor plays the leading role, that of the Algerian revolutionary hero Ali Ammar (1930-1957), known under the pseudonym \"Ali La Pointe\". The film received several awards and nominations including the Golden Lion at the Venice Film Festival in 1966, Pontecorvo received the Oscar for best director in 1979.\n\nThe success of \"The Battle of Algiers\" is global, and Brahim Hadjadj becomes the radiant face of Algeria and the country's number one actor. In the minds of all Algerians he becomes \"Ali La Pointe\", in a film which exposes to the world the abuses of the French colonial army under the cover of \"pacification campaigns\", previously censored by the French media. Brahim Hadjadj becomes in the middle of the sixties, the rebel hero, glamorous icon of an entire youth who believes that a more egalitarian world is possible. Around the attribution of the role of Ali La Pointe to Brahim Hadjadj, there is a whole mythology, some say that the director Gillo Pontecorvo sitting at the terrace of the Tantonville café in Algiers, saw Hadjadj passing by by chance and offered him the role. Wild casting or not, Gillo Pontecorvo found the naturalness, spontaneity and grace he was looking for in Brahim, for his reality cinema film which he wanted to be as close as possible to a documentary.\n\nBrahim Hadjadj goes from shadow to light after \"The Battle of Algiers\", without any dramatic training and a basic level of school studies, neither prepared nor supervised, he finds himself hounded by the press, bombarded with questions, which according to him, exceeded his cultural level. The actor, overwhelmed by his new status, still lives as before, day by day. Gillo Pontecorvo, thought of him to play the role of the anticolonial revolutionary José Dolores in his new film “Queimada” (1969). Brahim Hadjadj, then without an agent to manage his career and unpunctual, gave rise to serious doubts in the production company which considered him risky for such a substantial project. Brahim Hadjadj unreachable, the production opts for the Colombian actor Evaristo Márquez who shares the poster with the legend Marlon Brando. Brahim continued his career with Luchino Visconti in 1967 in \"The Stranger\", in 1969 in \"L'Opium Et Le Bâton\" by Ahmed Rachedi, in the role of Omar, in 1971 in \"Patrouille À l'Est\" by Amar Laskri, in 1974 Ahmed Rachedi in \"The Finger in the Gear\", in 1975 Mohammed Lakhdar-Hamina in the cult \"Chronique Des Années De Braise\", in 1986 he is Si Omar in \"The Roaring Years of the Twist\" by Mahmoud Zemmouri...\n\nIn the 90s, in the middle of the dark decade, bomb attacks increased in Algiers and throughout the country, culture was no longer a priority for institutions, and a good number of intellectuals, journalists and artists, threatened, flee the country. The last years of Brahim Hadjadj's life, in the suburbs of the Algerian capital, in the Cherarba district, were difficult. Hadjadj is diagnosed with a brain tumor. While it took time to raise the funds to send him abroad for surgery, he died on March 8, 1996 in Algiers.",
        "birthday": "1934-01-31",
        "deathday": "1996-03-08",
        "gender": 2,
        "homepage": "https://africultures.com/personnes/?no=51937",
        "id": 140996,
        "imdb_id": "nm0352835",
        "known_for_department": "Acting",
        "name": "Brahim Hadjadj",
        "place_of_birth": "Médéa, Algeria",
        "popularity": 1.0099,
        "profile_path": "/84w4StAMYafVsw2Ci2sE70fyPpy.jpg"
    }
}