{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/y2DB71C4nyIdMrANijz8mzvQtk6.jpg",
                "genre_ids": [
                    28,
                    80,
                    18,
                    53
                ],
                "id": 49026,
                "original_language": "en",
                "original_title": "The Dark Knight Rises",
                "overview": "Following the death of District Attorney Harvey Dent, Batman assumes responsibility for Dent's crimes to protect the late attorney's reputation and is subsequently hunted by the Gotham City Police Department. Eight years later, Batman encounters the mysterious Selina Kyle and the villainous Bane, a new terrorist leader who overwhelms Gotham's finest. The Dark Knight resurfaces to protect a city that has branded him an enemy.",
                "popularity": 17.5242,
                "poster_path": "/hr0L2aueqlP2BYUblTTjmtn0hw4.jpg",
                "release_date": "2012-07-17",
                "title": "The Dark Knight Rises",
                "video": false,
                "vote_average": 7.787,
                "vote_count": 23539,
                "character": "Rich Twit",
                "credit_id": "56219a6cc3a3680e1900973e",
                "order": 38
            },
            {
                "adult": false,
                "backdrop_path": "/fO0qXJnBJYuWJ5dvWWGXfRF8MXA.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 382591,
                "original_language": "fr",
                "original_title": "Demain tout commence",
                "overview": "A man without attachments or responsibilities suddenly finds himself with an abandoned baby and leaves for London to try and find the mother. Eight years later after he and his daughter become inseparable Gloria's mother reappears.",
                "popularity": 3.279,
                "poster_path": "/aFgtdhuzgI2eqnIVWtRB03x3pnt.jpg",
                "release_date": "2016-12-07",
                "title": "Two Is a Family",
                "video": false,
                "vote_average": 7.737,
                "vote_count": 3008,
                "character": "Doctor",
                "credit_id": "58ef836fc3a368262600c6a3",
                "order": 38
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Jay Benedict (April 11, 1951 – April 4, 2020) was an American actor who spent most of his life and career in the United Kingdom. He was frequently cast as American characters in British films and television programmes. He was best known for his television roles as Doug Hamilton in the soap opera Emmerdale, and as Captain/Major John Kieffer in the detective drama Foyle's War, in the episodes \"Invasion\" and \"All Clear\". He also played Russ Jorden, Newt's father, in the special \"Extended Edition\" of the film Aliens.\n\nBenedict was born in Burbank, California. He moved to Europe with his family in the 1960s, and spent most of his working life in England. He was of half German descent. His theatrical credits include The Rocky Horror Show in the Kings Road in the early 1970s, Harold Pinter's production of Sweet Bird of Youth, The Reverend Lee in The Foreigner and Riccardo in Franco Zeffirelli's production of Filumena in which he played opposite Pierce Brosnan in the latter's first stage role, and Bill Wilson, co-founder of Alcoholics Anonymous, in a touring production of \"One Day at a Time\". In 2013, he appeared opposite Steven Berkoff and Andree Bernard in the world premiere of the former's one act play An Actor's Lament at The Berkoff Performing Arts Centre at Alton College, followed by a second performance at The Sinden Theatre, Homewood School, Tenterden in Kent, two nights at The Maltings Theatre & Cinema in Berwick-upon-Tweed and then a three-week run at the Assembly Hall in Edinburgh as part of the Edinburgh Festival Fringe. In May 2014, it was revived with a short run at the Theatre Royal, Margate with a further one-week run scheduled at The Gaiety Theatre, Dublin, in September 2014.\n\nIn August 2014, he returned to the Edinburgh Festival Fringe in the world premiere of Terry Jastrow's The Trial of Jane Fonda, playing World War II veteran Archie Bellows.\n\nHe also appeared widely on television, most notably as Frank Crowe in an episode of the BBC's award-winning 2003 television miniseries Seven Wonders of the Industrial World, John E. Jones III in Nova's Judgment Day: Intelligent Design on Trial, Alan Kalanak in the 2001 Christmas Special edition of Jonathan Creek and Yves Houdet in Thames Television's mini-series of Angus Wilson's Anglo-Saxon Attitudes. Other television appearances include Lilyhammer as Agent Becker, Queen Victoria's Men (Lord Melbourne), Sharpe's Honour (General Verigny), Bergerac (Martin Colley), Death Train (Halloran), Harnessing Peacocks (Eli Drew) and Only Love (Roger). He provided the voice for Shiro Hagen in Star Fleet, the English adaptation of the Japanese X-Bomber.\n\nHis first film role, at the age of 11, was in the 1963 Tony Saytor film La Bande à Bobo. In 1977, he played Deak in the Tosche Station scenes in Star Wars, which were deleted from the film before release. Subsequent film appearances include The Dirty Dozen: Next Mission (Didier le Clair), Icon (Carey Jordan), The White Knight (Turkish Ambassador), The Russia House (Spikey), Saving Grace (the MC), Rewind and The Dark Knight Rises (Rich Twit). In 2003 he was third lead in Vicente Aranda's version of Carmen, playing Don Prospero. ...\n\nSource: Article \"Jay Benedict\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1951-04-11",
        "deathday": "2020-04-04",
        "gender": 2,
        "homepage": null,
        "id": 141014,
        "imdb_id": "nm0070779",
        "known_for_department": "Acting",
        "name": "Jay Benedict",
        "place_of_birth": " Burbank, California, USA",
        "popularity": 0.0988,
        "profile_path": "/egmUxHP7CUIK0GhdEVhjkS1fa8e.jpg"
    }
}