{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/oNoprEND25zXR6Fns8cIZUkuoMc.jpg",
                "genre_ids": [
                    35,
                    80,
                    18
                ],
                "id": 308266,
                "original_language": "en",
                "original_title": "War Dogs",
                "overview": "Based on the true story of two young men, David Packouz and Efraim Diveroli, who won a $300 million contract from the Pentagon to arm America's allies in Afghanistan.",
                "popularity": 6.4733,
                "poster_path": "/mDcPRjZC1bb6LavFU3gwsWdVfCM.jpg",
                "release_date": "2016-08-18",
                "title": "War Dogs",
                "video": false,
                "vote_average": 6.926,
                "vote_count": 5190,
                "character": "AEY Interviewee",
                "credit_id": "58765cbb92514179ef009530",
                "order": 36
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Randy Jay Burrell is an American actor, writer, director and musician from Tampa, Florida. He is the son of Don Burrell, an insurance agency owner, and Laurie Burrell, a healthcare professional. Randy grew up in a close, loving, adventurous family and is the eldest of four children, three boys and one girl. His well-rounded childhood included family travels to Africa, Australia, Europe, playing football, basketball, surfing and martial arts plus, a household of pets.\n\nFrom an early age, Randy knew he wanted to work in entertainment. At the tender age of 5, Randy displayed an actor's preparedness and generosity in his first theatrical role as the Tin Man in his Kindergarten production of \"The Wizard of Oz.\" Randy knew all of his lines and those of the other characters, which saved the day when the Cowardly Lion forgot his lines and Randy was able to feed his young co-star the lines live on stage. As a boy, he liked creating his own home-movie documentaries of his action figures, getting into character every Halloween, and making people laugh.\n\nBeginning at age 10, Randy worked professionally in modeling and acting in Miami, Tampa and Orlando for department stores, TV commercials, book covers and print ads. In his teens, his Uncle Tom introduced Randy to the acoustic guitar, which led to Randy teaching himself classic rock songs and writing his own music.\n\nRandy attended the University of South Florida studying theatre performance and entertainment business. While in college, Randy acted in plays, commercials and independent film projects. Shortly before arriving in Los Angeles, he worked on the Florida location of the feature film \"Dolphin Tale\" (2011) as the double for Harry Connick, Jr. and enjoyed a round of golf with Connick's co-star Morgan Freeman, who motivated Randy to pursue his dream and move to Los Angeles.\n\nOnce in Los Angeles, Randy earned roles quickly in film, television and commercials. He also performed in an all original rock band in live venues on Sunset Boulevard and all around Los Angeles. Creative on the other side of the camera, Randy has written, directed and produced short films, tv pilots and Web series.\n\nActing has always been a passion of Randy's and he has his sights set on a full career like the greats he admires: Carrey, Costner, Hanks, DiCaprio and Eastwood, the latter whom he had the privilege of meeting in Los Angeles two weeks before filming \"Doc Holliday's Revenge\", Randy's first western and starring role in a feature.\n\nIn his free time, Randy enjoys music, movies, video games, all that is Marvel and DC, hiking, surfing, skating, exploring nature, traveling and rooting for his home state teams the Tampa Bay Buccaneers, Tampa Bay Lightning, Tampa Bay Rays and the Orlando Magic.\n\n(IMDb Mini Biography By: Deborah Fairchild)",
        "birthday": "1986-08-16",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1411462,
        "imdb_id": "nm3702531",
        "known_for_department": "Acting",
        "name": "Randy Jay Burrell",
        "place_of_birth": "Tampa, Florida, United States",
        "popularity": 0.0862,
        "profile_path": "/cdxm6v0LpqH1KWSnO7SpZzO4nuP.jpg"
    }
}