{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zJeYB7rX1kg5kVmzB0kxbvxmYOl.jpg",
                "genre_ids": [
                    18
                ],
                "id": 87093,
                "original_language": "en",
                "original_title": "Big Eyes",
                "overview": "In the late 1950s and early '60s, artist Walter Keane achieves unbelievable fame and success with portraits of saucer-eyed waifs. However, no one realizes that his wife, Margaret, is the real painter behind the brush. Although Margaret is horrified to learn that Walter is passing off her work as his own, she is too meek to protest too loudly. It isn't until the Keanes' marriage comes to an end and a lawsuit follows that the truth finally comes to light.",
                "popularity": 3.1327,
                "poster_path": "/203HAjJcLMl7xThcTqZx4zmEGcV.jpg",
                "release_date": "2014-12-24",
                "title": "Big Eyes",
                "video": false,
                "vote_average": 6.979,
                "vote_count": 3541,
                "character": "Sexy Girl",
                "credit_id": "54fb4e359251413aa0001ef8",
                "order": 34
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Emily Fonda was born in Sydney, Australia. She earned a Bachelor of Communications from Griffith University in Australia, and intended to pursue a career in Journalism. After a brief stint in London, England, where she performed with the Thieving Dingo Theatre Company, a move to Vancouver, Canada reignited her dreams of a dedicated career as an actress. Since arriving in Hollywood North, she has appeared in television series' \"Citizen\", \"Witches of East End\", \"Girlfriends Guide to Divorce\" and \"The Tomorrow People\". Emily play's Ann Marie in \"Supernatural\" Season 10, alongside Jensen Ackles. In 2014, Emily will make her feature film debut in Tim Burton's \"Big Eyes\", followed by the highly anticipated \"Fifty Shades of Grey\", as 'Martina'. Catch her in the trailer delivering the infamous line \"Mr. Grey will see you now\". Emily now resides in Los Angeles.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1411603,
        "imdb_id": "nm4350371",
        "known_for_department": "Acting",
        "name": "Emily Fonda",
        "place_of_birth": "Sydney, Australia.",
        "popularity": 0.0698,
        "profile_path": null
    }
}