{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1yWn9A2LN0uRGudIg0bV2Np6T69.jpg",
                "genre_ids": [
                    10752,
                    28,
                    18
                ],
                "id": 9289,
                "original_language": "en",
                "original_title": "The Longest Day",
                "overview": "The retelling of June 6, 1944, from the perspectives of the Germans, US, British, Canadians, and the Free French. Marshall Erwin Rommel, touring the defenses being established as part of the Reich's Atlantic Wall, notes to his officers that when the Allied invasion comes they must be stopped on the beach. \"For the Allies as well as the Germans, it will be the longest day\"",
                "popularity": 3.5233,
                "poster_path": "/5zmvEofdIlgXrQl9A7e5IOzlnFU.jpg",
                "release_date": "1962-09-25",
                "title": "The Longest Day",
                "video": false,
                "vote_average": 7.594,
                "vote_count": 977,
                "character": "Maj. Gen. Max Pemsel",
                "credit_id": "53ba7b28c3a368072e004052",
                "order": 44
            },
            {
                "adult": false,
                "backdrop_path": "/1oRug23GWxgyQmqQGbX7ke974lp.jpg",
                "genre_ids": [
                    18,
                    36,
                    10752
                ],
                "id": 5902,
                "original_language": "en",
                "original_title": "A Bridge Too Far",
                "overview": "The story of Operation Market Garden—a failed attempt by the allies in the latter stages of WWII to end the war quickly by securing three bridges in Holland allowing access over the Rhine into Germany. A combination of poor allied intelligence and the presence of two crack German panzer divisions meant that the final part of this operation (the bridge in Arnhem over the Rhine) was doomed to failure.",
                "popularity": 8.5626,
                "poster_path": "/lszOk3Xmh7qpLaM9J4K9E6ADLk1.jpg",
                "release_date": "1977-06-15",
                "title": "A Bridge Too Far",
                "video": false,
                "vote_average": 7.224,
                "vote_count": 868,
                "character": "Field Marshal Karl R.G. Von Rundstedt",
                "credit_id": "57bb857792514176d70002db",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Wolfgang Price",
            "Вольфганг Прайсс"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nWolfgang Preiss (27 February 1910 at Nuremberg - 27 November 2002 at Baden-Baden) was a German theatre, film and television actor.\n\nThe son of a teacher, in the early 1930s Preiss studied philosophy, German and drama. He also took private acting classes with Hans Schlenck, making his stage début in Munich in 1932. He went to appear in various theatre productions in Heidelberg, Königsberg, Bonn, Bremen, Stuttgart and Berlin.\n\nIn 1942 he made his film début - he was exempted from military service specifically - in the UFA production Die grosse Liebe with Zarah Leander. After the end of the Second World War Preiss returned to the theatre, and from 1949 worked extensively dubbing films into German.\n\nIn 1954 he returned to film acting, appearing in Alfred Weidenmann's Canaris. The following year Preiss played the lead role of Claus von Stauffenberg in Falk Harnack's film Der 20. Juli, which dramatised the 1944 plot to assassinate Hitler. This role brought Preiss to popular attention and also the 1956 Federal Film Award.\n\nFrom now on Preiss was largely typecast in the role of the upright and obligation-conscious German officer to the other A-list actor playing the Fanatic (I.E. Paul Scofeld in The Train) a part he played in many films, later reprising it in numerous international productions, predominantly in Italy and the USA, while occasionally playing a more typically cynical or brutal Nazi officer.\n\nPreiss appeared in such productions as The Longest Day (1962), Otto Preminger's The Cardinal (1963), and with Jean-Paul Belmondo in Is Paris Burning? (1966). He starred alongside Burt Lancaster in John Frankenheimer's The Train (1964), Frank Sinatra in Von Ryan's Express (1965), Robert Mitchum in Anzio (1968), with Richard Burton, in the title role of Erwin Rommel in Raid on Rommel (1971), and The Boys From Brazil (1978) with Gregory Peck. He also appeared in several Italian language films, credited as \"Luppo Prezzo\", and played Field Marshal Von Rundstedt in Richard Attenborough's all-star war epic A Bridge Too Far (1977).\n\nIn addition, for the cinema-going public of West Germany he became the epitome of the evil genius in his role as Doctor Mabuse, a role he first played in 1960 (following Rudolf Klein-Rogge) in Fritz Lang's The Thousand Eyes of Dr. Mabuse. He went on to play the role four more times.\n\nIn the 1980s Preiss turned to television, notably playing General Walther von Brauchitsch in the American TV mini-series Winds of War and War and Remembrance, based on the books of Herman Wouk.\n\nIn 1987 received a second Federal Film Award for his outstanding work in film.\n\nIn film dubbing Preiss provided the voice for such actors as Lex Barker, Christopher Lee, Anthony Quinn, Claude Rains, Richard Widmark, as well as that of Conrad Veidt as \"Major Strasser\" in the remastered version of Casablanca.\n\nDescription above from the Wikipedia article Wolfgang Preiss, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1910-02-27",
        "deathday": "2002-11-27",
        "gender": 2,
        "homepage": null,
        "id": 14121,
        "imdb_id": "nm0007234",
        "known_for_department": "Acting",
        "name": "Wolfgang Preiss",
        "place_of_birth": "Nuremberg, Germany",
        "popularity": 0.2085,
        "profile_path": "/oIWvhCWDMOeyMBBwLJIzSo4L4uN.jpg"
    }
}