{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dLL90vskYFn1S89RZp5TUguK9wl.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 4982,
                "original_language": "en",
                "original_title": "American Gangster",
                "overview": "Loosely based on the criminal career of Frank Lucas, a gangster from La Grange, North Carolina, who smuggled heroin into the United States on American service planes returning from the Vietnam War, before being detained by a task force led by Newark Detective Richie Roberts.",
                "popularity": 7.5255,
                "poster_path": "/8sV6nWuKczuXRt0C6EWoXqJAj6G.jpg",
                "release_date": "2007-11-02",
                "title": "American Gangster",
                "video": false,
                "vote_average": 7.591,
                "vote_count": 5725,
                "character": "Dancer",
                "credit_id": "56c4b6c7c3a3680d3e00031f",
                "order": 105
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/eY6bnNP10bWljC19v8UXAScHyuP.jpg",
                "genre_ids": [
                    18,
                    80,
                    53
                ],
                "id": 1538,
                "original_language": "en",
                "original_title": "Collateral",
                "overview": "Cab driver Max picks up a man who offers him $600 to drive him around. But the promise of easy money sours when Max realizes his fare is an assassin.",
                "popularity": 7.8611,
                "poster_path": "/nV5316WUsVij8sVXLCF1g7TFitg.jpg",
                "release_date": "2004-08-04",
                "title": "Collateral",
                "video": false,
                "vote_average": 7.233,
                "vote_count": 5921,
                "credit_id": "54b2889a92514107e00030eb",
                "department": "Crew",
                "job": "Choreographer"
            },
            {
                "adult": false,
                "backdrop_path": "/irpJXGiVr539uuspcQcNdkhS2lq.jpg",
                "genre_ids": [
                    16,
                    28,
                    35,
                    10751,
                    878
                ],
                "id": 38055,
                "original_language": "en",
                "original_title": "Megamind",
                "overview": "After Megamind, a highly intelligent alien supervillain, defeats his long-time nemesis Metro Man, Megamind creates a new hero to fight, but must act to save the city when his \"creation\" becomes an even worse villain than he was.",
                "popularity": 13.542,
                "poster_path": "/uZ9ytt3sPTx62XTfN56ILSuYWRe.jpg",
                "release_date": "2010-10-28",
                "title": "Megamind",
                "video": false,
                "vote_average": 7.01,
                "vote_count": 7146,
                "credit_id": "5ac167e49251412720010076",
                "department": "Crew",
                "job": "Choreographer"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Fatima Wilson"
        ],
        "biography": "As the New York Times notes, Fatima is “one of the most sought-after hip-hop and popular music choreographers in the world”. She has received numerous MTV VMA nominations for Best Choreography, including for will.i.am’s #thatPOWER video, and was recently nominated for Video Director of the Year for the 2015 BET Awards. Her work as a choreographer and video director for the Black Eyed Peas has also earned her several MTV VMA nominations, including a win for Best Hip Hop Video for “My Humps” and Best Choreography for “Hey Mama”. Fatima was also the creative force behind breaking artist Meghan Trainor and was the director of “No”, “Dear Future Husband”, and “All About The Bass” (over 1 billion hits and counting). She is also the director and choreographer behind the popular commercial campaigns for Nair and Old Navy. Fatima is acclaimed by critics and peers alike and has received multiple nominations for American Choreography Awards, Choreography Media Honors and a Lucille Lortel Award nomination for Outstanding Choreographer – Off-Broadway, for her theatrical debut, Radiant Baby, a musical based on the life of artist Keith Haring, produced and directed by George C. Wolfe at the New York Public Theater.\n\nFatima’s film resume reads like a who’s who of Hollywood having choreographed the critically acclaimed Dreamgirls, Charlie Wilson’s War, American Gangster, Public Enemy, Ali, Confessions of a Shopaholic, as well as working with stars like Will Smith, Halle Berry, Isla Fisher, Eddie Murphy, Colin Farrell, John Travolta, Uma Thurman, The Rock, Sandra Bullock, Thandle Newton, Gong Li, Queen Latifah, and Academy Award winning directors such as Michael Mann, Mike Nichols, Ridley Scott, and the list goes on.\n\nFatima Robinson has long been acclaimed for her work as Choreographer for artists, such as:\n\n1. Aaliyah (Are You That Somebody; Hot Like Fire; More Than A Woman; One In A Million; Rock The Boat; Try Again; We Need A Resolution)\n\n2. Black Eyed Peas (Boom Boom Pow; Imma Be; Meet Me Halfway; Rock That Body; The Time)\n\n3. Brandy (Baby)\n\n4. Britney Spears & Iggy Azalea (Pretty Girls)\n\n5. Busta Rhymes (Put Your Hands Where My Eyes Can See)\n\n6. Cheryl Cole (Promise This)\n\n7. Dr. Dre (Been There Done That)\n\n8. Fergie (Clumsy; Fergalicious; London Bridge; Milf Money)\n\n9. Jessica Simpson (These Boots Are Made for Walking)\n\n10. Kendrick Lamar (I)\n\n11. Lenny Kravitz (Fly Away)\n\n12. Mary J Blige (Family Affair; Just Fine)\n\n13. Michael Jackson (Remember the Time)\n\n14. Natasha Bedingfield (Touch)\n\n15. Nelly Furtado (Promiscuous; Turn Off The Light; Say It Right)\n\n16. No Doubt (Bathwater)\n\n17. Pharrell Williams (Come Get It Bae; Freedom; Happy; Marilyn Monroe)\n\n18. Rihanna (If It's Love; Pon De Replay)\n\n19. Robin Thicke (Magic)\n\n20. Sade (Soldier of Love)\n\n21. Santana (Maria Maria — ft. The Product G&B)\n\n22. Selena Gomez (Come and Get It)\n\n23. Sevyn (My Love For You)\n\n24. Will Smith (Wild Wild West — ft. Dru Hill, Kool Mo Dee)\n\n25. Yeah Yeah Yeahs (Zero)",
        "birthday": "1971-08-29",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.fatimarobinson.com/",
        "id": 1412213,
        "imdb_id": "nm0268872",
        "known_for_department": "Crew",
        "name": "Fatima Robinson",
        "place_of_birth": "Little Rock, Arkansas, USA",
        "popularity": 0.0552,
        "profile_path": "/63tVL8lgCSW0gtmmYe2pUIu7Ia4.jpg"
    }
}