{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4Yihb0wD1Jd2sQtNrKo9TOs8S3l.jpg",
                "genre_ids": [
                    80,
                    18,
                    35
                ],
                "id": 308639,
                "original_language": "en",
                "original_title": "Dope",
                "overview": "Malcolm is carefully surviving life in a tough neighborhood in Los Angeles while juggling college applications, academic interviews, and the SAT. A chance invitation to an underground party leads him into an adventure that could allow him to go from being a geek, to being dope, to ultimately being himself.",
                "popularity": 3.5711,
                "poster_path": "/n6u00imN7AX2NiyWUc5kTgHXmEf.jpg",
                "release_date": "2015-06-19",
                "title": "Dope",
                "video": false,
                "vote_average": 7.064,
                "vote_count": 1522,
                "character": "Allen the Bouncer",
                "credit_id": "6487c8a3e2726000afc3d86e",
                "order": 16
            },
            {
                "adult": false,
                "backdrop_path": "/8r9RoGfwGmn1pn0G3sbvHHemSWF.jpg",
                "genre_ids": [
                    18,
                    10402,
                    36
                ],
                "id": 277216,
                "original_language": "en",
                "original_title": "Straight Outta Compton",
                "overview": "In 1987, five young men, using brutally honest rhymes and hardcore beats, put their frustration and anger about life in the most dangerous place in America into the most powerful weapon they had: their music.  Taking us back to where it all began, Straight Outta Compton tells the true story of how these cultural rebels—armed only with their lyrics, swagger, bravado and raw talent—stood up to the authorities that meant to keep them down and formed the world’s most dangerous group, N.W.A.  And as they spoke the truth that no one had before and exposed life in the hood, their voice ignited a social revolution that is still reverberating today.",
                "popularity": 5.8699,
                "poster_path": "/1CiLJx8Xtv3TbbFj6k7BboSmKgC.jpg",
                "release_date": "2015-08-11",
                "title": "Straight Outta Compton",
                "video": false,
                "vote_average": 7.787,
                "vote_count": 4041,
                "character": "Tone",
                "credit_id": "543193c90e0a264643003a79",
                "order": 30
            },
            {
                "adult": false,
                "backdrop_path": "/9vAoubhoZE8aSkUZoSfxs3UWZhO.jpg",
                "genre_ids": [
                    53,
                    28,
                    80
                ],
                "id": 156022,
                "original_language": "en",
                "original_title": "The Equalizer",
                "overview": "McCall believes he has put his mysterious past behind him and dedicated himself to beginning a new, quiet life. But when he meets Teri, a young girl under the control of ultra-violent Russian gangsters, he can’t stand idly by – he has to help her. Armed with hidden skills that allow him to serve vengeance against anyone who would brutalize the helpless, McCall comes out of his self-imposed retirement and finds his desire for justice reawakened. If someone has a problem, if the odds are stacked against them, if they have nowhere else to turn, McCall will help. He is The Equalizer.",
                "popularity": 14.6413,
                "poster_path": "/9u4yW7yPA0BQ2pv9XwiNzItwvp8.jpg",
                "release_date": "2014-09-24",
                "title": "The Equalizer",
                "video": false,
                "vote_average": 7.281,
                "vote_count": 9488,
                "character": "Marcus",
                "credit_id": "54c7667cc3a36874ae001739",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Allan Maldanado"
        ],
        "biography": "Allen Maldonado was born May 20, 1983 and named after his mother Alleen in the city of Bellflower, California. As a child Allen started to entertain at the early age of 5. \"He would hit the floor and break dance at the slightest sound of music\" Says his mother. At the age of seven things started to change for Allen due to a dangerous environment and some of his neighbors in Compton. He, his mother and two older sisters moved into a home in Rialto, California. His first foray into the entertainment business was dancing on Soul Train. This first love would lead him to his true love... Acting! Allen's senior year in high school is when the acting bug bit him. He performed in numerous comedy shows and pep rallies. After graduating he took some acting classes in the Inland Empire which put him in front of a manager by the name of Vance from Advance LA. This would help him make the transition to Los Angeles. His first appearance as a working actor would come soon afterwards. Starring in a PBS educational program called \"Madison Heights\" Allen portrayed the role of \"Tyrone\" a young street thug. Noticing the charisma and potential in Allen, Vance would later refer him to a woman that would change his life forever...Mrs. Bobbie Shaw Chance. Her alumni is some of the most wanted actors in the business such as Drew Barrymore, Giovanni Ribisi, Kiko Ellworth, and many other of Hollywood's elite. With Bobbie's help and that of an extraordinary fellow student by the name of Choice Skinner, Allen would grow from a young man with an extreme amount of raw energy and charisma to a bona fide \"A\" list actor. Allen quickly grew to love and understand the craft of acting. Shortly after joining Bobbie's acting studio, Allen booked his first big screen appearance in the hit film \"Friday After Next\" as a juvenile delinquent that would attack Ice Cube and Mike Epps with a pool stick. Currently Allen has a recurring role on the Emmy award winning soap opera \"The Young and The Restless\" as Jamal. He participates in a National Radio program called the \"The Courtyard\" as Malcolm Y every Saturday from 1:00 to 2:00 on the popular radio station KPFK 90.7. In the immediate future Allen has three films that will be premiering this fall. They are as follows, \"God Army 2: States of Grace\" as Rob, \"America 101\" as a smart mouth sarcastic ticket clerk and \"A Beautiful Life\" as Portfolio a young aspiring guitar player.",
        "birthday": "1983-05-20",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.allenmaldonado.net/",
        "id": 141432,
        "imdb_id": "nm1280286",
        "known_for_department": "Acting",
        "name": "Allen Maldonado",
        "place_of_birth": "Bellflower - California - USA",
        "popularity": 0.247,
        "profile_path": "/rl8YFsk4XsFZqCZO5jHNwP0Qoog.jpg"
    }
}