{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/eTlcNXGv32zkVI7ZDHhfeaKHXKQ.jpg",
                "genre_ids": [
                    28,
                    9648,
                    878,
                    53
                ],
                "id": 198663,
                "original_language": "en",
                "original_title": "The Maze Runner",
                "overview": "A teenager with no memory of his past finds himself among a group of boys living in a walled enclosure surrounded by a massive, ever-changing maze. As he struggles to adapt to their rules and society, he begins to uncover clues that may lead to escape and the truth behind their confinement.",
                "popularity": 23.2679,
                "poster_path": "/ode14q7WtDugFDp78fo9lCsmay9.jpg",
                "release_date": "2014-09-10",
                "title": "The Maze Runner",
                "video": false,
                "vote_average": 7.192,
                "vote_count": 17558,
                "character": "Glader",
                "credit_id": "54bccf999251416e9b003a79",
                "order": 25
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Nicholas Michael Killebrew"
        ],
        "biography": "Nicholas Michael Killebrew was born on October 7, 1992, in Metairie, Louisiana. When he was only a year old, his family moved to the Northshore where he grew up, and later picked up his love for film and music. At 10 years old, Killebrew began writing and acting in his own short films, pursuing his passions and hoping to one day live his dream of being in the movies. He attended Ponchatoula High School in Ponchatoula, LA, where he took his first few theatre and drama classes. He then graduated from Ponchatoula High, and began his bachelor's degree at Southeastern Louisiana University, studying Marketing. In 2012, Killebrew finally made his first professional, on-screen appearance as \"Camera Man\" in Ragin Cajun Redneck Gators (2013). He then went on to playing a \"Demon Figure\" in Demonic (2014), and as a \"Glader\" in The Maze Runner (2014).  - IMDb Mini Biography",
        "birthday": "1992-10-07",
        "deathday": null,
        "gender": 0,
        "homepage": null,
        "id": 1415423,
        "imdb_id": "nm5767590",
        "known_for_department": "Acting",
        "name": "Nick Killebrew",
        "place_of_birth": "Metairie - Louisiana - USA",
        "popularity": 0.0429,
        "profile_path": null
    }
}