{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/eTlcNXGv32zkVI7ZDHhfeaKHXKQ.jpg",
                "genre_ids": [
                    28,
                    9648,
                    878,
                    53
                ],
                "id": 198663,
                "original_language": "en",
                "original_title": "The Maze Runner",
                "overview": "A teenager with no memory of his past finds himself among a group of boys living in a walled enclosure surrounded by a massive, ever-changing maze. As he struggles to adapt to their rules and society, he begins to uncover clues that may lead to escape and the truth behind their confinement.",
                "popularity": 23.2679,
                "poster_path": "/ode14q7WtDugFDp78fo9lCsmay9.jpg",
                "release_date": "2014-09-10",
                "title": "The Maze Runner",
                "video": false,
                "vote_average": 7.192,
                "vote_count": 17558,
                "character": "Glader",
                "credit_id": "54bccd2292514148b000778f",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Carl Greene",
            "Cazi"
        ],
        "biography": "Born in Salem, Massachusetts, Greene spent his childhood performing in anything from talent shows to tap dancing competitions while sports were well in the mix. It was from these experiences that Greene learned that any opportunity is a good one and should be taken. Through these trials he discovered his love for competition and achieving. This drive to achieve brought him to audition for a role in the independent film \"Piper's World\" for the role of Tyler where he found his true passion acting. At the age of 12 Greene and his mother moved to Las Vegas, NV where he began playing athletics once his name began to spread he was recruited to join the track team where his gift was formally realized, he then went on to run cross country and track where he set multiple records, wins and championships for him and his team. He graduated from Foothill High School in 2011. Greene then moved to AZ where he became a men's cross country National Champion. He was named All American and NV legend he also participated in Junior Olympics. People are also surprised by the fact that he is musically gifted. Greene sings and writes his own songs. He is also working on his first album, while pursuing his acting and singing dreams.  - IMDb Mini Biography",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1415413,
        "imdb_id": "nm5155685",
        "known_for_department": "Acting",
        "name": "Cazi Greene",
        "place_of_birth": "Salem - Massachusetts - USA",
        "popularity": 0.0327,
        "profile_path": "/r2apJwXU3FFxpkHxtpQ7fXw5UZq.jpg"
    }
}