{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8s7FJ9dHXgeFZdvxfjPmrrJh6EC.jpg",
                "genre_ids": [
                    18,
                    10751,
                    14
                ],
                "id": 11236,
                "original_language": "en",
                "original_title": "The Secret Garden",
                "overview": "A young British girl born and reared in India loses her neglectful parents in an earthquake. She is returned to England to live at her uncle's castle. Her uncle is very distant due to the loss of his wife ten years before. Neglected once again, she begins exploring the estate and discovers a garden that has been locked and forgotten. Aided by one of the servants' boys, she begins restoring the garden, and eventually discovers some other secrets of the manor.",
                "popularity": 2.4846,
                "poster_path": "/zf6h5dJ7wVG7LqMO9dhHGHVejzj.jpg",
                "release_date": "1993-08-13",
                "title": "The Secret Garden",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 938,
                "character": "Ben Weatherstaff",
                "credit_id": "565c8e31c3a3680a5200040c",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/lhpokM60CnLWcNETQqKMz2q9ryL.jpg",
                "genre_ids": [
                    18,
                    10749,
                    35
                ],
                "id": 9454,
                "original_language": "en",
                "original_title": "EverAfter",
                "overview": "Danielle, a vibrant young woman is forced into servitude after the death of her father when she was a young girl. Danielle's stepmother Rodmilla is a heartless woman who forces Danielle to do the cooking and cleaning, while she tries to marry off the eldest of her two daughters to the prince. But Danielle's life takes a wonderful turn when, under the guise of a visiting royal, she meets the charming Prince Henry.",
                "popularity": 4.8604,
                "poster_path": "/9TspO5dThMBioF0DFrvy6YqrngH.jpg",
                "release_date": "1998-07-31",
                "title": "EverAfter",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 1510,
                "character": "Maurice",
                "credit_id": "59623882c3a3680d590aec0d",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "والتر اسپارو"
        ],
        "biography": "Walter Leonard Sparrow was an English film and television actor best known for his appearance as Duncan in the 1991 film Robin Hood: Prince of Thieves starring Kevin Costner. He began his career as a stand up comedian before turning to drama and performing with the Royal Shakespeare Company. He made his movie debut in 1965's Dr.Terror's House of Horrors. As well as Robin Hood, Sparrow appeared in more than 30 films,  including I Hired A Contract Killer,  The Accidental Tourist, The Secret Garden, Now & Then, Jane Eyre, Ever After and Treasure Island. He also appeared in over 50 television guest spots on both American and British TV. One of his more notable guest appearances was in the 1989 episode Danger UXD of the sitcom Only Fools and Horses, which had 16.1 million viewers, as porn shop owner Dirty Barry.",
        "birthday": "1927-01-22",
        "deathday": "2000-05-31",
        "gender": 2,
        "homepage": null,
        "id": 141521,
        "imdb_id": "nm0817112",
        "known_for_department": "Acting",
        "name": "Walter Sparrow",
        "place_of_birth": "Eltham, London, England, UK",
        "popularity": 0.9896,
        "profile_path": "/1GPhxI5s782nxaRJQGt9GXnqIWZ.jpg"
    }
}