{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/56H7AtJ5GK4UxFoHuw9QDwI7wzD.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 42297,
                "original_language": "en",
                "original_title": "Burlesque",
                "overview": "Ali leaves behind a troubled life and follows her dreams to Los Angeles, where she lands a job as a cocktail waitress at the Burlesque Lounge, a once-majestic theater that houses an inspired musical revue. Vowing to perform there, she makes the leap from bar to stage, helping restore the club's former glory.",
                "popularity": 5.0965,
                "poster_path": "/3U9zBIibERQZqYKM3N1a4MYgBsN.jpg",
                "release_date": "2010-11-23",
                "title": "Burlesque",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 2306,
                "character": "Natalie",
                "credit_id": "52fe45fac3a36847f80e573b",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/qDQEQbgP3v7B9IYLAUcYexNrVYP.jpg",
                "genre_ids": [
                    10751,
                    16,
                    35,
                    12
                ],
                "id": 404368,
                "original_language": "en",
                "original_title": "Ralph Breaks the Internet",
                "overview": "Video game bad guy Ralph and fellow misfit Vanellope von Schweetz must risk it all by traveling to the World Wide Web in search of a replacement part to save Vanellope's video game, Sugar Rush. In way over their heads, Ralph and Vanellope rely on the citizens of the internet — the netizens — to help navigate their way, including an entrepreneur named Yesss, who is the head algorithm and the heart and soul of trend-making site BuzzzTube.",
                "popularity": 7.0486,
                "poster_path": "/iVCrhBcpDaHGvv7CLYbK6PuXZo1.jpg",
                "release_date": "2018-11-20",
                "title": "Ralph Breaks the Internet",
                "video": false,
                "vote_average": 7.168,
                "vote_count": 7833,
                "character": "News Anchor (voice)",
                "credit_id": "5bfd60e6c3a3686476036134",
                "order": 55
            },
            {
                "adult": false,
                "backdrop_path": "/feQvRl67oc4AOWN4LhAwkrMWdX4.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 664300,
                "original_language": "en",
                "original_title": "Shiva Baby",
                "overview": "College student Danielle must cover her tracks when she unexpectedly runs into her sugar daddy at a shiva - with her parents, ex-girlfriend and family friends also in attendance.",
                "popularity": 2.858,
                "poster_path": "/4sdqVsT6SHqtbCYZS7bhVoEftlL.jpg",
                "release_date": "2021-03-26",
                "title": "Shiva Baby",
                "video": false,
                "vote_average": 7.139,
                "vote_count": 706,
                "character": "Kim",
                "credit_id": "5e648107151c5c0017feffcb",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "다이아나 애그론",
            "다이애나 에그론",
            "Dianna Elise Agron",
            "Νταϊάνα Άγκρον",
            "ディアナ・アグロン"
        ],
        "biography": "Dianna Elise Agron (born April 30, 1986) is an American actress and singer. After primarily dancing and starring in small musical theater productions in her youth, Agron made her screen debut in 2006, and in 2007, she played recurring character Debbie Marshall on Heroes and had her first leading role. In 2009, she took the notable role of the antagonistic but sympathetic head cheerleader Quinn Fabray on the Fox musical comedy-drama series Glee. For her role in the series, she won a SAG Award and, as part of the cast, was nominated for the Brit Award for Best International Breakthrough Act, among other accolades.\n\nAfter Glee proved to be a breakthrough success, Agron began working more in film, first starring in the popular young adult adaptation I Am Number Four (2011) as Sarah Hart before taking on films aimed at more diverse audiences, including the 2013 mob-comedy The Family and 2015's Bare. She has also directed several short films and music videos and, in 2017, began performing as a singer at the Café Carlyle in New York City, while continuing to star in films including Novitiate and Hollow in the Land in 2017, Shiva Baby in 2020, and As They Made Us in 2022. She directed part of the 2019 anthology feature film Berlin, I Love You, as well as acting in it. As a singer, Agron is noted for her husky lyric contralto voice.",
        "birthday": "1986-04-30",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 141687,
        "imdb_id": "nm1872698",
        "known_for_department": "Acting",
        "name": "Dianna Agron",
        "place_of_birth": "Savannah, Georgia, USA",
        "popularity": 0.8836,
        "profile_path": "/9BVahBiKoMKndboGFYQYtEd3RM4.jpg"
    }
}