{
    "movies": {
        "cast": [],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Hugo Chavez"
        ],
        "biography": "Hugo Rafael Chávez Frías (born July 28, 1954) was the 56th President of Venezuela, having held that position since 1999 until the time of his dead in 2013. Following his own political ideology of Bolivarianism and \"Socialism for the 21st Century\", he had focused on implementing socialist reforms in the country as a part of a social project known as the Bolivarian Revolution, which has seen the implementation of a new constitution, participatory democracy and the nationalisation of several key industries.\n\nBorn into a working class family in Sabaneta, Barinas, Chávez became a career military officer, and after becoming dissatisfied with the Venezuelan puntofijismo political system which he viewed as corrupt and undemocratic, he founded the secretive Revolutionary Bolivarian Movement-200 (MBR-200) in the early 1980s to work towards overthrowing it. After the Democratic Action government of President Carlos Andrés Pérez ordered the violent repression of protests against spending cuts, Chávez led the MBR-200 in an unsuccessful coup d'état against the government in 1992, for which he was imprisoned.\n\nGetting out of prison after two years, he founded a political party, the Fifth Republic Movement, and was elected president of Venezuela in 1998. He subsequently introduced a new constitution which increased rights for marginalised groups and altered the structure of Venezuelan government, and was re-elected in 2000. During his second presidential term, he introduced a system of Bolivarian Missions, Communal Councils and worker-managed cooperatives, whilst also nationalising various key industries. The opposition movement meanwhile, fearing that he was eroding representative democracy and becoming increasingly authoritative, attempted to remove him from power both through an unsuccessful military coup in 2002 and a recall referendum in 2003. He was again elected into power in 2006, following which he founded a new political party, the United Socialist Party of Venezuela (PSUV), in 2007.\n\nA vocal critic of capitalism and in particular neoliberalism, Chávez has been a prominent opponent of the United States' foreign policy, which he describes as imperialistic. Allying himself strongly with the socialist governments of Fidel and Raúl Castro in Cuba, Evo Morales in Bolivia, and Rafael Correa of Ecuador, his presidency is seen as a part of the leftist \"pink tide\" sweeping Latin America. He has supported Latin American and Caribbean cooperation and was instrumental in setting up the pan-regional Union of South American Nations, the Bolivarian Alliance for the Americas, the Bank of the South, and the regional television network TeleSur. His political influence in Latin America led Time magazine to include him among their list of the world's 100 most influential people in both 2005 and 2006.",
        "birthday": "1954-07-28",
        "deathday": "2013-03-05",
        "gender": 2,
        "homepage": null,
        "id": 141677,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Hugo Chávez",
        "place_of_birth": "Sabaneta, Venezuela",
        "popularity": 0.0475,
        "profile_path": "/csTGT1veyI7nfyctOMTE19TT7ih.jpg"
    }
}