{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fBvSfLetWlAMevQVHa0nBDV1Fon.jpg",
                "genre_ids": [
                    28,
                    53
                ],
                "id": 1572,
                "original_language": "en",
                "original_title": "Die Hard: With a Vengeance",
                "overview": "New York detective John McClane is back and kicking bad-guy butt in the third installment of this action-packed series, which finds him teaming with civilian Zeus Carver to prevent the loss of innocent lives. McClane thought he'd seen it all, until a genius named Simon engages McClane, his new \"partner\" -- and his beloved city -- in a deadly game that demands their concentration.",
                "popularity": 8.4761,
                "poster_path": "/buqmCdFQEWwEpL3agGgg2GVjN2d.jpg",
                "release_date": "1995-05-19",
                "title": "Die Hard: With a Vengeance",
                "video": false,
                "vote_average": 7.273,
                "vote_count": 6368,
                "character": "Officer Jane",
                "credit_id": "52fe42ffc3a36847f80329af",
                "order": 12
            },
            {
                "adult": false,
                "backdrop_path": "/iv1ajZACUGHn4JztG9Z8yvbcmic.jpg",
                "genre_ids": [
                    35,
                    10402
                ],
                "id": 1584,
                "original_language": "en",
                "original_title": "School of Rock",
                "overview": "Fired from his band and hard up for cash, guitarist and vocalist Dewey Finn finagles his way into a job as a fifth-grade substitute teacher at a private school, where he secretly begins teaching his students the finer points of rock 'n' roll. The school's hard-nosed principal is rightly suspicious of Finn's activities. But Finn's roommate remains in the dark about what he's doing.",
                "popularity": 9.283,
                "poster_path": "/zXLXaepIBvFVLU25DH3wv4IPSbe.jpg",
                "release_date": "2003-10-03",
                "title": "School of Rock",
                "video": false,
                "vote_average": 7.085,
                "vote_count": 5874,
                "character": "Alicia's Mother",
                "credit_id": "56d040829251413e6d005ca9",
                "order": 39
            },
            {
                "adult": false,
                "backdrop_path": "/42mSR48e4h6Zp5BkTUyWPYsAA1X.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 1883,
                "original_language": "en",
                "original_title": "Malcolm X",
                "overview": "A tribute to the controversial black activist and leader of the struggle for black liberation. He hit bottom during his imprisonment in the '50s, he became a Black Muslim and then a leader in the Nation of Islam. His assassination in 1965 left a legacy of self-determination and racial pride.",
                "popularity": 7.04,
                "poster_path": "/o2s9ow0uRRm1BcF3teznk5twd90.jpg",
                "release_date": "1992-11-18",
                "title": "Malcolm X",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 1773,
                "character": "Augusta",
                "credit_id": "57c9f128c3a36847ba003803",
                "order": 43
            },
            {
                "adult": false,
                "backdrop_path": "/gZWl93sf8AxavYpVT1Un6EF3oCj.jpg",
                "genre_ids": [
                    80,
                    53,
                    18
                ],
                "id": 475557,
                "original_language": "en",
                "original_title": "Joker",
                "overview": "During the 1980s, a failed stand-up comedian is driven insane and turns to a life of crime and chaos in Gotham City while becoming an infamous psychopathic crime figure.",
                "popularity": 15.2359,
                "poster_path": "/udDclJoHjfjb8Ekgsd4FDteOkCU.jpg",
                "release_date": "2019-10-01",
                "title": "Joker",
                "video": false,
                "vote_average": 8.133,
                "vote_count": 26800,
                "character": "Social Worker",
                "credit_id": "5ca5b82dc3a36826c5af011e",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Sharon Washington is an American playwright as well as a stage, TV, film, and voice actress. She received her MFA from the Yale School of Drama and her BA from Dartmouth College.\n\nShe got her start doing soap operas such as the 1996 season of \"One Life to Live\" in addition to having a recurring role on the mini-series follow-up \"Heaven & Earth: North & South, Book III\".\n\nShe has had guest star appearances in TV series including Power Book III: Raising Kanan, and in the final season of Madam Secretary. She’s also had recurring roles in For Life, City On A Hill, The Code, Gotham, Law & Order: SVU, and Damages.\n\nOther television credits include the Hulu series The Looming Tower, Blue Bloods, The Blacklist, Golden Boy, White Collar, Royal Pains, NYC 22, Law & Order and Law & Order: CI. She has appeared in numerous television commercials both on-camera and voice-over and is an accomplished audiobook and documentary film narrator.\n\nShe played Lena in the webseries Hustling for which she was awarded an Indie Series award for Best Supporting Actress (2015).  Her film appearances include Joker, The Bourne Legacy, Michael Clayton, Wiener Dog, Rocksteady, Taking Chance, Freedomland, The School of Rock, Half Nelson, The Long Kiss Goodnight, Malcolm X, and Die Hard With A Vengeance. She also appeared in the short film Approaching A Breakthrough, directed by Noah Pritzker, which premiered at the 2017 Tribeca Film Festival. \n\nShe is the narrator of several documentary series for Animal Planet, Discovery, NOVA and TV One. She has also narrated a diverse range of PBS, Nova, National Geographic, and Discovery Channel programs. She voiced different characters in two installments of the successful Grand Theft Auto video game saga.\n\nShe added playwright to her resumé, writing and performing her solo play Feeding The Dragon which received it’s world premiere at City Theatre in Pittsburgh followed by a production at Hartford Stage and from there to a successful run Off-Broadway at Primary Stages at the Cherry Lane Theater in the Spring of 2018 where she was nominated for an Outer Critics Circle Award for Outstanding Solo Performance, a Lucille Lortel Award for Outstanding Solo Show and won an Audelco Award for Solo Performance.\n\nOn Broadway, she appeared as The Lady in the critically-acclaimed The Scottsboro Boys musical by Kander & Ebb directed by five-time Tony Award winner Susan Stroman. A role she originated at The Vineyard Theatre and The Guthrie.\n\nOther Off-Broadway credits include roles in Dot at the Vineyard Theatre, written by Colman Domingo and also directed by Susan Stroman; While I Yet Live by Billy Porter at Primary Stages; Luce by JC Lee at Lincoln Center Theater (LCT3); and Wild With Happy also by Colman Domingo at the Public Theater for which she received a Lucille Lortel Award nomination and an Audelco Award.\n\nShe has worked many times on the New York Shakespeare Festival stage including playing Lady Anne to Denzel Washington's Richard III and Valeria to Christopher Walken's Coriolanus; as well as in the award-winning adaptation of Caucasian Chalk Circle directed by George C. Wolfe and Stuff Happens directed by Daniel Sullivan.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "https://iamsharonwashington.com/",
        "id": 141748,
        "imdb_id": "nm0913531",
        "known_for_department": "Acting",
        "name": "Sharon Washington",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.1956,
        "profile_path": "/kZktXVoRLaETbNkiMoDBzFpdWVB.jpg"
    }
}