{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6Zo212BjDdDMqRIqcaiWXn10hty.jpg",
                "genre_ids": [
                    28,
                    36,
                    18
                ],
                "id": 37472,
                "original_language": "cn",
                "original_title": "葉問2",
                "overview": "Having defeated the best fighters of the Imperial Japanese army in occupied Shanghai, Ip Man and his family settle in post-war Hong Kong. Struggling to make a living, Master Ip opens a kung fu school to bring his celebrated art of Wing Chun to the troubled youth of Hong Kong. His growing reputation soon brings challenges from powerful enemies, including pre-eminent Hung Gar master, Hung Quan.",
                "popularity": 0.6589,
                "poster_path": "/aC5nwtbadmJqvl4eVCJPno16Mx5.jpg",
                "release_date": "2010-04-29",
                "title": "Ip Man 2",
                "video": false,
                "vote_average": 7.459,
                "vote_count": 2373,
                "character": "Twister Supporter",
                "credit_id": "54cfc02c925141475d0085c9",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Christian Bachini",
            "Kang",
            "Christian Kang Bachini",
            "Christian Kang"
        ],
        "biography": "Italy's first martial arts action star Christian Bachini, growing up watching Hong Kong martial arts films and inspired by his childhood idols such as Jackie Chan and the late great Bruce Lee, determined to make an impact on the martial arts genre, left everything behind and moved to China in 2009 to write his own legacy in action cinema.\n\nAs a professional actor combined with over 14 years of training in traditional kung fu, modern wushu, extreme martial arts, Tae Kwon Do, Capoeira, and many other combat styles, after starring in several independent action movies produced by local production houses and his experience acting on the set of the Hong Kong action hit film, Ip Man 2, Christian begins to launch a new wave for the action genre in Shanghai. Incorporating stylized and visual dazzling Asian martial arts with western fighting styles as well as extreme martial arts, parkour, Jujitsu, and Capoeira, he gave birth to a new mix of fighting arts.\n\nTo match with his strong self confidence and never say die attitude, Christian adopted the name \"Kang\" which means \"to counter and resist\" in Chinese, to show his dedication and determination to create a new action style that showcase the efficient and hard hitting Western style of fighting with Chinese kung fu's visually impressive fight choreography that uses no wires, stunt doubles, or use of CGI.",
        "birthday": null,
        "deathday": null,
        "gender": 0,
        "homepage": "http://www.christiankangbachini.com/",
        "id": 1421366,
        "imdb_id": "nm3985011",
        "known_for_department": "Acting",
        "name": "Christian Kang Bachini",
        "place_of_birth": "Parma (Italy)",
        "popularity": 0.0389,
        "profile_path": null
    }
}