{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zAL3LOswagN9onjN8DPcNFTqKuD.jpg",
                "genre_ids": [
                    18
                ],
                "id": 705,
                "original_language": "en",
                "original_title": "All About Eve",
                "overview": "From the moment she glimpses her idol at the stage door, Eve Harrington is determined to take the reins of power away from the great actress Margo Channing. Eve maneuvers her way into Margo's Broadway role, becomes a sensation and even causes turmoil in the lives of Margo's director boyfriend, her playwright and his wife. Only the cynical drama critic sees through Eve, admiring her audacity and perfect pattern of deceit.",
                "popularity": 2.0482,
                "poster_path": "/blBzZaatPWVuWpXEnPscMA4Xp6m.jpg",
                "release_date": "1950-11-09",
                "title": "All About Eve",
                "video": false,
                "vote_average": 8.076,
                "vote_count": 1604,
                "character": "Sarah Siddons Awards Guest (uncredited)",
                "credit_id": "636a4b829f1be70081a6dbb5",
                "order": 40
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Marion Dean Hughes was born in Greenwich, Connecticut. She received a B.A. from UCLA in 1932. As an actress she appeared on Broadway in \"New Faces\", \"Three Waltzes\" and \"I Must Love Someone.\" In stock she appeared in \"The Women\" and \"The Man Who Came to Dinner.\" She also appeared in the national tour of \"Lady in the Dark.\" She appeared in various nightclub stints and from 1951-59 she ran her own club, \"Marion Parker's Guys & Dolls\" in Scottsdale, Arizona. After 1960 she switched from performing to working in managerial positions, though she did appear in a 1964 TV commercial for Ivory Soap. By 1970 she was a public relations consultant.",
        "birthday": "1911-07-21",
        "deathday": "1998-02-11",
        "gender": 1,
        "homepage": null,
        "id": 1421291,
        "imdb_id": "nm0682425",
        "known_for_department": "Acting",
        "name": "Marion Pierce",
        "place_of_birth": " Greenwich, Connecticut, U.S.",
        "popularity": 0.0261,
        "profile_path": null
    }
}