{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rFY9V4Dhq7lbIu6LlpzbL9u2K2E.jpg",
                "genre_ids": [
                    35
                ],
                "id": 257211,
                "original_language": "en",
                "original_title": "The Intern",
                "overview": "70-year-old widower Ben Whittaker has discovered that retirement isn't all it's cracked up to be. Seizing an opportunity to get back in the game, he becomes a senior intern at an online fashion site, founded and run by Jules Ostin.",
                "popularity": 9.0769,
                "poster_path": "/9UoAC9tu8kIyRy8AcJnGhnH0gOH.jpg",
                "release_date": "2015-09-23",
                "title": "The Intern",
                "video": false,
                "vote_average": 7.226,
                "vote_count": 7017,
                "character": "ATF Receptionist",
                "credit_id": "5692bf09c3a3684cff002c6c",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Paulina Singer (born September 5, 1991) is an American actress, known for her roles as Grace Bledsoe on WE TV's horror drama series South of Hell and Jessie Tyler on Freeform's teen drama series Dead of Summer.\n\nSinger was born and raised in Exeter, New Hampshire. Her father is African American and her mother is of Ukrainian descent. She studied for a year at Eugene Lang College The New School for Liberal Arts in New York City before dropping out to pursue an acting career. At 19, Singer joined the Upright Citizens Brigade to study improvisational theatre.\n\nIn 2015, Singer was cast in a main role in the WE TV horror drama series South of Hell, executive produced by Eli Roth and Jason Blum. She portrayed Grace Bledsoe, alongside Mena Suvari and Bill Irwin. The following year, she joined the regular cast of Freeform's teen drama-thriller series Dead of Summer, portraying summer camp counselor Jessie Tyler. In 2017, she portrayed the lead role of Kelley Winters in the Lifetime television film High School Lover, alongside James Franco, Lana Condor and Julia Jones.",
        "birthday": "1991-09-05",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1422977,
        "imdb_id": "nm4732761",
        "known_for_department": "Acting",
        "name": "Paulina Singer",
        "place_of_birth": "Exeter, New Hampshire, USA",
        "popularity": 0.2448,
        "profile_path": "/uVJ6cFZEAn6w3fJbFZmfhefhxAL.jpg"
    }
}