{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/38yjZWYBI0xxNqoBKiGyA4UZjk.jpg",
                "genre_ids": [
                    80,
                    18,
                    53
                ],
                "id": 6075,
                "original_language": "en",
                "original_title": "Carlito's Way",
                "overview": "Free after years in prison, Carlito Brigante intends to give up his criminal ways, but it's not long before the ex-con is sucked back into the New York City underworld. Reconnecting with his dancer girlfriend, Carlito gets entangled in the shady dealings of his friend Dave Kleinfeld, who also serves as his lawyer. An encounter with shifty gangster Benny Blanco sets the duo on a dangerous path.",
                "popularity": 5.3983,
                "poster_path": "/g6D7mjQtndu768cusGmoEQY9fTB.jpg",
                "release_date": "1993-11-10",
                "title": "Carlito's Way",
                "video": false,
                "vote_average": 7.83,
                "vote_count": 3307,
                "character": "Waitress (uncredited)",
                "credit_id": "55df48d2c3a368347d000213",
                "order": 92
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Cice Master"
        ],
        "biography": "Cice Rivera, (born June 20, 1970) is an American television and film actress, makeup artist, director, producer, photographer, writer and published author. She began acting classes at sixteen and made her first movie appearance in Carlito's Way (1992) and The Cowboy Way (1994). Since establishing her career as a rising Hollywood actress and author, with films such as Carlito's Angels and Blue's Clues shows, which received 3 wins and 30 nominations, NYTimes awards and award winning show. Early life Rivera was born in Newark, N.J. Currently resides in Hollywood, F.L. the daughter of Nilda Lopez, a Hispanic cosmetologist and Rafael Rivera Sr., a Hispanic entrepreneur from Arecibo Puerto Rico. Rivera's maternal grandparents are from Spain and Puerto Rico. On her father's side, she is descended from a prominent family in Puerto Rico. Rivera has an older brother Rafael, a younger brother Manuel and a adopted little sister Alexis. Rivera lived in West Orange N.J. until age eighteen, where she took art and writing classes at an art gallery nearby. She frequently wrote poetry and did canvas art for much of her childhood. Rivera studied art as a child and also taking small parts in any production. Rivera attended West Orange High School for a short period: Later attending and graduating from Florida School of Excellence. Rivera participated in high school theater productions, art, photography and fashion design. Rivera enrolled in the University of Metaphysical Science in California 2004. Prior to this, she worked as a bartender while pursuing an acting career. She went into Manhattan daily to pursue auditions and supported herself with a variety of odd jobs. Rivera later completed her coursework and was awarded a degree from UMS and Addiction Academy of SF and is furthering her education with a degree in psychology. She is Florida State licensed counselor. She is fluent in Spanish and intermediate in several languages. Career Modeling At 16, she began her career as a model. Rivera first modeling job was for a catalog. Following many fashion shows. She modeled for various photographers and companies.",
        "birthday": "1970-06-20",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1422582,
        "imdb_id": "nm1575218",
        "known_for_department": "Directing",
        "name": "Cice Rivera",
        "place_of_birth": "New Jersey",
        "popularity": 0.0379,
        "profile_path": "/vDZPzMP5G4Ctt1UggYTS112TIUo.jpg"
    }
}