{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tmowA51oykuOdiyqRCP0jGYU1mB.jpg",
                "genre_ids": [
                    18,
                    28,
                    80
                ],
                "id": 47931,
                "original_language": "pt",
                "original_title": "Tropa de Elite 2",
                "overview": "After a bloody invasion of the BOPE in the High-Security Penitentiary Bangu 1 in Rio de Janeiro to control a rebellion of interns, the Lieutenant-Colonel Roberto Nascimento and the second in command Captain André Matias are accused by the Human Right Aids member Diogo Fraga of execution of prisoners. Matias is transferred to the corrupted Military Police and Nascimento is exonerated from the BOPE by the Governor.",
                "popularity": 2.7233,
                "poster_path": "/c7yCrf3PTSdp6RMGktZQhzFcFFM.jpg",
                "release_date": "2010-10-08",
                "title": "Elite Squad: The Enemy Within",
                "video": false,
                "vote_average": 7.832,
                "vote_count": 1942,
                "character": "Vermont",
                "credit_id": "56a3be32c3a368389b00375c",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/x0pkoGlwWdkzRxgQioD3cUG0awu.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 1000837,
                "original_language": "pt",
                "original_title": "Ainda Estou Aqui",
                "overview": "A woman married to a former politician during the 1971 military dictatorship in Brazil is forced to reinvent herself and chart a new course for her family after a violent and arbitrary act.",
                "popularity": 6.6253,
                "poster_path": "/quSUoX9zBrK7abP20fRf4d5YlXA.jpg",
                "release_date": "2024-09-19",
                "title": "I'm Still Here",
                "video": false,
                "vote_average": 7.962,
                "vote_count": 806,
                "character": "Fernando Gasparian",
                "credit_id": "671db80a2685cb6563c10fec",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Charles Fricks de Andrade (Cachoeiro de Itapemirim, June 16, 1972) is a Brazilian actor. Of remote German descent, Fricks began his career in amateur theatre groups in his hometown. After living in the United States for a year, he returned to Brazil and settled in Rio de Janeiro, where he continued his studies in free courses at theatre schools.\n\nIn 1993, he joined the Companhia Atores de Laura, then directed by Daniel Herz and Susanna Kruger, he worked in more than ten shows and won a Shell Award nomination for his performance in As Artimanhas de Scapino. On TV, among other things, he worked on three micro-series directed by Luiz Fernando Carvalho: Hoje é dia de Maria - primeiro e segunda jornada; and Capitu. He has made 9 feature films. These include Nise, Almost Memory, Without Control, Chico Xavier - the film and Elite Squad 2.",
        "birthday": "1972-06-16",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 142323,
        "imdb_id": "nm1879448",
        "known_for_department": "Acting",
        "name": "Charles Fricks",
        "place_of_birth": "Cachoeiro de Itapemirim, Espirito Santo, Brazil",
        "popularity": 1.1767,
        "profile_path": "/8LhyR3pWr8RWx2YPlS8MQcEGgir.jpg"
    }
}