{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/Z3ocAumcK9Iooc9BMlu7wE7XX9.jpg",
                "genre_ids": [
                    35,
                    10402,
                    10749,
                    18
                ],
                "id": 198277,
                "original_language": "en",
                "original_title": "Begin Again",
                "overview": "Gretta, a budding songwriter, finds herself alone after her boyfriend Dave ditches her. Her life gains purpose when Dan, a record label executive, notices her talent.",
                "popularity": 3.6349,
                "poster_path": "/qx4HXHXt528hS4rwePZbZo20xqZ.jpg",
                "release_date": "2014-07-03",
                "title": "Begin Again",
                "video": false,
                "vote_average": 7.233,
                "vote_count": 3870,
                "character": "Butler",
                "credit_id": "54d4f634c3a3686ac201319c",
                "order": 23
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Howard F. Brewer Jr."
        ],
        "biography": "After retiring from the NYPD, Howard pursued a second career in acting, using the screen name Ron Voz. He played the corpse in three different productions of \"Lucky Stiff.\" He filmed with Richard Gere in \"The Hoax,\" playing the role of Norman Mailer, and with Robin Williams and John Travolta in the film \"Old Dogs.\" He played the role of the chauffeur in the Julia Roberts &amp; Clive Owens film, \"Duplicity.\" Following a principle role in the Disney film \"Enchanted,\" he joined the Screen Actors Guild. He recently filmed the Mighty Morphin Power Rangers teaser trailer, produced by his grandson Louis Maldarelli. He plays the butler in \"Can a Song Save Your Life\" (forthcoming, with Keira Knightley). He especially enjoyed volunteering in student-directed films at New York University, the School of Visual Arts, and the New York Film Academy.  - IMDb Mini Biography",
        "birthday": "1940-03-18",
        "deathday": "2012-12-11",
        "gender": 2,
        "homepage": null,
        "id": 1423884,
        "imdb_id": "nm2590342",
        "known_for_department": "Acting",
        "name": "Ron Voz",
        "place_of_birth": "Astoria - New York - USA",
        "popularity": 0.0071,
        "profile_path": null
    }
}