{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/Z3ocAumcK9Iooc9BMlu7wE7XX9.jpg",
                "genre_ids": [
                    35,
                    10402,
                    10749,
                    18
                ],
                "id": 198277,
                "original_language": "en",
                "original_title": "Begin Again",
                "overview": "Gretta, a budding songwriter, finds herself alone after her boyfriend Dave ditches her. Her life gains purpose when Dan, a record label executive, notices her talent.",
                "popularity": 3.6349,
                "poster_path": "/qx4HXHXt528hS4rwePZbZo20xqZ.jpg",
                "release_date": "2014-07-03",
                "title": "Begin Again",
                "video": false,
                "vote_average": 7.233,
                "vote_count": 3870,
                "character": "Singer Songwriter 2",
                "credit_id": "54d4d27b9251413fcd013f65",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Black Pumas"
        ],
        "biography": "In 2017, singer and songwriter Eric Burton made his way from California to Texas. Born in the San Fernando Valley, he grew up singing in church and then got heavily involved in musical theater. He started busking at the Santa Monica Pier, where he brought in a few hundred dollars a day and developed his performance skills. Burton traveled through the Western states, studying music at New Mexico State University before deciding to settle down and busk in Austin, Texas.\n\nThrough a mutual friend, Adrian Quesada connected with Burton. Quesada felt that Burton's vocals were a match for the retro-funk- and R&B-flavored tracks Quesada had been working on and the two joined forces in 2018 as Black Pumas. The group received its first Grammy Award nomination in 2020 for Best New Artist at the 62nd awards. They went on to get Record of the Year and Album of the Year nominations at the 63rd Grammy Awards.",
        "birthday": "1989-10-07",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.ericburdon.com/",
        "id": 1423812,
        "imdb_id": "nm6581067",
        "known_for_department": "Acting",
        "name": "Eric Burton",
        "place_of_birth": "San Fernando Valley, California",
        "popularity": 0.2158,
        "profile_path": "/kXdpnsXyAqVJGoqQ2FrJP1ACnf2.jpg"
    }
}