{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1tXlUvfhLVjM5rZcN2783IhCkbu.jpg",
                "genre_ids": [
                    28,
                    18
                ],
                "id": 307081,
                "original_language": "en",
                "original_title": "Southpaw",
                "overview": "Billy \"The Great\" Hope, the reigning junior middleweight boxing champion, has an impressive career, a loving wife and daughter, and a lavish lifestyle. However, when tragedy strikes, Billy hits rock bottom, losing his family, his house and his manager. He soon finds an unlikely savior in Tick Willis, a former fighter who trains the city's toughest amateur boxers. With his future on the line, Hope fights to reclaim the trust of those he loves the most.",
                "popularity": 8.7038,
                "poster_path": "/kSQ49Fi3NVTqGGXILmxV2T2pdkG.jpg",
                "release_date": "2015-03-24",
                "title": "Southpaw",
                "video": false,
                "vote_average": 7.365,
                "vote_count": 5618,
                "character": "Leila Hope",
                "credit_id": "5563b933c3a3680532000056",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "우나 로렌스",
            "اونا لارنس"
        ],
        "biography": "Oona Laurence (born August 1, 2002) is an American actress who is best known for originating the role of Matilda Wormwood in Matilda on Broadway alongside Bailey Ryon, Milly Shapiro, and Sophia Gennusa. She is a New York City-based child actress with credits in film, theatre, and television. After several appearances in regional theatre productions and minor roles in short films and television episodes, in 2012, Laurence auditioned for the new musical Matilda on Broadway. Laurence landed the role of Matilda, performing in the show from March 4 to December 15, 2013. After Matilda, Laurence transitioned to film acting appearing in Tumorhead, A Little Game, The Grief of Others, I Smile Back, Damsel, Lamb, and Southpaw, portraying the daughter of Jake Gyllenhaal and Rachel McAdams' characters. She has appeared on television in Law & Order: Special Victims Unit and Orange Is the New Black. In 2015, Laurence co-starred opposite Jake Gyllenhaal and Rachel McAdams in Antoine Fuqua's Southpaw. In 2016, she co-starred as Natalie in the film Pete's Dragon, and portrayed Jane Mitchell, the daughter of Mila Kunis' character Amy Mitchell, in Bad Moms. In 2017, Laurence co-starred opposite Colin Farrell, Nicole Kidman, Kirsten Dunst, and Elle Fanning in Sofia Coppola's The Beguiled. She is the voice of Hedgehog and additional characters in the Cartoon Network series Summer Camp Island. She also performs the theme song. Laurence lives in New York City and has two younger sisters, Aimee and Jetè, who are also actresses.",
        "birthday": "2002-08-01",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1423519,
        "imdb_id": "nm4802218",
        "known_for_department": "Acting",
        "name": "Oona Laurence",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.5121,
        "profile_path": "/8meq4FBTAAuftXb2MCgY7lbeoRs.jpg"
    }
}