{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cVPBT3FqKG3BPXlH4Hg54KHxnqQ.jpg",
                "genre_ids": [
                    80,
                    53,
                    18
                ],
                "id": 934,
                "original_language": "fr",
                "original_title": "Du rififi chez les hommes",
                "overview": "Out of prison after a five-year stretch, jewel thief Tony turns down a quick job his friend Jo offers him, until he discovers that his old girlfriend Mado has become the lover of local gangster Pierre Grutter during Tony's absence. Expanding a minor smash-and-grab into a full-scale jewel heist, Tony and his crew appear to get away clean, but their actions after the job is completed threaten the lives of everyone involved.",
                "popularity": 1.8251,
                "poster_path": "/heVdAFNZUxXVmO6jiJcEHCvI5lK.jpg",
                "release_date": "1955-04-13",
                "title": "Rififi",
                "video": false,
                "vote_average": 7.786,
                "vote_count": 600,
                "character": "Rémi Grutter",
                "credit_id": "52fe4290c3a36847f8028733",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/mQsMFca19fZsLKMc6x5FjwncTYh.jpg",
                "genre_ids": [
                    28,
                    12,
                    53
                ],
                "id": 1672,
                "original_language": "fr",
                "original_title": "Le Professionnel",
                "overview": "French secret service agent Josselin Beaumont is dispatched to take down African warlord N'Jala. But when his assignment is canceled, he's shocked to learn that his government is surrendering him to local authorities. He is given a mock trial and sentenced to 20 years of hard labor. But Beaumont escapes from prison and vows not only to avenge himself against his betrayers but also to finish his original assignment.",
                "popularity": 3.7473,
                "poster_path": "/dhAZ8T0tTlTNw3D7Cn8wc87sk1w.jpg",
                "release_date": "1981-10-21",
                "title": "The Professional",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 556,
                "character": "Commissaire Rosen",
                "credit_id": "52fe430ac3a36847f8036185",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Abraham Hosseinoff",
            "Робер Оссейн"
        ],
        "biography": "Robert Hossein was a French film actor of Parsi origin, director and writer. He directed the 1982 adaption of Les Misérables, and appeared in Vice and Virtue, Le Casse, Les Uns et les Autres and Venus Beauty Institute. His most recent roles include starring as Michèle Mercier's husband in the Angélique series and as a Catholic priest who falls in love with Claude Jade and becomes a communist in Prêtres interdits (Forbidden Priests) in 1973.\n\nHossein started directing films in 1956 with Les salauds vont en enfer from a story by Frédéric Dard whose novels and plays went on to furnish Hossein with much of his later film material. Right from the start Hossein established his characteristic trademarks: using a seemingly straightforward suspense plot and subverting its conventions (sometimes to the extent of a complete disregard of the traditional demand for a final twist or revelation) in order to concentrate on ritualistic relationships. This is the director's running preoccupation which is always stressed in his films by an extraordinary command of film space and often striking frame compositions where the geometry of human figures and set design is used to accentuate the psychological set-up of the scene. The mechanisms of guilt and the way it destroys relationships is another recurring theme, presumably influenced by Hossein's lifelong interest in the works of Dostoyevski.\n\nAlthough Hossein had some modest international successes with films like Toi, le venin and Le vampire de Dusseldorf, he was much singled out for scorching criticism by the critics and followers of the New Wave for the unashamedly melodramatic frameworks of his films. The fact that he was essentially an auteur director with a consistent set of themes and an extraordinary mastery of original and unusual approaches to staging his stories, was never appreciated. He was not averse to trying his hand at widely different genres and was never defeated, making the strikingly different spaghetti western Une corde, un Colt and the low-budgeted but daringly subversive period drama J'ai tué Raspoutine. However, because of the lack of wider success and continuing adverse criticism, Hossein virtually ended his film directing career in 1970, having concentrated on theatre where his achievements were never questioned, and subsequently returning to film directing only twice. With two or three exceptions, his films remain commercially unavailable and very difficult to see.\n\nHe is the son of André Hossein a Zoroastrian French composer of Azerbaijani-Tajik descent, and a Jewish comedy actress from Kiev. He was married three times: first to Marina Vlady (he has two sons with her, Pierre and Igor), later to Caroline Eliacheff (with whom he has a son, Nicholas). He is currently married to actress Candice Patou, with whom he has one son, Julien.\n\nAccording to an article written by Emannuel Peze, Hossein experienced a conversion to Catholicism in 1971 during a visit to the Marian apparition at San Damiano in Lombardo Italy.\n\nDescription above from the Wikipedia article Robert Hossein, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1927-12-30",
        "deathday": "2020-12-31",
        "gender": 2,
        "homepage": null,
        "id": 14246,
        "imdb_id": "nm0396136",
        "known_for_department": "Acting",
        "name": "Robert Hossein",
        "place_of_birth": "Paris, France",
        "popularity": 1.3417,
        "profile_path": "/fh7dLd3KMKIxhWMz3Fz0T2s81Kc.jpg"
    }
}