{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yJYFp97trLmcNAQb5A4SXXhNJU4.jpg",
                "genre_ids": [
                    35,
                    10749,
                    14,
                    18
                ],
                "id": 103332,
                "original_language": "en",
                "original_title": "Ruby Sparks",
                "overview": "Calvin is a young novelist who achieved phenomenal success early in his career but is now struggling with his writing – as well as his romantic life. Finally, he makes a breakthrough and creates a character named Ruby who inspires him. When Calvin finds Ruby, in the flesh, sitting on his couch about a week later, he is completely flabbergasted that his words have turned into a living, breathing person.",
                "popularity": 10.4629,
                "poster_path": "/zELurt0GVRkR5X5ymuk7KXUxhC8.jpg",
                "release_date": "2012-07-25",
                "title": "Ruby Sparks",
                "video": false,
                "vote_average": 7.119,
                "vote_count": 1694,
                "character": "Party Goer 2 - Hammer",
                "credit_id": "5a297f91925141032c118d78",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "エデン・ブローリン",
            "ایدن برولین"
        ],
        "biography": "Eden Brolin (born 1994) is an American actress, best known for her role as Charlie Singer in the Beyond television series[1] and as Mia in Yellowstone. She is the daughter of actor Josh Brolin and Alice Adair.\n\nBrolin's first starring role was in the Richard Linklater-produced indie feature I Dream Too Much. Other credits include Code Black and Manson's Lost Girls. Brolin stars as the mysterious Charlie Singer in the supernatural drama Beyond on the Freeform TV channel. After a well-reviewed performance in season one, she was quickly promoted to a series regular by the network. Brolin also stars as Mia opposite Kevin Costner in the western drama Yellowstone, where she plays a barrel racer at the rodeo who becomes friendly with the bunkhouse guys. She starred as Ophelia in a 2019 stage production of Hamlet. In 2020, Brolin starred opposite Liam Hemsworth and Vince Vaughn in the Lionsgate theatrical feature Arkansas. Brolin is also the lead singer of the music group known as Atta Boy, and eight years after the band's debut album titled Out of Sorts was released, their second album titled Big Heart Manners was released on June 26, 2020.",
        "birthday": "1994-11-30",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1424363,
        "imdb_id": "nm2863262",
        "known_for_department": "Acting",
        "name": "Eden Brolin",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 1.9334,
        "profile_path": "/z64sPFRx1IomrKZvkRF8GLwCvag.jpg"
    }
}