{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tyj0QztA0PkYo6XauifWjkx7UVi.jpg",
                "genre_ids": [
                    16,
                    10751,
                    14,
                    12
                ],
                "id": 12092,
                "original_language": "en",
                "original_title": "Alice in Wonderland",
                "overview": "On a golden afternoon, wildly curious young Alice tumbles into the burrow and enters the merry, madcap world of Wonderland full of whimsical escapades.",
                "popularity": 7.9458,
                "poster_path": "/20cvfwfaFqNbe9Fc3VEHJuPRxmn.jpg",
                "release_date": "1951-07-28",
                "title": "Alice in Wonderland",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 6057,
                "character": "March Hare (voice)",
                "credit_id": "52fe44b29251416c7503de19",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Gerardo Luigi Colonna"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nGerardo Luigi \"Jerry\" Colonna (September 17, 1904 – November 22, 1986) was an American musician, actor, comedian, singer, songwriter and trombonist best remembered as the zaniest of Bob Hope's sidekicks in Hope's popular radio shows and films of the 1940s and 1950s.\n\nWith his pop-eyed facial expressions and walrus-sized handlebar moustache, Colonna was known for singing loudly \"in a comic caterwaul,\" according to Raised on Radio author Gerald Nachman, and for his catchphrase, \"Who's Yehudi?\", uttered after many an old joke, although it usually had nothing to do with the joke. The line was believed to be named for violin virtuoso Yehudi Menuhin, and the search for Yehudi became a running gag on the Hope show.\n\nColonna featured in three of the popular Hope-Crosby Road films: Road to Singapore (1940) as Achilles Bombassa, Road to Rio (1947) as a Cavalry captain and The Road to Hong Kong (1962) in a cameo role. He can also be seen in the Fred Allen vehicle, It's in the Bag! (1945), as psychiatrist Dr. Greenglass, and he made a brief appearance with Hope in the \"Wife, Husband and Wolf\" sketch in Star Spangled Rhythm. In 1956 he performed the featured song \"My Lucky Charm\" in the film Meet Me in Las Vegas, starring Dan Dailey and Cyd Charisse.\n\nHe provided the voice of the March Hare in the Walt Disney animated film version of Alice in Wonderland (1951) (another radio legend, Ed Wynn, voiced the Mad Hatter) and also lent his zany narration style to several Disney shorts, including Casey at the Bat (1946) and The Brave Engineer (1950).",
        "birthday": "1904-09-17",
        "deathday": "1986-11-21",
        "gender": 2,
        "homepage": null,
        "id": 142527,
        "imdb_id": "nm0173160",
        "known_for_department": "Acting",
        "name": "Jerry Colonna",
        "place_of_birth": "Boston, Massachusetts, USA",
        "popularity": 0.1178,
        "profile_path": "/wQ5k8eb8PSMEVQLncjmSqGSTedy.jpg"
    }
}