{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hqyjzDRCs1N5gEsh2gklzPdsEFD.jpg",
                "genre_ids": [
                    28,
                    53,
                    12
                ],
                "id": 56292,
                "original_language": "en",
                "original_title": "Mission: Impossible - Ghost Protocol",
                "overview": "Ethan Hunt and his team are racing against time to track down a dangerous terrorist named Hendricks, who has gained access to Russian nuclear launch codes and is planning a strike on the United States. An attempt to stop him ends in an explosion causing severe destruction to the Kremlin and the IMF to be implicated in the bombing, forcing the President to disavow them. No longer being aided by the government, Ethan and his team chase Hendricks around the globe, although they might still be too late to stop a disaster.",
                "popularity": 8.8306,
                "poster_path": "/psiWp3VTjznfokmGQG9uqiiknQQ.jpg",
                "release_date": "2011-12-07",
                "title": "Mission: Impossible - Ghost Protocol",
                "video": false,
                "vote_average": 7.104,
                "vote_count": 10366,
                "character": "Hanaway",
                "credit_id": "52fe48f7c3a36847f818298f",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Joshua Lee Holloway",
            "乔什·霍洛韦",
            "乔什·哈洛威",
            "جاش هالووی",
            "ジョシュ ホロウェイ"
        ],
        "biography": "Josh Lee Holloway (born July 20, 1969) is an American actor best known for his roles as James \"Sawyer\" Ford on the television show Lost and as Will Bowman on the science fiction drama Colony. Most recently he had a recurring role in season 3 of the western series Yellowstone.\n\nHolloway was born in San Jose, California, the second of four boys of a nurse mother and a surveyor father. His family moved to the Blue Ridge Mountains of Georgia when he was two. He was raised in Free Home, Georgia. Holloway is related to Baptist preacher Dr. Dale Holloway, and author and World War II prisoner of war Carl Holloway. He is also a descendant of Robert E. Lee. Holloway attended Cherokee High School in Canton, Georgia, graduating in 1987. He developed an interest in movies at a very young age. He studied at the University of Georgia but left after one quarter due to financial constraints. Holloway moved to Los Angeles, where he began a successful career as a runway and print model, including for brands Dolce & Gabbana, Calvin Klein and Donna Karan. In 1993, Holloway appeared in the Aerosmith video for the song \"Cryin'\" as a thief who tries to steal Alicia Silverstone's purse from a diner, only to be caught and beaten up by her.  Holloway eventually started acting. His first role was as \"Good Looking Guy\" in an episode of Angel in 1999, followed by a role in the comedy Doctor Benny and in the movies Mi Amigo, Moving August, and Cold Heart. Following these roles, he gained recognition for his lead role in the Sci-Fi Channel movie Sabretooth with David Keith and John Rhys-Davies. He also made appearances in Good Girls Don't episode \"Addicted To Love\"; NCIS episode \"My Other Left Foot\"; The Lyon's Den episode \"Separation Anxiety\"; Walker, Texas Ranger episode \"Medieval Crimes\"; and CSI: Crime Scene Investigation episode \"Assume Nothing\". His big break came when he was cast as James \"Sawyer\" Ford in the hit television series Lost. The show propelled Holloway to celebrity status, but left him with little time to leverage his fame with other roles.",
        "birthday": "1969-07-20",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 142636,
        "imdb_id": "nm0391326",
        "known_for_department": "Acting",
        "name": "Josh Holloway",
        "place_of_birth": "San Jose, California, USA",
        "popularity": 1.1848,
        "profile_path": "/biuhUJn5BDhXpfKvVW4dVUxvB44.jpg"
    }
}