{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hVvW015x8cD2X0KthGovw27EpF2.jpg",
                "genre_ids": [
                    10402,
                    10749,
                    35
                ],
                "id": 2769,
                "original_language": "en",
                "original_title": "An American in Paris",
                "overview": "Jerry Mulligan is an exuberant American expatriate in Paris trying to make a reputation as a painter. His friend Adam is a struggling concert pianist who's a long time associate of a famous French singer, Henri Baurel. A lonely society woman, Milo Roberts, takes Jerry under her wing and supports him, but is interested in more than his art.",
                "popularity": 3.5492,
                "poster_path": "/lyDXkvG53ldz6Cf7dbjJl7TaoP5.jpg",
                "release_date": "1951-09-26",
                "title": "An American in Paris",
                "video": false,
                "vote_average": 7.026,
                "vote_count": 606,
                "character": "Winston Churchill (uncredited)",
                "credit_id": "63a731fdd55c3d00824afc50",
                "order": 86
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Dudley Field Malone (June 3, 1882 – October 5, 1950) was an American attorney, politician, liberal activist, and actor. Malone is best remembered as one of the most prominent liberal attorneys in the United States during the decade of the 1920s and for his unsuccessful 1920 campaign for Governor of New York.\n\nAfter being admitted to the bar in 1907, he began practicing law and became active in the Democratic Party in New York, specifically in the reform faction opposed to the Tammany Hall organization. In 1912, he helped organize Woodrow Wilson's successful primary and general election campaign for US president.\n\nIn 1925, Malone accepted an invitation to join Clarence Darrow as co-counsel for the defense of John T. Scopes in the famous \"Monkey Trial.\" In response to Bryan's argument against admitting scientific testimony, Malone gave arguably the best speech of the trial in defense of academic freedom. \"I have never learned anything from any man who agreed with me\" was one of his famous quotes.\n\nMalone declared bankruptcy in New York and moved to Westwood, Los Angeles, California. He claimed his debts consisted mostly of sums owed to personal friends, including William K. Vanderbilt, Edward F. Hutton and the late Otto H. Kahn.\n\nHe served as counsel to 20th Century Fox and appeared in a few movies as a character actor. As Malone bore a strong resemblance to Winston Churchill, he was called on to play Churchill in the film adaptation of Joseph E. Davies's book Mission to Moscow (1943).",
        "birthday": "1882-06-03",
        "deathday": "1950-10-05",
        "gender": 2,
        "homepage": null,
        "id": 1426931,
        "imdb_id": "nm0540418",
        "known_for_department": "Acting",
        "name": "Dudley Field Malone",
        "place_of_birth": "New York, New York, U.S.A.",
        "popularity": 0.0214,
        "profile_path": "/ygje8ONtiGVsCFKQvDDHjJphw1A.jpg"
    }
}