{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4JuoO0XywrCDeHLy4kTB9FU5U2C.jpg",
                "genre_ids": [
                    18
                ],
                "id": 265169,
                "original_language": "tr",
                "original_title": "Kış Uykusu",
                "overview": "Aydın is a hotel owner and a retired actor in rural Turkey. As winter emerges he begins navigating the conflicts within the relationships with his wife, sister and existence.",
                "popularity": 1.1256,
                "poster_path": "/95j83qOqH3Ivz4RYkaSjGT0VSNr.jpg",
                "release_date": "2014-06-13",
                "title": "Winter Sleep",
                "video": false,
                "vote_average": 7.537,
                "vote_count": 585,
                "character": "Nihal",
                "credit_id": "534fc612c3a3681cd4000d42",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ayşe Melisa Sözen",
            "ملیسا سوزن"
        ],
        "biography": "​Melisa Sözen (born 6 July 1985) is a Turkish actress.\n\nStarting her professional career at the very early age of 15, she studied in theatre department of Pera Fine Arts High School. Sözen starred in many Turkish TV hits including Çemberimde Gül Oya, Bıçak Sırtı, Bir Bulut Olsam, The Magnificent Century, \"Kırmızı Oda\" and Şubat. She played two different roles in \"Şubat\".After working with Turkey's most prominent directors in movies like Av Mevsimi, Bir Varmış Bir Yokmuş and Cenneti Beklerken Sözen attracted international attention with her phenomenal acting in Nuri Bilge Ceylan's Palme d'Or winning Winter Sleep in 2014. Following her role in the 3rd Season of Éric Rochant's influential series Le bureau des légendes in 2017, Sözen moved to Paris for a while and worked on her French. Her first leading role in a French movie came in 2019 with Damien veut changer le monde.\n\nAchieving an extraordinary level of critical success in her homeland by winning both Theater Critics Association's and Film Critics Association's awards for the actress in a leading role in 2015 with her performances in The Knot of the Heart and Winter Sleep, Sözen frequently was invited as a jury member to many international film festivals including Guanajuato International Film Festival (Mexico, 2015), International Istanbul Film Festival (Turkey, 2016), Sarajevo Film Festival (Bosnia Herzegovina, 2017) and Cannes Series (France, 2018).",
        "birthday": "1985-07-06",
        "deathday": null,
        "gender": 1,
        "homepage": "http://melisasozenofficial.com/",
        "id": 142784,
        "imdb_id": "nm1489950",
        "known_for_department": "Acting",
        "name": "Melisa Sözen",
        "place_of_birth": "Istanbul, Turkey",
        "popularity": 0.3359,
        "profile_path": "/c0yFUMePzSfU4HONDIRGGcqtyt4.jpg"
    }
}