{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6WRrGYalXXveItfpnipYdayFkQB.jpg",
                "genre_ids": [
                    18,
                    53,
                    80
                ],
                "id": 1422,
                "original_language": "en",
                "original_title": "The Departed",
                "overview": "To take down South Boston's Irish Mafia, the police send in one of their own to infiltrate the underworld, not realizing the syndicate has done likewise. While an undercover cop curries favor with the mob kingpin, a career criminal rises through the police ranks. But both sides soon discover there's a mole among them.",
                "popularity": 13.4795,
                "poster_path": "/nT97ifVT2J1yMQmeq20Qblg61T.jpg",
                "release_date": "2006-10-04",
                "title": "The Departed",
                "video": false,
                "vote_average": 8.159,
                "vote_count": 15527,
                "character": "Chinese Government Man",
                "credit_id": "55e7873f9251413e38000247",
                "order": 48
            },
            {
                "adult": false,
                "backdrop_path": "/rn3E4Kd7EUOGOF95Hsd0aOhQqZg.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 30890,
                "original_language": "en",
                "original_title": "Radio Days",
                "overview": "The Narrator tells us how the radio influenced his childhood in the days before TV. In the New York City of the late 1930s to the New Year's Eve 1944, this coming-of-age tale mixes the narrator's experiences with contemporary anecdotes and urban legends of the radio stars.",
                "popularity": 4.2685,
                "poster_path": "/ljZ3yyYznAiq1vF6nHITdJn6qXB.jpg",
                "release_date": "1987-01-30",
                "title": "Radio Days",
                "video": false,
                "vote_average": 7.056,
                "vote_count": 602,
                "character": "Japanese",
                "credit_id": "5ea0f00ce942be00241e8e25",
                "order": 67
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Henry Yuk was born and raised in Brooklyn, graduating from Brooklyn College with a degree in English and Education. His introduction to theater came when his drama teacher at Midwood High School got him involved in “Sing,” a NYC high school performance program. However his early career was in education and child care, first teaching at three Brooklyn public schools & subsequently directing a Chinatown day care center for 6 years.\n\nHis interest in theater did not wane, and opportunity presented itself later when he was invited to join the Pan Asian Repertory Theatre Company. During this time he perfomed in numerous productions, including “Yellow Fever,” where he played the role of Chuck Chan.\n\nMeanwhile, he also was developing experience in film. His first SAG job was in the movie “Eyewitness.\" This led to a number of small roles in other films, until he landed a more significant role in “The Last Dragon” which has since become a cult classic. Roles since then have included General Tan in Martin Scorsese’s “Kundun,” and Sung Yon Kim in the “Sopranos.\"\n\nHenry has a warm personality with a keen sense of humor, which can be subtle and cerebral or antic and physical. At the same time he is quite adept at dramatic and more sensitive roles. Henry speaks Cantonese and Toisanese dialect. While he speaks perfect American English, he has also played roles with Asian accents. His credits include voiceovers and narration.\n\nThe son of immigrants from Guangdong Province, Henry lives in Brooklyn with his wife Holly Hyans, a partner at Morrison & Foerster LLP. They have two daughters.",
        "birthday": "1950-11-09",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.henryyuk.com",
        "id": 1428152,
        "imdb_id": "nm0950794",
        "known_for_department": "Acting",
        "name": "Henry Yuk",
        "place_of_birth": "Brooklyn, New York City, New York, USA",
        "popularity": 0.222,
        "profile_path": "/vqsJWpXDeHdhlAORYzLDUnnRc9B.jpg"
    }
}