{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sU3gFo7Gn67zjtKXIvzJ4omcUbH.jpg",
                "genre_ids": [
                    36,
                    18,
                    12
                ],
                "id": 665,
                "original_language": "en",
                "original_title": "Ben-Hur",
                "overview": "In 25 AD, Judah Ben-Hur, a Jew in ancient Judea, opposes the occupying Roman empire.  Falsely accused by a Roman childhood friend-turned-overlord of trying to kill the Roman governor, he is put into slavery and his mother and sister are taken away as prisoners.",
                "popularity": 5.7433,
                "poster_path": "/m4WQ1dBIrEIHZNCoAjdpxwSKWyH.jpg",
                "release_date": "1959-11-18",
                "title": "Ben-Hur",
                "video": false,
                "vote_average": 7.886,
                "vote_count": 2943,
                "character": "Woman in crowd (uncredited)",
                "credit_id": "5605ea0fc3a36812070004d1",
                "order": 24
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nMay McAvoy (September 8, 1899 – April 26, 1984) was an American actress who worked mainly during the silent film era. Some of her major roles are Laura Pennington in The Enchanted Cottage, Esther in Ben-Hur: A Tale of the Christ, and Mary Dale in The Jazz Singer.\n\nMcAvoy appeared in her first film, entitled Hate, in 1917. After appearing in more than three dozen films, she co-starred with Ramón Novarro and Francis X. Bushman in director Fred Niblo's 1925 production of Ben-Hur, released by MGM. The feature-length film was one of the most lavish and spectacular productions of the silent movie era.\n\nAlthough her voice was not heard in The Jazz Singer, McAvoy did speak in several other films, including the second \"all-talkie\" released by Warner Brothers, The Terror, which was directed by Roy Del Ruth and co-starred Conrad Nagel.\n\nFor years a rumor circulated that McAvoy retired from the screen at the transition to sound films because of a lisp or speech impediment. In truth, she married the treasurer of United Artists, who asked her not to work.\n\nLater, she returned to films and played small roles during the 1940s and 1950s, making her final film appearance in a small part in the 1959 version of Ben-Hur.",
        "birthday": "1899-09-06",
        "deathday": "1984-04-26",
        "gender": 1,
        "homepage": null,
        "id": 14287,
        "imdb_id": "nm0564219",
        "known_for_department": "Acting",
        "name": "May McAvoy",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.1786,
        "profile_path": "/r1twk0uEppt3dhuZqi4Zx7Nq0NP.jpg"
    }
}