{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/15HEZcSKtLcl69avXfmjoIJBuay.jpg",
                "genre_ids": [
                    9648,
                    53
                ],
                "id": 940,
                "original_language": "en",
                "original_title": "The Lady Vanishes",
                "overview": "On a train headed for England a group of travelers is delayed by an avalanche. Holed up in a hotel in a fictional European country, young Iris befriends elderly Miss Froy. When the train resumes, Iris suffers a bout of unconsciousness and wakes to find the old woman has disappeared. The other passengers ominously deny Miss Froy ever existed, so Iris begins to investigate with another traveler and, as the pair sleuth, romantic sparks fly.",
                "popularity": 3.4055,
                "poster_path": "/c1t9LB76LvEARPanfEzXmkm7fwY.jpg",
                "release_date": "1938-10-07",
                "title": "The Lady Vanishes",
                "video": false,
                "vote_average": 7.44,
                "vote_count": 971,
                "character": "Iris Matilda Henderson",
                "credit_id": "52fe4290c3a36847f8028a69",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Маргарет Локвуд",
            "Margaret Mary Day Lockwood"
        ],
        "biography": "Margaret Lockwood, CBE (15 September 1916 – 15 July 1990) was an English actress, notable for her performance in the 1945 Gainsborough movie, The Wicked Lady.\n\nMargaret Mary Lockwood Day was born in Karachi, British India (now Karachi, Pakistan), to an English administrator of a railway company and his Scottish wife. Lockwood's family returned to the United Kingdom when she was a child, along with her brother. She attended Sydenham High School for girls, and a ladies school in Kensington, London.\n\nShe began studying for the stage at an early age at the Italia Conti, and made her debut in 1928, at the age of 12, at the Holborn Empire, where she played a fairy in A Midsummer Night's Dream. In December of the following year, she appeared at the Scala Theatre in the pantomime The Babes in the Wood. In 1932, she appeared at the Theatre Royal, Drury Lane in Cavalcade.\n\nLockwood then trained at the Royal Academy of Dramatic Art in London, where she was seen by a talent scout and signed to a contract. In June 1934, she played Myrtle in House on Fire at the Queen's Theatre, and on 22 August 1934 appeared as Margaret Hamilton in Gertrude Jenning's play Family Affairs when it premiered at the Ambassadors Theatre; Helene Ferber in Repayment at the Arts Theatre in January 1936; Trixie Drew in Henry Bernard's play Miss Smith at the Duke of York's Theatre in July 1936; and back at the Queen's in July 1937 as Ann Harlow in Ann's Lapse.\n\nLockwood entered films in 1934, and in 1935 she appeared in the film version of Lorna Doone. In 1938 she starred in her most successful film, Alfred Hitchcock's The Lady Vanishes, in which she first appeared with Michael Redgrave. In 1940, she played the role of Jenny Sunley, the self-centered, frivolous wife of Michael Redgrave's character in The Stars Look Down. In the early 1940s, Lockwood changed her on-screen image to play villainesses in both contemporary and period films, becoming the most successful actress in British films during that period. Her greatest success was in the title role in The Wicked Lady (1945), a film which was controversial in its day and brought her considerable publicity. In 1946 Lockwood gained the Daily Mail National Film Awards First Prize for most popular British film actress.\n\nShe made a return to the stage in a record-breaking national tour of Noel Coward's Private Lives in 1949, and also played Eliza Doolittle in Pygmalion at the Edinburgh Festival of 1951, and the title role in Peter Pan in 1949, 1950, and 1957 (the latter with her daughter as Wendy). Her subsequent long-running West End hits include an all-star production of Wilde's An Ideal Husband (1965/66, in which she played the villainous Mrs Cheveley), Somerset Maugham's Lady Frederick (1970), Relative Values (Noel Coward revival, 1973), and the thrillers Spider's Web (1955, written for her by Agatha Christie), Signpost to Murder (1962), and Double Edge (1975).\n\nIn 1969, she starred as barrister Julia Stanford in the TV play, Justice is a Woman. This inspired the Yorkshire Television series, Justice, which ran for three seasons (39 episodes) from 1971 to 1974, and featured her real-life partner, John Stone, as fictional boyfriend, Dr Ian Moody.  Lockwood's role as the feisty Harriet Peterson won her Best Actress Awards from the TV Times (1971) and The Sun (1973). Her last professional appearance was as Queen Alexandra in Royce Ryton's stage play, Motherdear (Ambassadors Theatre, 1980). She was created a CBE in the New Year Honours of 1981.\n\nMargaret Lockwood had married and been divorced from Rupert Leon. She lived her final years in seclusion and died in the Cromwell Hospital, Kensington, London from cirrhosis of the liver, aged 73. She was cremated at Putney Vale Crematorium. She was survived by her daughter, actress Julia Clark (née Margaret Julia Leon, born 1941).",
        "birthday": "1916-09-15",
        "deathday": "1990-07-15",
        "gender": 1,
        "homepage": null,
        "id": 14298,
        "imdb_id": "nm0516994",
        "known_for_department": "Acting",
        "name": "Margaret Lockwood",
        "place_of_birth": "Karachi, British India [now Pakistan]",
        "popularity": 0.2905,
        "profile_path": "/fJYOZdBuBjBd4Gi8yLsnoSaAfB5.jpg"
    }
}