{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cw8z9H963CtcqchtEEzqs3Ls1wC.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 21641,
                "original_language": "en",
                "original_title": "The Damned United",
                "overview": "Taking over Leeds United, Brian Clough's abrasive approach and his clear dislike of the players' dirty style of play make it certain there is going to be friction. Glimpses of his earlier career help explain both his hostility to previous manager Don Revie and how much he is missing right-hand man Peter Taylor.",
                "popularity": 2.7168,
                "poster_path": "/ftlbCma6QoRiZgiflVmLuPKHrkq.jpg",
                "release_date": "2009-03-27",
                "title": "The Damned United",
                "video": false,
                "vote_average": 7.225,
                "vote_count": 661,
                "character": "Colin Todd",
                "credit_id": "52fe4422c3a368484e011797",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Giles was born in Harrogate, Yorkshire, UK. He has recently directed 'The Dare', 'Knights of Camelot' 'World of Darkness' and 'Food For Thought' and produced 'A Serial Killers Guide To Life' and 'Cassette' feature films. He starred in the films, I Want Candy, The Torment, The Harsh Light of Day, The Damned United and is the founder Figi Productions where he has produced and directed eight award winning films including, 'The Heart of the Forest', '47 Cleveland' 'Taken' 'Barry Brown' and the first 3D short drama to be filmed in the UK 'Sportsday 3D'. He is now in prep for his drama feature 'The Nobodies' and is in the edit 'Knights of Camelot' and soon to be released his writing and directing debut; the psychological horror feature 'The Dare' which won the Audience Award at Popcorn Frights Film Festival, starring Richard Brake, Alexandra Evans, Richard Short, Bart Edwards and Robert Maaser for Millennium Films and B2Y.\n\nAfter he gained a 2:1 at The University in Hertfordshire he trained at Drama Studio London. His first major role was playing Carl in Ealing Studio's 'I Want Candy', with Mackenzie Crook and Tom Burke. Since he has played the lead in the British horror, 'The Torment' (released as 'The Possession of David O'Reilly' in the US). He also was the lead in The Harsh Light of Day'. Other films include: 'Between Two Worlds', 'The Banksy Job', 'Hero', 'Tales of The Supernatural' and the Zombie Comedy 'Stalled'. He played Coin Todd in 'The Damned United' for BBC Films with Michael Sheen, Timothy Spall and Jim Broadbent, directed by Tom Hooper (The Kings Speech). Dorian in 'Walking with the Enemy' with Ben Kingsley. He played the lead role of Vincent in vampire feature 'Night Junkies', Joel in 'Three Minutes Moments, and FBI Agent Kyle Fraser in the sci-fi film 'LVJ'. He also played the popular role of Steve, the cult loving and troubled character on the BAFTA nominated, London based interactive drama series 'KateModern', The show won a Webby and a Press Guild award winner for innovation in broadcasting and was nominated for three BAFTA's. His character also crossed over to the American sister show 'LonelyGirl15' for a season. TV includes: Blackpool, Coronation Street, The Great War, Tricks, 50 Ways, The Silence and Accidental Farmer.\n\nHe is a member of The Soho Theater and The Royal Court Theaters Young Writers program, where he has had three of his plays read, two of which, White and Cracking Up where fully performed at Off West End theaters. His latest play On The Tiles had a performance at The Prince of Wales Theater in London's West End. He plays football for Arsenal Ex Pros and Celebrities Charity XI and was top goal-scorer in 2018 and 2019.",
        "birthday": "1977-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.gilesalderson.com/",
        "id": 142947,
        "imdb_id": "nm1815188",
        "known_for_department": "Acting",
        "name": "Giles Alderson",
        "place_of_birth": "Harrogate, Yorkshire, England, UK",
        "popularity": 0.1523,
        "profile_path": "/hw9PnPfkqA6JrwDhREtB8QtLdTU.jpg"
    }
}