{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qxTw8OKJLRX1Xb5nR5CcIDnLKoq.jpg",
                "genre_ids": [
                    18,
                    53,
                    27
                ],
                "id": 44214,
                "original_language": "en",
                "original_title": "Black Swan",
                "overview": "The story of Nina, a ballerina in a New York City ballet company whose life, like all those in her profession, is completely consumed with dance. She lives with her retired ballerina mother Erica who zealously supports her daughter's professional ambition. When artistic director Thomas Leroy decides to replace prima ballerina Beth MacIntyre for the opening production of their new season, Swan Lake, Nina is his first choice.",
                "popularity": 7.3213,
                "poster_path": "/viWheBd44bouiLCHgNMvahLThqx.jpg",
                "release_date": "2010-12-03",
                "title": "Black Swan",
                "video": false,
                "vote_average": 7.688,
                "vote_count": 15010,
                "character": "Corps De Ballet",
                "credit_id": "54e5fee19251412201000055",
                "order": 48
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Σάρα Χέι"
        ],
        "biography": "Sarah Hay, born in 1987, was brought up in Princeton, New Jersey, with her older brother, who is an opera singer, and sister. Her grandmother was an art dealer in New York, and her grandfather is a member of the New York Philharmonic. Hay's parents are both amateur dancers and psychologists. She began attending dancing classes at the age of three, and joined the School of American Ballet in New York City when she was eight, and later attended the Jacqueline Kennedy Onassis School of Ballet at the American Ballet Theatre. She later explained that while she was popular at normal school, at the ballet school she was considered to be a \"loser\" because she wasn't from a wealthy background. She described herself a \"troublemaker\" during her childhood, and only decided to pursue ballet professionally when she was a teenager.",
        "birthday": "1987-09-16",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1429010,
        "imdb_id": "nm4188769",
        "known_for_department": "Acting",
        "name": "Sarah Hay",
        "place_of_birth": "New York, USA",
        "popularity": 0.2076,
        "profile_path": "/cLQS8DvoqjN8JDHmJ20yCy1vlby.jpg"
    }
}