{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hb1GBVDwQIvSNpx1cQUFAIHfyBW.jpg",
                "genre_ids": [
                    18
                ],
                "id": 265177,
                "original_language": "fr",
                "original_title": "Mommy",
                "overview": "A peculiar neighbor offers hope to a recent widow who is struggling to raise a teenager who is unpredictable and, sometimes, violent.",
                "popularity": 2.7549,
                "poster_path": "/3zyQtPg3avKprmJP2gBiYgyWUQC.jpg",
                "release_date": "2014-09-19",
                "title": "Mommy",
                "video": false,
                "vote_average": 8.221,
                "vote_count": 2777,
                "character": "Paul",
                "credit_id": "54084210c3a368581b000ea2",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "פטריק הווארד",
            "Патрик Юар"
        ],
        "biography": "Patrick Huard is an actor, comedian, filmmaker, author, emcee, director and producer. He has appeared in 15 feature films, including La Vie après l'Amour, Nez Rouge, Sur le Seuil, Maman Last Call, Monica la Mitraille, Cadavres, Bon Cop Bad Cop (for which he co-wrote the screenplay and which became one of biggest box office successes of all time in Canada), Funkytown, Starbuck (Quebec's most popular film in 2011, distributed in more than 20 countries) and Omertà, from screenwriter and director Luc Dionne. This film revisits the cult TV series 11 years after the end of its third season.  In March 2012, he made an eagerly anticipated return to the stage with his third one-man show entitled Le Bonheur, nearly 12 years after his last solo effort. Patrick is currently touring the province with this show. Previously, he presented two highly successful two comedy shows, 18 ans et plus and Face à Face. As well, he appeared in several Juste pour rire galas and in Eric Bogosian's play Talk Radio, doing some 1,200 shows and selling hundreds of thousands of tickets across Quebec.\n\nOn television, Patrick has played all kinds of characters-guy guys, bad guys and even a drag queen-in such series as Music Hall, Cover Girl, Fortier, Au Nom de la Loi and Taxi 0-22 where he spent four seasons as Rogatien, his famous irascible taxi driver. For this role, he was honoured with the Artis trophy in 2008 and 2009 in the \"actor in a comedy program\" category. The public also showed their affection for Patrick, twice selecting him for the Male Personality of the Year trophy, in 2009 and 2010. In 2012, after his return to the stage, Patrick took part in TVA's hit show Star Académie. After making his mark in the 2009 edition for his amazing ability to share his knowledge, he was pleased to reprise his role as a performance teacher on the popular program.\n\nPatrick Huard has also hosted several Juste pour rire galas, the Gala de l'ADISQ, the Soirée des Jutra, a comedy series on Radio-Canada as well as several daily radio shows.\n\nIncreasingly, Patrick Huard can also be found behind the camera. He produced and directed Taxi 0-22 (four seasons on TVA), in addition to videos, commercials, a documentary for Canal D, his first feature film, Les 3 P'tits Cochons [The Three Little Pigs], the biggest box office hit in Quebec in 2007, and Filière 13.",
        "birthday": "1969-01-02",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.patrickhuard.ca",
        "id": 142995,
        "imdb_id": "nm0399088",
        "known_for_department": "Acting",
        "name": "Patrick Huard",
        "place_of_birth": "Montreal, Quebec, Canada",
        "popularity": 0.164,
        "profile_path": "/neN84KoE3s48CTkrNReYQ3z1HED.jpg"
    }
}