{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/n1Gh3MJAVvXmkgSDf3SOLlPCjag.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749
                ],
                "id": 9390,
                "original_language": "en",
                "original_title": "Jerry Maguire",
                "overview": "Jerry Maguire used to be a typical sports agent: willing to do just about anything he could to get the biggest possible contracts for his clients, plus a nice commission for himself. Then, one day, he suddenly has second thoughts about what he's really doing. When he voices these doubts, he ends up losing his job and all of his clients, save Rod Tidwell, an egomaniacal football player.",
                "popularity": 4.8354,
                "poster_path": "/lABvGN7fDk5ifnwZoxij6G96t2w.jpg",
                "release_date": "1996-12-13",
                "title": "Jerry Maguire",
                "video": false,
                "vote_average": 6.971,
                "vote_count": 3483,
                "character": "Former Girlfriend",
                "credit_id": "52fe44f1c3a36847f80b33ef",
                "order": 84
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            " Britanny York ",
            "Brittany York"
        ],
        "biography": "Ravishing brunette beauty Alison Armitage was born on February 26, 1965 in High Wycombe, London, England. She's of mixed French, English, and German descent. Alison has two brothers and grew up in Hong Kong, where she lived for twenty years. Armitage became a competitive swimmer at age four and qualified for the Olympic team representing Hong Kong. Alison studied computer science at the University of San Diego in California. Following graduation from college she moved to Denver, Colorado. Armitage then moved a second time to Los Angeles, California. Using the alias Brittany York, Alison was the Playmate of the Month in the October, 1990 issue of \"Playboy.\" She subsequently appeared in many \"Playboy\" videos. Among the other publications Armitage has done pictorials for and/or graced the covers of are \"Maxim,\" \"Razor,\" \"DT,\" and \"Bikini.\" Alison has not only been featured in TV commercials for such clients as Reebok Sportswear, West Cigarettes, Budweiser Beer, and Trac Cell Phones, but also has done print ads for Anhueser Beer, Miller Beer, Carrabelle Swimwear, Vital Hair Care, and Michael Beaudry Jewelry. She has small roles in the movies \"Secret Games,\" \"Miracle Beach,\" \"Jerry Maguire,\" and \"Driven.\" Moreover, Armitage had regular featured parts in the TV series \"Acapulco H.E.A.T.,\" \"The New Adventures of Robin Hood,\" \"True Survivors,\" and \"The Bold and the Beautiful.\" Among the TV shows Alison has made guest appearances on are \"Full House,\" \"Seinfeld,\" \"Silk Stockings,\" and \"L.A. Heat.\" Armitage speaks fluent French. IMDb Mini Biography By: woodyanders",
        "birthday": "1965-02-26",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 142955,
        "imdb_id": "nm0000785",
        "known_for_department": "Acting",
        "name": "Alison Armitage",
        "place_of_birth": "High Wycombe, England, UK",
        "popularity": 0.3189,
        "profile_path": "/8OaG5isDZjifrXlp2Iy5N2w0VyL.jpg"
    }
}