{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/69D57G3XqQMVNCwK0Z2PCcYC4Da.jpg",
                "genre_ids": [
                    18
                ],
                "id": 25538,
                "original_language": "zh",
                "original_title": "一一",
                "overview": "Each member of a family in Taipei asks hard questions about life's meaning as they live through everyday quandaries. NJ is morose: his brother owes him money, his mother-in-law is in a coma, his wife suffers a spiritual crisis when she finds her life a blank and his business partners make bad decisions.",
                "popularity": 4.5736,
                "poster_path": "/mR8dSQZI8X6Z1NClJhFrtJp636z.jpg",
                "release_date": "2000-09-20",
                "title": "Yi Yi",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 595,
                "character": "Mr. Ota",
                "credit_id": "52fe44cec3a368484e037e19",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/2tE0A6WjLowwQOUY8se1Xlf3O6U.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 68730,
                "original_language": "en",
                "original_title": "Silence",
                "overview": "In the 17th century, two Portuguese Jesuit priests travel to Japan in an attempt to locate their mentor, who is rumored to have committed apostasy, and to propagate Catholicism.",
                "popularity": 5.516,
                "poster_path": "/wO8XKAt3JUpdij27gIq6Maq4JMp.jpg",
                "release_date": "2016-12-23",
                "title": "Silence",
                "video": false,
                "vote_average": 7.127,
                "vote_count": 3156,
                "character": "Old Samurai / Inoue",
                "credit_id": "575ec00b9251410f880003f2",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "イッセー尾形",
            "Issei Ogata"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nIssey Ogata (born 22 February 1952 in Fukuoka, Fukuoka), is a Japanese actor and comedian. He was interested in plays since childhood. After he graduated from Toyotama High School in Japan, he joined a theatrical company and appeared on the stage. Later, he jumped at the opportunity to be an entertainer when he took the gold medal at the audition called \"Birth of Comedians\". Then, he started garnering roles on Japanese TV. Shows he appeared on include \"Evil Grandmother\" of Fuji TV and \"RinRinto\" of NHK drama.\n\nHe now performs plays by himself \"Life Never Stops\" at GyanGyan Theater in Shibuya, which has gained immense popularity. Furthermore, he has had starring roles in major art-house films, including Ota in the great Edward Yang's highly regarded Yi Yi: A One and a Two, the title character in Jun Ichikawa's Tony Takitani (an adaptation of the Haruki Murakami short story), and has played the role of Japanese Emperor Hirohito in Aleksandr Sokurov's 2005 film, The Sun.\n\nDescription above from the Wikipedia article Issey Ogata, licensed under CC-BY-SA, full list of contributors on Wikipedia.​",
        "birthday": "1952-02-22",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 143037,
        "imdb_id": "nm0644521",
        "known_for_department": "Acting",
        "name": "Issey Ogata",
        "place_of_birth": "Fukuoka, Japan",
        "popularity": 0.8047,
        "profile_path": "/dQ5X5nSobSgRFKK7lo8j41jtw5c.jpg"
    }
}