{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/15HEZcSKtLcl69avXfmjoIJBuay.jpg",
                "genre_ids": [
                    9648,
                    53
                ],
                "id": 940,
                "original_language": "en",
                "original_title": "The Lady Vanishes",
                "overview": "On a train headed for England a group of travelers is delayed by an avalanche. Holed up in a hotel in a fictional European country, young Iris befriends elderly Miss Froy. When the train resumes, Iris suffers a bout of unconsciousness and wakes to find the old woman has disappeared. The other passengers ominously deny Miss Froy ever existed, so Iris begins to investigate with another traveler and, as the pair sleuth, romantic sparks fly.",
                "popularity": 3.4055,
                "poster_path": "/c1t9LB76LvEARPanfEzXmkm7fwY.jpg",
                "release_date": "1938-10-07",
                "title": "The Lady Vanishes",
                "video": false,
                "vote_average": 7.44,
                "vote_count": 971,
                "character": "Eric Todhunter",
                "credit_id": "52fe4290c3a36847f8028a79",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/nXvF27feIPaYMS8RGnLubeKcOjW.jpg",
                "genre_ids": [
                    35,
                    80
                ],
                "id": 5506,
                "original_language": "en",
                "original_title": "The Ladykillers",
                "overview": "Five oddball criminals planning a bank robbery rent rooms on a cul-de-sac from an octogenarian widow under the pretext that they are classical musicians.",
                "popularity": 2.0926,
                "poster_path": "/9LJ6ZV59Q92LAJAbmb7xm9dUBGU.jpg",
                "release_date": "1955-12-08",
                "title": "The Ladykillers",
                "video": false,
                "vote_average": 7.274,
                "vote_count": 504,
                "character": "Claude, alias 'Major Courtney'",
                "credit_id": "52fe440ac3a36847f807ebb7",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Cecil Schwabe"
        ],
        "biography": "Cecil Parker (3 September 1897 – 20 April 1971) was an English character and comedy actor with a distinctive husky voice, who usually played supporting roles in his 91 films made between 1928 and 1969.\n\nBorn Cecil Schwabe in Hastings, Sussex, he began his theatrical career in London in 1922 after serving in World War I. He made his first film appearance in 1928 and subsequently became a familiar face in British, and occasionally American films, until his death. He appeared less often on television, but many of his films have remained popular and are often shown.\n\nHe acted in two adaptations of A. J. Cronin's novels, The Citadel (1938) and The Stars Look Down (1940), in addition to appearing in The Lady Vanishes (1938) and Under Capricorn (1949), both of the later films were directed by Alfred Hitchcock. Other roles were in 23 Paces to Baker Street (1956), Dangerous Moonlight (1941), Swiss Family Robinson (1960), and I Was Monty's Double (1958), as well as the comedies A French Mistress (1960), The Ladykillers (1955), The Man in the White Suit (1951), The Court Jester (1955), Indiscreet (1958) and I Believe in You (1952). Parker was also the original Charles Condomine in the West End production of Noel Coward's Blithe Spirit, a role subsequently played on Broadway by Clifton Webb and in the 1945 film by Rex Harrison.\n\nHe often played a touchy senior officer or British upper-class character, and his last two films were true to form: The Magnificent Two (1967) with the British comedy double act Morecambe and Wise and Richard Attenborough's version of Oh! What A Lovely War (1969).\n\nHe played an evil, scheming butler on one episode of The Avengers (\"The £50,000 Breakfast\").\n\nDescription above from the Wikipedia article  Cecil Parker , licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1897-09-02",
        "deathday": "1971-04-20",
        "gender": 2,
        "homepage": null,
        "id": 14300,
        "imdb_id": "nm0662116",
        "known_for_department": "Acting",
        "name": "Cecil Parker",
        "place_of_birth": "Hastings, Sussex, England, UK",
        "popularity": 0.393,
        "profile_path": "/bKRahLwOtk2EPYrE50zGjeZYsIO.jpg"
    }
}