{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dcyPj11c00lOhMESAVWtJKzlHt4.jpg",
                "genre_ids": [
                    18
                ],
                "id": 250538,
                "original_language": "en",
                "original_title": "The Good Lie",
                "overview": "A young refugee of the Sudanese Civil War who wins a lottery for relocation to the United States with three other lost boys. Encountering the modern world for the first time, they develop an unlikely friendship with a brash American woman assigned to help them, but the young man struggles to adjust to this new life and his feelings of guilt about the brother he left behind.",
                "popularity": 2.1143,
                "poster_path": "/yAhoeIwwtPxJ7uf9HLIMHIqWFnL.jpg",
                "release_date": "2014-09-10",
                "title": "The Good Lie",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 543,
                "character": "Processing Office Woman",
                "credit_id": "54ed9c4e9251417965003a7e",
                "order": 47
            },
            {
                "adult": false,
                "backdrop_path": "/1GU0jS5ZG5MhfdDrpj8s9XxbgJJ.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 505642,
                "original_language": "en",
                "original_title": "Black Panther: Wakanda Forever",
                "overview": "Queen Ramonda, Shuri, M’Baku, Okoye and the Dora Milaje fight to protect their nation from intervening world powers in the wake of King T’Challa’s death.  As the Wakandans strive to embrace their next chapter, the heroes must band together with the help of War Dog Nakia and Everett Ross and forge a new path for the kingdom of Wakanda.",
                "popularity": 13.3307,
                "poster_path": "/sv1xJUazXeYqALzczSZ3O6nkH75.jpg",
                "release_date": "2022-11-09",
                "title": "Black Panther: Wakanda Forever",
                "video": false,
                "vote_average": 7.036,
                "vote_count": 7020,
                "character": "Sope the Shaman",
                "credit_id": "636ca261d7fbda007bee731a",
                "order": 18
            },
            {
                "adult": false,
                "backdrop_path": "/b6ZJZHUdMEFECvGiDpJjlfUWela.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 284054,
                "original_language": "en",
                "original_title": "Black Panther",
                "overview": "King T'Challa returns home to the reclusive, technologically advanced African nation of Wakanda to serve as his country's new leader. However, T'Challa soon finds that he is challenged for the throne by factions within his own country as well as without. Using powers reserved to Wakandan kings, T'Challa assumes the Black Panther mantle to join with ex-girlfriend Nakia, the queen-mother, his princess-kid sister, members of the Dora Milaje (the Wakandan 'special forces') and an American secret agent, to prevent Wakanda from being dragged into a world war.",
                "popularity": 10.6294,
                "poster_path": "/uxzzxijgPIY7slzFvMotPv8wjKA.jpg",
                "release_date": "2018-02-13",
                "title": "Black Panther",
                "video": false,
                "vote_average": 7.369,
                "vote_count": 22817,
                "character": "Shaman",
                "credit_id": "58debd699251411bbc0113fd",
                "order": 27
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Sope Aluko (\"Shaw-peh Ah-loo-koh\") was born in Nigeria (West Africa). Sope is a multilingual, dual citizen of both the US and the UK. She speaks five languages, including her native language, Yoruba/Nigerian, French, and Bahasa/Indonesian.\n\nSope's early years were spent living in some of the most beautiful countries in the world, including France, Switzerland, Tanzania, Trinidad & Tobago, and Indonesia. Her father being in the diplomatic service, exposed Sope and her sisters to appreciate the beauty of these countries, as well as the people, their languages, struggles and politics. Sope reflects that she and her sisters grew up feeling like \"gypsy children\" in the best possible way. All the world was a classroom and the people were their teachers.\n\nAs early as she could talk, Sope loved to perform. She decided as a very young girl that she would be an actor. Sope cultivated her acting chops in the UK, primarily Shakespearean stage plays, certified by the London Academy of Music and Dramatic Arts (LAMDA) and the Royal Academy of Dramatic Arts (RADA).\n\nAs an extended artistic expression to her acting, Sope studied various forms of dance, including Balinese and African dance. She had the privilege of performing the world famous South African \"Ipi Tombi\" dance at the National Arts Theater in Nigeria.\n\nA lover of education, Sope obtained an undergraduate degree in Engineering and Master's degree in Marketing. She had a successful corporate career in England and America for several years before returning to her acting career. Sope is a wife and mom of two young boys and lives in Los Angeles and Miami.\n\n- IMDb Mini Biography",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1431508,
        "imdb_id": "nm3571491",
        "known_for_department": "Acting",
        "name": "Sope Aluko",
        "place_of_birth": null,
        "popularity": 0.5753,
        "profile_path": "/dNfAM8jNgwa1693nuplfjp70Ls4.jpg"
    }
}