{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dcyPj11c00lOhMESAVWtJKzlHt4.jpg",
                "genre_ids": [
                    18
                ],
                "id": 250538,
                "original_language": "en",
                "original_title": "The Good Lie",
                "overview": "A young refugee of the Sudanese Civil War who wins a lottery for relocation to the United States with three other lost boys. Encountering the modern world for the first time, they develop an unlikely friendship with a brash American woman assigned to help them, but the young man struggles to adjust to this new life and his feelings of guilt about the brother he left behind.",
                "popularity": 2.1286,
                "poster_path": "/yAhoeIwwtPxJ7uf9HLIMHIqWFnL.jpg",
                "release_date": "2014-09-10",
                "title": "The Good Lie",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 543,
                "character": "Theo",
                "credit_id": "54ec9c94c3a3680b80001d28",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Olufemi Ogunsanwo",
            "Femi Ogunsanwo",
            "Femi Tay Oguns"
        ],
        "biography": "Olufemi Ogunsanwo MBE, known professionally as Femi Oguns, is a British playwright, theatre producer and founder of Identity Theatre School and Identity Drama School. As a playwright, his first play Torn has previewed at the Arcola Theatre in Dalston, London. A Romeo and Juliet-style story centred on the Nigerian and Jamaican communities in London, Torn received mixed reviews: The Stage described it as a \"lively and relevant new play\" but \"clunky\"; The Times as \"street smart\" but \"a sprawling, chaotic piece of writing desperately in need of the attentions of a disciplined script editor\". As an actor, Oguns has had roles in British TV shows Prime Suspect 6: The Last Witness, The Bill and EastEnders and at the Arcola theatre. He was appointed Member of the Order of the British Empire in the 2014 Birthday Honours for services to acting.",
        "birthday": null,
        "deathday": null,
        "gender": 0,
        "homepage": null,
        "id": 1431170,
        "imdb_id": "nm2796341",
        "known_for_department": "Production",
        "name": "Femi Oguns",
        "place_of_birth": "London, England, UK",
        "popularity": 0.0143,
        "profile_path": null
    }
}