{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/scQf03Fm3jeyv4FH04qvi4fp4wh.jpg",
                "genre_ids": [
                    80,
                    35,
                    28
                ],
                "id": 402900,
                "original_language": "en",
                "original_title": "Ocean's Eight",
                "overview": "Debbie Ocean, a criminal mastermind, gathers a crew of female thieves to pull off the heist of the century at New York's annual Met Gala.",
                "popularity": 8.6805,
                "poster_path": "/MvYpKlpFukTivnlBhizGbkAe3v.jpg",
                "release_date": "2018-06-07",
                "title": "Ocean's Eight",
                "video": false,
                "vote_average": 6.968,
                "vote_count": 8525,
                "character": "Liu Wen",
                "credit_id": "5eb85e17b7d3520021e6fa96",
                "order": 115
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Liu Wen",
            "刘雯"
        ],
        "biography": "Liu Wen (simplified Chinese: 刘雯; traditional Chinese: 劉雯; pinyin: Liú Wén; born January 27, 1988) is a Chinese fashion model represented by The Society Management and based in New York City. She is the first model of East Asian descent to walk the Victoria's Secret Fashion Show, the first spokesmodel of East Asian descent for Estée Lauder and the first Asian model to ever make Forbes magazine's annual highest-paid models list. In 2012, The New York Times named her \"China’s first bona fide supermodel\".\n\nIn an April 2014 article about social media's rise in the fashion industry, American Vogue remarked that she had \"by far, the biggest social-media audience of any model\". Models.com dubbed her as the first ever Asian \"New Supermodel\" in July 2014. And in October of the same year, Liu became the first person in the world to showcase an Apple Watch on a magazine cover when she appeared on Vogue China's November 2014 issue.\n\nIn April 2015, she and South Korean singer Choi Siwon participated in a Chinese spin-off of the South Korean variety show We Got Married. Wikipedia",
        "birthday": "1988-01-27",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1431124,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Liu Wen",
        "place_of_birth": "Yongzhou, Hunan Province, China",
        "popularity": 0.237,
        "profile_path": "/xui0wSJhWK87TmIJD0F1BIfTAOd.jpg"
    }
}