{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wONHmd6x0UW6AV1DLzxlNwH9sQn.jpg",
                "genre_ids": [
                    53,
                    36,
                    18
                ],
                "id": 393624,
                "original_language": "en",
                "original_title": "Official Secrets",
                "overview": "The true story of British intelligence whistleblower Katharine Gun who—prior to the 2003 Iraq invasion—leaked a top-secret NSA memo exposing a joint US-UK illegal spying operation against members of the UN Security Council. The memo proposed blackmailing member states into voting for war.",
                "popularity": 3.3583,
                "poster_path": "/lyCGqSkT3PqLYQXiWs4FCVJBAYW.jpg",
                "release_date": "2019-08-30",
                "title": "Official Secrets",
                "video": false,
                "vote_average": 7.206,
                "vote_count": 1038,
                "character": "Jan Clements",
                "credit_id": "643aceb5da10f002eba184c3",
                "order": 29
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Janie is an award-winning British actress, singer and musical theatre performer, characterised by her extraordinary versatility in acclaimed work on stage, film, television and radio. Her career embraces everything from Shakespeare at the Royal Shakespeare Company and Shakespeare's Globe, to revivals of classic plays at the Bath Festival, directed by Sir Peter Hall, acclaimed performances in modern dramas and comedies, and leading roles in classic musicals, both in the West End and major regional theatres. Janie is also a passionate champion of new writing. In addition, she regularly performs her own witty and sophisticated cabaret at leading venues including Crazy Coqs, The Hippodrome, The Pheasantry, the St James Studio, Aldeburgh Festival and the 'Divas at the Donmar' season.\n\nJanie has worked closely with contemporary playwrights, particularly Alan Ayckbourn and Michael Frayn, and the late Harold Pinter in numerous productions and has become a renowned interpreter of their work. In recent years, she has also worked with the next generation of outstanding emerging playwrights, including Lucy Kirkwood, whose acclaimed new play NSFW was premiered at The Royal Court in 2012 and for which Janie received her fourth Olivier Award nomination, this time as Best Supporting Actress in a Play, for her performance as glossy womens' magazine editor, Miranda.\n\nJanie is increasingly expanding her work in film and television and has recently completed two feature films; Dare To Be Wild, set in Ireland and written and directed by Vivienne Decourcy and The Trouble With Dot and Harry, opposite Neil Morrissey, written and directed by Sundance Festival Grand Prize-winner, Gary Walkow.\n\nJanie won the three most prestigious awards in British Theatre; the Olivier Award, the Evening Standard Award and Critics Circle Awards for Best Actress in a Play, as well as the Obie and Theatre World Best Newcomer Award in New York, for her hilarious and heartbreaking performance as Jacie Triplethree in Alan Ayckbourn's Comic Potential. She also received the Olivier Award for Best Supporting Actress in a Musical for her performance as Carrie Pipperidge in Nicholas Hytner's acclaimed production of Rodgers & Hammerstein's Carousel at the National Theatre and the TMA UK Theatre Award 2013 for Best Performance in a Musical for her performance as Dolly Levi in Hello, Dolly! at Curve, Leicester.",
        "birthday": "1962-06-20",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.janiedee.com/",
        "id": 143170,
        "imdb_id": "nm0214178",
        "known_for_department": "Acting",
        "name": "Janie Dee",
        "place_of_birth": "Old Windsor, England, UK",
        "popularity": 0.0641,
        "profile_path": "/p44p1mxBF7OkCdnPRBZxfBVLwuU.jpg"
    }
}