{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9CkI4VsYF8qJWfZpPqwZnBctb3M.jpg",
                "genre_ids": [
                    18
                ],
                "id": 50270,
                "original_language": "it",
                "original_title": "Paprika",
                "overview": "Mimma starts working in Madame Colette’s brothel to help her boyfriend financially. There she is rechristened “Paprika,” and falls in love with her first client, naval officer Franco. Despite this attraction, she begins her climb through the sex trade, residing in Italy’s most illustrious brothels.",
                "popularity": 19.1822,
                "poster_path": "/A2VdIkrwBtfbZphrzxpIvEfetjl.jpg",
                "release_date": "1991-02-13",
                "title": "Paprika",
                "video": false,
                "vote_average": 7.142,
                "vote_count": 547,
                "character": "Duchess Silvia Dolgoruky (uncredited)",
                "credit_id": "616433a68c40f7002a733c3a",
                "order": 57
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Petra Rockstar"
        ],
        "biography": "Petra Scharbach, best known as Petra, is a German actress, model, singer and painter. She was sometimes credited as Petra Rockstar.\n\nBorn in Frankfurt, at 6 moved to Parma with her mother. In Italy, after having participated and won several beauty contests and worked as a model in local fashion shows, debuted in the mid-eighties as singer and softcore actress. In the same period she appeared on the cover of Playmen and of the French edition of Penthouse.\n\nThen she worked for several years with the Riccardo Schicchi's agency Diva Futura and was the main actress in several softcore movies. After some years she left Rome and returned to Parma to host a sport program in TV Parma. During these years she was a protagonist of gossip columns for her relations with American actor Tony Curtis.\n\nIn the early 2000s she began a career as a body art painter.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1431798,
        "imdb_id": "nm0770086",
        "known_for_department": "Acting",
        "name": "Petra Scharbach",
        "place_of_birth": "Frankfurt - Germany",
        "popularity": 0.3712,
        "profile_path": "/xDCpdW6AVRfnSoapvNQEQbBm86V.jpg"
    }
}