{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dcyPj11c00lOhMESAVWtJKzlHt4.jpg",
                "genre_ids": [
                    18
                ],
                "id": 250538,
                "original_language": "en",
                "original_title": "The Good Lie",
                "overview": "A young refugee of the Sudanese Civil War who wins a lottery for relocation to the United States with three other lost boys. Encountering the modern world for the first time, they develop an unlikely friendship with a brash American woman assigned to help them, but the young man struggles to adjust to this new life and his feelings of guilt about the brother he left behind.",
                "popularity": 2.1286,
                "poster_path": "/yAhoeIwwtPxJ7uf9HLIMHIqWFnL.jpg",
                "release_date": "2014-09-10",
                "title": "The Good Lie",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 543,
                "character": "INS Official",
                "credit_id": "54eda65cc3a3686d580038eb",
                "order": 50
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Levi E. Burdick"
        ],
        "biography": "Levi Burdick is from Ft. Lauderdale, Fl. and is a professional actor in Atlanta, GA. A Summa Cum Laude graduate of Shorter University, Levi has traveled the world as a businessman, corporate host, and entertainer. His acting career began on the stage and he as brought to life many iconic roles like Brick Politt in Cat on a Hot Tin Roof, Captain Jack Ross from A Few Good Men, Bogey from Play It Again, Sam and a powerful performance as Dracula in Bram Stoker's Dracula. While the call of a live audience will always keep Mr. Burdick returning to the stage, the power of telling a story on the big screen took him to Atlanta where the booming film industry as offered new opportunities in film, television, print modeling and commercial work. Along with several guest and supporting roles in various shows, Levi has also played lead roles in high quality independent productions across the southeast. His intensity on camera and extreme professionalism have made him a casting director's dream and a favorite in the Atlanta film community. Five nominations for Best Actor on the stage and a 2012 Atlanta 48 Hour Film project nomination for Best Actor (among 95 films) have demonstrated that his skill on the set is only surpassed by his charisma and charm. Mr. Burdick can be seen on the big screen Reese Witherspoon feature The Good Lie (2014) and on the ID Discovery Channel shows, Fatal Encounters, Bloodlands, and Your Worst Nightmare. Signed with Atlanta's number one talent agency, The People Store, Levi continues to perform and entertain across the country.  - IMDb Mini Biography",
        "birthday": null,
        "deathday": null,
        "gender": 0,
        "homepage": "http://www.leviburdickactor.com/",
        "id": 1431536,
        "imdb_id": "nm4562041",
        "known_for_department": "Acting",
        "name": "Levi Burdick",
        "place_of_birth": null,
        "popularity": 0.0416,
        "profile_path": null
    }
}