{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ryuNZtfeugm9olrytaydFPsDSoB.jpg",
                "genre_ids": [
                    28,
                    12,
                    35,
                    80,
                    53
                ],
                "id": 942,
                "original_language": "en",
                "original_title": "Lethal Weapon 2",
                "overview": "Riggs and Murtaugh are on the trail of South African diplomats using their immunity to engage in criminal activities.",
                "popularity": 7.1963,
                "poster_path": "/z35OkbOTfnalyx8LK5EPUrnKQhR.jpg",
                "release_date": "1989-07-07",
                "title": "Lethal Weapon 2",
                "video": false,
                "vote_average": 7.021,
                "vote_count": 3559,
                "character": "Rika Van Den Haas",
                "credit_id": "52fe4291c3a36847f8028c35",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Patricia Jude Kensit",
            "Patricia Jude Frances Kensit ",
            "Eight Wonder",
            "Патрисия Джуд Фрэнсис Кенсит",
            "Патрисия Кенсит",
            "پتسی کنسیت"
        ],
        "biography": "Patricia Jude Francis \"Patsy\" Kensit (born 4 March 1968) is an English actress and singer. Beginning her career as a child actor, Kensit gained attention when she acted in a string of commercials for Birds Eye frozen peas. She went on to appear in films such as The Great Gatsby (1974), Gold (1974), Alfie Darling (1975), Hennessy (1975), The Blue Bird (1976) and Hanover Street (1979). Balancing a dual career as both an actress and a singer, in 1983 Kensit formed and became the lead singer of the pop band Eighth Wonder. The group released several singles, including the top 20 hits \"I'm Not Scared\" and \"Cross My Heart\", before disbanding in 1989. Kensit achieved further success in her breakthrough role as Suzette in the musical film Absolute Beginners (1986) and as Rika van den Haas in Lethal Weapon 2 (1989) before starring in the films Blue Tornado (1991), Timebomb (1991), Twenty-One (1991), Blame It on the Bellboy (1992), Bitter Harvest (1993), Full Eclipse (1993), Angels & Insects (1995), Love and Betrayal (1995) and Grace of My Heart (1996).\n\nFollowing a return to television, between 2004 and 2006, Kensit played the role of Sadie King in the ITV soap opera Emmerdale and then that of Faye Morton in the BBC One medical drama Holby City from 2007 to 2010, and again for an episode in 2019. Throughout 2023, she played Emma Harding in EastEnders. Kensit has been married to musicians Dan Donovan, Jim Kerr, Liam Gallagher and Jeremy Healy. Kensit was nominated for the Young Artist Award for Best Juvenile Actress in a Motion Picture for her role in Hanover Street (1979). In 1991, she was nominated for the Independent Spirit Award for Best Female Lead in Twenty-One (1991), and later had several nominations for her role in Emmerdale.\n\nPatricia Jude Francis Kensit was born on 4 March 1968, at the General Lying-In Hospital, Lambeth, to James and Margaret Rose (née Doohan). Kensit's maternal grandparents hailed from County Leitrim, Ireland. She has an older brother. Her mother was a secretary at Dior and former model, who had previously dated Aga Khan IV, while Kensit's father was a close associate of both the Kray Twins and the Richardson Gang, earning himself the nickname \"Jimmy the Dip\", and was involved in the Great Train Robbery. He served time in prison before Kensit was born and used a cover as an antiques dealer. Kensit's godfather was Reggie Kray. Her paternal grandfather was a robber and counterfeiter. Kensit spent her childhood living on a council estate in Hounslow and had to sleep on mattresses on the floor. She attended Newland House School, St Catherine's School, Twickenham, and Corona Theatre School.",
        "birthday": "1968-03-04",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.patsykensit.com/",
        "id": 14326,
        "imdb_id": "nm0000475",
        "known_for_department": "Acting",
        "name": "Patsy Kensit",
        "place_of_birth": "Lambeth, London, England",
        "popularity": 1.6896,
        "profile_path": "/r60KQk3xOmMIhGmJqCeHQq6RX68.jpg"
    }
}