{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kOCJvnRYKg6CkvoFYbzz0itrUzR.jpg",
                "genre_ids": [
                    10749,
                    35
                ],
                "id": 384677,
                "original_language": "en",
                "original_title": "Set It Up",
                "overview": "Two overworked and underpaid assistants come up with a plan to get their bosses off their backs by setting them up with each other.",
                "popularity": 2.8403,
                "poster_path": "/7omfwqiiMld9EnUps3Uk9YZLy6g.jpg",
                "release_date": "2018-06-15",
                "title": "Set It Up",
                "video": false,
                "vote_average": 6.926,
                "vote_count": 2728,
                "character": "Mexican Restaurant Waiter",
                "credit_id": "5984800ac3a3687573006219",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Jeff Hiller is an American actor and comedian, best known for his portrayal of Joel on Somebody Somewhere. He is also known for his role as Mr. Whitely in American Horror Story: NYC.\n\nHiller grew up in San Antonio, Texas, and graduated from Texas Lutheran University in 1998.\n\nHiller started performing improv comedy with the Upright Citizens Brigade Theatre in 2001 where he was part of the improv teams People People, The Scam, Creep, Rumpleteaser and Police Chief Rumble. He taught improv comedy for a decade.\n\nHiller has appeared in various television series, including Guiding Light, Ugly Betty, 30 Rock, Law & Order: Criminal Intent, Psych, Unbreakable Kimmy\n\nSchmidt, and Community. Hiller appeared in the films Morning Glory and Ghost Town. Hiller was well-received for his performance as John Quincy Adams in the hit rock musical Bloody Bloody Andrew Jackson. In 2018, Hiller replaced Drew Droege's solo show Bright Colors and Bold Patterns off-Broadway and it was directed by Michael Urie.\n\nFrom 2022-2024, Hiller played Joel in Bridget Everett’s Peabody Award-winning series Somebody Somewhere.\n\nIn 2025 revival of Urinetown, Hiller played the role of Mr. McQueen.",
        "birthday": "1976-12-07",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.hillertime.com",
        "id": 143236,
        "imdb_id": "nm1865598",
        "known_for_department": "Acting",
        "name": "Jeff Hiller",
        "place_of_birth": "San Antonio, Texas,  United States",
        "popularity": 0.3964,
        "profile_path": "/AoIQ8ZRtxMIQatnhFeJHG6q6AVf.jpg"
    }
}