{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/enNubozHn9pXi0ycTVYUWfpHZm.jpg",
                "genre_ids": [
                    18,
                    28,
                    80,
                    53
                ],
                "id": 155,
                "original_language": "en",
                "original_title": "The Dark Knight",
                "overview": "Batman raises the stakes in his war on crime. With the help of Lt. Jim Gordon and District Attorney Harvey Dent, Batman sets out to dismantle the remaining criminal organizations that plague the streets. The partnership proves to be effective, but they soon find themselves prey to a reign of chaos unleashed by a rising criminal mastermind known to the terrified citizens of Gotham as the Joker.",
                "popularity": 45.0503,
                "poster_path": "/qJ2tW6WMUDux911r6m7haRef0WH.jpg",
                "release_date": "2008-07-16",
                "title": "The Dark Knight",
                "video": false,
                "vote_average": 8.5,
                "vote_count": 34382,
                "character": "Polk",
                "credit_id": "560c2ad6c3a368681f005c14",
                "order": 59
            },
            {
                "adult": false,
                "backdrop_path": "/paSilBRK7Qw3iIbf3xIYVDKnVF9.jpg",
                "genre_ids": [
                    28,
                    35,
                    53,
                    10749
                ],
                "id": 9434,
                "original_language": "en",
                "original_title": "Grosse Pointe Blank",
                "overview": "Hitman Martin Blank becomes a moving target after he rebuffs a fellow assassin's invitation to form a union. On the advice of his quirky assistant and neurotic psychiatrist, Martin begrudgingly heads out to Grosse Pointe, Michigan for his ten-year high school reunion, where he soon comes across the woman he jilted on prom night.",
                "popularity": 2.6571,
                "poster_path": "/7lQ0MSNQqBTYpXTTZL82u1n95Z3.jpg",
                "release_date": "1997-04-11",
                "title": "Grosse Pointe Blank",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 967,
                "character": "Kenneth McCullers",
                "credit_id": "560c6bfec3a36868140073fb",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/7ZJ8caqGFoqSclAfRueyU85udQD.jpg",
                "genre_ids": [
                    18
                ],
                "id": 1715,
                "original_language": "en",
                "original_title": "The Cider House Rules",
                "overview": "Homer is an orphan who was never adopted, becoming the favorite of orphanage director Dr. Larch. Dr. Larch imparts his full medical knowledge on Homer, who becomes a skilled, albeit unlicensed, physician. But Homer yearns for a self-chosen life outside the orphanage. What will Homer learn about life and love in the cider house? What of the destiny that Dr. Larch has planned for him?",
                "popularity": 5.3835,
                "poster_path": "/qAECAgqjSFRVZzEEGbFAZqZNiDh.jpg",
                "release_date": "1999-12-17",
                "title": "The Cider House Rules",
                "video": false,
                "vote_average": 7.076,
                "vote_count": 1218,
                "character": "Muddy",
                "credit_id": "579ca25ec3a36855d200713c",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Kenneth Todd Freeman",
            "К. Тодд Фриман",
            "К. Тодд Фримэн",
            "K. 토드 프리먼"
        ],
        "biography": "Kenneth Todd Freeman (born July 9, 1965) is an American actor. He has been nominated for two Tony Awards over the course of his career and has won one Drama Desk Award. He has played supporting roles in films such as Grosse Pointe Blank (1997) and The Cider House Rules (1999), played a prominent recurring role on Buffy the Vampire Slayer (1998–1999), and was a series regular on A Series of Unfortunate Events (2017–2019).\n\nBorn in Houston, Texas, Freeman went to the local High School for the Performing and Visual Arts before later graduating from the University of North Carolina School of the Arts in 1987.\n\nFreeman has been an ensemble member of the Steppenwolf Theatre Company in Chicago, Illinois since 1993. In the same year, he was nominated for the Tony Award for Best Actor in a Play for his lead performance in the Apartheid drama The Song of Jacob Zulu. More recently, Freeman has played the role of Doctor Dillamond from Wicked in the first North American tour, Chicago and Broadway productions. In 2015, he was nominated for his second Tony Award, this time for Best Featured Actor in a Play as Sissy Na Na in Airline Highway. He won the Drama Desk Award for Outstanding Featured Actor in a Play for the same role.\n\nHe has also had supporting roles in various films such as Eraser (1996), Grosse Pointe Blank (1997), The Cider House Rules (1999), and The Dark Knight (2008). On television, he earned a recurring role on Buffy the Vampire Slayer as Mr. Trick.\n\nHe performed in the Steppenwolf Theatre Company's production of Downstate, which concluded its run on November 18, 2018.\n\nHe portrayed Mr. Poe in the 2017 Netflix comedy drama series A Series of Unfortunate Events.",
        "birthday": "1965-07-09",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 143328,
        "imdb_id": "nm0293461",
        "known_for_department": "Acting",
        "name": "K. Todd Freeman",
        "place_of_birth": "Houston, Texas, USA",
        "popularity": 1.0117,
        "profile_path": "/oH93DHGXt2NTzW1sqrqEYKGBrt2.jpg"
    }
}