{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/or90vNrOVnYwi07fYYpQ3pbnjxP.jpg",
                "genre_ids": [
                    18,
                    53
                ],
                "id": 702,
                "original_language": "en",
                "original_title": "A Streetcar Named Desire",
                "overview": "A disturbed, aging Southern belle moves in with her sister for solace — but being face-to-face with her brutish brother-in-law accelerates her downward spiral.",
                "popularity": 3.2619,
                "poster_path": "/aicdlO5vt7z2ARm279eGzJeYCLQ.jpg",
                "release_date": "1951-09-19",
                "title": "A Streetcar Named Desire",
                "video": false,
                "vote_average": 7.617,
                "vote_count": 1411,
                "character": "Foreman (uncredited)",
                "credit_id": "563aaa9bc3a3681b590225c5",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Born in 1910, Spokane Washington. He worked in the oil fields as a rough neck. Competed in the 1932 Olympics in race walking. Worked as an extra in several movies. Joined the US Marines in 1942? where he eventually rose to the rank of Commissioned Warrent Officer. Instituted swimming programs at Camp Pendleton prior to shipping in the Pacific Theater of WW2.  Fought in hand to hand combat on Iwo Jima and several other Japanese held islands.  After the war Mel came back to the LA area where he worked as an illustrator for the Westmore Bros make up artists. Eventually he moved on to working as the head of the art dept for Pacific Title and Art Studio, supervising the creation of backgrounds and titles for many epic movies, among them: The Alamo, How the West was Won and many others.  Mel worked at Pacific Title until his untimely and early death at the age of 53. Struck down in the prime of his life by pulmonary embolisms (blood clots in his lungs) Mel left his beloved wife Leatrice and 3 children, Melanie, Kim (Mel) and Jennifer.  It was long suspected that his blood clots were caused by the numerous bayonet wounds to his legs from the combat.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 143454,
        "imdb_id": "nm0033706",
        "known_for_department": "Acting",
        "name": "Mel Archer",
        "place_of_birth": null,
        "popularity": 0.1955,
        "profile_path": null
    }
}