{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tOkSenL74N23O4S7wjJSUHz7Aeh.jpg",
                "genre_ids": [
                    80,
                    18,
                    53
                ],
                "id": 388,
                "original_language": "en",
                "original_title": "Inside Man",
                "overview": "When an armed, masked gang enter a Manhattan bank, lock the doors and take hostages, the detective assigned to effect their release enters negotiations preoccupied with corruption charges he is facing.",
                "popularity": 8.6347,
                "poster_path": "/ffMUgkDZICNiyaws1Jkv8qG8uFW.jpg",
                "release_date": "2006-03-17",
                "title": "Inside Man",
                "video": false,
                "vote_average": 7.398,
                "vote_count": 6057,
                "character": "Zahir",
                "credit_id": "54f413d99251410c2a000ec4",
                "order": 58
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Baktash Khadem Zaher",
            "Richard Zaher"
        ],
        "biography": "Baktash is a graduate of Embry-Riddle Aeronautical University, with a Bachelors of Science in Aerospace Studies. He was born in Kabul, Afghanistan, and grew up in New York City.\n\nBaktash is the founder and CEO of Paramount Business Jets, an internationally-renowned leader in the luxury private aircraft industry, with the largest selection of jets in the world and raves from Clive Owen, Angelina Jolie, and Michael Imperioli.\n\nBaktash starred in FireDancer, Afghanistan's first entry in the Oscars for best foreign film, The Return, and Spike Lee's Inside Man. He has traveled extensively, is fluent in five languages, and has been featured in most of the major media outlets, including ABC, NBC, CBS, BBC, the New York Times, Washington Post, Los Angeles Times, San Francisco Chronicle, and the Daily News.\n\n- IMDb Mini Biography",
        "birthday": "1976-02-07",
        "deathday": null,
        "gender": 0,
        "homepage": "https://www.paramountbusinessjets.com/",
        "id": 1434094,
        "imdb_id": "nm1295647",
        "known_for_department": "Acting",
        "name": "Baktash Zaher",
        "place_of_birth": "Kabul, Afghanistan",
        "popularity": 0.0193,
        "profile_path": "/rPv6UJ4xHtQzC4PgynE5c71kmpp.jpg"
    }
}