{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sGKUhw88FMH5gfz0E6BK2YOZ5se.jpg",
                "genre_ids": [
                    36,
                    18
                ],
                "id": 82695,
                "original_language": "en",
                "original_title": "Les Misérables",
                "overview": "An adaptation of the successful stage musical based on Victor Hugo's classic novel set in 19th-century France. Jean Valjean, a man imprisoned for stealing bread, must flee a relentless policeman named Javert. The pursuit consumes both men's lives, and soon Valjean finds himself in the midst of the student revolutions in France.",
                "popularity": 6.8937,
                "poster_path": "/6CuzBs2Lb8At7qQr64mLXg2RYRb.jpg",
                "release_date": "2012-12-18",
                "title": "Les Misérables",
                "video": false,
                "vote_average": 7.315,
                "vote_count": 5417,
                "character": "Enjolras",
                "credit_id": "52fe486c9251416c9108c0a5",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "آرون تویت",
            "ارون تویت",
            "اِران تویت",
            "آرون تیویت"
        ],
        "biography": "Aaron Kyle Tveit (born October 21, 1983) is an American actor and singer.\n\nTveit originated the lead role of Christian in the stage adaptation of Moulin Rouge! on Broadway, a performance for which he won the 2020 Tony Award for Best Actor in a Musical and received a 2020 Grammy Award nomination. His other work on the Broadway stage includes originating the roles of Gabe in Next to Normal and Frank Abagnale Jr. in Catch Me If You Can, as well as performing the roles of Fiyero in Wicked and Link Larkin in Hairspray.\n\nTveit has also portrayed several musical theatre roles on screen, such as Enjolras in the film adaptation of Les Misérables (2012), as well as Danny Zuko in Fox's Grease: Live (2016). Tveit is also known for his work in television, including the roles of Gareth Ritter on BrainDead, Tripp van der Bilt on Gossip Girl, Mike Warren on Graceland, and Danny Bailey in Schmigadoon!.\n\nDescription above from the Wikipedia article Aaron Tveit, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1983-10-21",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 143425,
        "imdb_id": "nm3117836",
        "known_for_department": "Acting",
        "name": "Aaron Tveit",
        "place_of_birth": "Middletown, New York, USA",
        "popularity": 0.6403,
        "profile_path": "/r69Yb2Az5oRpop6ZJMDhjQ4qfN0.jpg"
    }
}