{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/OfH6y4NfYpzHcA67nwT5TjhSzJ.jpg",
                "genre_ids": [
                    18,
                    10749,
                    9648
                ],
                "id": 17057,
                "original_language": "en",
                "original_title": "In a Lonely Place",
                "overview": "A violent screenwriter and a female neighbor fall in love after she clears him of murder, but she begins to have second thoughts.",
                "popularity": 2.1395,
                "poster_path": "/vbdgtwzLOpE6MppZlyYChMagvQq.jpg",
                "release_date": "1950-05-17",
                "title": "In a Lonely Place",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 619,
                "character": "Mel Lippman",
                "credit_id": "52fe47029251416c7508ae97",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/1aspiiXDHVizaCYTNaWwRQSmXCh.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 990,
                "original_language": "en",
                "original_title": "The Hustler",
                "overview": "Fast Eddie Felson is a small-time pool hustler with a lot of talent but a self-destructive attitude. His bravado causes him to challenge the legendary Minnesota Fats to a high-stakes match.",
                "popularity": 2.9284,
                "poster_path": "/snItsSViawjaadW9mlWUmGwR41R.jpg",
                "release_date": "1961-09-25",
                "title": "The Hustler",
                "video": false,
                "vote_average": 7.674,
                "vote_count": 1016,
                "character": "",
                "credit_id": "682cfa18bdfecb719a8c1258",
                "order": 33
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Arthur Gordon Smith"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nArthur Gordon \"Art\" Smith (March 23, 1899 – February 24, 1973) was an American film, stage and television actor, best known for playing supporting roles in the 1940s.\n\nBorn in Chicago, he was a member of the Group Theatre and performed in many of their productions, including Rocket to the Moon, Awake and Sing!, Golden Boy and Waiting for Lefty, all by Clifford Odets; House of Connelly by Paul Green; and Sidney Kingsley's Men in White. The gray-haired actor usually played studious and dignified types in films, such as doctors or butlers.\n\nSmith appeared in many black-and-white noirish films in supporting roles alongside more handsome and popular movie leads, such as John Garfield in Body and Soul (1947) and Humphrey Bogart in In a Lonely Place (1950). He had a key role as a federal agent in 1947's Ride the Pink Horse, starring and directed by Robert Montgomery. Two of these films, In a Lonely Place and Ride a Pink Horse, were based on novels by Dorothy B. Hughes.\n\nSmith was one of the victims of the Hollywood blacklist, which ended most of his film career in 1952. In 1957, he originated the role of Doc in the stage version of West Side Story. Smith only returned occasionally to the film business, for example in an uncredited part in The Hustler. He also worked on television before retiring in 1967. He died, aged 73, in Long Island, New York, from a heart attack.",
        "birthday": "1899-03-22",
        "deathday": "1973-02-24",
        "gender": 2,
        "homepage": null,
        "id": 14359,
        "imdb_id": "nm0807354",
        "known_for_department": "Acting",
        "name": "Art Smith",
        "place_of_birth": "Chicago, Illinois, USA",
        "popularity": 0.1403,
        "profile_path": "/pZUgwEf3x0yHRuwRv5ys42FpZC9.jpg"
    }
}