{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kN8SMfKfca655F97pqRnWPmFAiZ.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 550231,
                "original_language": "en",
                "original_title": "The Secret: Dare to Dream",
                "overview": "A widow with three children hires a handyman to fix her house during a major storm. When not doing home repairs, he shares his philosophy of believing in the power of the universe to deliver what we want.",
                "popularity": 2.612,
                "poster_path": "/5mCqEeBA0MW7H6akFrFQXJu68rU.jpg",
                "release_date": "2020-04-16",
                "title": "The Secret: Dare to Dream",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 634,
                "character": "Weather Guy (voice)",
                "credit_id": "5f77ebfd532acb00377adcf0",
                "order": 24
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Jerry White Jr. has been making films since he was a teenager, getting his start with public access television in Metro Detroit during the early 90s. He is a lifelong student of DIY guerrilla filmmaking as well as a MFA graduate of USC's School of Cinematic Arts. As a director, actor, and producer, he has screened at over a hundred film festivals worldwide, winning numerous awards and securing international distribution for 20 Years of Madness, a film more than two decades in the making. In 2017, he founded the Vidlings & Tapeheads Film Festival to promote unconventional storytelling and bring together eclectic, unorthodox, and progressive filmmakers, musicians, and artists. Jerry is drawn to niche creative subcultures, outsider artists, and passionate amateurs and this is reflected in his work.",
        "birthday": "1975-10-24",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.jerrywhitejr.com/",
        "id": 1435525,
        "imdb_id": "nm3553326",
        "known_for_department": "Directing",
        "name": "Jerry White Jr.",
        "place_of_birth": null,
        "popularity": 0.0261,
        "profile_path": "/ly85IL1VACCPSxaKtyBbFTBuWYB.jpg"
    }
}