{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7HiMvoDSYW4fyu4rkmWH6pcKKuF.jpg",
                "genre_ids": [
                    35,
                    18,
                    80,
                    53
                ],
                "id": 7270,
                "original_language": "en",
                "original_title": "Matchstick Men",
                "overview": "A phobic con artist and his protege are on the verge of pulling off a lucrative swindle when the con artist's teenage daughter arrives unexpectedly.",
                "popularity": 2.7862,
                "poster_path": "/y5hBAMrOWUusHjnWUGLpFWPtPAP.jpg",
                "release_date": "2003-09-12",
                "title": "Matchstick Men",
                "video": false,
                "vote_average": 7.007,
                "vote_count": 1838,
                "character": "Carpet Store Manager",
                "credit_id": "616a41b15a99150065eba1f8",
                "order": 21
            },
            {
                "adult": false,
                "backdrop_path": "/eyjWwMOgkq4nh0wMtyW8XPJ749H.jpg",
                "genre_ids": [
                    18
                ],
                "id": 109410,
                "original_language": "en",
                "original_title": "42",
                "overview": "In 1946, Branch Rickey, owner of the Brooklyn Dodgers, took a stand against Major League Baseball's infamous color line when he signed Jackie Robinson  to the team. The deal put both men in the crosshairs of the public, the press and even other players. Facing unabashed racism from every side, Robinson was forced to demonstrate tremendous courage and let his talent on the field wins over fans and his teammates – silencing his critics and forever changing the world by changing the game of baseball.",
                "popularity": 5.4709,
                "poster_path": "/iZ7jVGQWj3eBUdqwAPUlKk0BaS2.jpg",
                "release_date": "2013-04-12",
                "title": "42",
                "video": false,
                "vote_average": 7.199,
                "vote_count": 1883,
                "character": "Mallie",
                "credit_id": "5f8e7407392712003a2d92ca",
                "order": 32
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Mone Walton"
        ],
        "biography": "Monnae Michaell's work spans TV, film, theater, animation and commercials. Nominated for an NAACP Theatre Award for her role as Tanya in August Wilson's King Hedley III (Mark Taper), and considered for an Emmy nomination for her work in Flight '93, as Lisa Jefferson, some of her favorite roles have been Annie on American Dreams, Judge Bass on The Defenders, Half George in \"the road weeps, the well runs dry.\" and Citizen 2 in \"Citizen: An American Lyric...\" Other television credits include, \"The Office\" \"NipTuck\", \" The Young & The Restless\", \"The Shield\", \"The Practice\", and many others. Monnae attended the Lee Strasberg Institute through New York University and began her career in musical theatre as an actress/ singer /dancer. She has performed in many musical venues, and her one-woman show (presented in various NYC clubs) won a Bistro Award for Best Newcomer. She has taught creative improvisational workshops for children ages 6-17, and her work is represented in commercials, voice-overs, industrials, CD-ROMs and animated film. She is the voice of Anui, Balto's mother in the animated film Balto II: Wolf Quest.",
        "birthday": "1965-10-11",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1435163,
        "imdb_id": "nm0910563",
        "known_for_department": "Acting",
        "name": "Monnae Michaell",
        "place_of_birth": " New York City, New York, USA",
        "popularity": 0.4919,
        "profile_path": "/viQRzMcT0ihksIyqx5SVyIzTRAr.jpg"
    }
}