{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7HlX7R8yTSlxqmzMxVemsOEkAfo.jpg",
                "genre_ids": [
                    18
                ],
                "id": 401104,
                "original_language": "en",
                "original_title": "To the Bone",
                "overview": "A young woman dealing with anorexia meets an unconventional doctor who challenges her to face her condition and embrace life.",
                "popularity": 3.7831,
                "poster_path": "/pkdxhdB3dRUqazqoy9lzUvhayjc.jpg",
                "release_date": "2017-01-22",
                "title": "To the Bone",
                "video": false,
                "vote_average": 7.212,
                "vote_count": 3539,
                "character": "Penny",
                "credit_id": "57568b52c3a3680cc4002387",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            " Rebekah Lynne Kennedy"
        ],
        "biography": "Rebekah Kennedy began acting on the stage. Rebekah spent all of her time doing theatre and it wasn't until later that she truly discovered the screen.\n\nSoon came an amazing opportunity when Rebekah booked the lead role Hanna in the feature, \"House Hunting\" with Marc Singer and Art LaFleur and then went on to play Caroline Boutine in the feature, \"Creature,\" starring Mehcad Brooks and Serinda Swan. Then came another wonderful opportunity when she booked a supporting role in the feature, \"Season of the Witch\" with Nicolas Cage.\n\nRebekah made her television debut on the TNT show, \"Memphis Beat.\" She also had a guest star role in the long running TV show \"Criminal Minds\" on CBS, the lead guest star Esther Labott in The Book of Esther on \"Law & Order SVU\" on NBC, and most recently as the crazy drug addict Melly Wyatt in \"Station 19\" on ABC.\n\nRebekah first hit the big screen when she played the young Peasant Turk Girl in \"Season of the Witch\" with Nicolas Cage and Ron Perlman, which landed in theaters January 2011, \"Creature\" which opened in September 2011, and then as one of the leads in the horror film \"Bastard\" with After Dark Films and Fox Home Entertainment which opened in October 2015. \"A Dark Foe\" with Graham Greene and Selma Blair opened in select theaters July 2021 and most recently \"The Unseen\" which played in select theaters June 30th 2023 with RJ Mitte.\n\nRebekah can also be seen in Netflix's \"To The Bone\" starring Lily Collins and Keanu Reeves. \"Let Me Make You A Martyr\" with Mark Boone Junior, \"Street Level\" with Sons of Anarchy's David Labrava and Mark Boone Junior, and \"Limbo\" with James Purefoy. She most recently can be seen starring as the mute girl Jojo in the Amazon prime movie \"Los Angeles\" and as the starring witch Masha in \"Two Witches\" that is taking the horror world by storm. She also most recently wrapped \"The Veil\" with Sean O'Bryan that premiered at the Austin Film Festival and \"Crust\" with Sean Whalen, Daniel Roebuck, and Alan Ruck that will be releasing this Fall.\n\nRebekah is also heavily involved with reaching out to the homeless and has done work with the Covenant House in Los Angeles.",
        "birthday": "1984-04-03",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 143549,
        "imdb_id": "nm2796058",
        "known_for_department": "Acting",
        "name": "Rebekah Kennedy",
        "place_of_birth": "Arlington, Texas, USA",
        "popularity": 0.1295,
        "profile_path": "/d23uj6cZsC5CYSUcePIbTQev13b.jpg"
    }
}