{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/46GikxYW84dRh71sWVY0eRQiHLX.jpg",
                "genre_ids": [
                    27,
                    18
                ],
                "id": 393519,
                "original_language": "fr",
                "original_title": "Grave",
                "overview": "In Justine’s family everyone is a vet and a vegetarian. At 16, she’s a gifted teen ready to take on her first year in vet school, where her older sister also studies. There, she gets no time to settle: hazing starts right away. Justine is forced to eat raw meat for the first time in her life. Unexpected consequences emerge as her true self begins to form.",
                "popularity": 5.6208,
                "poster_path": "/kc8jT1MAiKM0iwdjAwC5lQrTNry.jpg",
                "release_date": "2016-11-11",
                "title": "Raw",
                "video": false,
                "vote_average": 7.045,
                "vote_count": 3306,
                "character": "Alexia",
                "credit_id": "57322305c3a368691c000166",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "エラ・ルンプフ"
        ],
        "biography": "Ella Rumpf (born February 4, 1995) is a Swiss actress, best known for her role as Alexia in the 2016 horror drama film Raw, which won the Sutherland Trophy at the 2016 BFI London Film Festival. Her other notable roles include, critical acclaimed Tiger in Tiger Girl (2017) and Hanna in The Divine Order (2017), the Swiss entry for the Best Foreign Language Film at the 90th Academy Awards.\n\nElla Rumpf was born in Paris and grew up in Zurich, Switzerland. Her father is a psychotherapist and her mother a lecturer. Rumpf went to the Steiner school and had her first taste of acting by winning the lead role in Romeo and Juliet at 14. She appeared in her debut film at age 16 called Summer Outside in 2011 directed by Friederike Jehn.\n\nRumpf won the role of Ali in the multi-award-winning feature film War (Krieg), by Simon Jaquemet in 2014 and was nominated for Best Supporting Actress at the Swiss Film Awards. She shaved her head for the role. She attended the Giles Foreman Center for Acting in London from 2013–2015 after completing her studies at the Zurich University of Applied Sciences in 2013.\n\nElla Rumpf starred alongside Garance Marillier in Raw (2016). In 2017, she played the lead role in Tiger Girl and a supporting role in The Divine Order (Die göttliche Ordnung). In 2022, Rumpf appeared in the HBO television series Tokyo Vice, to be directed by Michael Mann and written by J.T. Rogers.\n\nShe speaks Swiss German and French at a native level, and is fluent in German and English.\n\nSource: Article \"Ella Rumpf\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1995-02-04",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1438688,
        "imdb_id": "nm5050688",
        "known_for_department": "Acting",
        "name": "Ella Rumpf",
        "place_of_birth": "Paris, France",
        "popularity": 0.3499,
        "profile_path": "/xui86lo1tlhl3rLy9MpVCWPNpph.jpg"
    }
}