{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1w8kutrRucTd3wlYyu5QlUDMiG1.jpg",
                "genre_ids": [
                    12,
                    10751,
                    16
                ],
                "id": 762509,
                "original_language": "en",
                "original_title": "Mufasa: The Lion King",
                "overview": "Mufasa, a cub lost and alone, meets a sympathetic lion named Taka, the heir to a royal bloodline. The chance meeting sets in motion an expansive journey of a group of misfits searching for their destiny.",
                "popularity": 20.2493,
                "poster_path": "/lurEK87kukWNaHd0zYnsi3yzJrs.jpg",
                "release_date": "2024-12-18",
                "title": "Mufasa: The Lion King",
                "video": false,
                "vote_average": 7.362,
                "vote_count": 2372,
                "character": "Nala (voice)",
                "credit_id": "662f9769a199a6012b72eea2",
                "order": 16
            },
            {
                "adult": false,
                "backdrop_path": "/4G7SzRAaXYZ5hYfS05wbTzjv2Tn.jpg",
                "genre_ids": [
                    12,
                    18,
                    10751,
                    16
                ],
                "id": 420818,
                "original_language": "en",
                "original_title": "The Lion King",
                "overview": "Simba idolizes his father, King Mufasa, and takes to heart his own royal destiny. But not everyone in the kingdom celebrates the new cub's arrival. Scar, Mufasa's brother—and former heir to the throne—has plans of his own. The battle for Pride Rock is ravaged with betrayal, tragedy and drama, ultimately resulting in Simba's exile. With help from a curious pair of newfound friends, Simba will have to figure out how to grow up and take back what is rightfully his.",
                "popularity": 8.098,
                "poster_path": "/dzBtMocZuJbjLOXvrl4zGYigDzh.jpg",
                "release_date": "2019-07-12",
                "title": "The Lion King",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 10491,
                "character": "Nala (voice)",
                "credit_id": "59fa5b48925141137f001c68",
                "order": 6
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/7EazpcvoCfNZZysgljUAkQCBvW.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 614917,
                "original_language": "en",
                "original_title": "King Richard",
                "overview": "The story of how Richard Williams served as a coach to his daughters Venus and Serena, who will soon become two of the most legendary tennis players in history.",
                "popularity": 2.9343,
                "poster_path": "/2dfujXrxePtYJPiPHj1HkAFQvpu.jpg",
                "release_date": "2021-11-18",
                "title": "King Richard",
                "video": false,
                "vote_average": 7.621,
                "vote_count": 2678,
                "credit_id": "66ba8bc609107b5472d77153",
                "department": "Sound",
                "job": "Songs"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Beyoncé Knowles-Carter",
            "Beyoncé Knowles",
            "Destiny's Child",
            "Beyoncé Giselle Knowles-Carter",
            "Beyoncé Giselle Knowles",
            "ਬਿਆਂਸੇ ਨੌਲੇਸ",
            "பியான்சே நோல்ஸ்",
            "ბიონსე ნოულსი",
            "Beyonce",
            "بیانسه"
        ],
        "biography": "Beyoncé Giselle Knowles-Carter (born September 4, 1981), often known simply as Beyoncé, is an American R&B and pop recording artist and actress.\n\nBorn and raised in Houston, Texas, she enrolled in various performing arts schools and was first exposed to singing and dancing competitions as a child. Knowles rose to fame in the late 1990s as the lead singer of the R&B girl group Destiny's Child, one of the world's best-selling girl groups of all time. During the hiatus of Destiny's Child, Knowles released her debut solo album Dangerously in Love (2003), which spawned the number one hits \"Crazy in Love\" and \"Baby Boy\" and became one of the most successful albums of that year, earning her a then record-tying five Grammy Awards.\n\nFollowing the group's disbandment in 2005, Knowles released B'Day in 2006. It debuted at number one on the Billboard charts and included the hits \"Déjà Vu\", \"Irreplaceable\" and \"Beautiful Liar\". Her third solo album I Am... Sasha Fierce, released in November 2008, included the anthemic \"Single Ladies (Put a Ring on It)\". The album and its singles earned her six Grammy Awards, breaking the record for most Grammy Awards won by a female artist in one night. Knowles is one of the most honored artists by the Grammys with 16 awards—13 as a solo artist and three as a member of Destiny's Child.\n\nKnowles began her acting career in 2001, appearing in the musical film Carmen: A Hip Hopera. In 2006, she starred in the lead role in the film adaptation of the 1981 Broadway musical Dreamgirls, for which she earned two Golden Globe nominations. Knowles launched her family's fashion line, House of Deréon, in 2004, and has endorsed such brands as Pepsi, Tommy Hilfiger, Armani and L'Oréal.\n\nIn 2010, Forbes ranked Knowles at number two on its list of the 100 Most Powerful and Influential Celebrities in the world; she was also listed as the most powerful and influential musician in the world. Time also included Knowles on its list of the \"100 Most Influential People in the World\". Knowles has attained five Hot 100 number one singles as a solo performer and four with Destiny's Child, and as a solo artist, has sold over 35 million albums and singles in the U.S.; according to Sony, her total record sales, when combined with the group, have surpassed 100 million. On December 11, 2009, Billboard listed Knowles as the most successful female artist of the 2000s decade and the top Radio Artist of the decade. In February 2010, the RIAA listed her as the top certified artist of the decade.",
        "birthday": "1981-09-04",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.beyonce.com/",
        "id": 14386,
        "imdb_id": "nm0461498",
        "known_for_department": "Acting",
        "name": "Beyoncé",
        "place_of_birth": "Houston, Texas, USA",
        "popularity": 0.4291,
        "profile_path": "/a91EgtxUVG1orBvMekTQUzpNppy.jpg"
    }
}