{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1ufic9NSdolkgNkQSAVjlVp0uqn.jpg",
                "genre_ids": [
                    9648,
                    53,
                    18
                ],
                "id": 210577,
                "original_language": "en",
                "original_title": "Gone Girl",
                "overview": "With his wife's disappearance having become the focus of an intense media circus, a man sees the spotlight turned on him when it's suspected that he may not be innocent.",
                "popularity": 18.2364,
                "poster_path": "/ts996lKsxvjkO2yiYG0ht4qAicO.jpg",
                "release_date": "2014-10-01",
                "title": "Gone Girl",
                "video": false,
                "vote_average": 7.89,
                "vote_count": 19271,
                "character": "Lauren Nevens",
                "credit_id": "550316dac3a3685ba20053a4",
                "order": 39
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Renee Rusch",
            "Donna Rusch Beisel"
        ],
        "biography": "Donna Rusch Beisel is an American actress. A fun fact, before he became a star, she starred with Matthew McConaughey in a training film for Exxon Aviation.  She graduated from the University of Houston with her Bachelor of Arts degree in Radio/TV/Film. She landed a job as a part-time Desk Assistant at the country's #1 All-News Radio Station, KTRH-740 AM, Houston. She quickly rose to become a Reporter, earning numerous local and statewide awards including \"Best News Series in Texas\" from UPI. After 3 years, she went to the smaller city of Beaumont, Texas to prime her TV reporting skills. Soon, she became the city's first female solo 10 o'clock weeknight News Anchor. But after nearly 4 years, her love of acting won out.\n\nShe moved back to Houston and signed with top Texas Talent Agent, Jenny Bosby of the Pastorini-Bosby Talent Agency. On her first national commercial audition, she booked the job for Texaco Express Lube. For 17 years, she worked primarily in commercials, voiceover and as a spokeswoman for Industrial Films and Web Content for clients such as ExxonMobil, Shell, Compaq Computers, Continental Airlines and Chevron.\n\nIn 1995, she became host of Texas Today, a live daily morning show featuring Hollywood stars visiting the city, top chefs, book authors, and a live band. In 2000, her first TV movie role was as a Reporter in Mortelle Invasion (2000), directed by Tim Matheson, made famous by his Otter role in American College (1978). She also became known as \"Renee Rusch\", a traffic reporter on several radio stations and served time as a TV Traffic Anchor on both the NBC and CBS television affiliates.\n\nIn 2011, she made the move to L.A. and quickly hooked into the Independent Film world with a lead role in the award-winning film Home from War (2012), accepted to Cannes 2013. She also stars in the thriller The Channel (2015).  She has appeared on episodes of Criminal Minds(2013) and Revenge(2013).",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1439207,
        "imdb_id": "nm4016223",
        "known_for_department": "Acting",
        "name": "Donna Rusch",
        "place_of_birth": "Houston, Texas, USA",
        "popularity": 0.0429,
        "profile_path": "/kGnHvBUrfv7yPee9qCfeNDiGQ8z.jpg"
    }
}