{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1ufic9NSdolkgNkQSAVjlVp0uqn.jpg",
                "genre_ids": [
                    9648,
                    53,
                    18
                ],
                "id": 210577,
                "original_language": "en",
                "original_title": "Gone Girl",
                "overview": "With his wife's disappearance having become the focus of an intense media circus, a man sees the spotlight turned on him when it's suspected that he may not be innocent.",
                "popularity": 18.2364,
                "poster_path": "/ts996lKsxvjkO2yiYG0ht4qAicO.jpg",
                "release_date": "2014-10-01",
                "title": "Gone Girl",
                "video": false,
                "vote_average": 7.89,
                "vote_count": 19271,
                "character": "Above-It-All Journalist",
                "credit_id": "5502ff1fc3a3687b69003e25",
                "order": 23
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Katharine Elizabeth Campbell"
        ],
        "biography": "Kate Campbell's immense love for storytelling, music, and art began, at early age growing up in Northern Ontario, Canada. This love and fascination kept her busy singing in choirs, performing in plays and studying voice. She also had a great love for athletics and excelled at a National level in hurdles and was a gold medal Provincial champion in Track & Field while attending High School. She turned down several athletic scholarships to study Musical Theatre Performance at Sheridan College. While in Toronto she shot several TV and film projects, co-hosted the Latin American Awards at Roy Thompson Hall, co-produced and starred in a hit production of Neil LaBute's The Shape of Things, and co-directed a benefit concert for St. Michael's Boy's Choir 'A Gift of Music' at Roy Thompson Hall featuring The Barenaked Ladies, John McDermott, and Michael Burgess.\n\nKate then ventured to Los Angeles where she has enjoyed singing with some of the industry's most incredible talents throughout LA and up and down the California Coast, Palm Springs, Las Vegas, and also the Sundance Film Festival. She is the female vocalist for the LA based band the Martini Kings. She also collaborates in performance and as a lyricist with NY/LA based jazz musician Nick Mancini. She has performed with Robbie Krieger of The Doors and with actor/musician Jeff Goldblum & his Mildred Snitzer Orchestra.\n\n- IMDb Mini Biography",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1439089,
        "imdb_id": "nm1685386",
        "known_for_department": "Acting",
        "name": "Kate Campbell",
        "place_of_birth": null,
        "popularity": 0.0336,
        "profile_path": "/gKa7jT8Vdg8CGsgddkpd2CbeJ6r.jpg"
    }
}