{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kIBBeb94FbNfLSljeFUxUoszflb.jpg",
                "genre_ids": [
                    18,
                    10752,
                    36
                ],
                "id": 17295,
                "original_language": "it",
                "original_title": "La battaglia di Algeri",
                "overview": "Paratrooper commander Colonel Mathieu, a former French Resistance fighter during World War II, is sent to Algeria to reinforce efforts to squelch the uprisings of the Algerian War. There he faces Ali la Pointe, a former petty criminal who, as the leader of the Algerian Front de Liberation Nationale, directs terror strategies against the colonial French government occupation. As each side resorts to ever-increasing brutality, no violent act is too unthinkable.",
                "popularity": 2.1462,
                "poster_path": "/2p3AFtOHFvP6OeVMqlnL1zLKOqL.jpg",
                "release_date": "1966-09-08",
                "title": "The Battle of Algiers",
                "video": false,
                "vote_average": 7.872,
                "vote_count": 826,
                "character": "The Drunk Man (uncredited)",
                "credit_id": "65cf72ca706e56017939a42c",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ahmed Ayad",
            "رويشد"
        ],
        "biography": "Ahmed Ayad (April 28, 1921 - January 20, 1999), was an Algerian actor and comedian born in Algiers, to a father from Aït Djennad in the wilaya of Tizi Ouzou and a mother from Blida. He is the half-brother of singer Hadj Mrizek.\n\nDuring childhood, Rouiched did a thousand small jobs to survive. Self-taught, he obtained his first role in a play by Abdelhamid Ababsa entitled “Estardjâ Yâ Assi” (Come back to you O unconscious). His interpretation saves the piece from flopping.\n\nHe then launched into the profession and became the leader of an artistic troupe. He rubbed shoulders with the big names of the time: Rachid Ksentini, Mustapha Badie, Nadjat Tounsi, Sid-Ali Fernandel, Mohamed Touri, Mustapha Kateb… His conception of art and theater earned him the grievances of Mahieddine Bachetarzi.\n\nAfter independence, he was part of the Algerian National Theater troupe, but won recognition on television and in cinema in the film \"Hassen Terro\" by Mohamed Lakhdar-Hamina.\n\nRouiched, who became a very great figure in Algerian comedy theater and cinema, continued his career on Algerian Television where he played in numerous sketches and television films until his death in 1999.",
        "birthday": "1921-04-28",
        "deathday": "1999-01-28",
        "gender": 2,
        "homepage": "https://www.spla.pro/fr/fiche.personnes.spla.51939.html",
        "id": 1439879,
        "imdb_id": "nm0746250",
        "known_for_department": "Acting",
        "name": "Rouiched",
        "place_of_birth": "Algiers, Algeria",
        "popularity": 0.9079,
        "profile_path": "/xxI87MXvn9ZvEh6xmcHP0gBiZkW.jpg"
    }
}