{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dCuwNZp2DLOWr8qV0GDBHINhVZM.jpg",
                "genre_ids": [
                    18,
                    14
                ],
                "id": 103328,
                "original_language": "fr",
                "original_title": "Holy Motors",
                "overview": "We follow 24 hours in the life of a being moving from life to life like a cold and solitary assassin moving from hit to hit. In each of these interwoven lives, the being possesses an entirely distinct identity: sometimes a man, sometimes a woman, sometimes youthful, sometimes old. By turns murderer, beggar, company chairman, monstrous creature, worker, family man.",
                "popularity": 1.6796,
                "poster_path": "/4ZuTrrDQhCS9f6KzIX6HfsjjyMd.jpg",
                "release_date": "2012-07-02",
                "title": "Holy Motors",
                "video": false,
                "vote_average": 6.991,
                "vote_count": 1199,
                "character": "Church Musician",
                "credit_id": "618fd15b976a23006942a640",
                "order": 26
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Noir Désir"
        ],
        "biography": "Bertrand Cantat (born 5 March 1964) is a French songwriter, singer, and musician known for being the former frontman of the rock band Noir Désir. In 2003, he was proven guilty without a doubt and convicted of the murder (\"murder with indirect intent\" – dolus eventualis) of French actress Marie Trintignant, which occurred in a hotel room in Vilnius. Cantat returned to Noir Désir after his release from prison in 2007, playing with the group until it disbanded in 2010. He subsequently formed a musical duo with Pascal Humbert, calling themselves Détroit.\n\nCantat was born in Pau, Pyrénées-Atlantiques. The son of a navy officer, he spent his childhood in Le Havre. His family moved when he was an adolescent to Bordeaux. At the lycée Saint-Genès, he met Denis Barthe, Serge Teyssot-Gay, and Frédéric Vidalenc, who soon became members of his band.\n\nAt the height of Noir Désir's success in the 1990s, Cantat was a prominent figure in French music. Noir Désir is regarded \"to have made the history of the French rock scene for three decades\". He was known for the quality of his lyrics, charisma, and live performances, often compared to Jim Morrison of the Doors.\n\nIn 1997, Cantat married Krisztina Rády, an art director of Hungarian descent, with whom he had two children; Milo, born in 1998, and Alice, born in 2003.\n\nIn 2002, Cantat began an affair with French actress Marie Trintignant after meeting at his concert. In 2003, the two were in Vilnius, Lithuania, while Trintignant was filming the television movie, Colette, une femme libre.\n\nOn July 27, local authorities received a call from Trintignant's brother, Vincent, to Cantat and Trintignant's Vilnius hotel room. According to Cantat, the previous night, Trintignant received a text from her estranged husband, Samuel Benchetrit and the two began arguing. In initial interviews with authorities, Cantat claimed that she became physical and he hit her in response, accidentally knocking her down to hit her head on the radiator. He claimed he put her bed around 1AM and called her ex for relationship advice. He then called Vincent to come over. After reviewing the situation and realizing she would not wake, Vincent decided to call the police.\n\nTrintignant was taken to a local hospital, where she had two operations performed. After four days, severely injured and still in a deep coma, her parents had her transferred back to Paris. She died of a cerebral edema the following day, August 1. Trintignant was 41 at the time of her death and left four young sons. Cantat was detained by the police upon their initial arrival, where he gave his initial claims of the accident story.\n\nThe post-mortem examination suggested that Cantat had inflicted nineteen blows to Trintignant's head, causing irreversible brain damage. A separate French inquiry determined the she died from violent shaking and severe, repeated blows.\n\nIn March 2004, Cantat was sentenced by Vilnius Regional Court under Article 129 of the Lithuanian Criminal Code to eight years in prison for murder, committed with indirect intent (dolus eventualis). Cantat served four years of his eight-year sentence in prison. Cantat was released from the French prison on parole in October 2007. His parole status was lifted in 2010.\n\nSource: Article \"Bertrand Cantat\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1964-03-05",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1441988,
        "imdb_id": "nm1370300",
        "known_for_department": "Acting",
        "name": "Bertrand Cantat",
        "place_of_birth": "Pau, Pyrénées-Atlantiques, France",
        "popularity": 0.0434,
        "profile_path": "/cu0t1MDXeFanWuumTi2MleDHkyJ.jpg"
    }
}