{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kEhCztSTP4ixu7R0AIWg8vvcvbb.jpg",
                "genre_ids": [
                    28,
                    12,
                    10752
                ],
                "id": 948713,
                "original_language": "en",
                "original_title": "The Last Kingdom: Seven Kings Must Die",
                "overview": "In the wake of King Edward's death, Uhtred of Bebbanburg and his comrades adventure across a fractured kingdom in the hopes of uniting England at last.",
                "popularity": 4.7232,
                "poster_path": "/qcNDxDzd5OW9wE3c8nWxCBQoBrM.jpg",
                "release_date": "2023-04-14",
                "title": "The Last Kingdom: Seven Kings Must Die",
                "video": false,
                "vote_average": 7.246,
                "vote_count": 749,
                "character": "Brida",
                "credit_id": "643d29152ea6b9048d520a98",
                "order": 33
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Cox was born to a British father and an Irish mother in Vienna. Her parents later divorced. Both of them are pianists, who originally came to Vienna on a grant for musicians. Cox grew up in Vienna and graduated from high school in 2003. She developed an interest in acting after performing in a play as part of her English classes during her final year in high school. After her graduation she went on to study acting at the Max Reinhardt Seminar. In 2008 she was under contract as a stage actor at the Theater in der Josefstadt in Vienna. In 2011 Cox moved to Berlin and since then she has appeared in various movies and series on German and Austrian TV, among them several Tatort movies. Since 2015 she plays the role of the viking woman Brida in the TV series The Last Kingdom, which made her known to international audiences.",
        "birthday": "1985-02-23",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 144344,
        "imdb_id": "nm2686957",
        "known_for_department": "Acting",
        "name": "Emily Cox",
        "place_of_birth": "Vienna, Austria",
        "popularity": 0.6737,
        "profile_path": "/vuCvqZKsfoAJSBwThbfGGbPROgv.jpg"
    }
}