{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hZHeDPQGNKN9NN9GuW7qVbM2tDx.jpg",
                "genre_ids": [
                    12,
                    35,
                    18
                ],
                "id": 962,
                "original_language": "en",
                "original_title": "The Gold Rush",
                "overview": "A gold prospector in Alaska struggles to survive the elements and win the heart of a dance hall girl.",
                "popularity": 3.1193,
                "poster_path": "/eQRFo1qwRREYwj47Yoe1PisgOle.jpg",
                "release_date": "1925-07-13",
                "title": "The Gold Rush",
                "video": false,
                "vote_average": 7.987,
                "vote_count": 1706,
                "character": "Big Jim McKay",
                "credit_id": "52fe4294c3a36847f80299a1",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Moroni Swain",
            "Мак Свейн"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nMack Swain (born Moroni Swain, February 16, 1876 – August 25, 1935) was an early American film actor, who appeared in many of Mack Sennett's comedies at Keystone Studios, including the Keystone Cops series. He also appeared in major features by Charlie Chaplin.\n\nIn the early 1900s Swain had his own stock theater company, which performed in the western and midwestern United States.\n\nSwain worked in vaudeville before starting in silent film at Keystone Studios under Mack Sennett. While with Keystone, he was teamed with Chester Conklin to make a series of comedy films. With Swain as \"Ambrose\" and Conklin as the grand mustachioed \"Walrus\", they performed these roles in several films including The Battle of Ambrose and Walrus and Love, Speed and Thrills, both made in 1915.\n\nBesides these comedies, the two appeared together in a variety of other films, 26 all told, and they also appeared separately and/or together in films starring Mabel Normand, Charles Chaplin, Roscoe Arbuckle and most of the rest of the roster of Keystone players.\n\nSwain later took his Ambrose character with him to the L-KO Kompany. Having already worked with Charles Chaplin at Keystone, Swain began working with him again at First National in 1921, appearing in The Idle Class, Pay Day, and The Pilgrim. He is also remembered for his large supporting role as Big Jim McKay in the 1925 film The Gold Rush, for United Artists, written by and starring Chaplin.\n\nFor his contribution to the motion picture industry, Mack Swain received a star on the Hollywood Walk of Fame, at 1500 Vine Street.",
        "birthday": "1876-02-15",
        "deathday": "1935-08-25",
        "gender": 2,
        "homepage": null,
        "id": 14435,
        "imdb_id": "nm0841501",
        "known_for_department": "Acting",
        "name": "Mack Swain",
        "place_of_birth": "Salt Lake City, Utah, USA",
        "popularity": 0.1992,
        "profile_path": "/xYULwPUrtqZz50Eaiz3BeZP83iq.jpg"
    }
}