{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lfMtVr5hkFeGy4dMaEf3XUQr76d.jpg",
                "genre_ids": [
                    12,
                    80,
                    18
                ],
                "id": 433498,
                "original_language": "en",
                "original_title": "Papillon",
                "overview": "Henri “Papillon” Charrière, a safecracker from the Parisian underworld, is wrongfully convicted and sentenced to life imprisonment in the penal colony of French Guiana, where he forges a strong friendship with Louis Dega, a counterfeiter who needs his protection.",
                "popularity": 5.3735,
                "poster_path": "/ahF5c6vyP8HWMqIwlhecbRALkjq.jpg",
                "release_date": "2017-09-07",
                "title": "Papillon",
                "video": false,
                "vote_average": 7.324,
                "vote_count": 2031,
                "character": "Commandant",
                "credit_id": "5be686a30e0a263c0000b46c",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Nicholas Asbury (born 13 February 1971) is a British actor and author. He won an Olivier Award as part of the Royal Shakespeare Company's complete cycle of Shakespeare's history plays in 2009 and is known for television roles such as Winston Churchill in the BBC's 37 Days, Mr. Angel in Hugh Laurie's Why Didn't They Ask Evans?, and Jim in the BAFTA award-winning Alma's Not Normal.\n\nAsbury attended Hereford Cathedral School, then Dartington College of Arts. In 1998 he performed at The Watermill Theatre, before joining the ensemble of the Royal Shakespeare Company from 1999 until 2008. He subsequently acted in the all-male Shakespearean troupe Propeller, for whom he also composed music. A diary of his experiences acting in Propeller's 2011/12 productions of Henry V and The Winter's Tale was featured as a series in The Guardian.\n\nHis first book, Exit Pursued by a Badger, is a record of his involvement in Michael Boyd's The Histories Cycle with the RSC. It won the Michael Meyer Award from The Society of Authors in 2011. He has since appeared in television series such as The Inbetweeners, Chewing Gum, Sherlock, and Alma's Not Normal. His second book, White Hart, Red Lion, is a work of travel literature revisiting the subject of Shakespeare's history plays through the locations that feature in them.",
        "birthday": "1971-02-13",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1443861,
        "imdb_id": "nm1477786",
        "known_for_department": "Acting",
        "name": "Nicholas Asbury",
        "place_of_birth": "Hereford, England, UK",
        "popularity": 0.1093,
        "profile_path": "/wuhSNWzSQjcSXgYhdlR8WqmQrjj.jpg"
    }
}