{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cGnaZm6EQOJESde3Vv4v53Zk4gN.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 626735,
                "original_language": "en",
                "original_title": "Dog",
                "overview": "An army ranger and his dog embark on a road trip along the Pacific Coast Highway to attend a friend's funeral.",
                "popularity": 3.9073,
                "poster_path": "/zHQy4h36WwuCetKS7C3wcT1hkgA.jpg",
                "release_date": "2022-02-17",
                "title": "Dog",
                "video": false,
                "vote_average": 7.309,
                "vote_count": 1670,
                "character": "Holding Cell Prisoner",
                "credit_id": "618c8427e93e95008e9be94e",
                "order": 33
            },
            {
                "adult": false,
                "backdrop_path": "/sOhtC4cmaYPOlcjXCWxxrx2NKKn.jpg",
                "genre_ids": [
                    18
                ],
                "id": 451915,
                "original_language": "en",
                "original_title": "Beautiful Boy",
                "overview": "After he and his first wife separate, journalist David Sheff struggles to help their teenage son, who goes from experimenting with drugs to becoming devastatingly addicted to methamphetamine.",
                "popularity": 7.884,
                "poster_path": "/zuw4QtOpOO0Ib1f866SG9WmduMN.jpg",
                "release_date": "2018-10-12",
                "title": "Beautiful Boy",
                "video": false,
                "vote_average": 7.552,
                "vote_count": 2707,
                "character": "Meeting Leader",
                "credit_id": "61dfb368a6fdaa0096096df6",
                "order": 32
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Tom Beyer won a prestigious Ovation Award in Los Angeles for his stage performance at the Mark Taper Forum in \"The Cider House Rules,\" directed by Tom Hulce and adapted by Peter Parnell. He starred opposite Tony Award Winner Alice Ripley in \"Gentlemen Prefer Blondes\" at Reprise! in Los Angeles. Jillian Armenante directed him in the premiere of her farce \"In Flagrante Gothicto,\" in which he portrayed a 12-year-old french girl. (Garland Award, Best Ensemble in a Comedy.) He is an award-winning theatre director, and has received critical acclaim for his stage adaptations of classical works such as \"The Canterbury Tales.\"\n\nHe acted on many stages in Seattle, where he also produced and acted in an award-winning production of \"Holy Days\" written by Sally Nemeth, and spent three years as a company member of Seattle's Book-It Repertory Theatre, adapting literature into theatre. After a brief stint in his New York homeland, he moved to Los Angeles for \"The Cider House Rules\" and shortly thereafter was directed by Roger Rees in Shakespeare's \"The Merry Wives of Windsor\" at the Old Globe Theatre in San Diego. Tom is also a tap-dancer, a rusty classical organist, a dabbler on the piano, a marathon runner, and has a purple belt in Karate.",
        "birthday": "1965-06-14",
        "deathday": null,
        "gender": 2,
        "homepage": "https://tantor.com/narrator/tom-beyer.html",
        "id": 1444798,
        "imdb_id": "nm0962120",
        "known_for_department": "Acting",
        "name": "Tom Beyer",
        "place_of_birth": "New York City, New York",
        "popularity": 0.1271,
        "profile_path": "/kBQ9bqns4ipSMQbbkCkS7UBRJjo.jpg"
    }
}