{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9xzVKUGbVKrrgwlmshJ8SxI5mL7.jpg",
                "genre_ids": [
                    9648,
                    80,
                    53
                ],
                "id": 963,
                "original_language": "en",
                "original_title": "The Maltese Falcon",
                "overview": "A private detective takes on a case that involves him with three eccentric criminals, a beautiful liar, and their quest for a priceless statuette.",
                "popularity": 5.3716,
                "poster_path": "/bf4o6Uzw5wqLjdKwRuiDrN1xyvl.jpg",
                "release_date": "1941-10-18",
                "title": "The Maltese Falcon",
                "video": false,
                "vote_average": 7.712,
                "vote_count": 1775,
                "character": "Lt. of Detectives Dundy",
                "credit_id": "52fe4294c3a36847f8029a37",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/sj5R5SGor3YMFBuabMj8gPbyBmh.jpg",
                "genre_ids": [
                    12,
                    18,
                    37
                ],
                "id": 3090,
                "original_language": "en",
                "original_title": "The Treasure of the Sierra Madre",
                "overview": "Two jobless Americans convince a prospector to travel to the mountains of Mexico with them in search of gold. But the hostile wilderness, local bandits, and greed all get in the way of their journey.",
                "popularity": 2.4311,
                "poster_path": "/pWcst7zVbi8Z8W6GFrdNE7HHRxL.jpg",
                "release_date": "1948-01-15",
                "title": "The Treasure of the Sierra Madre",
                "video": false,
                "vote_average": 8.0,
                "vote_count": 1264,
                "character": "Pat McCormick",
                "credit_id": "52fe4385c3a36847f805a53b",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ernest Barton MacLane",
            "Barton Mac Lane",
            "Barton Maclane",
            "Barton McLane",
            "Бартон Маклейн"
        ],
        "biography": "Barton MacLane graduated from Wesleyan University, where he displayed a notable aptitude for sports, in particular football and basketball. Not surprisingly, his physical prowess led to an early role in The Quarterback (1926) with Richard Dix. MacLane once commented that, as an actor, he needed to have the physical strength to tear the bad guys \"from limb to limb\", if necessary. Ironically, it was usually Barton himself who was destined to be at the end of a hiding (when not getting shot, instead), typically as snarling henchmen, outlaws and other assorted dubious or abrasive types throughout most of his 40-year acting career. In fact, Barton became so typecast that his name was for a time used proverbially, to generally describe a shouting, hard-nosed ruffian.\n\nAfter training at the American Academy of Dramatic Arts, MacLane joined a stock company in Brooklyn. In 1927 he had his first part on Broadway, a brief moment as an assistant district attorney, in the melodrama \"The Trial of Mary Dugan\". He then played a small featured role as a police officer in \"Subway Express\" (1929-30), a drama enacted in the interior of a subway car. In mid-1932 MacLane tried his hand at writing his own starring vehicle for the stage, entitled \"Rendezvous\". While the play closed after just 21 performances, it led to a contract with Warner Brothers.\n\nBarton had already appeared in bit roles for Paramount at their Astoria Studios, including The Marx Brothers' debut film The Cocoanuts (1929). He portrayed mobster Brad Collins in 'G' Men (1935) (with James Cagney), which set the tone for most of his future assignments. Brawny, with squinty eyes and a rasping voice, MacLane was the ideal surly tough guy, particularly suitable for westerns and the type of films noir Warner Brothers excelled at. He was often cast as cops, be they bent or honest. Some of his most representative performances include gangster Al Kruger in Bullets or Ballots (1936), which won him some of the best critical notices of his career; outlaw Jack Slade in Western Union (1941); crooked construction boss Pat McCormick, who gets beaten up by Humphrey Bogart and Tim Holt over past-due wages in The Treasure of the Sierra Madre (1948); hard-nosed cops Detective Dundy in The Maltese Falcon (1941) and Lt. Reece in Kiss Tomorrow Goodbye (1950). MacLane, on loan to Universal, also had a starring role in Prison Break (1938) as an innocent tuna fisherman who is framed for murder. He was prominent as a tough but sympathetic cop, foil to sleuthing girl reporter Glenda Farrell in the \"Torchy Blaine\" series of the mid- to late 1930s. In the 1960s Barton began to cultivate a good-guy image as Marshal Frank Caine in the NBC western series Outlaws (1960) as well as showing up in a small recurring role as Air Force Gen. Martin Peterson in I Dream of Jeannie (1965).\n\nBarton was married to the actress Charlotte Wynters, who appeared with him in six of his films. When not on the set, the couple spent time on their 2000-acre cattle ranch in Madera County, California.\n\nFor his work in television, Barton has a star on the Hollywood Walk of Fame.",
        "birthday": "1902-12-25",
        "deathday": "1969-01-01",
        "gender": 2,
        "homepage": null,
        "id": 14451,
        "imdb_id": "nm0533692",
        "known_for_department": "Acting",
        "name": "Barton MacLane",
        "place_of_birth": "Columbia, South Carolina, USA",
        "popularity": 0.3366,
        "profile_path": "/5lrfsloSoznUSZWf9NYywYRLtDW.jpg"
    }
}