{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uR0FopHrAjDlG5q6PZB07a1JOva.jpg",
                "genre_ids": [
                    16,
                    878,
                    28
                ],
                "id": 610150,
                "original_language": "ja",
                "original_title": "ドラゴンボール超 スーパーヒーロー",
                "overview": "The Red Ribbon Army, an evil organization that was once destroyed by Goku in the past, has been reformed by a group of people who have created new and mightier Androids, Gamma 1 and Gamma 2, and seek vengeance against Goku and his family.",
                "popularity": 5.8248,
                "poster_path": "/pi0iZOEHeA3ih4p1IwAG4x2DZNH.jpg",
                "release_date": "2022-06-11",
                "title": "Dragon Ball Super: Super Hero",
                "video": false,
                "vote_average": 7.892,
                "vote_count": 2936,
                "character": "Lemo (voice)",
                "credit_id": "62a637ebeb14fa09ddb34d09",
                "order": 14
            },
            {
                "adult": false,
                "backdrop_path": "/wghKvEjM7UzQzQcKnGbDjOyQO13.jpg",
                "genre_ids": [
                    16,
                    12,
                    28,
                    14,
                    10402
                ],
                "id": 900667,
                "original_language": "ja",
                "original_title": "ONE PIECE FILM RED",
                "overview": "Uta — the most beloved singer in the world. Her voice, which she sings with while concealing her true identity, has been described as “otherworldly.” She will appear in public for the first time at a live concert. As the venue fills with all kinds of Uta fans — excited pirates, the Navy watching closely, and the Straw Hats led by Luffy who simply came to enjoy her sonorous performance — the voice that the whole world has been waiting for is about to resound.",
                "popularity": 5.578,
                "poster_path": "/m80kPdrmmtEh9wlLroCp0bwUGH0.jpg",
                "release_date": "2022-08-06",
                "title": "One Piece Film Red",
                "video": false,
                "vote_average": 7.195,
                "vote_count": 1080,
                "character": "Charlotte Katakuri (voice)",
                "credit_id": "63672efe1684f7008aeaf0c9",
                "order": 48
            },
            {
                "adult": false,
                "backdrop_path": "/5nkKy7eEDsXqsxFLJy3GxZhE90J.jpg",
                "genre_ids": [
                    16,
                    14,
                    18,
                    12
                ],
                "id": 476292,
                "original_language": "ja",
                "original_title": "さよならの朝に約束の花をかざろう",
                "overview": "Maquia is a member of a special race called the Iorph who can live for hundreds of years. However, Maquia has always felt lonely despite being surrounded by her people, as she was orphaned from a young age. She daydreams about the outside world, but dares not travel from her home due to the warnings of the clan's chief.  One day the kingdom of Mezarte invades her homeland. They already have what is left of the giant dragons, the Renato, under their control, and now their king wishes to add the immortality to his bloodline.  They ravage the Iorph homeland and kill most of its inhabitants. Caught in the midst of the attack, Maquia is carried off by one of the Renato. It soon dies, and she is left deserted in a forest, now truly alone save for the cries of a single baby off in the distance. Maquia finds the baby in a destroyed village and decides to raise him as her own, naming him Ariel. Although she knows nothing of the human world, how to raise a child that ages much faster than her.",
                "popularity": 2.59,
                "poster_path": "/hL3NqRE2ccR4Y2sYSJTrmalRjrz.jpg",
                "release_date": "2018-02-24",
                "title": "Maquia: When the Promised Flower Blooms",
                "video": false,
                "vote_average": 8.183,
                "vote_count": 667,
                "character": "Izor (voice)",
                "credit_id": "5a32b1a0c3a36814ab01b6f4",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/e6CnfsN7wnhZEMqh5EnCfTDXQ7g.jpg",
                "genre_ids": [
                    28,
                    12,
                    14,
                    16
                ],
                "id": 507569,
                "original_language": "ja",
                "original_title": "劇場版 七つの大罪 天空の囚われ人",
                "overview": "Traveling in search of the rare ingredient, “sky fish”  Meliodas and Hawk arrive at a palace that floats above the clouds. The people there are busy preparing a ceremony, meant to protect their home from a ferocious beast that awakens once every 3,000 years. But before the ritual is complete, the Six Knights of Black—a Demon Clan army—removes the seal on the beast, threatening the lives of everyone in the Sky Palace.",
                "popularity": 0.9589,
                "poster_path": "/63NOOAkaZAK8h93Sg7Ucq6XLJGP.jpg",
                "release_date": "2018-08-18",
                "title": "The Seven Deadly Sins: Prisoners of the Sky",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 1054,
                "character": "Escanor (voice)",
                "credit_id": "5a9355d0c3a36824fd02a0e1",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/gXSpNiP9a5uq0mo1hcfp2PVUsOV.jpg",
                "genre_ids": [
                    28,
                    878,
                    16
                ],
                "id": 503314,
                "original_language": "ja",
                "original_title": "ドラゴンボール超 ブロリー",
                "overview": "Earth is peaceful following the Tournament of Power. Realizing that the universes still hold many more strong people yet to see, Goku spends all his days training to reach even greater heights. Then one day, Goku and Vegeta are faced by a Saiyan called 'Broly' who they've never seen before. The Saiyans were supposed to have been almost completely wiped out in the destruction of Planet Vegeta, so what's this one doing on Earth? This encounter between the three Saiyans who have followed completely different destinies turns into a stupendous battle, with even Frieza (back from Hell) getting caught up in the mix.",
                "popularity": 1.3663,
                "poster_path": "/5vx8zZ7fDsA8KMO6fiVs3pZmNWQ.jpg",
                "release_date": "2018-12-14",
                "title": "Dragon Ball Super: Broly",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 3018,
                "character": "Remo (voice)",
                "credit_id": "5bc12bb992514179c1020aee",
                "order": 15
            },
            {
                "adult": false,
                "backdrop_path": "/iMKviWNREc35F1uPVq0GkRc3OKN.jpg",
                "genre_ids": [
                    16,
                    878
                ],
                "id": 9606,
                "original_language": "ja",
                "original_title": "メトロポリス",
                "overview": "In the midst of societal conflict in the futuristic city of Metropolis, Kenichi and his uncle Shunsaku Ban set out to uncover the mystery behind the first human-like robot, Tima.",
                "popularity": 3.962,
                "poster_path": "/41WtqvaObaYE3RuqgBfQFPV3aV1.jpg",
                "release_date": "2001-05-26",
                "title": "Metropolis",
                "video": false,
                "vote_average": 7.126,
                "vote_count": 505,
                "character": "Marduk Party Member/Policeman/Scientist (voice)",
                "credit_id": "5ec8f06ba35c8e0020e2237e",
                "order": 20
            },
            {
                "adult": false,
                "backdrop_path": "/xPpXYnCWfjkt3zzE0dpCNME1pXF.jpg",
                "genre_ids": [
                    16,
                    28,
                    14,
                    53
                ],
                "id": 635302,
                "original_language": "ja",
                "original_title": "劇場版「鬼滅の刃」無限列車編",
                "overview": "Tanjiro Kamado, joined with Inosuke Hashibira, a boy raised by boars who wears a boar's head, and Zenitsu Agatsuma, a scared boy who reveals his true power when he sleeps, boards the Infinity Train on a new mission with the Fire Hashira, Kyojuro Rengoku, to defeat a demon who has been tormenting the people and killing the demon slayers who oppose it!",
                "popularity": 40.849,
                "poster_path": "/h8Rb9gBr48ODIwYUttZNYeMWeUU.jpg",
                "release_date": "2020-10-16",
                "title": "Demon Slayer -Kimetsu no Yaiba- The Movie: Mugen Train",
                "video": false,
                "vote_average": 8.204,
                "vote_count": 4219,
                "character": "Gyomei Himejima (voice)",
                "credit_id": "5f89be01e9da690039e6d6c9",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Tomokazu “Freedom” Sugita",
            "すぎた ともかず",
            "杉田 智和",
            "توموکازو سوگیتا"
        ],
        "biography": "Tomokazu Sugita is a Japanese voice actor who was born on October 11, 1980 in Saitama, Japan. Previously affiliated with Atomic Monkey, he is now the CEO of AGRS Co., Ltd. His bloodtype is B.\n\nSugita and fellow seiyuu Narita Ken are sometimes referred to as \"brothers\" due to a joke made during Live Pastel Collection 2003. During an Omaera No Tame Darou event, hosts Toshiyuki Morikawa and Nobuyuki Hiyama asked Sugita how they were similar. His answer was that both of them rarely blink, making eye-to-eye contact with either a frightening encounter.\n\nSugita has also had a close friendship with fellow seiyuu Yuichi Nakamura since 2001. Both play male leads in two anime adapted from Key visual novels, Yuichi Aizawa of Kanon and Tomoya Okazaki of Clannad, respectively.\n\nSugita won for \"Best Supporting Actor\" in the Third Seiyu Awards.\n\nOn April 1, 2020, he left Atomic Monkey, where he had belonged for many years, and on October 11, 2019 he established AGRS Co., Ltd., where he serves as the representative director.",
        "birthday": "1980-10-11",
        "deathday": null,
        "gender": 2,
        "homepage": "https://agrs.co.jp/voiceactor/",
        "id": 144655,
        "imdb_id": "nm0837523",
        "known_for_department": "Acting",
        "name": "Tomokazu Sugita",
        "place_of_birth": "Saitama, Japan",
        "popularity": 1.2733,
        "profile_path": "/cv5zuPZySNsHXu24pjKLYCRzJ2J.jpg"
    }
}