{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kIBBeb94FbNfLSljeFUxUoszflb.jpg",
                "genre_ids": [
                    18,
                    10752,
                    36
                ],
                "id": 17295,
                "original_language": "it",
                "original_title": "La battaglia di Algeri",
                "overview": "Paratrooper commander Colonel Mathieu, a former French Resistance fighter during World War II, is sent to Algeria to reinforce efforts to squelch the uprisings of the Algerian War. There he faces Ali la Pointe, a former petty criminal who, as the leader of the Algerian Front de Liberation Nationale, directs terror strategies against the colonial French government occupation. As each side resorts to ever-increasing brutality, no violent act is too unthinkable.",
                "popularity": 2.1462,
                "poster_path": "/2p3AFtOHFvP6OeVMqlnL1zLKOqL.jpg",
                "release_date": "1966-09-08",
                "title": "The Battle of Algiers",
                "video": false,
                "vote_average": 7.872,
                "vote_count": 826,
                "character": "",
                "credit_id": "66d9dce53376a503b6b8d919",
                "order": 5
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/kIBBeb94FbNfLSljeFUxUoszflb.jpg",
                "genre_ids": [
                    18,
                    10752,
                    36
                ],
                "id": 17295,
                "original_language": "it",
                "original_title": "La battaglia di Algeri",
                "overview": "Paratrooper commander Colonel Mathieu, a former French Resistance fighter during World War II, is sent to Algeria to reinforce efforts to squelch the uprisings of the Algerian War. There he faces Ali la Pointe, a former petty criminal who, as the leader of the Algerian Front de Liberation Nationale, directs terror strategies against the colonial French government occupation. As each side resorts to ever-increasing brutality, no violent act is too unthinkable.",
                "popularity": 2.1462,
                "poster_path": "/2p3AFtOHFvP6OeVMqlnL1zLKOqL.jpg",
                "release_date": "1966-09-08",
                "title": "The Battle of Algiers",
                "video": false,
                "vote_average": 7.872,
                "vote_count": 826,
                "credit_id": "57d98077c3a3685342006a03",
                "department": "Production",
                "job": "Production Supervisor"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Hadj Smaine"
        ],
        "biography": "Hadj Smaine Mohamed Seghir, (often credited Hadj Smaine) born October 29, 1932 in Constantine, and died September 6, 2021 in Los Angeles, is an Algerian actor and director.\n\nAt that time, Constantine was considered a place giving great importance to religion, culture, art, and Algerian Arab-Muslim traditions. Hadj Smaine grew up in Constantine with his family and friends who loved art and culture in general; cinema, music, scouting, sports such as swimming in Sidi M'Sid. With his scout friends, Hadj Smaine played sketches inspired by the films they watched in the city's theaters. With friends, they went to the Constantine film club (ex. Université Populaire, Abdelhamid Ben Badis Center currently).\n\nThe Popular University, which was at the same time the conservatory of the city of Constantine, had premises allocated to associations for musicians, for amateur theater, among others for scouts.\n\nThe Popular University also had other administrative functions because it depended on a state structure; the French Colonial Administration.\n\nOver time, Hadj Smaine had joined the theater troupe Les Milles et une Nuits with other friends of scouting; Hassan Belhadj (1st director of Algerian Cinema, great actor, patriot and former collaborator of M'Hamed Yazid) and Abdelkrim Menaï (former scout of Muslim scouts). After several years of theater practice, Hadj Smaine left the troupe Les Milles et Une Nuit in order to create a theater without \"sketch\", similar to that which was practiced in Europe and in the Arab world (in Egypt more particularly).\n\nAmong others, Hadj Smaine was a member of the following theater troupes: Les Milles et Une Nuits, Les Compagnons du Vieux Rocher, The Algerian theater team before Independence (from 1957 to 1958), The troupe of the Youth House of Hussein Dey (before 1962), Les Capucines d'Alger (before 1962), The National Theater of Algeria (at Independence).\n\nHe died on September 6, 2021 in Los Angeles (USA).",
        "birthday": "1932-10-29",
        "deathday": "2021-09-06",
        "gender": 2,
        "homepage": null,
        "id": 1446515,
        "imdb_id": "nm1350537",
        "known_for_department": "Acting",
        "name": "Hadj Smaine Mohamed Seghir",
        "place_of_birth": "Constantine, Algérie",
        "popularity": 0.0749,
        "profile_path": "/27OP1y0lfHpGV5Spu1b8BUA1Umx.jpg"
    }
}