{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mDfJG3LC3Dqb67AZ52x3Z0jU0uB.jpg",
                "genre_ids": [
                    12,
                    28,
                    878
                ],
                "id": 299536,
                "original_language": "en",
                "original_title": "Avengers: Infinity War",
                "overview": "As the Avengers and their allies have continued to protect the world from threats too large for any one hero to handle, a new danger has emerged from the cosmic shadows: Thanos. A despot of intergalactic infamy, his goal is to collect all six Infinity Stones, artifacts of unimaginable power, and use them to inflict his twisted will on all of reality. Everything the Avengers have fought for has led up to this moment - the fate of Earth and existence itself has never been more uncertain.",
                "popularity": 29.705,
                "poster_path": "/7WsyChQLEftFiDOVTGkv3hFpyyt.jpg",
                "release_date": "2018-04-25",
                "title": "Avengers: Infinity War",
                "video": false,
                "vote_average": 8.235,
                "vote_count": 30938,
                "character": "Gamora's Mother",
                "credit_id": "5ae3c6010e0a2676c3000adc",
                "order": 45
            },
            {
                "adult": false,
                "backdrop_path": "/7RyHsO4yDXtBv1zUU3mTpHeQ0d5.jpg",
                "genre_ids": [
                    12,
                    878,
                    28
                ],
                "id": 299534,
                "original_language": "en",
                "original_title": "Avengers: Endgame",
                "overview": "After the devastating events of Avengers: Infinity War, the universe is in ruins due to the efforts of the Mad Titan, Thanos. With the help of remaining allies, the Avengers must assemble once more in order to undo Thanos' actions and restore order to the universe once and for all, no matter what consequences may be in store.",
                "popularity": 16.7585,
                "poster_path": "/ulzhLuWrPK07P1YkdWQLZnQh1JL.jpg",
                "release_date": "2019-04-24",
                "title": "Avengers: Endgame",
                "video": false,
                "vote_average": 8.237,
                "vote_count": 26720,
                "character": "Gamora Reader",
                "credit_id": "5e85df36691cd500125969d3",
                "order": 99
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Ameenah Kaplan (born June 17, 1974) is an American actress, musician and choreographer.\n\nKaplan was born on June 17, 1974 in Denver, Colorado. She was raised in Atlanta, where she graduated from Avondale High School for the Performing Arts, and from New York, where she attended Tisch School of the Arts at New York University and trained in their experimental theater wing. She is a graduate of the Academy of Art University film school.\n\nShe has been a drummer since age 12 and was a member of the original American cast of STOMP. She is the west coast drum coach for Blue Man Group. She has played drums and/or percussion with Ty Taylor of Vintage Trouble, Adam Lambert, Alisan Porter, Macy Gray, Rihanna, Taylor Hicks, Lisa Haley and the Zydecats, Drake, Leslie Odom Jr., Scarlett Cherry, and the Twinz. She has performed on Oprah, Conan O’Brien, The Academy Awards, the AMA’s, the Grammy’s, and the Tonight Show.\n\nShe is the Resident Director of The Lion King on Broadway. Her current bands are : Sin City (hip-hop) and KULA (rock) and BAST .",
        "birthday": "1974-06-17",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1448180,
        "imdb_id": "nm0438188",
        "known_for_department": "Acting",
        "name": "Ameenah Kaplan",
        "place_of_birth": "Denver, Colorado, USA",
        "popularity": 0.0807,
        "profile_path": "/kECeBrZmUeuo2vbMY86ars99WvV.jpg"
    }
}