{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sIJTdyF6JFbIz5mENPpeSlCKYyB.jpg",
                "genre_ids": [
                    14,
                    35,
                    10749
                ],
                "id": 59436,
                "original_language": "en",
                "original_title": "Midnight in Paris",
                "overview": "While on a trip to Paris with his fiancée's family, a nostalgic screenwriter finds himself mysteriously going back to the 1920s every day at midnight.",
                "popularity": 5.2502,
                "poster_path": "/4wBG5kbfagTQclETblPRRGihk0I.jpg",
                "release_date": "2011-05-11",
                "title": "Midnight in Paris",
                "video": false,
                "vote_average": 7.521,
                "vote_count": 7491,
                "character": "Juan Belmonte",
                "credit_id": "52fe4990c3a36847f81a0c31",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Daniel Lundh is a Franco-Swedish actor and writer.\n\nDaniel Lundh was born in Malmö, of a Swedish father and a French mother. His father, Lennart Lundh, is a fine-art dealer and former actor.\n\nAt the age of seven, the family moved to Paris, where he attended Montessori schooling. In addition to Swedish and French, he became fluent in English and Spanish.\n\nAfter graduation, he moved to New York City to pursue theater studies at the Lee Strasberg Theater Institute. His teacher, Chad Burton, took him under his wing by allowing him to attend sessions at the mythical Actors Studio. He then trained at HB Studio with Salem Ludwig. Back in Paris, he studied for two years at Cours Florent, notably with Lesley Chatterley. He also regularly trained with Bela Grushka and Jordan Beswick C.S.A.\n\nThereafter, he left for London, where he remained for three years. He appeared in numerous fringe plays and series like Dream Team, Hollyoaks and Mile High.\n\nIn 2006, he obtained his first film role in O Jerusalem, directed by Elie Chouraqui, alongside Ian Holm, JJ Feild and Patrick Bruel.\n\nIn 2007, he starred in Délice Paloma, by Nadir Mokneche, with co-stars Aylin Prandi and Biyouna. The film was a success and the actor received critical acclaim for his role as a troubled youth in search of his father. His performance earned him a nomination for the César for Most Promising Actor.\n\nIn 2008, he successively worked in House of Saddam, a BBC and HBO co-production on the life of Saddam Hussein, and Les Héritières, for France 3. The TV film, in two parts, is an adaptation of King Lear by Shakespeare, set in Corsica, with Jacques Weber, Amira Casar and Jean Benguigui. There, he played the role of Massimo, the bastard and vengeful son.\n\nIn 2010, he acted in 22 Bullets, a thriller about the Marseille mob, directed by Richard Berry, alongside Jean Reno, Kad Merad, Jean-Pierre Darroussin, and Marina Fois. The film was produced by EuropaCorp.\n\nIn 2011, he played Juan Belmonte in Woody Allen's Midnight in Paris.\n\nIn parallel to his acting career, he devotes himself to writing and music.\n\nIn 2017, he starred in Netflix's hit Spanish series, Morocco: Love in Times of War.\n\nSource: Article \"Daniel Lundh\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1994-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 144957,
        "imdb_id": "nm1563607",
        "known_for_department": "Acting",
        "name": "Daniel Lundh",
        "place_of_birth": "Malmö, Sweden",
        "popularity": 0.2335,
        "profile_path": "/nyzXolo9qis7t6pENMxc2BcXWA0.jpg"
    }
}