{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/aheSIG4h3JNxWeDvdb1NxKzgjaM.jpg",
                "genre_ids": [
                    36,
                    10752,
                    18,
                    12
                ],
                "id": 967,
                "original_language": "en",
                "original_title": "Spartacus",
                "overview": "The rebellious Thracian Spartacus, born and raised a slave, is sold to Gladiator trainer Batiatus. After weeks of being trained to kill for the arena, Spartacus turns on his owners and leads the other slaves in rebellion. As the rebels move from town to town, their numbers swell as escaped slaves join their ranks. Under the leadership of Spartacus, they make their way to southern Italy, where they will cross the sea and return to their homes.",
                "popularity": 6.2092,
                "poster_path": "/r0Fgg1GyZgzokaiw2HFQv3oPaL2.jpg",
                "release_date": "1960-10-13",
                "title": "Spartacus",
                "video": false,
                "vote_average": 7.54,
                "vote_count": 2262,
                "character": "David",
                "credit_id": "52fe4294c3a36847f8029d6b",
                "order": 12
            },
            {
                "adult": false,
                "backdrop_path": "/e0tZ5Kjg5mukFGcxEddCZymAxH4.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 22527,
                "original_language": "en",
                "original_title": "The Wrong Man",
                "overview": "In 1953, an innocent man named Christopher Emmanuel \"Manny\" Balestrero is arrested after being mistaken for an armed robber.",
                "popularity": 2.2755,
                "poster_path": "/pO5XR2R56RAbVjdks9gGGn0fbOa.jpg",
                "release_date": "1956-12-22",
                "title": "The Wrong Man",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 583,
                "character": "Detective Lt. Bowers",
                "credit_id": "52fe4444c3a368484e0196a3",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Harold Hochstein",
            "Harold Stone"
        ],
        "biography": "From Wikipedia, the free encyclopedia.  Harold J. Stone (March 3, 1913 – November 18, 2005) was an American film and television character actor.\n\nBorn Harold Hochstein to a Jewish acting family, he began his career on Broadway in 1939 and appeared in five plays in the next six years, including One Touch of Venus and Stalag 17, following which he made his motion picture debut in the Alan Ladd film noir classic The Blue Dahlia (1946). He went on to work in small but memorable roles in such films as The Harder They Fall with Humphrey Bogart (1956), Alfred Hitchcock's The Wrong Man (1956), Somebody Up There Likes Me (1956), Spartacus (1960) and Girl Happy (1965). Although he would go on to perform secondary roles in a number of films, he became a recognizable face to television viewers for his more than 150 guest appearances on numerous shows dating from the 1950s to the early 1980s including but not limited to The Restless Gun, United States Marshal, The Barbara Stanwyck Show, I Spy, The Virginian, Griff, The Untouchables, The Twilight Zone, Hogan's Heroes and Get Smart. In the 1961-1962 season, he appeared three times in Stephen McNally's ABC crime drama Target: The Corruptors!. In 1963, he appeared with Marsha Hunt in the ABC medical drama Breaking Point in an episode which was nominated for an Emmy Award for writing. In Sept. 1964,Stone appeared in popular TV series, Bonanza (in an episode entitled -'The Hostage').Stone himself was nominated for an Emmy for Outstanding Single Performance by an Actor in a Leading Role for his role in The Nurses.\n\nIn the 1960s and 1970s, while continuing to work in television, most notably as a regular on 1973's short-lived Bridget Loves Bernie, Stone returned to the stage, directing several off-Broadway and Broadway productions, including Ernest in Love and Charley's Aunt.\n\n \n\nDescription above from the Wikipedia article Harold J. Stone, licensed under CC-BY-SA, full list of contributors on Wikipedia.   ",
        "birthday": "1913-03-03",
        "deathday": "2005-11-18",
        "gender": 2,
        "homepage": null,
        "id": 14505,
        "imdb_id": "nm0831905",
        "known_for_department": "Acting",
        "name": "Harold J. Stone",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.3834,
        "profile_path": "/uMigCHh4dNbXvMsj6ZWfQS89TEL.jpg"
    }
}