{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/aheSIG4h3JNxWeDvdb1NxKzgjaM.jpg",
                "genre_ids": [
                    36,
                    10752,
                    18,
                    12
                ],
                "id": 967,
                "original_language": "en",
                "original_title": "Spartacus",
                "overview": "The rebellious Thracian Spartacus, born and raised a slave, is sold to Gladiator trainer Batiatus. After weeks of being trained to kill for the arena, Spartacus turns on his owners and leads the other slaves in rebellion. As the rebels move from town to town, their numbers swell as escaped slaves join their ranks. Under the leadership of Spartacus, they make their way to southern Italy, where they will cross the sea and return to their homes.",
                "popularity": 6.2092,
                "poster_path": "/r0Fgg1GyZgzokaiw2HFQv3oPaL2.jpg",
                "release_date": "1960-10-13",
                "title": "Spartacus",
                "video": false,
                "vote_average": 7.54,
                "vote_count": 2262,
                "character": "Laelius",
                "credit_id": "52fe4294c3a36847f8029d8b",
                "order": 20
            },
            {
                "adult": false,
                "backdrop_path": "/cZgUATpU4NDlsfGj7sRriKJEiLB.jpg",
                "genre_ids": [
                    12,
                    16,
                    35,
                    10751
                ],
                "id": 12230,
                "original_language": "en",
                "original_title": "One Hundred and One Dalmatians",
                "overview": "When a litter of dalmatian puppies are abducted by the minions of Cruella De Vil, the parents must find them before she uses them for a diabolical fashion statement.",
                "popularity": 6.0862,
                "poster_path": "/v62BSVTUmFoVLW3v0ffXo7kzhL9.jpg",
                "release_date": "1961-01-25",
                "title": "One Hundred and One Dalmatians",
                "video": false,
                "vote_average": 7.172,
                "vote_count": 6461,
                "character": "Horace / Inspector Craven (voice)",
                "credit_id": "52fe44cf9251416c75041a91",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Frederic Worlock",
            "Fred Worlock"
        ],
        "biography": "Frederick Worlock was a British-American actor. He is known for his work in various films during the 1940s and 1950s, and as the voice of Horace in One Hundred and One Dalmatians. On stage, he made his début in 1906 in Henry V in Bristol and acted in four productions in London before moving to the United States in the 1920s, where he appeared in Broadway productions between 1923 and 1954. From 1938 to 1966, Worlock appeared as a supporting actor in films including Man Hunt, Dr. Jekyll and Mr. Hyde, How Green Was My Valley, The Imperfect Lady, Singapore, The Lone Wolf in London, Love from a Stranger, Ruthless, Joan of Arc, Spartacus, One Hundred and One Dalmatians (voice-over), and Spinout. He appeared in a number of the Sherlock Holmes films starring Basil Rathbone in the 1940s. The diginfied-looking British actor often portrayed \"professorial roles, some benign, some villainous\". Worlock died from cerebral ischemia in 1973, at the age of 86.",
        "birthday": "1886-12-14",
        "deathday": "1973-08-01",
        "gender": 2,
        "homepage": null,
        "id": 14509,
        "imdb_id": "nm0941520",
        "known_for_department": "Acting",
        "name": "Frederick Worlock",
        "place_of_birth": "London, England, UK",
        "popularity": 0.1797,
        "profile_path": "/8i21iKKMvqDxxqzYT1MW06FOAJ4.jpg"
    }
}