{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/aheSIG4h3JNxWeDvdb1NxKzgjaM.jpg",
                "genre_ids": [
                    36,
                    10752,
                    18,
                    12
                ],
                "id": 967,
                "original_language": "en",
                "original_title": "Spartacus",
                "overview": "The rebellious Thracian Spartacus, born and raised a slave, is sold to Gladiator trainer Batiatus. After weeks of being trained to kill for the arena, Spartacus turns on his owners and leads the other slaves in rebellion. As the rebels move from town to town, their numbers swell as escaped slaves join their ranks. Under the leadership of Spartacus, they make their way to southern Italy, where they will cross the sea and return to their homes.",
                "popularity": 6.2092,
                "poster_path": "/r0Fgg1GyZgzokaiw2HFQv3oPaL2.jpg",
                "release_date": "1960-10-13",
                "title": "Spartacus",
                "video": false,
                "vote_average": 7.54,
                "vote_count": 2262,
                "character": "Caius",
                "credit_id": "52fe4294c3a36847f8029d87",
                "order": 19
            },
            {
                "adult": false,
                "backdrop_path": "/qQGHkmLWPcMGkKws78pFh14SzUo.jpg",
                "genre_ids": [
                    18,
                    36,
                    10749
                ],
                "id": 8095,
                "original_language": "en",
                "original_title": "Cleopatra",
                "overview": "Determined to hold on to the throne, Cleopatra seduces the Roman emperor Julius Caesar. When Caesar is murdered, she redirects her attentions to his general, Marc Antony, who vows to take power—but Caesar’s successor has other plans.",
                "popularity": 5.2417,
                "poster_path": "/bj7rUGUewofA9cpHt1h36gvDFfy.jpg",
                "release_date": "1963-06-12",
                "title": "Cleopatra",
                "video": false,
                "vote_average": 7.04,
                "vote_count": 800,
                "character": "Cassius",
                "credit_id": "52fe4493c3a36847f809df39",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "John Glen Hoyt",
            "John McArthur Hoysradt"
        ],
        "biography": "John Hoyt was an American film, theatre, and television actor, October 5, 1905 – September 15, 1991. He began his acting career on Broadway, later appearing in numerous films and television series.\n\nHe is perhaps best known for his roles in the films The Lawless (1950), When Worlds Collide (1951), Julius Caesar (1953), Blackboard Jungle (1955), Spartacus (1960), Cleopatra (1963), The Outer Limits (1964), Flesh Gordon (1974), and the television series Gimme a Break! (1981-87).\n\nHoyt was born John McArthur Hoysradt in Bronxville, New York, the son of Warren J. Hoysradt, an investment banker, and his wife, Ethel Hoysradt, née Wolf. He attended the Hotchkiss School and Yale University, where he served on the editorial board of campus humor magazine The Yale Record. He received a bachelor's and a master's degree from Yale. He worked as a history instructor at the Groton School for two years.\n\nHoyt shortened his surname in 1945, the year before his film debut in O.S.S. He became a familiar face in film noir and played the strict Principal Warneke in the 1955 film Blackboard Jungle, starring Glenn Ford. He played an industrialist in the 1951 film When Worlds Collide. Hoyt appeared in one Shakespearean film: MGM's Julius Caesar, reprising the role of Decius Brutus (or Decimus Junius Brutus Albinus), whom he had played in the 1937 Mercury Theatre production. In 1952, he played Cato in Androcles and the Lion. In 1953, he portrayed Elijah in the biblical film Sins of Jezebel. He had featured roles in the big-budget sixties epics Spartacus and Cleopatra.",
        "birthday": "1905-10-05",
        "deathday": "1991-09-15",
        "gender": 2,
        "homepage": null,
        "id": 14508,
        "imdb_id": "nm0398466",
        "known_for_department": "Acting",
        "name": "John Hoyt",
        "place_of_birth": "Bronxville, New York, USA",
        "popularity": 0.5117,
        "profile_path": "/rtm0wKVwtsn8dyBHPQB9jWlSIcT.jpg"
    }
}