{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/aheSIG4h3JNxWeDvdb1NxKzgjaM.jpg",
                "genre_ids": [
                    36,
                    10752,
                    18,
                    12
                ],
                "id": 967,
                "original_language": "en",
                "original_title": "Spartacus",
                "overview": "The rebellious Thracian Spartacus, born and raised a slave, is sold to Gladiator trainer Batiatus. After weeks of being trained to kill for the arena, Spartacus turns on his owners and leads the other slaves in rebellion. As the rebels move from town to town, their numbers swell as escaped slaves join their ranks. Under the leadership of Spartacus, they make their way to southern Italy, where they will cross the sea and return to their homes.",
                "popularity": 6.2092,
                "poster_path": "/r0Fgg1GyZgzokaiw2HFQv3oPaL2.jpg",
                "release_date": "1960-10-13",
                "title": "Spartacus",
                "video": false,
                "vote_average": 7.54,
                "vote_count": 2262,
                "character": "Claudia Marius",
                "credit_id": "52fe4294c3a36847f8029d73",
                "order": 14
            },
            {
                "adult": false,
                "backdrop_path": "/y3zUOMWRoI2vC4ck2GBJyFWhzyA.jpg",
                "genre_ids": [
                    35,
                    10751,
                    10749
                ],
                "id": 9820,
                "original_language": "en",
                "original_title": "The Parent Trap",
                "overview": "Hallie Parker and Annie James are identical twins who were separated at a young age due to their parents' divorce. Unbeknownst to their parents, the girls are sent to the same summer camp, where they meet, discover the truth about their relationship, and come up with a plan to switch places in an effort to reunite their mother and father.",
                "popularity": 13.2463,
                "poster_path": "/p4dGmi8u9W0HHyVXcgWPoiFfKTF.jpg",
                "release_date": "1998-07-28",
                "title": "The Parent Trap",
                "video": false,
                "vote_average": 7.218,
                "vote_count": 4348,
                "character": "Vicki Blake",
                "credit_id": "5aaed45692514116c002bff7",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Barnes' initial appearance on television was in the episode \"The Man Who Beat Lupo\" on Ford Theatre. She made guest appearances on many television series, including the ABC/Warner Bros. programs 77 Sunset Strip and Maverick, CBS's Have Gun - Will Travel, What's My Line, and the crime drama Richard Diamond, Private Detective. In 1960-61, she guest-starred on The Untouchables episode \"90 Proof Dame\" as the wife of a French exporter of brandy.\n\nBarnes appeared as Kate Henniger, with Bing Russell and Arthur Space in the 1958 episode \"Ghost Town\" of the ABC/WB Western series Colt .45, starring Wayde Preston. In 1959, she portrayed Lola in the NBC detective series 21 Beacon Street.\n\nIn the 1960s, Barnes worked for producer Martin Ransohoff and appeared in episodes of his The Beverly Hillbillies (\"Elly Goes to School\" and \"The Clampett Look\") and was billed as special guest-star. Barnes played Peter Falk's former wife on the 1965–1966 CBS series The Trials of O'Brien and was host of the ABC daytime talk show Dateline: Hollywood in 1967.\n\nShe was also a frequent panelist in the early years of the syndicated version of What's My Line?. On December 19, 1972, Barnes appeared on The Merv Griffin Show with Joan Fontaine, Zsa Zsa Gabor and Dan Martino (founder of the Dan Martino School for Men).\n\nBarnes moved to Los Angeles soon after finishing her education, and took up a contract with Columbia Pictures. She went on to have roles in more than 20 films. Among her most remembered roles is the snooty Gloria Upson in the film Auntie Mame, which earned her a Golden Globe Award nomination for New Star of the Year. Barnes became the 13th actress to play Jane when she appeared in Tarzan, the Ape Man, with Denny Miller as Tarzan.\n\nIn Disney's original 1961 version of The Parent Trap starring Hayley Mills, Barnes played gold-digger Vicki Robinson, who temporarily comes between Maureen O'Hara and Brian Keith. In the 1998 remake starring Lindsay Lohan, she played Vicki Blake, the mother of the child-hating gold-digger and fiancee Meredith Blake (Elaine Hendrix). As well, she appeared in The War Wagon, a western movie starring John Wayne and Kirk Douglas.\n\nBarnes was also a writer and columnist. In 1973, she told newspaper columnist Dick Kleiner that she liked writing because \"it is something you do yourself. With acting, if you win an Oscar or an Emmy, you have to thank everybody. If you write a book, it is completely your own.\"\n\nShe wrote a book, titled Starting from Scratch, about home decorating and several novels, including The Deceivers, Who Is Carla Hart?, Pastora, and Silverwood. She wrote a weekly book review for the Los Angeles Times, and her column \"Touching Home\" was carried by The Chicago Tribune and the New York News Syndicate.",
        "birthday": "1934-11-15",
        "deathday": "2022-04-29",
        "gender": 1,
        "homepage": null,
        "id": 14506,
        "imdb_id": "nm0055645",
        "known_for_department": "Acting",
        "name": "Joanna Barnes",
        "place_of_birth": "Boston, Massachusetts, USA",
        "popularity": 0.3217,
        "profile_path": "/9wGu4Dg1L5dDFPAjjk8CoA8xjN4.jpg"
    }
}