{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wDLgGI6Rswo30YkWoM6TGq0VWVy.jpg",
                "genre_ids": [
                    35,
                    18,
                    14,
                    10749
                ],
                "id": 13198,
                "original_language": "en",
                "original_title": "Wristcutters: A Love Story",
                "overview": "Zia, distraught over breaking up with his girlfriend, decides to end it all. Unfortunately, he discovers that there is no real ending, only a run-down afterlife that is strikingly similar to his old one, just a bit worse. Discovering that his ex-girlfriend has also \"offed\" herself, he sets out on a road trip to find her.",
                "popularity": 4.1179,
                "poster_path": "/qModiIR60IMLP28ruGZluQOtsOj.jpg",
                "release_date": "2007-10-19",
                "title": "Wristcutters: A Love Story",
                "video": false,
                "vote_average": 6.966,
                "vote_count": 580,
                "character": "Kamakaze Pizza Patron",
                "credit_id": "65cfa168fdf8b7018667fa4a",
                "order": 29
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Azazel Jacobs is an American film director and screenwriter, known for his acclaimed features such as The GoodTimesKid (2005), Momma's Man (2008), Terri (2011), The Lovers (2017), French Exit (2020), and His Three Daughters (2023).\n\nRaised in a Jewish family in Manhattan, Jacobs pursued his passion for film, earning degrees from SUNY Purchase and the AFI Conservatory. His early work, The GoodTimesKid, gained a cult following, while Momma's Man was hailed as \"Independent Film defined\" by The New York Times. Terri, starring John C. Reilly, premiered at Sundance and garnered international recognition.\n\nJacobs further showcased his talent by directing two seasons of the SKY/HBO show, Doll & Em. In 2017, he wrote and directed The Lovers, released by A24, starring Debra Winger and Tracy Letts. The film's screenplay earned him an Independent Spirit Award nomination.\n\nIn 2020, Jacobs directed French Exit, based on Patrick deWitt's novel, featuring Michelle Pfeiffer in a role Variety deemed unforgettable. The film received multiple award nominations, including a Golden Globe, and won Best Actress at the Canadian Screen Awards.\n\nHis latest film, His Three Daughters, premiered at the 2023 Toronto International Film Festival and was acquired by Netflix for a 2024 release. The film, written, directed, edited, and produced by Jacobs, stars Natasha Lyonne, Elizabeth Olsen, and Carrie Coon in critically acclaimed performances.\n\nJacobs has also directed episodes for television series like Sorry For Your Loss and Mozart in the Jungle. In 2024, an official remake of The Lovers, \"Do Aur Do Pyaar\", was released in India, marking the first remake of an A24 film.\n\nIMDb mini bio by; yusufpiskin",
        "birthday": "1972-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": "https://talkiesinc.com/",
        "id": 145130,
        "imdb_id": "nm0414337",
        "known_for_department": "Directing",
        "name": "Azazel Jacobs",
        "place_of_birth": "Manhattan, New York City, New York, USA",
        "popularity": 0.1462,
        "profile_path": "/oIolEvy9ArYRVl0di2D7jfQJ6EN.jpg"
    }
}