{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jsgRkhPxYtzAhDFCUyNbvlX63tY.jpg",
                "genre_ids": [
                    10749,
                    10751,
                    16,
                    14
                ],
                "id": 10020,
                "original_language": "en",
                "original_title": "Beauty and the Beast",
                "overview": "Follow the adventures of Belle, a bright young woman who finds herself in the castle of a prince who's been turned into a mysterious beast. With the help of the castle's enchanted staff, Belle soon learns the most important lesson of all -- that true beauty comes from within.",
                "popularity": 11.4334,
                "poster_path": "/hUJ0UvQ5tgE2Z9WpfuduVSdiCiU.jpg",
                "release_date": "1991-10-22",
                "title": "Beauty and the Beast",
                "video": false,
                "vote_average": 7.731,
                "vote_count": 10301,
                "character": "Chip (voice)",
                "credit_id": "52fe43099251416c75000fc7",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/qSxeCfWUUyht9hZgaaYmtPtTkw2.jpg",
                "genre_ids": [
                    12,
                    14,
                    10751
                ],
                "id": 8844,
                "original_language": "en",
                "original_title": "Jumanji",
                "overview": "When siblings Judy and Peter discover an enchanted board game that opens the door to a magical world, they unwittingly invite Alan -- an adult who's been trapped inside the game for 26 years -- into their living room. Alan's only hope for freedom is to finish the game, which proves risky as all three find themselves running from giant rhinoceroses, evil monkeys and other terrifying creatures.",
                "popularity": 3.2897,
                "poster_path": "/vgpXmVaVyUL7GGiDeiK1mKEKzcX.jpg",
                "release_date": "1995-12-15",
                "title": "Jumanji",
                "video": false,
                "vote_average": 7.241,
                "vote_count": 10898,
                "character": "Peter Shepherd",
                "credit_id": "52fe44c0c3a36847f80a7ce7",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/lAaAtQ5b8iX9JeG6QUq4RM1paKD.jpg",
                "genre_ids": [
                    18
                ],
                "id": 10435,
                "original_language": "en",
                "original_title": "Chaplin",
                "overview": "An aged Charlie Chaplin narrates his life to his autobiography's editor, including his rise to wealth and comedic fame from poverty, his turbulent personal life and his run-ins with the FBI.",
                "popularity": 3.8615,
                "poster_path": "/Aeltt5tl02zrEj4GoMynHc94lWG.jpg",
                "release_date": "1992-12-17",
                "title": "Chaplin",
                "video": false,
                "vote_average": 7.438,
                "vote_count": 1131,
                "character": "Sydney Chaplin jr. Age 8",
                "credit_id": "642d4c9458361b00b4bfea3a",
                "order": 111
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Bradley Michael Pierce"
        ],
        "biography": "Bradley Pierce began acting at age 6 and has since appeared in various projects ranging from commercial and voiceover to television and film. He is best known for his role as Peter in the 1995 film, Jumanji, as well as voicing Chip in Disney’s original Beauty and the Beast. Other notable roles include voicing Tails in the Saturday morning cartoon series, Sonic the Hedgehog, and a starring role in The Borrowers with John Goodman.\n\nBradley also appeared with Patty Duke and Melissa Gilbert in the TV film Cries from the Heart/Touch of Truth as an autistic child named Michael. He has guest starred on several TV shows including Life Goes On, Roseanne, Herman’s Head, Mad About You, Lois & Clark: The New Adventures of Superman, Touched by an Angel, Profiler, and Star Trek: Voyager. He voiced the character Nibs in the 2002 film Return to Never Land and has provided various voices for the Disney Interactive Studio RPG series, Kingdom Hearts. Bradley is currently producing films and a variety of digital content through his company, ZFO Entertainment, as well as in partnership with Lost In Time Pictures.\n\nOutside of filmmaking, Bradley is the co-founder of Pierce & Luna, a cocktail community geared towards bartending education and liquor reviews. Along with his partner, Bella Luna, Pierce has begun providing bartending services and consultations for elite parties and festivals.",
        "birthday": "1982-10-23",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.mrbradleypierce.com/",
        "id": 145151,
        "imdb_id": "nm0682300",
        "known_for_department": "Acting",
        "name": "Bradley Pierce",
        "place_of_birth": "Glendale, Arizona, USA",
        "popularity": 0.4018,
        "profile_path": "/j6iW0vVA23GQniAPSYI6mi4hiEW.jpg"
    }
}