{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mgDv2dDihyetAcENxyf2tpXY245.jpg",
                "genre_ids": [
                    10402,
                    18
                ],
                "id": 1407,
                "original_language": "fr",
                "original_title": "La Môme",
                "overview": "From the mean streets of the Belleville district of Paris to the dazzling limelight of New York's most famous concert halls, Edith Piaf's life was a constant battle to sing and survive, to live and love. Raised in her grandmother's brothel, Piaf was discovered in 1935 by nightclub owner Louis Leplee, who persuaded her to sing despite her extreme nervousness. Piaf became one of France's immortal icons, her voice one of the indelible signatures of the 20th century.",
                "popularity": 3.3301,
                "poster_path": "/3b9DAONAsFRhJKu25R33PE3VwDh.jpg",
                "release_date": "2007-02-14",
                "title": "La Vie en Rose",
                "video": false,
                "vote_average": 7.393,
                "vote_count": 1667,
                "character": "Doug Davis",
                "credit_id": "52fe42f4c3a36847f802f589",
                "order": 22
            },
            {
                "adult": false,
                "backdrop_path": "/nBHKT3pm5DmidZd5VS4bD5Hc2S3.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 820446,
                "original_language": "en",
                "original_title": "Downton Abbey: A New Era",
                "overview": "The Crawley family goes on a grand journey to the south of France to uncover the mystery of the dowager countess's newly inherited villa. Meanwhile, a Hollywood director seeks to film his latest production at Downton.",
                "popularity": 8.4976,
                "poster_path": "/r5n4CLoIjUcnT3shWDi6MHdJ25a.jpg",
                "release_date": "2022-04-27",
                "title": "Downton Abbey: A New Era",
                "video": false,
                "vote_average": 7.236,
                "vote_count": 540,
                "character": "Bertie Hexham",
                "credit_id": "624b6ab5223e200069bd26e3",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/baRFkHjBNSEF2frf0Gh8dZBFewl.jpg",
                "genre_ids": [
                    35
                ],
                "id": 19833,
                "original_language": "en",
                "original_title": "In the Loop",
                "overview": "The US President and the UK Prime Minister are planning on launching a war in the Middle East, but—behind the scenes—government officials and advisers are either promoting the war or are trying to prevent it.",
                "popularity": 1.391,
                "poster_path": "/jL6txnziFSeEifQkqnPBtaPaiXU.jpg",
                "release_date": "2009-01-22",
                "title": "In the Loop",
                "video": false,
                "vote_average": 7.033,
                "vote_count": 726,
                "character": "Civil Servant",
                "credit_id": "560999c592514171940001c0",
                "order": 17
            },
            {
                "adult": false,
                "backdrop_path": "/fzZmcKQv7ZTGIiPvocPhNs3wUyK.jpg",
                "genre_ids": [
                    18,
                    10749,
                    14
                ],
                "id": 122906,
                "original_language": "en",
                "original_title": "About Time",
                "overview": "The night after another unsatisfactory New Year's party, Tim's father tells his son that the men in his family have always had the ability to travel through time. They can't change history, but they can change what happens and has happened in their own lives. Thus begins the start of a lesson in learning to appreciate life itself as it is, as it comes, and most importantly, the people living alongside us.",
                "popularity": 7.7462,
                "poster_path": "/iR1bVfURbN7r1C46WHFbwCkVve.jpg",
                "release_date": "2013-09-04",
                "title": "About Time",
                "video": false,
                "vote_average": 7.913,
                "vote_count": 8873,
                "character": "Rupert",
                "credit_id": "578e8de2925141084801024c",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/lgQQ6n1vPw40buW7QGc1DxDzQS9.jpg",
                "genre_ids": [
                    18,
                    10749,
                    36
                ],
                "id": 535544,
                "original_language": "en",
                "original_title": "Downton Abbey",
                "overview": "The beloved Crawleys and their intrepid staff prepare for the most important moment of their lives. A royal visit from the King and Queen of England will unleash scandal, romance and intrigue that will leave the future of Downton hanging in the balance.",
                "popularity": 5.2434,
                "poster_path": "/pWt1iRuhNpeVDNP2QiUT2C5OiBt.jpg",
                "release_date": "2019-09-12",
                "title": "Downton Abbey",
                "video": false,
                "vote_average": 7.152,
                "vote_count": 1193,
                "character": "Bertie Hexham",
                "credit_id": "5f4bd9f01684f70036714bb0",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Harry Frederick Gerard Hadden-Paton (born 10 April 1981) is a British actor. He is perhaps best known for his television roles as Herbert Pelham, 7th Marquess of Hexham, in the television series Downton Abbey and Martin Charteris in The Crown.\n\nHadden-Paton played the lead role of Henry Higgins in the Lincoln Center Theater revival of My Fair Lady on Broadway, a performance for which he was nominated for the 2018 Tony Award for Best Actor in a Musical.\n\nHadden-Paton was born at Westminster Hospital in London, the son of former cavalry officer Nigel Hadden-Paton, head of a landed gentry family of Rossway, near Berkhamsted, Hertfordshire, and Sarah ('Bumble'), daughter of Brigadier Frederick Mellor, of The Cottage, Chiddingfold, Surrey. He has three sisters: Polly, Clementine, and Alice. He is the godson of Sarah, Duchess of York.\n\nHe is married to fellow actor Rebecca Night, whom he met while performing in The Importance of Being Earnest. They have been married since 2010 and have two daughters, Martha and Audrey. Hadden-Paton and Night co-starred in the autumn of 2019 in The King's Speech at the Chicago Shakespeare Theater.\n\nHadden-Paton was educated at Eton College and Durham University. He trained at the London Academy of Music and Dramatic Art (LAMDA).\n\nSince leaving LAMDA in 2006, Hadden-Paton has established himself as a leading stage actor. He was commended in the 2007 Ian Charleson Awards for his appearances in Romeo and Juliet at the Battersea Arts Centre and as John Worthing in The Importance of Being Earnest, directed by Peter Gill. His stand-out performances continued with Captain Jack Absolute in The Rivals at the Southwark Playhouse, as Hohenzollern in The Prince of Homburg at the Donmar Warehouse, and as Harry Villiers in the 2010 première of Posh at the Royal Court.\n\nIn 2011, he appeared as Teddy Graham in the Olivier Award-winning revival Flare Path at the Theatre Royal Haymarket, and as Jackie Jackson in a film adaptation of The Deep Blue Sea, both marking the centenary of their author, the English playwright Terence Rattigan.\n\nFollowing the success of Flare Path he has appeared as Michael Palin in the premiere of Steve Thompson's No Naughty Bits at the Hampstead Theatre, as Marlow in Jamie Lloyd's production of She Stoops to Conquer at the National Theatre, as Alsamero in the Young Vic's production of The Changeling, and as Phillip in the hit revival of Alexi Kaye Campbell's The Pride at the Trafalgar Studios. Hadden-Paton made his Broadway debut playing Henry Higgins in a revival of My Fair Lady, for which he received Tony and Grammy Award nominations.\n\nIn 2021, Hadden-Paton originated a leading role in the new musical Flying Over Sunset, directed by James Lapine, at the Vivian Beaumont Theater, Lincoln Center, New York. Having been postponed by the COVID-19 pandemic, the musical premiered on Broadway at the Vivian Beaumont Theater on November 11, 2021 in previews with the official opening scheduled for December 13, 2021. He resumes the role of Higgins at the London Coliseum in May 2022. ...\n\nSource: Article \"Harry Hadden-Paton\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1981-04-10",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 145133,
        "imdb_id": "nm2227000",
        "known_for_department": "Acting",
        "name": "Harry Hadden-Paton",
        "place_of_birth": "London, England, UK",
        "popularity": 0.6409,
        "profile_path": "/fA949hIh8eI1rVgWj1oiTCc2h7V.jpg"
    }
}