{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bYimqNnizPUCnL5HOdoCW02IGmH.jpg",
                "genre_ids": [
                    18,
                    35,
                    10749
                ],
                "id": 74643,
                "original_language": "fr",
                "original_title": "The Artist",
                "overview": "Hollywood, 1927: As silent movie star George Valentin wonders if the arrival of talking pictures will cause him to fade into oblivion, he sparks with Peppy Miller, a young dancer set for a big break.",
                "popularity": 3.1239,
                "poster_path": "/z68py0ZqPgeacGPG54AGVRbNBS7.jpg",
                "release_date": "2011-10-12",
                "title": "The Artist",
                "video": false,
                "vote_average": 7.451,
                "vote_count": 3367,
                "character": "Autograph Girl (uncredited)",
                "credit_id": "566db325c3a3680e730079b2",
                "order": 67
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Born in Ireland of Italian descent, Sonya Macari began appearing in television commercials in Dublin at the age of 18, and her acting debut was in the Irish hit show “The Clinic” followed by a recurring role on Showtime’s “ The Tudors.” She now resides in Los Angeles and has built on the success she has achieved as a stage and screen actress in Ireland, playing a variety of roles including a feature in the ten time Oscar nominated silent movie “ The Artist,” the title role of “Mary Magdalene” for the Hallmark channel, an Italian spy \"Antonia” for the hit show “Chuck” on NBC, Francesca in a TV series “Caravaggio And My Mother The Pope.” Other credits include the lead role of “Sara” in an apocalyptic science fiction movie entitled “ Protocol” alongside Eric Lange, and Eva Clark, a 1930’s stage actress driven by the pressure of achieving and losing fame in “Behind The Curtain,” a film noir homage and festival favorite. In “Kiss The Devil,” a fantasy thriller, Sonya stars as “Vanessa” alongside Doug Jones, and was nominated for Best Supporting Actress at The Utah Film Festival, and won Best Supporting Actress at the Maverick Movie Awards. Just recently Sonya booked a role in the hit American show “It’s Always Sunny In Philadelphia,” which is due to air worldwide soon.\n\nSonya is also a book narrator and has narrated several books for Penguin Random House international. She is a member of SAG/AFTRA, Irish and British Equity.",
        "birthday": "1980-01-01",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.creativeactingstudios.com/about-sonya",
        "id": 1452935,
        "imdb_id": "nm2363874",
        "known_for_department": "Acting",
        "name": "Sonya Macari",
        "place_of_birth": "County Dublin, Ireland",
        "popularity": 0.0783,
        "profile_path": "/pOkhIZbDexfbvauaySlNOd4VJAE.jpg"
    }
}