{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5fxTB08O7CW1hAcN2MWOKodp1h1.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 615777,
                "original_language": "en",
                "original_title": "Babylon",
                "overview": "A tale of outsized ambition and outrageous excess, tracing the rise and fall of multiple characters in an era of unbridled decadence and depravity during Hollywood's transition from silent films to sound films in the late 1920s.",
                "popularity": 8.8545,
                "poster_path": "/wjOHjWCUE0YzDiEzKv8AfqHj3ir.jpg",
                "release_date": "2022-12-22",
                "title": "Babylon",
                "video": false,
                "vote_average": 7.38,
                "vote_count": 3486,
                "character": "Jane Thornton",
                "credit_id": "63a8bb9a0f21c600ca7854c4",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Φίμπι Τόνκιν",
            "Φοίβη Τζέιν Ελίζαμπεθ Τόνκιν",
            "フィービー・トンキン",
            "Phoebe Jane Elizabeth Tonkin",
            "فیبی تانکین",
            "فوبی تانکین"
        ],
        "biography": "Phoebe Jane Elizabeth Tonkin (born 12 July 1989) is an Australian actress and model. She is best known for portraying Cleo Sertori in H2O: Just Add Water, Fiona Maxwell in Tomorrow, When the War Began and Faye Chamberlain in The Secret Circle.  Tonkin's first television appearance was on the Australian teen show H2O: Just Add Water, where she played one of the main characters, Cleo Sertori. While not a strong swimmer, she worked to improve her abilities during pre-production of the show. On 20 October 2007, Tonkin appeared on the Nickelodeon UK Kids' Choice Awards, where she presented the award for best band alongside H2O co-stars Claire Holt and Cariba Heine.  Her other credits include appearances on the Australian series Packed to the Rafters and the film Tomorrow, When the War Began, and guest starred on Home and Away in 2010. She has appeared in various commercials, including ones for Vauxhall Motors and Chic Management.  Tonkin stars as Faye Chamberlain in the CW series The Secret Circle, which premiered on 15 September 2011.  She also models, and has been in various photo shoots for catalogues and magazines such as Girlfriend, Teen Vogue, and Dolly.",
        "birthday": "1989-07-12",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 145247,
        "imdb_id": "nm2100081",
        "known_for_department": "Acting",
        "name": "Phoebe Tonkin",
        "place_of_birth": "Sydney, New South Wales, Australia",
        "popularity": 1.0513,
        "profile_path": "/NgjSnxirsJNuFBjKR4apkKL3wC.jpg"
    }
}