{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mmd1HnuvAzFc4iuVJcnBrhDNEKr.jpg",
                "genre_ids": [
                    27,
                    53
                ],
                "id": 694,
                "original_language": "en",
                "original_title": "The Shining",
                "overview": "Jack Torrance accepts a caretaker job at the Overlook Hotel, where he, along with his wife Wendy and their son Danny, must live isolated from the rest of the world for the winter. But they aren't prepared for the madness that lurks within.",
                "popularity": 9.1204,
                "poster_path": "/xazWoLealQwEgqZ89MLZklLZD3k.jpg",
                "release_date": "1980-05-23",
                "title": "The Shining",
                "video": false,
                "vote_average": 8.209,
                "vote_count": 18178,
                "character": "Dinner Guest (uncredited)",
                "credit_id": "5e74e3c92f3b1700144df07e",
                "order": 26
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Peter McNamara, born in London and attended the National Youth Theatre and trained at LAMDA. Possibly best known as Ralph Passmore, the nemesis of Tucker Jenkin's in Tucker's Luck (1983), the spin off series of Phil Redmond's Grange Hill (1978). Peter was known for his fantastic singing voice in many theatre musical productions including South Pacific. He started out his long list of jobs as a supporting artist, working on such films as Quadrophenia (1979), The Shining (1980), Chariots of Fire (1981) and Star Wars (1977), before being cast in Grange Hill (1978). He worked frequently with Christopher Menaul who cast him as a Chelsea skinhead Rory in The Treatment (1984) and previously Tucker's Luck (1983). He became a well respected character actor in a career that eventually spanned four decades, he was often called upon to play the menacing hard-man and when Denzel Washington came to London to work on For Queen & Country (1988), Peter was asked to show him around and guide him on the Cockney accent. In 1990, Peter starred as Kenno in the controversial football hooligan film, Arrivederci Millwall (1990), one of the first films to tackle that subject. He went onto play Jimmy Cadogan in the children's TV series; Oasis (1993) in 1993 and a spot on 99-1 (1994) which reunited him with Arrivederci Millwall (1990) director Charles McDougall. Despite his hard-man roles Peter often played in a lot of comedy TV shows including Desmond's (1989) and Harry Enfield and Chums (1994). In 1995, he appeared in Funny Bones (1995) with Lee Evans, Jerry Lewis, Oliver Platt and Oliver Reed. Then in 1996 he was seen in the series No Bananas (1996) as DS Howard. He was in both the film and TV series of London's Burning (1988) and played recurring roles in numerous other British TV shows including Thief Takers (1995), The Bill (1984), Trial & Retribution (1997), Silent Witness (1996) and Casualty (1986). In 2002, he appeared as Frederick Michael Argyle in The Gathering (2002) where he acted alongside Christina Ricci, Ioan Gruffudd and Stephen Dillane. In 2004, he appeared in an extraordinary experimental drama documentary called Pissed on the Job (2004), Peter played a heavy drinker who was also a teacher, the film which can be seen online is a great example of his work, his subtle performance is extremely realistic in this damning piece about the dangers of alcohol. He showed up as a vampire drug dealer in the film Dead Cert (2010) in 2010 and had been working on some low budget films in the latter years of his career that sadly never got released due to budget and various technical issues. His last credit Dinklebrain (2012) was not the last film he made, rumour has it that he was very much actively making some independent short films, which hopefully will emerge in the near future. Sadly, Peter McNamara died in May 2018 at the age of 57 and he was cremated at Enfield Crematorium on 14th June 2018, a week after what would have been his 58th birthday.\n\n- IMDb Mini Biography By: Shona M",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1452763,
        "imdb_id": "nm0534063",
        "known_for_department": "Acting",
        "name": "Peter McNamara",
        "place_of_birth": "Edmonton, Middlesex, England, UK",
        "popularity": 0.6559,
        "profile_path": "/iztEduFFszlfqGgKpm70WZeAqrB.jpg"
    }
}