{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dDYpjrwh1wNVQk0rEpc9P81wQt4.jpg",
                "genre_ids": [
                    10402,
                    18,
                    10749
                ],
                "id": 332562,
                "original_language": "en",
                "original_title": "A Star Is Born",
                "overview": "Seasoned musician Jackson Maine discovers — and falls in love with — struggling artist Ally. She has just about given up on her dream to make it big as a singer — until Jack coaxes her into the spotlight. But even as Ally's career takes off, the personal side of their relationship is breaking down, as Jack fights an ongoing battle with his own internal demons.",
                "popularity": 5.4739,
                "poster_path": "/wrFpXMNBRj2PBiN4Z5kix51XaIZ.jpg",
                "release_date": "2018-10-03",
                "title": "A Star Is Born",
                "video": false,
                "vote_average": 7.498,
                "vote_count": 11944,
                "character": "Guitarist",
                "credit_id": "5c151f5ac3a36866cc36b782",
                "order": 33
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Lukas Autry Nelson (born December 25, 1988, in Austin, Texas) is an American singer‐songwriter and the son of country legend Willie Nelson who rose to prominence as the frontman of Lukas Nelson & Promise of the Real—a band he formed in 2008 that supported artists like Neil Young and contributed to nine albums before their 2024 hiatus. He earned acclaim co‑writing and producing the Grammy‑winning soundtrack for A Star Is Born (2018), and in June 2025 he launched his solo career with American Romance, released via Sony Music Nashville and produced by Shooter Jennings; the 12‑track album, including singles like “Ain’t Done” and “Pretty Much,” is a soulful, introspective blend of country, folk, and Americana that reflects his personal growth—sobriety, piloting, and stepping out from his father’s shadow—while exploring themes of love, loss, resilience, and American road life.",
        "birthday": "1988-12-25",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1453337,
        "imdb_id": "nm2649431",
        "known_for_department": "Acting",
        "name": "Lukas Nelson",
        "place_of_birth": "Austin, Texas, USA",
        "popularity": 0.5364,
        "profile_path": "/jTvPdQeGH4xC9EOiezV2QJJZYAp.jpg"
    }
}