{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2aC3284N1p86o6S4Uyj9AaryYeR.jpg",
                "genre_ids": [
                    37,
                    28,
                    12
                ],
                "id": 966,
                "original_language": "en",
                "original_title": "The Magnificent Seven",
                "overview": "An oppressed Mexican peasant village hires seven gunfighters to help defend their homes.",
                "popularity": 8.9842,
                "poster_path": "/e5ToxOyJwuZD4VOfI0qEn5uIjeJ.jpg",
                "release_date": "1960-10-12",
                "title": "The Magnificent Seven",
                "video": false,
                "vote_average": 7.509,
                "vote_count": 1875,
                "character": "Old Man",
                "credit_id": "52fe4294c3a36847f8029c67",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Wladimir Sokoloff",
            "Wladimir Sokolow",
            "Vladimir Aleksandrovich Sokoloff",
            "Влади́мир Алекса́ндрович Соколо́в",
            "Waldemar Sokoloff"
        ],
        "biography": "​From Wikipedia, the free encyclopedia.  Vladimir Aleksandrovich Sokoloff (Russian: Владимир Александрович Соколов; December 26, 1889 – February 15, 1962) was a character actor on stage and particularly in film.\n\nSokoloff was born in Moscow, Russia. He became an actor and assistant director with the Moscow Art Theatre before emigrating to Berlin in 1923. With the rise of Nazism, Sokoloff who was Jewish, moved first to Paris in 1932, then to the United States in 1937.\n\nHe appeared in a number of Broadway plays from 1937 to 1950. He also quickly found work in American films, playing characters of a wide variety of nationalities (he himself once estimated 35), for example, Filipino (Back to Bataan), French (Passage to Marseille), Greek (Mr. Lucky), Arab (Road to Morocco), Romanian (I Was a Teenage Werewolf), and Chinese (Macao). Among his better known parts are the Spanish guerrilla Anselmo in For Whom the Bell Tolls (1943) and the Mexican Old Man in The Magnificent Seven.\n\nIn the late 1950s and early 1960s, he also appeared on a number of television series, including three episodes of CBS's The Twilight Zone (\"Dust\", \"The Gift\" and \"The Mirror\"). On January 1, 1961, Sokoloff guest starred as \"Old Stefano\", a wise shepherd, in the ABC/Warner Brothers western series Lawman, with John Russell and Peter Brown. He also appeared on one episode of The Untouchables entitled \"Troubleshooter\".\n\nHe was a pupil of Stanislavski, but in a 1960 newspaper article, he rejected Method acting (as well as all other acting theories).\n\nAfter a long career, he died of a stroke in 1962 in Hollywood, California.\n\nDescription above from the Wikipedia article Vladimir Sokoloff, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1889-12-26",
        "deathday": "1962-02-15",
        "gender": 2,
        "homepage": null,
        "id": 14533,
        "imdb_id": "nm0812453",
        "known_for_department": "Acting",
        "name": "Vladimir Sokoloff",
        "place_of_birth": "Moscow, Russian Empire [now Russia]",
        "popularity": 0.3412,
        "profile_path": "/zsgRzwH3Hi4mZQnWBXXld56LEyM.jpg"
    }
}