{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/b0Xdh15XGZbKON9CbFVB5sTqrSJ.jpg",
                "genre_ids": [
                    18
                ],
                "id": 315846,
                "original_language": "ja",
                "original_title": "海街diary",
                "overview": "After the death of their estranged father, 3 adult sisters invite their teenaged half-sister to live with them.",
                "popularity": 2.3686,
                "poster_path": "/x9A0AtEg5EEYbDGfP8NqH3C9w8M.jpg",
                "release_date": "2015-06-13",
                "title": "Our Little Sister",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 514,
                "character": "Suzu Asano",
                "credit_id": "552fa3d99251413b3b003670",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/8yniaG7C4iCm0VVTSShAPUZYM3Y.jpg",
                "genre_ids": [
                    28,
                    12,
                    16,
                    18,
                    10751,
                    14
                ],
                "id": 315465,
                "original_language": "ja",
                "original_title": "バケモノの子",
                "overview": "Kyuta, a boy living in Shibuya, and Kumatetsu, a lonesome beast from Jutengai, an imaginary world. One day, Kyuta forays into the imaginary world and, as he's looking for his way back, meets Kumatetsu who becomes his spirit guide. That encounter leads them to many adventures.",
                "popularity": 2.6766,
                "poster_path": "/kzKJxfIdZ70nsPfKyq7hlYlJwSx.jpg",
                "release_date": "2015-07-11",
                "title": "The Boy and the Beast",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 1534,
                "character": "Kaede (voice)",
                "credit_id": "566231e1c3a3682bd800108e",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "広瀬 すず",
            "Hirose Suzu",
            "ซูสุ ฮิโรเสะ",
            "سوزو هیروسه"
        ],
        "biography": "Suzu Hirose (広瀬 すず Hirose Suzu, born 19 June 1998 in Shimizu-ku, Shizuoka, Shizuoka) is a Japanese actress and model.\n\nHirose performed the role of Suzu Asano, the titular little sister, in Hirokazu Kore-eda's 2015 live action adaptation of the manga Umimachi diary, originally written and illustrated by Mangaka Akimi Yoshida. In Our Little Sister she stars as a football playing teenager who gets adopted into the Kamakura home of her elder half-sisters after the death of their alienated father. The Kouda sisters first meet her at the funeral in the town where he settled for his second marriage. The film was screened in competition for the Palme d'Or enabling Hirose to attend the Cannes Film Festival. For her performance as Suzu she was awarded the Japan Academy Prize for \"Newcomer of the Year\" and received the \"Best New Actress\" award from Kinema Junpo, among other accolades. Hirose and Koreeda collaborated again for The Third Murder.\n\nIn March 2016 Hirose first appeared as a competitive karuta and Ogura Hyakunin Isshu poetry obsessed high school student in part one of Norihiro Koizumi's (小泉徳宏 Koizumi Norihiro) Awesome film series, performing the lead role of Chihaya Ayase in his big-screen, live-action, adaptation of cartoonist Yuki Suetsugu's comic strip, better known in English under its romanised Japanese title Chihayafuru. Her performance in the first part, poetically titled Chihayafuru: Kami no ku, or \"upper phrase\" was followed in a second part, titled Shimo no ku, in April that same year and earned her \"Best Actress\" nominations. Hirose reprised her role in a third part, titled Chihayafuru: Musubi, the conclusion of the film trilogy, for which principal photography wrapped in June 2017 and which is scheduled for release in Japanese theatres in Heisei 30, the following year.",
        "birthday": "1998-06-19",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.web-foster.com/pc/artists/Hirose/Suzu",
        "id": 1454976,
        "imdb_id": "nm5620173",
        "known_for_department": "Acting",
        "name": "Suzu Hirose",
        "place_of_birth": "Shimizu, Shizuoka, Japan",
        "popularity": 1.605,
        "profile_path": "/2QPyHhJQ0BY7GEsH3L5g8DhxPTQ.jpg"
    }
}