{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/m10uqk0HI5JcITAbxNJIIiGA8HP.jpg",
                "genre_ids": [
                    80,
                    18,
                    53
                ],
                "id": 968,
                "original_language": "en",
                "original_title": "Dog Day Afternoon",
                "overview": "Based on the true story of would-be Brooklyn bank robbers John Wojtowicz and Salvatore Naturile. Sonny and Sal attempt a bank heist which quickly turns sour and escalates into a hostage situation and stand-off with the police. As Sonny's motives for the robbery are slowly revealed and things become more complicated, the heist turns into a media circus.",
                "popularity": 5.5578,
                "poster_path": "/mavrhr0ig2aCRR8d48yaxtD5aMQ.jpg",
                "release_date": "1975-09-21",
                "title": "Dog Day Afternoon",
                "video": false,
                "vote_average": 7.846,
                "vote_count": 3145,
                "character": "Stevie",
                "credit_id": "52fe4295c3a36847f8029e65",
                "order": 14
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/6aoyUbvu0419XLKLIMoH0TkEicH.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 103,
                "original_language": "en",
                "original_title": "Taxi Driver",
                "overview": "Suffering from insomnia, disturbed loner Travis Bickle takes a job as a New York City cabbie, haunting the streets nightly, growing increasingly detached from reality as he dreams of cleaning up the filthy city.",
                "popularity": 10.5072,
                "poster_path": "/ekstpH614fwDX8DUln1a2Opz0N8.jpg",
                "release_date": "1976-02-09",
                "title": "Taxi Driver",
                "video": false,
                "vote_average": 8.135,
                "vote_count": 12877,
                "credit_id": "633d41626beaea007d533d71",
                "department": "Production",
                "job": "Production Assistant"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Gary Springer is an entertainment publicist representing film, theatre and events. His company represents independent and foreign films at festivals in the US and abroad, and for release in NY and nationally as well as serving as sales, distribution and awards consultant. He has represented or consulted on multiple film festivals in the US and internationally. Gary has represented over 25 Broadway shows, and numerous off-Broadway productions and companies. Gary's first career was as an actor with film appearances including \"Dog Day Afternoon,\" \"Jaws 2,\" \"Small Circle of Friends\" and \"Law and Disorder.\" Gary is the international press consultant to the Monaco based International Emerging Film Talent Association. He was a founding member of The Creative Coalition and is a voting member for the Academy Awards.\n\nGary grew up in New York, a child of the entertainment business. His mother, June was a Broadway singer, and, as Monica Lane, was a headliner for many years at the famed Latin Quarter in NYC. His father, John, was one of the leading entertainment PR representatives in the world for many years. He represented a galaxy of film, theatre and television stars including Richard Burton, Elizabeth Taylor, Henry Fonda, Marilyn Monroe, Tony Randall, Paul Newman, Louise Brooks, Lillian Gish, Montgomery Clift, Gary Cooper, Marlene Dietrich, Robert Preston, Bette Davis, Liv Ullmann, Yves Montand, Sir Michael Redgrave, Lana Turner, Warren Beatty, Julie Christy, Peter O'Toole, to name just a few. He represented such films as Bonnie & Clyde, Catch 22, Who's Afraid of Virginia Woolf, Midnight Cowboy, Z, Monty Python & The Holy Grail, Marlene, Tess, and many others. There were numerous Broadway productions, Special events, Film Festivals, and much more.",
        "birthday": "1959-07-29",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 14552,
        "imdb_id": "nm0819725",
        "known_for_department": "Acting",
        "name": "Gary Springer",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.0546,
        "profile_path": null
    }
}