{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1pOp56fSV4XySjaGrhb6NPD2n4r.jpg",
                "genre_ids": [
                    18,
                    36,
                    28
                ],
                "id": 10423,
                "original_language": "en",
                "original_title": "Dragon: The Bruce Lee Story",
                "overview": "This film is a glimpse into the life, love and the unconquerable spirit of the legendary Bruce Lee. From a childhood of rigorous martial arts training, Lee realizes his dream of opening his own kung-fu school in America. Before long, he is discovered by a Hollywood producer and begins a meteoric rise to fame and an all too short reign as one the most charismatic action heroes in cinema history.",
                "popularity": 2.3536,
                "poster_path": "/lxhsdC8wuGgQf0gKCt8wyHHxGcQ.jpg",
                "release_date": "1993-05-07",
                "title": "Dragon: The Bruce Lee Story",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 768,
                "character": "Green Hornet Director",
                "credit_id": "5968bcdbc3a368729801e20f",
                "order": 27
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Van Zandt Jarvis Williams"
        ],
        "biography": "You could shoehorn actor Van Williams right in there between the other tall, dark and drop-jaw gorgeous heartthrobs Tom Tryon and John Gavin of the late 1950s/early 1960s who conveyed a similar bland, heroic image. All three were too often given colorless heroes to play on film and/or TV -- roles that played off their charm but seldom tested their talent.\n\nBorn on February 27, 1934 as Van Zandt Jarvis Williams, he was the son of a cattle rancher. He majored in animal husbandry and business at Texas Christian University but moved to Hawaii which changed the course of his life. While operating a salvage company and a skin-diving school during the mid-1950s, he was approached by Elizabeth Taylor and husband/producer Mike Todd, who were filming there. Encouraged by Todd to try his luck, Van arrived in Hollywood with no experience. Todd perished in a plane crash before he was able to help Van, but the young hopeful ventured on anyway, taking some acting/voice lessons, and was almost immediately cast in dramatic TV roles.\n\nWarner Brothers had a keen eye for this type of photogenic hunk and smartly signed Van. Fitting in perfectly, he was soon showing just how irresistible he was as a clean-cut private eye on the series \"Bourbon Street Beat (1959)\". Although the show lasted only one season, Warners carried his Kenny Madison character into the more popular adventure drama Surfside 6 (1960) opposite fellow pin-up / blond beefcake bookend Troy Donahue. Series-wise, Van tried comedy next opposite \"Walter Brennan in The Tycoon (1964)\". After his contract expired at Warners, 20th Century-Fox handed him his most vividly recalled role, that of the emerald-suited superhero \"The Green Hornet (1966)\" with the late Bruce Lee as his partner Kato. The show, inspired by the huge cult hit \"Batman (1966)\" enjoyed a fast start but, like its predecessor, met an equally untimely finish.\n\nNever a strong draw in films, Van revealed quite a bit of himself (literally) in his debut in \"Tall Story (1960)\" coming out of a shower. He was handed a typically staid second lead in \"The Caretakers (1963)\". Continuing well into the 1970s to guest sporadically on the TV scene in classics like \"The Dick Van Dyke Show (1961)\", \"Love, American Style (1969)\", \"Mission: Impossible (1966)\", \"The Big Valley (1965)\", \"Nanny and the Professor (1970)\", \"Barnaby Jones (1973)\", and \"The Rockford Files (1974)\". Another starring series attempt with \"Westwind (1975)\" failed to make the grade and he soon let his career go. Van went on quite successfully in business with telecommunications, real estate and law enforcement supplies among his ventures. With his glossy, pretty-boy years far behind him, he has not felt the need to look back except for an occasional autograph convention.\n\n- IMDb Mini Biography By: Gary Brumburgh / gr-home@pacbell.net",
        "birthday": "1934-02-27",
        "deathday": "2016-11-28",
        "gender": 2,
        "homepage": null,
        "id": 145535,
        "imdb_id": "nm0931868",
        "known_for_department": "Acting",
        "name": "Van Williams",
        "place_of_birth": "Fort Worth, Texas, USA",
        "popularity": 0.1529,
        "profile_path": "/xDXUeFoNfkSwhLCn65Vr2wI07kr.jpg"
    }
}