{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1Cuaush5VwesuZJzJRy2ptfalCh.jpg",
                "genre_ids": [
                    10751,
                    14,
                    35,
                    12
                ],
                "id": 2899,
                "original_language": "fr",
                "original_title": "Astérix & Obélix : Mission Cléopâtre",
                "overview": "History's favorite Gauls assist Queen Cleopatra when she wagers that the Egyptian people can build a palace for Julius Caesar in just three months.",
                "popularity": 5.6606,
                "poster_path": "/5gMmVSkY7RAxb5xRk7ej7JVhXyl.jpg",
                "release_date": "2002-01-30",
                "title": "Asterix & Obelix: Mission Cleopatra",
                "video": false,
                "vote_average": 7.373,
                "vote_count": 3654,
                "character": "Guimieukis",
                "credit_id": "52fe4373c3a36847f80551dd",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            " Noemie Lenoir"
        ],
        "biography": "Noémie Lenoir (born 19 September 1979) is a French model and actress. She is known for her work with Gucci, L'Oréal, Next, Gap, Tommy Hilfiger, Victoria's Secret, Balmain Paris Hair Couture and Marks and Spencer.\n\nLenoir was born in Les Ulis, Essonne, France. Her mother is a cleaning lady and comes from the French island of Réunion in the Indian Ocean, while her father is from mainland France and an electrician. When she was 17, Lenoir was spotted by the Ford modelling agency and began modelling in New York.\n\nGrowing up in a banlieue district near Paris, which she describes as a \"ghetto\", Lenoir was first spotted at the age of 17 in 1997 when she was approached by a Ford booker in a post office. She signed with L'Oréal in 1997, and has since appeared in their advertisements alongside Laetitia Casta and long-term model and actress Andie MacDowell. She has also worked for Victoria's Secret, Gap, Next, and many others.\n\nLenoir was the face of UK high-street retailer Marks & Spencer, for four years until Christmas 2009 and was seen in various British TV adverts, magazines and billboards alongside fellow models Erin O'Connor, Twiggy and Laura Bailey. Lenoir returned to Marks & Spencer advertising in 2012 where she is seen \"enjoying a selection of quintessentially British pastimes\".\n\nIn 2007, Lenoir featured in the hit film Rush Hour 3 alongside actors Jackie Chan and Chris Tucker. In 2009, Lenoir featured in the music video for Usher's single \"Hey Daddy (Daddy's Home)\".\n\nShe is represented by Models 1.\n\nAfter a relationship with rapper Stomy Bugsy, she lived with international football player Claude Makélélé. They have a son. The couple split in early 2009. Lenoir gave birth to a daughter in August 2015.\n\nOn 9 May 2010, Lenoir was found unconscious, after a suspected suicide attempt in a park near her Paris home, by a man walking his dog. She was taken to hospital where large quantities of drugs and alcohol were found in her system. She spoke about the suicide attempt in a February 2011 interview with Britain's Guardian Weekend magazine, admitting she had done \"something really, really stupid\". Some have referred to the incident as a case in a \"series of suicidal tragedies\" ongoing in the fashion industry at the time, along with the suicides of Ambrose Olsen, Daul Kim, Tom Nicon, Hayley Kohle, and Ruslana Korshunova.\n\nShe hosted a show on Trace TV for two years. She appears in all three Marks and Spencer Christmas TV adverts for 2009, broadcast in both Ireland and the United Kingdom.\n\nSource: Article \"Noémie Lenoir\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1979-09-19",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 145633,
        "imdb_id": "nm1105708",
        "known_for_department": "Acting",
        "name": "Noémie Lenoir",
        "place_of_birth": "Versailles, Yvelines, France",
        "popularity": 0.4994,
        "profile_path": "/6qUNl0kczXHMN4yHrsDYEcEjw3O.jpg"
    }
}