{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/354kfjVb96mtFALMhBE6jzHGiA2.jpg",
                "genre_ids": [
                    10752,
                    18
                ],
                "id": 975,
                "original_language": "en",
                "original_title": "Paths of Glory",
                "overview": "A commanding officer defends three scapegoats on trial for a failed offensive that occurred within the French Army in 1916.",
                "popularity": 3.4471,
                "poster_path": "/hGg1UCQSHlXfv2HI9bDHT2OQBam.jpg",
                "release_date": "1957-10-25",
                "title": "Paths of Glory",
                "video": false,
                "vote_average": 8.3,
                "vote_count": 3091,
                "character": "Lt. Roget/Singing man",
                "credit_id": "52fe4295c3a36847f8029f25",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Bert DeWayne Morris",
            "Bert DeWayne Morris Jr."
        ],
        "biography": "Wayne Morris  (February 17, 1914 – September 14, 1959), born Bert DeWayne Morris in Los Angeles, was an American film and television actor, as well as a decorated World War II fighter ace. He appeared in many notable films, including Paths of Glory (1957), The Bushwackers (1952) and the title role of Kid Galahad in 1937. While filming Flight Angels (1940), Morris became interested in flying and became a pilot. With war in the wind, he joined the Naval Reserve and became a Navy flier in 1942, leaving his film career behind for the duration of the war. Flying the F6F Hellcat off the aircraft carrier USS Essex, Morris shot down seven Japanese planes and contributed to the sinking of five ships. He was awarded four Distinguished Flying Crosses and two Air Medals. Morris was considered by the Navy as physically 'too big' to fly fighters. After being turned down several times as a fighter pilot, he went to his brother in law, Cdr. David McCampbell, imploring him for the chance to fly fighters. Cdr. McCampbell said \"Give me a letter.\" He flew with the VF-15, the famed \"McCampbell Heroes.\" He married Patricia O'Rourke, an Olympic swimmer, and sister to B-movie actress Peggy Stewart. Following the war, Morris returned to films, but his nearly four-year absence had cost him his burgeoning stardom. He continued to act in movies, but the pictures, for the most part, sank in quality. Losing his boyish looks but not demeanor, Morris spent most of the fifties in low-budget westerns. He made an unusual career move in 1957, making his Broadway debut as a washed-up boxing champ in William Saroyan's The Cave Dwellers. He also appeared as a weakling in Stanley Kubrick's Paths of Glory (1957). Morris suffered a massive heart attack while visiting aboard the aircraft carrier USS Bon Homme Richard in San Francisco Bay and was pronounced dead after being transported to Oakland Naval Hospital in Oakland, California. He was 45. He was buried at Arlington National Cemetery.\n\nDescription above from the Wikipedia article Wayne Morris (American actor), licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": "1914-02-17",
        "deathday": "1959-09-14",
        "gender": 2,
        "homepage": null,
        "id": 14565,
        "imdb_id": "nm0606998",
        "known_for_department": "Acting",
        "name": "Wayne Morris",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.1469,
        "profile_path": "/2HFQHQrPdlr8eRca5x9BAfeQnjc.jpg"
    }
}