{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wTvDGO0xGMmnScqjuiDeWU7PkcB.jpg",
                "genre_ids": [
                    10749,
                    14,
                    18
                ],
                "id": 293863,
                "original_language": "en",
                "original_title": "The Age of Adaline",
                "overview": "After 29-year-old Adaline recovers from a nearly lethal accident, she inexplicably stops growing older. As the years stretch on and on, Adaline keeps her secret to herself  until she meets a man who changes her life.",
                "popularity": 5.2512,
                "poster_path": "/MbILysGhjAbnZi1Okae9wYqLMx.jpg",
                "release_date": "2015-04-16",
                "title": "The Age of Adaline",
                "video": false,
                "vote_average": 7.479,
                "vote_count": 6890,
                "character": "1950s Policeman",
                "credit_id": "553c908b92514137f9000b10",
                "order": 16
            },
            {
                "adult": false,
                "backdrop_path": "/mtZh7DHYcwiE8lQ2XrcaMd78CId.jpg",
                "genre_ids": [
                    16,
                    10751
                ],
                "id": 13004,
                "original_language": "en",
                "original_title": "Barbie and the Diamond Castle",
                "overview": "Liana and Alexa (Barbie and Teresa) are best friends who share everything, including their love of singing. Upon meeting a girl inside a mirror, the duo embark on a journey that will put their friendship to the ultimate test.",
                "popularity": 5.5299,
                "poster_path": "/qewfjmkNpggNuXQtrUjMl8hvHoM.jpg",
                "release_date": "2008-09-03",
                "title": "Barbie and the Diamond Castle",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 865,
                "character": "Ian (voice)",
                "credit_id": "5cf2db150e0a261e00ccbabf",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Film and stage actor Noel Johansen holds American, Canadian and British citizenship. He has a played diversity of characters and is known in the industry as the \"accent guy,\" having recently been nominated for his role as Ilyia Sokolov (Russian Cellist) in Bletchley San Francisco. He grew up in an acting family, then attended the University of Pennsylvania and trained at Drama Studio London, lived in Paris for 2 years and is bilingual in French, speaks basic German and Italian. Another role he earned much recognition for was Danny Jackson (who has 16p11.2 deletion syndrome) opposite Devon Sawa in ABC's \"Somewhere Between.\" Other roles he known for are Mr. Black (evil henchman leader) in Nickelodeon's \"Rufus,\" Russell (a drunk AA leader) in DirecTV's \"Loudermilk\" and Sam Crowley (a Russian spy) in CBS's Chaos. And Noel has enjoyed many roles in Hallmark movies of the week, and playing the cop in Age of Adeline (see movie trailer) directed by Lee Toland Krieger. On stage, among various New York credits, he played the young Einstein in Steve Martin's \"Picasso at the Lapin Agile\" in the Broadway Touring version at the Wilmington Playhouse.\n\nNoel has a black belt in Tae Kwon Do and qualified for the Olympics Team after university and still trains today. He's also an avid sailor and swimmer.",
        "birthday": "1985-01-12",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.noeljohansen.com/bio",
        "id": 1457250,
        "imdb_id": "nm1501235",
        "known_for_department": "Acting",
        "name": "Noel Johansen",
        "place_of_birth": "Montreal, Quebec, Canada",
        "popularity": 0.5401,
        "profile_path": "/6KFImoiyLhSF3RxvjRPCRlBp4xQ.jpg"
    }
}