{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qIjyBgsMDbpeEO3CJx7vxVn4KO8.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 549053,
                "original_language": "en",
                "original_title": "Last Christmas",
                "overview": "Kate is a young woman who has a habit of making bad decisions, and her last date with disaster occurs after she accepts work as Santa's elf for a department store. However, after she meets Tom there, her life takes a new turn.",
                "popularity": 2.7989,
                "poster_path": "/kDEjffiKgjuGo2DRzsqfjvW0CQh.jpg",
                "release_date": "2019-11-07",
                "title": "Last Christmas",
                "video": false,
                "vote_average": 7.22,
                "vote_count": 2480,
                "character": "Sarah",
                "credit_id": "5e86553fa5743d00110fba43",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Margaret Jayne Clunie (born 3 October 1987) is an English actress and former model. She is known for her role as Harriet, Duchess of Sutherland in the ITV series Victoria (2016–2017).  Clunie grew up in Rickmansworth, Hertfordshire, the daughter of a business consultant and a medical secretary. She has an older sister. Clunie initially wanted to be a fashion journalist. She studied English at Newcastle University, where she participated in theatre. She went on to graduate from the Oxford School of Drama in 2010. Clunie was 14 when she was scouted to be a model on the Tube. She spent her weekends on shoots and later walked at London Fashion Week, but said she found much of it \"soul destroying\", a \"confidence-crushing conveyor belt\" with \"gorgeous young girls being told they’re not good enough, that they’re fat and look awful\"\n\nClunie made her television debut in a 2012 episode of the BBC One medical soap opera Doctors. The following year, she had a recurring role as Natasha in the second series of the Sky Arts dark comedy A Young Doctor's Notebook with Daniel Radcliffe and Jon Hamm. She made her London stage debut in Hard Feelings at the Finborough Theatre the following year. In 2016 and 2017, Clunie portrayed Harriet, Duchess of Sutherland in the first two series of the ITV biographical drama Victoria. She also played Jess in Danny Sangra's comedy film Goldbricks in Bloom.\n\nIn 2019, Clunie guest starred in an episode of the BBC One crime series Death in Paradise and appeared in the romantic comedy film Last Christmas. This was followed by roles as Ellie in the Greek miniseries Kart postal (or Postcard) in 2021, the Hostess in the Disney+ series Andor in 2022,  and Domenica Howarth in the second series of the Channel 5 crime drama Dalgliesh. Clunie featured in the 2024 John Lewis Christmas advert.",
        "birthday": "1987-10-03",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.42mp.com/talent/margaret-clunie",
        "id": 1457604,
        "imdb_id": "nm3518982",
        "known_for_department": "Acting",
        "name": "Margaret Clunie",
        "place_of_birth": "Rickmansworth, Hertfordshire, England, UK",
        "popularity": 0.4688,
        "profile_path": "/enmPDhrWhZBMpJInxjuQQYroCK5.jpg"
    }
}