{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6L1Co3uRWuoaqDxpWvGDvgXms7T.jpg",
                "genre_ids": [
                    18
                ],
                "id": 976,
                "original_language": "en",
                "original_title": "Sweet Smell of Success",
                "overview": "New York City newspaper writer J.J. Hunsecker holds considerable sway over public opinion with his Broadway column, but one thing that he can't control is his younger sister, Susan, who is in a relationship with aspiring jazz guitarist Steve Dallas. Hunsecker strongly disapproves of the romance and recruits publicist Sidney Falco to find a way to split the couple, no matter how ruthless the method.",
                "popularity": 4.6649,
                "poster_path": "/akzvV8JasNrgEl5iAP9K6zPHGJe.jpg",
                "release_date": "1957-07-04",
                "title": "Sweet Smell of Success",
                "video": false,
                "vote_average": 7.61,
                "vote_count": 539,
                "character": "Frank D' Angelo",
                "credit_id": "52fe4295c3a36847f802a003",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/kPlCjRGUv5okUM8Zsa3xE0sSJHI.jpg",
                "genre_ids": [
                    18
                ],
                "id": 17443,
                "original_language": "en",
                "original_title": "...And Justice for All",
                "overview": "An ethical Baltimore defense lawyer disgusted with rampant legal corruption is forced to defend a judge he despises in a rape trial under the threat of being disbarred.",
                "popularity": 1.7678,
                "poster_path": "/AiAXiqN883MYQMzxeEzAtV9jkU0.jpg",
                "release_date": "1979-10-19",
                "title": "...And Justice for All",
                "video": false,
                "vote_average": 7.07,
                "vote_count": 546,
                "character": "Arnie",
                "credit_id": "52fe47269251416c7508f515",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Scholem Lewin"
        ],
        "biography": "Sam Levene was a Broadway, film, radio and television actor who in a career spanning 5 decades created some of the most legendary comedic roles in American theatrical history. Levene appeared in a staggering list of 38 Broadway productions, 33 of which were the original Broadway productions, including Nathan Detroit, the craps-shooter extraordinaire, in the 1950 original Broadway production of \"Guys and Dolls\", Max Kane, the hapless agent, in the original 1932 Broadway production of \"Dinner at Eight\", Patsy, the comedic gambler, in the 1935 Broadway farce \"Three Men on a Horse\" , Gordon Miller, the shoestring producer, in the original 1937 Broadway production of \"Room Service\",  Sidney Black, the theatrical producer,  in \" Light Up the Sky\" , Horace Vandergelder, the crotchety merchant of Yonkers, in the 1954 premier UK production of Thornton Wilder's \"The Matchmaker\" and Al Lewis, the retired vaudevillian, in the original 1972 Broadway production of Neil Simon's \"The Sunshine Boys\".  Levene was a consistent presence on Broadway for 5 decades; Levene's first Broadway play was in 1927, the last in 1980. Throughout his career Levene effortlessly segued between starring roles in over 100 productions on stage, radio, television and film, appearing in a variety of roles, including policemen, servicemen, gamblers, gangsters, newspaper reporter, theatrical producer, actor's agent, dress manufacturer and even a psychiatrist and was equally adept in segueing from comedy to farce and drama. 9 years after making his Broadway debut, Levene was lured to Hollywood where he made his motion picture debut as Patsy in the 1936 film version of \"Three Men on a Horse\" earning $1,000 a week. Known as a dependable character actor, Levene appeared in 50 films, including 14 at MGM, which included two appearances as Police Lieutenant Abrams in the \"Thin Man\" series. During his five-decade Hollywood career, Levene established himself as one the great film noir stalwarts. Levene's film noir credits include his riveting performance as Samuels, the murdered GI, in \"Crossfire\" (1947), considered by many as one of RKO’s if not perhaps of any studio’s best film noirs. Other film noir credits include: William Holden's taxi-driving brother-in-law \"Siggie\" in \"Golden Boy\" (1939), \"Action in the North Atlantic\" (1943), a Doolittle Flyer and Japanese POW in \"The Purple Heart\" (1944), a police lieutenant in \"The Killers\" (1946), \"Brute Force\" (1947), \"Boomerang\" (1947), \"Killer McCoy\" (1947), \"Dial 1119\" (1950), \"Sweet Smell of Success\" (1957), \"Slaughter on Tenth Avenue\" (1957).\n\nIn 1961 Levene was nominated for the 1961 Tony Award for Best Actor in a play for his performance as Dr. Aldo Meyer in Dore Schary's \"The Devil's Advocate\". Levene never received a Tony;  by the time the Tony's were established in 1947, Levene had already created roles in 16 original Broadway shows, including legendary performances in the original Broadway productions of \"Dinner at Eight\"(1932), \"Three Men on a Horse\" (1935), \"Room Service\" (1937) and \"Margin For Error\" (1939). In 1984, Levene was posthumously inducted in the American Theatre Hall of Fame and in 1998, Sam Levene along with the original Broadway cast of the 1950 \"Guys and Dolls\" Decca cast album posthumously inducted into the Grammy Hall of Fame.",
        "birthday": "1905-08-28",
        "deathday": "1980-12-28",
        "gender": 2,
        "homepage": "http://www.samlevene.com/",
        "id": 14574,
        "imdb_id": "nm0505249",
        "known_for_department": "Acting",
        "name": "Sam Levene",
        "place_of_birth": "Šack, Belarus",
        "popularity": 0.0833,
        "profile_path": "/kATWTkWQdPXS0Ry3OfiYrFHEg0L.jpg"
    }
}