{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6L1Co3uRWuoaqDxpWvGDvgXms7T.jpg",
                "genre_ids": [
                    18
                ],
                "id": 976,
                "original_language": "en",
                "original_title": "Sweet Smell of Success",
                "overview": "New York City newspaper writer J.J. Hunsecker holds considerable sway over public opinion with his Broadway column, but one thing that he can't control is his younger sister, Susan, who is in a relationship with aspiring jazz guitarist Steve Dallas. Hunsecker strongly disapproves of the romance and recruits publicist Sidney Falco to find a way to split the couple, no matter how ruthless the method.",
                "popularity": 4.6649,
                "poster_path": "/akzvV8JasNrgEl5iAP9K6zPHGJe.jpg",
                "release_date": "1957-07-04",
                "title": "Sweet Smell of Success",
                "video": false,
                "vote_average": 7.61,
                "vote_count": 539,
                "character": "Susan Hunsecker",
                "credit_id": "52fe4295c3a36847f8029ffb",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Susan Stewart Harrison"
        ],
        "biography": "From Wikipedia, the free encyclopedia.  Susan Harrison (born August 26, 1938 in Leesburg, Florida) is an American actress. She is most famous for her appearance in the 1957 film noir classic Sweet Smell of Success as the sister for whom Burt Lancaster has an unhealthy affection as well as in The Twilight Zone episode \"Five Characters in Search of an Exit.\"\n\nShe is a graduate of the High School of Performing Arts in New York City, where she played Frankie in Member of the Wedding by Carson McCullers and Eliza Doolittle in George Bernard Shaw's Pygmalion. She attended Boston University, briefly studying under Peter Kass, who directed her in the role of Abigail in Arthur Miller's The Crucible. Her professional debut was in the live television drama Can You Coffeepot on Skates?, presented in 1956. This was followed by television appearances on Matinee Theatre and Alfred Hitchcock Presents and her cinematic debut in Sweet Smell of Success. On October 19, 1957, she opened on Broadway at the Bijou Theater, playing \"the Girl\" in William Saroyan's new play The Cave Dwellers to uniformly good reviews. The following year she was in the Playhouse 90 production of In Lonely Expectation, which brought her to the attention of Rod Serling and led to her role as the ballerina in the iconic Twilight Zone episode. She had several later television and stage roles, most notably in an episode of the television show Bonanza, \"Dark Star.\" In 1960 she played Ruby, the female lead, in the little-seen film Key Witness with Jeffrey Hunter and Dennis Hopper.\n\nBy 1963 she had left public life and acting and devoted herself to family matters, though in the 1990s she played Elberta in a Southern Illinois University production of Mixed Couples. She has since appeared at various film and science fiction conventions.\n\nShe is the mother of Darva Conger, the bride in Who Wants to Marry a Multi-Millionaire?, a controversial Fox reality TV program that aired once in February 2000 and was never repeated. She also has two sons, one deceased, and two stepsons. She lives in Los Angeles, California.\n\nDescription above from the Wikipedia article Susan Harrison, licensed under CC-BY-SA,full list of contributors on Wikipedia. \n\n ",
        "birthday": "1938-08-26",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 14572,
        "imdb_id": "nm0365893",
        "known_for_department": "Acting",
        "name": "Susan Harrison",
        "place_of_birth": "Leesburg, Florida, USA",
        "popularity": 0.0828,
        "profile_path": "/6zDf2O60k7UrSsfo3rWRbaKv5Lb.jpg"
    }
}