{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/nLFxvLokHe3bQmrmAfljIfax2jQ.jpg",
                "genre_ids": [
                    878,
                    80
                ],
                "id": 185,
                "original_language": "en",
                "original_title": "A Clockwork Orange",
                "overview": "In a near-future Britain, young Alexander DeLarge and his pals get their kicks beating and raping anyone they please. When not destroying the lives of others, Alex swoons to the music of Beethoven. The state, eager to crack down on juvenile crime, gives an incarcerated Alex the option to undergo an invasive procedure that'll rob him of all personal agency. In a time when conscience is a commodity, can Alex change his tune?",
                "popularity": 9.6432,
                "poster_path": "/4sHeTAp65WrSSuc05nRBKddhBxO.jpg",
                "release_date": "1971-12-19",
                "title": "A Clockwork Orange",
                "video": false,
                "vote_average": 8.185,
                "vote_count": 13337,
                "character": "Nurse Feeley",
                "credit_id": "630e0cecd051d9009227e1ca",
                "order": 34
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Carol Drinkwater (born 22 April 1948) is an Anglo-Irish actress, author and filmmaker. She portrayed Helen Herriot (née Alderson) in the television adaptation of the James Herriot books All Creatures Great and Small, which led to her receiving the Variety Club Television Personality of the Year award in 1985.\n\nDrinkwater is the daughter of the bandleader and agent, Peter Regan (born Peter Albert Drinkwater) and Irish nurse, Phillis McCormack.\n\nShe was a member of the National Theatre Company under the leadership of Laurence Olivier and has acted in numerous television series and films including the highly successful Chocky, Bouquet of Barbed Wire, Another Bouquet and Golden Pennies. Drinkwater won a Critics' Circle Best Screen Actress award for her role, Anne, in the feature film Father (1990) in which she starred opposite Max von Sydow. Amongst many other film and television series, she has appeared in Stanley Kubrick's A Clockwork Orange (1971), Queen Kong (1976), The Shout (1978), Father (1990), and the film adaptation of Beryl Bainbridge's novel An Awfully Big Adventure (1995), directed by Mike Newell and starring Hugh Grant and Alan Rickman.\n\nShe has written a number of children's books, including her first, The Haunted School, which was produced as a television mini-series and film. Bought by Disney, it won the Chicago International Film Festival Gold Award for Children's Films. Her books for adults include commercial fiction and a series of best-selling memoirs about her experiences on her olive farm in Provence. In 2013 Drinkwater worked on a series of five documentary films inspired by her two Mediterranean travel books, The Olive Route and The Olive Tree. The OLIVE ROUTE films were completed in February 2013 and have since been broadcast on international networks worldwide. In 2015 Penguin Books UK announced a deal signed with Drinkwater to write two epic novels. The first, The Forgotten Summer, was published in March 2016. The second, The Lost Girl, was published in June 2017. Drinkwater revealed to The Guardian, in October 2017, that the experience of the starlet Marguerite in The Lost Girl was based on her own experience of being sexually assaulted by Elia Kazan while auditioning for the leading film role in his film The Last Tycoon (1976).\n\nIn 2018 Penguin signed a second deal with Drinkwater for two more novels. The first, published in May 2019, is The House on The Edge of The Cliff.\n\nShe is married to French TV producer Michel Noll.",
        "birthday": "1948-04-22",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.caroldrinkwater.com/",
        "id": 145875,
        "imdb_id": "nm0237958",
        "known_for_department": "Acting",
        "name": "Carol Drinkwater",
        "place_of_birth": " London, England, UK",
        "popularity": 0.201,
        "profile_path": "/xkc9fWWFVYvXW71oAmO86MZDYpb.jpg"
    }
}