{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/suaEOtk1N1sgg2MTM7oZd2cfVp3.jpg",
                "genre_ids": [
                    53,
                    80,
                    35,
                    18
                ],
                "id": 680,
                "original_language": "en",
                "original_title": "Pulp Fiction",
                "overview": "A burger-loving hit man, his philosophical partner, a drug-addled gangster's moll and a washed-up boxer converge in this sprawling, comedic crime caper. Their adventures unfurl in three stories that ingeniously trip back and forth in time.",
                "popularity": 18.5743,
                "poster_path": "/vQWk5YBFWF4bZaofAbv0tShwBvQ.jpg",
                "release_date": "1994-09-10",
                "title": "Pulp Fiction",
                "video": false,
                "vote_average": 8.5,
                "vote_count": 29079,
                "character": "Diner Patron #2 (uncredited)",
                "credit_id": "5ef88932a284eb00368d3b27",
                "order": 51
            },
            {
                "adult": false,
                "backdrop_path": "/pR3v192B20nFtsHY1jZQS4AkN0a.jpg",
                "genre_ids": [
                    36,
                    53
                ],
                "id": 11973,
                "original_language": "en",
                "original_title": "Thirteen Days",
                "overview": "The story of the Cuban Missile Crisis in 1962—the nuclear standoff with the USSR sparked by the discovery by the Americans of missile bases established on the Soviet-allied island of Cuba.",
                "popularity": 4.5108,
                "poster_path": "/aLx9UXH9fK2v6NDMvMyW4X88K3u.jpg",
                "release_date": "2000-12-25",
                "title": "Thirteen Days",
                "video": false,
                "vote_average": 7.002,
                "vote_count": 786,
                "character": "Reporter (uncredited)",
                "credit_id": "5f4bd79274507d0032b012cf",
                "order": 85
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Richard Rossi is an actor, novelist, filmmaker, musician.  He played guitar on stage at age 7, wowing audiences with songs like 'Somewhere Over the Rainbow.' Richard is the oldest of 5, and had musician parents, Richard and Dorothy. The Rossi family performed in the bars of their hometown of Pittsburgh. As a teen, Richard acted in films such as 'The Fish That Saved Pittsburgh.'\n\nIn 1980, Richard formed a duo with his best friend from school, John Walker, and soon \"Walker and Rossi\" were performing their songs on TV. The Post Gazette compared them to Simon & Garfunkel and called them poets of song.  In 1984, Richard married his wife Sherrie in Lynchburg, Virginia. Sherrie saw Walker-Rossi perform at Liberty U., where they were given a standing ovation by the audience of 5,000. Richard & Sherrie moved back to Pgh. in 1986. Richard reached out to his hometown, performing concerts as a guitar-playing maverick minister at the nightclub Graffiti, Station Square, and Soldier's & Sailors.\n\nIn 1988, Richard and Sherrie became parents. Their daughter Karis was born. Richard was reading the Bible in the original Greek and came to a verse that read 'By grace ('Karis') are you saved.' In March of 1991, their second child, Joshua was born. Richard, Sherrie, Karis, and Joshua hosted dinners for the homeless and Richard hosted his talk-show 'Richard Rossi Live' during evening drive time on WPIT-FM until the station was sold in 1992. The popular program expanded to an international audience and now airs on BlogTalkRadio.\n\nRichard formed partnerships with African American ministers and founded the Multi-Cultural Community Coalition to combat racism. Richard's sermons were thespian, an art-form foretelling his future as an actor.\n\nIn 1996, Richard & family relocated, making a journey to Hollywood. Art became Richard's ministry. Richard took acting classes with another Pittsburgh native,Milton Katselas, and soon Richard was appearing on TV shows like Ally McBeal & Gilmore Girls.\n\nRichard was granted permission to perform the story of evangelist Elmer Gantry. Richard played the lead role & directed his version of the play at Stella Adler Theatre, garnering laudatory reviews. Richard's research revealed the Gantry play was inspired by faith healer Aimee Semple McPherson. This led to Richard's writing, directing, & acting in his films on Sister Aimee ('Saving Sister Aimee' and 'Sister Aimee: The Aimee Semple McPherson Story' in 2008) that he made as an allegory for his former life as an evangelist. ABC called Richard the 'Pastor to the Stars' when it leaked out that he was advisor to stars.\n\nHe released 3 books: his 1st novel, 'Stick Man' a coming-of-age story, a self-help book entitled 'Create Your Life\" and his 3rd book 'Sister Aimee.' Musically, he released 3 albums 'Without Her Love,' 'Seasons of My Heart,' & 'The Kingdom Is Near.' He released his film on Roberto Clemente, 'Baseball's Last Hero,' & '10th Anniversary of Sister Aimee' a remastered collection of both of his films on Aimee McPherson.\n\nHis latest feature \"Canaan Land,\" stars Richard as an evangelist & co-stars Rebecca Holden as Sara Sunday, a female preacher. The film is set for release soon.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.canaanlandmovie.com",
        "id": 1459067,
        "imdb_id": "nm0744302",
        "known_for_department": "Acting",
        "name": "Richard Rossi",
        "place_of_birth": "Pittsburgh, Pennsylvania",
        "popularity": 0.1165,
        "profile_path": "/cj4nsEqmJHRc9ki6382dGVOdUNe.jpg"
    }
}