{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/orXMq2jZy8wFmePv7zXS2Kor7Ug.jpg",
                "genre_ids": [
                    37,
                    27,
                    18
                ],
                "id": 294963,
                "original_language": "en",
                "original_title": "Bone Tomahawk",
                "overview": "During a shootout in a saloon, Sheriff Hunt injures a suspicious stranger. The doctor's assistant, wife of the local foreman, tends to him in prison. That night, the town is attacked and they both disappear—only the arrow of a cannibal tribe is found. Hunt and a few of his men go in search of the prisoner and the foreman's wife.",
                "popularity": 3.0127,
                "poster_path": "/4MmTHpn2Y8emqvBgvOjufImUmKZ.jpg",
                "release_date": "2015-10-23",
                "title": "Bone Tomahawk",
                "video": false,
                "vote_average": 6.871,
                "vote_count": 2382,
                "character": "Ramiro",
                "credit_id": "58e20f5b925141283500a007",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Erick was born and raised in Guatemala. As early as 5 years old Erick  knew he wanted to be an actor. While growing up in a small village with  his grandparents he would reenact scenes from the Soap Operas he had  watched with his grandmother the previous night. As a teenager he moved  to the United States and got the opportunity to go to college to study  business administration. Once in college he enrolled in an intro to  acting class and that's where his childhood dream of being an actor was  reawakened. After that intro to acting class and with much excitement  and fear Erick changed his major to acting. A few years later Erick  received his Bachelor's in Fine Arts degree in theater performance from  the University of Maryland Baltimore County.\n\nBefore pursuing  acting for the camera Erick had the opportunity to perform for the  stage. Some of his favorite roles include Valentin in The Kiss of the  Spider Woman, and Marmeladov in an original production of Crime &amp;  Punishment. Some notable television credits include Eastbound &amp;  Down, The Bridge, Back in The Game and Southland.\n\nThat  combination of excitement and fear Erick felt when switching majors in  college would become a recurring theme in his life as an actor.",
        "birthday": "1979-07-30",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1459830,
        "imdb_id": "nm2974788",
        "known_for_department": "Acting",
        "name": "Erick Chavarria",
        "place_of_birth": "Guatemala City, Guatemala",
        "popularity": 0.1014,
        "profile_path": "/kD3VC8IXsfjaVfp14GfB6nexgeZ.jpg"
    }
}