{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/s90zsx8QQmgkXVhM6TJEYAaWy2I.jpg",
                "genre_ids": [
                    12,
                    18,
                    36
                ],
                "id": 978,
                "original_language": "en",
                "original_title": "Seven Years in Tibet",
                "overview": "Austrian mountaineer Heinrich Harrer journeys to the Himalayas without his family to head an expedition in 1939. But when World War II breaks out, the arrogant Harrer falls into Allied forces' hands as a prisoner of war. He escapes with a fellow detainee and makes his way to Lhasa, Tibet, where he meets the 14-year-old Dalai Lama, whose friendship ultimately transforms his outlook on life.",
                "popularity": 2.6833,
                "poster_path": "/5euQXAgJ34TdUFl1t3O6Jw2lJAs.jpg",
                "release_date": "1997-09-12",
                "title": "Seven Years in Tibet",
                "video": false,
                "vote_average": 7.157,
                "vote_count": 2970,
                "character": "Regent",
                "credit_id": "52fe4295c3a36847f802a12d",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "डैनी डेन्जोंगपा"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nTshering Phintso Denzongpa, widely known by his acting name \"Danny\" Denzongpa (born 25 February 1948) is an Indian actor of Sikkimese ancestry working in Bollywood films.\n\nDenzongpa was born in the state of Sikkim, at that time an independent Bhutia monarchy. He is an ethnic Bhutia and speaks Bhutia as his mother tongue.\n\nHe started his career by singing Indian and Nepali songs and acting in Indian and Nepali movies. His nepali song \"Kaanchi lai ghumaune Kathmandu Sahara\" is still famous among Nepali people after 2 decades. He has acted in numerous Hindi films such as Asoka and 16 December. He has also starred in some international projects, the most famous being Seven Years in Tibet where he acted alongside Hollywood actor Brad Pitt. In 2003, Denzongpa was awarded the Padma Shree, India's fourth highest civilian honour. Denzongpa is noted for his villainous and character roles.\n\nHe started dabbling in the brewing industry after 1982, and in 2009, his company Yuksom Breweries, which has three breweries in Sikkim, Orissa and Assam, and sells over three million cases, acquired Rhino Breweries in Assam, to thwart industry leader United Breweries’ (UB) plans to take over the North East market.\n\nDescription above from the Wikipedia article Danny Denzongpa, licensed under CC-BY-SA, full list of contributors on Wikipedia.​",
        "birthday": "1948-02-25",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 14596,
        "imdb_id": "nm0219939",
        "known_for_department": "Acting",
        "name": "Danny Denzongpa",
        "place_of_birth": "Sikkim, India",
        "popularity": 0.264,
        "profile_path": "/xDNLtgG8iDXxNRvSDjpuNSNfKvX.jpg"
    }
}