{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/s90zsx8QQmgkXVhM6TJEYAaWy2I.jpg",
                "genre_ids": [
                    12,
                    18,
                    36
                ],
                "id": 978,
                "original_language": "en",
                "original_title": "Seven Years in Tibet",
                "overview": "Austrian mountaineer Heinrich Harrer journeys to the Himalayas without his family to head an expedition in 1939. But when World War II breaks out, the arrogant Harrer falls into Allied forces' hands as a prisoner of war. He escapes with a fellow detainee and makes his way to Lhasa, Tibet, where he meets the 14-year-old Dalai Lama, whose friendship ultimately transforms his outlook on life.",
                "popularity": 2.6833,
                "poster_path": "/5euQXAgJ34TdUFl1t3O6Jw2lJAs.jpg",
                "release_date": "1997-09-12",
                "title": "Seven Years in Tibet",
                "video": false,
                "vote_average": 7.157,
                "vote_count": 2969,
                "character": "British Officer",
                "credit_id": "52fe4295c3a36847f802a129",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/lS2bIZ4gMvhYwgpTHOJaVvu8qMD.jpg",
                "genre_ids": [
                    12,
                    18,
                    10751
                ],
                "id": 9036,
                "original_language": "en",
                "original_title": "Eight Below",
                "overview": "In the Antarctic, after an expedition with Dr. Davis McClaren, the sled dog trainer Jerry Shepherd has to leave the polar base with his colleagues due to the proximity of a heavy snow storm. He ties his dogs to be rescued after, but the mission is called-off and the dogs are left alone at their own fortune. For six months, Jerry tries to find a sponsor for a rescue mission.",
                "popularity": 4.4872,
                "poster_path": "/39hR806Me4wI42LCFcK2LBiCRGW.jpg",
                "release_date": "2006-02-17",
                "title": "Eight Below",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 1756,
                "character": "Captain Lovett",
                "credit_id": "5e67a58955c9260013648735",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Duncan Fraser is a British-born Canadian actor. He is most noted for his performance in the 1985 film Overnight, for which he was a Genie Award nominee for Best Supporting Actor at the 7th Genie Awards in 1986, and his regular role as Staff Sgt. Regan in Da Vinci's Inquest, for which he was a Gemini Award nominee for Best Supporting Actor in a Drama Series at the 15th Gemini Awards in 2000.\n\nBorn in Manchester, England, Fraser planned to study aeronautical engineering at London University, but switched to psychology after finding engineering too technical and mathematical. Following university he travelled around the world for a number of years, before settling in the Vancouver area in 1974 and working as an actor. He spent a number of years as director of the Nanaimo Theatre Festival, and as associate director of Vancouver's Fend Players theatre company.\n\nFraser was also known for his regular television roles as Zack Denny in Bordertown, Mac McDougall in The Heights, Colonel Munro in Hawkeye, and Brian Brewster in Hope Island.\n\nDescription above from the Wikipedia article Duncan Fraser (actor), licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 14595,
        "imdb_id": "nm0292114",
        "known_for_department": "Acting",
        "name": "Duncan Fraser",
        "place_of_birth": "Greater Manchester, England, UK",
        "popularity": 0.233,
        "profile_path": "/ckiY9K7fwH5KRuTE3IM5kelwm0c.jpg"
    }
}