{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cMUReq46MSz6WWsdW1Gu8oecJlc.jpg",
                "genre_ids": [
                    18
                ],
                "id": 10637,
                "original_language": "en",
                "original_title": "Remember the Titans",
                "overview": "After leading his football team to 15 winning seasons, coach Bill Yoast is demoted and replaced by Herman Boone – tough, opinionated and as different from the beloved Yoast as he could be. The two men learn to overcome their differences and turn a group of hostile young men into champions.",
                "popularity": 5.4502,
                "poster_path": "/825ohvC4wZ3gCuncCaqkWeQnK8h.jpg",
                "release_date": "2000-09-29",
                "title": "Remember the Titans",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 2783,
                "character": "Nurse Allice",
                "credit_id": "56b4b350925141662c002714",
                "order": 37
            },
            {
                "adult": false,
                "backdrop_path": "/zHkQEQzoLAJwlMif4QJP1jjbsky.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 330483,
                "original_language": "en",
                "original_title": "The Choice",
                "overview": "Travis and Gabby first meet as neighbors in a small coastal town and wind up in a relationship that is tested by life's most defining events.",
                "popularity": 3.3178,
                "poster_path": "/6MF3cdAasnF17SG9bmeamQ066iJ.jpg",
                "release_date": "2016-02-04",
                "title": "The Choice",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 1923,
                "character": "Cora",
                "credit_id": "57baf31492514109b30026c2",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Sharon Blackwood was reared in the small town of Greensboro, Georgia. This upbringing served her well in her first television guest roles, on I'll Fly Away and In the Heat of the Night. She has been fortunate to work opposite Sidney Poitier, Kenneth Branagh, Ellen Burstyn, Tom Wilkinson, Joel Edgerton, Ruth Negga, Jason Bateman and Diane Keaton. Her feature films include Robert Zemeckis' \"Flight\" and Boaz Yakin's , \"Remember the Titans\" both starring Denzel Washington; Ross Katz's The Choice; Gregory Jacobs' Magic Mike XXL; Andy Tennant's Sweet Home Alabama. She also appeared in Terence Davies' The Neon Bible and as Lola Loving in \"Loving\", both of which were nominated for the Palm D'or at the Cannes Film Festival.\n\nMs. Blackwood began her acting career in the theatre. Beginning with the role of Ada in \"Tobacco Road\", she then did very diverse characters including Aunt Julia in \"Hedda Gabler\", Woman (Veronica) in \"Veronica's Room\" as well as performing in the musical \"Side by Side by Sondheim. She received Bachelor and Master of Music degrees from West Georgia College, where she studied voice with Metropolitan Opera Soprano Inge Manski-Lundeen; with whom she studied throughout her career. Her favorite operatic roles include Dorabella in Cosi Fan Tutte and Mother in Amahl and the Night Visitors. She continues as an Oratorio soloist in Atlanta, Ga.\n\nMs. Blackwood is a former Vice President of the League of Women Voters of Georgia and continues her work with them and other service organizations.\n\nMarried to Michael Blackwood for over 45 years, she has two daughters and two grandchildren who have been her support and inspiration throughout her career.",
        "birthday": "1952-10-02",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 146025,
        "imdb_id": "nm0085994",
        "known_for_department": "Acting",
        "name": "Sharon Blackwood",
        "place_of_birth": "Greensboro, Georgia, USA",
        "popularity": 0.9105,
        "profile_path": "/sdbIIWqcIinNGP0OZbEWX3rEpLo.jpg"
    }
}