{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uZzVtRO2aV9gtFx9WHNZ2nR9z55.jpg",
                "genre_ids": [
                    16,
                    35,
                    878,
                    28,
                    14
                ],
                "id": 13253,
                "original_language": "en",
                "original_title": "Futurama: Bender's Game",
                "overview": "When Leela is insulted by a group of space-rednecks (like regular rednecks, but in space), she enters the Planet Express ship in a demolition derby. Leela emerges victorious, but when she brings the damaged ship home, and the Professor sees the fuel gauge, he's enraged by the hit he's going to take at the Dark Matter pump.  Now the crew have to find a way to break Mom's stranglehold on starship fuel, even if they have to wade through a Lord of the Rings-inspired fantasy-land to do it!",
                "popularity": 0.9806,
                "poster_path": "/bx8OVOBn5WP9TJJuOpRzyMCdzzb.jpg",
                "release_date": "2008-11-03",
                "title": "Futurama: Bender's Game",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 565,
                "character": "Rich Little (voice)",
                "credit_id": "60600e578c0a48003e0e2be5",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Richard Caruthers Little",
            "The Man of a Thousand Voices"
        ],
        "biography": "​Born in Canada, Rich Little got his start just like almost every other comic of his time - night clubs. he was a very popular comic in these clubs, but if there was one thing Rich was best known for, it was impersonations. He studied the voices of many stars his whole life, stars like James Stewart, Johnny Carson, Don Rickles, Dean Martin, Truman Capote and George Burns. In the late 1960s, Rich was dubbed \"the best impressionist in the world.\" During the 1970s, however, a rivalry began between him and fellow impressionist Frank Gorshin, who is five years older. Ultimately, Rich overpowered Gorshin and remained the best impressionist in the world. In 1973 Rich became more associated with Dean Martin and made countless appearances on the \"Dean Martin Celebrity Roasts,\" honoring most of the people he impersonated. Besides impressions, Rich also had a successful career as a narrator in many stories, made many appearances in TV series, and hosted many TV shows. He also made his first movie, as Otterlake in The Other Side of the Wind (1972) in 1972. His acting career wasn't as successful as his impressions, but he did have a great talent. After the 1980s, Rich calmed down and moved away from the limelight.  In 1998, Rich took a look back at his most remembered moments of his career: his appearances on the \"Dean Martin Roasts,\" in an infomercial to promote the Roast videos. Rich says he will ALWAYS remember those moments.",
        "birthday": "1938-11-26",
        "deathday": null,
        "gender": 2,
        "homepage": "http://richlittle.com/",
        "id": 146138,
        "imdb_id": "nm0514648",
        "known_for_department": "Acting",
        "name": "Rich Little",
        "place_of_birth": "Ottawa, Ontario, Canada",
        "popularity": 0.2207,
        "profile_path": "/eFqZRAM1Woim3BL4fAMPubZNmN8.jpg"
    }
}