{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1RWLMyC9KcFfcaoViMiJGSSZzzr.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 100402,
                "original_language": "en",
                "original_title": "Captain America: The Winter Soldier",
                "overview": "After the cataclysmic events in New York with The Avengers, Steve Rogers, aka Captain America is living quietly in Washington, D.C. and trying to adjust to the modern world. But when a S.H.I.E.L.D. colleague comes under attack, Steve becomes embroiled in a web of intrigue that threatens to put the world at risk. Joining forces with the Black Widow, Captain America struggles to expose the ever-widening conspiracy while fighting off professional assassins sent to silence him at every turn. When the full scope of the villainous plot is revealed, Captain America and the Black Widow enlist the help of a new ally, the Falcon. However, they soon find themselves up against an unexpected and formidable enemy—the Winter Soldier.",
                "popularity": 8.6751,
                "poster_path": "/tVFRpFw3xTedgPGqxW0AOI8Qhh0.jpg",
                "release_date": "2014-03-20",
                "title": "Captain America: The Winter Soldier",
                "video": false,
                "vote_average": 7.655,
                "vote_count": 19406,
                "character": "CIA Instructor",
                "credit_id": "5897be62c3a368770e001154",
                "order": 54
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Amin Nazemzadeh"
        ],
        "biography": "Dominic Rains (born Amin Nazemzadeh) is an Iranian-born American actor, known for his starring role as Dr. Crockett Marcel in NBC's Chicago Med.\n\nHe appeared as Kasius, the main antagonist of the first part of the fifth season of Marvel's Agents of SHIELD. He had a recurring role as Kahmir DeJean in the short-lived series FlashForward; as well as a starring role as Dr. Leo Julian in General Hospital and General Hospital: Night Shift.",
        "birthday": "1982-03-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 146411,
        "imdb_id": "nm1487670",
        "known_for_department": "Acting",
        "name": "Dominic Rains",
        "place_of_birth": "Tehran, Iran",
        "popularity": 0.7185,
        "profile_path": "/fOTgkYQWryERySm6nX4wkfjRx1H.jpg"
    }
}