{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3uIHgW5SAaa8kP24aoFvgf9hjOX.jpg",
                "genre_ids": [
                    18
                ],
                "id": 393729,
                "original_language": "fr",
                "original_title": "Divines",
                "overview": "In a ghetto where religion and drug trafficking rub shoulders, Dounia has a lust for power and success. Supported by Maimouna, her best friend, she decides to follow in the footsteps of Rebecca, a respected dealer. But her encounter with Djigui, a young, disturbingly sensual dancer, throws her off course.",
                "popularity": 1.5727,
                "poster_path": "/gOwIZPNFstt9BWUyekMzSF2Wzd1.jpg",
                "release_date": "2016-08-31",
                "title": "Divines",
                "video": false,
                "vote_average": 7.692,
                "vote_count": 667,
                "character": "Myriam, la mère",
                "credit_id": "57833cde925141742a004032",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "مجدولين الإدريسي"
        ],
        "biography": "Idrissi was born in Rabat in 1977. Her parents are of Berber ancestry. Idrissi dreamed of becoming a ballerina, enrolling in ballet lessons at the age of four. At age 16, she moved to Montreal to study business management, and discovered her passion for cinema after she went with a friend to a theater competition. In 2003, she made her film debut in El Bandia, which was popular among younger audiences. She starred as Habiba in the 2006 film La Symphonie marocaine, directed by Kamal Kamal. Idrissi played Jamila in Souad Hamidou's 2009 film Camille and Jamila. She portrayed Rihanna, a sick girl at a mental asylum, in Pégase in 2010, and received her first prize for her performance. In 2016, Idrissi played Myriam, one of the leading female roles, in Divines, directed by Houda Benyamina. The film won the Caméra d'Or at the Cannes Film Festival. Idrissi has also acted in theatrical productions and has been praised for her versatility as an actress.",
        "birthday": "1977-03-10",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1464081,
        "imdb_id": "nm2404251",
        "known_for_department": "Acting",
        "name": "Majdouline Idrissi",
        "place_of_birth": "Rabat, Morocco",
        "popularity": 0.1434,
        "profile_path": "/y4FYWaf0ItuPhejBF0453RWp3a3.jpg"
    }
}