{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/titl6uMe5u974sLAA2Zy1kFi4sC.jpg",
                "genre_ids": [
                    18,
                    28,
                    36,
                    53
                ],
                "id": 612,
                "original_language": "en",
                "original_title": "Munich",
                "overview": "During the 1972 Olympic Games in Munich, eleven Israeli athletes are taken hostage and murdered by a Palestinian terrorist group known as Black September. In retaliation, the Israeli government recruits a group of Mossad agents to track down and execute those responsible for the attack.",
                "popularity": 4.4464,
                "poster_path": "/iUekaw96QLInZpsNwRTlRKrZgwm.jpg",
                "release_date": "2005-12-23",
                "title": "Munich",
                "video": false,
                "vote_average": 7.143,
                "vote_count": 2805,
                "character": "Yussef's Wife",
                "credit_id": "624a4e55713ea6004de5667d",
                "order": 48
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Souad Ben Hessaoud"
        ],
        "biography": "Souad Amidou (born 4 July 1959) is a French actress.\n\nShe is the daughter of the actor Amidou. Her career started working with her father on the short film Le thé à la menthe in 1963. Then she was chosen by Claude Lelouch to play the daughter of Anouk Aimée in Un homme et une femme in 1966.\n\nWhen she was younger, she followed acting lessons from Anicette Fray. She followed her training at the \"New Square Sylvia Monfort\" then continued at Jean-Louis Martin-Barbaz, then with John Strasberg and Andreas Voutsinas.\n\nFrom the early 1980s, she was acting in cinema and television. She became popular with her role in Le Grand frère from Francis Girod that got her a nomination for the Caesar of the best female hope. She also worked under the direction of Gérald Oury, Jacques Deray, Ariel Zeitoun, Gérard Lauzier and Steven Spielberg.\n\nOn 23 December 1987 she married the director Fabien Onteniente; the couple broke up on 15 March 1991.\n\nShe received the Legion of Honour decoration in 2008.\n\nIn 2009, she directed the first short film Camille and Jamila, but she proved her talent as a filmmaker with her second film Rendez-vous avec Ninette, presented in many festivals.\n\nSouad Amidou is vegan, member of the sponsorship committee of the Institut citoyen du cinéma and member of the NGO Vegan Marathon.\n\nSource: Article \"Souad Amidou\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1959-07-04",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 146628,
        "imdb_id": "nm0024850",
        "known_for_department": "Acting",
        "name": "Souad Amidou",
        "place_of_birth": "Nanterre, Seine [now Hauts-de-Seine], France",
        "popularity": 0.1315,
        "profile_path": "/yxuuIMVcxZvVvSb1lHqqXURRGZS.jpg"
    }
}