{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ft8WRF2xqEwwGWa59naDUybKTAx.jpg",
                "genre_ids": [
                    18,
                    10752,
                    10749
                ],
                "id": 770,
                "original_language": "en",
                "original_title": "Gone with the Wind",
                "overview": "The spoiled daughter of a Georgia plantation owner conducts a tumultuous romance with a cynical profiteer during the American Civil War and Reconstruction Era.",
                "popularity": 7.332,
                "poster_path": "/lNz2Ow0wGCAvzckW7EOjE03KcYv.jpg",
                "release_date": "1939-12-15",
                "title": "Gone with the Wind",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 4191,
                "character": "Yankee Deserter",
                "credit_id": "52fe4274c3a36847f801fea5",
                "order": 25
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Paul Causey Hurst",
            "Paul C. Hurst"
        ],
        "biography": "Paul Hurst (October 15, 1888 - February 27, 1953) was an American character actor of prodigious output who also directed and wrote silent films. Much of his early work was in low budget western films. A native of central California, Hurst had a first-hand knowledge of Western lore, growing up surrounded by the multi-million acre Lux & Miller ranches which ran cattle throughout the state. Visiting San Francisco as a young man, Hurst became involved in amateur theatricals and thereafter traveled to Los Angeles to join in the emerging film industry there. He began appearing in films as early as 1912, most of them Westerns. By 1916, he was directing them as well (some sources report that he served in the First World War as a member of the French Foreign Legion, but the dates of his film projects make this story highly suspect).\n\nIn the early 1920s, Hurst wrote several scenarios for films he directed and appeared in. He proved adept at working as a director for some of the cheapest producers along Gower Gulch, where movies were normally shot on location in a week or less and where stunt men were often the highest paid folks on the set. Within a few years, he focused all of his energies into acting, notably becoming one of the few successes to emerge from Hollywood's Poverty Row. Hurst quickly became one of the more prolific and familiar characters in American movies. With his blocky build and squinty demeanor, and with a raspy voice that enhanced his memorability once sound pictures came in, Hurst played villains and cops and comedy sidekicks in more than 250 films. His most famous role was that of the deserter shot dead on the stairway of Tara by Vivien Leigh in Gone with the Wind (1939). Hurst was the sidekick to Monte Hale in a number of B-Westerns. Former Gower Gulch veteran John Wayne hired Hurst for Big Jim McLain (1952) knowing that Hurst was ill with terminal cancer. In 1953, at the age of 64, due to his health problems, Paul Hurst committed suicide.\n\nDate of Death: 27 February 1953, Hollywood, California  (suicide)",
        "birthday": "1888-10-14",
        "deathday": "1953-02-27",
        "gender": 2,
        "homepage": null,
        "id": 14664,
        "imdb_id": "nm0403636",
        "known_for_department": "Acting",
        "name": "Paul Hurst",
        "place_of_birth": "Traver, California, USA",
        "popularity": 0.2308,
        "profile_path": "/fs73WLszYIJuwUfmWkQExPN5zqj.jpg"
    }
}