{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cLZxnkj75cGBK1tLTMyIudOZYZk.jpg",
                "genre_ids": [
                    99
                ],
                "id": 1777,
                "original_language": "en",
                "original_title": "Fahrenheit 9/11",
                "overview": "Michael Moore's view on how the Bush administration allegedly used the tragic events on 9/11 to push forward its agenda for unjust wars in Afghanistan and Iraq.",
                "popularity": 3.8937,
                "poster_path": "/1WQgOCJj22zF7Bsr0pIBgGBr71q.jpg",
                "release_date": "2004-06-25",
                "title": "Fahrenheit 9/11",
                "video": false,
                "vote_average": 7.084,
                "vote_count": 1460,
                "character": "Self (archive footage)",
                "credit_id": "52fe4314c3a36847f8038b73",
                "order": 15
            },
            {
                "adult": false,
                "backdrop_path": "/wONHmd6x0UW6AV1DLzxlNwH9sQn.jpg",
                "genre_ids": [
                    53,
                    36,
                    18
                ],
                "id": 393624,
                "original_language": "en",
                "original_title": "Official Secrets",
                "overview": "The true story of British intelligence whistleblower Katharine Gun who—prior to the 2003 Iraq invasion—leaked a top-secret NSA memo exposing a joint US-UK illegal spying operation against members of the UN Security Council. The memo proposed blackmailing member states into voting for war.",
                "popularity": 3.3583,
                "poster_path": "/lyCGqSkT3PqLYQXiWs4FCVJBAYW.jpg",
                "release_date": "2019-08-30",
                "title": "Official Secrets",
                "video": false,
                "vote_average": 7.206,
                "vote_count": 1038,
                "character": "Self (archive footage) (uncredited)",
                "credit_id": "5db75b740f2fbd001772776c",
                "order": 46
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Anthony Charles Lynton Blair",
            "托尼·布莱尔"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nAnthony Charles Lynton Blair (born 6 May 1953) is a former British Labour Party politician who served as the Prime Minister of the United Kingdom from 2 May 1997 to 27 June 2007. He was the Member of Parliament (MP) for Sedgefield from 1983 to 2007 and Leader of the Labour Party from 1994 to 2007. He resigned from all of these positions in June 2007.\n\nTony Blair was elected Leader of the Labour Party in the leadership election of July 1994, following the sudden death of his predecessor, John Smith. Under his leadership, the party adopted the term \"New Labour\" and moved away from its traditional left wing position towards the centre ground. Blair subsequently led Labour to a landslide victory in the 1997 general election. At 43 years old, he became the youngest Prime Minister since Lord Liverpool in 1812. In the first years of the New Labour government, Blair's government implemented a number of 1997 manifesto pledges, introducing the minimum wage, Human Rights Act and Freedom of Information Act, and carrying out devolution, establishing the Scottish Parliament, the National Assembly for Wales, and the Northern Ireland Assembly.\n\nBlair's role as Prime Minister was particularly visible in foreign and security policy, including in Northern Ireland, where he was involved in the 1998 Good Friday Agreement. From the start of the War on Terror in 2001, Blair strongly supported the foreign policy of US President George W. Bush, notably by participating in the 2001 invasion of Afghanistan and 2003 invasion of Iraq. Blair is the Labour Party's longest-serving Prime Minister, the only person to have led the Labour Party to three consecutive general election victories, and the only Labour Prime Minister to serve consecutive terms more than one of which was at least four years long.\n\nHe was succeeded as Leader of the Labour Party on 24 June 2007 and as Prime Minister on 27 June 2007 by Gordon Brown. On the day he resigned as Prime Minister, he was appointed the official Envoy of the Quartet on the Middle East. In May 2008, Blair launched his Tony Blair Faith Foundation. This was followed in July 2009 by the launching of the Faith and Globalisation Initiative with Yale University in the USA, Durham University in the UK and the National University of Singapore in Asia to deliver a postgraduate programme in partnership with the Foundation.\n\nDescription above from the Wikipedia article Tony Blair, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1953-05-06",
        "deathday": null,
        "gender": 2,
        "homepage": "https://institute.global/",
        "id": 146687,
        "imdb_id": "nm0086363",
        "known_for_department": "Acting",
        "name": "Tony Blair",
        "place_of_birth": "Edinburgh, Scotland, UK",
        "popularity": 0.098,
        "profile_path": "/8d2ImyiI2fNSFW365FHsSmsfDvW.jpg"
    }
}