{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/Ac2s9RJEi1ZeaQopoLsqlsmWQmx.jpg",
                "genre_ids": [
                    18
                ],
                "id": 85350,
                "original_language": "en",
                "original_title": "Boyhood",
                "overview": "The film tells a story of a divorced couple trying to raise their young son. The story follows the boy for twelve years, from first grade at age 6 through 12th grade at age 17-18, and examines his relationship with his parents as he grows.",
                "popularity": 3.9047,
                "poster_path": "/2BvtvDUyxiMJ4dmKfiQf4qdOHQN.jpg",
                "release_date": "2014-06-05",
                "title": "Boyhood",
                "video": false,
                "vote_average": 7.493,
                "vote_count": 5326,
                "character": "Jimmy",
                "credit_id": "5557058ec3a368776f005e27",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/gXPtXbvI0nfLihu1dXgehAxsvm1.jpg",
                "genre_ids": [
                    18,
                    53,
                    80,
                    12
                ],
                "id": 1541,
                "original_language": "en",
                "original_title": "Thelma & Louise",
                "overview": "Taking a break from their dreary lives, close friends Thelma and Louise embark on a short weekend trip that ends in unforeseen incriminating circumstances. As fugitives, both women rediscover the strength of their bond and their newfound resilience.",
                "popularity": 5.6945,
                "poster_path": "/vbRAGLzbC75QfiKD1lKjmnQGuph.jpg",
                "release_date": "1991-05-24",
                "title": "Thelma & Louise",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 3655,
                "character": "Singer in Bar Band (uncredited)",
                "credit_id": "5b2385190e0a265b6300490d",
                "order": 23
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Charles Wayne Sexton",
            "Arc Angels"
        ],
        "biography": "Charlie Wayne Sexton was born 11 August 1968, in San Antonio, Texas, to Kay and Mike Sexton. He was what many considered a musically gifted child. He signed his first record deal at MCA Records at the age of 16 and recorded his first album, \"Pictures For Pleasures\", when he met Bob Dylan. \"Pictures For Pleasures\" was released in 1985, along with a music video, \"Hold Me\", which aired on MTV in 1985. This was the first time the world outside of Austin was introduced to a man named Charlie Sexton.\n\nIn 1987 Charlie toured with David Bowie\n\n on the Glass Spider Tour and the following year played backup on his brother Will's debut album, \"Will & The Kill\". In 1989 Charlie made his second album titled \"Charlie Sexton\". Charlie has appeared on soundtracks for such movies as Le flic de Beverly Hills 2 (1987), Air America (1990) and Thelma & Louise (1991). He toured with Dylan for two years as his guitarist. He joined the band Arc Angels in the early 1990s, and while with them released an album entitled \"Arc Angels\" in 1992. In 1994 he went on to have small role in the movie F.T.W. (1994), playing a cowboy named Slim. After the breakup of Arc Angels he formed Charlie Sexton & Sextet in 1995 and the group released the album \"Under the Wishing Tree\". When Charlie left the band in 2002 he went on to produce other artists' albums. In 2003 he joined Dylan once again, this time for a movie project, Masked and Anonymous(2003).\n\nCharlie produced and also played guitar and other instruments on 'Edie Brickell\"s \"Volcano\" album (2003). He has stayed in the music business since he first started, with all the ups and downs that come with a music career, and has never given up on what he loves - the music. Both Charlie & Will Sexton still have as many fans all over the world as they did the day they started.",
        "birthday": "1968-08-11",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1467543,
        "imdb_id": "nm0786631",
        "known_for_department": "Acting",
        "name": "Charlie Sexton",
        "place_of_birth": "San Antonio, Texas, USA",
        "popularity": 0.1588,
        "profile_path": "/lvLDURaLppIO7RtbZlkWEBGyQH1.jpg"
    }
}