{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/Ac2s9RJEi1ZeaQopoLsqlsmWQmx.jpg",
                "genre_ids": [
                    18
                ],
                "id": 85350,
                "original_language": "en",
                "original_title": "Boyhood",
                "overview": "The film tells a story of a divorced couple trying to raise their young son. The story follows the boy for twelve years, from first grade at age 6 through 12th grade at age 17-18, and examines his relationship with his parents as he grows.",
                "popularity": 3.4778,
                "poster_path": "/2BvtvDUyxiMJ4dmKfiQf4qdOHQN.jpg",
                "release_date": "2014-06-05",
                "title": "Boyhood",
                "video": false,
                "vote_average": 7.493,
                "vote_count": 5326,
                "character": "Book Release Emcee",
                "credit_id": "555705059251412ff9003ac7",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Mark Finn is an actor, an author, a pop culture critic, and a playwright. His biography, Blood and Thunder: The Life and Art of Robert E. Howard, was nominated for a World Fantasy award in 2007 and he is a nationally recognized authority on the Texas author. His articles, essays, and introductions about Robert E. Howard and his works have appeared in publications for the Robert E. Howard Foundation, Dark Horse Comics, Boom! Comics, The Cimmerian, REH: Two-Gun Raconteur, The Howard Review, Wildside Press, and he has presented papers about Robert E. Howard to the PCA/ACA National conference, the AWC, and lectures and performs readings regularly.\n\nAs the creative director of the old time radio troupe, The Violet Crown Radio Players (2002-2007), Finn wrote, produced, directed and starred in a number of old time radio plays, including a one hour adaptation of \"King Kong,\" which was nominated for a B.Iden Payne award in 2005. He lives in North Texas.\n\n- IMDb Mini Biography By: Mark Finn",
        "birthday": null,
        "deathday": null,
        "gender": 0,
        "homepage": null,
        "id": 1467542,
        "imdb_id": "nm4227286",
        "known_for_department": "Acting",
        "name": "Mark Finn",
        "place_of_birth": null,
        "popularity": 0.0357,
        "profile_path": null
    }
}