{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/Ac2s9RJEi1ZeaQopoLsqlsmWQmx.jpg",
                "genre_ids": [
                    18
                ],
                "id": 85350,
                "original_language": "en",
                "original_title": "Boyhood",
                "overview": "The film tells a story of a divorced couple trying to raise their young son. The story follows the boy for twelve years, from first grade at age 6 through 12th grade at age 17-18, and examines his relationship with his parents as he grows.",
                "popularity": 3.4778,
                "poster_path": "/2BvtvDUyxiMJ4dmKfiQf4qdOHQN.jpg",
                "release_date": "2014-06-05",
                "title": "Boyhood",
                "video": false,
                "vote_average": 7.493,
                "vote_count": 5326,
                "character": "Make Out Girl",
                "credit_id": "55582e37c3a368776c007446",
                "order": 42
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Megan Sean-Nicole Devine"
        ],
        "biography": "Megan Devine has always had a free spirit to be herself and a witty personality that hides nothing. Megan Sean-Nicole Devine was born June 9, 1994 in Austin, Texas and was home schooled since first grade with her siblings. Megan began her love for performing when she started competitive figure skating at the young age of 7. Knowing she had a passion for the spotlight she wanted to try something new.\n\nIn the summer of 2004 Megan asked her mother if she could start acting and modeling. With her younger sister by two and a half years, Kristen Noelle Devine\n\n, they began taking workshops and training with local coaches. Megan's first role was playing the role of the \"popular girl\" in First Kiss (2005), which has two million YouTube views. Megan has steadily built her resume with film, commercial, theater, industrial and print credits. Her modeling credits include Texas Department of Agriculture, Neiman Marcus, Lake Austin Spa Resort and full window displays for C. Jane Boutique in Austin, TX. Megan's commercial credits include Wal-Mart, Verizon and Poptent.\n\nIn 2011 Megan filmed three feature films. Two supporting roles in Richard Linklater\n\nfilmed Boyhood and in the film The Truth (2015) and a lead role for the film The Age of Reason (2014). All three films are scheduled to be release 2014.\n\nMegan keeps busy with friends and family, modeling and teaching preschool at a local gymnastics facility. One of the things she loves the most, about the business, is making new friends on every set.\n\n- IMDb Mini Biography",
        "birthday": "1994-06-09",
        "deathday": null,
        "gender": 0,
        "homepage": "http://www.megandevine.biz/",
        "id": 1467928,
        "imdb_id": "nm2113991",
        "known_for_department": "Acting",
        "name": "Megan Devine",
        "place_of_birth": "Austin, Texas, USA",
        "popularity": 0.0256,
        "profile_path": null
    }
}