{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/Ac2s9RJEi1ZeaQopoLsqlsmWQmx.jpg",
                "genre_ids": [
                    18
                ],
                "id": 85350,
                "original_language": "en",
                "original_title": "Boyhood",
                "overview": "The film tells a story of a divorced couple trying to raise their young son. The story follows the boy for twelve years, from first grade at age 6 through 12th grade at age 17-18, and examines his relationship with his parents as he grows.",
                "popularity": 3.4778,
                "poster_path": "/2BvtvDUyxiMJ4dmKfiQf4qdOHQN.jpg",
                "release_date": "2014-06-05",
                "title": "Boyhood",
                "video": false,
                "vote_average": 7.493,
                "vote_count": 5326,
                "character": "Mason's Boss",
                "credit_id": "55584b4592514129b7001366",
                "order": 53
            },
            {
                "adult": false,
                "backdrop_path": "/scQf03Fm3jeyv4FH04qvi4fp4wh.jpg",
                "genre_ids": [
                    80,
                    35,
                    28
                ],
                "id": 402900,
                "original_language": "en",
                "original_title": "Ocean's Eight",
                "overview": "Debbie Ocean, a criminal mastermind, gathers a crew of female thieves to pull off the heist of the century at New York's annual Met Gala.",
                "popularity": 9.568,
                "poster_path": "/MvYpKlpFukTivnlBhizGbkAe3v.jpg",
                "release_date": "2018-06-07",
                "title": "Ocean's Eight",
                "video": false,
                "vote_average": 6.968,
                "vote_count": 8525,
                "character": "Lawrence",
                "credit_id": "5b2185080e0a264d930110c7",
                "order": 39
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Richard recently played George Pappas on David E. Kelley's Big Shot with John Stamos and Yvette Nicole Brown on Disney+. Next year you can see him in the feature film The Long Game. Recent credits include Ocean's 8 and Where'd You Go Bernadette? with Cate Blanchett. This marks Richard's 4th film with award-winning director Richard Linklater. Other credits include: Boyhood, which was nominated for six Academy Awards and won the Golden Globe for Best Picture, The Book of Love, with Jason Sudeikis and Jessica Biel with all original music by Justin Timberlake, Bernie, opposite Shirley MacLaine and Jack Black, as well as extensive television credits. His theatre credits include the Shakespeare Theatre in Washington, D.C., Yale Repertory Theatre, Mark Taper Forum, and great theatres in New York, California and everywhere in between.\n\nAs a speaker and educator Richard is a passionate advocate for arts education. He has been a guest artist and teacher at many of the top programs in the country including Yale, Juilliard, Penn State, and UCSD where he was the Arthur and Molli Wagner Endowed Chair in Acting. During his tenure at UCSD it was ranked the #3 program in the world by the Hollywood Reporter. He has delivered keynote addresses and conducted masterclasses for students and teachers at dozens of conferences, festivals and schools. He is also a judge for the College Television Awards presented by the Emmys. He is a member of The Television Academy, SAG-AFTRA, Actors Equity, and Stage Directors and Choreographers Society. He is a highly sought after coach for actors, artists, and leaders in business and education.",
        "birthday": "1972-12-22",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.richardrobichaux.com/",
        "id": 1467970,
        "imdb_id": "nm1767468",
        "known_for_department": "Acting",
        "name": "Richard Robichaux",
        "place_of_birth": "Channelview, Texas, USA",
        "popularity": 0.1239,
        "profile_path": "/njqjUdziijDcTZtkm0Gtfybfs35.jpg"
    }
}