{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/iItypZVpdnxTFgA0iv345AzMUqk.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 981,
                "original_language": "en",
                "original_title": "The Philadelphia Story",
                "overview": "When a rich woman's ex-husband and a tabloid-type reporter turn up just before her planned remarriage, she begins to learn the truth about herself.",
                "popularity": 7.137,
                "poster_path": "/dKUubjvxO78XDts6VP1Ggcp4R9O.jpg",
                "release_date": "1940-12-05",
                "title": "The Philadelphia Story",
                "video": false,
                "vote_average": 7.617,
                "vote_count": 914,
                "character": "Uncle Willie",
                "credit_id": "52fe4296c3a36847f802a30d",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nRoland Young (11 November 1887 – 5 June 1953) was an English actor.\n\nYoung made his first stage appearance in London's West End in Find the Woman in 1908, and in 1912 he made his Broadway debut in Hindle Wakes. He appeared in two comedies written for him by Clare Kummer, Good Gracious Annabelle! (1916) and A Successful Calamity (1917) before he served with the United States Army during World War I. He returned to New York when the war ended, and married Kummer's daughter, Frances. For the next few years he alternated between New York and London. He made his film debut in the 1922 silent film Sherlock Holmes, in which he played Watson opposite John Barrymore as Holmes.\n\nHe signed a contract with Metro-Goldwyn-Mayer and made his talkie debut in The Unholy Night (1929), directed by Lionel Barrymore. He was loaned to Warner Bros. to appear in Her Private Life, with Billie Dove and Fox Film Corporation, winning critical approval for his comedic performance as Jeanette MacDonald's husband in Don't Bet on a Woman. He was again paired with MacDonald in the film version of Good Gracious Annabelle!, titled Annabelle's Affairs. He appeared in Cecil B. de Mille's The Squaw Man, and played opposite Alfred Lunt and Lynn Fontanne in The Guardsman (both 1931). He appeared with Evelyn Brent in Columbia's The Pagan Lady (1932) and Pola Negri in RKO's A Woman Commands (1932). His final film under his MGM contract was Lovers Courageous (1932), opposite Robert Montgomery. In 1933 he had a starring role in the risqué comedy for Fox Film called Pleasure Cruise along side Genevieve Tobin.\n\nYoung began to work as a freelance performer and found himself in constant demand. He appeared with Jeanette MacDonald, Genevieve Tobin and Maurice Chevalier in One Hour With You (1932) and with Kay Francis in Street of Women (1932). Alexander Korda invited him to return to Britain to make his British film debut in Wedding Rehearsal (1932). He returned to Hollywood and appeared in a diverse group of films that included comedies, murder mysteries, and dramas, and also worked on Broadway. Among his films of this period were Ruggles of Red Gap (1935), David Copperfield (1935) (playing Uriah Heep), and the H.G. Wells fantasy The Man Who Could Work Miracles (1936).\n\nIn 1937, he achieved one of the most important successes of his career in Topper, as a bank president haunted by the ghosts of his clients, played by Cary Grant and Constance Bennett. It was one of the most successful films of the year, and Young was nominated for the Academy Award for Best Supporting Actor. Topper's wife was played by Billie Burke, who wrote in her memoir that Young \"was dry and always fun to work with\". They also appeared together in The Young in Heart (1938), and both of the Topper sequels, Topper Takes a Trip (1938) and Topper Returns (1941).\n\nHe continued working steadily through the 1940s, playing small roles opposite some of Hollywood's leading actresses, such as Joan Crawford, Marlene Dietrich, Paulette Goddard and Greta Garbo in her final film, Two-Faced Woman (1941).  In the 1950s, Young appeared on several episodic television series, including Lux Video Theatre, Studio One, Pulitzer Prize Playhouse and The Chevrolet Tele-Theatre.",
        "birthday": "1887-11-10",
        "deathday": "1953-06-05",
        "gender": 2,
        "homepage": null,
        "id": 14685,
        "imdb_id": "nm0950019",
        "known_for_department": "Acting",
        "name": "Roland Young",
        "place_of_birth": "London, England, UK",
        "popularity": 0.4907,
        "profile_path": "/hme2CvDcGqdZEsPKcdvhjgEvvDl.jpg"
    }
}