{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/iItypZVpdnxTFgA0iv345AzMUqk.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 981,
                "original_language": "en",
                "original_title": "The Philadelphia Story",
                "overview": "When a rich woman's ex-husband and a tabloid-type reporter turn up just before her planned remarriage, she begins to learn the truth about herself.",
                "popularity": 7.137,
                "poster_path": "/dKUubjvxO78XDts6VP1Ggcp4R9O.jpg",
                "release_date": "1940-12-05",
                "title": "The Philadelphia Story",
                "video": false,
                "vote_average": 7.617,
                "vote_count": 914,
                "character": "Elizabeth 'Liz' Imbrie",
                "credit_id": "52fe4296c3a36847f802a309",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ruth March",
            "Рут Хасси"
        ],
        "biography": "​From Wikipedia, the free encyclopedia\n\nRuth Carol Hussey (October 30, 1911 – April 19, 2005) was an American actress best known for her Academy Award-nominated role as photographer Elizabeth Imbrie in The Philadelphia Story.\n\nAfter working as an actress in summer stock, she returned to Providence and worked as a radio fashion commentator on a local station. She wrote the ad copy for a Providence clothing store and read it on the radio each afternoon. She was encouraged by a friend to try out for acting roles at the Providence Playhouse. The theater director there turned her down, saying the roles were cast only out of New York City. Later that week, she journeyed to New York City and on her first day there, she signed with a talent agent who booked her for a role in a play starting the next day back at the Providence Playhouse.\n\nIn New York City, she also worked for a time as a model. She then landed a number of stage roles with touring companies. Dead End toured the country in 1937 and the last theater on the road trip was at the Biltmore Hotel in Los Angeles, where she was spotted on opening night by MGM talent scout Billy Grady. MGM signed her to a players contract and she made her film debut in 1937. She quickly became a leading lady in MGM's \"B\" unit, usually playing sophisticated, worldly roles. For a 1940 \"A\" picture role, she was nominated for an Academy Award for her turn as Elizabeth Imbrie, the cynical magazine photographer and almost-girlfriend of James Stewart's character Macaulay Connor in The Philadelphia Story. In 1941, exhibitors voted her the third-most popular new star in Hollywood.\n\nHussey also worked with Robert Taylor in Flight Command (1940), Robert Young in Northwest Passage (1940) and H.M. Pulham, Esq. (1941), Van Heflin in Tennessee Johnson (1942), Ray Milland in The Uninvited (1944), and Alan Ladd in The Great Gatsby (1949).\n\nIn 1946, she starred on Broadway in the Pulitzer Prize-winning play State of the Union. Her 1949 role in Goodbye, My Fancy on Broadway caused a Billboard reviewer to write: \"Miss Hussey brings a splendid aliveness and warmth to the lovely congresswoman....\"\n\nShe filled in for Jean Arthur in the 1955 Lux Radio Theater presentation of Shane, playing Miriam Start, alongside original film stars Alan Ladd and Van Heflin.\n\nIn 1960, she co-starred in The Facts of Life with Bob Hope. Hussey was also active in early television drama.",
        "birthday": "1911-10-30",
        "deathday": "2005-04-19",
        "gender": 1,
        "homepage": null,
        "id": 14683,
        "imdb_id": "nm0404046",
        "known_for_department": "Acting",
        "name": "Ruth Hussey",
        "place_of_birth": "Providence, Rhode Island, USA",
        "popularity": 0.2636,
        "profile_path": "/y5KfUEnQSDr3VYmfdQfkf9K0L1o.jpg"
    }
}