{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hHvvGvodFPADcbn0svgmSBYM9TU.jpg",
                "genre_ids": [
                    18
                ],
                "id": 306819,
                "original_language": "en",
                "original_title": "The Danish Girl",
                "overview": "When Gerda Wegener asks her husband Einar to fill in as a portrait model, Einar discovers the person she's meant to be and begins living her life as Lili Elbe. Having realized her true self and with Gerda's love and support, Lili embarks on a groundbreaking journey as a transgender pioneer.",
                "popularity": 3.1432,
                "poster_path": "/mXZZIacI5FC8thzSC0lgQBQ2uAX.jpg",
                "release_date": "2015-11-27",
                "title": "The Danish Girl",
                "video": false,
                "vote_average": 7.565,
                "vote_count": 5844,
                "character": "Henri",
                "credit_id": "57564168c3a3680cc4001519",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/um7DVcGyLvImgAdn5JGpjIudYSV.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 454652,
                "original_language": "en",
                "original_title": "Colette",
                "overview": "After marrying a successful Parisian writer known commonly as Willy, Sidonie-Gabrielle Colette is transplanted from her childhood home in rural France to the intellectual and artistic splendor of Paris. Soon after, Willy convinces Colette to ghostwrite for him. She pens a semi-autobiographical novel about a witty and brazen country girl named Claudine, sparking a bestseller and a cultural sensation. After its success, Colette and Willy become the talk of Paris and their adventures inspire additional Claudine novels.",
                "popularity": 3.0312,
                "poster_path": "/z73Wer1DgObAwWnqZlOyeI33ROY.jpg",
                "release_date": "2018-09-21",
                "title": "Colette",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 922,
                "character": "Gaston De Caillavet",
                "credit_id": "5b48ab79c3a368452a0082d9",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Jake Graf, born in London, is a transgender actor, writer, and director. Currently living in the United Kingdom.\n\nGraf specializes in short films dealing with transgender issues in an effort to normalize queer and trans experiences to a wider, more mainstream audience. Many of Graf’s films emphasize the daily lived experiences of trans men.\n\nAccording to Graf, he was vocal from a young age about his knowledge of being a boy, despite being raised and treated as a girl. Feeling that he was missing parts that other boys had, Graf felt isolated and reclusive as a child. Around the age of puberty, Graf learned to keep these feelings to himself, until eventually beginning the process of transitioning at 28 years old.\n\nGraf's first work within the industry was a screenplay dealing with his experiences in making a female to male transition. Short films such as X-WHY (2011), Brace (2015), and Chance (2015) have given the film director a way to open up about his sexual identity by explaining what it was like to go through the process of being a transgender individual.\n\nJake Graf and his wife, Hannah Winterbourne, announced their engagement in 2017 after Graf proposed in New York City. Winterbourne is an engineer with the British Army and currently is the highest ranking transgender officer. The couple has expressed interest in having children, and will likely do so through surrogacy.\n\nFrom Wikipedia, the free encyclopedia",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.jakegraf.com",
        "id": 1468771,
        "imdb_id": "nm4261422",
        "known_for_department": "Directing",
        "name": "Jake Graf",
        "place_of_birth": "London, England",
        "popularity": 0.1522,
        "profile_path": "/9W8Jlj0pYvtcI2VJ61dGDpeH5OO.jpg"
    }
}