{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ufUAOM5aVizNf8d5YLoutqrrlhq.jpg",
                "genre_ids": [
                    878,
                    28,
                    12,
                    53
                ],
                "id": 336843,
                "original_language": "en",
                "original_title": "Maze Runner: The Death Cure",
                "overview": "Thomas leads his group of escaped Gladers on their final and most dangerous mission yet. To save their friends, they must break into the legendary Last City, a WCKD-controlled labyrinth that may turn out to be the deadliest maze of all. Anyone who makes it out alive will get answers to the questions the Gladers have been asking since they first arrived in the maze.",
                "popularity": 8.2843,
                "poster_path": "/drbERzlA4cuRWhsTXfFOY4mRR4f.jpg",
                "release_date": "2018-01-10",
                "title": "Maze Runner: The Death Cure",
                "video": false,
                "vote_average": 7.095,
                "vote_count": 8098,
                "character": "Co-Conductor",
                "credit_id": "5a6faf040e0a26796900761c",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Official 2024 Primetime Emmy® Shortlisted Actor\n\nGreg Kriek was an official contender for the 2024 Primetime Emmy® Awards in the race for Outstanding Supporting Actor in a Limited Series/Movie for his compelling performance opposite Kevin Hart in DIE HART 2: DIE HARTER. He found himself in competition with some of the industry's elite, including Barry Keoghan, Robert Downey Jr., Callum Turner, and Taylor Kitsch.\n\nWith over 95 international screen credits, Greg has emerged as one of South Africa's most globally recognized actors and producers living and working in Hollywood today. He is widely acclaimed for his versatility and transformative performances, especially in award-winning projects. Greg is officially South Africa's most internationally credited actor in his category.\n\nHis recent highlights include starring as Dr. Tony Sinclair in the Emmy® winning film The Serengeti Rules and his powerful turn as Karl Stromberg in the four-time Emmy-nominated series Die Hart 2: Die Harter alongside Kevin Hart, John Cena, and Nathalie Emmanuel.\n\nGreg's work in 2023 earned him Best Supporting Actor of the Year at the Oscar-qualifying Los Angeles Annual Film Awards for his standout role in the Holocaust drama TRUST opposite Emily Bader.\n\nHe is also part of the global REBEL MOON franchise from Zack Snyder, playing Marcus opposite a star-studded cast, including Sir Anthony Hopkins, Charlie Hunnam, and Djimon Hounsou. Additional highlights include working on FLY ME TO THE MOON under the direction of Greg Berlanti, alongside Scarlett Johansson, Channing Tatum, and Woody Harrelson.\n\nHaving trained with some of the industry's most revered acting coaches and institutions, such as Larry Moss, Anthony Meindl Studios, The Second City, and Ivana Chubbuck, Greg has honed a craft that speaks across genres and borders.\n\nLooking ahead, 2025 promises to be another banner year, with over seven major releases, including a major role in a top-secret Amazon limited series, a new western feature with Hollywood legends Harvey Keitel and Dermot Mulroney, and main ensemble roles in BROKEN THINGS and FACE. He is also set to lead two Hollywood features filming in Iceland and Cambodia in early 2025.\n\nGreg's star has risen internationally since his major role opposite Megan Fox in Lionsgate's action thriller ROGUE. Throughout his career, he has shared the screen with iconic actors such as Morgan Freeman, Dylan O'Brien, Billy Zane, Rutger Hauer, Walton Goggins, Olga Kurylenko, Barry Pepper, and Lindsay Wagner.\n\nIn addition to starring in Netflix's BLACK MIRROR (Season 5) with Miley Cyrus, Greg played a key role as Dietrich Case in Universal Studios' INSIDE MAN 2. His extensive international work includes FOX's DEEP STATE (Season 2), TREMORS: A Cold Day in Hell* as \"Dutch\", MAZE RUNNER: THE DEATH CURE, and SAMSON.\n\nGreg has also been a standout in South African cinema, with lead roles in BORN TO WIN (as seen on Netflix), \"N MAN SOOS MY PA, THE RECCE (earning him Best Actor in a Feature Film in 2019), and many more.\n\nAs one of South Africa's finest exports to Hollywood, Greg continues to break boundaries, delivering performances that resonate with audiences worldwide.",
        "birthday": "1991-11-05",
        "deathday": null,
        "gender": 2,
        "homepage": "http://gregkriek.com",
        "id": 1469407,
        "imdb_id": "nm5105990",
        "known_for_department": "Acting",
        "name": "Greg Kriek",
        "place_of_birth": "Cape Town, South Africa",
        "popularity": 0.8492,
        "profile_path": "/isdXPMMvrnHutuVjudqKULNWbnn.jpg"
    }
}