{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rRs4eLjEuUHEVZl0BW4qRckbB4X.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749
                ],
                "id": 19404,
                "original_language": "hi",
                "original_title": "दिलवाले दुल्हनिया ले जायेंगे",
                "overview": "Raj is a rich, carefree, happy-go-lucky second generation NRI. Simran is the daughter of Chaudhary Baldev Singh, who in spite of being an NRI is very strict about adherence to Indian values. Simran has left for India to be married to her childhood fiancé. Raj leaves for India with a mission at his hands, to claim his lady love under the noses of her whole family. Thus begins a saga.",
                "popularity": 9.057,
                "poster_path": "/2CAL2433ZeIihfX1Hb2139CX0pW.jpg",
                "release_date": "1995-10-20",
                "title": "Dilwale Dulhania Le Jayenge",
                "video": false,
                "vote_average": 8.515,
                "vote_count": 4506,
                "character": "Rajeshwari \"Chutki\" Singh",
                "credit_id": "52fe47d69251416c750a71d3",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Pooja Ruparel is an Indian actress who appears in Bollywood movies and TV series. She is well known for her iconic role as \"Chutki\" in Dilwale Dulhania Le Jayenge, one of India's most successful films. She has also acted in a number of plays, apart from being a stand-up comedian and a singer.\n\nPooja Ruparel started appearing in Bollywood movies as a child artist in 1993. She first appeared in King Uncle starring Jackie Shroff and Shah Rukh Khan, and gained nationwide popularity through her role as \"Chutki\" in Dilwale Dulhania Le Jayenge. Pooja has also acted in a number of movies and TV series ever since, including Amit Sahani Ki List, X: Past Is Present, 24 (Indian TV series) and Zabaan Sambhalke.",
        "birthday": "1982-11-21",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 146973,
        "imdb_id": "nm0750408",
        "known_for_department": "Acting",
        "name": "Pooja Ruparel",
        "place_of_birth": "Mumbai, India",
        "popularity": 0.4375,
        "profile_path": "/evHnj6s0Z2sbV1Mq0dfXxQQU8Mf.jpg"
    }
}