{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rRs4eLjEuUHEVZl0BW4qRckbB4X.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749
                ],
                "id": 19404,
                "original_language": "hi",
                "original_title": "दिलवाले दुल्हनिया ले जायेंगे",
                "overview": "Raj is a rich, carefree, happy-go-lucky second generation NRI. Simran is the daughter of Chaudhary Baldev Singh, who in spite of being an NRI is very strict about adherence to Indian values. Simran has left for India to be married to her childhood fiancé. Raj leaves for India with a mission at his hands, to claim his lady love under the noses of her whole family. Thus begins a saga.",
                "popularity": 9.057,
                "poster_path": "/2CAL2433ZeIihfX1Hb2139CX0pW.jpg",
                "release_date": "1995-10-20",
                "title": "Dilwale Dulhania Le Jayenge",
                "video": false,
                "vote_average": 8.515,
                "vote_count": 4506,
                "character": "Preeti Singh, Kuljeet's Sister",
                "credit_id": "52fe47d69251416c750a71d7",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Mandhira Bedi",
            "Manthira Bedi",
            "Manthra Bedi",
            "Mandhra Bedi",
            "मंदिरा बेदी",
            "മന്ദിര ബേദി",
            "மந்திரா பேடி"
        ],
        "biography": "Mandira Bedi is an Indian actress, fashion designer, and television presenter who gained celebrity status playing the title role in the 1994 television serial, Shanti, shown on India's national channel, Doordarshan, which was the first ever daily soap on Indian television.\n\nShe followed up her career in TV serials with shows like Aurat (DD and Sony), Dushman (DD) and Kyunki Saas Bhi Kabhi Bahu Thi (Star Plus) with hosting duties for ICC Cricket World Cups in the years 2003 and 2007 and the Champions Trophies in the years 2004 and 2006 as well as the Indian Premier League season 2 for Sony Max. She fronted the coverage of IPL season 3 for the British Network – ITV. She debuted as a fashion designer during Lakme Fashion Week 2014 with her saree collection.\n\nBedi also promoted faux leather for PETA. On 26 October 2013, Bedi launched her signature sari store.",
        "birthday": "1972-04-15",
        "deathday": null,
        "gender": 1,
        "homepage": "http://mandirabedi.in",
        "id": 146974,
        "imdb_id": "nm0990671",
        "known_for_department": "Acting",
        "name": "Mandira Bedi",
        "place_of_birth": "Calcutta, West Bengal, India",
        "popularity": 0.3073,
        "profile_path": "/l50tq0OwzIxE4Z5JXDUSQvqCltN.jpg"
    }
}