{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sm3ErHMXQLaNdo74vbIa1JRXIXS.jpg",
                "genre_ids": [
                    18,
                    37
                ],
                "id": 1712,
                "original_language": "en",
                "original_title": "Giant",
                "overview": "Wealthy rancher Bick Benedict and dirt-poor cowboy Jett Rink both woo Leslie Lynnton, a beautiful young woman from Maryland who is new to Texas. She marries Benedict, but she is shocked by the racial bigotry of the White Texans against the local people of Mexican descent. Rink discovers oil on a small plot of land, and while he uses his vast, new wealth to buy all the land surrounding the Benedict ranch, the Benedict's disagreement over prejudice fuels conflict that runs across generations.",
                "popularity": 3.9693,
                "poster_path": "/oQ1Arue52pFLSvvwfcNTy16hTCG.jpg",
                "release_date": "1956-11-08",
                "title": "Giant",
                "video": false,
                "vote_average": 7.614,
                "vote_count": 722,
                "character": "Luz Benedict II",
                "credit_id": "52fe430ec3a36847f80373cf",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/k7GM13qRYSour3lk90Dq1EwdpoW.jpg",
                "genre_ids": [
                    18,
                    53,
                    9648
                ],
                "id": 2649,
                "original_language": "en",
                "original_title": "The Game",
                "overview": "In honor of his birthday, San Francisco banker Nicholas Van Orton, a financial genius and a cold-hearted loner, receives an unusual present from his younger brother, Conrad: a gift certificate to play a unique kind of game. In nary a nanosecond, Nicholas finds himself consumed by a dangerous set of ever-changing rules, unable to distinguish where the charade ends and reality begins.",
                "popularity": 7.5585,
                "poster_path": "/4UOa079915QjiTA2u5hT2yKVgUu.jpg",
                "release_date": "1997-09-12",
                "title": "The Game",
                "video": false,
                "vote_average": 7.567,
                "vote_count": 6967,
                "character": "Ilsa",
                "credit_id": "52fe4363c3a36847f80506eb",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Carrol Baker",
            "Karolina Piekarski",
            "کارول بیکر"
        ],
        "biography": "Carroll Baker (born May 28, 1931) is a former American actress who has enjoyed popularity as both a serious dramatic actress and, particularly in the 1960s, as a movie sex symbol.  After studying under Lee Strasberg at the Actors Studio, Baker began performing on Broadway in 1954. From there, she was recruited by director Elia Kazan to play the lead in the adaptation of two Tennessee Williams plays into the film Baby Doll in 1956.  In the mid-1960s, as a contract player for Paramount Pictures, Baker became a sex symbol after appearing as a hedonistic widow in The Carpetbaggers (1964).  The film's producer, Joseph E. Levine, cast her in Sylvia before giving her the role of Jean Harlow in the biopic Harlow (1965).  Despite significant prepublicity, Harlow was a critical failure, and Baker relocated to Italy in 1966 amid a legal dispute over her contract with Paramount and Levine's overseeing of her career. In Europe, she spent the next 10 years starring in hard-edged giallo and horror films, including Romolo Guerrieri's The Sweet Body of Deborah (1968), a series of four films with Umberto Lenzi beginning with Orgasmo (1969) and ending with Knife of Ice (1972), and Corrado Farina's Baba Yaga (1973).  Baker appeared in supporting roles in several acclaimed dramas in the 1980s, including the drama Star 80 (1983) as the mother of murder victim Dorothy Stratten, and the racial drama Native Son (1986), based on the novel by Richard Wright. Through the 1990s Baker had guest roles in several television series, such as Murder, She Wrote; L.A. Law, and Roswell.  She formally retired from acting in 2003.",
        "birthday": "1931-05-28",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 14701,
        "imdb_id": "nm0004647",
        "known_for_department": "Acting",
        "name": "Carroll Baker",
        "place_of_birth": "Johnstown, Pennsylvania, USA",
        "popularity": 0.7121,
        "profile_path": "/ui9gwewS5Ofb2sop0ZWN9G8Yako.jpg"
    }
}