{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kv9xVrxfLpudBLyYf1QvLCpUQuy.jpg",
                "genre_ids": [
                    36,
                    18
                ],
                "id": 1182047,
                "original_language": "en",
                "original_title": "The Apprentice",
                "overview": "A young Donald Trump, eager to make his name as a hungry scion of a wealthy family in 1970s New York, comes under the spell of Roy Cohn, the cutthroat attorney who would help create the Donald Trump we know today. Cohn sees in Trump the perfect protégé—someone with raw ambition, a hunger for success, and a willingness to do whatever it takes to win.",
                "popularity": 5.2575,
                "poster_path": "/zxA7bL9qOnU49NXIqpnyJlRvkqs.jpg",
                "release_date": "2024-10-09",
                "title": "The Apprentice",
                "video": false,
                "vote_average": 6.903,
                "vote_count": 739,
                "character": "Theodore Green",
                "credit_id": "667ad68a3e19d5783ce45df6",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jason Michael Jones"
        ],
        "biography": "Jai Jai Jones (pronounced jay jay) was born Jason Michael Jones in Toronto, Ontario. His mother was born and raised in Jamaica and his father from Grenada. He has two sisters, and a younger brother. Jai Jai has always been a big fan of soccer and has played since the age of 5. He has won over 50 championships in Ontario and Quebec and has also spent time playing in Italy with his team from Canada. Jai Jai continues to play and follow soccer recreationally.\n\nJai Jai caught the acting bug while in his last years of high school and started to pursue it professionally in Late 2000. It was then he landed his first role from his first ever audition in the Canadian feature film- Love Disease. Since then Jai Jai has had lots of success appearing in numerous commercials in Canada and the United States, as well as several TV shows and films including 'Brady Bunch in the White House', 'The Natalie Cole story', 'Desperately Seeking Santa' and Emmy nominated 'Copper'. Throughout his career he has worked with actors such as Omar Epps, Natalie Cole, Theresa Randle, Ato Essandoh, Alfre Woodard, Regina King and director Robert Townsend.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1470382,
        "imdb_id": "nm0428291",
        "known_for_department": "Acting",
        "name": "Jai Jai Jones",
        "place_of_birth": "Toronto, Ontario, Canada",
        "popularity": 0.0672,
        "profile_path": "/2GxNPLmgWq6DZns5BTveueJPiab.jpg"
    }
}