{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9X7YweCJw3q8Mcf6GadxReFEksM.jpg",
                "genre_ids": [
                    28,
                    18,
                    878
                ],
                "id": 263115,
                "original_language": "en",
                "original_title": "Logan",
                "overview": "In the near future, a weary Logan cares for an ailing Professor X in a hideout on the Mexican border. But Logan's attempts to hide from the world and his legacy are upended when a young mutant arrives, pursued by dark forces.",
                "popularity": 11.2749,
                "poster_path": "/fnbjcRDYn6YviCcePDnGdyAkYsB.jpg",
                "release_date": "2017-02-28",
                "title": "Logan",
                "video": false,
                "vote_average": 7.82,
                "vote_count": 19839,
                "character": "Jackson's Henchman",
                "credit_id": "5922df38925141485e070577",
                "order": 84
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Damon Carney is an American actor with roles in television ranging from \"Walker Texas Ranger\" to \"Friday Night Lights\"; most recently playing Don Wheeler in the critically acclaimed series \"American Crime\", opposite Felicity Huffman and Timothy Hutton.\n\nFilm credits include: Ranger Blaine in Disney's blockbuster \"The Lone Ranger\" alongside Johnny Depp and Armie Hammer; Mr. Heatherton in the upcoming film \"Waiting For The Miracle To Come\" alongside Willie Nelson; and Phil in \"My All American\" starring Aaron Eckhart. Damon will make his leading man debut as Detective Sean Carter in Dimension's film \"Hellraiser: Judgment\" set for release in 2017.\n\nBorn and raised in Tyler, Texas Damon is one of 11 children. An extraordinarily diverse actor, Damon has played a multitude of roles ranging from a drug dealing but, lovable womanizer in the 70's drama \"Swingtown\" to a hit man in the upcoming feature film \"Kreep\", starring Judd Nelson.\n\nIn addition to acting, Damon, an entrepreneur, opened up a restaurant with his wife of 25 years. He and his wife, Bradi, have owned and operated The Tin Cup deli in Arlington, Texas for 13 successful years while raising their two children.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1471922,
        "imdb_id": "nm2308823",
        "known_for_department": "Acting",
        "name": "Damon Carney",
        "place_of_birth": null,
        "popularity": 0.0635,
        "profile_path": "/4SQ1Zy48o3R9kk9vHQJZtpsVV6u.jpg"
    }
}