{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7FregPTA0h0ROUvHvq62TBAzmSV.jpg",
                "genre_ids": [
                    18
                ],
                "id": 209276,
                "original_language": "en",
                "original_title": "Starred Up",
                "overview": "19-year-old Eric, arrogant and ultra-violent, is prematurely transferred to the same adult prison facility as his estranged father. As his explosive temper quickly finds him enemies in both prison authorities and fellow inmates — and his already volatile relationship with his father is pushed past breaking point — Eric is approached by a volunteer psychotherapist, who runs an anger management group for prisoners. Torn between gang politics, prison corruption, and a glimmer of something better, Eric finds himself in a fight for his own life, unsure if his own father is there to protect him or join in punishing him.",
                "popularity": 2.044,
                "poster_path": "/e1DRGfyRxYQclvJOJiXwAw5gDg2.jpg",
                "release_date": "2014-03-21",
                "title": "Starred Up",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 972,
                "character": "Officer White",
                "credit_id": "59919382925141434f00e8d7",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Duncan Airlie James was born on May 23rd, in Glasgow, Scotland. From a young age, Duncan found a love for sports, that took him through football (soccer), rugby, and eventually led him into the Martial Arts.\n\nDisplaying a strong \"creative / artistic\" streak in the 80s he spent most of the decade as a drummer and musician for a variety of bands in Glasgow, Scotland.\n\nIn the early 90s, with his competitive nature and physical presence again pushed to the fore of his life, he could no longer resist the drive to pursue his dream of success in combat. Duncan dedicated the next decade of his life to the sport and won six versions of World, Thai Boxing and Kick Boxing titles as a competitive fighter. He competed all over the world during his illustrious and very successful career with his tartan shorts and fighting kilt becoming a famous trademark and his badge of honour!\n\nAfter many years of hard work, and enjoying great success across the globe, Duncan retired from his competitive fighting career at the end of 2006. To date, he is still the ONLY Scotsman ever to fight in the prestigious K-1 events in Japan and remains Scotland's most well known, and arguably most successful ever ring fighter!\n\nWith the demands and rigours of a professional fighting career behind him, and with his focus and interest now shifted from that path, the creative juices once again started to flow strongly and before long, Duncan rediscovered his love of performance and acting.\n\nHe brings the same drive, intensity, determination and self discipline that he showed to achieve outstanding success as a professional fighter, to his passion for acting.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1471026,
        "imdb_id": "nm3461674",
        "known_for_department": "Acting",
        "name": "Duncan Airlie James",
        "place_of_birth": " Glasgow, Scotland, UK",
        "popularity": 0.1077,
        "profile_path": "/ptLekWmOm5BpXgSqqV5XGpetYQ6.jpg"
    }
}