{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yJIRptBDdt92JS4decYj5HL3Q60.jpg",
                "genre_ids": [
                    53,
                    80,
                    28
                ],
                "id": 197950,
                "original_language": "fr",
                "original_title": "La French",
                "overview": "Newly transferred to the bustling port city of Marseille to assist with a crackdown on organized crime, energetic young magistrate Pierre Michel is given a rapid-fire tutorial on the ins and outs of an out-of-control drug trade. Pierre's wildly ambitious mission is to take on the French Connection, a highly organized operation that controls the city's underground heroin economy and is overseen by the notorious —and reputedly untouchable— Gaetan Zampa. Fearless, determined and willing to go the distance, Pierre plunges into an underworld world of insane danger and ruthless criminals.",
                "popularity": 2.3242,
                "poster_path": "/kIkmaZATFP4RkQSiWgyL6KGOTq6.jpg",
                "release_date": "2014-12-03",
                "title": "The Connection",
                "video": false,
                "vote_average": 7.123,
                "vote_count": 901,
                "character": "Jairzinho (non crédité)",
                "credit_id": "60d2697e0716500045cb1c80",
                "order": 81
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Eric Kabongo Ilunga (born 21 May 1984), is a Belgian actor and singer with a Congolese descent. He is best known for the roles in the films Welcome to Germany, Sawah and Third Wedding.\n\nHe was born on 21 May 1984 in Kinshasa, Zaire (currently Democratic Republic of the Congo). At the age of 13, he came to Belgium due to the fact that his mother married a Belgian and settled in Flemish village in the suburbs, in Belgium. He currently lives in Waregem, West Flanders.\n\nHe started his career as a rapper with the stage name 'Krazy-E'. In 2013, he became an actor with an uncredited role as a train passenger in the film The Fifth Estate. In 2014, Kabongo played in the short D5R and then received a role in the critically acclaimed Belgian film Black.\n\nIn 2016, he was invited to Germany to play the role as a refugee 'Diallo' in the comedy film Welcome to Germany. With the film, he became a leading actor across Europe. In 2019, he acted in the film Sawah where he won the Golden Palm Award for Best Supporting Actor at the Queen Palm International Film Festival. In the same year, he acted in the series Rivallen und Rebellen.\n\nIn 2014, a documentary What about Eric? was released regarding his life. The documentary later won the prizes for Best Belgian documentary as well. Then the documentary Ensor won the award for the Best Flemish documentary, which was later dedicated to Kabongo by directors Lennart Stuyck and Ruben Vermeersch.\n\nSource: Article \"Eric Kabongo\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1984-05-21",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1471308,
        "imdb_id": "nm6225875",
        "known_for_department": "Acting",
        "name": "Eric Kabongo",
        "place_of_birth": "Kinshasa, Democratic Republic of the Congo",
        "popularity": 0.1277,
        "profile_path": "/xEdcEPpitwrlrlKUvBqZPMzWGYH.jpg"
    }
}