{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/b8Ma7TkasTDpMIkoIngzHVcgANa.jpg",
                "genre_ids": [
                    16,
                    10751,
                    35,
                    14
                ],
                "id": 508947,
                "original_language": "en",
                "original_title": "Turning Red",
                "overview": "Thirteen-year-old Mei is experiencing the awkwardness of being a teenager with a twist – when she gets too excited, she transforms into a giant red panda.",
                "popularity": 12.5737,
                "poster_path": "/qsdjk9oAKSQMWs0Vt5Pyfh6O4GZ.jpg",
                "release_date": "2022-03-10",
                "title": "Turning Red",
                "video": false,
                "vote_average": 7.337,
                "vote_count": 5537,
                "character": "Additional Voices (voice)",
                "credit_id": "622df404aad9c2001b4f3d20",
                "order": 30
            },
            {
                "adult": false,
                "backdrop_path": "/9X7YweCJw3q8Mcf6GadxReFEksM.jpg",
                "genre_ids": [
                    28,
                    18,
                    878
                ],
                "id": 263115,
                "original_language": "en",
                "original_title": "Logan",
                "overview": "In the near future, a weary Logan cares for an ailing Professor X in a hideout on the Mexican border. But Logan's attempts to hide from the world and his legacy are upended when a young mutant arrives, pursued by dark forces.",
                "popularity": 12.4212,
                "poster_path": "/fnbjcRDYn6YviCcePDnGdyAkYsB.jpg",
                "release_date": "2017-02-28",
                "title": "Logan",
                "video": false,
                "vote_average": 7.82,
                "vote_count": 19839,
                "character": "Delilah",
                "credit_id": "58e0750a9251415e44013359",
                "order": 38
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Alison Fernandez (born July 20, 2005) is an American actress best known for her role in ABC's Once Upon a Time as Lucy Mills and in the 2017 film Logan as Delilah. She has had recurring roles in Netflix's Orange Is the New Black and The CW's Jane the Virgin as Young Jane.\n\nFernandez was born in Brooklyn, New York. She started her acting career at age five in New York City community theaters, She is the daughter of Manuel Fernandez, who has been her manager from the time she started acting. She has an older sister, Sabrina, who is also an actress. Fernandez received her education in acting for Theater, singing and choreography at the A Class Act N.Y.\n\nFernandez played Zara Amaro, Nick Amaro's daughter in Law & Order: Special Victims Unit in 2011. She made her film debut in the 2014 film Teenage Mutant Ninja Turtles as Rosa Mendez.\n\nIn 2016 she landed guest starring roles on three shows, Fresh Off the Boat, Another Period and Jane the Virgin. In 2017 she guest starred on Once Upon a Time as Lucy, and then had a regular starring role in the 7th season. She appeared in the X-Men film Logan as Delilah, and recurred on the Netflix dramedy series Orange Is the New Black, having first appeared on the show in 2013.  She co-starred in Freeform's Life-Size 2 in December 2018 opposite Tyra Banks and Francia Raisa.\n\nFernandez also landed the role of Amber in Team Kaylie. Then she obtained the role of Pepper Paloma in Upside-Down Magic.\n\nShe lives in Los Angeles.",
        "birthday": "2005-07-20",
        "deathday": null,
        "gender": 1,
        "homepage": "https://resumes.actorsaccess.com/alisonfernandez",
        "id": 1472792,
        "imdb_id": "nm4731251",
        "known_for_department": "Acting",
        "name": "Alison Fernández",
        "place_of_birth": "Brooklyn, New York, U.S.",
        "popularity": 0.2845,
        "profile_path": "/3L5tZZzoo422CmLvSEA88PaBrNb.jpg"
    }
}