{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rKe3MR2u4ZZ0y9uKivzKJRrqBCe.jpg",
                "genre_ids": [
                    18,
                    10402
                ],
                "id": 537116,
                "original_language": "en",
                "original_title": "tick, tick... BOOM!",
                "overview": "On the brink of turning 30, a promising theater composer navigates love, friendship and the pressure to create something great before time runs out.",
                "popularity": 2.7737,
                "poster_path": "/DPmfcuR8fh8ROYXgdjrAjSGA0o.jpg",
                "release_date": "2021-11-11",
                "title": "tick, tick... BOOM!",
                "video": false,
                "vote_average": 7.617,
                "vote_count": 2182,
                "character": "Cristin",
                "credit_id": "6181494ed388ae002cf83ee9",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Gizel Jimenez"
        ],
        "biography": "Gizel Jiménez is an American actress and singer.\n\nBorn in Miami, she was raised in New York until the age of 13 when she moved to Florida. She attended Coral Reef High School where she competed in classical vocal competitions. She was later accepted into the New World School of the Arts in Miami, graduating with a BFA in musical theatre.\n\nHer first professional job was a Broadway tour, cast as Rosalia in West Side Story. In 2013, she performed at the Walnut Street Theatre in In the Heights. In 2015, she appeared in a production of the musical The Theory of Relativity at the Norma Terris Theatre in Chester, Connecticut, her first show with the theatrical group Goodspeed Musicals.\n\nIn 2018, she appeared in a production of Alice by Heart at Vassar College & New York Stage and Film’s Powerhouse Theatre. In 2018 she appeared as Kate Monster in New York in Avenue Q. That year, she was nominated for a Drama Desk Award for Outstanding Actress in a Musical for her role in stage musical Miss You Like Hell. She also performed at the ceremony.\n\nThe following year, she appeared in Stephen Bracket directed production of Reefer Madness. She also joined the Broadway production of Wicked playing Nessarose at the Gershwin Theatre.\n\nIn 2020, she was Princess Piper in the original cast of Bliss the Musical in Seattle's 5th Avenue Theatre.\n\nShe made her first television appearance in an episode of Law & Order SVU called \"Presumed Guilty.\" She was the female lead in a short film called Timmy Two Chins and was also in a commercial with comedian Nick Kroll for Comedy Central.\n\nShe appeared in 2021 musical film Tick, Tick... Boom!. She had a recurring role as Tess on Showtime television series Dexter: New Blood in 2022. In 2024, she played Mel on Apple TV+ television series Bad Monkey.",
        "birthday": "1989-07-07",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.bretadamsltd.net/content/client/actors/gizel-jimenez/",
        "id": 1473510,
        "imdb_id": "nm5442366",
        "known_for_department": "Acting",
        "name": "Gizel Jiménez",
        "place_of_birth": "Miami, Florida, US",
        "popularity": 0.0814,
        "profile_path": "/jCaBA7CtmPYbb5dlZ5MEpaXDuf5.jpg"
    }
}