{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4ZQIEbCwrD1cTvslORZcrNtQqYO.jpg",
                "genre_ids": [
                    27
                ],
                "id": 8769,
                "original_language": "en",
                "original_title": "Christine",
                "overview": "Nerdy high schooler Arnie Cunningham falls for Christine, a rusty 1958 Plymouth Fury, and becomes obsessed with restoring the classic automobile to her former glory. As the car changes, so does Arnie, whose newfound confidence turns to arrogance behind the wheel of his exotic beauty. Arnie's girlfriend Leigh and best friend Dennis reach out to him, only to be met by a Fury like no other.",
                "popularity": 4.1187,
                "poster_path": "/mMtUJke2TtIoT6JB9hkvERmsSu8.jpg",
                "release_date": "1983-12-09",
                "title": "Christine",
                "video": false,
                "vote_average": 6.869,
                "vote_count": 2095,
                "character": "Moochie Welch",
                "credit_id": "52fe44b8c3a36847f80a649f",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/uw4SnKFZ453Gxmj5XR5Susj8TNo.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 602,
                "original_language": "en",
                "original_title": "Independence Day",
                "overview": "Strange phenomena surface around the globe. The skies ignite. Terror races through the world's major cities. As these extraordinary events unfold, it becomes increasingly clear that a force of incredible magnitude has arrived. Its mission: total annihilation over the Fourth of July weekend. The last hope to stop the destruction is an unlikely group of people united by fate and unimaginable circumstances.",
                "popularity": 6.5527,
                "poster_path": "/p0BPQGSPoSa8Ml0DAf2mB2kCU0R.jpg",
                "release_date": "1996-06-25",
                "title": "Independence Day",
                "video": false,
                "vote_average": 6.896,
                "vote_count": 9970,
                "character": "Intellectual on Roof",
                "credit_id": "5ea48835ec455200273f8bce",
                "order": 107
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Malcolm Danare (born June 15, 1962) is an American actor, known for his role of Caesar in the 1985 film Heaven Help Us and Dr. Mendel Craven in the 1998 film Godzilla and its animated series followup. He is also known for voicing Kipling in Monster High and voicing Tiny of Ever After High.\n\nMalcolm Danare had never been in front of a camera before he played the role that earned him a Golden Globe nomination. This debut role was Poteete in Paramount Pictures’ movie The Lords of Discipline, for which he was nominated for Best Newcomer. Danare's next film for Paramount was the iconic Flashdance.\n\nMalcolm went on to star and co-star in a diverse collection of films: Mel Brooks’s Robin Hood: Men in Tights, Walter Hill’s Crossroads, Amy Heckerling’s European Vacation, Michael Dinner’s Heaven Help Us (aka Catholic Boys), Bob Clark and Mark Herrier’s Popcorn, and John Carpenter’s horror classic Christine. Malcolm also co-starred in Columbia Pictures’ Godzilla and its animated television series.",
        "birthday": "1962-06-15",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 14738,
        "imdb_id": "nm0199118",
        "known_for_department": "Acting",
        "name": "Malcolm Danare",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.2736,
        "profile_path": "/uWmucINKfgQk5qX3tZxyf8oQibC.jpg"
    }
}