{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/y2DB71C4nyIdMrANijz8mzvQtk6.jpg",
                "genre_ids": [
                    28,
                    80,
                    18,
                    53
                ],
                "id": 49026,
                "original_language": "en",
                "original_title": "The Dark Knight Rises",
                "overview": "Following the death of District Attorney Harvey Dent, Batman assumes responsibility for Dent's crimes to protect the late attorney's reputation and is subsequently hunted by the Gotham City Police Department. Eight years later, Batman encounters the mysterious Selina Kyle and the villainous Bane, a new terrorist leader who overwhelms Gotham's finest. The Dark Knight resurfaces to protect a city that has branded him an enemy.",
                "popularity": 17.5242,
                "poster_path": "/hr0L2aueqlP2BYUblTTjmtn0hw4.jpg",
                "release_date": "2012-07-17",
                "title": "The Dark Knight Rises",
                "video": false,
                "vote_average": 7.8,
                "vote_count": 23539,
                "character": "Sewer Thug #1",
                "credit_id": "5744667fc3a3681233001525",
                "order": 29
            },
            {
                "adult": false,
                "backdrop_path": "/j7ij93mtHXAF8D3PjRSEaKPHpIE.jpg",
                "genre_ids": [
                    878,
                    53,
                    9648,
                    28
                ],
                "id": 406990,
                "original_language": "en",
                "original_title": "What Happened to Monday",
                "overview": "In a world where families are limited to one child due to overpopulation, a set of identical septuplets must avoid being put to a long sleep by the government and dangerous infighting while investigating the disappearance of one of their own.",
                "popularity": 5.0552,
                "poster_path": "/atOgZMJpMrTdpqvPiHVPfBhR61l.jpg",
                "release_date": "2017-08-18",
                "title": "What Happened to Monday",
                "video": false,
                "vote_average": 7.159,
                "vote_count": 6244,
                "character": "Dutch",
                "credit_id": "5814109d92514157430297ef",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/70AV2Xx5FQYj20labp0EGdbjI6E.jpg",
                "genre_ids": [
                    53,
                    80,
                    18
                ],
                "id": 637649,
                "original_language": "en",
                "original_title": "Wrath of Man",
                "overview": "A cold and mysterious new security guard for a Los Angeles cash truck company surprises his co-workers when he unleashes precision skills during a heist. The crew is left wondering who he is and where he came from. Soon, the marksman's ultimate motive becomes clear as he takes dramatic and irrevocable steps to settle a score.",
                "popularity": 15.9586,
                "poster_path": "/M7SUK85sKjaStg4TKhlAVyGlz3.jpg",
                "release_date": "2021-04-22",
                "title": "Wrath of Man",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 5739,
                "character": "Brendan",
                "credit_id": "5f526dabb234b900371a4318",
                "order": 23
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Scottish actor Cameron Jack was born and bred into a working class shipbuilding family in Partick, Glasgow in 1972. In 1992 he received the Margaret Rutherford scholarship to study acting at Mountview theatre school in North London.\n\nGraduating in 1995, he set out on an eclectic career, appearing in everything from multiple West End musicals, low budget British film and Hollywood blockbusters. He first came to prominence on screen with television appearances in the mid to late 1990's, appearing in mainstream TV fare like 'Taggart', 'The Bill', 'The Vanishing Man' and 'Lucy Sullivan is getting married'.  In 2011, he was cast in his first feature film role in the final part of Christopher Nolan's Batman trilogy, 'The Dark Knight Rises', playing one of Bane's henchmen 'Sewer Thug 1'. In 2013 he worked on BBC drama 'Waterloo Road' and three brand new TV Sitcoms including 'Man Down'.\n\n2014 saw him appear as Lewis Milton in 'Silent Witness' for the BBC.\n\nIn 2015 he shot the The UK thriller 'Level Up' and the acclaimed Sci FI thriller 'What Happened To Monday' with Noomi Rapace, Glenn Close and Willem Dafoe. In 2016 he appeared in the feature films 'iBoy', 'Death Race: Beyond Anarchy', 'Perfect Skin' and 'Calibre' in which he appeared as Frank McClay. The film was a huge international hit and won the prestigious Michael Powell Award for Best British Film in 2018 at The Edinburgh International Film Festival.\n\n2017 saw him take roles in brand new BBC drama 'Trust Me', International hit 'Outlander' , and two BAFTA award winning dramas, 'Call The Midwife and 'Patrick Melrose'.",
        "birthday": "1972-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": "https://cam.co.uk/talent/cameron-jack/",
        "id": 1473276,
        "imdb_id": "nm0413089",
        "known_for_department": "Acting",
        "name": "Cameron Jack",
        "place_of_birth": "Glasgow, Scotland, UK",
        "popularity": 0.4458,
        "profile_path": "/koUbBoCqgOLOFGMAl1hFNfPgbzY.jpg"
    }
}