{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/r2IOBOeg5wLfLtyOnT5Pur6Tl4q.jpg",
                "genre_ids": [
                    12,
                    28,
                    878
                ],
                "id": 1892,
                "original_language": "en",
                "original_title": "Return of the Jedi",
                "overview": "Luke Skywalker leads a mission to rescue his friend Han Solo from the clutches of Jabba the Hutt, while the Emperor seeks to destroy the Rebellion once and for all with a second dreaded Death Star.",
                "popularity": 8.3835,
                "poster_path": "/jQYlydvHm3kUix1f8prMucrplhm.jpg",
                "release_date": "1983-05-25",
                "title": "Return of the Jedi",
                "video": false,
                "vote_average": 7.905,
                "vote_count": 16311,
                "character": "Stardestroyer Captain #2",
                "credit_id": "54eb11d5c3a36836ed006b59",
                "order": 34
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Tom Mannion is a Scottish actor. His television credits include Brookside, Only Fools and Horses, Up the Garden Path, The Bill, Boon, Cadfael, Doctor Finlay, Doctors, Eleventh Hour, Holby City, Hustle, Life on Mars, Midsomer Murders, New Tricks, Red Cap, Secret Diary of a Call Girl, Spatz, Taggart, The Agatha Christie Hour, The Chief, The Royal, and Wycliffe. He has recently been in the BBC TV series Lip Service,Moving On and Inside Men. His film credits include Brothers, Beyond the Sea, Iris, Beautiful Creatures and Croupier as Detective Inspector Ross. In 2011-12, he went on tour throughout the UK, playing Inspector Goole, in Stephen Daldry's production of An Inspector Calls. In December 2012 he joined the cast of Emmerdale as horse trainer Steve Harland. He made his final appearance in the soap on 11 September 2013.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 147482,
        "imdb_id": "nm0543429",
        "known_for_department": "Acting",
        "name": "Tom Mannion",
        "place_of_birth": null,
        "popularity": 1.0273,
        "profile_path": "/A0OO0MxwhNWJGlLYq3o10scokEc.jpg"
    }
}