{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/n1Gh3MJAVvXmkgSDf3SOLlPCjag.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749
                ],
                "id": 9390,
                "original_language": "en",
                "original_title": "Jerry Maguire",
                "overview": "Jerry Maguire used to be a typical sports agent: willing to do just about anything he could to get the biggest possible contracts for his clients, plus a nice commission for himself. Then, one day, he suddenly has second thoughts about what he's really doing. When he voices these doubts, he ends up losing his job and all of his clients, save Rod Tidwell, an egomaniacal football player.",
                "popularity": 4.6233,
                "poster_path": "/lABvGN7fDk5ifnwZoxij6G96t2w.jpg",
                "release_date": "1996-12-13",
                "title": "Jerry Maguire",
                "video": false,
                "vote_average": 6.971,
                "vote_count": 3483,
                "character": "Former Girlfriend",
                "credit_id": "5ecda0133dc3130021c68093",
                "order": 82
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nLisa Ann Hadley (born January 11, 1972) is an American actress. She is best known for the role of Dr. Julie Devlin in the ABC daytime television soap opera Port Charles, which she played from 1997 to 2001.\n\nHadley was born in Seattle and grew up in Arlington, Washington; she is the youngest of four children. She attended Pepperdine University achieving a BFA in theater and went on to study acting in New York and Los Angeles.\n\nHadley began in television in 1995 with a guest spot as a waitress in an episode of Partners. In 1996, she played the former girlfriend of Tom Cruise in the film Jerry Maguire. In the 1996-1997 season, she had recurring roles on both Hercules: The Legendary Journeys and in Melrose Place. In 1997, Hadley was Marie in the short film Cusp. Hadley was Dr. Julie Devlin on the soap opera Port Charles. In 1999, she appeared as Taliah in the film The Lords of Los Angeles, and guest starred as Merriam Rusk on the British-Canadian horror anthology television series The Hunger. Later that year, she appeared as a beautiful Princess in a Honey Nut Cheerios cereal television commercial. From 2001 to 2002, Hadley had recurring roles on TV shows including Gilmore Girls, JAG, and Pasadena. In 2002, Hadley had roles in films Infested and Dead Above Ground.",
        "birthday": "1972-01-11",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 147400,
        "imdb_id": "nm0352902",
        "known_for_department": "Acting",
        "name": "Lisa Ann Hadley",
        "place_of_birth": "Seattle, Washington, U.S.A",
        "popularity": 0.248,
        "profile_path": "/dOwGVq4DHEhwQcMkxIeGAo7KN5U.jpg"
    }
}