{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cq9N64ucEtfIc3eMxNr1VzY9LH9.jpg",
                "genre_ids": [
                    18
                ],
                "id": 37799,
                "original_language": "en",
                "original_title": "The Social Network",
                "overview": "In 2003, Harvard undergrad and computer programmer Mark Zuckerberg begins work on a new concept that eventually turns into the global social network known as Facebook. Six years later, Mark is one of the youngest billionaires ever, but his unprecedented success leads to both personal and legal complications when he ends up on the receiving end of two lawsuits, one involving his former friend.",
                "popularity": 7.5791,
                "poster_path": "/n0ybibhJtQ5icDqTp8eRytcIHJx.jpg",
                "release_date": "2010-10-01",
                "title": "The Social Network",
                "video": false,
                "vote_average": 7.37,
                "vote_count": 12636,
                "character": "Party Girl (uncredited)",
                "credit_id": "564623599251413acf000176",
                "order": 111
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Venus",
            "テイタム・ミランダ"
        ],
        "biography": "Tatum Miranda aka Venus, is an actress, model & singer. She was born on a US military base in Belgium & grew up around the Air Force traveling. She went to high school and college in Alaska before moving to Los Angeles to pursue a career in music and film. She has worked on the sets of Horrible Bosses 2, Cat Run 2, True Detective, NCIS LA, MANswers, 1000 Ways To Die, & she recently finished filming her first lead role in the film Most Likely To Die which will be theatrically released in October 2015. She is also set to star as the Jedi Nyla Tardun in a fan film titled Rise of the Empire. Tatum recently began working for Brett Ratner at RatPac Entertainment doing script analysis to improve her efficiency in her own script writing. She was soon inspired to produce her own projects instead waiting around to book other jobs. She is currently writing a feature called The City of Eight and beginning another called Thirst of the Ancients with plans to help produce both. Tatum is a classically trained singer & an independent recording artist. She records out of her own private studio. She is working to complete her first album titled Sub Rosa. She looks forward to combining her passion of music with film.",
        "birthday": "1987-01-14",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.tatummiranda.com",
        "id": 1475368,
        "imdb_id": "nm4049197",
        "known_for_department": "Acting",
        "name": "Tatum Miranda",
        "place_of_birth": "Mons, Belgium",
        "popularity": 0.1091,
        "profile_path": "/uls9oPk6VDbDBXocjvGbSFpAK92.jpg"
    }
}