{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tHR34A5n0my4maACNdLpWGd6QYq.jpg",
                "genre_ids": [
                    18,
                    53
                ],
                "id": 698948,
                "original_language": "en",
                "original_title": "Thirteen Lives",
                "overview": "Based on the true nail-biting mission that captivated the world. Twelve boys and the coach of a Thai soccer team explore the Tham Luang cave when an unexpected rainstorm traps them in a chamber inside the mountain. Entombed behind a maze of flooded cave tunnels, they face impossible odds. A team of world-class divers navigate through miles of dangerous cave networks to discover that finding the boys is only the beginning.",
                "popularity": 8.5127,
                "poster_path": "/yi5KcJqFxy0D6yP8nCfcF8gJGg5.jpg",
                "release_date": "2022-07-18",
                "title": "Thirteen Lives",
                "video": false,
                "vote_average": 7.87,
                "vote_count": 1368,
                "character": "Reporter #2",
                "credit_id": "6647250bcee5ab90aa2df5f1",
                "order": 55
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Artin John Tsambazis"
        ],
        "biography": "In school, Artin John Tsambazis could not decide whether to pursue acting, aviation, or law. Now he acts, and the latter two he maintains an interest in. Artin stars as Joseph Reid in the CBS season 5 finale of SWAT. He appears in Ron Howard directed Thirteen Lives (MGM) in a minor supporting role opposite Viggo Mortensen and Colin Farrell, and can be seen in a major supporting role in romantic comedy feature Love in Bloom. He is Monty Holden in Watch Dogs Legion (Ubisoft), and Leander in Assassins Creed Odyssey (Ubisoft). Artin plays Ian - a 1970's British Rockstar in DC's Legends of Tomorrow, and can be seen in Warner Brothers Television's Supergirl, as a nefarious member of the \"Children of Liberty\". He took on the role of Italian mobster Anthony Skomal, in Death Note (Netflix), directed by Adam Wingard. His credits include The X Files and Lucifer (FOX), A&E's The Returned, & CW shows iZombie, The Tomorrow People, Supernatural, Arrow and Emily Owens M.D. Artin comes from a theatrical background, and has since made the transition to film & television. At age 17 he was awarded a scholarship to a prestigious US film and acting School, but deferred in order to make things happen for himself in the real world. Artin performed in, as well as produced the multi-award winning science fiction film 2BR02B: To Be Or Naught To Be (starring Melissa Roxburgh), based on the story by Kurt Vonnegut, with his producing partner Derek Pedersson. Artin and Derek are producing the feature film Druuna: Morbus Gravis (based on the Heavy Metal Magazine comics by Italian creator Paolo Eleuteri Serpieri). Artin's theater roles include A Steady Rain, by Keith Huff, where he reprised the Hugh Jackman Broadway role.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://igniteeliteartists.com/talent/artin-john/",
        "id": 1475789,
        "imdb_id": "nm4730571",
        "known_for_department": "Acting",
        "name": "Artin John",
        "place_of_birth": null,
        "popularity": 0.3425,
        "profile_path": "/kxGjzPRsCvi5q1ykCSndTYHD4ZL.jpg"
    }
}