{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/g0nLh5eQjTcffJUavvatBNkaSpy.jpg",
                "genre_ids": [
                    18
                ],
                "id": 132363,
                "original_language": "en",
                "original_title": "The Butler",
                "overview": "A look at the life of Cecil Gaines, who served eight presidents as the White House's head butler from 1952 to 1986, and had a unique front-row seat as political and racial history was made.",
                "popularity": 4.9736,
                "poster_path": "/pAi8Bl3ZKX6pANPVhNwbhbQANop.jpg",
                "release_date": "2013-08-16",
                "title": "The Butler",
                "video": false,
                "vote_average": 7.333,
                "vote_count": 2950,
                "character": "Lorraine",
                "credit_id": "62b869ff3d43e00051296ec3",
                "order": 26
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Pernell Walker (born September 19, 1980) is an American actress known for her impactful performances in film, television, and theater. Hailing from the South Bronx, Walker earned a Bachelor of Arts in Theater from City College and a Master of Fine Arts in Acting from the Actors Studio Drama School.  Walker first garnered attention with her breakout role as Laura in Pariah (2011), an award-winning Focus Features film directed by Dee Rees. Her performance earned critical acclaim and established her as a compelling presence in independent cinema. She further showcased her versatility with roles in television series such as The Deuce (2017–2019), where she portrayed Ruby \"Thunder Thighs,\" and City on a Hill (2021–2022), in which she played Grace Campbell.\n\nHer Off-Broadway debut came with the world premiere of SEED (2011), and she has participated in stage readings like Accept/Except, directed by Tony and Emmy Award-winning George Faison. Her stage performances, including roles in Singin' Wid a Sword in Ma Hand and Post Prison Playdate, reflect her commitment to powerful storytelling across mediums.\n\nWalker’s television credits include notable appearances in When They See Us (2019), directed by Ava DuVernay, Law & Order: Special Victims Unit (2018), and Dietland (2018). She has also appeared in films like Lost Cat Corona (2017) and Ambition’s Debt (2017). In recent years, her work has continued to expand, with roles in the Netflix series Ripley (2024) and the feature film Weekend in Taipei (2024).",
        "birthday": "1980-09-19",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1476142,
        "imdb_id": "nm2651139",
        "known_for_department": "Acting",
        "name": "Pernell Walker",
        "place_of_birth": null,
        "popularity": 0.1108,
        "profile_path": "/2BvLTNYVCZPI2QFAAAZosov4RYA.jpg"
    }
}