{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/syKiIOqEoOi1Hb0Oh0n9cImcBab.jpg",
                "genre_ids": [
                    27,
                    53
                ],
                "id": 756999,
                "original_language": "en",
                "original_title": "The Black Phone",
                "overview": "Finney Blake, a shy but clever 13-year-old boy, is abducted by a sadistic killer and trapped in a soundproof basement where screaming is of little use. When a disconnected phone on the wall begins to ring, Finney discovers that he can hear the voices of the killer’s previous victims. And they are dead set on making sure that what happened to them doesn’t happen to Finney.",
                "popularity": 13.5895,
                "poster_path": "/p9ZUzCyy9wRTDuuQexkQ78R2BgF.jpg",
                "release_date": "2022-06-17",
                "title": "The Black Phone",
                "video": false,
                "vote_average": 7.563,
                "vote_count": 5255,
                "character": "Patrolman",
                "credit_id": "616461929603310062be925f",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Kellan Rhude grew up in a military family, moving every few years, which shaped his ability to adapt and connect with people from all walks of life. As an actor, he has appeared in Dexter: New Blood, Showtime’s highest-rated miniseries, and brought a moment of levity to the darkness of David Fincher’s The Killer, which premiered in competition at the 2023 Venice International Film Festival. Having grown up on horror films, it’s no surprise he has been part of projects like The Black Phone for Universal, a major hit that now has a sequel set for fall 2025. He played Floyd Tibbits in Salem’s Lot, based on the Stephen King novel, and will soon star in a horror-thriller alongside Jena Malone, Terrence Howard, and Christopher Lloyd. He also has a role in the climax of Appofeniacs, a new thriller featuring Guardians of the Galaxy’s Sean Gunn.\n\nBeyond acting, Kellan loves to sing and play guitar. He’s an avid runner, and one of his favorite memories is swimming with wild spinner dolphins in Hawaii.\n\nHe earned his BFA from Boston University’s College of Fine Arts and is completing a master’s degree in writing at Johns Hopkins University. He writes poetry, essays, and fiction, with the goal of publishing his work in the near future.",
        "birthday": "1993-07-21",
        "deathday": null,
        "gender": 2,
        "homepage": "https://kellanrhude.com/",
        "id": 1477442,
        "imdb_id": "nm2474226",
        "known_for_department": "Acting",
        "name": "Kellan Rhude",
        "place_of_birth": "New York, USA",
        "popularity": 0.4223,
        "profile_path": "/kJROAmETdn5WaYl7xoCe6MW4MPm.jpg"
    }
}