{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4sOeeDX9uBteu81ty2bcdbzU933.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 308369,
                "original_language": "en",
                "original_title": "Me and Earl and the Dying Girl",
                "overview": "Greg is coasting through senior year of high school as anonymously as possible, avoiding social interactions like the plague while secretly making spirited, bizarre films with Earl, his only friend. But both his anonymity and friendship threaten to unravel when his mother forces him to befriend a classmate with leukemia.",
                "popularity": 2.52,
                "poster_path": "/eLjS2bLMjln2n2I73Xu6TaANPDZ.jpg",
                "release_date": "2015-06-12",
                "title": "Me and Earl and the Dying Girl",
                "video": false,
                "vote_average": 7.532,
                "vote_count": 2641,
                "character": "Madison",
                "credit_id": "557d32889251411e790012bb",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Katherine C. Hughes",
            "K.C. Hughes"
        ],
        "biography": "Katherine Hughes is a writer, director, and actor from New York currently based in Los Angeles. She has spent the last decade working on sets as an actress while learning vital lessons from a long list of filmmakers who have served as mentors and inspired her own work behind the camera. Her first short Yellow Belt Fury was featured on Short of the Week in late 2021 and has led to many exciting opportunities as an emerging director including securing financing for upcoming projects, writing assignments with major studios, and a development deal for her first feature. Katherine is currently studying gender and film at UCLA.  Katherine is greatly influenced by the rhythmic energy and world-building of Edgar Wright along with the dark comedy and feminine gore from writers like Diablo Cody. She is dedicated to achieving her goal of directing high-concept film and episodic television in addition to collaborating with established brands and artists.",
        "birthday": "1995-04-06",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.katherinehughes.me/",
        "id": 1477060,
        "imdb_id": "nm3675325",
        "known_for_department": "Acting",
        "name": "Katherine Hughes",
        "place_of_birth": "New York, New York, U.S.A.",
        "popularity": 0.2751,
        "profile_path": "/1Gu1be9AqBsySPV2VluUN49r7Ym.jpg"
    }
}