{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/20wSDAS6rUWhkZQ2PxPC9TRsAd1.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 11499,
                "original_language": "en",
                "original_title": "Frost/Nixon",
                "overview": "For three years after being forced from office, Nixon remained silent. But in summer 1977, the steely, cunning former commander-in-chief agreed to sit for one all-inclusive interview to confront the questions of his time in office and the Watergate scandal that ended his presidency. Nixon surprised everyone in selecting Frost as his televised confessor, intending to easily outfox the breezy British showman and secure a place in the hearts and minds of Americans. Likewise, Frost's team harboured doubts about their boss's ability to hold his own. But as the cameras rolled, a charged battle of wits resulted.",
                "popularity": 3.5386,
                "poster_path": "/z4cQ2mJxwPZUwVh97yX9oNsLLZQ.jpg",
                "release_date": "2008-10-15",
                "title": "Frost/Nixon",
                "video": false,
                "vote_average": 7.277,
                "vote_count": 1232,
                "character": "Tricia Nixon",
                "credit_id": "5a5e630b9251412a17004b7a",
                "order": 25
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jenn Gotzon",
            "Jennifer Gotzon",
            "Jenn Gotzen",
            "Jennifer Lee Gotzon"
        ],
        "biography": "Career break playing Pres. Nixon's daughter Tricia in 5-time Oscar Nominated \"Frost/Nixon\" launched Gotzon starring in many family films on Amazon winning awards for Doonby, God's Country, The Sacred Eternal, Julie and Jack. Award winning actress & International model, Jenn Gotzon brings a natural radiance, emotional depth and transformative ability to the protagonist roles she plays on-screen revealing hope to the human condition. With 2 Oscar-Nominated films, under her belt, playing historical characters - Tricia Nixon in Ron Howard's \"Frost/Nixon\" & British captive Lydia in \"Alone Yet Not Alone\" - Jenn's developed an uplifting brand as an American leading lady in wholesome and redemptive movies. Jenn Gotzon appears as the cover model on several magazines including Valley Social who printed, \"Gotzon continuously garners awards for her Meryl Streep chameleon-like transformations\" inspired from the Hollywood casting director Bill Dance after he saw Jenn win \"Best Actress\" for her protagonist role in short film \"Stained\". He told the press, \"I felt like I was watching a young Meryl Streep on screen\".",
        "birthday": "1979-05-18",
        "deathday": null,
        "gender": 1,
        "homepage": "https://jenngotzon.com",
        "id": 147879,
        "imdb_id": "nm1342461",
        "known_for_department": "Acting",
        "name": "Jenn Gotzon Chandler",
        "place_of_birth": "Northampton, Pennsylvania, USA",
        "popularity": 0.1349,
        "profile_path": "/kE5i7SL3voAa0yRbvZKUdVzJKqP.jpg"
    }
}