{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3m9hY5uixci0XpUawRG0mGEUe4r.jpg",
                "genre_ids": [
                    28,
                    80,
                    53
                ],
                "id": 984,
                "original_language": "en",
                "original_title": "Dirty Harry",
                "overview": "When a madman dubbed 'Scorpio' terrorizes San Francisco, hard-nosed cop, Harry Callahan – famous for his take-no-prisoners approach to law enforcement – is tasked with hunting down the psychopath.",
                "popularity": 3.0664,
                "poster_path": "/scl2JDHzYoIEs5xyYy5ITCfyY0G.jpg",
                "release_date": "1971-12-23",
                "title": "Dirty Harry",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 2588,
                "character": "Mrs. Russell",
                "credit_id": "52fe4296c3a36847f802a553",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Mae Mercer (June 12, 1932 – October 29, 2008) was an American blues singer and actress. She was born in the Temperance Hall community of Edgecombe County.\n\nMercer lived in North Carolina through age 15. She spent eight years in the 1960s singing in a blues bar in Paris, the Blues Club, owned by publisher Maurice Girodias and touring Europe. She eventually came to own and operate a blues club in the city.\n\nMercer returned to the United States in the early 1970s to begin a career as an actress in films and television. Films in which she appeared included Dirty Harry (1971), The Beguiled (1971), Frogs (1972), Cindy (1978), and Pretty Baby (1978). She was co-producer of the documentary film Angela Davis: Portrait of a Revolutionary (1972).\n\nIn 1996, the Mayor of Rocky Mount, NC, Fred Turnage, declared June 12 Mae Mercer Day. During this time, Mercer sought to produce her own biographical picture through her production company Black Owl Productions and was backed by local pastor Reverend James Bullock. Filming was slated to take place in Edgecombe County and other parts of North Carolina, New York, Paris and Southern California.",
        "birthday": "1932-06-12",
        "deathday": "2008-10-29",
        "gender": 1,
        "homepage": null,
        "id": 14787,
        "imdb_id": "nm0580284",
        "known_for_department": "Acting",
        "name": "Mae Mercer",
        "place_of_birth": null,
        "popularity": 0.1793,
        "profile_path": "/ursFwq5k7cmhrE4zIUpoKaDoALZ.jpg"
    }
}