{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3m9hY5uixci0XpUawRG0mGEUe4r.jpg",
                "genre_ids": [
                    28,
                    80,
                    53
                ],
                "id": 984,
                "original_language": "en",
                "original_title": "Dirty Harry",
                "overview": "When a madman dubbed 'Scorpio' terrorizes San Francisco, hard-nosed cop, Harry Callahan – famous for his take-no-prisoners approach to law enforcement – is tasked with hunting down the psychopath.",
                "popularity": 3.0664,
                "poster_path": "/scl2JDHzYoIEs5xyYy5ITCfyY0G.jpg",
                "release_date": "1971-12-23",
                "title": "Dirty Harry",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 2588,
                "character": "Bressler",
                "credit_id": "52fe4296c3a36847f802a54b",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Harold Vincent \"Harry\" Guardino",
            "Harold Vincent Guardino"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nHarry Guardino (December 23, 1925—July 17, 1995) was an American actor whose career spanned from the early 1950s to the early 1990s. In 1964, he was cast in a short-lived CBS series entitled The Reporter, a drama about a hard-hitting investigative journalist named Danny Taylor. His principal co-star was Gary Merrill as city editor Lou Sheldon.\n\nBorn in Brooklyn, New York, Guardino appeared on stage, in films, and on television. His Broadway theatre credits included A Hatful of Rain, One More River (earning a Tony Award nomination for Best Featured Actor in a Play for his performance), Anyone Can Whistle, The Rose Tattoo, The Seven Descents of Myrtle, and Woman of the Year.\n\nGuardino's other film credits include Houseboat, Pork Chop Hill (about the Korean War), The Five Pennies, King of Kings, Madigan, Lovers and Other Strangers, and Dirty Harry. He was nominated twice for the Golden Globe Award for Best Supporting Actor. He guest starred on John Cassavetes's 1959-1960 series, Johnny Staccato, the story of a pianist/private detective in New York City.\n\nIn 1960, Guardino appeared as Johnny Caldwell in the episodes \"Perilous Passage\", \"The O'Mara's Ladies\", and \"Daughter of the Sioux\" in the NBC western series Overland Trail starring William Bendix and Doug McClure. McClure two years later would join the long-running The Virginian series on NBC after a preceding stint on the CBS detective series Checkmate (TV series).\n\nGuardino had a continuing role as Perry Mason's nemesis, Hamilton Burger, in the 1973 television series The New Perry Mason and a recurring role on Angela Lansbury's Murder, She Wrote. He made guest appearances in dozens of television series, including Studio One, Target: The Corruptors!, The Eleventh Hour, Alfred Hitchcock Presents, Kraft Television Theatre, Playhouse 90, Dr. Kildare, The Lloyd Bridges Show, Route 66, Ben Casey, Hawaii Five-O, Love, American Style, The Greatest Show on Earth, Kojak, The Streets of San Francisco, Jake and the Fatman, and Cheers. He had the lead role of Det. Lee Gordon in the 1969 made-for-television suspense film The Lonely Profession.\n\nGuardino died at the age of sixty-nine of lung cancer in Palm Springs, California.\n\nDescription above from the Wikipedia article Harry Guardino, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1925-12-23",
        "deathday": "1995-07-17",
        "gender": 2,
        "homepage": null,
        "id": 14785,
        "imdb_id": "nm0345340",
        "known_for_department": "Acting",
        "name": "Harry Guardino",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.4697,
        "profile_path": "/wuLulT4AiELcmIxKFaQp3RNlg08.jpg"
    }
}