{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3m9hY5uixci0XpUawRG0mGEUe4r.jpg",
                "genre_ids": [
                    28,
                    80,
                    53
                ],
                "id": 984,
                "original_language": "en",
                "original_title": "Dirty Harry",
                "overview": "When a madman dubbed 'Scorpio' terrorizes San Francisco, hard-nosed cop, Harry Callahan – famous for his take-no-prisoners approach to law enforcement – is tasked with hunting down the psychopath.",
                "popularity": 3.464,
                "poster_path": "/scl2JDHzYoIEs5xyYy5ITCfyY0G.jpg",
                "release_date": "1971-12-23",
                "title": "Dirty Harry",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 2588,
                "character": "Chico",
                "credit_id": "52fe4296c3a36847f802a547",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/mrfbeWcjgSaZ9NEb0xJMR9xzSeB.jpg",
                "genre_ids": [
                    18
                ],
                "id": 380,
                "original_language": "en",
                "original_title": "Rain Man",
                "overview": "When car dealer Charlie Babbitt learns that his estranged father has died, he returns home to Cincinnati, where he discovers that he has a savant older brother named Raymond and that his father's $3 million fortune is being left to the mental institution in which Raymond lives. Motivated by his father's money, Charlie checks Raymond out of the facility in order to return with him to Los Angeles. The brothers' cross-country trip ends up changing both their lives.",
                "popularity": 8.4238,
                "poster_path": "/iTNHwO896WKkaoPtpMMS74d8VNi.jpg",
                "release_date": "1988-12-12",
                "title": "Rain Man",
                "video": false,
                "vote_average": 7.751,
                "vote_count": 6688,
                "character": "(voice)",
                "credit_id": "63b6c49b07e28100e08b51dd",
                "order": 50
            },
            {
                "adult": false,
                "backdrop_path": "/ttBydD0SynC0TMkW3AcnmsySkLp.jpg",
                "genre_ids": [
                    10749,
                    14,
                    18,
                    35
                ],
                "id": 137,
                "original_language": "en",
                "original_title": "Groundhog Day",
                "overview": "A narcissistic TV weatherman, along with his attractive-but-distant producer, and his mawkish cameraman, is sent to report on Groundhog Day in the small town of Punxsutawney, where he finds himself repeating the same day over and over.",
                "popularity": 7.2346,
                "poster_path": "/gCgt1WARPZaXnq523ySQEUKinCs.jpg",
                "release_date": "1993-02-11",
                "title": "Groundhog Day",
                "video": false,
                "vote_average": 7.616,
                "vote_count": 8408,
                "character": "State Trooper (voice) (uncredited)",
                "credit_id": "5613fcba9251412d06002a72",
                "order": 49
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Reni Santoni (April 21, 1939 – August 1, 2020) was an American film, television and voice actor.\n\nSantoni was born in New York City of French and Spanish descent.\n\nHe began his career in off-Broadway theatre. His first significant film role was an uncredited appearance in the 1964 film The Pawnbroker, starring Rod Steiger, in which he played a junkie trying to sell a radio to the title character, using anti-Semitic slurs that have absolutely no effect.\n\nSantoni's first leading role was as the young actor in Carl Reiner's Enter Laughing. His other well-known film roles include Inspector \"Chico\" González in the 1971 classic Dirty Harry, as Ramon Herrera in the 1983 hit drama Bad Boys, and as detective Tony Gonzales in 1986 action film Cobra. Around that time, he also made guest appearances on television shows such as Barnaby Jones, Lou Grant, Hawaii Five-O, Hardcastle and McCormick, Hill Street Blues and Midnight Caller. In 1973, he was a junior partner on, \"Owen Marshall: Counselor at Law\". (Santoni and \"Owen Marshall\" co-star Lee Majors were born the same week in April 1939).\n\nSantoni continued to work in film and television through to the 21st century. Some of his more memorable characterizations include \"Poppie,\" the unhygienic restaurateur on TV's Seinfeld, and \"Captain Carlos Rodríguez\" in Carl Reiner's comedy film Dead Men Don't Wear Plaid.\n\nDescription above from the Wikipedia article Reni Santoni, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1939-04-21",
        "deathday": "2020-08-01",
        "gender": 2,
        "homepage": null,
        "id": 14784,
        "imdb_id": "nm0763858",
        "known_for_department": "Acting",
        "name": "Reni Santoni",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.5287,
        "profile_path": "/pA8RHgo7dDMSBcBwWmDITjuZGIe.jpg"
    }
}