{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wdwcOBMkt3zmPQuEMxB3FUtMio2.jpg",
                "genre_ids": [
                    12,
                    28,
                    878
                ],
                "id": 271110,
                "original_language": "en",
                "original_title": "Captain America: Civil War",
                "overview": "Following the events of Age of Ultron, the collective governments of the world pass an act designed to regulate all superhuman activity. This polarizes opinion amongst the Avengers, causing two factions to side with Iron Man or Captain America, which causes an epic battle between former allies.",
                "popularity": 12.4919,
                "poster_path": "/rAGiXaUfPzY7CDEyNKUofk3Kw2e.jpg",
                "release_date": "2016-04-27",
                "title": "Captain America: Civil War",
                "video": false,
                "vote_average": 7.448,
                "vote_count": 23408,
                "character": "Chinese Newscaster",
                "credit_id": "635fcb91590086110980a7cf",
                "order": 76
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "金世佳",
            "Jin Shijia",
            "小太阳",
            "Kim Scar",
            "Цзинь Ши Цзя",
            "Jin Shi Jia",
            "Kingscar Jin"
        ],
        "biography": "Jin Shi Jia, also known as Kingscar Jin, is a Chinese actor and former swimmer, born on November 10, 1986, in Shanghai, China. He gained recognition for his role as Lu Zhanbo in the popular romantic comedy TV series 'iPartment', which became a hit among young audiences in China. Jin graduated from the Shanghai Theatre Academy, where he majored in acting.\n\nBefore his acting career, Jin was a competitive swimmer and even won a silver medal in the Men's 100m Freestyle at the National Youth Championships in 2003. His acting journey began in 2009, and he has since appeared in numerous TV series and films, showcasing his versatility. Some of his notable works include Tiny Times, My Amazing Bride, and Under the Skin. Jin has also ventured into theater, further demonstrating his passion for the performing arts.",
        "birthday": "1986-11-10",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1480174,
        "imdb_id": "nm4369324",
        "known_for_department": "Acting",
        "name": "Jin Shijia",
        "place_of_birth": "Shanghai, China",
        "popularity": 1.0237,
        "profile_path": "/q8vtZEynxIODbPDIRUellNufUHH.jpg"
    }
}