{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/pBdQ4iorzRV2G38mdS6rzrmUfMA.jpg",
                "genre_ids": [
                    28,
                    10752
                ],
                "id": 840326,
                "original_language": "fi",
                "original_title": "Sisu",
                "overview": "When an ex-soldier who discovers gold in the Lapland wilderness tries to take the loot into the city, German soldiers led by a brutal SS officer battle him.",
                "popularity": 10.1824,
                "poster_path": "/zehhtcLHnTOE0lw9rLTIRsJeeW2.jpg",
                "release_date": "2022-09-09",
                "title": "Sisu",
                "video": false,
                "vote_average": 7.408,
                "vote_count": 2440,
                "character": "Aatami",
                "credit_id": "60c752ddd132d600416afca4",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Йорма Томміла",
            "یورما تومیلا"
        ],
        "biography": "Jorma Tommila (Finnish pronunciation: [ˈjo̞rmɑ ˈtomːilɑ]; born 1959) is a Finnish actor. Winner of the Jussi Award for Best Actor in 1997, Tommila is best known for playing Aatami Korpi in the film Sisu (2022).\n\nTommila was born in Rauma, Finland and spent his youth in Kiukainen. His father died when Jorma was four years old, after suffering from injuries to his lungs in World War II. Tommila was raised by his mother, and his older sister Kielo Tommila is also an actress. He lives with his family in Vaasa. He is married to actress Ida Helander-Tommila, the sister of director Jalmari Helander. He is the father of Onni Tommila, who is also an actor.\n\nWhilst at Helsinki Theatre Academy in 1987, Tommila was one of four founding members of God's Theater, a Finnish theater group that made experimental and radical stage art, their performances including full frontal nudity, the setting off of fire extinguishers, and the performers throwing faeces into the crowd. The four were arrested and fined, and given suspended prison sentences. They were also expelled from the college, the expulsion prompting protests from fellow students.\n\nIn 1997, Tommila won the Jussi Award for Best Actor for his role in the film The Christmas Party, directed by his God Theatre's fellow founder Jari Halonen.\n\nTommila's character in the film Sisu, filmed in Lapland with a budget of €6 million, has been compared with Rambo (played by Sylvester Stallone) in the 1982 film, and with John Wick (played by Keanu Reeves). He has also been described as a “new action cinema icon”. Tommila portrays Aatami Korpi, an ex-commando and gold prospector who strikes gold but has his bounty stolen by Nazi soldiers. Korpi, with courage and \"unimaginable determination in the face of overwhelming odds\", becomes \"a one-man death squad who will go to outrageous lengths to get his gold back – even if it means killing every last Nazi in his path.\" For the role Tommila won the award for best actor at the Sitges Film Festival in 2022.",
        "birthday": "1959-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 148012,
        "imdb_id": "nm0866918",
        "known_for_department": "Acting",
        "name": "Jorma Tommila",
        "place_of_birth": "Panelia, Finland",
        "popularity": 0.8416,
        "profile_path": "/ll9ZZR4kMnHS8FU2yHx76bnm0P.jpg"
    }
}