{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/o7JVhqMmrex1TPbmuxl8YXVlcfl.jpg",
                "genre_ids": [
                    28,
                    35,
                    14
                ],
                "id": 287947,
                "original_language": "en",
                "original_title": "Shazam!",
                "overview": "A boy is given the ability to become an adult superhero in times of need with a single magic word.",
                "popularity": 6.2104,
                "poster_path": "/xnopI5Xtky18MPhK40cZAGAOVeV.jpg",
                "release_date": "2019-03-29",
                "title": "Shazam!",
                "video": false,
                "vote_average": 6.988,
                "vote_count": 9869,
                "character": "Billy's Mom",
                "credit_id": "5ab15287c3a368619e00fe01",
                "order": 23
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Caroline Korycki"
        ],
        "biography": "Caroline Palmer is an alumnus of Western University, where she performed regularly on stage and at the London Fringe Festival. Caroline returned to Toronto to complete a masters degree, and pursue a career in film and television. She soon landed a lead role in the feature film The Drownsman, from Black Fawn Films and Breakthrough Entertainment, and has been gaining momentum in the industry ever since. Known for her ability to shift from comedic to dramatic roles, and strong dialect work, Caroline was most recently seen on USA's Suits, CBC's breakout hit Workin' Moms, working alongside Christoph Waltz and Vanessa Redgrave in Waltz's directorial debut Georgetown, playing Kim Price, a new character in Season 12 of CBC's prolific Heartland, and as the mom of Billy Batson (played by Asher Angel and Zachary Levi) in DC's latest franchise Shazam!. When not on set she can be found writing (her first film, Thinly Veiled, is in post-production), and producing for Roaming Focus Productions, which she co-owns with her husband, Photographer and Director, Mike Palmer.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1482440,
        "imdb_id": "nm5699124",
        "known_for_department": "Acting",
        "name": "Caroline Palmer",
        "place_of_birth": "Canada ",
        "popularity": 0.817,
        "profile_path": "/bBoPZEt3IDFzKgmvnO8Bd75rgDW.jpg"
    }
}