{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8yE0aOQoZSSl2CuuPvjxdHuQl4P.jpg",
                "genre_ids": [
                    878,
                    53
                ],
                "id": 10514,
                "original_language": "en",
                "original_title": "The Andromeda Strain",
                "overview": "When virtually all of the residents of Piedmont, New Mexico, are found dead after the return to Earth of a space satellite, the head of the US Air Force's Project Scoop declares an emergency. A group of eminent scientists led by Dr. Jeremy Stone scramble to a secure laboratory and try to first isolate the life form while determining why two people from Piedmont - an old alcoholic and a six-month-old baby - survived. The scientists methodically study the alien life form unaware that it has already mutated and presents a far greater danger in the lab, which is equipped with a nuclear self-destruct device designed to prevent the escape of dangerous biological agents.",
                "popularity": 4.67,
                "poster_path": "/4FBSFz8wLpxd4o6hnvKOJJ8WSIz.jpg",
                "release_date": "1971-03-12",
                "title": "The Andromeda Strain",
                "video": false,
                "vote_average": 7.054,
                "vote_count": 736,
                "character": "Dr. Charles Dutton",
                "credit_id": "52fe437e9251416c750127dd",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Wayne James McMeekan"
        ],
        "biography": "David Wayne (January 30, 1914 – February 9, 1995) was an American actor with a career spanning nearly 50 years.\n\nWayne was born Wayne James McMeekan in Traverse City, Michigan, the son of Helen Matilda (née Mason) and John David McMeekan. He grew up in Bloomingdale, Michigan. Wayne's first major Broadway role was Og the leprechaun in Finian's Rainbow, for which he won the Theatre World Award and the first ever Tony for Best Featured Actor in a Musical. While appearing in the play, he and co-star Albert Sharpe were recruited by producer David O. Selznick to play Irish characters in the film Portrait of Jennie (1948).\n\nIt was in 1948 as well that Wayne became one of those fortunate 50 applicants (out of approximately 700) granted membership in New York's newly formed Actors Studio. He was awarded a second Tony for Best Actor in a Play for The Teahouse of the August Moon and was nominated as Best Actor in a Musical for The Happy Time. He originated the role of Ensign Pulver in the classic stage comedy Mister Roberts and also appeared in Say, Darling, After the Fall, and Incident at Vichy.",
        "birthday": "1914-01-30",
        "deathday": "1995-02-09",
        "gender": 2,
        "homepage": null,
        "id": 14831,
        "imdb_id": "nm0915536",
        "known_for_department": "Acting",
        "name": "David Wayne",
        "place_of_birth": "Traverse City - Michigan - USA",
        "popularity": 0.5209,
        "profile_path": "/mXatzN2o2Dcx4hUQxeKXkbkE9Fk.jpg"
    }
}