{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5UX6M0aEphiW6Xmy5rpYX75glbo.jpg",
                "genre_ids": [
                    14,
                    27,
                    35
                ],
                "id": 927,
                "original_language": "en",
                "original_title": "Gremlins",
                "overview": "After receiving an exotic small animal as a Christmas gift, a young man inadvertently breaks three important rules concerning his new pet, which unleashes a horde of malevolently mischievous creatures on a small town.",
                "popularity": 6.4053,
                "poster_path": "/6m0F7fsXjQvUbCZrPWcJNrjvIui.jpg",
                "release_date": "1984-06-08",
                "title": "Gremlins",
                "video": false,
                "vote_average": 7.136,
                "vote_count": 6659,
                "character": "Sheriff Frank",
                "credit_id": "52fe428ec3a36847f8027fc5",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Gerard Gilbert",
            "Gerard Kenneth Tierney"
        ],
        "biography": "​From Wikipedia, the free encyclopedia\n\nScott Brady (September 13, 1924 – April 16, 1985) was an American film and television actor. Born as Gerard Kenneth Tierney, he was the younger brother of fellow actor Lawrence Tierney. Brady served in the Navy during World War II, where he was a boxing champ. After being discharged, he supported himself as a lumberjack, and began taking acting classes; he began his film career soon afterward. Brady specialized in tough-guy roles in films like He Walked by Night, Canon City and Johnny Guitar. He appeared twice on the long running TV western The Virginian in the 1960s. He appeared regularly on the 1970s cop show, Police Story. He played lead to Clint Eastwood's third billing in Ambush at Cimarron Pass, which Eastwood is quoted as saying was \"probably the lousiest western ever made.\" His last film role was in the 1984 movie Gremlins. He played Shirley Feeney's father Jack Feeney in episode 32 of Laverne & Shirley which aired on February 15, 1977. He also starred in the western TV show Shotgun Slade from 1959-61. Brady died from pulmonary fibrosis at the age of 60. Other sources have the cause as emphysema.\n\nDescription above from the Wikipedia article Scott Brady, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1924-09-13",
        "deathday": "1985-04-16",
        "gender": 2,
        "homepage": null,
        "id": 14847,
        "imdb_id": "nm0103722",
        "known_for_department": "Acting",
        "name": "Scott Brady",
        "place_of_birth": "Brooklyn, New York City, New York, USA",
        "popularity": 0.9106,
        "profile_path": "/qdtpqkFPVjpakR75RiNx7TQyiej.jpg"
    }
}