{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bP9iuGdBVD48Sw6r06ZcepwMZ1c.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 22596,
                "original_language": "en",
                "original_title": "Safety Last!",
                "overview": "When a store clerk organizes a contest to climb the outside of a tall building, circumstances force him to make the perilous climb himself.",
                "popularity": 2.0538,
                "poster_path": "/fEt5HWJ32ek8ibef7zSZnA00Jp0.jpg",
                "release_date": "1923-04-01",
                "title": "Safety Last!",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 542,
                "character": "Department Store Customer (uncredited)",
                "credit_id": "59d2b89c925141405b000630",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Antoinette Field",
            "Helen Field Gilmore",
            "Helen Gillmore",
            "Antoinette A. Field"
        ],
        "biography": "Helen Gilmore (born Antoinette A. Field, c. 1872 – April 1936) was an American actress of the stage and silent motion pictures from Louisville, Kentucky. She appeared in over 140 films between 1913 and 1932.\n\nIn approximately 1872, Gilmore was born to Richard Field and Mary Cilia Daniels. In 1894, she toured with comic actor Stuart Robson's company, even substituting, on at least one occasion, for Mrs. Robson—the temporarily unavailable May Waldron—in the role of Adriana in Shakespeare's A Comedy of Errors. It was during that tour that Gilmore met and married fellow cast member (and fellow Kentuckian), Joseph B. Zahner, hurriedly tying the knot at New York's City Hall on Friday, July 13. Scarcely five years later, Zahner, then 33, suffered a fatal heart attack.\n\nBetween 1910 and 1913, Gilmore appeared on Broadway in 4 musical revues: Deems Taylor's The Echo, Manuel Klein's Around the World and Under Many Flags (both at the New York Hippodrome), and Oscar Straus's My Little Friend. Shortly thereafter, she made her screen debut in A Female Fagin.\n\nAs Mrs. Hobbs in A Petticoat Pilot (1918), Gilmore was commended for her careful character study. The Paramount Pictures film was directed by Rollin S. Sturgeon and was based on the novel by Evelyn Lincoln. She played the head nurse in Too Much Business (1922). This was a comedy which originated with a Saturday Evening Post story by Earl Derr Biggers. In it Gilmore was cast with Elsa Lorimer and Mack Fenton. Her final motion picture credit is for the role of a motorist in the Laurel and Hardy short Two Tars (1928).",
        "birthday": "1862-01-04",
        "deathday": "1936-11-16",
        "gender": 1,
        "homepage": null,
        "id": 148405,
        "imdb_id": "nm0319532",
        "known_for_department": "Acting",
        "name": "Helen Gilmore",
        "place_of_birth": " Washington, District of Columbia, USA",
        "popularity": 0.0713,
        "profile_path": "/8YkdtQhmNnH8AyuQ41P8xhfgKc4.jpg"
    }
}