{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/eMgflonfRY89Zj4LZykJKPpG4wg.jpg",
                "genre_ids": [
                    18
                ],
                "id": 596,
                "original_language": "en",
                "original_title": "The Grapes of Wrath",
                "overview": "Tom Joad returns to his home after a jail sentence to find his family kicked out of their farm due to foreclosure. He catches up with them on his Uncle’s farm, and joins them the next day as they head for California and a new life... Hopefully.",
                "popularity": 5.0806,
                "poster_path": "/eUcxMVBIA0Jg8l1RGUqycrc3eIQ.jpg",
                "release_date": "1940-03-15",
                "title": "The Grapes of Wrath",
                "video": false,
                "vote_average": 7.815,
                "vote_count": 1043,
                "character": "Hungry Girl (uncredited)",
                "credit_id": "55e50635925141379d000960",
                "order": 94
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Margaret O'Rene Ryan",
            "Margaret Sherman"
        ],
        "biography": "A vastly talented musical performer, Peggy Ryan found stardom dancing alongside partner Donald O'Connor as Universal's answer to Judy Garland and Mickey Rooney. Paired up in many a low-budget WWII-era musical, she was best known for her dancing feet, but she was no slouch in the singing department and her buoyant personality added plenty of zest to the escapist fare she appeared in.\n\nChristened Margaret O'Rene Ryan, Peggy was, as they say, born in a trunk in 1924 to a pair of vaudeville dancers (\"The Merry Dancing Ryans\") and, by age two, the pint-sized scene-stealer was already selling her heart out on stage alongside her parents. No glamor girl, Peggy had a very plaintive face, prominent nose and gangly figure, similar to a Virginia Weidler, so she was wise enough to play it up for laughs. Discovered by George Murphy, the young girl earned a part in Universal's enjoyable tune fest Top of the Town(1937), where the little Irish charmer managed to steal a dance alongside Murphy. Other movies beckoned, sometimes in teary dramas such as The Women Men Marry (1937) and The Grapes of Wrath (1940). With the movie What's Cookin'? (1942), she teamed with O'Connor for the first time. The two were a sensation and sparked many musical programmers with their clowning, mugging, intricate dance steps, and indefatigable style. The jitterbugging twosome romped through Private Buckaroo (1942), Give Out, Sisters(1942), Get Hep to Love (1942), Top Man (1943), The Merry Monahans (1944), Chip Off the Old Block (1944) and Bowery to Broadway (1944) during their peak. During this period she married James Cross and had a son, James Michael Cross, who later died in a 1987 car accident.\n\nPeggy began to freelance in post-war years and found employment with other studios. She was paired up with dancer Ray McDonald for the films Shamrock Hill (1949) and All Ashore (1953) and began seeing him off screen as well. They eventually married, had a child named Kerry, and toured together across the U.S. in a nightclub act for a few years until their marriage folded. She decided to retire from films following her third marriage to Hawaiian announcer/emcee/columnist Eddie Sherman. She choreographed book shows here and there (\"The Music Man\", \"Funny Girl\"), but basically settled down in Hawaii. In later years, she came out of semi-retirement to appear in a small recurring part as the Governor of Hawaii's secretary, Millie, on TV's popular Hawaii Five-O (1968) in 1968. She remained a sporadic presence throughout the run of the show. After teaching tap dancing for decades on the sly, Peggy moved to Las Vegas with her family. A trouper to the end, she formed a group of middle-aged dancers called \"The TNT's\" and performed in and about town. In 2003, she suffered her first mini-stroke, dying a year later in what was reported to be complications from multiple strokes on October 30, 2004.",
        "birthday": "1924-08-28",
        "deathday": "2004-10-30",
        "gender": 1,
        "homepage": null,
        "id": 148567,
        "imdb_id": "nm0752787",
        "known_for_department": "Acting",
        "name": "Peggy Ryan",
        "place_of_birth": "Long Beach, California, USA",
        "popularity": 1.8076,
        "profile_path": "/4AVB1gkMaZlSzsUIlw6OHYsGRS8.jpg"
    }
}