{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/y2FNZLHynsevBnVTocGW6c3pQpr.jpg",
                "genre_ids": [
                    18
                ],
                "id": 422,
                "original_language": "it",
                "original_title": "8½",
                "overview": "Guido Anselmi, a film director, finds himself creatively barren at the peak of his career. Urged by his doctors to rest, Anselmi heads for a luxurious resort, but a sorry group gathers—his producer, staff, actors, wife, mistress, and relatives—each one begging him to get on with the show. In retreat from their dependency, he fantasizes about past women and dreams of his childhood.",
                "popularity": 4.83,
                "poster_path": "/t8pFvll3cFrn5NmqZz2FawqIwPe.jpg",
                "release_date": "1963-02-14",
                "title": "8½",
                "video": false,
                "vote_average": 8.1,
                "vote_count": 2411,
                "character": "Maurice, Maya's Assistant",
                "credit_id": "559ac23bc3a3684baa0040bb",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            " Abdalqadir as-Sufi"
        ],
        "biography": "After a brief career in acting, Ian Dallas, a native-born Scotsman, later reverted to Islam and joined the Shadhili-Darqawi Order of Sufis in Morocco. Upon the death of his Shaykh, Shaykh Muhammad Ibn al-Habib, Dallas became the Shaykh of the Order under the name Shaykh Abdulqadir as-Sufi, the name he was given by his Shaykh. He is still active today (2004) as the leader of the worldwide Murabitun movement of Sufis. He wrote a fictionalized account of his journey into Sufism in a novel, \"The Book of Strangers.\" It is also said that, while living in London in the 1960s, he was friends with Eric Clapton, and gave Clapton a copy of the ancient Persian Sufi parable \"Layla and Majnun,\" which later became the basis for Clapton's song \"Layla\" about his own ill-fated romance.",
        "birthday": "1930-10-30",
        "deathday": "2021-08-01",
        "gender": 2,
        "homepage": null,
        "id": 1485030,
        "imdb_id": "nm0198037",
        "known_for_department": "Acting",
        "name": "Ian Dallas",
        "place_of_birth": "Edinburgh, Scotland, UK",
        "popularity": 0.0143,
        "profile_path": null
    }
}