{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/x3mFfOKOzIi1ROSgy9bgyYq7zDH.jpg",
                "genre_ids": [
                    18
                ],
                "id": 342737,
                "original_language": "en",
                "original_title": "20th Century Women",
                "overview": "In 1979 Santa Barbara, California, Dorothea Fields is a determined single mother in her mid-50s who is raising her adolescent son, Jamie, at a moment brimming with cultural change and rebellion. Dorothea enlists the help of two younger women – Abbie, a free-spirited punk artist living as a boarder in the Fields' home and Julie, a savvy and provocative teenage neighbour – to help with Jamie's upbringing.",
                "popularity": 2.1717,
                "poster_path": "/mso2rEr9i0MilRIOao5HaWFipS9.jpg",
                "release_date": "2016-12-28",
                "title": "20th Century Women",
                "video": false,
                "vote_average": 7.325,
                "vote_count": 1186,
                "character": "Jamie",
                "credit_id": "5869ce489251414e750133ce",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/wEXYJgW5l2IwwNdRVk9ixgKl8qu.jpg",
                "genre_ids": [
                    10749,
                    14
                ],
                "id": 465136,
                "original_language": "en",
                "original_title": "Every Day",
                "overview": "16-year old Rhiannon falls in love with a mysterious spirit named “A” that inhabits a different body every day. Feeling an unmatched connection, Rhiannon and “A” work each day to find each other, not knowing what the next day will bring.",
                "popularity": 5.4778,
                "poster_path": "/4UnME3icxSspwL0UoGZNSyyp7Xs.jpg",
                "release_date": "2018-02-22",
                "title": "Every Day",
                "video": false,
                "vote_average": 7.252,
                "vote_count": 2263,
                "character": "Nathan / A",
                "credit_id": "596079379251410a590b3029",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "لوکاس جید زومان",
            "لوکاس زومان"
        ],
        "biography": "Lucas Jade Zumann was raised in a Jewish family and attended Hebrew school. He went to Waters Elementary School, then transferred to the Chicago Waldorf School in fifth grade, where he studied until eighth grade before returning for his senior year.\n\nZumann was discovered by Paskal Rudnicke during a Disney talent search casting call in Chicago. His first foray into acting was as an ensemble member in the musical \"Oliver!\" at the Music Theater Works (formerly Light Opera Works) in his hometown. He later had a small role in the Netflix series Sense8, playing a punk.\n\nZumann's first major role was as Milo in the horror film Sinister 2. He gained further recognition for his portrayal of Jamie Fields in the Academy Award-nominated film 20th Century Women, alongside Elle Fanning, Billy Crudup, Greta Gerwig, and Annette Bening. In 2016, he also appeared in an episode of the television series Chicago Fire.\n\nHe gained international fame for his role as Gilbert Blythe in the Canadian television series Anne with an E, which premiered in 2017 on CBC and Netflix.\n\nIn 2018, he starred as Nathan Daldry/A in the teen romantic comedy film Every Day. He was also cast in the films Dr. Bird's Advice for Sad Poets and To The Stars that same year.\n\nIMDb Mini Bio By; yusufpiskin",
        "birthday": "2000-12-12",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1485770,
        "imdb_id": "nm6722749",
        "known_for_department": "Acting",
        "name": "Lucas Jade Zumann",
        "place_of_birth": "Chicago, Illinois, USA",
        "popularity": 1.12,
        "profile_path": "/7ocQJdexgzKx4Yqk0qs9fChIniV.jpg"
    }
}