{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kFm4FbjD2mBWtK9uyXryFtOD0Ut.jpg",
                "genre_ids": [
                    10751,
                    35
                ],
                "id": 11528,
                "original_language": "en",
                "original_title": "The Sandlot",
                "overview": "During a summer of friendship and adventure, one boy becomes a part of the gang, nine boys become a team and their leader becomes a legend by confronting the terrifying mystery beyond the right field wall.",
                "popularity": 5.0629,
                "poster_path": "/7PYqz0viEuW8qTvuGinUMjDWMnj.jpg",
                "release_date": "1993-04-07",
                "title": "The Sandlot",
                "video": false,
                "vote_average": 7.537,
                "vote_count": 1239,
                "character": "Kenny DeNunez",
                "credit_id": "52fe44539251416c75030bcd",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/ihIVjdiuvtVuFUaCqfNJwajIs3i.jpg",
                "genre_ids": [
                    14,
                    10402
                ],
                "id": 13192,
                "original_language": "en",
                "original_title": "Moonwalker",
                "overview": "Moonwalker is a 1988 American experimental anthology musical film starring Michael Jackson. Rather than featuring one continuous narrative, the film expresses the influence of fandom and innocence through a collection of short films about Jackson, some of which are long-form music videos from Jackson's 1987 album Bad. The film is named after his famous dance, \"the moonwalk\", which he originally learned as \"the backslide\" but perfected the dance into something no one had seen before. The movie's introduction is a type of music video for Jackson's \"Man in the Mirror\" but is not the official video for the song. The film then expresses a montage of Michael's career, which leads into a parody of his Bad video titled \"Badder\", followed by sections \"Speed Demon\" and \"Leave Me Alone\". What follows is the biggest section where Michael plays a hero with magical powers and saves three children from Mr. Big. This section is \"Smooth Criminal\" which leads into a performance of \"Come Together\".",
                "popularity": 3.7532,
                "poster_path": "/3GwTPQkAcgDeAirRpEuJG8HDdRz.jpg",
                "release_date": "1988-10-29",
                "title": "Moonwalker",
                "video": false,
                "vote_average": 6.977,
                "vote_count": 587,
                "character": "Zeke",
                "credit_id": "52fe454c9251416c75051c77",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Brandon Adams",
            "Brandon Q. Adams"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nBrandon Quintin Adams (born August 22, 1979) is an American actor known for his playing Jesse Hall in the first two Mighty Ducks movies and Kenny DeNunez in The Sandlot.\n\nBrandon has also appeared in The Fresh Prince of Bel-Air, Martin, and in Michael Jackson's Moonwalker where he played Zeke 'Baby Bad' Michael in the Badder segment, a parody of Jackson's classic video for \"Bad\". He also was in the \"Smooth Criminal\" short film and appeared in the movie The People Under the Stairs. Adams' also provided the voice of Raijin in the hit video game Kingdom Hearts II.\n\nAdams is also a rapper, performing under the name B. Lee.\n\nDescription above from the Wikipedia article Brandon Adams, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1979-08-22",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 148638,
        "imdb_id": "nm0010781",
        "known_for_department": "Acting",
        "name": "Brandon Quintin Adams",
        "place_of_birth": "Topeka, Kansas, USA",
        "popularity": 0.5146,
        "profile_path": "/1mZvTa53pIRElfS2H0SXIpnaite.jpg"
    }
}