{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uChOlEWqFwxwJ3eZP9eQj2yqczd.jpg",
                "genre_ids": [
                    35,
                    10402,
                    10749
                ],
                "id": 13368,
                "original_language": "en",
                "original_title": "White Christmas",
                "overview": "Two talented song-and-dance men team up after the war to become one of the hottest acts in show business. In time they befriend and become romantically involved with the beautiful Haynes sisters who comprise a sister act.",
                "popularity": 3.2375,
                "poster_path": "/A5kBQsHKbIptxJyELEpHQJROCRj.jpg",
                "release_date": "1954-10-14",
                "title": "White Christmas",
                "video": false,
                "vote_average": 7.183,
                "vote_count": 540,
                "character": "Carousel Club Diner (uncredited)",
                "credit_id": "649f11ad3af929012539462a",
                "order": 25
            },
            {
                "adult": false,
                "backdrop_path": "/jGyDvz8WjVZzHX573WDs8BTIUU9.jpg",
                "genre_ids": [
                    9648,
                    10749,
                    53
                ],
                "id": 381,
                "original_language": "en",
                "original_title": "To Catch a Thief",
                "overview": "An ex-thief is accused of enacting a new crime spree, so to clear his name he sets off to catch the new thief, who’s imitating his signature style.",
                "popularity": 3.9352,
                "poster_path": "/9UdAlTenWqxj2l5oFExkjuVHmKO.jpg",
                "release_date": "1955-08-03",
                "title": "To Catch a Thief",
                "video": false,
                "vote_average": 7.282,
                "vote_count": 1591,
                "character": "Frenchman (uncredited)",
                "credit_id": "64f461803d43e000c4a8eda2",
                "order": 22
            },
            {
                "adult": false,
                "backdrop_path": "/87wqeMeUeMRLjsE1IWNKJcPlpuC.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 289,
                "original_language": "en",
                "original_title": "Casablanca",
                "overview": "In Casablanca, Morocco in December 1941, a cynical American expatriate meets a former lover, with unforeseen complications.",
                "popularity": 5.0551,
                "poster_path": "/oyGRZVIthHJjc98ekKpeWpDh8Ws.jpg",
                "release_date": "1943-01-15",
                "title": "Casablanca",
                "video": false,
                "vote_average": 8.155,
                "vote_count": 5717,
                "character": "Gambler at Rick's (uncredited)",
                "credit_id": "53a1bb820e0a266ff700009d",
                "order": 70
            },
            {
                "adult": false,
                "backdrop_path": "/hKrrCigPFmhv1bg5IJl9nzjEaN4.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 631,
                "original_language": "en",
                "original_title": "Sunrise: A Song of Two Humans",
                "overview": "A married farmer falls under the spell of a slatternly woman from the city, who tries to convince him to drown his wife.",
                "popularity": 3.5707,
                "poster_path": "/oj8ZW8jKXBSs8F1e5iWsTUeXSJW.jpg",
                "release_date": "1927-11-04",
                "title": "Sunrise: A Song of Two Humans",
                "video": false,
                "vote_average": 7.836,
                "vote_count": 850,
                "character": "Ballroom Dancer / Kissing Couple (uncredited)",
                "credit_id": "564291169251410a4400020a",
                "order": 18
            },
            {
                "adult": false,
                "backdrop_path": "/8Tnn2UOlecCKNLKG8ZK5Mu6bK94.jpg",
                "genre_ids": [
                    80,
                    53
                ],
                "id": 845,
                "original_language": "en",
                "original_title": "Strangers on a Train",
                "overview": "Having met on a train, a smooth-talking psychotic socialite shares his theory on how two complete strangers can get away with murder to an amateur tennis player — a theory he plans to test out.",
                "popularity": 3.3558,
                "poster_path": "/ihC083U7ef56Ui4x0P0dobojrZ1.jpg",
                "release_date": "1951-06-27",
                "title": "Strangers on a Train",
                "video": false,
                "vote_average": 7.671,
                "vote_count": 1775,
                "character": "Tennis Match Spectator (uncredited)",
                "credit_id": "67d89cc272a16d85d5e1ec80",
                "order": 61
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Alfredo Carlos Birabén"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nBarry Norton (born Alfredo Carlos Birabén; June 16, 1905 – August 24, 1956) was an Argentinian-American actor. He appeared in over 90 films, starting in silent films from 1925 until his death in 1956. He is perhaps best known for his role as Juan Harker in Universal Pictures' Spanish-language version of Drácula in 1931, the English language role of Jonathan Harker originated by David Manners.  Arriving in Hollywood in the 1920s, Norton first appeared as an extra in The Black Pirate (1926) but was soon cast in Fox Films' The Lily that same year. His big break came when he was given the role of Pvt. \"Mother's Boy\" Lewisohn in What Price Glory?, which turned out to be a huge commercial success. He landed substantial roles in Legion of the Condemned and 4 Devils (both 1928), which were also very successful. His acting was well received by audiences and critics at the time, and during the silent era he avoided being typecast as a Latin lover. One theater owner in Golden City, Montana said, \"[Norton] has as yet to show me a bad performance. There's a boy that is a 'natural'.\"\n\nIn the early 1930s, Norton could still get leading roles in major films. Major Hollywood studios started producing alternate-language versions of their prestige productions, and he became one of dozens of Latino actors needed. Drácula was one of these films, but Norton also appeared in Spanish-language versions of Paramount on Parade (1930), The Benson Murder Case (1930), and The Criminal Code (1931). In a few cases, he appeared in both versions of a film. Examples include Storm Over the Andes (Spanish version: Alas sobre El Chaco), The Sea Fiend (El diablo del Mar), and Captain Calamity (El capitan Tormenta), the latter film reuniting him with Lupita Tovar, his romantic interest from Dracula.\n\nIn addition to roles in Spanish-territory films, he had roles in numerous major films, usually playing sophisticated Europeans. With the decline in Spanish-language film production in Los Angeles, Norton's opportunities for leading roles became less and less frequent. Though he had a pleasing voice, his Argentine accent seemed incongruous with his appearance. According to some sources, he never mastered English very well. In 1933, he secured what would be his last important role, playing Jean Parker's Spanish fiancé in Frank Capra's Lady for a Day (1933). Although he would continue to work for another 15 years, Norton's last credited screen role would be Should Husbands Work? (1939). For the rest of his career, Norton continued to reside in Los Angeles and obtain small roles in films. Many films he appeared in are now considered to be classics.",
        "birthday": "1905-06-16",
        "deathday": "1956-08-24",
        "gender": 2,
        "homepage": null,
        "id": 148852,
        "imdb_id": "nm0636161",
        "known_for_department": "Acting",
        "name": "Barry Norton",
        "place_of_birth": "Buenos Aires, Argentina",
        "popularity": 0.1293,
        "profile_path": "/nguhCb1NDANgok4uFmv4gjw1X0c.jpg"
    }
}