{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/eMgflonfRY89Zj4LZykJKPpG4wg.jpg",
                "genre_ids": [
                    18
                ],
                "id": 596,
                "original_language": "en",
                "original_title": "The Grapes of Wrath",
                "overview": "Tom Joad returns to his home after a jail sentence to find his family kicked out of their farm due to foreclosure. He catches up with them on his Uncle’s farm, and joins them the next day as they head for California and a new life... Hopefully.",
                "popularity": 5.0306,
                "poster_path": "/eUcxMVBIA0Jg8l1RGUqycrc3eIQ.jpg",
                "release_date": "1940-03-15",
                "title": "The Grapes of Wrath",
                "video": false,
                "vote_average": 7.815,
                "vote_count": 1043,
                "character": "Boy Who Bragged of Eating Chicken (uncredited)",
                "credit_id": "55e4f4ee92514137940004e0",
                "order": 41
            },
            {
                "adult": false,
                "backdrop_path": "/d5HjGve67GkNC9lWpzZVKSotLlT.jpg",
                "genre_ids": [
                    18,
                    9648
                ],
                "id": 1939,
                "original_language": "en",
                "original_title": "Laura",
                "overview": "A police detective falls in love with the woman whose murder he's investigating.",
                "popularity": 2.1817,
                "poster_path": "/j0zEiFFrdbZnMXqD3piOtZBJeNB.jpg",
                "release_date": "1944-11-26",
                "title": "Laura",
                "video": false,
                "vote_average": 7.634,
                "vote_count": 853,
                "character": "Newsboy (uncredited)",
                "credit_id": "56db1053c3a3684cb20028de",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Walton Algernon Albright",
            "Wally Albright Jr.",
            "Walton Algernon Albright Jr."
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nWally Albright (September 3, 1925 – August 7, 1999) was an American former child actor.\n\nAlbright was born Walton Algernon Albright, Jr. in Burbank, California. He appeared in a number of films during his career, and is notable for appearing in six Our Gang short subjects throughout the early 1930s. Though his tenure with the gang was brief, his role was usually that of the gang leader, alongside Matthew \"Stymie\" Beard.\n\nAlbright played so many roles as a baby that he was quite well known by the time he was three. He appeared in small parts of various films made by Hal Roach Studios. At the end of 1933, when Gus Meins took over directing, Our Gang needed a few new characters. Several older Our Gangers left the series in the summer of 1933 including Dorothy DeBorba and Bobby \"Wheezer\" Hutchins. Wally would be one of several characters including Scotty Beckett and Billie \"Buckwheat\" Thomas to debut in 1934 in the Our Gang episode Hi Neighbor. Wally quickly became one of the bigger Our Gang stars. But much to the dismay of Hal Roach and director Gus Meins, Wally voluntarily left the gang and returned to a normal childhood life. However, Albright did play a small role in John Ford's version of John Steinbeck's \"The Grapes of Wrath,\" appearing as an older child in the migrant camp. He watches as Ma Joad cooks a stew for her family and tells her, \"Me and my brother, we et good.\" Another child later tells Ma he was lying. \"I peeked through their window last night and they was eatin' fried dough, just like everybody else.\" He graduated high school and college as he entered adult life.",
        "birthday": "1925-09-03",
        "deathday": "1999-08-07",
        "gender": 2,
        "homepage": null,
        "id": 148861,
        "imdb_id": "nm0017044",
        "known_for_department": "Acting",
        "name": "Wally Albright",
        "place_of_birth": "Burbank, California, USA",
        "popularity": 0.1345,
        "profile_path": "/mMXl7YJ70KlDZeOQRNRUsT5IyFA.jpg"
    }
}