{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zJjI78peUFRIe2NPHthVhow2f60.jpg",
                "genre_ids": [
                    28,
                    12,
                    14,
                    18
                ],
                "id": 256040,
                "original_language": "te",
                "original_title": "బాహుబలి:ద బిగినింగ్",
                "overview": "The young Shivudu is left as a foundling in a small village by his mother. By the time he’s grown up, it has become apparent that he possesses exceptional gifts. He meets the beautiful warrior princess Avanthika and learns that her queen has been held captive for the last 25 years. Shividu sets off to rescue her, discovering his own origins in the process.",
                "popularity": 4.9895,
                "poster_path": "/9BAjt8nSSms62uOVYn1t3C3dVto.jpg",
                "release_date": "2015-07-10",
                "title": "Bāhubali: The Beginning",
                "video": false,
                "vote_average": 7.542,
                "vote_count": 859,
                "character": "Dancer",
                "credit_id": "5c826c65c3a3684e92d83dcf",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Gabriela Bertante is a Brazilian model who appears in Indian films.\n\nGabriela Bertante notes that as a teenager aged 17, she used to help her parents at their store in her hometown in Matias Barbosa, Minas Gerais, Brazil before she moved to Sao Paulo to begin a career in modelling. Bertante also took her football seriously and played in regional soccer leagues, while her brother Glelberson Luís Leopoldino Bertante has played football professionally for several Brazilian teams including Palmeiras. She moved to India in 2010 and took part in the Lakme Fashion Week and was featured in several magazines which caught the attention of MTV who cast her as a VJ in MTV Grind.",
        "birthday": "1989-05-07",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1488787,
        "imdb_id": "nm4992192",
        "known_for_department": "Acting",
        "name": "Gabriela Bertante",
        "place_of_birth": "Matias Barbosa, Minas Gerais, Brazil",
        "popularity": 0.1309,
        "profile_path": "/w82N7Ndf9qdJrm0DaqzkKzjxk4q.jpg"
    }
}