{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1aspiiXDHVizaCYTNaWwRQSmXCh.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 990,
                "original_language": "en",
                "original_title": "The Hustler",
                "overview": "Fast Eddie Felson is a small-time pool hustler with a lot of talent but a self-destructive attitude. His bravado causes him to challenge the legendary Minnesota Fats to a high-stakes match.",
                "popularity": 2.9284,
                "poster_path": "/snItsSViawjaadW9mlWUmGwR41R.jpg",
                "release_date": "1961-09-25",
                "title": "The Hustler",
                "video": false,
                "vote_average": 7.674,
                "vote_count": 1016,
                "character": "Charlie Burns",
                "credit_id": "52fe4297c3a36847f802a9eb",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Walter Myron McCormick"
        ],
        "biography": "​From Wikipedia, the free encyclopedia\n\nMyron McCormick (February 8, 1908 – July 30, 1962) was an American actor of stage, radio and film.\n\nMcCormick was born as Walter Myron McCormick in Albany, Indiana.\n\nHe was the only cast member of the Broadway smash South Pacific to remain with the show for all 1,925 performances. He won a 1950 Tony Award for his portrayal of sailor Luther Billis. He later was featured on Broadway from 1955-1957 in the military comedy No Time for Sergeants and repeated his role as Sergeant King for the 1958 film version starring Andy Griffith.\n\nTo movie audiences, he is possibly best remembered from 1961's The Hustler as Charlie, the partner of pool shark \"Fast Eddie\" Felson (Paul Newman). McCormick was an alumnus of Princeton University, where he was a Phi Beta Kappa.\n\nHe became a featured performer in many popular radio dramas of the 1940s. He also made guest appearances on numerous television programs of the 1950s/early 1960s, including The Untouchables, Naked City, Alfred Hitchcock Presents and Way Out.\n\nDescription above from the Wikipedia article Myron McCormick, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1908-02-08",
        "deathday": "1962-07-30",
        "gender": 2,
        "homepage": null,
        "id": 14883,
        "imdb_id": "nm0566584",
        "known_for_department": "Acting",
        "name": "Myron McCormick",
        "place_of_birth": null,
        "popularity": 0.1086,
        "profile_path": "/fjcrA8lZbchZ4hH8ZDcTXRGiXMW.jpg"
    }
}