{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6qOyw4yfzbzTp5YsCX26C28Do0S.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 872,
                "original_language": "en",
                "original_title": "Singin' in the Rain",
                "overview": "In 1927 Hollywood, a silent film star falls for a chorus girl just as he and his paranoid screen partner struggle to make the difficult transition to talking pictures.",
                "popularity": 4.2669,
                "poster_path": "/w03EiJVHP8Un77boQeE7hg9DVdU.jpg",
                "release_date": "1952-04-10",
                "title": "Singin' in the Rain",
                "video": false,
                "vote_average": 8.146,
                "vote_count": 3306,
                "character": "Chorus Girl (uncredited)",
                "credit_id": "61ac050f678259005ef32407",
                "order": 131
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Shirley Jean ",
            "Shirley Jean Rickert Measures",
            "Shirley Jean Measures",
            "Shirley Jane Rickert ",
            "Shirley Jeane Rickert",
            "Shirley Rickert",
            "Shirley Jean Ricketts",
            "Shirley Ricketts"
        ],
        "biography": "Shirley Jean Rickert (March 25, 1926 – February 6, 2009) was an American child actress who was briefly the \"blonde girl\" for the Our Gang series in 1931, during the Hal Roach talkie period.  At 18 months of age, Rickert won a local baby beauty contest, which emboldened her mother to move the family to Hollywood. She made her screen debut at the age of four in the short How's My Baby (1930), soon followed by her Our Gang debut, Helping Grandma in 1931. Rickert's most notable appearances were in the films Love Business and Bargain Day.\n\nAfter Rickert left the Our Gang series, she had a brief movie career, including starring roles as Tomboy Teri Taylor alongside Mickey Rooney in eight Mickey McGuire comedies, followed by a string of jobs including driving trucks for the U.S. Army Air Corps during World War II. She later worked in burlesque as an exotic dancer, billed as Gilda and Her Crowning Glory (after her long blonde hair), retiring from burlesque in 1959.  Description above from the Wikipedia article Shirley Jean Rickert, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1926-03-25",
        "deathday": "2009-02-06",
        "gender": 1,
        "homepage": null,
        "id": 149018,
        "imdb_id": "nm0419880",
        "known_for_department": "Acting",
        "name": "Shirley Jean Rickert",
        "place_of_birth": " Seattle, Washington, USA",
        "popularity": 2.4918,
        "profile_path": null
    }
}