{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3sF6AibdbTTkswfSRxXEGCt5w6s.jpg",
                "genre_ids": [
                    14,
                    12,
                    28
                ],
                "id": 847,
                "original_language": "en",
                "original_title": "Willow",
                "overview": "The evil Queen Bavmorda hunts the newborn princess Elora Danan, a child prophesied to bring about her downfall. When the royal infant is found by Willow, a timid farmer and aspiring sorcerer, he's entrusted with delivering her from evil.",
                "popularity": 3.5609,
                "poster_path": "/pAIRGMIdN7ZdZhflazdV2ezuJ9f.jpg",
                "release_date": "1988-05-20",
                "title": "Willow",
                "video": false,
                "vote_average": 7.009,
                "vote_count": 2039,
                "character": "Llug",
                "credit_id": "5985e0f8925141438102445f",
                "order": 23
            },
            {
                "adult": false,
                "backdrop_path": "/2w4xG178RpB4MDAIfTkqAuSJzec.jpg",
                "genre_ids": [
                    12,
                    28,
                    878
                ],
                "id": 11,
                "original_language": "en",
                "original_title": "Star Wars",
                "overview": "Princess Leia is captured and held hostage by the evil Imperial forces in their effort to take over the galactic Empire. Venturesome Luke Skywalker and dashing captain Han Solo team together with the loveable robot duo R2-D2 and C-3PO to rescue the beautiful princess and restore peace and justice in the Empire.",
                "popularity": 15.836,
                "poster_path": "/6FfCtAuVAW8XJjZ7eWeLibRLWTw.jpg",
                "release_date": "1977-05-25",
                "title": "Star Wars",
                "video": false,
                "vote_average": 8.206,
                "vote_count": 21485,
                "character": "Jabba's Henchman (uncredited)",
                "credit_id": "5ae0f0ea925141730a006cca",
                "order": 99
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Ronald Lawrence Morisco-Tarr, known as Ron Tarr and 'Big' Ron Tarr, was a British actor and supporting artiste famed for his hirsute physical stature. Born in Willesden in Middlesex, England, Tarr got his first acting role in the 1973 Carry On film  Carry On Girls where he played a bearded audience member. This was followed by appearances in many television series such as Doctor Who, Blake’s 7, Space 1999, Are You Being Served?, The Gentle Touch, The Comic Strip Presents: 5 Go Mad in Dorset and Dramarama. He also notched up a number of film appearances including A View To A Kill, Eat the Rich (he also cameos in Motorhead’s music video soundtrack of the film) and Willow. However, it is his role as Big Ron in the BBC soap opera Eastenders that Tarr is best remembered.  He played the friendly ducking and diving market trader Big Ron from the show’s inception in 1985 to just before his untimely death from cancer at the age of 60 in October 1997. Although he was only a supporting actor and therefore his character had very few central storylines, he was often seen interacting with the main characters in the show who could always rely on his physically intimidating presence whenever trouble was brewing. After his death, he appeared in pre-recorded episodes of the soap. To explain the absence of his character, in early 1998 Big Ron was written out of the series in a storyline concerning him winning the lottery and moving to Spain.",
        "birthday": "1936-11-14",
        "deathday": "1997-10-20",
        "gender": 2,
        "homepage": null,
        "id": 1490615,
        "imdb_id": "nm0850611",
        "known_for_department": "Acting",
        "name": "Ron Tarr",
        "place_of_birth": "Willesden, Middlesex, England, UK",
        "popularity": 0.2403,
        "profile_path": "/iMSzEgb5VCREfDQjtxo9cI0wYt5.jpg"
    }
}