{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ycNyvi9gk4ZI2NLk4KBbseNZbfN.jpg",
                "genre_ids": [
                    99
                ],
                "id": 58496,
                "original_language": "en",
                "original_title": "Senna",
                "overview": "The remarkable story of Brazilian racing driver Ayrton Senna, charting his physical and spiritual achievements on the track and off, his quest for perfection, and the mythical status he has since attained, is the subject of Senna, a documentary feature that spans the racing legend's years as an F1 driver, from his opening season in 1984 to his untimely death a decade later.",
                "popularity": 2.9837,
                "poster_path": "/nZbLCbRoP6iJq5sr8daHQzjnzFh.jpg",
                "release_date": "2010-10-07",
                "title": "Senna",
                "video": false,
                "vote_average": 8.112,
                "vote_count": 1116,
                "character": "Self",
                "credit_id": "52fe4965c3a36847f8197ebb",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Alain Marie Pascal Prost (born 24 February 1955) is a French retired racing driver and Formula One team owner. A four-time Formula One Drivers' Champion, from 1987 until 2001 he held the record for most Grand Prix victories until Michael Schumacher surpassed Prost's total of 51 victories at the 2001 Belgian Grand Prix. In 1999, Prost received the World Sports Award of the Century in the motor sport category.\n\nProst discovered karting at the age of 14 during a family holiday. He progressed through motor sport's junior ranks, winning the French and European Formula Three championships, before joining the McLaren Formula One team in 1980 at the age of 24. He finished in the points on his Formula One début – at the San Martin Autodrome in Buenos Aires, Argentina, where he took his first podium a year later – and took his first race victory a year later at his home Grand Prix in France, driving for the factory Renault team.\n\nDuring the 1980s and early 1990s Prost formed a fierce sporting rivalry, mainly with Ayrton Senna but also Nelson Piquet and Nigel Mansell. In 1986, at Adelaide in the last race of the season, he beat Mansell and Piquet of Williams to the title, after Mansell retired late in the race and Piquet was pulled in for a late precautionary pit stop. Senna joined Prost at McLaren in 1988 and the two had a series of controversial clashes, including a collision at the 1989 Japanese Grand Prix that gave Prost his third Drivers' Championship. A year later at the same venue they collided again, but this time Prost, driving for Ferrari, lost out. Before the end of a winless 1991 season Prost was fired by Ferrari for his public criticism of the team. After a sabbatical in 1992, he joined the Williams team, prompting Mansell, the reigning Drivers' Champion, to leave for CART. With a competitive car, Prost won the 1993 championship and retired from Formula One driving at the end of the year.\n\nIn 1997, Prost took over the French Ligier team, running it as Prost Grand Prix until it went bankrupt in 2002. From 2003 to 2012 he competed in the Andros Trophy, which is an ice racing championship, taking 38 race victories and winning the championship 3 times.\n\nProst employed a smooth, relaxed style behind the wheel, deliberately modelling himself on personal heroes like Jackie Stewart and Jim Clark. He was nicknamed \"The Professor\" for his intellectual approach to competition. Though it was not a name he particularly cared for, he would admit later that it was an appropriate summation of his approach to his racing. Skilled at setting up his car for race conditions, Prost would often conserve his brakes and tyres early in a race, leaving them fresher for a challenge at the end. ...\n\nSource: Article \"Alain Prost\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1955-02-24",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 149193,
        "imdb_id": "nm1169354",
        "known_for_department": "Acting",
        "name": "Alain Prost",
        "place_of_birth": "Lorette, Loire, France",
        "popularity": 0.171,
        "profile_path": "/cV7P1fG1Bhb1Jr8IcqHNkCIVEY8.jpg"
    }
}