{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6Z0FhoZM56YkuXhvklMTpc7rc5u.jpg",
                "genre_ids": [
                    27,
                    9648,
                    53
                ],
                "id": 423108,
                "original_language": "en",
                "original_title": "The Conjuring: The Devil Made Me Do It",
                "overview": "Paranormal investigators Ed and Lorraine Warren encounter what would become one of the most sensational cases from their files. The fight for the soul of a young boy takes them beyond anything they'd ever seen before, to mark the first time in U.S. history that a murder suspect would claim demonic possession as a defense.",
                "popularity": 55.3329,
                "poster_path": "/rQfX2xx8TUoNvyk892yKWNikJaM.jpg",
                "release_date": "2021-05-25",
                "title": "The Conjuring: The Devil Made Me Do It",
                "video": false,
                "vote_average": 7.394,
                "vote_count": 6231,
                "character": "Sergeant Thomas",
                "credit_id": "5dfa82f26097500012334d00",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Mark Rowe was born in Charlotte, North Carolina and grew up in Knoxville, Tennessee. He studied Theatre and Graphic Design at the University of Tennessee and spent a few years after graduation performing in regional theatre, before moving to NYC. He studied at the Ensemble Studio Theatre and performed in and around the city.\n\nHe took a break from the business while exploring the world of Entertainment Marketing and Design, which brought him to Los Angeles. He later returned to acting when he was asked by a producer friend to attend a commercial callback. He booked what turned out to be a Budweiser Super Bowl commercial which brought him back into the business. Soon after, he landed his first recurring Co-Star role opposite Liev Schreiber on Ray Donovan.\n\nIn the Summer of 2019 he returned to NYC. Mark is a proud member of SAG-Aftra and Actor's Equity Association. He splits his time between NY, Atlanta and LA.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1491257,
        "imdb_id": "nm5081441",
        "known_for_department": "Acting",
        "name": "Mark Rowe",
        "place_of_birth": "Charlotte, North Carolina, USA",
        "popularity": 0.3213,
        "profile_path": "/4G3LvCPuTFzLuFdLvly1xSGjhEI.jpg"
    }
}