{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ycNyvi9gk4ZI2NLk4KBbseNZbfN.jpg",
                "genre_ids": [
                    99
                ],
                "id": 58496,
                "original_language": "en",
                "original_title": "Senna",
                "overview": "The remarkable story of Brazilian racing driver Ayrton Senna, charting his physical and spiritual achievements on the track and off, his quest for perfection, and the mythical status he has since attained, is the subject of Senna, a documentary feature that spans the racing legend's years as an F1 driver, from his opening season in 1984 to his untimely death a decade later.",
                "popularity": 2.9837,
                "poster_path": "/nZbLCbRoP6iJq5sr8daHQzjnzFh.jpg",
                "release_date": "2010-10-07",
                "title": "Senna",
                "video": false,
                "vote_average": 8.112,
                "vote_count": 1116,
                "character": "Self",
                "credit_id": "52fe4965c3a36847f8197ecb",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Viviane Senna da Silva Lalli"
        ],
        "biography": "Viviane Senna da Silva Lalli, born on June 14, 1957, in São Paulo, Brazil, is a prominent Brazilian businesswoman and social entrepreneur, best known as the sister of Formula 1 legend Ayrton Senna. Following Ayrton's tragic passing in 1994, Viviane dedicated herself to honoring his legacy by founding and leading the Instituto Ayrton Senna, a non-profit organization aimed at improving education and social opportunities for underprivileged children in Brazil. The institute focuses on research and innovation in educational practices, impacting millions of students and supporting educators across the country.\n\nWith a background in psychology from the Pontifical Catholic University of São Paulo, Viviane has leveraged her knowledge and dedication to address systemic issues in Brazilian education. Under her leadership, the institute has become one of Brazil’s most influential non-profits, actively advocating for quality education as a driver for social transformation. Viviane remains a respected figure in both the philanthropic and educational sectors, working to foster an equitable future for Brazil's youth.",
        "birthday": "1957-06-14",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 149204,
        "imdb_id": "nm4064191",
        "known_for_department": "Acting",
        "name": "Viviane Senna",
        "place_of_birth": "São Paulo, Brazil",
        "popularity": 0.4725,
        "profile_path": "/7NwLAVmCEfXLNIY2Zx3wUz2Mar3.jpg"
    }
}