{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ycNyvi9gk4ZI2NLk4KBbseNZbfN.jpg",
                "genre_ids": [
                    99
                ],
                "id": 58496,
                "original_language": "en",
                "original_title": "Senna",
                "overview": "The remarkable story of Brazilian racing driver Ayrton Senna, charting his physical and spiritual achievements on the track and off, his quest for perfection, and the mythical status he has since attained, is the subject of Senna, a documentary feature that spans the racing legend's years as an F1 driver, from his opening season in 1984 to his untimely death a decade later.",
                "popularity": 2.9837,
                "poster_path": "/nZbLCbRoP6iJq5sr8daHQzjnzFh.jpg",
                "release_date": "2010-10-07",
                "title": "Senna",
                "video": false,
                "vote_average": 8.112,
                "vote_count": 1116,
                "character": "Self",
                "credit_id": "52fe4965c3a36847f8197ecf",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Professor Sid Watkins (September 6, 1928 – September 12, 2012) was a renowned British neurosurgeon and pioneering medical advisor in Formula 1, credited with revolutionizing the sport’s approach to driver safety. Born in Liverpool, England, Watkins trained as a neurosurgeon and became one of the most respected doctors in his field. In 1978, he was appointed as Formula 1’s Chief Medical Officer, where he began implementing critical safety improvements.\n\nWatkins advocated for and introduced numerous life-saving practices, including on-site medical teams, improved medical facilities at tracks, and the deployment of rapid-response vehicles. His friendship with drivers like Ayrton Senna and Niki Lauda was well-known, and he was often the first on the scene to assist injured drivers. Watkins’ efforts helped save lives and led to the creation of the FIA Institute for Motor Sport Safety, where he served as chairman.\n\nWatkins’ legacy is monumental in motorsport safety, transforming Formula 1 into a much safer sport. His contributions are widely respected, and he is remembered as the “Guardian Angel” of Formula 1 drivers, with his work continuing to protect lives even after his passing in 2012.",
        "birthday": "1928-09-06",
        "deathday": "2012-09-12",
        "gender": 2,
        "homepage": null,
        "id": 149211,
        "imdb_id": "nm4065589",
        "known_for_department": "Acting",
        "name": "Sid Watkins",
        "place_of_birth": "Liverpool, United Kingdom",
        "popularity": 0.1362,
        "profile_path": "/zBQ3dgGREDNw6bvkNQsrhcZzFLC.jpg"
    }
}