{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/iRl2k4TMhfESV2W3ygu3OmIVVwh.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 339380,
                "original_language": "en",
                "original_title": "On the Basis of Sex",
                "overview": "Young lawyer Ruth Bader Ginsburg teams with her husband Marty to bring a groundbreaking case before the U.S. Court of Appeals and overturn a century of sex discrimination.",
                "popularity": 2.5822,
                "poster_path": "/izY9Le3QWtu7xkHq7bjJnuE5yGI.jpg",
                "release_date": "2018-12-25",
                "title": "On the Basis of Sex",
                "video": false,
                "vote_average": 7.354,
                "vote_count": 1074,
                "character": "Self",
                "credit_id": "5c3eb897c3a36811b43f44a2",
                "order": 14
            },
            {
                "adult": false,
                "backdrop_path": "/2cBCFvMDLZowXKvMaCGot5dmHUz.jpg",
                "genre_ids": [
                    99,
                    80,
                    36
                ],
                "id": 22074,
                "original_language": "en",
                "original_title": "Capitalism: A Love Story",
                "overview": "Michael Moore comes home to the issue he's been examining throughout his career: the disastrous impact of corporate dominance on the everyday lives of Americans (and by default, the rest of the world).",
                "popularity": 3.5556,
                "poster_path": "/zJBkIPakBXdu3cEgGqKCPHUNXVE.jpg",
                "release_date": "2009-09-06",
                "title": "Capitalism: A Love Story",
                "video": false,
                "vote_average": 7.091,
                "vote_count": 545,
                "character": "Self (archive footage)",
                "credit_id": "5e6112c355c9260015596055",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/cLZxnkj75cGBK1tLTMyIudOZYZk.jpg",
                "genre_ids": [
                    99
                ],
                "id": 1777,
                "original_language": "en",
                "original_title": "Fahrenheit 9/11",
                "overview": "Michael Moore's view on how the Bush administration allegedly used the tragic events on 9/11 to push forward its agenda for unjust wars in Afghanistan and Iraq.",
                "popularity": 3.8937,
                "poster_path": "/1WQgOCJj22zF7Bsr0pIBgGBr71q.jpg",
                "release_date": "2004-06-25",
                "title": "Fahrenheit 9/11",
                "video": false,
                "vote_average": 7.084,
                "vote_count": 1460,
                "character": "Self (archive footage) (uncredited)",
                "credit_id": "5f67578ce18e3f00380ac6a6",
                "order": 31
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Joan Ruth Bader",
            "RBG",
            "The Notorious R.B.G"
        ],
        "biography": "Ruth Bader Ginsburg (born Joan Ruth Bader; March 15, 1933 – September 18, 2020) was an associate justice of the Supreme Court of the United States from 1993 until her death in September 2020. She was nominated by President Bill Clinton, replacing retiring justice Byron White, and at the time was generally viewed as a moderate consensus-builder. She eventually became part of the liberal wing of the Court as the Court shifted to the right over time. Ginsburg was the first Jewish woman and the second woman to serve on the Court, after Sandra Day O'Connor.  Ginsburg was born and grew up in Brooklyn, New York. Her older sister died when she was a baby, and her mother died shortly before Ginsburg graduated from high school. She earned her bachelor's degree at Cornell University and married Martin D. Ginsburg, becoming a mother before starting law school at Harvard, where she was one of the few women in her class. Ginsburg transferred to Columbia Law School, where she graduated joint first in her class. During the early 1960s, she worked with the Columbia Law School Project on International Procedure, learned Swedish, and co-authored a book with Swedish jurist Anders Bruzelius; her work in Sweden profoundly influenced her thinking on gender equality. She then became a professor at Rutgers Law School and Columbia Law School, teaching civil procedure as one of the few women in her field.\n\nGinsburg spent much of her legal career as an advocate for gender equality and women's rights, winning many arguments before the Supreme Court. She advocated as a volunteer attorney for the American Civil Liberties Union and was a member of its board of directors and one of its general counsel in the 1970s. In 1980, President Jimmy Carter appointed her to the U.S. Court of Appeals for the District of Columbia Circuit, where she served until her appointment to the Supreme Court in 1993. Between O'Connor's retirement in 2006 and the appointment of Sonia Sotomayor in 2009, she was the only female justice on the Supreme Court. During that time, Ginsburg became more forceful with her dissents, notably in Ledbetter v. Goodyear Tire & Rubber Co. (2007). Ginsburg's dissenting opinion was credited with inspiring the Lilly Ledbetter Fair Pay Act which was signed into law by President Barack Obama in 2009, making it easier for employees to win pay discrimination claims.\n\nGinsburg received attention in American popular culture for her passionate dissents in numerous cases, widely seen as reflecting paradigmatically liberal views of the law. She was dubbed \"The Notorious R.B.G.\", and she later embraced the moniker. Ginsburg died at her home in Washington, D.C., on September 18, 2020, at the age of 87, from complications of metastatic pancreatic cancer. Given the proximity of her death to the 2020 election and Ginsburg's wish for her replacement not to be chosen \"until a new president is installed\", the decision for President Trump to appoint and all but one of the Republican Senators to confirm Amy Coney Barrett as her replacement proved controversial after the Senate Republican majority's prior refusal to hold a hearing or vote for Merrick Garland in early 2016 under Barack Obama after the death of Antonin Scalia.",
        "birthday": "1933-03-15",
        "deathday": "2020-09-18",
        "gender": 1,
        "homepage": "https://www.supremecourt.gov/about/biographyGinsburg.aspx",
        "id": 1493224,
        "imdb_id": "nm0046029",
        "known_for_department": "Acting",
        "name": "Ruth Bader Ginsburg",
        "place_of_birth": "Brooklyn, New York, USA",
        "popularity": 0.0946,
        "profile_path": "/oYQwgl6zgEYVIPEZSfmDlntJGYv.jpg"
    }
}