{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rAgsOIhqRS6tUthmHoqnqh9PIAE.jpg",
                "genre_ids": [
                    28,
                    35,
                    12
                ],
                "id": 436969,
                "original_language": "en",
                "original_title": "The Suicide Squad",
                "overview": "Supervillains Harley Quinn, Bloodsport, Peacemaker and a collection of nutty cons at Belle Reve prison join the super-secret, super-shady Task Force X as they are dropped off at the remote, enemy-infused island of Corto Maltese.",
                "popularity": 19.5303,
                "poster_path": "/q61qEyssk2ku3okWICKArlAdhBn.jpg",
                "release_date": "2021-06-06",
                "title": "The Suicide Squad",
                "video": false,
                "vote_average": 7.484,
                "vote_count": 9124,
                "character": "Polka-Dot Man's Mom",
                "credit_id": "61c939daecaef5001c3d0da5",
                "order": 37
            },
            {
                "adult": false,
                "backdrop_path": "/gXIuss4Ajlex0E6iJPjkSTR8Qip.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 389015,
                "original_language": "en",
                "original_title": "I, Tonya",
                "overview": "Competitive ice skater Tonya Harding rises amongst the ranks at the U.S. Figure Skating Championships, but her future in the sport is thrown into doubt when her ex-husband intervenes.",
                "popularity": 3.2345,
                "poster_path": "/6gNXwSHxaksR1PjVZRqNapmkgj3.jpg",
                "release_date": "2017-12-07",
                "title": "I, Tonya",
                "video": false,
                "vote_average": 7.478,
                "vote_count": 5981,
                "character": "Shawn's Mother",
                "credit_id": "5a41f7f50e0a264f85033867",
                "order": 17
            },
            {
                "adult": false,
                "backdrop_path": "/jLeOzQLZJEpmAMDnfKMmORFGuV.jpg",
                "genre_ids": [
                    9648,
                    27
                ],
                "id": 591275,
                "original_language": "en",
                "original_title": "Fear Street: 1666",
                "overview": "In 1666, a colonial town is gripped by a hysterical witch-hunt that has deadly consequences for centuries to come, and it's up to teenagers in 1994 to finally put an end to their town's curse, before it's too late.",
                "popularity": 5.678,
                "poster_path": "/rmEPtz3Ufzol2VWUAZYzOFaBio3.jpg",
                "release_date": "2021-07-14",
                "title": "Fear Street: 1666",
                "video": false,
                "vote_average": 7.101,
                "vote_count": 1866,
                "character": "Union Townswoman",
                "credit_id": "61065d877a1bd60028e04e75",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Hailing from Gainesville, Georgia, Lynne is the middle child of three to Nat Ashe, a poultry industry executive, and Bebe Ashe, a part-time legal secretary. Lynne knew by the age of four that she wanted to be both an actor and a writer. Around age 8, she was distressed to learn that the stage name she had picked for herself was already taken. It was Debbie Reynolds. Lynne is primarily of Irish and English descent, with rumors that she is very distantly linked to Thomas Ashe, one of the first settlers in Ireland in the 1500s, who in turn is very distantly related to Queen Elizabeth II. But that's too much genealogy research to prove or disprove, so she's happy just to entertain the idea as a possibility.\n\nLynne received a BA in Theatre Arts from Brenau University and was one of the first graduates of the Gainesville Theatre Alliance, a joint program between UNG and Brenau. She received a graduate assistantship in Wake Forest University's MA Theatre program. It was at Wake Forest that she studied under professor James Dodding (whose former students also include Tom Baker, David Bowie, Tom Hulce, and Gary Oldman) and developed a passion for Shakespeare and British Restoration Theatre. Dodding encouraged her to apply for (and she received) a grant to study for a summer at The Shakespeare Institute in Stratford-upon Avon. While at Wake Forest, Lynne sustained an ankle injury requiring reconstructive surgeries and had to take off half a semester for recovery. (And which also prevents her from being able to wear heels). She was unable to complete the missed coursework before her assistantship funds ran dry. She decided to postpone completion of her degree because she wanted to pay down the medical debt before taking on a student loan. Unfortunately, she was never able to complete her degree. But she considers the opportunity of working with professors Maya Angelou and Dodding, along with the Stratford experience, to be just as valuable as the degree itself. Go Deacs!",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "https://lynneashe.com/",
        "id": 1493882,
        "imdb_id": "nm3496235",
        "known_for_department": "Acting",
        "name": "Lynne Ashe",
        "place_of_birth": "Gainesville, Georgia, USA",
        "popularity": 0.1356,
        "profile_path": "/cUfEMdv3aQz2L17rnnSSmRpyhXC.jpg"
    }
}