{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/eAIHqfS3kXm7kZl4j7ZBfdegyEz.jpg",
                "genre_ids": [
                    53,
                    28,
                    80
                ],
                "id": 38700,
                "original_language": "en",
                "original_title": "Bad Boys for Life",
                "overview": "Marcus and Mike are forced to confront new threats, career changes, and midlife crises as they join the newly created elite team AMMO of the Miami police department to take down the ruthless Armando Armas, the vicious leader of a Miami drug cartel.",
                "popularity": 10.0701,
                "poster_path": "/y95lQLnuNKdPAzw9F9Ab8kJ80c3.jpg",
                "release_date": "2020-01-15",
                "title": "Bad Boys for Life",
                "video": false,
                "vote_average": 7.131,
                "vote_count": 8499,
                "character": "Javier",
                "credit_id": "5eefa957ed2ac200359d7180",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Carlos Guerrero was born and raised in Miami, Florida the second of six children of Daisy and Cuban Actor/Poet Jorge Raul Guerrero. His first appearance on stage and camera were in the arms of his father as a small child. Carlos has played a wide range of diverse dramatic and comedic Leading and Guest Star roles on theatre, television, and films. Some of his credits include the popular hit TV shows: BansheeBanshee, Bloodline, Burn Notice, The Glades and Prison Break. Speaking fluent English and Spanish has allowed him to work on both the American and Hispanic markets. Carlos is a proud member of SAG (Screen Actor's Guild). Carlos has laid it all on the line to produce \"Promises\" a film he wrote and stars in playing a self made millionaire who ends up homeless. Carlos endured an eight month transformation for this role since make-up was unacceptable. Promises earned Carlos three Best Actor awards and also won Best Film, Best Director, Best Family Picture, and other awards at venues across the U.S.. Promises will be released on September 29, 2015 on DVD and Digital media. www.PromisesFilm.com is the official website for Promises.\n\nAlthough his studies have been extensive, his best learning came from the teachings, advice, and experiences of his father and best friend who taught him that \"to be happy in life you must do what you love\". Carlos is now passing this on to his four children and has had the privilege of working on several projects with his son and best friend Carlos Guerrero Jr. (Dolphin Tale, Burn Notice, Promises) and daughter Nina Guerrero (Promises) who have both also inherited a love for acting and have created the third generation of professional \"Guerrero\" actors.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.carlosguerreroactor.com/",
        "id": 1494308,
        "imdb_id": "nm2034254",
        "known_for_department": "Acting",
        "name": "Carlos Guerrero",
        "place_of_birth": null,
        "popularity": 0.7018,
        "profile_path": "/jnoivE0GOWq1j67xO0qTri8SPFe.jpg"
    }
}