{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uTTySGAQ092zr5TP7PqDnHuWR1W.jpg",
                "genre_ids": [
                    53,
                    18,
                    80
                ],
                "id": 994,
                "original_language": "en",
                "original_title": "Straw Dogs",
                "overview": "David Sumner, a mild-mannered academic from the United States, marries Amy, an Englishwoman. In order to escape a hectic stateside lifestyle, David and his wife relocate to the small town in rural Cornwall where Amy was raised. There, David is ostracized by the brutish men of the village, including Amy's old flame, Charlie. Eventually the taunts escalate.",
                "popularity": 2.1904,
                "poster_path": "/yigkfHE1OhkxPPrjrV78Y9ibGEk.jpg",
                "release_date": "1971-11-25",
                "title": "Straw Dogs",
                "video": false,
                "vote_average": 7.161,
                "vote_count": 997,
                "character": "Rev. Barney Hood",
                "credit_id": "52fe4297c3a36847f802ac5b",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Actor and writer Colin Welland will perhaps be forever remembered for his triumph at the 1982 Academy Awards, when he won the Best Screenplay Oscar for his screenplay for the hit film Chariots of Fire, proclaiming \"The British are Coming!\" As an actor, his first film appearance is perhaps still his best-loved, the sympathetic Mr Farthing in Kes (1969), for which he won a BAFTA. Born in Liverpool, but raised in Leigh, Welland initially started out as an art teacher before moving into acting and becoming a household name playing the role of PC Graham in the long running BBC police serial Z Cars. Aside from Chariots of Fire, he wrote many other plays and films including the BAFTA winning Kisses at Fifty (later remade for Hollywood with Gene Hackman as Twice in a Lifetime), Leeds United! based on the rag trade strike that his own mother-in-law was active in, Yanks, A Dry White Season and War of the Buttons. As a film and TV actor his credits include Kes, Straw Dogs, Blue Remembered Hills, Cowboys and Sweeney!  He died at the age of 81 on November 2, 2015, having suffered from Alzheimer's disease for several years.",
        "birthday": "1934-07-04",
        "deathday": "2015-11-02",
        "gender": 2,
        "homepage": null,
        "id": 14957,
        "imdb_id": "nm0919815",
        "known_for_department": "Acting",
        "name": "Colin Welland",
        "place_of_birth": "Liverpool, England",
        "popularity": 0.1672,
        "profile_path": "/fArEscDcAe3prPsqbxGG5y0lI1W.jpg"
    }
}