{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6Z1fVDm7b05I1650DJRqAq8dIaI.jpg",
                "genre_ids": [
                    80,
                    9648,
                    53,
                    18
                ],
                "id": 2118,
                "original_language": "en",
                "original_title": "L.A. Confidential",
                "overview": "Three detectives in the corrupt and brutal L.A. police force of the 1950s use differing methods to uncover a conspiracy behind the shotgun slayings of the patrons at an all-night diner.",
                "popularity": 8.4199,
                "poster_path": "/2PH1pqXMcYBDjodkjiMwMiPi2bH.jpg",
                "release_date": "1997-09-19",
                "title": "L.A. Confidential",
                "video": false,
                "vote_average": 7.802,
                "vote_count": 5225,
                "character": "Court Bailiff (uncredited)",
                "credit_id": "560eb2d5c3a368681000ceaa",
                "order": 86
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Dell Yount is a professional character actor, director, and theatre arts educator with a career spanning over three decades in education and performance. Born in California on March 28, 1960, Yount earned both his Bachelor’s and Master’s degrees in Theatre Arts (Acting) from California State University, San Bernardino and Fullerton. After completing his studies, he began his acting career with a lead role in the national tour of the Tony Award-winning musical \"The Mystery of Edwin Drood.\" Yount is recognized for his various roles in television and film, including appearances in notable series such as \"Star Trek: Enterprise,\" \"The X-Files,\" \"Buffy the Vampire Slayer,\" and \"ER,\" as well as films like \"Phone Booth\" and \"The United States of Leland.\" A dedicated member of SAG-AFTRA since 1990, he is also known for teaching Theatre Arts and sharing his expertise with aspiring actors at colleges and universities. In addition to his professional accomplishments, Yount is the recipient of several awards, including a Kennedy Center National Acting Award, and holds a Drama-Logue Award for directing.",
        "birthday": "1960-03-28",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 149526,
        "imdb_id": "nm0950306",
        "known_for_department": "Acting",
        "name": "Dell Yount",
        "place_of_birth": "California, USA",
        "popularity": 0.1532,
        "profile_path": "/b8IYFkj3dTA8md9WfcEpOYhJcgK.jpg"
    }
}