{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uTTySGAQ092zr5TP7PqDnHuWR1W.jpg",
                "genre_ids": [
                    53,
                    18,
                    80
                ],
                "id": 994,
                "original_language": "en",
                "original_title": "Straw Dogs",
                "overview": "David Sumner, a mild-mannered academic from the United States, marries Amy, an Englishwoman. In order to escape a hectic stateside lifestyle, David and his wife relocate to the small town in rural Cornwall where Amy was raised. There, David is ostracized by the brutish men of the village, including Amy's old flame, Charlie. Eventually the taunts escalate.",
                "popularity": 2.1904,
                "poster_path": "/yigkfHE1OhkxPPrjrV78Y9ibGEk.jpg",
                "release_date": "1971-11-25",
                "title": "Straw Dogs",
                "video": false,
                "vote_average": 7.161,
                "vote_count": 997,
                "character": "John Niles",
                "credit_id": "52fe4297c3a36847f802ac53",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Peter Randolph Michael Albrecht"
        ],
        "biography": "Born in Kuala Lumpur, British Malaya, to a Swiss-French mother and an American father,  Peter Arne was an actor and an antique dealer who was murdered in 1983.  In the late 1940s, Arne and his partner Jack Corke befriended acclaimed novelist Mary Renault and her partner, Julie Mullard, on the SS Cairo, a steamer bound from Britain to South Africa and convinced them to go into business building homes for immigrants to the country. Renault financed using her £25,000 MGM award, employing labourers and craftsmen to begin construction of several houses, but Arne and Corke squandered the money, racking up debts before stealing Renault's car and returning to the UK to avoid charges of embezzlement.  On 1st August 1983, Arne attended a costume fitting for a role in Doctor Who. On his return home, neighbours reported sounds of an argument to the police who subsequently found Arne's body inside his Knightsbridge flat. He had been bludgeoned to death with a stool and log from his fireplace.  The prime suspect in Arne's murder was Giuseppe Perusi, a schoolteacher from Italy who had been living rough in a local park, and for whom Arne had been providing food. Four days later, a body matching Perusi's description was found in the River Thames at Wandsworth, having drowned in an apparent suicide. At the subsequent inquest in October 1983, Police concluded that Perusi had beaten the actor to death then killed himself.",
        "birthday": "1920-09-29",
        "deathday": "1983-08-01",
        "gender": 2,
        "homepage": null,
        "id": 14955,
        "imdb_id": "nm0036170",
        "known_for_department": "Acting",
        "name": "Peter Arne",
        "place_of_birth": "Kuala Lumpur, Malaysia",
        "popularity": 0.2367,
        "profile_path": "/zIpRwfHgXz8OpBwAzhQ7u6VRrnR.jpg"
    }
}