{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2lfDV3DCNumvNyEhgsIGsrB19fs.jpg",
                "genre_ids": [
                    37,
                    12
                ],
                "id": 995,
                "original_language": "en",
                "original_title": "Stagecoach",
                "overview": "A group of people traveling on a stagecoach find their journey complicated by the threat of Geronimo, and learn something about each other in the process.",
                "popularity": 3.4391,
                "poster_path": "/zgMnfnwWZ3nkx4t0bUDEKtW24O8.jpg",
                "release_date": "1939-03-02",
                "title": "Stagecoach",
                "video": false,
                "vote_average": 7.625,
                "vote_count": 1172,
                "character": "Samuel Peacock",
                "credit_id": "52fe4298c3a36847f802ad09",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Thomas Donald Meek"
        ],
        "biography": "Thomas Donald Meek (14 July 1878 – 18 November 1946) was a Scottish-American actor. He first performed publicly at the age of eight and began appearing on Broadway in 1903. Meek is perhaps best known for his roles in the films You Can't Take It with You (1938) and Stagecoach (1939). He posthumously received a star on the Hollywood Walk of Fame in 1960.\n\nMeek was born in Glasgow to Matthew and Annie Meek. In the 1890s, the Meek family emigrated to Canada and then to the United States. By 1900, they were living in Philadelphia where Meek was employed as a dry goods salesman, according to the United States census of that year with Meek later working on stage.\n\nAfter years on the stage, Meek became a film actor, appearing memorably in several movies including The Adventures of Tom Sawyer, Little Miss Broadway, and State Fair. Before becoming an actor, he fought in the Spanish–American War in the United States Army and contracted yellow fever which caused him to lose his hair. He was cast as timid, worried characters in many of his films, and is perhaps best known for his roles as Mr. Poppins in Frank Capra's You Can't Take It With You and as whiskey salesman Samuel Peacock in John Ford's Stagecoach.\n\nFrom 1931 through 1932, Meek was featured as criminologist Dr. Crabtree in a series of 12 Warner Brothers two-reel short subjects written by S.S. Van Dine.  Meek and Isabella \"Belle\" Walken married in Boston in a Methodist church on January 3, 1909. By this marriage, the American-born Belle Meek lost her United States citizenship by taking her husband's British nationality.  Donald Meek died of leukaemia on 18 November 1946 in Los Angeles, while filming the role of Mr. Twiddle in Magic Town. A prolific film actor in over 100 Hollywood movies during its Golden Age, he received a posthumous star on the Hollywood Walk of Fame. He was entombed in the Fairmount Mausoleum at Fairmount Cemetery in Denver, Colorado.",
        "birthday": "1878-07-13",
        "deathday": "1946-11-18",
        "gender": 2,
        "homepage": null,
        "id": 14968,
        "imdb_id": "nm0576083",
        "known_for_department": "Acting",
        "name": "Donald Meek",
        "place_of_birth": "Glasgow, Scotland, UK",
        "popularity": 0.2746,
        "profile_path": "/6TTBTlpHK6QG2i8T596LZbwvmJN.jpg"
    }
}