{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2lfDV3DCNumvNyEhgsIGsrB19fs.jpg",
                "genre_ids": [
                    37,
                    12
                ],
                "id": 995,
                "original_language": "en",
                "original_title": "Stagecoach",
                "overview": "A group of people traveling on a stagecoach find their journey complicated by the threat of Geronimo, and learn something about each other in the process.",
                "popularity": 3.4391,
                "poster_path": "/zgMnfnwWZ3nkx4t0bUDEKtW24O8.jpg",
                "release_date": "1939-03-02",
                "title": "Stagecoach",
                "video": false,
                "vote_average": 7.625,
                "vote_count": 1172,
                "character": "Dallas",
                "credit_id": "52fe4297c3a36847f802aced",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/m2SXRnAd0d5N6qH2cbgluRgMX4z.jpg",
                "genre_ids": [
                    80,
                    53
                ],
                "id": 11016,
                "original_language": "en",
                "original_title": "Key Largo",
                "overview": "A hurricane swells outside, but it's nothing compared to the storm within the hotel at Key Largo. There, sadistic mobster Johnny Rocco holes up - and holds at gunpoint hotel owner James Temple, his widowed daughter-in-law Nora, and ex-GI Frank McCloud.",
                "popularity": 4.2339,
                "poster_path": "/rySfmQQZhS7RswOiJcJrww6FcHy.jpg",
                "release_date": "1948-07-16",
                "title": "Key Largo",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 554,
                "character": "Gaye Dawn",
                "credit_id": "52fe43e39251416c7502206f",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Claire Wemlinger",
            "The Queen of Film Noir"
        ],
        "biography": "Claire Trevor (née Wemlinger; March 8, 1910 – April 8, 2000) was an American actress. She appeared in 65 feature films from 1933 to 1982, winning the Academy Award for Best Supporting Actress for her role in Key Largo (1948), and received nominations for her roles in The High and the Mighty (1954) and Dead End (1937). Trevor received top billing, ahead of John Wayne, for Stagecoach (1939).\n\nTrevor's acting career spanned more than seven decades and included successes in stage, radio, television, and film. She often played the hard-boiled blonde, and every conceivable type of 'bad girl' role.\n\nShe made her stage debut in the summer of 1929 with a repertory company in Ann Arbor, Michigan. She subsequently returned to New York, where she appeared in a number of Brooklyn-filmed Vitaphone short films and performed in summer stock theatre. In 1932, she starred on Broadway as the female lead in Whistling in the Dark.\n\nTrevor made her film debut in Jimmy and Sally (1933). From 1933 to 1938, Trevor starred in 29 films, often having either the lead role or the role of heroine. In 1937, she was the second lead actress (after top-billed Sylvia Sidney) in Dead End, with Humphrey Bogart, which led to her nomination for Best Supporting Actress. From 1937 to 1940, she appeared with Edward G. Robinson in the popular radio series Big Town, while continuing to make movies. In the early 1940s, she also was a regular on The Old Gold Don Ameche Show on the NBC Red Radio Network, starring with Ameche in presentations of plays by Mark Hellinger. In 1939, she was well established as a solid leading lady. One of her more memorable performances during this period includes the Western Stagecoach (1939).\n\nTwo of Trevor's most memorable roles were opposite Dick Powell in Murder, My Sweet (1944) and with Lawrence Tierney in Born to Kill (1947). In Key Largo (1948), Trevor played Gaye Dawn, a washed-up, alcoholic nightclub singer and gangster's moll. For that role, she won the Academy Award for Best Supporting Actress. Her third and final Oscar nomination was for her performance in The High and the Mighty (1954). In 1957, she won an Emmy for her role in the Producers' Showcase episode entitled \"Dodsworth\". Trevor moved into supporting roles in the 1950s, with her appearances becoming very rare after the mid-1960s. She played Charlotte, the mother of Kay (Sally Field) in Kiss Me Goodbye (1982). Her final television role was for the 1987 television film, Norman Rockwell's Breaking Home Ties. Trevor made a guest appearance at the 70th Academy Awards in 1998.\n\nFor her contribution to the motion picture industry, she has a star on the Hollywood Walk of Fame at 6933 Hollywood Boulevard.\n\n[biography (excerpted) from Wikipedia]",
        "birthday": "1910-03-08",
        "deathday": "2000-04-08",
        "gender": 1,
        "homepage": null,
        "id": 14965,
        "imdb_id": "nm0872456",
        "known_for_department": "Acting",
        "name": "Claire Trevor",
        "place_of_birth": "Bensonhurst, Brooklyn, New York City, New York, USA",
        "popularity": 0.4679,
        "profile_path": "/9fBt1rbo63Gu7pO7WVo8RizMgUF.jpg"
    }
}