{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/c2gcLDxniE0lNmT2a7CcQVuW6En.jpg",
                "genre_ids": [
                    12,
                    28,
                    53
                ],
                "id": 36557,
                "original_language": "en",
                "original_title": "Casino Royale",
                "overview": "Le Chiffre, a banker to the world's terrorists, is scheduled to participate in a high-stakes poker game in Montenegro, where he intends to use his winnings to establish his financial grip on the terrorist market. M sends Bond—on his maiden mission as a 00 Agent—to attend this game and prevent Le Chiffre from winning. With the help of Vesper Lynd and Felix Leiter, Bond enters the most important poker game in his already dangerous career.",
                "popularity": 16.5461,
                "poster_path": "/lMrxYKKhd4lqRzwUHAy5gcx9PSO.jpg",
                "release_date": "2006-11-14",
                "title": "Casino Royale",
                "video": false,
                "vote_average": 7.564,
                "vote_count": 11144,
                "character": "Dossier Girl (uncredited)",
                "credit_id": "56a02e9f925141370b003e05",
                "order": 73
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Simona Brhlikova"
        ],
        "biography": "Simona Roman, born Brhlíková, hails from former Czechoslovakia. She was bitten by the entertainment-bug in her early childhood and at the young age starred in several stage and musical productions.\n\nKnown not only for her striking aesthetic appeal - Simona also speaks 7 languages.\n\nLeaving the family nest at 17 Simona embarked on the bold adventure across Northern America and Africa for some 'fun' and life experience. During her audacious journey, Simona lived with Eskimos in Alaska, learned some warrior-techniques from Masai tribe in Kenya and eventually followed her acting dreams to London where she diligently honed her academic and dramatic skills at prestigious London institutions such as UCL and RADA.\n\nSimona's natural talent lead her to star in terrific theatre productions like 'Much Ado About Nothing', 'As You Like It', 'Queen of Spades' amongst others. Naturally standing out from the crowd Simona was soon invited to play in prime-time Television shows and features like 'IT Crowd', 'Life Begins', the ever popular 'Footballers' Wives', the national favorite 'Bad Girls' and 'Casanova's Love Letters' as well as string of independent films and major international features such as Casino Royal, Gallowwalkers in which she excels as the villainous Kiss-Cut, and highly popular British action thriller Vendetta.\n\nWhen not working, chasing outdoor thrills or cooking, Simona keeps herself grounded by meditating in the nature and animal rescue.",
        "birthday": "1984-09-14",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1496358,
        "imdb_id": "nm1971501",
        "known_for_department": "Acting",
        "name": "Simona Roman",
        "place_of_birth": "Michalovce, Slovakia",
        "popularity": 0.0588,
        "profile_path": null
    }
}