{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ruF3Lmd4A8MHbnEBE6lxPMbsHGL.jpg",
                "genre_ids": [
                    9648,
                    18
                ],
                "id": 15,
                "original_language": "en",
                "original_title": "Citizen Kane",
                "overview": "Newspaper magnate Charles Foster Kane is taken from his mother as a boy and made the ward of a rich industrialist. As a result, every well-meaning, tyrannical or self-destructive move he makes for the rest of his life appears in some way to be a reaction to that deeply wounding event.",
                "popularity": 6.1449,
                "poster_path": "/sav0jxhqiH0bPr2vZFU0Kjt2nZL.jpg",
                "release_date": "1941-04-17",
                "title": "Citizen Kane",
                "video": false,
                "vote_average": 8.0,
                "vote_count": 5751,
                "character": "Signor Matiste",
                "credit_id": "52fe420ec3a36847f8000915",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/byQdu1nzQLI9t1VeoP1xuQfru3L.jpg",
                "genre_ids": [
                    80,
                    53
                ],
                "id": 996,
                "original_language": "en",
                "original_title": "Double Indemnity",
                "overview": "A seductive housewife draws an insurance salesman into a plot of adultery and crime to collect on her husband's life insurance.",
                "popularity": 3.5639,
                "poster_path": "/rVNYZZgfhwqVMMWlBmxOfWqnwCj.jpg",
                "release_date": "1944-07-06",
                "title": "Double Indemnity",
                "video": false,
                "vote_average": 8.106,
                "vote_count": 1902,
                "character": "Sam Garlopis",
                "credit_id": "52fe4298c3a36847f802addd",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Josep Lluís Moll"
        ],
        "biography": "Fortunio Bonanova, pseudonym of Josep Lluís Moll, (13 January 1895 – 2 April 1969) was a Spanish baritone singer and a film, theater, and television actor. He occasionally worked as a producer and director.\n\nAccording to Lluis Fàbregas Cuixart, the pseudonym Fortunio Bonanova referred to his desire to seek fortune, and his love of the Bonanova neighborhood in his native Palma.\n\nAs a young man, living under his birthname, he was a professional telegraph operator. He studied music with the Italian Giovachini. In 1921, he debuted as a singer in Tannhäuser, at the Teatre Principal in Palma. That year, along with a group of Majorcan intellectuals and Jorge Luis Borges (who was briefly living in Majorca with his parents and sister), he signed the Ultraist Manifesto, using the name Fortunio Bonanova.\n\nAlso in 1921, he appeared in a silent film of Don Juan Tenorio by the brothers Baños, which was shown the following year in New York City and Hollywood. He later directed his own Don Juan in 1924.\n\nIn 1927, he acted in Love of Sunya, directed by Albert Parker and starring Gloria Swanson. In 1932 he had small parts in Hollywood productions featuring Joan Bennett and Mary Astor. In the same period, he appeared in New York in several operas as well as the zarzuelas La Canción del Olvido (\"The song of forgetting\"), La Duquesa del Tabarín (\"The Duchess of Tabarín\"), Los Gavilanes, and La Montería. In 1934, he returned to Spain, where he had a major role in the film El Desaparecido (\"The disappeared one\") written and directed by Antonio Graciani. In 1935 he acted and sang in the film Poderoso Caballero (\"A Big Guy\"), directed by Màximo Nossik.\n\nIn 1936, with the outbreak of the Spanish Civil War, he returned to the United States, where he played the role of Captain Bill in a film called Capitán Tormenta, directed by Jules Bernhardt. A sequence of increasingly larger acting and singing roles mostly in English-language films followed, especially after 1940. Among his roles were Signor Matiste, Susan Alexander Kane's opera coach in Citizen Kane (1941); General Sebastiano in Five Graves to Cairo (1943); Don Miguel in The Black Swan (1942); Fernando in For Whom the Bell Tolls (1943); Sam Garlopis in Double Indemnity (1944); and a singing Christopher Columbus in Where Do We Go From Here?. He continued for the next several decades in a miscellany of character roles.",
        "birthday": "1895-01-13",
        "deathday": "1969-04-02",
        "gender": 2,
        "homepage": null,
        "id": 14979,
        "imdb_id": "nm0093769",
        "known_for_department": "Acting",
        "name": "Fortunio Bonanova",
        "place_of_birth": "Palma de Mallorca, Mallorca, Balearic Islands, Spain",
        "popularity": 0.1761,
        "profile_path": "/39RJP5GMzaw1Bh6hBaYK6qsEDW1.jpg"
    }
}