{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/acvE3RWjDLgvbL2RtcyzkrsAyNV.jpg",
                "genre_ids": [
                    80,
                    36,
                    18
                ],
                "id": 466420,
                "original_language": "en",
                "original_title": "Killers of the Flower Moon",
                "overview": "When oil is discovered in 1920s Oklahoma under Osage Nation land, the Osage people are murdered one by one—until the FBI steps in to unravel the mystery.",
                "popularity": 10.9118,
                "poster_path": "/dB6Krk806zeqd0YNp2ngQ9zXteH.jpg",
                "release_date": "2023-10-18",
                "title": "Killers of the Flower Moon",
                "video": false,
                "vote_average": 7.415,
                "vote_count": 3760,
                "character": "Vera (Mollie's Housekeeper)",
                "credit_id": "64a5b0458c44b9014e3bb94e",
                "order": 73
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Actress and rising-star Norma Jean marks her feature film debut in the highly anticipated Martin Scorsese film, Killers of the Flower Moon, debuting in 2023. Norma Jean portrays \"Vera,\" acting alongside Leonardo DiCaprio and Lily Gladstone.\n\nBorn in Camden, New Jersey, and raised in Watertown, New York, her mother named her after Marilyn Monroe. After high school, Norma Jean set off on her own, working three jobs and falling in love with community theater. Over the course of her career, she has performed in many hit stage productions. She is revered for her ability to artfully master over ten dialects. Norma Jean is often compared to other rubber-faced comediennes such as Imogene Coca, Carol Burnett, Vicki Lawrence, and Lily Tomlin.\n\nNorma Jean currently voices the role of \"Shandra Keating\" in Celeritas, a sci-fi podcast that ranks in the top ten of all SciFi podcasts in 15 countries. A gifted comedienne, she performs on TikTok as Smokin' Bev, an opinionated and sometimes offensive character based on her mother.\n\nNorma Jean holds an Interdisciplinary Bachelor of Science degree in International Business and Public Speaking from SUNY Empire State College in Saratoga Springs, NY. She currently resides in Austin, Texas.",
        "birthday": "1967-02-13",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.theblancoagency.com/norma-jean",
        "id": 1497946,
        "imdb_id": "nm2692138",
        "known_for_department": "Acting",
        "name": "Norma Jean",
        "place_of_birth": "Camden, New Jersey, USA",
        "popularity": 0.0968,
        "profile_path": "/ve6WDuND40K1ozfWNQONr6bYRjl.jpg"
    }
}