{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1PRWW60yQparK1I8Soyy9Evf7Dv.jpg",
                "genre_ids": [
                    16,
                    35,
                    18,
                    10751
                ],
                "id": 869626,
                "original_language": "en",
                "original_title": "Marcel the Shell with Shoes On",
                "overview": "Marcel is an adorable one-inch-tall shell who ekes out a colorful existence with his grandmother Connie and their pet lint, Alan. Once part of a sprawling community of shells, they now live alone as the sole survivors of a mysterious tragedy. When a documentarian discovers them amongst the clutter of his Airbnb, his resulting short film brings Marcel millions of passionate fans, as well as unprecedented dangers and a new hope at finding his long-lost family.",
                "popularity": 2.3466,
                "poster_path": "/jaYmP4Ct8YLnxWAW2oYkUjeXtzm.jpg",
                "release_date": "2022-06-24",
                "title": "Marcel the Shell with Shoes On",
                "video": false,
                "vote_average": 7.667,
                "vote_count": 639,
                "character": "The Maestro (voice)",
                "credit_id": "6256274751e6ab009973781c",
                "order": 16
            },
            {
                "adult": false,
                "backdrop_path": "/aH5QhlVu7uMnLO9P432IcP8FyCI.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 1850,
                "original_language": "en",
                "original_title": "Man on the Moon",
                "overview": "The story of the life and career of eccentric avant-garde comedian, Andy Kaufman.",
                "popularity": 3.8544,
                "poster_path": "/msOZS07xRIFnapwp3fprGbKEAfT.jpg",
                "release_date": "1999-12-22",
                "title": "Man on the Moon",
                "video": false,
                "vote_average": 7.247,
                "vote_count": 1869,
                "character": "Ed Weinberger",
                "credit_id": "639031f9bc8abc139a9ff01e",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/5ORjzDMq26GI82COSnJngXm5Kww.jpg",
                "genre_ids": [
                    99,
                    18,
                    35
                ],
                "id": 469019,
                "original_language": "en",
                "original_title": "Jim & Andy: The Great Beyond",
                "overview": "Offbeat documentarian Chris Smith provides a behind-the-scenes look at how Jim Carrey adopted the persona of idiosyncratic comedian Andy Kaufman on the set of Man on the Moon.",
                "popularity": 1.1685,
                "poster_path": "/kKzopOFXz9YfsCTqg3XpF0GoypX.jpg",
                "release_date": "2017-09-05",
                "title": "Jim & Andy: The Great Beyond",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 702,
                "character": "Self",
                "credit_id": "5a0fa69892514138f6020348",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nPeter Bonerz (born August 6, 1938 in Portsmouth, New Hampshire) is an American actor and director who is best known as the character Dr. Jerry Robinson on The Bob Newhart Show.\n\nBonerz grew up in Milwaukee, Wisconsin, where he attended Marquette University High School, gaining his first theatrical experience with the Prep Players under rigid conditions. At Marquette University he participated in the Marquette University Players under the Rev. John J. Walsh, S.J. After graduating with a bachelor of science degree in 1960, he decided to seek a career in theater, beginning with The Premise, an improv group in New York. After compulsory service as a draftee in the US Army he joined The Committee, an improv troupe in San Francisco.\n\nHis first network television appearance was in 1965 on The Addams Family in the Season Two episode \"Morticia, The Writer\". He had several more TV appearances in the late 1960s and also had a number of roles in several films, including Medium Cool (1969) and Catch-22 (1970). In 1972, he landed the popular supporting role of Dr. Jerry Robinson, the eccentric orthodontist on The Bob Newhart Show, whose most frequent comic foil was Marcia Wallace as Carol, the sharp-tongued secretary. He also directed 29 episodes. The show ran for six seasons, with ratings among the top 20 in the first three seasons.\n\nIn one of his later acting roles he played a psychiatrist in Serial (1980). In 1986, Bonerz co-starred alongside Tuesday Weld and River Phoenix in the CBS television movie Circle of Violence, and would go on to direct a large number of sitcom episodes for series such as Friends, Murphy Brown, NewsRadio, Home Improvement, It's Your Move, and ALF. He also directed a few films, such as Police Academy 6: City Under Siege.",
        "birthday": "1938-08-06",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 14987,
        "imdb_id": "nm0094288",
        "known_for_department": "Directing",
        "name": "Peter Bonerz",
        "place_of_birth": "Portsmouth - New Hampshire - USA",
        "popularity": 0.2325,
        "profile_path": "/8qWxMGvASfbwbW9AbV2Fb4pP3t7.jpg"
    }
}