{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wcJmFsz8RqIhozMwvU81hreTX4i.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 12163,
                "original_language": "en",
                "original_title": "The Wrestler",
                "overview": "Aging wrestler Randy \"The Ram\" Robinson is long past his prime but still ready and rarin' to go on the pro-wrestling circuit. After a particularly brutal beating, however, Randy hangs up his tights, pursues a serious relationship with a long-in-the-tooth stripper, and tries to reconnect with his estranged daughter. But he can't resist the lure of the ring and readies himself for a comeback.",
                "popularity": 3.5185,
                "poster_path": "/6OTR8dSoNGjWohJNo3UhIGd3Tj.jpg",
                "release_date": "2008-09-07",
                "title": "The Wrestler",
                "video": false,
                "vote_average": 7.532,
                "vote_count": 3809,
                "character": "Wrestler",
                "credit_id": "57c4c9efc3a3684746001593",
                "order": 62
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "DJ Hyde",
            "Mano Metalico",
            "Deej"
        ],
        "biography": "David John Markland is an American professional wrestler, better known by his ring name DJ Hyde. He is the owner of Combat Zone Wrestling since 2009, where he is a three-time CZW Iron Man Champion and winner of CZW Tournament of Death VIII. He also competes for several independent promotions including Big Japan Pro Wrestling and the East Coast Wrestling Association as the Commissioner of ECWA. Hyde had wrestled in such companies such as Chikara, westside Xtreme wrestling, Jersey All Pro Wrestling, Fight Club Pro, Heartland Wrestling Association, IWA Mid South, Maryland Championship Wrestling and Dragon Gate USA.",
        "birthday": "1978-03-01",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.djhyde.com/",
        "id": 1498649,
        "imdb_id": "nm3150343",
        "known_for_department": "Acting",
        "name": "David John Markland",
        "place_of_birth": "Newark, Delaware, USA",
        "popularity": 0.0363,
        "profile_path": "/lCptVEgvT7M2NzNkKwZpYYpEWab.jpg"
    }
}