{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8HKwxHZ23sW8wz4yb28IWnAM1M6.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 458423,
                "original_language": "en",
                "original_title": "Mamma Mia! Here We Go Again",
                "overview": "Five years after meeting her three fathers, Sophie Sheridan prepares to open her mother’s hotel. In 1979, young Donna Sheridan meets the men who each could be Sophie’s biological father.",
                "popularity": 5.2208,
                "poster_path": "/aWicerX4Y7n7tUwRAVHsVcBBpj2.jpg",
                "release_date": "2018-07-18",
                "title": "Mamma Mia! Here We Go Again",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 3473,
                "character": "Ensemble Performer",
                "credit_id": "5fa34574519bbb003c4cc0a0",
                "order": 220
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Amanda is a playwright, actress and jazz and blues singer-songwriter from London. In 2017 she was on the Royal Court and BBC London Writers’ Groups. After touring HAMLET to 188 countries with Shakespeare's Globe, she wrote her first play AND I DREAMT I WAS DROWNING, which was developed as part of the Talawa Firsts Festival 2018. She has since written and performed short pieces at the Sam Wanamaker Playhouse, THE LITTLE SOB as part of Dark Night of the Soul in early 2019, and BESSIE COLEMAN about the first African American female pilot as part of Notes to the Forgotten She-Wolves in early 2020. She is under commission to Audible as part of their Emerging Playwrights Programme 2020 and is writing an audio play called RECOGNITION about the C19th’s famous mixed race composer Samuel Coleridge-Taylor for 45North Ltd/Ellie Keel Productions, as well as a monologue called THE ECHO which she will perform about the history of protest songs. She is the winner of Soho Theatre's Verity Bargate Award 2020 for her play SHEDDING A SKIN.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1499274,
        "imdb_id": "nm2680075",
        "known_for_department": "Acting",
        "name": "Amanda Wilkin",
        "place_of_birth": null,
        "popularity": 0.0404,
        "profile_path": "/2a2pF3dXB2Q2jKF8mfdjxxZ0LF1.jpg"
    }
}