{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3mpgltEMgPf8zFtPnAWdDVN8ZT1.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 1056360,
                "original_language": "en",
                "original_title": "American Fiction",
                "overview": "A novelist fed up with the establishment profiting from \"Black\" entertainment uses a pen name to write a book that propels him into the heart of hypocrisy and the madness he claims to disdain.",
                "popularity": 3.759,
                "poster_path": "/57MFWGHarg9jid7yfDTka4RmcMU.jpg",
                "release_date": "2023-11-10",
                "title": "American Fiction",
                "video": false,
                "vote_average": 7.305,
                "vote_count": 1174,
                "character": "Brittany",
                "credit_id": "6507d4498ee49c013809bd9e",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Skyler Wright is an actress first known for her role as Tye Sheridan's girlfriend in The Forger (2014). Born in Atlanta, GA, Skyler moved as a young child to Nantucket, MA where she grew up on the stages of the island's strong community theatre scene. In 2010, she was cast to share the stage with John Shea in the controversial play, Blackbird. Skyler's mother, a wine merchant, and step-father, a stockbroker, knew moving to the Boston area would allow Skyler to attend Duxbury High School and pursue her acting career. She immediately signed with a Boston Talent Agency and began working in commercials and print.  Skyler was a member of the Duxbury Chamber Choir, where she performed as a soloist at Carnegie Hall in New York, NY and Strathmore Hall in Washington, DC. She earned recognition from the International Thespian Society for having completed over 1,000 hours of theatre and received numerous acting awards from the M.E.T.G. (Massachusetts Educational Theatre Guild). A triple-threat performer, Skyler honed her acting, singing and dancing expertise spending school vacations training at New York University, Berklee College of Music, Broadway Artists Alliance, UCB and in other prestigious programs. Although she has known from an early age that she loves the stage, it was being cast as a principal in her first film that solidified her passion for a professional career.",
        "birthday": "1997-08-24",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.skylerwright.com",
        "id": 1499805,
        "imdb_id": "nm4169254",
        "known_for_department": "Acting",
        "name": "Skyler Wright",
        "place_of_birth": "Atlanta, Georgia, USA",
        "popularity": 0.5062,
        "profile_path": "/lgBS5LLjSqIuXVpv8sy9LxgeMbE.jpg"
    }
}