{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/y1giivdsGLyo1LCvlsL6mLKyTZ7.jpg",
                "genre_ids": [
                    53,
                    18,
                    9648
                ],
                "id": 1018,
                "original_language": "en",
                "original_title": "Mulholland Drive",
                "overview": "Blonde Betty Elms has only just arrived in Hollywood to become a movie star when she meets an enigmatic brunette with amnesia. Meanwhile, as the two set off to solve the second woman's identity, filmmaker Adam Kesher runs into ominous trouble while casting his latest project.",
                "popularity": 9.3955,
                "poster_path": "/x7A59t6ySylr1L7aubOQEA480vM.jpg",
                "release_date": "2001-06-06",
                "title": "Mulholland Drive",
                "video": false,
                "vote_average": 7.808,
                "vote_count": 6652,
                "character": "Coco",
                "credit_id": "52fe42e5c3a36847f802aec3",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Johnnie Lucille Collier",
            "Lucille Collier",
            "Lucy Ann Collier"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nJohnnie Lucille Collier (April 12, 1923 – January 22, 2004), known professionally as Ann Miller, was an American dancer, singer and actress. She is best remembered for her work in the Classical Hollywood musical films of the 1940s and 1950s.\n\nAt age 13 in 1936, Miller became a showgirl at the Bal Tabarin. She was hired as a dancer in the \"Black Cat Club\" in San Francisco (she reportedly told them she was 18). It was there that she was discovered by Lucille Ball and talent scout/comic Benny Rubin (although some sources say this occurred at Bal Tabarin). This led Miller to be given a contract with RKO in 1936 at the age of 13 (she had also told them she was 18, and apparently provided a fake birth certificate, procured by her father - with the name \"Lucy Ann Collier\") and she remained there until 1940.\n\nIn 1941, she signed with Columbia Pictures, where, starting with Time Out for Rhythm, she starred in 11 B movie musicals from 1941 to 1945. In July 1945, with World War II still raging in the Pacific, she posed in a bathing suit as a Yank magazine pin-up girl. She ended her contract in 1946 with one \"A\" film, The Thrill of Brazil. The ad in Life magazine featured Miller's leg in a large, red, bow-tied stocking as the \"T\" in \"Thrill\". She finally hit her mark in Metro-Goldwyn-Mayer musicals such as Easter Parade (1948), On the Town (1949) and Kiss Me Kate (1953).\n\nMiller was famed for her speed in tap dance. Studio publicists concocted press releases claiming she could tap 500 times per minute, but in truth, the sound of ultra-fast \"500\" taps was looped in later. Because the stage floors were waxed and too slick for regular tap shoes, she had to dance in shoes with rubber treads on the sole. Later she would loop the sound of the taps while watching the film and actually dancing on a \"tap board\" to match her steps in the film.\n\nHer film career effectively ended in 1956 as the studio system lost steam to television, but she remained active in the theater and on television. She starred on Broadway in the musical Mame in 1969, in which she wowed the audience in a tap number created just for her. In 1979 she astounded audiences in the Broadway show Sugar Babies with fellow MGM veteran Mickey Rooney, which toured the United States extensively after its Broadway run. In 1983, she won the Sarah Siddons Award for her work in Chicago theatre. She appeared in a special 1982 episode of The Love Boat, joined by fellow showbiz legends Ethel Merman, Carol Channing, Della Reese, Van Johnson and Cab Calloway in a storyline that cast them as older relatives of the show's regular characters. Her last stage performance was a 1998 production of Stephen Sondheim's Follies, in which she played hardboiled Carlotta Campion and received rave reviews for her rendition of the song \"I'm Still Here\".\n\nFor her contribution to the motion picture industry, Miller has a star on the Hollywood Walk of Fame at 6914 Hollywood Blvd. In 1998, a Golden Palm Star on the Palm Springs, California, Walk of Stars was dedicated to her. To honor Miller's contribution to dance, the Smithsonian Institution displays her favorite pair of tap shoes, which she playfully nicknamed \"Moe and Joe\".",
        "birthday": "1923-04-12",
        "deathday": "2004-01-22",
        "gender": 1,
        "homepage": null,
        "id": 15008,
        "imdb_id": "nm0587900",
        "known_for_department": "Acting",
        "name": "Ann Miller",
        "place_of_birth": "Houston, Texas, USA",
        "popularity": 0.4321,
        "profile_path": "/wIXkTkf7bElq7u7kSlEVfoDnzYZ.jpg"
    }
}