{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/y1giivdsGLyo1LCvlsL6mLKyTZ7.jpg",
                "genre_ids": [
                    53,
                    18,
                    9648
                ],
                "id": 1018,
                "original_language": "en",
                "original_title": "Mulholland Drive",
                "overview": "Blonde Betty Elms has only just arrived in Hollywood to become a movie star when she meets an enigmatic brunette with amnesia. Meanwhile, as the two set off to solve the second woman's identity, filmmaker Adam Kesher runs into ominous trouble while casting his latest project.",
                "popularity": 10.5819,
                "poster_path": "/x7A59t6ySylr1L7aubOQEA480vM.jpg",
                "release_date": "2001-06-06",
                "title": "Mulholland Drive",
                "video": false,
                "vote_average": 7.808,
                "vote_count": 6652,
                "character": "Jimmy Katz",
                "credit_id": "52fe42e5c3a36847f802aedf",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Raymon Lee Cramton ",
            "Chas Everett",
            "Chad York"
        ],
        "biography": "Chad Everett (June 11, 1937 – July 24, 2012) was an American actor who appeared in more than 40 films and television series. He was well known for his role as Dr. Joe Gannon in the television drama Medical Center which aired 1969 to 1976.  Everett's first notable role came in an episode of the ABC/Warner Brothers 1960-1962 detective series Surfside 6. His first major role came a year later in the film Claudelle Inglish, and subsequently played a deputy in the short-lived 1963 ABC western television series The Dakotas, which featured Jack Elam as a fellow lawman. After appearing in a number of movies and television series in the later 1960s, he got his big break, landing the role of Dr. Joe Gannon on the innovative medical drama, Medical Center, with costar James Daly.\n\nHe appeared in numerous films and television series, including The Singing Nun, Centennial, Hagen, Airplane II: The Sequel, Star Command, and Mulholland Drive. He also appeared as a guest star in more than 40 television series such as Redigo, Melrose Place, The Nanny, Touched by an Angel, Diagnosis: Murder, Caroline in the City, Murder, She Wrote, The Red Skelton Show, The Man from U.N.C.L.E., and Route 66.",
        "birthday": "1937-06-11",
        "deathday": "2012-07-24",
        "gender": 2,
        "homepage": null,
        "id": 15013,
        "imdb_id": "nm0263496",
        "known_for_department": "Acting",
        "name": "Chad Everett",
        "place_of_birth": "South Bend, Indiana, USA",
        "popularity": 0.5013,
        "profile_path": "/5tG4tUdbLIgpRaGvtHxQGiriIDa.jpg"
    }
}