{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kfofK4GzJsJZhCShqZY438c8Y4Y.jpg",
                "genre_ids": [
                    35,
                    12,
                    10751
                ],
                "id": 116149,
                "original_language": "en",
                "original_title": "Paddington",
                "overview": "A young Peruvian bear travels to London in search of a home. Finding himself lost and alone at Paddington Station, he meets the kindly Brown family, who offer him a temporary haven.",
                "popularity": 7.2892,
                "poster_path": "/wpchRGhRhvhtU083PfX2yixXtiw.jpg",
                "release_date": "2014-11-24",
                "title": "Paddington",
                "video": false,
                "vote_average": 7.114,
                "vote_count": 3990,
                "character": "Marjorie Clyde",
                "credit_id": "55e419c5c3a368418b003337",
                "order": 26
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Cleopatra Mary Palmer (née Sylvestre; 19 April 1945 – 20 September 2024), known professionally as Cleo Sylvestre, was a British actress. She was the first black woman ever to play a leading role at the National Theatre in London, and the first woman to record with The Rolling Stones.\n\nSylvestre was brought up in Euston, north London, by her mother, Laureen Sylvestre (née Goodare), a cabaret artist at the Shim Sham Club in Wardour Street, who was born in Yorkshire in 1911. Laureen was of mixed English and African' heritage, and married Owen Oscar Sylvestre, from Trinidad, in 1944. Owen was a Flight Sergeant in the Air Force and had been awarded the Distinguished Flying Medal; he and Laureen divorced in 1955.  Sylvestre always understood Owen to be her father; her daughter Zoë discovered many years later - whilst working in Sierra Leone - that her biological father was Ben Lewis, a lawyer from Sierra Leone whom the family called Uncle Ben, and that she had 15 half-siblings. Aged eight, she made her film debut in Johnny on the Run.\n\nSylvestre was educated at Camden School for Girls and also attended the Italia Conti Academy of Theatre Arts. In 1964 she released a single, \"To Know Him Is to Love Him\", under the name \"Cleo\", produced by Andrew Loog Oldham and backed by The Rolling Stones. After Brian Jones left the Rolling Stones in 1969, she agreed to rehearse with his new band but abandoned music to concentrate on her theatre and television work.\n\nHer West End debut was at Wyndham's Theatre in Wise Child (1967) by Simon Gray, in which she starred alongside Sir Alec Guinness and was nominated most promising new actress. She was the first black actress in a leading role at the National Theatre in The National Health (1969) by Peter Nichols. She did several seasons with the Young Vic Company, including Molière's Les Fourberies de Scapin on Broadway and a tour of Mexico. She subsequently worked in many regional theatres, including the Theatre Royal, Lincoln, the Theatre Royal, Brighton, the Theatre Royal, York, the Derby Playhouse and the Belgrade Theatre, Coventry. She played Phaedre at the Edinburgh Fringe in 2007 and Rosa Parks, Josephine Baker and Wangari Maathai in Alison Mead's A Century of Women at Leicester Square Theatre (2011). She appeared with Antony Sher in his play ID (2003) at the Almeida Theatre, toured with English Touring Theatre in Far from the Madding Crowd (2008) and with Northern Broadsides in its 2010 production of Medea. She also appeared with Michael Sheen in Under Milk Wood (2021) at the Royal National Theatre. Children's theatre work includes seasons at the Unicorn Theatre and the London Bubble Theatre Company.\n\nHer television appearances include: Ken Loach's Up the Junction (1965), Doctor Who (1965), Cathy Come Home (1966) and Poor Cow (1967), as well as appearances in the original Till Death Us Do Part, Z-Cars, Callan, Doctors, New Tricks, The Armando Iannucci Shows, Chambers, The Bill, Who Do You Do and A Bird in the Hand, a Tube Tales episode directed by Jude Law. After a brief appearance as a factory worker in soap opera Coronation Street in 1966, she became the first ever regular black British female character on British TV, in the original series of Crossroads, playing Meg Richardson's adopted daughter Melanie from 1970 to 1972.",
        "birthday": "1945-04-19",
        "deathday": "2024-09-20",
        "gender": 1,
        "homepage": "https://www.bbc.com/news/articles/cn8jg8dgy12o",
        "id": 1502435,
        "imdb_id": "nm0843266",
        "known_for_department": "Acting",
        "name": "Cleo Sylvestre",
        "place_of_birth": "Hitchin, Herts, England, UK",
        "popularity": 0.3777,
        "profile_path": "/iYn0Vz1rdlUthTy35oC2JY5Pxz.jpg"
    }
}