{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ke3lanTAgCqPMpOyutIfXzYih2s.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 266856,
                "original_language": "en",
                "original_title": "The Theory of Everything",
                "overview": "The Theory of Everything is the extraordinary story of one of the world’s greatest living minds, the renowned astrophysicist Stephen Hawking, who falls deeply in love with fellow Cambridge student Jane Wilde.",
                "popularity": 6.154,
                "poster_path": "/kJuL37NTE51zVP3eG5aGMyKAIlh.jpg",
                "release_date": "2014-11-07",
                "title": "The Theory of Everything",
                "video": false,
                "vote_average": 7.839,
                "vote_count": 10824,
                "character": "Lucy Hawking (Age 6)",
                "credit_id": "55e6df9dc3a3685f9100298e",
                "order": 34
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Raffiella Chapman is a British actress who plays the titular role of Vesper in critically acclaimed feature film Vesper (2022). Her first movie role was Lucy Hawking in The Theory of Everything (2014) followed by Claire in Tim Burton's Miss Peregrine's Home for Peculiar Children (2016) but it as Vesper that Chapman has attracted attention and won critical acclaim.\n\n\"A star-making turn from Raffiella Chapman... There is a ferocity to Chapman's piercing eyes... she channels the anger and vulnerability of Gen Z\" The Playlist\n\n\"impressive up-and-comer, Chapman's stoic but winningly vulnerable performance keeps proceedings humane and honestly felt: Where so many YA heroines amount to dauntless adults in children's bodies, she plays the title character as a changeable, characterful child thrust into unreasonable adult responsibilities.\" Variety\n\n\"Chapman is believably commanding in the lead, with a toughness that belies her tender years. But she still embodies the uncertainty of a teenager, and there's a touching vulnerability to her performance.\" Cineuropa",
        "birthday": "2007-10-11",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1503909,
        "imdb_id": "nm5380206",
        "known_for_department": "Acting",
        "name": "Raffiella Chapman",
        "place_of_birth": "Hastings, East Sussex, England",
        "popularity": 0.4255,
        "profile_path": "/ex7eqksy6YRkvGIgghpq8HV90aX.jpg"
    }
}