{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/DztBnZaqmla2sGUW9s8AyOmskT.jpg",
                "genre_ids": [
                    18
                ],
                "id": 14,
                "original_language": "en",
                "original_title": "American Beauty",
                "overview": "Lester Burnham, a depressed suburban father in a mid-life crisis, decides to turn his hectic life around after developing an infatuation with his daughter's attractive friend.",
                "popularity": 9.2546,
                "poster_path": "/wby9315QzVKdW9BonAefg8jGTTb.jpg",
                "release_date": "1999-09-15",
                "title": "American Beauty",
                "video": false,
                "vote_average": 8.005,
                "vote_count": 12548,
                "character": "Spartanette #3",
                "credit_id": "55e52dccc3a36813f2001196",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Originally from San Antonio, TX, Lily found her passion for dancing at age 3. She is classically ballet trained in Vaganova and has received the highest certificates in all levels of the Checcetti  Ballet Technique.  At a young age Lily performed in the Ballet West production of “The Nutcracker” and the Fort Worth Ballet production of “Cinderella”, in San Antonio. She continued to perform in different roles for numerous years. Lily is also extensively trained in Ballet, Pointe, Jazz, Lyrical, Contemporary, Modern, Hip-Hop, and Tap. Throughout high school Lily attended many competitions and dance conventions training with various dance teachers from both Los Angeles, New York and Chicago . She received many Top Elite awards and scholarships which led her to Los Angeles to pursue her professional dance career.  Lily has worked with many choreographers including Paula Abdul,  Andre Fuentes and many more. She has performed in many stage productions at Disney’s world famous El Capitan Theatre in Hollywood, CA including the World Premieres of “Tarzan” “Toy Story 2” and “Herbie Fully Loaded”. Her film credits include the feature film ”American Beauty”, and “Zombie Prom”. She has worked on industrials for Taco Bell and Marriott Resorts and has danced for many up and coming artist.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1503020,
        "imdb_id": "nm0396928",
        "known_for_department": "Acting",
        "name": "Lily Houtkin",
        "place_of_birth": "San Antonio, Texas",
        "popularity": 0.0168,
        "profile_path": "/eDanpIZCudL8pNFsPPJUF80gHOX.jpg"
    }
}