{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zeHB7aP46Xs3u4aFLuAq2GFeUGb.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 455207,
                "original_language": "en",
                "original_title": "Crazy Rich Asians",
                "overview": "An American-born Chinese economics professor accompanies her boyfriend to Singapore for his best friend's wedding, only to get thrust into the lives of Asia's rich and famous.",
                "popularity": 4.7521,
                "poster_path": "/1XxL4LJ5WHdrcYcihEZUCgNCpAW.jpg",
                "release_date": "2018-08-15",
                "title": "Crazy Rich Asians",
                "video": false,
                "vote_average": 7.063,
                "vote_count": 3804,
                "character": "Felicity Young",
                "credit_id": "5b7e0fd2c3a368341700a492",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Janice Koh"
        ],
        "biography": "A well-respected stage and screen actress, Janice Koh began her performance training under the Theatre Studies and Drama 'A'-level programme at Victoria Junior College. She graduated from the National University of Singapore with an Honours degree in Theatre Studies, and in 1996, received a Masters with Distinction in Theatre Administration from the University of London's Goldsmith's College, under a Public Service Commission Scholarship.\n\nOn television, Janice is most recognized for her role as the ambitious lawyer Angela Ang on the critically acclaimed Channel 5 legal drama The Pupil. Her performance as the sassy, fast-talking character earned her an Asian Television Awards 2010 nomination for Best Performance by an Actress in a Leading Role. For The Pupil Season 2, Janice got another nod for the same role when she was nominated Actress of the Year 2011 by Elle Magazine. This versatile artist has played a range of dramatic roles on several television series including an Interpol officer on Season Two of Zero Calling on Channel 5. She was also on Fighting Spiders Seasons 1 and 2, the popular C.L.I.F. Season 2 on Channel 8, OKTO's The Dairy of Amos Lee and also hosted Channel News Asia's The Art of Conversation, a documentary series following the journeys of Singapore's creative talents. Other television projects include Chase for Channel 5, CNA's Bertha's Nest, Arts Central's Going Straits, Arts Start and the award-winning Singapore Short Story Project. Janice has also made guest appearances on Sayang Sayang, Phua Chu Kang, Growing Up and Anything Goes. Janice's recent film credits include Ken Kwek's Unlucky Plaza, Hitman: Agent 47, and Kelvin Tong's film, The Offering. She most recently starred in the film Crazy Rich Asians by Warner Bros, which is due to be released in August 2018. A familiar face in the Singapore theatre scene, Janice has performed in more than 50 theatre productions, both in Singapore and abroad. In 2003, she won the Life! Theatre Award for Best Actress for her performance in David Auburn's Proof, and was nominated for the Life! Theatre Best Actress for her roles in Loo Zihan's With/Out, Alfian Sa'at's Optic Trilogy, Pangdemonium's production of Rabbit Hole, as well as Ovidia Yu's Hitting (On) Women. Alongside her cast, she received the Best Ensemble Award at the 2016 Boh Cameron Theatre Awards for Another Country by Wild Rice. Other recent theatre credits include Thomas Lim's Supervision by Wild Rice, Florian Zeller's The Father by Pangdemonium, the role of Margery in Robert Askin's Hand To God by Singapore Repertory Theatre, the role of 'Mummy' in Michael Chiang's iconic 'Beauty World', directed by Dick Lee, Bryony Lavery's Frozen by Pangdemonium, The Finger Player's Rant & Rave for the Esplanade's 10th Anniversary celebrations, Pangdemonium's Swimming with Sharks, Cooling Off Day by Wild Rice, Tan Tarn How's Fear of Writing,(WoAiAhAi) by The Theatre Practice, Poop by The Finger Players, The Crab Flower Club by Toy Factory, 120 and Diaspora by Theatreworks and Eleanor Wong's Jointly & Severably. Internationally, Janice has toured with a number of productions to major venues and festivals in Europe and Asia.",
        "birthday": "1973-12-10",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1503706,
        "imdb_id": "nm2080775",
        "known_for_department": "Acting",
        "name": "Janice Koh Yu-Mei",
        "place_of_birth": "Singapore",
        "popularity": 0.1028,
        "profile_path": "/qGNE4sNicSpQ9UxsS7nrNekqQeN.jpg"
    }
}