{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8r9RoGfwGmn1pn0G3sbvHHemSWF.jpg",
                "genre_ids": [
                    18,
                    10402,
                    36
                ],
                "id": 277216,
                "original_language": "en",
                "original_title": "Straight Outta Compton",
                "overview": "In 1987, five young men, using brutally honest rhymes and hardcore beats, put their frustration and anger about life in the most dangerous place in America into the most powerful weapon they had: their music.  Taking us back to where it all began, Straight Outta Compton tells the true story of how these cultural rebels—armed only with their lyrics, swagger, bravado and raw talent—stood up to the authorities that meant to keep them down and formed the world’s most dangerous group, N.W.A.  And as they spoke the truth that no one had before and exposed life in the hood, their voice ignited a social revolution that is still reverberating today.",
                "popularity": 5.6597,
                "poster_path": "/1CiLJx8Xtv3TbbFj6k7BboSmKgC.jpg",
                "release_date": "2015-08-11",
                "title": "Straight Outta Compton",
                "video": false,
                "vote_average": 7.787,
                "vote_count": 4041,
                "character": "Tomica",
                "credit_id": "55e6b7fd9251410f130024bd",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Patterson was born and raised in St. Petersburg, Florida. Her mother was 16 when she was born. She graduated from the New York University Tisch School of the Arts and later began appearing in off-Broadway productions. She made her big screen debut appearing in an supporting role in the 2010 romantic comedy-drama film, Why Did I Get Married Too?. In 2012 she made her Broadway debut in Manhattan Theatre Club production of Wit starring Cynthia Nixon. She later performed in off-Broadway productions of Luck of the Irish, Significant Other and By the Way, Meet Vera Stark. In 2017 she starred in August Wilson's play Jitney.\n\nIn 2015, Patterson appeared in the biographical drama film Straight Outta Compton directed by F. Gary Gray. On television, she made guest appearances on The Good Wife, Blue Bloods, Elementary and Instinct. From 2017 to 2018 she was a regular cast member in the E! drama series, The Arrangement. In 2020 she played Josephine Baker in an episode of HBO series, Lovecraft Country. In 2021, Patterson starred in the Disney+ action comedy series, Turner & Hooch. The series was canceled after one season. In 2023, Patterson played civil rights leader Coretta Scott King in the biographical drama film, Rustin directed by George C. Wolfe. Later in 2023 she was cast opposite Carrie Preston in the CBS comedy-drama series, Elsbeth.",
        "birthday": "1984-01-31",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.broadwayworld.com/people/Carra-Patterson/",
        "id": 1503717,
        "imdb_id": "nm3842417",
        "known_for_department": "Acting",
        "name": "Carra Patterson",
        "place_of_birth": "St. Petersburg, Florida",
        "popularity": 0.2028,
        "profile_path": "/wigOMxJMtqjzNoxulng0oOgNn8K.jpg"
    }
}