{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ke3lanTAgCqPMpOyutIfXzYih2s.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 266856,
                "original_language": "en",
                "original_title": "The Theory of Everything",
                "overview": "The Theory of Everything is the extraordinary story of one of the world’s greatest living minds, the renowned astrophysicist Stephen Hawking, who falls deeply in love with fellow Cambridge student Jane Wilde.",
                "popularity": 6.154,
                "poster_path": "/kJuL37NTE51zVP3eG5aGMyKAIlh.jpg",
                "release_date": "2014-11-07",
                "title": "The Theory of Everything",
                "video": false,
                "vote_average": 7.839,
                "vote_count": 10823,
                "character": "Sarah (Geneva Student)",
                "credit_id": "55e6df9dc3a3685f98002f30",
                "order": 36
            },
            {
                "adult": false,
                "backdrop_path": "/hHvvGvodFPADcbn0svgmSBYM9TU.jpg",
                "genre_ids": [
                    18
                ],
                "id": 306819,
                "original_language": "en",
                "original_title": "The Danish Girl",
                "overview": "When Gerda Wegener asks her husband Einar to fill in as a portrait model, Einar discovers the person she's meant to be and begins living her life as Lili Elbe. Having realized her true self and with Gerda's love and support, Lili embarks on a groundbreaking journey as a transgender pioneer.",
                "popularity": 3.2137,
                "poster_path": "/mXZZIacI5FC8thzSC0lgQBQ2uAX.jpg",
                "release_date": "2015-11-27",
                "title": "The Danish Girl",
                "video": false,
                "vote_average": 7.565,
                "vote_count": 5843,
                "character": "Gallery Employee",
                "credit_id": "575641849251416e300013f6",
                "order": 24
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Victoria Emslie is a British stage, television and film actress, best known for her roles in Downton Abbey, The Theory of Everything, The Frankenstein Chronicles, The Danish Girl (film), Grace (TV series) and the TV adaption of 12 Monkeys. She has a Masters in French and Arabic from the University of St. Andrews Emslie choose these languages as an opportunity to live abroad and travel. She then studied MA Acting For Screen at Royal Central School of Speech and Drama. Through her activism with Time’s Up UK and ERA 50:50, she bootstrapped Primetime at Cannes Film Festival in 2019. This global organisation helps the Entertainment Industry find and hire more women and non-binary professionals behind the camera. Primetime spans 75+ countries, partnering with leaders like BAFTA and the Geena Davis Institute. Victoria’s “Primetime Pledges” initiative facilitated high-end job offers and RTS award wins. A multiply neurodivergent founder, Victoria created a £40k filmmaking grant with major industry deals and is currently producing five films from her community. Primetime emphasises accessibility and inclusion, with features like self-identification for enhanced visibility. Recognised as \"Shaker of the Year\" by industry leaders, Victoria is a multidisciplinary artist and also serves on BAFTA’s Disability Advisory Group.",
        "birthday": "1987-03-01",
        "deathday": null,
        "gender": 1,
        "homepage": "https://iagtalent.com/clients/victoria-emslie/",
        "id": 1503911,
        "imdb_id": "nm4990981",
        "known_for_department": "Acting",
        "name": "Victoria Emslie",
        "place_of_birth": "Covent Garden, London, England, UK",
        "popularity": 0.1245,
        "profile_path": "/cJl8803vrh000NwHOTUtgbsicyT.jpg"
    }
}