{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/d84M69u6Q202dm6EvhVxbiqrK9f.jpg",
                "genre_ids": [
                    12,
                    18
                ],
                "id": 334533,
                "original_language": "en",
                "original_title": "Captain Fantastic",
                "overview": "Deep in the forests of the Pacific Northwest, a father devoted to raising his six kids with a rigorous physical and intellectual education is forced to leave his paradise and enter the world, beginning a journey that challenges his idea of what it means to be a parent.",
                "popularity": 5.3481,
                "poster_path": "/2sFME73GaD8UsUxPUKe60cPdLif.jpg",
                "release_date": "2016-07-08",
                "title": "Captain Fantastic",
                "video": false,
                "vote_average": 7.892,
                "vote_count": 6607,
                "character": "Rellian Cash",
                "credit_id": "55e93af69251413e3e005297",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/rAQcPrEaPzDRVNX7XX5TWyxCGFN.jpg",
                "genre_ids": [
                    27,
                    53
                ],
                "id": 346364,
                "original_language": "en",
                "original_title": "It",
                "overview": "In a small town in Maine, seven children known as The Losers Club come face to face with life problems, bullies and a monster that takes the shape of a clown called Pennywise.",
                "popularity": 12.1543,
                "poster_path": "/9E2y5Q7WlCVNEhP5GiVTjhEhx1o.jpg",
                "release_date": "2017-09-06",
                "title": "It",
                "video": false,
                "vote_average": 7.237,
                "vote_count": 19551,
                "character": "Henry Bowers",
                "credit_id": "57739feb92514124cb00054c",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Nic Hamilton",
            "니콜라스 해밀턴"
        ],
        "biography": "Nicholas has worked constantly throughout his teens. He plays Henry Bowers in horror remake \"IT\", based on the acclaimed Stephen King novel and also appears in \"The Dark Tower\", starring Matthew McConaughey and Idris Elba. Other feature credits include Captain Fantastic, from director Matt Ross, opposite Viggo Mortensen, which had outings at both the Sundance and Cannes film festivals and received a Nomination for Best Ensemble in a Feature Film at 2017's SAG Awards; and Strangerland from director Kim Farrant, opposite Nicole Kidman, Hugo Weaving and Joseph Fiennes.\n\nNicholas first came to industry attention with the lead role in the short film Time for which he received a Best Male Actor Award at the 2013 Tropfest Short Film Festival.\n\nOther credits to date include guest leads in Wanted and Mako Mermaids and the short films Letter to Annabelle, Jack Rabbit, The Boy Who Stole the Belltower and Gifted.\n\nHe is represented by WME, 3 Arts, and Catherine Poulton in Australia.",
        "birthday": "2000-05-04",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1504947,
        "imdb_id": "nm5640595",
        "known_for_department": "Acting",
        "name": "Nicholas Hamilton",
        "place_of_birth": "Lismore, New South Wales, Australia",
        "popularity": 0.2932,
        "profile_path": "/6XB730yU5XKJfEhV5W2zV8B9Fmh.jpg"
    }
}