{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/iFQzlUmO5QmMPcSHHDdfd522x33.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 7857,
                "original_language": "it",
                "original_title": "Amarcord",
                "overview": "In an Italian seaside town, young Titta gets into trouble with his friends and watches various local eccentrics as they engage in often absurd behavior. Frequently clashing with his stern father and defended by his doting mother, Titta witnesses the actions of a wide range of characters, from his extended family to Fascist loyalists to sensual women, with certain moments shifting into fantastical scenarios.",
                "popularity": 4.0547,
                "poster_path": "/6PcyPeenUgVb0S7htBKnW5xcVHy.jpg",
                "release_date": "1973-12-18",
                "title": "Amarcord",
                "video": false,
                "vote_average": 7.909,
                "vote_count": 1152,
                "character": "Boy (uncredited)",
                "credit_id": "67ba0a5f31ad7dc8734653a6",
                "order": 57
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Eros Walter Luciano Ramazzotti"
        ],
        "biography": "Eros Walter Luciano Ramazzotti (born 28 October 1963) is an Italian pop singer, musician and songwriter. He is popular in Italy and most European countries, and throughout the Spanish-speaking world, as he has released most of his albums in both Italian and Spanish.\n\nSince 1984, Ramazzotti has released 11 studio albums, one EP, three compilation albums, three live albums, and 37 singles. He has sold over 60 million records in his 30-year career. His repertoire includes duets with artists such as Cher, Tina Turner, Andrea Bocelli, Patsy Kensit, Anastacia, Joe Cocker, Julio Iglesias, Lynn Davis, Ricardo Arjona, Luciano Pavarotti, Laura Pausini, Nicole Scherzinger and Ricky Martin.\n\nRamazzotti first gained international success in 1993, with the release of Tutte storie, which amassed five million album sales and occupied the top five in every country where he had previously released albums. This success led to a BMG International record contract in 1994. His audience appeal comes from several factors, including his unique voice, which can be described as somewhat nasal but nevertheless forceful and resonant baritone, and his energetic delivery of catchy, melodic tunes which are often passionate mid-tempo autobiographical ballads, with instrumentation that is rich in soft-rock influence.\n\nRamazzotti was born in Cinecittà Est, a suburb of Rome. He is the son of Rodolfo Ramazzotti, a construction worker and Raffaela Molina, a housewife. His father originated from the province of Viterbo in Lazio and his mother from the province of Vibo Valentia in Calabria. He was named after Eros, the Greek god of love. He began playing the guitar at age seven. As a teenager, he wrote songs with the help of his father who was a music lover and played piano. He wanted to attend a musical conservatory but failed the admission examination, and started training in bookkeeping, but dropped out. He occasionally appeared as an extra in films while dreaming of having a career as a pop-star.\n\nIn 1981, Ramazzotti took part in a music contest, Voci Nuove di Castrocaro (New Voices of Castrocaro Terme) with the song \"Rock 80\", which he wrote, performing in front of various record label representatives. Although the contest was won by Zucchero and Fiordaliso, Ramazzotti reached the final and received two votes from Roberto Galanti and Baron Lando Lanni, who represented the recently launched Italian Label DDD (Drogueria di Drugolo). DDD gave Eros his first contract. He moved to Milan with his brother Marco and his mother Raffaella, and they initially lived in the same building as the record label company.\n\nRamazzotti's first single, \"Ad un amico\" (To a Friend), was released in 1982, and was not particularly well received. Soon after, Eros met Renato Brioschi, who mentored the young artist toward his first success in 1984 at the highly regarded Sanremo Festival. His song, \"Terra promessa\" (Promised Land) won the Newcomers' category, and was subsequently released widely throughout Europe. ...\n\nSource: Article \"Eros Ramazzotti\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1963-10-28",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.ramazzotti.com/",
        "id": 1504791,
        "imdb_id": "nm0006962",
        "known_for_department": "Acting",
        "name": "Eros Ramazzotti",
        "place_of_birth": "Rome, Italy",
        "popularity": 0.2497,
        "profile_path": "/sj1B0YovIENUsDBLfNPgrnV06FF.jpg"
    }
}