{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/f2yrxYqXr1RSJwgF9Ek1ULI21Ap.jpg",
                "genre_ids": [
                    35
                ],
                "id": 366564,
                "original_language": "fr",
                "original_title": "Comment c'est loin",
                "overview": "After ten years of doing nothing, Orel and Gringe are in their mid 30s and they struggle to finish their first rap album. Their texts are mostly sex jokes and booze stories and reflect the everyday life they have in a small town from France. The problem is that they never really finished a song and when their producers want to meet, they have to face a new challenge : finish their first song in the next 24h. Their old issues, the fear of failure, their alcoholic friends and annoying girlfriends won't help them to do so, or will they ?",
                "popularity": 1.9941,
                "poster_path": "/jhZtyj9BYECjWVRKUJPQCNNYsMM.jpg",
                "release_date": "2015-12-09",
                "title": "Comment c'est loin",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 676,
                "character": "Gringe",
                "credit_id": "5638e471c3a3681b5901f1b7",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Guillaume Tranchant",
            "غرينج"
        ],
        "biography": "Guillaume Tranchant (born 20 February 1980), better known by his stage name Gringe, is a French rapper, songwriter and actor. He is one half of the French hip hop duo Casseurs Flowters, along with Orelsan, with whom he has released two studio albums: Orelsan et Gringe sont les Casseurs Flowters in 2013, and the original soundtrack for their 2015 film Comment c'est loin.\n\nIn 2004, Gringe formed the hip hop duo Casseurs Flowters with his colleague Orelsan, and with help from French record producer Skread, they released their first mixtape Fantasy: Episode 1 in 2004 with 11 tracks. Afterwards, the two decided to focus on building their solo careers; Gringe collaborated with a number of artists including El Matador, Brasco, Pit Baccardi, La Province, Jamal and Nubi, while he also appeared on the song \"Ils sont cools\", from Orelsan's second studio album Le chant des sirènes, which peaked at number 66 on the French (SNEP) Singles Chart.\n\nOn 3 July 2013, Gringe released his first collaborative single as Casseurs Flowters with Orelsan, \"Bloqué\", as a pre-release for their upcoming debut studio album, Orelsan et Gringe sont les Casseurs Flowters, which was released on 15 November 2013 to generally positive reviews. On 9 December 2015, Orelsan and Gringe released their second collective studio album Comment c'est loin, which also served as the soundtrack for their comedy film of the same name, peaking at number 24 on the French Albums Chart and earning a platinum certification in France 13 months later.\n\nIn April 2017, Gringe announced that he was working on his debut solo album, but did not provide any exact date for its release.\n\nOn 3 November 2018, Gringe released his first solo album Enfant lune.\n\nSource: Article \"Gringe\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1980-02-20",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1507097,
        "imdb_id": "nm6237589",
        "known_for_department": "Acting",
        "name": "Gringe",
        "place_of_birth": "Poitiers, Vienne, France",
        "popularity": 0.1466,
        "profile_path": "/4E4DlB4HKPWVwSIOovmgupx74yG.jpg"
    }
}