{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9OKzKuCfcMwpHVp56pjNI7J4xXR.jpg",
                "genre_ids": [
                    27,
                    878
                ],
                "id": 923,
                "original_language": "en",
                "original_title": "Dawn of the Dead",
                "overview": "During an ever-growing epidemic of zombies that have risen from the dead, two Philadelphia SWAT team members, a traffic reporter, and his television-executive girlfriend seek refuge in a secluded shopping mall.",
                "popularity": 4.6088,
                "poster_path": "/70MY8H0bLMvXf8ED2SgVMPhDVVM.jpg",
                "release_date": "1978-09-02",
                "title": "Dawn of the Dead",
                "video": false,
                "vote_average": 7.495,
                "vote_count": 2184,
                "character": "Roger \"Trooper\" DeMarco",
                "credit_id": "52fe428dc3a36847f8027b85",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/rspbS1E9wJtslrb8amfJgtMBUVh.jpg",
                "genre_ids": [
                    27,
                    28
                ],
                "id": 924,
                "original_language": "en",
                "original_title": "Dawn of the Dead",
                "overview": "A group of survivors take refuge in a shopping mall after the world is taken over by aggressive, flesh-eating zombies.",
                "popularity": 6.3314,
                "poster_path": "/ttquyxStEEctzghtA2f4PUGprDr.jpg",
                "release_date": "2004-03-19",
                "title": "Dawn of the Dead",
                "video": false,
                "vote_average": 7.057,
                "vote_count": 4228,
                "character": "The General",
                "credit_id": "52fe428ec3a36847f8027ce5",
                "order": 41
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Scott Reiniger"
        ],
        "biography": "Scott H. Reiniger, born in New York City, holds a Bachelor of Arts Degree in Theater Arts majoring in Acting/Directing at Rollins College in Florida. Following graduation from college. Reiniger went back to New York to train professionally at The American Stanislavsky Theatre for three years and subsequently at The American Conservatory Theater (ACT) in San Francisco and Circle Repertory in New York. As an actor, he worked on stage continuously and then moved to directing and developing new plays and continues to do so.\n\nHe starred as 'Roger' in George A. Romero's original film classic, \"Dawn of the Dead\" and performed roles in Film and Television. He also appeared as the 'Army General' in the 2004 remake of \"Dawn of the Dead\" directed by Zach Schneider.\n\nAs Director, he has worked with hundreds of actors and performers including Ryan Phillippe, Bruce Davison, Jean Smart, Jonathan Silverman, Warren Beatty, Annette Bening, Dan Ackroyd, Tom Selleck, Lee Grant, Ed Asner, Holland Taylor and Bill Macy. With over 20 professional stage productions in Los Angeles, New York, and major Regional LORT theaters throughout the country. Reiniger has also worked extensively with playwrights developing and directing numerous new works and moving them into production including the Pulitzer Prize Winner, \"The Kentucky Cycle\", by Robert Schenkkan and with screenwriters.\n\nHe then studied Film and Television Production and Cinematography at the University of California's (UCLA) Certificate Program, The Sony Institute and Screenwriting at Truby's Writers Studio in Los Angeles. He is Head of the Camera Department at The American Academy of Dramatic Arts in Los Angeles and continues to develop and write new work.\n\nIn 2004 Reiniger discovered that he's the great, great, great-grandson of Josiah Harlan, who was the first American to set foot in Afghanistan. This in turn makes Scott Reiniger the prince of the Western province of Ghor. Wow. That was a shock and a surprise.",
        "birthday": "1948-09-05",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.scottreiniger.net/",
        "id": 15071,
        "imdb_id": "nm0718203",
        "known_for_department": "Acting",
        "name": "Scott H. Reiniger",
        "place_of_birth": "New York City, New York",
        "popularity": 0.0924,
        "profile_path": "/hoY44xf8CumZqpTsOxBwPOKpnMo.jpg"
    }
}