{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/r18vpGFsNf6n984x4KdJmAAWKkP.jpg",
                "genre_ids": [
                    18,
                    27
                ],
                "id": 136,
                "original_language": "en",
                "original_title": "Freaks",
                "overview": "A circus' beautiful trapeze artist agrees to marry the leader of side-show performers, but his deformed friends discover she is only marrying him for his inheritance.",
                "popularity": 4.6606,
                "poster_path": "/fX2Wxd0W9E7eVClUd8kJTfennoV.jpg",
                "release_date": "1932-01-01",
                "title": "Freaks",
                "video": false,
                "vote_average": 7.795,
                "vote_count": 1237,
                "character": "Cleopatra",
                "credit_id": "5e61e79022af3e0018dcbc72",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Olga Baklanova",
            "Baclanova",
            "オルガ・バクラノヴァ",
            "Olga Vladimirovna Baklanova",
            "Ольга Бакланова",
            "О. Бакланова"
        ],
        "biography": "From Wikipedia\n\nÓlga Vladímirovna Baclanova (19 August 1893 – 6 September 1974) was a Russian-born actress and operatic singer, who achieved prominence during the silent film era and was often billed under her last name only, as Baclanova, similarly to the surname-only nomenclature assigned to fellow countryman Nazimova.\n\nShe was billed as the \"Russian Tigress\" and remains most noted by modern audiences for portraying Cleopatra in Tod Browning's horror movie Freaks (1932), which features a cast of actual carnival sideshow freaks.\n\nBaclanova first came to New York City with the 1925 touring production of the Moscow Art Theatre's Lysistrata. Though the rest of the company returned to Russia in 1926, she stayed to pursue a career in the United States. A statuesque blonde, Baclanova quickly established herself as a popular actress in American silent movies and achieved a notable success with The Docks of New York (1928), directed by Josef von Sternberg. Later that year, she also appeared in The Man Who Laughs as Duchess Josiana, the femme fatale love interest to Conrad Veidt's disfigured hero.\n\nThe introduction of talking films proved difficult for Baclanova, as audiences did not respond to her heavy Russian accent. She no longer secured leading roles, and was relegated to supporting parts. Her career was in decline when she was offered the role of the cruel circus performer Cleopatra in Tod Browning's film Freaks (1932). This horror movie, which featured actual carnival freaks, was highly controversial and screened only briefly before being withdrawn. It would be 30 years before Freaks gained a cult following. The movie did not revive Baclanova's film career, which ended in 1943.\n\nBaclanova worked extensively on stage in London's West End and in New York, for about 10 years starting in the mid-1930s. In 1943 she appeared in \"Claudia\" at the Moore Theatre in Seattle, Washington.\n\nBaclanova was married three times and bore two sons with her first and second husbands. The birth of her second son with actor Nicholas Soussanin was front page news and covered quite extensively in the press in 1930.\n\nAfter her retirement she settled in Vevey, Switzerland, where she died in 1974.",
        "birthday": "1893-08-16",
        "deathday": "1974-09-06",
        "gender": 1,
        "homepage": null,
        "id": 1508,
        "imdb_id": "nm0045754",
        "known_for_department": "Acting",
        "name": "Olga Baclanova",
        "place_of_birth": "Moscow, Russian Empire [now Russia]",
        "popularity": 0.2844,
        "profile_path": "/4iGwi4WGG8dk84hXBh0HWz2Ffv8.jpg"
    }
}