{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/e5MvOQIIouSgQcBHCMNA6Rsbwnd.jpg",
                "genre_ids": [
                    18
                ],
                "id": 81481,
                "original_language": "ko",
                "original_title": "도가니",
                "overview": "Based on actual events that took place at Gwangju Inhwa School for the hearing-impaired, where young deaf students were the victims of repeated sexual assaults by faculty members over a period of five years in the early 2000s.",
                "popularity": 3.978,
                "poster_path": "/mbMp0oIFmYnw0i5gzRoKt8cH5ve.jpg",
                "release_date": "2011-09-22",
                "title": "Silenced",
                "video": false,
                "vote_average": 8.156,
                "vote_count": 701,
                "character": "Kang In-ho",
                "credit_id": "53072c189251412be500006c",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/fVpFOcQyHJM2di9upgSIwWD5wac.jpg",
                "genre_ids": [
                    27,
                    53,
                    28,
                    12
                ],
                "id": 396535,
                "original_language": "ko",
                "original_title": "부산행",
                "overview": "When a zombie virus pushes Korea into a state of emergency, those trapped on an express train to Busan must fight for their own survival.",
                "popularity": 13.3006,
                "poster_path": "/vNVFt6dtcqnI7hqa6LFBUibuFiw.jpg",
                "release_date": "2016-07-20",
                "title": "Train to Busan",
                "video": false,
                "vote_average": 7.753,
                "vote_count": 7959,
                "character": "Seok-woo",
                "credit_id": "572f1ae4c3a3687cc9000534",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Gong Ji-chul",
            "Гон Ю",
            "공유",
            "Yoo Gong",
            "공지철",
            "孔侑",
            "孔劉",
            "コン・ユ",
            "Gong Yoo",
            "Gong Yu",
            "Kong Yoo",
            "Kong Yu",
            "孔刘",
            "孔地哲",
            "იაუ გონგი",
            "กงยู",
            "گونگ یو",
            "Кон Ю"
        ],
        "biography": "Gong Yoo (Hangul: 공유) is a South Korean actor. He started his career in showbiz as a VJ and subsequently debuted with parts in school dramas and films, eventually gaining starring roles in prime time dramas such Hello My Teacher and One Fine Day. His role as a cafe manager who falls in love with a girl disguised as a man in romantic comedy The 1st Shop of Coffee Prince solidified his status as a drama leading man. The popularity of the drama made him a regional star. After serving the 2-year compulsory military service, Gong Yoo made his comeback with romantic comedy Finding Mr Destiny and Silenced, a film project spearheaded by the actor himself upon reading the book based on the real events of deaf students being sexually exploited by the staff in a South Korean special school. Gong took on the role as a North Korean agent in action film the suspect in 2013. His post-military television comeback Big was however, not as well received. While Gong remained popular with Korean audience and brand sponsors, he experienced somewhat of a career renaissance in 2016 with box office hits Train to Busan and Age of Shadows, as well as one of the most-viewed Korean cable television drama, Goblin.",
        "birthday": "1979-07-10",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 150903,
        "imdb_id": "nm1508003",
        "known_for_department": "Acting",
        "name": "Gong Yoo",
        "place_of_birth": "Busan, South Korea",
        "popularity": 1.7193,
        "profile_path": "/ocGoFb6TrK3uWGXt4WnuibUG1vD.jpg"
    }
}