{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1nR9mCsJD02j13wet0yAnVhEG6Y.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 71157,
                "original_language": "fr",
                "original_title": "Polisse",
                "overview": "Paris, France. Fred and his colleagues, members of the BPM, the Police Child Protection Unit, dedicated to pursuing all sorts of offenses committed against the weakest, must endure the scrutiny of Melissa, a photographer commissioned to graphically document the daily routine of the team.",
                "popularity": 2.378,
                "poster_path": "/cKs3XSFVbFeZcH3g9geAvr6ApOl.jpg",
                "release_date": "2011-10-06",
                "title": "Polisse",
                "video": false,
                "vote_average": 7.781,
                "vote_count": 1268,
                "character": "Chrystelle",
                "credit_id": "52fe4826c3a368484e0eb6f7",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Karole Rocher est une actrice française née en 1974 à Bezons, dans le Val-d'Oise.\n\nElle a débuté en 1995 dans un clip d'Olivier Dahan pour Princesse Erika: Faut qu'je travaille. Elle a ensuite tourné sous la direction de Sylvie Verheyde aux côtés de Emma de Caunes dans Un Frère, travaillé avec Christian Vincent dans Sauve-moi. On l'a également vue dans Osmose de Raphaël Fetjo et Scorpion de Julien Séri. Elle retrouve Sylvie Verheyde en 2001 pour Princesses et en 2008 pour Stella.\n\nLes années suivantes, Karole Rocher fait des apparitions dans Comment J’ai Tué Mon Père, Adieu, Osmose et Stella.\n\nEn 2008 et 2009, la comédienne rejoint le casting de la série originale de Canal +, Braquo et tourne sous la direction de Maïwenn pour Le Bal Des Actrices. L'année suivante, Karole Rocher joue dans Bus Palladium, Les Yeux De Sa Mère et Dernière Séance.\n\n2011 lui offre une nouvelle fois un rôle dans un film de Maïwenn avec Polisse et participe au film de Robert Guédiguian, Les Neiges Du Kilimandjaro. L'année qui suit, la comédienne est nommé au César 2012 de la Meilleure Actrice dans un second rôle pour son interprétation de flic de la brigade des mineurs dans Polisse.",
        "birthday": "1974-01-01",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.karolerocher.fr/",
        "id": 150901,
        "imdb_id": "nm0430629",
        "known_for_department": "Acting",
        "name": "Karole Rocher",
        "place_of_birth": "Bezons - Val-d'Oise - France",
        "popularity": 0.2738,
        "profile_path": "/dNr33o4OKy9O9WxJdfGlDSl54EJ.jpg"
    }
}