{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1GU0jS5ZG5MhfdDrpj8s9XxbgJJ.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 505642,
                "original_language": "en",
                "original_title": "Black Panther: Wakanda Forever",
                "overview": "Queen Ramonda, Shuri, M’Baku, Okoye and the Dora Milaje fight to protect their nation from intervening world powers in the wake of King T’Challa’s death.  As the Wakandans strive to embrace their next chapter, the heroes must band together with the help of War Dog Nakia and Everett Ross and forge a new path for the kingdom of Wakanda.",
                "popularity": 14.185,
                "poster_path": "/sv1xJUazXeYqALzczSZ3O6nkH75.jpg",
                "release_date": "2022-11-09",
                "title": "Black Panther: Wakanda Forever",
                "video": false,
                "vote_average": 7.036,
                "vote_count": 7020,
                "character": "Naval Engineer",
                "credit_id": "636ca5d41684f70083db5120",
                "order": 71
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Aba Arthur was born in Washington DC to parents Appianda Arthur and Aba Enim. She developed a love of film, television, and pop culture at an early age. This love of creative arts would soon turn into a focused career in the entertainment industry.\n\nAba attended the University of Colorado-Boulder and graduated with a Bachelor of Fine Arts degree in Performing Arts along with a Bachelor of Arts degree in Political Science. During her time at the university, Aba co-created a successful dance troupe called BAM! (Bust A Move), where she also served as choreographer.\n\nUpon graduation, Aba moved to L.A. and was cast in several commercials and feature films, some of which were screened overseas. Ever the fervid writer, Aba continued to write during those years, a passionate pursuit she still maintains to this day. She wrote her first published book, titled, 'The 21 Day Ex-Boyfriend Cleanse' and quickly developed a love of screenwriting.\n\nAfter creating more than 20 script concepts, Aba was inspired to start her own production company, The Ohemaa Project. She launched her first stage production in 2008 for her solo show titled, 'Landing in Love,' and worked with visual artists in her stage production, 'Breathing Art' (which toured from 2016-2018). Classically trained for both stage and screen, she has also appeared in notable plays including, 'Proof,' and 'For Colored Girls.'\n\nAfter years of living and working in L.A., Aba relocated to Atlanta, Georgia and continued her writing, performing, and acting career. She was cast in various television shows, including the upcoming 'Bad Monkey,' starring Vince Vaughn, 'Cobra Kai,' and the popular American fantasy Netflix drama, 'Legacies.' She appeared in the NBC show, 'Southland,' and the comedic show, 'Boomerang.' She was cast as Nicole in the ABC television series, 'Queens' and played Miss Gold in 'Respect,' a biopic of Aretha Franklin, starring Jennifer Hudson. In 2018, Aba wrote, produced, and co-directed her first film titled 'The Womb.' In November 2022, Aba will appear in the highly anticipated sequel to Black Panther: Wakanda Forever. Most recently, Aba has been cast in the role of Abena, in the new Oprah Winfrey adaption of 'The Color Purple,' due to release in 2023.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1510786,
        "imdb_id": "nm2353060",
        "known_for_department": "Acting",
        "name": "Aba Arthur",
        "place_of_birth": "Washington, D.C., U.S.",
        "popularity": 0.0589,
        "profile_path": "/iSkqZ5NgyeIeHLxFTysqO6Vv2xr.jpg"
    }
}