{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4BOgSGwEEHZuDhiHUOsrXaJBqoc.jpg",
                "genre_ids": [
                    36,
                    18,
                    28
                ],
                "id": 617653,
                "original_language": "en",
                "original_title": "The Last Duel",
                "overview": "King Charles VI declares that Knight Jean de Carrouges settle his dispute with his squire, Jacques Le Gris, by challenging him to a duel.",
                "popularity": 5.1662,
                "poster_path": "/zjrJE0fpzPvX8saJXj8VNfcjBoU.jpg",
                "release_date": "2021-10-13",
                "title": "The Last Duel",
                "video": false,
                "vote_average": 7.422,
                "vote_count": 3606,
                "character": "Marie",
                "credit_id": "61547cc681c7be00439e582f",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Tallulah Rose Haddon"
        ],
        "biography": "Tallulah Haddon is a live art performer and actress based in South London.\n\nA performance artist whose work frequently overlaps with cabaret, comedy, beat boxing and drag art forms, Tallulah frequently performs in a diverse range of spaces including outdoor festivals, queer performance nights and live art events. Tallulah’s work looks broadly at issues of gender and power, and has previously explored her own romantic relationship, the power of celebrity men and how they abuse it (and others), heteronormativy in sex and the process by which women absorb the experiences of our close female friends.\n\nTallulah is currently exploring themes and techniques of audience participation in relation to power, female collaboration and performance in public spaces, domestic abuse and installation.\n\nPrevious events and venues where Tallulah has performed include Duckie, Low Stakes, Deadline, Latitude Festival, Shuffle Festival, Soho Theatre, Fierce Festival, Tits and Tinsel, The Royal Vauxall Tavern, Bethnal Green Working Men’s Club and Morge Fest amongst many others. She has previously studied at Marissa Carnesky’s Finishing School, as well as with artists such as Lauren Barri-Holstein and Daniel Oliver.\n\nAs a performer her work is frequently collaborative, and she has performed alongside Lucy McCormick, Elijah Harris (see Shared Saliva), Cloud.\n\nBio via - tallulahhaddon.com",
        "birthday": "1997-09-09",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.tallulahhaddon.com",
        "id": 1510974,
        "imdb_id": "nm7552807",
        "known_for_department": "Acting",
        "name": "Tallulah Haddon",
        "place_of_birth": " London, England, UK",
        "popularity": 0.1176,
        "profile_path": "/hjr2yU4mFCWlZZ9XUOQZkXkuMU4.jpg"
    }
}