{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wePpxpU1eNZnHCChP5xGNJrGKY3.jpg",
                "genre_ids": [
                    10751,
                    18
                ],
                "id": 339984,
                "original_language": "en",
                "original_title": "Miracles from Heaven",
                "overview": "When Christy discovers her 10-year-old daughter Anna has a rare, incurable disease, she becomes a ferocious advocate for her daughter’s healing as she searches for a solution. After Anna has a freak accident and falls three stories, a miracle unfolds in the wake of her dramatic rescue that leaves medical specialists mystified, her family restored and their community inspired.",
                "popularity": 5.4227,
                "poster_path": "/hz9VF1TfaM0D04pYneSXUkNeOZv.jpg",
                "release_date": "2016-03-17",
                "title": "Miracles from Heaven",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 1223,
                "character": "Billy Snyder",
                "credit_id": "55fafe219251413d500001ae",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/oMnJhVFr0xVfxy4HPBt1LDKoFgV.jpg",
                "genre_ids": [
                    27,
                    9648
                ],
                "id": 591274,
                "original_language": "en",
                "original_title": "Fear Street: 1978",
                "overview": "In 1978, two rival groups at Camp Nightwing must band together to solve a terrifying mystery when horrors from their towns' history come alive.",
                "popularity": 7.7281,
                "poster_path": "/5dNTxhoGDTHHGqUTdxcr4H1dqlU.jpg",
                "release_date": "2021-07-08",
                "title": "Fear Street: 1978",
                "video": false,
                "vote_average": 7.188,
                "vote_count": 2079,
                "character": "Young Will Goode",
                "credit_id": "60e8b5db22e480005f11e5e3",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Brandon Spink is quickly making a name for himself with buzz-worthy roles in television and film. At the age of seven, he found his passion of performing while starring in local theater productions.\n\nAt 10 years old Brandon booked the lead role of Young Johnny Knoxville for the pilot of the same name for ABC.\n\nBrandon took 2016 by storm with the feature Miracles from Heaven the role of Billy, co-starring Jennifer Garner and Queen Latifah; the incredible true story based on author, Christy Beam's memoir.\n\nNext was the role of young Bruce Wayne in Warner Bros. star studded film Batman v Superman: Dawn of Justice, directed by Zach Snyder.\n\nFollowed by Open Road Film's Mother's Day, playing Jennifer Aniston and Timothy Olyphant's son, Peter. The romantic comedy is by acclaimed director Garry Marshall.\n\nIn addition to the big screen in 2016, Brandon recurred as Petey in NBC's one-hour drama Game of Silence.\n\n2017 is gearing up to be another busy year for Brandon who guest starred on ABC's Once Upon A Time as Baelfire.\n\nBrandon will next be seen in a recurring role on Epix series Berlin Station.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1511243,
        "imdb_id": "nm4800462",
        "known_for_department": "Acting",
        "name": "Brandon Spink",
        "place_of_birth": null,
        "popularity": 0.1367,
        "profile_path": "/2ngCvKwwJ434JQD99YLPa2YZtwV.jpg"
    }
}