{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8r9RoGfwGmn1pn0G3sbvHHemSWF.jpg",
                "genre_ids": [
                    18,
                    10402,
                    36
                ],
                "id": 277216,
                "original_language": "en",
                "original_title": "Straight Outta Compton",
                "overview": "In 1987, five young men, using brutally honest rhymes and hardcore beats, put their frustration and anger about life in the most dangerous place in America into the most powerful weapon they had: their music.  Taking us back to where it all began, Straight Outta Compton tells the true story of how these cultural rebels—armed only with their lyrics, swagger, bravado and raw talent—stood up to the authorities that meant to keep them down and formed the world’s most dangerous group, N.W.A.  And as they spoke the truth that no one had before and exposed life in the hood, their voice ignited a social revolution that is still reverberating today.",
                "popularity": 5.6597,
                "poster_path": "/1CiLJx8Xtv3TbbFj6k7BboSmKgC.jpg",
                "release_date": "2015-08-11",
                "title": "Straight Outta Compton",
                "video": false,
                "vote_average": 7.787,
                "vote_count": 4041,
                "character": "Cameraman (uncredited)",
                "credit_id": "6691b15068dd5e1bf3023803",
                "order": 122
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Brian Robert Gilleece"
        ],
        "biography": "Brian Gilleece is an American Born Actor, On-Air Personality & Host. Brian was born in Port Jefferson, NY, the son of Robert & Frances Gilleece and younger brother to David, Christopher & Andy. Brian spent the majority of his childhood in the small central Connecticut town of Woodbury and attended Holy Cross High School in Waterbury, CT were he was involved in athletics of a varied nature including Ice Hockey, Baseball & Captain of the Varsity Down Hill Ski Racing Team & Captain of the Varsity Golf Team. Brian also acted in Fall and Spring theater department play productions.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.briangilleece.com/",
        "id": 1512535,
        "imdb_id": "nm6849502",
        "known_for_department": "Acting",
        "name": "Brian Gilleece",
        "place_of_birth": "Port Jefferson - New York - USA",
        "popularity": 0.0845,
        "profile_path": "/ynyoG0BmYQBoHqVzHTNG1tNMEFY.jpg"
    }
}