{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/oi7D7gBwTpaDqSx9jaXmkT7Yaai.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 269,
                "original_language": "fr",
                "original_title": "À bout de souffle",
                "overview": "A small-time thief steals a car and impulsively murders a motorcycle policeman. Wanted by the authorities, he attempts to persuade a girl to run away to Italy with him.",
                "popularity": 2.8408,
                "poster_path": "/9Wx0Wdn2EOqeCZU4SP6tlS3LOml.jpg",
                "release_date": "1960-03-16",
                "title": "Breathless",
                "video": false,
                "vote_average": 7.517,
                "vote_count": 1904,
                "character": "(uncredited)",
                "credit_id": "560189cbc3a3685618001d34",
                "order": 27
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jacques Gouzerh"
        ],
        "biography": "Jacques Serguine (born 1935) is a French writer and essayist.\n\nBorn in 1935, Jacques Serguine, pen name of Jacques Gouzerh, lived and worked in Avon near Fontainebleau. He was noticed very young by Jean Paulhan who published his first texts in La Nouvelle Revue française. In 1959, his first novel, Les Fils de Rois, inaugurated the series \"Le Chemin\" (Gallimard) directed by Georges Lambrichs, obtained the Prix Fénéon and missed the Prix Médicis by one vote behind Claude Mauriac. Assimilated to the literary movement of the Hussards, he will decline the invitation by political convictions. His fourth novel Mano l'Archange, although unanimously hailed by the critic whose first defender was Kleber Haedens, was banned from sale for \"harm to good morals\".\n\nOn the sidelines of a noted literary work and devoted to the sensual aspect of human relations, Jacques Serguine is also the author of the famous Cruelle Zélande and Éloge de la fessée (Folio Gallimard) which has been said to have given their letters of nobility to this erotic fantasy. He is also the author of the original screenplay of the film A Very Curious Girl by Nelly Kaplan.\n\nSource: Article \"Jacques Serguine\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1934-06-09",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1513489,
        "imdb_id": "nm1028100",
        "known_for_department": "Acting",
        "name": "Jacques Serguine",
        "place_of_birth": "Neuilly-sur-Seine, Seine [now Hauts-de-Seine], France",
        "popularity": 0.0071,
        "profile_path": "/6a4L4DohmxyMrspmqaR8NIf5Sqa.jpg"
    }
}