{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/myikoqu8Z2gtE7TaBgk9r6fB9MF.jpg",
                "genre_ids": [
                    18
                ],
                "id": 1040,
                "original_language": "it",
                "original_title": "Il gattopardo",
                "overview": "As Garibaldi's troops begin the unification of Italy in the 1860s, an aristocratic Sicilian family grudgingly adapts to the sweeping social changes undermining their way of life. Proud but pragmatic Prince Don Fabrizio Salina allows his war hero nephew, Tancredi, to marry Angelica, the beautiful daughter of gauche, bourgeois Don Calogero, in order to maintain the family's accustomed level of comfort and political clout.",
                "popularity": 3.1711,
                "poster_path": "/riSUxwoK3xjkOgy6YJSvPhi7cO6.jpg",
                "release_date": "1963-03-27",
                "title": "The Leopard",
                "video": false,
                "vote_average": 7.751,
                "vote_count": 886,
                "character": "Don Francisco Ciccio Tumeo",
                "credit_id": "52fe42e5c3a36847f802b1c7",
                "order": 39
            },
            {
                "adult": false,
                "backdrop_path": "/csCSd8gftDRax0tiuo4VZJ9UaOo.jpg",
                "genre_ids": [
                    10752,
                    18,
                    53
                ],
                "id": 15383,
                "original_language": "fr",
                "original_title": "L'Armée des ombres",
                "overview": "Betrayed by an informant, Philippe Gerbier finds himself trapped in a torturous Nazi prison camp. Though Gerbier escapes to rejoin the Resistance in occupied Marseilles, France, and exacts his revenge on the informant, he must continue a quiet, seemingly endless battle against the Nazis in an atmosphere of tension, paranoia and distrust.",
                "popularity": 3.3563,
                "poster_path": "/aqNZWM9bspt8zaDvVRIRiWxRVJ7.jpg",
                "release_date": "1969-09-10",
                "title": "Army of Shadows",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 689,
                "character": "Hairdresser",
                "credit_id": "52fe46549251416c75074e57",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Серж Реджани"
        ],
        "biography": "Serge Reggiani (2 May 1922 – 23 July 2004) was an Italian-born French singer and actor. He was born in Reggio Emilia, Italy and moved to France with his parents at the age of eight. For many years, he struggled with alcoholism, caused in part by the 1980 suicide of his son Stephan.\n\nAfter acting school (Conservatoire des arts cinématographiques) he was discovered by Jean Cocteau and appeared in a wartime production of Les Parents terribles (\"The Terrible Parents\"). During World War II, he left Paris to join the French resistance.\n\nHis first feature film came in 1946 with his role in Les portes de la nuit (\"The Doors of the Night\"). He later went on to perform in 80 films including Casque d'or, Les Misérables (1958),Tutti a casa, Le Doulos, Il Gattopardo, La terrazza, The Pianist (1998).\n\nIn spite of never quite reaching the peak with his acting career, he did triumph in the theatre in 1959 with his performance in Jean-Paul Sartre’s play Les Séquestrés d'Altona. In the meantime, though, in 1965 he began a second career, that of a singer (at the age of 43), with the help of Simone Signoret and her husband Yves Montand and later with great assistance of the French diva Barbara. Reggiani became one of the most acclaimed performers of French \"Chanson\" (\"song\") and although he was in his 40s, his bad-boy rugged image made him popular with both young and older listeners.\n\nHis best known songs include Les loups sont entrés dans Paris (\"The Wolves Have Entered Paris\") and Sarah (La femme qui est dans mon lit) (\"The Woman Who Is In My Bed\"), the latter written by Georges Moustaki. However, one of his regular songwriters throughout his career was Boris Vian (Le Déserteur, Arthur où t'as mis le corps, La Java des bombes atomiques). His new young fans identified with his left-wing ideals and antimilitarism, most notably during the 1968 student revolts in France. With age he became more and more acclaimed as one of the best interpreters of the French chanson also bringing the poetry of Rimbaud, Apollinaire and Prévert closer to his audience. In 1995, he made a comeback to the singing stage, giving a few concerts despite his deteriorated health and personal distress, the last one being held as late as in the year of his death, in spring of 2004.\n\nIn later life he became a painter and gave a number of exhibitions of his artwork.\n\nSerge Reggiani died in Paris of a heart attack at the age of 82, one day after the death of another well known French singer Sacha Distel. He is interred in Montparnasse Cemetery.",
        "birthday": "1922-05-02",
        "deathday": "2004-07-22",
        "gender": 2,
        "homepage": null,
        "id": 15137,
        "imdb_id": "nm0716577",
        "known_for_department": "Acting",
        "name": "Serge Reggiani",
        "place_of_birth": "Reggio Emilia, Italy",
        "popularity": 0.0774,
        "profile_path": "/7URSpmWp6SDIfLhKoPExc2oueet.jpg"
    }
}