{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/myikoqu8Z2gtE7TaBgk9r6fB9MF.jpg",
                "genre_ids": [
                    18
                ],
                "id": 1040,
                "original_language": "it",
                "original_title": "Il gattopardo",
                "overview": "As Garibaldi's troops begin the unification of Italy in the 1860s, an aristocratic Sicilian family grudgingly adapts to the sweeping social changes undermining their way of life. Proud but pragmatic Prince Don Fabrizio Salina allows his war hero nephew, Tancredi, to marry Angelica, the beautiful daughter of gauche, bourgeois Don Calogero, in order to maintain the family's accustomed level of comfort and political clout.",
                "popularity": 3.1711,
                "poster_path": "/riSUxwoK3xjkOgy6YJSvPhi7cO6.jpg",
                "release_date": "1963-03-27",
                "title": "The Leopard",
                "video": false,
                "vote_average": 7.751,
                "vote_count": 886,
                "character": "Garibaldi's General",
                "credit_id": "52fe42e5c3a36847f802b1d3",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/sU3gFo7Gn67zjtKXIvzJ4omcUbH.jpg",
                "genre_ids": [
                    36,
                    18,
                    12
                ],
                "id": 665,
                "original_language": "en",
                "original_title": "Ben-Hur",
                "overview": "In 25 AD, Judah Ben-Hur, a Jew in ancient Judea, opposes the occupying Roman empire.  Falsely accused by a Roman childhood friend-turned-overlord of trying to kill the Roman governor, he is put into slavery and his mother and sister are taken away as prisoners.",
                "popularity": 5.7433,
                "poster_path": "/m4WQ1dBIrEIHZNCoAjdpxwSKWyH.jpg",
                "release_date": "1959-11-18",
                "title": "Ben-Hur",
                "video": false,
                "vote_average": 7.886,
                "vote_count": 2943,
                "character": "Roman Officer with Messala (uncredited)",
                "credit_id": "5605e7c3c3a368120d0003c8",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Montgomery Wood"
        ],
        "biography": "Giuliano Gemma (2 September 1938 – 1 October 2013) was an Italian actor. He is best known internationally for his work in Spaghetti Westerns, particularly for his performances as the title character in Duccio Tessari's A Pistol for Ringo (1965), Captain Montgomery Brown/'Ringo' in Tessari's The Return of Ringo (1965), the title character in Michele Lupo's Arizona Colt (1966), Scott Mary in Tonino Valerii's Day of Anger (1967) and Michael \"California\" Random in Lupo's California (1977).\n\nBorn in Rome, Gemma first worked as a stuntman, then was offered real acting parts by director Duccio Tessari, starting with the film Arrivano i titani (1962). He also made an appearance in Luchino Visconti's Il Gattopardo as Garibaldi's General. Gemma later went on to star in Spaghetti Westerns in films such as A Pistol for Ringo (Una pistola per Ringo), Blood for a Silver Dollar (Un dollaro bucato), Wanted and Day of Anger (I giorni dell'ira). He was sometimes credited as Montgomery Wood. Giuliano Gemma's career survived the demise of the genre, and he remained active on Italian television.\n\nGemma played in a variety of movies, including art-house offerings such as Valerio Zurlini's The Desert of the Tartars (Il deserto dei tartari) in 1976. The same year, Gemma won a David di Donatello, the Italian equivalent of the Oscar, for his portrayal of Major Matiss in The Desert of Tartars.\n\nGemma also starred in a web comic named \"Man Born Again\" (2012) by Eclypsed Word.\n\nHis daughter, Vera Gemma, is also an actress. Giuliano Gemma also worked as a sculptor.\n\nOn 1 October 2013, Gemma died following a car accident in Cerveteri, near Rome. He was taken to a hospital in Civitavecchia and pronounced dead shortly after his arrival. Two other passengers, a man and his son, were also injured in the accident.\n\nSource: Article \"Giuliano Gemma\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1938-09-02",
        "deathday": "2013-10-01",
        "gender": 2,
        "homepage": null,
        "id": 15139,
        "imdb_id": "nm0312575",
        "known_for_department": "Acting",
        "name": "Giuliano Gemma",
        "place_of_birth": "Rome, Italy",
        "popularity": 0.5243,
        "profile_path": "/hpWbvBhSFklP9rMms1iA5NvXHNZ.jpg"
    }
}