{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fe5a9dB8tylKUpcXq88ioXpNSsm.jpg",
                "genre_ids": [
                    18,
                    35,
                    10749
                ],
                "id": 11971,
                "original_language": "en",
                "original_title": "Much Ado About Nothing",
                "overview": "In this Shakespearean farce, Hero and her groom-to-be, Claudio, team up with Claudio's commanding officer, Don Pedro, the week before their wedding to hatch a matchmaking scheme. Their targets are sharp-witted duo Benedick and Beatrice -- a tough task indeed, considering their corresponding distaste for love and each other. Meanwhile, meddling Don John plots to ruin the wedding.",
                "popularity": 2.2771,
                "poster_path": "/tvltGP6vYOkHdURag0jPSjhPUAV.jpg",
                "release_date": "1993-05-07",
                "title": "Much Ado About Nothing",
                "video": false,
                "vote_average": 6.937,
                "vote_count": 764,
                "character": "Friar Francis",
                "credit_id": "52fe44ad9251416c7503d147",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Jimmy Yuill is an actor, born in 1959, in Golspie, Scotland. He is a member of the Royal Shakespeare Company and later joined the Renaissance Theatre Company. He has appeared in many of Kenneth Branagh's films. His most recent work saw him play the Chief Constable in \"The Raven\"  along side John Cusack. Yuill was also the music composer for A Midwinter's Tale and Swan Song.  Most of his acting work has been in theatre, although he has played police officers on television; he is best remembered for the character Doug Kersey in the British television show Wycliffe.  In June 2006 Jimmy made his first appearance in EastEnders as the recurring character Victor Brown. In October 2007, Yuill took the lead in Sophocles' Antigone as Creon, King of Thebes at The Tron Theatre, Glasgow.  In 2010, he was nominated for the award of Best Male Performance for his role in a play adaption of the Testament of Cresseid by the Critics Award for Theatre in Scotland.",
        "birthday": "1956-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 151797,
        "imdb_id": "nm0950788",
        "known_for_department": "Acting",
        "name": "Jimmy Yuill",
        "place_of_birth": "Golspie, Scotland",
        "popularity": 0.231,
        "profile_path": "/oHsqdz8ImfAQfTnNKNTan0sxa9e.jpg"
    }
}