{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fn4n6uOYcB6Uh89nbNPoU2w80RV.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 315635,
                "original_language": "en",
                "original_title": "Spider-Man: Homecoming",
                "overview": "Following the events of Captain America: Civil War, Peter Parker, with the help of his mentor Tony Stark, tries to balance his life as an ordinary high school student in Queens, New York City, with fighting crime as his superhero alter ego Spider-Man as a new threat, the Vulture, emerges.",
                "popularity": 18.6027,
                "poster_path": "/c24sv2weTHPsmDa7jEMN0m2P3RT.jpg",
                "release_date": "2017-07-05",
                "title": "Spider-Man: Homecoming",
                "video": false,
                "vote_average": 7.329,
                "vote_count": 22490,
                "character": "Sally",
                "credit_id": "576a828cc3a3682206000901",
                "order": 29
            },
            {
                "adult": false,
                "backdrop_path": "/mDfJG3LC3Dqb67AZ52x3Z0jU0uB.jpg",
                "genre_ids": [
                    12,
                    28,
                    878
                ],
                "id": 299536,
                "original_language": "en",
                "original_title": "Avengers: Infinity War",
                "overview": "As the Avengers and their allies have continued to protect the world from threats too large for any one hero to handle, a new danger has emerged from the cosmic shadows: Thanos. A despot of intergalactic infamy, his goal is to collect all six Infinity Stones, artifacts of unimaginable power, and use them to inflict his twisted will on all of reality. Everything the Avengers have fought for has led up to this moment - the fate of Earth and existence itself has never been more uncertain.",
                "popularity": 29.705,
                "poster_path": "/7WsyChQLEftFiDOVTGkv3hFpyyt.jpg",
                "release_date": "2018-04-25",
                "title": "Avengers: Infinity War",
                "video": false,
                "vote_average": 8.235,
                "vote_count": 30938,
                "character": "Sally",
                "credit_id": "5ae0aa1d92514172fb000032",
                "order": 42
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Isabella Amara, an actress and vocalist, was born in Atlanta, Georgia. She's a veteran actress on stage and screen.\n\nIsabella stayed busy in 2015 filming four feature films around the country. She stars in the lead role of \"Claire\" opposite Woody Harrelson and Laura Dern as their biological daughter in Fox Searchlight's upcoming feature film Wilson(2016) written by Daniel Clowes and directed by Craig Johnson. In the spring of 2015, she portrayed the role of 15 year old Michelle Darnell (teen Melissa McCarthy) in Universal's feature film The Boss (2016) directed by Ben Falcone and starring Melissa McCarthy. Isabella filmed the supporting role of Franny in the Indie feature film The Tale(2016) written and directed by Jennifer Fox in the fall of 2015, Isabella's second film with Laura Dern. She wrapped her 2015 year as \"Heidi\" in the CBS film Middle School-Worst Years of My Life (2016). Other feature films of Isabella's include Barely Lethal (2015) starring Samuel L. Jackson, Hailey Steinfeld and directed by Kyle Newman plus Joyful Noise (2012) starring Dolly Parton, Queen Latifah, Jeremy Jordan and directed by Todd Graff.\n\nDuring early elementary school, Isabella's love for acting and music was discovered. Isabella captured lead roles in community theatre and performed with national tours as a kid triple threat actor, singer, and dancer. She transitioned to film and television acting at age ten training in Atlanta, New York and Los Angeles while acting in independent films.\n\nIsabella attended a performing arts high school focusing on vocals and acting. A classically trained vocalist, Isabella has expanded her music performing around Atlanta as a lead singer for a rock band. She continues to train with vocal stylist coach for recording artists in the pop and rock genre too. Her love for singing is matched with her passion for acting.\n\n- IMDb Mini Biography By: C. Fairchild",
        "birthday": "1998-10-09",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1517836,
        "imdb_id": "nm4194645",
        "known_for_department": "Acting",
        "name": "Isabella Amara",
        "place_of_birth": "Atlanta, Georgia, USA",
        "popularity": 0.2883,
        "profile_path": "/hz2uP4Qjucj5my9rLc0FO9aWV2E.jpg"
    }
}