{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/exk2xDI2YT5UHs5Bow79AVRGOnP.jpg",
                "genre_ids": [
                    53,
                    9648,
                    10749
                ],
                "id": 506,
                "original_language": "en",
                "original_title": "Marnie",
                "overview": "Marnie is a thief, a liar, and a cheat. When her new boss, Mark Rutland, catches on to her routine kleptomania, she finds herself being blackmailed.",
                "popularity": 2.9872,
                "poster_path": "/nRRy4VO2A3Py7wiZBPz11PAlogp.jpg",
                "release_date": "1964-07-17",
                "title": "Marnie",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 1176,
                "character": "Racetrack Patron (uncredited)",
                "credit_id": "61e107efbf0f6300411e0484",
                "order": 30
            },
            {
                "adult": false,
                "backdrop_path": "/2L8U8rUyWeFTb6n1egTNeJsEsvj.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749
                ],
                "id": 284,
                "original_language": "en",
                "original_title": "The Apartment",
                "overview": "Bud Baxter is a minor clerk in a huge New York insurance company, until he discovers a quick way to climb the corporate ladder. He lends out his apartment to the executives as a place to take their mistresses. Although he often has to deal with the aftermath of their visits, one night he's left with a major problem to solve.",
                "popularity": 4.4619,
                "poster_path": "/2nt8Z54Bce74ycithkzlSNkgXJB.jpg",
                "release_date": "1960-06-21",
                "title": "The Apartment",
                "video": false,
                "vote_average": 8.2,
                "vote_count": 2472,
                "character": "Bar Patron (uncredited)",
                "credit_id": "62650165202e1108ac7aec53",
                "order": 33
            },
            {
                "adult": false,
                "backdrop_path": "/iItypZVpdnxTFgA0iv345AzMUqk.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 981,
                "original_language": "en",
                "original_title": "The Philadelphia Story",
                "overview": "When a rich woman's ex-husband and a tabloid-type reporter turn up just before her planned remarriage, she begins to learn the truth about herself.",
                "popularity": 6.7871,
                "poster_path": "/dKUubjvxO78XDts6VP1Ggcp4R9O.jpg",
                "release_date": "1940-12-05",
                "title": "The Philadelphia Story",
                "video": false,
                "vote_average": 7.617,
                "vote_count": 914,
                "character": "Wedding Guest (uncredited)",
                "credit_id": "626eaeb2162bc300a82609b2",
                "order": 33
            },
            {
                "adult": false,
                "backdrop_path": "/zAL3LOswagN9onjN8DPcNFTqKuD.jpg",
                "genre_ids": [
                    18
                ],
                "id": 705,
                "original_language": "en",
                "original_title": "All About Eve",
                "overview": "From the moment she glimpses her idol at the stage door, Eve Harrington is determined to take the reins of power away from the great actress Margo Channing. Eve maneuvers her way into Margo's Broadway role, becomes a sensation and even causes turmoil in the lives of Margo's director boyfriend, her playwright and his wife. Only the cynical drama critic sees through Eve, admiring her audacity and perfect pattern of deceit.",
                "popularity": 2.0482,
                "poster_path": "/blBzZaatPWVuWpXEnPscMA4Xp6m.jpg",
                "release_date": "1950-11-09",
                "title": "All About Eve",
                "video": false,
                "vote_average": 8.076,
                "vote_count": 1604,
                "character": "Sarah Siddons Awards Guest (uncredited)",
                "credit_id": "636a4b8be0ec510079cb2aef",
                "order": 41
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Luther Raymond Vestergard was born 2 December 1902 in Chicago, Illinois to Christian Vestergard and Maytha Heckel. Growing up in Chicago, Luther attended local schools. Upon graduating, Luther moved to Los Angeles California where he attended the University of Southern California. At the same time he worked as an assistant deputy probation officer so he could pay his way through college. Luther would move on to Harvard University in Cambridge, Massachusetts to study law. Luther was only able to complete 2 years before running out of money.\n\nReturning to Los Angeles in 1926, Luther started acting, working under the stage name of Paul Power. Initially he appeared in 2 reel silent comedies based on the \"Winnie Winkle, the Bread Winner\" comic strip. The vast majority of his appearances during his career were in a number of supporting and minor roles that extended the rest of his life (over 40 years) taking his career from the days of silent films through the golden age of movies to television. His largest role was in Christian movie \"Oil Town U.S.A.\" where he worked with his friend Billy Graham.\n\nLuther was married twice and divorced twice with no record of having any children. He also took care of his mother(who was bed ridden from a traffic accident) during the last four years of her life.\n\nLuther was also a lay minister serving at different times as assistant pastor and interim pastor for Saint Matthews Lutheran Church. He occasionally conducted services at the local movie studios and funeral services for the Motion Pictures Home in Calabasas, California. He joined the Hollywood Christian Group after it was organized in 1949.\n\nLuther passed away 5 April 1968 at the Hollywood West Hospital.",
        "birthday": "1902-12-07",
        "deathday": "1968-04-05",
        "gender": 2,
        "homepage": null,
        "id": 151891,
        "imdb_id": "nm0694446",
        "known_for_department": "Acting",
        "name": "Paul Power",
        "place_of_birth": "Chicago, Illinois, USA",
        "popularity": 0.0846,
        "profile_path": null
    }
}