{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/am9WwUTZuUDuinVcyST4OxJ8vFs.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 38684,
                "original_language": "en",
                "original_title": "Jane Eyre",
                "overview": "After a bleak childhood, Jane Eyre goes out into the world to become a governess. As she lives happily in her new position at Thornfield Hall, she meet the dark, cold, and abrupt master of the house, Mr. Rochester. Jane and her employer grow close in friendship and she soon finds herself falling in love with him. Happiness seems to have found Jane at last, but could Mr. Rochester's terrible secret be about to destroy it forever?",
                "popularity": 5.4943,
                "poster_path": "/3Cn7D0wEaxnvm8kTta1osNu3QJv.jpg",
                "release_date": "2011-03-11",
                "title": "Jane Eyre",
                "video": false,
                "vote_average": 7.204,
                "vote_count": 1509,
                "character": "Grace Poole",
                "credit_id": "549a0b6192514131320007bf",
                "order": 24
            },
            {
                "adult": false,
                "backdrop_path": "/quVfDYktBYQfojgZ3E9pYrclGse.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 407445,
                "original_language": "en",
                "original_title": "Breathe",
                "overview": "Based on the true story of Robin, a handsome, brilliant and adventurous man whose life takes a dramatic turn when polio leaves him paralyzed.",
                "popularity": 3.8467,
                "poster_path": "/wLu2N0QVfSpk10RJ17HLHyRUmww.jpg",
                "release_date": "2017-10-13",
                "title": "Breathe",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 774,
                "character": "Second Woman",
                "credit_id": "5cd8c2319251412f6bcfb84c",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Rodie Cavaliero",
            "Rosalind Cecilia \"Rosie\" Cavaliero",
            "Rosalind Cecilia Cavaliero"
        ],
        "biography": "British actress Rosie Cavaliero used her versatility to become one of the busiest performers in the television industry. Born in Rio de Janeiro, Brazil,she relocated with her family to England as a child. She made her first screen appearance in the drama \"Medics\" (ITV, 1990-95). She spent the 1990s making guest appearances on television, most notably in a mutli-episdoe role on \"Cold Feet\" (ITV, 1997-2003). The numerous appearances finally paid off when she was cast as one of the leads in the sitcom \"Eyes Down\" (BBC, 2003-04). The show lasted only two seasons but it gave Cavaliero a calling card. The actress went on to star in the comedies \"Feel the Force\" (BBC, 2006) and \"Jam and Jerusalem\" (BBC, 2006-09), and appeared with Claire Foy in the miniseries \"Little Dorrit\" (BBC, 2008). She joined an all-star cast, including Mia Wasikowska and Michael Fassbener, in a critically acclaimed production of \"Jane Eyre\" (BBC, 2011), playing Grace Poole. She continued racking up credits, starring in the crime drama \"Prey\" (ITV, 2014-15), as Detective Sergeant Susan Reinhart, and landing recurring roles on \"Hunderby\" (Sky Atlantic, 2012-15) and \"Unforgotten\" (ITV, 2015- ). She mixed in a comedic role, playing opposite John Cleese and Alison Steadman in \"Hold the Sunset\" (BBC, 2018- ). She later joined Sheridan Smith for the drama \"Cleaning Up\" (ITV, 2019- ), before taking a role that gave her larger exposure in the United States. Cavaliero was cast as housekeeper Elizabeth Cordingley in \"Gentleman Jack\" (BBC/HBO, 2019- ). The series, starring Suranne Jones, 19th Century British landowner Anne Lister, who chronicled her life, including her lesbian romances, in a coded diary.",
        "birthday": "1967-11-27",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.markhamfroggattandirwin.com/clients/rosie-cavaliero/",
        "id": 151949,
        "imdb_id": "nm0146803",
        "known_for_department": "Acting",
        "name": "Rosie Cavaliero",
        "place_of_birth": "Rio de Janeiro, Brazil",
        "popularity": 0.6415,
        "profile_path": "/q9EOEphyrCGhUyDgAhFf00xAlWB.jpg"
    }
}