{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9GHsA3bt6MYW7Cpur91GeVBQKIC.jpg",
                "genre_ids": [
                    28,
                    53,
                    18,
                    12
                ],
                "id": 11893,
                "original_language": "en",
                "original_title": "Runaway Train",
                "overview": "A hardened convict and a younger prisoner escape from a brutal prison in the middle of winter only to find themselves on an out-of-control train with a female railway worker while being pursued by the vengeful head of security.",
                "popularity": 3.3746,
                "poster_path": "/A9pf9KjhqCGthu6PKAKE5E1qRNn.jpg",
                "release_date": "1985-11-15",
                "title": "Runaway Train",
                "video": false,
                "vote_average": 6.965,
                "vote_count": 612,
                "character": "Ranken",
                "credit_id": "52fe449c9251416c7503ac61",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/k1HwxcuoCrKzfZ4UbU1fnNKgXGV.jpg",
                "genre_ids": [
                    18,
                    53,
                    80
                ],
                "id": 9303,
                "original_language": "en",
                "original_title": "Bound",
                "overview": "Corky, a tough female ex-convict working on an apartment renovation in a Chicago building, meets a couple living next door, Caesar, a paranoid mobster, and Violet, his seductive girlfriend, who is immediately attracted to her.",
                "popularity": 5.3461,
                "poster_path": "/nfXU25TsAUsLMTJ6oHlgxPUcUOF.jpg",
                "release_date": "1996-09-13",
                "title": "Bound",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 1006,
                "character": "Mickey Malnato",
                "credit_id": "52fe44e4c3a36847f80b0495",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/y7pnEmBotaowRY0o8V33r4JuRNS.jpg",
                "genre_ids": [
                    18
                ],
                "id": 26617,
                "original_language": "en",
                "original_title": "Five Easy Pieces",
                "overview": "A drop-out from upper-class America picks up work along the way on oil-rigs when his life isn't spent in a squalid succession of bars, motels, and other points of interest.",
                "popularity": 2.248,
                "poster_path": "/xGLkuMWigSPLBvWiENSMlVq56iE.jpg",
                "release_date": "1970-09-12",
                "title": "Five Easy Pieces",
                "video": false,
                "vote_average": 7.123,
                "vote_count": 551,
                "character": "Spicer",
                "credit_id": "52fe450fc3a368484e046087",
                "order": 12
            },
            {
                "adult": false,
                "backdrop_path": "/2q5DeKboc4F2qVlJkoEZHNrSgRp.jpg",
                "genre_ids": [
                    28,
                    16,
                    80,
                    9648,
                    18
                ],
                "id": 14919,
                "original_language": "en",
                "original_title": "Batman: Mask of the Phantasm",
                "overview": "Andrea Beaumont leaves her father to return to Gotham, rekindling an old romance with Bruce Wayne. At the same time, a mysterious figure begins to hunt down Gotham's criminals, wrongly implicating Batman in the murders. Now on the run from the law, Batman must find and stop the culprit, while also navigating his relationship with Andrea.",
                "popularity": 3.8713,
                "poster_path": "/hT4ehUteagUrhUOHAtmYiY7mp5l.jpg",
                "release_date": "1993-12-25",
                "title": "Batman: Mask of the Phantasm",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 1171,
                "character": "Buzz Bronski (voice)",
                "credit_id": "52fe46289251416c7506f179",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/jPdRlbRBHGl2POLLk6Oylbav7ac.jpg",
                "genre_ids": [
                    18,
                    36,
                    12
                ],
                "id": 9549,
                "original_language": "en",
                "original_title": "The Right Stuff",
                "overview": "As the Space Race ensues, seven pilots set off on a path to become the first American astronauts to enter space. However, the road to making history brings forth momentous challenges.",
                "popularity": 23.2079,
                "poster_path": "/btqTjNRxecYgQ1FGfVlLqSSNjz.jpg",
                "release_date": "1983-10-20",
                "title": "The Right Stuff",
                "video": false,
                "vote_average": 7.432,
                "vote_count": 911,
                "character": "Head of Program",
                "credit_id": "58f9d7079251415873008bcf",
                "order": 28
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Character actor John P. Ryan was born on July 30, 1936 in New York City. The son of Irish immigrant parents, Ryan graduated from Rice High School and studied English at the City College of New York, where he first developed an interest in acting. He served six years in the US Army and worked as a welfare investigator prior to pursuing an acting career. John made his film debut in the 1967 comedy \"The Tiger Makes Out.\" He appeared in five pictures for Jack Nicholson; he's especially memorable as male nurse Spicer in \"Five Easy Pieces.\" Manic, pale-eyed and craggy-faced, with an often intense and explosive screen presence, Ryan was frequently cast as nasty villains, hard-boiled police officers, and strict military men. John gave a strong and touching performance in a rare change-of-pace sympathetic role as Frank Davis, the bitter and regretful father of a murderous monster mutant baby in Larry Cohen's excellent \"It's Alive.\" He also portrayed Davis in the okay sequel \"It Lives Again.\" Other notable movie parts include the fanatical Colonel Hardcore in \"Shamus,\" shrewd mob capo Patsy O'Neill in the witty \"Cops and Robbers,\" evil scientist Schneider in \"Futureworld,\" the dogged Lt. Parmental in \"Breathless,\" vicious Irish mobster Joe Flynn in \"The Cotten Club;\" at his ferocious best as sadistic prison Warden Ranken in the powerful \"Runaway Train,\" hateful fascist lunatic Glastenbury in the exciting \"Avenging Force,\" ruthless drug kingpin Nathan White in the cruddy \"Death Wish IV: The Crackdown,\" ramrod high school principal Mr. O'Rourke in the amusing \"Three O'Clock High,\" and lethal robot history teacher Mr. Hardin in \"Class of 1999.\" Among the TV shows Ryan did guest spots on are \"M.A.S.H.,\" \"The Rockford Files,\" \"Hawaii Five-O,\" \"Buck Rogers in the 25th Century,\" \"Starsky &amp; Hutch,\" \"Kojak,\" \"Hart to Hart,\" \"The F.B.I.,\" and \"Miami Vice.\" John had a recurring role on the TV series \"Archer.\" In addition to his film and TV credits, Ryan also appeared in over 90 stage plays. Following his final film appearance in \"Bound,\" John spent his later years giving acting lessons and was an advocate of spiritual healing. John P. Ryan died from a stroke at age 70 on March 20, 2007 in Los Angeles, California; he's survived by two daughters.",
        "birthday": "1936-07-30",
        "deathday": "2007-03-20",
        "gender": 2,
        "homepage": null,
        "id": 15213,
        "imdb_id": "nm0752636",
        "known_for_department": "Acting",
        "name": "John P. Ryan",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.5121,
        "profile_path": "/6WV5Sv2YnFG0W1rVnxOxpLyIFUM.jpg"
    }
}