{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4PPC7fKClu0u7NTbo5xgV4vb5VD.jpg",
                "genre_ids": [
                    80,
                    27,
                    9648
                ],
                "id": 4232,
                "original_language": "en",
                "original_title": "Scream",
                "overview": "A year after the murder of her mother, a teenage girl is terrorized by a masked killer who targets her and her friends by using scary movies as part of a deadly game.",
                "popularity": 10.8717,
                "poster_path": "/lr9ZIrmuwVmZhpZuTCW8D9g0ZJe.jpg",
                "release_date": "1996-12-20",
                "title": "Scream",
                "video": false,
                "vote_average": 7.42,
                "vote_count": 7446,
                "character": "Dewey Riley",
                "credit_id": "52fe43b3c3a36847f8068f93",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/orXMq2jZy8wFmePv7zXS2Kor7Ug.jpg",
                "genre_ids": [
                    37,
                    27,
                    18
                ],
                "id": 294963,
                "original_language": "en",
                "original_title": "Bone Tomahawk",
                "overview": "During a shootout in a saloon, Sheriff Hunt injures a suspicious stranger. The doctor's assistant, wife of the local foreman, tends to him in prison. That night, the town is attacked and they both disappear—only the arrow of a cannibal tribe is found. Hunt and a few of his men go in search of the prisoner and the foreman's wife.",
                "popularity": 3.529,
                "poster_path": "/4MmTHpn2Y8emqvBgvOjufImUmKZ.jpg",
                "release_date": "2015-10-23",
                "title": "Bone Tomahawk",
                "video": false,
                "vote_average": 6.871,
                "vote_count": 2382,
                "character": "Purvis",
                "credit_id": "54cd49c4925141474b001d64",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "دیوید آرکت"
        ],
        "biography": "David Arquette (born September 8, 1971) is an American actor, former professional wrestler, director, producer, and fashion designer. In acting, he is best known for his role as Dewey Riley in the slasher film franchise Scream, for which he won a Teen Choice Award and two Blockbuster Entertainment Awards. As a professional wrestler, he is best remembered for his 2000 stint in World Championship Wrestling (WCW), where he won the WCW World Heavyweight Championship and headlined the Slamboree pay-per-view event; he has received praise in recent times for his work on the independent circuit.\n\nA member of the Arquette acting family, he first became known during the mid-1990s after starring in several Hollywood films aside from the Scream franchise, such as Wild Bill, Never Been Kissed, Buffy the Vampire Slayer, See Spot Run and Eight Legged Freaks. He has since had several television roles, such as Jason Ventress on ABC's In Case of Emergency. Arquette has also voiced Skully on the Disney Channel animated series Jake and the Never Land Pirates, and executive produced the game show Celebrity Name Game, for which he received a Daytime Emmy Award nomination.\n\nDescription above from the Wikipedia article David Arquette, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1971-09-08",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 15234,
        "imdb_id": "nm0000274",
        "known_for_department": "Acting",
        "name": "David Arquette",
        "place_of_birth": "Winchester, Virginia, USA",
        "popularity": 0.8059,
        "profile_path": "/8J68lAEKjx5z2Aj7hhDtQ2YQffv.jpg"
    }
}