{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wCcz89uLIjZ7PKwGvrsQTz0vqe2.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 14292,
                "original_language": "en",
                "original_title": "Miracle",
                "overview": "When college coach Herb Brooks is hired to helm the 1980 U.S. men's Olympic hockey team, he brings a unique and brash style to the ice. After assembling a team of hot-headed college all-stars, who are humiliated in an early match, Brooks unites his squad against a common foe: the heavily-favored Soviet team.",
                "popularity": 2.328,
                "poster_path": "/mxtej2th8t8x0ufVBTyhsO6Htxj.jpg",
                "release_date": "2004-02-06",
                "title": "Miracle",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 630,
                "character": "Self (archive footage)",
                "credit_id": "6775f5cf194b5816d7614f1a",
                "order": 23
            },
            {
                "adult": false,
                "backdrop_path": "/8rBBojmT5vwkuVh2hFWBkbWtlBX.jpg",
                "genre_ids": [
                    36,
                    18
                ],
                "id": 10139,
                "original_language": "en",
                "original_title": "Milk",
                "overview": "The true story of Harvey Milk, the first openly gay man ever elected to public office. In San Francisco in the late 1970s, Harvey Milk becomes an activist for gay rights and inspires others to join him in his fight for equal rights that should be available to all Americans.",
                "popularity": 4.1614,
                "poster_path": "/ot4ImF4b7QbS6XsTdMH3pWxNmX2.jpg",
                "release_date": "2008-11-05",
                "title": "Milk",
                "video": false,
                "vote_average": 7.24,
                "vote_count": 2295,
                "character": "Self (archive footage)",
                "credit_id": "6775f5e4dd179c5b35927e81",
                "order": 36
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Gov. Jerry Brown"
        ],
        "biography": "Edmund Gerald Brown Jr. (born April 7, 1938) is an American lawyer, author, and politician who served as the 34th and 39th governor of California from 1975 to 1983 and 2011 to 2019. A member of the Democratic Party, he was elected secretary of state of California in 1970; Brown later served as mayor of Oakland from 1999 to 2007 and attorney general of California from 2007 to 2011. He was both the oldest and sixth-youngest governor of California due to the 28-year gap between his second and third terms. Upon completing his fourth term in office, Brown became the fourth longest-serving governor in U.S. history, serving 16 years and 5 days in office.\n\nBorn in San Francisco, he is the son of Bernice Layne Brown and Pat Brown, who was the 32nd governor of California (1959–1967). After graduating from the University of California, Berkeley and Yale Law School, he practiced law and began his political career as a member of the Los Angeles Community College District Board of Trustees (1969–1971). He was elected to serve as the 23rd secretary of state of California from 1971 to 1975. At 36, Brown was elected to his first term as governor in 1974, making him the youngest California governor in 111 years. In 1978, he won his second term. During his governorship, Brown ran unsuccessfully as a candidate for the Democratic presidential nomination in 1976 and 1980. He declined to pursue a third term as governor in 1982, instead making an unsuccessful run for the United States Senate that same year, losing to San Diego mayor and future governor Pete Wilson.\n\nAfter traveling abroad, Brown returned to California and served as the sixth Chairman of the California Democratic Party (1989–1991), attempting to run for U.S. president once more in 1992 but losing the Democratic primary to Bill Clinton. He then moved to Oakland, where he hosted a talk radio show; Brown soon returned to public life, serving as mayor of Oakland (1999–2007) and attorney general of California (2007–2011). He ran for his third and fourth terms as governor in 2010 and 2014, his eligibility to do so having stemmed from California's constitutional grandfather clause. On October 7, 2013, he became the longest-serving governor in the history of California, surpassing Earl Warren.",
        "birthday": "1938-04-07",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.jerrybrown.org",
        "id": 1523611,
        "imdb_id": "nm0113831",
        "known_for_department": "Acting",
        "name": "Jerry Brown",
        "place_of_birth": "San Francisco, California, USA",
        "popularity": 0.1176,
        "profile_path": "/sUKx5FbiVEUqpxQ2hHmRxlyvhCY.jpg"
    }
}