{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8WIufsaJgm7VWgAc5ALWdJ8v2kB.jpg",
                "genre_ids": [
                    14,
                    27,
                    35
                ],
                "id": 766,
                "original_language": "en",
                "original_title": "Army of Darkness",
                "overview": "Ash, a handsome, shotgun-toting, chainsaw-armed department store clerk, is time warped backwards into England's Dark Ages, where he romances a beauty and faces legions of the undead.",
                "popularity": 4.8105,
                "poster_path": "/xsgTuAtR2zSH8Umg3jWZcZjlDpe.jpg",
                "release_date": "1992-10-31",
                "title": "Army of Darkness",
                "video": false,
                "vote_average": 7.255,
                "vote_count": 3336,
                "character": "Wench (uncredited)",
                "credit_id": "5f809b90d8e15a003be4c58a",
                "order": 41
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Lisa Michelle Axelrod is best known for blockbuster action-adventure films & music videos of the 1980's, but began her career as a music photo journalist in Cleveland, OH in 1982 at 14 for The Iron Planet a long gone Metal Newspaper. Moving to Phoenix in 1985 at 17 to attend college, Lisa took a job at The Mason Jar, an infamous rock club where she became friends with most of the bands we know & love today. In 1986 now 18, Lisa transferred to College in Los Angeles and began interviewing & shooting for Music Connection, leaving in 1987 when RIP Magazine launched \"The RIP Girls\" for live promotions & charity events. Leading to the now infamous documentary \"The Metal Years\", filmed at The Cathouse, which opened on her birthday 1986. For 3 years Lisa was everywhere, till a tragic accident on Mother's Day 1989 on Sunset, took her career & nearly her life. A month before her college graduation and the premiere of \"Roadhouse\" for MGM. While in recovery, her fiance passed away from pancreatic cancer compelling Lisa to take a hiatus from the business in order to spiritually regroup in Hawaii. After returning to Los Angeles in 2008 Lisa completed her Master's Degree in Psychology at Pepperdine University and is now working toward her Media Psychology PhD in Miami, Florida where she resides with a rescue Chihuahua mix named George Lucas. Lisa dedicates her spare time mentoring women on her non-profit advisory board, participating in community based art projects and advocating for environmental justice within the state of Florida.",
        "birthday": "1967-09-23",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.backstage.com/u/lisa-michelle-axelrod/",
        "id": 1525432,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Lisa Michelle Axelrod",
        "place_of_birth": "Shaker Heights, Ohio, USA",
        "popularity": 0.087,
        "profile_path": "/cKhMQYQZYPZh6XuphLhdZ9IwZQn.jpg"
    }
}