{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4kIRrW1AlHP5Idne8CPHeQt8nR5.jpg",
                "genre_ids": [
                    16,
                    10751,
                    35,
                    14
                ],
                "id": 550205,
                "original_language": "en",
                "original_title": "Wish Dragon",
                "overview": "Determined teen Din is longing to reconnect with his childhood best friend when he meets a wish-granting dragon who shows him the magic of possibilities.",
                "popularity": 6.0287,
                "poster_path": "/lnPf6hzANL6pVQTxUlsNYSuhT5l.jpg",
                "release_date": "2021-01-15",
                "title": "Wish Dragon",
                "video": false,
                "vote_average": 7.88,
                "vote_count": 1407,
                "character": "Additional Voices (voice)",
                "credit_id": "643aa6b1091e6204d35e2ba7",
                "order": 28
            },
            {
                "adult": false,
                "backdrop_path": "/jXk3ZMq7n4ugOqKYq0CtMn3gia8.jpg",
                "genre_ids": [
                    10751,
                    16,
                    12,
                    35
                ],
                "id": 431580,
                "original_language": "en",
                "original_title": "Abominable",
                "overview": "A group of misfits encounter a young Yeti named Everest, and they set off to reunite the magical creature with his family on the mountain of his namesake.",
                "popularity": 5.3314,
                "poster_path": "/llhj3xtNes2Ri4d9HqtleKo1CfL.jpg",
                "release_date": "2019-09-19",
                "title": "Abominable",
                "video": false,
                "vote_average": 7.455,
                "vote_count": 2108,
                "character": "Goon (voice)",
                "credit_id": "5ea441713faba00025461b74",
                "order": 20
            },
            {
                "adult": false,
                "backdrop_path": "/htBUhLSS7FfHtydgYxUWjL3J1Q1.jpg",
                "genre_ids": [
                    16,
                    12,
                    10751,
                    14
                ],
                "id": 560050,
                "original_language": "en",
                "original_title": "Over the Moon",
                "overview": "Fueled by memories of her mother, resourceful Fei Fei builds a rocket to the moon on a mission to prove the existence of a legendary moon goddess.",
                "popularity": 5.5592,
                "poster_path": "/lG0TF0wj1n9p9CPy5xlIUIkF56a.jpg",
                "release_date": "2020-10-16",
                "title": "Over the Moon",
                "video": false,
                "vote_average": 7.198,
                "vote_count": 1340,
                "character": "Photographed Mother (voice)",
                "credit_id": "5f92e36cf96a390036831fad",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Elizabeth Pan was born and raised in the Los Angeles suburb of Thousand Oaks, California where she grew up learning to speak both English and Mandarin Chinese at the same time. Elizabeth’s auspicious stage career started in the 5th Grade when she played the posterior end of Nana the Dog in Westlake Elementary’s production of “Peter Pan.”  It could only go up from there.\n\nIn her junior year at UCLA, Elizabeth attended a production of Miss Saigon at Los Angeles’ premier theater company, Center Theatre Group and signed up for acting lessons the next day.  Elizabeth studied classical theater at the Royal National Theatre in London, the American Conservatory Theater in San Francisco and The Antaeus Company in Los Angeles.  A few years later, Elizabeth was back at Center Theater Group but this time as a lead actor in the critically acclaimed production of Jessica Hagedorn’s “Dogeaters” at the Kirk Douglas Theater. \n\nShe has worked on some of the most prestigious stages in Southern California.  The LA Weekly theatre critic said of her performance in Chay Yew’s adaptation of The Cherry Orchard, “I can not remember anything in theatre as heartbreaking…Pan’s eyes are glistening pieces of obsidian and her wounded silence is unbearable.”  Elizabeth originated the lead role of Chinadoll in Damon Chua’s “Film Chinois” which won the 2007 Ovation Award for Best New Play.  Elizabeth currently works extensively in film, television, stage, commercials and voiceovers.  You have seen her in guest star and co-star roles on FOX, NBC, ABC and CBS.  Her voice is on various commercials, television shows, films and video games including “Penguins of Madagascar (Dreamworks)”, “ The Regular Show (The Cartoon Network)”, and “Mr. Robot (USA Network)”.  Elizabeth can be seen on national commercials including Progressive Insurance, HSBC and Canada Dry.  She loves hiking in the mountains around her home in Los Angeles, cooking for other people, especially if vegan food is involved and is plotting world domination through real estate.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.elizabethpan.com/",
        "id": 1525065,
        "imdb_id": "nm0659004",
        "known_for_department": "Acting",
        "name": "Elizabeth Pan",
        "place_of_birth": "Thousand Oaks, California, United States",
        "popularity": 0.0932,
        "profile_path": "/oVotD5j8ReC9qioPtTZ2tIyP79j.jpg"
    }
}