{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gkyYZSevVI6zbGrLDmSo9Im88Qv.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 10322,
                "original_language": "en",
                "original_title": "Being There",
                "overview": "A simple-minded gardener named Chance has spent all his life in the Washington D.C. house of an old man. When the man dies, Chance is put out on the street with no knowledge of the world except what he has learned from television.",
                "popularity": 2.5453,
                "poster_path": "/3RO3jbCKEey2T9bYFkYt9xpwen9.jpg",
                "release_date": "1979-12-19",
                "title": "Being There",
                "video": false,
                "vote_average": 7.613,
                "vote_count": 1046,
                "character": "Kaufman",
                "credit_id": "543b41ddc3a368199c0044fb",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "The son of a Dallas wholesale coal dealer, Noble spent much of his youth attending pool halls and movie houses. He retained his expertise with a pool cue throughout his life, while his stronger interest in acting (fueled by movies) manifested itself in local stage productions and drama studies at Southern Methodist University. Following Navy service in World War II, Noble went to New York to study at the Actors Studio, then went on to a stage revival of Pygmalion wherein he met his future wife, actress Carolyn Coates. The actor appeared on such TV soap operas as As the World Turns (1956), A World Apart (1970) and such Broadway productions as \"1776\" (a role he took to the movie 1776 (1972)), spending much of his spare time in psychotherapy to handle his ongoing feelings of self-doubt. In films from the mid '70s, Noble principally played small roles as authority figures and politicians (Being There (1979), The Nude Bomb (1980)), with occasional larger roles. such as Bo Derek's father in 10 (1979). In 1979, Noble was cast as the genially absent-minded \"Governor Gene Gatling\" on the sitcom, Benson (1979), a role in which he remained until the series' 1986 cancellation. Two years later, he resurfaced on TV in the role of a Nebraska-based recording engineer on the very short-lived sitcom, First Impressions (1988).",
        "birthday": "1922-03-05",
        "deathday": "2016-03-28",
        "gender": 2,
        "homepage": null,
        "id": 152699,
        "imdb_id": "nm0633595",
        "known_for_department": "Acting",
        "name": "James Noble",
        "place_of_birth": "Dallas, Texas, USA",
        "popularity": 0.167,
        "profile_path": "/wx6flzyPDZrYZ0ppMCc4upV50JX.jpg"
    }
}