{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lSH1j2uChyuxKmslXRf1AGyi43p.jpg",
                "genre_ids": [
                    37,
                    18
                ],
                "id": 8879,
                "original_language": "en",
                "original_title": "Pale Rider",
                "overview": "A mysterious preacher protects a humble prospector village from a greedy mining company trying to encroach on their land.",
                "popularity": 4.4673,
                "poster_path": "/kpAN5WnDEVWYzMDPkXHTbrDQuak.jpg",
                "release_date": "1985-06-28",
                "title": "Pale Rider",
                "video": false,
                "vote_average": 7.167,
                "vote_count": 1132,
                "character": "Ma Blankenship",
                "credit_id": "53a2e470c3a36831fc00146d",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/yQtFsAby716b8JMlGls9Suzs87z.jpg",
                "genre_ids": [
                    18
                ],
                "id": 1367,
                "original_language": "en",
                "original_title": "Rocky II",
                "overview": "After Rocky goes the distance with champ Apollo Creed, both try to put the fight behind them and move on. Rocky settles down with Adrian but can't put his life together outside the ring, while Creed seeks a rematch to restore his reputation. Soon enough, the \"Master of Disaster\" and the \"Italian Stallion\" are set on a collision course for a climactic battle that is brutal and unforgettable.",
                "popularity": 6.7493,
                "poster_path": "/nMaiiu0CzT77U4JZkUYV7KqdAjK.jpg",
                "release_date": "1979-06-15",
                "title": "Rocky II",
                "video": false,
                "vote_average": 7.281,
                "vote_count": 4584,
                "character": "Adrian's Nurse (uncredited)",
                "credit_id": "5e7297c42f3b1700194b6787",
                "order": 47
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "​From Wikipedia, the free encyclopedia.  \n\nFran Ryan (November 29, 1916 – January 15, 2000) was an American character actress featured in television and films. She was born in Los Angeles, California.\n\nFran Ryan began performing at the age of 6, at Oakland's Henry Duffy Theatre, in Northern California. She attended Stanford University for three years, and during World War II was a member of the USO entertaining troops. She performed comedy, singing and acting on stage in California and Chicago but was not to launch her television career for two decades. Her small screen debut came in an episode on Television's Batman, in 1966, followed by a bit part in Beverly Hillbillies. Ryan's best known television role was as Aggie Thompson in The Doris Day Show (in its first incarnation plotline theme), though the gig only lasted a few months. This role was cut short because she was offered the 'replacement' role on the hit series Green Acres as Doris Ziffel from 1969-1971. Fran was to replace Barbara Pepper, who by then was in poor health. Sadly, Miss Pepper died just five months later of heart ailments, on July 15, 1969.\n\nRyan also starred on the long running TV Western series Gunsmoke during its twentieth and final season as Miss Hannah (Cobb). In 1987, she reprised the role of Miss Hannah in the TV movie Gunsmoke: Return to Dodge.\n\nFran Ryan played the role of Sister Agatha in the soap opera General Hospital in (1979). She also did voices for cartoons such as Hong Kong Phooey, Mister T and Little Dracula. Fran starred on some TV shows for children like Sigmund and the Sea Monsters in 1975 as Gertrude Grouch, and in 1970s children's show The New Zoo Revue as Ms. Goodbody, the 1980s TV series No Soap, Radio as Mrs. Belmont, the short lived 1980s CBS TV series The Wizard as Tillie Russell from 1986-1987. Her last regular TV role was on The Dave Thomas Comedy Show.\n\nShe starred in many feature films, including Flush (1977), Big Wednesday (1978), Take This Job and Shove It (1981), Pale Rider (1985), Chances Are, and in her scene-stealing cameo in 1981's Stripes, as a tortured cab fare to Bill Murray as the cabbie, in the opening scenes of the comedy film.\n\nRyan made guest appearances on TV shows ranging from Batman, Adam-12, CHiPs, Quantum Leap, Night Court, Baywatch to The Commish.\n\nFran Ryan was often compared to actress Marjorie Main; they looked similar to one another. Ryan died on January 15, 2000, at age 83. She is buried in the family plots alongside her mother, at the Holy Sepulchre Catholic Cemetery, in Hayward, California.\n\nDescription above from the Wikipedia article Fran Ryan, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1916-11-29",
        "deathday": "2000-01-15",
        "gender": 1,
        "homepage": null,
        "id": 152670,
        "imdb_id": "nm0752539",
        "known_for_department": "Acting",
        "name": "Fran Ryan",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.3609,
        "profile_path": "/lrbyK3AYrxhmMMnT6yjmjplZ9ri.jpg"
    }
}