{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yFkUPqBuUnbhYbQL8VFpTrAT9za.jpg",
                "genre_ids": [
                    18,
                    878,
                    9648
                ],
                "id": 686,
                "original_language": "en",
                "original_title": "Contact",
                "overview": "A radio astronomer receives the first extraterrestrial radio signal ever picked up on Earth. As the world powers scramble to decipher the message and decide upon a course of action, she must make some difficult decisions between her beliefs, the truth, and reality.",
                "popularity": 6.2788,
                "poster_path": "/bCpMIywuNZeWt3i5UMLEIc0VSwM.jpg",
                "release_date": "1997-07-11",
                "title": "Contact",
                "video": false,
                "vote_average": 7.434,
                "vote_count": 4710,
                "character": "Japanese Tech #1",
                "credit_id": "5908c9b7925141646c010904",
                "order": 73
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From an early age Mak Takano was heavily influenced by the work of the legendary Japanese film icon, Ken Takakura. Mak had the privilege of being invited by his mentor, Ken-san, to the screenings of his films such as \"Antartica\", \"Eki (Station)\", and many others.\n\nMak got his start in Hollywood movies in 1988, soon after graduating from the University of Redlands in California, where he got his Masters degree.\n\nBy fate, his first acting job was to be in Ridely Scott's \"Black Rain\" (Paramount), starring Michael Douglas, Andy Garcia, and mentor Ken Takakura. Mak auditioned for director Ridley Scott in L.A. and was able to surprise Ken-san on the set as a Yakuza (Japanese gangster).\n\nMak's acting career continued with a pivotal recurring role on the groundbreaking TV series \"Twin Peaks\" for director David Lynch.\n\nIn 1992, Mak landed a co-starring role in the Tom Selleck vehicle \"Mr. Baseball\" (Universal) for director Fred Schepisi. Destiny would have it that the film again co-starred the great Ken Takakura!\n\nThe following year, Mak co-starred in the hit movie, \"Teenage Mutant Ninja Turtles III\" (New Line Cinema). Other notable roles include Robert Zemeckis' sci-fi thriller \"Contact\" (Warner Bros), starring Jodie Foster, Mathew McConaughey, Angela Bassett and John Hurt. And guest appearances on hit TV series \"Alias\" and \"Sabrina, The Teenage Witch\".\n\nMak has had classical training in London, England, and has studied with the late Herbert Berghof at HB Studio in New York City. Mak also works with several top acting coaches in Los Angeles. Mak's extensive Martial Arts, and MMA background makes him the go to Asian face of Hollywood!",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.maktakano.com/",
        "id": 152783,
        "imdb_id": "nm0847342",
        "known_for_department": "Acting",
        "name": "Mak Takano",
        "place_of_birth": "Nihonbashi, Tokyo, Japan",
        "popularity": 0.0775,
        "profile_path": "/lG7YJcESHknEZd3ukzBO3jkrGwh.jpg"
    }
}