{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/oXs8kp1oX5N0Mte6U8UUAwmLwt6.jpg",
                "genre_ids": [
                    28,
                    12,
                    878,
                    53
                ],
                "id": 154,
                "original_language": "en",
                "original_title": "Star Trek II: The Wrath of Khan",
                "overview": "The starship Enterprise and its crew is pulled back into action when old nemesis, Khan, steals a top secret device called Project Genesis.",
                "popularity": 3.0596,
                "poster_path": "/uPyLsKl8Z0LOoxeaFXsY5MxhR5s.jpg",
                "release_date": "1982-06-04",
                "title": "Star Trek II: The Wrath of Khan",
                "video": false,
                "vote_average": 7.446,
                "vote_count": 2015,
                "character": "Khan's Crewman #1",
                "credit_id": "664066e78335e15ace67b672",
                "order": 22
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Shlomo Goldberg"
        ],
        "biography": "Bond was born Shlomo Goldberg in Haifa, Israel of a Romanian-born mother and a Hungarian-born father who had emigrated to Israel.He was a child actor who starred in Tarzan and the Jungle Boy,  a 1968 release. He recreated himself in America in the early 1980s  after doing his mandatory military service for the state of Israel. He became a daytime television actor on General Hospital. In 1984 Bond posed bare-chested for a pin-up wall poster.\n\nHe married in 1982 and had a daughter. In 1989, he joined the cast of daytime drama Santa Barbara as Mack Blake where he stayed for one year only. Later, he starred as a seductive but evil vampire in the movies To Die For and Son of Darkness: To Die For II (1991).\n\n1988 marked the year of Bond's breakthrough on to the Big Screen in his acclaimed theatrical role as Travis Abilene in the Andy Sidaris classic Picasso Trigger.\n\nBorn Jewish, he later embraced Christianity, describing himself as a \"Christian Jew\".",
        "birthday": "1953-04-22",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 152705,
        "imdb_id": "nm0094047",
        "known_for_department": "Acting",
        "name": "Steve Bond",
        "place_of_birth": "Haifa, Israel",
        "popularity": 0.2692,
        "profile_path": "/5zvpeJ57n7MdJQuTid5OroZ1xgr.jpg"
    }
}