{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8WIufsaJgm7VWgAc5ALWdJ8v2kB.jpg",
                "genre_ids": [
                    14,
                    27,
                    35
                ],
                "id": 766,
                "original_language": "en",
                "original_title": "Army of Darkness",
                "overview": "Ash, a handsome, shotgun-toting, chainsaw-armed department store clerk, is time warped backwards into England's Dark Ages, where he romances a beauty and faces legions of the undead.",
                "popularity": 4.8105,
                "poster_path": "/xsgTuAtR2zSH8Umg3jWZcZjlDpe.jpg",
                "release_date": "1992-10-31",
                "title": "Army of Darkness",
                "video": false,
                "vote_average": 7.255,
                "vote_count": 3335,
                "character": "Girl in S-Mart (uncredited)",
                "credit_id": "5dc5a986470ead001890e413",
                "order": 38
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "آنجلا فدرستون"
        ],
        "biography": "Angela Eileen Featherstone (born 3 April 1965) is a Canadian actress, writer, director, and advocate for children in foster care. She was born and raised in Hamilton, Ontario. Within a year of emancipating herself from foster care at age 17, Featherstone became Canada's top model when her September Flare magazine cover broke all previous records for sales. She quickly expanded upon her success and left for New York, where she signed with the illustrious Click models and later would be one of the first models signed to Next. She would travel the world in the 80s as a top fashion model.\n\nFor acting, she downplayed her striking features to play unlikely roles, emerging as a versatile actress. She is best known for playing the Maid on Seinfeld, Chloe in Friends, and Robbie's fiancée Linda in The Wedding Singer. Most recently, she played the role of Maggie on Showtime's Ray Donovan and Jame on HBO's Girls. Featherstone has created sitcoms for Sony, DreamWorks, and NBC television and has written nonfiction for Time, Jane, Flare, Huffington Post, Dame, and Zoomer. Her essay about childhood trauma, \"God Said No\", was published in the 2014 edition of Gargoyle magazine and nominated for the Pushcart Prize. In 2021, she published the essay \"Forgiveness\" in Dame magazine. An alumnus of UCLA Extension Writer's Program \"Personal Essay & Memoir,\" she is completing her memoir. In 2022, Featherstone began directing with her debut seven-minute film, L'Étranger. As a director, she combines into a movement of aesthetic bliss her years of experience in fashion as a model, working with important photographers and magazines (such as Italian, French, and American Vogue; Mademoiselle; Seventeen; Sassy; Harper's Bazaar Italia; Grazia; Harpers & Queens; Albert Watson; Bruce Weber; & Irving Penn), her love of cinema and decades in the film industry, a refined sense of story as an oft published essayist, her passion for philosophy, and a love of creating safe spaces for collaboration.  Featherstone, a committed advocate for children in foster care, volunteered with the Children's Action Network, curating their Heart Gallery from 2011 to 2019, and served on their Winter Wonderland committee in 2014 and 2015. She also mentored a child in foster care through Kidsave from 2011 to 2020. She has described suffering physical, emotional, and sexual abuse when she herself was a foster child. In 2021, she founded the nonprofit healing school for youth aging out of foster care, Fosteringcare.org. Through this trauma-healing intensive and healing-trade program, she and the founding board members hope to impact the brutal statistics for this extraordinarily vulnerable demographic. In 2014, she lectured at the ICAN Nexus Conference on Violence Within the Home and its Effects on Children. She continues to lecture and write about healing PTSD, child abuse, human trafficking, and intimacy. Her 2015 essay on child sex trafficking for DAME was picked up by Salon.com and MSN and was read by over seven million viewers. Since 2009, she has studied moral and spiritual psychology with Rabbi Mordecai Finley, Ph.D. She served as a consultant on Cracked Up, a Netflix documentary about the effects and healing of trauma",
        "birthday": "1965-04-03",
        "deathday": null,
        "gender": 1,
        "homepage": "https://fosteringcare.org/",
        "id": 15276,
        "imdb_id": "nm0004911",
        "known_for_department": "Acting",
        "name": "Angela Featherstone",
        "place_of_birth": "Hamilton, Ontario, Canada",
        "popularity": 0.5093,
        "profile_path": "/b9AHQJW7N2UNTGY7mVxj2Eg1QbE.jpg"
    }
}