{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sLjeApi5odpyEoCzAnbr5DycL3z.jpg",
                "genre_ids": [
                    12,
                    35,
                    14,
                    10751,
                    18
                ],
                "id": 381289,
                "original_language": "en",
                "original_title": "A Dog's Purpose",
                "overview": "A dog goes on quest to discover his purpose in life over the course of several lifetimes with multiple owners.",
                "popularity": 6.9571,
                "poster_path": "/3jcNvhtVQe5Neoffdic39fRactM.jpg",
                "release_date": "2017-01-19",
                "title": "A Dog's Purpose",
                "video": false,
                "vote_average": 7.639,
                "vote_count": 3434,
                "character": "Adult Hannah",
                "credit_id": "56b40abb9251410aab000df1",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/g5G19q0xgkzWEvfcGo1KcL8nQOk.jpg",
                "genre_ids": [
                    18,
                    9648,
                    27
                ],
                "id": 1923,
                "original_language": "en",
                "original_title": "Twin Peaks: Fire Walk with Me",
                "overview": "In the questionable town of Deer Meadow, Washington, FBI Agent Desmond inexplicably disappears while hunting for the man who murdered a teen girl. The killer is never apprehended, and, after experiencing dark visions and supernatural encounters, Agent Dale Cooper chillingly predicts that the culprit will claim another life. Meanwhile, in the more cozy town of Twin Peaks, hedonistic beauty Laura Palmer hangs with lowlifes and seems destined for a grisly fate.",
                "popularity": 9.8063,
                "poster_path": "/rol5H6loAojd6tH2VXQYEXzGQk1.jpg",
                "release_date": "1992-06-03",
                "title": "Twin Peaks: Fire Walk with Me",
                "video": false,
                "vote_average": 7.392,
                "vote_count": 2083,
                "character": "Norma Jennings",
                "credit_id": "593ca3ba92514105930158b1",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "페기 립튼"
        ],
        "biography": "Peggy Lipton (August 30, 1946 – May 11, 2019) was an American actress and model who rose to fame in the late 1960s. She is best known for two major television roles: Julie Barnes on \"The Mod Squad\" (1968-1973) and Norma Jennings on \"Twin Peaks\" (1990-1991, 2017).  Born Margaret Ann Lipton in New York City, she grew up in a middle-class Jewish family on Long Island. She began modeling at age 15 and signed with Ford Agency. Her early struggles with stuttering led her to become introverted, though she found that acting helped her overcome this challenge.\n\nHer breakthrough came with \"The Mod Squad,\" where she played Julie Barnes, one of three hippie undercover cops. The show was groundbreaking for its time, addressing contemporary social issues and featuring an interracial cast. Her performance earned her four Emmy nominations and a Golden Globe Award.\n\nIn 1974, Lipton married music producer Quincy Jones, making them one of the most prominent interracial couples in the entertainment industry at that time. They had two daughters: Kidada Jones (born 1974) and Rashida Jones (born 1976).\n\nAfter marrying Jones, Lipton largely stepped away from acting to focus on her family. They divorced in 1989.\n\nShe returned to acting, performing in many TV roles, including Norma Jennings in David Lynch's Twin Peaks.\n\nShe passed away in 2019 at age 72 from colon cancer. Her memoir \"Breathing Out\" (2005) detailed her life experiences, including her battles with anxiety and her journey in the entertainment industry.\n\nLipton is remembered as a cultural icon of the 1960s and early 1970s, particularly for her role in \"The Mod Squad,\" which helped break down racial barriers on television.",
        "birthday": "1946-08-30",
        "deathday": "2019-05-11",
        "gender": 1,
        "homepage": null,
        "id": 152759,
        "imdb_id": "nm0005152",
        "known_for_department": "Acting",
        "name": "Peggy Lipton",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.851,
        "profile_path": "/kInR5Xfd2NqoxshUitOmM8Qr7SA.jpg"
    }
}