{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4VgiVdd2I3AktHkOpCeSjtP4t8b.jpg",
                "genre_ids": [
                    18
                ],
                "id": 24469,
                "original_language": "en",
                "original_title": "Fish Tank",
                "overview": "Fifteen-year-old Mia is in a constant state of war with her family and the world around her. When she meets her party-girl mother’s charming new boyfriend Connor, she is amazed to find he returns her attention, and believes he might help her start to make sense of her life.",
                "popularity": 2.3023,
                "poster_path": "/rI3MKBDsWzQHi9PWDAMKkgmYcff.jpg",
                "release_date": "2009-09-11",
                "title": "Fish Tank",
                "video": false,
                "vote_average": 6.937,
                "vote_count": 889,
                "character": "Kelly",
                "credit_id": "56c502fcc3a3680d44000d3a",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Joanna Horton is an English actress, notable for her stage and television work, including an episode of Robin Hood (series 1 episode 4), Father Brown, Spooks and Foyle's War.\n\nIn 2009, Horton played Hannah in Days of Significance, written by Roy Williams, as part of the Royal Shakespeare Company, and played Barbara in The Gods Weep, written by Dennis Kelly, in 2010. In the same year, Horton also played Dunyasha in The Cherry Orchard, written by Anton Chekhov, at the Birmingham Rep, and Anna in Town, written by D.C. Moore, at the Royal & Derngate in Northampton. She appeared as Deb in an adaptation of Morgan Lloyd Malcolm's Belongings at Hampstead Theatre and Trafalgar Studios in 2011. During summer 2013 she appeared again with the Royal Shakespeare Company as Celia in As You Like It and Helena in All's Well That Ends Well. In 2017, she played Cassio in Othello at Shakespeare's Globe.",
        "birthday": "1980-03-31",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1528072,
        "imdb_id": "nm1765118",
        "known_for_department": "Acting",
        "name": "Joanna Horton",
        "place_of_birth": "Manchester, England, United Kingdom",
        "popularity": 0.1478,
        "profile_path": null
    }
}