{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dE0NoGwzU81sYTLY9gUGEzLjozG.jpg",
                "genre_ids": [
                    18,
                    35,
                    10749
                ],
                "id": 84199,
                "original_language": "en",
                "original_title": "The First Time",
                "overview": "A spark of attraction smolders, then ignites, between two teens from different high schools who meet by chance at a party.",
                "popularity": 2.5986,
                "poster_path": "/tG6jUndWd9FRuvI4j5Z2bhTuq0V.jpg",
                "release_date": "2012-10-19",
                "title": "The First Time",
                "video": false,
                "vote_average": 6.992,
                "vote_count": 2127,
                "character": "Aubrey's Mom",
                "credit_id": "52fe48e09251416c9109b39f",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Christine Stiller",
            "Christine Joan Taylor Stiller"
        ],
        "biography": "Christine Joan Taylor Stiller (born July 30, 1971) is an American actress. She is known for playing Marcia Brady in The Brady Bunch Movie and A Very Brady Sequel, as well as roles in films like The Craft, The Wedding Singer, Zoolander, Dodgeball: A True Underdog Story, and her television roles in Hey Dude, Arrested Development, and Search Party.\n\nTaylor began her acting career in 1989 on the Nickelodeon children's television series Hey Dude where she played the lifeguard Melody Hanson. She continued in that role through 1991 while making various guest appearances on other programs. In 1995, Taylor was cast as Marcia Brady in The Brady Bunch Movie and later in A Very Brady Sequel.\n\nFollowing The Brady Bunch Movie, Taylor made several comedic guest appearances on the TV series Ellen, landing the lead role in the television series Party Girl, based on the 1995 film of the same name, and more guest appearances on Seinfeld and Friends.\n\nShe played the racist school bully Laura Lizzie in the 1996 horror film The Craft, and also played Drew Barrymore's cousin, Holly Sullivan, in the 1998 comedy The Wedding Singer. In 2001, she starred alongside her husband Ben Stiller in Zoolander and again, in 2016, she reprised her role in Zoolander 2.\n\nIn 2005, she made television appearances as a guest star in two episodes of Arrested Development as Sally Sitwell and, in 2006, in an episode of NBC's My Name Is Earl. In July 2006, her husband, Ben Stiller announced plans to direct a CBS sitcom starring Taylor, but the series never aired. In 2008, she was in the film, Tropic Thunder, along with her husband, Ben Stiller.\n\nShe has appeared with Mandy Moore in both Dedication and License to Wed. In 2010, she guest starred in Hannah Montana Forever and she starred in the Hallmark Channel Christmas movie Farewell Mr. Kringle. In 2013, she reprised her role as Sally Sitwell in two episodes of the revived Arrested Development. She also guest starred on Elementary in 2017, playing villainess Gail Lundquist.\n\nBeginning in 2016, Taylor had a recurring role as Gail on Search Party. In 2021, Taylor joined the cast of High Desert, an Apple TV+ series.\n\nChristine and her husband, Ben Stiller, separated in 2017, after 17 years of marriage, but have since rekindled their marriage.",
        "birthday": "1971-07-30",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 15286,
        "imdb_id": "nm0852132",
        "known_for_department": "Acting",
        "name": "Christine Taylor",
        "place_of_birth": "Allentown, Pennsylvania, USA",
        "popularity": 0.8461,
        "profile_path": "/81jveproLhJzWHpCuJh7hN65zRl.jpg"
    }
}