{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5l3Xb2WQR0nXiVhbj5rAv0z4xsZ.jpg",
                "genre_ids": [
                    12,
                    18
                ],
                "id": 62204,
                "original_language": "fr",
                "original_title": "La Guerre du feu",
                "overview": "In the prehistoric world, a Cro-Magnon tribe depends on an ever-burning source of fire, which eventually extinguishes. Lacking the knowledge to start a new fire, the tribe sends three warriors on a quest for more. With the tribe's future at stake, the warriors make their way across a treacherous landscape full of hostile tribes and monstrous beasts. On their journey, they encounter Ika, a woman who has the knowledge they seek.",
                "popularity": 2.4286,
                "poster_path": "/tyzW1M00xfHKNtmTlT6wJ3F4pNr.jpg",
                "release_date": "1981-12-16",
                "title": "Quest for Fire",
                "video": false,
                "vote_average": 7.012,
                "vote_count": 540,
                "character": "Gaw",
                "credit_id": "52fe4675c3a368484e091ced",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Nameer El-Kadi"
        ],
        "biography": "Nicholas Kadi (born Nameer El-Kadi; September 22, 1952) is a Turkish-born Iraqi American actor.\n\nKadi was born in Istanbul, Turkey of Iraqi descent. His father, Nizar el Kadi, was an Iraqi ambassador.\n\nKadi has appeared in numerous television sitcoms and series, such as JAG, Sleeper Cell, Alias, 24, ER, The Young and the Restless and The Wayans Bros. He is fluent in Arabic and French.\n\nAccording to commentary by Rae Dawn Chong and Ron Perlman on La Guerre du Feu (1981) DVD, Kadi met his wife on the set of the film (she was an on-set nurse in Scotland) and Ron is the godfather to their daughter.\n\nHe is twin brother of Naseer El-Kadi.\n\nDescription above from the Wikipedia article Nicholas Kadi, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1952-09-22",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 152970,
        "imdb_id": "nm0252832",
        "known_for_department": "Acting",
        "name": "Nicholas Kadi",
        "place_of_birth": "Istanbul, Turkey",
        "popularity": 0.2267,
        "profile_path": "/4U8S1C8WWB5pALkZiDNWbtrVjE9.jpg"
    }
}