{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/oNoprEND25zXR6Fns8cIZUkuoMc.jpg",
                "genre_ids": [
                    35,
                    80,
                    18
                ],
                "id": 308266,
                "original_language": "en",
                "original_title": "War Dogs",
                "overview": "Based on the true story of two young men, David Packouz and Efraim Diveroli, who won a $300 million contract from the Pentagon to arm America's allies in Afghanistan.",
                "popularity": 6.4733,
                "poster_path": "/mDcPRjZC1bb6LavFU3gwsWdVfCM.jpg",
                "release_date": "2016-08-18",
                "title": "War Dogs",
                "video": false,
                "vote_average": 6.926,
                "vote_count": 5190,
                "character": "Arms Buyer (uncredited)",
                "credit_id": "587664e99251416ed000015d",
                "order": 63
            },
            {
                "adult": false,
                "backdrop_path": "/uozb2VeD87YmhoUP1RrGWfzuCrr.jpg",
                "genre_ids": [
                    28,
                    80
                ],
                "id": 495764,
                "original_language": "en",
                "original_title": "Birds of Prey (and the Fantabulous Emancipation of One Harley Quinn)",
                "overview": "Harley Quinn joins forces with a singer, an assassin and a police detective to help a young girl who had a hit placed on her after she stole a rare diamond from a crime lord.",
                "popularity": 10.953,
                "poster_path": "/h4VB6m0RwcicVEZvzftYZyKXs6K.jpg",
                "release_date": "2020-02-05",
                "title": "Birds of Prey (and the Fantabulous Emancipation of One Harley Quinn)",
                "video": false,
                "vote_average": 6.893,
                "vote_count": 10528,
                "character": "Roman's Bodyguard (uncredited)",
                "credit_id": "5ebe1fd08e2e00002114f309",
                "order": 95
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Di Medio Lucas",
            "Gianluca Di Medio Ceccarelli",
            "Lucas DiMedio"
        ],
        "biography": "Gianluca Di Medio Ceccarelli is an Italian American Actor born in Aracaju in Brazil, was raised in Pescara, by his parents in Abruzzo a region in center of Italy. He started his artistic career in high school, studying Fine Art and Theater in Pescara since he was teenager and in Rome under the guidance of Claudia Giannotti and J.Tamburi participating in student theater 's productions and many workshops. He is also a big Sport lover,especially Soccer and Basketball that he played in various levels Professionally.Gianluca then pursued a modeling career in Milan and appeared in various magazines, commercials and advertising campaigns around the world. After relocating to Rome, he focused on a career in acting. Gianluca got some small parts in TV shows such as well as parts in commercials. His first film role was in Tinto Brass' \"Senso 45\" as an SS soldier during the second World War. In 2005 Gianluca decided to try to make it in Hollywood and moved in Los Angeles for pursue his dreams,Gianluca acted in the films such as well as in commercials for. He also continued his work as a model in fashion shows for. Gianluca now resides in Los Angeles California and still pursuing his acting career. His dream is to being working like an International Actor and producing Films.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.e-talenta.eu/members/profile/lucas-dimedio",
        "id": 1530990,
        "imdb_id": "nm3142227",
        "known_for_department": "Acting",
        "name": "Lucas Di Medio",
        "place_of_birth": "Aracaju, Sergipe, Brazil",
        "popularity": 0.3005,
        "profile_path": "/fL7eLZVLRhHCvthGStcWVJnK6jR.jpg"
    }
}