{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/41ZWAGMttCr74dq7sAeh44QSJTQ.jpg",
                "genre_ids": [
                    28,
                    18,
                    36,
                    10752
                ],
                "id": 14433,
                "original_language": "en",
                "original_title": "Zulu",
                "overview": "In 1879, during the Anglo-Zulu War, man-of-the-people Lt. Chard and snooty Lt. Bromhead are in charge of defending the isolated and vastly outnumbered Natal outpost of Rorke's Drift from tribal hordes.",
                "popularity": 2.6628,
                "poster_path": "/9V7tl1kIb67ZPRRNlUdy3JvqEiA.jpg",
                "release_date": "1964-01-22",
                "title": "Zulu",
                "video": false,
                "vote_average": 7.389,
                "vote_count": 540,
                "character": "Sgt. Maxfield",
                "credit_id": "52fe45f29251416c75067ff1",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Paul Frederick Daneman"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nPaul Daneman (29 October 1925 - 28 April 2001) was an English film, television, theatre and voice actor.\n\nPaul Frederick Daneman was born in Islington, London. He attended the Haberdashers' Aske's School and Sir William Borlase's Grammar School in Marlow and studied stage design at Reading University where he joined the dramatic society. After training at RADA he joined Bristol Old Vic, Birmingham Rep and the Old Vic for four years. In August 1955 he created the role of Vladimir in Waiting For Godot, at the Arts Theatre in Westminster.\n\nHis film credits include: Zulu and Oh! What a Lovely War. Daneman's TV credits include: The Adventures of Robin Hood, Persuasion (1960 series), Danger Man, Out of the Unknown, The Saint, Spy Trap, Blake's 7, The Professionals and Rumpole of the Bailey. The BBC's 1960 landmark production \"||An Age of Kings]],\" a fifteen part drama that combined Shakespeare's histories of the Kings of England and presented them in chronological order, featured Daneman as Richard III.\n\nDaneman played the husband of Wendy Craig in the original series of the popular BBC sitcom Not in Front of the Children before being replaced by Ronald Hines. He also played Bilbo Baggins in the 1968 BBC Radio dramatisation of J. R. R. Tolkien's The Hobbit.\n\nWhile recovering from a heart attack, he wrote the sitcom Affairs of the Heart. In 1995 Daneman published If I Only Had Wings, a novel inspired by his experiences in the Royal Air Force during World War II.\n\nDaneman died in 2001 and was buried at East Sheen Cemetery, South West London.\n\nDescription above from the Wikipedia article Paul Daneman, licensed under CC-BY-SA, full list of contributors on Wikipedia. ​",
        "birthday": "1925-10-29",
        "deathday": "2001-04-28",
        "gender": 2,
        "homepage": null,
        "id": 153078,
        "imdb_id": "nm0199399",
        "known_for_department": "Acting",
        "name": "Paul Daneman",
        "place_of_birth": "London, England, UK",
        "popularity": 0.5301,
        "profile_path": "/6EfIhOb5VUClPAdwPlS529OZP4t.jpg"
    }
}