{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5l2kTFOC9QicBxOVpocy5pSu4i8.jpg",
                "genre_ids": [
                    28,
                    18,
                    36
                ],
                "id": 437068,
                "original_language": "ko",
                "original_title": "택시운전사",
                "overview": "May, 1980. Man-seob is a taxi driver in Seoul who lives from hand to mouth, raising his young daughter alone. One day, he hears that there is a foreigner who will pay big money for a drive down to Gwangju city. Not knowing that he’s a German journalist with a hidden agenda, Man-seob takes the job.",
                "popularity": 4.0499,
                "poster_path": "/iXVaWbxmyPk4KZGZk5GGDGFieMX.jpg",
                "release_date": "2017-08-02",
                "title": "A Taxi Driver",
                "video": false,
                "vote_average": 8.048,
                "vote_count": 1076,
                "character": "Gu Jae-sik",
                "credit_id": "588781d09251416668005010",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ryoo Joon-yeol",
            "Ryoo Jun-yeol",
            "Ryu Joon-yeol"
        ],
        "biography": "Ryu Jun-yeol (Hangul: 류준열; born 25 September 1986) is a South Korean actor. He gained popularity through his breakthrough role in the television series Reply 1988 (2015–2016). Known as a prolific Chungmuro actor, since then he has starred in the box-office hit films The King (2017), A Taxi Driver (2017), Believer (2018), Money (2019), The Battle: Roar to Victory (2019).\n\nHe pursued acting studies at Suwon University and became a prolific performer in short films and independent titles beginning in 2012. His first feature film role was a small part in the Korean Academy of Film Arts title INGtoogi: Battle of Internet Trolls. Following a flurry of shorts in 2014, Ryu next featured in the KAFA film Socialphobia. Following its debut at the Busan International Film Festival, the youth thriller became a smash hit at the box office and earned him numerous accolades, including the KAFA Rising Star Award and similar prizes from the First Brand Awards and the Max Movie Awards.\n\nIn 2015, Ryu debuted as a TV actor, landing a small part in The Producers and next to a main role in Reply 1988. That role quickly turned him into a star and earned him more prizes, this time from the Paeksang Arts Awards and the Korea Cable TV Awards. He also appeared in the KAFA film The Boys Who Cried Wolf. The following year saw Ryu conquer the film world, scoring roles in diverse titles such as the youth road drama One Way Trip, the sci-fi drama Sori: Voice from the Heart, island thriller No Tomorrow, melodrama Canola and the noir thriller The King, and featured alongside Song Kang-ho in the Gwangju massacre drama A Taxi Driver.",
        "birthday": "1986-09-25",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1530733,
        "imdb_id": "nm6916719",
        "known_for_department": "Acting",
        "name": "Ryu Jun-yeol",
        "place_of_birth": "Suwon, Gyeonggi, South Korea",
        "popularity": 0.4019,
        "profile_path": "/5CYYuEiAocVRRhmrvUrithsCpil.jpg"
    }
}