{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/i109vzdCkG7W3H9FxHmfpZjgh61.jpg",
                "genre_ids": [
                    10751,
                    12,
                    18
                ],
                "id": 522518,
                "original_language": "en",
                "original_title": "A Dog's Journey",
                "overview": "A dog finds the meaning of his own existence through the lives of the humans he meets.",
                "popularity": 4.6657,
                "poster_path": "/wquJChp0NpoqthYdE3YjXNNxvVC.jpg",
                "release_date": "2019-05-03",
                "title": "A Dog's Journey",
                "video": false,
                "vote_average": 8.1,
                "vote_count": 1570,
                "character": "Trent",
                "credit_id": "5c603cd1925141721cb81553",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Henry",
            "Liú Xiànhuá",
            "헨리",
            "유헌화",
            "Yoo Heon-hwa",
            "هنری لاو"
        ],
        "biography": "Henry Lau, commonly referred to as Henry, is a Canadian singer, dancer, musician, songwriter, composer, entertainer, model and actor mostly active in South Korea and China. He debuted in 2008 as a member of Super Junior-M. Aside from group activities, he has also produced several songs for various artists, television dramas and is a part of a composing team Noize Bank.  In June 2013, Lau debuted as a solo artist with his first extended play, Trap. It peaked at #2 on South Korea's Gaon Album Chart and spawned the single with the same name, which peaked at 28 on South Korea's Gaon Digital Chart, also peaked at #18 on the Billboard Korea K-Pop Hot 100 Weekly singles.  In April 2018, Lau left SM Entertainment following the expiration of his contract with them and effectively left Super Junior-M.  In July 2018, Lau established his own studio, Henry Workshop.  Later that year, he joined Monster Entertainment Group and signed with Korean label AXIS.",
        "birthday": "1989-10-11",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1530941,
        "imdb_id": "nm5376582",
        "known_for_department": "Acting",
        "name": "Henry Lau",
        "place_of_birth": "Toronto, Ontario, Canada",
        "popularity": 0.5599,
        "profile_path": "/apbaSap49dGzaE6TcmUshTWN25q.jpg"
    }
}