{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/x085XrfEmU31QeXgMFttmuoGr0Y.jpg",
                "genre_ids": [
                    27,
                    53,
                    878
                ],
                "id": 170,
                "original_language": "en",
                "original_title": "28 Days Later",
                "overview": "Twenty-eight days after a killer virus was accidentally unleashed from a British research facility, a small group of London survivors are caught in a desperate struggle to protect themselves from the infected. Carried by animals and humans, the virus turns those it infects into homicidal maniacs -- and it's absolutely impossible to contain.",
                "popularity": 17.8409,
                "poster_path": "/sQckQRt17VaWbo39GIu0TMOiszq.jpg",
                "release_date": "2002-10-31",
                "title": "28 Days Later",
                "video": false,
                "vote_average": 7.235,
                "vote_count": 7832,
                "character": "Featured Infected",
                "credit_id": "64d3b3a703726400c57308b9",
                "order": 27
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Terry John is a British actor best known for playing Percy in Oh, Doctor Beeching!.\n\nHe began acting in The '80s, appearing in three episodes of the mini-series Wolcott. The rest of the decade for John contained guest shots in Bergerac, CASUAL+Y, A Very British Coup, and Minder.\n\nIn The '90s, John made 5 different appearances in The Bill (and would play a further three characters in the next decade). Further guest roles came in Lovejoy, EastEnders, As Time Goes By, Pie in the Sky, and Backup.\n\nHe was cast as Corporal Tony Genaro in Which Way to the War?, an unaired Pilot written by David Croft. Croft didn't forget about John, and gave him a role in his next series, Oh, Doctor Beeching!, as Percy, a railway guard and notorious skirt-chaser.\n\nFollowing his stint on Beeching!, John's acting career began to slow down, with some of his last acting roles coming in 28 Days Later, Murphy's Law, and Wire in the Blood. His final credit to date came in 2006, in yet another episode of The Bill.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://tvtropes.org/pmwiki/pmwiki.php/Creator/TerryJohn",
        "id": 1531254,
        "imdb_id": "nm0424240",
        "known_for_department": "Acting",
        "name": "Terry John",
        "place_of_birth": null,
        "popularity": 0.0902,
        "profile_path": "/b1SHk2aTYUrB0R9lsLhJ4QvdKYi.jpg"
    }
}