{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cHkhb5A4gQRK6zs6Pv7zorHs8Nk.jpg",
                "genre_ids": [
                    28,
                    80,
                    53
                ],
                "id": 168259,
                "original_language": "en",
                "original_title": "Furious 7",
                "overview": "Deckard Shaw seeks revenge against Dominic Toretto and his family for his comatose brother.",
                "popularity": 14.3471,
                "poster_path": "/wurKlC3VKUgcfsn0K51MJYEleS2.jpg",
                "release_date": "2015-04-01",
                "title": "Furious 7",
                "video": false,
                "vote_average": 7.224,
                "vote_count": 10951,
                "character": "Samantha Hobbs",
                "credit_id": "56417cfec3a3685be2001846",
                "order": 22
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Eden Estrella is an American actress born on March 30, 2004 and lives in the Los Angeles area with her parents and two siblings.\n\nHer breakout role in Furious 7 (2015) as the sassy, young daughter of Agent Luke Hobbs, played by Dwayne Johnson shows that the apple doesn't fall far from the tree as she confronts the charismatic, but imposing figure of Dominic Torretto, played by Vin Diesel. She reprises the role as Samantha Hobbs in The Fate of the Furious (2017).\n\nFrom her mother's side, Eden's Filipina heritage is mixed with Spanish and Portuguese. From her father's side, Eden has Irish, German, British, French and Scottish ancestry, with Eden's European lineage tracing back to the Salisbury's and notably, the O'Baoigheallains; as epitomized in O'Dugals 14th century poem of the \"blue-eyed, bold kings of Dartry!'\n\nEden began her acting career in 2013. She is represented by agent, Robin Nassif of Media Artists Group and manager, Tina Treadwell of Treadwell Entertainment Group and attorney Steve Younger of 'Myman Greenspan Fineman Fox Rosenberg Light [us]'.\n\nEden is a GATE honors student taking up ballet, jazz, acting and singing lessons. In her spare time, Eden loves to draw anime, read and write and has self-published short stories and poetry on Wattpad.",
        "birthday": "2004-03-30",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1533850,
        "imdb_id": "nm5635302",
        "known_for_department": "Acting",
        "name": "Eden Estrella",
        "place_of_birth": "Los Angeles, U.S.A",
        "popularity": 0.0666,
        "profile_path": "/3FODNSxezBtAe99M2HiBDzQBh13.jpg"
    }
}