{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/aheSIG4h3JNxWeDvdb1NxKzgjaM.jpg",
                "genre_ids": [
                    36,
                    10752,
                    18,
                    12
                ],
                "id": 967,
                "original_language": "en",
                "original_title": "Spartacus",
                "overview": "The rebellious Thracian Spartacus, born and raised a slave, is sold to Gladiator trainer Batiatus. After weeks of being trained to kill for the arena, Spartacus turns on his owners and leads the other slaves in rebellion. As the rebels move from town to town, their numbers swell as escaped slaves join their ranks. Under the leadership of Spartacus, they make their way to southern Italy, where they will cross the sea and return to their homes.",
                "popularity": 6.2092,
                "poster_path": "/r0Fgg1GyZgzokaiw2HFQv3oPaL2.jpg",
                "release_date": "1960-10-13",
                "title": "Spartacus",
                "video": false,
                "vote_average": 7.54,
                "vote_count": 2262,
                "character": "Metallius (uncredited)",
                "credit_id": "5602d91e9251416e95000512",
                "order": 99
            },
            {
                "adult": false,
                "backdrop_path": "/1rSF7UoY6aU8i7yJOLovZv8AYwX.jpg",
                "genre_ids": [
                    53
                ],
                "id": 31997,
                "original_language": "en",
                "original_title": "Saboteur",
                "overview": "Aircraft factory worker Barry Kane flees across the United States after he is wrongly accused of starting the fire that killed his best friend.",
                "popularity": 3.589,
                "poster_path": "/iDKOOTymUZg0WAWPcbdP6nPZEFF.jpg",
                "release_date": "1942-04-24",
                "title": "Saboteur",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 518,
                "character": "Will - Other Man in Movie (uncredited)",
                "credit_id": "664fa793dd35d1e2b7caf34b",
                "order": 62
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Vinton Hayworth Sr. ",
            "Jack Arnold",
            "Vinton Haworth"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nVinton Hayworth (June 4, 1906 – May 21, 1970) was an Americanactor who began in weaselly and milquetoast roles and aged into dignified character parts.\n\nCareer\n\nBorn in Washington, D.C., he began acting in his late teens. He was a pioneering radio announcer in the early 1920s, first in Washington, later in New York City, and then in Chicago.\n\nSubsequently, he appeared on numerous radio programs in various roles. He entered movies in 1933, under the stage name Jack Arnold and made appearances in small roles, usually played comically good-natured, sneaky characters. His appearances as Jack Arnold ended in the early 1940s and he did a two year stint on Broadway from 1942-44 before returning to California. He made appearances in film from the late 1950s onward.\n\nHayworth was also one of the founders of AFRA (later AFTRA), the union representing radio and television artists, of which he was also the president from 1951-54.\n\nHayworth began appearing on television in the 1950s. He appeared in Alfred Hitchcock Presents, Gunsmoke, Perry Mason, Dennis the Menace, Petticoat Junction, Hazel, The Munsters, Green Acres (1965) and Dick Tracy (1967). He played Carlos Galindo on Disney's Zorro (1957-1959). His final role was as General Winfield Schaeffer on I Dream of Jeannie between 1969 and 1970. Hayworth replaced Barton MacLane, who had played General Peterson until his death in 1969. Both Hayworth and MacLane died before the final episodes that they appeared in were aired.\n\nDeath\n\nShortly after completing his recurring role of General Schaeffer in I Dream of Jeannie, Hayworth died of a heart attack on May 21, 1970. He died five days before I Dream of Jeannie aired its last first-run episode (May 26, 1970). His remains were cremated.\n\nPersonal\n\nHayworth was married to actress Jean Owens. Hayworth's elder sister was Volga Hayworth, mother of screen star Rita Hayworth.",
        "birthday": "1906-06-04",
        "deathday": "1970-05-21",
        "gender": 2,
        "homepage": null,
        "id": 153309,
        "imdb_id": "nm0370386",
        "known_for_department": "Acting",
        "name": "Vinton Hayworth",
        "place_of_birth": "Washington, District of Columbia, USA",
        "popularity": 0.3002,
        "profile_path": "/mx3JgPmQQeK8hcCc6LtuFYQGiaB.jpg"
    }
}