{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jniabJVBSW3EqLlyhjxWCZjVkiE.jpg",
                "genre_ids": [
                    12,
                    28,
                    878
                ],
                "id": 1895,
                "original_language": "en",
                "original_title": "Star Wars: Episode III - Revenge of the Sith",
                "overview": "The evil Darth Sidious enacts his final plan for unlimited power – and the heroic Jedi Anakin Skywalker must choose a side.",
                "popularity": 8.2385,
                "poster_path": "/xfSAoBEm9MNBjmlNcDYLvLSMlnq.jpg",
                "release_date": "2005-05-17",
                "title": "Star Wars: Episode III - Revenge of the Sith",
                "video": false,
                "vote_average": 7.453,
                "vote_count": 14346,
                "character": "Malé-Dee",
                "credit_id": "54e3673ec3a368454d009987",
                "order": 41
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Kee Wah Chan"
        ],
        "biography": "Kee Chan was born during a period of social turbulence in Singapore.\n\nA move to Australia with his family would set Kee on a path to realizing his childhood dreams. Kee returned to his childhood aspiration of becoming a professional actor. Despite a tentative start playing small roles on Australian television shows, Kee, whose name means \"Keeper of the Peace,\" was cast as Fedallah, the lead support role to Patrick Stewart (Captain Ahab), in \"Moby Dick\" (1998). A support role in Mission: Impossible II (2000) and several other movies eventually led to a role as Senator Malé-Dee in the last installment of the George Lucas epic, Star Wars: Episode III - Revenge of the Sith (2005).\n\nIn 2002, Kee landed a lead role opposite Dennis Hopper in the 22 episode, multi-time dimension drama series, \"Flatland\" (2002).\n\nWidely traveled with numerous location shoots around the world, Kee resides in Los Angeles, California.\n\n- IMDb Mini Biography",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.kractors.co.nz/Kee~Chan",
        "id": 15342,
        "imdb_id": "nm0150970",
        "known_for_department": "Acting",
        "name": "Kee Chan",
        "place_of_birth": "Singapore",
        "popularity": 0.203,
        "profile_path": "/e52bZCgtWRfCfi29oM7996PiIbF.jpg"
    }
}