{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/x2FqFdUxRekbNdow3vZdtDqL96z.jpg",
                "genre_ids": [
                    35,
                    18,
                    36
                ],
                "id": 402897,
                "original_language": "en",
                "original_title": "The Death of Stalin",
                "overview": "When dictator Joseph Stalin dies, his parasitic cronies square off in a frantic power struggle to become the next Soviet leader. As they bumble, brawl and back-stab their way to the top, the question remains — just who is running the government?",
                "popularity": 2.5354,
                "poster_path": "/AqH7q89NxGRDAyRWKqsL3OBtYfV.jpg",
                "release_date": "2017-10-20",
                "title": "The Death of Stalin",
                "video": false,
                "vote_average": 7.012,
                "vote_count": 2009,
                "character": "NKVD Officer Delov",
                "credit_id": "5a94b61e0e0a260872000c1c",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "폴 레디",
            "Пол Риди",
            "بول ريدي"
        ],
        "biography": "Paul Ready is a British actor. He is known principally for his work on stage, but he has also appeared in television, radio and films. He received a commendation at the 2003 Ian Charleson Awards. In 2018, he played the role of Rob MacDonald in the BBC television series Bodyguard.\n\nReady was born in Birmingham and growing up in the town of Harborne he attended King Edward VI Five Ways school within the city. He went on to train at London Academy of Music and Dramatic Art.\n\nAt the age of 17, Ready played Romeo in the National Youth Theatre production of Romeo and Juliet at London's Bloomsbury Theatre, playing opposite Rosamund Pike who played Juliet.\n\nHe is a regular at the National and Royal Court theaters. Recent appearances have included leading parts in Major Barbara and Saint Joan (both plays by George Bernard Shaw) and Time and the Conways. His West End credits include One Flew Over the Cuckoo's Nest which starred Christian Slater.\n\nAlso appearing on television, Ready received notability in 2013 for appearing on the television show Utopia.\n\nIn 2018, he feature as Henry Goodsir, one of the lead roles in The Terror, a 10-part series based on Dan Simmons' best-selling novel.\n\nReady is married to actress and writer Michelle Terry. They have one daughter.",
        "birthday": "1977-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1534392,
        "imdb_id": "nm0713961",
        "known_for_department": "Acting",
        "name": "Paul Ready",
        "place_of_birth": "Birmingham, England",
        "popularity": 0.3161,
        "profile_path": "/8sQg5Qb3q2wlhvtBD6iu3NKAHRg.jpg"
    }
}