{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7NzsBCM8cj53yLEPWYhN0YfGZG.jpg",
                "genre_ids": [
                    18
                ],
                "id": 1630,
                "original_language": "en",
                "original_title": "The People vs. Larry Flynt",
                "overview": "Larry Flynt is the hedonistically obnoxious, but indomitable, publisher of Hustler magazine. The film recounts his struggle to make an honest living publishing his girlie magazine and how it changes into a battle to protect the freedom of speech for all people.",
                "popularity": 2.6703,
                "poster_path": "/sAgHn7ys6TiVXBDTZ0UBEjinIUk.jpg",
                "release_date": "1996-12-25",
                "title": "The People vs. Larry Flynt",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 1168,
                "character": "DC Reporter",
                "credit_id": "61434ee6d236e60026395cab",
                "order": 90
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nGene Lyons (February 9, 1921 – July 8, 1974) was an American television actor from Pittsburgh, best known for his role as police commissioner Dennis Randall on the NBC detective series Ironside starring Raymond Burr.\n\nA life member of The Actors Studio, Lyons was in the Broadway production of Witness for the Prosecution for two years. His other Broadway credits include Masquerade (1958), The Trip to Bountiful (1953), Harriet (1942), and This Rock (1942).\n\nIn 1953, Lyons played a police detective on the CBS drama series Pentagon U.S.A.. He appeared in 1954 as Steve Rockwell on the CBS daytime drama Woman with a Past. Before joining Raymond Burr as a regular on Ironside, he appeared on Perry Mason in 1965 as murderer Ralph Balfour in \"The Case of the Wrathful Wraith.\" He also made guest appearances on nearly two dozen other series including The Dick Van Dyke Show, Gunsmoke, Have Gun, Will Travel, The Fugitive, Ben Casey, Star Trek (\"A Taste of Armageddon\"), The Twilight Zone (\"King Nine Will Not Return\"), The Alfred Hitchcock Hour and The Untouchables. He also appeared in films including Kiss Her Goodbye and The Young Don't Cry.\n\nLyons died in Los Angeles, California on July 8, 1974 and is buried at Calvary Catholic Cemetery in Pittsburgh.",
        "birthday": "1921-02-09",
        "deathday": "1974-07-08",
        "gender": 2,
        "homepage": null,
        "id": 153458,
        "imdb_id": "nm0529056",
        "known_for_department": "Acting",
        "name": "Gene Lyons",
        "place_of_birth": "Pittsburgh, Pennsylvania, USA",
        "popularity": 0.2221,
        "profile_path": "/4OlNbB00am3OLJvaAZ1SBN2pd3R.jpg"
    }
}