{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/AfGp6Ev3BVdEd7L99kGQzOzsqRb.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 568,
                "original_language": "en",
                "original_title": "Apollo 13",
                "overview": "The true story of technical troubles that scuttle the Apollo 13 lunar mission in 1970, risking the lives of astronaut Jim Lovell and his crew, with the failed journey turning into a thrilling saga of heroism. Drifting more than 200,000 miles from Earth, the astronauts work furiously with the ground crew to avert tragedy.",
                "popularity": 8.8273,
                "poster_path": "/tVeKscCm2fY1xDXZk8PgnZ87h9S.jpg",
                "release_date": "1995-06-30",
                "title": "Apollo 13",
                "video": false,
                "vote_average": 7.451,
                "vote_count": 5607,
                "character": "Reporter",
                "credit_id": "5bc37dfe0e0a266e5704e1ed",
                "order": 78
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "John Wheeler graduated from the University of the Pacific in Stockton, California, earning a bachelors degree in Music. A singer and character actor most familiar from television, he appeared on episodes of The Odd Couple, Green Acres, The Brady Bunch, and on Star Trek (as the tellarite Gav in the episode \"Journey To Babel\"). Wheeler sang with the City Center Opera in New York and performed in Rodgers & Hammerstein's Carousel and Bernstein, Comden, and Green's Wonderful Town at the 1958 Brussels World's Fair, repeating his role in the latter work in its television premier that same year. On Broadway, he appeared in The Happiest Girl in the World, Kean, Cafe Crown, I Had a Ball, and Sweet Charity (as \"Herman\", the dance hall proprietor, a role that went to Stubby Kaye in the movie adaptation; Wheeler played a smaller role in the film). He remained active into the 1990s.",
        "birthday": "1930-06-20",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 153561,
        "imdb_id": "nm0923863",
        "known_for_department": "Acting",
        "name": "John Wheeler",
        "place_of_birth": "Houston, Texas, USA",
        "popularity": 0.7901,
        "profile_path": "/voGuP13slMO9rK35QmFs7wYYIWf.jpg"
    }
}