{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ejLsnT6KmMpvtoPHMp40m54hRDd.jpg",
                "genre_ids": [
                    12,
                    18,
                    53
                ],
                "id": 551,
                "original_language": "en",
                "original_title": "The Poseidon Adventure",
                "overview": "When their ocean liner capsizes, a group of passengers struggle to survive and escape.",
                "popularity": 2.4836,
                "poster_path": "/6RGiA5BfhelU9zoD0b1GAG4GWWf.jpg",
                "release_date": "1972-12-01",
                "title": "The Poseidon Adventure",
                "video": false,
                "vote_average": 7.11,
                "vote_count": 937,
                "character": "Passenger (uncredited)",
                "credit_id": "687a476c39849ffe8dd983b0",
                "order": 25
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Marco Lopez",
            "Marco Antonio Lopez",
            "Marco Antonio"
        ],
        "biography": "Marco Antonio Lopez (born September 10, 1935), also credited as Marco Antonio and Marco Lopez, is an American actor born in Los Angeles, who played several parts in the supporting cast of Jack Webb's Mark VII Limited television series, Dragnet and Adam-12. He also served as Webb's stand in for long shots. His first Hollywood job was as a stand-in for Elvis Presley in the 1956 movie Love Me Tender.\n\nIn 1971, Webb offered Lopez the role that would bring him into the homes of millions of Americans weekly, that of Firefighter Marco Lopez in Webb and Robert Cinader's television series, Emergency! Like his fellow Emergency! co-star, Los Angeles County Fire Department engineer and actor Mike Stoker, Lopez used his real name as his character name (which led to confusion that he was an actual firefighter with the LACoFD - he had never worked with the LACoFD at any time).\n\nAfter Emergency! went off the air in 1979, Lopez took roles in such television shows as MacGyver; Mission: Impossible; The New Adam-12; The Lloyd Bridges Show; Murder, She Wrote and The Six Million Dollar Man. He also appeared opposite Catherine Zeta-Jones and Julia Roberts in the movie America's Sweethearts, where he had an uncredited role as a photographer. Lopez was also one of the original \"extra\" crewman on Voyage to the Bottom of the Sea, a show he lent his visage (though seldom his voice) to from 1964 to 1968.",
        "birthday": "1935-09-10",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1536284,
        "imdb_id": "nm0530241",
        "known_for_department": "Acting",
        "name": "Marco López",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 1.0461,
        "profile_path": "/vurbaWECYhZpU7z43ag21flqSEp.jpg"
    }
}