{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qHXdyDBgetOyetVkWGzHYGp7L72.jpg",
                "genre_ids": [
                    12,
                    18,
                    36
                ],
                "id": 7305,
                "original_language": "en",
                "original_title": "Alive",
                "overview": "The amazing true story of a Uruguayan rugby team's plane that crashed in the middle of the Andes mountains, and their immense will to survive and pull through alive, forced to do anything and everything they could to stay alive on meager rations and through the freezing cold.",
                "popularity": 3.4042,
                "poster_path": "/uQACcCZqd7WCTRin9xRIW5gr1bd.jpg",
                "release_date": "1993-01-15",
                "title": "Alive",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 1513,
                "character": "Moncho Sabella",
                "credit_id": "59988b78c3a3682268014077",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Richard Cox"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nRichard Ian Cox (born October 3, 1973) is a Welsh-Canadian actor, voice actor, comedian and online radio host best known for his voice work for English language dubs of anime, mainly for InuYasha. Richard gained prominence for playing the character of Henry Dailey's (played by Mickey Rooney) teenaged traveller and horse rider, Alec Ramsay, in The Family Channel's Adventures of the Black Stallion during the early 1990s. Cox also gained fame for voicing Ian Kelley, the title character in the animated series Being Ian and for voicing Scattershot, one of the Autobots in the CGI-Animated series Transformers: Cybertron. In 2015, he provided the voice of Lofty in the American dubbed version of the 2015 reboot of the British children's animated television series Bob the Builder taking over from both Sonya Leite and Emma Tate. He maintains an active online presence on Tumblr and Twitter as well as Facebook. He hosts his own podcast called The Show.",
        "birthday": "1973-10-03",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 153783,
        "imdb_id": "nm0185214",
        "known_for_department": "Acting",
        "name": "Richard Ian Cox",
        "place_of_birth": "St. Asaph, Wales, UK",
        "popularity": 0.2058,
        "profile_path": "/pF7esxIeumjZnTjYTSoM9ZkPm8.jpg"
    }
}