{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8r9RoGfwGmn1pn0G3sbvHHemSWF.jpg",
                "genre_ids": [
                    18,
                    10402,
                    36
                ],
                "id": 277216,
                "original_language": "en",
                "original_title": "Straight Outta Compton",
                "overview": "In 1987, five young men, using brutally honest rhymes and hardcore beats, put their frustration and anger about life in the most dangerous place in America into the most powerful weapon they had: their music.  Taking us back to where it all began, Straight Outta Compton tells the true story of how these cultural rebels—armed only with their lyrics, swagger, bravado and raw talent—stood up to the authorities that meant to keep them down and formed the world’s most dangerous group, N.W.A.  And as they spoke the truth that no one had before and exposed life in the hood, their voice ignited a social revolution that is still reverberating today.",
                "popularity": 5.6597,
                "poster_path": "/1CiLJx8Xtv3TbbFj6k7BboSmKgC.jpg",
                "release_date": "2015-08-11",
                "title": "Straight Outta Compton",
                "video": false,
                "vote_average": 7.787,
                "vote_count": 4041,
                "character": "Mare, Record Label Employee (uncredited)",
                "credit_id": "6691b0ab2387d293bf63728b",
                "order": 118
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Suzanne Sumner Ferry is an American actress/producer/author from Los Angeles, California. She started acting after being inspired by watching her actor son Carson Ferry's acting workshops, but it had always been a strong desire of hers, evident in numerous high school theatrical productions she was involved with in her earlier years. She is also author of two books: \"Corinna the Christmas Elf\" (2006; Tate Publishing Enterprises) and \"The Day the Stars Stood Still: A Memoir about Logan Fleming, the Former Top Wax Artist at Movieland Wax Museum\" (2009; BearManor Media).\n\nSuzanne Sumner Ferry is also the second cousin of late actress/singer/starlet Kathryn Grayson from Winston-Salem, NC. She is writing a biography about Kathryn Grayson.\n\nHer two children, Carson Ferry and McKenna Ferry, also act. Her niece Kara Suzanne Boger and nephew Evan Fisher Boger also are actors. Suzanne lives with her husband Mike Ferry and children in Southern California.\n\n- IMDb Mini Biography By: Suzanne Sumner Ferry",
        "birthday": "1964-06-06",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1537753,
        "imdb_id": "nm1957881",
        "known_for_department": "Acting",
        "name": "Suzanne Sumner Ferry",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.0387,
        "profile_path": "/pBGc3WvEZKiWC9NcJXDyDEoDLnm.jpg"
    }
}