{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jpFcZH2eyh6gcoxCa637TrGe4bT.jpg",
                "genre_ids": [
                    28,
                    878
                ],
                "id": 2048,
                "original_language": "en",
                "original_title": "I, Robot",
                "overview": "In 2035, where robots are commonplace and abide by the three laws of robotics, a technophobic cop investigates an apparent suicide. Suspecting that a robot may be responsible for the death, his investigation leads him to believe that humanity may be in danger.",
                "popularity": 7.5859,
                "poster_path": "/efwv6F2lGaghjPpBRSINHtoEiZB.jpg",
                "release_date": "2004-07-15",
                "title": "I, Robot",
                "video": false,
                "vote_average": 6.956,
                "vote_count": 12214,
                "character": "Girl's Dad",
                "credit_id": "666b3b3bf6866a30260802bb",
                "order": 23
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/fGBJEfGjHmhg7nLAT0Jkcv9qV5e.jpg",
                "genre_ids": [
                    18,
                    35,
                    10749
                ],
                "id": 43347,
                "original_language": "en",
                "original_title": "Love & Other Drugs",
                "overview": "Maggie is an alluring free spirit who won't let anyone – or anything – tie her down. But she meets her match in Jamie, whose relentless and nearly infallible charm serves him well with the ladies and the cutthroat world of pharmaceutical sales. Maggie and Jamie's evolving relationship takes them both by surprise, as they find themselves under the influence of the ultimate drug: love.",
                "popularity": 9.7248,
                "poster_path": "/wZLM2uKJRYNchLmiCIjosX0rXy8.jpg",
                "release_date": "2010-11-04",
                "title": "Love & Other Drugs",
                "video": false,
                "vote_average": 7.043,
                "vote_count": 5367,
                "credit_id": "65200a743d355700e23e9c4e",
                "department": "Crew",
                "job": "Stunts"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Bobby L. Stewart"
        ],
        "biography": "Bobby L. Stewart was born in Amherstburg, a small town in southern Ontario. He first appeared on stage when he was in Grade 5, singing a classic Motown tune. Feeling a little stage shy in his early years, he sang the song....behind the stage curtain lol . Yet Bobby's fascination with theatre only grew, and by grade 9, he , along with two classmates wrote , produced and stared in his first short film about street life in the big city. Since then, his curiosity and commitment to the performing art continued to develop. In the late 1980s , Bobby moved to Vancouver Bc where he began formal study of theatre and film, including 4 years intensive training at William Davis Center for Performing Arts, as well as with many other teaching professionals in the Vancouver area. Bobby has appeared in numerous film and tv series produced in the Vancouver region , including Canadian classic such as X-Files ( several episode's) Madison ( recurring) , Northwood and Dark Angel (several episodes), as well more than 30 tv commercials. For a period of time , he put a hold on his film and theatre career to raise his young family and pursue other professional interest. He always intended to continue acting his true passion in life and returned to the scene in early 2000s . He has since renewed success in the industry and has landed several Supporting Lead roles in film/tv .",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 153842,
        "imdb_id": "nm0829216",
        "known_for_department": "Acting",
        "name": "Bobby Stewart",
        "place_of_birth": "Amherstburg, Ontario, Canada",
        "popularity": 0.0546,
        "profile_path": "/dgeoeAD3cEdKussD6WBvqIsyO4s.jpg"
    }
}