{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/r8fEOeDjlbtvaxYZ3QDh21gzpKh.jpg",
                "genre_ids": [
                    80,
                    18,
                    53
                ],
                "id": 1093,
                "original_language": "fr",
                "original_title": "Ascenseur pour l'échafaud",
                "overview": "A self-assured businessman murders his employer, the husband of his mistress, which unintentionally provokes an ill-fated chain of events.",
                "popularity": 2.2694,
                "poster_path": "/dLbf8LtbLQFM7KUaVgwkfKIPqXu.jpg",
                "release_date": "1958-01-29",
                "title": "Elevator to the Gallows",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 658,
                "character": "Julien Tavernier",
                "credit_id": "52fe42e7c3a36847f802bb55",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/wRMUb4hrgD868hNiRjCkbPXqRv0.jpg",
                "genre_ids": [
                    80,
                    18,
                    53
                ],
                "id": 10363,
                "original_language": "fr",
                "original_title": "Plein soleil",
                "overview": "Tom Ripley is a talented mimic, moocher, forger and all-around criminal improviser; but there's more to Tom Ripley than even he can guess.",
                "popularity": 2.3457,
                "poster_path": "/xGVRU34izQwG8YQNfVOSfKPhD3S.jpg",
                "release_date": "1960-03-10",
                "title": "Purple Noon",
                "video": false,
                "vote_average": 7.58,
                "vote_count": 564,
                "character": "Philippe Greenleaf",
                "credit_id": "52fe43619251416c7500e04d",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/51QLF3Fo9P6nGqN9xZ6mRSIuzEV.jpg",
                "genre_ids": [
                    18,
                    53
                ],
                "id": 4946,
                "original_language": "fr",
                "original_title": "La Piscine",
                "overview": "Set in a magnificent villa near a sun-drenched St. Tropez, lovers Jean-Paul and Marianne are spending a happy, lazy summer holiday. Their only concern is to gratify their mutual passion - until the day when Marianne invites her former lover and his beautiful teenage daughter to spend a few days with them. From the first moment, a certain uneasiness and tension begin to develop between the four, which soon escalates in a dangerous love-game.",
                "popularity": 2.0562,
                "poster_path": "/pIR9bZM0bN1TwM1tppP7wZ2eJrL.jpg",
                "release_date": "1969-01-31",
                "title": "The Swimming Pool",
                "video": false,
                "vote_average": 7.003,
                "vote_count": 531,
                "character": "Harry",
                "credit_id": "52fe43e6c3a36847f807710d",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Maurice Julien Marie Robinet",
            "Морис Роне"
        ],
        "biography": "Maurice Ronet (13 April 1927 – 14 March 1983) was a French film actor, director, and writer.\n\nMaurice Ronet was born Maurice Julien Marie Robinet in Nice, Alpes Maritimes. He was the only child of professional stage actors Émile Robinet and Gilberte Dubreuil. He made his stage debut at the age of 14 alongside his parents in Sacha Guitry's Deux couverts in Lausanne. After attending the Parisian acting school Centre du Spectacle de la Rue-Blanche, he entered the Paris Conservatoire in 1944, where Jean-Louis Barrault was one of his mentors. When he made his film debut at 22 in Jacques Becker's Rendez-vous de juillet (1949) in a role that was written specifically for him by Becker, he had little interest in pursuing an acting career.\n\nAfter completing the film, he married Maria Pacôme (a French stage actress and playwright), and they departed to Moustiers-Sainte-Marie in Provence, where he tried his hand at ceramics. After completing his military service, he returned to Paris in the early 1950s where he took courses in philosophy and physics, and pursued his passion for literature, music (piano and organ), film and painting. His artwork, part of the peinture non figurative movement, was exhibited with friends Jean Dubuffet and Georges Mathieu. He also acted occasionally in small roles in the films of French directors like Yves Ciampi and René Wheeler, with ambitions of becoming a filmmaker himself. Gradually, however, he came to discover a freedom in acting and a creative satisfaction that provided a synthesis of all his interests.\n\nMaurice Ronet became one of European cinema's more prolific actors. Between 1955 and 1975 he appeared in over 60 films. He often portrayed characters who were in conflict with themselves or society. He first garnered acclaim at the 1953 Cannes Film Festival for a supporting role in Jean Dreville's Endless Horizons (Horizons sans fin) and over the next few years as the romantic lead in André Michel's La sorcière (The Blonde Witch/The Sorceress, 1956) and in Jules Dassin's He Who Must Die (Celui qui doit mourir, 1957). It was at the presentation of \"La Sorcière\" at Cannes where he met a creative and an intellectual counterpart in Louis Malle. Two years later, he made his international box-office breakthrough as Julien Tavernier in Malle's first feature film Elevator to the Gallows (Ascenseur pour l'échafaud 1958), which features Jeanne Moreau. He originated the role of Philippe Greenleaf in Purple Noon (Plein soleil, 1960), René Clément's adaptation of The Talented Mr. Ripley. ...\n\nSource: Article \"Maurice Ronet\" from Wikipedia in English, licensed under CC-BY-SA.",
        "birthday": "1927-04-13",
        "deathday": "1983-03-14",
        "gender": 2,
        "homepage": null,
        "id": 15395,
        "imdb_id": "nm0740067",
        "known_for_department": "Acting",
        "name": "Maurice Ronet",
        "place_of_birth": "Nice, Alpes-Maritimes, France",
        "popularity": 0.5797,
        "profile_path": "/kNoCaKscnlHGTUucSUwjla7QT1v.jpg"
    }
}