{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wSJHuSD7ojzoXifWjOAjxV7UpEL.jpg",
                "genre_ids": [
                    10751,
                    16,
                    10402,
                    12
                ],
                "id": 354912,
                "original_language": "en",
                "original_title": "Coco",
                "overview": "Despite his family’s baffling generations-old ban on music, Miguel dreams of becoming an accomplished musician like his idol, Ernesto de la Cruz. Desperate to prove his talent, Miguel finds himself in the stunning and colorful Land of the Dead following a mysterious chain of events. Along the way, he meets charming trickster Hector, and together, they set off on an extraordinary journey to unlock the real story behind Miguel's family history.",
                "popularity": 21.5358,
                "poster_path": "/6Ryitt95xrO8KXuqRGm1fUuNwqF.jpg",
                "release_date": "2017-10-27",
                "title": "Coco",
                "video": false,
                "vote_average": 8.202,
                "vote_count": 20232,
                "character": "Abuelita (voice)",
                "credit_id": "58631dfec3a3680ab60012ce",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Rene Victor",
            "Renée Victor"
        ],
        "biography": "Renée Victor (July 25, 1938 — May 30, 2025) was an American actress, dance instructor, and singer. She was best known for her role as Abuelita in the Disney•PIXAR film Coco (2017), the recurring role of Lupita on Weeds (2005–12), and the voice of female Argonians in Bethesda Softworks' video game The Elder Scrolls V: Skyrim (2011).\n\nVictor was the eldest of three sisters. She moved to Los Angeles in the 1960s, where she launched her career in entertainment as a singer for prominent bandleaders who spearheaded the popularity of Latin music in the U.S., including Xavier Cugat and Perez Prado. At this time, she also served as a dance instructor, teaching salsa and tango. Having met her husband in these circles, she and her husband traveled globally to perform together under the banner “Ray & Renee” — nicknamed the Latin Sonny & Cher — from 1963 to 1973.\n\nIn the 1970s, Victor hosted KTLA’s Pacesetters, which highlighted the Chicano Power movement. After joining the Screen Actors Guild in 1973, she eventually transitioned to television and film work in the ’80s, scoring appearances in series like Scarecrow and Mrs. King (1985) and Matlock (1987). Her film credits include The Doctor (1991), alongside William Hurt, as well as The Apostle (1997) and A Night in Old Mexico (2013), featuring close friend Robert Duvall.",
        "birthday": "1938-07-25",
        "deathday": "2025-05-30",
        "gender": 1,
        "homepage": null,
        "id": 154004,
        "imdb_id": "nm0896149",
        "known_for_department": "Acting",
        "name": "Renée Victor",
        "place_of_birth": "San Antonio, Texas, USA",
        "popularity": 0.2758,
        "profile_path": "/wAVDqwFhQsRQgO6VIYq6T9Wbbx8.jpg"
    }
}