{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/nsWgxQrDcTVhSGzAu5kVlw64XB1.jpg",
                "genre_ids": [
                    10749,
                    35,
                    10770,
                    10402
                ],
                "id": 35558,
                "original_language": "en",
                "original_title": "Starstruck",
                "overview": "Pop star Christopher Wilde has fame, fortune and a big-budget Hollywood movie awaiting him. But after meeting Jessica Olson, a down-to-earth girl from the Midwest, he is faced with following his heart or doing what's best for his career.",
                "popularity": 3.6454,
                "poster_path": "/kuyJuNiiZvu5iNr8Dgv5y75v1uc.jpg",
                "release_date": "2010-02-14",
                "title": "Starstruck",
                "video": false,
                "vote_average": 7.027,
                "vote_count": 1209,
                "character": "Howard",
                "credit_id": "5659a424c3a36857da003839",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Hugh Dane was an American character actor. He is best known for playing Hank the security guard on the television sitcom The Office from 2005 to 2013.\n\nDane's professional acting career began with a role in the 1989 video game, It Came from the Desert before moving on to his first television role in a two-part episode of Hunter. In 1991, Dane acted in his first film role as a prison guard in the crime-thriller Ricochet. In the following years, Dane played small roles in popular television series' such as The Fresh Prince of Bel-Air, Hangin' with Mr. Cooper, Boy Meets World, Martin, Friends (\"The One With The Baby On The Bus\"), Sister, Sister, Monk and Girl Meets World.\n\nDane received his most recognition for his role as Hank, the head of security, in The Office.[1] He also starred in Netflix's Wet Hot American Summer: First Day of Camp as a judge.\n\nIn 1999, Dane returned to film, acting in such movies as Restraining Order, Joy Ride, Reflections: A Story of Redemption, Ralph & Stanley, Beautiful Dreamer, For Heaven's Sake, StarStruck, and Bridesmaids.\n\nDane died on May 16, 2018, at the age of 75 from pancreatic cancer.",
        "birthday": "1942-10-21",
        "deathday": "2018-05-16",
        "gender": 2,
        "homepage": null,
        "id": 154195,
        "imdb_id": "nm0199317",
        "known_for_department": "Acting",
        "name": "Hugh Dane",
        "place_of_birth": "Pheonix, Arizona, USA",
        "popularity": 0.3515,
        "profile_path": "/3ExDddVnNZu4tLtXSF4k0mRuZlm.jpg"
    }
}