{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/plWyKqUIenzqFjMrs1gu7Gjygfq.jpg",
                "genre_ids": [
                    53,
                    9648
                ],
                "id": 402,
                "original_language": "en",
                "original_title": "Basic Instinct",
                "overview": "Catherine, a novelist with an insatiable sexual appetite, becomes a prime suspect when her boyfriend is brutally murdered -- a crime she had described in her latest story.",
                "popularity": 6.2114,
                "poster_path": "/76Ts0yoHk8kVQj9MMnoMixhRWoh.jpg",
                "release_date": "1992-03-20",
                "title": "Basic Instinct",
                "video": false,
                "vote_average": 6.93,
                "vote_count": 4125,
                "character": "Nurse",
                "credit_id": "52fe423fc3a36847f800f5ab",
                "order": 24
            },
            {
                "adult": false,
                "backdrop_path": "/3HmLKhahTxX2ALTWlagr92pZrU7.jpg",
                "genre_ids": [
                    18
                ],
                "id": 462,
                "original_language": "en",
                "original_title": "Erin Brockovich",
                "overview": "A twice-divorced mother of three who sees an injustice, takes on the bad guy and wins -- with a little help from her push-up bra. Erin goes to work for an attorney and comes across medical records describing illnesses clustered in one nearby town. She starts investigating and soon exposes a monumental cover-up.",
                "popularity": 4.5699,
                "poster_path": "/jEMvWBWVjndZT0vJnLrRWi9ajea.jpg",
                "release_date": "2000-03-17",
                "title": "Erin Brockovich",
                "video": false,
                "vote_average": 7.442,
                "vote_count": 3426,
                "character": "Anna",
                "credit_id": "5f84fae78741c400364a4a60",
                "order": 25
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Adilah Barnes is one of few veteran actors in Hollywood who have not only mastered the art of successfully marketing herself, but also of utilizing all of her creative skills – all the while staying true to herself and maintaining her integrity.  She is currently involved with the CW’s 4400.  She has guest-starred on such tv series as CBS’s NCIS, Showtime’s Shameless, The Middle, ABC’s Body of Proof, NBC’s Harry’s Law and Prime Suspect. She is probably best known for her role as “Anne Marie” for 6 seasons on ABC’s Roseanne.\n\nHer film credits include playing opposite Sandra Bullock in the CastleRock Entertainment film, Murder By Numbers and the Universal blockbuster and award-winning Erin Brockovich with Julia Roberts.  She has also appeared opposite Ving Rhames in the heartwarming CBS Hallmark made-for-tv movie, Little John, among other credits.\n\nIn her role opposite Hilary Swank, as the infamous Ida B. Wells in HBO’s Iron – Jawed Angels, Barnes marched for women’s rights and ironically, in real life she is also a marcher and supporter for women.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.adilahbarnes.com/",
        "id": 154114,
        "imdb_id": "nm0055481",
        "known_for_department": "Acting",
        "name": "Adilah Barnes",
        "place_of_birth": null,
        "popularity": 0.0495,
        "profile_path": "/yXL6gH6R4oSTzXBQcp6WQX8Yipi.jpg"
    }
}