{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5e8V714wUtpPgMD9xD8NjTEqlyu.jpg",
                "genre_ids": [
                    28
                ],
                "id": 14746,
                "original_language": "en",
                "original_title": "Streets of Fire",
                "overview": "Raven Shaddock and his gang of merciless biker friends kidnap rock singer Ellen Aim. Ellen's former lover, soldier-for-hire Tom Cody, happens to be passing through town on a visit. In an attempt to save his star act, Ellen's manager hires Tom to rescue her. Along with a former soldier, they battle through dangerous cityscapes, determined to get Ellen back.",
                "popularity": 2.8832,
                "poster_path": "/tmYHBKCZkbmiUfhfOQKgfh0jvXK.jpg",
                "release_date": "1984-06-01",
                "title": "Streets of Fire",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 520,
                "character": "Addie",
                "credit_id": "592588589251413ba000f3ef",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Olivia Margarette Brown",
            "Olivia M. Brown"
        ],
        "biography": "​Olivia Margarette Brown (born April 10, 1960) is an American actress.\n\nBrown was born in Frankfurt, Germany and raised in Livonia, Michigan, United States. Her family eventually moved to California and she is also a graduate of Santa Monica High School. She played Det. Trudy Joplin on Miami Vice and Vanessa Hargraves on Designing Women. She also played a recurring character on 7th Heaven. She also played a recurring character on Moesha which she played Barbara Lee. She has also acted in several films, including Throw Momma from the Train, 48 Hrs., All Tied Up, and Streets of Fire.\n\nShe guest starred in an episode of Lois and Clark: The New Adventures of Superman as a psychic named Starr\n\nShe was married to Mykelti Williamson for two years. Her brother is Steve Brown, who played for the Houston Oilers of the NFL during the late 1980s.\n\nDescription above from the Wikipedia article Olivia Brown, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1960-04-10",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 154141,
        "imdb_id": "nm0114368",
        "known_for_department": "Acting",
        "name": "Olivia Brown",
        "place_of_birth": "Livonia, Michigan, USA",
        "popularity": 0.4355,
        "profile_path": "/gPagR6TAgiNh0n1dpUreTPwXvTv.jpg"
    }
}