{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ttBydD0SynC0TMkW3AcnmsySkLp.jpg",
                "genre_ids": [
                    10749,
                    14,
                    18,
                    35
                ],
                "id": 137,
                "original_language": "en",
                "original_title": "Groundhog Day",
                "overview": "A narcissistic TV weatherman, along with his attractive-but-distant producer, and his mawkish cameraman, is sent to report on Groundhog Day in the small town of Punxsutawney, where he finds himself repeating the same day over and over.",
                "popularity": 7.2346,
                "poster_path": "/gCgt1WARPZaXnq523ySQEUKinCs.jpg",
                "release_date": "1993-02-11",
                "title": "Groundhog Day",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 8407,
                "character": "Phil's Assistant Kenny",
                "credit_id": "52fe421dc3a36847f8004f25",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/k63j5qexRlpD3wxzETKfuZRVWiT.jpg",
                "genre_ids": [
                    18,
                    35,
                    10749,
                    14
                ],
                "id": 9007,
                "original_language": "en",
                "original_title": "Just Like Heaven",
                "overview": "Shortly after David Abbott moves into his new San Francisco digs, he has an unwelcome visitor on his hands: winsome Elizabeth Masterson, who asserts that the apartment is hers -- and promptly vanishes. When she starts appearing and disappearing at will, David thinks she's a ghost, while Elizabeth is convinced she's alive.",
                "popularity": 5.1174,
                "poster_path": "/2cLbyVNhEEaUJGg7rfbLtX6454I.jpg",
                "release_date": "2005-09-16",
                "title": "Just Like Heaven",
                "video": false,
                "vote_average": 6.954,
                "vote_count": 2469,
                "character": "Maitre D'",
                "credit_id": "52fe44d0c3a36847f80aba33",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/f5XOH9b9oV7yzIqhKDEXtDx0uz9.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 16553,
                "original_language": "en",
                "original_title": "Little Manhattan",
                "overview": "Ten-year-old Gabe was just a normal kid growing up in Manhattan until Rosemary Telesco walked into his life, actually into his karate class. But before Gabe can tell Rosemary how he feels, she tells him she will not be going to public school any more. Gabe has a lot more to learn about life, love, and girls.",
                "popularity": 2.1373,
                "poster_path": "/z0RNI1NMtsvLsuTo1rWZfNHVs1z.jpg",
                "release_date": "2005-09-26",
                "title": "Little Manhattan",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 730,
                "character": "Ralph",
                "credit_id": "52fe46da9251416c75085b7f",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/1Nyjb7aeRKynWgmOl8he5ZcvWLm.jpg",
                "genre_ids": [
                    35,
                    18,
                    14
                ],
                "id": 492,
                "original_language": "en",
                "original_title": "Being John Malkovich",
                "overview": "One day at work, unsuccessful puppeteer Craig finds a portal into the head of actor John Malkovich. The portal soon becomes a passion for anybody who enters its mad and controlling world of overtaking another human body.",
                "popularity": 3.6004,
                "poster_path": "/xVSvIwRNzwXSs0CLefiiG6A96m4.jpg",
                "release_date": "1999-10-29",
                "title": "Being John Malkovich",
                "video": false,
                "vote_average": 7.412,
                "vote_count": 4557,
                "character": "Guy in Restaurant",
                "credit_id": "566047f8c3a36875f100336a",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/qDVdTL1KqGmGLGsy7UPA3vksku7.jpg",
                "genre_ids": [
                    28,
                    12,
                    53
                ],
                "id": 9802,
                "original_language": "en",
                "original_title": "The Rock",
                "overview": "When vengeful General Francis X. Hummel seizes control of Alcatraz Island and threatens to launch missiles loaded with deadly chemical weapons into San Francisco, only a young FBI chemical weapons expert and notorious Federal prisoner have the skills to penetrate the impregnable island fortress and take him down.",
                "popularity": 7.9286,
                "poster_path": "/j5mxLNWjUlXUUk8weFBtnF4afIR.jpg",
                "release_date": "1996-06-07",
                "title": "The Rock",
                "video": false,
                "vote_average": 7.137,
                "vote_count": 4924,
                "character": "Francis Reynolds",
                "credit_id": "5f0f6477ac41610038cf88d3",
                "order": 38
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "William Garson Paszamant",
            "William Garson",
            "Willy Garson",
            "Will Garson",
            "ویلی گارسون"
        ],
        "biography": "Willie Garson Paszamant (February 20, 1964 – September 21, 2021) was an American actor. He appeared in over 75 films and more than 300 TV episodes. He was known for playing Stanford Blatch on the HBO series Sex and the City, in the related films Sex and the City and Sex and the City 2 and in the spin-off And Just Like That..., Mozzie in the USA Network series White Collar from 2009 to 2014, Ralph in the 2005 romantic comedy Little Manhattan, Gerard Hirsch in the reboot of Hawaii Five-0, and Martin Lloyd in the sci-fi series Stargate SG-1.\n\nGarson was born in Highland Park, New Jersey, the son of Muriel (née Schwartz) and Donald M. Paszamant. Garson was Jewish. He attended Camp Wekeela in Hartford, Maine, as a child for 11 years. He graduated in 1982 from Highland Park High School. In 1985, he received a Bachelor of Fine Arts degree in Theater from Wesleyan University and a Master of Fine Arts degree from the Yale Drama School.\n\nGarson began his career in theater, appearing in productions off-Broadway and on Broadway. He made his film debut in the 1989 comedy Troop Beverly Hills. He had his breakthrough role in 1998 as Stanford Blatch on Sex and the City. He played the role for the entire six-season run of the show and in the two subsequent films.\n\nGarson continued to work steadily in film and television throughout his career. He appeared in numerous other films, including The Rock (1996), There's Something About Mary (1998), and The Wedding Planner (2001). He also had recurring roles on the television shows NYPD Blue (1993), Friends (1995), and Hawaii Five-0 (2010).\n\nGarson was a talented actor who was known for his versatility and his ability to play a wide range of characters. He was also a gifted comedian and a scene-stealer. He will be remembered for his roles in Sex and the City, White Collar, and other films and television shows.\n\nGarson died on September 21, 2021, at the age of 57. He had been diagnosed with pancreatic cancer earlier that year.",
        "birthday": "1964-02-20",
        "deathday": "2021-09-21",
        "gender": 2,
        "homepage": null,
        "id": 1542,
        "imdb_id": "nm0308606",
        "known_for_department": "Acting",
        "name": "Willie Garson",
        "place_of_birth": "Highland Park, New Jersey, USA",
        "popularity": 0.6607,
        "profile_path": "/8M3aV0mys2MMFtsLag0Vjox9dzc.jpg"
    }
}