{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xga9dXEIJHAjNLGMjw4VDPH7LJB.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 9090,
                "original_language": "en",
                "original_title": "To Wong Foo, Thanks for Everything! Julie Newmar",
                "overview": "Manhattan drag queens Vida Boheme and Noxeema Jackson impress regional judges in competition, securing berths in the Nationals in Los Angeles. When the two meet pathetic drag novice Chi-Chi Rodriguez — one of the losers that evening — the charmed Vida and Noxeema agree to take the hopeless youngster under their joined wing. Soon the three set off on a madcap road trip across America and struggle to make it to Los Angeles in time.",
                "popularity": 2.777,
                "poster_path": "/xlRhO3TzTxCFn2s9LEcVi7s582t.jpg",
                "release_date": "1995-09-08",
                "title": "To Wong Foo, Thanks for Everything! Julie Newmar",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 708,
                "character": "Tommy",
                "credit_id": "5e0f35dc663b8700177f1a7f",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Michael S. Vartan (born November 27, 1968) is a French-American actor, known for his TV roles as Michael Vaughn on the ABC television action drama Alias, George Helen's on Bates Motel, James Walker on Big Shots, Terence Hoffman on the E! drama The Arrangement, and Dr. Tom Wakefield on the TNT medical drama Hawthorne. His best known film roles are as Sam Coulson in Never Been Kissed, Kevin Fields in Monster-in-Law, and Kevin Lassiter in The Next Best Thing.\n\nHis other film roles include The Pallbearer, One Hour Photo, Rogue, Colombiana, and Small Town Crime. He played the role of Lancelot in TNT's production of Marion Zimmer Bradley's The Mists of Avalon (2001).\n\nHe also had a guest appearance on Friends as Dr. Tim Burke, Tom Selleck's character's son.\n\nVartan co-hosts a weekly live sports program called Advanced Shouting with friends Dan Petriw and Noel Fogelman. The first episode was uploaded to YouTube in June 2020. The broadcast is also available via Facebook.\n\nHe was born in France and lived there until the age of 5 when he moved to the United States with his mother after his parents divorced. He moved back to France to be with his father until his high school years, and grew up a \"farm kid\" in a \"simple environment\" in Fleury, Manche, a small town in Normandy. At age eighteen, Vartan moved back with his mother in Los Angeles, telling her that he wanted to be an artist, because he did not wish to fulfill the mandatory military service required in France. He now considers himself to be American and is bilingual, being fluent in French and English.",
        "birthday": "1968-11-27",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 15424,
        "imdb_id": "nm0890232",
        "known_for_department": "Acting",
        "name": "Michael Vartan",
        "place_of_birth": "Boulogne-Billancourt, Hauts-de-Seine, Île-de-France, France",
        "popularity": 0.4442,
        "profile_path": "/5HCb1CxwIgiZAjKMe9BG8VtHE80.jpg"
    }
}