{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/iukXiB3Guz5VyTlraZiBnHT8Y0B.jpg",
                "genre_ids": [
                    878,
                    28
                ],
                "id": 1103,
                "original_language": "en",
                "original_title": "Escape from New York",
                "overview": "In a world ravaged by crime, the entire island of Manhattan has been converted into a walled prison where brutal prisoners roam free. After the US president crash-lands inside, war hero Snake Plissken has 24 hours to bring him back.",
                "popularity": 5.385,
                "poster_path": "/vH9llaphjAssRGi0k7e75tD40Ce.jpg",
                "release_date": "1981-05-23",
                "title": "Escape from New York",
                "video": false,
                "vote_average": 7.053,
                "vote_count": 3337,
                "character": "Romero",
                "credit_id": "52fe42e7c3a36847f802bc29",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/dm1bqDSw3MJTjYCeuNUv122BXFp.jpg",
                "genre_ids": [
                    53,
                    28,
                    80
                ],
                "id": 17814,
                "original_language": "en",
                "original_title": "Assault on Precinct 13",
                "overview": "A highway patrol officer, two criminals, and a station secretary form an unlikely alliance to defend a defunct Los Angeles precinct against a siege by a bloodthirsty street gang.",
                "popularity": 5.2402,
                "poster_path": "/RtGDEmXbSxE8NThCCY1SXFXLLw.jpg",
                "release_date": "1976-10-08",
                "title": "Assault on Precinct 13",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1133,
                "character": "White Warlord",
                "credit_id": "52fe474a9251416c75094239",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Thin, intense, antsy, and often unnerving character actor Frank Doubleday usually portrayed creepy villains in both movies and TV shows alike from the mid-1970's up until the early 1990's. Frank was born on January 28, 1945 in Norwich, Connecticut and came with his family to Los Angeles, California at age six. Doubleday made his film debut as an aggressive switchblade-wielding punk thug in the hilariously raunchy comedy The First Nudie Musical (1976). Doubleday's lean, hollow-eyed, sunken-cheeked face, closely cropped light blonde hair, skinny limbs, and slim build gave him a striking and potent screen presence that was put to especially effective use in two pictures for director John Carpenter: He's genuinely scary as the vicious street gang leader who kills little girl Kim Richards in cold blood in the terrific urban action classic Assault on Precinct 13 (1976) and was likewise memorably freaky as Isaac Hayes' ghoulish flunky \"Romero\" in the excellent futuristic science fiction cult favorite Escape from New York (1981). Doubleday's other noteworthy parts are a mob kingpin's conceited jerk son in Avenging Angel (1985), a fidgety prison inmate in the nifty science fiction item Space Rage (1985), a ferocious member of a roving murderous band of supernatural Eskimo spirits in the spooky Nomads (1986), a mercenary in Broadcast News (1987), and a sweaty, twitchy hoodlum who holds a bunch of fat ladies hostage in a laundromat in the funky urban science fiction hoot Dollman (1991). Among the TV shows Doubleday did guest appearances on are Amazing Stories (1985), Sledge Hammer! (1986), Stingray (1985), T.J. Hooker (1982), Hill Street Blues (1981), CHiPs (1977), The Incredible Hulk (1978), Charlie's Angels (1976), Wonder Woman (1975) and Starsky and Hutch (1975). Outside of acting, Frank also directed stage plays and taught acting at the Hollywood Court Theater. Doubleday died at age 73 from esophageal cancer on March 3, 2018 in Los Angeles, California.",
        "birthday": "1945-01-28",
        "deathday": "2018-03-03",
        "gender": 2,
        "homepage": null,
        "id": 15449,
        "imdb_id": "nm0234664",
        "known_for_department": "Acting",
        "name": "Frank Doubleday",
        "place_of_birth": "Norwich, Connecticut, USA",
        "popularity": 0.1223,
        "profile_path": "/iksQQYEtuZh6zdPLtDAkmV9iXaz.jpg"
    }
}