{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/g2s22rGjCTCYsjI1iAflem7HjdG.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 9428,
                "original_language": "en",
                "original_title": "The Royal Tenenbaums",
                "overview": "Royal Tenenbaum and his wife Etheline had three children and then they separated. All three children are extraordinary --- all geniuses. Virtually all memory of the brilliance of the young Tenenbaums was subsequently erased by two decades of betrayal, failure, and disaster. Most of this was generally considered to be their father's fault. \"The Royal Tenenbaums\" is the story of the family's sudden, unexpected reunion one recent winter.",
                "popularity": 4.6249,
                "poster_path": "/nG7hZJn7wQTSDCQT39Gy3s3tbrp.jpg",
                "release_date": "2001-10-05",
                "title": "The Royal Tenenbaums",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 4745,
                "character": "Dudley Heinsbergen",
                "credit_id": "59fcda30c3a3682e330013ca",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Stephen Lea Sheppard is a Canadian writer and former television and film actor. He played Dudley Heinsbergen in the 2001 Wes Anderson film The Royal Tenenbaums and geek guru Harris Trinsky on NBC dramedy Freaks and Geeks.\n\nSheppard was born in Gibsons, British Columbia, northwest of Vancouver. On a commentary track for the Freaks and Geeks episode, \"Looks and Books”, Judd Apatow shared that he gave Wes Anderson an \"acting reel\" he made of Sheppard's performance on the show, in order to help Sheppard get his Royal Tenenbaums role. These two roles remain Sheppard's only on-camera acting credits.\n\nBeginning in 2007, he has co-authored several modules for the role playing game Exalted.\n\nSheppard lives in Surrey, British Columbia.",
        "birthday": "1983-01-26",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1545799,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Stephen Lea Sheppard",
        "place_of_birth": null,
        "popularity": 0.0898,
        "profile_path": null
    }
}