{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bYimqNnizPUCnL5HOdoCW02IGmH.jpg",
                "genre_ids": [
                    18,
                    35,
                    10749
                ],
                "id": 74643,
                "original_language": "fr",
                "original_title": "The Artist",
                "overview": "Hollywood, 1927: As silent movie star George Valentin wonders if the arrival of talking pictures will cause him to fade into oblivion, he sparks with Peppy Miller, a young dancer set for a big break.",
                "popularity": 3.1239,
                "poster_path": "/z68py0ZqPgeacGPG54AGVRbNBS7.jpg",
                "release_date": "2011-10-12",
                "title": "The Artist",
                "video": false,
                "vote_average": 7.45,
                "vote_count": 3366,
                "character": "Film Clapper #1 (uncredited)",
                "credit_id": "566db37c92514169e200c28c",
                "order": 68
            },
            {
                "adult": false,
                "backdrop_path": "/vAsFwNkxV0cHJWRJXkshg76rJRQ.jpg",
                "genre_ids": [
                    10751,
                    18
                ],
                "id": 43959,
                "original_language": "en",
                "original_title": "Soul Surfer",
                "overview": "The true story of teen surfer Bethany Hamilton, who lost her arm in a shark attack and courageously overcame all odds to become a champion again, through her sheer determination and unwavering faith.",
                "popularity": 3.5547,
                "poster_path": "/cvgRxrEupUFeJ0xzUExJo4dMXbL.jpg",
                "release_date": "2011-04-08",
                "title": "Soul Surfer",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 1196,
                "character": "Halloween Party Surfer (uncredited)",
                "credit_id": "5f3f0e0113af5f0036dec04b",
                "order": 54
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Josh Margulies was born under a full moon in Nepal and raised in Hawai'i. He is an award winning comedic & romantic actor. When he was a little boy he always used to put on plays with his brother in front of the huge glass window at family gatherings. He eventually earned recognition in his quirky breakthrough role as the lead in the comedic TV pilot \"Surreal Estates\", where he plays a scientist & ghost-hunter. This pilot was subsequently featured at Cannes in 2019. In 2021 it was awarded as runner up for Best Ensemble. Although his forte is comedy, drama is not lost on this man; In 2018 he won a best supporting actor award as a concerned father in the dramatic Indie feature film, Sand Angels. The comedy pilot won best pilot in the 2016 Sunset Film Festival in Los Angeles. He plays alongside Dylan McDermott in Fox's very funny, \"LA to Vegas\". Margulies was featured in \"The Artist\" (Best Picture 2012). That year he debuted at the Hollywood Fringe Festival in Hollywood & won an award as best actor in a comedy playing a crazy alien! More recently Josh played the James Bond/ Indiana Jones type lead in \"The lost treasure\" and a father in the family comedy \"Caralique\". After that he traveled the globe for a spell -going to 17 countries in 7 months before returning to his career calling. He lives and continues to act in Paris, France with his lovely talented director wife and two little girls.\n\nJosh is also an award winning producer alongside his partner, the talented French director, Stella Tinucci. He is Welsh, Russian, Polish and French. Margulies is an avid traveler, big wave searcher and world surfer. He was born in Nepal under a full moon, held by mother Theresa and raised in Hawaii. His father Edward Margulies was a doctor of medicine who attended Johns Hopkins and traveled the earth during his residency. Edward found himself on an adventure in the Himalayas & met Sherry Nohonani Allen, Josh's mother, who was in Nepal doing missionary work.\n\nHis acting film debut came in college when he was asked to star in a remake of the Maltese Falcon. He played the Humphrey Bogart character \"Sam Spade\". He is a confident playful and rugged actor. In several other college films he has played the best friend, playboy or guy's guy. He has had roles ranging from physician, bartender, coach to CEO and stockbroker. His acting technique is bold and friendly.",
        "birthday": "1970-07-30",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.filmmakers.eu/en/actors/josh-margulies",
        "id": 1548521,
        "imdb_id": "nm3246920",
        "known_for_department": "Acting",
        "name": "Josh Margulies",
        "place_of_birth": "Katmandou, Nepal",
        "popularity": 0.0239,
        "profile_path": "/3S5tqX0cubAoTNLEPITX7C2YHNV.jpg"
    }
}