{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/scQf03Fm3jeyv4FH04qvi4fp4wh.jpg",
                "genre_ids": [
                    80,
                    35,
                    28
                ],
                "id": 402900,
                "original_language": "en",
                "original_title": "Ocean's Eight",
                "overview": "Debbie Ocean, a criminal mastermind, gathers a crew of female thieves to pull off the heist of the century at New York's annual Met Gala.",
                "popularity": 9.0605,
                "poster_path": "/MvYpKlpFukTivnlBhizGbkAe3v.jpg",
                "release_date": "2018-06-07",
                "title": "Ocean's Eight",
                "video": false,
                "vote_average": 6.968,
                "vote_count": 8525,
                "character": "Kendall Jenner",
                "credit_id": "587d8bd59251414143013c14",
                "order": 94
            },
            {
                "adult": false,
                "backdrop_path": "/5i2prsAzznXWGSmhkr9yMh5tnmO.jpg",
                "genre_ids": [
                    99
                ],
                "id": 567860,
                "original_language": "en",
                "original_title": "Fyre",
                "overview": "He promised supermodels and yachts, but delivered tents and cheese sandwiches. How one man engineered a music festival disaster.",
                "popularity": 3.1273,
                "poster_path": "/yFsP0BAJhAH3RTXCAnGvI1CtaUb.jpg",
                "release_date": "2019-01-18",
                "title": "Fyre",
                "video": false,
                "vote_average": 6.93,
                "vote_count": 974,
                "character": "Self (archive footage)",
                "credit_id": "5c469873c3a368477784d83e",
                "order": 38
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Kendall Nicole Jenner",
            "肯达尔·詹娜"
        ],
        "biography": "Kendall Nicole Jenner (born November 3, 1995) is an American model, television personality, and businesswoman. She is the daughter of Kris Jenner and Caitlyn Jenner and grew up as part of the Kardashian–Jenner family, first appearing on the reality series Keeping Up with the Kardashians (2007–2021). She later continued her television presence on Hulu’s The Kardashians (2022–present), becoming one of the most recognizable faces from the show.\n\nOutside of reality TV, Kendall pursued a career in modeling and became one of the leading figures in the fashion industry. She has walked for Chanel, Versace, Balmain, Marc Jacobs, and Givenchy, and has appeared in campaigns for Estée Lauder, Calvin Klein, and Fendi. She has also been featured on the covers of Vogue, Harper’s Bazaar, Elle, and other international fashion magazines. In 2017, Forbes listed her as the world’s highest-paid model, confirming her position as one of the most in-demand names in fashion.\n\nAlongside modeling, Kendall has built a presence in business and media. She co-founded the Kendall + Kylie clothing brand with her sister Kylie Jenner, appeared in cameo roles such as Ocean’s 8 (2018), and has also been part of televised fashion events like the Victoria’s Secret Fashion Show. With her mix of reality TV fame, fashion success, and entrepreneurial ventures, she has become a significant figure in global pop culture",
        "birthday": "1995-11-03",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.kendallj.com",
        "id": 1549005,
        "imdb_id": "nm2832525",
        "known_for_department": "Acting",
        "name": "Kendall Jenner",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.8711,
        "profile_path": "/ccREiRWn47w1yYLKNzosFYq8ok.jpg"
    }
}