{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cemjdP7HrUyJAry85vRT19Hidbi.jpg",
                "genre_ids": [
                    27
                ],
                "id": 138,
                "original_language": "en",
                "original_title": "Dracula",
                "overview": "British estate agent Renfield travels to Transylvania to meet the mysterious Count Dracula, who is interested in leasing a castle in London. After Dracula enslaves Renfield and drives him to insanity, the pair sail to London together and Dracula, a secret vampire, begins preying on London socialites.",
                "popularity": 3.1152,
                "poster_path": "/ueVSPt7vAba0XScHWTDWS5tNxYX.jpg",
                "release_date": "1931-02-12",
                "title": "Dracula",
                "video": false,
                "vote_average": 7.153,
                "vote_count": 1286,
                "character": "Renfield",
                "credit_id": "52fe421dc3a36847f8004fd5",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/hrED8MSOn4xJP9Cpk7WomUcFKGI.jpg",
                "genre_ids": [
                    27,
                    878
                ],
                "id": 229,
                "original_language": "en",
                "original_title": "Bride of Frankenstein",
                "overview": "Dr. Frankenstein and his monster both turn out to be alive, not killed as previously believed. Dr. Frankenstein wants to get out of the evil experiment business, but when a mad scientist, Dr. Pretorius, kidnaps his wife, Dr. Frankenstein agrees to help him create a new creature.",
                "popularity": 2.9539,
                "poster_path": "/5241zUwe7rC17MNc2QpCBKKdp1N.jpg",
                "release_date": "1935-04-20",
                "title": "Bride of Frankenstein",
                "video": false,
                "vote_average": 7.509,
                "vote_count": 1037,
                "character": "Karl",
                "credit_id": "52fe4229c3a36847f8008d6d",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/wFbPbJ9uRDpjY7micBTeolgkOA4.jpg",
                "genre_ids": [
                    18,
                    27,
                    878
                ],
                "id": 3035,
                "original_language": "en",
                "original_title": "Frankenstein",
                "overview": "Tampering with life and death, Henry Frankenstein pieces together salvaged body parts to bring a human monster to life; the mad scientist's dreams are shattered by his creation's violent rage as the monster awakens to a world in which he is unwelcome.",
                "popularity": 5.6174,
                "poster_path": "/mu6wHwH0IwCCaEYtpqujuPJYat1.jpg",
                "release_date": "1931-11-21",
                "title": "Frankenstein",
                "video": false,
                "vote_average": 7.464,
                "vote_count": 1679,
                "character": "Fritz",
                "credit_id": "52fe437fc3a36847f8058849",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/uGXid3UHMzoL2hyNfWSPDWkqbKC.jpg",
                "genre_ids": [
                    27,
                    878
                ],
                "id": 10787,
                "original_language": "en",
                "original_title": "The Invisible Man",
                "overview": "After experimenting on himself and becoming invisible, scientist Jack Griffin, now aggressive due to the drug's effects, seeks a way to reverse the experiment at any cost.",
                "popularity": 2.2867,
                "poster_path": "/ewfUA5pMEJrmQCdI4TsHmLlIUbf.jpg",
                "release_date": "1933-11-03",
                "title": "The Invisible Man",
                "video": false,
                "vote_average": 7.507,
                "vote_count": 893,
                "character": "Reporter (uncredited)",
                "credit_id": "575d8c6e9251411584000075",
                "order": 22
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Dwight Iliff Fry",
            "Dwight I. Frye"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nDwight Iliff Frye (February 22, 1899 – November 7, 1943) was an American stage and screen actor, noted for his appearances in the classic horror films Dracula, Frankenstein and Bride of Frankenstein.\n\nFrye was born in Salina, Kansas. Nicknamed \"The Man with the Thousand-Watt Stare,\" and \"The Man of a Thousand Deaths,\" he specialized in the portrayal of mentally unbalanced characters, including his signature role, the madman Renfield in Tod Browning's 1931 version of Dracula. Later that same year he also played the hunchbacked assistant in the film Frankenstein. (This character, named Fritz, is often mistakenly referred to as Ygor, a character originated by Béla Lugosi in the later film Son of Frankenstein.)\n\nFrye had a prominent role in the 1933 horror film The Vampire Bat, starring Lionel Atwill, Melvyn Douglas, and Fay Wray, in which he played Herman, a half-wit suspected of being a killer. He also had a memorable role in the classic Bride of Frankenstein, in which he played Karl. The part of Karl was originally much longer and many extra scenes of Frye were shot as a sub plot but were edited out of the final version to shorten the running time as well as to appease the censor boards. The most memorable of these \"cut scenes\" was that of Karl killing the Burgomaster portrayed by E. E. Clive. No known prints of these scenes survive today, but photographs of the scene were used to illustrate the scene's synopsis and are included in the recent Universal DVD release of the film.\n\nDuring the early 1940s, Frye alternated between film roles and appearing on stage in a variety of productions ranging from comedies to musicals, as well as appearing in a stage version of Dracula. In 1924 he played the Son in a translation of Luigi Pirandello's Six Characters in Search of an Author.[1] There was a Dwight Frye Fan Club at one time,[2] but it is currently dormant. He also made a contribution to the war effort by working nights as a tool designer for Lockheed Aircraft. Frye's strong resemblance to former Secretary of War Newton D. Baker helped land him what would have been a substantial role in the biographical film Wilson, based on the life of U.S. President Woodrow Wilson, but he died of a heart attack while riding on a bus in Hollywood a few days before filming was to have begun.\n\nFrye was interred in Glendale's Forest Lawn Memorial Park Cemetery.\n\nDescription above from the Wikipedia article Dwight Frye, licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": "1899-02-22",
        "deathday": "1943-11-07",
        "gender": 2,
        "homepage": null,
        "id": 1549,
        "imdb_id": "nm0296859",
        "known_for_department": "Acting",
        "name": "Dwight Frye",
        "place_of_birth": "Salina, Kansas, USA",
        "popularity": 0.2688,
        "profile_path": "/7tTCehS5FN9YuRKSWmlL5rygabD.jpg"
    }
}