{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fKrFGB96kVeJ9uE83Jc4fIWBgqO.jpg",
                "genre_ids": [
                    18,
                    10752
                ],
                "id": 1116,
                "original_language": "en",
                "original_title": "The Wind That Shakes the Barley",
                "overview": "In 1920s Ireland young doctor Damien O'Donovan prepares to depart for a new job in a London hospital. As he says his goodbyes at a friend's farm, British Black and Tans arrive, and a young man is killed. Damien joins his brother Teddy in the Irish Republican Army, but political events are soon set in motion that tear the brothers apart.",
                "popularity": 3.4732,
                "poster_path": "/9XquDdOGrlC0EAbPoOXALqS2dDh.jpg",
                "release_date": "2006-06-23",
                "title": "The Wind That Shakes the Barley",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 846,
                "character": "Donacha",
                "credit_id": "52fe42e8c3a36847f802bde3",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Born and residing in Cork City, Ireland, Gerard first discovered his love for acting when he was 12 years old when he was cast as \"Big Con\" in David Puttnam's feature \"The War of the Buttons\". At 12 years old and being away from home, Gerard kept himself occupied offset by practicing magic tricks which he learned from some crew members. These little tricks will go on to change Gerard's life forever! Eight years later Gerard has gone on to become a rising star in magic noted for his sleight of hand skills, and becoming \"The Close up Champion\" from the worlds largest magic organisation \"The international brotherhood of magicians\". Today, Gerard is a sought-after magic performer in Ireland. With magic quickly taking over Gerard's life, his love for acting never diminished, landing roles such as Donnacha in Ken Loach's \"The Wind that Shakes the Barley\" was just one of the many highlights of Gerard's acting career. Gerard continues to pursue his love for both magic perfection and acting.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.starnow.com/u/gerardkearney/",
        "id": 15499,
        "imdb_id": "nm1918199",
        "known_for_department": "Acting",
        "name": "Gerard Kearney",
        "place_of_birth": "County Cork, Ireland",
        "popularity": 0.091,
        "profile_path": null
    }
}