{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5ymJuqUWwQZ7yq63UE8DNpFBELr.jpg",
                "genre_ids": [
                    10752,
                    18,
                    53
                ],
                "id": 336050,
                "original_language": "hu",
                "original_title": "Saul fia",
                "overview": "In the horror of 1944 Auschwitz, a prisoner forced to burn the corpses of his own people finds moral survival trying to save from the flames the body of a boy he takes for his son, seeking to give him a proper jewish burial.",
                "popularity": 3.4047,
                "poster_path": "/9ZcX6NjCJam5uwkooXffhHI29Lj.jpg",
                "release_date": "2015-06-11",
                "title": "Son of Saul",
                "video": false,
                "vote_average": 7.13,
                "vote_count": 1122,
                "character": "Bearded Prisoner",
                "credit_id": "56737e4ac3a3685ee2000aec",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Todd Charmont is an American actor living in Berlin, Germany. Todd was born and raised, for the first half of his childhood, on a farm in the United States. By the time he ventured out on his own at the age of 18, he had visited a large portion of the contiguous United States, Hawaii and Canada, he had changed residence over a half dozen times and attended an even greater number of schools. In the two years to follow, Todd continued a nomadic lifestyle, made his first parachute jump, became a parachute rigger, worked for the French National Skydiving team in the United States and France and then in Brazil for the World Championships where they won first place, became a test jumper for the world’s largest sport parachute manufacturer, and before he turned 21, became a skydiving instructor and the youngest Tandem Master at that time.  During the filming of DAYS OF THUNDER, Todd was introduced to the film industry, while involved in Tom Cruise´s early skydiving training, in the capacity of a free fall video-cameraman. After DAYS OF THUNDER, Todd joined a large number of the crew members as they migrated to the set of BILLY BATHGATE and then THE LAST OF THE MOHICANS where Todd earned his first film credit as a crew member.  Over eight thousand jumps, over 60 films and over 15 years of living in Berlin, Todd has expanded his horizons once again and is presently working as an actor. His first acting role in a feature film, SON OF SAUL, was Directed by László Nemes who was awarded the GRAND PRIX at the 68th Cannes Film Festival 2015, has been nominated for a Golden Globe Award and is Hungary’s entry for a foreign language film Oscar nomination for the 2016 Academy Awards",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "http://charmont.de",
        "id": 1550426,
        "imdb_id": "nm1052273",
        "known_for_department": "Acting",
        "name": "Todd Charmont",
        "place_of_birth": null,
        "popularity": 0.0193,
        "profile_path": "/3iAxYPABtEWKumMKMZKJNmF1X4e.jpg"
    }
}