{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/oQ024BtJgArg8WI4zfuc2vkCJno.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 363676,
                "original_language": "en",
                "original_title": "Sully",
                "overview": "On 15 January 2009, the world witnessed the 'Miracle on the Hudson' when Captain 'Sully' Sullenberger glided his disabled plane onto the Hudson River, saving the lives of all 155 souls aboard. However, even as Sully was being heralded by the public and the media for his unprecedented feat of aviation skill, an investigation was unfolding that threatened to destroy his reputation and career.",
                "popularity": 5.9412,
                "poster_path": "/4vs83YcJ8TsabADDtaeCJ6ZTjYY.jpg",
                "release_date": "2016-09-07",
                "title": "Sully",
                "video": false,
                "vote_average": 7.197,
                "vote_count": 7442,
                "character": "Alison",
                "credit_id": "644377d5651fcf02fb9cfa2e",
                "order": 16
            },
            {
                "adult": false,
                "backdrop_path": "/rFY9V4Dhq7lbIu6LlpzbL9u2K2E.jpg",
                "genre_ids": [
                    35
                ],
                "id": 257211,
                "original_language": "en",
                "original_title": "The Intern",
                "overview": "70-year-old widower Ben Whittaker has discovered that retirement isn't all it's cracked up to be. Seizing an opportunity to get back in the game, he becomes a senior intern at an online fashion site, founded and run by Jules Ostin.",
                "popularity": 9.0769,
                "poster_path": "/9UoAC9tu8kIyRy8AcJnGhnH0gOH.jpg",
                "release_date": "2015-09-23",
                "title": "The Intern",
                "video": false,
                "vote_average": 7.226,
                "vote_count": 7016,
                "character": "ATF Interviewer #2",
                "credit_id": "5692bef392514144530005bb",
                "order": 19
            },
            {
                "adult": false,
                "backdrop_path": "/xoFolYFMGVzIOjYhEhyBiYbBpqK.jpg",
                "genre_ids": [
                    18
                ],
                "id": 10647,
                "original_language": "en",
                "original_title": "Pay It Forward",
                "overview": "Like some other kids, 12-year-old Trevor McKinney believed in the goodness of human nature. Like many other kids, he was determined to change the world for the better. Unlike most other kids, he succeeded.",
                "popularity": 6.1473,
                "poster_path": "/62OIokwaxFwBFWM147ijLJsaVJD.jpg",
                "release_date": "2000-10-20",
                "title": "Pay It Forward",
                "video": false,
                "vote_average": 7.36,
                "vote_count": 1894,
                "character": "Molly",
                "credit_id": "5f2c51f7f5483600368464f3",
                "order": 27
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Molly Kate Bernard"
        ],
        "biography": "Molly Kate Bernard (born April 10, 1988) is an American actress. She is best known for her role as Lauren Heller on the television series Younger.\n\nMolly Kate Bernard was born in Brooklyn, New York. She began her career in 2000 in the comedy drama Pay It Forward beside Kevin Spacey and Haley Joel Osment. After completing school, she returned to the screen by interpreting the leading part in a short film named Wrestling with the Past realized by Jason Leinwand. In 2013, she played Wendy during the seventh episode of the fifth season of the television series Royal Pains alongside Mark Feuerstein and Paulo Costanzo. The same year, she obtained a recurring role in the television series Alpha House where she played Angie Sullivan until 2014. In 2015, she played a recurring role in the television series Younger alongside Sutton Foster and Hilary Duff, where she portrayed Lauren Heller. She was promoted to series regular in season two. In 2015, she had a small role in the Nancy Meyers comedy The Intern, beside Robert De Niro and Anne Hathaway. Bernard has a bachelor's degree from Skidmore College and a MFA in acting from Yale School of Drama.\n\nBernard is the granddaughter of actor Joseph Bernard, who co-founded the Lee Strasberg Theatre and Film Institute. She attended the Las Vegas Academy in Las Vegas, Nevada.",
        "birthday": "1988-04-10",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1551382,
        "imdb_id": "nm0076331",
        "known_for_department": "Acting",
        "name": "Molly Bernard",
        "place_of_birth": "Brooklyn, New York City, New York, USA",
        "popularity": 0.4817,
        "profile_path": "/vgHY5N57Zw9RgudQT0BEL4UoIxI.jpg"
    }
}