{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/byQdu1nzQLI9t1VeoP1xuQfru3L.jpg",
                "genre_ids": [
                    80,
                    53
                ],
                "id": 996,
                "original_language": "en",
                "original_title": "Double Indemnity",
                "overview": "A seductive housewife draws an insurance salesman into a plot of adultery and crime to collect on her husband's life insurance.",
                "popularity": 3.5639,
                "poster_path": "/rVNYZZgfhwqVMMWlBmxOfWqnwCj.jpg",
                "release_date": "1944-07-06",
                "title": "Double Indemnity",
                "video": false,
                "vote_average": 8.106,
                "vote_count": 1902,
                "character": "Keyes' Secretary (uncredited)",
                "credit_id": "5c31f3010e0a267eb33e333d",
                "order": 29
            },
            {
                "adult": false,
                "backdrop_path": "/jXZ2tyJl44yKvh22I6ooQwU5rFM.jpg",
                "genre_ids": [
                    35,
                    10749,
                    18
                ],
                "id": 164,
                "original_language": "en",
                "original_title": "Breakfast at Tiffany's",
                "overview": "Holly Golightly is an eccentric New York City playgirl determined to marry a Brazilian millionaire. But when young writer Paul Varjak moves into her apartment building, her past threatens to get in their way.",
                "popularity": 5.401,
                "poster_path": "/79xm4gXw4l7A5D0XukUOJRocFYQ.jpg",
                "release_date": "1961-10-06",
                "title": "Breakfast at Tiffany's",
                "video": false,
                "vote_average": 7.64,
                "vote_count": 4328,
                "character": "Harriet - Party Guest in Gold Dress (uncredited)",
                "credit_id": "5c31f4419251416d9471716c",
                "order": 62
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/2L8U8rUyWeFTb6n1egTNeJsEsvj.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749
                ],
                "id": 284,
                "original_language": "en",
                "original_title": "The Apartment",
                "overview": "Bud Baxter is a minor clerk in a huge New York insurance company, until he discovers a quick way to climb the corporate ladder. He lends out his apartment to the executives as a place to take their mistresses. Although he often has to deal with the aftermath of their visits, one night he's left with a major problem to solve.",
                "popularity": 4.4619,
                "poster_path": "/2nt8Z54Bce74ycithkzlSNkgXJB.jpg",
                "release_date": "1960-06-21",
                "title": "The Apartment",
                "video": false,
                "vote_average": 8.2,
                "vote_count": 2472,
                "credit_id": "5c31faf30e0a2655ee429aaf",
                "department": "Crew",
                "job": "Choreographer"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Miriam Franklin",
            "Miriam Nelson Meyers"
        ],
        "biography": "Miriam Lois Frankel was born in Chicago on Sept. 21, 1919, the only child of Daniel Frankel, a salesman who later produced nightclub shows, and Miriam Elizabeth (Bly) Frankel, a seamstress who went on to a show-business wardrobe department career. At 19 she made her Broadway debut, in Sing Out the News (1938), a musical revue, with June Allyson, whose songs included Sing Ho for Private Enterprise. In 1941, two weeks after Pearl Harbor, she married Gene Nelson, a fellow dancer and actor. They moved to Los Angeles, and good luck followed. Having lunch at Paramount one day with a friend, she ran into a New York pal and came home with a seven-year acting-dancing contract. Ms. Nelson’s onscreen appearances included Lady in the Dark (1944), a straight acting role as Edward G. Robinson’s secretary in Double Indemnity (1944) and versatile dance work in Duffy’s Tavern (1945). After the Nelsons divorced in 1956, she took up choreography full time. Her television projects included The Red Skelton Hour, Father Knows Best, The Lucy Show, The Love Boat and Murder, She Wrote. Ms. Nelson’s first credited big-screen choreography was on Blake Edwards’s He Laughed Last (1956), a crime comedy about a chorus girl. Her final screen credit was Out of the Cold, a romantic drama starring Keith Carradine, released on DVD in 2001.",
        "birthday": "1922-09-21",
        "deathday": "2018-08-12",
        "gender": 1,
        "homepage": null,
        "id": 1551984,
        "imdb_id": null,
        "known_for_department": "Crew",
        "name": "Miriam Nelson",
        "place_of_birth": null,
        "popularity": 0.0393,
        "profile_path": "/nps1ihmQZsmAKBlbhBWq87zI8S1.jpg"
    }
}