{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8uQRpN3JkD24yL1NjUP2YdSsgNf.jpg",
                "genre_ids": [
                    18
                ],
                "id": 925,
                "original_language": "en",
                "original_title": "Do the Right Thing",
                "overview": "Salvatore \"Sal\" Fragione is the Italian owner of a pizzeria in Brooklyn. A neighborhood local, Buggin' Out, becomes upset when he sees that the pizzeria's Wall of Fame exhibits only Italian actors. Buggin' Out believes a pizzeria in a black neighborhood should showcase black actors, but Sal disagrees. The wall becomes a symbol of racism and hate to Buggin' Out and to other people in the neighborhood, and tensions rise.",
                "popularity": 4.5675,
                "poster_path": "/63rmSDPahrH7C1gEFYzRuIBAN9W.jpg",
                "release_date": "1989-06-14",
                "title": "Do the Right Thing",
                "video": false,
                "vote_average": 7.768,
                "vote_count": 1883,
                "character": "ML",
                "credit_id": "52fe428ec3a36847f8027dbb",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/bX5UVSVDOcuFMJh2zWN6gXbKswM.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 2056,
                "original_language": "en",
                "original_title": "The Station Agent",
                "overview": "When his only friend dies, a man born with dwarfism moves to rural New Jersey to live a life of solitude, only to meet a chatty hot dog vendor and a woman dealing with her own personal loss.",
                "popularity": 3.59,
                "poster_path": "/kjJg6eJa9I9flfHaJG67ecEv8YX.jpg",
                "release_date": "2003-12-05",
                "title": "The Station Agent",
                "video": false,
                "vote_average": 7.357,
                "vote_count": 717,
                "character": "Henry Styles",
                "credit_id": "52fe4330c3a36847f804125b",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/hdi07iPiYKVVzYUSKVU00r4j3ck.jpg",
                "genre_ids": [
                    18,
                    53
                ],
                "id": 10734,
                "original_language": "en",
                "original_title": "Escape from Alcatraz",
                "overview": "San Francisco Bay, January 18, 1960. Frank Lee Morris is transferred to Alcatraz, a maximum security prison located on a rocky island. Although no one has ever managed to escape from there, Frank and other inmates begin to carefully prepare an escape plan.",
                "popularity": 8.2846,
                "poster_path": "/uORr2GXQnyqgBOg6tVsRCJD2qxc.jpg",
                "release_date": "1979-06-22",
                "title": "Escape from Alcatraz",
                "video": false,
                "vote_average": 7.513,
                "vote_count": 2970,
                "character": "English",
                "credit_id": "52fe43ac9251416c7501996d",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/mRVzzlXswVmXWqCPni9JIla5fmj.jpg",
                "genre_ids": [
                    18
                ],
                "id": 3116,
                "original_language": "en",
                "original_title": "Midnight Cowboy",
                "overview": "Joe Buck is a wide-eyed hustler from Texas hoping to score big with wealthy New York City women; he finds a companion in Enrico \"Ratso\" Rizzo, an ailing swindler with a bum leg and a quixotic fantasy of escaping to Florida.",
                "popularity": 4.8818,
                "poster_path": "/f7YLzOxwWzeEdo7RhAlPSBTYa8.jpg",
                "release_date": "1969-05-25",
                "title": "Midnight Cowboy",
                "video": false,
                "vote_average": 7.511,
                "vote_count": 1511,
                "character": "Bartender",
                "credit_id": "595a9d549251410bfa044110",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Paul Benjamin (born 1938) is an American actor.\n\nBenjamin was born in Pelion, South Carolina. He made his film debut in 1969 as a bartender in Midnight Cowboy. After a small role in Sidney Lumet's The Anderson Tapes, he did extensive television work in the 1970s.\n\nA few notable exceptions were a major role in Barry Shear's Across 110th Street, and smaller parts in Gordon Parks' biopic Leadbelly, Arthur Marks' Friday Foster, and Don Siegel's prison film Escape from Alcatraz. He gave exceptional performances in the TV adaptations of I Know Why The Caged Bird Sings and Gideon's Trumpet. He later starred in the HBO movie The Man Who Broke 1,000 Chains, based on the novel by Robert E. Burns.\n\nOn the big screen in the 1990s, Benjamin worked with some well known directors. He appeared in Spike Lee's Do The Right Thing, Robert Townsend's The Five Heartbeats, Bill Duke's Hoodlum, and John Singleton's Rosewood.\n\nOn television, he appeared in the 1994 pilot episode of ER, which led to his recurring role of homeless man Al Ervin during the next few seasons. Benjamin also worked on the American Masters documentary of Pulitzer Prize-winning author Ralph Ellison, which aired on PBS.\n\nAfter 2000, he appeared primarily in small independent films like Stanley's Gig, The Station Agent, Deacons For Defense, and James Hunter's 2004 drama Back in the Day.\n\nHe recently made a special appearance in the independent film The Talk Man, directed by Gene Gallerano.\n\nDescription above from the Wikipedia article Paul Benjamin, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1938-02-04",
        "deathday": "2019-06-28",
        "gender": 2,
        "homepage": null,
        "id": 15534,
        "imdb_id": "nm0071345",
        "known_for_department": "Acting",
        "name": "Paul Benjamin",
        "place_of_birth": "Pelion, South Carolina, USA",
        "popularity": 0.4583,
        "profile_path": "/6t4RCyCoynTG0mk5godo7AW3doK.jpg"
    }
}