{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bgkFOoXEQMRjKkCvgoj7smdGbuh.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 157350,
                "original_language": "en",
                "original_title": "Divergent",
                "overview": "In a world divided into factions based on personality types, Tris learns that she's been classified as Divergent and won't fit in. When she discovers a plot to destroy Divergents, Tris and the mysterious Four must find out what makes Divergents dangerous before it's too late.",
                "popularity": 7.9056,
                "poster_path": "/aNh4Q3iuPKDMPi2SL7GgOpiLukX.jpg",
                "release_date": "2014-03-14",
                "title": "Divergent",
                "video": false,
                "vote_average": 6.91,
                "vote_count": 13105,
                "character": "Dauntless Patrol #4",
                "credit_id": "56883d04c3a368227b019584",
                "order": 36
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Yasmine Aker is an actress, singer, and songwriter based out of Los Angeles, California. She was born in Dubai, United Arab Emirates to Iranian parents and later moved to Canada. She began performing at an early age, starring in school plays and community events. She sang soprano with the Voices of Bahá Choir for a performance at Carnegie Hall, New York, during the Conference of the Arts 2002. She has a passion for public service and was awarded the TD Canada Trust Scholarship for Community Leadership. Yasmine studied psychology at York University and the University of Western Ontario in London.\n\nAfter competing in the Miss World franchise as the titleholder, Miss London 2006, and Miss World Canada Photogenic 2006, she turned her sights back to her childhood dream of pursuing a career in film and television. She has starred in various motion pictures and television shows in Canada and the United States. Yasmine embarked on a solo singing career in 2009 with the Grammy-nominated Canadian production team KUYA, who have worked with international stars such as Alessia Cara, Nelly Furtado, Akon, and Genuwine. She has since released three albums, her latest album titled \"Unvarnished\". Her musical sound combines elements from her Middle Eastern roots, pop, neo-soul, and electronica. Yasmine moved to Los Angeles in 2011 to continue her work in film and television.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.yasmineaker.com/",
        "id": 1557161,
        "imdb_id": "nm3309544",
        "known_for_department": "Acting",
        "name": "Yasmine Aker",
        "place_of_birth": "Dubai, United Arab Emirates",
        "popularity": 0.9039,
        "profile_path": "/uwwkJ8CP5zeojmIRfuhLk450bGV.jpg"
    }
}