{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rFY9V4Dhq7lbIu6LlpzbL9u2K2E.jpg",
                "genre_ids": [
                    35
                ],
                "id": 257211,
                "original_language": "en",
                "original_title": "The Intern",
                "overview": "70-year-old widower Ben Whittaker has discovered that retirement isn't all it's cracked up to be. Seizing an opportunity to get back in the game, he becomes a senior intern at an online fashion site, founded and run by Jules Ostin.",
                "popularity": 9.0769,
                "poster_path": "/9UoAC9tu8kIyRy8AcJnGhnH0gOH.jpg",
                "release_date": "2015-09-23",
                "title": "The Intern",
                "video": false,
                "vote_average": 7.226,
                "vote_count": 7017,
                "character": "Lewis",
                "credit_id": "5692beb0c3a3684cf8002c20",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Jason Orley is an American writer-director originally from Michigan. He grew up in Michigan with two older brothers and attended Lahser High School in the Detroit area, where he was exposed to film and TV production early on through a high school program and was accepted into NYU’s summer high school film program. During or after college, he interned for Nancy Meyers, including on It’s Complicated (2009) and later appeared as an actor in The Intern (2015).\n\nOrley’s debut feature film was Big Time Adolescence (2019), which he both wrote and directed. The screenplay for Big Time Adolescence had been one of his earliest, and it was written while he was in his early twenties; it appeared on the 2014 Black List. The film made its world premiere at the Sundance Film Festival in 2019 and was nominated for the Grand Jury Prize in Drama.\n\nHis second feature as director is I Want You Back (2022), a romantic comedy starring Charlie Day and Jenny Slate. In addition to feature films, Orley has done TV work as a writer (for example, Graves on Epix) and developed pilots for various networks and streaming platforms.\n\nKnown for writing from personal experience, Orley has said that Big Time Adolescence was inspired by aspects of his childhood—growing up with older brothers, having mentors or role models who were not conventional, and exploring friendship and identity in adolescence. His style tends to favour authenticity, allowing characters to breathe rather than strictly controlling every detail, and staying grounded in emotional truth, even in comedic scenarios.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1561688,
        "imdb_id": "nm3753276",
        "known_for_department": "Directing",
        "name": "Jason Orley",
        "place_of_birth": null,
        "popularity": 1.119,
        "profile_path": "/ih6oR7w6OOF3jweg5RNQqG84L0R.jpg"
    }
}