{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lNUP9ymEHolzjLIHyoAkpHRQZxq.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 110160,
                "original_language": "fr",
                "original_title": "Laurence Anyways",
                "overview": "The story of an impossible love between a woman named Fred and a transgender woman named Laurence who reveals her inner desire to become her true self.",
                "popularity": 2.3226,
                "poster_path": "/d8BpJ9qOQE7VFFqaV1XDdGfMsP7.jpg",
                "release_date": "2012-05-18",
                "title": "Laurence Anyways",
                "video": false,
                "vote_average": 7.65,
                "vote_count": 876,
                "character": "Simon Deltreuil",
                "credit_id": "64c2575a13a32000e21b2841",
                "order": 25
            },
            {
                "adult": false,
                "backdrop_path": "/rD6VVei45TLnkCdDucJDDUmb3e3.jpg",
                "genre_ids": [
                    80,
                    18,
                    53
                ],
                "id": 22302,
                "original_language": "fr",
                "original_title": "Polytechnique",
                "overview": "A dramatization of the Montreal Massacre of 1989 where several female engineering students were murdered by an unstable misogynist.",
                "popularity": 1.1309,
                "poster_path": "/k0xmtct9cSseksuFKMSXxM8hfni.jpg",
                "release_date": "2009-02-06",
                "title": "Polytechnique",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 661,
                "character": "Male Student in First Classroom",
                "credit_id": "5f950e7a7f0540003436eaa4",
                "order": 37
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Alexis Lefebvre studied at The National Theatre School of Canada. He has trod the boards of countless theaters and started his career with the Dave Saint-Pierre (Foudre, Over my dead body, Un peu de tendresse bordel de merde, La pornographie des âmes). He also worked with Éric jean (Les mystères de Quat'sous) and La Chapelle theater (Caligula-Remix, De rage, Plyball, ...). Alexis is playing in the play La nuit du 4 au 5 (m.e.s Claude Poissant, text Rachel Graton), presented at the Centre du Théâtre d'Aujourd'hui. You could also have seen him in television in Toute la vérité, Les hauts et les bas de Sophie Paquin, Yamaska, Mensonges, Pour Sarah and District 31.\n\nIn the last years, you could have seen him in La nuit du 4 au 5, Pan B, Les yeux fermés, Les Cavaliers, L’oeil du cyclone and 5e rang. As well as in the impressive series Les pays d'en haut in the role of Dr. Marignon. He also was part of the series Les Simone and Les honorable. In cinema, he worked with Louis Bélanger in Les mauvaises herbes and with Robin Aubert in L'origine d'un cri. In 2020, you could have seen him in the ambitious series C’est comme ça que je t’aime, wrote by François Létourneau et directed by Jean-François Rivard.\n\nFurthermore, he lends his voice on many narratives and dubbling projects, ranging from original documentary series made in Quebec, to an impressive number of commercials and several works of fiction for both television and film.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://agencerbl.com/talents/alexis-lefebvre/",
        "id": 1562330,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Alexis Lefebvre",
        "place_of_birth": null,
        "popularity": 0.0495,
        "profile_path": "/4y8lwvTBzQMVRmBxcP98N86rV4r.jpg"
    }
}