{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/i7n9u1SppzXcSO2EVgwEehzABzm.jpg",
                "genre_ids": [
                    37
                ],
                "id": 17529,
                "original_language": "en",
                "original_title": "True Grit",
                "overview": "The murder of her father sends a teenage tomboy on a mission of 'justice', which involves avenging her father's death. She recruits a tough old marshal, 'Rooster' Cogburn because he has 'true grit', and a reputation of getting the job done.",
                "popularity": 3.5697,
                "poster_path": "/9TjGjAD2deCtIG4ebi8LhIyFK6j.jpg",
                "release_date": "1969-06-11",
                "title": "True Grit",
                "video": false,
                "vote_average": 7.331,
                "vote_count": 818,
                "character": "Goudy",
                "credit_id": "52fe472f9251416c75090841",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Alfred Ryder, the veteran actor who appeared on radio and Broadway and in the movies and TV and who also was a renowned stage director, was born Alfred Jacob Corn on January 5, 1916, in New York City. He made his professional debut as an actor at the age of eight and attended New York City's Professional Children's School. His Broadway debut came in 1929, when the 13-year-old Ryder played a \"lost boy\" in Eva Le Gallienne's production of J.M. Barrie's \"Peter Pan\". Ryder studied acting with Benno Schneider, Robert Lewis and Lee Strasberg. He appeared in the 1938 Broadway production of \"Our Town\" - his Broadway debut as an adult performer - as well as numerous Broadway productions before World War II, including the 1939 revival of Clifford Odets's \"Awake and Sing!\". For many years he was the voice of Sammy in the radio serial \"Rise of the Goldbergs\" Ryder joined the Army Air Force during World War II, eventually appearing in the U.S. Army Air Force's gala Broadway stage show \"Winged Victory\" in 1943. The following year, he made his movie debut as \"PFC Alfred Ryder\" in the film version of the show Winged Victory (1944)). After the war he made more films, including director Anthony Mann's classic 1947 film noir T-Men (1947). On Broadway, he appeared as Oswald in the 1948 revival of Henrik Ibsen's \"Ghosts\" and as Mark Antony in the 1950 production of \"Julius Caesar\". Also that year, he appeared as Orestes in the Broadway play \"The Tower Beyond Tragedy\".\n\nRyder had the singular honor of being cast as the understudy for Laurence Olivier in one of the legendary actor's greatest roles, that of Archie Rice, in the 1958 Broadway production of John Osborne's \"The Entertainer\". Olivier's Archie Rice is considered one of the greatest performances of the 20th century, and Ryder was chosen to keep the Broadway patrons in their seats in the event the great British theatrical knight couldn't go on. Ryder also appeared in the original Broadway production of Eugène Ionesco's absurdist masterpiece \"Rhinoceros\" in 1960.\n\nA noted theatrical stage director with such companies as Washington, D.C.'s Arena Stage, Ryder made his Broadway directorial debut with the play \"A Far Country\" in 1961. He subsequently directed two more Broadway productions, \"The Exercise\" in 1968 and the 1971 revival of August Strindberg's \"Dance of Death.\"\n\nDespite his achievements on the stage, film and radio, Ryder is mostly remembered as a prolific and versatile TV character actor. He made over 100 appearances on TV, including memorable turns on Star Trek: The Original Series (1966) (he appeared as Prof. Robert Crater in the series' very first aired episode, \"The Man Trap\"), Voyage to the Bottom of the Sea (1964) (two appearances as the ghost of Nazi U-boat commander Capt. Gerhardt Krueger), and The Invaders (1967) (appearing as The Alien Leader). Ryder retired from screen acting in 1976 to concentrate on the stage, both as an actor and director. He died on April 16, 1995 in Englewood, NJ, at the age of 79. He was married to actress Kim Stanley, with whom he had a child, from 1957 until 1964, and he was the brother of actress Olive Deering.\n\nFrom the IMDB Mini Bio for Alfred Ryder",
        "birthday": "1916-01-05",
        "deathday": "1995-04-16",
        "gender": 2,
        "homepage": null,
        "id": 15620,
        "imdb_id": "nm0753086",
        "known_for_department": "Acting",
        "name": "Alfred Ryder",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.1982,
        "profile_path": "/bAZhNIshbrhbwykjwJnBcemmBjS.jpg"
    }
}