{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xXHZeb1yhJvnSHPzZDqee0zfMb6.jpg",
                "genre_ids": [
                    28,
                    12,
                    80
                ],
                "id": 385128,
                "original_language": "en",
                "original_title": "F9",
                "overview": "Dominic Toretto and his crew battle the most skilled assassin and high-performance driver they've ever encountered: his forsaken brother.",
                "popularity": 8.004,
                "poster_path": "/deEmLILTPejEb6OGsXRJ5MCvyDW.jpg",
                "release_date": "2021-05-19",
                "title": "F9",
                "video": false,
                "vote_average": 7.038,
                "vote_count": 7460,
                "character": "Leysa",
                "credit_id": "5dafa87d1cac8c001b0d13bc",
                "order": 35
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Bacardi",
            "Belcalis Almanzar",
            "Belcalis Marlenis Almánzar",
            "Belcalis Marlenis Cephus"
        ],
        "biography": "Belcalis Marlenis Almánzar (born October 11, 1992), known professionally as Cardi B, is an American rapper, songwriter, and actress. Her first studio album, Invasion of Privacy (2018) debuted at number one on the Billboard 200, was certified triple platinum by the RIAA, and was the best-selling female rap album of the 2010s according to Billboard. Critically acclaimed, it made Cardi B the only woman to win the Grammy Award for Best Rap Album as a solo artist, and marked the first female rap album after fifteen years to be nominated for Album of the Year. It spawned two number-one singles on the Billboard Hot 100. With \"Bodak Yellow\", Cardi B became the first female rapper to achieve a Diamond-certified song by the RIAA, as well as the second female rapper to top the Hot 100 with a solo output—following Lauryn Hill in 1998. \"I Like It\" marked the first time a female rapper attained multiple number-one songs on the chart. With her feature on \"Girls Like You\" with band Maroon 5, she became the first female rapper to achieve multiple Diamond-certified songs by the RIAA. Her accolades include a Grammy Award, eight Billboard Music Awards, five Guinness World Records, six American Music Awards, fourteen BET Hip Hop Awards, and two ASCAP Songwriter of the Year awards. In 2018 Time magazine included her on their annual list of the 100 most influential people in the world, and in 2020, Billboard honored her as Woman of the Year. Cardi B made her film debut in Hustlers (2019) directed by Lorene Scafaria, opposite Jennifer Lopez and Constance Wu.",
        "birthday": "1992-10-11",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.cardibofficial.com/",
        "id": 1562344,
        "imdb_id": "nm8054799",
        "known_for_department": "Acting",
        "name": "Cardi B",
        "place_of_birth": "Washington Heights, New York City, New York, USA",
        "popularity": 0.7131,
        "profile_path": "/x3hazhdT0Lcpv2ys4WG6Af2F24S.jpg"
    }
}