{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tmP4COlAaowO0FniW30aatOcmMq.jpg",
                "genre_ids": [
                    18,
                    35,
                    10749,
                    10402
                ],
                "id": 243,
                "original_language": "en",
                "original_title": "High Fidelity",
                "overview": "After his long-time girlfriend dumps him, a thirty-year-old record store owner seeks to understand why he is unlucky in love while recounting his \"top five breakups of all time\".",
                "popularity": 3.1403,
                "poster_path": "/e2LZGB62GMhv3Fo8tDZjY87I81a.jpg",
                "release_date": "2000-03-17",
                "title": "High Fidelity",
                "video": false,
                "vote_average": 7.12,
                "vote_count": 2080,
                "character": "Laura",
                "credit_id": "52fe422cc3a36847f80098eb",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Iben Hjejle (born March 22, 1971) is a Danish actress, notable for starring in the John Cusack film High Fidelity (2000). In Denmark, she is best known for appearing in the Danish television sitcom Langt fra Las Vegas (Far from Las Vegas), and playing the girlfriend of Danish comedian Casper Christensen, her former real life boyfriend. She also plays Christensen's girlfriend in the sitcom Klovn (Clown).\n\nHjejle was born in Copenhagen. She has starred in a series of Danish movies, including a Dogme movie, and also in Danish-produced action movies such as Gamle mænd i nye biler (Old Men in New Cars). She also played the Swedish Queen Sofia Magdalena in SVT's successful period drama production of Gustav III:s äktenskap (The Marriage of Gustav III) in 2001.\n\nHjejle also appeared in the 1997 film Portland, in Mifune's Last Song in 2000, The Emperor's New Clothes in 2002, and in Dreaming of Julia and Flickering Lights in 2003. Iben Hjejle was a part of the Danish popular television series Anna Pihl until its ending in April 2008, after 3 seasons. She had a part in Lars von Trier's Direktøren for det hele (2006, also known as The Boss of It All).\n\nShe turned down the role of Eowyn in Peter Jackson's The Lord of the Rings film trilogy because she didn't like the idea of being so far from home.",
        "birthday": "1971-03-22",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1562,
        "imdb_id": "nm0005013",
        "known_for_department": "Acting",
        "name": "Iben Hjejle",
        "place_of_birth": "København, Danmark",
        "popularity": 0.6941,
        "profile_path": "/7eowXOGOSYlg1T6RWmJizLQKFJE.jpg"
    }
}