{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kzXUQnrUnHUGHuwWbgf9KpoU3qr.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 544401,
                "original_language": "en",
                "original_title": "Cherry",
                "overview": "Cherry drifts from college dropout to army medic in Iraq - anchored only by his true love, Emily. But after returning from the war with PTSD, his life spirals into drugs and crime as he struggles to find his place in the world.",
                "popularity": 2.9009,
                "poster_path": "/pwDvkDyaHEU9V7cApQhbcSJMG1w.jpg",
                "release_date": "2021-02-26",
                "title": "Cherry",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1323,
                "character": "Sh*tty Bank Manager",
                "credit_id": "654417229d6e3306c88e7b78",
                "order": 42
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Marine Corps combat veteran Davis Aguila is a native of Cleveland, Ohio. He graduated from James Ford Rhodes High School and joined the United States Marine Corps in 2003. Assigned to the 2nd Marine Division, he served in the 3rd Battalion, 8th Marines based out of Camp Lejeune, North Carolina. In early 2004, he deployed to Haiti with Operation Secure Tomorrow followed by two consecutive deployments in Iraq. Davis returned in 2007 and served an additional three years in the Reserves. During this time, he traveled to Quantico, Virginia to train pre-deployment Reserve Marines in convoy formations, vehicle and personnel searches and S.W.A.T. tactics. Throughout his service, Davis's natural talents helped his fellow Marines maintain their cohesiveness and motivation. He boosted morale by being charismatic and outgoing. He loves to entertain and this allowed him to be of deeper service to his unit. Upon separating from the Marine Corps in 2010, Davis pursued a career in entertainment. Represented by The Talent Group, he booked his first regional commercial in 2011 with Blue Cross Blue Shield of Western New York. While exploring other artistic outlets, Davis landed multiple theater roles. First being cast as Manta Ray in 'Akarui'; a play by Jen Silverman and directed by Raymond Bobgan. Davis' recent works include a television mini-series, 'T.R.A.C.E.: A Doctor Who Fan Film', a web series, 'Greek Chronicles', a television movie, 'With This Ring', and movies, 'Captain America: The Winter Soldier' and 'The Tank'. Along with Commercial and Film work, he continues his work in Theater and Performing arts.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1563268,
        "imdb_id": "nm5168683",
        "known_for_department": "Acting",
        "name": "Davis Aguila",
        "place_of_birth": null,
        "popularity": 0.0861,
        "profile_path": "/hQjeVR7EygYXvqk2H7QI5Awu0RC.jpg"
    }
}