{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/P82NAcEsLIYgQtrtn36tYsj41m.jpg",
                "genre_ids": [
                    10751,
                    35,
                    12,
                    16
                ],
                "id": 748783,
                "original_language": "en",
                "original_title": "The Garfield Movie",
                "overview": "Garfield, the world-famous, Monday-hating, lasagna-loving indoor cat, is about to have a wild outdoor adventure! After an unexpected reunion with his long-lost father – scruffy street cat Vic – Garfield and his canine friend Odie are forced from their perfectly pampered life into joining Vic in a hilarious, high-stakes heist.",
                "popularity": 15.4256,
                "poster_path": "/xYduFGuch9OwbCOEUiamml18ZoB.jpg",
                "release_date": "2024-04-30",
                "title": "The Garfield Movie",
                "video": false,
                "vote_average": 7.04,
                "vote_count": 1326,
                "character": "Nolan (voice)",
                "credit_id": "65541fc70816c700c3daebce",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/uVlUu174iiKhsUGqnOSy46eIIMU.jpg",
                "genre_ids": [
                    18,
                    10749,
                    14
                ],
                "id": 402431,
                "original_language": "en",
                "original_title": "Wicked",
                "overview": "In the land of Oz, ostracized and misunderstood green-skinned Elphaba is forced to share a room with the popular aristocrat Glinda at Shiz University, and the two's unlikely friendship is tested as they begin to fulfill their respective destinies as Glinda the Good and the Wicked Witch of the West.",
                "popularity": 16.6767,
                "poster_path": "/2E1x1qcHqGZcYuYi4PzVZjzg8IV.jpg",
                "release_date": "2024-11-20",
                "title": "Wicked",
                "video": false,
                "vote_average": 6.932,
                "vote_count": 2407,
                "character": "Pfannee",
                "credit_id": "675aafb47e7cb94bdf1ec0ea",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "ボウエン・ヤン",
            "بوون یانگ"
        ],
        "biography": "Bowen Yang (born November 6, 1990) is an American actor, comedian, podcaster, and writer. Yang was hired to join the writing staff of the NBC sketch comedy series Saturday Night Live in September 2018, ahead of its 44th season, and a year later was promoted to on-air cast status for SNL's 45th season. He made history becoming the first SNL featured player to be nominated for a Primetime Emmy Award in 2021. He was promoted to repertory status before the 47th season.\n\nYang has appeared in the television series Girls5Eva, Ziwe, and The Other Two and is a cast member on Awkwafina Is Nora from Queens. He is also known for his appearances in the LGBTQ romantic comedies Fire Island and Bros, both released in 2022. He co-hosts a comedy pop-culture podcast, Las Culturistas, with Matt Rogers. In January 2019, he was named to Forbes magazine's 30 Under 30 Hollywood & Entertainment list.\n\nDescription above from the Wikipedia article Bowen Yang, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1990-11-06",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1564920,
        "imdb_id": "nm6299248",
        "known_for_department": "Acting",
        "name": "Bowen Yang",
        "place_of_birth": "Brisbane, Queensland, Australia",
        "popularity": 0.7775,
        "profile_path": "/lrebxaz4BGJucBW79cakZ0HsSa1.jpg"
    }
}