{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/84h6avqHvW2TgLfERuqYkQwzjp1.jpg",
                "genre_ids": [
                    27,
                    53
                ],
                "id": 1130276,
                "original_language": "en",
                "original_title": "Succubus",
                "overview": "A new father going through a marital separation joins a dating app and matches with a beautiful but mysterious young woman... whose powers of seduction and manipulation entangle him in a mystery more horrifying than he could have ever imagined.",
                "popularity": 7.0566,
                "poster_path": "/nyGKQrctWNmhSvto8h60AhZ3iLz.jpg",
                "release_date": "2024-10-06",
                "title": "Succubus",
                "video": false,
                "vote_average": 9.3,
                "vote_count": 170,
                "character": "Chris",
                "credit_id": "646beae22bcf6701389612e5",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Brendan Andolsek Bradley ",
            "Brendan A. Bradley"
        ],
        "biography": "Born and raised in North  Carolina, Brendan graduated with Honors from New York University's Tisch  School of the Arts. To further hone his skills, Brendan spent time in  London at the Royal Academy of Dramatic Art (RADA). When not on stage or  in class, Brendan dedicated himself to developing and producing  independent films and theater throughout New York City. His first play,  Jettison, received productions in Manhattan and Miami and was published a  year later.  Brendan first moved to Los Angeles to film September 12th  for which he won the Methodfest Best Actor Award in 2009. His talent and  passion quickly earned him success in the online entertainment  community with appearances in The Legend of Neil, The Station and his  own Squatters series. As a producer, he also developed and produced  transmedia campaigns for Post-It Notes, DentaBurst, Kimberly Clark and  KABC's Frosty, Heidi & Frank.  He currently thrives in Los Angeles  continuing to work in film, television and transmedia entertainment.",
        "birthday": "1983-05-05",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1564490,
        "imdb_id": "nm1731701",
        "known_for_department": "Acting",
        "name": "Brendan Bradley",
        "place_of_birth": "Durham, North Carolina, USA",
        "popularity": 1.5503,
        "profile_path": "/I3SeZ7gDnN8JDQUA5bf4iB3W5u.jpg"
    }
}