{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bYimqNnizPUCnL5HOdoCW02IGmH.jpg",
                "genre_ids": [
                    18,
                    35,
                    10749
                ],
                "id": 74643,
                "original_language": "fr",
                "original_title": "The Artist",
                "overview": "Hollywood, 1927: As silent movie star George Valentin wonders if the arrival of talking pictures will cause him to fade into oblivion, he sparks with Peppy Miller, a young dancer set for a big break.",
                "popularity": 3.1239,
                "poster_path": "/z68py0ZqPgeacGPG54AGVRbNBS7.jpg",
                "release_date": "2011-10-12",
                "title": "The Artist",
                "video": false,
                "vote_average": 7.45,
                "vote_count": 3366,
                "character": "Director #3 (Finale)",
                "credit_id": "566da9d59251415ec500bd63",
                "order": 30
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Bob Glouberman (born May 3, 1968) is an American actor who has appeared in over 100 television shows, mainly sitcoms.\n\nGlouberman was born in Brooklyn, New York. He has had recurring roles on the television shows Without a Trace, The Closer (the CBS Tom Selleck sitcom), Spin City, Lateline, and Mad About You, as well as recurring voiceover roles on the cartoons Handy Manny, Digimon Tamers, Rave Master, and Men in Black: The Series. He has also appeared on Desperate Housewives, The Closer (the Kyra Sedgewick drama), Ugly Betty, Close to Home, Curb Your Enthusiasm, Arrested Development, iCarly, Malcolm in the Middle, The West Wing, and ER. His unique look and demeanor have led him to play on several occasions the role of the 'nightmare blind date' to many of Hollywood's preeminent leading ladies, including Carmen Electra in Fat Actress, Calista Flockhart in Ally McBeal, and Jenny McCarthy in the film Dirty Love. He is also the co-founder of the Los Angeles Race Fantastique (or, LARF for short). LARF is an elaborate scavenger hunt which runs public races, private races, and daily races for tourists in Cozumel, Mexico, St Thomas Virgin Islands and Los Angeles.\n\nSource: Article \"Bob Glouberman\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1968-05-03",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 156685,
        "imdb_id": "nm0323067",
        "known_for_department": "Acting",
        "name": "Bob Glouberman",
        "place_of_birth": "Brooklyn, New York, USA",
        "popularity": 0.076,
        "profile_path": "/qGLILxbHOwX0McLOoMhteFfJqZ3.jpg"
    }
}