{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/smkjSDuCRlOcOAASYTRCZG0MgUc.jpg",
                "genre_ids": [
                    28,
                    12,
                    36,
                    18
                ],
                "id": 602063,
                "original_language": "ja",
                "original_title": "るろうに剣心 最終章 The Final",
                "overview": "In 1879, Kenshin and his allies face their strongest enemy yet: his former brother-in-law Enishi Yukishiro and his minions, who've vowed their revenge.",
                "popularity": 6.1814,
                "poster_path": "/7bbEASVf9XWtfxWiuWUMY3uyhTb.jpg",
                "release_date": "2021-04-23",
                "title": "Rurouni Kenshin: The Final",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 510,
                "character": "Enishi Yukishiro",
                "credit_id": "5e5a9519357c0000132725a5",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "あらた まっけんゆう",
            "真剣佑",
            "Mackenyu Arata",
            "Mackenyu Maeda",
            "Macken",
            "아라타 마켄유",
            "แมกเคนยู",
            " ماكينيو",
            "Маккэнъю Арата",
            "新田 真剣佑",
            "前田真剣佑",
            "ماکنیو"
        ],
        "biography": "Mackenyu (新田 真剣佑, born November 16, 1996) is a Japanese actor born in Los Angeles, California. He is the son of actor and martial artist Sonny Chiba. He attended Beverly Hills High School in their Advanced Placement Program and appeared in a few films and TV shows while growing up. As a young child, Mackenyu had many interests including horseback riding, Yabusame, Kyokushin Karate (he was placed third at the US Kyokushin Karate Nationals), gymnastics, water polo, and wrestling (for which he became the school representative). He was also into music, playing piano since he was 10 years old, and later participated in the brass band of his high school in Beverly Hills, playing saxophone, and flute.\n\nAt the age of 15, Mackenyu watched a movie of Haruma Miura and got inspired to pursue acting professionally in Japan. He held on to the dream of co-starring with the actor once he established his career, which then came true in the movie adaptation of Gunjō Senki (2021). Mackenyu landed his first feature film lead role in Take a Chance (2015) and was featured in the acclaimed short movie Tadaima (2015) for which he won a best supporting actor award at the Asians of Films festival. He moved to Japan later in the same year.\n\nHis fame grew in Japan after landing the role of Eiji Tomari in Kamen Rider Drive: Surprise Future (2015). In 2016, he made his stage debut in the Japanese musical Boys Over Flower (Hana Yori Dango: The Musical), which prepared him for his future major roles in the stage-musicals ZEROTOPIA (2018) and Hoshi no Daichi ni Furu Namida (2020). He had a prominent role in the two part feature film Chihayafuru Part I & II (2016) which made him a big name in Japan. Mackenyu started to expand his acting opportunities in Hollywood with a supporting role in the film Pacific Rim: Uprising (2018). In 2021, he starred as the final villain, Yukishiro Enishi, in the Rurouni Kenshin series. He portrayed Scar in the live-action sequel of Fullmetal Alchemist (2022). He gained global popularity when he landed the role of Roronoa Zoro in the live-action series adaptation of One Piece (2023). Drawing on his martial arts background, Mackenyu performs his own stunts and is highly skilled in sword fighting.",
        "birthday": "1996-11-16",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.mackenfamily.jp/",
        "id": 1566805,
        "imdb_id": "nm5018289",
        "known_for_department": "Acting",
        "name": "Mackenyu",
        "place_of_birth": " Los Angeles, California, USA",
        "popularity": 1.1024,
        "profile_path": "/bacZSFemex2oUexBccrbIksGxGz.jpg"
    }
}