{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5r2BZajlRZqnOc6s2BS0aiFDcne.jpg",
                "genre_ids": [
                    18,
                    37
                ],
                "id": 4512,
                "original_language": "en",
                "original_title": "The Assassination of Jesse James by the Coward Robert Ford",
                "overview": "Outlaw Jesse James is rumored to be the 'fastest gun in the West'. An eager recruit into James' notorious gang, Robert Ford eventually grows jealous of the famed outlaw and, when Robert and his brother sense an opportunity to kill James, their murderous action elevates their target to near mythical status.",
                "popularity": 3.677,
                "poster_path": "/2d1S6fJS80fvseg6mJE8eq5o7Kx.jpg",
                "release_date": "2007-09-20",
                "title": "The Assassination of Jesse James by the Coward Robert Ford",
                "video": false,
                "vote_average": 7.041,
                "vote_count": 2621,
                "character": "Martha Bolton",
                "credit_id": "544cc64ec3a36872e0001f62",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/x3mFfOKOzIi1ROSgy9bgyYq7zDH.jpg",
                "genre_ids": [
                    18
                ],
                "id": 342737,
                "original_language": "en",
                "original_title": "20th Century Women",
                "overview": "In 1979 Santa Barbara, California, Dorothea Fields is a determined single mother in her mid-50s who is raising her adolescent son, Jamie, at a moment brimming with cultural change and rebellion. Dorothea enlists the help of two younger women – Abbie, a free-spirited punk artist living as a boarder in the Fields' home and Julie, a savvy and provocative teenage neighbour – to help with Jamie's upbringing.",
                "popularity": 2.1717,
                "poster_path": "/mso2rEr9i0MilRIOao5HaWFipS9.jpg",
                "release_date": "2016-12-28",
                "title": "20th Century Women",
                "video": false,
                "vote_average": 7.325,
                "vote_count": 1186,
                "character": "Julie's Mother",
                "credit_id": "589c17fbc3a36874ce000f53",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Alison A. Elliott (born 19 May 1970) is an American actress. Elliott was born in San Francisco, CA, the daughter of Barbara, a teacher of nursing, and Bob Elliott, a computer executive. She moved with her family to Tokyo, Japan when she was 4 years old, and then moved back to San Francisco when she was 8, where she later attended an arts high school. At 14, her modeling career began, and in 1989, she moved to Los Angeles to star as a teen-aged model on the TV sitcom Living Dolls (1989). She is perhaps best known for her roles in films, such as Underneath (1994), The Spitfire Grill (1996), The Wings of the Dove (1997), and Birth (2004). She also had one of the leading roles in the BBC production, Buccaneers (1995). In the 2007 western The Assassination of Jesse James by the Coward Robert Ford, Elliott plays the memorable role of Martha Bolton, the older sister of Robert Ford. In addition to her film roles, Elliott has narrated audio books, including Belle Prater's Boy by Ruth White and its sequel The Search for Belle Prater.\n\nDescription above from the Wikipedia article Alison Elliott, licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": "1970-05-19",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 15675,
        "imdb_id": "nm0254362",
        "known_for_department": "Acting",
        "name": "Alison Elliott",
        "place_of_birth": "San Francisco, California, USA",
        "popularity": 0.4799,
        "profile_path": "/vn7cFU2IcTz4C1EQXlf2w0M4Qcq.jpg"
    }
}