{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/A29oACLcWmIo8RDzNH7GNQziBbG.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749
                ],
                "id": 450489,
                "original_language": "en",
                "original_title": "Irreplaceable You",
                "overview": "A stunning cancer diagnosis spurs Abbie to seek a future girlfriend for fiancé and childhood sweetheart Sam, who's clueless when it comes to dating.",
                "popularity": 2.1095,
                "poster_path": "/hkflwtWCJffdDSwg63fdDFbwOvS.jpg",
                "release_date": "2018-02-16",
                "title": "Irreplaceable You",
                "video": false,
                "vote_average": 6.95,
                "vote_count": 709,
                "character": "Melanie",
                "credit_id": "5a779545c3a3682251006c9a",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/1hdorswm5HPxb81xq84H9gqveUq.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 371638,
                "original_language": "en",
                "original_title": "The Disaster Artist",
                "overview": "An aspiring actor in Hollywood meets an enigmatic stranger by the name of Tommy Wiseau, the meeting leads the actor down a path nobody could have predicted; creating the worst movie ever made.",
                "popularity": 2.3925,
                "poster_path": "/2HuLGiyH0TPYxnCvYHAxc8K738o.jpg",
                "release_date": "2017-03-12",
                "title": "The Disaster Artist",
                "video": false,
                "vote_average": 7.107,
                "vote_count": 3619,
                "character": "Receptionist",
                "credit_id": "5a8e39f60e0a263e7700b291",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jessie Hannah Ennis"
        ],
        "biography": "Jessie Hannah Ennis (born June 15, 1991) is an American actor, director, and writer.\n\nEnnis was born in Boston but moved to Los Angeles at the age of 2. She is the daughter of American actor and comedian John Ennis. She graduated from Sarah Lawrence College.\n\nEnnis began her acting career in the early 2010s with roles in sitcoms like Veep and Married. During this time she also had roles in comedy films such as G.B.F. (2013) with Natasha Lyonne and Megan Mullally, and Hits with Meredith Hagner and Matt Walsh.\n\nIn 2012 she released a short film entitled The Arm, which she co-wrote and co-directed with friends Brie Larson and Sarah Ramos.\n\nEnnis continued her work in film and television with her role as Debbie in Life of the Party starring Melissa McCarthy and Maya Rudolph. She also played the role of Rachel in The House starring Will Ferrell and Amy Poehler. She also played Erin Brill in Better Call Saul starring Bob Odenkirk and Rhea Seehorn. She gained wider recognition starring as Jo, a power-hungry and ruthless assistant, in the comedy series Mythic Quest on Apple TV+. She had a recurring role as Jenny in season 2 of The Flight Attendant, a thriller series on HBO Max with Kaley Cuoco and Rosie Perez.\n\nIn 2021 Ennis co-hosted a podcast with Brie Larson titled Learning Lots. The podcast explored topics such as regret, reflection, and flow.",
        "birthday": "1991-06-15",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1569001,
        "imdb_id": "nm2080924",
        "known_for_department": "Acting",
        "name": "Jessie Ennis",
        "place_of_birth": "Boston, Massachusetts, U.S.",
        "popularity": 0.2673,
        "profile_path": "/Rx6zznL7EVBuOueSPfsuPlPvun.jpg"
    }
}