{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2TkuCpt75P5CyRgW1606dkY4JwM.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 4104,
                "original_language": "en",
                "original_title": "Benny & Joon",
                "overview": "A mentally ill young woman finds her love in an eccentric man who models himself after Buster Keaton.",
                "popularity": 2.5792,
                "poster_path": "/t1IVTmj0TrVt5zxps7VRSdvLKSo.jpg",
                "release_date": "1993-04-16",
                "title": "Benny & Joon",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 794,
                "character": "Claudia",
                "credit_id": "52fe43adc3a36847f8066f97",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Liane Alexandra Curtis"
        ],
        "biography": "Daughter of Jack Curtis and Paulette Rubinstein was born in NYC on July 11, 1965. She made her debut on the pilot of \"Sesame Street\" (1969) at the ripe age of 4. Liane went to the Lycee Francais de New York and then to the Rudolf Steiner School. She studied acting with Anthony Mannino and Bill Alderson. Liane worked behind the scenes throughout her childhood dubbing several foreign films into English. Liane was a member of the Metropolitain and City Opera children's choruses. Liane's feature film debut was in John Sayles's Baby It's You (1983) in 1983. She was given special permission by SAG to work as an adult even though she was still a minor. Liane currently lives happily in Los Angeles with her husband and three children. She has written several songs which she has been known to play at coffee houses on the Westside of LA from time to time and works in TV and Film as often as she can. - IMDb Mini Biography By: Liane Curtis",
        "birthday": "1965-07-11",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 157054,
        "imdb_id": "nm0193421",
        "known_for_department": "Acting",
        "name": "Liane Curtis",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.1308,
        "profile_path": "/fyyOSTh2JyebrorJf8mP7ZMwwIo.jpg"
    }
}