{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1fI06RK90Vp7ybQxs84ep1iQrqD.jpg",
                "genre_ids": [
                    80,
                    53,
                    28
                ],
                "id": 9846,
                "original_language": "en",
                "original_title": "To Live and Die in L.A.",
                "overview": "When his longtime partner on the force is killed, reckless U.S. Secret Service agent Richard Chance vows revenge, setting out to nab dangerous counterfeit artist Eric Masters.",
                "popularity": 3.2689,
                "poster_path": "/2iW3pSihBIhXjnBQmUJ0mAiZbB5.jpg",
                "release_date": "1985-11-01",
                "title": "To Live and Die in L.A.",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 709,
                "character": "Max Waxman",
                "credit_id": "52fe453ac3a36847f80c31a1",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Alexander Wise Allport Jr.",
            "Chris Allport"
        ],
        "biography": "Christopher Allport (June 17, 1947 – January 25, 2008) was an American actor.\n\nAlexander Wise Allport Jr. was born in Boston. His acting life began at the age of nine in New Canaan, Connecticut, at the Children's Theatre. While at Northwestern University, he worked with director Paul Sills and Story Theatre. He performed in New York with the Public Theater at Lincoln Center, and with Ensemble Studio Theatre; and in Los Angeles at the Taper, South Coast Repertory and with Padua Playwrights. In 2007, he wrote and starred in The Backroad Home, a theatrical memoir with his original music, directed and developed by Paul Linke and produced by his wife, Susan Hayden (Ruskin Group Theatre).\n\nOne of his earliest television roles was as Tim McGowan on the soap opera Another World (1973–74). Around 1975 or 1976, Allport did a screen test with actress Amy Irving for the parts of Han Solo and Princess Leia, respectively, for the upcoming filming of the 1977 movie Star Wars. Neither actor got the parts, which went to Harrison Ford and Carrie Fisher, respectively.\n\nHis film credits include Savage Weekend, To Live and Die in L.A., Jack Frost, Jack Frost 2: Revenge of the Mutant Killer Snowman, and Garden Party, which was released in 2008. He died shortly after the latter film was completed.\n\nHis list of television credits includes appearances on such programs as Midnight Caller, The X-Files, Commander In Chief, ER, Felicity, Mad Men, and Brothers & Sisters.\n\nHis role as Andrew Campbell on Mad Men was set to be a recurring one, though he only got to appear in one episode (season one, episode 4: \"New Amsterdam\"). In season two, after Allport's death, they killed off his character in the American Airlines crash storyline and, later, dedicated the episode to him.\n\nOn January 25, 2008, Allport was one of three men killed by three avalanches near the Mountain High ski resort in Wrightwood, San Bernardino County, California (in the San Gabriel Mountains). There were two other fatalities: Michael McKay, an off-duty member of the resort's ski patrol, and Darin Bodie Coffey. A fourth man, snowboarder Oscar Gonzales, escaped after getting lost and hitting a rock. Winter storms had been recently hitting Southern California; the San Gabriel Mountains, while usually free of avalanches, had been hit by 3 feet (0.91 m) of snow the week before Allport died.",
        "birthday": "1947-06-17",
        "deathday": "2008-01-25",
        "gender": 2,
        "homepage": null,
        "id": 157169,
        "imdb_id": "nm0021597",
        "known_for_department": "Acting",
        "name": "Christopher Allport",
        "place_of_birth": "Boston, Massachusetts, USA",
        "popularity": 1.549,
        "profile_path": "/zmPu6I56j0EBEAWp6QW3nq9DxDg.jpg"
    }
}