{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gKk8Bg4qpHfniAJC3phzCZpkaIg.jpg",
                "genre_ids": [
                    27,
                    14
                ],
                "id": 501170,
                "original_language": "en",
                "original_title": "Doctor Sleep",
                "overview": "Still scarred by the trauma he endured as a child at the Overlook Hotel, Dan Torrance faces the ghosts of the past when he meets Abra, a courageous teen who desperately needs his help -- and who possesses a powerful extrasensory ability called the \"shine\".",
                "popularity": 5.5697,
                "poster_path": "/p69QzIBbN06aTYqRRiCOY1emNBh.jpg",
                "release_date": "2019-10-30",
                "title": "Doctor Sleep",
                "video": false,
                "vote_average": 7.142,
                "vote_count": 4649,
                "character": "Deenie",
                "credit_id": "5bdc1264c3a368402c009a96",
                "order": 23
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "American actress, Chelsea Talmadge is best known for her portrayal of Carol in the hit Netflix sci-fi series, Stranger Things from 2016 to 2017, working along with side Millie Bobbie Brown, Winona Ryder, and David Harbour. Along-side filming for Stranger Things, she also had two other recurring roles. One in the independent series Still the King as Mabel which was written and produced by Billy Ray Cyrus and the other, as Vera in the thrilling Halt and Catch Fire.\n\nTalmadge first came to acting at the young age of 12 after attending an entertainment summer camp. Since then, she has appeared in many television series, commercials, and movies, such as playing alongside Kat Dennings in To Write Love on Her Arms and Gary Burgoff in Daniel’s Lot. In addition to acting, Talmadge has an incredible voice and has a passion for making music. Chelsea was born in Fountain Valley California and moved to Orlando Florida at the age of three. She began training in dance at the age of six and continued to show a strong passion for the arts. Chelsea has performed in numerous stage productions, Including Flip at The Orlando International Film Festival, Urinetown: The Musical, 13 The Musical Anne Frank and Me, where she played the lead, and Pinkalicious: The Musical.",
        "birthday": "1993-12-30",
        "deathday": null,
        "gender": 1,
        "homepage": "https://mn2s.com/booking-agency/talent-roster/chelsea-talmadge/",
        "id": 1572103,
        "imdb_id": "nm3571720",
        "known_for_department": "Acting",
        "name": "Chelsea Talmadge",
        "place_of_birth": "Fountain Valley, California, USA",
        "popularity": 0.1644,
        "profile_path": "/cxH53B64fEjbI6u7uLTMjJFpAe2.jpg"
    }
}