{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zd3p7GKopxH4rIjGoDQ1ugalUtx.jpg",
                "genre_ids": [
                    16,
                    10751,
                    10770,
                    12
                ],
                "id": 13382,
                "original_language": "en",
                "original_title": "Rudolph the Red-Nosed Reindeer",
                "overview": "Sam the snowman tells us the story of a young red-nosed reindeer who, after being ousted from the reindeer games because of his glowing nose, teams up with Hermey, an elf who wants to be a dentist, and Yukon Cornelius, the prospector. They run into the Abominable Snowman and find a whole island of misfit toys. Rudolph vows to see if he can get Santa to help the toys, and he goes back to the North Pole on Christmas Eve. But Santa's sleigh is fogged in. But when Santa looks over Rudolph, he gets a very bright idea...",
                "popularity": 1.4632,
                "poster_path": "/xjAElUhXuc7zFJPj3qUHjcySNsE.jpg",
                "release_date": "1964-12-06",
                "title": "Rudolph the Red-Nosed Reindeer",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 619,
                "character": "Doll / Others (voice)",
                "credit_id": "5a1a422f0e0a264cbc037eb1",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Corinne Conley, born in upstate Le Roy, New York, and raised in Radford, Virginia, completed her education at the University of Virginia in 1949, majoring in Dramatic Arts. Her illustrious career primarily unfolded in Canada, where she achieved recognition by winning the Canadian Council of Authors and Artists' prestigious Best Actress Award. With a career spanning over half a century, Conley's versatile talent has graced television, film, and voice acting since its inception in 1953.",
        "birthday": "1929-05-23",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 157319,
        "imdb_id": "nm0174766",
        "known_for_department": "Acting",
        "name": "Corinne Conley",
        "place_of_birth": "Le Roy, New York, USA",
        "popularity": 0.1781,
        "profile_path": "/tFxfNo6DER4wuS6x47MIXX9qPdy.jpg"
    }
}