{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/A63giQFJP4ABqNk4sLzegVeqVdl.jpg",
                "genre_ids": [
                    18,
                    10752,
                    36
                ],
                "id": 14574,
                "original_language": "en",
                "original_title": "The Boy in the Striped Pyjamas",
                "overview": "When his family moves from their home in Berlin to a strange new house in Poland, young Bruno befriends Shmuel, a boy who lives on the other side of the fence where everyone seems to be wearing striped pajamas. Unaware of Shmuel's fate as a Jewish prisoner or the role his own Nazi father plays in his imprisonment, Bruno embarks on a dangerous journey inside the camp's walls.",
                "popularity": 7.1324,
                "poster_path": "/sLwYSEVVV3r047cjrpRAbGgNsfL.jpg",
                "release_date": "2008-05-07",
                "title": "The Boy in the Striped Pyjamas",
                "video": false,
                "vote_average": 7.824,
                "vote_count": 7405,
                "character": "Dancer (uncredited)",
                "credit_id": "5b1561d40e0a262dee00ba13",
                "order": 25
            },
            {
                "adult": false,
                "backdrop_path": "/v8zOcynvSd6IW3FzZrvst2HJ53s.jpg",
                "genre_ids": [
                    80,
                    53
                ],
                "id": 276907,
                "original_language": "en",
                "original_title": "Legend",
                "overview": "Suave, charming and volatile, Reggie Kray and his unstable twin brother Ronnie start to leave their mark on the London underworld in the 1960s. Using violence to get what they want, the siblings orchestrate robberies and murders while running nightclubs and protection rackets. With police Detective Leonard \"Nipper\" Read hot on their heels, the brothers continue their rapid rise to power and achieve tabloid notoriety.",
                "popularity": 8.2099,
                "poster_path": "/4shf5Alq4KWCKqrAAQe0JGJHYp5.jpg",
                "release_date": "2015-09-09",
                "title": "Legend",
                "video": false,
                "vote_average": 7.055,
                "vote_count": 4059,
                "character": "Casino Guest (uncredited)",
                "credit_id": "5fdb83ea3f7e1d003f43ca0f",
                "order": 39
            },
            {
                "adult": false,
                "backdrop_path": "/ieux01445tYkzGdAukUFiYZiDNn.jpg",
                "genre_ids": [
                    18,
                    36,
                    10752
                ],
                "id": 41411,
                "original_language": "fr",
                "original_title": "La Rafle",
                "overview": "A faithful retelling of the 1942 \"Vel' d'Hiv Roundup\" and the events surrounding it.",
                "popularity": 3.1295,
                "poster_path": "/9osPoGTddZZfMUzFDs82n57y2wQ.jpg",
                "release_date": "2010-03-10",
                "title": "The Round Up",
                "video": false,
                "vote_average": 7.546,
                "vote_count": 1025,
                "character": "Nurse (uncredited)",
                "credit_id": "5fdb84c67776f0003f30e03c",
                "order": 101
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Orsolya Júlia Papp",
            "Orsolya Julia Papp"
        ],
        "biography": "In 2013 Julia portrayed the lead Elizabeth in short film Aquarius' Mule, a drug addict who has to face the consequences of her drug abuse. In 2014, Papp played the female lead role of a young prostitute Magdolna in the film Tariro, a story about human trafficking. Papp portrayed the lead character Anna in the 2015 film Archie, a story about a young mother and her six-year-old autistic son. Later in the year Julia played Catherine in Pulitzer Prize winning play Proof. Her performance was well-received by critics. \"The cast is led by Julia Papp, who gives a powerfully emotional performance\" Carn's Theatre Passion. \"At the centre of this production of Proof is the moving and multifaceted performance of Julia Papp\" Theatre Truffles. \"Julia Papp gives a strong and believable performance\" West End Wilma. \"...especially the absolutely brilliant, heartbreaking and emotional Julia Papp's performance\" At Stage Door. \"The acting was absolutely superb with Julia Papp displaying every possible emotion\" Broke In The Big Smoke. In the same year, Julia won an Accolade Award of Merit as Best Supporting Actress for her feature film Seven Devils playing the troubled psychic Rita. The film also won the Silver Screen Award at the Nevada International Film Festival and Silver Award at the International Independent Film Awards. Papp can also be seen in Hungarian TV series Maganyomozok (2014), EngineX4 (2015), Daniel (2015), and Hidden Angel (2016). Most recently she played the role of Claire in the 2016 film Forever Tomorrow (2016).",
        "birthday": "1984-03-20",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1573782,
        "imdb_id": "nm2774738",
        "known_for_department": "Acting",
        "name": "Julia Papp",
        "place_of_birth": null,
        "popularity": 0.0338,
        "profile_path": "/nvnIqHV8WCGE2Gyk5u5Cyf61GD0.jpg"
    }
}