{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/vgnoBSVzWAV9sNQUORaDGvDp7wx.jpg",
                "genre_ids": [
                    12,
                    18,
                    878
                ],
                "id": 157336,
                "original_language": "en",
                "original_title": "Interstellar",
                "overview": "The adventures of a group of explorers who make use of a newly discovered wormhole to surpass the limitations on human space travel and conquer the vast distances involved in an interstellar voyage.",
                "popularity": 63.1735,
                "poster_path": "/gEU2QniE6E77NI6lCU6MxlNBvIx.jpg",
                "release_date": "2014-11-05",
                "title": "Interstellar",
                "video": false,
                "vote_average": 8.461,
                "vote_count": 37854,
                "character": "Scientist (uncredited)",
                "credit_id": "56b63c949251414a3a004185",
                "order": 29
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Kristian Van der Heyden began Harald House Belgium in 2016 after honing his skills in Los Angeles as a writer, producer, and actor for eight years. He produced \"A Punk Daydream\" (2019), a documentary that delves into the street punk culture of Indonesia, which premiered at Rotterdam Film Festival in 2019. Kristian produced \"Slave Island,\" a co-production with Belgium, Estonia, Taiwan, and Italy, about present-day slavery on a remote island of Indonesia, which premiered at Movies That Matter 2025. His projects typically explore significant social challenges within various communities, across cultures. Fiore Mio, a documentary about life in the Aosta Mountains by Paolo Cognetti is released by Lumiere in Benelux and released in Italy in over 300 theaters. Appreciative of the learning experiences each project brings, Kristian’s dedication to impactful storytelling was acknowledged in 2022 when he was named an Emerging Producer at the Ji-Hlava Film Festival.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.haraldhouse.com/",
        "id": 1573547,
        "imdb_id": "nm4120466",
        "known_for_department": "Production",
        "name": "Kristian Van der Heyden",
        "place_of_birth": "Wilrijk, Belgium",
        "popularity": 0.3523,
        "profile_path": "/59HMcKb4BiO5gI52LPmpYZTkpw3.jpg"
    }
}