{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dGRGes6Yw0vK1IymLatHBXGvvpS.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 9576,
                "original_language": "en",
                "original_title": "Tootsie",
                "overview": "When struggling, out of work actor Michael Dorsey secretly adopts a female alter ego – Dorothy Michaels – in order to land a part in a daytime drama, he unwittingly becomes a feminist icon and ends up in a romantic pickle.",
                "popularity": 3.4871,
                "poster_path": "/ngyCzZwb9y5sMUCig5JQT4Y33Q.jpg",
                "release_date": "1982-12-17",
                "title": "Tootsie",
                "video": false,
                "vote_average": 7.214,
                "vote_count": 1834,
                "character": "Jacqui",
                "credit_id": "52fe450cc3a36847f80b94df",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/e7cTxDnHGQIozy0Os5r6HauL1Gz.jpg",
                "genre_ids": [
                    10402,
                    18,
                    35
                ],
                "id": 10654,
                "original_language": "en",
                "original_title": "Hair",
                "overview": "Upon receiving his draft notice and leaving his family ranch in Oklahoma, Claude heads to New York and befriends a tribe of long-haired hippies on his way to boot camp.",
                "popularity": 2.7009,
                "poster_path": "/z0ctToyPWCB2RgIkMpD6RhRKAeH.jpg",
                "release_date": "1979-03-15",
                "title": "Hair",
                "video": false,
                "vote_average": 7.28,
                "vote_count": 696,
                "character": "Black Boys",
                "credit_id": "64fdc43f6a222701372c27e5",
                "order": 36
            },
            {
                "adult": false,
                "backdrop_path": "/npoUm3stzUM2lR46ClLDwBZDaeZ.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 262,
                "original_language": "en",
                "original_title": "The King of Comedy",
                "overview": "Aspiring comic Rupert Pupkin attempts to achieve success in show business by stalking his idol, a late night talk-show host who craves his own privacy.",
                "popularity": 4.99,
                "poster_path": "/3BM78deUfeZfShqPTblZuamgC8a.jpg",
                "release_date": "1982-12-18",
                "title": "The King of Comedy",
                "video": false,
                "vote_average": 7.784,
                "vote_count": 2452,
                "character": "Street Scum",
                "credit_id": "59a86c05c3a3683ccc01c661",
                "order": 34
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Ellen Foley (born 1951) is an American singer and actress who has appeared on Broadway and television, where she co-starred in the hit NBC sitcom Night Court during its second season. In music, she has released five solo albums, but she is best known for her collaborations with rock singer Meat Loaf, particularly the 14× Platinum selling 1977 album Bat Out of Hell.\n\nFoley was born in St. Louis, Missouri, the daughter of John and Virginia B. Foley. She attended Webster University.\n\nFoley gained public recognition through singing a duet with Meat Loaf on the hit single \"Paradise by the Dashboard Light\" from the 1977 album Bat Out of Hell. Foley's part was recorded individually and in one take with Meat Loaf present in the room so she could sing in character. Although Karla DeVito (who toured with Meat Loaf in support of the album) is featured in the music video, DeVito is lip synching to Foley's vocals.\n\nHer debut album Night Out was released in 1979; the album's single \"What's a Matter Baby\" reached No. 7 in the Dutch charts and No. 92 on the US charts. The single \"We Belong to the Night\" reached No.1 in the Netherlands. The album, which peaked at No. 152, was produced by Ian Hunter and Mick Ronson. Foley recorded a duet with Ian Hunter in 1980, \"We Gotta Get Outta Here\". Her creative relationship with Hunter led her to singing backing vocals on the Iron City Houserockers' 1980 album Have a Good Time but Get Out Alive!, produced by Hunter, Ronson, and The E Street Band's Steven Van Zandt.\n\nShe also sings in the title cut of the 1979 Blue Öyster Cult album Mirrors and on The Clash album Sandinista! (released in 1980) in the songs \"Hitsville UK\" and \"Corner Soul\", and on the unreleased track \"Blonde Rock 'n' Roll\". In 1981, all four members of The Clash appeared on her album The Spirit of St. Louis, and Mick Jones and Joe Strummer co-wrote a number of songs for the album. Jones produced the album, which featured members of The Blockheads and peaked at No. 137 on the US charts. In 1982, she provided backing vocals on The Clash's song \"Car Jamming\" from the album Combat Rock. The Clash's hit song \"Should I Stay or Should I Go\", written and sung by Jones, was about the turbulent relationship he shared with Foley at the time.\n\nShe released her third solo album Another Breath in 1983; it failed to chart. In 1984, she sang backing vocals on Joe Jackson's album Body & Soul and had a large role in the music video for Utopia's \"Crybaby\".\n\nFoley was one of four female vocalists to front the group Pandora's Box, formed by Jim Steinman in the late 1980s. Their album Original Sin, released in 1989, was the first to feature the song \"It's All Coming Back to Me Now\" (vocals by Elaine Caswell); both Celine Dion and a duet between Meat Loaf and Marion Raven had separate chart successes with that song in some countries, years later. ...\n\nSource: Article \"Ellen Foley\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1951-06-05",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 157459,
        "imdb_id": "nm0284129",
        "known_for_department": "Acting",
        "name": "Ellen Foley",
        "place_of_birth": "St. Louis, Missouri, USA",
        "popularity": 0.4423,
        "profile_path": "/80OuOOR0WjvhnDcz96R8XH2BPmy.jpg"
    }
}