{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/le14c0VjhbBv475RAEQ13Wt2loo.jpg",
                "genre_ids": [
                    18,
                    80,
                    28
                ],
                "id": 10648,
                "original_language": "en",
                "original_title": "Magnum Force",
                "overview": "\"Dirty\" Harry Callahan is a San Francisco Police Inspector on the trail of a group of rogue cops who have taken justice into their own hands. When shady characters are murdered one after another in grisly fashion, only Dirty Harry can stop them.",
                "popularity": 3.783,
                "poster_path": "/1uX1uzn09seCftG3rTGLPyFXxV6.jpg",
                "release_date": "1973-12-13",
                "title": "Magnum Force",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 1119,
                "character": "Sunny",
                "credit_id": "52fe439b9251416c7501705b",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Born in San Diego, California, Yoshioka has started her career as an actress in the late 1960s. Following her appearance on Star Trek, she also worked on episodes of Mannix (1970, with John Wheeler), Laugh-In (1972, with Frank Welker), Anna and the King (1972, with Samantha Eggar, Keye Luke, and Brian Tochi), Banacek (1972, with Ned Romero, Kermit Murdock, Louise Sorel, Peter Brocco, and Bob Harks), The Magician (1974, with France Nuyen and Bob Harks and directed by Alexander Singer), Kung Fu (1975, with Keye Luke and Clyde Kusatsu), The Paper Chase (1978, with Earl Boen and Charles Hallahan), and Night Court (1984, with Karen Austin, John Larroquette, John Staible, Juan De Villa, and Tony Rocco). Her appearance from Kung Fu was later re-used in the film version, Kung Fu: The Movie in 1986.\n\nYoshioka had memorable appearances as Suzuki in Gaily, Gaily (1969, with Brian Keith, Harvey Jason, Peter Brocco, and Don Keefer), as Mai-Ling Chan in The Return of Charlie Chan (1973, with Louise Sorel), and as Sunny in Magnum Force (1973, with Mitchell Ryan, David Soul, and Wayne Grace).\n\nOther film work include Sweet Charity (1969, with Ricardo Montalban, Ben Vereen, John Wheeler, Jimmy Fields, Lance LeGault, and Buddy Joe Hooker), the television drama They Only Come Out at Night (1975, with Tim O'Connor and Barbara Luna), Swashbuckler (1976, with Genevieve Bujold, Sid Haig, Harry Basch, Henry Kingi, Sr., Anthony De Longis, and Bob Minor), the exercise video Maximum Potential (1987, with Mark DeAlessandro), the television thriller The Perfect Bride (1991, with Marilyn Rockafellow and directed by Terrence O'Hara), the thriller Distant Cousins (1993, with Mary Crosby, Brian Bonsall, and Cyndi Pass), the horror thriller The Nurse (1997, with Jay Underwood and Richard Penn), and the thriller A Table for One (1999, with Mark Rolston).\n\nYoshioka is a founding member and co-chairperson of the Coalition of Asian Pacifics in Entertainment where she also served on the Board of Directors. Other boards she serves on include the Association of Asian Pacific American Artists and East West Players. Yoshioka has held several executive positions at Image Organization, Behaviour Worldwide, CineTel Films, and World International Network.",
        "birthday": "1946-11-30",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 157441,
        "imdb_id": "nm0949065",
        "known_for_department": "Acting",
        "name": "Adele Yoshioka",
        "place_of_birth": "San Diego, California, USA",
        "popularity": 1.3888,
        "profile_path": "/1gv2hIhyWqyyUoOTDTu5IIs9VKL.jpg"
    }
}