{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/pRSTtNlcADoQkfeBGtFQNE1FDpb.jpg",
                "genre_ids": [
                    28,
                    53,
                    878
                ],
                "id": 5548,
                "original_language": "en",
                "original_title": "RoboCop",
                "overview": "In a violent, near-apocalyptic Detroit, evil corporation Omni Consumer Products wins a contract from the city government to privatize the police force. To test their crime-eradicating cyborgs, the company leads street cop Alex Murphy into an armed confrontation with crime lord Boddicker so they can use his body to support their untested RoboCop prototype. But when RoboCop learns of the company's nefarious plans, he turns on his masters.",
                "popularity": 6.3886,
                "poster_path": "/esmAU0fCO28FbS6bUBKLAzJrohZ.jpg",
                "release_date": "1987-07-17",
                "title": "RoboCop",
                "video": false,
                "vote_average": 7.347,
                "vote_count": 5425,
                "character": "Chandra",
                "credit_id": "52fe440dc3a36847f807f749",
                "order": 39
            },
            {
                "adult": false,
                "backdrop_path": "/xBcuoZooxfrajF8312bSPWqvTMV.jpg",
                "genre_ids": [
                    35
                ],
                "id": 14367,
                "original_language": "en",
                "original_title": "Adventures in Babysitting",
                "overview": "When plans with her boyfriend fall through, high school senior Chris Parker ends up babysitting the Anderson kids, Brad and Sara. What should be a quiet night in, however, turns into a series of ridiculous exploits, starting when they leave the house to pick up Chris' friend Brenda. Soon, Brad's buddy Daryl is involved, and the group must contend with car thieves, blues musicians and much more.",
                "popularity": 2.2431,
                "poster_path": "/8QiAj0Xw2UMeZMIIfZKeNoIsszs.jpg",
                "release_date": "1987-07-01",
                "title": "Adventures in Babysitting",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 702,
                "character": "Nurse",
                "credit_id": "61b0bde21684f70042a3a393",
                "order": 37
            },
            {
                "adult": false,
                "backdrop_path": "/3NyCi98Y2lqLawrV41kNCcyo6Ab.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 177,
                "original_language": "en",
                "original_title": "The Fisher King",
                "overview": "Two troubled men face their terrible destinies and events of their past as they join together on a mission to find the Holy Grail and thus to save themselves.",
                "popularity": 3.9549,
                "poster_path": "/hwIYw22HmAUMobV4zsX69MgfVUz.jpg",
                "release_date": "1991-09-20",
                "title": "The Fisher King",
                "video": false,
                "vote_average": 7.293,
                "vote_count": 1391,
                "character": "Receptionist",
                "credit_id": "5693180692514142570012da",
                "order": 32
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Diane Robin (born 23 July 1966) is an Aerican actress. Although often cast as a New Yorker, Diane Robin was born in the Fairfax District of Los Angeles. Her training began in high school, with a scholarship to the Lee Strasberg Theater Institute, and she was the youngest person to have been accepted into the adult program.Diane got a manager who convinced her to sneak on to the Universal lot, and personally hand deliver her picture and resumé to a casting director. She did ,but was then thrown off the lot by a security guard. Telling the story of the fiasco to a complete stranger ,he replied \"I'm an agent and don't have anyone like you.\" She signed with him the next day, and has gone on to appear in over 120 television and film productions. Diane has worked with Academy Award-winning actors including Holly Hunter, Robin Williams, and Jeff Bridges. Some of the legendary directors with whom she has worked include, Terry Gilliam , Peter Hyams,Chris Columbus , and Paul Verhoeven in Robocop, as Chandra in the infamous \"bitches Leave \" scene. She has guest starred on numerous TV shows including NCIS, Desperate Housewives, and MacGyver. She's also costarred in many Hallmark and Lifetime movies such as McBride, Mystery Woman and Annie's Point. She can be seen in Authors Anonymous with Kaley Cuoco, House of Deadly Secrets with Patty McCormack, and Lifetimes You Can't Take My Daughter with Lyndsy Fonseca. In the Indie Award-winning comedy Dating Daisy she plays one of her favorite roles, the pushy endearing mother Eleanor .She is very excited about her acclaimed comedy web series Strange Therapy, in which she stars , and wrote , on Amazon Prime. She recently completed costarring in the thriller Deadly Reunion, and has just been cast as of of the leads in The Sweepers. Always happy on a set, Diane got a license plate so there would be no ambiguity about who she is and what she loves to do. It simply reads CAST ME.",
        "birthday": "1966-07-23",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 157549,
        "imdb_id": "nm0732187",
        "known_for_department": "Acting",
        "name": "Diane Robin",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 1.348,
        "profile_path": "/3QXPjGPPYPDKsbVrYQJbo8VncXi.jpg"
    }
}