{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/d9eONXYtCmQnPWw61w9pNMGlSzK.jpg",
                "genre_ids": [
                    35,
                    18,
                    14,
                    10749
                ],
                "id": 1262,
                "original_language": "en",
                "original_title": "Stranger Than Fiction",
                "overview": "Harold Crick is a lonely IRS agent whose mundane existence is transformed when he hears a mysterious voice narrating his life.",
                "popularity": 4.4245,
                "poster_path": "/nCzcepubwShvZ4vbCsygQNgF2Z1.jpg",
                "release_date": "2006-09-09",
                "title": "Stranger Than Fiction",
                "video": false,
                "vote_average": 7.282,
                "vote_count": 2388,
                "character": "Penny Escher",
                "credit_id": "52fe42ebc3a36847f802cccf",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/euxYhuuJjChU755u2YHj0ZPjww3.jpg",
                "genre_ids": [
                    35,
                    80,
                    18
                ],
                "id": 1574,
                "original_language": "en",
                "original_title": "Chicago",
                "overview": "Murderesses Velma Kelly and Roxie Hart find themselves on death row together and fight for the fame that will keep them from the gallows in 1920s Chicago.",
                "popularity": 4.9513,
                "poster_path": "/3ED8cWCXY9zkx77Sd0N5qMbsdDP.jpg",
                "release_date": "2002-12-10",
                "title": "Chicago",
                "video": false,
                "vote_average": 7.119,
                "vote_count": 2746,
                "character": "Matron Mama Morton",
                "credit_id": "52fe42ffc3a36847f8032b85",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/3CcO4QdasRCitq2dczOpx7CXgLM.jpg",
                "genre_ids": [
                    10751,
                    12,
                    18
                ],
                "id": 12837,
                "original_language": "en",
                "original_title": "The Secret Life of Bees",
                "overview": "Set in South Carolina in 1964, this is the tale of Lily Owens a 14 year-old girl who is haunted by the memory of her late mother. To escape her lonely life and troubled relationship with her father, Lily flees with Rosaleen, her caregiver and only friend, to a South Carolina town that holds the secret to her mother's past.",
                "popularity": 3.7485,
                "poster_path": "/m1LGEeoYfc6crbfG8WmTKg9SVqL.jpg",
                "release_date": "2008-09-17",
                "title": "The Secret Life of Bees",
                "video": false,
                "vote_average": 7.478,
                "vote_count": 548,
                "character": "August Boatwright",
                "credit_id": "52fe45299251416c7504dc6b",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/7D1v3y0RPoyJBZAx4eGdjcqJUuD.jpg",
                "genre_ids": [
                    12,
                    35,
                    18
                ],
                "id": 17379,
                "original_language": "en",
                "original_title": "Last Holiday",
                "overview": "The discovery that she has a terminal illness prompts introverted department store saleswoman Georgia Byrd to reflect on what she realizes has been an overly cautious life. With weeks to live, she withdraws her life savings, sells all her possessions and jets off to Europe where she lives it up at a posh hotel. Upbeat and passionate, Georgia charms everybody she meets, including renowned Chef Didier. The only one missing from her new life is her longtime crush Sean Matthews.",
                "popularity": 4.3761,
                "poster_path": "/hRNZszPHjIpYGlrMN3o4f6f6cVd.jpg",
                "release_date": "2006-01-13",
                "title": "Last Holiday",
                "video": false,
                "vote_average": 7.219,
                "vote_count": 807,
                "character": "Georgia Byrd",
                "credit_id": "52fe47219251416c7508ec2d",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/wePpxpU1eNZnHCChP5xGNJrGKY3.jpg",
                "genre_ids": [
                    10751,
                    18
                ],
                "id": 339984,
                "original_language": "en",
                "original_title": "Miracles from Heaven",
                "overview": "When Christy discovers her 10-year-old daughter Anna has a rare, incurable disease, she becomes a ferocious advocate for her daughter’s healing as she searches for a solution. After Anna has a freak accident and falls three stories, a miracle unfolds in the wake of her dramatic rescue that leaves medical specialists mystified, her family restored and their community inspired.",
                "popularity": 5.5539,
                "poster_path": "/hz9VF1TfaM0D04pYneSXUkNeOZv.jpg",
                "release_date": "2016-03-17",
                "title": "Miracles from Heaven",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 1223,
                "character": "Angela Bradford",
                "credit_id": "55c58ddc9251417a27000da3",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/hGr0FrLI74vqpBWTBOPloDBwOAK.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 705861,
                "original_language": "en",
                "original_title": "Hustle",
                "overview": "After discovering a once-in-a-lifetime player with a rocky past abroad, a down on his luck basketball scout takes it upon himself to bring the phenom to the States without his team's approval. Against the odds, they have one final shot to prove they have what it takes to make it in the NBA.",
                "popularity": 4.9115,
                "poster_path": "/xWic7kPq13oRxYjbGLApXCnc7pz.jpg",
                "release_date": "2022-06-03",
                "title": "Hustle",
                "video": false,
                "vote_average": 7.728,
                "vote_count": 2677,
                "character": "Teresa Sugerman",
                "credit_id": "5f8e7f2e17c4430039df0792",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Dana Owens",
            "퀸 라티파",
            "Κουίν Λατίφα",
            "Dana Elaine Owens",
            "拉蒂法皇后"
        ],
        "biography": "Dana Elaine Owens (born March 18, 1970), known professionally as Queen Latifah, is an American rapper, actress, and singer. Born in Newark, New Jersey, she signed with Tommy Boy Records in 1989 and released her debut album All Hail the Queen on November 28, 1989, featuring the hit single \"Ladies First\". Nature of a Sista' (1991) was her second and final album with Tommy Boy Records.\n\nLatifah starred as Khadijah James on the Fox sitcom Living Single from 1993 to 1998. Her third album, Black Reign (1993), became the first album by a solo female rapper to receive a RIAA certification, and spawned the single \"U.N.I.T.Y.\", which was influential in raising awareness of violence against women and the objectification of Black female sexuality. The record won a Grammy Award and peaked at No. 23 on the Billboard Hot 100. She then starred in the lead role of Set It Off (1996) and released her fourth album, Order in the Court, on June 16, 1998, with Motown Records. Latifah garnered acclaim with her role of Matron \"Mama\" Morton in the musical film Chicago (2002), receiving a nomination for the Academy Award for Best Supporting Actress.\n\nLatifah released her fifth album The Dana Owens Album in 2004. In 2007 and 2009, she released two more studio albums – Trav'lin' Light and Persona. She created the daytime talk show The Queen Latifah Show, which ran from 1999 to 2001, and again from 2013 to 2015, in syndication. She has appeared in a number of films, such as Bringing Down the House (2003), Taxi (2004), Barbershop 2: Back in Business (2005), Beauty Shop (2005), Last Holiday (2006), Hairspray (2007), Joyful Noise (2012), 22 Jump Street (2014) and Girls Trip (2017) and provided voice work in the Ice Age film series. Latifah received critical acclaim for her portrayal of blues singer Bessie Smith in the HBO film Bessie (2015), which she co-produced, winning the Primetime Emmy Award for Outstanding Television Movie. From 2016 to 2019, she starred as Carlotta Brown in the musical drama series Star. In 2020, she portrayed Hattie McDaniel in the miniseries Hollywood.\n\nQueen Latifah has been referred to as the \"Queen of Rap\" by several media articles, as well as \"rap's first feminist\". Latifah became the first hip hop artist to receive a star on the Hollywood Walk of Fame (2006). Latifah's work in music, film and television has earned her a Grammy Award, an Emmy Award, a Golden Globe Award, three Screen Actors Guild Awards, two NAACP Image Awards, and an Academy Award nomination.\n\nDescription above from the Wikipedia article Queen Latifah, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1970-03-18",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.queenlatifah.com",
        "id": 15758,
        "imdb_id": "nm0001451",
        "known_for_department": "Acting",
        "name": "Queen Latifah",
        "place_of_birth": "Newark, New Jersey, USA ",
        "popularity": 1.1128,
        "profile_path": "/fnOghG8JjYDicgNrsy80mKdwj5B.jpg"
    }
}