{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fOzPQKNcMzraCh2YGeJVx4zEKtF.jpg",
                "genre_ids": [
                    10402,
                    10749,
                    18
                ],
                "id": 382399,
                "original_language": "en",
                "original_title": "High Strung",
                "overview": "When a hip hop violinist busking in the New York subway encounters a classical dancer on scholarship at the Manhattan Conservatory of the Arts, sparks fly. With the help of a hip hop dance crew they must find a common ground while preparing for a competition that could change their lives forever.",
                "popularity": 4.4033,
                "poster_path": "/xfj4Vomg8h3I1hBHj4GfpduUfkv.jpg",
                "release_date": "2016-04-08",
                "title": "High Strung",
                "video": false,
                "vote_average": 7.05,
                "vote_count": 921,
                "character": "Ruby",
                "credit_id": "56be2f779251417347004403",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "キーナン・カンパ"
        ],
        "biography": "Keenan Kampa is an international ballet dancer, model and actress, landing a major role in the movie High Strung (2016).\n\nKampa started dancing at the age of four. She studied at the Conservatory Ballet in Reston. Kampa was raised near Reston, Virginia From 2003 to 2004, she was part of the Boston Ballet's Summer Dance Program.\n\nIn 2007, when she was eighteen years old, she was invited to study at the Vaganova Ballet Academy in St. Petersburg, Russia, the second American to be admitted to the academy after Ryan Martin. After three years, she graduated at the top of her class and with a Russian diploma. She accepted a contract with the Boston Ballet after two seasons, she was invited to dance with the Mariinsky Theatre, becoming the first American in history to do so. She returned to the United States in 2014 for hip surgery. She planned to return to Russia, but decided to remain in the United States.",
        "birthday": "1989-02-03",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1576443,
        "imdb_id": "nm6469442",
        "known_for_department": "Acting",
        "name": "Keenan Kampa",
        "place_of_birth": " Washington, D.C.",
        "popularity": 0.0704,
        "profile_path": "/x3878x841a3gWYVwHvb797rSM5W.jpg"
    }
}