{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/r4nx6BZY4PfLPrThytBtAuwN8uV.jpg",
                "genre_ids": [
                    27
                ],
                "id": 13550,
                "original_language": "en",
                "original_title": "The Changeling",
                "overview": "After a tragic event happens, composer John Russell moves to Seattle to try to overcome it and build a new and peaceful life in a lonely big house that has been uninhabited for many years. But, soon after, the obscure history of such an old mansion and his own past begin to haunt him.",
                "popularity": 5.0463,
                "poster_path": "/z4nTYj3JZ5jWAhDgrmEhW2GRAzb.jpg",
                "release_date": "1980-03-28",
                "title": "The Changeling",
                "video": false,
                "vote_average": 6.985,
                "vote_count": 676,
                "character": "Captain DeWitt",
                "credit_id": "52fe45799251416c75057bd9",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "John Collicos"
        ],
        "biography": "John Colicos (December 10, 1928 – March 6, 2000) was a celebrated Canadian actor known for his extensive work on stage and screen in Canada, the United States, and the United Kingdom. He began his career in Canadian theater and became the youngest actor to play King Lear at London’s Old Vic. His authoritative presence led to many memorable villain roles in science fiction and drama.\n\nColicos is especially famous for his portrayal of Commander Kor, the first Klingon ever depicted in Star Trek’s Original Series (\"Errand of Mercy,\" 1967), a role he later reprised in Star Trek: Deep Space Nine. He also played Count Baltar in the original Battlestar Galactica series and gave voice to the villain Apocalypse in the 1990s X-Men animated series. Beyond science fiction, Colicos appeared in numerous films and television programs, including The Changeling, Anne of the Thousand Days, and General Hospital.\n\nHe was recognized for his commanding voice, dramatic stage work, and pioneering contributions to popular culture. Colicos was married to Mona McHenry and had two sons. He died in Toronto in 2000 at the age of 71.",
        "birthday": "1928-12-10",
        "deathday": "2000-03-06",
        "gender": 2,
        "homepage": null,
        "id": 15765,
        "imdb_id": "nm0171475",
        "known_for_department": "Acting",
        "name": "John Colicos",
        "place_of_birth": "Toronto, Ontario, Canada",
        "popularity": 0.2758,
        "profile_path": "/ln0FRANagWyBK6Itx727hCwR8hM.jpg"
    }
}