{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lAaAtQ5b8iX9JeG6QUq4RM1paKD.jpg",
                "genre_ids": [
                    18
                ],
                "id": 10435,
                "original_language": "en",
                "original_title": "Chaplin",
                "overview": "An aged Charlie Chaplin narrates his life to his autobiography's editor, including his rise to wealth and comedic fame from poverty, his turbulent personal life and his run-ins with the FBI.",
                "popularity": 3.3076,
                "poster_path": "/Aeltt5tl02zrEj4GoMynHc94lWG.jpg",
                "release_date": "1992-12-17",
                "title": "Chaplin",
                "video": false,
                "vote_average": 7.438,
                "vote_count": 1131,
                "character": "Workhouse Official",
                "credit_id": "63808d9e6e938a007fff6556",
                "order": 22
            },
            {
                "adult": false,
                "backdrop_path": "/o4p4joAAFETuUFCHJe2XYJcnCdi.jpg",
                "genre_ids": [
                    18
                ],
                "id": 10876,
                "original_language": "en",
                "original_title": "Quills",
                "overview": "In early 19th-century France, the Marquis de Sade is confined to an asylum where his forbidden writings continue to circulate beyond its walls. As the authorities tighten control, a clash unfolds between the Marquis’ unyielding imagination, the reformist ideals of the Abbé in charge, and the repressive measures of a doctor sent to silence him. Desire, power, and censorship collide in a battle over freedom of expression.",
                "popularity": 4.0027,
                "poster_path": "/AvGdw3BpvJV2wHmK2qY0N7XHqET.jpg",
                "release_date": "2000-11-22",
                "title": "Quills",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 677,
                "character": "First Vendor",
                "credit_id": "5a725d2c0e0a2664390006a8",
                "order": 32
            },
            {
                "adult": false,
                "backdrop_path": "/9IYyCLf5NNAQFK9pNtqzEU9HWzM.jpg",
                "genre_ids": [
                    35,
                    878
                ],
                "id": 68,
                "original_language": "en",
                "original_title": "Brazil",
                "overview": "Low-level bureaucrat Sam Lowry escapes the monotony of his day-to-day life through a recurring daydream of himself as a virtuous hero saving a beautiful damsel. Investigating a case that led to the wrongful arrest and eventual death of an innocent man instead of wanted terrorist Harry Tuttle, he meets the woman from his daydream, and in trying to help her gets caught in a web of mistaken identities, mindless bureaucracy and lies.",
                "popularity": 3.9345,
                "poster_path": "/aewan59WcFThBimkTVVoNf2o5Vb.jpg",
                "release_date": "1985-02-20",
                "title": "Brazil",
                "video": false,
                "vote_average": 7.67,
                "vote_count": 3484,
                "character": "Black Maria Guard",
                "credit_id": "5a725db50e0a26642a000693",
                "order": 23
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Howard 'Lew' Lewis"
        ],
        "biography": "Howard Lew Lewis was an English comedian and actor best known for his roles in the 1980s sitcom Brush Strokes and Tony Robinson's children's comedy series Maid Marian and Her Merry Men. His first job was with the RAF as a  a computer operator and he worked for several years in computing and telecommunications at managerial level before undertaking acting as his chosen career. He often appeared in vehicles for Ronnie Barker, including The Magnificent Evans and Open All Hour, and appeared in the first series of Blackadder. His film roles included Hal in Robin Hood: Prince of Thieves, a guard in Terry Gilliam's Brazil, Richard Attenborough's Chaplin, and the voice of Obelix in the 1994 animated film Asterix in America. Diabetes and dementia plagued him in later years and he was admitted into a community hospital in Edinburgh in 2017. He passed away there on 20th January 2018. Police Scotland confirmed later that month that they were investigating a complaint brought by Lewis's daughter Debora Milazzo against the hospital. She claimed that her father was given an unnecessary cocktail of high-dose sedatives and maximum-strength opiate painkillers that subsequently brought about his death. The police ultimately found no case to answer.",
        "birthday": "1941-08-21",
        "deathday": "2018-01-20",
        "gender": 2,
        "homepage": null,
        "id": 157785,
        "imdb_id": "nm0507270",
        "known_for_department": "Acting",
        "name": "Howard Lew Lewis",
        "place_of_birth": "London, England",
        "popularity": 0.9454,
        "profile_path": "/diG8wWjR7CZbYPuWISHziBFbmfe.jpg"
    }
}