{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uPyZMwbXLnPrFPmUC9qK7WfLJAW.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 250734,
                "original_language": "en",
                "original_title": "Far from the Madding Crowd",
                "overview": "In Victorian England, the independent and headstrong Bathsheba Everdene attracts three very different suitors: Gabriel Oak, a hardworking young sheep farmer; Frank Troy, a handsome and reckless Sergeant; and William Boldwood, a prosperous and mature bachelor.",
                "popularity": 6.8656,
                "poster_path": "/cr4cctBPv9qHDtjDps4wi0kqI7h.jpg",
                "release_date": "2015-04-23",
                "title": "Far from the Madding Crowd",
                "video": false,
                "vote_average": 7.021,
                "vote_count": 1068,
                "character": "Jan Coggan",
                "credit_id": "5999e14092514149e2002e5f",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Harry Peacock was born in London in August 1978. His father is comic actor Trevor Peacock (whose son he played in an episode of television drama 'Kingdom') and his older brother the actor Daniel Peacock. After training Harry made his television debut in 2000 and in 2003, whilst taking part in a National Theatre studio workshop production , 'Heart of a Dog', met actress Katherine Parkinson - who was playing the dog - and they were engaged three years later, marrying in 2009. They have two daughters Dora and Gwen. The couple are also directors of Big Nose Productions. Harry has appeared on stage at the Royal Court in the play 'Chicken Soup With Barley' in 2011 but is arguably best known for his comic roles on television, particularly the satirical 'Star Stories', impersonating a host of celebrities and the sitcom 'Toast of London' as smug actor Ray Purchase - in 2014 both Harry and Matt Berry who plays his rival Toast were nominated for the best comedy breakthrough award. In 2015 he appeared in the BBC TV sitcom 'The Kennedys' with Katherine, though not playing a married couple.",
        "birthday": "1978-08-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 157753,
        "imdb_id": "nm0668775",
        "known_for_department": "Acting",
        "name": "Harry Peacock",
        "place_of_birth": " London, England, UK",
        "popularity": 0.2556,
        "profile_path": "/jjCPCCOGQrEZnRLh5SCOBneMqy2.jpg"
    }
}