{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dSD9aSZtgFthuMQ78GD1QOQf54V.jpg",
                "genre_ids": [
                    878,
                    16,
                    28,
                    18,
                    14
                ],
                "id": 487670,
                "original_language": "en",
                "original_title": "The Death of Superman",
                "overview": "When a hulking monster arrives on Earth and begins a mindless rampage, the Justice League is quickly called in to stop it. But it soon becomes apparent that only Superman can stand against the monstrosity.",
                "popularity": 2.6456,
                "poster_path": "/y0uxSHaSFmt6XaBJgjkeLqe7aM.jpg",
                "release_date": "2018-07-24",
                "title": "The Death of Superman",
                "video": false,
                "vote_average": 7.386,
                "vote_count": 794,
                "character": "John Henry Irons (voice)",
                "credit_id": "5b2982f00e0a263e71000152",
                "order": 22
            },
            {
                "adult": false,
                "backdrop_path": "/jdGfm589quvuyGNCv0BtqaAQrp4.jpg",
                "genre_ids": [
                    878,
                    16,
                    28,
                    12,
                    14
                ],
                "id": 487672,
                "original_language": "en",
                "original_title": "Reign of the Supermen",
                "overview": "In the wake of The Death of Supermen, the world is still mourning the loss of the Man of Steel following his fatal battle with the monster Doomsday. However, no sooner as his body been laid to rest than do four new bearers of the Superman shield come forward to take on the mantle. The Last Son of Krypton, Superboy, Steel, and the Cyborg Superman all attempt to fill the vacuum left by the world's greatest champion. Meanwhile, Superman's death has also signaled to the universe that Earth is vulnerable. Can these new Supermen and the rest of the heroes prove them wrong?",
                "popularity": 2.2386,
                "poster_path": "/e9TzqscNRUaG8HqEP3K1jUvi8pC.jpg",
                "release_date": "2019-01-13",
                "title": "Reign of the Supermen",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 668,
                "character": "John Henry Irons / Steel (voice)",
                "credit_id": "5d95b06d3bd26e002bb6174d",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/8aBF5cGWGOHPazyMsTpVkr27mTs.jpg",
                "genre_ids": [
                    18,
                    10749,
                    878
                ],
                "id": 226448,
                "original_language": "en",
                "original_title": "In Your Eyes",
                "overview": "Two seemingly unconnected souls from different corners of the United States make a telepathic bond that allows them to see, hear and feel the other's experiences, creating a bond that apparently can't be broken.",
                "popularity": 1.7562,
                "poster_path": "/4XAaMo2nBZR3eH8HU6AbPkBKEXI.jpg",
                "release_date": "2014-04-20",
                "title": "In Your Eyes",
                "video": false,
                "vote_average": 7.141,
                "vote_count": 710,
                "character": "Jake",
                "credit_id": "5ee90914afa1b00020c20b11",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "کرس ویلیامز"
        ],
        "biography": "Cress Williams is an American actor born on July 26, 1970, in Heidelberg, West Germany, to American parents. He studied acting at Fullerton College and earned a Bachelor of Arts degree in theatre from the University of California, Los Angeles. Williams began his acting career performing in college plays, notably in productions like Shakespeare's \"Othello\" in 1990 before moving on to television and film roles.\n\nHe is best known for his diverse roles on television, including Terrence \"Scooter\" Williams on the sitcom \"Living Single,\" Inspector Antwon Babcock on \"Nash Bridges,\" and Detective Ed Williams on the drama \"Close to Home.\" He gained further prominence as Mayor Lavon Hayes in The CW series \"Hart of Dixie\" and especially as the lead character Jefferson Pierce/Black Lightning in the superhero TV series \"Black Lightning\" (2018-2021). Williams has also had guest roles on numerous popular shows including \"Prison Break,\" where he played the assassin Wyatt Mathewson, along with appearances in \"Friday Night Lights,\" \"Grey's Anatomy,\" and \"Law & Order: SVU,\" among others.\n\nIn addition to live-action roles, he has voiced the character John Henry Irons in animated films related to the DC universe. Off screen, Williams has been married twice and has four children. His career spans from the early 1990s to the present, marked by a steady presence in television dramas, action series, and superhero fiction, earning him recognition as a versatile and reliable actor in the entertainment industry",
        "birthday": "1970-07-26",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 157847,
        "imdb_id": "nm0930317",
        "known_for_department": "Acting",
        "name": "Cress Williams",
        "place_of_birth": "Heidelberg, Germany",
        "popularity": 0.4872,
        "profile_path": "/pIOyAg9U0eAUvs8N2Xca7uRKlOe.jpg"
    }
}