{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/suaEOtk1N1sgg2MTM7oZd2cfVp3.jpg",
                "genre_ids": [
                    53,
                    80,
                    35,
                    18
                ],
                "id": 680,
                "original_language": "en",
                "original_title": "Pulp Fiction",
                "overview": "A burger-loving hit man, his philosophical partner, a drug-addled gangster's moll and a washed-up boxer converge in this sprawling, comedic crime caper. Their adventures unfurl in three stories that ingeniously trip back and forth in time.",
                "popularity": 18.5743,
                "poster_path": "/vQWk5YBFWF4bZaofAbv0tShwBvQ.jpg",
                "release_date": "1994-09-10",
                "title": "Pulp Fiction",
                "video": false,
                "vote_average": 8.5,
                "vote_count": 29079,
                "character": "Gawker #1",
                "credit_id": "52fe426ac3a36847f801cba3",
                "order": 39
            },
            {
                "adult": false,
                "backdrop_path": "/kYgQzzjNis5jJalYtIHgrom0gOx.jpg",
                "genre_ids": [
                    16,
                    10751,
                    28,
                    35,
                    12,
                    14
                ],
                "id": 1011985,
                "original_language": "en",
                "original_title": "Kung Fu Panda 4",
                "overview": "Po is gearing up to become the spiritual leader of his Valley of Peace, but also needs someone to take his place as Dragon Warrior. As such, he will train a new kung fu practitioner for the spot and will encounter a villain called the Chameleon who conjures villains from the past.",
                "popularity": 30.3134,
                "poster_path": "/kDp1vUBnMpe8ak4rjgl3cLELqjU.jpg",
                "release_date": "2024-03-02",
                "title": "Kung Fu Panda 4",
                "video": false,
                "vote_average": 7.042,
                "vote_count": 3213,
                "character": "Wolf Crime Boss / Bunny Waiter / Citizen #1 / Questioned Sheep (voice)",
                "credit_id": "65ec8d9b8fdda90149823f39",
                "order": 26
            },
            {
                "adult": false,
                "backdrop_path": "/6OpluXPGIE8hfVrhpeygR7p4XwR.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 7350,
                "original_language": "en",
                "original_title": "The Bucket List",
                "overview": "Corporate billionaire Edward Cole and working class mechanic Carter Chambers are worlds apart. At a crossroads in their lives, they share a hospital room and discover they have two things in common: a desire to spend the time they have left doing everything they ever wanted to do and an unrealized need to come to terms with who they are. Together they embark on the road trip of a lifetime, becoming friends along the way and learning to live life to the fullest, with insight and humor.",
                "popularity": 6.6897,
                "poster_path": "/idbNSe8zsYKQL97dJApfOrDSdya.jpg",
                "release_date": "2007-12-25",
                "title": "The Bucket List",
                "video": false,
                "vote_average": 7.192,
                "vote_count": 3907,
                "character": "Nurse Shing",
                "credit_id": "568ba4c2c3a368607502e2a0",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Karen Maruyama is an American actress and comedienne. She has appeared on television in supporting roles in a number of sitcoms, including recurring characters on The Jamie Foxx Show, Strip Mall, Suddenly Susan, and Arrested Development. Maruyama is well known as an improv performer and instructor, and was a featured guest on both the American and British versions of Whose Line Is It Anyway?, as well as a member of The Groundlings. She also appeared as a parking lot attendant in an episode of Curb Your Enthusiasm. She also played a nurse in The Bucket List (2007) and a housekeeper in the 2012 film The Campaign. She is part of the cast of The Jim Henson Company's live stage show \"Puppet Up! - Uncensored\" which has toured to Aspen, Las Vegas, Edinburgh, Sydney and Melbourne and is currently appearing monthly at Avalon Hollywood. In 2013, on the serie 2 Broke Girls (third season, seventh episode), she appears how Han's mother, under the name Su-Min.\n\nKaren was also featured as a fashion victim in an episode of the makeover show How Do I Look?. She also appeared as a non-celebrity contestant on the 1984 CBS game show, Body Language, under the name Karen Upshaw, saying she was from Perris, California. She was paired with celebrity players Ted Lange and Constance Towers. She was also on The New $25,000 Pyramid in 1983 with Audrey Landers and Michael McKean.",
        "birthday": "1958-05-29",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 157865,
        "imdb_id": "nm0555462",
        "known_for_department": "Acting",
        "name": "Karen Maruyama",
        "place_of_birth": "U.S.A",
        "popularity": 0.1755,
        "profile_path": "/6XCu6ZFSkF8ppMO40Jx6HgDKJgj.jpg"
    }
}