{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ai2FicMUxLCurVkjtYdSvVDWRmS.jpg",
                "genre_ids": [
                    16,
                    10751,
                    878
                ],
                "id": 10681,
                "original_language": "en",
                "original_title": "WALL·E",
                "overview": "What if mankind had to leave Earth and somebody forgot to turn the last robot off? After hundreds of years doing what he was built for, WALL•E discovers a new purpose in life when he meets a sleek search robot named EVE. EVE comes to realize that WALL•E has inadvertently stumbled upon the key to the planet's future, and races back to space to report to the humans. Meanwhile, WALL•E chases EVE across the galaxy and sets into motion one of the most imaginative adventures ever brought to the big screen.",
                "popularity": 12.7339,
                "poster_path": "/hbhFnRzzg6ZDmm8YAmxBnQpQIPh.jpg",
                "release_date": "2008-06-22",
                "title": "WALL·E",
                "video": false,
                "vote_average": 8.102,
                "vote_count": 19506,
                "character": "Pool Mother (uncredited)",
                "credit_id": "59d0ab8392514113eb016547",
                "order": 27
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Niki McElroy is an American actress and writer based in Los Angeles, California. With a passion for storytelling and performance that emerged during her high school years, she won multiple competitions in both acting and writing. Over the past two decades, Niki has honed her craft, working extensively in film, television, and commercial projects. Her work includes starring in national campaigns, with appearances in commercials, magazines, and on billboards across the country. Notably, she was among a select group of actors featured in Pixar's groundbreaking first animated film incorporating live-action segments.",
        "birthday": "1980-01-03",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1580169,
        "imdb_id": "nm2805755",
        "known_for_department": "Acting",
        "name": "Niki McElroy",
        "place_of_birth": "Louisville, Kentucky, USA",
        "popularity": 0.0461,
        "profile_path": "/AoQ7YfazOoeGy0hBmlJXE3HU6HR.jpg"
    }
}