{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uG1v9Hk1XKICd6IJChRR20mBh8i.jpg",
                "genre_ids": [
                    16,
                    28,
                    12,
                    35,
                    10751
                ],
                "id": 431693,
                "original_language": "en",
                "original_title": "Spies in Disguise",
                "overview": "Super spy Lance Sterling and scientist Walter Beckett are almost exact opposites. Lance is smooth, suave and debonair. Walter is… not. But what Walter lacks in social skills he makes up for in smarts and invention, creating the awesome gadgets Lance uses on his epic missions. But when events take an unexpected turn, Walter and Lance suddenly have to rely on each other in a whole new way.",
                "popularity": 5.7098,
                "poster_path": "/e7rWcrnuNej3JeVjqmRu0jVeRa4.jpg",
                "release_date": "2019-12-04",
                "title": "Spies in Disguise",
                "video": false,
                "vote_average": 7.573,
                "vote_count": 2876,
                "character": "Agency Employee #10 / Italian Woman (voice)",
                "credit_id": "5e5bce38357c0000112994ce",
                "order": 27
            },
            {
                "adult": false,
                "backdrop_path": "/2vq5GTJOahE03mNYZGxIynlHcWr.jpg",
                "genre_ids": [
                    18,
                    28,
                    36
                ],
                "id": 359724,
                "original_language": "en",
                "original_title": "Ford v Ferrari",
                "overview": "American car designer Carroll Shelby and the British-born driver Ken Miles work together to battle corporate interference, the laws of physics, and their own personal demons to build a revolutionary race car for Ford Motor Company and take on the dominating race cars of Enzo Ferrari at the 24 Hours of Le Mans in France in 1966.",
                "popularity": 13.8559,
                "poster_path": "/dR1Ju50iudrOh3YgfwkAU1g2HZe.jpg",
                "release_date": "2019-11-13",
                "title": "Ford v Ferrari",
                "video": false,
                "vote_average": 8.007,
                "vote_count": 8493,
                "character": "Ferrari's English Translator",
                "credit_id": "600cf90b7776f000400ec551",
                "order": 56
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Stefania Spampinato was born in a small town at the base of the Etna  Volcano in Belpasso, Sicily. She started dancing at 6 years old. Her  passion for the arts at a young age was undeniable so her mother started  making her dance costumes so she could afford her daughter's tuition.  After graduating high school with honors, she did something unheard of  in her small village: she bought a plane ticket & left. What came to  follow was a wildly successful career in dance & theatre that  lasted 10 years & included collaborations with Joquin Cortez, Kylie  Minogue, Demi Lovato Leona Lewi, Neo, Take That, Nine, Samsung, Toyota,  Target Wells Fargo, Adidas, Miller light, The VoiceUK, & X Factor US  & UK In 2011 she made an even bolder move & bought a one way  ticket to Los Angeles, CA. Upon landing she immersed herself in acting  classes with Gary Imhoff (formally of the Beverly Hills Playhouse),  Anthony Meindl, & Michelle Danner. Within 3 months she had  representation commercially and theatrically.",
        "birthday": "1982-07-17",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1581103,
        "imdb_id": "nm5312098",
        "known_for_department": "Acting",
        "name": "Stefania Spampinato",
        "place_of_birth": "Catania, Italy",
        "popularity": 0.6131,
        "profile_path": "/7W9SHn3VtwlZLJ67akzxiIBfg7q.jpg"
    }
}