{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5OeY4U2rzePxWq2rkqMajUx2gz7.jpg",
                "genre_ids": [
                    16,
                    10751,
                    12,
                    14,
                    10749
                ],
                "id": 812,
                "original_language": "en",
                "original_title": "Aladdin",
                "overview": "In the boorish city of Agrabah, kind-hearted street urchin Aladdin and Princess Jasmine fall in love, although she can only marry a prince. He and power-hungry Grand Vizier Jafar vie for a magic lamp that can fulfill their wishes.",
                "popularity": 8.0896,
                "poster_path": "/eLFfl7vS8dkeG1hKp5mwbm37V83.jpg",
                "release_date": "1992-11-25",
                "title": "Aladdin",
                "video": false,
                "vote_average": 7.654,
                "vote_count": 11610,
                "character": "Iago (voice)",
                "credit_id": "52fe427ac3a36847f8021b21",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Gilbert Jeremy Gottfried",
            "Гилберт Готтфрид",
            "Gilbert Gottfried"
        ],
        "biography": "Gilbert Jeremy Gottfried (February 28, 1955 - April 12, 2022) was an American actor and stand-up comedian. Gottfried's persona as a comedian features an exaggerated shrill voice and emphasis on crude humor. His numerous roles in film and television include voicing the parrot Iago in Disney's Aladdin animated films and TV show, Digit LeBoid in the PBS Kids show Cyberchase, and Kraang Subprime in Teenage Mutant Ninja Turtles. Gottfried was the voice of the Aflac Duck until 2011. He appeared in the critically panned commercial hit Problem Child in 1990.\n\nSince 2014, Gottfried has hosted a podcast, Gilbert Gottfried's Amazing Colossal Podcast, which features new episodes each week featuring discussions of classic movies and celebrity interviews, most often with veteran actors, comedians, musicians and comedy writers.[2] Gilbert, a documentary film on Gottfried's life and career, was released in 2017.\n\nDescription above from the Wikipedia article Gilbert Gottfried, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1955-02-28",
        "deathday": "2022-04-12",
        "gender": 2,
        "homepage": "http://www.gilbertgottfried.com",
        "id": 15832,
        "imdb_id": "nm0331906",
        "known_for_department": "Acting",
        "name": "Gilbert Gottfried",
        "place_of_birth": "Brooklyn, New York City, New York, USA",
        "popularity": 0.5387,
        "profile_path": "/hkkAgJD0HKcuyd8EuvhyN5vHcDQ.jpg"
    }
}