{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/leukkAoRu9rsa3s8oaLm8C10EWw.jpg",
                "genre_ids": [
                    28,
                    80
                ],
                "id": 10027,
                "original_language": "en",
                "original_title": "Unleashed",
                "overview": "Raised as a slave, Danny is used to fighting for his survival. In fact, his \"master,\" Bart, thinks of him as a pet and goes as far as leashing him with a collar so they can make money in fight clubs, where Danny is the main contender. When Bart's crew is in a car accident, Danny escapes and meets a blind, kindhearted piano tuner who takes him in and uses music to free the fighter's long-buried heart.",
                "popularity": 5.4294,
                "poster_path": "/gghvmS3UxtOw1UHIgYjpeZNxHil.jpg",
                "release_date": "2005-02-02",
                "title": "Unleashed",
                "video": false,
                "vote_average": 6.938,
                "vote_count": 2075,
                "character": "Bart's Thug",
                "credit_id": "625f3f1fdfaae9016fcea9ab",
                "order": 76
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Si Agathe possède l'autorité d'un chef, Vincent lui, par contre, est un athlète enthousiaste : décrit comme le « casse-cou de la bande », il est le Monsieur Muscle du trio et est toujours partant pour donner son corps à la science. Que ce soit pour affronter des animaux dangereux, effectuer des cascades dantesques ou bien tester les machines, « un mot, un geste, Vincent fait le reste ! ». Sous ses airs de baroudeur, Vincent cache assez difficilement son vertige (Peut-on sauter du plus haut pont d'Europe !) et son mal des transports : les expériences sont parfois à haut risque et notre Cobaye montre bien souvent qu'il prend beaucoup de plaisir tout autant que de peur. Aventurier dans l'âme, il est souvent celui qui connaît les tactiques de survie et est le plus physique de la bande, même s'il laisse les activités les plus dangereuses aux professionnels.",
        "birthday": "1971-02-09",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1583584,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Vincent Chatelain",
        "place_of_birth": null,
        "popularity": 0.0552,
        "profile_path": null
    }
}