{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/iv1ajZACUGHn4JztG9Z8yvbcmic.jpg",
                "genre_ids": [
                    35,
                    10402
                ],
                "id": 1584,
                "original_language": "en",
                "original_title": "School of Rock",
                "overview": "Fired from his band and hard up for cash, guitarist and vocalist Dewey Finn finagles his way into a job as a fifth-grade substitute teacher at a private school, where he secretly begins teaching his students the finer points of rock 'n' roll. The school's hard-nosed principal is rightly suspicious of Finn's activities. But Finn's roommate remains in the dark about what he's doing.",
                "popularity": 5.5566,
                "poster_path": "/zXLXaepIBvFVLU25DH3wv4IPSbe.jpg",
                "release_date": "2003-10-03",
                "title": "School of Rock",
                "video": false,
                "vote_average": 7.084,
                "vote_count": 5876,
                "character": "Katie",
                "credit_id": "56d03f0bc3a3681e3c006509",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Becca Brown",
            "Rebecca Brown"
        ],
        "biography": "Rivkah Reyes (they/she, but mostly they) is a queer Filipinx-Jewish actor, musician, comedian, producer, and writer from Chicago. They have been performing since the age of 4 when they picked up a guitar for the first time. In the 4th grade, Rivkah performed on the NPR show From the Top, which eventually led to them being discovered and cast in the 2003 film School of Rock. Since their movie debut, Riv has been a prominent force in the comedy and theater scenes of Chicago, Los Angeles, and New York.\n\nThey have worked with The Second City in Chicago on several sketch revues and performed improv, sketch, and stand-up at iO, The Hollywood Improv, The Laugh Factory, Club Cumming, and Las Culturistas' I Don't Think So Honey! Live. They are an alum of the School at Steppenwolf, The Second City and iO's training centers, and the University of Illinois at Chicago. In 2020, Rivkah released an article called “Confessions of an Obsolete Child Actor” about their journey from childhood stardom to adulthood lessons. Currently, Riv resides in Los Angeles and spends their days drinking tea, listening to Lo-Fi beats, and being a spooky witch.",
        "birthday": "1992-08-18",
        "deathday": null,
        "gender": 3,
        "homepage": "https://www.rivkahreyes.com/",
        "id": 1583107,
        "imdb_id": "nm1440134",
        "known_for_department": "Acting",
        "name": "Rivkah Reyes",
        "place_of_birth": "Chicago, Illinois, USA",
        "popularity": 0.2955,
        "profile_path": "/syGvodwI4LZO7S7Vqpju5ykdkvU.jpg"
    }
}