{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6HRo6TUVcb0x9Rzq3h8rURvZMzf.jpg",
                "genre_ids": [
                    18,
                    53,
                    10752
                ],
                "id": 333352,
                "original_language": "en",
                "original_title": "Eye in the Sky",
                "overview": "A UK-based military officer in command of a top secret drone operation to capture terrorists in Kenya discovers the targets are planning a suicide bombing and the mission escalates from “capture” to “kill.” As American pilot Steve Watts is about to engage, a nine-year old girl enters the kill zone, triggering an international dispute reaching the highest levels of US and British government over the moral, political, and personal implications of modern warfare.",
                "popularity": 4.0929,
                "poster_path": "/xMY2XbaRtmto9LXwo83wnYRKN2U.jpg",
                "release_date": "2015-09-07",
                "title": "Eye in the Sky",
                "video": false,
                "vote_average": 7.007,
                "vote_count": 1640,
                "character": "Female Sergeant",
                "credit_id": "56d53668c3a3681e39016157",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Kate Liquorish is a South African actor who started her work on stage, garnering multiple award nominations, including best actress and best supporting actress at the esteemed Fleur De Cap Theatre Awards, which focuses on professional productions in and around South Africa. Liquorish is equally as talented on screen; the actor has achieved the seminal experience of acting opposite Dame Helen Mirren in Gavin Hood’s “Eye In the Sky”, a thriller film which was produced by Colin Firth, whilst in BET’s series Madiba the actor stars alongside the likes of Laurence Fishburne of The Matrix, Orlando Jones of American Gods and David Harewood of Supergirl, with Liquorish playing the iconic political activist Ruth First.\n\nLiquorish’s most recent project includes starring alongside Pearl Thusi, a prestigious actor, model, television and radio personality, in Africa’s first netflix Original Queen Sono. Queen Sono was so spectacularly beloved that many fans have been begging for a second season, despite only dropping in 2020. Queen Sono saw African talent take over the big screen, and saw Liquorish play the role of eKaterina Gromova. Other projects for the actor include in television series Still Breathing, which is a deeply poignant show discussing a group of friends who, after having drifted apart, reconnect after tragedy has struck. Liqourish also produces her own podcast, and posts to her followers, which numbers over 4 thousand, about her various interests which include cooking and writing.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1584777,
        "imdb_id": "nm5539110",
        "known_for_department": "Acting",
        "name": "Kate Liquorish",
        "place_of_birth": null,
        "popularity": 0.6117,
        "profile_path": "/kHX9IavOap9HzeN59IDk2g5zSxv.jpg"
    }
}