{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jOqOduY1tLhXgVZo7ypCtDVr0mM.jpg",
                "genre_ids": [
                    18,
                    9648,
                    53
                ],
                "id": 489999,
                "original_language": "en",
                "original_title": "Searching",
                "overview": "After David Kim's 16-year-old daughter goes missing, a local investigation is opened and a detective is assigned to the case. But 37 hours later and without a single lead, David decides to search the one place no one has looked yet, where all secrets are kept today: his daughter's laptop.",
                "popularity": 3.0395,
                "poster_path": "/yuAPCsCGJGSxA7YOW4elF5JNrzK.jpg",
                "release_date": "2018-08-24",
                "title": "Searching",
                "video": false,
                "vote_average": 7.571,
                "vote_count": 4028,
                "character": "Emergency Medical Technician (uncredited)",
                "credit_id": "5f52ab8f43999b0034e0af8b",
                "order": 44
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Rene Aranda",
            "Ren Aranda"
        ],
        "biography": "Rene Michelle Aranda, sometimes credited as Ren Aranda, is a multi-award winning, American actress and international producer.\n\nRen's career pursuits began at the age of 13, when she attended her first theater class at Robert O. Townsend Junior High School. She graduated Ruben S. Ayala High School in 2009 with over a dozen awards from the school's drama department, including \"Most Inspirational\" two years in a row and the first 'Lifetime Achievement Award' in the history of the school's program, founded in her honor. The Thespian Arts Theatre Festival she founded her senior year continues, annually to this date, at her alma matter and inspired other departments, campus-wide, to celebrate talent shows of their own.\n\nIn the fall following her high school graduation, Ren moved to Los Angeles to attend the 3-year, audition-only conservatory, The LACC Theatre Academy. The Academy alumni includes Morgan Freeman, Mark Hamill, Cindy Williams and Donna Reed. During Aranda's attendance there, she won national recognition when presented with the \"Outstanding Performance by an Actress\" Award at the John F. Kennedy Center for the Performing Arts for her role as \"Willie The Space Freak\" in a gender-bended adaptation of Sam Shepard's, \"The Unseen Hand\". She was flown from Los Angeles to Washington D.C. to be honored February of 2012. There were only two recipients of this first annual award, nationwide. She shaved her head for the role and was credited for this in BuzzFeed Community article, \"17 Trail-Blazing Bald Beauties In Hollywood\", listed among the likes of Persis Khambatta, Angelina Jolie-Pitt, Natalie Portman, Elliot Page and more.\n\nAranda gained furhter notability in the Entertainment Industry early in her movie career for her producer role in five back-to-back feature films under Plus Entertainment, commissioned for Spanish Television Network, Cinelatino, in 2014. During production, a partnership with Hollywood TV Cops and Hollywood & Vine Talent Casting developed, out of which she landed her most notable roles across feature films, music videos and television shows.\n\nShe founded her production company, Starpark Studios, in 2008 and made it LLC in 2013. Her acting and producing work has been distributed by the likes of Lifetime, Ion, Syfy, Starz, Discovery, Cinelatino, Netflix, Walmart, Redbox, Amazon, iTunes, YouTube and in movie theaters across the U.S.",
        "birthday": "1990-12-06",
        "deathday": null,
        "gender": 1,
        "homepage": "http://renearanda.com",
        "id": 1585167,
        "imdb_id": "nm5237822",
        "known_for_department": "Acting",
        "name": "Rene Michelle Aranda",
        "place_of_birth": "Whittier, California, USA",
        "popularity": 0.0828,
        "profile_path": "/jMooXrhbJhM5wVPpVZHKcag61MA.jpg"
    }
}