{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/o7JVhqMmrex1TPbmuxl8YXVlcfl.jpg",
                "genre_ids": [
                    28,
                    35,
                    14
                ],
                "id": 287947,
                "original_language": "en",
                "original_title": "Shazam!",
                "overview": "A boy is given the ability to become an adult superhero in times of need with a single magic word.",
                "popularity": 5.5654,
                "poster_path": "/xnopI5Xtky18MPhK40cZAGAOVeV.jpg",
                "release_date": "2019-03-29",
                "title": "Shazam!",
                "video": false,
                "vote_average": 6.988,
                "vote_count": 9869,
                "character": "Interviewee",
                "credit_id": "62dc55715ca70400679c4e99",
                "order": 87
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Lisa Codrington, a renowned actor and writer in Toronto, earned acclaim with a Governor General’s Award for Drama nomination and received the K.M. Hunter Theater Award and the Carol Bolt Award for Playwrights. Her impressive writing credits encompass acclaimed works like \"The Prescription – 21 Black Futures\" (Obsidian/CBC), \"The Adventures of the Black Girl in Her Search for God\" (Shaw Festival, Karamu House), \"Up the Garden Path\" (Obsidian Theatre), \"The Aftermath\" (Groundswell Festival, Femfest), \"The Colony – Opera to Go\" (Tapestry), and \"Cast Iron\" (Nightwood Theatre & Obsidian Theatre). Her acting roles span across Letterkenny, Orphan Black, Schitt's Creek, The Handmaid's Tale, Bad Blood, Anne with an E, CBC's Children Ruin Everything, and Amazon Prime's The Lake. Currently, Lisa's actively developing two new plays while serving as a playwright in residence at Why Not Theatre, showcasing her prolific talent and dedication to the craft.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1586973,
        "imdb_id": "nm5854586",
        "known_for_department": "Acting",
        "name": "Lisa Codrington",
        "place_of_birth": null,
        "popularity": 0.1283,
        "profile_path": "/g2HSLaDsKwpkUbaKJRE2eEtpwix.jpg"
    }
}