{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/x2LTysjFSpeK0d40zHw6Lqd4oAH.jpg",
                "genre_ids": [
                    12,
                    14,
                    10749,
                    10751
                ],
                "id": 2270,
                "original_language": "en",
                "original_title": "Stardust",
                "overview": "In a countryside town bordering on a magical land, a young man makes a promise to his beloved that he'll retrieve a fallen star by venturing into the magical realm. His journey takes him into a world beyond his wildest dreams and reveals his true identity.",
                "popularity": 6.5831,
                "poster_path": "/7zbFmxy3DqKYL2M8Hop6uylp2Uy.jpg",
                "release_date": "2007-08-10",
                "title": "Stardust",
                "video": false,
                "vote_average": 7.283,
                "vote_count": 4227,
                "character": "Mr. Monday",
                "credit_id": "56da889ec3a3684ca6000db9",
                "order": 30
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Frank has been an actor for over forty years, during which time he has  done seasons with most of the major repertory companies in Britain, including Birmingham, Swansea. Salisbury, Hornchurch, Dundee, Worcester, York, Liverpool, Leatherhead, Watford. He has also appeared in ten World Premieres at the Warehouse Theatre, Croydon. In the West End, he appeared in Treasure Island and Trafford Tanzi at the Mermaid, Jeanne at Sadlers Wells, Joseph and the Amazing Technicolor Dreamcoat at the Westminster and Little Shop of Horrors at the Comedy. He toured the Middle and Far East with Derek Nimmo’s Company, in Key for Two by John Chapman, and Japan and the Philippines with Ken Hill’s Phantom of the Opera.\n\nFrank has made numerous television appearances including Nicholas  Nickleby, The Professionals, The Famous Five, Mitch, Boon, Pressgang,  Old Flames, Square Deal, Camomile Lawn, Resnick, The Chief, Finney,  See-Saw, Michael Winner’s True Crimes, Undercover Heart, Holby City,  EastEnders, Doctors (6 episodes), and The Bill (five times). His films include Buster and Stardust.\n\nFrank is married to ex-actress Jenny, and has two grown-up sons and a wonderful eight-year-old grandson.",
        "birthday": "1942-03-31",
        "deathday": "2020-04-10",
        "gender": 2,
        "homepage": null,
        "id": 1586553,
        "imdb_id": "nm0007203",
        "known_for_department": "Acting",
        "name": "Frank Ellis",
        "place_of_birth": "Birmingham, England, UK",
        "popularity": 0.055,
        "profile_path": "/bk7j5ImjBLQtGvM3yUm4yEdjpAs.jpg"
    }
}