{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sd4xN5xi8tKRPrJOWwNiZEile7f.jpg",
                "genre_ids": [
                    16,
                    12,
                    35,
                    10751
                ],
                "id": 920,
                "original_language": "en",
                "original_title": "Cars",
                "overview": "Lightning McQueen, a hotshot rookie race car driven to succeed, discovers that life is about the journey, not the finish line, when he finds himself unexpectedly detoured in the sleepy Route 66 town of Radiator Springs. On route across the country to the big Piston Cup Championship in California to compete against two seasoned pros, McQueen gets to know the town's offbeat characters.",
                "popularity": 10.9704,
                "poster_path": "/u4G8EkiIBZYx0wEg2xDlXZigTOZ.jpg",
                "release_date": "2006-06-08",
                "title": "Cars",
                "video": false,
                "vote_average": 7.01,
                "vote_count": 14591,
                "character": "Flo (voice)",
                "credit_id": "52fe428dc3a36847f8027805",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/y5tad0a4yRbxYgOHGllEIEeCCKt.jpg",
                "genre_ids": [
                    16,
                    10749,
                    14,
                    10751
                ],
                "id": 10198,
                "original_language": "en",
                "original_title": "The Princess and the Frog",
                "overview": "A waitress, desperate to fulfill her dreams as a restaurant owner, is set on a journey to turn a frog prince back into a human being, but she has to face the same problem after she kisses him.",
                "popularity": 12.4762,
                "poster_path": "/v6nAUs62OJ4DXmnnmPFeVmMz8H9.jpg",
                "release_date": "2009-12-08",
                "title": "The Princess and the Frog",
                "video": false,
                "vote_average": 7.215,
                "vote_count": 5889,
                "character": "Mama Odie (voice)",
                "credit_id": "52fe43409251416c7500938b",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/ioqaIhJSkwa9DGRHGtOOUTiGRs2.jpg",
                "genre_ids": [
                    12,
                    18
                ],
                "id": 8358,
                "original_language": "en",
                "original_title": "Cast Away",
                "overview": "Chuck Noland, a top international manager for FedEx, and Kelly, a Ph.D. student, are in love and heading towards marriage. Then Chuck's plane to Malaysia crashes at sea during a terrible storm. He's the only survivor, and finds himself marooned on a desolate island. With no way to escape, Chuck must find ways to survive in his new home.",
                "popularity": 7.9895,
                "poster_path": "/7lLJgKnAicAcR5UEuo8xhSMj18w.jpg",
                "release_date": "2000-12-22",
                "title": "Cast Away",
                "video": false,
                "vote_average": 7.661,
                "vote_count": 11818,
                "character": "Becca Twig",
                "credit_id": "5e05b2310284200019b8fa8c",
                "order": 33
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Jenifer Jeanette Lewis (born January 25, 1957) is an American film and television actress and singer.\n\nShe is one of Hollywood's most familiar faces, with more than 300 appearances in film and television and was dubbed a \"national treasure\" by TV Guide.com. She began her career appearing in Broadway musicals and worked as a back-up singer for Bette Midler before appearing in the films Beaches and Sister Act.\n\nShe delivered legendary performances as Tina Turner's mother in What's Love Got to Do With It and in The Preacher's Wife as the mother of Whitney Houston's character.\n\nShe starred opposite Matt Damon in Clint Eastwood's Hereafter. For director Tyler Perry, she created unforgettable characters in Madea's Family Reunion and Meet the Browns. In the movie Cast Away, she portrayed Tom Hanks' boss. In animated films, Jenifer's uniquely recognizable voice is adored by Disney fans worldwide in roles such as \"Flo\" in Cars and Cars 2, and as \"Mama Odie\" in The Princess and the Frog.\n\nFor six seasons, Jenifer portrayed \"Lana Hawkins\" on Lifetime's hit series Strong Medicine. She starred on the hit show Black-ish (ABC), where her hilarious portrayal of \"Ruby Johnson\" earned her a nomination for the 2016 Critics Choice Award.\n\nShe has also written two books: The Mother of Black Hollywood and Walking in My Joy: In These Streets.",
        "birthday": "1957-01-25",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 15899,
        "imdb_id": "nm0507338",
        "known_for_department": "Acting",
        "name": "Jenifer Lewis",
        "place_of_birth": "Kinloch, Missouri, USA",
        "popularity": 0.4402,
        "profile_path": "/bdeUHXY4cXvhOW2nCblNachBYsM.jpg"
    }
}