{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sd4xN5xi8tKRPrJOWwNiZEile7f.jpg",
                "genre_ids": [
                    16,
                    12,
                    35,
                    10751
                ],
                "id": 920,
                "original_language": "en",
                "original_title": "Cars",
                "overview": "Lightning McQueen, a hotshot rookie race car driven to succeed, discovers that life is about the journey, not the finish line, when he finds himself unexpectedly detoured in the sleepy Route 66 town of Radiator Springs. On route across the country to the big Piston Cup Championship in California to compete against two seasoned pros, McQueen gets to know the town's offbeat characters.",
                "popularity": 10.888,
                "poster_path": "/u4G8EkiIBZYx0wEg2xDlXZigTOZ.jpg",
                "release_date": "2006-06-08",
                "title": "Cars",
                "video": false,
                "vote_average": 7.01,
                "vote_count": 14592,
                "character": "Fillmore (voice)",
                "credit_id": "52fe428dc3a36847f8027811",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/wXzdoMyLYvz7AoXPGx5STZ1XZDd.jpg",
                "genre_ids": [
                    14,
                    35,
                    12
                ],
                "id": 1832,
                "original_language": "en",
                "original_title": "Dogma",
                "overview": "An abortion clinic worker with a special heritage is called upon to save the existence of humanity from being negated by two renegade angels trying to exploit a loophole and reenter Heaven.",
                "popularity": 4.3598,
                "poster_path": "/xI5beD8Td79E2uZNAxgd1gWWOEd.jpg",
                "release_date": "1999-10-04",
                "title": "Dogma",
                "video": false,
                "vote_average": 6.925,
                "vote_count": 2645,
                "character": "Cardinal Glick",
                "credit_id": "52fe4318c3a36847f8039edf",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/4CLZ8P4kZNBLR06n1NdxxWKnFRp.jpg",
                "genre_ids": [
                    99,
                    36
                ],
                "id": 13016,
                "original_language": "en",
                "original_title": "Zeitgeist",
                "overview": "A documentary examining possible historical and modern conspiracies surrounding Christianity, the 9/11 terrorist attacks, and the Federal Reserve bank.",
                "popularity": 0.8843,
                "poster_path": "/4eJQJ3tvnNO7CdxXT5awnd9ovGX.jpg",
                "release_date": "2007-06-01",
                "title": "Zeitgeist",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 504,
                "character": "Self (voice) (archive sound)",
                "credit_id": "65aed84e6af8f800cd7a8068",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "George Denis Patrick Carlin (May 12, 1937 – June 22, 2008) was an American stand-up comedian, social critic, actor and author, who won five Grammy Awards for his comedy albums.  Carlin was noted for his black humor as well as his thoughts on politics, the English language, psychology, religion, and various taboo subjects. Carlin and his \"Seven Dirty Words\" comedy routine were central to the 1978 U.S. Supreme Court case F.C.C. v. Pacifica Foundation, in which a narrow 5–4 decision by the justices affirmed the government's power to regulate indecent material on the public airwaves.\n\nThe first of his fourteen stand-up comedy specials for HBO was filmed in 1977. In the 1990s and 2000s, Carlin's routines focused on socio-cultural criticism of modern American society. He often commented on contemporary political issues in the United States and satirized the excesses of American culture. His final HBO special, It's Bad for Ya, was filmed less than four months before his death.\n\nIn 2004, Carlin placed second on the Comedy Central list of the 100 greatest stand-up comedians of all time, ahead of Lenny Bruce and behind Richard Pryor.  He was a frequent performer and guest host on The Tonight Show during the three-decade Johnny Carson era, and hosted the first episode of Saturday Night Live. In 2008, he was awarded the Mark Twain Prize for American Humor.\n\nDescription above from the Wikipedia article George Carlin, licensed under CC-BY-SA, full list of contributors on Wikipedia .",
        "birthday": "1937-05-12",
        "deathday": "2008-06-22",
        "gender": 2,
        "homepage": "http://www.georgecarlin.com",
        "id": 15903,
        "imdb_id": "nm0137506",
        "known_for_department": "Acting",
        "name": "George Carlin",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.6126,
        "profile_path": "/6YKQHJzml6XviUADpSC6kfF56W9.jpg"
    }
}