{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/oMnJhVFr0xVfxy4HPBt1LDKoFgV.jpg",
                "genre_ids": [
                    27,
                    9648
                ],
                "id": 591274,
                "original_language": "en",
                "original_title": "Fear Street: 1978",
                "overview": "In 1978, two rival groups at Camp Nightwing must band together to solve a terrifying mystery when horrors from their towns' history come alive.",
                "popularity": 8.5384,
                "poster_path": "/5dNTxhoGDTHHGqUTdxcr4H1dqlU.jpg",
                "release_date": "2021-07-08",
                "title": "Fear Street: 1978",
                "video": false,
                "vote_average": 7.187,
                "vote_count": 2081,
                "character": "Sheila",
                "credit_id": "60ac045a6331b2003fe5cba4",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Chiara Aurelia de Braconier d'Alphen",
            "Chiara de Braconier d'Alphen"
        ],
        "biography": "Chiara Aurelia de Braconier d'Alphen was born in Taos, New Mexico to a Belgian father and an American mother and grew up in Albuquerque. She pioneered her pursuit of acting at the Lee Strasberg Theater after moving to Los Angeles when she was four years old. She traveled between the mountains of the Southwest, and the Sunshine State during her childhood with her clear focus in acting, dancing and singing. Chiara was ecstatic to move to Los Angeles full time in 2014 to pursue her acting career and has enjoyed every minute. Chiara's resume since includes her most recent portrayal of \"Rose Lord\" in her series regular role on TELL ME YOUR SECRETS, along side Amy Brenneman and Lily Rabe. She is excited for the release of this show on TNT upcoming in 2019. She played \"Misty\" in the Independent Feature Film released in 2018 in the Spotlight portion at the Tribeca Film Festival. Alex Pettyfer directs and stars in BACK ROADS whose cast also includes Juliette Lewis, Jennifer Morrison and Nicola Peltz. In 2017 Chiara portrayed a young Carla Gugino as \"Jessie\" in GERALD'S GAME, an adaptation of the Stephen King novel for Netflix, directed by Mike Flanagan (HUSH, OUIJA). She also appeared as a recurring guest star on NBC's THE BRAVE wrapping up the last two episodes of their show. Chiara's other credits include, RECOVERY ROAD on ABC where she played Young Haley Lu Richardson, Nickelodeon's NICKY, RICKY, DICKY AND DAWN, and ABC's show, AGENT CARTER, for Marvel Studios. She also appeared in PRETTY LITTLE LIARS, as well as the feature film BIG SKY, alongside Kyra Sedgwick and Bella Thorne. With gratitude Chiara was nominated and awarded Best Performance by a Young Actress in a Supporting Role in 2019 for her role in BACK ROADS and in 2017 & 2018 for her role in GERALD'S GAME by The Young Entertainer's Awards as well as The BAM Awards. She was nominated in 2016 for the Young Artist's Award for Best Young Actress for her role in SECRET SUMMER. And in 2015, Chiara won Best Young Artist at Cinerockom International Film Festival for her role in the film OPAL. Along with acting, Chiara believes that kindness is created through compassion towards others and she supports numerous local and international non-profit organizations, and donates her income to various charities. She has volunteered and supported finding happy homes for animals through No Kill Los Angeles & Best Friends Animal Society. She also volunteers to feed the homeless through The Angel Food Project in Los Angeles, and is a member of the Young Leaders Council at Oceana.",
        "birthday": "2002-09-13",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1590225,
        "imdb_id": "nm5988570",
        "known_for_department": "Acting",
        "name": "Chiara Aurelia",
        "place_of_birth": "Taos, New Mexico, USA",
        "popularity": 0.4858,
        "profile_path": "/p0pKPznL6pJ2PlKIarLMrXjCvNF.jpg"
    }
}