{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xQyGkQ8ICa4lgifGr3oZjkm3AJ2.jpg",
                "genre_ids": [
                    18
                ],
                "id": 804095,
                "original_language": "en",
                "original_title": "The Fabelmans",
                "overview": "Growing up in post-World War II era Arizona, young Sammy Fabelman aspires to become a filmmaker as he reaches adolescence, but soon discovers a shattering family secret and explores how the power of films can help him see the truth.",
                "popularity": 5.3526,
                "poster_path": "/h7llKkqkkJtJrTOaDLuVeUYDQ7I.jpg",
                "release_date": "2022-11-11",
                "title": "The Fabelmans",
                "video": false,
                "vote_average": 7.584,
                "vote_count": 2551,
                "character": "Barry",
                "credit_id": "6317079a7fcab3007a21ecb8",
                "order": 25
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Kalama Epstein was born and raised on the island of Oahu, Hawaii, and is the youngest of three children. His first name means \"flaming torch\" in Hawaiian. Performing runs in his genes, and he has been modeling and performing since he was a baby, with a lifelong passion for film and film-making. He realized he also enjoyed being in front of the camera after co-starring on an episode of Hawaii Five-0 (2010). Since then, Kalama has spent the majority of his time in Los Angeles pursuing his dreams of acting and directing. He has landed starring roles in the Amazon Studios pilot Maker Shack Agency (2014), the Nickelodeon show Deadtime Stories (2012), and the feature film Under the Blood-Red Sun (2014). He has guest starred on a variety of shows including CW's Crazy Ex-Girlfriend (2015), Nickelodeons Bella and the Bulldogs (2015), Disney's Dog with a Blog (2012), and will be seen in a recurring role in The Fosters, season 4. Kalama was the lead in the award winning short film The Kid (2013), written and directed by Sean Brosnan. He has also co-starred on an episode of HBO's Ray Donovan (2013) and was the principal in numerous national commercials.",
        "birthday": "2000-05-05",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1590304,
        "imdb_id": "nm4795228",
        "known_for_department": "Acting",
        "name": "Kalama Epstein",
        "place_of_birth": "Oahu, Hawaii, USA",
        "popularity": 0.1717,
        "profile_path": "/kuZuEBSCW5pBBiAjKADuRGMb59X.jpg"
    }
}