{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/e782pDRAlu4BG0ahd777n8zfPzZ.jpg",
                "genre_ids": [
                    16,
                    14,
                    12,
                    18
                ],
                "id": 555604,
                "original_language": "en",
                "original_title": "Guillermo del Toro's Pinocchio",
                "overview": "During the rise of fascism in Mussolini's Italy, a wooden boy brought magically to life struggles to live up to his father's expectations.",
                "popularity": 4.8713,
                "poster_path": "/vx1u0uwxdlhV2MUzj4VlcMB0N6m.jpg",
                "release_date": "2022-11-09",
                "title": "Guillermo del Toro's Pinocchio",
                "video": false,
                "vote_average": 8.047,
                "vote_count": 3121,
                "character": "Twin Daughter 2 / Old Woman / Street Sweep (voice)",
                "credit_id": "638d297915376c3e0ff3f666",
                "order": 14
            },
            {
                "adult": false,
                "backdrop_path": "/620hnMVLu6RSZW6a5rwO8gqpt0t.jpg",
                "genre_ids": [
                    16,
                    35,
                    14,
                    12,
                    10751
                ],
                "id": 508943,
                "original_language": "en",
                "original_title": "Luca",
                "overview": "Luca and his best friend Alberto experience an unforgettable summer on the Italian Riviera. But all the fun is threatened by a deeply-held secret: they are sea monsters from another world just below the water’s surface.",
                "popularity": 9.2167,
                "poster_path": "/9x4i9uKGXt8IiiIF5Ey0DIoY738.jpg",
                "release_date": "2021-06-17",
                "title": "Luca",
                "video": false,
                "vote_average": 7.795,
                "vote_count": 8666,
                "character": "Maggiore (Cop) (voice)",
                "credit_id": "60cd928a5ff34e00573fd1bd",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Francesca Fanti was chosen by Francis Ford Coppola to play the leading role of Filomena Corrado in Distant Vision (2016), a live cinema experimental production directed by Coppola as a month-long project at UCLA.\n\nFrancesca presented the bold one-woman comedy show \"Orgasmo Adulto Escapes From the Zoo,\" (written by Nobel Prize winner Dario Fo and Franca Rame), and won the ADA Artistic Director Achievement Award for Best Actress in a Comedy in Los Angeles first, then The Bay Area Critics Award for Best Solo Performance in San Francisco where the show was critically acclaimed, sold out and extended for months.\n\nIn Italy, Francesca worked with American character actor Vincent Schiavelli, presenting the show \"Cc'era 'Na Vota\" in Sicilian dialect (not her own) to audiences in Sicily. She also starred in the very popular Italian TV show \"La Squadra\" and worked with director Carlo Carlei on the TV movie \"Ferrari\".\n\nMilestone Italian writer Dacia Maraini invited Francesca to perform her work in Italy after seeing Francesca's sterling performance of the drama one-woman show \"Letters of Love\" in Los Angeles. Francesca later on brought Maraini's controversial play \"Dialogue Between a Prostitute and Her Client\" to critically acclaimed performances in Pasadena and she has written a film adaptation of this play. She is also developing two other projects: \"Dating Valentina\" (a comedy about divorce, single parenting and online dating debut) and \"Missing Michael H.\" (a drama based on the true story of a friend who recently went missing).\n\nShe can be seen in the FX TV show \"American Crime Story - The Assassination of Gianni Versace\" (episode #8) in the role of Franca Versace, mom of Gianni. Also in Bryan Singer's critically acclaimed digital web series \"H+\" (2012-2013) in the leading role of Simona Rossi and in Nine (2009) opposite Daniel Day Lewis. A versatile actor, Fanti has provided voice work for many projects including \"Madagascar 3: Europe's Most Wanted\" (2012) and has appeared in numerous national commercials with such celebrities as Herb Ritts, Elizabeth Taylor, Madonna and Bob Richardson.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1591205,
        "imdb_id": "nm0266908",
        "known_for_department": "Acting",
        "name": "Francesca Fanti",
        "place_of_birth": null,
        "popularity": 0.3536,
        "profile_path": "/8Kti1mECLgP1QYmkSiDl3EOsCxE.jpg"
    }
}