{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4LRemkftqYK7OmmP88rJLTvGYHu.jpg",
                "genre_ids": [
                    18,
                    53,
                    80,
                    9648
                ],
                "id": 15472,
                "original_language": "sv",
                "original_title": "Män som hatar kvinnor",
                "overview": "Swedish thriller based on Stieg Larsson's novel about a male journalist and a young female hacker. In the opening of the movie, Mikael Blomkvist, a middle-aged publisher for the magazine Millennium, loses a libel case brought by corrupt Swedish industrialist Hans-Erik Wennerström. Nevertheless, he is hired by Henrik Vanger in order to solve a cold case, the disappearance of Vanger's niece",
                "popularity": 4.6015,
                "poster_path": "/6w0TKhfR0Rzby5SXxgfuI99Jrva.jpg",
                "release_date": "2009-02-27",
                "title": "The Girl with the Dragon Tattoo",
                "video": false,
                "vote_average": 7.53,
                "vote_count": 3069,
                "character": "Man (uncredited)",
                "credit_id": "5acb994fc3a3687e480172e4",
                "order": 41
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Danny Anthony"
        ],
        "biography": "Daniel has been working worldwide as an actor, filmmaker, and model for over 10 years. Hailing from Sweden, he studied acting at the prestigious Stella Adler acting school in Los Angeles. While studying there, he was awarded Best Cinematographer for the short film, JAMES AND QUINN, his impressive entry into Scott Haze's 120-Hour Film Festival, in 2013. He also had lead roles in commercials such as Corona and CitiBank. As a model, Daniel was chosen by Tags Clothing as part of their billboard campaign that same year. After returning to Sweden in 2014, his list of commercial and TV credits continues to grow, and he is currently developing a web series.",
        "birthday": "1988-01-06",
        "deathday": null,
        "gender": 2,
        "homepage": "https://commercialactors.com/?option=com_ca&view=caprofileview&id=1694",
        "id": 1593589,
        "imdb_id": "nm3834744",
        "known_for_department": "Acting",
        "name": "Daniel Abreu",
        "place_of_birth": "Sweden",
        "popularity": 0.0535,
        "profile_path": "/hPX7KIFXPeQfKReFUuJuYkFsb0v.jpg"
    }
}