{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4FnbeuCnsN3MT6omPrivl2ttJ8o.jpg",
                "genre_ids": [
                    18,
                    10752,
                    36
                ],
                "id": 1061699,
                "original_language": "en",
                "original_title": "The Six Triple Eight",
                "overview": "During World War II, the US Army's only all-Black, all-women battalion takes on an impossible mission: sorting through a three-year backlog of 17 million pieces of mail that hadn't been delivered to American soldiers and finish within six months.",
                "popularity": 3.8913,
                "poster_path": "/7tvAnzZj9e9AjdoHaN9jshm2Cjw.jpg",
                "release_date": "2024-12-06",
                "title": "The Six Triple Eight",
                "video": false,
                "vote_average": 7.541,
                "vote_count": 564,
                "character": "Elaine White",
                "credit_id": "63bf1a0405a5330094ee4f56",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Stephanie Sonuga"
        ],
        "biography": "Pepi Sonuga is one to watch on both the big and small screen. The Nigerian-American actress was born in Lagos, Nigeria and moved to Los Angeles, California at the age of 10 to begin pursuing a career in entertainment. At 15 years old, she won the title of Miss Jr. Teen Los Angeles in a local pageant and then began modeling for brands such as Hot Topic, Forever 21, Skechers and many more. She attended Culver City High School and began studying theater arts, improvisation, and script writing in a drama class. She most recently starred in the Freeform drama series, Famous In Love, for two seasons.\n\nSonuga got her first start in the 2013 drama, The Life Of A King. The film is based on the true story of Eugene Brown, played by Cuba Gooding Jr. On television, she starred in Starz's comedy-horror series, Ash VS Evil Dead and also recurred on the Freeform family drama, The Fosters. She will next be seen in the feature, Thriller, opposite Mykelti Williamson and RZA. Written and directed by Dallas Jackson, the horror film tells the story of a clique of South Central Los Angeles teens who find themselves terrorized during Homecoming weekend years after a childhood prank goes horribly wrong. The film premiered at the 2018 LA Film Festival.",
        "birthday": "1993-09-08",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1594135,
        "imdb_id": "nm3345344",
        "known_for_department": "Acting",
        "name": "Pepi Sonuga",
        "place_of_birth": "Lagos, Nigeria",
        "popularity": 0.2636,
        "profile_path": "/ySgVYbU00lohcpnD178ewvILCWC.jpg"
    }
}