{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mKnKgHZaGcrhBnRNZ1gYWhDLM3L.jpg",
                "genre_ids": [
                    35,
                    14
                ],
                "id": 11787,
                "original_language": "en",
                "original_title": "Harvey",
                "overview": "The story of Elwood P. Dowd who makes friends with a spirit taking the form of a human-sized rabbit named Harvey that only he sees (and a few privileged others on occasion also.) After his sister tries to commit him to a mental institution, a comedy of errors ensues. Elwood and Harvey become the catalysts for a family mending its wounds and for romance blossoming in unexpected places.",
                "popularity": 3.0774,
                "poster_path": "/dgd82hYmpiXDM1G867HqNaWe8wj.jpg",
                "release_date": "1950-12-04",
                "title": "Harvey",
                "video": false,
                "vote_average": 7.672,
                "vote_count": 646,
                "character": "Dr. Sanderson",
                "credit_id": "63319166d7f465007d9b1322",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/9xzVKUGbVKrrgwlmshJ8SxI5mL7.jpg",
                "genre_ids": [
                    9648,
                    80,
                    53
                ],
                "id": 963,
                "original_language": "en",
                "original_title": "The Maltese Falcon",
                "overview": "A private detective takes on a case that involves him with three eccentric criminals, a beautiful liar, and their quest for a priceless statuette.",
                "popularity": 5.616,
                "poster_path": "/bf4o6Uzw5wqLjdKwRuiDrN1xyvl.jpg",
                "release_date": "1941-10-18",
                "title": "The Maltese Falcon",
                "video": false,
                "vote_average": 7.712,
                "vote_count": 1775,
                "character": "Reporter (uncredited)",
                "credit_id": "560497d1c3a3685c420003e6",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Charles Ruppert"
        ],
        "biography": "Charles Drake (October 2, 1917 – September 10, 1994) was an American actor.Drake was born as Charles Ruppert in New York City. He graduated from Nichols College and became a salesman. In 1939, he turned to acting and signed a contract with Warner Brothers. He wasn't immediately successful. World War II interrupted his career; soon after his military service was complete, Drake returned to Hollywood in 1945, his contract with Warner Brothers ended. In the 1940s, he did some freelance work, like A Night in Casablanca. In 1949 he moved to Universal Studios. In 1955, Drake turned to television as one of the stock-company players on Robert Montgomery Presents and three years later he became the host of the British TV espionage weekly Rendezvous. In 1959, he starred in the Western film, No Name on the Bullet, where he played a doctor dedicated to saving a small town from a dangerous assassin. In 1967 he played the part of Oliver Greer in The Fugitive episode The One That Got Away. He played in 83 films between 1939 and 1975, including Scream, Pretty Peggy. More than 50 were dramas, but he also acted in comedies, science fiction, horror and film noir. He died on September 10, 1994 in East Lyme, Connecticut, aged 76.\n\nDescription above from the Wikipedia article  Charles Drake, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1917-10-02",
        "deathday": "1994-09-10",
        "gender": 2,
        "homepage": null,
        "id": 15978,
        "imdb_id": "nm0236866",
        "known_for_department": "Acting",
        "name": "Charles Drake",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.3876,
        "profile_path": "/8MbNiIMYrJ7UgKseAmBbw2sXH1M.jpg"
    }
}