{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/68NGFE8zD2gaQVH6MqJeKzojFJM.jpg",
                "genre_ids": [
                    18
                ],
                "id": 1626,
                "original_language": "fr",
                "original_title": "Vivre sa vie: film en douze tableaux",
                "overview": "Twelve episodic tales in the life of a Parisian woman and her slow descent into prostitution.",
                "popularity": 1.954,
                "poster_path": "/A0BjScjASfMFgyGI5sU0CwfKh3l.jpg",
                "release_date": "1962-09-20",
                "title": "Vivre Sa Vie",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 671,
                "character": "Man Near the Jukebox (uncredited)",
                "credit_id": "57924ae1c3a3685961004602",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jean Tenenbaum"
        ],
        "biography": "Jean Ferrat (born Jean Tenenbaum; 26 December 1930 – 13 March 2010) was a French singer-songwriter and poet. He specialized in singing poetry, particularly that of Louis Aragon. He had a left-wing sympathy that found its way into a few songs.\n\nFerrat was born in Vaucresson, Hauts-de-Seine, the youngest of four children from a modest family which moved to Versailles in 1935, where Ferrat studied at the Jules Ferry College. His Russian-born father (naturalized in 1928) was forced to wear the yellow star and deported to Auschwitz in 1942, where he died.\n\nIn the early 1950s, he started in Parisian cabaret. After that he avoided any particular musical style, but remained faithful to himself, his friends and his public. In 1956, he set \"Les yeux d'Elsa\" (\"Elsa's eyes\"), a Louis Aragon poem which Ferrat loved, to music. Its rendition by popular artist André Claveau brought Ferrat some initial recognition as a songwriter.\n\nHis first 45 RPM single was released in 1958, without success. It was not until 1959, with publisher Gérard Meys, who also became his close friend and associate, that his career started to flourish. He signed with Decca and released his second single, \"Ma Môme\", in 1960 under the musical direction of Meys.\n\nIn 1961, Ferrat married Christine Sèvres, a singer who performed some of his songs. She died in 1981 at age 50. He met Alain Goraguer, who became an arranger of his songs. His debut album, Deux Enfants du Soleil, was released that year. Ferrat also wrote songs for Zizi Jeanmaire and went on the road, sharing billing with her at the Alhambra for six months.\n\nNuit et Brouillard (\"Night and Fog\"), which followed in 1963, was awarded the Académie Charles Cros's Grand Prix du Disque and showed any topic could be put in songs. Ferrat toured again in 1965, but stopped performing on stage in 1973.\n\nIn 1990, he received an award from the Société des auteurs, compositeurs et éditeurs de musique, (SACEM) the French association of songwriters, composers and music publishers.\n\nFerrat died in Aubenas, Ardèche, following a long illness at the age of 79. He lived in Antraigues-sur-Volane, a small village of not even 700 people in Ardeche.\n\nIn 2013 Ferrat's song, Nuit et Brouillard, appeared in the BBC's list of 20 songs that changed the world.\n\nIn 2015, a tribute album was released by Columbia Records where various artists interpreted songs by Jean Ferrat. The 15-track album titled Hommage à Jean Ferrat: Des airs de liberté contained performances by artists Marc Lavoine, Cali, Dionysos, Julien Doré, Patrick Bruel, Catherine Deneuve, Benjamin Biolay, Raphaël, Patrick Fiori, Grégoire, Sanseverino, Hubert-Félix Thiéfaine, Zebda, Natasha St Pier, Patricia Petibon & Marc Lavoine and \"Ma France\" sung by Jean Ferrat. The album charted in France, Belgium and Switzerland.\n\nSource: Article \"Jean Ferrat\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1930-12-26",
        "deathday": "2010-03-13",
        "gender": 2,
        "homepage": null,
        "id": 1598818,
        "imdb_id": "nm0274202",
        "known_for_department": "Acting",
        "name": "Jean Ferrat",
        "place_of_birth": "Vaucresson, Hauts-de-Seine, France",
        "popularity": 0.1021,
        "profile_path": "/2aNMSVfDvuF4qdRdy3UZHdDBYee.jpg"
    }
}