{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tVoWbAAfTDIhTeo78SbA2V6mv8E.jpg",
                "genre_ids": [
                    35,
                    10751
                ],
                "id": 14306,
                "original_language": "en",
                "original_title": "Marley & Me",
                "overview": "A newly married couple, in the process of starting a family, learn many of life's important lessons from their trouble-loving retriever, Marley. Packed with plenty of laughs to lighten the load, the film explores the highs and lows of marriage, maturity and confronting one's own mortality, as seen through the lens of family life with a dog.",
                "popularity": 4.7013,
                "poster_path": "/pnB6hjTKylb0Ve2nUWt16gzkErr.jpg",
                "release_date": "2008-12-25",
                "title": "Marley & Me",
                "video": false,
                "vote_average": 7.192,
                "vote_count": 4671,
                "character": "Debby",
                "credit_id": "52fe45e49251416c7506614d",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "해일리 허드슨"
        ],
        "biography": "Haley Kaye Hudson (born June 14, 1986) is an American actress. She began her career at age 16 after being cast in Disney's remake of Freaky Friday opposite Jamie Lee Curtis and Lindsay Lohan. Hudson played the role of Peg, a member of the rock band Pink Slip and best friend of the main character, played by Lohan. During her teens and 20s, she portrayed many different characters in films and TV shows, including the roles of Debby in Marley & Me, Quinn Hodes in Weeds, Sydney Fields in Terminator: The Sarah Connor Chronicles, and Amanda in both Look and Look: The Series for director Adam Rifkin. In 2012, Hudson starred in the IFC horror film The Pact, which premiered at the Sundance Film Festival to mostly positive reviews. Critics singled her out for her sensitive, visceral portrayal of the blind psychic, Stevie.",
        "birthday": "1986-06-14",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 159985,
        "imdb_id": "nm1268839",
        "known_for_department": "Acting",
        "name": "Haley Hudson",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.6518,
        "profile_path": "/yyB5RFaG83XdwqbqFEBptwi9SuG.jpg"
    }
}