{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8Qsr8pvDL3s1jNZQ4HK1d1Xlvnh.jpg",
                "genre_ids": [
                    14,
                    12
                ],
                "id": 259316,
                "original_language": "en",
                "original_title": "Fantastic Beasts and Where to Find Them",
                "overview": "In 1926, Newt Scamander arrives at the Magical Congress of the United States of America with a magically expanded briefcase, which houses a number of dangerous creatures and their habitats. When the creatures escape from the briefcase, it sends the American wizarding authorities after Newt, and threatens to strain even further the state of magical and non-magical relations.",
                "popularity": 11.2281,
                "poster_path": "/h6NYfVUyM6CDURtZSnBpz647Ldd.jpg",
                "release_date": "2016-11-16",
                "title": "Fantastic Beasts and Where to Find Them",
                "video": false,
                "vote_average": 7.311,
                "vote_count": 19242,
                "character": "Policeman",
                "credit_id": "5909d8339251411cf300dcdd",
                "order": 44
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Erick Hayden is an American Actor well known for Fantastic Beasts and Where to Find Them, Spectre, and the highly anticipated live action Dumbo which is coming out in 2019. He was born in Massachusetts on April 9, 1971. He moved to Alaska in 1981 and worked in various jobs before becoming a theatre and film critic for the Anchorage Press newspaper. After doing so this led Erick to pursue a theatre degree which he received from the University of Alaska-Anchorage in 2000. He then worked as an audio/visual specialist for many years while perfecting his craft in Anchorage, Alaska. He lived there until moving to England in 2011. Since establishing himself as an actor in England he has been seen in Fantastic Beasts, Spectre, The Toymaker, Alcatraz, and many more.",
        "birthday": "1971-04-09",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.erickhayden.com/",
        "id": 1599252,
        "imdb_id": "nm3689362",
        "known_for_department": "Acting",
        "name": "Erick Hayden",
        "place_of_birth": null,
        "popularity": 0.4686,
        "profile_path": "/a9OkTdaR2mw6McSL5xTlU7bfKzl.jpg"
    }
}