{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/vZS0CQBaxj1CPFWTICXLXMJbb3o.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 18947,
                "original_language": "en",
                "original_title": "The Boat That Rocked",
                "overview": "When a group of rebellious deejays decides to defy the ban on government-censored music, they take to the seas to broadcast music and mayhem to millions of adoring fans.",
                "popularity": 4.2744,
                "poster_path": "/l7CBRLAXUnHi0kp2krhLtlJvtWI.jpg",
                "release_date": "2009-04-01",
                "title": "The Boat That Rocked",
                "video": false,
                "vote_average": 7.226,
                "vote_count": 2195,
                "character": "Model",
                "credit_id": "570aa0309251413627000090",
                "order": 26
            },
            {
                "adult": false,
                "backdrop_path": "/eVHVwP71el20fofkCHo78ebQv7Q.jpg",
                "genre_ids": [
                    28,
                    12,
                    35,
                    80
                ],
                "id": 343668,
                "original_language": "en",
                "original_title": "Kingsman: The Golden Circle",
                "overview": "When an attack on the Kingsman headquarters takes place and a new villain rises, Eggsy and Merlin are forced to work together with the American agency known as the Statesman to save the world.",
                "popularity": 7.5915,
                "poster_path": "/34xBL6BXNYFqtHO9zhcgoakS4aP.jpg",
                "release_date": "2017-09-20",
                "title": "Kingsman: The Golden Circle",
                "video": false,
                "vote_average": 6.954,
                "vote_count": 10747,
                "character": "Clara",
                "credit_id": "5918019492514159c103f15a",
                "order": 25
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "포피 델레바인"
        ],
        "biography": "Poppy Angela Delevingne (born May 3, 1986) is an English socialite, actress and model.\n\nBorn in London, one of three daughters of property developer Charles Hamar Delevingne and Pandora Anne Delevingne (née Stevens). She grew up in Belgravia and attended the independent Bedales School. She is the elder sister of retired model and actress Cara Delevingne.\n\nDelevingne's maternal grandfather was publishing executive and English Heritage chairman Sir Jocelyn Stevens, the nephew of magazine publisher Sir Edward George Warris Hulton and the grandson of newspaper proprietor Sir Edward Hulton, 1st Baronet. Her maternal grandmother Janie Sheffield, a granddaughter of the 6th Baronet Sheffield, was lady-in-waiting to Princess Margaret. Through the Sheffield baronets, Delevingne is a direct descendant of Charlemagne, King of the Franks (36th great-grandfather) and William the Conqueror (26th great-grandfather).\n\nHer paternal grandmother was the socialite The Hon. Angela Margo Hamar Greenwood and her paternal great-grandparents were the Canadian-born British politician Hamar Greenwood, 1st Viscount Greenwood and Margery Greenwood, Viscountess Greenwood. Through one of her maternal great-great-grandfathers, Sir Lionel Lawson Faudel-Phillips, 3rd Baronet, Delevingne descends from the Anglo-Jewish Faudel-Phillips baronets; two of her ancestors on that line served as Lord Mayor of London.",
        "birthday": "1986-05-03",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1603909,
        "imdb_id": "nm3518672",
        "known_for_department": "Acting",
        "name": "Poppy Delevingne",
        "place_of_birth": "London, England",
        "popularity": 0.1837,
        "profile_path": "/4EZa9PCZpQMZfrUZ7Wl2xzRSoue.jpg"
    }
}