{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/e9zfOyNd3YaViIGadiqWg9x8pAq.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 861,
                "original_language": "en",
                "original_title": "Total Recall",
                "overview": "Construction worker Douglas Quaid's obsession with the planet Mars leads him to visit Recall, a company that manufactures memories. When his memory implant goes wrong, Doug can no longer be sure what is and isn't reality.",
                "popularity": 8.61,
                "poster_path": "/wVbeL6fkbTKSmNfalj4VoAUUqJv.jpg",
                "release_date": "1990-06-01",
                "title": "Total Recall",
                "video": false,
                "vote_average": 7.308,
                "vote_count": 6102,
                "character": "Everett",
                "credit_id": "567b9c3ec3a3684bd3002322",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Marc Alaimo (born Michael Joseph Alaimo; May 5, 1942) is an American actor best known for his villainous roles, particularly as Gul Dukat on Star Trek: Deep Space Nine. He grew up in Milwaukee, Wisconsin. Alaimo began his career in theater and transitioned to television and film, often cast as antagonists. He appeared in the 1970s and 1980s in many TV shows and films before making his mark in the Star Trek franchise.\n\nIn Star Trek, Alaimo is notable for multiple roles: he was the first actor to portray a Romulan (Commander Tebok in Star Trek: The Next Generation) and the first Cardassian (Gul Macet) in the franchise. His most famous role is Gul Dukat, the complex and recurring Cardassian villain in Deep Space Nine, appearing in 35 episodes from 1993 to 1999. His portrayal brought depth and nuance to the character, making Gul Dukat one of Star Trek's most compelling villains.\n\nAlaimo's distinctive physical features influenced the design of the Cardassians, with makeup artist Michael Westmore emphasizing his neck muscles to create the species' characteristic neck ridges. Beyond Star Trek, Alaimo appeared in films like Total Recall (1990) and Naked Gun 33 1/3: The Final Insult.\n\nHe has a son, Michael Antony Alaimo, who is a writer and producer in television.",
        "birthday": "1942-05-05",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 160474,
        "imdb_id": "nm0015826",
        "known_for_department": "Acting",
        "name": "Marc Alaimo",
        "place_of_birth": "Milwaukee, Wisconsin, USA",
        "popularity": 0.4091,
        "profile_path": "/6d0WANcmGAKY1xq5SUw6aECXJaH.jpg"
    }
}