{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1GJvBE7UWU1WOVi0XREl4JQc7f8.jpg",
                "genre_ids": [
                    28,
                    12,
                    35,
                    878
                ],
                "id": 607,
                "original_language": "en",
                "original_title": "Men in Black",
                "overview": "After a police chase with an otherworldly being, a New York City cop is recruited as an agent in a top-secret organization established to monitor and police alien activity on Earth: the Men in Black. Agent K and new recruit Agent J find themselves in the middle of a deadly plot by an intergalactic terrorist who has arrived on Earth to assassinate two ambassadors from opposing galaxies.",
                "popularity": 10.6535,
                "poster_path": "/uLOmOF5IzWoyrgIF5MfUnh5pa1X.jpg",
                "release_date": "1997-07-02",
                "title": "Men in Black",
                "video": false,
                "vote_average": 7.213,
                "vote_count": 14278,
                "character": "Alien on TV Monitor (uncredited)",
                "credit_id": "5f49c2c8fe5c9100372a860b",
                "order": 64
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Marie Dionne Warrick",
            "狄昂‧華薇克"
        ],
        "biography": "Marie Dionne Warwick (born December 12, 1940) is an American singer, actress, and television host.\n\nWarwick ranks among the 40 biggest U.S. hit makers between 1955 and 1999, based on her chart history on Billboard's Hot 100 pop singles chart. She is the second-most charted female vocalist during the rock era (1955–1999). She is also one of the most-charted vocalists of all time, with 56 of her singles making the Hot 100 between 1962 and 1998 (12 of them Top Ten), and 80 singles in total – either solo or collaboratively – making the Hot 100, R&B and/or adult contemporary charts. Dionne ranks #74 on the Billboard Hot 100's \"Greatest Artists of all time\".\n\nDuring her career, she has sold more than 100 million records worldwide and she has won many awards, including six Grammy Awards. Warwick has been inducted into the Hollywood Walk of Fame, the Grammy Hall of Fame, the R&B Music Hall of Fame and the Apollo Theater Walk of Fame. In 2019 she won the Grammy Lifetime Achievement Award. Three of her songs (\"Walk On By\", \"Alfie\" and \"Don't Make Me Over\") have been inducted into the Grammy Hall of Fame. She is a former Goodwill Ambassador for the UN's Food and Agriculture Organization.\n\nMarie Dionne Warrick, later Warwick, was born in Orange, New Jersey to Lee Drinkard and Mancel Warrick. Her mother was manager of the Drinkard Singers, and her father was a Pullman porter, chef, record promoter and CPA. Dionne was named after her aunt on her mother's side. She had a sister, Delia (\"Dee Dee\"), who died in 2008, and a brother, Mancel Jr., who was killed in an accident in 1968 at age 21. Her parents were both African American, and she also has Native American and Dutch ancestry.\n\nShe was raised in East Orange, New Jersey and was a Girl Scout for a time. After finishing East Orange High School in 1959, Warwick pursued her passion at the Hartt College of Music in West Hartford, Connecticut. She landed some work with her group singing backing vocals for recording sessions in New York City. During one session, Warwick met Burt Bacharach, who hired her to record demos featuring songs written by him and lyricist Hal David. She later landed her own record deal.\n\nMany of Warwick's family were members of the Drinkard Singers, a family gospel group and RCA recording artists who frequently performed throughout the New York metropolitan area. The original group, known as the Drinkard Jubilairs, consisted of Cissy, Anne, Larry, and Nicky, and later included Warwick's grandparents, Nicholas and Delia Drinkard, and their children: William, Lee (Warwick's mother) and Hansom. When the Drinkard Singers performed on TV Gospel Time, Dionne Warwick had her television performance debut.\n\nMarie instructed the group, and they were managed by Lee. As they became more successful, Lee and Marie began performing with the group, and they were augmented by pop/R&B singer Judy Clay, whom Lee had unofficially adopted. Elvis Presley eventually expressed an interest in having them join his touring entourage. Dionne began singing gospel as a child at the New Hope Baptist Church in Newark, New Jersey. ...\n\nSource: Article \"Dionne Warwick\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1940-12-12",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.dionnewarwick.info/",
        "id": 160573,
        "imdb_id": "nm0005536",
        "known_for_department": "Acting",
        "name": "Dionne Warwick",
        "place_of_birth": "East Orange, Newark, New Jersey, USA",
        "popularity": 0.2528,
        "profile_path": "/aubfx1cK4hlkLWzBDTykRqLQXyI.jpg"
    }
}