{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8aTHhowlxO3nBQjianlIyns1ZIt.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 156700,
                "original_language": "en",
                "original_title": "The Kings of Summer",
                "overview": "Joe Toy, on the verge of adolescence, finds himself increasingly frustrated by his single father, Frank's attempts to manage his life. Declaring his freedom once and for all, he escapes to a clearing in the woods with his best friend, Patrick, and a strange kid named Biaggio. He announces that they are going to build a house there, free from responsibility and parents. Once their makeshift abode is finished, the three young men find themselves masters of their own destiny, alone in the woods.",
                "popularity": 2.4639,
                "poster_path": "/6dcIbwJuxlEnzLe0EaGFvsh4ZdS.jpg",
                "release_date": "2013-01-19",
                "title": "The Kings of Summer",
                "video": false,
                "vote_average": 6.982,
                "vote_count": 1177,
                "character": "Bus Passenger (uncredited)",
                "credit_id": "59579319c3a36828fc008f2f",
                "order": 46
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Christine was born in Brooklyn, New York, mainly raised in northeast Ohio, but spent many a holiday and summer back on the east coast where she fondly remembers entertaining neighbors on the stoop in Brooklyn, singing and dancing for an audience of women who leaned out of windows. In 2017, she discovered, unbeknownst to her, but suspected by many, her lower east side Italian heritage and the requisite loads of relatives that come with such a discovery. In 2021, she finally and happily landed back in NYC after two fruitful decades of theatre making and teaching and raising her son in Cleveland. The third time has been the charm.\n\nWhile in NYC as a younger woman, she studied comparative literature and writing at Columbia University's School of General Studies while working at ABC Radio Network News. After a whirlwind solo backpacking adventure across Europe, it was time time for graduate school, so she mustered the courage to pursue a dream she'd put on hold for too long: to study acting. She received her MFA from Kent State University. She is also published author and a U.S. Presidential Scholar Teacher who has won grants, including a National Endowment for the Humanities grant, to study Shakespeare at The Globe Theatre in London, The Juilliard School, and The National Institute on Teaching Shakespeare.\n\nChristine is also an award-winning theatre director and former artistic director. She is an alum of Lincoln Center Theater Directors Lab, Directors Lab West, Directors Lab North, and Cleveland Play House Directors Gym. She has continued her acting training with Shakespeare & Company, Dream Lab Studio, James Ciccone. and Anthony Grasso. She has taught at The Film and Media Arts School at Cleveland State University and Baldwin Wallace University Department of Theatre & Dance. She's an acting coach in private practice. She has completed one screenplay and is writing a second.\n\nShe is a member of SAG-AFTRA, AEA & SDC (the Society of Stage Directors & Choreographers).",
        "birthday": null,
        "deathday": null,
        "gender": 0,
        "homepage": null,
        "id": 1608002,
        "imdb_id": "nm3257942",
        "known_for_department": "Acting",
        "name": "Christine McBurney",
        "place_of_birth": null,
        "popularity": 0.273,
        "profile_path": "/tk8BBLNlUnz1tMiFspGuiOddi4m.jpg"
    }
}