{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/b6ZJZHUdMEFECvGiDpJjlfUWela.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 284054,
                "original_language": "en",
                "original_title": "Black Panther",
                "overview": "King T'Challa returns home to the reclusive, technologically advanced African nation of Wakanda to serve as his country's new leader. However, T'Challa soon finds that he is challenged for the throne by factions within his own country as well as without. Using powers reserved to Wakandan kings, T'Challa assumes the Black Panther mantle to join with ex-girlfriend Nakia, the queen-mother, his princess-kid sister, members of the Dora Milaje (the Wakandan 'special forces') and an American secret agent, to prevent Wakanda from being dragged into a world war.",
                "popularity": 12.2394,
                "poster_path": "/uxzzxijgPIY7slzFvMotPv8wjKA.jpg",
                "release_date": "2018-02-13",
                "title": "Black Panther",
                "video": false,
                "vote_average": 7.369,
                "vote_count": 22817,
                "character": "Young Killmonger",
                "credit_id": "58debd6a9251411b7a0110b4",
                "order": 45
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Seth Carr was born August 16, 2007 in Anaheim, California. He started his career when he was just three months old as a baby model. As he got older acting became an interest for him, and it has blossomed into a career. Seth is known for his roles in television shows/films such as Ray Donovan, Superstore, Bosch, Brooklyn Nine-Nine, Code Black, Nickelodeon's new comedy series \"Knight Squad as Fizzwick. Seth Carr is also featured in Marvel's Black Panther as young Killmonger and lead role in the suspense thriller \" Breaking In\" starring along side Gabrielle Union as her son Glover Russell.",
        "birthday": "2007-08-16",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1609481,
        "imdb_id": "nm3695624",
        "known_for_department": "Acting",
        "name": "Seth Carr",
        "place_of_birth": " Anaheim, California, USA",
        "popularity": 0.2812,
        "profile_path": "/eXaSk9kGCNPBYXwfKbxsNhvThGS.jpg"
    }
}