{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5JaR6UEoCJJLtLpqFOVMY4O4R7P.jpg",
                "genre_ids": [
                    80,
                    18,
                    28
                ],
                "id": 949,
                "original_language": "en",
                "original_title": "Heat",
                "overview": "Obsessive master thief Neil McCauley leads a top-notch crew on various daring heists throughout Los Angeles while determined detective Vincent Hanna pursues him without rest. Each man recognizes and respects the ability and the dedication of the other even though they are aware their cat-and-mouse game may end in violence.",
                "popularity": 10.0455,
                "poster_path": "/umSVjVdbVwtx5ryCA2QXL44Durm.jpg",
                "release_date": "1995-12-15",
                "title": "Heat",
                "video": false,
                "vote_average": 7.922,
                "vote_count": 7791,
                "character": "Timmons",
                "credit_id": "52fe4292c3a36847f8029267",
                "order": 27
            },
            {
                "adult": false,
                "backdrop_path": "/vSd89kiENYeFa6mPHzsM5BgliPm.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 4032,
                "original_language": "en",
                "original_title": "My Girl",
                "overview": "Vada Sultenfuss is obsessed with death. Her mother is dead, and her father runs a funeral parlor. She is also in love with her English teacher, and joins a poetry class over the summer just to impress him. Thomas J., her best friend, is \"allergic to everything\", and sticks with Vada despite her hangups. When Vada's father hires Shelly, and begins to fall for her, things take a turn to the worse...",
                "popularity": 3.3201,
                "poster_path": "/qyJJNHteA7BUwQSey05t7qP4vRV.jpg",
                "release_date": "1991-11-27",
                "title": "My Girl",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 2184,
                "character": "Danny",
                "credit_id": "5edcfabab422420022931241",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Raymond Buktenica"
        ],
        "biography": "Ray Buktenica /bʌkˈtɛniːˈkɑː/ (born August 6, 1943) is an American film and television character actor. He has played numerous roles, primarily on television since 1972. He is best known for playing the character Benny Goodwin, the boyfriend and later fiancé of Brenda Morgenstern on the 1970s sitcom Rhoda, Dr. Solomon on House Calls and Jerry Berkson, Libby's boss on Life Goes On. He provided the voice of Hugo Strange in the character's sole appearance on Batman: The Animated Series. In 1996, he guest-starred on Lois & Clark: The New Adventures of Superman as Leo Nunk, a newspaper reporter. In 1997, he guest-starred on Star Trek: Deep Space Nine, in the episode \"By Inferno's Light\", as Deyos, the Vorta in command of the Dominion's Internment Camp 371.",
        "birthday": "1943-08-06",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 160970,
        "imdb_id": "nm0119805",
        "known_for_department": "Acting",
        "name": "Ray Buktenica",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.3119,
        "profile_path": "/A5pPFbVcZOQEu6zYKgFPxfKHG7N.jpg"
    }
}