{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/77Fqz6PFCSnWySDOmEL6ZPcaYIl.jpg",
                "genre_ids": [
                    10749,
                    35
                ],
                "id": 1014590,
                "original_language": "en",
                "original_title": "Upgraded",
                "overview": "Ana is an ambitious intern dreaming of a career in the art world while trying to impress her demanding boss Claire. When she's upgraded to first class on a work trip, she meets handsome Will, and Ana pretends to be her boss– a white lie that sets off a glamorous chain of events, romance and opportunity, until her fib threatens to surface.",
                "popularity": 7.7147,
                "poster_path": "/uhOXS17gRpTwA85WsZLlYFK3rz0.jpg",
                "release_date": "2024-02-07",
                "title": "Upgraded",
                "video": false,
                "vote_average": 7.205,
                "vote_count": 929,
                "character": "Renee",
                "credit_id": "65c42bf5176a94017c36c4e8",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "فولا ایوانز اکینگبولا"
        ],
        "biography": "Fola Evans-Akingbola is a British actress and model. She portrays Maddie Bishop in Freeform's TV series, Siren.  She was born in London and grew up in Bermondsey and Honor Oak Park. Her parents are British or Nigerian. She majored in her philosophy studies but left in favor of her modeling career. She attended, according to her own statement \"just for fun\", the National Youth Theatre and the Identity School of Acting.  Fola is a London-based actress. She trained at the National Youth Theatre of Great Britain, Identity Drama School and the Actors' Temple in London. Since entering into the industry in 2014, Fola has gone on to work on internationally acclaimed shows such as Game of Thrones (HBO) and Death in Paradise (BBC). February 2017 saw Fola perform at the Southwark Playhouse in the theatre production School Play written by Alex MacKeith. Her latest on-screen project VS. is a British film produced in association with BBC films, Wildgaze and Silvertown Films, which is out in 2018. She is filming SIREN - a new TV show for Freeform/Disney ABC which premieres summer 2018. She is represented by IAG in London, William Morris Endeavour (WME) and Luber Roklin Entertainment in Los Angeles.",
        "birthday": "1994-10-26",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1610713,
        "imdb_id": "nm6826652",
        "known_for_department": "Acting",
        "name": "Fola Evans-Akingbola",
        "place_of_birth": " London, England",
        "popularity": 2.6689,
        "profile_path": "/raJY40zYj85becShbPtPCvNmdkD.jpg"
    }
}