{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7kURId6slyHNujYpCFm0Z1M3kRt.jpg",
                "genre_ids": [
                    28,
                    878,
                    12
                ],
                "id": 49538,
                "original_language": "en",
                "original_title": "X-Men: First Class",
                "overview": "Before Charles Xavier and Erik Lensherr took the names Professor X and Magneto, they were two young men discovering their powers for the first time. Before they were arch-enemies, they were closest of friends, working together with other mutants (some familiar, some new), to stop the greatest threat the world has ever known.",
                "popularity": 0.4264,
                "poster_path": "/hNEokmUke0dazoBhttFN0o3L7Xv.jpg",
                "release_date": "2011-06-01",
                "title": "X-Men: First Class",
                "video": false,
                "vote_average": 7.298,
                "vote_count": 13126,
                "character": "Soviet NCO",
                "credit_id": "571cebabc3a3684e98001a55",
                "order": 35
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "David Agranov was born in Riga, Latvia to Russian parents. His family moved to Italy and lived in Rome on Viale Regina Margherita. They then moved to London for some time, before finally emigrating to the United States. He grew up in the Washington, D.C. area and became a naturalized American citizen. Agranov is an actor, singer, and songwriter who works in Theatre, Film, Television, and Music. (member: AEA, SAG, AFTRA, ASCAP.)\n\nHe is known for playing the sadistic prison physician, \"Dr. Marat\", who manipulates Villanelle, played by Jodie Comer, in the hit series 'Killing Eve' from Phoebe Waller-Bridge and BBC America, Hired and Directed by Danny Boyle for F/X's 'Trust', he also plays \"J. Ronald Getty\", son to J. Paul Getty, as portrayed by Donald Sutherland. Shot in London, Rome, and Calabria, the cast also includes Hilary Swank as Gail Getty, Harris Dickinson, as the kidnapped grandson, J. Paul Getty III, as well as Michael Esper, and Norbert Leo Butz as the other Getty sons.\n\nIn May of 2019, he had his debut as a cast member of a Film In Competition at the Cannes Film Festival, when 'La Gomera', in Selection Officielle, had its World Premiere. Directed by Corneliu Porumboiu, the film's international title is 'The Whistlers'. He plays \"Denis\", the young American filmmaker who shows up at the wrong place at the wrong time.\n\nHe'll next be seen as \"The Knight\" in the upcoming feature film 'A Pity', directed by Kevin and Alec Barth. Their Director of Photography was Chayse Irvin, also known for Spike Lee's 'BlacKkKlansman' and the upcoming 'Blonde' from Andrew Dominik.\n\nHe played \"Rodolpho\" in A View from the Bridge, directed by Daniel Aukin at the Tony Award Winning Regional Theatre, Arena Stage, with Delaney Williams, Virginia Kull, and Louis Cancelmi. He co-produced and starred in the West Coast Premiere of the stage version of 'Trainspotting' where he gave a tour de force performance as \"Tommy\". He also played \"Edmund the Bastard\" at the Met Theatre in Los Angeles, with James Gammon as 'King Lear'. He is the creator of the one man show, 'The Chet Baker Project', where he portrays the trumpeter/singer, and has performed this one act play in New York, Beverly Hills, and Rome.\n\nAgranov recurred as \"Yuri the Fury\" on 'Ray Donovan' for Showtime, opposite Liev Schreiber, Jack Kesy, and Raymond J. Barry. He also recurred as \"Jim Ballard\" on 'The Unit', produced by David Mamet for 20th Century Fox Television. He then went on to play \"Ferdinand\" in Tom Stoppard's 'Rock and Roll' at the Studio Theatre in Washington, D.C., a role based largely on Vaclav Havel.\n\nHe was hired for several scenes opposite Angelina Jolie in SALT, directed by Phillip Noyce, released in 2010 by Columbia Pictures.",
        "birthday": "1975-04-14",
        "deathday": null,
        "gender": 2,
        "homepage": "https://dpntalent.com/talent/david-agranov/",
        "id": 1610301,
        "imdb_id": "nm1290815",
        "known_for_department": "Acting",
        "name": "David Agranov",
        "place_of_birth": "Riga - Latvia - USSR",
        "popularity": 0.1031,
        "profile_path": "/oUeCUNHagvhXufgvIMCAWcKltHg.jpg"
    }
}