{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/744ybMaYRry1IQKoDakMc4GEU4L.jpg",
                "genre_ids": [
                    878,
                    18,
                    10749
                ],
                "id": 38,
                "original_language": "en",
                "original_title": "Eternal Sunshine of the Spotless Mind",
                "overview": "Joel Barish, heartbroken that his girlfriend underwent a procedure to erase him from her memory, decides to do the same. However, as he watches his memories of her fade away, he realises that he still loves her, and may be too late to correct his mistake.",
                "popularity": 12.565,
                "poster_path": "/5MwkWH9tYHv3mV9OdYTMR5qreIz.jpg",
                "release_date": "2004-03-19",
                "title": "Eternal Sunshine of the Spotless Mind",
                "video": false,
                "vote_average": 8.092,
                "vote_count": 15682,
                "character": "Young Bully",
                "credit_id": "52fe4211c3a36847f80016a7",
                "order": 16
            },
            {
                "adult": false,
                "backdrop_path": "/sd37prLFqNbL9ES2OTUBiEAcwIH.jpg",
                "genre_ids": [
                    18
                ],
                "id": 14359,
                "original_language": "en",
                "original_title": "Doubt",
                "overview": "In 1964 Bronx, two Catholic school nuns question the new priest's ambiguous relationship with a troubled African-American student.",
                "popularity": 3.0497,
                "poster_path": "/9lypT2ghNuUPYVJf66oe4fKvUqI.jpg",
                "release_date": "2008-12-12",
                "title": "Doubt",
                "video": false,
                "vote_average": 7.198,
                "vote_count": 1797,
                "character": "Tommy Conroy",
                "credit_id": "583fbcabc3a36862e1005410",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Paul Litowski",
            "Paulie Litowsky",
            "Paul Litowsky"
        ],
        "biography": "Paul Litowsky (born April 17, 1995), known professionally as Paulie Litt, is an American actor and producer. He is best known for his role as Justin Shanowski on the sitcom Hope & Faith.\n\nLitt was raised in Freehold Boro, New Jersey. He made his television debut on an episode of Third Watch. In 2003, he was cast in the role of Justin Shanowski, Hope's son on the ABC sitcom Hope & Faith, which he played for all three seasons. At the time, Regis Philbin, who worked with his Hope & Faith co-star Kelly Ripa, described him as a forty-year old caught in a five-year old's body. He had a recurring role in the Disney Channel series Wizards of Waverly Place.\n\nIn 2006, he was nominated for the award for the Best Performance in a TV series - Supporting Young Actor (Comedy) at the 27th Young Artist Awards for his performance on Hope & Faith, which was won by Angus T. Jones. His co-stars Megan Fox and Macey Cruthird were also nominated for the female version of the award in 2005 and 2006 respectively.\n\nHe made his film debut in the 2004 Kevin Smith comedy Jersey Girl starring Ben Affleck. In 2008, he played Spritle Racer in Speed Racer, as well as the accompanying video game. He also appeared in Doubt (2008).\n\nHe has appeared in over 26 commercials. Early in his career, he appeared in commercials for Oreos and ex-lax. He has been in Apple's \"Get a Mac\" television commercials as the 'Young PC' that starred John Hodgman and Justin Long.\n\nHe made his debut as a producer in the short film The Day I Finally Killed Myself as an Associate Producer. He made his production debut in a feature film in 2016 in The Book of Love starring Jason Sudeikis.",
        "birthday": "1995-04-17",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1611576,
        "imdb_id": "nm1445789",
        "known_for_department": "Acting",
        "name": "Paulie Litt",
        "place_of_birth": "New Jersey, USA",
        "popularity": 0.1443,
        "profile_path": "/eALQouFgLeczJabJaLdH1R4M3hl.jpg"
    }
}