{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8WIufsaJgm7VWgAc5ALWdJ8v2kB.jpg",
                "genre_ids": [
                    14,
                    27,
                    35
                ],
                "id": 766,
                "original_language": "en",
                "original_title": "Army of Darkness",
                "overview": "Ash, a handsome, shotgun-toting, chainsaw-armed department store clerk, is time warped backwards into England's Dark Ages, where he romances a beauty and faces legions of the undead.",
                "popularity": 4.8105,
                "poster_path": "/xsgTuAtR2zSH8Umg3jWZcZjlDpe.jpg",
                "release_date": "1992-10-31",
                "title": "Army of Darkness",
                "video": false,
                "vote_average": 7.255,
                "vote_count": 3336,
                "character": "Horseback Warrior (uncredited)",
                "credit_id": "5f809b9c2667780036b57c5e",
                "order": 42
            },
            {
                "adult": false,
                "backdrop_path": "/obyCUbpZvMTizOqYWHqkTFgfvnf.jpg",
                "genre_ids": [
                    10752,
                    10749,
                    36,
                    28
                ],
                "id": 676,
                "original_language": "en",
                "original_title": "Pearl Harbor",
                "overview": "The lifelong friendship between Rafe McCawley and Danny Walker is put to the ultimate test when the two ace fighter pilots become entangled in a love triangle with beautiful Naval nurse Evelyn Johnson. But the rivalry between the friends-turned-foes is immediately put on hold when they find themselves at the center of Japan's devastating attack on Pearl Harbor on Dec. 7, 1941.",
                "popularity": 8.2771,
                "poster_path": "/y8A0Cvp8WQmZ3bjbnsL53lY0dsC.jpg",
                "release_date": "2001-05-21",
                "title": "Pearl Harbor",
                "video": false,
                "vote_average": 6.941,
                "vote_count": 6745,
                "character": "Injured Marine",
                "credit_id": "6828b852218515aa699e2d1a",
                "order": 113
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Actor, J Michael Briggs was born in Houston Texas. His career in entertainment started out in music. In 1989 while attempting to further his music career in Hollywood, J Michael, on the advice of actor friend, Peer Ebbighousen, started to do background work to make extra money. While working on a TV comedy for Disney/NBC called Hull High, director Kenny Ortega (High School Musical, Newsies) befriended and put him in front of the camera for the first time. After that, everything changed. He moved to Orlando Florida to learn acting in the Theater. While there, he studied at Zoe and Company with Russ Blackwell from the prestigious Circle in The Square in New York. While learning his craft under Russ he was fortunate enough to work in class alongside, now well known actor, Tory Kittles, (Miracle at St. Anne, Sons of Anarchy, etc.). In 1998 J Michael earned a Pierrot Award for best supporting actor in the theater production of The Amorous Ambassador. In December of 1999 he made the move back to Los Angeles and has since been steadily increasing his body of work. During the early years in Los Angeles he won a few notable featured roles on The Norm Show, Buffy The Vampire Slayer, and the blockbuster film, Pearl Harbor. He won the best actor award for his portrayal of Mufasa in the LBCC production of The Circle of Life, based on the Broadway hit, The Lion King. In 2008 J Michael paired with long time friend and fellow actor, Canyon Prince to produce a risky little web-series about internet dating, called The Romantic Foibles of Esteban (http://www.idatedesteban.com/). The gamble paid off. The show was a success in the newly forming Los Angeles web series community. The critics praised J Michael's work, comparing him to the legendary Charlie Chaplin. Later the show would be honored as a trend setter in the burgeoning web series market. Today J Michael continues to book higher and higher profile roles. Recently, a series regular slot as Officer Briggs on \"Homicide Hunter, Joe Kenda\" for Discovery ID, a Co-Star role on \"Vindicated\", for the BET Network, Lead roles in La Sierva, (Subtext Features) slated for distribution in 2013, Kill Cam with director John Darko, Get Away directed by James Thomas and a supporting role in Hard Sun directed by long time friend and collaborator, Canyon Prince. Up next for J Michael is the feature length Western, The Reckoning of Scarlet Waters where he will be playing a supporting role opposite lead, Mirelly Taylor (Lost, Elf-Man) directed by Tino Luciano and a supporting role on, A Sexual Thriller, directed by Joel Colburn.",
        "birthday": "1968-07-22",
        "deathday": null,
        "gender": 2,
        "homepage": "https://resumes.actorsaccess.com/449090-1138831",
        "id": 1613293,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "J Michael Briggs",
        "place_of_birth": "Houston, Texas, USA",
        "popularity": 0.0464,
        "profile_path": null
    }
}