{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/pQQYGl6JzyUzzd6TxjkVah3H8wq.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 821881,
                "original_language": "en",
                "original_title": "The Swimmers",
                "overview": "From war-torn Syria to the 2016 Rio Olympics, two young sisters embark on a risky voyage, putting their hearts and their swimming skills to heroic use.",
                "popularity": 2.8932,
                "poster_path": "/u9MiJ6zLpDw4s3qZz93WDVwTUIo.jpg",
                "release_date": "2022-11-24",
                "title": "The Swimmers",
                "video": false,
                "vote_average": 7.438,
                "vote_count": 597,
                "character": "Nizar",
                "credit_id": "6082103dbefb090029dae077",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "احمد مالك"
        ],
        "biography": "Ahmed Malek Mostafa (born 29 September 1995) is an Egyptian actor. His first audition came at the age of eight when his uncle took him to perform in a commercial. In 2005, Malek had his first role in the TV series \"Ayamna el helwa\" (Our Good Days). A few years later, he played a small role in \"Mafish Fayda\", starring Moustafa Amar and Basma. Shortly after, executive director Osama Farid asked Malek to perform the role of young Hassan al-Banna, founder of the Muslim Brotherhood, in the TV series El-Gamaah (2010) (The Brotherhood), which is considered the then-15-year-old's first breakthrough role.\n\nAfter the 2011 Egyptian Revolution, Malek disappeared for a short time, as he decided to focus on political and revolutionary activism. When director Gamal Abdel Hameed offered him the role of a young Egyptian revolutionary activist in the TV series \"Al-shaware'a al-khafiya\" (The Backstreets) - starring famous actors Jamal Soliman, Layla Olwi, Sami El-Adl and Gihan Fadel - he could not resist.\n\nIn 2012, director Mohamed Samy offered Malek the role of Ahmed, a stammered teenage addict in his series Ma'a Sabq Alesrar (2012). With his newfound success in the role, Samy nominated Malek to play the role of a troubled teen in his new TV series Hekayet Hayah (2013) for which he won a DG award for Best Young Actor in 2013. Seeing Malek's impressive performance, renowned Egyptian director Sharif Arafah asked him to audition for a pivotal role in the much-anticipated sequel of his movie El-Gezirah (2007). The sequel, The Island 2 (2014), propelled Malek towards regional stardom in the Middle East and after which he become one of the most successful and sought-after Egyptian actors of his generation. He would later find international fame with roles in critically acclaimed films such as Clash (2016), Sheikh Jackson (2017) and Leil Khargi (2018) - all of which have been selected to represent Egypt in international film festivals and award circuits.",
        "birthday": "1995-09-29",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1614501,
        "imdb_id": "nm5972255",
        "known_for_department": "Acting",
        "name": "Ahmed Malek",
        "place_of_birth": "Cairo, Egypt",
        "popularity": 0.2234,
        "profile_path": "/7iGxBlHhjJNSQ4wilu50ptHAMWD.jpg"
    }
}