{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kODNw6GJNdgldUMEhKPlCw8wQCr.jpg",
                "genre_ids": [
                    18,
                    28
                ],
                "id": 312221,
                "original_language": "en",
                "original_title": "Creed",
                "overview": "The former World Heavyweight Champion Rocky Balboa serves as a trainer and mentor to Adonis Johnson, the son of his late friend and former rival Apollo Creed.",
                "popularity": 9.8762,
                "poster_path": "/1BfTsk5VWuw8FCocAhCyqnRbEzq.jpg",
                "release_date": "2015-11-25",
                "title": "Creed",
                "video": false,
                "vote_average": 7.407,
                "vote_count": 7691,
                "character": "Lady Cop",
                "credit_id": "588d9a83c3a36874940045d8",
                "order": 17
            },
            {
                "adult": false,
                "backdrop_path": "/9il7qNbeYnPMYlutsVYDsj4hRyb.jpg",
                "genre_ids": [
                    18,
                    28
                ],
                "id": 480530,
                "original_language": "en",
                "original_title": "Creed II",
                "overview": "Between personal obligations and training for his next big fight against an opponent with ties to his family's past, Adonis Creed is up against the challenge of his life.",
                "popularity": 9.2946,
                "poster_path": "/v3QyboWRoA4O9RbcsqH8tJMe8EB.jpg",
                "release_date": "2018-11-21",
                "title": "Creed II",
                "video": false,
                "vote_average": 7.035,
                "vote_count": 5601,
                "character": "Pharmacist",
                "credit_id": "5c06d575c3a3685c370e0e54",
                "order": 27
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Johanna Tolentino got her first big break at the age of 16 on the feature film Lean On Me with Morgan Freeman. Recently, she booked co-starring roles on the Comedy Central pilot Alternatino Orange is the New Black (Netflix), Do No Harm (NBC), and supporting roles in the short films, Taking East New York directed by Exile Ramirez and El Pasaje directed by Noel Nunez, as well as features Keep in Touch directed by Sam Kretchmar, and Sylvester Stallone's upcoming Rocky sequel, Creed directed by Ryan Coogler.\n\nShe trained at the Puerto Rican Traveling Theater in audition technique. voice and acting before booking roles in regional theaters, regional commercials and industrial films in Atlanta and Philadelphia. Theatre credits include Rosa in The Buddy Holly Story at the Walnut Street Theatre in Philadelphia, Elliot: A Soldiers Fugue, The Conduct of Life at Villanova University, Latinolougues at The Wilma Theatre and various roles on off-off Broadway shows in New York.\n\nShe is the creator, producer and star of the web series \"Whatever It Takes\". She has also booked co-starring roles on various web series, including \"Which Way\" directed by Bill Herndon.\n\n- IMDb Mini Biography By: Johanna Tolentino\n\nJohanna Tolentino got her first big break at the age of 16 on the feature film Lean On Me with Morgan Freeman. She's booked co-starring roles on network television such as (Comedy Central) pilot Alternatino Orange is the New Black (Netflix), Do No Harm , Guest star role on ( NBC), Law & Order SVU, co star role on The blacklist and GOTHAM (FOX).\n\nSupporting roles in the short films, Taking East New York directed by Exile Ramirez and El Pasaje directed by Noel Nunez, as well as features Keep in Touch directed by Sam Kretchmar, Patti Cakes directed by Jeremy Jasper and Sylvester Stallone's Rocky sequel, Creed directed by Ryan Coogler and Creed II directed by Steven Carole JR.\n\nShe trained at the Puerto Rican Traveling Theater in audition Vocal , film and theatre acting techniques before booking roles in regional theaters, regional commercials and industrial films in Atlanta and Philadelphia. Theatre credits include Rosa in The Buddy Holly Story at the Walnut Street Theatre in Philadelphia, Elliot: A Soldiers Fugue, The Conduct of Life at Villanova University, Latinolougues at The Wilma Theatre, Morir Soñando at Passage Theatre in Trenton New Jersey . Young Money as Gardenia. with Azuka Theatre company in Philly . Janet Wide Awake as principal Tolentino with Passage Theatre company .\n\nJohanna was Barrymore nominated for a best artist Award for the role of Paloma in the play Morir Soñando by Erlina Ortiz at Passage Theatre company..\n\nShe is the creator, producer, writer and star of the web series \"Whatever It Takes\"",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1614447,
        "imdb_id": "nm0865995",
        "known_for_department": "Acting",
        "name": "Johanna Tolentino",
        "place_of_birth": null,
        "popularity": 0.0423,
        "profile_path": "/7Rxygb2eYvMPiXyLL6ReWpN0QYZ.jpg"
    }
}