{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zUs2GW4rPSIsfzBp0GtXaQR2mqk.jpg",
                "genre_ids": [
                    18,
                    10402
                ],
                "id": 1808,
                "original_language": "en",
                "original_title": "Velvet Goldmine",
                "overview": "Almost a decade since larger-than-life glam-rock enigma Brian Slade disappeared from public eye, an investigative journalist is on assignment to uncover the truth behind his former idol.",
                "popularity": 2.0664,
                "poster_path": "/bsuSac0PldPFcOtR1Vioe7VBF4l.jpg",
                "release_date": "1998-08-28",
                "title": "Velvet Goldmine",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 520,
                "character": "Middle Age Man",
                "credit_id": "5f43f8ff47c9fb0037fb8559",
                "order": 40
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Roger Alborough (born 19 February 1953) is a British TV and Theatre actor appearing in many dramas on the BBC, ITV, Channel 4 and in film.  Richard trained at The Central School of Speech and Drama from 1973 to 1976  Recent work includes Black Mirror by Charlie Brooker Thieftakers 2, The 8 Days that Made Rome, Washington for The History Channel as General Braddock. Alborough has also appeared in Doctors, Silent Witness, The Queen as Sir William Heseltine, Body Story, Judge John Deed, EastEnders, The Bill, Mr Pye, Strife, Merlin of the Crystal Cave, and Unnatural Causes among others. In the BBC sitcom The Green Green Grass, Alborough played the part of Jonty in the 2005 Christmas Special episode \"One Flew Over the Cuckoo Clock\".\n\nIn 2018, Alborough played the role of The Professor in Ionesco's The Lesson at the award-winning Hope Theatre in London. He followed this with role of Tom in Goodnight Mr Tom at East Riding Theatre. In 2016, Alborough played the role of Andy Capp at the Finborough Theatre in London in a stage musical based on the long-running cartoon strip\n\nFilms include Shaka Zulu as Hawkins, I Anna, Velvet Underground.\n\nRoger has also played radical co-prime minister Peter Clement in the game Not for Broadcast.\n\nWest End includes Buddy and Jailhouse Rock. Up'n Under, Chasing Dragons at the Soho Theatre, African Snow at the Trafalgar Studios, Enjoy original cast at the Vaudeville, Annie Get Your Gun Haymarket.",
        "birthday": "1953-02-19",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.monstervoice.co.uk/voices/roger-alborough/",
        "id": 1614377,
        "imdb_id": "nm0016897",
        "known_for_department": "Acting",
        "name": "Roger Alborough",
        "place_of_birth": "Winchester, England, UK",
        "popularity": 0.0782,
        "profile_path": "/8DH9JngLgxnsP8zPuSeagPAZaIY.jpg"
    }
}