{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7aiVtavsu145yo6n4ZpazwMDLXL.jpg",
                "genre_ids": [
                    16,
                    878,
                    18,
                    10402,
                    12,
                    14
                ],
                "id": 776305,
                "original_language": "ja",
                "original_title": "竜とそばかすの姫",
                "overview": "Suzu is a 17-year-old high-school student living in a rural town with her father. Wounded by the loss of her mother at a young age, Suzu one day discovers the massive online world \"U\" and dives into this alternate reality as her avatar, Belle. Before long, all of U's eyes are fixed on Belle, when, suddenly, a mysterious, dragon-like figure appears before her.",
                "popularity": 6.1743,
                "poster_path": "/fYHOD4pxZQk4rsP2tQrZI5uBlZV.jpg",
                "release_date": "2021-07-16",
                "title": "Belle",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 801,
                "character": "Ruka Watanabe (voice)",
                "credit_id": "60949e4c60c751003b106196",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "たましろ ティナ",
            "玉城TINA"
        ],
        "biography": "Tina Tamashiro (玉城 ティナ Tamashiro Tina, born October 8, 1997) is a Japanese model and actress who is represented by the talent agency, Dine and Indy.\n\nTamashiro is born to an American father and a Japanese mother. She met the president of her office when she was walking home with her friends.\n\nIn July 2012, Tamashiro won the Kodansha sponsored Miss iD 2013 Grand Prix. The organizer said \"You find Tina Tamashio\" which is said by Kodansha editor Tsukasa Kobayashi who is also playing a producer. Tamashiro later appeared in fashion magazines and served as an exclusive model for Vivi.\n\nDescription above from the Wikipedia article Tina Tamashiro, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1997-10-08",
        "deathday": null,
        "gender": 1,
        "homepage": "http://tina-official.com/",
        "id": 1615061,
        "imdb_id": "nm6119056",
        "known_for_department": "Acting",
        "name": "Tina Tamashiro",
        "place_of_birth": "Okinawa Prefecture, Japan",
        "popularity": 0.8148,
        "profile_path": "/u2OfpoFq4ZFaWnuCuH0JSpTo6hr.jpg"
    }
}