{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5UX6M0aEphiW6Xmy5rpYX75glbo.jpg",
                "genre_ids": [
                    14,
                    27,
                    35
                ],
                "id": 927,
                "original_language": "en",
                "original_title": "Gremlins",
                "overview": "After receiving an exotic small animal as a Christmas gift, a young man inadvertently breaks three important rules concerning his new pet, which unleashes a horde of malevolently mischievous creatures on a small town.",
                "popularity": 6.4053,
                "poster_path": "/6m0F7fsXjQvUbCZrPWcJNrjvIui.jpg",
                "release_date": "1984-06-08",
                "title": "Gremlins",
                "video": false,
                "vote_average": 7.136,
                "vote_count": 6659,
                "character": "Sheila Futterman",
                "credit_id": "5a43562ec3a368591604ce5f",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Jackie Joseph (born November 7, 1934) is an American character actress, voice artist, and writer known for portraying the film characters of: Audrey Fulquard in the original The Little Shop of Horrors, Sheila Futterman in both Gremlins films, and the voice of Melody in the animated television series Josie and the Pussycats and Josie and the Pussycats in Outer Space. She was a regular on The Doris Day Show portraying Doris' friend, Jackie Parker and also famously played the love interest of Ernest T. Bass on The Andy Griffith Show.\n\nJoseph was born in Los Angeles, California. She began her entertainment career as a featured performer and singer in the Billy Barnes Revues of the 1950s and '60s, with future husband and actor Ken Berry. She was married to Berry, with whom she adopted two children, from May 29, 1960, until June 1976. Joseph has since remarried; she and husband David Lawrence reside in a quiet suburb of Los Angeles.\n\nJoseph is popular with fans of the original low-budget version of The Little Shop of Horrors. Some of her television credits include appearances on such memorable shows as The Andy Griffith Show, The Dick Van Dyke Show (two appearances), That Girl, F Troop, Gomer Pyle, U.S.M.C. (four appearances), CHiPs (in a two-part episode), Full House and Designing Women. She also appeared for a week on the game show Match Game '74.\n\nIn the early 1980s, Joseph helped form an organization for celebrity wives overcoming divorce. The group, which included Lynn Landon, Patti Palmer Lewis, and Carol Lawrence, went on talk shows (such as Phil Donahue's) discussing the foibles of celebrity split-ups. In recent years she has been heavily involved with the Screen Actors Guild as well as organizations providing care for stray animals. She has been a columnist for Toluca Lake's newspaper, \"The Tolucan Times,\" where she often ends her column with the phrase, \"We'll talk.\"\n\nSome of her good friends in Hollywood include actress Doris Day, actress and comedienne Jo Anne Worley, actor Ed Asner, announcer and voice-artist Gary Owens, and more-than-once film co-star, Dick Miller.\n\nDescription above from the Wikipedia article Jackie Joseph, licensed under CC-BY-SA, full list of contributors on Wikipedia.\n\n​",
        "birthday": "1934-11-07",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 16182,
        "imdb_id": "nm0430604",
        "known_for_department": "Acting",
        "name": "Jackie Joseph",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.626,
        "profile_path": "/2DkqtrIJs8d4GycqVyKjoPfNnsV.jpg"
    }
}