{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wDwQXLDUuiEaaiuWIDBpbqnwYGX.jpg",
                "genre_ids": [
                    18
                ],
                "id": 492188,
                "original_language": "en",
                "original_title": "Marriage Story",
                "overview": "A stage director and an actress struggle through a grueling, coast-to-coast divorce that pushes them to their personal extremes.",
                "popularity": 8.0279,
                "poster_path": "/2JRyCKaRKyJAVpsIHeLvPw5nHmw.jpg",
                "release_date": "2019-09-28",
                "title": "Marriage Story",
                "video": false,
                "vote_average": 7.732,
                "vote_count": 7159,
                "character": "Theater Actor",
                "credit_id": "5df6071765686e0013849663",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "瑪麗·懷斯曼"
        ],
        "biography": "Wiseman is the youngest daughter of Dorothy and Kevin Wiseman and has three older brothers. She grew up in Milford, Pennsylvania and Gaithersburg, Maryland, attended the DC Shakespeare Theatre’s high school outreach program, earned her BFA in Theatre Arts at Boston University, and studied between 2011 and 2015 at Juilliard School's Drama Division where one of her classmates was future Star Trek: Discovery cast member Mary Chieffo. Another classmate is actor Noah Averbach-Katz, whom she started dating in 2013. The couple married on February 16, 2019.\n\nWiseman's stage roles have included Nitzan Halperin's Sow and Weep (2008, Boston University College of Fine Arts in New York), Ariel Carson's I Wanted it to Have a How & I Wanted it to Have a Verb (2011, Dixon Place) and Betsy/Lindsay in Clybourne Park (2013, Chautauqua Theater Company).\n\nWiseman has performed in productions and workshops of new plays in Playwrights’ theatres like PS 122, The Public, Soho Rep, and New York Theatre Workshop.\n\nThis page is based on a Wikipedia article. Text is available under the CC BY-SA 4.0 license; additional terms may apply.",
        "birthday": "1985-07-30",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1621502,
        "imdb_id": "nm6384402",
        "known_for_department": "Acting",
        "name": "Mary Wiseman",
        "place_of_birth": "Milford, Pennsylvania, U.S.A.",
        "popularity": 0.3052,
        "profile_path": "/85uKEsrzJ0pWMDKKwAQtYdMbnq4.jpg"
    }
}