{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/44immBwzhDVyjn87b3x3l9mlhAD.jpg",
                "genre_ids": [
                    27,
                    80,
                    53
                ],
                "id": 934433,
                "original_language": "en",
                "original_title": "Scream VI",
                "overview": "Following the latest Ghostface killings, the four survivors leave Woodsboro behind and start a fresh chapter.",
                "popularity": 9.5984,
                "poster_path": "/wDWwtvkRRlgTiUr6TyLSMX8FCuZ.jpg",
                "release_date": "2023-03-08",
                "title": "Scream VI",
                "video": false,
                "vote_average": 6.975,
                "vote_count": 2895,
                "character": "Frat Party Girl",
                "credit_id": "640bfc01b42242008a2ca8f3",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Erika Kurata-Prevost"
        ],
        "biography": "Erika Prevost is a mixed race Japanese-Canadian actor born and raised in Montreal, Canada. From a young age Erika loved the spotlight. Finding her first form of expression through movement, she had a career in dance before being exposed to the world of Acting. Beginning with a series regular role on Disney's hit teen dance drama TV series The Next Step, Erika continued to hone her craft at The National Theatre School of Canada. Majoring in Acting in 2020, Erika has moved to Toronto to continue her career, which is where she is currently based. Erika has made her mark in the film and television industry through her roles in Sony's Party Of Five, Amazon Prime's Colors of Love; Lionsgate's Step Up All In; Starz' American Gods; Lifetime's Saying Yes To Christmas; Universal Picture's 7th installment of their hit franchise Bring It On, to name a few. Her upcoming releases include a starring role in a Tubi original picture, set to come out December 2022.\n\nErika also has extensive dance training and has a background in HipHop, Contemporary, Ballet, Jazz and Ballroom. A few of her dance credits include work on NBC's The Voice, the Just For Laughs Gala, Cirque due Soleil's NBA All Star Games and Pan Am Games Opening Ceremony, and many more.\n\nPrevost has filmed all across the country, from the west coast (Vancouver) to the east coast (Halifax) and shows no sign of slowing down. Embracing the constant changes of this industry, Erika aspires to keep sharing her love of storytelling with as many people as possible, while never trading honesty for relatability.",
        "birthday": "1995-07-15",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1622782,
        "imdb_id": "nm6671114",
        "known_for_department": "Acting",
        "name": "Erika Prevost",
        "place_of_birth": "Montreal, Quebec, Canada",
        "popularity": 0.1361,
        "profile_path": "/lJ7IM3gFPLnQwemoGeywJbTDjjv.jpg"
    }
}