{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3G1Q5xF40HkUBJXxt2DQgQzKTp5.jpg",
                "genre_ids": [
                    16,
                    35,
                    10751,
                    14
                ],
                "id": 568124,
                "original_language": "en",
                "original_title": "Encanto",
                "overview": "The tale of an extraordinary family, the Madrigals, who live hidden in the mountains of Colombia, in a magical house, in a vibrant town, in a wondrous, charmed place called an Encanto. The magic of the Encanto has blessed every child in the family—every child except one, Mirabel. But when she discovers that the magic surrounding the Encanto is in danger, Mirabel decides that she, the only ordinary Madrigal, might just be her exceptional family's last hope.",
                "popularity": 14.6612,
                "poster_path": "/4j0PNHkMr5ax3IA8tjtxcmPU3QT.jpg",
                "release_date": "2021-10-13",
                "title": "Encanto",
                "video": false,
                "vote_average": 7.584,
                "vote_count": 9865,
                "character": "Señora Guzmán (voice)",
                "credit_id": "61adac8ac072a20087ecf370",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Rose Portillo is an accomplished American actress/writer/director/educator and visual artist whose stage and film career began with a lead role in Luis Valdez's 'Zoot Suit' (original L.A. and Broadway productions and the film). She played the role of Mother in the critically acclaimed 2017 revival, starring Demián Bichir. She was Associate Director of About Productions, now celebrating 24 years of creating original Theaterworks and founded the company's Young Theaterworks, which serves students in Continuation/Options High Schools primarily in East Los Angeles. Since appearing in Theresa Chavez's solo play, L.A. Real, she has directly partnered with Chavez (the company's Artistic Director) on at least 10 critically acclaimed productions.",
        "birthday": "1953-11-07",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 162381,
        "imdb_id": "nm0692419",
        "known_for_department": "Acting",
        "name": "Rose Portillo",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.3475,
        "profile_path": "/aZBwQ2EJWrS8NhHfQTiU0GqIGuy.jpg"
    }
}