{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7nFfW8RM50PANBIdfI9Ut3FdoSB.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749
                ],
                "id": 310593,
                "original_language": "it",
                "original_title": "Youth",
                "overview": "Two lifelong friends bond whilst vacationing in a luxury Swiss Alps lodge as they ponder retirement. While Fred has no plans to resume his musical career despite the urging of his loving daughter Lena, Mick is intent on finishing the screenplay for what may be his last important film for his muse Brenda. And where will inspiration lead their younger friend Jimmy, an actor grasping to make sense of his next performance?",
                "popularity": 3.0163,
                "poster_path": "/ceRN51oeadmccAvqvDxpnnNRcLU.jpg",
                "release_date": "2015-05-20",
                "title": "Youth",
                "video": false,
                "vote_average": 6.898,
                "vote_count": 2130,
                "character": "Sumi Jo",
                "credit_id": "57494498c3a3683385001f0e",
                "order": 69
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "조수미",
            "Jo Su-mi",
            "Cho Sumi"
        ],
        "biography": "Sumi Jo, OSI (조수미; born 22 November 1962) is a South Korean lyric coloratura soprano known for her Grammy award-winning interpretations of the bel canto repertoire.\n\nJo was born Jo Su-gyeong [tɕo sʰuɡjʌŋ] in Changwon, South Korea. Her mother was an amateur singer and pianist who had been unable to pursue her own professional music studies because of politics in Korea during the 1950s. Determined to provide her daughter with opportunities she never had, Jo's mother enrolled her in piano lessons at the age of 4 and later voice lessons at the age of 6. Although Jo's family lived in a rented property, her parents bought a piano for her to play. Her mother raised and trained Jo strictly. Jo recalled even when her mother went out, she locked the door outside so that Jo could not play truant. As a child, Jo would often spend up to eight hours a day studying music.\n\nIn 1976, Jo entered the Sun Hwa Arts School from which she graduated in 1980, receiving dual diplomas in voice and piano. She entered the department of vocal music at the Seoul National University (SNU) with the best practical score since the department had opened. There she continued her music studies from 1981 to 1983. While studying at SNU, Jo made her professional recital debut, appeared in several concerts with the Korean Broadcasting System, and made her professional operatic debut as Susanna in The Marriage of Figaro with Seoul Opera.\n\nIn 1983, Jo left SNU in order to study at the Conservatorio Santa Cecilia in Rome. Among her teachers were Carlo Bergonzi and Giannella Borelli. While Jo studied in Italy, she was frequently heard in concert in Italian cities and on national radio broadcasts and telecasts. It was during this time when Jo began to use \"Sumi\" as her stage name in order to make her name more friendly to European language speakers who often found it difficult to pronounce Su-gyeong. She graduated in 1985 with majors in keyboard and voice.\n\nFollowing graduation, Jo began to study with Elisabeth Schwarzkopf and won several international competitions in Seoul, Naples, Enna, Barcelona, and Pretoria. In August 1986, she was unanimously awarded first prize in the Carlo Alberto Cappelli International Competition in Verona, one of the world's most important contests, open only to first-prize winners of other major competitions.\n\nIn 1986, Jo made her European operatic debut as Gilda in Verdi's Rigoletto at the Teatro Comunale Giuseppe Verdi in Trieste. This performance drew the attention of Herbert von Karajan, who proceeded to cast her as Oscar in Un ballo in maschera opposite Plácido Domingo for the 1989 Salzburg Festival. Karajan's death during festival rehearsals prevented Jo from actually singing on stage under his baton (Georg Solti conducted the performances) but she did sing under Karajan in the studio recording of Ballo, made in the early months of 1989 for Deutsche Grammophon.\n\nIn 1988, Jo made her La Scala debut as Thetis in Niccolò Jommelli's Fetonte. That same year she made her debut with the Bavarian State Opera and sang Barbarina in The Marriage of Figaro at the Salzburg Festival. ...\n\nSource: Article \"Sumi Jo\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1962-11-22",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.josumi.com",
        "id": 1627270,
        "imdb_id": "nm0423279",
        "known_for_department": "Acting",
        "name": "Sumi Jo",
        "place_of_birth": "Changwon, South Gyeongsang, South Korea",
        "popularity": 0.1216,
        "profile_path": "/lUE8TDd7PnaL2Qf9UaHlfwM8X2H.jpg"
    }
}