{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/iuRVt8tFiXDPGgzavhuSa3QHRxD.jpg",
                "genre_ids": [
                    35
                ],
                "id": 18785,
                "original_language": "en",
                "original_title": "The Hangover",
                "overview": "When three friends finally come to after a raucous night of bachelor-party revelry, they find a baby in the closet and a tiger in the bathroom. But they can't seem to locate their best friend, Doug – who's supposed to be tying the knot. Launching a frantic search for Doug, the trio perseveres through a nasty hangover to try to make it to the church on time.",
                "popularity": 20.2069,
                "poster_path": "/A0uS9rHR56FeBtpjVki16M5xxSW.jpg",
                "release_date": "2009-06-02",
                "title": "The Hangover",
                "video": false,
                "vote_average": 7.327,
                "vote_count": 17494,
                "character": "Police Clerk",
                "credit_id": "52fe479a9251416c7509f6cd",
                "order": 28
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "James Martin Kelly "
        ],
        "biography": "James Martin Kelly is an American character actor, born on September 6th, in Brooklyn New York to James Francis and Joan Marie Kelly. Jim married Mary-Ellen on Oct 8, 1978. In 1988 Jim and Mary-Ellen moved to Florida to raise their four children. At Mary-Ellen's urging, Jim auditioned for a play, changing his life. Plays led to a few commercial and TV gigs but he knew this was a craft that should be taken seriously. While studying the Eric Morris technique in Tampa Florida, his teacher, Kathy Laughlin urged him to move to Los Angeles, saying \"There's no market here for the kind of work you do\". For decades since, Jim has been opposite some of the biggest artists in motion pictures and on television, working together to tell the writer's story. Best known for his powerful turn as 'Rob Farrior' in 'Jack Reacher' with Tom Cruise, James continues to deliver consistent, solid, moving performances.",
        "birthday": "1954-09-05",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 162849,
        "imdb_id": "nm0446457",
        "known_for_department": "Acting",
        "name": "James Martin Kelly",
        "place_of_birth": "Brooklyn, New York City, New York, USA",
        "popularity": 0.1744,
        "profile_path": "/tEzKhyEa5SO3bUyvwV9yO521kKj.jpg"
    }
}