{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rfkIeCaIHhN3K5wjJJqKmfUjYp8.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 381284,
                "original_language": "en",
                "original_title": "Hidden Figures",
                "overview": "The untold story of Katherine G. Johnson, Dorothy Vaughan and Mary Jackson – brilliant African-American women working at NASA and serving as the brains behind one of the greatest operations in history – the launch of astronaut John Glenn into orbit. The visionary trio crossed all gender and race lines to inspire generations to dream big.",
                "popularity": 12.5756,
                "poster_path": "/9lfz2W2uGjyow3am00rsPJ8iOyq.jpg",
                "release_date": "2016-12-10",
                "title": "Hidden Figures",
                "video": false,
                "vote_average": 8.052,
                "vote_count": 10083,
                "character": "TV Reporter at Cape Canaveral",
                "credit_id": "59bf043292514146fa007948",
                "order": 42
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Paul Ryden is an actor and writer, known for Hidden Figures (2016), Stranger Things (2016), and Halt and Catch Fire (2014).\n\nWith a background in feature news reporting (Green Bay, WI; Louisville, KY: Turner Broadcasting, Atlanta), it's only natural that Paul is often cast as a news anchor or reporter, but he's played a variety of roles from doctor to judge to parole officer to corporate executive. His theatre work the last few years includes the lead roles of William Gillett in The Game's Afoot and Matt Drayton in Guess Who's Coming to Dinner.\n\nPaul has traveled extensively, producing fund-raising videos for mission agencies and NGO's in such far-flung locales as Afghanistan, Rwanda, Ukraine, Indonesia, and points beyond.",
        "birthday": "1953-02-12",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.paulryden.com/",
        "id": 1628085,
        "imdb_id": "nm0753077",
        "known_for_department": "Acting",
        "name": "Paul Ryden",
        "place_of_birth": "Atlanta, Georgia, U.S.",
        "popularity": 0.0979,
        "profile_path": "/dI7ert82EOqFZsODQpACe8zVXxg.jpg"
    }
}