{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/g5haoqEqt5VwVwQKEkoXY9zqSxb.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 232672,
                "original_language": "en",
                "original_title": "Blended",
                "overview": "Recently divorced mom Lauren and widowed dad Jim let their friends push them into a blind date, which goes disastrously wrong. Unsurprisingly, neither wants to see the other ever again. However, fate intervenes when both Jim and Lauren, unbeknownst to each other, purchase one-half of the same vacation package at a South African resort for families, during spring break. They and their children are forced to share the same romantic suite and participate in a slew of family activities together.",
                "popularity": 9.236,
                "poster_path": "/o2YrH9jS7CAfWjETHFeL0tth79E.jpg",
                "release_date": "2014-05-21",
                "title": "Blended",
                "video": false,
                "vote_average": 6.891,
                "vote_count": 3668,
                "character": "Baseball Dad",
                "credit_id": "644cd7bc53f83305021929b1",
                "order": 48
            },
            {
                "adult": false,
                "backdrop_path": "/k3PqsPLkKLDyjZupZ6gqZHPxMv3.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 54138,
                "original_language": "en",
                "original_title": "Star Trek Into Darkness",
                "overview": "When the crew of the Enterprise is called back home, they find an unstoppable force of terror from within their own organization has detonated the fleet and everything it stands for, leaving our world in a state of crisis.  With a personal score to settle, Captain Kirk leads a manhunt to a war-zone world to capture a one man weapon of mass destruction. As our heroes are propelled into an epic chess game of life and death, love will be challenged, friendships will be torn apart, and sacrifices must be made for the only family Kirk has left: his crew.",
                "popularity": 5.4208,
                "poster_path": "/7XrRkhMa9lQ71RszzSyVrJVvhyS.jpg",
                "release_date": "2013-05-05",
                "title": "Star Trek Into Darkness",
                "video": false,
                "vote_average": 7.32,
                "vote_count": 9342,
                "character": "U.S.S. Vengeance Ensign",
                "credit_id": "54692254eaeb816b4b001866",
                "order": 38
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Robert Moran"
        ],
        "biography": "Rob Moran, is an American actor. He is known for appearing in many of the Farrelly brothers films such as Dumb and Dumber, There's Something About Mary, Me, Myself, & Irene, Kingpin, and Hall Pass. He starred in the American teen drama South Of Nowhere as the Carlin family patriarch. In 1996, he played \"Stanley Osmanski\" in Kingpin. He made guest appearances in such television series as Men of a Certain Age and Cold Case. He also played Ed Long in Hall Pass. He appeared most recently as the doomed patriarch in the 2011 horror movie You're Next.\n\nFrom Wikipedia, the free encyclopedia",
        "birthday": "1963-05-12",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 162924,
        "imdb_id": "nm0602813",
        "known_for_department": "Acting",
        "name": "Rob Moran",
        "place_of_birth": "Boston, Massachusetts, USA",
        "popularity": 0.484,
        "profile_path": "/lwGI1FIdRpwvKnZlD3dKhntP4i4.jpg"
    }
}