{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dSD9aSZtgFthuMQ78GD1QOQf54V.jpg",
                "genre_ids": [
                    878,
                    16,
                    28,
                    18,
                    14
                ],
                "id": 487670,
                "original_language": "en",
                "original_title": "The Death of Superman",
                "overview": "When a hulking monster arrives on Earth and begins a mindless rampage, the Justice League is quickly called in to stop it. But it soon becomes apparent that only Superman can stand against the monstrosity.",
                "popularity": 3.513,
                "poster_path": "/y0uxSHaSFmt6XaBJgjkeLqe7aM.jpg",
                "release_date": "2018-07-24",
                "title": "The Death of Superman",
                "video": false,
                "vote_average": 7.386,
                "vote_count": 794,
                "character": "Dan Turpin (voice)",
                "credit_id": "5b2982bf0e0a263e7a000110",
                "order": 20
            },
            {
                "adult": false,
                "backdrop_path": "/2Fk3AB8E9dYIBc2ywJkxk8BTyhc.jpg",
                "genre_ids": [
                    878,
                    53,
                    28
                ],
                "id": 524047,
                "original_language": "en",
                "original_title": "Greenland",
                "overview": "John Garrity, his estranged wife and their young son embark on a perilous journey to find sanctuary as a planet-killing comet hurtles toward Earth. Amid terrifying accounts of cities getting levelled, the Garritys experience the best and worst in humanity. As the countdown to the global apocalypse approaches zero, their incredible trek culminates in a desperate and last-minute flight to a possible safe haven.",
                "popularity": 10.1832,
                "poster_path": "/bNo2mcvSwIvnx8K6y1euAc1TLVq.jpg",
                "release_date": "2020-07-29",
                "title": "Greenland",
                "video": false,
                "vote_average": 7.126,
                "vote_count": 4773,
                "character": "News Anchor",
                "credit_id": "5ef4dd63bccf1e0038390393",
                "order": 22
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Rick Pasqualone (born March 30, 1966, in Albertson, New York) is an American actor known for his work in stage, film, television, and voice acting. He began his career in 1990 with a role in the Off-Broadway hit \"Tony N' Tina's Wedding\" and later made his Broadway debut in the Neil Simon comedy \"Proposals.\" Rick has a versatile career, notable for providing voices in many video games and animated projects.\n\nSome of his most recognized voice roles include Vito Scaletta in the Mafia video game series, Doctor Strange in Ultimate Marvel vs. Capcom 3 and Midnight Suns, Aldo Trapani in The Godfather II, and various characters in games like Halo 5: Guardians, Batman: Arkham Knight, and Grand Theft Auto V. He also performs in television series such as NCIS: Los Angeles and Tulsa King.\n\nOutside of screen and voice acting, Pasqualone co-created and stars in \"Channeling The King,\" a touring one-man show featuring the music of Elvis Presley. He studied acting and improv after attending Boston College and has worked in both New York and Los Angeles throughout his career. He is married to Denise Fennell.",
        "birthday": "1966-03-30",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.rickpasqualone.com",
        "id": 1631561,
        "imdb_id": "nm0664710",
        "known_for_department": "Acting",
        "name": "Rick Pasqualone",
        "place_of_birth": "Albertson, New York, USA",
        "popularity": 0.1945,
        "profile_path": "/sfeELkPfoVeRH8AYF6UJBxYfFxL.jpg"
    }
}