{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2QGuTuyxwCCER9iwSeONW8BAxce.jpg",
                "genre_ids": [
                    18
                ],
                "id": 4497,
                "original_language": "es",
                "original_title": "Viridiana",
                "overview": "Viridiana is preparing to start her life as a nun when she is sent, somewhat unwillingly, to visit her aging uncle, Don Jaime. He supports her; but the two have met only once. Jaime thinks Viridiana resembles his dead wife. Viridiana has secretly despised this man all her life and finds her worst fears proven when Jaime grows determined to seduce his pure niece. Viridiana becomes undone as her uncle upends the plans she had made to join the convent.",
                "popularity": 2.3871,
                "poster_path": "/mYPuSx5JwL8AdTwS1iQW4Un1cYP.jpg",
                "release_date": "1962-04-01",
                "title": "Viridiana",
                "video": false,
                "vote_average": 7.643,
                "vote_count": 529,
                "character": "Don Amalio",
                "credit_id": "52fe43c6c3a36847f806ebb7",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/rTJRWO9zHcB29JecTXHg0wUa4Xs.jpg",
                "genre_ids": [
                    37
                ],
                "id": 391,
                "original_language": "it",
                "original_title": "Per un pugno di dollari",
                "overview": "The Man With No Name enters the Mexican village of San Miguel in the midst of a power struggle among the three Rojo brothers and sheriff John Baxter. When a regiment of Mexican soldiers bearing gold intended to pay for new weapons is waylaid by the Rojo brothers, the stranger inserts himself into the middle of the long-simmering battle, selling false information to both sides for his own benefit.",
                "popularity": 5.9032,
                "poster_path": "/lBwOEpwVeUAmrmglcstnaGcJq3Y.jpg",
                "release_date": "1964-09-12",
                "title": "A Fistful of Dollars",
                "video": false,
                "vote_average": 7.829,
                "vote_count": 4483,
                "character": "Silvanito",
                "credit_id": "5d01b09b0e0a263f96cedd3b",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Pepe Calvo",
            "José Selgado Calvo"
        ],
        "biography": "José Calvo (March 3, 1916 – May 16, 1980) was a Spanish film actor best known for his roles in western films or historical dramas.\n\nHe made around 150 appearances mostly in films between 1952 and his death in 1980. He entered film in 1952 and was prolific as an actor throughout the 1950s and 1960s. He made many appearances in crime dramas, often with a historical theme and appeared in a high number of western films.\n\nIn 1964 he starred as the innkeeper Silvanito in Sergio Leone's Spaghetti Western production A Fistful of Dollars as one of Clint Eastwood's few \"amigos\" in the town of San Miguel. He later appeared in westerns such as I Giorni dell'ira (1967) opposite Lee Van Cleef, Anda muchacho, spara! (1971) and Dust in the Sun (1973) etc.\n\nHowever, after the Spaghetti western era of the late 1960s, in the 1970s he returned to appearing in primarily Spanish films and in contrast to the roles which dominated much of his career did appear in several Spanish comedy films often with slapstick humor as that genre grew popular in Latin cinema during this period.\n\nHe died in Gran Canaria on May 16, 1980 aged 64.\n\nDescription above from the Wikipedia article José Calvo, licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": "1916-03-03",
        "deathday": "1980-05-16",
        "gender": 2,
        "homepage": null,
        "id": 16311,
        "imdb_id": "nm0130952",
        "known_for_department": "Acting",
        "name": "José Calvo",
        "place_of_birth": "Madrid, Madrid, Spain",
        "popularity": 0.3115,
        "profile_path": "/qsz2KKV8JYUWIo6qpU7ExnYkXWd.jpg"
    }
}