{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/42mSR48e4h6Zp5BkTUyWPYsAA1X.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 1883,
                "original_language": "en",
                "original_title": "Malcolm X",
                "overview": "A tribute to the controversial black activist and leader of the struggle for black liberation. He hit bottom during his imprisonment in the '50s, he became a Black Muslim and then a leader in the Nation of Islam. His assassination in 1965 left a legacy of self-determination and racial pride.",
                "popularity": 7.2691,
                "poster_path": "/o2s9ow0uRRm1BcF3teznk5twd90.jpg",
                "release_date": "1992-11-18",
                "title": "Malcolm X",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 1773,
                "character": "Roseland Dancer",
                "credit_id": "62f72d76c99826009a522b87",
                "order": 280
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Keith’s writing and recording collaborations span a wide variety of artists & writers including Whitney Houston, Heather Headley, Jessica Simpson, Luther Vandross, Amy Grant, Bebe & Cece Winans, 98°, Vanessa Williams, Brian McKnight, Mandy Moore, Claude Kelly, Liz Rose, Marcus Hummon, Amy Foster, Chris Mann, Danny Gokey and many others. His career has garnered over 40 #1 singles, in multiple genres such as Pop, CCM, Gospel, R&B, AC, generating album sales in excess of 30 million.\n\nKeith is also a founding member of farfurther.com – the forthcoming .music initiative.\n\nAwards:\n\n2011 Grammy for Best Gospel Performance: Bebe & Cece Winans, Grace\n\n2011 Grammy for Best Contemporary R&B Gospel Album: Bebe & Cece Winans, Still\n\n2010 Dove Award nomination: Female Vocalist Of The Year: Heather Headley, Audience of One\n\n2010 Grammy for Best Contemporary R&B Gospel Album: Heather Headley, Audience of One\n\n2009 Grammy for Best Traditional Gospel Album: Various Artists, Oh Happy Day\n\n2005 Grammy Award for Best Contemporary Soul Gospel Album: Cece Winans, Purified\n\n2001 Grammy Award for Best Traditional R&B Vocal Album: Gladys Knight, At Last\n\n1998 Grammy Award nomination for Producer Of The Year\n\n1995 Produced the Academy Award winning song Colors of the Wind from the motion picture Pocahontas\n\n1994 Produced Grammy Award nominated song, Whatever You Imagine, Wendy Moten, The Pagemaster\n\n1992 Grammy Award nomination, Vanessa Williams, Record Of The Year, Save The Best For Last\n\n1992 Grammy Award nomination, Save The Best For Last, Song Of The Year\n\n1991 Grammy Award nomination for Producer Of The Year\n\n1991 Grammy Award nomination, Amy Grant, Album Of The Year, Heart In Motion\n\n1991 Grammy Award nomination, Amy Grant, Record Of The Year, Baby Baby\n\n1991 Grammy Award nomination, Amy Grant, Song Of The Year, Baby Baby\n\n1991 Grammy Award nominations for Bebe & Cece Winans, Different Lifestyles\n\n1991 Three Doves Awards, two for Bebe & Cece Winans and one for The Imperials\n\n1987 Grammy Award nomination, Bebe Winans, Best Soul Gospel Vocal (Male), It’s Only Natural",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "http://keiththomas.com/",
        "id": 1632343,
        "imdb_id": "nm0859097",
        "known_for_department": "Production",
        "name": "Keith Thomas",
        "place_of_birth": null,
        "popularity": 0.051,
        "profile_path": "/a0epSsFsx3lECikbe2vOO5HUGtv.jpg"
    }
}