{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/y2DB71C4nyIdMrANijz8mzvQtk6.jpg",
                "genre_ids": [
                    28,
                    80,
                    18,
                    53
                ],
                "id": 49026,
                "original_language": "en",
                "original_title": "The Dark Knight Rises",
                "overview": "Following the death of District Attorney Harvey Dent, Batman assumes responsibility for Dent's crimes to protect the late attorney's reputation and is subsequently hunted by the Gotham City Police Department. Eight years later, Batman encounters the mysterious Selina Kyle and the villainous Bane, a new terrorist leader who overwhelms Gotham's finest. The Dark Knight resurfaces to protect a city that has branded him an enemy.",
                "popularity": 18.3339,
                "poster_path": "/hr0L2aueqlP2BYUblTTjmtn0hw4.jpg",
                "release_date": "2012-07-17",
                "title": "The Dark Knight Rises",
                "video": false,
                "vote_average": 7.787,
                "vote_count": 23539,
                "character": "Court Room Thug (uncredited)",
                "credit_id": "575af48cc3a368540300009a",
                "order": 157
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Raised in Baltimore, Maryland, award winning film maker London May began his acting career early in Baltimore's renowned Children's Theater Association. After a long break to pursue a burgeoning and successful music career, London returned to acting in 2010, studying comedy improv at The iO West and classic theater with Uranium Madhouse, where he made his Los Angeles stage debut in \"The Duchess Of Malfi.\" He was also cast in Christopher Nolan's \"The Dark Knight Rises,\" co-starred in the pilot episode of Ron Howard's \"The Great Escape\", and \"Cold Sweat\", a short directed by James Cameron's DP Paul Babin. Since then London has been busy with roles on The Disney Channel, Discovery Channel, Oxygen Channel, TNT, as well as leading roles in numerous films and stage productions (most notably in \"Saw\" director Darren L. Bousman's acclaimed \"The Tension Experience.\") London is also a sought after music video actor and he has been seen over 50 million times in various videos from Hilary Duff, Aimee Mann, American Football, Strung Out, et al. In 2019 May produced and starred in the sensational Black Metal horror comedy short \"Brutal Realty, Inc.\" which garnered rave reviews and won 8 international film festival awards.\n\nBesides acting on screen and stage, London May is also a highly regarded musician, best known as drummer and bassist with legendary singer Glenn Danzig's seminal goth punk group Samhain. During his long and continuing music career London's playing has been featured on over 30 releases and he has performed with such popular artists as Tiger Army, Son Of Sam (with Davey Havok of AFI), Lol Tolhurst (of The Cure), Lee Ving (of FEAR), Pat Smear (Nirvana, Foo Fighters), Exene Cervenka (of X), Dag Nasty, Cold Cave, acclaimed artist Doug Aiken, Boredoms, Reptile House, Jackass star Chris Pontius, Rikk Agnew (Christian Death), and Distorted Pony. In 2016 Cleopatra Records released \"Devilution: The Early Years,\" a deluxe retrospective CD/LP of London's earliest recordings and in 2017 he joined the legendary Black Metal group, Ritual. In 2020 London began drumming for Industrial legends MINISTRY.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1633514,
        "imdb_id": "nm1580576",
        "known_for_department": "Acting",
        "name": "London May",
        "place_of_birth": null,
        "popularity": 0.0904,
        "profile_path": "/wCNnokfx6pGEyiWeMBXZoL7pGdt.jpg"
    }
}