{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sBB39VMtByFltGGGW2c5N6LOAvj.jpg",
                "genre_ids": [
                    18,
                    53,
                    80
                ],
                "id": 8470,
                "original_language": "en",
                "original_title": "John Q",
                "overview": "John Quincy Archibald is a father and husband whose son is diagnosed with an enlarged heart and then finds out he cannot receive a transplant because HMO insurance will not cover it. Therefore, he decides to take a hospital full of patients hostage until the hospital puts his son's name on the donor's list.",
                "popularity": 3.8997,
                "poster_path": "/xEE91LvXiqgs7Hmdl44LCzHtFf6.jpg",
                "release_date": "2002-02-15",
                "title": "John Q",
                "video": false,
                "vote_average": 7.136,
                "vote_count": 2486,
                "character": "Arianna Huffington",
                "credit_id": "60976462cf4b8b003ea34665",
                "order": 55
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ariádni-Ánna Stasinopoúlou"
        ],
        "biography": "Arianna Huffington (born Arianna Stasinopoulos (Greek: Αριάννα Στασινόπουλος)) is a Greek American author and syndicated columnist. She is best known as co-founder of the news website The Huffington Post. A popular conservative commentator in the mid-1990s, she adopted more liberal political beliefs in the late 1990s. She is the ex-wife of former Republican congressman Michael Huffington.\n\nIn 2003, she ran as an independent candidate for Governor in the California recall election.\n\nIn 2009, Huffington was named as number 12 in Forbes' first-ever list of the Most Influential Women In Media. She has also moved up to number 42 in The Guardian's Top 100 in Media List.\n\nOn February 7, 2011, AOL announced it would acquire The Huffington Post for US$315 million and make Huffington president and editor-in-chief of The Huffington Post Media Group, which will include The Huffington Post and existing AOL properties such as Engadget, AOL Music, Patch Media, and StyleList.",
        "birthday": "1950-07-15",
        "deathday": null,
        "gender": 1,
        "homepage": "http://ariannahuffington.com",
        "id": 163555,
        "imdb_id": "nm0400251",
        "known_for_department": "Acting",
        "name": "Arianna Huffington",
        "place_of_birth": "Athens, Greece",
        "popularity": 0.1832,
        "profile_path": "/KR8nX8nnFJrudDh4iFp2QOSsZK.jpg"
    }
}