{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rn3E4Kd7EUOGOF95Hsd0aOhQqZg.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 30890,
                "original_language": "en",
                "original_title": "Radio Days",
                "overview": "The Narrator tells us how the radio influenced his childhood in the days before TV. In the New York City of the late 1930s to the New Year's Eve 1944, this coming-of-age tale mixes the narrator's experiences with contemporary anecdotes and urban legends of the radio stars.",
                "popularity": 3.837,
                "poster_path": "/ljZ3yyYznAiq1vF6nHITdJn6qXB.jpg",
                "release_date": "1987-01-30",
                "title": "Radio Days",
                "video": false,
                "vote_average": 7.047,
                "vote_count": 603,
                "character": "Communist Neighbor",
                "credit_id": "52fe44489251416c9100b369",
                "order": 45
            },
            {
                "adult": false,
                "backdrop_path": "/gRifpXd3ailxdFPBZ8F1xiBQJUL.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 19265,
                "original_language": "en",
                "original_title": "Whatever Works",
                "overview": "Whatever Works explores the relationship between a crotchety misanthrope, Boris and a naïve, impressionable young runaway from the south, Melody. When Melody's uptight parents arrive in New York to rescue her, they are quickly drawn into wildly unexpected romantic entanglements. Everyone discovers that finding love is just a combination of lucky chance and appreciating the value of \"whatever works.\"",
                "popularity": 1.7939,
                "poster_path": "/upIYOZbiutCBnvejGYaZlJxxKcs.jpg",
                "release_date": "2009-06-19",
                "title": "Whatever Works",
                "video": false,
                "vote_average": 7.082,
                "vote_count": 1785,
                "character": "Boris Yellnikoff",
                "credit_id": "52fe47ca9251416c750a596b",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Lawrence Gene David "
        ],
        "biography": "Larry David (born July 2, 1947) is an American producer, writer, and actor. David attended the University of Maryland and started doing stand-up comedy in New York night clubs in 1974. In 1979, he was hired to write and perform for the comedy variety show Fridays, which was modelled after Saturday Night Live. He stayed with the show until 1982 when he was hired as a writer for Saturday Night Live, where he worked for a year.\n\nIn 1989, David received a call from fellow New York comedian Jerry Seinfeld who was working with NBC to develop a comedy pilot. Together, they developed the legendary \"show about nothing\" starring Seinfeld, Julia Louis-Dreyfus, Michael Richards and Jason Alexander. Though not initially successful, Seinfeld would become one of the most successful and influential shows in television history. With a talented cast and daring story lines, the show won legions of loyal fans. According to David, the character of George Costanza was modelled after himself, a cheap, neurotic and ultimately selfish bald man.\n\nDavid wrote and produced Seinfeld until 1996, when he left the show to pursue feature screenwriting. He returned for the season finale in 1998 and made frequent guest appearances throughout the show's run. David also acted in bit roles in Woody Allen's Radio Days (1987) and New York Stories (1989). In 1998, David wrote and directed the feature film Sour Grapes, an irreverent look at the pitfalls of wealth and greed.\n\nThe following year, David proved his Midas touch once again when he created the hugely successful semi-scripted series Curb Your Enthusiasm for HBO. Originally airing as a special, the show featured David playing himself as a nervous stand-up comic returning to do a television special after a long absence from the stage. The popularity of the special resulted in a weekly HBO series. Partially improvised, the show proved to be another groundbreaking television experiment winning a Golden Globe in 2003 for Best Comedy Series.\n\nDavid married Laurie Lennard in 1993. The couple has two daughters.",
        "birthday": "1947-07-02",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 16376,
        "imdb_id": "nm0202970",
        "known_for_department": "Writing",
        "name": "Larry David",
        "place_of_birth": "Brooklyn, New York City, New York, USA",
        "popularity": 0.4129,
        "profile_path": "/ojPx93eaDcanOVi4AH14uAFwXhn.jpg"
    }
}