{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/x3mFfOKOzIi1ROSgy9bgyYq7zDH.jpg",
                "genre_ids": [
                    18
                ],
                "id": 342737,
                "original_language": "en",
                "original_title": "20th Century Women",
                "overview": "In 1979 Santa Barbara, California, Dorothea Fields is a determined single mother in her mid-50s who is raising her adolescent son, Jamie, at a moment brimming with cultural change and rebellion. Dorothea enlists the help of two younger women – Abbie, a free-spirited punk artist living as a boarder in the Fields' home and Julie, a savvy and provocative teenage neighbour – to help with Jamie's upbringing.",
                "popularity": 2.1458,
                "poster_path": "/mso2rEr9i0MilRIOao5HaWFipS9.jpg",
                "release_date": "2016-12-28",
                "title": "20th Century Women",
                "video": false,
                "vote_average": 7.325,
                "vote_count": 1186,
                "character": "Carpenter #3 (uncredited)",
                "credit_id": "688a4cf5346589dc8d84c05d",
                "order": 69
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "A skilled character and period actor, Jacob Peacock’s distinct 6’4” physic and extensive acting and stunt training have earned him roles in national commercials and theatrical projects from stage to screen.\n\nHis transformational period acting skills and stunt work are featured in the Arcade Fire video for “We Exist” where he fights with Andrew Garfield, and in the films “David and Goliath,” “The Legend of Bull,” and “What’s Eating Todd.” He can be seen in the upcoming feature film “20th Century Women” opposite Annette Benning and Billy Crudup, and in “The Bad Batch” directed by Ana Lily Amirpour and starring Jason Momoa, Keanu Reeves and Jim Carrey.\n\nJacob was showcased in a multi-page feature for Maxim magazine (August 2015) for the unique paleo workout he co-developed, which launched the Real Viking Brothers channel on YouTube, a reoccurring series in the magazine, and plans in development for a short film and comic.  He is currently studying at The Stephen Book Acting Workshop with Stephen Book and has also studied improvisation at Turbine Arts Collective under Robert Watzke, stunts and swordplay at The Academy of Theatrical combat under Jan Bryant and Dan Speaker, and is currently studying at Swordplay LA under Tim Weske. Skills include basketball, swordplay, theater combat, Weapons, Sailing, Most Sports, ETC.\n\nA California native, Jacob was raised in wine country where he started his stage training in community theater at age five. He resides in Santa Monica can be frequently seen practicing his The Real Viking Brothers workouts on the beaches and wilderness areas of Los Angeles.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://officialjacobpeacock.com/",
        "id": 1639443,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Jacob Peacock",
        "place_of_birth": "Santa Monica, California, U.S.",
        "popularity": 0.0479,
        "profile_path": "/z4umA1lBvDOpndb0lCZ8aSZ1FnH.jpg"
    }
}