{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bhspYsRMHgMqzUlxiVpIY8OrqMt.jpg",
                "genre_ids": [
                    16,
                    12,
                    10751
                ],
                "id": 313297,
                "original_language": "en",
                "original_title": "Kubo and the Two Strings",
                "overview": "Kubo mesmerizes the people in his village with his magical gift for spinning wild tales with origami. When he accidentally summons an evil spirit seeking vengeance, Kubo is forced to go on a quest to solve the mystery of his fallen samurai father and his mystical weaponry, as well as discover his own magical powers.",
                "popularity": 4.5553,
                "poster_path": "/la6QA9tk4Foq8OBH2Dyh5dTcw6H.jpg",
                "release_date": "2016-08-18",
                "title": "Kubo and the Two Strings",
                "video": false,
                "vote_average": 7.633,
                "vote_count": 3679,
                "character": "Villager (voice)",
                "credit_id": "5bc11efac3a3682d60023b6e",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Zachary Alexander Rice was born in Irvine, California to famed Artist McKenzie and Rocket Scientist, Steven Rice. Zach has been acting since he was a young child; At three he was memorizing monologues from movies and complete comedy routines to perform for family and friends. It was obvious to everyone that Zach had a passion for performing. Zach has been constantly working in Film, Television, Voice, and Commercials. He has more than 50+ acting credits, 2 Director credits, 1 Writing credits, his own show and a comedy Stand Up special on the way. He has surpassed one million followers 1,000,000+ across social media platforms with his own brand of humor online as ZachRiceTV. He also performs successful comedy rap under the moniker, ItzSizzlingBacon. Zach has been nominated and won several acting awards and was voted \"Fav Teen Stand Up Comedian in America\".\n\nHe is a giant kid whose nickname is \"Man-Baby\" for his massive body and cherubic face. A nickname that Zach embraces! He has successfully transitioned from Disney type-actor to more adult roles - working almost non-stop in the entertainment industry.",
        "birthday": "2004-09-09",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.stage32.com/profile/304837/about",
        "id": 1639097,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Zachary Alexander Rice",
        "place_of_birth": "Irvine, California, U.S.",
        "popularity": 0.0668,
        "profile_path": "/2RE7I706g4LXT1KmcGeFpY2K1nk.jpg"
    }
}