{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yCnJT53HMXAK87xzPAdjdYhZ3JE.jpg",
                "genre_ids": [
                    18,
                    9648,
                    878
                ],
                "id": 1124,
                "original_language": "en",
                "original_title": "The Prestige",
                "overview": "A mysterious story of two magicians whose intense rivalry leads them on a life-long battle for supremacy -- full of obsession, deceit and jealousy with dangerous and deadly consequences.",
                "popularity": 11.832,
                "poster_path": "/2ZOzyhoW08neG27DVySMCcq2emd.jpg",
                "release_date": "2006-10-17",
                "title": "The Prestige",
                "video": false,
                "vote_average": 8.204,
                "vote_count": 16794,
                "character": "Owens",
                "credit_id": "52fe42e8c3a36847f802bf4b",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/gcGaSXzmodu53ABb0wOWrVWjKeg.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 1360,
                "original_language": "en",
                "original_title": "Frida",
                "overview": "A biography of artist Frida Kahlo, who channeled the pain of a crippling injury and her tempestuous marriage into her work.",
                "popularity": 4.2256,
                "poster_path": "/a4hgR6aKoohB6MHni171jbi9BkU.jpg",
                "release_date": "2002-08-29",
                "title": "Frida",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 2083,
                "character": "Guillermo Kahlo",
                "credit_id": "52fe42eec3a36847f802dc4d",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Roger Rees (May 5, 1944 – July 10, 2015) was a Welsh-American actor and director. Born in Aberystwyth, Wales, he grew up in south London where his father worked as a police officer. He attended Camberwell College of Arts and the Slade School of Fine Art, initially training as a painter before transitioning to theater work. He painted scenery at the Wimbledon Theater in south London before becoming an actor there in 1965.  Rees became widely recognized for his stage work, particularly his starring role in the Royal Shakespeare Company's adaptation of Charles Dickens' \"Nicholas Nickleby,\" which brought him both an Olivier Award and a Tony Award. He also received Obie Awards for his role in The End of the Day and as co-director of Peter and the Starcatcher. On television, he joined the hit TV comedy \"Cheers\" for the 1989-90 season as Kirstie Alley's suitor, the single-minded international financier and corporate raider Robin Colcord, and appeared in various other productions including the sci-fi series \"M.A.N.T.I.S.\" He became an American citizen in 1989 and was married to theatre collaborator Rick Elice since 2011. Roger was subsequently diagnosed with cancer and while performing on Broadway in the musical \"The Visit\" starring Chita Rivera, he was forced to quit the show in late May 2015. The 71-year-old actor died on July 10, 2015, leaving behind a distinguished legacy.",
        "birthday": "1944-05-05",
        "deathday": "2015-07-10",
        "gender": 2,
        "homepage": null,
        "id": 16407,
        "imdb_id": "nm0715953",
        "known_for_department": "Acting",
        "name": "Roger Rees",
        "place_of_birth": "Aberystwyth, Wales, UK",
        "popularity": 1.1133,
        "profile_path": "/pVZwILdpzTXECMUvLOSu12RbTHa.jpg"
    }
}