{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/c6yfABGVKuB5cjoOwdX4AJMlzUz.jpg",
                "genre_ids": [
                    35,
                    14
                ],
                "id": 620,
                "original_language": "en",
                "original_title": "Ghostbusters",
                "overview": "After losing their academic posts at a prestigious university, a team of parapsychologists goes into business as proton-pack-toting \"ghostbusters\" who exterminate ghouls, hobgoblins and supernatural pests of all stripes. An ad campaign pays off when a knockout cellist hires the squad to purge her swanky digs of demons that appear to be living in her refrigerator.",
                "popularity": 7.2781,
                "poster_path": "/7E8nLijS9AwwUEPu2oFYOVKhdFA.jpg",
                "release_date": "1984-06-08",
                "title": "Ghostbusters",
                "video": false,
                "vote_average": 7.495,
                "vote_count": 9352,
                "character": "Casey Kasem (voice)",
                "credit_id": "52fe425fc3a36847f8019313",
                "order": 21
            },
            {
                "adult": false,
                "backdrop_path": "/ekppa3eJm51s389jBX6dgt7CjYc.jpg",
                "genre_ids": [
                    16,
                    878,
                    28,
                    12,
                    10751
                ],
                "id": 1857,
                "original_language": "en",
                "original_title": "The Transformers: The Movie",
                "overview": "The Autobots must stop a colossal planet-consuming robot who goes after the Autobot Matrix of Leadership. At the same time, they must defend themselves against an all-out attack from the Decepticons.",
                "popularity": 2.9213,
                "poster_path": "/j4HTorvJdGOuIgGyE56fMCLmcCg.jpg",
                "release_date": "1986-08-08",
                "title": "The Transformers: The Movie",
                "video": false,
                "vote_average": 7.153,
                "vote_count": 559,
                "character": "Cliffjumper (voice)",
                "credit_id": "5986ec09c3a3680d5100e191",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Kemal Amin Kasem"
        ],
        "biography": "Kemal Amin \"Casey\" Kasem (April 27, 1932 – June 15, 2014) was an American disc jockey, radio personality, and voice actor, who created and hosted several radio countdown programs, notably American Top 40. He was the first actor to voice Norville \"Shaggy\" Rogers in the Scooby-Doo franchise (1969 to 1997 and 2002 to 2009).\n\nKasem began hosting the original American Top 40 on the weekend of July 4, 1970, and remained there until 1988. He would then spend nine years hosting another countdown titled Casey's Top 40, beginning in January 1989 and ending in February 1998, before returning to revive American Top 40 in 1998. Along the way, spin-offs of the original countdown were conceived for country music and adult contemporary audiences, and Kasem hosted two countdowns for the latter format beginning in 1992 and continuing until 2009. He also founded the American Video Awards in 1983 and continued to co-produce and host it until its final show in 1987.\n\nKasem also provided many commercial voiceovers, performed many voices for children's television (such as Sesame Street and the Transformers cartoon series), was \"the voice of NBC\" and helped with the annual Jerry Lewis telethon.\n\nDescription above from the Wikipedia article Casey Kasem, licensed under CC-BY-SA, full list of contributors on Wikipedia .",
        "birthday": "1932-04-27",
        "deathday": "2014-06-15",
        "gender": 2,
        "homepage": null,
        "id": 16418,
        "imdb_id": "nm0440487",
        "known_for_department": "Acting",
        "name": "Casey Kasem",
        "place_of_birth": "Detroit, Michigan, USA",
        "popularity": 0.4849,
        "profile_path": "/59kecPxxPIO8uwzaRZAOSDE1l80.jpg"
    }
}