{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/vxvzf0cGtFY2Vpw5ULWumCIW6Ri.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 16,
                "original_language": "en",
                "original_title": "Dancer in the Dark",
                "overview": "A Czech immigrant in 1960s America escapes into musicals while working long hours in poverty. Struggling with hereditary blindness, she is determined to secure her son’s future and will sacrifice everything to ensure he receives the operation that could spare him from her fate.",
                "popularity": 5.657,
                "poster_path": "/pWzOfTJRZHPNO1VNrMnNFqRcJwg.jpg",
                "release_date": "2000-09-01",
                "title": "Dancer in the Dark",
                "video": false,
                "vote_average": 7.868,
                "vote_count": 1888,
                "character": "Norman",
                "credit_id": "52fe420ec3a36847f80009a9",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/nY2faCdUVHzuH6FmDI6QsAURE68.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 145,
                "original_language": "da",
                "original_title": "Breaking the Waves",
                "overview": "In a small, conservative Scottish village, an oilman is paralyzed in an accident. His wife, who prayed for his return, feels guilty; even more, when he urges her to have sex with another.",
                "popularity": 4.6565,
                "poster_path": "/dQWMcdHXUOSHtr7ypOCa5T79JMS.jpg",
                "release_date": "1996-07-05",
                "title": "Breaking the Waves",
                "video": false,
                "vote_average": 7.499,
                "vote_count": 1053,
                "character": "Terry",
                "credit_id": "52fe421ec3a36847f8005519",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/1J28PJOkusMN5Ab9Q3oF310e11k.jpg",
                "genre_ids": [
                    10749,
                    18,
                    12
                ],
                "id": 175,
                "original_language": "fr",
                "original_title": "Le Grand Bleu",
                "overview": "Two men answer the call of the ocean in this romantic fantasy-adventure.  Jacques and Enzo are a pair of friends who have been close since childhood, and who share a passion for the dangerous sport of free diving. Professional diver Jacques opted to follow in the footsteps of his father, who died at sea when Jacques was a boy; to the bewilderment of scientists, Jacques harbors a remarkable ability to adjust his heart rate and breathing pattern in the water, so that his vital signs more closely resemble that of dolphins than men.  As Enzo persuades a reluctant Jacques to compete against him in a free diving contest -- determining who can dive deeper and longer without scuba gear -- Jacques meets Johana, a beautiful insurance investigator from America, and he finds that he must choose between his love for her and his love of the sea.",
                "popularity": 3.347,
                "poster_path": "/3t5t7yaFiTJQlqxiTkXJMFZdkh3.jpg",
                "release_date": "1988-05-10",
                "title": "The Big Blue",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 1501,
                "character": "Jacques Mayol",
                "credit_id": "52fe4222c3a36847f8006bbd",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/r3xsFBD1VTUusk393bBc7SsDUJe.jpg",
                "genre_ids": [
                    80,
                    18,
                    53
                ],
                "id": 553,
                "original_language": "en",
                "original_title": "Dogville",
                "overview": "A woman on the run from the mob is reluctantly accepted in a small Colorado community in exchange for labor, but when a search visits the town, she learns that their support has a price.",
                "popularity": 4.7686,
                "poster_path": "/lraVawavIXh5geMlVjpzCw9TGwR.jpg",
                "release_date": "2003-05-21",
                "title": "Dogville",
                "video": false,
                "vote_average": 7.8,
                "vote_count": 2542,
                "character": "The Man with the Big Hat",
                "credit_id": "52fe4251c3a36847f8014c9f",
                "order": 16
            },
            {
                "adult": false,
                "backdrop_path": "/rN1OKiEp8gNQ9RB6GeZeqOqVsjk.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 26371,
                "original_language": "en",
                "original_title": "Maurice",
                "overview": "After his lover rejects him, Maurice attempts to come to terms with his sexuality within the restrictiveness of Edwardian society.",
                "popularity": 2.1282,
                "poster_path": "/4MI2y8XViPrDiKs1p0QC4bTeZzf.jpg",
                "release_date": "1987-09-18",
                "title": "Maurice",
                "video": false,
                "vote_average": 7.625,
                "vote_count": 573,
                "character": "French Colleague (uncredited)",
                "credit_id": "58da665ac3a3686d67009e7f",
                "order": 36
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/1UAjYFLLQYOzFd0Ud6YQq2HoubU.jpg",
                "genre_ids": [
                    18,
                    27,
                    80,
                    53
                ],
                "id": 398173,
                "original_language": "en",
                "original_title": "The House That Jack Built",
                "overview": "Failed architect, engineer and vicious murderer Jack narrates the details of some of his most elaborately orchestrated crimes, each of them a towering piece of art that defines his life's work as a serial killer for twelve years.",
                "popularity": 6.7657,
                "poster_path": "/bMUGNkPaHOurcBK9g3XpJx3fxuO.jpg",
                "release_date": "2018-07-05",
                "title": "The House That Jack Built",
                "video": false,
                "vote_average": 7.128,
                "vote_count": 2915,
                "credit_id": "6036f92811c066003f487e6a",
                "department": "Crew",
                "job": "Thanks"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nJean-Marc Barr (born on 27 September 1960 in Bitburg, Rhineland-Palatinate, Germany) is a French-American film actor and director. His mother is French. His American father was in the US Air Force and served in the Second World War. Jean-Marc Barr is primarily known as an actor, but is also a film director, screenwriter and producer. Barr is bilingual in French and English: he speaks French with a nasal, hybrid accent, reminiscent of his American upbringing - with a slight American accent and occasional anglicisms in interviews - and English with a Mid-Atlantic accent.\n\nHe studied philosophy at the University of California, Los Angeles, the Paris Conservatoire and the Sorbonne. He went on to pursue an education in drama at the Guildhall School of Music and Drama in London. In London he met his future wife, a pianist and composer Irina Dečermić.\n\nJean-Marc Barr began working in theatre in France in 1986. After some television roles and film work, in particular, Hope and Glory (1987) by John Boorman, he was cast in the tremendously successful The Big Blue (1988). Luc Besson cast him in the role of French diver Jacques Mayol. He played in the role opposite Rosanna Arquette and Jean Reno. The Big Blue was the most financially successful film in France in the 1980s.\n\nIn 1991, he starred in Danish director Lars von Trier's Europa, marking the beginning of a long friendship (he is the godfather of von Trier's children) as well as a significant professional relationship. He went on to appear in von Trier’s Europa (1991), Breaking the Waves (1996), Dancer in the Dark (2000), Dogville (2004) and Manderlay (2005). Also in 2005 he starred in the French film Crustacés et Coquillages.\n\nHis collaboration with von Trier put him on track to start directing his own work. He debuted in 1999 as a director, screenwriter and producer with the intimate love story Lovers. This film became the first part of a trilogy; the two subsequent parts being the drama Too Much Flesh (2000) and the comedy Being Light (2001) which he co-directed with Pascal Arnold.\n\nHe may also be recognized for his role as the attractive divorce lawyer, Maitre Bertram in the Merchant Ivory film le Divorce (2003). He appeared as Hugo in The Red Siren in 2002. He appeared as the main character in the video for Blur's 1995 single, \"Charmless Man\".\n\nDescription above from the Wikipedia article Jean-Marc Barr, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1960-09-27",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1642,
        "imdb_id": "nm0000852",
        "known_for_department": "Acting",
        "name": "Jean-Marc Barr",
        "place_of_birth": "Bitburg, Rhineland-Palatinate, Germany",
        "popularity": 0.2998,
        "profile_path": "/65aLM2ZvBjJu2JWGSrTGHqXyc8w.jpg"
    }
}