{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/syapU4X3vYBCdARyAOtz3g90hMt.jpg",
                "genre_ids": [
                    53,
                    18,
                    80
                ],
                "id": 1900,
                "original_language": "en",
                "original_title": "Traffic",
                "overview": "An exploration of the United States of America's war on drugs from multiple perspectives. For the new head of the Office of National Drug Control Policy, the war becomes personal when he discovers his well-educated daughter is abusing cocaine within their comfortable suburban home. In Mexico, a flawed, but noble policeman agrees to testify against a powerful general in league with a cartel, and in San Diego, a drug kingpin's sheltered trophy wife must learn her husband's ruthless business after he is arrested, endangering her luxurious lifestyle.",
                "popularity": 5.291,
                "poster_path": "/v6YrfR1e2OUAYbXrJ7hv3EiGNcg.jpg",
                "release_date": "2000-12-27",
                "title": "Traffic",
                "video": false,
                "vote_average": 7.081,
                "vote_count": 2261,
                "character": "Manolo Sanchez",
                "credit_id": "52fe431fc3a36847f803c161",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/kcBlY5FasH8ti150aYExULw53ui.jpg",
                "genre_ids": [
                    18,
                    10402,
                    36
                ],
                "id": 16052,
                "original_language": "en",
                "original_title": "Selena",
                "overview": "In this biographical drama, Selena Quintanilla is born into a musical Mexican-American family in Texas. Her father, Abraham, realizes that his young daughter is talented and begins performing with her at small venues. She finds success and falls for her guitarist, Chris Perez, who draws the ire of her father. Seeking mainstream stardom, Selena begins recording an English-language album which, tragically, she would never complete.",
                "popularity": 3.5355,
                "poster_path": "/j8xX3yBAFOayfSaImgLZPnAcdWz.jpg",
                "release_date": "1997-03-21",
                "title": "Selena",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 1262,
                "character": "A. B. Quintanilla",
                "credit_id": "580358e19251411bd900068e",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/qKWQ9IEDkMawD7sgKnIGCdFAhct.jpg",
                "genre_ids": [
                    53,
                    28,
                    18,
                    10752
                ],
                "id": 8963,
                "original_language": "en",
                "original_title": "Crimson Tide",
                "overview": "After the Cold War, a breakaway Russian republic with nuclear warheads becomes a possible worldwide threat. U.S. submarine Capt. Frank Ramsey signs on a relatively green but highly recommended Lt. Cmdr. Ron Hunter to the USS Alabama, which may be the only ship able to stop a possible Armageddon. When Ramsey insists that the Alabama must act aggressively, Hunter, fearing they will start rather than stop a disaster, leads a potential mutiny to stop him.",
                "popularity": 5.5877,
                "poster_path": "/21nqRJ6ofEgVvEl68J4O9V26Xzy.jpg",
                "release_date": "1995-05-12",
                "title": "Crimson Tide",
                "video": false,
                "vote_average": 7.181,
                "vote_count": 1869,
                "character": "Sonarman #2",
                "credit_id": "5f73c17dd388ae0035bca049",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Jacob Vargas (born August 18, 1971) is a Mexican-American actor. He began his acting career when he was discovered breakdancing in a schoolyard at age 12. His introduction to acting came with a bit part as a breakdancer on the hit TV show Diff'rent Strokes (1978).\n\nHis first movie role was in the TV movie The Children of Times Square (1986). He started to appear in more films including Last Resort (1986), Ernest Goes to Camp (1987), The Principal (1987), Little Nikita (1988), American Me (1992), and Gas Food Lodging (1992).  In 1995, he won the very first ALMA Award (for Emerging Artist of the Year) for his work in both Allison Anders' Mi Vida Loca (1993) and Gregory Nava's My Family (1995).\n\nHe next starred in films including Crimson Tide (1995), Get Shorty (1995), Selena (1997), Romy and Michele's High School Reunion (1997), and the cult favorite Next Friday (2000) as Ice Cube's nemesis, Joker.\n\nHis next role was Tijuana cop Manolo, 'Benicio del Toro\"s partner in Steven Soderbergh's Academy Award- winning film Traffic (2000), which earned him a Screen Actors Guild Award and another ALMA Award.\n\nIn 2001, he executive produced and starred in the independent film Road Dogz (2002). He wrote, directed and acted in EDNY (2003). He also co-produced and starred in the stage play \"Latinologues\", which ran on Broadway in 2005 and is available on DVD.\n\nHe voiced for Pepito in Dr. Dolittle 2 (2001). Next, he played Sammi the chef in John Moore's Flight of the Phoenix (2004), Marine sniper Juan Cortez in Academy Award-winning director Sam Mendes' war drama Jarhead (2005), a straight-arrow DEA agent in the action drama The Death and Life of Bobby Z (2006), a politically charged busboy Miguel in Emilio Estevez's historical drama Bobby (2006), and a psychologically tortured drone pilot Rudy Ramirez in Alex Rivera's sci-fi political love story Sleep Dealer (2008).\n\nHe had roles in The Hills Have Eyes 2 (2007), Are We Done Yet? (2007), Death Race (2008), Cesar Chavez (2014, Heaven is For Real (2014), The Tell-Tale Heart (2016), Plan B, (2021), and Kimi (2022).\n\nHis major TV roles are as Bob on Surfside Girls, Tony Medina on Mr. Iglesias, Horacio on Mosaic, Domingo Colon on Marvel's Luke Cage, Allesandro Montez on Sons of Anarchy and later on Mayans M.C., Guillermo on Moonlight, Ernesto Tiant on Greetings from Tucson, and Dr. Roberto Martinez on Max Steel. He had recurring roles on Colony, Blue, and Six Feet Under.\n\nHe has also guest starred on a number of shows including National Treasure: Edge of History, The Mentalist, Burn Notice, Psych, Numb3rs, Medium, CSI: NY, Cold Case, The Pretender, JAG, ER, Full House, and Hunter.\n\nHe has voiced for characters on animated series including Solar Opposites, Young Justice, and a recurring role on Tarantula.",
        "birthday": "1971-08-18",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 16429,
        "imdb_id": "nm0889846",
        "known_for_department": "Acting",
        "name": "Jacob Vargas",
        "place_of_birth": "Michoacan, Mexico",
        "popularity": 0.6625,
        "profile_path": "/hq5SIxyGHGTBCxc9LPpyeHmOjkU.jpg"
    }
}