{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tcx15vswrQJCGET5lGxESQ4J5LG.jpg",
                "genre_ids": [
                    10752,
                    36,
                    12
                ],
                "id": 57212,
                "original_language": "en",
                "original_title": "War Horse",
                "overview": "On the brink of the First World War, Albert's beloved horse Joey is sold to the Cavalry by his father. Against the backdrop of the Great War, Joey begins an odyssey full of danger, joy, and sorrow, and he transforms everyone he meets along the way. Meanwhile, Albert, unable to forget his equine friend, searches the battlefields of France to find Joey and bring him home.",
                "popularity": 4.5931,
                "poster_path": "/3aRHhvvngFPJFy5uAjo7GVr3PhL.jpg",
                "release_date": "2011-12-25",
                "title": "War Horse",
                "video": false,
                "vote_average": 7.296,
                "vote_count": 3518,
                "character": "Junior German Officer",
                "credit_id": "638c7aee7d5db50fbf00dc5a",
                "order": 37
            },
            {
                "adult": false,
                "backdrop_path": "/hwNtEmmugU5Yd7hpfprNWI0DGIn.jpg",
                "genre_ids": [
                    18,
                    53,
                    10752
                ],
                "id": 16869,
                "original_language": "en",
                "original_title": "Inglourious Basterds",
                "overview": "In Nazi-occupied France during World War II, a group of Jewish-American soldiers known as \"The Basterds\" are chosen specifically to spread fear throughout the Third Reich by scalping and brutally killing Nazis. The Basterds, lead by Lt. Aldo Raine soon cross paths with a French-Jewish teenage girl who runs a movie theater in Paris which is targeted by the soldiers.",
                "popularity": 18.9435,
                "poster_path": "/7sfbEnaARXDDhKm0CZ7D7uc2sbo.jpg",
                "release_date": "2009-08-02",
                "title": "Inglourious Basterds",
                "video": false,
                "vote_average": 8.215,
                "vote_count": 23209,
                "character": "Herrman #3",
                "credit_id": "5776d2f3925141466c0015c7",
                "order": 37
            },
            {
                "adult": false,
                "backdrop_path": "/n4S9IhJI3UTq5GQMFg7qwC3kcI3.jpg",
                "genre_ids": [
                    18,
                    9648
                ],
                "id": 37903,
                "original_language": "de",
                "original_title": "Das weiße Band - Eine deutsche Kindergeschichte",
                "overview": "An aged tailor recalls his life as the schoolteacher of a small village in Northern Germany that was struck by a series of strange events in the year leading up to WWI.",
                "popularity": 2.9645,
                "poster_path": "/54dlnGDexrwAFlDb8HWKfmmX4LB.jpg",
                "release_date": "2009-09-24",
                "title": "The White Ribbon",
                "video": false,
                "vote_average": 7.488,
                "vote_count": 1067,
                "character": "The Tutor",
                "credit_id": "5776d310c3a36873b1000e9a",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Since his father was the senior physician of a ward in the Bad Schussenried Centre for Psychiatry, he grew up with his three siblings in a service flat on the former hospital grounds. He attended the Studienkolleg St.Johann Blönried and graduated from there in 2003. At the age of 17, he lived for one year on the Pine Ridge Indian Reservation, where he graduated from Red Cloud High School in 2001. In 2008 he completed his acting education at the Otto Falckenberg School in Munich.\n\nHe studied at the Hochschule für Fernsehen und Film München and graduated there in March 2018 with a diploma in documentary film directing and television journalism.\n\nInternationally, Kranz was seen in the drama The White Ribbon (2009) by Michael Haneke, in Quentin Tarantino's war film Inglourious Basterds and in Steven Spielberg's Bridge of Spies. He became known to a wider television audience with the series Hindafing, in which he plays the city priest Kraus. The series was awarded the Austrian film prize Romy in 2018.\n\nHis spot myBorder's joyFence was awarded the First Steps Award and the Porsche Award in 2018.",
        "birthday": "1983-04-17",
        "deathday": null,
        "gender": 2,
        "homepage": "http://michaelkranz.com",
        "id": 1643968,
        "imdb_id": "nm2947895",
        "known_for_department": "Acting",
        "name": "Michael Kranz",
        "place_of_birth": "Ravensburg, Germany",
        "popularity": 1.1276,
        "profile_path": "/9WioDLqhY0eUG96ytxXkNuH8nej.jpg"
    }
}