{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ujd2rMIVb0Z8orWrEbMWdJsBRYd.jpg",
                "genre_ids": [
                    53,
                    28,
                    12
                ],
                "id": 484468,
                "original_language": "fr",
                "original_title": "Le Chant du loup",
                "overview": "Shown from the perspective of a young submariner with unusually sensitive hearing and uncannily precise sound recognition. The fate of many often depends on his ability, and one time, whilst highly stressed, he makes a incorrect call which put his entire crew in mortal danger.  Trying to regain the confidence of his comrades, he conducts an unauthorised investigation of an apparent plot which, it turns out, risks escalating into a nuclear apocalypse. Suddenly working under pressure with the fleet admiral, they must do whatever is necessary, even the unthinkable, to prevent a nuclear war, since a confirmed nuclear strike order cannot be countermanded.",
                "popularity": 11.6585,
                "poster_path": "/8bxIzp9w9l9ZzGVwNaIKOaem05A.jpg",
                "release_date": "2019-02-20",
                "title": "The Wolf's Call",
                "video": false,
                "vote_average": 7.548,
                "vote_count": 2088,
                "character": "Shooting officer SNLE",
                "credit_id": "601d602bd96c3c00401d1136",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Nicolas Van Beveren (born August 31, 1982) is a French actor and film director best known for starring as Jon in the 2016 science fiction film Virtual Revolution.\n\nVan Beveren was born in Summer 1982 to a Seychellois mother and Belgian father in Machabée, a town in Mahé, Seychelles. At the age of 6, he moved to France where he developed interest in acting. He started his career in 2007 after he was called up for an audition in Paris to play a role in a television series on M6, a French TV channel. He has since gone on to feature in various television series and films and has directed four short films over the course of his career. He cites Steven Spielberg, Ridley Scott and Denzel Washington as his influences. Van Beveren appeared in Axe (marque) publicity in 2015.\n\nNicolas Van Beveren went in Notre Dame private school in Poissy, a little city next to Paris between 1987 and 1991. As a teenager, he went in collège Saint-Stanislas in Osny from 1991 to 1996 then he changed for another collège, Léonard de Vinci, located in Saint-Thibault-des-Vignes from 1996 to 1998 in Île-de-France region. He passed his baccalaureate in the Martin Luther King highschool in Bussy-Saint-Georges from 1998 to 2001. He entered between 1998 and 2000 in the Conservatoire national supérieur d'art dramatique of Noisiel.\n\nSource: Article \"Nicolas van Beveren\" from Wikipedia in english, licensed under CC-BY-SA 3.0.",
        "birthday": "1982-08-31",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1643601,
        "imdb_id": "nm3016596",
        "known_for_department": "Acting",
        "name": "Nicolas Van Beveren",
        "place_of_birth": "Mahé, Seychelles",
        "popularity": 0.1532,
        "profile_path": "/wpwwOOb5Yug13CtMLr73Z5RVz90.jpg"
    }
}