{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7Q44vznK8E9SYsdkmIanrLmydZn.jpg",
                "genre_ids": [
                    28,
                    80,
                    18,
                    36,
                    53
                ],
                "id": 6968,
                "original_language": "de",
                "original_title": "Der Baader Meinhof Komplex",
                "overview": "When German police viciously quell a protest against the shah of Iran, popular journalist Ulrike Meinhof rebels against her dishonest marriage, walks away from her children and joins radical anarchist Andreas Baader. Together with Baader's girlfriend, Gudrun Ensslin, they form the violent Red Faction Army, and together perpetrate a slew of terrorist attacks as a way of disrupting the fabric of what they see as an increasingly fascist state.",
                "popularity": 2.0897,
                "poster_path": "/AjwdjcVorNKScu682tDATn5duoy.jpg",
                "release_date": "2008-09-25",
                "title": "The Baader Meinhof Complex",
                "video": false,
                "vote_average": 6.976,
                "vote_count": 613,
                "character": "Simone - Stefan Austs girlfriend (uncredited)",
                "credit_id": "5f72b27fe4b5760037eeeb7d",
                "order": 49
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Esther was born in Berlin Germany, grew up in Greece and returned with her family later again back to Germany. She started out as a kid. Dancing, singing, hosting. When it got more professional, she decided to make this passion her job. She hosted a kids show, when she was 10 years old. Almost every weekend, she was on stage as a dancer. She started vocal training in the age of 13 and finished her vocal training as an opera singer by the age of 23. She had several bands and projects, composed her own songs and had fun being a DJ for several occasions. When she was 14 she got her first talent agent. From then on she starred and supported more than 30 movies and TV shows up until today. National and international. After a few years of acting only, her passion for music grew stronger and she decided to go deeper into this field. Ever since she had been writing poems, short stories and articles. Now it turned into fully structured pop/rock/folk songs. In 2009, she went to Israel to record two singles, that she later decided not to put on her album, since the style wasn't what she wanted. She toured with a new program, rewrote, rerecorded until she had found the style she wanted to go for, on her first album as a solo singer. Since 2011, she is writing continuously. Spending a lot of time in New York and Los Angeles made her style grow more and more American. Her English is perfect, her writing is inspiring and her thoughts are deep. She cares about the environment and tries to be as active as possible for several projects worldwide. Over the years, she won several national awards as a painter and got attention in the media as an actress and society girl.\n\nShe wants to be as independent as possible. As free as can be. And as committed as necessary to serve her and other people's tasks best. She never stopped learning. She had recently her acting trained again with f.exp. Margie Haber, Crystal Carson and Christiane Kupfer, just to name a few.\n\nTo stay focused, she studies business administration and economy psychology in a correspondence course.\n\nIn 2012 she continues working on her album and tours with a small acoustic concert within Germany.",
        "birthday": "1981-12-16",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1645196,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Esther Seibt",
        "place_of_birth": "Berlin, Germany",
        "popularity": 0.0835,
        "profile_path": "/lhGcRMw1298y5p2yDdCt0zRm3aL.jpg"
    }
}