{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7QDWTqSGqI2Q5dOBtvT64MOhmwJ.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 930094,
                "original_language": "en",
                "original_title": "Red, White & Royal Blue",
                "overview": "After an altercation between Alex, the president's son, and Britain's Prince Henry at a royal event becomes tabloid fodder, their long-running feud now threatens to drive a wedge in U.S./British relations. When the rivals are forced into a staged truce, their icy relationship begins to thaw and the friction between them sparks something deeper than they ever expected.",
                "popularity": 10.1049,
                "poster_path": "/ta3ReqbdEcLJM3mcHMzbYFZI8v7.jpg",
                "release_date": "2023-07-27",
                "title": "Red, White & Royal Blue",
                "video": false,
                "vote_average": 7.967,
                "vote_count": 1424,
                "character": "Secret Service Agent",
                "credit_id": "64bf2ad46d4c9700e275d187",
                "order": 33
            },
            {
                "adult": false,
                "backdrop_path": "/f0ACHVpV707zqu4etZrXnWNdSgL.jpg",
                "genre_ids": [
                    28,
                    80,
                    53
                ],
                "id": 866398,
                "original_language": "en",
                "original_title": "The Beekeeper",
                "overview": "One man's campaign for vengeance takes on national stakes after he is revealed to be a former operative of a powerful and clandestine organization known as Beekeepers.",
                "popularity": 15.5325,
                "poster_path": "/A7EByudX0eOzlkQ2FIbogzyazm2.jpg",
                "release_date": "2024-01-08",
                "title": "The Beekeeper",
                "video": false,
                "vote_average": 7.289,
                "vote_count": 3771,
                "character": "Detective Chen",
                "credit_id": "659fe6fb84448e012a10d647",
                "order": 17
            },
            {
                "adult": false,
                "backdrop_path": "/nvW0QfRJ7ga9TK8DKwBfAPA8ywP.jpg",
                "genre_ids": [
                    28,
                    18,
                    80
                ],
                "id": 944401,
                "original_language": "fr",
                "original_title": "Dogman",
                "overview": "A boy, bruised by life, finds his salvation through the love of his dogs.",
                "popularity": 9.9999,
                "poster_path": "/5RuUD7J4vO0El7TRL9guZIik0I0.jpg",
                "release_date": "2023-09-27",
                "title": "Dogman",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 1238,
                "character": "Officer Dad's Arrest",
                "credit_id": "637a93aef056d500825ea1f0",
                "order": 36
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Derek Siow is a film and television actor and has appeared in feature films such as Angel Has Fallen, The Beekeeper and Zero Dark Thirty. He appeared in the TV thriller The Fear Index opposite Josh Hartnett and was also in the main cast of the animation TV series The Skinner Boys for 2 seasons\n\nDerek is also known for voicing numerous video games including Rise Of The Ronin, Dead Island 2, Star Wars: Battlefront 2, Horizon Forbidden West, Skull and Bones, Gears Tactics, Battlefield V, Guitar Hero Live and as Ashton Anchors in Star Ocean: Anamnesis.\n\nHis Hollywood feature film debut came in the Academy-Award winning Zero Dark Thirty where he worked with Kathryn Bigelow in a small role as an interrogator. He would go on to appear as US Marine Tony Song in Brad Pitt's War Machine alongside Will Poulter, LaKeith Stanfield and Hopper Penn. He played wealthy investor Jay Lee in The Rezort. He had a key role as an ex-military hacker in Angel Has Fallen alongside Danny Huston and portrayed CIA agent Gene Wilcox opposite Thandiwe Newton in the thriller All The Old Knives. Derek played the leader of a triad gang in Batgirl which he played opposite J.K. Simmons (Commissioner Gordon) and also as Detective Chen opposite Jason Statham in The Beekeeper.\n\nDerek has appeared in TV shows including The Fear Index (opposite Josh Hartnett) as Lin Ju-Long, the CFO of a tech company. He played Andy Sim, a press officer for the police force in The Capture and also appeared in American Odyssey as Salter, an American special forces soldier.\n\nDerek trained at the Royal Academy of Dramatic Art in London and also regularly attended classes at the Ivana Chubbuck Studio.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.filmmakers.eu/en/actors/derek-siow",
        "id": 1647129,
        "imdb_id": "nm3685723",
        "known_for_department": "Acting",
        "name": "Derek Siow",
        "place_of_birth": " Melbourne, Australia",
        "popularity": 0.1821,
        "profile_path": "/qvgJitn5JRvyoEQEPqc3VcM7x1e.jpg"
    }
}