{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/g1QkFTSkqA0Pq1p63jTsPIEA7zy.jpg",
                "genre_ids": [
                    18
                ],
                "id": 1246,
                "original_language": "en",
                "original_title": "Rocky Balboa",
                "overview": "When he loses a highly publicized virtual boxing match to ex-champ Rocky Balboa, reigning heavyweight titleholder Mason Dixon retaliates by challenging the Italian Stallion to a 10-round exhibition bout. To the surprise of his son and friends, Rocky agrees to come out of retirement and face an opponent who's faster, stronger and thirty years his junior. Rocky takes on Dixon in what will become the greatest fight in boxing history!",
                "popularity": 6.2397,
                "poster_path": "/byBlJvZwCqgtIwrZNv0pyE974jC.jpg",
                "release_date": "2006-12-20",
                "title": "Rocky Balboa",
                "video": false,
                "vote_average": 6.873,
                "vote_count": 3636,
                "character": "Mason 'The Line' Dixon",
                "credit_id": "52fe42e9c3a36847f802c63f",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Antonio Deon Tarver (born November 21, 1968) is an American former professional boxer and boxing commentator. In boxing, he competed from 1997 to 2015 and held multiple light heavyweight world championships, including the WBA (Unified), WBC, IBF, and Ring magazine titles, as well as the IBO light heavyweight and cruiserweight titles.\n\nAs an amateur, Tarver represented the United States at the 1996 Olympics, winning a bronze medal in the light heavyweight division; he eventually lost to Vassiliy Jirov from Kazakhstan, whom he had previously defeated at the 1995 World Championships to win gold. Tarver also triumphed at the 1995 Pan American Games and 1995 U.S. National Championships, winning gold in both. He remains the only boxer in history to have won gold at the Pan Am Games, World Championships, and U.S. Nationals all in the same year.\n\nOutside of boxing, Tarver starred as Mason \"The Line\" Dixon, the heavyweight champion in the 2006 film Rocky Balboa.",
        "birthday": "1968-11-21",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 16507,
        "imdb_id": "nm1620989",
        "known_for_department": "Acting",
        "name": "Antonio Tarver",
        "place_of_birth": "Orlando, Florida, USA",
        "popularity": 0.1134,
        "profile_path": "/r8E2Fw6mu3g4del7uadNmPft53o.jpg"
    }
}