{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/g1QkFTSkqA0Pq1p63jTsPIEA7zy.jpg",
                "genre_ids": [
                    18
                ],
                "id": 1246,
                "original_language": "en",
                "original_title": "Rocky Balboa",
                "overview": "When he loses a highly publicized virtual boxing match to ex-champ Rocky Balboa, reigning heavyweight titleholder Mason Dixon retaliates by challenging the Italian Stallion to a 10-round exhibition bout. To the surprise of his son and friends, Rocky agrees to come out of retirement and face an opponent who's faster, stronger and thirty years his junior. Rocky takes on Dixon in what will become the greatest fight in boxing history!",
                "popularity": 7.5978,
                "poster_path": "/byBlJvZwCqgtIwrZNv0pyE974jC.jpg",
                "release_date": "2006-12-20",
                "title": "Rocky Balboa",
                "video": false,
                "vote_average": 6.872,
                "vote_count": 3632,
                "character": "Martin",
                "credit_id": "52fe42e9c3a36847f802c63b",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/bF8eIIIJJoMZf2mFibAejqEGQcX.jpg",
                "genre_ids": [
                    18,
                    10402
                ],
                "id": 244786,
                "original_language": "en",
                "original_title": "Whiplash",
                "overview": "Under the direction of a ruthless instructor, a talented young drummer begins to pursue perfection at any cost, even his humanity.",
                "popularity": 17.4549,
                "poster_path": "/7fn624j5lj3xTme2SgiLCeuedmO.jpg",
                "release_date": "2014-10-10",
                "title": "Whiplash",
                "video": false,
                "vote_average": 8.4,
                "vote_count": 15913,
                "character": "Red Henderson",
                "credit_id": "55e6d230c3a3685f96002a6b",
                "order": 29
            },
            {
                "adult": false,
                "backdrop_path": "/kVGUdR1CXKAyCFj5Tt4uyR2bpFx.jpg",
                "genre_ids": [
                    36,
                    18
                ],
                "id": 273895,
                "original_language": "en",
                "original_title": "Selma",
                "overview": "\"Selma,\" as in Alabama, the place where segregation in the South was at its worst, leading to a march that ended in violence, forcing a famous statement by President Lyndon B. Johnson that ultimately led to the signing of the Voting Rights Act.",
                "popularity": 4.5908,
                "poster_path": "/wq4lhMc4BuOyQqe1ZGzhxLyy3Uk.jpg",
                "release_date": "2014-12-25",
                "title": "Selma",
                "video": false,
                "vote_average": 7.39,
                "vote_count": 2256,
                "character": "Cager Lee",
                "credit_id": "5994024892514154120130cf",
                "order": 36
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Henry Gayle Sanders",
            "Henry Sanders",
            "Henry Gale Sanders"
        ],
        "biography": "Henry Gayle Sanders is an American actor known for his TV roles as Prosper Denton on Queen Sugar, Samuel Carter on 9-1-1, Uncle Chester on Hap & Leonard, Cedric on the miniseries DMZ, and Robert E. On Dr. Quinn, Medicine Woman as well as the TV movie of the same name.\n\nHe's known for his film roles as Arthur Holloway in Samaritan, Pastor Jack in Roman J. Israel Esq., Cager Lee in Selma, Red Henderson in Whiplash, Martin in Rocky Balboa, Cesar's Trainer in Play It to the Bone, and Sandy in Bull Durham. He has also had roles in a number of TV movies.\n\nHe's guest starred on numerous TV shows including Shameless, American Horror Story, Grey's Anatomy, The Mentalist, CSI, Cold Case, Eleventh Hour, Heartland, Commander in Chief, Joan of Arcadia, The West Wing, Boomtown, NYPD Blue, Moesha, Sliders, ER, Murphy Brown, The Young and the Restless, L.A. Law, Alf, Matlock, Married... with Children, Beauty and the Beast, Moonlighting, Cagney & Lacey, Highway to Heaven, What's Happening Now?, 227, Hunter, Hill Street Blues, Miami Vice, Knots Landing, Night Court, Knight Rider, Diff'rent Strokes, St. Elsewhere, The Greatest American Hero, The Jeffersons, Good Times, and The Rockford Files.",
        "birthday": "1942-08-18",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 16506,
        "imdb_id": "nm0761572",
        "known_for_department": "Acting",
        "name": "Henry G. Sanders",
        "place_of_birth": "Houston, Texas, USA",
        "popularity": 0.5439,
        "profile_path": "/4HWUP5K5kPxt5c0Xp65QOyV5gPG.jpg"
    }
}