{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mNLonkdD4MtaZnHTifp8be8nJrm.jpg",
                "genre_ids": [
                    18
                ],
                "id": 374473,
                "original_language": "en",
                "original_title": "I, Daniel Blake",
                "overview": "A middle aged carpenter, who requires state welfare after injuring himself, is joined by a single mother in a similar scenario.",
                "popularity": 3.2663,
                "poster_path": "/nu3WVABXz2W85N6JXTZOT1aWS3b.jpg",
                "release_date": "2016-10-21",
                "title": "I, Daniel Blake",
                "video": false,
                "vote_average": 7.717,
                "vote_count": 1472,
                "character": "Shopper (uncredited)",
                "credit_id": "5787cdb192514131ca001275",
                "order": 46
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "James was born in York, UK to parents Mark and Liz. He attended Clifton Preparatory School until the age of 8 before moving to St Olave's School. It was at school here that he first developed a love for acting and drama through the influences of some of his teachers. At 13 he began attending St Peter's School, York and it was here that his sporting prowess as a cricketer came to the fore playing alongside now England cricketer Jonny Bairstow.\n\nLeaving school at 18 with a hand full of A-levels, James then spent time working in York in order to save for his time in Vancouver, B.C, Canada. Whilst he spent several months in, what he believes to be, the nicest cities he has ever had the opportunity to visit, his acting took a hiatus as uncertainty and settled on him in terms of career path choices.\n\nUpon return from North America, James began studying Politics and Sociology at Newcastle University. It was here that acting really took over and the decision was made that it was the only career that he could seriously consider taking on. Being a large and active part of theatre and comedy societies where he was successful winning awards and ultimately sitting on the executive committee.\n\nHaving graduated in 2013 he then embarked upon his chosen path, but deciding not to attend drama school due to the financial implication of such a venture. In going about it 'the old fashioned way' and learning on the job, a clear progression can be seen in his screen work as he continually looks more and more comfortable on screen. 'Eveline' was reasonably well received, but James himself has commented on his try-hard acting. More recently in 'Father Figure' he has been able to maintain character much more strongly and with his newest work in 'Acheron', 'Switch', 'The Jeweller' and 'Chloe' he has been going from strength to strength.  - IMDb Mini Biography By: Lauren Green",
        "birthday": "1991-01-31",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1650256,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "James Hepworth",
        "place_of_birth": "York, Yorkshire, England",
        "popularity": 0.0143,
        "profile_path": null
    }
}