{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8WIufsaJgm7VWgAc5ALWdJ8v2kB.jpg",
                "genre_ids": [
                    14,
                    27,
                    35
                ],
                "id": 766,
                "original_language": "en",
                "original_title": "Army of Darkness",
                "overview": "Ash, a handsome, shotgun-toting, chainsaw-armed department store clerk, is time warped backwards into England's Dark Ages, where he romances a beauty and faces legions of the undead.",
                "popularity": 4.8105,
                "poster_path": "/xsgTuAtR2zSH8Umg3jWZcZjlDpe.jpg",
                "release_date": "1992-10-31",
                "title": "Army of Darkness",
                "video": false,
                "vote_average": 7.255,
                "vote_count": 3335,
                "character": "Fake Shemp",
                "credit_id": "5f809b0f02842000380ad00b",
                "order": 32
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/gtdCmYpubVkkvTQ8rdR9tkixDSj.jpg",
                "genre_ids": [
                    80,
                    18,
                    53
                ],
                "id": 10223,
                "original_language": "en",
                "original_title": "A Simple Plan",
                "overview": "Captivated by the lure of sudden wealth, the quiet rural lives of two brothers erupt into conflicts of greed, paranoia and distrust when over $4 million in cash is discovered at the remote site of a downed small airplane. Their simple plan to retain the money while avoiding detection opens a Pandora's box when the fear of getting caught triggers panicked behavior and leads to virulent consequences.",
                "popularity": 1.9306,
                "poster_path": "/iJYGDwZmVEYRkSPbWQdxzvBLTcK.jpg",
                "release_date": "1998-12-11",
                "title": "A Simple Plan",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 994,
                "credit_id": "63925c90f04d0100a26fd26b",
                "department": "Production",
                "job": "Casting Associate"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Born in Trenton, but grew up along the near-mythical Springsteen Jersey Shore... Point Pleasant. After graduating from Ithaca Film School, he moved to Los Angeles where he briefly worked for The Walter Partos Agency and Disney's product placement department as an intern before finding his near permanent home with Renaissance Pictures. In one way or another, he was worked for them since Darkman (1990). He's done work as a second-unit director for both Renassiance (Xena) and other Independent or up and coming filmmakers. His somewhat imposing personal style has gotten him more than a few roles as bad guys, bank robbers, mad biker-killers and other such fare in films and music videos. He has had a disturbing recurring role as a Death Metal High Priest, Wheatley (named after horror writer Dennis Wheatley) in Jim VanBebber's music videos for Death Metal band Necrophagia.\n\nPollison and his wife, Lisa Feerick Pollison are considered authorities on World Cinema, especially Asian & Scandinavian Film. He used his expertise in Hong Kong action films to good use during the development of the Xena and Hercules Televisions productions. The Hong Kong Origins of Xena's character and his involvement were written up in the official Xena Magazine.\n\nPollison was employed with Ghosthouse productions, working with Rob Tapert on films such as The Grudge and The Bogeyman. He then moved to Ghost House Underground , Ghost House Productions' independent releasing arm for DVDs, limited release films and streaming platforms. Although Ghosthouse Underground has since been folded back into the main company, Pollison remains a Consultant for Ghost House as well as Bloody Disgusting and other Indie releasing companies as a buyer and development associate.",
        "birthday": "1966-11-12",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1650913,
        "imdb_id": null,
        "known_for_department": "Production",
        "name": "David Pollison",
        "place_of_birth": "Trenton, New Jersey, USA",
        "popularity": 0.068,
        "profile_path": null
    }
}