{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/85k0kaoRgGmF6ACq0M61AFxhjLN.jpg",
                "genre_ids": [
                    35,
                    80
                ],
                "id": 12153,
                "original_language": "en",
                "original_title": "White Chicks",
                "overview": "Two FBI agent brothers, Marcus and Kevin Copeland, accidentally foil a drug bust. To avoid being fired they accept a mission escorting a pair of socialites to the Hamptons--but when the girls are disfigured in a car accident, they refuse to go. Left without options, Marcus and Kevin decide to pose as the sisters, transforming themselves from black men into rich white women.",
                "popularity": 13.9855,
                "poster_path": "/aHTUpo45qy9QYIOnVITGGqLoVcA.jpg",
                "release_date": "2004-06-23",
                "title": "White Chicks",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 4258,
                "character": "Tony",
                "credit_id": "5b62c2b09251414060029add",
                "order": 19
            },
            {
                "adult": false,
                "backdrop_path": "/dfkE2LppPbJ1qUzi3tdND5iuMFp.jpg",
                "genre_ids": [
                    35,
                    80
                ],
                "id": 10607,
                "original_language": "en",
                "original_title": "Don't Be a Menace to South Central While Drinking Your Juice in the Hood",
                "overview": "When Ashtray moves to South Central L.A. to live with his father (who appears to be the same age he is) and grandmother (who likes to talk tough and smoke reefer), he falls in with his gang-banging cousin Loc Dog, who along with the requisite pistols and Uzi carries a thermo-nuclear warhead for self-defense. Will Ashtray be able to keep living the straight life?",
                "popularity": 6.7019,
                "poster_path": "/HZQBF7JDd2e9p4rPSbSHuWHaCC.jpg",
                "release_date": "1996-01-12",
                "title": "Don't Be a Menace to South Central While Drinking Your Juice in the Hood",
                "video": false,
                "vote_average": 7.03,
                "vote_count": 1402,
                "character": "Birthday Boy Thug",
                "credit_id": "674ccfab465c6ba6dd93b4a5",
                "order": 26
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Leroy Casey",
            "DJ Twist"
        ],
        "biography": "Casey Lee an American Actor, and Musician born and raised in the city of New York, South Bronx. Moving to Los Angeles in the mid 90's. He landed a job as DJ Twist on the hit Fox television show \"In Living Color\" During that time he began to get involved in acting.\n\nKnown for delivering great unique character performances in whatever role he plays. Fast forward, Lee has Guest starred on many television shows, from ABC, CBS, FOX, as well as Major motion pictures. He continues to train, believing acting is a forever learning process.",
        "birthday": "1973-01-22",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 165262,
        "imdb_id": "nm0496953",
        "known_for_department": "Acting",
        "name": "Casey Lee",
        "place_of_birth": "South Bronx, New York City, New York,  USA",
        "popularity": 0.0641,
        "profile_path": "/aSO6TcjH521f6juQyxohk6AroNU.jpg"
    }
}