{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9xjUZjuYyehv2qnqMH0oR9nSTft.jpg",
                "genre_ids": [
                    80,
                    28,
                    18,
                    53
                ],
                "id": 9702,
                "original_language": "en",
                "original_title": "Bound by Honor",
                "overview": "Based on the true life experiences of poet Jimmy Santiago Baca, the film focuses on half-brothers Paco and Cruz, and their bi-racial cousin Miklo. It opens in 1972, as the three are members of an East L.A. gang known as the \"Vatos Locos\", and the story focuses on how a violent crime and the influence of narcotics alter their lives. Miklo is incarcerated and sent to San Quentin, where he makes a \"home\" for himself. Cruz becomes an exceptional artist, but a heroin addiction overcomes him with tragic results. Paco becomes a cop and an enemy to his \"carnal\", Miklo.",
                "popularity": 8.813,
                "poster_path": "/gvP6R6juhe2IpCG7QGDgjyUvm0g.jpg",
                "release_date": "1993-02-05",
                "title": "Bound by Honor",
                "video": false,
                "vote_average": 8.132,
                "vote_count": 1450,
                "character": "Montana's Daughter",
                "credit_id": "5c4003ef0e0a2643d391a715",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Vanessa Marquez was born on December 21, 1968 in Los Angeles County, California. She decided that she wanted to be an actress after she first saw The Wizard of Oz (1939) when she was only 3 or 4. She made her film debut as Ana Delgado in Stand and Deliver in 1988. In the Nineties Miss Marquez was very much in demand as an actress, appearing in such films as Twenty Bucks (1993), Bound by Honor (1993, also known as Blood In, Blood Out), and Father Hood (1993). On television she guest starred on such shows as Wiseguy, Seinfeld, Nurses, and Melrose Place. She appeared in the first three seasons on the hit TV show ER in the role of Nurse Wendy Goldman. Vanessa Marquez died on August 30, 2018 in South Pasadena, California.",
        "birthday": "1968-12-21",
        "deathday": "2018-08-30",
        "gender": 1,
        "homepage": null,
        "id": 165285,
        "imdb_id": "nm0549882",
        "known_for_department": "Acting",
        "name": "Vanessa Marquez",
        "place_of_birth": "Los Angeles County, California, USA",
        "popularity": 0.1705,
        "profile_path": "/8B0stRxSUO5ptMUsETCyynOtt4f.jpg"
    }
}