{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ambKXAJYrDPJK9wBJlIVVWbQbar.jpg",
                "genre_ids": [
                    99
                ],
                "id": 432976,
                "original_language": "en",
                "original_title": "Icarus",
                "overview": "While investigating the furtive world of illegal doping in sports, director Bryan Fogel connects with renegade Russian scientist Dr. Grigory Rodchenkov—a pillar of his country’s “anti-doping” program. Over dozens of Skype calls, urine samples, and badly administered hormone injections, Fogel and Rodchenkov grow closer despite shocking allegations that place Rodchenkov at the center of Russia’s state-sponsored Olympic doping program.",
                "popularity": 2.0955,
                "poster_path": "/x5azMi1KvZWbBbfjmGqpHNGqjH.jpg",
                "release_date": "2017-06-03",
                "title": "Icarus",
                "video": false,
                "vote_average": 7.657,
                "vote_count": 784,
                "character": "Self (archive footage)",
                "credit_id": "611ba1fcd1a893002dd5a7b7",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Sebastian Coe OBE MP",
            "Себастьян Ньюболд Коу",
            "Себастьян Коу"
        ],
        "biography": "Sebastian Newbold Coe, Baron Coe, CH, KBE, Hon FRIBA is a British sports administrator, former politician and retired track and field athlete. As a middle-distance runner, Coe won four Olympic medals, including 1500 metres gold medals at the Olympic Games in 1980 and 1984. He set nine outdoor and three indoor world records in middle-distance track events – including, in 1979, setting three world records in the space of 41 days – and the world record he set in the 800 metres in 1981 remained unbroken until 1997. Coe's rivalries with fellow Britons Steve Ovett and Steve Cram dominated middle-distance racing for much of the 1980s. Following Coe's retirement from athletics, he was a Conservative member of parliament from 1992 to 1997 for Falmouth and Camborne in Cornwall, and became a Life Peer on 16 May 2000. Coe headed the successful London 2012 Olympic bid for the 2012 Summer Olympics and became chairman of the London Organising Committee for the Olympic Games. In 2007, he was elected a vice-president of the International Association of Athletics Federations (IAAF), and re-elected for another four-year term in 2011. In August 2015, he was elected president of the IAAF.",
        "birthday": "1956-09-29",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1652427,
        "imdb_id": "nm1660012",
        "known_for_department": "Acting",
        "name": "Sebastian Coe",
        "place_of_birth": "Hammersmith, London, England, UK",
        "popularity": 0.0357,
        "profile_path": "/8iFsYacjXYNCfFPnX11f8MGJSeK.jpg"
    }
}