{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yQtFsAby716b8JMlGls9Suzs87z.jpg",
                "genre_ids": [
                    18
                ],
                "id": 1367,
                "original_language": "en",
                "original_title": "Rocky II",
                "overview": "After Rocky goes the distance with champ Apollo Creed, both try to put the fight behind them and move on. Rocky settles down with Adrian but can't put his life together outside the ring, while Creed seeks a rematch to restore his reputation. Soon enough, the \"Master of Disaster\" and the \"Italian Stallion\" are set on a collision course for a climactic battle that is brutal and unforgettable.",
                "popularity": 7.2533,
                "poster_path": "/nMaiiu0CzT77U4JZkUYV7KqdAjK.jpg",
                "release_date": "1979-06-15",
                "title": "Rocky II",
                "video": false,
                "vote_average": 7.282,
                "vote_count": 4583,
                "character": "Tony Gazzo",
                "credit_id": "52fe42efc3a36847f802e123",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/wC36tEU7AqP5llAvjXkZhZ248tX.jpg",
                "genre_ids": [
                    18
                ],
                "id": 1366,
                "original_language": "en",
                "original_title": "Rocky",
                "overview": "Rocky Balboa is a Philadelphia club fighter who seems to be going nowhere. But when a stroke of fate puts him in the ring with a world heavyweight champion, Rocky knows that it's his one shot at the big time — a once-in-a-lifetime opportunity to go the distance and come out a winner!",
                "popularity": 10.7773,
                "poster_path": "/8kEun6U9hTddM7NEfLLCGQKU2Mp.jpg",
                "release_date": "1976-11-20",
                "title": "Rocky",
                "video": false,
                "vote_average": 7.8,
                "vote_count": 8231,
                "character": "Tony Gazzo",
                "credit_id": "52fe42efc3a36847f802e031",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/g7prwSflNODkHZI6792MYoU4qoh.jpg",
                "genre_ids": [
                    53,
                    12,
                    18
                ],
                "id": 38985,
                "original_language": "en",
                "original_title": "Sorcerer",
                "overview": "Four men from different parts of the globe, all hiding from their pasts in the same remote South American town, agree to risk their lives transporting several cases of dynamite (which is so old that it is dripping unstable nitroglycerin) across dangerous jungle terrain.",
                "popularity": 3.0502,
                "poster_path": "/2b7oexm173SF1FSEq0DdgxZZNRH.jpg",
                "release_date": "1977-06-24",
                "title": "Sorcerer",
                "video": false,
                "vote_average": 7.441,
                "vote_count": 599,
                "character": "Spider",
                "credit_id": "52fe46f09251416c91064bdb",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/tmU7GeKVybMWFButWEGl2M4GeiP.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 238,
                "original_language": "en",
                "original_title": "The Godfather",
                "overview": "Spanning the years 1945 to 1955, a chronicle of the fictional Italian-American Corleone crime family. When organized crime family patriarch, Vito Corleone barely survives an attempt on his life, his youngest son, Michael steps in to take care of the would-be killers, launching a campaign of bloody revenge.",
                "popularity": 29.4604,
                "poster_path": "/3bhkrj58Vtu7enYsRolD1fZdja1.jpg",
                "release_date": "1972-03-14",
                "title": "The Godfather",
                "video": false,
                "vote_average": 8.7,
                "vote_count": 21834,
                "character": "Willi Cicci (uncredited)",
                "credit_id": "6489b12ee2726000e8c325be",
                "order": 55
            },
            {
                "adult": false,
                "backdrop_path": "/6aoyUbvu0419XLKLIMoH0TkEicH.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 103,
                "original_language": "en",
                "original_title": "Taxi Driver",
                "overview": "Suffering from insomnia, disturbed loner Travis Bickle takes a job as a New York City cabbie, haunting the streets nightly, growing increasingly detached from reality as he dreams of cleaning up the filthy city.",
                "popularity": 11.9039,
                "poster_path": "/ekstpH614fwDX8DUln1a2Opz0N8.jpg",
                "release_date": "1976-02-09",
                "title": "Taxi Driver",
                "video": false,
                "vote_average": 8.135,
                "vote_count": 12865,
                "character": "Personnel Officer",
                "credit_id": "633d33f28f26bc0082ebe637",
                "order": 32
            },
            {
                "adult": false,
                "backdrop_path": "/kGzFbGhp99zva6oZODW5atUtnqi.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 240,
                "original_language": "en",
                "original_title": "The Godfather Part II",
                "overview": "In the continuing saga of the Corleone crime family, a young Vito Corleone grows up in Sicily and in 1910s New York. In the 1950s, Michael Corleone attempts to expand the family business into Las Vegas, Hollywood and Cuba.",
                "popularity": 16.2247,
                "poster_path": "/hek3koDUyRQk7FIhPXsa6mT2Zc3.jpg",
                "release_date": "1974-12-20",
                "title": "The Godfather Part II",
                "video": false,
                "vote_average": 8.57,
                "vote_count": 13188,
                "character": "William 'Willie' Cicci",
                "credit_id": "55c0e566c3a3682379001ffb",
                "order": 22
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Joseph J. Spagnuolo",
            "Joseph Spagnuolo"
        ],
        "biography": "​Joe Spinell was born Joseph J. Spagnuolo in Manhattan, New York of Italian immigrant parents, and the last of six children. His father, Pelegrino Spagnuolo (b. 1892, d. 1950), died from liver and kidney disease. His mother Filomena Spagnuolo (b. 1903, d. 1987) was a bit-part actress who acted in a few movies, some of them alongside her son. Spinell stood 5 foot and 11 inches. He was born at his family's apartment in Manhattan's Little Italy on 2nd Avenue in Manhattan. A few years after the death of his father, he moved with his mother and older siblings to Woodside, Queens, New York where he lived off-and-on for the remainder of his life. Spinell suffered most of his life from hemophilia as well as chronic asthma. Because of his large, heavyset frame and imposing looks, Spinell was often cast as criminals, thugs, or corrupt police officers. His most notable roles were as mafioso Willi Cicci in The Godfather and The Godfather Part II, and as loan shark Tony Gazzo in Rocky and Rocky II. Although primarily known as a character actor, Spinell co-wrote and starred as a serial killer in the 1980 film, Maniac. Joe Spinell died in his apartment on January 13, 1989 at the age of 52. The cause of his untimely death is arguable to this day. Some say that his death was caused by sudden heart attack due to heavy drug use, drinking and emotional distress in light of his mother passing away two years earlier. It is also speculated that he may have died from asthma complications, or bled to death from hemophilia related causes. He was planning a sequel to Maniac before his death. He was buried in Calvary Cemetery, Queens near his home. He is the distant cousin of the American football team St. Louis Ram's Head Coach Steve Spagnuolo. Spinell was married to adult film star Jean Jennings from February 1977 to July 1979. Together they had one daughter, but they eventually divorced.",
        "birthday": "1936-10-28",
        "deathday": "1989-01-13",
        "gender": 2,
        "homepage": null,
        "id": 16525,
        "imdb_id": "nm0818874",
        "known_for_department": "Acting",
        "name": "Joe Spinell",
        "place_of_birth": "Manhattan, New York",
        "popularity": 0.5548,
        "profile_path": "/jiok99ZvHDOj51BBgio2qvum0Mb.jpg"
    }
}