{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fzZmcKQv7ZTGIiPvocPhNs3wUyK.jpg",
                "genre_ids": [
                    18,
                    10749,
                    14
                ],
                "id": 122906,
                "original_language": "en",
                "original_title": "About Time",
                "overview": "The night after another unsatisfactory New Year's party, Tim's father tells his son that the men in his family have always had the ability to travel through time. They can't change history, but they can change what happens and has happened in their own lives. Thus begins the start of a lesson in learning to appreciate life itself as it is, as it comes, and most importantly, the people living alongside us.",
                "popularity": 7.7462,
                "poster_path": "/iR1bVfURbN7r1C46WHFbwCkVve.jpg",
                "release_date": "2013-09-04",
                "title": "About Time",
                "video": false,
                "vote_average": 7.913,
                "vote_count": 8873,
                "character": "Trudy (Party Guest)",
                "credit_id": "578e974bc3a3680733000a97",
                "order": 36
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Molly joined BBC Studios Comedy Productions in 2024 as Creative Director and Produced a pilot called Break Clause written by Jess Bray and Directed by Alice Snedden for Ch4. Prior to this Molly launched the UK arm of Jax Media. Molly developed and produced Dillon Mapletoft and Oliver Taylor's Everyone Else Burns for Jax Media UK and Universal International Studios, launching to critical acclaim on Ch4 and the CW in America. Since the start of Jax UK in 2019, Molly also produced a short-form series called Peck'Eds with writer/performer Soph Galustian for BBC Three. Previously Molly was in development at Baby Cow (co-founded by Steve Coogan). Before Baby Cow, Molly was assistant producer to (writer/director) Richard Curtis across Red Nose Day UK and USA as well as assisting on films About Time and Esio Trot.",
        "birthday": "1983-08-01",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1653299,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Molly Seymour",
        "place_of_birth": "Liverpool, Merseyside, England, UK",
        "popularity": 0.0569,
        "profile_path": null
    }
}