{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/55C8p02S7fLXHT8zlRjAA0j14bd.jpg",
                "genre_ids": [
                    37,
                    80,
                    18
                ],
                "id": 338766,
                "original_language": "en",
                "original_title": "Hell or High Water",
                "overview": "A divorced dad and his ex-con brother resort to a desperate scheme in order to save their family's farm in West Texas.",
                "popularity": 3.7631,
                "poster_path": "/ljRRxqy2aXIkIBXLmOVifcOR021.jpg",
                "release_date": "2016-08-11",
                "title": "Hell or High Water",
                "video": false,
                "vote_average": 7.302,
                "vote_count": 4638,
                "character": "Trooper Bruno (uncredited)",
                "credit_id": "5790e3e59251416b280020f8",
                "order": 43
            },
            {
                "adult": false,
                "backdrop_path": "/5SGAJrTVpWXKNdEwspTG9s60YOp.jpg",
                "genre_ids": [
                    10749,
                    12,
                    878,
                    18
                ],
                "id": 365942,
                "original_language": "en",
                "original_title": "The Space Between Us",
                "overview": "A young man raised by scientists on Mars returns to Earth to find his father.",
                "popularity": 2.3019,
                "poster_path": "/lRBl9mfvUbZeaAyXoP09XwPOo0W.jpg",
                "release_date": "2017-01-26",
                "title": "The Space Between Us",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 2495,
                "character": "Dr. Cox (uncredited)",
                "credit_id": "57c0e521c3a3684b23001b32",
                "order": 49
            },
            {
                "adult": false,
                "backdrop_path": "/9j3gGPnnsBGXaj6FgN2wS8zsOFP.jpg",
                "genre_ids": [
                    80,
                    18,
                    53
                ],
                "id": 339692,
                "original_language": "en",
                "original_title": "Shot Caller",
                "overview": "A newly-released prison gangster is forced by the leaders of his gang to orchestrate a major crime with a brutal rival gang on the streets of Southern California.",
                "popularity": 5.8314,
                "poster_path": "/qLmLz2wtyYvmW8Ult3l2ngOnW8v.jpg",
                "release_date": "2017-07-07",
                "title": "Shot Caller",
                "video": false,
                "vote_average": 6.961,
                "vote_count": 2126,
                "character": "Doyle",
                "credit_id": "59b15168925141076508a845",
                "order": 22
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Danny Winn has shown himself to be quite the versatile and instinctual actor with many faces. Not only in Hollywood but nationally and soon internationally. He brings his theatrical prowess to the big screen in two breakout movies this spring. Danny will first be seen this March in his Lead role of the hard to figure Paul, a Priest who struggles with his own inner Demon’s in the suspense thriller “The Crossbreed”. A film Directed by the well known Turkish director Biray Dalkiran. This is Dalkiran’s ninth feature film, and is his first debut movie to Hollywood and the US. The Crossbreed received several awards at the many LA film festivals and is released internationally. Danny Winn’s second movie release this spring will be in the period western “Hyde Park” under the direction of Nicholas Barton. Barton is known for his love of true western stories of the untold, and his meticulous nature to authenticity of the story. Danny will open the movie and appear in his strong supporting role as Happy Jim. A Faro dealer who is truly caught in the crossfire of love, jealousy, arrogance, and the old west struggle of survival and control. Danny’s role as Happy Jim takes his method to new heights as he plays basically two characters in one. Viewers will also be able to witness Winn’s learned talents and skills in card dealing which he studied specifically for this role. Danny even developed a signature card move for this film known as the Faro flip. One must watch closely too, as Winn performs his own stunts in Hyde Park. Danny Winn performs along side the likes of C Thomas Howell, Luke Arnold, Viva Bianca, Richard Riehle, MC Gainey and more.  Winn states that his believability, and instinctual method are drawn from his many true life experiences. He taps into a wide range of learned emotion form many memories out of his inner self and combines them with how he feels the character to be on the outside. Danny’s belief is that the true magic happens at the action of the scene when filming  “The character will truly shine instinctually in the moment without over processing.” His adaptability as well as accessibility to emotions derives from the many people, characters and experiences he discovered while moving about the many stations of his fathers military duty spanning 21 years.  Danny was trained in the degree of \"Fine Arts In Theatre\" . He attained several Supporting, Guest Star and Co Star roles in series' such as NBC's \"The Night Shift\", AMC's \"Longmire\", \"Graves” as well as WGN's \"Manhattan\". Danny also expanded to small stunt and stunt coordinator roles in various capacities on productions such as AMC;s \"Preacher\", the movie \"Shot Collar\", \"The cost of Sin\", and as a horse rider in the remake of \"The Magnificent 7\".  One of Winn’s first feature film roles was in the movie “Gold”  in his scene with Mathew McConaughey. Danny performs as a disgruntled investor who is ready to throw blows with McConaughey’s character. Gold was released in 2017.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1654004,
        "imdb_id": "nm7377921",
        "known_for_department": "Acting",
        "name": "Danny Winn",
        "place_of_birth": null,
        "popularity": 0.0882,
        "profile_path": "/gamfUfnq5p565WxBC2Yv2b3WrcN.jpg"
    }
}