{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cy7ymUaMEWRoig7LWXpfzaaw2vv.jpg",
                "genre_ids": [
                    18
                ],
                "id": 147,
                "original_language": "fr",
                "original_title": "Les Quatre Cents Coups",
                "overview": "For young Parisian boy Antoine Doinel, life is one difficult situation after another. Surrounded by inconsiderate adults, including his neglectful parents, Antoine spends his days with his best friend, Rene, trying to plan for a better life. When one of their schemes goes awry, Antoine ends up in trouble with the law, leading to even more conflicts with unsympathetic authority figures.",
                "popularity": 3.1065,
                "poster_path": "/12PuU23kkDLvTd0nb8hMlE3oShB.jpg",
                "release_date": "1959-06-03",
                "title": "The 400 Blows",
                "video": false,
                "vote_average": 8.024,
                "vote_count": 2226,
                "character": "Gilberte Doinel",
                "credit_id": "52fe421ec3a36847f8005665",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/6n53UI4mX9QMfe2S0Pgt8mGebY1.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 194,
                "original_language": "fr",
                "original_title": "Le Fabuleux Destin d'Amélie Poulain",
                "overview": "At a tiny Parisian café, the adorable yet painfully shy Amélie accidentally discovers a gift for helping others. Soon Amelie is spending her days as a matchmaker, guardian angel, and all-around do-gooder. But when she bumps into a handsome stranger, will she find the courage to become the star of her very own love story?",
                "popularity": 9.2209,
                "poster_path": "/nSxDa3M9aMvGVLoItzWTepQ5h5d.jpg",
                "release_date": "2001-04-25",
                "title": "Amélie",
                "video": false,
                "vote_average": 7.913,
                "vote_count": 11932,
                "character": "Suzanne",
                "credit_id": "52fe4225c3a36847f80077b3",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Odette-Michelle-Suzanne Agramon"
        ],
        "biography": "Claire Maurier (born Odette-Michelle-Suzanne Agramon; March 27, 1929) is a French actress who has appeared in more than 90 films since 1947.\n\nMaurier was born Odette-Michelle-Suzanne Agramon on March 27, 1929 in the French commune of Céret, in the Pyrénées-Orientales region, which is in the southwest of France.\n\nShe started her acting career in small film roles at the end of the 1940s. Her first 'main' role came when she portrayed Gilberte Doinel, the mother of the main character in François Truffaut's 1959 film The 400 Blows. Another notable early role of hers was as Christiane Colombey, the bigamist wife of the main character in the 1963 film La Cuisine au beurre.\n\nIn 1978, she had a notable role in Édouard Molinaro's film La Cage aux Folles as Simone. In 1981, she was nominated the César Award for Best Actress in a Supporting Role for A Bad Son. She played Madeleine, a seductive older woman.\n\nIn 2001, she gained international recognition when she starred as Mme. Suzanne, the owner of the Café des 2 Moulins, the Montmartre bistro where the titular character Amélie Poulain works as a waitress in Jean-Pierre Jeunet's Amélie (Le Fabuleux Destin d'Amélie Poulain). The film became the highest-grossing French-language film released in the United States. The film won four César Awards, and was nominated for five Academy Awards. In 2005, she starred as Maryse Berthelot in the French comedy series Faites comme chez vous!.\n\nIn 2010, she played the neglectful mother of Gérard Dépardieu's character Germain in Jean Becker's film My Afternoons with Margueritte.\n\nSource: Article \"Claire Maurier\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1929-03-27",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1654,
        "imdb_id": "nm0561158",
        "known_for_department": "Acting",
        "name": "Claire Maurier",
        "place_of_birth": "Ceret, Pyrénées-Orientales, France",
        "popularity": 0.3166,
        "profile_path": "/rlMYKpiTIzZCw2ee3YGENJZQKPC.jpg"
    }
}