{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4i3Amppd6eW5Qkhjv4gdHk3CCoE.jpg",
                "genre_ids": [
                    36,
                    10402,
                    18
                ],
                "id": 279,
                "original_language": "en",
                "original_title": "Amadeus",
                "overview": "Disciplined Italian composer Antonio Salieri becomes consumed by jealousy and resentment towards the hedonistic and remarkably talented young Salzburger composer Wolfgang Amadeus Mozart.",
                "popularity": 5.9174,
                "poster_path": "/1n5VUlCqgmVax1adxGZm8oCFaKc.jpg",
                "release_date": "1984-09-19",
                "title": "Amadeus",
                "video": false,
                "vote_average": 8.026,
                "vote_count": 4488,
                "character": "Marcellina in 'The Marriage of Figaro' (singing voice)",
                "credit_id": "6679703d1dcafc0691f4e14f",
                "order": 41
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Patricia Katherine Payne ONZM (born 8 March 1942) is an operatic mezzo-soprano and contralto from New Zealand. A member of London's Royal Opera House, she made an international career, performing leading roles of both Wagner and Italian repertory at major opera houses of the world. After decades of singing, she became a visual artist.  Born in Dunedin, Payne was educated at Otago Girls' High School. After winning the National Operatic Aria Competition in 1966, she continued her studies in London. She was a student at the London Opera Centre from 1967 to 1968, and also studied with Roy Henderson, Hans Hotter and Vera Rózsa. After mainly working in oratorios from 1969, she made her stage debut at the Royal Opera House in 1974 as Schwertleite in Wagner's Die Walküre, and became a member of the ensemble. She appeared there as Erda in his Das Rheingold and Siegfried, and the First Norn in his Götterdämmerung, among others. She was Geneviève in Debussy's Pelléas et Mélisande, Ulrica in Verdi's Un ballo in maschera, and Mrs Sedley in Britten's Peter Grimes. In 1976 she was a \"huge success\" as Filpyevna in the Royal Opera House, Covent Garden, production of Tchaikovsky’s Eugene Onegin.\n\nShe appeared at the Bayreuth Festival in 1977, as Schwertleite and First Norn in the Jahrhundertring, the centenary production of Wagner's Der Ring des Nibelungen, conducted by Pierre Boulez and staged by Patrice Chéreau. She made her debut at the Metropolitan Opera in 1980, as Cieca in Ponchielli's La Gioconda. In 1978, she appeared at La Scala in Milan as Ulrica, a role that has been called her signature role. She performed at the Opera North in Leeds in 1987 in the English premiere of Daphne by Richard Strauss, singing the role of Gaea. In 1995, she appeared at the Tel Aviv Opera as Clarissa in Prokofiev's L'Amour des trois oranges, and as Auntie in the first performance of Britten's Peter Grimes in New Zealand.",
        "birthday": "1942-03-08",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1657741,
        "imdb_id": "nm5831538",
        "known_for_department": "Acting",
        "name": "Patricia Payne",
        "place_of_birth": "Dunedin, New Zealand",
        "popularity": 0.0214,
        "profile_path": null
    }
}