{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7e9uENnSM93CQXyzLSuzBUgxm4P.jpg",
                "genre_ids": [
                    99,
                    10402
                ],
                "id": 164558,
                "original_language": "en",
                "original_title": "One Direction: This Is Us",
                "overview": "\"One Direction: This Is Us\" is a captivating and intimate all-access look at life on the road for the global music phenomenon. Weaved with stunning live concert footage, this inspiring feature film tells the remarkable story of Niall, Zayn, Liam, Harry and Louis' meteoric rise to fame, from their humble hometown beginnings and competing on the X-Factor, to conquering the world and performing at London’s famed O2 Arena. Hear it from the boys themselves and see through their own eyes what it's really like to be One Direction.",
                "popularity": 1.2147,
                "poster_path": "/b720e7DW3nqRJaUH9xpTtvYhnUj.jpg",
                "release_date": "2013-08-28",
                "title": "One Direction: This Is Us",
                "video": false,
                "vote_average": 8.254,
                "vote_count": 1053,
                "character": "Self",
                "credit_id": "5aaf515392514116b1031e6a",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/sJjuXNHNT7PfzcgkqM3oSIkVOXB.jpg",
                "genre_ids": [
                    16,
                    35,
                    10751,
                    9648
                ],
                "id": 385103,
                "original_language": "en",
                "original_title": "Scoob!",
                "overview": "In Scooby-Doo’s greatest adventure yet, see the never-before told story of how lifelong friends Scooby and Shaggy first met and how they joined forces with young detectives Fred, Velma, and Daphne to form the famous Mystery Inc. Now, with hundreds of cases solved, Scooby and the gang face their biggest, toughest mystery ever: an evil plot to unleash the ghost dog Cerberus upon the world. As they race to stop this global “dogpocalypse,” the gang discovers that Scooby has a secret legacy and an epic destiny greater than anyone ever imagined.",
                "popularity": 4.7776,
                "poster_path": "/jHo2M1OiH9Re33jYtUQdfzPeUkx.jpg",
                "release_date": "2020-07-08",
                "title": "Scoob!",
                "video": false,
                "vote_average": 7.009,
                "vote_count": 1752,
                "character": "Simon Cowell (voice)",
                "credit_id": "5ebecb829979d2001f2abd96",
                "order": 14
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/7e9uENnSM93CQXyzLSuzBUgxm4P.jpg",
                "genre_ids": [
                    99,
                    10402
                ],
                "id": 164558,
                "original_language": "en",
                "original_title": "One Direction: This Is Us",
                "overview": "\"One Direction: This Is Us\" is a captivating and intimate all-access look at life on the road for the global music phenomenon. Weaved with stunning live concert footage, this inspiring feature film tells the remarkable story of Niall, Zayn, Liam, Harry and Louis' meteoric rise to fame, from their humble hometown beginnings and competing on the X-Factor, to conquering the world and performing at London’s famed O2 Arena. Hear it from the boys themselves and see through their own eyes what it's really like to be One Direction.",
                "popularity": 1.2147,
                "poster_path": "/b720e7DW3nqRJaUH9xpTtvYhnUj.jpg",
                "release_date": "2013-08-28",
                "title": "One Direction: This Is Us",
                "video": false,
                "vote_average": 8.254,
                "vote_count": 1053,
                "credit_id": "52fe4c7bc3a36847f8230999",
                "department": "Production",
                "job": "Producer"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Simon Phillip Cowell (born 7 October 1959) is an English television personality, entrepreneur and record executive. He is the founder and sole owner of the British entertainment company Syco and is the creator of the X Factor and Got Talent franchises. He has judged on the British television talent competition shows Pop Idol (2001–2003), The X Factor UK (2004–2010, 2014–2018) and Britain's Got Talent (2007–present), and the American television talent competition shows American Idol (2002–2010), The X Factor US (2011–2013) and America's Got Talent (2016–present).\n\nAfter some success in the 1980s and 1990s as a record producer, talent agent and consultant in the UK music industry, Cowell came to public prominence in 2001 as a judge on Pop Idol, a talent television show which he and its creator Simon Fuller successfully pitched to ITV Controller of Entertainment Claudia Rosencrantz. He subsequently created The X Factor in 2004 and Got Talent in 2006, which have become successful television franchises sold around the world.\n\nCowell often makes blunt and controversial comments as a television music and talent show judge, including insults and wisecracks about contestants and their singing abilities. He combines activities in both the television and music industries. Cowell has produced and promoted successful singles and albums for various recording acts whom he has signed and taken under his wing, including Little Mix, James Arthur, Labrinth, Leona Lewis, Fifth Harmony, Il Divo, Olly Murs, Noah Cyrus, Cher Lloyd, Fleur East, Ella Henderson, and Susan Boyle. He has also signed successful boy bands such as Westlife, One Direction, PrettyMuch, and CNCO.\n\nIn 2004 and 2010, Time named Cowell one of the 100 most influential people in the world. In 2008, The Daily Telegraph ranked him sixth in their list of the \"100 most powerful people in British culture\".The same year, he received the Special Recognition Award at the National Television Awards.At the 2010 British Academy Television Awards, Cowell received the BAFTA Special Award for his \"outstanding contribution to the entertainment industry and for his development of new talent\". In 2018, he received a star on the Hollywood Walk of Fame in the television category.\n\nDescription above from the Wikipedia article Simon Phillip Cowell, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1959-10-07",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 165899,
        "imdb_id": "nm1101562",
        "known_for_department": "Acting",
        "name": "Simon Cowell",
        "place_of_birth": "Lambeth, London, England, UK",
        "popularity": 0.5703,
        "profile_path": "/My1ntuj7FdrO1rnJW4FKGesRRp.jpg"
    }
}