{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8nh70OvIsJKpfZdTMZoMJMb8aVE.jpg",
                "genre_ids": [
                    18
                ],
                "id": 392982,
                "original_language": "en",
                "original_title": "Marshall",
                "overview": "Thurgood Marshall, the first African-American Supreme Court Justice, battles through one of his career-defining cases.",
                "popularity": 2.7224,
                "poster_path": "/2KfdXsXTCbMie0wB1mSmIX60C2F.jpg",
                "release_date": "2017-10-13",
                "title": "Marshall",
                "video": false,
                "vote_average": 7.25,
                "vote_count": 642,
                "character": "Minton's Singer",
                "credit_id": "5a7e8dc392514140f8005513",
                "order": 26
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Cassandra Monique Batie (born December 30, 1984), known professionally as Andra Day, is an American R&B and soul singer, songwriter, and actress. She is the recipient of various accolades, including a Grammy Award, a Children's and Family Emmy Award, and a Golden Globe Award, along with nomination for an Academy Award.\n\nIn 2015, she released her debut album, Cheers to the Fall. At the 2016 Grammy Awards, the album was nominated for Best R&B Album and the single, \"Rise Up\", was nominated for Best R&B Performance. To promote \"Rise Up\", she performed the song on The View, earning a Daytime Emmy Award nomination for the performance. Day also appeared alongside Stevie Wonder, who is partially credited for her discovery, in an ad for Apple TV in late 2015. In 2020, Day became one of the most-requested artists among Jazz Joy and Roy Global Radio listeners.\n\nIn 2021, Day made her acting debut with her portrayal of Billie Holiday in Lee Daniels' biopic The United States vs. Billie Holiday, winning the Golden Globe Award for Best Actress in a Motion Picture – Drama, and received a nomination for the Academy Award for Best Actress. Day received the Grammy Award for Best Compilation Soundtrack for Visual Media for the film's accompanying soundtrack.\n\nDescription above from the Wikipedia article Andra Day, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1984-12-30",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.andraday.com/",
        "id": 1658802,
        "imdb_id": "nm7363531",
        "known_for_department": "Acting",
        "name": "Andra Day",
        "place_of_birth": "Spokane, Washington, USA",
        "popularity": 0.5163,
        "profile_path": "/54zMzFLxL5AKnDR9AlsZLl9VhaG.jpg"
    }
}