{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/i4Fp0AJsqAzbeVQyCoG0adRRfdh.jpg",
                "genre_ids": [
                    28,
                    53
                ],
                "id": 11474,
                "original_language": "en",
                "original_title": "The Warriors",
                "overview": "Prominent gang leader Cyrus calls a meeting of New York's gangs to set aside their turf wars and take over the city. At the meeting, a rival leader kills Cyrus, but a Coney Island gang called the Warriors is wrongly blamed for Cyrus' death. Before you know it, the cops and every gangbanger in town is hot on the Warriors' trail.",
                "popularity": 3.4154,
                "poster_path": "/fCDXAJcPvpsMd5CL1kBKkkNGW3X.jpg",
                "release_date": "1979-02-01",
                "title": "The Warriors",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 2251,
                "character": "Vermin",
                "credit_id": "579a4472c3a3682d4f006451",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Terence Michos"
        ],
        "biography": "In his earlier years Terence (Terry) Michos enjoyed a successful Broadway, film, and television acting career that included lead roles in \"Grease\" both on Broadway and the national touring company, Paramount Pictures' \"The Warriors\", a CBS Movie of the Week, \"The Great Skycopter Rescue,\" the Universal Pictures/CBS miniseries \"The Contender\", and various guest starring roles in television series such as \"McClain's Law,\" \"Simon and Simon,\" and \"Romeo and Juliet\" for Public Television.\n\nAfter working as an actor Terence made his mark in the field of communications where he served as Communications Director for US Congresswoman Nan Hayworth's Washington DC and district operations.\n\nBefore his position with Congresswoman Hayworth, Terence served for sixteen years as Nnews director and news anchor for NewsCenter 6 and Cablevision News of the Hudson Valley. During that time he helped lead those news operations to a New England Cable Television Award (NECTA), nine Cable Ace nominations, the first ever Associated Press nomination for best local news in New York State, and anchored a public affairs political show that was seen throughout seven counties in Hudson Valley, much of Connecticut, the Bronx, and Brooklyn and was shown on a variety of cable outlets including C-Span and C-Span 2.\n\nTerence and his wife Carmen live in Poughkeepsie, New York, and are the parents of four grown children.",
        "birthday": "1953-12-26",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1658018,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Terry Michos",
        "place_of_birth": "Poughkeepsie, New York, USA",
        "popularity": 0.0596,
        "profile_path": "/8pRxlnpMKMvMzRpUgMIlXBNBt7a.jpg"
    }
}