{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/o7JVhqMmrex1TPbmuxl8YXVlcfl.jpg",
                "genre_ids": [
                    28,
                    35,
                    14
                ],
                "id": 287947,
                "original_language": "en",
                "original_title": "Shazam!",
                "overview": "A boy is given the ability to become an adult superhero in times of need with a single magic word.",
                "popularity": 6.2104,
                "poster_path": "/xnopI5Xtky18MPhK40cZAGAOVeV.jpg",
                "release_date": "2019-03-29",
                "title": "Shazam!",
                "video": false,
                "vote_average": 6.988,
                "vote_count": 9869,
                "character": "Ms. E.B. Glover",
                "credit_id": "5a95e2340e0a262efb0076fc",
                "order": 27
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Andi was born in Stratford, East London and attended Sarah Bonnell Comprehensive School. She studied drama at Barking College of Technology where peers included Razaaq Adoti (Amistad (1997), Black Hawk Down (2001)), Sarah Webb, lead singer of acid jazz group D Influence and Idris Elba (Pacific Rim (2013), The Wire (2002)).\n\nShe later went on to study TV production at Ravensbourne College of Design after which she took several roles at TV post production companies. Andi also worked in TV broadcasting at Walt Disney Television International and was the technical ops manager at new media start up, Where-It's-At. After working as a post production supervisor on ITV soap Night & Day (2001) Andi retrained as an actor at The Academy Drama School in London. She made her stage debut in 2003 and went on to appear at several renowned fringe and off-West End venues including The Arts Theatre, Riverside Studios, Kings Head and Liverpool Everyman.\n\n2005 saw her \"powerful\" (Time Out) performance in Medea and as jazz singer, Dolly Rathebe in Who Killed Mr Drum? Andi ended the year with a No. 1 tour of Dael Orlandersmith's Pulitzer nominated play, Yellowman which received critical praise.\n\nAndi's TV debut was in long-running BBC soap EastEnders (1985).\n\nIn 2007 Andi began performing stand up comedy and in July of that year won the coveted Funny Women award at London's Comedy Store. She went on to be runner up at Hackney Empire New Act of The Year and Leicester Mercury Comedian of The Year. This launched a successful television career which saw Andi make regular appearances on popular panel shows including Mock the Week (2005) and Never Mind the Buzzcocks (1996). She has also made two appearances on Jack Dee Live at the Apollo (2004) as well as three sell out tours of her solo stand up shows, All The Single Ladies and Afroblighty.\n\nShe performed live, in front of a 15,000 strong audience at London's O2 arena for the Channel 4 Great Ormond Street Comedy Gala.\n\nShe made her feature debut in Swinging with the Finkels (2011) opposite Sherlock (2010) and The Hobbit: An Unexpected Journey (2012) star Martin Freeman.\n\nAndi is an accomplished writer (The One Lenny (2011) and Stand Up for the Week (2010) (in which she also appeared). Andi is also developing her own film and television projects.\n\nShe has written for Fox US and BBC TV and Radio and for several newspapers including The Times and The I and is a regular blogger.\n\nIn 2014 Andi wrote and produced Brit.i.am (2014), a crowd-sourced short film about Britishness which went on to win three awards and was officially selected for ten festivals. She recently completed her second short, The Grid (2015), a sci thriller starring newcomer Stony Blyden and Eastenders alumni Troy Titus-Adams.",
        "birthday": "1973-01-27",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.andiosho.co.uk/",
        "id": 1659211,
        "imdb_id": "nm1450877",
        "known_for_department": "Acting",
        "name": "Andi Osho",
        "place_of_birth": "Plaistow, London, England, UK",
        "popularity": 0.4173,
        "profile_path": "/z5m18lhx3uJXfxycSzKGdoGeswv.jpg"
    }
}