{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hGr0FrLI74vqpBWTBOPloDBwOAK.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 705861,
                "original_language": "en",
                "original_title": "Hustle",
                "overview": "After discovering a once-in-a-lifetime player with a rocky past abroad, a down on his luck basketball scout takes it upon himself to bring the phenom to the States without his team's approval. Against the odds, they have one final shot to prove they have what it takes to make it in the NBA.",
                "popularity": 4.9115,
                "poster_path": "/xWic7kPq13oRxYjbGLApXCnc7pz.jpg",
                "release_date": "2022-06-03",
                "title": "Hustle",
                "video": false,
                "vote_average": 7.728,
                "vote_count": 2677,
                "character": "Dan Patrick",
                "credit_id": "62d2aa5d91745b004cba6dca",
                "order": 56
            },
            {
                "adult": false,
                "backdrop_path": "/g5haoqEqt5VwVwQKEkoXY9zqSxb.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 232672,
                "original_language": "en",
                "original_title": "Blended",
                "overview": "Recently divorced mom Lauren and widowed dad Jim let their friends push them into a blind date, which goes disastrously wrong. Unsurprisingly, neither wants to see the other ever again. However, fate intervenes when both Jim and Lauren, unbeknownst to each other, purchase one-half of the same vacation package at a South African resort for families, during spring break. They and their children are forced to share the same romantic suite and participate in a slew of family activities together.",
                "popularity": 8.8149,
                "poster_path": "/o2YrH9jS7CAfWjETHFeL0tth79E.jpg",
                "release_date": "2014-05-21",
                "title": "Blended",
                "video": false,
                "vote_average": 6.892,
                "vote_count": 3667,
                "character": "Dick",
                "credit_id": "54e3e0b99251411953009f3e",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Daniel Patrick Pugh (born May 15, 1956), known professionally as Dan Patrick, is an American sportscaster, radio personality, and actor from Mason, Ohio. He hosts The Dan Patrick Show broadcast on radio on Premiere Radio Networks and streaming on Peacock. He co-hosted NBC's Football Night in America and serves as a senior writer for Sports Illustrated. He worked at ESPN for 18 years, where he often anchored the weeknight and Sunday 11 p.m. edition of SportsCenter.\n\nBefore working with ESPN, Patrick was known by his surname, \"Dan Pugh\", as an on-air personality with the album rock-formatted WVUD and then, WTUE in Dayton, Ohio (1979–1983). Patrick was then a sports reporter for CNN (1983–89), where his assignments included the World Series, NBA Finals and Winter Olympics. From 1989–1995, Patrick did a daily sports segment for Bob and Brian, a syndicated Wisconsin-area morning show, and in the early 1990s, he did sports updates for the Columbus, Ohio, Rock Station WLVQ and appeared on the morning show \"Wags and Elliot.\"",
        "birthday": "1956-05-15",
        "deathday": null,
        "gender": 2,
        "homepage": "https://danpatrick.com",
        "id": 166029,
        "imdb_id": "nm0665830",
        "known_for_department": "Acting",
        "name": "Dan Patrick",
        "place_of_birth": "Zanesville, Ohio, USA",
        "popularity": 0.233,
        "profile_path": "/A4G9dtCuma1yR9QAkhqSyGZsDvr.jpg"
    }
}