{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/77Fqz6PFCSnWySDOmEL6ZPcaYIl.jpg",
                "genre_ids": [
                    10749,
                    35
                ],
                "id": 1014590,
                "original_language": "en",
                "original_title": "Upgraded",
                "overview": "Ana is an ambitious intern dreaming of a career in the art world while trying to impress her demanding boss Claire. When she's upgraded to first class on a work trip, she meets handsome Will, and Ana pretends to be her boss– a white lie that sets off a glamorous chain of events, romance and opportunity, until her fib threatens to surface.",
                "popularity": 7.7147,
                "poster_path": "/uhOXS17gRpTwA85WsZLlYFK3rz0.jpg",
                "release_date": "2024-02-07",
                "title": "Upgraded",
                "video": false,
                "vote_average": 7.205,
                "vote_count": 929,
                "character": "Amy",
                "credit_id": "635c05dd0f52650081fb9ef2",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Saoirse Jackson",
            "Σίρσα-Μόνικα Τζάκσον"
        ],
        "biography": "Saoirse-Monica Jackson is a Northern Irish actress. She portrayed Erin Quinn on the Channel 4 Irish sitcom Derry Girls from 2018 to 2022 and Cheryl Crawford in the BBC Liverpool gangster series This City Is Ours (2025).\n\nJackson was born in Derry, Northern Ireland, on 24 November 1993. She split her time growing up in Derry and Greencastle, County Donegal, where her parents ran a village pub. After obtaining GCSEs and A-Levels at St Cecilia's College in Derry, she trained in acting at the Arden School of Theatre in Manchester\n\nJackson's television debut came in 2016 when she landed the role of Sasha in Harlan Coben's The Five, appearing in four episodes. In 2016, she also played Curley's wife in the Birmingham Repertory Theatre tour of John Steinbeck's Of Mice and Men. She appeared briefly in the final episode of 2017 BBC One drama series Broken. In 2018, she portrayed Shena Carney in a West End production of The Ferryman at the Gielgud Theatre.\n\nJackson made her debut as Erin Quinn in the Channel 4 sitcom Derry Girls in the show's first episode, airing on Channel 4 on 4 January 2018.  Her performance saw her nominated for the IFTA Gala Television Award for Best Female Performance. She portrayed the role for three seasons until the conclusion of the series in May 2022.\n\nShe appeared in an episode of The Great British Bake Off: Festive Specials.\n\nOn 26 June 2020, she and her fellow Derry Girls co stars performed a sketch with Saoirse Ronan for the RTÉ fundraising special RTÉ Does Comic Relief. All proceeds from the night went towards those affected by the COVID-19 pandemic.\n\nIn 2025, she played the role of Cheryl Crawford, wife of Davey Crawford (portrayed by Stephen Walters), in the BBC One Liverpool-based gangster television series, This City Is Ours (2025)",
        "birthday": "1993-11-24",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.independenttalent.com/actors/saoirse-monica-jackson/",
        "id": 1660888,
        "imdb_id": "nm8090765",
        "known_for_department": "Acting",
        "name": "Saoirse-Monica Jackson",
        "place_of_birth": "Derry, Northern Ireland, UK",
        "popularity": 0.4882,
        "profile_path": "/5CSLLbQS59BlUPOqaxABQKfnnkz.jpg"
    }
}