{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/n92EzFFg2cMkJiEhnMfD5sKHSH3.jpg",
                "genre_ids": [
                    16,
                    10751,
                    10402
                ],
                "id": 49948,
                "original_language": "en",
                "original_title": "Fantasia 2000",
                "overview": "Blending lively music and brilliant animation, this sequel to the original 'Fantasia' restores 'The Sorcerer's Apprentice' and adds seven new shorts.",
                "popularity": 2.6135,
                "poster_path": "/5rwAtUaKEK48CPUijVfVU0IPKPZ.jpg",
                "release_date": "2000-01-01",
                "title": "Fantasia 2000",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 1324,
                "character": "Self - Host",
                "credit_id": "547f6942925141239b00026d",
                "order": 1
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/zb6fM1CX41D9rF9hdgclu0peUmy.jpg",
                "genre_ids": [
                    18,
                    36,
                    10752
                ],
                "id": 424,
                "original_language": "en",
                "original_title": "Schindler's List",
                "overview": "The true story of how businessman Oskar Schindler saved over a thousand Jewish lives from the Nazis while they worked as slaves in his factory during World War II.",
                "popularity": 13.4879,
                "poster_path": "/sF1U4EUQS8YHUYjNl3pMGNIQyr0.jpg",
                "release_date": "1993-12-15",
                "title": "Schindler's List",
                "video": false,
                "vote_average": 8.566,
                "vote_count": 16722,
                "credit_id": "5ff3790fe263bb00410db5f5",
                "department": "Sound",
                "job": "Musician"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Itzhak Perlman (Hebrew: יצחק פרלמן; born August 31, 1945) is an Israeli-American violinist, conductor, and music teacher. Perlman has performed worldwide, and throughout the United States, in venues that have included a State Dinner at the White House honoring Queen Elizabeth II, and at President Barack Obama's inauguration. He has conducted the Detroit Symphony Orchestra, the Philadelphia Orchestra, and the Westchester Philharmonic. In 2015, he was awarded the Presidential Medal of Freedom. He has received 16 Grammy Awards, including a Grammy Lifetime Achievement Award, and four Emmy Awards.\n\nPerlman was born in 1945 in Tel Aviv. His parents, Chaim and Shoshana Perlman, were Jewish natives of Poland and had independently emigrated to the British Mandate of Palestine (now Israel) in the mid-1930s before they met and later married. Perlman contracted polio at age four and has walked using leg braces and crutches since then and plays the violin while seated. As of 2018, he uses crutches or an electric Amigo scooter for mobility.\n\nPerlman first became interested in the violin after hearing a classical music performance on the radio. At the age of three, he was denied admission to the Shulamit Conservatory for being too small to hold a violin. He instead taught himself how to play the instrument using a toy fiddle until he was old enough to study with Rivka Goldgart at the Shulamit Conservatory and at the Academy of Music in Tel Aviv (now the Buchmann-Mehta School of Music), where he gave his first recital at age 10. He moved to the U.S. at age 13 to study at the Juilliard School with the violin teacher Ivan Galamian and his assistant Dorothy DeLay.\n\nPerlman appeared on The Ed Sullivan Show twice in 1958, and again in 1964, on the same show with the Rolling Stones. He made his debut at Carnegie Hall in 1963 and won the Leventritt Competition in 1964. Soon afterward, he began to tour widely. In addition to an extensive recording and performance career, he has continued to make appearances on television shows such as The Tonight Show and Sesame Street as well as playing at a number of White House functions.\n\nAlthough Perlman has never been billed or marketed as a singer, he sang the role of \"Un carceriere\" (\"a jailer\") on a 1981 EMI recording of Puccini's \"Tosca\" that featured Renata Scotto, Plácido Domingo, and Renato Bruson, with James Levine conducting. He had earlier sung the role in an excerpt from the opera on a 1980 Pension Fund Benefit Concert telecast as part of the Live from Lincoln Center series with Luciano Pavarotti as Cavaradossi and Zubin Mehta conducting the New York Philharmonic.\n\nOn July 5, 1986, Perlman performed at the New York Philharmonic's tribute to the 100th anniversary of the Statue of Liberty, which was televised live on ABC. The orchestra, conducted by Mehta, performed in Central Park.\n\nIn 1987, Perlman joined the Israel Philharmonic Orchestra (IPO) for its concerts in Warsaw and Budapest as well as other cities in Eastern bloc countries. He toured with the IPO in the spring of 1990 for its first-ever performance in the Soviet Union, with concerts in Moscow and Leningrad, and again in 1994, performing in China and India. ...\n\nSource: Article \"Itzhak Perlman\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1945-08-31",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 166002,
        "imdb_id": "nm0674221",
        "known_for_department": "Acting",
        "name": "Itzhak Perlman",
        "place_of_birth": "Tel Aviv, Palestine [now Israel]",
        "popularity": 0.1606,
        "profile_path": "/yELJweqEW6lzEIKlZJNQbEZprD8.jpg"
    }
}