{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lBcXozUeABairkTavz3X3ZAtOL0.jpg",
                "genre_ids": [
                    10749,
                    80,
                    18
                ],
                "id": 959604,
                "original_language": "fr",
                "original_title": "L'Amour ouf",
                "overview": "Local rebellious teenager Clotaire falls for his schoolmate Jackie, but gang violence leads him to a darker destructive path. After years apart, the star-crossed lovers discover that every path they've taken leads them back together.",
                "popularity": 5.5263,
                "poster_path": "/yu9dRyKcUHTfKcqsomUtpord4t3.jpg",
                "release_date": "2024-10-16",
                "title": "Beating Hearts",
                "video": false,
                "vote_average": 7.221,
                "vote_count": 883,
                "character": "Tony",
                "credit_id": "6435b9ff651fcf00f26d83e7",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Anthony Bajon (born 7 April 1994) is a French actor. He is best known for his leading role in the film The Prayer (2018), which earned him critical appreciation and the Silver Bear for Best Actor.\n\nAnthony Bajon began his acting career at the age of 12 on the stage of theater. Since then he has performed regularly in various theaters in France.\n\nIn 2015, Bajon debuted in Léa Fehner's film Les Ogres, after which he starred in the films Rodin by Jacques Doillon, and André Téchiné's Golden Years among others.\n\nIn 2018, Anthony Bajon played the lead role of 22-year-old drug addict Thomas in Cédric Kahn's movie The Prayer. For this role, he received the Silver Bear for Best Actor at the Berlin International Film Festival, becoming the seventh French actor in history of the festival to be honored with this award.\n\nSource: Article \"Anthony Bajon\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1994-04-07",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1660839,
        "imdb_id": "nm7557188",
        "known_for_department": "Acting",
        "name": "Anthony Bajon",
        "place_of_birth": "Villeneuve-Saint-Georges, Val-de-Marne, France",
        "popularity": 0.2566,
        "profile_path": "/eHpGmQtj4oRHQ3jn9tngWdb6Z9T.jpg"
    }
}