{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7Q2CmqIVJuDAESPPp76rWIiA0AD.jpg",
                "genre_ids": [
                    28,
                    12,
                    18
                ],
                "id": 1011477,
                "original_language": "en",
                "original_title": "Karate Kid: Legends",
                "overview": "After a family tragedy, kung fu prodigy Li Fong is uprooted from his home in Beijing and forced to move to New York City with his mother. When a new friend needs his help, Li enters a karate competition – but his skills alone aren't enough. Li's kung fu teacher Mr. Han enlists original Karate Kid Daniel LaRusso for help, and Li learns a new way to fight, merging their two styles into one for the ultimate martial arts showdown.",
                "popularity": 58.618,
                "poster_path": "/AEgggzRr1vZCLY86MAp93li43z.jpg",
                "release_date": "2025-05-08",
                "title": "Karate Kid: Legends",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 848,
                "character": "Brooklyn Referee",
                "credit_id": "68519854b717883dc5065f2c",
                "order": 29
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Richard Chevolleau is a Jamaican-Canadian actor, best known for playing Augur on Earth: Final Conflict from 1997 to 2002. He was born in Kingston, Jamaica, in 1966. He moved to Toronto, Canada, with his family when he was 10 years old. He began acting in high school and continued to study acting after graduating. He studied the Meisner Technique with Paul Bardier and later trained at the Maggie Bassett Studio. Chevolleau's first professional acting role was in the television series Erben des Fluchs in 1989. He has since appeared in numerous television shows and films, including Street Time, This Is Wonderland, 'Da Kink in My Hair, Lost Girl, She's the Mayor, Saving Hope, Hannibal, Blood and Water, Killjoys, Hudson & Rex and Murdoch Mysteries. He is also a successful stage actor, having appeared in productions of August Wilson's Fences, King Lear, and The Crucible. In 2004, Chevolleau won a Gemini Award for Best Performance by an Actor in a Guest Role Dramatic Series for his role in the television series The Eleventh Hour.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 166430,
        "imdb_id": "nm0156739",
        "known_for_department": "Acting",
        "name": "Richard Chevolleau",
        "place_of_birth": "Kingston, Jamaica",
        "popularity": 0.171,
        "profile_path": "/cdhiFvkAdNxY7Y45qf83XX6zgfb.jpg"
    }
}