{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/v46Uq29FXcl4huvu1Nh7tJ5qAjZ.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 10673,
                "original_language": "en",
                "original_title": "Wall Street",
                "overview": "A young and impatient stockbroker is willing to do anything to get to the top, including trading on illegal inside information taken through a ruthless and greedy corporate raider, whom takes the youth under his wing.",
                "popularity": 5.3071,
                "poster_path": "/2tQYq9ntzn2dEwDIGLBSipYPenv.jpg",
                "release_date": "1987-12-10",
                "title": "Wall Street",
                "video": false,
                "vote_average": 7.163,
                "vote_count": 2147,
                "character": "Dan",
                "credit_id": "52fe43a09251416c75017bfb",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Franklin E. Cover",
            "Frank Cover",
            "Franklin Edward Cover"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nFranklin Edward Cover (November 20, 1928 – February 5, 2006) was an American actor best known for starring in the sitcom The Jeffersons. His character, Tom Willis, was half of one of the first interracial marriages to be seen on prime-time television.\n\nCover was born on November 20, 1928 in Cleveland, Ohio, to Britta (Schreck) and Franklin Held Cover. He graduated from John Marshall High School in 1947. Cover graduated from Denison University in 1951, and he received his MA in Theater in 1954 and MFA in Theater in 1955 both from Case Western Reserve University.\n\nHis career started on the stage acting in Henry IV, Part 1 and Hamlet. He also appeared in Forty Carats with Julie Harris. He made his television debut on Naked City and later appeared on The Jackie Gleason Show.\n\nIn 1965, he married Mary Bradford Stone.\n\nHis first starring role was on The Jeffersons as Tom Willis who was married to a black woman, Helen, played by Roxie Roker. The couple lived in the same high-rise apartment building as the sitcom's title characters. Cover would often be the foil to Sherman Hemsley's black businessman, George Jefferson. The sitcom ran from 1975 to 1985. He also appeared in The Stepford Wives in 1975, and played Hubert Humphrey in the 1982 TV movie A Woman Called Golda.\n\nFollowing the end of The Jeffersons, Cover continued to make guest appearances on television shows as well as appearing in a supporting role in Wall Street (1987). In 1994, he appeared in the second episode of ER. His final television appearance was in an episode of Will & Grace (entitled \"Object Of My Rejection\") that aired on May 13, 1999.\n\nCover died at the Lillian Booth Actors Home in Englewood, New Jersey, on February 5, 2006. He had been living at the home since December 2005 while recovering from a heart condition, and died of pneumonia.  He was survived by his wife; the former Mary Bradford Stone, two adult children; Susan and Bradford, and a grandson, Maxwell. His son, Bradford Cover, an actor who lives in New York City, has appeared on Law and Order, Broadway, and Off Broadway, and is a company member at The Pearl Theatre Company. His daughter Susan is the founder of Susie's Supper Club (now closed), a home delivery food service that catered to parents and children in New York.  CLR",
        "birthday": "1928-11-20",
        "deathday": "2006-02-05",
        "gender": 2,
        "homepage": null,
        "id": 166598,
        "imdb_id": "nm0184429",
        "known_for_department": "Acting",
        "name": "Franklin Cover",
        "place_of_birth": "Cleveland, Ohio, USA",
        "popularity": 0.1783,
        "profile_path": "/8ffSODyNYHd06fFoJH7kiNvEy9E.jpg"
    }
}