{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9Ebn8atCcGk5OZrx4xmoTobAxoh.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 1581,
                "original_language": "en",
                "original_title": "The Holiday",
                "overview": "Two women, one American and one British, swap homes at Christmastime following bad breakups. Each woman finds romance with a local man but realizes that the imminent return home may end the relationship.",
                "popularity": 7.1835,
                "poster_path": "/h1ITOpvJN3Tw4Sy60w2QTfYMvdd.jpg",
                "release_date": "2006-12-05",
                "title": "The Holiday",
                "video": false,
                "vote_average": 7.091,
                "vote_count": 5347,
                "character": "Movie Trailer Narrator (voice)",
                "credit_id": "5c530c26c3a368477799ebe9",
                "order": 27
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Harold Cohen"
        ],
        "biography": "Harold Douglas (born Harold Cohen; September 1, 1924 – March 7, 2014) was an American voice actor best known for performing thousands of voice-overs for movie trailers, television commercials, and stage plays over the course of a six-decade career. Born Harold Cohen in Stamford, Connecticut, on September 1, 1924, the son of Jewish immigrants from Eastern Europe, Samuel and Miriam Levenson Cohen, Douglas and his brother Edwin were primarily raised by their grandparents Sarah and Tevya Levenson after their mother died when Douglas was only nine. He served in World War II, and attended the University of Miami in Florida as a drama major.\n\nDouglas began a career in radio in the 1950s. By the 1960s, he had become a producer for several prominent advertising agencies in New York City. He finally moved into doing voice-overs for commercials, promos, and trailers by the early 1970s, and would continue doing so until his retirement in the late 2000s. Because many of his trailers have begun with the words \"In a world\", there is controversy over whether his voice has immortalized them.  In addition, Douglas has been the promotional voice for The WB, ABC, A&E, Disney's Halloween Treat, A Disney Halloween, Disney Channel's \"Vault Disney\" (1997–2002), and The History Channel. He did the voiceover narration for the 1997 Detroit Red Wings, the 1994 and 1995 Houston Rockets and the 1992, 1993, 1996 and 1997 Chicago Bulls championship documentaries. Because he recorded so many trailers through the years, he was sometimes mistaken for Don LaFontaine.[citation needed] He can be seen parodying himself in the trailer for Comedian, a documentary that features Jerry Seinfeld.  Douglas provided narration for the trailer for the novel All the Talk Is Dead by Michael Ebner. Unlike most movie trailer announcers, Douglas lived in Northern Virginia and his agent was based in New York City instead of Los Angeles. Hal Douglas was described by a Miramax publicist as \"perhaps the most recognizable trailer voice in the business\". Douglas's voice briefly appears in the skit \"5 Men and a Limo\", featuring other notable voiceover recording artists, such as Don LaFontaine, John Leader, Nick Tate, Al Chalk, and Mark Elliot. As the skit was filmed in California, and as Douglas was primarily based in the East Coast, he was unable to make a physical appearance, and only is heard in a brief recording.\n\nIn 1988 Douglas moved from Pawling, New York, to a 40-acre farm in Lovettsville, Virginia, where he pursued organic gardening and his wife took up competitive horse riding. He had a small recording studio built there that allowed him to do his work at home, sometimes in pajamas. Douglas died at his home on March 7, 2014, of pancreatic cancer, at the age of 89",
        "birthday": "1924-09-01",
        "deathday": "2014-03-07",
        "gender": 2,
        "homepage": null,
        "id": 1666759,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Hal Douglas",
        "place_of_birth": "Stamford, Connecticut, U.S.",
        "popularity": 0.0655,
        "profile_path": "/j9kaspOndThAN9tmibHoMuCyvr9.jpg"
    }
}