{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bYimqNnizPUCnL5HOdoCW02IGmH.jpg",
                "genre_ids": [
                    18,
                    35,
                    10749
                ],
                "id": 74643,
                "original_language": "fr",
                "original_title": "The Artist",
                "overview": "Hollywood, 1927: As silent movie star George Valentin wonders if the arrival of talking pictures will cause him to fade into oblivion, he sparks with Peppy Miller, a young dancer set for a big break.",
                "popularity": 2.4813,
                "poster_path": "/z68py0ZqPgeacGPG54AGVRbNBS7.jpg",
                "release_date": "2011-10-12",
                "title": "The Artist",
                "video": false,
                "vote_average": 7.451,
                "vote_count": 3368,
                "character": "Make-up Artist 1 (uncredited)",
                "credit_id": "57b8d4d492514141ae000ae9",
                "order": 69
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/zlU8BIkgY7E6SMfD3USTWC6bchL.jpg",
                "genre_ids": [
                    878,
                    28,
                    18,
                    53
                ],
                "id": 119450,
                "original_language": "en",
                "original_title": "Dawn of the Planet of the Apes",
                "overview": "A group of scientists in San Francisco struggle to stay alive in the aftermath of a plague that is wiping out humanity, while Caesar tries to maintain dominance over his community of intelligent apes.",
                "popularity": 14.2776,
                "poster_path": "/kScdQEwS9jPEdnO23XjGAtaoRcT.jpg",
                "release_date": "2014-07-08",
                "title": "Dawn of the Planet of the Apes",
                "video": false,
                "vote_average": 7.334,
                "vote_count": 11828,
                "credit_id": "683238dd2f025fa43a72f566",
                "department": "Sound",
                "job": "Vocals"
            },
            {
                "adult": false,
                "backdrop_path": "/9BBTo63ANSmhC4e6r62OJFuK2GL.jpg",
                "genre_ids": [
                    878,
                    28,
                    12
                ],
                "id": 24428,
                "original_language": "en",
                "original_title": "The Avengers",
                "overview": "When an unexpected enemy emerges and threatens global safety and security, Nick Fury, director of the international peacekeeping agency known as S.H.I.E.L.D., finds himself in need of a team to pull the world back from the brink of disaster. Spanning the globe, a daring recruitment effort begins!",
                "popularity": 41.4687,
                "poster_path": "/RYMX2wcKCBAr24UyPD7xwmjaTn.jpg",
                "release_date": "2012-04-25",
                "title": "The Avengers",
                "video": false,
                "vote_average": 7.809,
                "vote_count": 33148,
                "credit_id": "6832392365b5510b26eb2c91",
                "department": "Sound",
                "job": "Vocals"
            },
            {
                "adult": false,
                "backdrop_path": "/k3PqsPLkKLDyjZupZ6gqZHPxMv3.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 54138,
                "original_language": "en",
                "original_title": "Star Trek Into Darkness",
                "overview": "When the crew of the Enterprise is called back home, they find an unstoppable force of terror from within their own organization has detonated the fleet and everything it stands for, leaving our world in a state of crisis.  With a personal score to settle, Captain Kirk leads a manhunt to a war-zone world to capture a one man weapon of mass destruction. As our heroes are propelled into an epic chess game of life and death, love will be challenged, friendships will be torn apart, and sacrifices must be made for the only family Kirk has left: his crew.",
                "popularity": 4.5789,
                "poster_path": "/7XrRkhMa9lQ71RszzSyVrJVvhyS.jpg",
                "release_date": "2013-05-05",
                "title": "Star Trek Into Darkness",
                "video": false,
                "vote_average": 7.32,
                "vote_count": 9344,
                "credit_id": "683239790889d3b4b7413b85",
                "department": "Sound",
                "job": "Vocals"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Julie Minasian has extensive musical training, performing and teaching experience.  She is a licensed Music Together teacher and has over 15 years of experience teaching piano to children and adults.  Julie was born into a musical family in a rich musical environment.  Her musical ability was nurtured at a very young age by her parents, Samuel, a violinist, and Joyce Minasian, a pianist who both graduated from the Eastman School of Music.  Julie's mother taught her piano starting at the age of 4 and she began voice lessons at age 15.  Julie showed interest in writing music around age 11.  A classically trained pianist and vocalist, Julie graduated from Drury University with a Bachelor of Music with majors in piano, voice and music theory/composition.  During college, Julie spent a year abroad in London, England at Trinity Laban conservatory where she studied piano and vocal performance.  She studied piano with Simon Young and performed a solo piano recital in London during her year abroad.\n\nAfter college, Julie went on to have a career singing in professional choirs, including the New York Choral Artists, as well as in choirs for film and game soundtracks.  Some of her film score credits include The Lorax, Ice Age 4, Men in Black 3 and Star Trek Into Darkness.  Julie also composes piano and choral music, and is a songwriter.  She has performed her original songs at numerous venues in New York City and Los Angeles and recorded a full-length CD entitled \"This is the Love I Have.\"  In addition to music, Julie is also a trained actress and has performed on stage as well as in TV and film.  She studied acting at Drury University and Regent's College in London, and with acting teachers in New York and Los Angeles.  Some of her film acting credits include the The Holiday, Spider-Man 3 and the 2011 Oscar-winning movie, The Artist.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.musictogetheroftheozarks.com/teachers.aspx",
        "id": 1668500,
        "imdb_id": "nm4855334",
        "known_for_department": "Sound",
        "name": "Julie Minasian",
        "place_of_birth": "New York City, New York",
        "popularity": 0.0579,
        "profile_path": "/sZv3t7rAfPcC7tuzlErSyoFphih.jpg"
    }
}