{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bYimqNnizPUCnL5HOdoCW02IGmH.jpg",
                "genre_ids": [
                    18,
                    35,
                    10749
                ],
                "id": 74643,
                "original_language": "fr",
                "original_title": "The Artist",
                "overview": "Hollywood, 1927: As silent movie star George Valentin wonders if the arrival of talking pictures will cause him to fade into oblivion, he sparks with Peppy Miller, a young dancer set for a big break.",
                "popularity": 3.1239,
                "poster_path": "/z68py0ZqPgeacGPG54AGVRbNBS7.jpg",
                "release_date": "2011-10-12",
                "title": "The Artist",
                "video": false,
                "vote_average": 7.451,
                "vote_count": 3367,
                "character": "Peppy's Assistant",
                "credit_id": "57b75bfd92514125f9001602",
                "order": 32
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Matt Skoller"
        ],
        "biography": "Matt Skollar was born in New York City to mom, Haydee, born and raised in Panama, and Stan, New York native of Russian/Jewish ancestry. Matt began acting, dancing and singing at a young age, which led him to his first professional job (age 10) playing a young prince in an 8-week run of \"The King and I.\" Matt's passion for performing arts further grew as he aged, leading him to put higher education on hold to pursue his childhood dream. This move would take Matt back to New York, where he was admitted to the prestigious New Actors Workshop. Matt studied for two years, full time, with master teachers such as George Morrison, Paul Sills and the late Mike Nichols. The emphasis of his training, steeped in Stanislavski and improvisation, allowed him to quickly showcase his talents in several off-Broadway plays, eventually leading to a contract with the esteemed Abrams Artists Agency.\n\nDuring his career, Matt has guest starred on numerous prime time shows such as Sex and the City (HBO), Law and Order SVU (NBC), Game of Silence (NBC) and most recently MacGyver (CBS). Matt also had a recurring role on the daytime drama, One Life to Live (ABC). He has appeared in various indie films, including the Oscar winning Best Picture, \"The Artist\" and \"Beast Beast\" which made it's screen debut during the 2020 Sundance Film Festival.\n\nHis stage work includes a two-man show in the NYC Fringe Festival, as well as, performances at the prestigious Williamstown Theater Festival. Matt would eventually relocate from Los Angeles to Atlanta to take advantage of Georgia's fast growing film industry. To continue his studies, Matt enrolled in Nick Conti's Professional Actors Studio as an advanced student. Matt's passion and experience in performing arts subsequently led him to teach and mentor fellow performers at the Professional Actors Studio. Since moving to Atlanta, Matt has co-written and co-starred in an indie original and award-winning TV production, \"Outside the Perimeter\" with fellow actors and colleagues, Franco Castan and Scott Oakley.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://resumes.actorsaccess.com/789295-3744679",
        "id": 1668087,
        "imdb_id": "nm1177232",
        "known_for_department": "Acting",
        "name": "Matt Skollar",
        "place_of_birth": "New York City, New York",
        "popularity": 0.1665,
        "profile_path": "/gStbUsouWqHI7mARY6c87HluXRC.jpg"
    }
}