{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jOqOduY1tLhXgVZo7ypCtDVr0mM.jpg",
                "genre_ids": [
                    18,
                    9648,
                    53
                ],
                "id": 489999,
                "original_language": "en",
                "original_title": "Searching",
                "overview": "After David Kim's 16-year-old daughter goes missing, a local investigation is opened and a detective is assigned to the case. But 37 hours later and without a single lead, David decides to search the one place no one has looked yet, where all secrets are kept today: his daughter's laptop.",
                "popularity": 3.0395,
                "poster_path": "/yuAPCsCGJGSxA7YOW4elF5JNrzK.jpg",
                "release_date": "2018-08-24",
                "title": "Searching",
                "video": false,
                "vote_average": 7.571,
                "vote_count": 4028,
                "character": "Margot's Friend #11 (voice)",
                "credit_id": "5c4a227a92514105c1530931",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ben J. Pierce"
        ],
        "biography": "Benny Jean Pierce (born February 19, 1999), known professionally as Miss Benny, is an American actress, singer and YouTuber.\n\nBenny was born on February 19, 1999, and grew up in Denton, Texas. She lived as a closeted teenager before coming out. As she began posting on YouTube, she found an outlet with similar individuals in the online community. She befriended fellow YouTube artists Troye Sivan and Tyler Oakley.  She is of Latin American descent.\n\nBenny began posting on YouTube using various channels when she was 11 years old in 2010 as a way to feel less isolated and lonely. In 2012, she began posting under the YouTube channel, KidPOV. She began posting under her own name in 2016. She frequently discusses gender and identity. Benny has done makeup tutorials and collaborated with other media personalities including Tyler Oakley and James Charles. Her YouTube channel also includes humorous skits.",
        "birthday": "1999-02-19",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1670961,
        "imdb_id": "nm4868704",
        "known_for_department": "Acting",
        "name": "Miss Benny",
        "place_of_birth": "Dallas, Texas, USA",
        "popularity": 0.1757,
        "profile_path": "/jLOnurv8aatAFGNrVHORFubfrud.jpg"
    }
}