{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ycNyvi9gk4ZI2NLk4KBbseNZbfN.jpg",
                "genre_ids": [
                    99
                ],
                "id": 58496,
                "original_language": "en",
                "original_title": "Senna",
                "overview": "The remarkable story of Brazilian racing driver Ayrton Senna, charting his physical and spiritual achievements on the track and off, his quest for perfection, and the mythical status he has since attained, is the subject of Senna, a documentary feature that spans the racing legend's years as an F1 driver, from his opening season in 1984 to his untimely death a decade later.",
                "popularity": 2.9837,
                "poster_path": "/nZbLCbRoP6iJq5sr8daHQzjnzFh.jpg",
                "release_date": "2010-10-07",
                "title": "Senna",
                "video": false,
                "vote_average": 8.112,
                "vote_count": 1116,
                "character": "Self",
                "credit_id": "52fe4965c3a36847f8197ebf",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Ron Dennis is a renowned figure in Formula 1, best known for transforming McLaren Racing into one of the sport's most successful teams. Dennis began his motorsport career as a mechanic and quickly moved up the ranks. In 1980, he merged his own team, Project Four Racing, with McLaren, eventually becoming McLaren's team principal and CEO.\n\nUnder his leadership, McLaren saw incredible success, winning numerous Constructors' and Drivers' Championships with legends like Niki Lauda, Alain Prost, Ayrton Senna, and later, Mika Häkkinen and Lewis Hamilton. Dennis is credited with modernizing the team, introducing innovative technology, and setting high standards for precision and professionalism in Formula 1.\n\nBeyond racing, Dennis also expanded McLaren into a successful luxury car brand. He stepped down from McLaren in 2017 but remains an influential figure in motorsports and the automotive industry.",
        "birthday": "1947-06-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 167391,
        "imdb_id": "nm2651182",
        "known_for_department": "Acting",
        "name": "Ron Dennis",
        "place_of_birth": "Woking, England",
        "popularity": 0.8371,
        "profile_path": "/kjcfPZqE9G5kaiAuVW6o84Dqmkz.jpg"
    }
}