{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/v4YV4ne1nwNni35iz4WmpZRZpCD.jpg",
                "genre_ids": [
                    28,
                    18,
                    36
                ],
                "id": 724495,
                "original_language": "en",
                "original_title": "The Woman King",
                "overview": "The story of the Agojie, the all-female unit of warriors who protected the African Kingdom of Dahomey in the 1800s with skills and a fierceness unlike anything the world has ever seen, and General Nanisca as she trains the next generation of recruits and readies them for battle against an enemy determined to destroy their way of life.",
                "popularity": 24.7701,
                "poster_path": "/438QXt1E3WJWb3PqNniK0tAE5c1.jpg",
                "release_date": "2022-09-16",
                "title": "The Woman King",
                "video": false,
                "vote_average": 7.643,
                "vote_count": 2227,
                "character": "Malik",
                "credit_id": "618adf2addd52d00616ce0f9",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Джордан Болджер"
        ],
        "biography": "Jordan Bolger is an English actor. He has performed in television, notably in Peaky Blinders, The 100, The Book of Boba Fett, and This Town. In film, he is known for side roles in Tom & Jerry and The Woman King. Bolger was born in Radford, Coventry, England, to a Jamaican father and English mother, and has a brother Daniell. He was brought up by his single mother Liz, who is a gym instructor. He did taekwondo and kickboxing as a youth. He trained as a dancer at the Tring Park School for the Performing Arts.\n\nOriginally intending to be a professional dancer, Bolger injured himself at a dancing audition and decided to audition as an actor instead. His first acting role was as Isaiah Jesus in the British period crime drama television series Peaky Blinders. He made 13 appearances in the show from 2014 to 2017, before exiting the show due to clashing schedules. In 2018, he appeared on the post-apocalyptic science fiction drama The 100, cast as Miles Ezekial Shaw. In 2021, he made his Hollywood debut in a side role in the comedy film Tom & Jerry. In 2022, he was cast as the recurring character Skad in the Star Wars spinoff television series The Book of Boba Fett. He appeared in a supporting role, Malik, in the 2022 film The Woman King.",
        "birthday": "1994-11-09",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.selectmodel.com/london/model/jordan-bolger",
        "id": 1674734,
        "imdb_id": "nm6304865",
        "known_for_department": "Acting",
        "name": "Jordan Bolger",
        "place_of_birth": "Radford, Coventry, England",
        "popularity": 0.5243,
        "profile_path": "/zGSxXrllgm3MNVT0jjvnAQFacPS.jpg"
    }
}