{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lOrM3OQhHlzEkpF7Ih3GghecrA8.jpg",
                "genre_ids": [
                    35
                ],
                "id": 583,
                "original_language": "en",
                "original_title": "Life of Brian",
                "overview": "Brian Cohen is an average young Jewish man, but through a series of ridiculous events, he gains a reputation as the Messiah. When he's not dodging his followers or being scolded by his shrill mother, the hapless Brian has to contend with the pompous Pontius Pilate and acronym-obsessed members of a separatist movement. Rife with Monty Python's signature absurdity, the tale finds Brian's life paralleling Biblical lore, albeit with many more laughs.",
                "popularity": 5.53,
                "poster_path": "/lSSA64WF0M0BXnjwr2quMh6shCl.jpg",
                "release_date": "1979-08-17",
                "title": "Life of Brian",
                "video": false,
                "vote_average": 7.761,
                "vote_count": 4652,
                "character": "Alfonso / Giggling Guard",
                "credit_id": "5568ed679251416b0e000289",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Christopher Langham"
        ],
        "biography": "Christopher Langham is an English writer, actor, and comedian. He is known for playing the cabinet minister Hugh Abbot in the BBC Four sitcom The Thick of It, and as presenter Roy Mallard in People Like Us, first on BBC Radio 4 and later on its transfer to television on BBC Two, where Mallard is almost entirely an unseen character.\n\nLangham subsequently created several spoof adverts in the same vein. He also played similar unseen interviewers in an episode of the television series Happy Families and in the film The Big Tease. He is also known for his roles in the television series Not the Nine O'Clock News, Help, Kiss Me Kate, and as the gatehouse guard in Chelmsford 123. In 2006, he won BAFTA awards for The Thick of It and Help.\n\nOn 2 August 2007, Langham was found guilty of fifteen charges of downloading and possessing level 5 child sexual abuse images and videos. Langham was jailed for ten months, reduced to six months on appeal. He was made to sign the sex offenders' register and was banned from working with children for 10 years.",
        "birthday": "1949-04-14",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 167449,
        "imdb_id": "nm0486413",
        "known_for_department": "Acting",
        "name": "Chris Langham",
        "place_of_birth": "London, England, UK",
        "popularity": 0.1728,
        "profile_path": "/nBMD5a0XVnk8DQbj7yTjRXX5NHc.jpg"
    }
}