{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rAQcPrEaPzDRVNX7XX5TWyxCGFN.jpg",
                "genre_ids": [
                    27,
                    53
                ],
                "id": 346364,
                "original_language": "en",
                "original_title": "It",
                "overview": "In a small town in Maine, seven children known as The Losers Club come face to face with life problems, bullies and a monster that takes the shape of a clown called Pennywise.",
                "popularity": 11.7514,
                "poster_path": "/9E2y5Q7WlCVNEhP5GiVTjhEhx1o.jpg",
                "release_date": "2017-09-06",
                "title": "It",
                "video": false,
                "vote_average": 7.237,
                "vote_count": 19557,
                "character": "Esther (uncredited)",
                "credit_id": "5a34bd64c3a36814a80386b3",
                "order": 45
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Kate Moyer (born May 2, 2008) is a Canadian actress. She is most noted for her performance in the film Our House, for which she received a Canadian Screen Award nomination for Best Supporting Actress at the 7th Canadian Screen Awards in 2019. In 2020, Moyer was again nominated for a Canadian Screen Award in the TV category, Best Performance in a Children's or Youth Program or Series for her portrayal of Heather Hobbie in season 1 of Holly Hobbie.\n\nIn 2018, Moyer portrayed Heather Hobbie, the younger sister of Holly Hobbie in season 1 of the series Holly Hobbie, which aired on Hulu in the United States and subsequently on The Family Channel in Canada and again in season 2 in 2019. Moyer also appeared as Olivia in the Hallmark TV movie A Christmas in Tennessee. In 2019, Moyer appeared as Young Peggy in the film Buffaloed, as the young version of the lead character. Moyer was also a guest star on the season 3 finale of Hulu's The Handmaid's Tale in the role of Kiki/Rebecca. Also in 2019, she was cast as Sofia, a young orphan, in season 1 of the Hallmark television series When Hope Calls, a spin-off of the When Calls the Heart series.\n\nIn 2020, she was cast as Eden Edwards, co-lead of Kurt Wimmer's modern prequel to Stephen King's 1984 movie Children of the Corn. One of the only productions to continue filming in the world during the 2020 COVID-19 global restrictions, principal filming was completed with an isolated cast and crew in Australia. The completed film was released in October 2020.",
        "birthday": "2008-05-02",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1674738,
        "imdb_id": "nm4280291",
        "known_for_department": "Acting",
        "name": "Kate Moyer",
        "place_of_birth": "Canada ",
        "popularity": 0.2122,
        "profile_path": "/1ZOuMRwWihDTMOe47NrsZdWlU09.jpg"
    }
}