{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/g3yflwqajsVEYdUr7B84fMHBkAw.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 329805,
                "original_language": "fr",
                "original_title": "Mon roi",
                "overview": "Tony is admitted to a rehabilitation center after a serious ski accident. Dependent on the medical staff and pain relievers, she takes time to look back on a turbulent relationship that she experienced with Georgio.",
                "popularity": 2.3585,
                "poster_path": "/kOhRkC7J3jpAgHGC0Uh3SoCqU4c.jpg",
                "release_date": "2015-10-21",
                "title": "My King",
                "video": false,
                "vote_average": 7.142,
                "vote_count": 793,
                "character": "Vladimir",
                "credit_id": "685c01794714f54c68ee6846",
                "order": 42
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Vladimir Perrin has spent two years at the National Conservatory of Nice, where he worked with actress and director Claudine Hunault. In 2008 he directed his first play WORLD OF HENRY, which he starred in as well. After moving to Paris, he got accepted into the \"Laboratoire de l'acteur\" coached by Hélène Zidi Cheruy, focusing on acting for the camera.  With the collaboration of his agent, Axelle Sibiril Lefebvre (ACT 1), he’s made a name for himself working on large television and feature film projects, such as the recent TF1 two- part period drama RESISTANCE, with Best Actress César winner Fanny Ardant.\n\nHe has worked with a variety of directors such as Jean-Pierre Mocky, Thierry Binisti, Miguel Courtois or Cannes Film Festival Jury Award winner Maïwenn (POLISSE). He also starred in American pop star Taylor Swift’s video BEGIN AGAIN (seen over 50 million times on Youtube).  He continues to train and has attended two workshops at the National Theatre of Chaillot, with Academy Award nominee Kristin Scott Thomas, Marion Levy, Anne Nathan, and director Fadhel Jaibi.",
        "birthday": "1989-01-05",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1675003,
        "imdb_id": "nm3220123",
        "known_for_department": "Acting",
        "name": "Vladimir Perrin",
        "place_of_birth": "Nice, Alpes-Maritimes, France",
        "popularity": 0.0868,
        "profile_path": "/hoSUPf2EolfLYysFAwuLDougxAI.jpg"
    }
}