{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ftNimlo6fP4WKRMWnF1ghX4fPUy.jpg",
                "genre_ids": [
                    35,
                    10749,
                    18
                ],
                "id": 6620,
                "original_language": "en",
                "original_title": "Sabrina",
                "overview": "Linus and David Larrabee are the two sons of a very wealthy family. Linus is all work – busily running the family corporate empire, he has no time for a wife and family. David is all play – technically he is employed by the family business, but never shows up for work, spends all his time entertaining, and has been married and divorced three times. Meanwhile, Sabrina Fairchild is the young, shy, and awkward daughter of the household chauffeur, who goes away to Paris for two years, and returns to capture David's attention, while falling in love with Linus.",
                "popularity": 3.8978,
                "poster_path": "/86ix9wBxiMAaISt4HpmXQm6Mlym.jpg",
                "release_date": "1954-09-01",
                "title": "Sabrina",
                "video": false,
                "vote_average": 7.505,
                "vote_count": 1294,
                "character": "Elizabeth Tyson",
                "credit_id": "52fe445fc3a36847f8091fd9",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "مارتا هایر"
        ],
        "biography": "Martha Hyer (August 10, 1924, Fort Worth, Texas - May 31, 2014, Santa Fe, New Mexico) was an American actress.\n\nShe attended Northwestern University and was a member of Pi Beta Phi fraternity. After completing her education, she next appeared in The Locket in 1946. She had roles in So Big (1953), Sabrina (1954), The Delicate Delinquent in 1956 (Jerry Lewis' first film without Dean Martin), Houseboat (1958), Ice Palace (1960), Desire in the Dust (1960), The Carpetbaggers (1964), First Men in the Moon (1964), Blood on the Arrow (1964) and The Sons of Katie Elder (1965), Night of the Grizzly (1966), among many others. She costarred with Keenan Wynn in Bikini Beach (1964), one of the Beach Party movies with Frankie Avalon and Annette Funicello.\n\nOn television, Hyer played the part of \"Hannah Haley\" in the episode \"Incident West of Lano\" on the Western series Rawhide.\n\nHer most significant role came as the love interest of Frank Sinatra in Some Came Running for director Vincente Minnelli in 1958, for which she received a nomination for the Academy Award for Best Supporting Actress. Hyer was one of the actresses considered for the Janet Leigh role of the doomed Marion Crane in the Alfred Hitchcock thriller Psycho. Her last film was Day of the Wolves in 1973.\n\nHyer married producer Hal B. Wallis in 1966, and the couple remained together until his death in 1986.\n\nShe died on May 31, 2014, at the age of 89 from natural causes, in Santa Fe, New Mexico, where she had lived for many years.\n\nDescription above from the Wikipedia article Martha Hyer, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1924-08-10",
        "deathday": "2014-05-31",
        "gender": 1,
        "homepage": null,
        "id": 16759,
        "imdb_id": "nm0405054",
        "known_for_department": "Acting",
        "name": "Martha Hyer",
        "place_of_birth": "Fort Worth, Texas, USA",
        "popularity": 0.4401,
        "profile_path": "/rynlhUJmF3L1d0qxBcPY1GkdwwY.jpg"
    }
}