{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cru4rjGcdHGhnPyjNXvW82jOrif.jpg",
                "genre_ids": [
                    10749,
                    35,
                    18
                ],
                "id": 986280,
                "original_language": "fi",
                "original_title": "Kuolleet lehdet",
                "overview": "In modern-day Helsinki, two lonely souls in search of love meet by chance in a karaoke bar. However, their path to happiness is beset by obstacles – from lost phone numbers to mistaken addresses, alcoholism, and a charming stray dog.",
                "popularity": 1.923,
                "poster_path": "/9ayYOpeqHhxfHHUoyt3kXzznECO.jpg",
                "release_date": "2023-09-14",
                "title": "Fallen Leaves",
                "video": false,
                "vote_average": 7.151,
                "vote_count": 651,
                "character": "Matron",
                "credit_id": "64622868a67254018588ba4d",
                "order": 38
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia.\n\nMaria Heiskanen (born 1970) is a Finnish actress. She works in cinema, television and theatre.\n\nHeiskanen received her breakthrough role in the 1991 Swedish film Il Capitano: A Swedish Requiem directed by Jan Troell. For her role Heiskanen won the Gold Plaque Award in Chicago International Film Festival for the Best Actress in 1992. Heiskanen lived in Sweden during 1993 - 2003 and worked in movies and theatre. She played in Kungliga Dramatiska Teatern and in Riksteatern where she for example performed role of Masja in Anton Chekhovs The Seagull (2008) directed by Lars Norén.\n\nIn Finland Heiskanen has worked with Aki Kaurismäki in Lights in the Dusk (2006). She also played in Aleksi Salmenperä's A Man's Work (2007) and was nominated for Jussi Awards from both performances.\n\nIn 2008, Heiskanen starred in the leading role of Jan Troell's Everlasting Moments, for which she won the Guldbagge Award for Best Actress and the Best Actress Award from Valladolid International Film Festival. The film won the Guldbagge Award for Best Film and was nominated for Best Foreign Language Film at the 66th Golden Globe Awards. It also made the January shortlist for Best Foreign Language Film at the 81st Academy Awards, but wasn't selected as one of the final nominees.\n\nDescription above from the Wikipedia article Maria Heiskanen, licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": "1970-08-21",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 16776,
        "imdb_id": "nm0374685",
        "known_for_department": "Acting",
        "name": "Maria Heiskanen",
        "place_of_birth": "Kuopio, Finland",
        "popularity": 0.0841,
        "profile_path": "/2orI2W2DMzSdURRFcvtxahTjSnu.jpg"
    }
}