{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/x7y8ezKtU1vRInk0dmbvDoKgJ8u.jpg",
                "genre_ids": [
                    18,
                    35,
                    10749
                ],
                "id": 2898,
                "original_language": "en",
                "original_title": "As Good as It Gets",
                "overview": "Melvin Udall, a cranky, bigoted, obsessive-compulsive writer of romantic fiction, is rude to everyone he meets, including his gay neighbor, Simon. After Simon is brutally attacked and hospitalized, Melvin finds his life turned upside down when he has to look after Simon's dog. In addition, Carol, the only waitress at the local diner who will tolerate him, leaves work to care for her chronically ill son, making it impossible for Melvin to eat breakfast.",
                "popularity": 5.5237,
                "poster_path": "/xXxuJPNUDZ0vjsAXca0O5p3leVB.jpg",
                "release_date": "1997-12-19",
                "title": "As Good as It Gets",
                "video": false,
                "vote_average": 7.397,
                "vote_count": 3930,
                "character": "Nurse",
                "credit_id": "57d6d80592514172cc0008c0",
                "order": 45
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Antonia Maria Benyovszky",
            "Antonia Benyovszky"
        ],
        "biography": "Antonia Jones, a SAG/AFTRA performer, was born Antonia Maria Benyovszky and is a descendant of the Hungarian King Maurice Benyovszky (1746-1786). Antonia harbored a passion for acting at an early age. A Chicago native, Antonia began her professional career in 1993 in New York City alongside actors Phillip Bosco and Joe Morton with the series regular role of \"Sara\" on FOX's Emmy nominated anthology series TRIBECA, produced by Robert DeNiro.  After leaving New York City,  she returned to Los Angeles and went on to a second series regular role in 1995 with the UPN network series LIVE SHOT in which she played \"Peggy Traynor\" an intern in the newsroom alongside notable actors such as Sam Anderson, David Birney, and Bruce McGill.\n\nAntonia has worked both in front of and behind the camera with added experience onstage, in production, screenwriting, and film development.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.antoniajones.com/",
        "id": 1678186,
        "imdb_id": "nm0427508",
        "known_for_department": "Acting",
        "name": "Antonia Jones",
        "place_of_birth": null,
        "popularity": 0.0629,
        "profile_path": "/73NAdmeU3RUYpyPQmkyI0nsL8Lg.jpg"
    }
}