{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3ejcvnHxMFfCbnFi736cXi1ChH1.jpg",
                "genre_ids": [
                    18
                ],
                "id": 4481,
                "original_language": "fr",
                "original_title": "Manon des sources",
                "overview": "In this, the sequel to Jean de Florette, Manon has grown into a beautiful young shepherdess living in the idyllic Provencal countryside. She plots vengeance on the men who greedily conspired to acquire her father's land years earlier.",
                "popularity": 2.1524,
                "poster_path": "/1qpu6Zc1PSDL3UbDNIZJ6YuhJDW.jpg",
                "release_date": "1986-11-19",
                "title": "Manon of the Spring",
                "video": false,
                "vote_average": 7.582,
                "vote_count": 537,
                "character": "Victor",
                "credit_id": "5e53dc43f48b34001972af9e",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Gabriel Bacquier (17 May 1924 – 13 May 2020) was a French operatic baritone. One of the leading baritones of the 20th century and particularly associated with the French and Italian repertoires, he was considered a fine singing actor equally at home in dramatic or comic roles and gave regular song recitals. He was a long-term member of the Opéra-Comique and the Paris Opera, but forged a long career internationally at leading opera houses in Europe and the U.S. His large discography spans five decades, and he was considered as “the ambassador of French song”.\n\nBorn Gabriel Augustin-Raymond-Théodore-Louis Bacquier in Béziers, France, on 17 May 1924, he was the only child of railway employees. As a young boy, he was fascinated by everything to do with singing: records, broadcasts and photos of singers. Leaving school aged 14, he worked at his uncle's print-shop, while studying in Montpellier to become a commercial artist, but during the Vichy regime, to avoid the round-ups and deportations by the Service du travail obligatoire, his parents arranged for him to do national service in the Chantiers de Jeunesse on the railways during the Occupation.\n\nAs a teenager he took voice lessons with a Madame Bastard in Béziers in his free time and made his operatic debut during the war as Ourrias in Gounod's Mireille in the town arena. After World War II, he entered the Paris Conservatoire, receiving a scholarship because of his family's modest means, and graduated in 1950. He was a contemporary of, and shared his student life with, future leading French singers Régine Crespin, Xavier Depraz, Michel Sénéchal and Michel Roux. In his final year, the director of the Conservatoire, Claude Delvincourt, allowed him leave to work at the Opéra de Nice in the 1949–50 season, singing small roles in operas and operettas; this along with regular singing spots in cinemas gave him important experience and income before his next career steps. Having already gained a first prize for opéra comique in his penultimate year, he won first prize for singing and second prize for opera at the conclusion of his formal studies. Around this time he also took a course in dramatic art.\n\nHe joined the opera company of José Beckmans in 1950, and was a member of La Monnaie in Brussels from 1953 until 1956, making his debut in the title role of Rossini's Il barbiere di Siviglia. There he sang the French repertory, both in opera (Gounod's Faust, Delibes' Lakmé, Massenet's Manon and Werther) and in operetta (Angélique, La belle Hélène, Les cloches de Corneville, Miss Heylett, Monsieur Beaucaire). He also appeared there in Puccini's La bohème and Madama Butterfly, and in Smetana's The Bartered Bride. While at the Monnaie, the French soprano Martha Angelici, whose husband was François Agostini, director of the Opéra-Comique at the time, sang in Les pêcheurs de perles with him; she suggested that he audition for the Paris company, which accepted him. ...\n\nSource: Article \"Gabriel Bacquier\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1924-05-17",
        "deathday": "2020-05-13",
        "gender": 2,
        "homepage": null,
        "id": 1681078,
        "imdb_id": "nm0045865",
        "known_for_department": "Acting",
        "name": "Gabriel Bacquier",
        "place_of_birth": "Béziers, Hérault, France",
        "popularity": 0.0676,
        "profile_path": "/eNun9ffKN1WYvR3RfQMJsxJ2Pst.jpg"
    }
}