{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1WRwy3EDc2LVtwauzIMMGVJLEI5.jpg",
                "genre_ids": [
                    18
                ],
                "id": 9787,
                "original_language": "en",
                "original_title": "Lords of Dogtown",
                "overview": "The radical true story behind three teenage surfers from Venice Beach, California, who took skateboarding to the extreme and changed the world of sports forever. Stacy Peralta, Tony Alva and Jay Adams are the Z-Boys, a bunch of nobodies until they create a new style of skateboarding that becomes a worldwide phenomenon. But when their hobby becomes a business, the success shreds their friendship.",
                "popularity": 12.3584,
                "poster_path": "/k2NiPfydLSwmk28C6qpvpJPuqtq.jpg",
                "release_date": "2005-06-03",
                "title": "Lords of Dogtown",
                "video": false,
                "vote_average": 7.102,
                "vote_count": 773,
                "character": "Astronaut",
                "credit_id": "610de47c38469a00724e6a7c",
                "order": 50
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "The Birdman",
            "Anthony Frank Hawk"
        ],
        "biography": "Anthony Frank \"Tony\" Hawk (born May 12, 1968) is an American professional skateboarder. Hawk gained significant fame for completing the first 900 as well as his licensed video game titles distributed by Activision. He is widely considered one of the most successful and influential pioneers of modern vertical skateboarding.\n\nRaised in San Diego, California, Hawk was described as being \"hyperactive\" as a child. His parents supported his skateboarding because it served as an outlet for his excessive energy, and as Hawk's skills developed, he became a professional skateboarder at age fourteen. In 1999, he became the first skater to land a 900. In 2002, he created the Boom Boom HuckJam, an extreme sports exhibition and tour which launched in Las Vegas. Throughout his career, Hawk has made numerous appearances in films and other media, as well as his own series of video games. He has also been involved in various philanthropic activities including his own Tony Hawk Foundation which helps build skateparks in underprivileged areas, and also including collaborations with other athletes in the charity Athletes for Hope.\n\nDescription above from the Wikipedia article Tony Hawk, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1968-05-12",
        "deathday": null,
        "gender": 2,
        "homepage": "https://tonyhawk.com",
        "id": 16832,
        "imdb_id": "nm0005000",
        "known_for_department": "Acting",
        "name": "Tony Hawk",
        "place_of_birth": "San Diego, California, USA",
        "popularity": 0.3628,
        "profile_path": "/gYNmD0a7LemMX6zDZ1lyDs6YYwd.jpg"
    }
}