{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jynfI114q3kOAbIiVjVfFFmttU2.jpg",
                "genre_ids": [
                    80,
                    18,
                    28
                ],
                "id": 101,
                "original_language": "fr",
                "original_title": "Léon",
                "overview": "Léon, the top hit man in New York, has earned a rep as an effective \"cleaner\". But when his next-door neighbors are wiped out by a loose-cannon DEA agent, he becomes the unwilling custodian of 12-year-old Mathilda. Before long, Mathilda's thoughts turn to revenge, and she considers following in Léon's footsteps.",
                "popularity": 11.642,
                "poster_path": "/bxB2q91nKYp8JNzqE7t7TWBVupB.jpg",
                "release_date": "1994-09-14",
                "title": "Léon: The Professional",
                "video": false,
                "vote_average": 8.301,
                "vote_count": 15445,
                "character": "Ball Kid",
                "credit_id": "57e6f3519251412b1e00a4e8",
                "order": 24
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Alex Dezen is a guitar player, solo artist, and the lead singer and songwriter for the now defunct American rock and roll band The Damnwells. He holds an MFA degree in English from The University of Iowa's Iowa Writers' Workshop, where he was a Jeffrey G. and Victoria J. Edwards Fellow. As a songwriter, he has written and released songs for artists such as Justin Bieber, Robin Thicke, Matt Hires, Court Yard Hounds, The Veronicas, and others. He has also written for and worked with a number of additional artist such as The Dixie Chicks, Dave Grohl, Gary Louris of The Jayhawks, Sara Bareilles, Christina Perri, Genevieve Schatz of Company of Thieves, Simple Plan, Jesse & Joy, Bun E. Carlos and many others. He is currently signed to Warner Chappell Music Publishing.\n\nA series of 4 solo EPs, known as \"The Bedhead EPs,\" were released throughout 2014. The first one, titled 1/4, was released on January 21, 2014. The second, titled 2/4, was released on April 22, 2014, and was accompanied by a video, which premiered on the website for American Songwriter magazine. The 3rd EP, titled 3/4, was released on July 22, 2014 The final EP in the series, 4/4, was released on December 30, 2014.\n\nIn 2015, he collaborated with the American dance company Pilobolus, composing the music for the dance piece Wednesday Morning, 11:45 (2015), which premiered at The American Dance Festival in Durham, NC, on June 15, 2015.\n\nThe Damnwells eponymous fifth studio album, featuring the original four members, was released on April 14, 2015.\n\nOn November 3, 2015, Dezen announced a PledgeMusic project of songs written in early 2015 to be released as his first solo album. The project reached its crowdfunding goal in one week. The self-titled album was released by Rock Ridge Music on February 12, 2016, followed by a 9-hour, free internet concert where Dezen performed acoustic versions of every song he has ever released over his 15-year career either with The Damnwells or as a solo artist, including a live, full-band performance of the self-titled solo album live at the High Watt in Nashville, TN. The footage is still available online to view Dezen's YouTube channel.\n\nOn August 23, 2016, Dezen announced another Pledge Music campaign for his second solo album, releasing the song and video for \"Randolph Tonight\" exclusively to Pledgers.\n\nIn August 2017, Dezen released the first recording by his new band, Broken Baby, a rock group featuring his long-time partner and collaborator Amber Marie Bollinger on lead vocals.\n\nSource: Article \"Alex Dezen\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1978-06-26",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.alexdezen.com/",
        "id": 1684474,
        "imdb_id": "nm0223418",
        "known_for_department": "Acting",
        "name": "Alex Dezen",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.0286,
        "profile_path": "/kbcqEB0nDgCwwc5clxXQDMTUw1r.jpg"
    }
}