{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4PPC7fKClu0u7NTbo5xgV4vb5VD.jpg",
                "genre_ids": [
                    80,
                    27,
                    9648
                ],
                "id": 4232,
                "original_language": "en",
                "original_title": "Scream",
                "overview": "A year after the murder of her mother, a teenage girl is terrorized by a masked killer who targets her and her friends by using scary movies as part of a deadly game.",
                "popularity": 10.8717,
                "poster_path": "/lr9ZIrmuwVmZhpZuTCW8D9g0ZJe.jpg",
                "release_date": "1996-12-20",
                "title": "Scream",
                "video": false,
                "vote_average": 7.42,
                "vote_count": 7444,
                "character": "Tatum Riley",
                "credit_id": "52fe43b3c3a36847f8068fa3",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Rose Arianna McGowan ",
            "로즈 맥고완",
            "ローズ・マッゴーワン"
        ],
        "biography": "Rósa Arianna McGowan (born September 5, 1973) is a filmmaker, activist and musician. Born in Italy, she was raised in the Children of God cult, before her American parents fled back to the USA when Rose was 10 amid concerns about the community.\n\nSettling in Oregon, McGowan was bullied at school and rebelled against her family. At 15, she legally emancipated herself from her parents and lived in a squat with drag artists, before moving to Los Angeles to try her hand at acting. Commercials, extra work and a small part in 1992’s 'Encino Man' followed, but McGowan walked away from the industry, deciding to work in cosmetology instead.\n\nIn 1994, while standing outside of an LA gym with a moody demeanor, she was discovered by a casting director for Gregg Araki’s 'The Doom Generation', believing she’d be perfect for the role of Amy Blue, an apathetic gen-X femme fatale. Her performance became synonymous with 90s punk cool, and she was nominated for Best Debut Performance at the 1996 Independent Spirit Awards.\n\nLanding an agent, McGowan quickly found further roles, among them parts in the slasher hit 'Scream' and cult indies including 'Jawbreaker', 'Going All the Way', and 'Devil in the Flesh'. With her pale white skin and blood-red lipstick, along with a relationship with controversial rock star Marilyn Manson, McGowan was promoted as a bad girl sex symbol for the 1990s, but began to struggle finding mainstream success.\n\nOn advice from her management, McGowan joined the cast of the fantasy drama 'Charmed' in its fourth season, replacing the departed Shannen Doherty as one third of a trio of sister witches. After five seasons on the series, McGowan returned to film with roles in Brian De Palma’s 'The Black Dahlia' and the Quentin Tarantino/Robert Rodriguez double bill 'Grindhouse'.\n\nWhile 'Grindhouse' garnered McGowan international attention, particularly for her role as a go-go dancer with a machine gun for a leg, it was an unhappy period in her personal life. A relationship with Rodriguez imploded, a car accident forced her to undergo extensive reconstructive surgery, and her father died.\n\nIn 2015, McGowan announced that she was walking away from acting to explore other ventures, due to her own traumatic experiences in the industry and her frustration with the quality of work promoted by Hollywood.\n\nHer filmmaking debut, the short film 'Dawn', premiered at the 2015 Sundance Film Festival to rave reviews, and in the same year she released her debut single — an atmospheric slice of electronica called RM486. She has since become a prominent activist across social media, launching her own feminist movement known as Rose Army, and continues to work as an artist, filmmaker and musician.\n\nIn 2016 Rose was involved in a sex scandal when multiple sex tapes and nude images were leaked online for the world to see as well as exposing her love for recreational drugs. Some seem to think she leaked the tapes and photos herself for more public exposure and others believe it to be the evils of Hollywood who might be outraged by the fact Rose has spoke out against them.",
        "birthday": "1973-09-05",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 16850,
        "imdb_id": "nm0000535",
        "known_for_department": "Acting",
        "name": "Rose McGowan",
        "place_of_birth": "Certaldo, Florence, Tuscany, Italy",
        "popularity": 1.0037,
        "profile_path": "/x8sHWjQ7cWVcHKhqGR09x0Y0tsP.jpg"
    }
}