{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6JU2ysRVOHqav0Hs6BUv4mvvDxZ.jpg",
                "genre_ids": [
                    28,
                    12,
                    53
                ],
                "id": 646389,
                "original_language": "en",
                "original_title": "Plane",
                "overview": "After a heroic job of successfully landing his storm-damaged aircraft in a war zone, a fearless pilot finds himself between the agendas of multiple militias planning to take the plane and its passengers hostage.",
                "popularity": 7.1452,
                "poster_path": "/qi9r5xBgcc9KTxlOLjssEbDgO0J.jpg",
                "release_date": "2023-01-11",
                "title": "Plane",
                "video": false,
                "vote_average": 6.915,
                "vote_count": 2467,
                "character": "Maria Falco",
                "credit_id": "63580fce43250f007d05c956",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Amber Rivera was born on August 26, 1983 in Tampa, Florida to Edith Morales and Martin Rivera, both from Bayamón, Puerto Rico. She grew up between Florida and Puerto Rico where at a young age she began performing in local stage productions, dance recitals, and commercials. At the age of 13 she competed in the Miss Pre-Teen Florida Pageant and won Miss Photogenic. At 15, Amber represented Puerto Rico at the IMTA competition in New York and was scouted by several talent and modeling agencies from Tokyo, Milan and Los Angeles; she ultimately did not accept any of the contracts as she opted to finish high school. That same year she filmed her first commercial and began studying voice at the Conservatory of Music of Puerto Rico. In 2003, Amber was named \"La Cara de Avon\" (The Face of Avon) by Caras Magazine in Puerto Rico. Amber would go on to study drama at The American Musical and Dramatic Academy in New York City and Improv at The Groundlings in Los Angeles. Amber can be seen in Plane (Lionsgate), starring Gerard Butler, as well as in NBC Peacock's The Resort. She has worked alongside Keaunu Reeves in Replicas (Lionsgate) and Martin Freeman in Start Up (Crackle). Amber starred in the short film Esta es Tu Cuba by award-winning up-and-coming director, Brian Robau, which received numerous accolades including a Student Academy Award, Cine Odessey's Best Actress Award, Cannes American Film Pavilion Award and the HBO Ibero-American Short Film Award. Other credits include The Baker and The Beauty (ABC), The Oath (Crackle), Driven (Universal Pictures), and Speed Kills (Saban Films).\n\n- IMDb Mini Biography By: self-verified",
        "birthday": "1983-08-26",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1685662,
        "imdb_id": "nm2429882",
        "known_for_department": "Acting",
        "name": "Amber Rivera",
        "place_of_birth": "Tampa, Florida, USA",
        "popularity": 0.129,
        "profile_path": "/bHA6eTOHpyFaiybgRUfFRKIJeXG.jpg"
    }
}