{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5n2jz145P1CRdPfA296MmEZF1sQ.jpg",
                "genre_ids": [
                    18
                ],
                "id": 512263,
                "original_language": "en",
                "original_title": "Honey Boy",
                "overview": "The story of a child star attempting to mend his relationship with his law-breaking, alcohol-abusing father over the course of a decade, loosely based on Shia LaBeouf’s life.",
                "popularity": 3.3273,
                "poster_path": "/juBWCym4Gc0XSDOvM7P4eOlzw1P.jpg",
                "release_date": "2019-09-28",
                "title": "Honey Boy",
                "video": false,
                "vote_average": 7.057,
                "vote_count": 705,
                "character": "Percy",
                "credit_id": "5c6d15a10e0a267f9d98a841",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Byron Bowers is an American comedian, writer, and actor. Byron has appeared on The Eric Andre Show on Adult Swim, Comedy Central's Adam DeVine's House Party, and on the reboot of BET's Comic View. He made his late-night debut on The Pete Holmes Show, followed by an appearance on Jimmy Kimmel Live. He appeared in MTV's Guy Code and in the History Channel comedy, The Crossroads of History. He is currently appearing in Lena Waithe's Showtime series drama The Chi as Meldrick. He also played the roommate of Lucas Hedges’ character in the film Honey Boy, which won the Special Jury Prize at the 2019 Sundance Film Festival.\n\nIn 2016, he performed at the Hollywood Bowl on a bill with Flying Lotus, Thundercat, and George Clinton as part of the Brainfeeder festival. He appeared in the horror film KUSO. His TV credits include season 3 of The Meltdown on Comedy Central, Funny as Hell in Montreal for HBO Canada, and Flop House for Viceland. [8] His festival performances include Oddball Comedy Fest, SXSW, Life is Beautiful, Austin City Limits, RIOT, SF Sketchfest, and Blue Whale Comedy Festival in Tulsa, Oklahoma.\n\nBowers grew up in Atlanta, Georgia, and moved to Los Angeles to pursue comedy in 2008.\n\nDescription above from the Wikipedia article Byron Bowers, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1687573,
        "imdb_id": "nm2720892",
        "known_for_department": "Acting",
        "name": "Byron Bowers",
        "place_of_birth": null,
        "popularity": 0.1824,
        "profile_path": "/9p7pTLQwumAqGNKgQOhJesaR5FD.jpg"
    }
}