{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7XmDhCTkce5GH8KCdbMoTZdxn1p.jpg",
                "genre_ids": [
                    18
                ],
                "id": 1913,
                "original_language": "es",
                "original_title": "Mar adentro",
                "overview": "Ramón Sampedro is a ship mechanic and part-time poet left a quadriplegic following a diving accident. Ramón fought for 30 years for the legal right to end his own life. He develops close relationships with his long-term lawyer Julia and his friend Rosa, who tries to convince him that his life is worth living. Despite his situation, Ramón manages to inspire those around him to live life to the fullest.",
                "popularity": 2.1409,
                "poster_path": "/mQW1JJKCUg02cmWBzr9JFu9vM1V.jpg",
                "release_date": "2004-09-03",
                "title": "The Sea Inside",
                "video": false,
                "vote_average": 7.575,
                "vote_count": 964,
                "character": "José",
                "credit_id": "52fe4321c3a36847f803c8c7",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/s3pniDBtG52O26WySm6HY0YLVWh.jpg",
                "genre_ids": [
                    18,
                    36,
                    10749
                ],
                "id": 274109,
                "original_language": "es",
                "original_title": "Palmeras en la nieve",
                "overview": "Spain, 2003. An accidental discovery leads Clarence to travel from the snowy mountains of Huesca to Equatorial Guinea, to visit the land where her father Jacobo and her uncle Kilian spent most of their youth, the island of Fernando Poo.",
                "popularity": 3.3449,
                "poster_path": "/iIVqgTKbqt24bUTzMlyRX8kB1Ac.jpg",
                "release_date": "2015-12-25",
                "title": "Palm Trees in the Snow",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 534,
                "character": "Old Kilian",
                "credit_id": "570ff944c3a36831e1000cdd",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Bugallo started in the world of acting in Logroño , where he lived for six years during his youth and was a member of the independent groups Lope de Rueda and Adefesio Studio Theatre , in addition to founding and directing JUBY ( United Youth Quarter Yague ) where he lived, and in 1976 won the National Award for Comedy Theatre with The altarpiece flautist of Jordi Teixidó.\n\nBecome one of the best stage actors of the national scene, Bugallo not made ​​his film debut until the age of 52 under the command of José Luis string in the language of butterflies . Since then reveals himself as one of the most talented side of national cinema thanks to titles like Los lunes al sol , of Fernando León de Aranoa , and the life that awaits you , from Manuel Gutiérrez Aragón.\n\nOne of the most familiar faces in the series and recent Galician films, although nationwide recognition he comes from the hand of Alejandro Amenábar , with its paper brother Ramón Sampedro in The Sea Inside , an interpretation that earned him a Goya Award for Best Supporting Actor Award and the Association of Spanish actors ( Actors' Union ).\n\nAnother big movie role he arrives with the film The Night of the Sunflowers (2006) and Amadeo, the end of the Civil Guard in a village in Castilla y León , where his performance is remarkable: embodies an experienced caiman, I incanecido in the art, imbued with humanity and finesse, and chooses not to comply with their duty of love for his daughter.\n\nHis recent work includes 53 days of Winter (2006), Shame (2007) and Courage (2009). Well as leading roles in Ashes Sky (2008) and Amador (2010), his second collaboration with Fernando León de Aranoa.\n\nHe has extensive experience in theater and founder of the theater companies Carrot Olympus and TE, well have belonged to other Galician and logroñesas companies. Performs various assemblies in Galicia between 1988 and 1992 . In 1995 he founded the AFAP ( Classroom Training Actors Pontevedra ), exclusively dedicated to the training of actors based on the theories of Stanislavsky and directed many productions, most represented in Galician, as Prelude to the theater, the damage it does snuff or Awakening",
        "birthday": "1947-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 16870,
        "imdb_id": "nm0119438",
        "known_for_department": "Acting",
        "name": "Celso Bugallo",
        "place_of_birth": null,
        "popularity": 0.0932,
        "profile_path": "/qtwvr4et0jxNGKISJFDL0YmGRTY.jpg"
    }
}