{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4s2d3xdyqotiVNHTlTlJjrr3q0H.jpg",
                "genre_ids": [
                    12,
                    10751,
                    16,
                    28,
                    35
                ],
                "id": 177572,
                "original_language": "en",
                "original_title": "Big Hero 6",
                "overview": "A special bond develops between plus-sized inflatable robot Baymax, and prodigy Hiro Hamada, who team up with a group of friends to form a band of high-tech heroes.",
                "popularity": 17.3989,
                "poster_path": "/2mxS4wUimwlLmI1xp6QW6NSU361.jpg",
                "release_date": "2014-10-24",
                "title": "Big Hero 6",
                "video": false,
                "vote_average": 7.727,
                "vote_count": 16088,
                "character": "Male Technician #1 (voice) (uncredited)",
                "credit_id": "65e5323144a424014a10ed84",
                "order": 46
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "amazingphil"
        ],
        "biography": "Philip Michael \"Phil\" Lester is a British YouTuber, vlogger and radio personality. He is best known for his YouTube channel “AmazingPhil”.  Together with frequent collaborator Dan Howell, Lester presented Sunday night entertainment show Dan and Phil on BBC Radio 1 from January 2013 until August 2014.\n\nLester was raised in Rawtenstall, Lancashire. He completed a degree in English Language and Linguistics from the University of York and a post graduate in the Department of Theatre, Film and television, going on to obtain a Master of Arts in Video Postproduction with Specialisation in Visual Effects. Lester has lived with fellow YouTuber Dan Howell since August 2011; the pair moved to London in July 2012 and recently built a house together.\n\nOn 26 March 2015, Howell and Lester announced they had co-written a book through a trailer on his channel called The Amazing Book Is Not on Fire (TABINOF). It was released in the UK on 8 October 2015 and worldwide on 15 October 2015. The book topped the General Hardbacks Sunday Times Bestsellers list having sold 26,745 copies in the UK in the first week of its release. It also became a #1 New York Times Bestseller in the young adult hardcover list.\n\nIn the same trailer the pair announced their theatrical stage show The Amazing Tour Is Not on Fire (TATINOF) which travelled around the UK during October and November 2015, ending at the London Palladium. On 22 April 2016 they are took the tour to the US which began at Playlist Live in Orlando, Florida and ended on 24 June 2016 at the Dolby in Hollywood, CA. It was the largest tour ever by YouTube creators. They're also touring in Australia in August 2016 starting in Perth and ending in Brisbane.\n\nOn 24 June 2016 they announced The Amazing Tour Is Not on Fire is to be released as a YouTube Originals film along with a making of documentary. Both films will be released on October 5th, 2016. They are the first British YouTube creators to release content on the YouTube Red platform. Alongside this in November 2016 they are releasing a photobook named Dan and Phil Go Outside which includes a personal collection of candid photos and insightful stories from their tour.",
        "birthday": "1987-01-30",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1688572,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Phil Lester",
        "place_of_birth": "Bury, England, UK",
        "popularity": 0.0505,
        "profile_path": "/hyLV8MvK2lnPUJk02lxX1uCawzW.jpg"
    }
}