{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/d9eONXYtCmQnPWw61w9pNMGlSzK.jpg",
                "genre_ids": [
                    35,
                    18,
                    14,
                    10749
                ],
                "id": 1262,
                "original_language": "en",
                "original_title": "Stranger Than Fiction",
                "overview": "Harold Crick is a lonely IRS agent whose mundane existence is transformed when he hears a mysterious voice narrating his life.",
                "popularity": 3.9908,
                "poster_path": "/nCzcepubwShvZ4vbCsygQNgF2Z1.jpg",
                "release_date": "2006-09-09",
                "title": "Stranger Than Fiction",
                "video": false,
                "vote_average": 7.282,
                "vote_count": 2390,
                "character": "Animal Footage Voice Over (voice)",
                "credit_id": "56c479489251416bb70022ab",
                "order": 64
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Bob Pappenbrook",
            "Robert Papenbrook"
        ],
        "biography": "Robert DeWayne Papenbrook (September 18, 1955 – March 17, 2006) was an American voice actor.\n\nFellow voice actors often nicknamed him \"Pappy\". He was very well known in the worlds of anime and video game voice-overs for his voice acting of \"gruff\" characters. However, he was especially well known in his various live action voice-overs which, most notably, included the Power Rangers franchise. He was discovered by filmmakers Steven Spielberg and George Lucas, which got him his very first voice acting role in the hit film Raiders of the Lost Ark as the voices of all the Hovito natives who pursue Indiana Jones in the beginning of the film. His best-known roles included the voices of Rito Revolto in Mighty Morphin Power Rangers and Power Rangers Zeo, Shadowborg in Big Bad Beetleborgs, Scorpix in Beetleborgs Metallix and Deviot in Power Rangers: Lost Galaxy.\n\nAside from acting, he also taught kickboxing and other martial arts. He and his wife Debbie Rothstein married in 1978 and had a son, Bryce Papenbrook, who is also a voice actor.\n\nOn March 17, 2006, Papenbrook died of chronic lung problems at the age of 50. The 2008 DVD Adventures in Voice Acting was dedicated to him (whose appearance was filmed before his death).\n\nSource: Article \"Bob Papenbrook\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1955-09-18",
        "deathday": "2006-03-17",
        "gender": 2,
        "homepage": null,
        "id": 168992,
        "imdb_id": "nm0653071",
        "known_for_department": "Acting",
        "name": "Bob Papenbrook",
        "place_of_birth": "San Diego, California, USA",
        "popularity": 0.1315,
        "profile_path": "/c6osjbHJq4od6Dv3tdxlUDjM05V.jpg"
    }
}