{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/aL53oMdZKZRJRH8txH07DLuleF9.jpg",
                "genre_ids": [
                    14,
                    12,
                    28
                ],
                "id": 284052,
                "original_language": "en",
                "original_title": "Doctor Strange",
                "overview": "After his career is destroyed, a brilliant but arrogant surgeon gets a new lease on life when a sorcerer takes him under her wing and trains him to defend the world against evil.",
                "popularity": 9.5286,
                "poster_path": "/uGBVj3bEbCoZbDjjl9wTxcygko1.jpg",
                "release_date": "2016-10-25",
                "title": "Doctor Strange",
                "video": false,
                "vote_average": 7.418,
                "vote_count": 22792,
                "character": "Girl on the Bus (uncredited)",
                "credit_id": "5e84c9ed5294e70011493899",
                "order": 32
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Juani Feliz is an actress born in the Dominican Republic and raised in the Bronx. Juani got bit by the acting bug after getting involved in her first school play at the age of 14 and landing her first TV and film roles a year later. Her acting career took a backseat when she left NY to attend Harvard College. Wanting to explore the sciences in college, she studied Biomedical Engineering at Harvard. Right out of college, Feliz worked at the Wyss Institute for Biologically Inspired Engineering in Boston, where she worked on a clinical trial for a melanoma cancer vaccine and helped develop biomaterials and drug delivery systems. During this time she also completed a Master's degree at Harvard.\n\nDespite having a blooming career in bioengineering, Juani yearned to return to acting. She moved back to NYC in 2016 to restart her acting career. Since her return, Juani has made it on the big screen with her roles in The Purge: Election Year and Canal Street. She has worked on various TV shows like Blue Bloods, Power, Shades of Blue, One Dollar and was one of 12 actors chosen to be a part of the 2017 ABC Discovers: NY Talent Showcase. Before the pandemic, Juani filmed her first network pilot as a series regular on the ABC romantic dramedy Until The Wedding and filmed for a major supporting role in the upcoming feature film Quiet In My Town.\n\nCurrently, Juani can be seen as Alejandra Lopez in FX's Fleishman Is In Trouble, as Carmen in Ava DuVernay's HBO Max series DMZ , and as Isabela in the first and second season of Tracy Oliver and Amy Poehler's Amazon comedy Harlem. She also recently guest-starred in episodes of The Rookie: Feds, The Good Doctor and NCIS: Hawaii. On the film side, Juani just wrapped filming as a lead in the indie thriller Birthrite and she will next be seen in Alex Garland's A24 action epic Civil War.\n\nJuani's on-screen presence has started to garner the attention of Latin America. She was recently nominated for the 2023 \"Best Actor/Actress Abroad\" award in the Dominican Republic's biggest award show, Premios Soberano. Last year, Juani was named one of People en Español's \"50 Mas Bellos\" (\"50 Most Beautiful\") of 2022. Juani's goal is to play roles and tell stories that break the mold and defy stereotypes of Latina women in America, just as she has been able to do in real life. She hopes to use her artistic platform to inspire strength, confidence and possibility in women, people of color, the LGBTQ+ community, and anyone that finds themselves fighting adversity in pursuit of their dreams.",
        "birthday": "1989-01-03",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.juanifeliz.com/",
        "id": 1689329,
        "imdb_id": "nm2535554",
        "known_for_department": "Acting",
        "name": "Juani Feliz",
        "place_of_birth": "Dominican Republic",
        "popularity": 0.3711,
        "profile_path": "/qDr3nNbTRwBBNQLnF4UCiTCVfPQ.jpg"
    }
}