{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8lBcqakI3F19NWkXdqE0M8W76b9.jpg",
                "genre_ids": [
                    28,
                    18,
                    36,
                    10752
                ],
                "id": 197,
                "original_language": "en",
                "original_title": "Braveheart",
                "overview": "Enraged at the slaughter of Murron, his new bride and childhood love, Scottish warrior William Wallace slays a platoon of the local English lord's soldiers. This leads the village to revolt and, eventually, the entire country to rise up against English rule.",
                "popularity": 11.4772,
                "poster_path": "/or1gBugydmjToAEq7OZY0owwFk.jpg",
                "release_date": "1995-05-24",
                "title": "Braveheart",
                "video": false,
                "vote_average": 7.944,
                "vote_count": 10594,
                "character": "Young soldier",
                "credit_id": "55dc9fbb92514174520002fe",
                "order": 44
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "​From Wikipedia, the free encyclopedia\n\nDavid McKay is a Scottish actor and television director.\n\nIn the television series Shoebox Zoo, he plays McTaggart. McTaggart is the Keeper of the Book of Forbidden Knowledge who has been bound to stay with Michael Scott until the book is found by Marnie (Vivien Endicott-Douglas). McTaggart has been a number of people in the first series. A tour guide, a servant to Michael and Toledo and a clown. Now as the second series unfolds, he must help Marnie and Michael as much as he can to help find the Book and stop Toledo taking over and finding the Book before Marnie.\n\nHe has also appeared in two Ken Loach films: Ae Fond Kiss... and My Name Is Joe. He has also had roles in Once Upon a Time in the Midlands, Les Misérables (1998), Braveheart and Rab C Nesbitt, among others.\n\nHe has directed for High Times, The Basil Brush Show, Tinsel Town and My Parents Are Aliens, and has written and directed a short film, Caesar, on pigeon-fancying.\n\nDescription above from the Wikipedia article David McKay (actor), licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 16908,
        "imdb_id": "nm0570954",
        "known_for_department": "Acting",
        "name": "David McKay",
        "place_of_birth": "Glasgow, Scotland, UK",
        "popularity": 0.1318,
        "profile_path": "/o2m5gIGsoV2uMWHoEj2ir6OSuwa.jpg"
    }
}