{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sTOhZruocNubL0HxjvdouwCEL9I.jpg",
                "genre_ids": [
                    16,
                    10751,
                    12,
                    35
                ],
                "id": 364689,
                "original_language": "en",
                "original_title": "Ferdinand",
                "overview": "Ferdinand, a little bull, prefers sitting quietly under a cork tree just smelling the flowers versus jumping around, snorting, and butting heads with other bulls. As Ferdinand grows big and strong, his temperament remains mellow, but one day five men come to choose the \"biggest, fastest, roughest bull\" for the bullfights in Madrid and Ferdinand is mistakenly chosen.  Based on the classic 1936 children's book by Munro Leaf.",
                "popularity": 10.0324,
                "poster_path": "/rMm94JsRfcOPiPVsTRcBiiVBOhz.jpg",
                "release_date": "2017-12-09",
                "title": "Ferdinand",
                "video": false,
                "vote_average": 7.222,
                "vote_count": 2975,
                "character": "Additional Voices (voice)",
                "credit_id": "5ac792490e0a26496702b4e3",
                "order": 42
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Laura Bayonas started working in movies at the age of 4, and when 7 years old, she played her first lead in the short \"Correo de guerra\" (1972) together with her mother — Lola Salvador, a well known scriptwriter and film producer. Since then she has accomplished a strong career in Europe, having lead roles in film and TV with well known Spanish directors, like Jose Luis Bunuel, Jaime Chavarri, Julio Medem, Alfonso Ungria, Fernando Fernan Gomez, Jose Luis Cuerda, Manolo Matji, Jose Luis Berlanga and others.\n\nAs a writer, Laura published her novel \"Yes Father, no Father\", a radical critic against parental education, which was a best seller in the 90's. She received an award for her first screenplay \"Panfilas\" by ICAA, Ministerio De Cultura of Spain.\n\nAfter moving from Spain, Bayonas is living in Los Angeles, California. Her most recent Hollywood-work is in \"CharlottaTS\" (2011, Lewis Teague).",
        "birthday": "1965-01-01",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1692648,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Laura Bayonas",
        "place_of_birth": "  Madrid, Spain",
        "popularity": 0.1411,
        "profile_path": "/emth0tpGgPq6tKC6fwCoEXER9VZ.jpg"
    }
}