{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mgDv2dDihyetAcENxyf2tpXY245.jpg",
                "genre_ids": [
                    10402,
                    18
                ],
                "id": 1407,
                "original_language": "fr",
                "original_title": "La Môme",
                "overview": "From the mean streets of the Belleville district of Paris to the dazzling limelight of New York's most famous concert halls, Edith Piaf's life was a constant battle to sing and survive, to live and love. Raised in her grandmother's brothel, Piaf was discovered in 1935 by nightclub owner Louis Leplee, who persuaded her to sing despite her extreme nervousness. Piaf became one of France's immortal icons, her voice one of the indelible signatures of the 20th century.",
                "popularity": 3.028,
                "poster_path": "/3b9DAONAsFRhJKu25R33PE3VwDh.jpg",
                "release_date": "2007-02-14",
                "title": "La Vie en Rose",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 1667,
                "character": "Louis Gassion",
                "credit_id": "52fe42f3c3a36847f802f50d",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/1Cuaush5VwesuZJzJRy2ptfalCh.jpg",
                "genre_ids": [
                    10751,
                    14,
                    35,
                    12
                ],
                "id": 2899,
                "original_language": "fr",
                "original_title": "Astérix & Obélix : Mission Cléopâtre",
                "overview": "History's favorite Gauls assist Queen Cleopatra when she wagers that the Egyptian people can build a palace for Julius Caesar in just three months.",
                "popularity": 6.3522,
                "poster_path": "/5gMmVSkY7RAxb5xRk7ej7JVhXyl.jpg",
                "release_date": "2002-01-30",
                "title": "Asterix & Obelix: Mission Cleopatra",
                "video": false,
                "vote_average": 7.373,
                "vote_count": 3654,
                "character": "Caius antivirus",
                "credit_id": "52fe4373c3a36847f80551bf",
                "order": 15
            },
            {
                "adult": false,
                "backdrop_path": "/zhceTJ7NOzgtTRkvmD5bumw74Lj.jpg",
                "genre_ids": [
                    35,
                    10751
                ],
                "id": 19100,
                "original_language": "fr",
                "original_title": "Nos jours heureux",
                "overview": "Set in 1992, a manager Vincent has to run a children's holiday camp for three weeks and to face the unexpected concerning the place, his colleagues, various problems linked to children about the rooms, trips, their belongings...",
                "popularity": 3.8147,
                "poster_path": "/507mUw7mtYpmjwJncOggw9gBZcG.jpg",
                "release_date": "2006-06-28",
                "title": "Those Happy Days",
                "video": false,
                "vote_average": 7.352,
                "vote_count": 1065,
                "character": "Vincent",
                "credit_id": "52fe47ba9251416c750a37c1",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/vOpm4wQk5qIl8UepoKrpaloqaPC.jpg",
                "genre_ids": [
                    18,
                    10749,
                    10752
                ],
                "id": 2841,
                "original_language": "fr",
                "original_title": "Un long dimanche de fiançailles",
                "overview": "Young Frenchwoman Mathilde searches for the truth about her missing fiancé, lost during World War I, and learns many unexpected things along the way. The love of her life is gone. But she refuses to believe he's gone forever — and she needs to know for sure.",
                "popularity": 3.7861,
                "poster_path": "/t73m7lX0eFYDjlB1Gcb7r3S5Yt.jpg",
                "release_date": "2004-10-27",
                "title": "A Very Long Engagement",
                "video": false,
                "vote_average": 7.326,
                "vote_count": 1257,
                "character": "The Factor",
                "credit_id": "57e2ac9bc3a3681a640071a5",
                "order": 18
            },
            {
                "adult": false,
                "backdrop_path": "/10ECHyeW7vZMjCLSRLak9K5fVdB.jpg",
                "genre_ids": [
                    35
                ],
                "id": 432068,
                "original_language": "fr",
                "original_title": "Le Sens de la fête",
                "overview": "Max is a battle-weary veteran of the wedding-planning racket. His latest — and last — gig is a hell of a fête, involving stuffy period costumes for the caterers, a vain, hyper- sensitive singer who thinks he's a Gallic James Brown, and a morose, micromanaging groom determined to make Max's night as miserable as possible. But what makes the affair too bitter to endure is that Max's colleague and ostensible girlfriend, Joisette, seems to have written him off, coolly going about her professional duties while openly flirting with a much younger server. It's going to be a very long night… especially once the groom's aerial serenade gets underway.",
                "popularity": 2.3562,
                "poster_path": "/e9hIxAKPdXo9Fgwca6vT4USOXK6.jpg",
                "release_date": "2017-10-04",
                "title": "C'est la vie!",
                "video": false,
                "vote_average": 7.02,
                "vote_count": 1515,
                "character": "Guy",
                "credit_id": "58641bb59251412b7b011559",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Les Robin des Bois",
            "Les Robins des Bois",
            "Jean Paul Rouve",
            "让-保罗·鲁夫"
        ],
        "biography": "Jean-Paul Rouve, born January 26, 1967 in Dunkerque (France), is a French actor and director.\n\nOnly son, Jean-Paul Rouve grew up in Dunkerque, and was introduced to the theater during his schooling. He took courses at the national drama center of Nord-Pas de Calais and founded an amateur theater troupe. After his baccalaureate, he left for Lille to study information and communication sciences. In 1989, thanks to one of his friends, Emmanuelle Lepoutre, he attended a course given by Isabelle Nanty in a theater school, the Cours Florent, and decided to stay in Paris to study comedy.\n\nHe was revealed to the general public in the Robins des Bois comic troupe during the 1990s.\n\nHe established himself during the 2000s as a recurring second role in French cinema, in different genres. Thus, he won the César for best male hope in 2003 for his performance in the historical drama Monsieur Batignole, by Gérard Jugnot, then was nominated for the César for best actor in a supporting role in 2005 for his incarnation of a lookalike of Michel. Polnareff in the comedy Podium, by Yann Moix. In 2006, he played a director of a summer camp in the comedy Nos jours bonheurs, by Éric Toledano and Olivier Nakache, before playing Louis Gassion in the biographical film La Môme (2007), by Olivier Dahan.\n\nDuring the 2010s, he especially won the role of Jeff Tuche, in the series of successful comedies Les Tuche directed by Olivier Baroux. He is also pursuing a career as a director of films with a more dramatic sensitivity, with When I will be little (2012), Les Souvenirs (2014) and Lola et ses frères (2018).",
        "birthday": "1967-01-26",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 16922,
        "imdb_id": "nm0746162",
        "known_for_department": "Acting",
        "name": "Jean-Paul Rouve",
        "place_of_birth": "Dunkerque, Nord, France",
        "popularity": 0.326,
        "profile_path": "/kU1AyNsgsyEGjNbvBo9EOHJaeUz.jpg"
    }
}