{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ApnB7gY4MrWoPqIw17lEMp1mXJD.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 1633,
                "original_language": "en",
                "original_title": "Fried Green Tomatoes",
                "overview": "Amidst her own personality crisis, a southern housewife meets an outgoing old woman who tells her the story of Idgie Threadgoode and Ruth Jamison, two young women who experienced hardships and love in 1920s Whistle Stop, Alabama.",
                "popularity": 3.9369,
                "poster_path": "/g71l1vbJwyAAYk8zKCkIQQ58qcb.jpg",
                "release_date": "1991-12-27",
                "title": "Fried Green Tomatoes",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 1403,
                "character": "Big George",
                "credit_id": "5305afc492514134881741bf",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/wC36tEU7AqP5llAvjXkZhZ248tX.jpg",
                "genre_ids": [
                    18
                ],
                "id": 1366,
                "original_language": "en",
                "original_title": "Rocky",
                "overview": "Rocky Balboa is a Philadelphia club fighter who seems to be going nowhere. But when a stroke of fate puts him in the ring with a world heavyweight champion, Rocky knows that it's his one shot at the big time — a once-in-a-lifetime opportunity to go the distance and come out a winner!",
                "popularity": 11.8538,
                "poster_path": "/8kEun6U9hTddM7NEfLLCGQKU2Mp.jpg",
                "release_date": "1976-11-20",
                "title": "Rocky",
                "video": false,
                "vote_average": 7.8,
                "vote_count": 8230,
                "character": "Dipper",
                "credit_id": "55d7d1fd92514143f000085d",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "استن شاو"
        ],
        "biography": "Stan Shaw (born July 14, 1952) is an American actor.\n\nBorn in Chicago, Illinois, he is the son of Bertha Shaw and saxophonist Eddie Shaw, and cousin of the late soul singers Sam Cooke and Tyrone Davis. Shaw started his acting career in the Chicago production of the Broadway musical Hair as well as the Broadway production of The Me Nobody Knows. His last Broadway show, Via Galactica was directed by Sir Peter Hall.\n\nBefore becoming an actor, Shaw was a karate, judo, and jujutsu instructor in Chicago. He holds first dan black belt in judo and jujutsu and a second dan in karate.\n\nShaw appeared in Rocky (1976) as Dipper, another boxer. In a deleted scene, Dipper, infuriated by the attention Rocky has received, challenges him before a television reporter. He also played a professional fighter in Tough Enough (1983), Harlem Nights (1989), and Snake Eyes (1998). One of his most notable roles was his appearance as Alex Haley's maternal grandfather Will Palmer in the 1979 miniseries Roots: The Next Generations. Another highly notable role was Private Washington in The Boys in Company C (1978). Shaw also played in The Great Santini (1979) as Toomer Smalls with Robert Duvall and David Keith. After a part in the 1991 film Fried Green Tomatoes, he had a role in the 1995 comedy Houseguest alongside Sinbad and appeared as a pirate in Cutthroat Island with Geena Davis. His television credits include episodes of Matlock, Murder, She Wrote, The X-Files, and a 2009 episode of CSI.\n\nDescription above from the Wikipedia article Stan Shaw, licensed under CC-BY-SA, full list of contributors on Wikipedia.​",
        "birthday": "1952-07-14",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 16936,
        "imdb_id": "nm0789976",
        "known_for_department": "Acting",
        "name": "Stan Shaw",
        "place_of_birth": "Chicago, Illinois, USA",
        "popularity": 0.4517,
        "profile_path": "/gq8VmKHlSZuBKBdwXFP48rIY4WR.jpg"
    }
}