{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/j44XhCxpLTi8WnrX52H83Z86ovG.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 695,
                "original_language": "en",
                "original_title": "Short Cuts",
                "overview": "Many loosely connected characters cross paths in this film, based on the stories of Raymond Carver. Waitress Doreen Piggot accidentally runs into a boy with her car. Soon after walking away, the child lapses into a coma. While at the hospital, the boy's grandfather tells his son, Howard, about his past affairs. Meanwhile, a baker starts harassing the family when they fail to pick up the boy's birthday cake.",
                "popularity": 7.2163,
                "poster_path": "/mbNTvbtWfV4soyErimDTdX67OAr.jpg",
                "release_date": "1993-10-01",
                "title": "Short Cuts",
                "video": false,
                "vote_average": 7.216,
                "vote_count": 637,
                "character": "Jerry Dunphy",
                "credit_id": "52fe426cc3a36847f801d567",
                "order": 28
            },
            {
                "adult": false,
                "backdrop_path": "/uw4SnKFZ453Gxmj5XR5Susj8TNo.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 602,
                "original_language": "en",
                "original_title": "Independence Day",
                "overview": "Strange phenomena surface around the globe. The skies ignite. Terror races through the world's major cities. As these extraordinary events unfold, it becomes increasingly clear that a force of incredible magnitude has arrived. Its mission: total annihilation over the Fourth of July weekend. The last hope to stop the destruction is an unlikely group of people united by fate and unimaginable circumstances.",
                "popularity": 7.9562,
                "poster_path": "/p0BPQGSPoSa8Ml0DAf2mB2kCU0R.jpg",
                "release_date": "1996-06-25",
                "title": "Independence Day",
                "video": false,
                "vote_average": 6.896,
                "vote_count": 9970,
                "character": "Self",
                "credit_id": "5ea48779db72c00026bcc18b",
                "order": 95
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "The Dean of Los Angeles Broadcasting"
        ],
        "biography": "Jerry Dunphy was an American television news anchor in the Los Angeles/Southern California media market. He was best known for his intro \"From the desert to the sea, to all of Southern California, a good evening.\"\n\nAfter serving as a pilot in World War II, Dunphy began his broadcast television career in 1953. He was the news director/anchor at then-CBS owned-and-operated (O&O) WXIX (now CW affiliated WVTV) in Milwaukee. Dunphy also was a sports reporter at another CBS O&O, WBBM-TV, in Chicago. Dunphy also served as a color commentator for Green Bay Packers telecasts on CBS in 1956.\n\nIn 1960, Dunphy took over the anchor chair at the Los Angeles CBS O&O station KNXT (now KCBS-TV), where he anchored Los Angeles' most popular newscast, later titled \"The Big News\", a program that often attracted a quarter of Los Angeles television owners, ratings unheard of in the market. He was still popular when fired in 1975, yet KNXT sought to adopt a faster-paced, \"Eyewitness News\" type format. It was then that Dunphy joined KABC-TV, bringing it to the top of the ratings, making it Southern California's news leader. Since Dunphy's unceremonious firing, Channel 2 never recovered in the ratings, until the mid-2000s. Dunphy left KABC-TV in 1989 and joined the upstart KCAL-TV that July (when it was still KHJ-TV) as one of the pioneering anchors of the three-hour primetime news format, \"Prime 9 News\". He returned to KCBS-TV in 1995 and remained until 1997 as an anchorman, and rejoined KCAL-TV in 1997, where he remained until his death.\n\nDunphy was one of the first newscasters to interview President Richard Nixon after his resignation in 1974. He would later sit down with Ronald Reagan, Jimmy Carter, and Gerald Ford. Dunphy also performed regular cameos in L.A.-based films including Warning Shot, Night of the Lepus, Oh God!, Short Cuts, The Jerky Boys and Independence Day, as well as in episode 6 of Batman Film Way,,,Way Out, and is considered to be the inspiration for two fictional television characters: Ted Baxter on The Mary Tyler Moore Show and Kent Brockman on The Simpsons (the director of \"Krusty Gets Busted\", Brad Bird, designed the character and modeled him after anchorman Ted Koppel.\n\nDunphy was also a songwriter. One of his songs was called, appropriately, \"From the Desert to the Sea\" and was recorded by country music star T.G. Sheppard.\n\nOn May 9, 1984, Dunphy received a star on the Hollywood Walk of Fame for his work in the television industry, located at 6669 Hollywood Boulevard.  He succumbed to a heart attack on May 20, 2002.",
        "birthday": "1921-06-09",
        "deathday": "2002-05-20",
        "gender": 2,
        "homepage": null,
        "id": 169317,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Jerry Dunphy",
        "place_of_birth": "Milwaukee, Wisconsin, USA",
        "popularity": 0.081,
        "profile_path": null
    }
}