{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zzK0HDEswyhHFDFWlPz6HdgXKH5.jpg",
                "genre_ids": [
                    10749,
                    18
                ],
                "id": 820525,
                "original_language": "en",
                "original_title": "After Everything",
                "overview": "Besieged by writer’s block and the crushing breakup with Tessa, Hardin travels to Portugal in search of a woman he wronged in the past – and to find himself. Hoping to win back Tessa, he realizes he needs to change his ways before he can make the ultimate commitment.",
                "popularity": 8.1319,
                "poster_path": "/uQxjZGU6rxSPSMeAJPJQlmfV3ys.jpg",
                "release_date": "2023-09-13",
                "title": "After Everything",
                "video": false,
                "vote_average": 6.872,
                "vote_count": 940,
                "character": "Nathalie",
                "credit_id": "6441b4e7651fcf02fb9c2851",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/4HXiEsWUEMzJNFwjJv6oUaocqJU.jpg",
                "genre_ids": [
                    10752,
                    18,
                    10749
                ],
                "id": 468224,
                "original_language": "en",
                "original_title": "Tolkien",
                "overview": "England, early 20th century. The future writer and philologist John Ronald Reuel Tolkien (1892-1973) and three of his schoolmates create a strong bond between them as they share the same passion for literature and art, a true fellowship that strengthens as they grow up, but the outbreak of World War I threatens to shatter it.",
                "popularity": 5.9598,
                "poster_path": "/A7eYO3t7oZQdfJj5KlJBI7GhT9H.jpg",
                "release_date": "2019-05-03",
                "title": "Tolkien",
                "video": false,
                "vote_average": 6.937,
                "vote_count": 1471,
                "character": "Young Edith Bratt",
                "credit_id": "5d64be28ad50f06b03453b2a",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Mimi Saeed",
            "Mimi Roshan Saeed",
            "میمی کین"
        ],
        "biography": "Mimi Roshan Saeed (born 5 August 1998), better known as Mimi Keene, is an English actress. She is known for her roles as Cindy Williams on the BBC soap opera EastEnders (2013–2015), Ruby Matthews on the Netflix comedy-drama series Sex Education (2019–2023), and Nathalie in the film After Everything (2023).\n\nKeene began her career as a child actress on stage, making her professional debut playing Janey in Kin at The Royal Court Theatre from 19 November to 23 December 2010. In 2013, she appeared in CBBC's Sadie J as Brandy May Lou and in Our Girl as Jade Dawes. Between 2013 and 2015, she was a series regular in EastEnders, playing Cindy Williams. For her role, she earned British Soap Award and Inside Soap Award nominations. She voiced Euryale, Stheno, and Medusa in the 2013 video game Castlevania: Lords of Shadow – Mirror of Fate and its 2014 sequel Castlevania: Lords of Shadow 2. In 2016, she appeared in an episode of Casualty as Lana Westmore, and played Megan in a short film, The Escape, in 2017. In 2019, she portrayed the younger version of Edith Tolkien in Tolkien, also in 2019 she began playing Ruby Matthews in the Netflix series Sex Education, and appeared in the film Close. In 2023, Keene appeared in the film After Everything.\n\nDescription above from the Wikipedia article Mimi Keene, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1998-08-05",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1694711,
        "imdb_id": "nm5488579",
        "known_for_department": "Acting",
        "name": "Mimi Keene",
        "place_of_birth": "Woodford, England, UK",
        "popularity": 0.8701,
        "profile_path": "/7bUgfaycm0f6PgEn3eLo8oANByO.jpg"
    }
}