{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yriYPLqyFqPW0QXaegT1KmWXk9a.jpg",
                "genre_ids": [
                    878,
                    53
                ],
                "id": 1954,
                "original_language": "en",
                "original_title": "The Butterfly Effect",
                "overview": "A young man struggles to access sublimated childhood memories. He finds a technique that allows him to travel back into the past, to occupy his childhood body and change history. However, he soon finds that every change he makes has unexpected consequences.",
                "popularity": 8.8434,
                "poster_path": "/ea5iv7TWMh18fOKoRGgmtcg85Gx.jpg",
                "release_date": "2004-01-17",
                "title": "The Butterfly Effect",
                "video": false,
                "vote_average": 7.574,
                "vote_count": 7841,
                "character": "Spencer",
                "credit_id": "53a99721c3a3687495006424",
                "order": 23
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jesse Hutchakowski "
        ],
        "biography": "Sharing the same Birth place as Marvel Character Wolverine, Jesse James Hutch was born in Alberta Canada. At the age of ten he watched his first film, the animated movie \"The Hobbit\", and was instantly hooked on the art of story telling. Through out high school Jesse was known as \"Hardcore\" Hutch, because of his outdoor adrenaline hobbies which included: white water rafting, white water kayaking, free climbing and mountain biking. Often times these hobbies were recorded on video and turned into short movies. At one point in Hutch's High School History class he Acted and played out a hostage take over scenario for a presentation. The teacher was apprehended, smoke grenades went off, paintball guns were used and the fire alarm went off. His marks for presentation were high, minus a few points because of the fire department being called.\n\nA collector of Movie Posters, some would say Hutch was an \"Actor\" even as a young boy, It was in 2001 that the title of \"Thespian\" became a professional one.\n\nHis first official audition, which he booked, was for Dark Angel(FOX) in which he played the role of a Mutant, his second audition for Wolf Lake(CBS), which he also booked, had to be passed on due to a filming conflict with Dark Angel. Many Lead roles include that of:\n\nRomantic Comedy Teacher(Hallmark) My Boyfriends Dogs, Race Car Driver(Jordan Wells) 20th Century Fox: Joy Ride 3, Luke Bailey: Cedar Cove Season 2(Hallmark), Navy Seal: True Justice(Reelz), College Hunk: About a Girl(N Network), Hard Working Mans Man on The Hallmark Romantic Comedy Let it Snow, starring alongside Candace Cameron Bure(Full House).\n\nRoles on TV Series such as Almost Human, Once Upon A Time, American Dreams, Smallville, Kyle xy & Heartland are but a few of Hutch's recognizable credits alongside Feature films such as: The Butterfly Effect, Freddy vs Jason, Scary Movie 3 & Joy Ride 3.\n\nPerforming almost all of his own stunts to date, Hutch has always had an attraction to Action and Adrenaline. Kick Boxing & Muay Thai are some of his past training.\n\nJesse Hutch's most important Lead roles are: Husband,Father, Son, Brother & Wild Man.  - IMDb Mini Biography",
        "birthday": "1981-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 169469,
        "imdb_id": "nm1237948",
        "known_for_department": "Acting",
        "name": "Jesse Hutch",
        "place_of_birth": "Alberta, Canada",
        "popularity": 0.7326,
        "profile_path": "/3tQsDlnoEVT73mV7OFs0D9EYn5f.jpg"
    }
}