{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/27Mj3rFYP3xqFy7lnz17vEd8Ms.jpg",
                "genre_ids": [
                    28,
                    53
                ],
                "id": 725201,
                "original_language": "en",
                "original_title": "The Gray Man",
                "overview": "When a shadowy CIA agent uncovers damning agency secrets, he's hunted across the globe by a sociopathic rogue operative who's put a bounty on his head.",
                "popularity": 6.3339,
                "poster_path": "/8cXbitsS6dWQ5gfMTZdorpAAzEH.jpg",
                "release_date": "2022-07-13",
                "title": "The Gray Man",
                "video": false,
                "vote_average": 6.934,
                "vote_count": 3922,
                "character": "Young Six",
                "credit_id": "62df1a4b955c65004f070550",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "A native of Southern California, Cameron Crovetti began his acting career at 8 years-old appearing in HBO's Emmy Award-winning drama series Big Little Lies playing one of the twin sons (alongside his real-life twin brother Nicholas) of Nicole Kidman and Alexander Skarsgård. Nominated for a Screen Actor's Guild Award for Best Ensemble Drama, Cameron went on to appear in the show's critically-acclaimed 2nd season with the opportunity to act alongside multiple Academy Award-winning actress Meryl Streep.\n\nCameron can next be seen playing a young Ryan Gosling in Netflix's action spy thriller The Gray Man directed by Anthony and Joe Russo. Cameron can also soon be seen starring opposite Academy Award-nominated actress Naomi Watts and his twin brother Nicholas in Prime Video's film Goodnight Mommy directed by Matt Sobel.\n\nCameron recently completed filming the highly-anticipated action-thriller Boy Kills World in South Africa, in which he and his brother Nicholas portray a young version of Bill Skarsgård's 'Boy' character (in yet another acting turn with the Skarsgård family). Directed by Moritz Mohr and produced by Sam Raimi and Roy Lee, the film also stars Jessica Rothe, Michelle Dockery, Sharlto Copley, Andrew Koji, Famke Janssen and legendary martial arts master Yayan Ruhian.\n\nCameron's previous credits include co-starring in the anthology series Dirty John opposite Amanda Peet and Christian Slater, Universal's horror-thriller Oracle with Heather Graham, the horror-fantasy Witch Hunt with Elizabeth Mitchell, indie French drama Anywhere With You with Betsy Brandt and Lorelei Linklater, the multiple award-winning short drama Boys, as well as guest starring roles in such major TV series as Black-ish, Teachers and Single Parents.",
        "birthday": "2008-03-12",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1696015,
        "imdb_id": "nm7805172",
        "known_for_department": "Acting",
        "name": "Cameron Crovetti",
        "place_of_birth": "California,USA",
        "popularity": 0.3353,
        "profile_path": "/xxoYAc0dY5pXotD0Z4tgnT5ppMN.jpg"
    }
}