{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uG1v9Hk1XKICd6IJChRR20mBh8i.jpg",
                "genre_ids": [
                    16,
                    28,
                    12,
                    35,
                    10751
                ],
                "id": 431693,
                "original_language": "en",
                "original_title": "Spies in Disguise",
                "overview": "Super spy Lance Sterling and scientist Walter Beckett are almost exact opposites. Lance is smooth, suave and debonair. Walter is… not. But what Walter lacks in social skills he makes up for in smarts and invention, creating the awesome gadgets Lance uses on his epic missions. But when events take an unexpected turn, Walter and Lance suddenly have to rely on each other in a whole new way.",
                "popularity": 5.1606,
                "poster_path": "/e7rWcrnuNej3JeVjqmRu0jVeRa4.jpg",
                "release_date": "2019-12-04",
                "title": "Spies in Disguise",
                "video": false,
                "vote_average": 7.573,
                "vote_count": 2876,
                "character": "Agency Employee #1 (voice)",
                "credit_id": "5e5bcd3866ae4d00128717d7",
                "order": 18
            },
            {
                "adult": false,
                "backdrop_path": "/o0UGl6icA4DbhmDNgdZ5AWvuTtM.jpg",
                "genre_ids": [
                    35
                ],
                "id": 653349,
                "original_language": "en",
                "original_title": "Vacation Friends",
                "overview": "When a straight-laced couple that has fun with a rowdy couple on vacation in Mexico return to the States, they discover that the crazy couple they met in Mexico followed them back home and decide to play tricks on them.",
                "popularity": 3.7943,
                "poster_path": "/cCyJeTAct07ORPJPHyzxCrVtZzh.jpg",
                "release_date": "2021-08-27",
                "title": "Vacation Friends",
                "video": false,
                "vote_average": 7.032,
                "vote_count": 832,
                "character": "Brooke",
                "credit_id": "612921b15ed9620065330b5c",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Tawny Newsome (born February 24, 1983) - (Height 5 feet 10 inches (1.77 meters) in height) is an American musician, comedian, and actress. She is known for her roles as Chelsea Leight-Leigh on the Comedy Central series Bajillion Dollar Propertie$, Nina on The Comedy Get Down, and Beckett Mariner on the animated Star Trek series Star Trek: Lower Decks. She is also a co-host of the podcast Yo, Is This Racist?\n\nNewsome was born in Vacaville, California, and grew up on a ranch. She attended DePaul University in Chicago, where she studied theater. After graduating, she began her comedy career with the Second City improv troupe.\n\nNewsome's first major television role was as Chelsea Leight-Leigh on Bajillion Dollar Propertie$. She also had a recurring role as Nina on The Comedy Get Down. In 2020, she began voicing the character of Beckett Mariner on Star Trek: Lower Decks.\n\nNewsome is also a musician and is a member of the band Four Lost Souls. She is also a co-host of the podcast Yo, Is This Racist? alongside Andrew Ti.",
        "birthday": "1983-02-24",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.tawnynewsome.com/",
        "id": 1697336,
        "imdb_id": "nm5634295",
        "known_for_department": "Acting",
        "name": "Tawny Newsome",
        "place_of_birth": "Vacaville, California, USA",
        "popularity": 0.3676,
        "profile_path": "/pMZ5cB05M6UGtU4I5xI0tpMYXka.jpg"
    }
}