{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yFkUPqBuUnbhYbQL8VFpTrAT9za.jpg",
                "genre_ids": [
                    18,
                    878,
                    9648
                ],
                "id": 686,
                "original_language": "en",
                "original_title": "Contact",
                "overview": "A radio astronomer receives the first extraterrestrial radio signal ever picked up on Earth. As the world powers scramble to decipher the message and decide upon a course of action, she must make some difficult decisions between her beliefs, the truth, and reality.",
                "popularity": 6.2788,
                "poster_path": "/bCpMIywuNZeWt3i5UMLEIc0VSwM.jpg",
                "release_date": "1997-07-11",
                "title": "Contact",
                "video": false,
                "vote_average": 7.435,
                "vote_count": 4709,
                "character": "Press Reporter (uncredited)",
                "credit_id": "645fe111ef8b320172d4dd36",
                "order": 88
            },
            {
                "adult": false,
                "backdrop_path": "/jRZ3joUcg8YDCQYl4Tog5xhY6wk.jpg",
                "genre_ids": [
                    28,
                    53
                ],
                "id": 36955,
                "original_language": "en",
                "original_title": "True Lies",
                "overview": "A fearless, globe-trotting, terrorist-battling secret agent has his life turned upside down when he discovers his wife might be having an affair with a used car salesman while terrorists smuggle nuclear war heads into the United States.",
                "popularity": 7.1082,
                "poster_path": "/pweFTnzzTfGK68woSVkiTgjLzWm.jpg",
                "release_date": "1994-07-15",
                "title": "True Lies",
                "video": false,
                "vote_average": 7.086,
                "vote_count": 4319,
                "character": "Police Captain (uncredited)",
                "credit_id": "63877e30229ae2155c550018",
                "order": 32
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Raymond Buffer"
        ],
        "biography": "Ray Buffer, born in 1969 as Raymond Ernest Buffer, Jr., is a versatile American talent celebrated for his contributions to both the entertainment industry and music. Growing up in Greenacres, Florida, he was raised by Delana and Raymond Ernest Buffer, Sr., who fostered his love for creativity and performance. His European ancestry provided a rich cultural backdrop for his artistic journey.\n\nBuffer was welcomed into the Buffer family through adoption at just 29 days old, beginning a lifelong quest to discover his roots. In 2003, after a diligent search, he reunited with his birth mother, Patricia Odell, expanding his family with newfound maternal relatives. Despite this reunion, the identity of his birth father remains a mystery, adding depth to his personal story.\n\nHis artistic journey began with music; he displayed an early talent for the violin and later mastered several instruments. However, it was theater that truly captured his heart during his formative years at John I Leonard High School in Lake Worth, Florida. There, he excelled in theatrical productions, showcased his musical talent in jazz choirs, and developed skills on the viola, piano, and string bass.\n\nTo further his pursuit of the arts, Buffer attended Palm Beach State College and Florida Atlantic University, earning a BFA in musical theater in 1994. Throughout the 1990s, he refined his craft through performances in regional and dinner theater productions, demonstrating versatility as both a performer and director.\n\nIn 1992, Buffer married writer and actress Roberta McMillan, and together they embarked on various creative projects, notably the acclaimed documentary film \"Rats & Bullies,\" which he directed in 2003. This film highlighted relational aggression and sparked important discussions about bullying, earning accolades at film festivals. They separated in 2009, with their divorce finalized in 2019.\n\nIn 1999, Buffer relocated to Huntington Beach, California, where he expanded his artistic horizons into television and film. His guest-starring roles showcased his range, including a memorable appearance on \"Curb Your Enthusiasm.\"\n\nIn 2007, driven by a passion for storytelling, Buffer left his managerial role at Long Beach Opera to establish his own theater company, The Relevant Stage, in San Pedro, California. This venture enabled him to produce a variety of engaging musical theater works until 2011, when he co-founded Art-In-Relation with business partner Jonas Sills.\n\nWith Art-In-Relation, Buffer continued to make an impact in the theatrical landscape, staging productions across Long Beach, Los Angeles, and Hollywood. His commanding presence and resonant voice led to numerous portrayals of Santa Claus in various media, solidifying his status as a versatile performer.\n\nToday, Buffer is a prominent figure in television, film, and theater, captivating audiences with his dynamic performances. As a sought-after concert soloist and voice-over artist, he continues to leave an indelible mark on the entertainment world, all while calling Long Beach, California, home.\n\nFor representation, Ray Buffer is represented in the USA by Judy Belshe-Toernblom and Birger Toernblom at A.R.T. Agency, and internationally by Elmazi Evdoxia and Psilopoulos Thanasis at Enorama Talent Agency.",
        "birthday": "1969-09-02",
        "deathday": null,
        "gender": 2,
        "homepage": "http://raybuffer.com",
        "id": 1699143,
        "imdb_id": "nm1338528",
        "known_for_department": "Acting",
        "name": "Ray Buffer",
        "place_of_birth": "West Palm Beach, Florida, USA",
        "popularity": 0.0891,
        "profile_path": null
    }
}