{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uYkQYnrAz8Gzw6WCmcFEAzhlJIA.jpg",
                "genre_ids": [
                    18
                ],
                "id": 426426,
                "original_language": "es",
                "original_title": "Roma",
                "overview": "In 1970s Mexico City, two domestic workers help a mother of four while her husband is away for an extended period of time.",
                "popularity": 1.5538,
                "poster_path": "/dtIIyQyALk57ko5bjac7hi01YQ.jpg",
                "release_date": "2018-11-21",
                "title": "Roma",
                "video": false,
                "vote_average": 7.63,
                "vote_count": 3995,
                "character": "Benita",
                "credit_id": "5b7594990e0a264ef5000871",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Hailing from Iguala, Guerrero, and being the eldest of five brothers and sisters, Clementina decided to defy her family and those around her, as she had fallen in love with theater. The culprit: the Mexican actor Esvón Gamaliel.\n\nDuring her adolescence she worked as a maid, just like her mother, and after seeing in Acapulco the play \"Una tal Raymunda\" by the Mexican master, Clementina decided that someday she would work with that man who stood on stage in a white suit.  At the age of 22, and with a child in her arms, she moved to the city of Toluca to study drama at the Universidad Autónoma del Estado de México. Although this was the place that made her fall in love with theater and taught her to face her shyness, it was also the place where she experienced the first blows of the acting world. She was often discriminated against for being poor and having indigenous features.\n\nWith more maturity, Clementina began to write and direct her own plays. If society did not open doors for her, she would open them for herself. Which she continues to do to this day.  Clementina was part of several series on Channel 11, such as La Malinche, as well as popular characters such as Selena, Juan Gabriel and Julio Cesar Chavez.\n\nFilming the movie \"Cría Puercos\" allowed her to develop her first co-starring role. It was then that she received the call for a new project of which everything was kept secret. After three castings and many months later, he was confirmed: he would be part of \"Roma\", a film by Alfonso Cuarón.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1701986,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Clementina Guadarrama",
        "place_of_birth": "Iguala, Guerrero, Mexico",
        "popularity": 0.0782,
        "profile_path": "/9TVeeNQwibt6J2PMCCpkzy1O4jW.jpg"
    }
}