{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dDYpjrwh1wNVQk0rEpc9P81wQt4.jpg",
                "genre_ids": [
                    10402,
                    18,
                    10749
                ],
                "id": 332562,
                "original_language": "en",
                "original_title": "A Star Is Born",
                "overview": "Seasoned musician Jackson Maine discovers — and falls in love with — struggling artist Ally. She has just about given up on her dream to make it big as a singer — until Jack coaxes her into the spotlight. But even as Ally's career takes off, the personal side of their relationship is breaking down, as Jack fights an ongoing battle with his own internal demons.",
                "popularity": 5.4739,
                "poster_path": "/wrFpXMNBRj2PBiN4Z5kix51XaIZ.jpg",
                "release_date": "2018-10-03",
                "title": "A Star Is Born",
                "video": false,
                "vote_average": 7.498,
                "vote_count": 11944,
                "character": "Emerald",
                "credit_id": "59ba26eac3a3680d1500a41b",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Willam",
            "The AAA Girls"
        ],
        "biography": "Willam Belli commonly referred to as simply Willam, is an American actor, drag queen, model, reality television personality, recording artist and author, who is known for his recurring role as transgender woman Cherry Peck in Ryan Murphy's medical drama Nip/Tuck and for being a contestant on the fourth season of RuPaul's Drag Race, for which he remains the only contestant ever disqualified from the series. In addition to acting, Belli found viral success with his music video parodies \"Chow Down\" and \"Boy Is a Bottom\" with his Los Angeles drag queen pop trio, DWV. However, the group split in June 2014, because of a personal conflict among the groupmates.",
        "birthday": "1982-06-30",
        "deathday": null,
        "gender": 2,
        "homepage": "http://willambelli.com",
        "id": 170432,
        "imdb_id": "nm1316418",
        "known_for_department": "Acting",
        "name": "Willam Belli",
        "place_of_birth": "Philadelphia, Pennsylvania, USA",
        "popularity": 0.2784,
        "profile_path": "/1FyknNjTlJL0Ndz3R5U4ErjAqZy.jpg"
    }
}