{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/aOI3o06xhCgLmA6Bcpm4KRDeMXF.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 763165,
                "original_language": "en",
                "original_title": "The Burial",
                "overview": "When a handshake deal goes sour, funeral home owner Jeremiah O'Keefe enlists charismatic, smooth-talking attorney Willie E. Gary to save his family business. Tempers flare and laughter ensues as the unlikely pair bond while exposing corporate corruption and racial injustice.",
                "popularity": 5.1109,
                "poster_path": "/9ssNSfNKpzZwhbFsnW3wa82m2sG.jpg",
                "release_date": "2023-10-06",
                "title": "The Burial",
                "video": false,
                "vote_average": 7.095,
                "vote_count": 552,
                "character": "David Shatterock",
                "credit_id": "6551fe05ea84c710959bc0fa",
                "order": 32
            },
            {
                "adult": false,
                "backdrop_path": "/zAfG4ZmpNfKSyr8MVn1CHjgYYXx.jpg",
                "genre_ids": [
                    18
                ],
                "id": 292011,
                "original_language": "en",
                "original_title": "Richard Jewell",
                "overview": "Richard Jewell thinks quick, works fast, and saves hundreds, perhaps thousands, of lives after a domestic terrorist plants several pipe bombs and they explode during a concert, only to be falsely suspected of the crime by sloppy FBI work and sensational media coverage.",
                "popularity": 2.855,
                "poster_path": "/5Lgkm8jt4roAFPZQ52fKMhVmDaZ.jpg",
                "release_date": "2019-12-13",
                "title": "Richard Jewell",
                "video": false,
                "vote_average": 7.42,
                "vote_count": 2608,
                "character": "Ron Martz",
                "credit_id": "5d68907a13af5f000fbc2ad9",
                "order": 31
            },
            {
                "adult": false,
                "backdrop_path": "/eAIHqfS3kXm7kZl4j7ZBfdegyEz.jpg",
                "genre_ids": [
                    53,
                    28,
                    80
                ],
                "id": 38700,
                "original_language": "en",
                "original_title": "Bad Boys for Life",
                "overview": "Marcus and Mike are forced to confront new threats, career changes, and midlife crises as they join the newly created elite team AMMO of the Miami police department to take down the ruthless Armando Armas, the vicious leader of a Miami drug cartel.",
                "popularity": 8.7072,
                "poster_path": "/y95lQLnuNKdPAzw9F9Ab8kJ80c3.jpg",
                "release_date": "2020-01-15",
                "title": "Bad Boys for Life",
                "video": false,
                "vote_average": 7.131,
                "vote_count": 8499,
                "character": "Disturbed Airline Passenger",
                "credit_id": "5eefad546f6a990038ce46af",
                "order": 32
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "David Moretti"
        ],
        "biography": "David Shae is an Actor from Rhode Island currently based in Atlanta, GA. David's first taste of acting was in High School, within his sketch group The Blueberry Johnsons. David and his best friends wrote and performed SNL style sketches, touring the local club scene in Providence, RI. From there, David moved to Los Angeles, embarking on the path to a professional career. He was accepted to the University of Southern California, where he lived off-campus in the Delta Chi fraternity house. He completed his college curriculum during the day, followed by acting classes at night. His mentors included the likes of Janet Alhanti, Margie Haber, and Ivana Chubbuck. Their training led to many smaller roles in independent productions. But it wasn't until his move to The South when David's career really started gaining traction. His first major network production was an episode of House Of Cards, playing Buha - press secretary to Joel Kinnaman - in an episode directed by Robin Wright. This led to more television gigs, such as The Gifted, Lodge 49, The Originals, and many others. From there, David began entering the world of feature films, with a supporting role in Gemini Man, directed by the Oscar-winning director Ang Lee. Currently, he continues to act in both mediums. While not working, David is involved with local charitable pursuits, such as using 'improv as therapy' to children with behavioral complications. He also immerses himself in anything animal related, as his rescued dog Tess has been by his side for 13 years now, enriching his life immeasurably.",
        "birthday": "1981-09-03",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1704672,
        "imdb_id": "nm1869788",
        "known_for_department": "Acting",
        "name": "David Shae",
        "place_of_birth": "Cranston, Rhode Island, USA",
        "popularity": 0.115,
        "profile_path": "/tBfDhXA1KlmdgVtuAgKX6C8QJWz.jpg"
    }
}