{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kvdy0Ijjo2r9qsnWV4Dzx07qwnc.jpg",
                "genre_ids": [
                    80,
                    14,
                    18
                ],
                "id": 1427,
                "original_language": "en",
                "original_title": "Perfume: The Story of a Murderer",
                "overview": "Jean-Baptiste Grenouille, born in the stench of 18th century Paris, develops a superior olfactory sense, which he uses to create the world's finest perfumes. However, his work takes a dark turn as he tries to preserve scents in the search for the ultimate perfume.",
                "popularity": 7.9304,
                "poster_path": "/2wrFrUej8ri5EpjgIkjKTAnr686.jpg",
                "release_date": "2006-09-13",
                "title": "Perfume: The Story of a Murderer",
                "video": false,
                "vote_average": 7.369,
                "vote_count": 4762,
                "character": "Marquis de Montesquieu",
                "credit_id": "52fe42f6c3a36847f8030167",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Harris Gordon was born in Canada. He completed his acting studies at East 15 Acting School in London and L’École Internationale de Théâtre Jacques Lecoq in Paris. Harris Gordon is a theatre actor (Teatre Nacional De Catalunya, Els Comediants, Georges Lavaudant…), a television actor (El Gran Nord, Hombres de Paco, Cuenta Atrás…) and a cinema actor (Perfume, Anna, Educación de las Hadas…).\n\nHe has directed 2 theatre plays, “Gulietta” with Pepa Plana and “Buscant Abraham” with Carles Chamarro and Toni Gonzalez. He is a member of the UK Professional Choreographers of Stage Combat and of the Ski Instructors Association in Canada.\n\nFor more than 20 years he has been a teacher at Estudis Berty Tovías –International Theatre School. At present he is a teacher at Teatracció International Theatre School.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 17073,
        "imdb_id": "nm2226757",
        "known_for_department": "Acting",
        "name": "Harris Gordon",
        "place_of_birth": null,
        "popularity": 0.0589,
        "profile_path": "/bs8krvbcchW3Jaj7Kz8QBnEW44S.jpg"
    }
}