{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/obyCUbpZvMTizOqYWHqkTFgfvnf.jpg",
                "genre_ids": [
                    10752,
                    10749,
                    36,
                    28
                ],
                "id": 676,
                "original_language": "en",
                "original_title": "Pearl Harbor",
                "overview": "The lifelong friendship between Rafe McCawley and Danny Walker is put to the ultimate test when the two ace fighter pilots become entangled in a love triangle with beautiful Naval nurse Evelyn Johnson. But the rivalry between the friends-turned-foes is immediately put on hold when they find themselves at the center of Japan's devastating attack on Pearl Harbor on Dec. 7, 1941.",
                "popularity": 9.0424,
                "poster_path": "/y8A0Cvp8WQmZ3bjbnsL53lY0dsC.jpg",
                "release_date": "2001-05-21",
                "title": "Pearl Harbor",
                "video": false,
                "vote_average": 6.942,
                "vote_count": 6742,
                "character": "Japanese Soldier",
                "credit_id": "58270551c3a368360f01a5d7",
                "order": 64
            },
            {
                "adult": false,
                "backdrop_path": "/xKtWcQD2yugIKz49LvZNHdLM09T.jpg",
                "genre_ids": [
                    35,
                    18,
                    10752
                ],
                "id": 256962,
                "original_language": "en",
                "original_title": "Little Boy",
                "overview": "An eight-year-old boy is willing to do whatever it takes to end World War II so he can bring his father home. The story reveals the indescribable love a father has for his little boy and the love a son has for his father.",
                "popularity": 2.8114,
                "poster_path": "/lAU9pgq3niI6sFemcKm4FGGmrnW.jpg",
                "release_date": "2015-04-23",
                "title": "Little Boy",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 544,
                "character": "Japanese Soldier",
                "credit_id": "58e2c73d92514128350121cd",
                "order": 43
            },
            {
                "adult": false,
                "backdrop_path": "/a3F9cXjRH488qcOqFmFZwqawBMU.jpg",
                "genre_ids": [
                    16,
                    28,
                    878,
                    53
                ],
                "id": 1376434,
                "original_language": "en",
                "original_title": "Predator: Killer of Killers",
                "overview": "While three of the fiercest warriors in human history—a Viking raider, a ninja in feudal Japan, and a WWII pilot—are killers in their own right, they are merely prey for their new opponent: the ultimate killer of killers.",
                "popularity": 21.6219,
                "poster_path": "/2XDQa6EmFHSA37j1t0w88vpWqj9.jpg",
                "release_date": "2025-06-05",
                "title": "Predator: Killer of Killers",
                "video": false,
                "vote_average": 7.892,
                "vote_count": 854,
                "character": "Additional Voices (voice)",
                "credit_id": "683e796ed36911e2007f4778",
                "order": 23
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ejii Inoue"
        ],
        "biography": "Accomplished actor and martial artist, Eiji Inoue impacted audiences with his performance in In the Cage (2013) as the character San Tao. He has also appeared in many well-known films such as The Last Samurai, Click, and Pearl Harbor. For the episode \"Chimera\" from NCIS, Eiji Inoue impressed production so much that they switched a role from one concept to another just so that Eiji could play the character, Satoshi Takada. During Eiji Inoue's acting career of 23 years, he has appeared in more than 60 plays. He is best known for his role as Takeshi Kawabata in Take Me Out a play by Richard Greenberg. This Tony Award winning production made a revival in Los Angeles and continued to be extended 3 times winning both critics' and audiences hearts alike. Not only is Eiji Inoue a driven and talented actor, he is also extremely experienced in Chinese martial arts, specifically Wushu Kungfu. With over 30 years of martial arts training and competitions, Eiji is adept in 18 different styles and weaponry uses. Some of which are Broad Sword, Double Broad Sword, Straight Sword, Long Spear, 3 Section Staff, Japanese Samurai Sword, etc. Because Eiji continues to perfect his craft by participating in theater when not working on films and TV, he has had the privilege of being cast alongside prolific actors such as Tom Cruise, Leonardo DiCaprio, Ben Affleck, Josh Hartnett, Adam Sandler, Meg Ryan, Arnold Schwarzenegger, and many more. Awards: ADA Award for Best Ensemble Cast for The Box. Nominations: His independent film Pearlblossom Hwy (2012) for AFI's Film Festival Top 10. Official Selections for Vienna International Film Festival, AFI Fest, Starz Denver Film Festival, International Film Festival Rotterdam, Bradford International Film Festival, San Francisco International Film Festival. Eiji Inoue's next project, Conversation, is expected to shoot in November 2014. With 2 projects already slated to come out in 2015, Eiji Inoue is one busy actor ready for more prominent roles and creatively challenging projects.",
        "birthday": null,
        "deathday": null,
        "gender": 0,
        "homepage": null,
        "id": 1707343,
        "imdb_id": "nm0409273",
        "known_for_department": "Acting",
        "name": "Eiji Inoue",
        "place_of_birth": null,
        "popularity": 0.1268,
        "profile_path": "/ad0JTlWFMVsHny8skQGGKPL7spw.jpg"
    }
}