{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jsgRkhPxYtzAhDFCUyNbvlX63tY.jpg",
                "genre_ids": [
                    10749,
                    10751,
                    16,
                    14
                ],
                "id": 10020,
                "original_language": "en",
                "original_title": "Beauty and the Beast",
                "overview": "Follow the adventures of Belle, a bright young woman who finds herself in the castle of a prince who's been turned into a mysterious beast. With the help of the castle's enchanted staff, Belle soon learns the most important lesson of all -- that true beauty comes from within.",
                "popularity": 11.4334,
                "poster_path": "/hUJ0UvQ5tgE2Z9WpfuduVSdiCiU.jpg",
                "release_date": "1991-10-22",
                "title": "Beauty and the Beast",
                "video": false,
                "vote_average": 7.731,
                "vote_count": 10301,
                "character": "Bookseller (voice)",
                "credit_id": "52fe43099251416c75000fe3",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/insPcjOIWFf6Uc9DR0ORgXATqSM.jpg",
                "genre_ids": [
                    18
                ],
                "id": 4960,
                "original_language": "en",
                "original_title": "Synecdoche, New York",
                "overview": "A theater director struggles with his work, and the women in his life, as he attempts to create a life-size replica of New York inside a warehouse as part of his new play.",
                "popularity": 3.0684,
                "poster_path": "/5UwdhrjXhUgsiDhe1dpS9z4yj7q.jpg",
                "release_date": "2008-10-24",
                "title": "Synecdoche, New York",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 1496,
                "character": "Man with Nose Bleed",
                "credit_id": "64d291d517792c00e280237f",
                "order": 39
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Alvin Epstein (May 14, 1925 – December 10, 2018) was an American actor and director. He was a founding member of both the American Repertory Theater and Yale Repertory Theatre. He was particularly admired for his performances in the plays of Samuel Beckett. He also served as Artistic Director at the Guthrie Theater.\n\nBorn in the Bronx, Epstein was the son of Harry Epstein, a physician, and his wife Goldie Epstein (née Rudnick). He graduated from the High School of Music & Art in Manhattan and the Queens College, City University of New York. After serving in the United States Army during World War II in Germany, he studied dance in New York with Martha Graham and mime in Paris. His early performances in New York City included appearing in mimes with Marcel Marceau. In 1956 he made his Broadway debut as the Fool in Orson Welles’ 1956 production of William Shakespear's King Lear. That same year he portrayed the slave Lucky in the Broadway premiere of Beckett’s Waiting for Godot.\n\nEpstein continued to appear in many productions of Beckett's plays, including Clov, the servant, in the United States premiere of Endgame in 1958. He portrayed two more characters in that play during his career: Hamm, Clov’s tyrannical blind master, in a 1984 Off-Broadway production that he also directed, at the Samuel Beckett Theater; and Hamm’s aged father, Nagg, who lives in a garbage can, performed at the Irish Repertory Theatre in Manhattan in 2005 and again, in 2008, at the Brooklyn Academy of Music.",
        "birthday": "1925-05-14",
        "deathday": "2018-12-10",
        "gender": 2,
        "homepage": null,
        "id": 170898,
        "imdb_id": "nm0258423",
        "known_for_department": "Acting",
        "name": "Alvin Epstein",
        "place_of_birth": "Bronx, New York, United States",
        "popularity": 0.0905,
        "profile_path": "/ulT5IYEjCYC8HJkUIrXlUz6h7e4.jpg"
    }
}