{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sYnrdolxonyMucMezj8PMVBRlVr.jpg",
                "genre_ids": [
                    18,
                    80,
                    53
                ],
                "id": 382614,
                "original_language": "en",
                "original_title": "The Book of Henry",
                "overview": "Susan, a single mother of two, works as a waitress in a small town. Her son, Henry, is an 11-year-old genius who not only manages the family finances but acts as emotional support for his mother and younger brother. When Henry discovers that the girl next door has a terrible secret, he implores Susan to take matters into her own hands.",
                "popularity": 4.5355,
                "poster_path": "/suLFg4UjvM5BoDipg2Wu3gZ802T.jpg",
                "release_date": "2017-06-16",
                "title": "The Book of Henry",
                "video": false,
                "vote_average": 7.51,
                "vote_count": 1317,
                "character": "Principal Wilder",
                "credit_id": "5837686fc3a36836a0015f47",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Tonya Pinkins was born in Chicago, Illinois.  She has four children. Her father was a police officer and insurance  salesman and her mother is a former postal worker. She has two brothers,  Eric Swoope and Thomas Swoope and a sister Tamera Swoope from whom she  is estranged. She was interested in the arts from a young age. In high  school, she studied acting at the Goodman Theatre  Young People's Program. Aged 18, she briefly attended college and  decided to pursue an acting career instead. She later returned to  college, earning an undergraduate degree from Columbia College in Chicago, followed by graduate work at Carnegie Mellon's music theater program, and a year at California Western School of Law in San Diego.\n\nPinkins is probably most admired for her stage work. She won a Tony Award for her performance as Sweet Anita in Jelly's Last Jam. She was nominated for her roles in Play On! and in Caroline, or Change, where she played the title role. Her additional Broadway credits include Merrily We Roll Along, Chronicle of a Death Foretold, The Wild Party, House of Flowers, Radio Golf, A Time To Kill and Holler If Ya Hear Me.\n\nPinkins has performed in several Off Broadway productions, including the comic role of Mopsa, the Shepherdess, in The Winter's Tale produced by the Riverside Shakespeare Company at The Shakespeare Center in 1983.\n\nIn 2011, Pinkins starred in the world premiere of Kirsten Greenidge’s Milk Like Sugar at La Jolla Playhouse, and received a 2012 Craig Noel nomination for Best featured Actress in a Play. She reprised her role in the Playwrights Horizons in the Peter Jay Sharp Theater, and garnered a 2012 Lucille Lortel Award for Outstanding Featured Actress in a Play.\n\nIn 2012 Pinkins starred in Katori Hall's play Hurt Village,  the gritty drama about life and change in a Memphis housing project  made its world-premiere at Off-Broadway's Signature Theatre Company as  part of the theatre's inaugural season. The play also Marsha Stephanie  Blake, Ron Cephas Jones,  Saycon Sengbloh, Lloyd Watts, Charlie Hudson III, Nicholas Christopher,  Corey Hawkins, Ron Cephas Jones and Joaquina Kalukango.\n\nIn 2014, Pinkins appeared in New Federal Theatre's revival of Ed Bullins' The Fabulous Miss Marie opposite Roscoe Orman; in the Broadway production of Holler If Ya Hear Me; and the world premiere of Branden Jacobs-Jenkins' War at Yale Repertory.\n\nShe has also had a prolific television career making guest appearances on such television shows as Army Wives, 24, Law & Order, The Cosby Show, Cold Case, Criminal Minds, and The Guardian among others. During the mid-1980s Pinkins created the role of Heather Dalton on the CBS soap, As the World Turns. In 1991 she was cast as Livia Frye in All My Children. Pinkins left All My Children  in 1995 but returned to her role in 2003. She was later put on contract  with the show from March 2004 until June 2006, when she was downgraded  to recurring status. She has played Amala Motobo on the popular  television show 24. She has appeared in several films in supporting roles, including Newlyweeds, Home, Fading Gigolo opposite Woody Allen, Enchanted, Premium, Romance & Cigarettes, Noah's Arc: Jumping The Broom and Above the Rim among others.",
        "birthday": "1962-05-30",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.tonyapinkins.com",
        "id": 170906,
        "imdb_id": "nm0684371",
        "known_for_department": "Acting",
        "name": "Tonya Pinkins",
        "place_of_birth": "Chicago, Illinois, USA",
        "popularity": 0.7693,
        "profile_path": "/1yXuqUKWqiEo4NO96TbDfZ5fAPf.jpg"
    }
}