{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gCIB3DdK00DyfwosVGf7pnFFdK3.jpg",
                "genre_ids": [
                    28,
                    12,
                    53
                ],
                "id": 399402,
                "original_language": "en",
                "original_title": "Hunter Killer",
                "overview": "Captain Glass of the USS Arkansas discovers that a coup d'état is taking place in Russia, so he and his crew join an elite group working on the ground to prevent a war.",
                "popularity": 7.0307,
                "poster_path": "/a0j18XNVhP4RcW3wXwsqT0kVoQm.jpg",
                "release_date": "2018-10-19",
                "title": "Hunter Killer",
                "video": false,
                "vote_average": 6.892,
                "vote_count": 2261,
                "character": "McCaw",
                "credit_id": "602678b6d6c300004170896f",
                "order": 32
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Kola Bokinni (born 5 August 1992) is an English actor. He is known for his role as Isaac McAdoo, the captain of AFC Richmond, in the Apple TV+ series Ted Lasso (2020–2023). He is also well known from Celebrity Bear Hunt (2025). Bokinni's mother is Irish, and his father is Nigerian. He attended the BRIT School, initially on Saturdays before an opportunity opened up to attend the main school. His first public performance was an original play, first performed at the Bussey in Peckham, before moving to the Royal Court Theatre in Sloane Square. Following good reviews for his performance he signed with his first agent.  Bokinni played Lennard in a 2016 episode of Black Mirror entitled \"Men Against Fire\". He also had a recurring role as Leyton on the television series Top Boy. From 2020 he played Isaac McAdoo, the AFC Richmond centre-back and vice-captain, and then captain on the Apple TV+ series Ted Lasso with his character maturing during his portrayal from immature and a \"bully\" to a leadership role. With members of the ensemble cast of Ted Lasso, he visited The White House and met President Biden and Vice-president Kamala Harris. Bokinni has spoken about the teamwork and camaraderie on the set of Ted Lasso. He described having his Ted Lasso character turned into a playable character with his likeness in the video game FIFA as \"something I don't think I'll ever be able to get over\" Bokinni is a football fan himself, and is a fan of Arsenal. He typically plays football more as an attacker than his defence-playing character from Ted Lasso. He is good friends with fellow actor Will Poulter, and his sister is broadcaster and DJ Yinka Bokinni.",
        "birthday": "1992-08-05",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.unitedagents.co.uk/kola-bokinni",
        "id": 1711173,
        "imdb_id": "nm6703520",
        "known_for_department": "Acting",
        "name": "Kola Bokinni",
        "place_of_birth": "Peckham, London, England, UK",
        "popularity": 0.2351,
        "profile_path": "/viNocsYg0dJo2OHs08S6lktorMi.jpg"
    }
}