{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xHDynIimfsgj0ZOs0j5ma8v1vmM.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 120467,
                "original_language": "en",
                "original_title": "The Grand Budapest Hotel",
                "overview": "The Grand Budapest Hotel tells of a legendary concierge at a famous European hotel between the wars and his friendship with a young employee who becomes his trusted protégé. The story involves the theft and recovery of a priceless Renaissance painting, the battle for an enormous family fortune and the slow and then sudden upheavals that transformed Europe during the first half of the 20th century.",
                "popularity": 10.2456,
                "poster_path": "/eWdyYQreja6JGCzqHWXpWHDrrPo.jpg",
                "release_date": "2014-02-26",
                "title": "The Grand Budapest Hotel",
                "video": false,
                "vote_average": 8.036,
                "vote_count": 15411,
                "character": "Actor",
                "credit_id": "583a0ceec3a3681cdc00d3a7",
                "order": 33
            },
            {
                "adult": false,
                "backdrop_path": "/goMGTcitprGu7YD6VZS4lUUwzRA.jpg",
                "genre_ids": [
                    12,
                    35,
                    16
                ],
                "id": 399174,
                "original_language": "en",
                "original_title": "Isle of Dogs",
                "overview": "In the future, an outbreak of canine flu leads the mayor of a Japanese city to banish all dogs to an island used as a garbage dump. The outcasts must soon embark on an epic journey when a 12-year-old boy arrives on the island to find his beloved pet.",
                "popularity": 5.2045,
                "poster_path": "/c0nUX6Q1ZB0P2t1Jo6EeFSVnOGQ.jpg",
                "release_date": "2018-03-23",
                "title": "Isle of Dogs",
                "video": false,
                "vote_average": 7.847,
                "vote_count": 5134,
                "character": "Mayor Kobayashi (voice)",
                "credit_id": "585bcc8992514175ad081a7f",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/6ITVHoipvxAS8luzKtHTbPaHLtT.jpg",
                "genre_ids": [
                    18,
                    10749,
                    35
                ],
                "id": 153,
                "original_language": "en",
                "original_title": "Lost in Translation",
                "overview": "Two lost souls visiting Tokyo -- the young, neglected wife of a photographer and a washed-up movie star shooting a TV commercial -- find an odd solace and pensive freedom to be real in each other's company, away from their lives in America.",
                "popularity": 8.2819,
                "poster_path": "/3jCLmYDIIiSMPujbwygNpqdpM8N.jpg",
                "release_date": "2003-09-18",
                "title": "Lost in Translation",
                "video": false,
                "vote_average": 7.388,
                "vote_count": 7675,
                "character": "Kun",
                "credit_id": "5a8f35d0c3a3682dac00397e",
                "order": 34
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/goMGTcitprGu7YD6VZS4lUUwzRA.jpg",
                "genre_ids": [
                    12,
                    35,
                    16
                ],
                "id": 399174,
                "original_language": "en",
                "original_title": "Isle of Dogs",
                "overview": "In the future, an outbreak of canine flu leads the mayor of a Japanese city to banish all dogs to an island used as a garbage dump. The outcasts must soon embark on an epic journey when a 12-year-old boy arrives on the island to find his beloved pet.",
                "popularity": 5.2045,
                "poster_path": "/c0nUX6Q1ZB0P2t1Jo6EeFSVnOGQ.jpg",
                "release_date": "2018-03-23",
                "title": "Isle of Dogs",
                "video": false,
                "vote_average": 7.847,
                "vote_count": 5134,
                "credit_id": "5a86108b0e0a26400b02f9ba",
                "department": "Production",
                "job": "Casting"
            },
            {
                "adult": false,
                "backdrop_path": "/goMGTcitprGu7YD6VZS4lUUwzRA.jpg",
                "genre_ids": [
                    12,
                    35,
                    16
                ],
                "id": 399174,
                "original_language": "en",
                "original_title": "Isle of Dogs",
                "overview": "In the future, an outbreak of canine flu leads the mayor of a Japanese city to banish all dogs to an island used as a garbage dump. The outcasts must soon embark on an epic journey when a 12-year-old boy arrives on the island to find his beloved pet.",
                "popularity": 5.2045,
                "poster_path": "/c0nUX6Q1ZB0P2t1Jo6EeFSVnOGQ.jpg",
                "release_date": "2018-03-23",
                "title": "Isle of Dogs",
                "video": false,
                "vote_average": 7.847,
                "vote_count": 5134,
                "credit_id": "5b29d85892514138e50024fa",
                "department": "Writing",
                "job": "Story"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Kunichi Nomura (野村 訓市, Nomura Kun'ichi, born April 10, 1974) is a Japanese writer, actor, radio personality, book editor, interior designer, creative director, and DJ from Tokyo, Japan.\n\nKun's mother is food researcher, Kouko Nomura, and his sister is chef and restaurateur, Yuri Nomura. His great grandfather on his father's side is the late journalist, Fumio Nomura.\n\nKun enrolled in Gakushuin kindergarten at the age of six and went on to spend most of his school years at Gakushuin until graduating high school in 1992. During his junior year in high school, he studied abroad in Texas for a year. Upon his return to Japan, he enrolled in Keio University's Faculty of Policy Management, although he spent most of his junior and senior years backpacking in Asia and Europe.\n\nUpon his return to Japan from his extensive travels, Kun opened a beach café called Sputnik at Tsujidō Kaigan in 1999, which he operated until 2005. After being influenced by The Electric Kool-Aid Acid Test, and Ken Kesey's Further bus trip in the mid 60s, Kun purchased a double-decker bus from London in 2004 and went on a journey with photographers, skateboarders, artists, writers and DJs, traveling from the most northern point to the southern tip of Japan, producing events and parties along the way.\n\nIn 2000, Kun published a book called Sputnik: Whole Life Catalogue, a collection of interviews of 86 artists from all over the world, focusing on their perspective on life and work. This book launched Kun's career as a freelance magazine writer and editor for several major publications, covering a wide range of topics from subculture, fashion, architecture, film, music, photography, and art. During this time, he interviewed over a hundred notable figures including Wes Anderson, Spike Jonze, Gus Van Sant, Jonathan Ive, Marc Newson, Richard Hutten, Ken Kesey, Haruki Murakami, Raymond Pettibon, and Barry McGee.\n\nIn 2004, Kun founded an interior design company called Tripster Inc., that mainly designs offices, stores and restaurants, although the company took on a wide range of other projects such as producing a Bruce Weber photography exhibition, a GAP campaign event, advising on Beams Japan's catalogues, and designing event spaces for Uniqlo and Nike. It was around this time that Kun started producing music events with artists such as Kenji Takimi, The Avalanches, DJ Milo, 2 Many DJs, Yamantaka Eye of Boredoms, and James Murphy of LCD Soundsystem.\n\nFrom 2015, Kun became creative director of sub culture magazine Studio Voice and stayed at the position until 2017.\n\nKun has made cameo appearances in several high profile films such as Sofia Coppola's Lost in Translation and Wes Anderson's movies The Grand Budapest Hotel and Isle of Dogs. For the latter, Kun is credited as a co-writer and casting director, while also voicing the character, Mayor Kobayashi.\n\nSince 2014, Kun has been hosting a weekly radio show called Antenna presents: Travelling Without Moving on J-Wave primarily sharing his stories from his extensive travels and playing an eclectic mix of music to go with his stories.",
        "birthday": "1974-04-10",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1714579,
        "imdb_id": "nm1440081",
        "known_for_department": "Acting",
        "name": "Kunichi Nomura",
        "place_of_birth": "Tokyo, Japan",
        "popularity": 0.7616,
        "profile_path": "/tcKdM9q1yWhNwZVUy59LFs2jaXM.jpg"
    }
}