{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3IzR3VhZAyhxVnuRRUHFLkfK4hT.jpg",
                "genre_ids": [
                    28,
                    12
                ],
                "id": 353081,
                "original_language": "en",
                "original_title": "Mission: Impossible - Fallout",
                "overview": "When an IMF mission ends badly, the world is faced with dire consequences. As Ethan Hunt takes it upon himself to fulfill his original briefing, the CIA begin to question his loyalty and his motives. The IMF team find themselves in a race against time, hunted by assassins while trying to prevent a global catastrophe.",
                "popularity": 9.7434,
                "poster_path": "/AkJQpZp9WoNdj7pLYSj1L0RcMMN.jpg",
                "release_date": "2018-07-25",
                "title": "Mission: Impossible - Fallout",
                "video": false,
                "vote_average": 7.443,
                "vote_count": 8721,
                "character": "British Agent",
                "credit_id": "5bb1824e925141168900ad92",
                "order": 38
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ross O'Hennessey",
            "Ross O'Hennesy"
        ],
        "biography": "Ross O'Hennessy was born in Pontllanfraith, South Wales but always knew he wanted to be actor. So at the tender age of 16 he packed his bags and moved to London. He spent a few years treading the boards with the National Youth Theatre before winning the Sir John Mills Scholorship to attend Private Drama School. After finishing a 3 years diploma course at The Mountview Academy of Theatre Arts, Ross launched straight into a highly successful play with Lauren Bacall which in turn took him to the Royal Shakespeare Company. From Theatre to Film and television was a natural progression and he has worked successfully on screen and his career continues to grow from strength to strength.",
        "birthday": "1974-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1717916,
        "imdb_id": "nm1090815",
        "known_for_department": "Acting",
        "name": "Ross O'Hennessy",
        "place_of_birth": "Pontllanfraith, Wales",
        "popularity": 0.2507,
        "profile_path": "/puxkY3ou0PJwyz1J57TZgsPpxX3.jpg"
    }
}