{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/h5jqLrIv1tlszezv2UEWq9KBuoj.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 446354,
                "original_language": "en",
                "original_title": "The Post",
                "overview": "A cover-up that spanned four U.S. Presidents pushed the country's first female newspaper publisher and a hard-driving editor to join an unprecedented battle between journalist and government. Inspired by true events.",
                "popularity": 4.6157,
                "poster_path": "/h4XG3g6uMMPIBPjAoQhC2QIMdkl.jpg",
                "release_date": "2017-12-22",
                "title": "The Post",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 4753,
                "character": "Tony Russo",
                "credit_id": "5ece30ceaaec71002066a9cc",
                "order": 76
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Actor Sonny Valicenti is set to return in the second season of David Fincher's thrilling drama series \"Mindhunter.\" in 2017, Valicenti appeared in Steven Spielberg's \"The Post,\" starring Tom Hanks and Meryl Streep. He was featured in a supporting role in the 2016 holiday comedy Office Christmas Party with Jason Bateman. The part was created specifically for Valicenti by directors Will Speck & Josh Gordon after the duo met him on the set of an Apple campaign shoot. Sonny's television work spans several beloved TV series including Tig Notaro's \"One Mississippi\" for Amazon, \"Lady Dynamite\" on Netflix, and the FX comedy, \"You're the Worst.\" In 2015, Final Scene, the short film he wrote, directed and starred in about the break up of comedy duo Dean Martin and Jerry Lewis appeared at the Austin Film Festival and Dances with Films.\n\nValicenti has appeared off Broadway in productions of Romeo & Juliet, Henry V, and The Spy. Regional credits include the Public Theater production of The Institute of Memory, Abacus, presented at BAM as part of their Next Wave Festival, The Children for the Theatre at Boston Court (a performance the LA Times called \"beyond praise\") and The Firebird with the LA Philharmonic.\n\nOriginally from Barrington, IL, Sonny caught the acting bug in high school and went on to receive a BFA in acting from California Institute of the Arts. He currently lives in Los Angeles.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1718318,
        "imdb_id": "nm3171185",
        "known_for_department": "Acting",
        "name": "Sonny Valicenti",
        "place_of_birth": "Barrington, Illinois, USA",
        "popularity": 0.1583,
        "profile_path": "/j3neEkxxuyf4EnOE2qH0NHuonCS.jpg"
    }
}