{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kv9xVrxfLpudBLyYf1QvLCpUQuy.jpg",
                "genre_ids": [
                    36,
                    18
                ],
                "id": 1182047,
                "original_language": "en",
                "original_title": "The Apprentice",
                "overview": "A young Donald Trump, eager to make his name as a hungry scion of a wealthy family in 1970s New York, comes under the spell of Roy Cohn, the cutthroat attorney who would help create the Donald Trump we know today. Cohn sees in Trump the perfect protégé—someone with raw ambition, a hunger for success, and a willingness to do whatever it takes to win.",
                "popularity": 5.1675,
                "poster_path": "/zxA7bL9qOnU49NXIqpnyJlRvkqs.jpg",
                "release_date": "2024-10-09",
                "title": "The Apprentice",
                "video": false,
                "vote_average": 6.903,
                "vote_count": 739,
                "character": "Daniel Sullivan",
                "credit_id": "65d46438bbcae0018204d95a",
                "order": 70
            },
            {
                "adult": false,
                "backdrop_path": "/oQ024BtJgArg8WI4zfuc2vkCJno.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 363676,
                "original_language": "en",
                "original_title": "Sully",
                "overview": "On 15 January 2009, the world witnessed the 'Miracle on the Hudson' when Captain 'Sully' Sullenberger glided his disabled plane onto the Hudson River, saving the lives of all 155 souls aboard. However, even as Sully was being heralded by the public and the media for his unprecedented feat of aviation skill, an investigation was unfolding that threatened to destroy his reputation and career.",
                "popularity": 5.9412,
                "poster_path": "/4vs83YcJ8TsabADDtaeCJ6ZTjYY.jpg",
                "release_date": "2016-09-07",
                "title": "Sully",
                "video": false,
                "vote_average": 7.197,
                "vote_count": 7442,
                "character": "Patrick Harten",
                "credit_id": "57e68142925141390b00729a",
                "order": 29
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Patrick Darraugh"
        ],
        "biography": "Patch Darragh graduated with honors from Juilliard and began his career playing significant roles in award-winning new plays and revivals at many of the countries top regional theaters, as well our foremost theaters both on and off-Broadway. He has accrued an extensive list of TV credits, more recently on the award winning HBO series SUCCESSION on which he played WayStar Royco board member, Ray Kennedy from Season two to Season four. Patch also had notable arcs on LAW & ORDER: SVU, MR. MERCEDES, THE LOUDEST VOICE, THE PATH, LONGMIRE, BOARDWALK EMPIRE & KALEIDOSCOPE. He's perhaps best known as the lovable Dad on the Netflix cult hit EVERYTHING SUCKS! on which he was a series regular.\n\nOn the film side, Patch can be seen in the Blumhouse features THE FIRST PURGE and CAM. He also starred in the independent films , SULLY, BRITTANY RUNS A MARATHON, and CABRINI. In 2017, Darragh starred in THE DEPTHS, and won Best Supporting Actor at the Los Angeles Film Awards. Upcoming: RESENTMENT, and THE UNION (Netflix).\n\nAs a writer, Patch has developed three television pilots, including two with fellow Juilliard grad Erin Gann. Their feature BIRTHRITE wrapped principle photography in June of 2023.",
        "birthday": "1977-06-21",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 172156,
        "imdb_id": "nm1113773",
        "known_for_department": "Acting",
        "name": "Patch Darragh",
        "place_of_birth": null,
        "popularity": 0.2915,
        "profile_path": "/pLYaRnY2l61DphIUYZvLSlZZfGJ.jpg"
    }
}