{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mpfRchw4jh2cEBajB9EJltTnDH2.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 1429,
                "original_language": "en",
                "original_title": "25th Hour",
                "overview": "In New York City in the days following the events of 9/11, Monty Brogan is a convicted drug dealer about to start a seven-year prison sentence, and his final hours of freedom are devoted to hanging out with his closest buddies and trying to prepare his girlfriend for his extended absence.",
                "popularity": 4.4731,
                "poster_path": "/uW7tTRElr2tRhmAVESzvHy4ByXg.jpg",
                "release_date": "2002-12-19",
                "title": "25th Hour",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 2441,
                "character": "DJ Dusk",
                "credit_id": "5f8baf20efd3c200383865b5",
                "order": 41
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Cipha Sounds (born Luis Diaz; on April 19, 1976) is an American DJ, comedian, and radio and television personality of Puerto Rican descent. He is mostly known for his work as a DJ, a VJ for MTV, and as a comedian.\n\nIn 1996, Sounds started as an intern with Wildman Steve and DJ Riz of New York's Flip Squad, and eventually Riz asked Sounds to spin at clubs with him as an opening DJ. Later on, Lil' Kim asked him to go on tour with her. For a year and a half Sounds worked with Lil' Kim, touring the country and Europe. After he returned to the U.S., Hot 97's Funkmaster Flex asked Sounds to join his Big Dawg Pitbulls crew. He became a mix show DJ on Funkmaster Flex's evening show on Hot 97, and he eventually got his own show called Cipha Saturdays at the same station. On Sirius Satellite Radio's Shade 45 channel, he hosted a show called The Cipha Sounds Effect along with Angela Yee, DJ Wonder and the Emoticon Farragut Foster. He started the show in 2004, and his last show was on July 1, 2008. Before moving on from Shade 45, Sounds started The Juan Epstein Podcast which became the weekend morning show on Hot 97 with Peter Rosenberg. It aired every Sunday from 4am to 9am. The show was called The Cipha/Rosenberg Experience, and they were given a Saturday morning slot from 6am to 10am. HOT 97 later moved The Cipha/Rosenberg Experience to Mon-Fri 5am to 7am, which later grew to 5am to 10am. The HOT 97 Morning Show later added Ebro Darden and Laura Stylez. Cipha Sounds is known for being the first to play Rihanna, Rick Ross, and more on NYC Radio. When Angie Martinez left HOT 97 to move to POWER 105.1, Cipha took over her slot on Weekday afternoons. After months of growing tension, and less than 24 hours after he had criticized management on a podcast regarding his removal as interim host of the afternoon show, Cipha was fired from Hot 97. He was ultimately with the station for more than 17 years. It was announced on February 20, 2015, that Cipha Sounds had signed with ROC Nation  From 2003 to 2006, Sounds was a DJ for Comedy Central's Chappelle's Show, for 19 episodes. In April 2006, he became the host of MTV's urban music video program Direct Effect which later became Sucker Free.",
        "birthday": "1976-04-19",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1722346,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "DJ Cipha Sounds",
        "place_of_birth": "The Bronx, New York, USA",
        "popularity": 0.0071,
        "profile_path": null
    }
}