{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dsqlBtXS5DJBrFYTIYJuSD5YatF.jpg",
                "genre_ids": [
                    35
                ],
                "id": 179150,
                "original_language": "fr",
                "original_title": "Réalité",
                "overview": "A wanna-be director is given 48 hours by a producer to find the best groan of pain, worthy of an Oscar, as the only condition to back his film.",
                "popularity": 1.8685,
                "poster_path": "/l6aty0lfqsTefZ5xduwT7D44N1q.jpg",
                "release_date": "2015-02-18",
                "title": "Reality",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 532,
                "character": "Frank",
                "credit_id": "60bea35f8ddc3400787cae57",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Marc Burnham"
        ],
        "biography": "MARK BURNHAM is an actor and filmmaker living in Los Angeles. After college, Mark began training at the MET Theatre, where he was a founding member of the MET Theatre Workshop under the tutelage of, and studying along side Oscar, Emmy, Tony, and Pulitzer Prize winners. Through the 1990's, Mark could be seen on television in MAG7, Buffy, 3rd Rock, Action, Sunset Beach, USA High, and Warden Of Red Rock. In 2012, Mark met Quentin Dupieux and spent the next two years working with the auteur director and DJ on four films; WRONG from DraftHouse, WRONG COPS ep1, WRONG COPS (feat), and REALITE' from IFC Midnight. In 2014 Mark Co-Produced the English language film HIDDEN IN THE WOODS from Chilean director Patricio Valladares and Sony Releasing. In 2018 Mark was seen in student Academy Award winner Ryan Prows first feature LOWLIFE playing Teddy Haynes from IFC Midnight. Before the pandemic shutdown in 2020, Mark was cast in the Legendary Entertainment and Netflix film THE TEXAS CHAINSAW MASSACRE as Leatherface.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 172254,
        "imdb_id": "nm0122511",
        "known_for_department": "Acting",
        "name": "Mark Burnham",
        "place_of_birth": null,
        "popularity": 0.2448,
        "profile_path": "/7MXSK9i4rU96zHeUZTVPqEsciv.jpg"
    }
}