{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6b6UpsOXmjO8mJKYsGTG9HW49CN.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 1443,
                "original_language": "en",
                "original_title": "The Virgin Suicides",
                "overview": "A group of male friends become obsessed with five mysterious sisters who are sheltered by their strict, religious parents.",
                "popularity": 5.8315,
                "poster_path": "/1NCQtXPQnaHRjOZVmktA9BSM35F.jpg",
                "release_date": "2000-04-21",
                "title": "The Virgin Suicides",
                "video": false,
                "vote_average": 7.12,
                "vote_count": 3436,
                "character": "Mary Lisbon",
                "credit_id": "52fe42f8c3a36847f803092b",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "AJ Cook",
            "Andrea Joy Cook",
            "A・J・クック",
            "艾·潔·庫克",
            "A.J. Cook",
            "ای. جی. کوک"
        ],
        "biography": "Andrea Joy \"A.J.\" Cook (born July 22, 1978) is a Canadian actress best known for her role as Supervisory Special Agent Jennifer \"JJ\" Jareau in the CBS crime drama Criminal Minds. She has also appeared in several Hollywood films including The Virgin Suicides, Out Cold, and Final Destination 2.\n\nCook was born in Oshawa, Ontario, and spent most of her life growing up in Whitby, where she attended Anderson Collegiate Vocational Institute. Her father, Mike, is a teacher, and her mother, Sandra, works as a psychiatrist.She has three siblings, Nathan, Paul, and Angela. Cook is a member of The Church of Jesus Christ of Latter-day Saints.A dancer from age four,Cook began taking jazz, tap and ballet lessons. She danced competitively for many years, before deciding at the age of 16 that she wanted to try acting.\n\nOn August 3, 2001, Cook married her long-time boyfriend, Nathan Andersen, whom she met in a film class at Utah Valley University. She later moved to Salt Lake City, Utahto be with him and currently resides in Los Angeles, California.In March 2008, it was reported that Cook and Andersen would be expecting their first child in October.Their son, Mekhai Allan Andersen, was born on September 13, 2008. Cook said \"He's such a good baby. I feel so lucky that he's mine. My husband and I feel very blessed!\"Mekhai made a brief appearance as Henry LaMontagne in Criminal Minds in Season 5 when Cook's character Jennifer Jareau was in a pharmacy buying children's medicine which leads to a breakthrough in the case the BAU was currently trying to solve.[13] He reprised the role of Henry in the Criminal Minds two-hour season seven finale in 2012. Cook and Andersen are also the owners of a Yorkshire Terrier named Zara.Cook was considered legally blind at an early age because of a severe astigmatism, but wore contacts to correct her vision. She eventually underwent surgery where a lens implant was used to correct the impairment.Cook is best friends with actress Meghan Ory.\n\nDescription above from the Wikipedia article A. J. Cook (actress), licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1978-07-22",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 17236,
        "imdb_id": "nm0176882",
        "known_for_department": "Acting",
        "name": "A. J. Cook",
        "place_of_birth": "Oshawa, Ontario, Canada",
        "popularity": 0.9363,
        "profile_path": "/tvEjGDQVuu7jiOvWXwEU6tEE7NW.jpg"
    }
}