{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6qOyw4yfzbzTp5YsCX26C28Do0S.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 872,
                "original_language": "en",
                "original_title": "Singin' in the Rain",
                "overview": "In 1927 Hollywood, a silent film star falls for a chorus girl just as he and his paranoid screen partner struggle to make the difficult transition to talking pictures.",
                "popularity": 4.2669,
                "poster_path": "/w03EiJVHP8Un77boQeE7hg9DVdU.jpg",
                "release_date": "1952-04-10",
                "title": "Singin' in the Rain",
                "video": false,
                "vote_average": 8.146,
                "vote_count": 3306,
                "character": "Chorus Girl (uncredited)",
                "credit_id": "61abe6662634620041823bc1",
                "order": 24
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Betty Van Allen (March 17, 1927 – June 22, 2009) was an American operatic mezzo-soprano who had an active international singing career during the 1950s through the 1970s. In the latter part of her career her voice acquired a contralto-like darkening, which can be heard on her recording of Sergei Prokofiev’s Alexander Nevsky with conductor Eugene Ormandy and the Philadelphia Orchestra. She was known for her collaborations with American composers, such as Leonard Bernstein, Aaron Copland, David Diamond, Ned Rorem, and Virgil Thomson among others.\n\nAllen was part of the first generation of black opera singers to achieve wide success and is viewed as part of an instrumental group of performers who helped break down the barriers of racial prejudice in the opera world. She was greatly admired by Bernstein and the conductor notably chose her to be the featured soloist for his final performances as music director of the New York Philharmonic in 1973. After her singing career ended, she became a lauded voice teacher and arts administrator.",
        "birthday": "1927-03-17",
        "deathday": "2009-06-22",
        "gender": 1,
        "homepage": null,
        "id": 1723456,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Betty Van Allen",
        "place_of_birth": "Campbell, OH",
        "popularity": 0.0214,
        "profile_path": null
    }
}