{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ycNyvi9gk4ZI2NLk4KBbseNZbfN.jpg",
                "genre_ids": [
                    99
                ],
                "id": 58496,
                "original_language": "en",
                "original_title": "Senna",
                "overview": "The remarkable story of Brazilian racing driver Ayrton Senna, charting his physical and spiritual achievements on the track and off, his quest for perfection, and the mythical status he has since attained, is the subject of Senna, a documentary feature that spans the racing legend's years as an F1 driver, from his opening season in 1984 to his untimely death a decade later.",
                "popularity": 2.9837,
                "poster_path": "/nZbLCbRoP6iJq5sr8daHQzjnzFh.jpg",
                "release_date": "2010-10-07",
                "title": "Senna",
                "video": false,
                "vote_average": 8.112,
                "vote_count": 1116,
                "character": "Self",
                "credit_id": "5855d2989251411a46046744",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Galvão Bueno, born on July 21, 1950, in Rio de Janeiro, Brazil, is a celebrated Brazilian sports commentator, best known for his enthusiastic coverage of Formula 1 and football. With a broadcasting career spanning over four decades, Bueno became the voice of Brazilian sports, working with Rede Globo, Brazil’s largest television network. His passionate, high-energy commentary style made him a household name, especially during Brazil's football World Cup victories and Ayrton Senna’s iconic moments in Formula 1.\n\nBueno’s iconic catchphrases and emotional connections with athletes, particularly with Senna, earned him widespread affection and recognition. He covered ten World Cups and countless Formula 1 races, making his voice synonymous with major sports events in Brazil.\n\nIn addition to his commentary career, Bueno ventured into business, including wine production, founding his own winery. He retired from regular broadcasting in recent years but remains a cherished figure in Brazilian sports media, with his voice still echoing in the memories of countless fans.",
        "birthday": "1950-07-21",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1724041,
        "imdb_id": "nm4081795",
        "known_for_department": "Acting",
        "name": "Galvão Bueno",
        "place_of_birth": "Rio de Janeiro, Brazil",
        "popularity": 0.1501,
        "profile_path": "/xMinaMBm3T9Lr0anZTXgA0TMfhi.jpg"
    }
}