{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bdms9QMM4y6NBKIvXDINsKnK0Fj.jpg",
                "genre_ids": [
                    12,
                    18,
                    36
                ],
                "id": 26428,
                "original_language": "en",
                "original_title": "Agora",
                "overview": "A historical drama set in Roman Egypt, concerning philosopher Hypatia of Alexandria and her relationship with her slave Davus, who is torn between his love for her and the possibility of gaining his freedom by joining the rising tide of Christianity.",
                "popularity": 2.5396,
                "poster_path": "/1xsFa6I5vDd2UI1AJ1tsW7BUChv.jpg",
                "release_date": "2009-05-17",
                "title": "Agora",
                "video": false,
                "vote_average": 6.998,
                "vote_count": 1489,
                "character": "Synesius",
                "credit_id": "52fe4501c3a368484e043399",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "​From Wikipedia, the free encyclopedia. Rupert Evans (Born 9 March 1977) is an English actor, who is well known in the United Kingdom for his television career.\n\nEvans was born in Staffordshire, England. He attended Milton Abbey School, in Dorset, and went on to train at the Webber Douglas Academy of Dramatic Art. He has secured a variety of television credits in the UK, including the BBC sitcom My Family, the drama Crime and Punishment starring John Simm and North and South. He also starred in ITV's High Stakes sitcom with Richard Wilson, and Paradise Heights, the BBC drama starring Neil Morrissey.\n\nHis first major film role was as FBI Agent John Myers in director Guillermo del Toro's 2004 adaptation of the Mike Mignola comic book Hellboy. Evans appeared as King Richard IV, the head of a fictional royal family, in the short-lived The Palace.He also appeared in Agora, filmed in Malta with Rachel Weisz and Max Minghella.  Description above from the Wikipedia article Rupert Evans , licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1976-03-09",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 17283,
        "imdb_id": "nm1140344",
        "known_for_department": "Acting",
        "name": "Rupert Evans",
        "place_of_birth": "Stowe-by-Chartley, England, United Kingdom",
        "popularity": 0.4129,
        "profile_path": "/YrsdSUjinm0NN6qd8Y2znPf8Cg.jpg"
    }
}