{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/d3eUH2Cb9C121I43kpYaPjyEDq1.jpg",
                "genre_ids": [
                    18
                ],
                "id": 290542,
                "original_language": "en",
                "original_title": "You're Not You",
                "overview": "A drama centered on a classical pianist who has been diagnosed with ALS and the brash college student who becomes her caregiver.",
                "popularity": 2.1651,
                "poster_path": "/jvrdukoeCuVckHlbAxU0MPoIzPI.jpg",
                "release_date": "2014-10-10",
                "title": "You're Not You",
                "video": false,
                "vote_average": 7.404,
                "vote_count": 814,
                "character": "Keely",
                "credit_id": "5408ffa60e0a263a1b000926",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Эли Лартер",
            "Alison Elizabeth Larter",
            "Alison Larter",
            "Άλι Λάρτερ",
            "علی لارتر",
            "Alison Elizabeth \"Ali\" Larter"
        ],
        "biography": "Alison Elizabeth \"Ali\" Larter (born February 28, 1976) is an American actress best known for playing the dual roles of Niki Sanders and Tracy Strauss on the NBC science fiction drama Heroes.\n\nShe also appeared in guest roles on several television shows in the 1990s. Her screen debut came in the 1999 film Varsity Blues, followed by the horror films House on Haunted Hill and Final Destination. Major supporting roles in the comedy Legally Blonde and the romantic comedy A Lot Like Love led her to lead roles as the titular character in the Bollywood film Marigold and in the 2009 thriller Obsessed. Larter achieved wider fame after her portrayal of video game heroine Claire Redfield in the successful films, Resident Evil: Extinction and Resident Evil: Afterlife. Larter frequently appears in \"Hot\" lists compiled by Maxim, FHM and Stuff as well as People magazine's \"Best Dressed List\" in 2007. After a three year relationship, Larter married actor Hayes MacArthur in a small ceremony in Maine in August 2009. The couple have a son, born December 2010.\n\nDescription above from the Wikipedia article Ali Larter, licensed under CC-BY-SA, full list of contributors on Wikipedia​",
        "birthday": "1976-02-28",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 17303,
        "imdb_id": "nm0005123",
        "known_for_department": "Acting",
        "name": "Ali Larter",
        "place_of_birth": "Cherry Hill, New Jersey, USA",
        "popularity": 3.6461,
        "profile_path": "/2HOlaSd30yBCrr366GfPG2PF6D8.jpg"
    }
}