{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jBz16NsAeKjpHNznl1EHlcr704P.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 9571,
                "original_language": "en",
                "original_title": "Dazed and Confused",
                "overview": "The adventures of a group of Texas teens on their last day of school in 1976, centering on student Randall Floyd, who moves easily among stoners, jocks and geeks. Floyd is a star athlete, but he also likes smoking weed, which presents a conundrum when his football coach demands he sign a \"no drugs\" pledge.",
                "popularity": 3.1038,
                "poster_path": "/msG9awbLhVZwv1Eh9Ge7SofMexW.jpg",
                "release_date": "1993-09-24",
                "title": "Dazed and Confused",
                "video": false,
                "vote_average": 7.319,
                "vote_count": 2143,
                "character": "Parking Lot Kid (uncredited)",
                "credit_id": "62fd182ab5bc21007cec45ef",
                "order": 60
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Anthony Pedone is a Writer/Director/Actor/Producer and Sundance Alumni.\n\nAnthony was born in Texas but spent the formational years of his life on a ranch in Clayton, New Mexico. At 16 he moved back to Texas and played in multiple musical projects while studying music at Texas State University.\n\nIn 2008 he co-founded Robotic Indifference and has collaborated with an innovative and diverse group of artists to produce over a dozen award winning films.\n\nIn 2015, Anthony produced THE STRONGEST MAN. Written and directed by Kenny Riches, THE STRONGEST MAN world premiere at Sundance and was released theatrically, and on VOD by Film Buff in North America and Sundance Global internationally.\n\nOther endeavors include THE WHY which screened in 6 countries, receiving multiple Best Experimental Feature Awards; THE CASSEROLE CLUB, winner of 5 Independent Vision Awards; ISIP THE WARRIOR, winner of Audience Choice Award for Best Short Film at The Key West Film Festival; CAMP CASSEROLE winner of Best of Fest at the Radar Hamburg Film Festival; and ROUNDBALL which world premiered at the 47th Annual World Fest in Houston, TX and received the Platinum Remi award for Best Romantic Comedy.\n\nAnthony is also the founder and Executive Director of The Victoria TX Independent Film Festival and The Self-Medicated Film Expo(RxSM).\n\nIn 2012 Anthony started Film Exchange, an international network of festivals that program several major cities including: Berlin, Austin, New Orleans, New York, Bend, Oregon, Corpus Christi and Lake Tahoe. Film Exchange is dedicated to helping regional films find international audiences, and has generated over 100 screenings internationally, given financial support to indie film projects, and has awarded over $180,000 in film services for its filmmakers in the 3 years it has been in operation.\n\n- IMDb Mini Biography By: anthony pedone",
        "birthday": "1970-06-23",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1730329,
        "imdb_id": null,
        "known_for_department": "Directing",
        "name": "Anthony Pedone",
        "place_of_birth": "Dallas, Texas, USA",
        "popularity": 0.0461,
        "profile_path": "/4dTFQz6nzFzqgGuoOXgNcCaVxtJ.jpg"
    }
}