{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rpsHpJj7FgnNBXhaO2KFthPwqH6.jpg",
                "genre_ids": [
                    10749,
                    18,
                    35
                ],
                "id": 200727,
                "original_language": "en",
                "original_title": "Love, Rosie",
                "overview": "Since the moment they met at age 5, Rosie and Alex have been best friends, facing the highs and lows of growing up side by side. A fleeting shared moment, one missed opportunity, and the decisions that follow send their lives in completely different directions. As each navigates the complexities of life, love, and everything in between, they always find their way back to each other - but is it just friendship, or something more?",
                "popularity": 5.8942,
                "poster_path": "/8Mf9GgyNv5jjLAAPGsom9skH2Du.jpg",
                "release_date": "2014-10-16",
                "title": "Love, Rosie",
                "video": false,
                "vote_average": 7.819,
                "vote_count": 6361,
                "character": "Herb",
                "credit_id": "5871e9ac925141356401256e",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Nick Lee is an Irish actor. His work on screen includes Reign (The CW); The Fall (BBC); Jack Taylor (TV3/RTL); Raw (RTÉ); Single-Handed: The Stolen Child (RTÉ); as Michael Collins in Frongoch - University of Revolution (TG4/S4C); The Clinic (RTÉ); Battlefield Britain (BBC); and the final series of Bachelors Walk (RTÉ). His stage work includes: The Changeling (Young Vic, London); Dubliners (Dublin Theatre Festival); Juno and the Paycock directed by Howard Davies (Abbey Theatre/National Theatre, London); Pineapple by Philip McMahon (Calipo); Malachy in The Dead School by Pat McCabe (Tricycle Theatre, London); The Passing written and directed by Paul Mercier and Three Sisters directed by David Leveaux (Abbey Theatre Dublin); Dmitry Karamazov in Delirium by Enda Walsh; Shawn Keogh in The Playboy of the Western World directed by Tony award winning director Garry Hynes (Druid/Tokyo International Arts Festival/Perth International Arts Festival, Australia); DruidSynge- The Complete Plays of JM Synge directed by Garry Hynes (Galway, Dublin, Edinburgh, Inis Meain, Guthrie Theater Minneapolis & at the Lincoln Center Festival in New York City); The Year of the Hiker directed by Garry Hynes (Druid/Irish Tour); as Michael Hegarty in The Freedom of the City by Brian Friel (Finborough Theatre, London); as Patrick Kavanagh in The Green Fool (Upstate Theatre Project)",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.weaudition.com/nicklee",
        "id": 1734961,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Nick Lee",
        "place_of_birth": "County Monaghan, Ireland",
        "popularity": 0.072,
        "profile_path": "/aH5NJgeOE4H0uRq4R2f2FNVtC5U.jpg"
    }
}