{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yQtFsAby716b8JMlGls9Suzs87z.jpg",
                "genre_ids": [
                    18
                ],
                "id": 1367,
                "original_language": "en",
                "original_title": "Rocky II",
                "overview": "After Rocky goes the distance with champ Apollo Creed, both try to put the fight behind them and move on. Rocky settles down with Adrian but can't put his life together outside the ring, while Creed seeks a rematch to restore his reputation. Soon enough, the \"Master of Disaster\" and the \"Italian Stallion\" are set on a collision course for a climactic battle that is brutal and unforgettable.",
                "popularity": 6.7493,
                "poster_path": "/nMaiiu0CzT77U4JZkUYV7KqdAjK.jpg",
                "release_date": "1979-06-15",
                "title": "Rocky II",
                "video": false,
                "vote_average": 7.281,
                "vote_count": 4584,
                "character": "Meat Foreman (uncredited)",
                "credit_id": "52fe42efc3a36847f802e12f",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/rBL73dGfdEqTr7Xj0HytF9s9SbM.jpg",
                "genre_ids": [
                    35,
                    12
                ],
                "id": 11153,
                "original_language": "en",
                "original_title": "National Lampoon's Vacation",
                "overview": "Clark Griswold is on a quest to take his family to the Walley World theme park for a vacation, but things don't go exactly as planned.",
                "popularity": 4.2383,
                "poster_path": "/q3DvoqY06yZnRp9faH6uge7n7VP.jpg",
                "release_date": "1983-07-29",
                "title": "National Lampoon's Vacation",
                "video": false,
                "vote_average": 7.104,
                "vote_count": 1638,
                "character": "Grover",
                "credit_id": "52fe44039251416c75025f47",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Frank McRae (born June 3, 1942, died April 29, 2021) was an American actor and former professional football player.\n\nMcRae was born in Memphis, Tennessee. McRae graduated from Tennessee State University with a double major in drama and history. He was a defensive tackle for the Chicago Bears in the 1967 NFL season.\n\nAmong his acting roles are the history teacher, Mr. Teasdale, in Red Dawn, bank robber Reed Youngblood in Dillinger, Hazel in Cannery Row, Spanky in The Wizard, James Bond's friend Sharkey in 1989's Licence to Kill, inmate Eclipse in Lock Up, shouting police captain in 48 Hrs. (a role he later parodied in Last Action Hero and Loaded Weapon 1), the train coachman in Tracks and former professional boxing champion Harry Noble in *batteries not included. He also made an effective pairing with John Candy as two bumbling subordinates; first as two tank soldiers (under an equally bumbling Sgt. Frank Tree played by Dan Aykroyd) in the cult classic 1941 and later as \"Walley World\" Security Guards in National Lampoon's Vacation . He played Jim, the Mechanic in the movie Used Cars. His most recent role was as a guest star on the television series ER. He also portrayed the character of Sergeant Tenga in Farewell to the King\n\nDescription above from the Wikipedia article Frank McRae, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1941-03-18",
        "deathday": "2021-04-29",
        "gender": 2,
        "homepage": null,
        "id": 1735,
        "imdb_id": "nm0574433",
        "known_for_department": "Acting",
        "name": "Frank McRae",
        "place_of_birth": "Memphis, Tennessee, USA",
        "popularity": 0.9052,
        "profile_path": "/5aGo82fuwSs1k9ZQckvdFGLjqPE.jpg"
    }
}