{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qKxAghWoR2M8ZIheMpbHp8jeXFi.jpg",
                "genre_ids": [
                    18,
                    12,
                    36
                ],
                "id": 9912,
                "original_language": "en",
                "original_title": "The World's Fastest Indian",
                "overview": "The life story of New Zealander Burt Munro, who spent years building a 1920 Indian motorcycle—a bike which helped him set the land-speed world record at Utah's Bonneville Salt Flats in 1967.",
                "popularity": 6.0963,
                "poster_path": "/vUIwPFAAXeCUuS040uGC0xSatcG.jpg",
                "release_date": "2005-10-12",
                "title": "The World's Fastest Indian",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 821,
                "character": "Engineer",
                "credit_id": "6607aefbe1faed017dfba22d",
                "order": 34
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Early life\n\nHe attended the University of Louisville where he received a Bachelor of Fine Arts degree in Theatre. For several years he worked as a stage actor and director.\n\nActing career\n\nIn 1997, he moved into acting for film and television. In 1998 (during a four-month period), he played three different villainous roles on Xena: Warrior Princess. One of the roles gave him the distinction of being victim to Gabrielle (Renee O'Connor) in the \"infamous Drool scene\", is named by Xena fans, from the episode, In Sickness and In Hell.\n\nIn 2005 he appeared in New Zealand's medical soap opera Shortland Street as nurse 'Liam Todd', caregiver to Dr. Chris Warner's twin sister, Amanda Warner (Marissa Stott).\n\nIn 2007 he got his first major role in the Power Rangers franchise, the new voice of Alpha 6 in the Operation Overdrive episode “Once a Ranger”. He would go on to villainous voice Admiral Malkor in Power Rangers Megaforce, Snide in Power Rangers Dino Super Charge, Galaxy Warriors host Cosmo Royale and Ripcon in Power Rangers Ninja Steel and Super Ninja Steel and Scrozzle in Power Rangers Beast Morphers.",
        "birthday": "1966-01-13",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.kractors.co.nz/Campbell~Cooley",
        "id": 173596,
        "imdb_id": "nm0177587",
        "known_for_department": "Acting",
        "name": "Campbell Cooley",
        "place_of_birth": "Pensacola, Florida, USA",
        "popularity": 0.1602,
        "profile_path": "/dcv1puzLCp3xuYKqiNyWb8VEXsF.jpg"
    }
}