{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hVvW015x8cD2X0KthGovw27EpF2.jpg",
                "genre_ids": [
                    10402,
                    10749,
                    35
                ],
                "id": 2769,
                "original_language": "en",
                "original_title": "An American in Paris",
                "overview": "Jerry Mulligan is an exuberant American expatriate in Paris trying to make a reputation as a painter. His friend Adam is a struggling concert pianist who's a long time associate of a famous French singer, Henri Baurel. A lonely society woman, Milo Roberts, takes Jerry under her wing and supports him, but is interested in more than his art.",
                "popularity": 3.5492,
                "poster_path": "/lyDXkvG53ldz6Cf7dbjJl7TaoP5.jpg",
                "release_date": "1951-09-26",
                "title": "An American in Paris",
                "video": false,
                "vote_average": 7.026,
                "vote_count": 606,
                "character": "Frenchman (uncredited)",
                "credit_id": "63a5ddabc6006d008903aba7",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Like most extras of his day, Larry Arnold made a career of being seen but never really being noticed. He started doing background work in the 1930s where his ordinary look made him a perfect fit for socialite scenes and to play your average looking person. The big budget films of the 1930s and 1940s kept him and many other extras constantly busy. With the acceptance of television shows into the motion picture industry, Arnold's career trajectory was like that of most extras. The big budget movies were fading away and they were replaced by television episodes. While this may have seemed like an attractive offering to most outsides, the work was not constant and it was not consistent so Arnold would regularly work as a stand-in for various actors where he may appear as an extra but his primary function was to stand on set and allow technicians to adjust their lights to him when the star was busy.\n\nBy the mid 1950s, Arnold found his way into working for various studios when he could not find stand-in work. He would appear in various television westerns and dramas. His wardrobe was not limited to a single genre or a job. One week he could appear as a cowboy in a episode of Gunsmoke or as a chef in an episode of The Untouchables. These random appearances continued throughout the rest of his career where he was just at home on a western set as he was on a drama set. While the name Larry Arnold may not mean much to the general public, her was the very personification of a professional extra by showing up with whatever wardrobe he needed to have and do whatever the scene required.",
        "birthday": "1900-04-11",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1735151,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Larry Arnold",
        "place_of_birth": "Canton, Connecticut, USA",
        "popularity": 0.0404,
        "profile_path": null
    }
}