{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bwgjIlMoSyU1Iw0IhNIFUeSbNDy.jpg",
                "genre_ids": [
                    18
                ],
                "id": 68722,
                "original_language": "en",
                "original_title": "The Master",
                "overview": "Freddie, a volatile, heavy-drinking veteran who suffers from post-traumatic stress disorder, finds some semblance of a family when he stumbles onto the ship of Lancaster Dodd, the charismatic leader of a new \"religion\" he forms after World War II.",
                "popularity": 5.8235,
                "poster_path": "/jjVGdNt4fYb3T2hjISGZ2qnCuaV.jpg",
                "release_date": "2012-09-14",
                "title": "The Master",
                "video": false,
                "vote_average": 7.113,
                "vote_count": 3105,
                "character": "V.A. Patient",
                "credit_id": "64c6797530f79c013bd28951",
                "order": 36
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Jeffrey Jenkins is SAG eligible Actor, he was born in San Francisco, and grew up in the small town of San Bruno; just a few miles south on the Peninsula. He started taking Tap dancing at age eight, which led to a continued study of Jazz, Swing, Waltz, and Social ballroom; and has been performing on stage ever since. After high school he was cast in thirteen local community theater productions, and he has studied Voice under Mildred Owen; he is a Bass/Baritone. He studied Acting with Bob Curtis at Cañada College, Advance Acting with Professor Jo Tomlin and Barbara Damashek, and Advanced in Front of the Camera with Professor Rick Houlberg, at SFSU. He received his BA in Broadcasting Electronic Communication Arts; emphasis in Production and Animation; 2007. During his senior year he interned for the MythBusters on Discovery Channel as a PA, Researcher and Location Scout, and won best documentary for a short film titled, 'Living History,' that he directed and produced at SFSU; and a national AEGIS award. He started Acting seriously again in 2009, landing background roles in 'The Curious Case of Benjamin Button,\"The Butler's In Love,' and five episodes on NBC's 'Trauma.' His first starring role was for Investigation Discovery Channel's 'I Almost Got Away with It;' episode: 203, 'Got a Dead Man's ID;' and he has been a co-star in three following episodes. He got his SAG eligibility working for Paul Thomas Anderson on 'The Master,' along side Joaquin Phoenix and Phillip Seymour Hoffman, which landed him a role and credit. He studies History and collects Vintage clothing which has helped him land many roles and parts. He continues to work in commercials and film: 'Moneyball,' 'Blue Jasmine,' and 'Steve Jobs;' and appreciates everyone that has helped him on this journey. Please see his IMDB and YouTube profiles for videos and images of his work.\n\n- IMDb Mini Biography By: Jeffrey W. Jenkins",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1736599,
        "imdb_id": "nm4166185",
        "known_for_department": "Acting",
        "name": "Jeffrey W. Jenkins",
        "place_of_birth": "San Francisco, California, USA",
        "popularity": 0.3933,
        "profile_path": "/jpOqkhFo3LzWDm92nhwHyZQTWYx.jpg"
    }
}