{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yYe63HwFBNFDcnWtBm8KR6NSAeg.jpg",
                "genre_ids": [
                    18,
                    10749,
                    10752
                ],
                "id": 409,
                "original_language": "en",
                "original_title": "The English Patient",
                "overview": "In the 1930s, Count Almásy is a Hungarian map maker employed by the Royal Geographical Society to chart the vast expanses of the Sahara Desert along with several other prominent explorers. As World War II unfolds, Almásy enters into a world of love, betrayal, and politics.",
                "popularity": 5.7646,
                "poster_path": "/8eHHqMg8qEYtVw8LQLygsHXSR2q.jpg",
                "release_date": "1996-11-14",
                "title": "The English Patient",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 2287,
                "character": "Kiss Me Soldier",
                "credit_id": "5713299ac3a3686636005663",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Jason Done (born 5 April 1973) is an English actor who appeared as Mordred in the 1998 TV miniseries Merlin, opposite Sam Neill. However he is best known for his role as Stephen Snow in ITV drama Where The Heart Is from 1999 to 2001 and Tom Clarkson in the BBC drama Waterloo Road from 2006 to 2013.\n\nWhere The Heart Is - Jason appeared as Stephen Snow in the ITV drama series Where The Heart Is, taking over the part in series 3 from William Ash, in 1999. Stephen Snow was the son of Peggy Snow (Pam Ferris) and Vic Snow (Tony Haygarth). Jason portrayed Stephen throughout series 3 & 4 & part of series 5, during which the character left the fictional town of Skelthwaite.\n\nWaterloo Road - On 9 March 2006, Done began appearing as schoolteacher, Tom Clarkson in the successful BBC One drama series, Waterloo Road. On 10 April 2013, it was announced that Done would be leaving his role as Tom after seven years and eight series. Tom left the series in the final episode of the eighth series, on 4 July 2013, in a shock twist which saw Tom fall from the school roof after helping troubled pupil, Kyle Stack (George Sampson) from committing suicide. Done is the second longest serving cast member.\n\nTV - In May 2014, Done appeared as Andrew Wendell in Casualty and in October 2014 as Paul Brightway in the story \"The Lions of Nemea\", part of series 8 of the ITV drama series Lewis. He also started in Closets, a short film. On 7 February 2016, Done appeared in the TV series Vera. In 2016, he appeared in the ITV/Netflix series Paranoid. Coronation Street 2017.\n\n(Wikipedia)",
        "birthday": "1973-04-05",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 173666,
        "imdb_id": "nm0232383",
        "known_for_department": "Acting",
        "name": "Jason Done",
        "place_of_birth": "Salford, Manchester, England, UK",
        "popularity": 0.786,
        "profile_path": "/ieJqdSIpWMu7hFqeJbftAgXegHg.jpg"
    }
}