{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/oNoprEND25zXR6Fns8cIZUkuoMc.jpg",
                "genre_ids": [
                    35,
                    80,
                    18
                ],
                "id": 308266,
                "original_language": "en",
                "original_title": "War Dogs",
                "overview": "Based on the true story of two young men, David Packouz and Efraim Diveroli, who won a $300 million contract from the Pentagon to arm America's allies in Afghanistan.",
                "popularity": 6.4733,
                "poster_path": "/mDcPRjZC1bb6LavFU3gwsWdVfCM.jpg",
                "release_date": "2016-08-18",
                "title": "War Dogs",
                "video": false,
                "vote_average": 6.926,
                "vote_count": 5190,
                "character": "Saudi Businessman (uncredited)",
                "credit_id": "587671bcc3a36824050000d8",
                "order": 92
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Hassan Said is a multi-lingual, Egyptian born, award winning Director as well as Producer and Writer - with over decade plus experience in motion pictures, commercials, music videos, documentary and web content. Furthermore, Hassan is also a member of the Screen Actors Guild of America. He has created content in English, Arabic, Spanish, Portuguese and French.  Upon graduating from Academy of Art University in San Francisco, Hassan began working as a videographer/editor at the renowned agency Goodby, Silverstein and Partners for clients like Yahoo, NBA, Sprint, Cheetos, Dickies, HP, Adobe, Haagen Dazs, to name a few. Not soon after, Hassan traveled to Angola with the sponsorship of ministry of culture to produce and mentor a Portuguese speaking film Alambamento which went on to win multiple awards and gain distribution in over 40+ countries as well as platforms like Amazon, iTunes and more. Fast forward several years later, his work has won multiple awards, screened in over 50 festivals in over 40 countries with write-ups by independent critics as well as international magazine outlets globally. Later he moved to Los Angeles working on multiple projects from commercials to television to narrative with prominent clients like Warner Bros., Universal, Paramount, MJZ, Biscuit Filmworks, Focus Features, NBC and more in multiple capacities.  He has directed over ten award winning narrative short films, as well as a number of commercials, music videos, web series and documentary content. Currently he is developing over five feature films, music videos and other projects in the United States and abroad. He hopes to continue to tell stories of self-awareness and vivid realities. His poetic use of striking characters and imagery explores the psychological impact of both life’s shocking and heartwarming moments.  Recently, Hassan embarked on directing, producing, and writing on the upcoming feature film THIS IS YOUR SONG. An ambitious tour-de-force project set in San Francisco, that incorporates a 97 minute one single take shot, making it the longest running shot in US film cinema.  The film is currently in post production.\n\nWhen he’s not working, you can find Hassan hammering at his typewriter working on his five features in development for US and abroad; maybe wandering the streets of Los Angeles or San Francisco taking pictures with his old Hasselblad or showcasing his photography in various galleries and exhibitions locally and globally.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "http://hassansaid.com",
        "id": 1737075,
        "imdb_id": "nm1737524",
        "known_for_department": "Acting",
        "name": "Hassan Said",
        "place_of_birth": "Alexandria, Egypt",
        "popularity": 0.0654,
        "profile_path": "/bCuIJ2Vf2BtCCH6S55JzHc5WwEu.jpg"
    }
}