{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uw4SnKFZ453Gxmj5XR5Susj8TNo.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 602,
                "original_language": "en",
                "original_title": "Independence Day",
                "overview": "Strange phenomena surface around the globe. The skies ignite. Terror races through the world's major cities. As these extraordinary events unfold, it becomes increasingly clear that a force of incredible magnitude has arrived. Its mission: total annihilation over the Fourth of July weekend. The last hope to stop the destruction is an unlikely group of people united by fate and unimaginable circumstances.",
                "popularity": 8.4642,
                "poster_path": "/p0BPQGSPoSa8Ml0DAf2mB2kCU0R.jpg",
                "release_date": "1996-06-25",
                "title": "Independence Day",
                "video": false,
                "vote_average": 6.896,
                "vote_count": 9963,
                "character": "Arab Pilot",
                "credit_id": "52fe425bc3a36847f801807b",
                "order": 85
            },
            {
                "adult": false,
                "backdrop_path": "/cyecB7godJ6kNHGONFjUyVN9OX5.jpg",
                "genre_ids": [
                    28,
                    878,
                    12
                ],
                "id": 1726,
                "original_language": "en",
                "original_title": "Iron Man",
                "overview": "After being held captive in an Afghan cave, billionaire engineer Tony Stark creates a unique weaponized suit of armor to fight evil.",
                "popularity": 16.604,
                "poster_path": "/78lPtwv72eTNqFW9COBYI0dWDJa.jpg",
                "release_date": "2008-04-30",
                "title": "Iron Man",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 27317,
                "character": "Abu Bakaar",
                "credit_id": "52fe4311c3a36847f8037ef7",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/jRZ3joUcg8YDCQYl4Tog5xhY6wk.jpg",
                "genre_ids": [
                    28,
                    53
                ],
                "id": 36955,
                "original_language": "en",
                "original_title": "True Lies",
                "overview": "A fearless, globe-trotting, terrorist-battling secret agent has his life turned upside down when he discovers his wife might be having an affair with a used car salesman while terrorists smuggle nuclear war heads into the United States.",
                "popularity": 7.1285,
                "poster_path": "/pweFTnzzTfGK68woSVkiTgjLzWm.jpg",
                "release_date": "1994-07-15",
                "title": "True Lies",
                "video": false,
                "vote_average": 7.086,
                "vote_count": 4319,
                "character": "Arab Terrorist (uncredited)",
                "credit_id": "63877e1d1b157d0082467308",
                "order": 31
            },
            {
                "adult": false,
                "backdrop_path": "/2GIr0LArTvO33HQVPEdp49FLdNV.jpg",
                "genre_ids": [
                    18,
                    53
                ],
                "id": 9008,
                "original_language": "en",
                "original_title": "The Insider",
                "overview": "A research chemist comes under personal and professional attack when he decides to appear in a 60 Minutes exposé on Big Tobacco.",
                "popularity": 4.226,
                "poster_path": "/jJCyIBPfvk41uETq6K6u4upyGO8.jpg",
                "release_date": "1999-10-28",
                "title": "The Insider",
                "video": false,
                "vote_average": 7.454,
                "vote_count": 1920,
                "character": "Hezbollah Head Gunman",
                "credit_id": "56d084259251416e3a0039c8",
                "order": 31
            },
            {
                "adult": false,
                "backdrop_path": "/s2bqHApZlliCuwgyHod0qucrYqZ.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 2164,
                "original_language": "en",
                "original_title": "Stargate",
                "overview": "An interstellar teleportation device, found in Egypt, leads to a planet with humans resembling ancient Egyptians who worship the god Ra.",
                "popularity": 5.5068,
                "poster_path": "/4T6Po0XnZlevmhfPh3ZfEs5butR.jpg",
                "release_date": "1994-10-28",
                "title": "Stargate",
                "video": false,
                "vote_average": 7.012,
                "vote_count": 3588,
                "character": "Arabic Interpreter",
                "credit_id": "5cb79fb3c3a3683abf81eded",
                "order": 29
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "سيد بدرية"
        ],
        "biography": "Egyptian-born film-maker and actor Sayed Badreya realized a childhood dream by winning roles in major Hollywood films such as The Insider, Three Kings, and Independence Day.  Growing up in poverty in Port Said, Sayed Badreya's dreams of movie stardom looked as bleak as the prospect of peace in the Middle East. From the Six Day War in '67 through the Yom Kippur War in '73, his only escape from the world he knew was the movie theater, where films transported him to a magical land. But it was here that he determined he was destined to be a part of that magic.  After attending New York University film school, and then moving to Hollywood, Sayed first worked in the film industry as an assistant to actor/director Anthony Perkins, and then with director James Cameron on True Lies.  His mission - to make movies that told the Arabic- American story, since it had yet to be told - led to the creation of his own production company, Zoom In Focus. Under this banner, he directed and produced the documentary, Saving Egyptian Film Classics as well as The Interrogation, which won Best Creative Short Film at New York International Film Festival. He also produced and starred in Hesham Issawi's short, T for Terrorist, which was awarded Best Short Film at the Boston International Film Festival and the San Francisco World Film Festival. In 2007, he played his first leading role in the English language motion picture American East, a film that he also co-wrote.  2008 was Sayed Badreya's breakout year. He captivated audiences as Abu Bakaar, the villainous arms dealer who kidnaps Tony Stark (Robert Downey Jr.) in the summer's blockbuster Iron Man. Also that year, Sayed played the comedic Palestinian cab driver opposite Adam Sandler in You Don't Mess with the Zohan.  This summer, Sayed can be seen in Paramount Pictures' feature film El traspatio aka Backyard, directed by Oscar-nominated Carlos Carrera in which he plays a serial killer opposite Ana de la Reguera. Sayed can also be seen this summer in Movie 43, where he plays opposite Halle Berry. Additional forthcoming films include The Three Stooges, his fifth film with the Farrelly brothers; The Dictator, playing Sascha Baron Cohen's father as the original Dictator, and Just Like a Woman, with Oscar nominated director Rachid Bouchareb. Also, Sayed is going to a new frontier in the new video game Uncharted 3, playing Ramses the Great Pirate Captain.  Most recently he completed his second leading role in the New York independent feature, Cargo, about human traffickers, directed by Yan Vizinberg. And he just finished co-starring opposite Oscar-nominated actress Melissa Leo in film The Space Between, directed by Travis Fine.  Sayed has also worked as an actor, Arabic dialect coach, and Islamic technical advisor on Path to 9/11, a $40 million mini-series about the events leading up to 9/11 produced by ABC/Touchstone.  Sayed's efforts to bring attention to Arab-Americans in the motion picture industry have received much coverage over the years on radio, television, and in major publications around the world, such as The New York Times, GQ, NPR, ABC's \"Politically Incorrect\" with Bill Maher, BBC's \"Panorama,\" CNN, \"Fox Report with Shepard Smith\", The Hollywood Reporter and Egypt Today.",
        "birthday": "1957-05-01",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.sayedbadreya.com/",
        "id": 173810,
        "imdb_id": "nm0046223",
        "known_for_department": "Acting",
        "name": "Sayed Badreya",
        "place_of_birth": "Port Said, Egypt",
        "popularity": 0.2198,
        "profile_path": "/sVvwmMsjXd5YqyZEfWcWQEkBScu.jpg"
    }
}