{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fRtQdiESAdt9rjXCvZhvkmprvac.jpg",
                "genre_ids": [
                    16,
                    10752,
                    18,
                    10751
                ],
                "id": 435129,
                "original_language": "en",
                "original_title": "The Breadwinner",
                "overview": "A headstrong young girl in Afghanistan, ruled by the Taliban, disguises herself as a boy in order to provide for her family.",
                "popularity": 2.4527,
                "poster_path": "/2d6qmkJz9AWqmk9wBWtd2uFX89t.jpg",
                "release_date": "2017-11-17",
                "title": "The Breadwinner",
                "video": false,
                "vote_average": 7.826,
                "vote_count": 875,
                "character": "Parvana (voice)",
                "credit_id": "587b499bc3a3684a4a00e1e6",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/wawIfsBlzgZYtHrBn8RUtGIZTgF.jpg",
                "genre_ids": [
                    10751,
                    35,
                    12,
                    16
                ],
                "id": 675445,
                "original_language": "en",
                "original_title": "PAW Patrol: The Movie",
                "overview": "Ryder and the pups are called to Adventure City to stop Mayor Humdinger from turning the bustling metropolis into a state of chaos.",
                "popularity": 6.1488,
                "poster_path": "/jXavWyam2VPR6bOhLwwuP3K2Hw4.jpg",
                "release_date": "2021-08-09",
                "title": "PAW Patrol: The Movie",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 1240,
                "character": "Daughter (voice)",
                "credit_id": "607729690bc5290058d7bb44",
                "order": 27
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Saara Chaudry is a Canadian actress, character designer, dancer and singer that began her career with small parts in TV productions such as Degrassi: The Next Generation (2001), Combat Hospital (2011), Desperately Seeking Santa (2011) and Isabelle Dances Into the Spotlight (2014).\n\nAs a 3-year old girl, she loved creating the concepts of characters what revealed to be Karen Chau's amazing idea for the show called Ni Hao, Kai-Lan (2007).\n\nSaara made her theatre debut as Little Cosette in the 25th anniversary Mirvish Production of Les Miserables at the Princess of Wales theatre. She had the honor of performing the role on opening night and at a special gala benefit with Colm Wilkinson. She won a 2014 Broadway World Award for best female performer in a featured role, was nominated for a Young Artists Award for best theatre performance and was also nominated for a Dora Award as a member of the Les Miserables ensemble.\n\nAfter her theatre run, Saara returned to television where she played the role of Howie on Nickelodeon's Max & Shred (2014), and guest starred on PBS Kids Odd Squad (2014). Saara just completed filming on season 4 of Sinking Ship's Emmy and Canadian Screen nominated Dino Dana (2017) as Saara, Dana's older sister, and is looking forward to filming the Dino Dana Movie this summer. Saara is currently filming on Universal Kids/Hulu's new tween series Holly Hobbie (2018), where she plays Amy, Holly's best friend.\n\nSaara has also worked on several animated projects and was honored to be nominated for a 2017 Canadian Screen Award for her role as Clara in the Canadian Screen Award winner The Curse of Clara: A Holiday Tale (2015). She is thrilled to be the voice of Parvana in the Oscar, Golden Globe and Canadian Screen Award nominated feature film, The Breadwinner (2017), based on the novel by one of her favorite authors, Deborah Ellis, for which she most recently won the ACTRA award for best voice performance. She is currently working on the animated series, Charlie's Colorforms City (2019), and is excited to be the voice of Carmen in Let's Go Luna! (2018).\n\nWhen not filming, Saara enjoys going to school, singing with her girl band Girl-Powr and being an advocate for gender equality and girls education.",
        "birthday": "2004-06-07",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1739118,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Saara Chaudry",
        "place_of_birth": "Toronto, Canada",
        "popularity": 0.1519,
        "profile_path": "/2fLXrvSFOOPzi635PsX2Yb01rD7.jpg"
    }
}