{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fRtQdiESAdt9rjXCvZhvkmprvac.jpg",
                "genre_ids": [
                    16,
                    10752,
                    18,
                    10751
                ],
                "id": 435129,
                "original_language": "en",
                "original_title": "The Breadwinner",
                "overview": "A headstrong young girl in Afghanistan, ruled by the Taliban, disguises herself as a boy in order to provide for her family.",
                "popularity": 2.4527,
                "poster_path": "/2d6qmkJz9AWqmk9wBWtd2uFX89t.jpg",
                "release_date": "2017-11-17",
                "title": "The Breadwinner",
                "video": false,
                "vote_average": 7.826,
                "vote_count": 875,
                "character": "Optician / Kiln Owner Talib / Crowd Voices (voice)",
                "credit_id": "587b491a9251414101002765",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Kane Mahon is a Canadian Academy-nominated actor and one of the most promising stars in the country. His diverse body of work continues to grow with some of most respected names in the entertainment industry. His two major projects at the moment include the Angelina Jolie-produced feature animation The Breadwinner, directed by Nora Twomey, which opens to industry acclaim at TIFF this year as well as Amazon's new Original Series Patriot, which sees Kane step into the recurring role of Mikham Candahar alongside stars such as Terry O'Quinn, Kurtwood Smith, Gil Bellows and many others.\n\nAn extremely versatile actor, he is known for completely immersing himself in each character he plays. Recognition for his talent includes nominations for Best Actor at the Vancouver Web Festival, Best Leading Male at the Rio Web Festival, and Best Performance at the Canadian Screen Awards.\n\nAfter he earned his high school diploma in literature, Mahon decided to study Diplomacy and return to Afghanistan. However after finishing university with a Masters in International Relations, already in Canada, he reached a crossroad in his life and instead of following his political aspirations he decided to pursue his long-awaited dream of carving out a career in the art of storytelling.\n\nMahon is fluent in English, Russian and Dari. In his spare time, he writes, directs, and produces, as well translates children's books. He is also an amateur astrophotographer.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.kanemahon.com",
        "id": 1739117,
        "imdb_id": "nm4251658",
        "known_for_department": "Acting",
        "name": "Kane Mahon",
        "place_of_birth": null,
        "popularity": 0.9336,
        "profile_path": "/z98t1BR4hco3xUztzaCisxs5Zip.jpg"
    }
}