{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ct2I74zKDrK1Ts2jJa9WixJrigg.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 440472,
                "original_language": "en",
                "original_title": "The Upside",
                "overview": "Phillip is a wealthy quadriplegic who needs a caretaker to help him with his day-to-day routine in his New York penthouse. He decides to hire Dell, a struggling parolee who's trying to reconnect with his ex and his young son. Despite coming from two different worlds, an unlikely friendship starts to blossom.",
                "popularity": 4.8185,
                "poster_path": "/hPZ2caow1PCND6qnerfgn6RTXdm.jpg",
                "release_date": "2019-01-10",
                "title": "The Upside",
                "video": false,
                "vote_average": 7.133,
                "vote_count": 1334,
                "character": "Waitstaff",
                "credit_id": "5a865fdc0e0a2652ab030adc",
                "order": 28
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Mathew Darcy",
            "매튜 달시"
        ],
        "biography": "Matthew D'Arcy is an American actor. After graduating from Drexel University, Matthew traveled to South Korea for the Department of State's Critical Language Scholarship and Fulbright Fellowship.\n\nMatthew spent two years in South Korea, making his entry into the Korean entertainment industry in his second year. His film debut came when he was cast as General MacArthur's scribe officer in Battle for Incheon: Operation Chromite (2016). Working with Director John H. Lee alongside Liam Neeson solidified Matthew's interest in acting, and he soon after made appearances on South Korean TV Networks including TVN - Saturday Night Live Korea (2011), KBS 'Good Morning' - Haphazard Neighborhood Travel, web and TV commercials, as well as in the Korean drama and KPOP sectors.\n\nMatthew returned to the States in 2016 and booked a lead role in Kai Liang's Philadelphia-based student short 'The Bandaged Heart,' followed by a featured role in Neil Burger's The Upside (2017).\n\nDuring the latter half of 2017, Matthew was cast in a supporting role in the upcoming Korean tap-dancing film Swing Kids (2018), directed by Hyeong-Cheol Kang.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "http://matthewdarcy.it",
        "id": 1741856,
        "imdb_id": "nm8376569",
        "known_for_department": "Acting",
        "name": "Matthew D'Arcy",
        "place_of_birth": null,
        "popularity": 0.0311,
        "profile_path": "/sy3aNnXaxqFQgm99zBu6Do6Es1u.jpg"
    }
}