{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dq18nCTTLpy9PmtzZI6Y2yAgdw5.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 497698,
                "original_language": "en",
                "original_title": "Black Widow",
                "overview": "Natasha Romanoff, also known as Black Widow, confronts the darker parts of her ledger when a dangerous conspiracy with ties to her past arises. Pursued by a force that will stop at nothing to bring her down, Natasha must deal with her history as a spy and the broken relationships left in her wake long before she became an Avenger.",
                "popularity": 9.4013,
                "poster_path": "/7JPpIjhD2V0sKyFvhB9khUMa30d.jpg",
                "release_date": "2021-07-07",
                "title": "Black Widow",
                "video": false,
                "vote_average": 7.191,
                "vote_count": 10767,
                "character": "Young Natasha",
                "credit_id": "5eb9c53e0cb3350021cf23e6",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ever Gabo Anderson",
            "Евер Андерсон",
            "Евер Ґабо Андерсон"
        ],
        "biography": "Ever Gabo Anderson, born on November 3, 2007, in Toronto, Canada, is a Canadian-American actress and model. She is the daughter of American actress Milla Jovovich and British director Paul W. S. Anderson, and has two younger sisters, Dashiel and Osian. Her ancestry includes Russian and Serbian roots from her mother's side and English heritage from her father's lineage.\n\nDespite initial attempts by her parents to dissuade her from pursuing acting, Ever remained steadfast in her pursuit. Fluent in English and Russian, she is also proficient in French, residing in Hollywood Hills, Los Angeles, California, where she practices taekwondo.\n\nAt the age of nine, Ever graced the cover of Vogue Bambini, photographed by Ellen von Unwerth, and captured the attention of renowned photographers like Karl Lagerfeld, Mikael Jansson, and Peter Lindbergh.\n\nHer debut in a feature film occurred in \"Resident Evil: The Final Chapter\" (2016), directed by her father. In this film, she portrayed a younger version of Alicia Marcus, a character her mother portrayed as an adult. Ever gained recognition for her portrayal of the young Natasha Romanoff in the film \"Black Widow\". Additionally, she played the role of Wendy Darling in the film \"Peter Pan & Wendy\", marking significant milestones in her burgeoning career as an actress.",
        "birthday": "2007-11-03",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1743933,
        "imdb_id": "nm8349839",
        "known_for_department": "Acting",
        "name": "Ever Anderson",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.7726,
        "profile_path": "/eMXNpIiQuOYSH8gtIif6wQyrBVt.jpg"
    }
}