{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jrudoaXcoLyHRPdolyOGemXgPEs.jpg",
                "genre_ids": [
                    36,
                    18
                ],
                "id": 369972,
                "original_language": "en",
                "original_title": "First Man",
                "overview": "A look at the life of the astronaut, Neil Armstrong, and the legendary space mission that led him to become the first man to walk on the Moon on July 20, 1969.",
                "popularity": 3.8495,
                "poster_path": "/i91mfvFcPPlaegcbOyjGgiWfZzh.jpg",
                "release_date": "2018-10-10",
                "title": "First Man",
                "video": false,
                "vote_average": 7.042,
                "vote_count": 5437,
                "character": "Wally Schirra (uncredited)",
                "credit_id": "5aeaa8fc92514167ee000d07",
                "order": 75
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Shawn Eric Jones, or Shawn Juan as his family refers to him as, is both an actor and model from Missouri. He first started acting in college while attending Crowder College in Neosho, Missouri, winning the 'New Comer of the Year' award his first year. Shawn's first big break came in modeling when he moved to Los Angeles, California, modeling for Abercrombie & Fitch and also did an ad for Under Armor. Shawn has been in numerous magazine ads and various independent films. He played the bartender in The Rolling Stone's music video 'Rain Fall Down', where he garnered the nickname \"Hot Pants\". He continues to both act and model and has started doing voice over work as well. Shawn Eric Jones was born and raised in Nevada, Missouri, helping his grandparents on their farm from a young age. He credits his hard work ethic to his Grandpa Roy and his father Wendell, who raised his sister and he all by himself. Shawn has a younger sister, Wendi, and a younger brother, Colby. He married the love of his life Renee on December 28th, 2013. They have 3 dogs: Zoey, Maddy, and Meeko.",
        "birthday": "1983-12-21",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1744406,
        "imdb_id": "nm6298007",
        "known_for_department": "Acting",
        "name": "Shawn Eric Jones",
        "place_of_birth": "Nevada, Missouri, USA",
        "popularity": 0.7051,
        "profile_path": "/tDejUSmjzMJ4ebqTR9iPsOVYVOF.jpg"
    }
}