{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zeHB7aP46Xs3u4aFLuAq2GFeUGb.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 455207,
                "original_language": "en",
                "original_title": "Crazy Rich Asians",
                "overview": "An American-born Chinese economics professor accompanies her boyfriend to Singapore for his best friend's wedding, only to get thrust into the lives of Asia's rich and famous.",
                "popularity": 4.7521,
                "poster_path": "/1XxL4LJ5WHdrcYcihEZUCgNCpAW.jpg",
                "release_date": "2018-08-15",
                "title": "Crazy Rich Asians",
                "video": false,
                "vote_average": 7.063,
                "vote_count": 3804,
                "character": "Jasmine Chen",
                "credit_id": "5c1052a50e0a2638af0f68a8",
                "order": 45
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "陈胤希"
        ],
        "biography": "Jasmine Chen is a jazz singer and songwriter from mainland China. She was born in Liaoning province, China, and started studying classical music in England in 2000. She started her first jazz band while she was studying in Leeds College of Music in 2003, she was the band leader and singer. In 2004 she graduated from Leeds College of Music with honor, majored in classical piano performance. In 2005, Jasmine return to China started her singing career in Shanghai, she has become one of China's leading figures in jazz scene. Her style is combining western jazz with Chinese musical elements, introducing Chinese folk and old music to the western world, as well as bringing western jazz to Chinese audiences. She performs in many places in the world, from the most well-known Shanghai jazz club \"JZ Club\" to Netherlands' Northsea Jazz Festival.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1746409,
        "imdb_id": "nm10037481",
        "known_for_department": "Acting",
        "name": "Jasmine Chen",
        "place_of_birth": null,
        "popularity": 0.0583,
        "profile_path": "/jiWCCHdbzC4u0TqSEwSpVix8edf.jpg"
    }
}