{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3ddK0Ba1jd81n6yA7gIFbaw5QgG.jpg",
                "genre_ids": [
                    18,
                    9648
                ],
                "id": 152780,
                "original_language": "fr",
                "original_title": "Le passé",
                "overview": "After four years apart, Ahmad returns to his wife Marie in Paris in order to progress their divorce. During his brief stay, he cannot help noticing the strained relationship between Marie and her daughter Lucie. As he attempts to improve matters between mother and daughter Ahmad unwittingly lifts the lid on a long buried secret...",
                "popularity": 3.3614,
                "poster_path": "/8nff89qjYN3Hck5G33xeRPsM8TZ.jpg",
                "release_date": "2013-05-17",
                "title": "The Past",
                "video": false,
                "vote_average": 7.244,
                "vote_count": 580,
                "character": "Naïma",
                "credit_id": "52fe4b2b9251416c910d22a7",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            " Сабрина Уазани",
            "사브리나 우아자니"
        ],
        "biography": "Sabrina Ouazani (born 6 December 1988) is a French actress of Algerian descent. She is best known internationally for her performance as Frida in Games of Love and Chance and as Charlotte Ben Smires in Netflix's hit rom-com series The Hook Up Plan.\n\nJoined by her mother in the casting of Games of Love and Chance, Sabrina Ouazani is retained by director Abdellatif Kechiche who shot this movie in the neighborhood of Franc-Moisin, a few hundred meters from his city of residence, Balzac apartment block 4000 in La Courneuve (a Paris suburb). For this first role, she was nominated for a César Award for Most Promising Actress in 2005.\n\nSource: Article \"Sabrina Ouazani\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1988-12-06",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 17475,
        "imdb_id": "nm1493817",
        "known_for_department": "Acting",
        "name": "Sabrina Ouazani",
        "place_of_birth": "Saint-Denis, Seine-Saint-Denis, France",
        "popularity": 0.3621,
        "profile_path": "/3uTfUTxkETtKqjpxfL73ZPaPoLh.jpg"
    }
}