{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sBB39VMtByFltGGGW2c5N6LOAvj.jpg",
                "genre_ids": [
                    18,
                    53,
                    80
                ],
                "id": 8470,
                "original_language": "en",
                "original_title": "John Q",
                "overview": "John Quincy Archibald is a father and husband whose son is diagnosed with an enlarged heart and then finds out he cannot receive a transplant because HMO insurance will not cover it. Therefore, he decides to take a hospital full of patients hostage until the hospital puts his son's name on the donor's list.",
                "popularity": 4.3211,
                "poster_path": "/xEE91LvXiqgs7Hmdl44LCzHtFf6.jpg",
                "release_date": "2002-02-15",
                "title": "John Q",
                "video": false,
                "vote_average": 7.136,
                "vote_count": 2486,
                "character": "Gloria Allred",
                "credit_id": "6097643da894d600407aad13",
                "order": 53
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Judge Gloria Allred"
        ],
        "biography": "Gloria Rachel Allred (born July 3, 1941) is an American attorney known for taking high-profile and often controversial cases, particularly those involving the protection of women's rights. She is also more commonly known for her nationally syndicated television show, We The People with Judge Gloria Allred, and has been a celebrity lawyer for a multitude of high profile individuals and cases.\n\nShe earned her B.A. with honors in English from the University of Pennsylvania, her M.A. from New York University, and her J.D. cum laude from Loyola University School of Law in Los Angeles. She was also awarded an honorary J.D. from the University of West Los Angeles School of Law.\n\nShe is a founding partner of the law firm Allred, Maroko & Goldberg (AM&G). Her firm represents victims who have been discriminated against on account of their sex, race, age, physical handicap or sexual orientation. Her firm also represents victims of AIDS discrimination, sexual harassment and wrongful termination. AM&G is also well-known for its work on behalf of victims in sexual assault, rape, child sexual abuse and battered women cases. The firm handles more women's rights cases than any other private firm in the United States.\n\nShe also founded and is currently president of the Women's Equal Rights Legal Defense and Education Fund (WERLDEF).\n\nGloria has won countless awards in her field, and is considered one of Los Angeles's most powerful and influential lawyers. She has also been inducted into the National Women's Hall of Fame.",
        "birthday": "1941-07-03",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.gloriaallred.com/",
        "id": 174838,
        "imdb_id": "nm0021608",
        "known_for_department": "Acting",
        "name": "Gloria Allred",
        "place_of_birth": "Philadelphia, Pennsylvania, USA ",
        "popularity": 0.1865,
        "profile_path": "/21M4KCy4qjYGuVlCx1r4R1H1U7a.jpg"
    }
}