{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5OFg2grrAMPo8OOKHQMCeuKU3js.jpg",
                "genre_ids": [
                    35,
                    10402
                ],
                "id": 11031,
                "original_language": "en",
                "original_title": "This Is Spinal Tap",
                "overview": "\"This Is Spinal Tap\" shines a light on the self-contained universe of a metal band struggling to get back on the charts, including everything from its complicated history of ups and downs, gold albums, name changes and undersold concert dates, along with the full host of requisite groupies, promoters, hangers-on and historians, sessions, release events and those special behind-the-scenes moments that keep it all real.",
                "popularity": 4.1471,
                "poster_path": "/z2LA8eBTSuuPC4NBhIZRNIwpimH.jpg",
                "release_date": "1984-03-02",
                "title": "This Is Spinal Tap",
                "video": false,
                "vote_average": 7.415,
                "vote_count": 1516,
                "character": "Duke Fame",
                "credit_id": "5891062192514103f300b69c",
                "order": 27
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Paul Shortino (born May 14, 1953) is an American rock singer and musician who has sung for Rough Cutt/The Cutt, Quiet Riot, Bad Boyz, and Shortino. He briefly recorded with J.K. Northrup as the duo, Shortino/Northrup. He has also recorded as a solo artist, writing and performing the song \"E.G.G.M.A.N.\" as the theme for Dr. Eggman in Sonic Adventure 2 for Sega, and in Shadow the Hedgehog as \"E.G.G.M.A.N. Doc Robeatnix Mix\". Shortino recorded lead vocals for the Heavy Metal benefit project Hear 'n Aid in 1985. The single from this project, \"Stars\", also features lead vocals by heavy metal singers Ronnie James Dio, Rob Halford, Geoff Tate, Don Dokken, Kevin DuBrow, Eric Bloom and Dave Meniketti.\n\nShortino is currently a member of the band King Kobra, and also performs in the cast of Raiding the Rock Vault at the Hard Rock Hotel and Casino in Las Vegas.\n\nShortino played the character \"Duke Fame\" in the film, This Is Spinal Tap, and reprised this role in the first webisode by Las Vegas-based group Sin City Sinners. He resides in Las Vegas with his wife Carmen, and is a regular guest of the Sinners.\n\nDescription above from the Wikipedia article Paul Shortino licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1953-05-14",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1748255,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Paul Shortino",
        "place_of_birth": null,
        "popularity": 0.0143,
        "profile_path": "/oRLRgcoQxRA4vpfEs9jnRhb4uAV.jpg"
    }
}