{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bQEIYntlPba76NN41uWxIzUmzBb.jpg",
                "genre_ids": [
                    18
                ],
                "id": 4995,
                "original_language": "en",
                "original_title": "Boogie Nights",
                "overview": "Set in 1977, back when sex was safe, pleasure was a business and business was booming, idealistic porn producer Jack Horner aspires to elevate his craft to an art form. Horner discovers Eddie Adams, a hot young talent working as a busboy in a nightclub, and welcomes him into the extended family of movie-makers, misfits and hangers-on that are always around. Adams' rise from nobody to a celebrity adult entertainer is meteoric, and soon the whole world seems to know his porn alter ego, \"Dirk Diggler\". Now, when disco and drugs are in vogue, fashion is in flux and the party never seems to stop, Adams' dreams of turning sex into stardom are about to collide with cold, hard reality.",
                "popularity": 11.9692,
                "poster_path": "/wnE24UPCPQsQnbBOu4zVE2qaDNm.jpg",
                "release_date": "1997-10-10",
                "title": "Boogie Nights",
                "video": false,
                "vote_average": 7.634,
                "vote_count": 3315,
                "character": "Puerto Rican Kid",
                "credit_id": "5890e634c3a368701700a1db",
                "order": 66
            },
            {
                "adult": false,
                "backdrop_path": "/ihIVjdiuvtVuFUaCqfNJwajIs3i.jpg",
                "genre_ids": [
                    14,
                    10402
                ],
                "id": 13192,
                "original_language": "en",
                "original_title": "Moonwalker",
                "overview": "Moonwalker is a 1988 American experimental anthology musical film starring Michael Jackson. Rather than featuring one continuous narrative, the film expresses the influence of fandom and innocence through a collection of short films about Jackson, some of which are long-form music videos from Jackson's 1987 album Bad. The film is named after his famous dance, \"the moonwalk\", which he originally learned as \"the backslide\" but perfected the dance into something no one had seen before. The movie's introduction is a type of music video for Jackson's \"Man in the Mirror\" but is not the official video for the song. The film then expresses a montage of Michael's career, which leads into a parody of his Bad video titled \"Badder\", followed by sections \"Speed Demon\" and \"Leave Me Alone\". What follows is the biggest section where Michael plays a hero with magical powers and saves three children from Mr. Big. This section is \"Smooth Criminal\" which leads into a performance of \"Come Together\".",
                "popularity": 3.7532,
                "poster_path": "/3GwTPQkAcgDeAirRpEuJG8HDdRz.jpg",
                "release_date": "1988-10-29",
                "title": "Moonwalker",
                "video": false,
                "vote_average": 6.977,
                "vote_count": 587,
                "character": "(segment \"Badder\")",
                "credit_id": "67c590214b1639904ae768d0",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "",
        "birthday": null,
        "deathday": null,
        "gender": 0,
        "homepage": null,
        "id": 1748176,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Jose Chaidez",
        "place_of_birth": null,
        "popularity": 0.051,
        "profile_path": null
    }
}