{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jLeOzQLZJEpmAMDnfKMmORFGuV.jpg",
                "genre_ids": [
                    9648,
                    27
                ],
                "id": 591275,
                "original_language": "en",
                "original_title": "Fear Street: 1666",
                "overview": "In 1666, a colonial town is gripped by a hysterical witch-hunt that has deadly consequences for centuries to come, and it's up to teenagers in 1994 to finally put an end to their town's curse, before it's too late.",
                "popularity": 5.8385,
                "poster_path": "/rmEPtz3Ufzol2VWUAZYzOFaBio3.jpg",
                "release_date": "2021-07-14",
                "title": "Fear Street: 1666",
                "video": false,
                "vote_average": 7.101,
                "vote_count": 1869,
                "character": "Grace Miller / Mrs. Fraser",
                "credit_id": "60f1e8643c887d005e8c7c7b",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Lacy Kell Camp"
        ],
        "biography": "Lacy Camp was born in Charlotte, NC on September 10, 1977. She began acting in high school and received a Bachelor of Fine Arts in Acting and Directing from the University of North Carolina at Greensboro. Before working in the film/TV industry, Lacy traveled with professional children's theaters performing in various venues along the east coast. Lacy has been married to Clark Camp since 2002 and together they have 2 daughters Ruthie and Darby. Lacy and her children have appeared in a handful of projects together from local commercials to feature films such as When We Last Spoke and Benji as well as critically acclaimed television series Big Little Lies. Ruthie enjoyed commercials and print work before busying herself with competitive basketball leagues. In 2019, Darby was named one of Hollywood Reporter's top 30 under 30 actors as well as receiving a SAG award nomination for best ensemble in HBO's Big Little Lies. Lacy enjoys coaching young actors, photography, traveling and watching her daughters pursue their passions.",
        "birthday": "1977-09-10",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1749419,
        "imdb_id": "nm4445676",
        "known_for_department": "Acting",
        "name": "Lacy Camp",
        "place_of_birth": "Charlotte, North Carolina, USA",
        "popularity": 0.2027,
        "profile_path": "/skn9AoLnIDSS2r4ztoyS5jYyn2R.jpg"
    }
}