{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/oXs8kp1oX5N0Mte6U8UUAwmLwt6.jpg",
                "genre_ids": [
                    28,
                    12,
                    878,
                    53
                ],
                "id": 154,
                "original_language": "en",
                "original_title": "Star Trek II: The Wrath of Khan",
                "overview": "The starship Enterprise and its crew is pulled back into action when old nemesis, Khan, steals a top secret device called Project Genesis.",
                "popularity": 3.0596,
                "poster_path": "/uPyLsKl8Z0LOoxeaFXsY5MxhR5s.jpg",
                "release_date": "1982-06-04",
                "title": "Star Trek II: The Wrath of Khan",
                "video": false,
                "vote_average": 7.446,
                "vote_count": 2015,
                "character": "Dr. Leonard 'Bones' McCoy",
                "credit_id": "52fe421fc3a36847f8005c0b",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/wN3dgwkiWSLrMVukPQIeccv5EJ6.jpg",
                "genre_ids": [
                    878,
                    12
                ],
                "id": 168,
                "original_language": "en",
                "original_title": "Star Trek IV: The Voyage Home",
                "overview": "When a huge alien probe enters the galaxy and begins to vaporize Earth's oceans, Kirk and his crew must travel back in time in order to bring back whales and save the planet.",
                "popularity": 4.0494,
                "poster_path": "/xY5TzGXJOB3L9rhZ1MbbPyVlW5J.jpg",
                "release_date": "1986-11-26",
                "title": "Star Trek IV: The Voyage Home",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 1560,
                "character": "McCoy",
                "credit_id": "52fe4221c3a36847f80066af",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/vfo2dzdXnoArYwrkM7kw1vgb7dL.jpg",
                "genre_ids": [
                    878,
                    28,
                    12,
                    53
                ],
                "id": 174,
                "original_language": "en",
                "original_title": "Star Trek VI: The Undiscovered Country",
                "overview": "After years of war, the Federation and the Klingon empire find themselves on the brink of a peace summit when a Klingon ship is nearly destroyed by an apparent attack from the Enterprise. Both worlds brace for what may be their deadliest encounter.",
                "popularity": 2.135,
                "poster_path": "/tvTOJD7Gz668GLy2nNdLRQvpPsv.jpg",
                "release_date": "1991-12-06",
                "title": "Star Trek VI: The Undiscovered Country",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 1331,
                "character": "Dr. Leonard 'Bones' McCoy",
                "credit_id": "52fe4222c3a36847f8006ad3",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jackson DeForest Kelley",
            "دِفارست کلی"
        ],
        "biography": "Jackson DeForest Kelley (January 20, 1920 – June 11, 1999) was an American actor, screenwriter,  poet and singer known for his iconic roles in Westerns and as Dr. Leonard \"Bones\" McCoy of the USS Enterprise in the television and film series Star Trek.\n\nKelley was delivered by his uncle at his parents' home in Atlanta, the son of Clora (née Casey) and Ernest David Kelley, who was a Baptist minister of Irish and Southern ancestry. DeForest was named after the pioneering electronics engineer Lee De Forest, and later named his Star Trek character's father \"David\" after his own. Kelley had an older brother, Ernest Casey Kelley.  As a child, he often played outside for hours at a time. Kelley was immersed in his father's mission in Conyers  and promised his father failure would mean \"wreck and ruin\". Before the  end of his first year at Conyers, Kelley was introduced into the  congregation to his musical talents and often sang solo in morning  church services. Eventually, this led to an appearance on the radio station WSB AM in Atlanta, Georgia. As a result of his radio work, he won an engagement with Lew Forbes and his orchestra at the Paramount Theater.\n\nIn  1934, the family left Conyers for the community of Decatur. He attended  the Decatur Boys High School where he played on the Decatur Bantams  baseball team. Kelley also played football and other sports. Before his  graduation, Kelley got a job as a drugstore car hop. He spent his  weekends working in the local theatres. Kelley graduated in 1938.  During World War II, Kelley served as an enlisted man in the United States Army Air Forces between March 10, 1943, and January 28, 1946, assigned to the First Motion Picture Unit. After an extended stay in Long Beach, California,  Kelley decided to pursue an acting career and relocate to southern  California permanently, living for a time with his uncle Casey. He  worked as an usher in a local theater in order to earn enough money for  the move. Kelley's mother encouraged her son in his new career goal, but  his father disliked the idea. While in California, Kelley was spotted  by a Paramount Pictures scout while doing a United States Navy training film.",
        "birthday": "1920-01-20",
        "deathday": "1999-06-11",
        "gender": 2,
        "homepage": null,
        "id": 1750,
        "imdb_id": "nm0001420",
        "known_for_department": "Acting",
        "name": "DeForest Kelley",
        "place_of_birth": "Atlanta, Georgia, USA",
        "popularity": 0.8513,
        "profile_path": "/qbcWkyGWvv5GKnbCqq9Pne09imA.jpg"
    }
}