{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/nlPCdZlHtRNcF6C9hzUH4ebmV1w.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749,
                    10402
                ],
                "id": 313369,
                "original_language": "en",
                "original_title": "La La Land",
                "overview": "Mia, an aspiring actress, serves lattes to movie stars in between auditions and Sebastian, a jazz musician, scrapes by playing cocktail party gigs in dingy bars, but as success mounts they are faced with decisions that begin to fray the fragile fabric of their love affair, and the dreams they worked so hard to maintain in each other threaten to rip them apart.",
                "popularity": 11.254,
                "poster_path": "/uDO8zWDhfWwoFdKS4fzkUJt0Rf0.jpg",
                "release_date": "2016-12-01",
                "title": "La La Land",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 17501,
                "character": "Hollywood Party Dancer - Agent #3",
                "credit_id": "64e3256a37109700ffbb423f",
                "order": 113
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Nicholas Jerome Baga",
            "Nicolas Jerome Baga",
            "Nick Braga"
        ],
        "biography": "Nick Baga is an American actor, dancer, artist and all around performer. Growing up in Boston watching Gene Kelly films, Nick always knew that he wanted to be in entertainment. It was his love and passion for movies and dance that brought him to Los Angeles and it's this incredible passion, his pure talent, his east coast charm and infectious energy that has made him quite the name for himself in the entertainment industry. Nick's talent and incomparable work ethic has garnered him credits in all realms of the entertainment industry including nationwide commercials, hit TV shows, blockbuster movies, top awards show's and some of music's highest rated tours.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.nickbaga.com/",
        "id": 1752324,
        "imdb_id": "nm2422952",
        "known_for_department": "Acting",
        "name": "Nick Baga",
        "place_of_birth": "Boston, Massachusetts, USA",
        "popularity": 0.0918,
        "profile_path": "/mOZBa0zodfqMqzvQ62kSOIMQUv.jpg"
    }
}