{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fHDvGGPFry65ou79WLi6JsjCZrM.jpg",
                "genre_ids": [
                    35
                ],
                "id": 632856,
                "original_language": "en",
                "original_title": "Spirited",
                "overview": "Each Christmas Eve, the Ghost of Christmas Present selects one dark soul to be reformed by a visit from three spirits. But this season, he picked the wrong Scrooge. Clint Briggs turns the tables on his ghostly host until Present finds himself reexamining his own past, present and future.",
                "popularity": 3.1287,
                "poster_path": "/h3zAzTMs5EP3cKusOxFNGSFE1WI.jpg",
                "release_date": "2022-11-10",
                "title": "Spirited",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 676,
                "character": "Mom",
                "credit_id": "67f52cbeddf9194387d9f0c0",
                "order": 91
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Michelle Lulic is an award-winning actor quickly building a career across television and film. Raised in New York, she studied acting on stage but later found herself most at home while working on set.\n\nShe notably appeared opposite America's favorite fictional serial killer, Dexter Morgan (Emmy Award-Winning actor Michael C. Hall), in Showtime's record-breaking series premiere of \"Dexter: New Blood.\"\n\nHowever, Michelle's first break into television was immediately after receiving her B.A. in Journalism, Media Studies, and Theater Arts at Rutgers University. Consecutively cast in multiple episodes of Travel Channel's \"Mysteries at the Museum,\" Michelle portrayed many noteworthy women in history.\n\nShe enjoys playing characters who are often underestimated. Her first lead role in a feature film was in the horror film, \"Where Demons Dwell,\" where she fought against the odds to protect her sisters from a dark curse. She also lent her voice to the animated short film, \"Sabina: Prey for the Hunter,\" where she plays a Bosnian-American immigrant seeking revenge for her mother's death.\n\nIn 2018, Michelle made her directorial debut with her science fiction short film, \"Fine,\" premiering at the Big Apple Film Festival. It screened across the festival circuit where it won Best Sci-Fi Short and Best Acting Duo at the L.A. Independent Shorts Awards in 2020. \"Fine\" is now streaming on Prime Video.\n\nWhether on set or off, Michelle always starts her day with a cup of coffee and a moment of meditation. She loves traveling to new cities and keeping creative projects half-finished until inspiration strikes.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "https://demoreel.com/michellelulic",
        "id": 1752936,
        "imdb_id": "nm5946992",
        "known_for_department": "Acting",
        "name": "Michelle Lulic",
        "place_of_birth": "New York City, New York",
        "popularity": 0.0573,
        "profile_path": "/wZB9TTrYWl08MtYB89QZRdoItjl.jpg"
    }
}