{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hNCqkXbWd40eftqSdjq8TmV7Mqr.jpg",
                "genre_ids": [
                    18,
                    878,
                    9648
                ],
                "id": 329865,
                "original_language": "en",
                "original_title": "Arrival",
                "overview": "Taking place after alien crafts land around the world, an expert linguist is recruited by the military to determine whether they come in peace or are a threat.",
                "popularity": 17.1934,
                "poster_path": "/x2FJsf1ElAgr63Y3PNPtJrcmpoe.jpg",
                "release_date": "2016-11-10",
                "title": "Arrival",
                "video": false,
                "vote_average": 7.619,
                "vote_count": 18547,
                "character": "Press Secretary",
                "credit_id": "5898ae38c3a368770e00b98b",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Sabrina Reeves is an actress fortunate to collaborate with esteemed directors such as Denys Arcand, Denis Villeneuve, Stanley Tucci, Kim Nguyen, Mel Shapiro, Jean-Pierre-Jeunet, Nicolas Monette, and Arto Paragamian. She was born and raised in Boston and began her acting career at a young age, performing speeches at her parents' dinner parties. One of her favourite speeches was a Queen Elizabeth speech that always pleased the crowd. Despite the challenges of her teenage years, she continued acting and eventually earned a BFA in drama from Carnegie-Mellon University. After graduating, she moved to New York and worked in film, theater, and television before meeting and marrying Canadian musician, David Usher.\n\nThey later relocated to Montreal, where Sabrina formed the performance company, Bluemouth Inc, with a dancer, filmmaker, and sound designer. Together, they created numerous original works, performed worldwide, received government grants, and garnered attention from Canadian Theatre articles. Inspired by her experiences with Bluemouth Inc, Sabrina pursued an MFA in Creative Writing from Concordia University and recently finished writing her first novel, Wetlands.\n\nIn addition to her artistic pursuits, Sabrina is a mother to two daughters and enjoys playing guitar and singing folk-pop music with them.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.reisler.ca/reisler-talent-women-Sabrina-Reeves.html",
        "id": 1752153,
        "imdb_id": "nm2484262",
        "known_for_department": "Acting",
        "name": "Sabrina Reeves",
        "place_of_birth": null,
        "popularity": 0.0675,
        "profile_path": "/2clqh6Iw5rzvYtQrkGHh3cbCdbO.jpg"
    }
}