{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gfR3GEClL7WrNpQOg8mcPhM8fx6.jpg",
                "genre_ids": [
                    28,
                    18,
                    36
                ],
                "id": 11645,
                "original_language": "ja",
                "original_title": "乱",
                "overview": "Shakespeare's King Lear is reimagined as a singular historical epic set in sixteenth-century Japan where an aging warlord divides his kingdom between his three sons.",
                "popularity": 6.1574,
                "poster_path": "/jQnUtWaHYfqnXPOIf77K7Ycqk4M.jpg",
                "release_date": "1985-06-01",
                "title": "Ran",
                "video": false,
                "vote_average": 8.056,
                "vote_count": 1675,
                "character": "Kyoami",
                "credit_id": "5596e71a9251410c1500017e",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/8swHho6hoIlHERMrX2Z83OBQJCa.jpg",
                "genre_ids": [
                    14,
                    53,
                    9648
                ],
                "id": 16140,
                "original_language": "ja",
                "original_title": "デスノート the Last name",
                "overview": "In the second installment of the Death Note film franchise, Light Yagami meets a second Kira and faithful follower Misa Amane and her Shinigami named Rem. Light attempts to defeat L along with Teru Mikami (a Kira follower) and Kiyomi Takada (another Kira follower) but in the end will Light win? or will a Shinigami named Ryuk make all the difference in Light's victory or his ultimate death?",
                "popularity": 2.7852,
                "poster_path": "/zFwCNC5LfmPKBsqMuAhzcG5Jubm.jpg",
                "release_date": "2006-10-28",
                "title": "Death Note: The Last Name",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 513,
                "character": "Rem (voice)",
                "credit_id": "5f31e01b71f095003694bf99",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "池畑 慎之介",
            "ピーター",
            " Pîtâ",
            "Peter",
            "Pītā"
        ],
        "biography": "Shinnosuke Ikehata (池畑 慎之介 Ikehata Shinnosuke) (born August 8, 1952, in Sakai, Osaka, Japan) is a Japanese singer, dancer, and actor who has appeared in Akira Kurosawa's Ran and Toshio Matsumoto's Funeral Parade of Roses. Ikehata also uses his stage name of Peter (ピーター Pītā) when he appears on TV variety shows and musical revues.\n\nAlways seen dancing with tight shirts and pants at dancing clubs, he adopted the stage name when he was 16 after his style of dress and dance which was said to resemble Peter Pan. One of Japan's most famous gay entertainers, Peter's androgynous appearance has enabled him to often play transgender or female characters and he often appears on stage in women's clothing (he does not identify as female, however).\n\nDescription above from the Wikipedia article Peter, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1952-08-08",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 17538,
        "imdb_id": "nm0676201",
        "known_for_department": "Acting",
        "name": "Shinnosuke Ikehata",
        "place_of_birth": " Sakai, Osaka, Japan",
        "popularity": 1.5948,
        "profile_path": "/uIGlMD44bVNMVeGrQUVp5vaOsxx.jpg"
    }
}