{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mQC9OxFBGKJmk4tgzpmKO1nIZx5.jpg",
                "genre_ids": [
                    18,
                    10752
                ],
                "id": 1786,
                "original_language": "fr",
                "original_title": "Au revoir les enfants",
                "overview": "Au revoir les enfants tells a heartbreaking story of friendship and devastating loss concerning two boys living in Nazi-occupied France. At a provincial Catholic boarding school, the precocious youths enjoy true camaraderie—until a secret is revealed. Based on events from writer-director Malle’s own childhood, the film is a subtle, precisely observed tale of courage, cowardice, and tragic awakening.",
                "popularity": 3.3695,
                "poster_path": "/lXP90Vx7OcviBfbbokcaG6zVnPG.jpg",
                "release_date": "1987-10-07",
                "title": "Au Revoir les Enfants",
                "video": false,
                "vote_average": 7.524,
                "vote_count": 685,
                "character": "Muller",
                "credit_id": "52fe4315c3a36847f8038f1f",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Peter Fitz (8 August 1931 - 10 January 2013) was a German stage and film actor.\n\nFitz completed an apprenticeship at the drama school of the Deutsches Schauspielhaus in Hamburg in the 1950s. In the 1960s, engagements at the Schauspiel Frankfurt theatre followed. Director Peter Stein brought him into the ensemble of the Berlin Schaubühne theatre, where he worked under the direction of Stein as well as Klaus Michael Grüber.\n\nIn the course of his career, Fitz performed at all major German-language venues, such as the Vienna Burgtheater, the Munich Kammerspiele, Berlin's Schiller Theater, as well as the Salzburg Festival. In 1980 and 1983, he was voted Actor of the Year by the editors of Theater heute magazine.\n\nFitz' theater work took precedence throughout his career, but he also appeared in a number of films and television productions. Some of these include the 1987 film Au revoir les enfants and The Wannsee Conference in 1984. In 1996, Fitz was nominated for the German Film Award for his portrayal of Reinhold Schünzel in Hans-Christoph Blumenberg's Beim nächsten Kuß knall’ ich ihn nieder. Fitz was also known to a broad television audience through crime films and series, as well as for his voice acting work.\n\nPeter Fitz died in his Berlin apartment on 10 January 2013 at the age of 81. He was the father of actress Hendrikje Fitz (1961–2016) and actor Florian Fitz (born 1967). His is buried in the Waldfriedhof Zehlendorf Berlin forest cemetery. His daughter was buried next to him upon her death in 2016.\n\nSource: Article \"Peter Fitz\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1931-08-08",
        "deathday": "2013-01-10",
        "gender": 2,
        "homepage": null,
        "id": 17546,
        "imdb_id": "nm0280132",
        "known_for_department": "Acting",
        "name": "Peter Fitz",
        "place_of_birth": "Kaiserslautern, Germany",
        "popularity": 0.2122,
        "profile_path": "/uuS2Tbva1PdAeMxFKUjlO1V7eJN.jpg"
    }
}