{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8r9RoGfwGmn1pn0G3sbvHHemSWF.jpg",
                "genre_ids": [
                    18,
                    10402,
                    36
                ],
                "id": 277216,
                "original_language": "en",
                "original_title": "Straight Outta Compton",
                "overview": "In 1987, five young men, using brutally honest rhymes and hardcore beats, put their frustration and anger about life in the most dangerous place in America into the most powerful weapon they had: their music.  Taking us back to where it all began, Straight Outta Compton tells the true story of how these cultural rebels—armed only with their lyrics, swagger, bravado and raw talent—stood up to the authorities that meant to keep them down and formed the world’s most dangerous group, N.W.A.  And as they spoke the truth that no one had before and exposed life in the hood, their voice ignited a social revolution that is still reverberating today.",
                "popularity": 5.6597,
                "poster_path": "/1CiLJx8Xtv3TbbFj6k7BboSmKgC.jpg",
                "release_date": "2015-08-11",
                "title": "Straight Outta Compton",
                "video": false,
                "vote_average": 7.787,
                "vote_count": 4041,
                "character": "Police Officer (uncredited)",
                "credit_id": "669208232263da7cccad0d1e",
                "order": 176
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Rick Silver was born in El Paso Texas, and attended private schools most his young years, Then he went on to attend The University Of Texas, where he acquired a Bachelors Degree in Business Marketing.\n\nRick was an ambitious entrepreneur since a young age, Being self employed all thru high school, After graduation he went on to open a retail store that grew to 5 stores in a matter of a few years, and branched out opening 3 restaurant/bars.\n\nDuring that time, Rick also directed, produced, and hosted a comedic bilingual TV show which aired locally on Telemundo, Showcasing, Extreme sports, Music Videos, events, Nightlife, and interviews with celebrities and athletes. It was during this time working in front of the camera that Rick discovered his true passion for the film industry. After the show ended, Rick wanted to continue working around cameras, and decided to sell his business, and real estate to move to Los Angeles California, to actively pursue acting and working in the film industry. Immediately after moving to L.A. Rick worked his way to become a registered union actor by working on films.\n\nRick has worked on dozens of Feature films, independent projects, TV shows and commercials. Never missing an opportunity to place himself in front of cameras, directors and producers. Rick has grown as a film actor and has improved his craft by attending classes at Second City , Playhouse, Act Club, Screen actors system with Director R. Williams, and other scene study classes and workshops. But mostly actively getting a hands on experience working non-stop on film projects, and scene study classes with other great actors.",
        "birthday": "1975-11-12",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1754370,
        "imdb_id": "nm3326785",
        "known_for_department": "Acting",
        "name": "Rick Silver",
        "place_of_birth": "El Paso, Texas, USA",
        "popularity": 0.0214,
        "profile_path": "/sHk0J8AMzxJneIVhiGZjyoW0YKA.jpg"
    }
}