{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/b8hPBW0NJmiIVzvQjT3CwIpAdzl.jpg",
                "genre_ids": [
                    16,
                    12,
                    10751,
                    18,
                    37,
                    10749
                ],
                "id": 9023,
                "original_language": "en",
                "original_title": "Spirit: Stallion of the Cimarron",
                "overview": "A captured mustang remains determined to return to his herd no matter what.",
                "popularity": 7.8261,
                "poster_path": "/cUgYrz4twiJ3QgVGpRfey984NIB.jpg",
                "release_date": "2002-05-24",
                "title": "Spirit: Stallion of the Cimarron",
                "video": false,
                "vote_average": 7.687,
                "vote_count": 4760,
                "character": "Little Creek's Friend (voice)",
                "credit_id": "52fe44d2c3a36847f80ac19d",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/1GZCV0dwIoAn6jpWPfVAbeMTVC2.jpg",
                "genre_ids": [
                    12,
                    10751,
                    18
                ],
                "id": 481848,
                "original_language": "en",
                "original_title": "The Call of the Wild",
                "overview": "Buck is a big-hearted dog whose blissful domestic life is turned upside down when he is suddenly uprooted from his California home and transplanted to the exotic wilds of the Yukon during the Gold Rush of the 1890s. As the newest rookie on a mail delivery dog sled team—and later its leader—Buck experiences the adventure of a lifetime, ultimately finding his true place in the world and becoming his own master.",
                "popularity": 5.5757,
                "poster_path": "/33VdppGbeNxICrFUtW2WpGHvfYc.jpg",
                "release_date": "2020-02-19",
                "title": "The Call of the Wild",
                "video": false,
                "vote_average": 7.537,
                "vote_count": 3846,
                "character": "Edenshaw",
                "credit_id": "5e2729f9168935001234f1c1",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Michael Heinrich ",
            "Michael James Heinrich"
        ],
        "biography": "Michael Horse (born Michael James Heinrich; December 21, 1949) is an American actor known for his portrayals of Native American characters in film and television.\n\nHorse was born Michael James Heinrich in Los Angeles, California, on December 21, 1949. His mother, Nancie Belle Posten, was Swedish. Horse's adoptive father, George Heinrich, was born in Florida to parents from Austria. Nancie died in California in 2004.\n\nHorse's film debut came in the role of Tonto in the 1981 film The Legend of the Lone Ranger, which was a commercial failure. Before taking the role, Horse had been concerned that the character might be perceived as a stereotype.\n\nAfter appearing in David Lynch's short film The Cowboy and the Frenchman (1988), Horse portrayed Deputy Hawk, a Native American policeman, in Lynch's TV series Twin Peaks (1990–91). He also acted in Passenger 57 (1992), House of Cards (1993), the 1990s version of the television series The Untouchables (1993), and North of 60 (1995–97). He also appeared in the Thanks episode \"Thanksgiving\" in 1999, portraying Squanto. He appeared as Deputy Owen Blackwood in four episodes of the first season of Roswell (1999). Horse also appeared as Sheriff Tskany in The X-Files episode \"Shapes\" in 1994. In 1999, Horse guest starred on Walker, Texas Ranger in the episode \"Team Cherokee\" as John Red Cloud, the owner of a Native American NASCAR racing team and a friend of the titular character, Texas Ranger Cordell Walker (Chuck Norris).\n\nHorse portrayed American Indian Movement (AIM) activist Dennis Banks in the 1994 film Lakota Woman: Siege at Wounded Knee. Eight years later, he lent his voice to Little Creek's friend in Spirit: Stallion of the Cimarron. He portrayed Mike Proudfoot on Sons of Tucson. In 1995 he portrayed Dirty Bob in the Western film Riders in the Storm. He played the character Jindoga in Hawkeye. In 2017, Horse reprised his role as Deputy Hawk in the third season of TV series Twin Peaks. He also portrayed Twamie Ullulaq in the seventh season of The Blacklist in 2020.",
        "birthday": "1951-12-21",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 175468,
        "imdb_id": "nm0395398",
        "known_for_department": "Acting",
        "name": "Michael Horse",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.6843,
        "profile_path": "/gjNwWfo72GVex6bLm5fmNJ39vhk.jpg"
    }
}