{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1GZVHgJUcVyytQRJ533GpMavAcL.jpg",
                "genre_ids": [
                    18
                ],
                "id": 7984,
                "original_language": "en",
                "original_title": "In the Name of the Father",
                "overview": "A small-time Belfast thief, Gerry Conlon, is wrongly convicted of an IRA bombing in London, along with his father and friends, and spends 15 years in prison fighting to prove his innocence.",
                "popularity": 2.6913,
                "poster_path": "/3NcIkKxaO2SmRVsG1v50XhtmL0f.jpg",
                "release_date": "1993-12-12",
                "title": "In the Name of the Father",
                "video": false,
                "vote_average": 7.896,
                "vote_count": 1845,
                "character": "Prisoner",
                "credit_id": "56081b93c3a368120d0053ac",
                "order": 76
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Paul Savage",
            "Lily Savage"
        ],
        "biography": "Paul James O'Grady, MBE DL (14 June 1955 - 28 March 2023) was an English comedian, television presenter, actor, writer and radio disc jockey. He achieved fame using his comedic drag queen character, \"Lily Savage\", and later became well known for presenting TV programmes as himself, such as The Paul O'Grady Show. Born to a working-class Irish family in Birkenhead, he attended Blessed Edward Campion Secondary Modern School, in Claughton Village, Birkenhead, Cheshire (now Merseyside). O'Grady moved to London in the late-1970s, there working as a peripatetic care officer for Camden Council. It was here in 1978 that he developed his drag act, basing the character of Lily Savage upon traits found amongst female relatives. Touring northern England as part of drag mime duo, the Playgirls, he eventually went solo as a stand-up comedian. Performing as Savage for eight years at a South London gay pub, the Royal Vauxhall Tavern (RVT), he gained a popular following among the city's gay community and used his character to speak out for LGBT rights. After being nominated for a 1992 Perrier Award, he attracted mainstream attention and made various television, radio, and theatrical appearances. As Savage, he presented morning chat show The Big Breakfast (1995–96), game show Blankety Blank (1997–2002) and comedy series Lily Live! (2000–01), earning various awards and becoming a well known public figure. Seeking to diversify his career away from Savage, O'Grady starred in BBC sitcom Eyes Down (2003–04) and presented two travel documentaries for ITV. In 2004, he began presenting ITV's daytime chat show The Paul O'Grady Show, which proved a hit with audiences. After the network refused to transfer creative control of the series to O'Grady's production company, Olga TV, in 2006 he defected to rival Channel 4, where the show was rebranded as The New Paul O'Grady Show and ran until 2009. O'Grady subsequently presented a late night ITV show, Paul O'Grady Live (2010–11) as well as Paul O'Grady: For the Love of Dogs (which ran from 2012 until his death in 2023) and Paul O'Grady's Animal Orphans (2014–2016), while presenting BBC Radio 2's Paul O'Grady on the Wireless and publishing a four-volume autobiography. O'Grady received a variety of awards, among them honorary degrees and an MBE in the 2008 Birthday Honours for services to entertainment. He died on 28th March 2023 aged 67.",
        "birthday": "1955-06-14",
        "deathday": "2023-03-28",
        "gender": 2,
        "homepage": null,
        "id": 175578,
        "imdb_id": "nm0767331",
        "known_for_department": "Acting",
        "name": "Paul O'Grady",
        "place_of_birth": "Tranmere, Birkenhead, Cheshire, England, UK",
        "popularity": 0.1029,
        "profile_path": "/iSHGbr01Fd8OT7NfDnHvBqsu4xN.jpg"
    }
}