{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kEhCztSTP4ixu7R0AIWg8vvcvbb.jpg",
                "genre_ids": [
                    28,
                    12,
                    10752
                ],
                "id": 948713,
                "original_language": "en",
                "original_title": "The Last Kingdom: Seven Kings Must Die",
                "overview": "In the wake of King Edward's death, Uhtred of Bebbanburg and his comrades adventure across a fractured kingdom in the hopes of uniting England at last.",
                "popularity": 4.7232,
                "poster_path": "/qcNDxDzd5OW9wE3c8nWxCBQoBrM.jpg",
                "release_date": "2023-04-14",
                "title": "The Last Kingdom: Seven Kings Must Die",
                "video": false,
                "vote_average": 7.246,
                "vote_count": 749,
                "character": "Aethelstan",
                "credit_id": "6409acc531644b007c9dd3a4",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/4HXiEsWUEMzJNFwjJv6oUaocqJU.jpg",
                "genre_ids": [
                    10752,
                    18,
                    10749
                ],
                "id": 468224,
                "original_language": "en",
                "original_title": "Tolkien",
                "overview": "England, early 20th century. The future writer and philologist John Ronald Reuel Tolkien (1892-1973) and three of his schoolmates create a strong bond between them as they share the same passion for literature and art, a true fellowship that strengthens as they grow up, but the outbreak of World War I threatens to shatter it.",
                "popularity": 5.8939,
                "poster_path": "/A7eYO3t7oZQdfJj5KlJBI7GhT9H.jpg",
                "release_date": "2019-05-03",
                "title": "Tolkien",
                "video": false,
                "vote_average": 6.937,
                "vote_count": 1471,
                "character": "Young J.R.R. Tolkien",
                "credit_id": "5d494ef82d1e4011e9bdd4ac",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Harry Gilby has been training at the Television Workshop in Nottingham since he was 12. He played Nathan in original cast of The Full Monty at the Noel Coward Theatre in London's West End.\n\nHarry Gilby made his acting debut in 2016, when he played a Village Lad in an episode of Jericho. In 2017 he played Charlie Lyndsay in the film Just Charlie, a transgender girl with a special talent for playing football. He was nominated for Most Promising Newcomer at the British Independent Film Awards 2017 for his role in the film Just Charlie. In 2018, he played Arlo in the short film Evie. In 2019, he made his feature film debut playing a young version of author J. R. R. Tolkien in Tolkien. He has also appeared in three episodes of Casualty as Toby Williams, a young boy dying of leukemia. He played Aethelstan in the final season of The Last Kingdom in 2022 and it's subsequent film Seven Kings Must Die in 2023.",
        "birthday": "2001-08-21",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1756015,
        "imdb_id": "nm7861765",
        "known_for_department": "Acting",
        "name": "Harry Gilby",
        "place_of_birth": "Nottingham, England, UK",
        "popularity": 1.0641,
        "profile_path": "/4rORd6r6Ts4eYWVhbP9iIsE4CEo.jpg"
    }
}