{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/l0fNAHLOFReQJsxCOmGWvJDnimn.jpg",
                "genre_ids": [
                    18,
                    10751,
                    35
                ],
                "id": 360814,
                "original_language": "hi",
                "original_title": "दंगल",
                "overview": "Dangal is an extraordinary true story based on the life of Mahavir Singh and his two daughters, Geeta and Babita Phogat. The film traces the inspirational journey of a father who trains his daughters to become world class wrestlers.",
                "popularity": 5.9521,
                "poster_path": "/cJRPOLEexI7qp2DKtFfCh7YaaUG.jpg",
                "release_date": "2016-12-21",
                "title": "Dangal",
                "video": false,
                "vote_average": 7.899,
                "vote_count": 1065,
                "character": "Young Geeta",
                "credit_id": "58a1d3e692514136700059d6",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Zaira Wasim is a former Indian actress who worked in Hindi films. The recipient of numerous accolades, including a Filmfare Award and a National Film Award, Wasim was honored with the National Child Award for Exceptional Achievement by Ram Nath Kovind, the President of India, at a ceremony in New Delhi in 2017.\n\nWasim made her film debut with the role of young Geeta Phogat in the biographical sports film Dangal (2016), which emerged as the highest-grossing Indian film, grossing more than ₹2,000 crores ($300 million) worldwide. She then starred as an aspiring singer in the musical drama Secret Superstar (2017), which became the highest-grossing Indian film with a female protagonist. Both were backed by Aamir Khan Productions and earned her numerous accolades, including the National Film Award for Best Supporting Actress for the former and the Filmfare Critics Award for Best Actress for the latter. Her last film appearance was in The Sky Is Pink (2019), which garnered her a Filmfare Award for Best Supporting Actress nomination, despite underperforming commercially.",
        "birthday": "2000-10-23",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1756862,
        "imdb_id": "nm7621668",
        "known_for_department": "Acting",
        "name": "Zaira Wasim",
        "place_of_birth": "Srinagar, Jammu and Kashmir, India",
        "popularity": 0.2603,
        "profile_path": "/lt7S0HddIyHC6HiyuSD75dJppCX.jpg"
    }
}