{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4Zc7ja5d4eGTT0rpx1pOCVLiRgW.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 649,
                "original_language": "fr",
                "original_title": "Belle de jour",
                "overview": "Beautiful young housewife Séverine Serizy cannot reconcile her masochistic fantasies with her everyday life alongside dutiful husband Pierre. When her lovestruck friend Henri mentions a secretive high-class brothel run by Madame Anais, Séverine begins to work there during the day under the name Belle de Jour. But when one of her clients grows possessive, she must try to go back to her normal life.",
                "popularity": 3.1272,
                "poster_path": "/iUAFECovwPA0cVV9bo4uNGLJSGL.jpg",
                "release_date": "1967-05-24",
                "title": "Belle de Jour",
                "video": false,
                "vote_average": 7.32,
                "vote_count": 962,
                "character": "Marcel",
                "credit_id": "52fe4264c3a36847f801ae19",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/xKhnjQA5wrAUaopEKegdKD3Yi26.jpg",
                "genre_ids": [
                    18
                ],
                "id": 8416,
                "original_language": "it",
                "original_title": "Il conformista",
                "overview": "A weak-willed Italian man becomes a fascist flunky who goes abroad to arrange the assassination of his old teacher, now a political dissident.",
                "popularity": 2.0436,
                "poster_path": "/nLJjFRqIJAK8qz0OKYnpKCblZNK.jpg",
                "release_date": "1970-07-01",
                "title": "The Conformist",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 718,
                "character": "Pasqualino 'Lino' Semirama",
                "credit_id": "52fe44a6c3a36847f80a240f",
                "order": 22
            },
            {
                "adult": false,
                "backdrop_path": "/myikoqu8Z2gtE7TaBgk9r6fB9MF.jpg",
                "genre_ids": [
                    18
                ],
                "id": 1040,
                "original_language": "it",
                "original_title": "Il gattopardo",
                "overview": "As Garibaldi's troops begin the unification of Italy in the 1860s, an aristocratic Sicilian family grudgingly adapts to the sweeping social changes undermining their way of life. Proud but pragmatic Prince Don Fabrizio Salina allows his war hero nephew, Tancredi, to marry Angelica, the beautiful daughter of gauche, bourgeois Don Calogero, in order to maintain the family's accustomed level of comfort and political clout.",
                "popularity": 2.9548,
                "poster_path": "/riSUxwoK3xjkOgy6YJSvPhi7cO6.jpg",
                "release_date": "1963-03-27",
                "title": "The Leopard",
                "video": false,
                "vote_average": 7.751,
                "vote_count": 886,
                "character": "Francesco Paolo",
                "credit_id": "5990da749251416723035cfb",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Pierre Clémenti (28 September 1942 – 27 December 1999) was a French actor.\n\nBorn in Paris, Clémenti studied drama and began his acting career in the theatre. He secured his first minor screen roles in 1960 in Yves Allégret's Chien de pique performing alongside Eddie Constantine. Arguably, his most famous role was that of gangster lover of bourgeois prostitute Catherine Deneuve in Belle de jour, the 1967 classic by Luis Buñuel, in whose film La voie lactée he played the Devil. He appeared in several highly regarded films of the period, working with many of Europe's best known directors, including Luchino Visconti (The Leopard), Pier Paolo Pasolini (Pigsty) and Bernardo Bertolucci (The Conformist and Partner). Other directors he has worked with are Liliana Cavani, Glauber Rocha, Miklós Jancsó and Philippe Garrel.\n\nIn 1972, his career was derailed after he was sentenced to prison for allegedly possessing or using drugs. Due to insufficient evidence, Clémenti was released after 17 months; later he penned a book about his time in prison. After his release he played the role of ever-optimistic sailor of the Potemkin in Dusan Makavejev's scandalous movie Sweet movie, and the role of the seductive saxophone player Pablo in Fred Haines's film adaptation of Herman Hesse's novel Steppenwolf. Throughout his career, he continued to be active on-stage.\n\nHe was also involved with the French underground film movement, directing several of his own films, which often featured fellow underground filmmakers and actors. Visa de censure no X was an experimental work made up of two of films. New Old was a feature length work released in 1978 in which Viva appeared. La Revolution ce ne'est qu'un debut, continuons le combat, followed by In the shadow of the blue rascal and Sun. He died of liver cancer in 1999\n\nDescription above from the Wikipedia article Pierre Clémenti, licensed under CC-BY-SA, full list of contributors on Wikipedia.​",
        "birthday": "1942-09-28",
        "deathday": "1999-12-27",
        "gender": 2,
        "homepage": null,
        "id": 17577,
        "imdb_id": "nm0167509",
        "known_for_department": "Acting",
        "name": "Pierre Clémenti",
        "place_of_birth": "Paris, France",
        "popularity": 0.2273,
        "profile_path": "/qon2PVQqEk3T2vphwGvpzsfI8Ht.jpg"
    }
}