{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gz3rCM34UicmOxRY1T2SgiQZJoS.jpg",
                "genre_ids": [
                    18
                ],
                "id": 249164,
                "original_language": "en",
                "original_title": "If I Stay",
                "overview": "Mia Hall, a talented young cellist, thought the most difficult decision she would ever have to make would be whether to pursue her musical dreams at prestigious Juilliard or follow her heart to be with the love of her life, Adam, a rock singer/guitarist. However, a car wreck changes everything in an instant, and now Mia's life hangs in the balance. Suspended between life and death, Mia faces a choice that will decide her future.",
                "popularity": 3.8833,
                "poster_path": "/7Twh8h3Wh7GC9npTAEUThgkxkWL.jpg",
                "release_date": "2014-08-21",
                "title": "If I Stay",
                "video": false,
                "vote_average": 7.366,
                "vote_count": 4239,
                "character": "Kat Hall",
                "credit_id": "52fe4f3ec3a36847f82c806f",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Mirelle Enos ",
            "میری انوس"
        ],
        "biography": "Mireille Enos (born 22 September 1975, height 5' 2\" (1,57 m)) is an actress who grew up in Houston, Texas.\n\nEnos studied at Brigham Young University. She was raised in the Church of Jesus Christ of Latter-day Saints but is no longer a practicing member.\n\nShe was nominated for a Tony Award (Best Featured Actress in a Play) in 2005 for her performance in the Broadway production of Who's Afraid of Virginia Woolf.\n\nShe also has numerous television appearances, notably playing Kathy and Jodeen Marquart, twin sisters, in HBO's Big Love.\n\nEnos married actor Alan Ruck on January 4, 2008. Daughter Vesper Vivianne Ruck was born on September 23rd, 2010. On December 2, 2010 filming began on AMC's The Killing; Enos leads the cast as Detective Sarah Linden.\n\nDescription above from the Wikipedia article Mireille Enos, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1975-09-22",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 175826,
        "imdb_id": "nm0257969",
        "known_for_department": "Acting",
        "name": "Mireille Enos",
        "place_of_birth": "Houston, Texas, USA",
        "popularity": 1.2492,
        "profile_path": "/zza8XezUz4I5Is55H2totMbGLeG.jpg"
    }
}