{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/vfo2dzdXnoArYwrkM7kw1vgb7dL.jpg",
                "genre_ids": [
                    878,
                    28,
                    12,
                    53
                ],
                "id": 174,
                "original_language": "en",
                "original_title": "Star Trek VI: The Undiscovered Country",
                "overview": "After years of war, the Federation and the Klingon empire find themselves on the brink of a peace summit when a Klingon ship is nearly destroyed by an apparent attack from the Enterprise. Both worlds brace for what may be their deadliest encounter.",
                "popularity": 2.6295,
                "poster_path": "/tvTOJD7Gz668GLy2nNdLRQvpPsv.jpg",
                "release_date": "1991-12-06",
                "title": "Star Trek VI: The Undiscovered Country",
                "video": false,
                "vote_average": 7.03,
                "vote_count": 1331,
                "character": "Excelsior Communications Officer (Janice Rand)",
                "credit_id": "52fe4222c3a36847f8006b3d",
                "order": 20
            },
            {
                "adult": false,
                "backdrop_path": "/5zTwAcnI3zCJ0mucPPnoBtkSWEV.jpg",
                "genre_ids": [
                    35,
                    10749,
                    80
                ],
                "id": 239,
                "original_language": "en",
                "original_title": "Some Like It Hot",
                "overview": "Two musicians witness a mob hit and struggle to find a way out of the city. Their only opportunity comes in the form of joining an all-girl band as they prepare to leave on a tour. The two disguise themselves as women and struggle to keep their identities secret as they deal with the problems this brings.",
                "popularity": 6.0458,
                "poster_path": "/hVIKyTK13AvOGv7ICmJjK44DTzp.jpg",
                "release_date": "1959-03-19",
                "title": "Some Like It Hot",
                "video": false,
                "vote_average": 8.096,
                "vote_count": 3670,
                "character": "Rosella (uncredited)",
                "credit_id": "566b19fd92514173ff00990f",
                "order": 60
            },
            {
                "adult": false,
                "backdrop_path": "/wN3dgwkiWSLrMVukPQIeccv5EJ6.jpg",
                "genre_ids": [
                    878,
                    12
                ],
                "id": 168,
                "original_language": "en",
                "original_title": "Star Trek IV: The Voyage Home",
                "overview": "When a huge alien probe enters the galaxy and begins to vaporize Earth's oceans, Kirk and his crew must travel back in time in order to bring back whales and save the planet.",
                "popularity": 4.2254,
                "poster_path": "/xY5TzGXJOB3L9rhZ1MbbPyVlW5J.jpg",
                "release_date": "1986-11-26",
                "title": "Star Trek IV: The Voyage Home",
                "video": false,
                "vote_average": 7.156,
                "vote_count": 1560,
                "character": "Commander Rand",
                "credit_id": "5d58acba8d2f8d0016493a82",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Amazing Grace",
            "Gracie",
            "Mary Ann Chase"
        ],
        "biography": "Grace Lee Whitney (April 1, 1930 - May 1, 2015) was an American actress and singer, best known for her role as Janice Rand on the original Star Trek television series and subsequent Star Trek films.  Born Mary Ann Chase, she was adopted by the Whitney family, who changed her name to Grace Elaine. She started her entertainment career as a \"girl singer\" on Detroit's WJR radio at the age of fourteen. After she left home, she began to call herself Lee Whitney, eventually becoming known as Grace Lee Whitney. In her late teens, she moved to Chicago where she opened in nightclubs for Billie Holiday and Buddy Rich, and toured with the Spike Jones and Fred Waring Bands.\n\nWhitney debuted on Broadway in Top Banana, playing Miss Holland. Following the successful run of the show, she joined the cast in Hollywood, where she recreated the role in the 1954 movie of the same name. In Los Angeles, Whitney auditioned for and was cast in the starring role of Lucy Brown in the national tour of The Threepenny Opera.\n\nWhitney made more than a hundred television appearances following her television dramatic debut in Cowboy G-Men in 1953; The Real McCoys, Wagon Train, Gunsmoke, Bat Masterson, The Rifleman, 77 Sunset Strip, Bewitched, Batman,  and The Untouchables. During the 1950s and early 1960s, Whitney was also on live television shows including You Bet Your Life, The Red Skelton Show, The Jimmy Durante Show and The Ernie Kovacs Show. Whitney was cast as a member of the all-female band in Billy Wilder's comedy Some Like It Hot. She shared several scenes with Jack Lemmon, Tony Curtis, and Marilyn Monroe, including the famed \"upper berth\" sequence. She had uncredited roles in House of Wax, Top Banana, The Naked and the Dead, and Pocketful of Miracles.\n\nStar Trek creator Gene Roddenberry cast Whitney in the role of Yeoman Janice Rand, the personal assistant to Captain James T. Kirk, in 1966. Whitney appeared in eight of the first fifteen episodes, after which she was released from contract. She had claimed that, while still under contract, she was sexually assaulted by an executive associated with the series. Later, in a public interview, she stated that Leonard Nimoy had been her main source of support during that time. She went into more details about the assault in her book The Longest Trek, but refused to name the executive, saying in the book, \"This is my story, not his.\"  Whitney returned to the Star Trek franchise in the 1970s after DeForest Kelley saw Whitney on the unemployment line and told her that fans had been asking for her at fan conventions. Whitney reprised her role as Janice Rand, who had received a promotion to chief petty officer in Star Trek: The Motion Picture). She also appeared in Star Trek III: The Search for Spock, Star Trek IV: The Voyage Home, and Star Trek VI: The Undiscovered Country, with another promotion, as Lieutenant Commander Janice Rand. Five years later, to celebrate the 30th anniversary of the franchise, she returned in the 1996 Star Trek: Voyager episode \"Flashback\", along with George Takei. She also reprised her role in two internet Star Trek episodes.\n\nIn the 1970s, she appeared in The Bold Ones, Cannon, and Hart to Hart. In 1998, she appeared in an episode of Diagnosis: Murder, which reunited her with her Star Trek colleagues George Takei, Walter Koenig and Majel Barrett.",
        "birthday": "1930-04-01",
        "deathday": "2015-05-01",
        "gender": 1,
        "homepage": null,
        "id": 1759,
        "imdb_id": "nm0926298",
        "known_for_department": "Acting",
        "name": "Grace Lee Whitney",
        "place_of_birth": "Ann Arbor, Michigan, USA",
        "popularity": 0.5704,
        "profile_path": "/3ItcKdBxe6rP7PeCg9lo7JoL2T4.jpg"
    }
}