{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ayDMYGUNVvXS76wQgFwTiUIDNb5.jpg",
                "genre_ids": [
                    10752,
                    28,
                    36,
                    18,
                    53
                ],
                "id": 300671,
                "original_language": "en",
                "original_title": "13 Hours: The Secret Soldiers of Benghazi",
                "overview": "An American Ambassador is killed during an attack at a U.S. compound in Libya as a security team struggles to make sense out of the chaos.",
                "popularity": 8.3433,
                "poster_path": "/AskDcQ6Sa6jImyt2KDQbgRuPebH.jpg",
                "release_date": "2016-01-14",
                "title": "13 Hours: The Secret Soldiers of Benghazi",
                "video": false,
                "vote_average": 7.271,
                "vote_count": 3751,
                "character": "Defence Attaché",
                "credit_id": "58a69f01925141742b00501a",
                "order": 26
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Davide Tucci was born on 14th September 1987 in Isola Del Liri (FR), later his family moved to the exotic Maltese Islands. Attending St Aloysius College, he developed a love for being a creative, which was followed by studying software and web design. Having always felt the urge to perform and entertain from a young age, Davide drew his inspiration from the actors, singers and public figures throughout his upbringing.\n\nSinging was always Davide’s passion and helped him break into the industry. His first role was in the hit musical “Spring Awakening” (2010) at St James Theatre as Georg. A successful run of the award winning show confirmed his love for the arts, as well as launched him unexpectedly into  a modeling career.\n\n“La Famiglia” (2011) the Maltese television crime drama was Davide’s first small screen role, portraying Valentino Saraceni. Later in 2012 he was involved in the very successful prime-time TVM (Television Malta) series “Katrina” (2012- 14) where he played the role of the visually impaired Clyde Montaldo, who was received warmly by the audience. Also taking on roles in theatre such as, “Jiena Nhobb, Inti Thobb” (2014) an original Maltese play by Simon Bartolo that deals with sexuality, religion and morality - in which Davide plays the controversial role of Devin. Later that year, he also worked in the Maltese/ Canadian eOne production of “A Dangerous Arrangement” (2015), working alongside actors such as Colm Meaney and Deborah Kara Unger. This film saw Davide take on the character of Tommaso - a young farmer working for the wealthy Vreeland family, who saves his co-star from drowning and deals with a father looking for vengeance.\n\nIn 2015, Davide starred in TVM most watched prime-time television programme, ‘Ic-Caqqufa’ (2015- 16), he played the role of Alex, a loner who finds refuge from the materialism of society with his love for horses. Also on the stage, ‘Faith, Hope and Charity’ (2015), set in Second World War Malta has seen Davide portraying the injured Italian pilot Francesco Cavalli, who after an emergency landing, falls in love with the nurse who takes care of him.\n\nThe following year, he took on the role of John in “Limestone Cowboy” (2016), who goes through a rollercoaster of emotions throughout the film, as he is torn between the relationship with his delusional father and that of his growing child as a single parent. This role allowed him to feature in a film that truly showed off Malta’s home grown cultural aspect. An on-going demand in theatre has seen him undertake a role in Malcolm Gelea’s “Marti Martek, Martek Marti” - a theatrical sex-comedy, where Davide portrays a cocky, sexually adventurous Owen, then dove straight into the iconic Demetrius, an arrogant, self-centred youth, who then falls in love with the woman he initially despises in William Shakespeare's “A Midsummer Night’s Dream” (2016), performed in the presidential gardens of San Anton in honour of William Shakespeare’s 400th anniversary from his death.\n\nBetween projects he loves travelling, adventuring, horse riding and enjoys any kind of sport and cooking. Davide works in English, Maltese and Italian.",
        "birthday": "1987-09-14",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1759548,
        "imdb_id": "nm5487606",
        "known_for_department": "Acting",
        "name": "Davide Tucci",
        "place_of_birth": "Sora, Frosinone, Lazio, Italy",
        "popularity": 0.0979,
        "profile_path": "/w1q9MLeEsNclBWuotd3r86BVfJI.jpg"
    }
}