{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wcJmFsz8RqIhozMwvU81hreTX4i.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 12163,
                "original_language": "en",
                "original_title": "The Wrestler",
                "overview": "Aging wrestler Randy \"The Ram\" Robinson is long past his prime but still ready and rarin' to go on the pro-wrestling circuit. After a particularly brutal beating, however, Randy hangs up his tights, pursues a serious relationship with a long-in-the-tooth stripper, and tries to reconnect with his estranged daughter. But he can't resist the lure of the ring and readies himself for a comeback.",
                "popularity": 3.5185,
                "poster_path": "/6OTR8dSoNGjWohJNo3UhIGd3Tj.jpg",
                "release_date": "2008-09-07",
                "title": "The Wrestler",
                "video": false,
                "vote_average": 7.532,
                "vote_count": 3809,
                "character": "Wayne",
                "credit_id": "575267f5c3a36852100019cf",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Todd Barry (born March 26, 1964) is an American actor and stand-up comedian, best known for his deadpan comedy.\n\nBarry was born in The Bronx, New York, and grew up in Florida. He graduated from the University of Florida with a degree in English in 1986. Before starting in stand-up comedy, he was a drummer in the indie rock band The Chant from 1984 to 1985. In 1999, his Comedy Central Presents aired. He wrote, directed and starred in the short film Borrowing Saffron (2002), co-starring H. Jon Benjamin. He has made guest appearances on shows like Dr. Katz, Professional Therapist, Home Movies, Space Ghost Coast to Coast, Wonder Showzen, Tom Goes to the Mayor, and Aqua Teen Hunger Force. He also voices a recurring character on Squidbillies. In 2004, he was featured in the animated series Shorties Watchin' Shorties.\n\nHe made 16 appearances on Dr. Katz—in the first two, as himself; then as the recurring character of Todd, a video store clerk, in most of its final season episodes. He also played a character in the television pilot Saddle Rash along with Sarah Silverman, H. Jon Benjamin and Mitch Hedberg. In \"The Third Conchord\", the twelfth and final episode of the first season of Flight of the Conchords, Barry played Todd, a bongo-playing megalomaniac, who tries to introduce the song \"Doggy Bounce\" to the Conchords' repertoire, and a new band name: The Crazy Dogggz.",
        "birthday": "1964-03-26",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.toddbarry.com/",
        "id": 176031,
        "imdb_id": "nm0058178",
        "known_for_department": "Acting",
        "name": "Todd Barry",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.441,
        "profile_path": "/ijou8PynLr4z8uKK5vdJQwFU6AN.jpg"
    }
}