{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/aVefEnQsfNPUrgsuMszTDt165P0.jpg",
                "genre_ids": [
                    27,
                    10402,
                    9648
                ],
                "id": 92060,
                "original_language": "en",
                "original_title": "Michael Jackson's Thriller",
                "overview": "A night at the movies turns into a nightmare when Michael and his date are attacked by a horde of bloody-thirsty zombies. On top of the success of the Thriller album and Michael Jackson's electrifying performance at Motown 25, the short film/music video for \"Thriller\" established Jackson as an international superstar and global phenomenon. Thriller is credited for transforming music videos into a serious art form, breaking down racial barriers in popular entertainment, popularizing the making-of documentary format and creating a home video market. The success transformed Jackson into a dominant force in global pop culture. In 2009, it became the first music video inducted into the United States National Film Registry by the Library of Congress as \"culturally, historically or aesthetically significant\". \"Thriller\" was also Jackson's seventh and final U.S. Hot 100 Top 10 hit from the Thriller album. It was the first album in history to have seven U.S. Top 10s.",
                "popularity": 2.6936,
                "poster_path": "/dYHGoPMkZMVuBA4EydmDQMo1EEv.jpg",
                "release_date": "1983-11-14",
                "title": "Michael Jackson's Thriller",
                "video": false,
                "vote_average": 8.2,
                "vote_count": 718,
                "character": "Zombie (uncredited)",
                "credit_id": "613ba6f0e27260006347a31b",
                "order": 24
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/npFK2ywM4Bs96768eLeNLBmKktb.jpg",
                "genre_ids": [
                    14,
                    53,
                    9648,
                    27
                ],
                "id": 2668,
                "original_language": "en",
                "original_title": "Sleepy Hollow",
                "overview": "Skeptical young detective Ichabod Crane gets transferred to the hamlet of Sleepy Hollow, New York, where he is tasked with investigating the decapitations of three people – murders the townsfolk attribute to a legendary specter, The Headless Horseman.",
                "popularity": 10.3147,
                "poster_path": "/1GuK965FLJxqUw9fd1pmvjbFAlv.jpg",
                "release_date": "1999-11-19",
                "title": "Sleepy Hollow",
                "video": false,
                "vote_average": 7.188,
                "vote_count": 7042,
                "credit_id": "52fe4364c3a36847f8050d0b",
                "department": "Writing",
                "job": "Screenstory"
            },
            {
                "adult": false,
                "backdrop_path": "/npFK2ywM4Bs96768eLeNLBmKktb.jpg",
                "genre_ids": [
                    14,
                    53,
                    9648,
                    27
                ],
                "id": 2668,
                "original_language": "en",
                "original_title": "Sleepy Hollow",
                "overview": "Skeptical young detective Ichabod Crane gets transferred to the hamlet of Sleepy Hollow, New York, where he is tasked with investigating the decapitations of three people – murders the townsfolk attribute to a legendary specter, The Headless Horseman.",
                "popularity": 10.3147,
                "poster_path": "/1GuK965FLJxqUw9fd1pmvjbFAlv.jpg",
                "release_date": "1999-11-19",
                "title": "Sleepy Hollow",
                "video": false,
                "vote_average": 7.188,
                "vote_count": 7042,
                "credit_id": "61c8d5aebe2d49001cc13b6a",
                "department": "Production",
                "job": "Co-Producer"
            },
            {
                "adult": false,
                "backdrop_path": "/tsSWHgaFlzzkp3o976juBZbmcs2.jpg",
                "genre_ids": [
                    28,
                    80,
                    878
                ],
                "id": 754,
                "original_language": "en",
                "original_title": "Face/Off",
                "overview": "In order to foil a terrorist plot, an FBI agent undergoes facial transplant surgery and assumes the identity of a criminal mastermind. The plan turns sour when the criminal wakes up prematurely and seeks revenge.",
                "popularity": 6.5593,
                "poster_path": "/69Xzn8UdPbVnmqSChKz2RTpoNfB.jpg",
                "release_date": "1997-06-27",
                "title": "Face/Off",
                "video": false,
                "vote_average": 7.048,
                "vote_count": 5600,
                "credit_id": "636fc52dca4f6700c68d92e9",
                "department": "Costume & Make-Up",
                "job": "Special Effects Makeup Artist"
            },
            {
                "adult": false,
                "backdrop_path": "/v3ClsT59peXyGJ4XuDvIQAPwcZy.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 4133,
                "original_language": "en",
                "original_title": "Blow",
                "overview": "A boy named George Jung grows up in a struggling family in the 1950's. His mother nags at her husband as he is trying to make a living for the family. It is finally revealed that George's father cannot make a living and the family goes bankrupt. George does not want the same thing to happen to him, and his friend Tuna, in the 1960's, suggests that he deal marijuana. He is a big hit in California in the 1960's, yet he goes to jail, where he finds out about the wonders of cocaine. As a result, when released, he gets rich by bringing cocaine to America. However, he soon pays the price.",
                "popularity": 6.9266,
                "poster_path": "/yYZFVfk8aeMP4GxBSU9MTvqs9mJ.jpg",
                "release_date": "2001-04-04",
                "title": "Blow",
                "video": false,
                "vote_average": 7.358,
                "vote_count": 4437,
                "credit_id": "64b9621e3009aa00e26455b9",
                "department": "Costume & Make-Up",
                "job": "Makeup Designer"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Kevin Yagher (born June 23, 1962) is an American special effects technician, known for Freddy Krueger's makeup and The Crypt Keeper creature.\n\nHis company, Kevin Yagher Productions, has created effects for A Nightmare on Elm Street 2: Freddy's Revenge, A Nightmare on Elm Street 3: Dream Warriors, A Nightmare on Elm Street 4: The Dream Master, Face/Off, Enemy of the State, Volcano, Starship Troopers, Conspiracy Theory, Radio Flyer, Mission: Impossible 2, and Honey, I Blew Up the Kid. Yagher's other credits include Tales from the Crypt, and Child's Play, where he met his wife, Catherine Hicks.\n\nHe is the designer and executor of the Chucky doll. Yagher frequently collaborated with puppeteer Brock Winkless on his productions. For example, Winkless performed the puppetry for Chucky in Child's Play and several of its sequels. Yagher and Winkless also worked closely on the visual effects of Honey, I Blew Up the Kid (1992).\n\nYagher directed Hellraiser: Bloodline, but decided to be credited as Alan Smithee after Dimension Films re-edited the film. He heads Kevin Yagher Productions, Inc.\n\nYagher has worked with \"Weird Al\" Yankovic on a number of occasions. In 1988, Yagher created a fat suit and appliance makeup for Yankovic's \"Fat\" video, which Yankovic later wore in his concerts while performing the song. A year later, Yagher created prosthetics that gave Yankovic a hypermuscular upper body when parodying Rambo in his film UHF.",
        "birthday": "1962-06-23",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 176246,
        "imdb_id": "nm0944892",
        "known_for_department": "Costume & Make-Up",
        "name": "Kevin Yagher",
        "place_of_birth": "Illinois, USA",
        "popularity": 0.2071,
        "profile_path": "/3R65DSRyivE7Twm4tCbiMtJNHGu.jpg"
    }
}