{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9guoVF7zayiiUq5ulKQpt375VIy.jpg",
                "genre_ids": [
                    16,
                    28,
                    14,
                    12
                ],
                "id": 592350,
                "original_language": "ja",
                "original_title": "僕のヒーローアカデミア THE MOVIE ヒーローズ：ライジング",
                "overview": "Class 1-A visits Nabu Island where they finally get to do some real hero work. The place is so peaceful that it's more like a vacation... until they're attacked by a villain with an unfathomable Quirk! His power is eerily familiar, and it looks like Shigaraki had a hand in the plan. But with All Might retired and citizens' lives on the line, there's no time for questions. Deku and his friends are the next generation of heroes, and they're the island's only hope.",
                "popularity": 4.0235,
                "poster_path": "/kpWsIkfXrnQ1pmR79qAHHq7DPxc.jpg",
                "release_date": "2019-12-20",
                "title": "My Hero Academia: Heroes Rising",
                "video": false,
                "vote_average": 8.2,
                "vote_count": 1226,
                "character": "Girl (voice)",
                "credit_id": "60d70719109cd0005f79e6a1",
                "order": 55
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "やまね あや",
            "山根 綺",
            "آیا یامانه"
        ],
        "biography": "Aya Yamane (山根 綺, Yamane Aya, born February 4, 1997) is a Japanese voice actress and idol from Kanagawa Prefecture. Member of the J-pop idol group Kleissis. She is affiliated with Aoni Production.\n\nShe graduated from Amusement Media General Academy. In 2015, she was selected to audition for the movie Jinro Game Crazy Fox (The Werewolf Game: Crazy Fox) and made her debut as Anna Sumita. In 2018, she became a member of the J-pop idol group Kleissis, derived from the game Arca Last: The World That Ends and the Fruit of the Diva.\n\nHer father is half Chinese and half Japanese, and her mother is one quarter Chinese. She likes cooking, movies, music, guitar and darts. Her special skills are singing and dancing.",
        "birthday": "1997-02-04",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.aoni.co.jp/search/yamane-aya.html",
        "id": 1762671,
        "imdb_id": "nm9797552",
        "known_for_department": "Acting",
        "name": "Aya Yamane",
        "place_of_birth": "Kanagawa, Japan",
        "popularity": 0.869,
        "profile_path": "/va0XORY6VchoceyqywJ4KxsVN5s.jpg"
    }
}