{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/euxYhuuJjChU755u2YHj0ZPjww3.jpg",
                "genre_ids": [
                    35,
                    80,
                    18
                ],
                "id": 1574,
                "original_language": "en",
                "original_title": "Chicago",
                "overview": "Murderesses Velma Kelly and Roxie Hart find themselves on death row together and fight for the fame that will keep them from the gallows in 1920s Chicago.",
                "popularity": 3.9445,
                "poster_path": "/3ED8cWCXY9zkx77Sd0N5qMbsdDP.jpg",
                "release_date": "2002-12-10",
                "title": "Chicago",
                "video": false,
                "vote_average": 7.12,
                "vote_count": 2750,
                "character": "Mona",
                "credit_id": "52fe42ffc3a36847f8032bb5",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Mýa"
        ],
        "biography": "​From Wikipedia, the free encyclopedia.  \n\nMýa Marie Harrison (born October 10, 1979), professionally referred to as Mýa, is an American singer-songwriter, record producer and actress. Born and raised in Washington D.C., Harrison's eponymous debut album with Interscope Records was released in April 1998, and sold over one million copies in the United States, producing the gold-certified top ten single \"It's All About Me\" featuring Sisqó.\n\nHer second studio album, platinum-selling Fear of Flying, was released in 2000 and became a success stateside and worldwide, with single \"Case of the Ex\" becoming Mýa's breakthrough hit, reaching number-one on the Australian Singles Chart. A year after, Harrison won her first Grammy Award for the worldwide number-one hit \"Lady Marmalade\", a cover version she recorded alongside Christina Aguilera, Lil' Kim, and Pink for the soundtrack of the film Moulin Rouge! (2001). \n\nThe singer's third studio album, Moodring, was released in July 2003 stateside and certified gold by the RIAA. Following several label changes, Mýa's often-delayed fourth studio album, Liberation (2007), received a download-release in Japan only and led to her 2008 Japan-exclusive album Sugar & Spice.\n\nHaving expanded her career to acting and product endorsement deals, Harrison has been engaged in product endorsement deals with brands such as Coca-Cola, Gap, Iceberg, Tommy Hilfiger, and Motorola and has had small roles in films such as Dirty Dancing: Havana Nights (2004), Shall We Dance? (2004), and Cursed (2005). In 2002, she had a supporting role in the film adaptation of the 1975 Broadway musical Chicago, for which she won a Screen Actors Guild Award.\n\nHarrison was the runner up on the ninth season of Dancing with the Stars. Billboard named Mýa the 97th Hot 100 Artists of 2000s.\n\nDescription above from the Wikipedia article  Mýa, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1978-10-10",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 17643,
        "imdb_id": "nm0616550",
        "known_for_department": "Acting",
        "name": "Mya",
        "place_of_birth": "Washington, District of Columbia, USA",
        "popularity": 0.229,
        "profile_path": "/yCAAdMvQs3K39OCTHEgPEI4OV4O.jpg"
    }
}