{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8yE0aOQoZSSl2CuuPvjxdHuQl4P.jpg",
                "genre_ids": [
                    878,
                    53
                ],
                "id": 10514,
                "original_language": "en",
                "original_title": "The Andromeda Strain",
                "overview": "When virtually all of the residents of Piedmont, New Mexico, are found dead after the return to Earth of a space satellite, the head of the US Air Force's Project Scoop declares an emergency. A group of eminent scientists led by Dr. Jeremy Stone scramble to a secure laboratory and try to first isolate the life form while determining why two people from Piedmont - an old alcoholic and a six-month-old baby - survived. The scientists methodically study the alien life form unaware that it has already mutated and presents a far greater danger in the lab, which is equipped with a nuclear self-destruct device designed to prevent the escape of dangerous biological agents.",
                "popularity": 4.281,
                "poster_path": "/4FBSFz8wLpxd4o6hnvKOJJ8WSIz.jpg",
                "release_date": "1971-03-12",
                "title": "The Andromeda Strain",
                "video": false,
                "vote_average": 7.054,
                "vote_count": 736,
                "character": "Dr. Robertson",
                "credit_id": "52fe437e9251416c75012829",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/knYZcpl08qhiEPCytyNXOq7Z1oS.jpg",
                "genre_ids": [
                    80,
                    18,
                    9648,
                    53
                ],
                "id": 10633,
                "original_language": "en",
                "original_title": "In the Heat of the Night",
                "overview": "African-American Philadelphia police detective Virgil Tibbs is arrested on suspicion of murder by Bill Gillespie, the racist police chief of tiny Sparta, Mississippi. After Tibbs proves not only his own innocence but that of another man, he joins forces with Gillespie to track down the real killer. Their investigation takes them through every social level of the town, with Tibbs making enemies as well as unlikely friends as he hunts for the truth.",
                "popularity": 4.1761,
                "poster_path": "/1zjS7aSgvOX98BSWEsshDw3kxe5.jpg",
                "release_date": "1967-08-02",
                "title": "In the Heat of the Night",
                "video": false,
                "vote_average": 7.651,
                "vote_count": 1161,
                "character": "Henderson",
                "credit_id": "52fe43999251416c75016a73",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Kermit Murdock (20 March 1908 – 11 February 1981) was an American film, television and radio actor known for his avuncular and professorial character portrayals. His more prominent character roles in major motion pictures included Dean Pollard in Splendor in the Grass (1961), Henderson in In the Heat of The Night (1967), and Dr. Robertson in The Andromeda Strain (1970).\n\nHe is also well known for his voice acting in many episodes of the 1950s science fiction radio series X Minus One. He was in The Mysterious Traveler episode \"Survival of the Fittest\" with Everett Sloane, and was featured in an episode of the series Adventure Ahead. He appeared in character roles in television drama of the 1960s and 1970s including episodes of Kung Fu, The Mod Squad, and The Defenders. He portrayed a prosecutor of witches in the Star Trek episode, \"All Our Yesterdays\".",
        "birthday": "1908-03-20",
        "deathday": "1981-02-11",
        "gender": 2,
        "homepage": null,
        "id": 176446,
        "imdb_id": "nm0613794",
        "known_for_department": "Acting",
        "name": "Kermit Murdock",
        "place_of_birth": "Pittsburgh, Pennsylvania, USA",
        "popularity": 0.1115,
        "profile_path": null
    }
}