{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tvNuhRlpRozDgsX1zR9gQ2aHv1X.jpg",
                "genre_ids": [
                    18
                ],
                "id": 1578,
                "original_language": "en",
                "original_title": "Raging Bull",
                "overview": "The life of boxer Jake LaMotta, whose violence and temper that led him to the top in the ring destroyed his life outside of it.",
                "popularity": 8.4623,
                "poster_path": "/1WV7WlTS8LI1L5NkCgjWT9GSW3O.jpg",
                "release_date": "1980-11-14",
                "title": "Raging Bull",
                "video": false,
                "vote_average": 7.923,
                "vote_count": 4523,
                "character": "Lenore",
                "credit_id": "52fe4300c3a36847f8032f1b",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Theresa Saldana (August 20, 1954 – June 6, 2016) was an American actress and author, known for her work in film and television. She is perhaps best known for her role as Rachel Scali, the wife of Police Commissioner Tony Scali, in the 1990s television series The Commish, for which she received a Golden Globe nomination for Best Performance by an Actress in a Supporting Role, in 1994. Major film roles include the part of Lenore La Motta, the wife of Joe Pesci's character, in the 1980 feature film Raging Bull and Robert Zemeckis's Beatle-mania ensemble I Wanna Hold Your Hand. She also appeared in Home Movies with Kirk Douglas and Nancy Allen for director Brian De Palma in 1980. The crime of stalking was brought to early attention after Saldana survived a brutal attempted murder by an obsessed fan in 1982. Saldana died at age 61 on June 6, 2016, following her hospitalization for pneumonia.\n\nDescription above from the Wikipedia article Theresa Saldana, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1954-08-20",
        "deathday": "2016-06-06",
        "gender": 1,
        "homepage": null,
        "id": 17652,
        "imdb_id": "nm0757854",
        "known_for_department": "Acting",
        "name": "Theresa Saldana",
        "place_of_birth": " Brooklyn, New York, USA",
        "popularity": 0.2675,
        "profile_path": "/VWTUbbQQX1Sq1b8AIwbXDuT93u.jpg"
    }
}