{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/h1vBJ0uN4QCbBb5WVKxmtfTrHoY.jpg",
                "genre_ids": [
                    37
                ],
                "id": 11697,
                "original_language": "en",
                "original_title": "The Man Who Shot Liberty Valance",
                "overview": "Questions arise when Senator Stoddard attends the funeral of a local man named Tom Doniphon in a small Western town. Flashing back, we learn Doniphon saved Stoddard, then a lawyer, when he was roughed up by a crew of outlaws terrorizing the town, led by Liberty Valance. As the territory's safety hung in the balance, Doniphon and Stoddard, two of the only people standing up to him, proved to be very important, but different, foes to Valance.",
                "popularity": 2.5324,
                "poster_path": "/4C1R0LEivLjbv3swAzJfzh0tzXl.jpg",
                "release_date": "1962-04-13",
                "title": "The Man Who Shot Liberty Valance",
                "video": false,
                "vote_average": 7.808,
                "vote_count": 1216,
                "character": "Doc Willoughby",
                "credit_id": "52fe447b9251416c75036527",
                "order": 6
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/oCC3rSccbJV9bxMDRedtqI6pnla.jpg",
                "genre_ids": [
                    35
                ],
                "id": 11030,
                "original_language": "en",
                "original_title": "Zelig",
                "overview": "Fictional documentary about the life of human chameleon Leonard Zelig, a man who becomes a celebrity in the 1920s due to his ability to look and act like whoever is around him. Clever editing places Zelig in real newsreel footage of Woodrow Wilson, Babe Ruth, and others.",
                "popularity": 3.3773,
                "poster_path": "/bfs67JaV4B5xVBvtXd3O4R7nk9G.jpg",
                "release_date": "1983-07-15",
                "title": "Zelig",
                "video": false,
                "vote_average": 7.432,
                "vote_count": 886,
                "credit_id": "56687a6cc3a36836a0003531",
                "department": "Crew",
                "job": "Thanks"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Kenneth Abner Doncourt"
        ],
        "biography": "Ken Murray (born Kenneth Abner Doncourt, July 14, 1903 – October 12, 1988) was an American comedian, actor, radio and television personality and author.\n\nAfter finding success on the vaudeville stage, Murray moved to Hollywood and made his film debut in the 1929 romantic drama Half Marriage, followed by a role in Leathernecking in 1930. Murray was the host of a weekly radio variety show (The Ken Murray Show) on NBC 1932-33 and on CBS 1936–37. He later was the original host (1945-57) of Queen for a Day, on the Mutual Broadcasting System radio show, which was simulcast on KTSL (now KCBS-TV), Channel 2 in Los Angeles.\n\nDuring World War II, Murray was one of the many celebrities to volunteer at the Hollywood Canteen. In 1947, he produced Bill and Coo, a feature film using trained birds and other animals as actors. Bill and Coo won a special Academy Award for \"novel and entertaining use of the medium of motion picture\" and \"artistry and patience\" .\n\nHe was also the host of The Ken Murray Show, a weekly music and comedy show on CBS Television that ran from 1950 to 1953. The show was the first to win a Freedom Foundation Award. Murray also guest starred on several television series, including The Ford Show, Starring Tennessee Ernie Ford and The Bing Crosby Show.\n\nMurray produced and co-starred as \"Smiling Billy Murray\" in a 1953 film, The Marshal's Daughter, a western that featured his protege Laurie Anders in the title role, her sole film performance. In 1962, Murray portrayed the top hat wearing, cigar chewing, drunken Doc Willoughby in John Ford's The Man Who Shot Liberty Valance starring John Wayne and James Stewart, arguably his most memorable screen role. Paired off for most of the picture with Edmond O'Brien as an alcoholic newspaper editor, he drunkenly rolls over the gunshot corpse of villain Liberty Valance (Lee Marvin) with his boot, looks around off-handedly, and says \"Dead\" to the surrounding crowd of euphoric Mexicans.\n\nIn 1964, Murray played Whipsaw, the operator of a stagecoach depot in the episode \"Little Cayuse\" of the television series Death Valley Days, hosted by Stanley Andrews. He and his partner take in a Cayuse orphan (Larry Domasin), who demonstrates his loyalty to the men during an Indian attack. In 1965, Murray played a THRUSH financier and owner of a caribbean casino in The Man from U.N.C.L.E.. In 1966, Murray was cast as Melody Murphy in the Walt Disney film Follow Me, Boys! starring Fred MacMurray, Vera Miles and Kurt Russell.",
        "birthday": "1903-07-14",
        "deathday": "1988-10-12",
        "gender": 2,
        "homepage": null,
        "id": 176543,
        "imdb_id": "nm0615108",
        "known_for_department": "Acting",
        "name": "Ken Murray",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.1224,
        "profile_path": "/rOLQKIaEQ5demTbFkc4dUJgn6do.jpg"
    }
}