{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/70uUnpfe7en9x011UjpZoub101l.jpg",
                "genre_ids": [
                    99,
                    18,
                    80
                ],
                "id": 1430,
                "original_language": "en",
                "original_title": "Bowling for Columbine",
                "overview": "This is not a film about gun control. It is a film about the fearful heart and soul of the United States, and the 280 million Americans lucky enough to have the right to a constitutionally protected Uzi. From a look at the Columbine High School security camera tapes to the home of Oscar-winning NRA President Charlton Heston, from a young man who makes homemade napalm with The Anarchist's Cookbook to the murder of a six-year-old girl by another six-year-old. Bowling for Columbine is a journey through the US, through our past, hoping to discover why our pursuit of happiness is so riddled with violence.",
                "popularity": 5.1555,
                "poster_path": "/5AlgeysilsfLdEwlTlYO7fqgsLn.jpg",
                "release_date": "2002-10-09",
                "title": "Bowling for Columbine",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 1614,
                "character": "Self (archive footage)",
                "credit_id": "687a948c73da5eb0cb528308",
                "order": 34
            },
            {
                "adult": false,
                "backdrop_path": "/lsTgf0YfoBUUAwm79xDVEpsq3tQ.jpg",
                "genre_ids": [
                    99,
                    35
                ],
                "id": 13007,
                "original_language": "en",
                "original_title": "Religulous",
                "overview": "Commentator-comic Bill Maher plays devil's advocate with religion as he talks to believers about their faith. Traveling around the world, Maher examines the tenets of Christianity, Judaism and Islam and raises questions about homosexuality, proof of Christ's existence, Jewish Sabbath laws, violent Muslim extremists.",
                "popularity": 0.6255,
                "poster_path": "/hBv5LCbWxPB8iU77dwurSGMVZ3N.jpg",
                "release_date": "2008-10-01",
                "title": "Religulous",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 610,
                "character": "Self (archive footage)",
                "credit_id": "687a958572ce78392c8a3f99",
                "order": 24
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Joseph Isadore Lieberman (February 24, 1942 – March 27, 2024) was an American politician and lawyer who served as a United States senator from Connecticut from 1989 to 2013. Originally a member of the Democratic Party, he was its nominee for vice president of the United States in the 2000 presidential election. During his final term in office, he was officially listed as an Independent Democrat and caucused with and chaired committees for the Democratic Party.\n\nLieberman was elected as a Democrat in 1970 to the Connecticut Senate, where he served three terms as majority leader. After an unsuccessful bid for the U.S. House of Representatives in 1980, he served as the Connecticut attorney general from 1983 to 1989. He narrowly defeated Republican Party incumbent Lowell Weicker in 1988 to win election to the U.S. Senate and was re-elected in 1994, 2000, and 2006. He was the Democratic Party nominee for vice president in the 2000 presidential election, running with presidential nominee and then Vice President Al Gore, and becoming the first Jewish candidate on a U.S. major party presidential ticket.\n\nGore and Lieberman lost the 2000 Presidential Election to the Republican George W. Bush–Dick Cheney ticket, while winning the popular vote. He also unsuccessfully sought the Democratic nomination in the 2004 U.S. presidential election. During his Senate re-election bid in 2006, Lieberman lost the Democratic primary election but won re-election in the general election as a third party candidate under the Connecticut for Lieberman party label.\n\nLieberman was officially listed in Senate records for the 110th and 111th Congress as an Independent Democrat, and sat as part of the Senate Democratic Caucus. After his speech at the 2008 Republican National Convention in which he endorsed John McCain for president, he no longer attended Democratic Caucus leadership strategy meetings or policy lunches. The Senate Democratic Caucus voted to allow him to keep the chairmanship of the Senate Committee on Homeland Security and Governmental Affairs. Subsequently, he announced that he would continue to caucus with the Democrats. Before the 2016 election, he endorsed Hillary Clinton for president and in 2020 endorsed Joe Biden for president.\n\nAs senator, Lieberman introduced and championed the Don't Ask, Don't Tell Repeal Act of 2010 and legislation that led to the creation of the Department of Homeland Security. During debate on the Affordable Care Act (ACA), as the crucial 60th vote needed to pass the legislation, his opposition to the public health insurance option was critical to its removal from the resulting bill signed by President Barack Obama.",
        "birthday": "1942-02-24",
        "deathday": "2024-03-27",
        "gender": 2,
        "homepage": null,
        "id": 1768928,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Joe Lieberman",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.0468,
        "profile_path": "/jvghn7Dvuorl7bm2Yecl5hW2IEN.jpg"
    }
}