{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/38zhXIWXlWDzwI8gRJOf5ISyGFc.jpg",
                "genre_ids": [
                    35,
                    53,
                    18
                ],
                "id": 10843,
                "original_language": "en",
                "original_title": "After Hours",
                "overview": "Desperate to escape his mind-numbing routine, uptown Manhattan office worker Paul Hackett ventures downtown for a hookup with a mystery woman.",
                "popularity": 3.9708,
                "poster_path": "/eamOBurHBu0MIxohTIVcfxmZ6Z7.jpg",
                "release_date": "1985-09-13",
                "title": "After Hours",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 1603,
                "character": "Neighbor #2",
                "credit_id": "61ac8f097f6c8d0041da2ff8",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Victor Bumbalo is an award-winning playwright whose plays have been produced worldwide. He is the recipient of an Igram Merrill Award for playwriting. Bumbalo was a finalist for the 2007 Lambda Literary Award for this play Questa and a finalist for the award in 2008 for Niagara Falls. Niagara Falls followed its Off-Broadway run with subsequent openings in over fifty cities throughout the United States, England, and Australia. Adan and the Experts opened to critical success Off-Broadway and has had numerous productions in the United States and Canada. What Are Tuesdays Like? was featured at The Carnegie Mellon Showcase of New Plays and at the Contemporary American Theater Festival. Besides playing throughout the United States, What are Tuesdays Like? has had productions in Germany, Japan, England, Sweden and Costa Rica.\n\nQuestra premiered in Los Angeles starring Wendie Malick, Dan Lauria, and Dorian Harewood. The play was produced by David Milch. There have been subsequent productions in New York, Chicago, and St. Petersburg, Florida.\n\nThe majority of Bumbalo's plays are published by Broadway Play Publishing Inc. Tell appears in the anthology Gay and Lesbian Plays Today, published by Heinemann Educational Books Inc., and Show is included in The Best American Short Plays, published by Applause Theatre Book Publishers.\n\nBumbalo has written for such popular television series as: NYPD Blue (produced by David Milch and Steven Bochco), American Gothic (produced by Sam Raimi), Relativity (produced by Edward Zwick), and HBO's Spawn and several produced movies of the week. With Ray Shenusay, they wrote episodes for Wow Wow Wubbzy for Nickelodeon.",
        "birthday": "1948-11-30",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.victorbumbalo.com/",
        "id": 176988,
        "imdb_id": "nm0120288",
        "known_for_department": "Writing",
        "name": "Victor Bumbalo",
        "place_of_birth": "Utica, New York,USA",
        "popularity": 0.0811,
        "profile_path": null
    }
}