{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9GHsA3bt6MYW7Cpur91GeVBQKIC.jpg",
                "genre_ids": [
                    28,
                    53,
                    18,
                    12
                ],
                "id": 11893,
                "original_language": "en",
                "original_title": "Runaway Train",
                "overview": "A hardened convict and a younger prisoner escape from a brutal prison in the middle of winter only to find themselves on an out-of-control train with a female railway worker while being pursued by the vengeful head of security.",
                "popularity": 3.3015,
                "poster_path": "/A9pf9KjhqCGthu6PKAKE5E1qRNn.jpg",
                "release_date": "1985-11-15",
                "title": "Runaway Train",
                "video": false,
                "vote_average": 6.965,
                "vote_count": 612,
                "character": "Queen Con",
                "credit_id": "52fe449c9251416c7503ac91",
                "order": 19
            },
            {
                "adult": false,
                "backdrop_path": "/lz6Cy1JgOR72AilU2ghDvLKbgqT.jpg",
                "genre_ids": [
                    35
                ],
                "id": 813,
                "original_language": "en",
                "original_title": "Airplane!",
                "overview": "An ex-fighter pilot forced to take over the controls of an airliner when the flight crew succumbs to food poisoning.",
                "popularity": 8.7172,
                "poster_path": "/7Q3efxd3AF1vQjlSxnlerSA7RzN.jpg",
                "release_date": "1980-06-27",
                "title": "Airplane!",
                "video": false,
                "vote_average": 7.306,
                "vote_count": 4780,
                "character": "First Jive Dude",
                "credit_id": "609b51f27ecd280058b3bc4f",
                "order": 31
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Norman Gibbs was born in the Bronx, NYC, and attended DeWitt Clinton High School before studying theatre at California Institute of the Arts.\n\nIn 1972, he was indicted for the illegal importation of and possession with the intent to distribute approximately fourteen pounds of cocaine, worth over $1,500,000 from Mexico, this after the actor had recently appeared in two films with similar fictional plots to his crime, The French Connection (1971) and The Godfather (1972)\n\nHe later had featured roles in Disaster on the Coastliner (1979, with Lloyd Bridges, William Shatner, Michael Pataki and Jerry Ayres) and in episodes of The Bionic Woman (1977, starring Lindsay Wagner, with Whit Bissell), Salvage 1 (1979, with Paul Sorensen), Trapper John, M.D. (1979), and Palmerstown, U.S.A. (1980, with Don Keefer and John Schuck).\n\nGibbs is perhaps best known on screen for his part as the First Jive Dude in Airplane! (1980, with Lloyd Bridges, Jonathan Banks, Marcy Goldman, Gregory Itzin, Cyril O'Reilly, Kenneth Tobey, Jason Wingreen, Sandra Lee Gimpel, Leslie Hoffman and Paula Moody), a role which he and his friend and fellow jive talker Al White all the lines for.  Between 1982 and 1984, he was featured in several episodes of Hill Street Blues where he worked with James B. Sikking, Barbara Bosson, Barbara Babcock, Milt Tarver, Alexandra Johnson and Tony Plana. Further acting work include Kiss Me Goodbye (1982, with Paul Dooley, Michael Ensign and Robert Miano), Blue Thunder (1983, with Malcolm McDowell, Jack Murdock, Paul Lambert, James Read, Tony Brubaker and Eurlyne Epper-Woldman), and Runaway Train (1985, starring Jon Voight, with John Bloom, Dennis Ott, Don Pugsley, Tommy \"Tiny\" Lister, Jr., Loren Janes, Tony Epper and Marshal Silverman).\n\nGibbs also guest starred in episodes of Lou Grant (1980, with Milt Tarver), The White Shadow (1980-1981, with Joan Pringle, James Cromwell and Karl Bruck), Flamingo Road (1982, starring John Beck and Stella Stevens), Fatal Vision (1984, starring Gary Cole, with Joel Polis, Mitchell Ryan, Wendy Schaal, Alexandra Johnson, Paddi Edwards, Kenneth Tigar, Richard Lineback, Brian Thompson, Matthew Faison and Peter Vogt), Scarecrow and Mrs. King (1985, starring Kate Jackson, with Ray Reinhardt), and NYPD Blue (1994, with Louis Giambalvo, Gordon Clapp and Don Stark).",
        "birthday": "1947-08-30",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 176937,
        "imdb_id": "nm0316709",
        "known_for_department": "Acting",
        "name": "Norman Alexander Gibbs",
        "place_of_birth": "The Bronx, New York, USA",
        "popularity": 0.0441,
        "profile_path": "/mOZ9Hd2QycFTOWCKvYNCg41sPMh.jpg"
    }
}