{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/77GGKq6Ixq6ZiqBM6XcPZgQmiN2.jpg",
                "genre_ids": [
                    28,
                    12,
                    18
                ],
                "id": 579974,
                "original_language": "te",
                "original_title": "రౌద్రం రణం రుధిరం",
                "overview": "A fictional history of two legendary revolutionaries' journey away from home before they began fighting for their country in the 1920s.",
                "popularity": 6.9769,
                "poster_path": "/nEufeZlyAOLqO2brrs0yeF1lgXO.jpg",
                "release_date": "2022-03-24",
                "title": "RRR",
                "video": false,
                "vote_average": 7.742,
                "vote_count": 1448,
                "character": "Cunningham",
                "credit_id": "62358b42df2945004601fa3e",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Mark Bennington is an internationally known photographer and best known as an actor for his work on: Star Trek: Voyager, NYPD Blue, Charmed and more recently in the films- Parmanu: The Story of Pokhran, Detective Byomkesh Bakshy!, Kesari, RRR and Swatantratya Veer Savarkar.\n\nAs an actor, Mark trained with Mike Nichols, Paul Sills & George Morrison at the New Actors Workshop in Manhattan. After graduating, he worked for 2 years with Diane Paulus & Randy Weiner's experimental theater ensemble 'Project 400' and later landed his first big theater gig in the Royal National Theatre's production of \"An Enemy of the People\" directed by Trevor Nunn, starring Sir Ian McKellen. He worked as an actor in regional theater for years before picking up the camera.\n\nAs a photographer, Mark's work has been published in The Atlantic, The Huffington Post, UpWorthy, CNN, Photo District News, GQ India, Verve Magazine, Man's World Magazine, Asian Photography, Worth Magazine, The Los Angeles Times, The LA Weekly, The Wall Street Journal, Platform Magazine, Forbes Magazine, The Times of India, The Virginia Quarterly Review, The Boston Globe, Lucky Magazine, Self Magazine, BuzzFeed and many more. Mark authored of the acclaimed photography book \"Living the Dream: The Life of the 'Bollywood' Actor (HarperCollins, 2017) and is an adjunct professor of photography at The S.I. Newhouse School of Media and Communication at Syracuse University. His work has been exhibited in Rome, Tokyo, New York City, San Fransisco, Berlin and London.\n\nAs a drummer, Mark played over 400 shows and recorded 3 albums with the legendary LA roots/rock band '50cent Haircut' (Knitting Factory Records).\n\nBased in Mumbai, he married cultural anthropologist Taapsi Ramchandani on December 21, 2013.",
        "birthday": "1969-08-20",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.markbennington.com",
        "id": 177225,
        "imdb_id": "nm1204791",
        "known_for_department": "Acting",
        "name": "Mark Bennington",
        "place_of_birth": null,
        "popularity": 0.2481,
        "profile_path": "/kr1Nv0Q2cZEO4wVRFrUzdoXtM01.jpg"
    }
}