{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3q35nBLCIdEbxYfsr7D5ocYQXKz.jpg",
                "genre_ids": [
                    18,
                    10751,
                    14
                ],
                "id": 1585,
                "original_language": "en",
                "original_title": "It's a Wonderful Life",
                "overview": "A holiday favourite for generations...  George Bailey has spent his entire life giving to the people of Bedford Falls.  All that prevents rich skinflint Mr. Potter from taking over the entire town is George's modest building and loan company.  But on Christmas Eve the business's $8,000 is lost and George's troubles begin.",
                "popularity": 6.3809,
                "poster_path": "/bSqt9rhDZx1Q7UZ86dBPKdNomp2.jpg",
                "release_date": "1946-12-20",
                "title": "It's a Wonderful Life",
                "video": false,
                "vote_average": 8.272,
                "vote_count": 4589,
                "character": "Pa Bailey",
                "credit_id": "52fe4301c3a36847f803353b",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Sam Hinds",
            "Samuel Hinds",
            "Samuel Southey Hinds"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nSamuel Southey Hinds (April 4, 1875 – October 13, 1948) was an American actor and former lawyer. He was often cast as kindly authoritarian figures and appeared in over 200 films until his death.\n\nHinds was born in Brooklyn, New York, the son of Joseph E. Hinds and Mary A. Beetham Hinds.\n\nHe was a graduate of Phillips Andover Academy and Harvard Law School and worked for over 32 years as a lawyer before becoming a professional actor. After he lost most of his money in the financial crisis of 1929, Hinds retired as a lawyer and joined the Pasadena Community Playhouse. He started acting in Broadway shows at age 54.\n\nHinds is perhaps best remembered for playing Peter Bailey, the father of James Stewart and founder of the Bailey Building and Loan, in It's a Wonderful Life (1946) and for his part as Paul Sycamore in You Can't Take It With You (1938), both films directed by Frank Capra. Hinds was also known for his roles in the Abbott & Costello films such as Buck Privates (1941), Ride 'Em Cowboy (1942) and Pardon My Sarong (1942). He also portrayed Lew Ayres' father in the Dr. Kildare film series during the early 1940s. Hinds mostly played supporting roles, often kind and dignified authority figures; often lawyers, doctors, mayors, judges or the father of the main figure.\n\nHinds' first film was If I Had a Million (1932); his second film was The Road Is Open Again (1933) where he portrayed President Woodrow Wilson. His earlier career was reflected in the role of Judge Thatcher, tortured by the mad Dr. Richard Vollin (Bela Lugosi) in The Raven (1935).\n\nHinds acted in a total of 214 films. His last film was The Bribe, released in 1949, after his death.\n\nHinds died of pneumonia in Pasadena, California, on October 13, 1948 at age 73. He was married to Dorothy Cruickshack, they had two children.",
        "birthday": "1875-04-03",
        "deathday": "1948-10-13",
        "gender": 2,
        "homepage": null,
        "id": 17756,
        "imdb_id": "nm0385594",
        "known_for_department": "Acting",
        "name": "Samuel S. Hinds",
        "place_of_birth": "Brooklyn, New York City, New York, USA",
        "popularity": 0.2757,
        "profile_path": "/uwUEvtPnO79him7Lf8lwQlVW78X.jpg"
    }
}