{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fzZmcKQv7ZTGIiPvocPhNs3wUyK.jpg",
                "genre_ids": [
                    18,
                    10749,
                    14
                ],
                "id": 122906,
                "original_language": "en",
                "original_title": "About Time",
                "overview": "The night after another unsatisfactory New Year's party, Tim's father tells his son that the men in his family have always had the ability to travel through time. They can't change history, but they can change what happens and has happened in their own lives. Thus begins the start of a lesson in learning to appreciate life itself as it is, as it comes, and most importantly, the people living alongside us.",
                "popularity": 7.7462,
                "poster_path": "/iR1bVfURbN7r1C46WHFbwCkVve.jpg",
                "release_date": "2013-09-04",
                "title": "About Time",
                "video": false,
                "vote_average": 7.913,
                "vote_count": 8873,
                "character": "Bhattie QC",
                "credit_id": "64d76978b6c264115753886b",
                "order": 22
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Pal Aron (born 1971) is a British television and theatre actor from Birmingham, England, known for his roles as Adam Osman in Casualty, Brandon Kane in The Bill, Jayesh Parekh and Sonny Dhillon in Coronation Street. Before professionally acting, he performed with the Theatre of the Unemployed in Birmingham. He was also in the comedy Green Wing, and has performed with the RSC. In January 2008, Aron was cast as Vijay Chohan in the daily hospital drama The Royal Today. He also appeared in The Cup, a BBC Two comedy series in which he plays Dr. Kaskar, a football fanatic parent trying to live his dreams through his footballer son. In April 2012, Aron joined the BBC Radio 4 soap opera The Archers as new junior cricket coach Iftikar \"Ifty\" Shah. In 2012, he appeared in the Sky1 TV comedy series Stella as Jagadeesh. In 2013, Aron appeared as Bhattie QC in About Time. In May 2020, he appeared in an episode of the BBC soap opera Doctors as Dick Starr.",
        "birthday": "1971-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.gardnerherrity.co.uk/actors.html",
        "id": 1780966,
        "imdb_id": "nm0036889",
        "known_for_department": "Acting",
        "name": "Pal Aron",
        "place_of_birth": "Birmingham, West Midlands, England, UK",
        "popularity": 0.0942,
        "profile_path": "/r7EjgxnhVNJhhpuGub3lL77Soty.jpg"
    }
}