{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/x7y8ezKtU1vRInk0dmbvDoKgJ8u.jpg",
                "genre_ids": [
                    18,
                    35,
                    10749
                ],
                "id": 2898,
                "original_language": "en",
                "original_title": "As Good as It Gets",
                "overview": "Melvin Udall, a cranky, bigoted, obsessive-compulsive writer of romantic fiction, is rude to everyone he meets, including his gay neighbor, Simon. After Simon is brutally attacked and hospitalized, Melvin finds his life turned upside down when he has to look after Simon's dog. In addition, Carol, the only waitress at the local diner who will tolerate him, leaves work to care for her chronically ill son, making it impossible for Melvin to eat breakfast.",
                "popularity": 5.5237,
                "poster_path": "/xXxuJPNUDZ0vjsAXca0O5p3leVB.jpg",
                "release_date": "1997-12-19",
                "title": "As Good as It Gets",
                "video": false,
                "vote_average": 7.397,
                "vote_count": 3930,
                "character": "New Yorker",
                "credit_id": "681bb8813a275d64d10b2551",
                "order": 68
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Alba Albanese"
        ],
        "biography": "Ava Lee Scott is an American actress, stunt performer, author, and producer. She is known for her work in The Avengers (2012), Billions (2019–2020), and The Good Cop (2018). In addition to her acting career, she has participated in various Off-Broadway productions and developed immersive theater projects. Scott began her career as a stunt performer, working on major Hollywood productions. She also played an uncredited role as Girl in Lot in 8mm (1999). Her versatility is evident in her work as a writer and producer, particularly in innovative theater projects such as The Raven, an immersive performance based on the works of Edgar Allan Poe. Beyond her film and theater endeavors, Scott is dedicated to creative storytelling and has collaborated with prestigious institutions such as the Columbia University School of the Arts.",
        "birthday": "1976-03-01",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1781717,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Ava Lee Scott",
        "place_of_birth": "Brooklyn, New York, USA",
        "popularity": 0.1096,
        "profile_path": "/4eCYdc3AFfKHqW8MZNeSZu5w9uE.jpg"
    }
}