{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6MKr3KgOLmzOP6MSuZERO41Lpkt.jpg",
                "genre_ids": [
                    35,
                    80,
                    12
                ],
                "id": 337404,
                "original_language": "en",
                "original_title": "Cruella",
                "overview": "In 1970s London amidst the punk rock revolution, a young grifter named Estella is determined to make a name for herself with her designs. She befriends a pair of young thieves who appreciate her appetite for mischief, and together they are able to build a life for themselves on the London streets. One day, Estella’s flair for fashion catches the eye of the Baroness von Hellman, a fashion legend who is devastatingly chic and terrifyingly haute. But their relationship sets in motion a course of events and revelations that will cause Estella to embrace her wicked side and become the raucous, fashionable and revenge-bent Cruella.",
                "popularity": 11.2552,
                "poster_path": "/hjS9mH8KvRiGHgjk6VUZH7OT0Ng.jpg",
                "release_date": "2021-05-26",
                "title": "Cruella",
                "video": false,
                "vote_average": 7.987,
                "vote_count": 9719,
                "character": "Swanky Bar Waiter",
                "credit_id": "651290cc344a8e0973ae010f",
                "order": 38
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            " Rob Cawsey"
        ],
        "biography": "Robert is a multi award winning writer, actor and comedian that trained at the Guildhall School of Music & Drama and Ecole Philippe Gaulier in Paris. He has worked extensively in theatre, TV and film. His comedy double act 'Guilt & Shame' with Gabriel Bisset-Smith performed 4 live shows at Edinburgh Fringe to sell out audiences and critical acclaim. All shows transferred to Soho Theatre in London as well as playing festivals all over the UK. His debut solo comedy / theatre show 'The Fantasist' was produced by Soho Theatre and directed by Vicky Jones. Following this, his podcast 'Guilt & Shame' with Gabriel and Vicky has a large and growing international audience. He has recently been in writers rooms for HBO and NBC and his web series 'Right Now' has been selected for film festivals all over the world, being nominated for 'Outstanding Achievement in Writing' (NYC Webfest 2020) and winning multiple awards including 'Best International Spotlight' at Melbourne WebFest 2020, Best Actor at UKOWF (UK Offline Web Fest) 2021 and Best Actor at Santa Monica Web Fest 2021.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.robertcawsey.com",
        "id": 1782026,
        "imdb_id": "nm1660010",
        "known_for_department": "Acting",
        "name": "Robert Cawsey",
        "place_of_birth": null,
        "popularity": 0.0286,
        "profile_path": "/7NoPCU4phW97eBNvQRVfU8KC7FK.jpg"
    }
}