{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/26O2JCu4cyR7U3ga1GT7BhTj888.jpg",
                "genre_ids": [
                    35,
                    9648,
                    80
                ],
                "id": 1594,
                "original_language": "en",
                "original_title": "A Shot in the Dark",
                "overview": "Inspector Jacques Clouseau, smitten with the accused maid Maria Gambrelli, unwittingly turns a straightforward murder investigation into a comedic series of mishaps, testing the patience of his irritable boss Charles Dreyfus as casualties mount.",
                "popularity": 5.8364,
                "poster_path": "/pR6tNqNLYIbRRYC5TFKWVWaVvvK.jpg",
                "release_date": "1964-06-23",
                "title": "A Shot in the Dark",
                "video": false,
                "vote_average": 7.191,
                "vote_count": 588,
                "character": "Maria Gambrelli",
                "credit_id": "52fe4302c3a36847f8033af3",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Elke Sommer, born Elke  von Schletz, is a German actress, entertainer and artist, who has starred in many Hollywood films.  She was spotted by film director Vittorio De Sica while on holiday in Italy, and began appearing in films there in 1958.  Also that year, she changed her surname from Schletz to Sommer, which was easier to pronounce for a non-German audience.  She quickly became a noted sex symbol and moved to Hollywood in the early 1960s.  She also became one of the most popular pin-up girls of the time, and posed for several pictorials in Playboy magazine, including the September 1964 and December 1967 issues.  Sommer became one of the top film actresses of the 1960s.  She made just shy of 100 film and television appearances between 1959 and 2005, including A Shot in the Dark with Peter Sellers, The Art of Love with James Garner and Dick Van Dyke, The Oscar with Stephen Boyd, Boy Did I Get a Wrong Number! with Bob Hope, the Bulldog Drummond extravaganza Deadlier Than the Male, The Wrecking Crew with Dean Martin, and The Wicked Dreams of Paula Schultz.  In 1964, she won a Golden Globe award as Most Promising Newcomer Actress for The Prize, a film in which she co-starred with Paul Newman and Edward G. Robinson.\n\nA frequent guest on television, Sommer sang and participated in comedy sketches on episodes of The Dean Martin Show and on Bob Hope specials, made 10 appearances on The Tonight Show Starring Johnny Carson, and was a panelist on the Hollywood Squares game show many times between 1973 and 1980, when Peter Marshall was its \"Square-Master\", or host.  Sommer's films during the 1970s included the thriller Zeppelin, in which she co-starred with Michael York, and a remake of Agatha Christie's frequently filmed murder mystery Ten Little Indians. In 1972, she starred in two Italian horror films directed by Mario Bava: Baron Blood and Lisa and the Devil.  The latter was subsequently re-edited (with 1975 footage inserted) to make a different film called House of Exorcism.  Sommer went back to Italy to act in additional scenes for Lisa and the Devil, which its producer inserted into the film to convert it to House of Exorcism, against the wishes of the director.\n\nIn 1975, Peter Rogers cast her in the British comedy Carry On Behind as the Russian Professor Vrooshka.[2] She became the Carry On films' joint highest-paid performer, at £30,000; this was an honor that she shared with Phil Silvers (who starred in Follow That Camel).\n\nMost of her movie work during the decade came in European films. After the 1979 comedy The Prisoner of Zenda, which reunited her with Sellers, the actress did virtually no more acting in Hollywood films, concentrating more on her artwork.  She provided the voice for Yzma in the German release of The Emperor's New Groove.\n\nSommer also performed as a singer, recording and releasing several albums.\n\nDescription above from the Wikipedia article Elke Sommer, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1940-11-05",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.elkesommeronline.com/",
        "id": 17844,
        "imdb_id": "nm0813961",
        "known_for_department": "Acting",
        "name": "Elke Sommer",
        "place_of_birth": "Berlin, Germany",
        "popularity": 0.5716,
        "profile_path": "/8xkl8985aLTtX9mC8iXHdrAEO7A.jpg"
    }
}