{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kEhCztSTP4ixu7R0AIWg8vvcvbb.jpg",
                "genre_ids": [
                    28,
                    12,
                    10752
                ],
                "id": 948713,
                "original_language": "en",
                "original_title": "The Last Kingdom: Seven Kings Must Die",
                "overview": "In the wake of King Edward's death, Uhtred of Bebbanburg and his comrades adventure across a fractured kingdom in the hopes of uniting England at last.",
                "popularity": 4.7232,
                "poster_path": "/qcNDxDzd5OW9wE3c8nWxCBQoBrM.jpg",
                "release_date": "2023-04-14",
                "title": "The Last Kingdom: Seven Kings Must Die",
                "video": false,
                "vote_average": 7.246,
                "vote_count": 749,
                "character": "Dunstan",
                "credit_id": "6409ad7c31644b007c9dd3f9",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Thomas Christian"
        ],
        "biography": "Tom Christian is a Liverpool-born, London-raised actor with a wide range of TV credits to his name.  2025 sees him with a major role playing DI Tommy Jardine, in the ITV thriller series 'Protection' about the murder of a family in witness protection, starring Siobhan Finneran and Katherine Kelly.  In 2023 he guest starred in Silent Witness as Philip, the son of a landowner, whose family gets caught up a train crash on their land.  And he played Dunstan in the 2023 feature length Netflix film 'Seven Kings Must Die', the finale to The Last Kingdom Netflix series.  In 2022 he played Ash in ITV's prime time drama 'The Walk-In' which starred Stephen Graham.  Also in 2022 he appeared in the BBC’s true crime drama series ‘Four Lives’ as well as ITV’s detective drama ‘Grace’.  In 2021 he appeared as Sir Henry Stafford in Sky History’s 3 part docu-drama ‘Royal B**tards: Rise of the Tudors’.  In 2020 he had a recurring role in ITV’s award-winning crime series ‘White House Farm’ which was based on the true story of a series of brutal murders in Essex and starred Stephen Graham and Freddie Fox.  The show won Best New Drama at the TV Choice Awards and was also nominated for an RTS Award.  He has had roles in many notable TV shows including Belgravia: The Next Chapter, Bridgerton, Gangs of London, Harlots, Mr Selfridge, Call the Midwife and Grantchester.  He also appeared in ITV’s ‘Hatton Garden’ which starred Timothy Spall, as well as Channel 4’s ‘Chimerica’.  He played regular character Brandon Boone in a number of episodes of E!’s soap opera ‘The Royals’, based on a modern, fictional Royal Family and which starred Elizabeth Hurley.  He also appeared as Agent Nash in the limited series ‘24: Live Another Day’ on Sky/Fox.  Born in Liverpool, he has both a native Liverpudlian accent, as well as a native East London accent picked up from his later years in London.  He can do an excellent neutral British accent plus a native standard generic American accent (used in Chimerica, American Odyssey and 24), as well as Southern/East Coast American accents.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://anthearepresents.com/artist/tom-christian",
        "id": 1786096,
        "imdb_id": "nm5276849",
        "known_for_department": "Acting",
        "name": "Tom Christian",
        "place_of_birth": "Liverpool, Merseyside, England, UK",
        "popularity": 0.2915,
        "profile_path": "/iI7CamrahYTLKBLBjsi9xmBIJ74.jpg"
    }
}