{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cDtefl7KGnKrDziEUXetMnztvqr.jpg",
                "genre_ids": [
                    28,
                    53
                ],
                "id": 1573,
                "original_language": "en",
                "original_title": "Die Hard 2",
                "overview": "One year after his heroics in Los Angeles, John McClane is an off-duty cop who is the wrong guy in the wrong place at the wrong time. On a snowy Christmas Eve, as he waits for his wife's plane to land at Washington Dulles International Airport, terrorists take over the air traffic control system in a plot to free a South American army general and drug smuggler being flown into the US to face drug charges. It's now up to McClane to take on the terrorists, while coping with an inept airport police chief, an uncooperative anti-terrorist squad, and the life of his wife and everyone else trapped in planes circling overhead.",
                "popularity": 9.1571,
                "poster_path": "/lDFO7D4MdbhjOwaPwe18QG69Rt0.jpg",
                "release_date": "1990-07-03",
                "title": "Die Hard 2",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 6088,
                "character": "Trudeau",
                "credit_id": "52fe42ffc3a36847f8032a69",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/ntgpger7OwFNlEldxuvvFHDKzjW.jpg",
                "genre_ids": [
                    18,
                    80,
                    53
                ],
                "id": 1598,
                "original_language": "en",
                "original_title": "Cape Fear",
                "overview": "Sam Bowden is a small-town corporate attorney. Max Cady is a tattooed, cigar-smoking, Bible-quoting, psychotic rapist. What do they have in common? 14 years ago, Sam was a public defender assigned to Max Cady's rape trial, and he made a serious error: he hid a document from his illiterate client that could have gotten him acquitted. Now, the cagey Cady has been released, and he intends to teach Sam Bowden and his family a thing or two about loss.",
                "popularity": 4.9025,
                "poster_path": "/meJZAAuVcjic2ipvbOPz5UlE4P9.jpg",
                "release_date": "1991-11-13",
                "title": "Cape Fear",
                "video": false,
                "vote_average": 7.251,
                "vote_count": 3631,
                "character": "Tom Broadbent",
                "credit_id": "52fe4303c3a36847f8033d75",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/xwVkihNJYn6wR8Sip1aoIz5ax35.jpg",
                "genre_ids": [
                    28,
                    12,
                    53
                ],
                "id": 1669,
                "original_language": "en",
                "original_title": "The Hunt for Red October",
                "overview": "A new technologically-superior Soviet nuclear sub, the Red October, is heading for the U.S. coast under the command of Captain Marko Ramius. The American government thinks Ramius is planning to attack. Lone CIA analyst Jack Ryan has a different idea: he thinks Ramius is planning to defect, but he has only a few hours to find him and prove it - because the entire Russian naval and air commands are trying to find Ramius, too. The hunt is on!",
                "popularity": 5.5254,
                "poster_path": "/yVl7zidse4KiWtGMqHFtZCx4X3N.jpg",
                "release_date": "1990-03-02",
                "title": "The Hunt for Red October",
                "video": false,
                "vote_average": 7.376,
                "vote_count": 3445,
                "character": "Rear ADM Joshua Painter (Enterprise Carrier Battle Group)",
                "credit_id": "52fe430ac3a36847f8036077",
                "order": 14
            },
            {
                "adult": false,
                "backdrop_path": "/9F6zZuETJWUtkcSEnOc0JLqBHAK.jpg",
                "genre_ids": [
                    53,
                    18
                ],
                "id": 10083,
                "original_language": "en",
                "original_title": "No Way Out",
                "overview": "Navy Lt. Tom Farrell meets a young woman, Susan Atwell , and they share a passionate fling. Farrell then finds out that his superior, Defense Secretary David Brice, is also romantically involved with Atwell. When the young woman turns up dead, Farrell is put in charge of the murder investigation. He begins to uncover shocking clues about the case, but when details of his encounter with Susan surface, he becomes a suspect as well.",
                "popularity": 5.5456,
                "poster_path": "/93CzsBvRhg035yvQosRtSsTL19v.jpg",
                "release_date": "1987-08-14",
                "title": "No Way Out",
                "video": false,
                "vote_average": 6.88,
                "vote_count": 752,
                "character": "CIA Director Marshall",
                "credit_id": "52fe43209251416c7500487f",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/zYM9IbF08gB1Ip3Qee19HPvNY8T.jpg",
                "genre_ids": [
                    28,
                    18,
                    53,
                    80,
                    9648
                ],
                "id": 9386,
                "original_language": "en",
                "original_title": "In the Line of Fire",
                "overview": "Veteran Secret Service agent Frank Horrigan is a man haunted by his failure to save President Kennedy while serving protection detail in Dallas. Thirty years later, a man calling himself \"Booth\" threatens the life of the current President, forcing Horrigan to come back to protection detail to confront the ghosts from his past.",
                "popularity": 4.1806,
                "poster_path": "/3NvOFpmyECI3DNExYMtFIRcGMsu.jpg",
                "release_date": "1993-07-08",
                "title": "In the Line of Fire",
                "video": false,
                "vote_average": 6.965,
                "vote_count": 1685,
                "character": "Harry Sargent",
                "credit_id": "52fe44f0c3a36847f80b314b",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/y2QZ8qCE4YWHo5hGYos26Jy5Req.jpg",
                "genre_ids": [
                    18
                ],
                "id": 39486,
                "original_language": "en",
                "original_title": "Secretariat",
                "overview": "Housewife and mother Penny Chenery agrees to take over her ailing father's Virginia-based Meadow Stables, despite her lack of horse-racing knowledge. Against all odds, Chenery - with the help of veteran trainer Lucien Laurin - manages to navigate the male-dominated business, ultimately fostering the first Triple Crown winner in 25 years.",
                "popularity": 2.5097,
                "poster_path": "/6YJ39NqRJ0ljUQohizHmE2hB6Wh.jpg",
                "release_date": "2010-08-20",
                "title": "Secretariat",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 614,
                "character": "Bull Hancock",
                "credit_id": "52fe471e9251416c9106a9ab",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Fred Dalton Thompson",
            "Senator Fred Thompson"
        ],
        "biography": "Freddie Dalton 'Fred' Thompson (August 19, 1942 - November 1, 2015), credited as Fred Thompson and Fred Dalton Thompson, is an American politician, actor, attorney, lobbyist, columnist, and radio host. He served as a Republican U.S. Senator from Tennessee from 1994 through 2003. He served as chairman of the International Security Advisory Board at the United States Department of State, was a member of the U.S.-China Economic and Security Review Commission, a member of the Council on Foreign Relations, and is a Visiting Fellow with the American Enterprise Institute, specializing in national security and intelligence.\n\nAs an actor, he has appeared in a large number of movies and television shows. He has frequently portrayed governmental figures. In the final months of his U.S. Senate term in 2002, he joined the cast of the long-running NBC television series Law & Order, playing Manhattan District Attorney Arthur Branch. In May 2007, he took a break from acting in order to run for the 2008 Republican presidential nomination. In 2009, he returned to acting with a guest appearance on television series; and co-starred with Brian Dennehy in the movie Alleged, about the Scopes Monkey Trial.\n\nFrom Wikipedia, the free encyclopedia.",
        "birthday": "1942-08-19",
        "deathday": "2015-11-01",
        "gender": 2,
        "homepage": null,
        "id": 17874,
        "imdb_id": "nm0000669",
        "known_for_department": "Acting",
        "name": "Fred Thompson",
        "place_of_birth": "Sheffield, Alabama, U.S.",
        "popularity": 0.5156,
        "profile_path": "/d3x9crhTbzHaVA2OEsRu1YxirBG.jpg"
    }
}