{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tEhvOU8nJp4v9goYwrJTASJJD3C.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 1791,
                "original_language": "fr",
                "original_title": "La Pianiste",
                "overview": "Erika Kohut, a sexually repressed piano teacher living with her domineering mother, meets a young man who starts romantically pursuing her.",
                "popularity": 5.1693,
                "poster_path": "/gNHKYQnP1RnqEhkivHJzBPb4MOP.jpg",
                "release_date": "2001-09-05",
                "title": "The Piano Teacher",
                "video": false,
                "vote_average": 7.261,
                "vote_count": 1176,
                "character": "Erika Kohut",
                "credit_id": "52fe4315c3a36847f8039123",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/6TmdYhlnM7OEITeuzcrX8XVlnp2.jpg",
                "genre_ids": [
                    35,
                    53,
                    9648
                ],
                "id": 1958,
                "original_language": "fr",
                "original_title": "8 femmes",
                "overview": "Eight women gather to celebrate Christmas in a snowbound cottage, only to find the family patriarch dead with a knife in his back. Trapped in the house, every woman becomes a suspect, each having her own motive and secret.",
                "popularity": 1.355,
                "poster_path": "/bJu4Gm7NQb2woPiIovrPD5jNWzf.jpg",
                "release_date": "2002-02-06",
                "title": "8 Women",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 1017,
                "character": "Augustine",
                "credit_id": "52fe4326c3a36847f803e0f9",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/w7Z4BVMin49voNN61IUWyN9DopV.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 86837,
                "original_language": "fr",
                "original_title": "Amour",
                "overview": "Georges and Anne are in their eighties. They are cultivated, retired music teachers. Their daughter, who is also a musician, lives abroad with her family. One day, Anne has a stroke, and the couple's bond of love is severely tested.",
                "popularity": 3.2873,
                "poster_path": "/19hyCudualHxCD0GrEngqsi0wBF.jpg",
                "release_date": "2012-09-20",
                "title": "Amour",
                "video": false,
                "vote_average": 7.756,
                "vote_count": 1690,
                "character": "Eva",
                "credit_id": "52fe49a49251416c910b3d75",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Isabelle Anne Madeleine Huppert",
            "Isabelle Ann Huppert",
            "이자벨 위페르",
            "伊莎贝尔•于佩尔",
            "Isabelle Madeleine Huppert",
            "Isabelle Anne Huppert",
            "Isabelle Ann Madeleine Huppert",
            " Ізабель Юппер",
            "ایزابل هوپر",
            "伊莎貝雨蓓"
        ],
        "biography": "Isabelle Anne Madeleine Huppert (born 16 March 1953) is a French actress. Described as \"one of the best actresses in the world\", she is known for her portrayals of cold and disdainful characters devoid of morality. Nominated for a record sixteen César Awards, she has won two. Among other accolades, she has received six Lumières Award nominations, more than any other person, and won four. In 2020, The New York Times ranked her second on its list of the greatest actors of the 21st century.\n\nHuppert's first César nomination was for the 1975 film Aloïse. In 1978, she won the BAFTA Award for Most Promising Newcomer for The Lacemaker. She went on to win two Best Actress awards at the Cannes Film Festival, for Violette Nozière (1978) and The Piano Teacher (2001), as well as two Volpi Cups for Best Actress at the Venice Film Festival, for Story of Women (1988) and La Cérémonie. Her other films in France include Loulou (1980), La Séparation (1994), 8 Women (2002), Gabrielle (2005), Amour (2012), and Things to Come (2016). Among international film's most prolific actresses, Huppert has worked in Italy, Russia, Central Europe, and in Asia. Her English-language films include: Heaven's Gate (1980), The Bedroom Window (1987), I Heart Huckabees (2004), The Disappearance of Eleanor Rigby (2013), Louder Than Bombs (2015), Greta (2018), and Frankie (2019).\n\nIn 2016, Huppert garnered international acclaim for her performance in Elle, which earned her a Golden Globe Award, an Independent Spirit Award and a nomination for the Academy Award for Best Actress. She also won Best Actress awards from the National Society of Film Critics, New York Film Critics Circle and the Los Angeles Film Critics Association, for both Elle and Things to Come.\n\nAlso a prolific stage actress, Huppert is the most nominated actress for the Molière Award, with seven nominations. She made her London stage debut in the title role of the play Mary Stuart in 1996, and her New York stage debut in a 2005 production of 4.48 Psychosis. She returned to the New York stage in 2009 to perform in Heiner Müller's Quartett, and in 2014 to star in a Sydney Theatre Company production of The Maids. In 2019, Huppert starred in Florian Zeller's The Mother at the Atlantic Theater Company in New York.\n\nDescription above from the Wikipedia article Isabelle Huppert, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1953-03-16",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 17882,
        "imdb_id": "nm0001376",
        "known_for_department": "Acting",
        "name": "Isabelle Huppert",
        "place_of_birth": "Parc Montsouris, Paris, France",
        "popularity": 1.1176,
        "profile_path": "/3YQwWkpNKQeV5NUmdCH76Ne1gDP.jpg"
    }
}