{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/vjsFyeCf5W5rxCFpS9MIAEZJkIG.jpg",
                "genre_ids": [
                    18
                ],
                "id": 1600,
                "original_language": "fr",
                "original_title": "La Double Vie de Véronique",
                "overview": "Véronique is a beautiful young French woman who aspires to be a renowned singer; Weronika lives in Poland, has a similar career goal and looks identical to Véronique, though the two are not related. The film follows both women as they contend with the ups and downs of their individual lives, with Véronique embarking on an unusual romance with Alexandre Fabbri, a puppeteer who may be able to help her with her existential issues.",
                "popularity": 3.5659,
                "poster_path": "/oqRyO9xrNBRaxqF9pCHHgLuaATx.jpg",
                "release_date": "1991-05-15",
                "title": "The Double Life of Véronique",
                "video": false,
                "vote_average": 7.481,
                "vote_count": 838,
                "character": "Serge",
                "credit_id": "52fe4303c3a36847f8033ecd",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/ll1d1AXoQganpzphgUVuWGo3Nmi.jpg",
                "genre_ids": [
                    35
                ],
                "id": 112198,
                "original_language": "fr",
                "original_title": "Le Prénom",
                "overview": "Vincent, a wealthy real estate agent, is invited to dinner by his sister Elizabeth and her husband Peter, both professors in Paris. Claude, a childhood friend and trombonist in a symphony orchestra, is also present. Vincent brings news from the prenatal examination of his and his wife Anna's unborn son.  The name chosen by the soon-to-be parents strongly offends the others for many reasons. The dispute between the guests quickly escalates and before long the resurgence of old grudges and hidden secrets is unavoidable ...",
                "popularity": 2.4116,
                "poster_path": "/5xKkDkv506CiSp99SxmHLsnaoFs.jpg",
                "release_date": "2012-04-25",
                "title": "What's in a Name",
                "video": false,
                "vote_average": 7.32,
                "vote_count": 1738,
                "character": "Claude",
                "credit_id": "52fe4b11c3a36847f81f09db",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Guillaume de Tonquedec"
        ],
        "biography": "Guillaume Emmanuel Marie de Quengo de Tonquédec (born 18 October 1966) is a French stage, television and film actor. He first earned fame in his homeland for his role as Renaud Lepic in the TV series Fais pas ci, fais pas ça (2007–2017) on France 2, before winning the César Award for Best Supporting Actor for his performance in What's in a Name? in 2013. De Tonquédec was made a Knight in the Ordre des Arts et des Lettres in 2015 by Minister of Culture Fleur Pellerin.  A native of Paris, Guillaume de Tonquédec grew up in Louveciennes. He studied economics and English at Paris Nanterre University until he joined the Conservatoire national supérieur d'art dramatique in Paris in 1986 for a three-year programme. In 1989, he began his stage career with a national tour in John Millington Synge's The Playboy of the Western World.\n\nHe gained recognition in film in Krzysztof Kieslowski's The Double Life of Veronique (1991), followed by his role as Claude Jade's son Jules Martin in List of Merite (1992). In 1996, he starred in Raúl Ruiz's Three Lives and Only One Death.\n\nIn 2007, De Tonquédec started starring in the successful TV series Fais pas ci, fais pas ça, which propelled him to stardom in France alongside fellow actors Valérie Bonneton, Isabelle Gélinas and Bruno Salomone. In 2013, he won the César Award for Best Supporting Actor for his role as Claude Gatignol in What's in a Name?. Co-star Valérie Benguigui won the César Award for Best Supporting Actress for her role as Élisabeth Garraud-Larchet. De Tonquédec had been nominated two years prior for the Molière Award for Best Supporting Actor for the same role he held in the eponymous play in Paris's Théâtre Édouard VII, upon which the film was based.\n\nHe was subsequently nominated twice for the Molière Award for Best Actor, in 2017 and 2020.\n\nGuillaume de Tonquédec, whose ancestors owned the Château de Tonquédec in Brittany from 1626 to 1801 and again from 1828 until 1878, is married to interior designer Christèle Marchal. They reside in L'Étang-la-Ville, Yvelines. They have three children: Amaury, Timothé and Victoire.\n\nSource: Article \"Guillaume de Tonquédec\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1966-10-18",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 17896,
        "imdb_id": "nm0211956",
        "known_for_department": "Acting",
        "name": "Guillaume de Tonquédec",
        "place_of_birth": "Paris, France",
        "popularity": 0.3269,
        "profile_path": "/mDPeqkKJgFMiH60gH32VTwgOHSp.jpg"
    }
}