{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/krYelh3x8VdSeAqOSd81NTek1aw.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 1607,
                "original_language": "en",
                "original_title": "A Bronx Tale",
                "overview": "Set in the Bronx during the tumultuous 1960s, an adolescent boy is torn between his honest, working-class father and a violent yet charismatic crime boss. Complicating matters is the youngster's growing attraction - forbidden in his neighborhood - for a beautiful black girl.",
                "popularity": 10.2648,
                "poster_path": "/sDbO6LmLYtyqAoFTPpRcMgPSCEO.jpg",
                "release_date": "1993-10-01",
                "title": "A Bronx Tale",
                "video": false,
                "vote_average": 7.876,
                "vote_count": 2672,
                "character": "Calogero 'C' Anello (Age 17)",
                "credit_id": "52fe4303c3a36847f8033fe5",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/qKWQ9IEDkMawD7sgKnIGCdFAhct.jpg",
                "genre_ids": [
                    53,
                    28,
                    18,
                    10752
                ],
                "id": 8963,
                "original_language": "en",
                "original_title": "Crimson Tide",
                "overview": "After the Cold War, a breakaway Russian republic with nuclear warheads becomes a possible worldwide threat. U.S. submarine Capt. Frank Ramsey signs on a relatively green but highly recommended Lt. Cmdr. Ron Hunter to the USS Alabama, which may be the only ship able to stop a possible Armageddon. When Ramsey insists that the Alabama must act aggressively, Hunter, fearing they will start rather than stop a disaster, leads a potential mutiny to stop him.",
                "popularity": 6.0646,
                "poster_path": "/21nqRJ6ofEgVvEl68J4O9V26Xzy.jpg",
                "release_date": "1995-05-12",
                "title": "Crimson Tide",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 1868,
                "character": "Petty Officer Third Class Russell Vossler",
                "credit_id": "52fe44ccc3a36847f80aa831",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/lPLTLCBn39Wiy1RPQLB9xOKyF2v.jpg",
                "genre_ids": [
                    28,
                    18,
                    53
                ],
                "id": 9798,
                "original_language": "en",
                "original_title": "Enemy of the State",
                "overview": "The life of labor lawyer and dedicated family man Robert 'Bobby' Dean is turned upside down after a chance meeting with a college buddy while holiday shopping. Unbeknownst to Dean, he's just been burdened with a videotape of a congressman's assassination. Hot on the trail of this tape is a ruthless group of National Security Agents commanded by a belligerently ambitious NSA official named Reynolds. Using satellite surveillance, bugs, and other sophisticated snooping devices, the NSA infiltrates every facet of Dean's existence, tracing each physical and digital footprint he leaves while also framing him for murder. With the help of the mysterious Brill, he attempts to throw the NSA off his trail and prove his innocence.",
                "popularity": 5.9231,
                "poster_path": "/x9pXrMKLsBGGOFyyZ0Gwt9YpVub.jpg",
                "release_date": "1998-11-20",
                "title": "Enemy of the State",
                "video": false,
                "vote_average": 7.056,
                "vote_count": 4033,
                "character": "Young Worker",
                "credit_id": "587b77b39251413e9200e8ee",
                "order": 27
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Lillo Brancato Jr.",
            "لیلو برانکاتو"
        ],
        "biography": "Lillo Brancato, Jr. (born March 30, 1976) is a Colombian-born American actor, known for his performance as Calogero 'C' Anello in Robert De Niro's 1993 directorial debut, A Bronx Tale. He's also known for his role as radio operator Russell Vossler in Crimson Tide (1995), and as Benitez in Renaissance Man (1994). He also portrayed Matthew Bevilaqua, a young mobster on The Sopranos.  In December 2005, Brancato was charged with second-degree murder for his role in a burglary in the Bronx, New York. Authorities say that an off-duty police officer, Daniel Enchautegui, confronted two burglars and was killed in a shootout. Brancato was subsequently acquitted of murder, but he was convicted of first-degree attempted burglary and was sentenced to 10 years in prison. Co-defendant Steven Armento was convicted of firing the fatal shot. On December 31, 2013, he was released on parole.\n\nHe has continued to appear in movies.",
        "birthday": "1976-03-30",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 17917,
        "imdb_id": "nm0000969",
        "known_for_department": "Acting",
        "name": "Lillo Brancato",
        "place_of_birth": "Bogotá, Colombia",
        "popularity": 0.5625,
        "profile_path": "/vUIga1je7MRsPSeJJvmtIpxfyRo.jpg"
    }
}