{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2tsmTWJsR81cwwZHLE85vPxSCoR.jpg",
                "genre_ids": [
                    53,
                    80,
                    18
                ],
                "id": 320,
                "original_language": "en",
                "original_title": "Insomnia",
                "overview": "Two Los Angeles homicide detectives are dispatched to a northern town where the sun doesn't set to investigate the methodical murder of a local teen.",
                "popularity": 4.2181,
                "poster_path": "/riVXh3EimGO0y5dgQxEWPRy5Itg.jpg",
                "release_date": "2002-05-24",
                "title": "Insomnia",
                "video": false,
                "vote_average": 6.953,
                "vote_count": 4965,
                "character": "Rich",
                "credit_id": "52fe4237c3a36847f800cf01",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Winner of Best Performance, Animation at the 2021 Canadian Screen Awards as Corner Gas Animated (2018)'s Sergeant Davis Quinton. Lorne is well-known for his portrayal of this beloved character in the Corner Gas comedy franchise - now in 60 countries worldwide - including the animated series and 6 seasons of the original International Emmy-nominated live-action comedy series Corner Gas (2004) and feature Corner Gas: The Movie (2014).\n\nLorne has the rare honor of having a theatre space named after him in the rebuilt Roxy Theatre in Edmonton Alberta. The Lorne Cardinal Theatre is scheduled to open November 2021.\n\nA classically trained actor, Lorne has also performed in, and directed, a diverse range of theatre productions such as King Lear, on Canada's premiere A-house stage at the National Arts Centre, and Black Elk Speaks at the Denver Center.\n\nHis work includes executive producing and directing, and he's received numerous nominations and distinguished awards for his body of work and is the recipient of an honorary PhD from Thompson Rivers University.\n\nAdditionally, he's a sought after voice actor for clients like Penguin Randomhouse, Canada's Museum of Civilization and projects such as The Great Northern Candy Drop (2017), Open Season: Scared Silly (2015) and Peabody award-winner Molly of Denali (2019).",
        "birthday": "1964-01-06",
        "deathday": null,
        "gender": 2,
        "homepage": "https://lornecardinal.wordpress.com/",
        "id": 179495,
        "imdb_id": "nm0136482",
        "known_for_department": "Acting",
        "name": "Lorne Cardinal",
        "place_of_birth": "Sucker Creek, Alberta, Canada",
        "popularity": 0.2415,
        "profile_path": "/b8La23LFwNPXEMnRDoqbIssB8nJ.jpg"
    }
}