{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8ln5VUVk7gnNGIb2VNgw8nICDVt.jpg",
                "genre_ids": [
                    16,
                    35,
                    10751
                ],
                "id": 35,
                "original_language": "en",
                "original_title": "The Simpsons Movie",
                "overview": "After Homer accidentally pollutes the town's water supply, Springfield is encased in a gigantic dome by the EPA and the Simpsons are declared fugitives.",
                "popularity": 7.0217,
                "poster_path": "/gzb6P78zeFTnv9eoFYnaJ2YrZ5q.jpg",
                "release_date": "2007-07-25",
                "title": "The Simpsons Movie",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 8276,
                "character": "TV Dad (voice)",
                "credit_id": "52fe4211c3a36847f800162b",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Philip Rosenthal"
        ],
        "biography": "Philip Rosenthal (born 1960) is an American television writer and producer who is best known as the creator, writer and executive producer for the sitcom Everybody Loves Raymond (1996–2005). The show was co-produced by Ray Romano, and based in part on Romano's comedy material. Rosenthal's wife, actress Monica Horan, played the role of Amy MacDougall-Barone, the off and on girlfriend (wife after season 7) of Robert Barone (Brad Garrett) in Raymond.\n\nIt was Rosenthal and Romano who decided to retire the series over the objections or reservations of the other cast members.\n\nRosenthal was born in Queens, New York, but spent most of his childhood living in New City, New York located in Rockland County. He attended Clarkstown North High School where he became very active in the school's drama club, Cue 'N Curtain. During his four years at Clarkstown, Rosenthal acted in many high school plays. Among his fellow schoolmates were future television producer Alan Kirschenbaum (Yes, Dear) and New York politician Richard Holbrook. Rosenthal graduated from Clarkstown North in 1977. From there, he attended Hofstra University, where he graduated in 1981. In the early 1980s, he was an actor based out of New York City before shifting his focus to production work, becoming the writer and producer of such shows as Coach with Craig T. Nelson and the short-lived Baby Talk. However, Rosenthal occasionally appears in acting roles as evidenced by a role in James L. Brooks' Spanglish as a business colleague of Adam Sandler's character. Rosenthal also had a minor role in 2007's The Simpsons Movie, a big screen adaption of the long running TV series which was also produced by Brooks and his company, Gracie Films. Rosenthal voiced the line \"Here we are kids... the Grand Canyon,\" in the fake TV ad that Tom Hanks was filming for the United States Government in support of the \"new\" Grand Canyon in the film. Producers liked the line and Rosenthal asked if he could perform the part. He has also appeared in Curb Your Enthusiasm, 30 Rock, and Jake Kasdan’s feature, The TV Set.\n\nPhil is the author of the book You're Lucky You're Funny: How Life Becomes a Sitcom which was released on October 21, 2006. Phil recounts how his hilarious life led to one of the most successful shows in history.\n\nRosenthal has the distinction of having directed President Bill Clinton in the White House Correspondents' Dinner video, which was shown to wide acclaim at the April 2000 event.\n\nHe co-wrote the “America: A Tribute to Heroes”, the 9/11 telethon which aired on all four networks, won a Peabody Award and an Emmy nomination for Outstanding Writing.\n\nHe has completed his first feature for Sony Pictures: Exporting Raymond, which he wrote and directed, the true story about the attempt to turn Everybody Loves Raymond into a successful Russian sitcom, where he served as a consultant. Much of the documentary centers on his struggle with the country's unusual cultural aspects and developing relationships with the show's cast and crew, despite little to no knowledge with the Russians' sense of humor.\n\nDescription above from the Wikipedia article Philip Rosenthal, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1960-06-27",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 179632,
        "imdb_id": "nm0742814",
        "known_for_department": "Writing",
        "name": "Phil Rosenthal",
        "place_of_birth": "Queens, New York City, New York, USA",
        "popularity": 0.1627,
        "profile_path": "/rR1dZHdTuCsw7wWsGbzdroaggjy.jpg"
    }
}