{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/j7KqDRzjbvIjDv7cdHz9G3ZYEQy.jpg",
                "genre_ids": [
                    27,
                    28,
                    53
                ],
                "id": 1233413,
                "original_language": "en",
                "original_title": "Sinners",
                "overview": "Trying to leave their troubled lives behind, twin brothers return to their hometown to start again, only to discover that an even greater evil is waiting to welcome them back.",
                "popularity": 26.8328,
                "poster_path": "/4CkZl1LK6a5rXBqJB2ZP77h3N5i.jpg",
                "release_date": "2025-04-16",
                "title": "Sinners",
                "video": false,
                "vote_average": 7.548,
                "vote_count": 2539,
                "character": "Bert",
                "credit_id": "6632b155d55c3d0126f2a222",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Peter Dreams"
        ],
        "biography": "The basic structural facts of rock band July Talk are this: two front people, Leah Fay Goldstein and Peter Dreimanis, surrounded by whiplashing guitarists Ian Docherty and Josh Warburton, and double drummers Danny Miles and Dani Nash. For this compulsively DIY, rigorously self-realizing group, the essence of July Talk has always been the tension between precision and chaos. To understand this tension, we can reduce it to sets of twos, or we can magnify it and look deeper as to why we feel the need to frame it one way or the other. What we see says more about what we’re looking for. With July Talk, as with most things, what have we missed?  We need not ask what July Talk’s two writhing frontpeople’s relationship is to each other, but rather what their relationship is to us, their audience, and to the world, this tender, villainous, confounding world. These bodies welcome our gaze, they revel and recoil in it while they furiously push back, asking of us what they ask of each other: please see me for who I am. If we see July Talk as a woman and a man, in opposition to one another, what we are seeing is our own projections upon these bodies.\n\nWhat goes on between these bodies, all of them, that kinetic, staticky, sticky space, is where the truth of July Talk takes shape. On stage, July Talk unfurls and explodes. The action pings from slo-motion commotion to back-bendy communion, fluid (as in bodily) and liquid (as in the dark goo phase of metamorphosis). Things get weird, occasionally grotesque, always enthralling. Each show offers moments of grace that reveal for a moment the inner workings of this unknowable universe. Hold onto those until the next time.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "http://julytalk.com",
        "id": 1805225,
        "imdb_id": "nm3227763",
        "known_for_department": "Acting",
        "name": "Peter Dreimanis",
        "place_of_birth": "Edmonton, Alberta, Canada",
        "popularity": 0.0256,
        "profile_path": "/lMqeuP0G9Gqvei6eJ65xabNkz5Y.jpg"
    }
}