{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tMkziWBEHwXs0jdFhOrrW7oCPmR.jpg",
                "genre_ids": [
                    27,
                    14,
                    18
                ],
                "id": 310131,
                "original_language": "en",
                "original_title": "The Witch",
                "overview": "In 1630, a farmer relocates his family to a remote plot of land on the edge of a forest where strange, unsettling things happen. With suspicion and paranoia mounting, each family member's faith, loyalty and love are tested in shocking ways.",
                "popularity": 6.1289,
                "poster_path": "/zap5hpFCWSvdWSuPGAQyjUv2wAC.jpg",
                "release_date": "2016-02-19",
                "title": "The Witch",
                "video": false,
                "vote_average": 6.992,
                "vote_count": 7336,
                "character": "Coven Witch",
                "credit_id": "590348a59251413e3800b1ce",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Brandy Leary creates contemporary performances through the body. Active as a performer, creator, collaborator and curator in the fields of dance and circus, she is the artistic director of Anandam Dancetheatre. Her performance works have been produced and performed in Canada, Europe, India, South Africa and the United States in theatres, urban environments, festivals, museums, art galleries and isolated landscapes.\n\nShe has lived between Canada and India for the past eighteen years training, collaborating and creating (both explicitly and implicitly) in the traditional Indian performing languages of Seraikella and Mayurbhanj Chhau (dance), Kalarippayattu (martial art) and Rope Mallakhamb (aerial rope). In Canada she works with western approaches to aerial rope, post contemporary dance/circus practices and psychic/shamanistic explorations to create performances.\n\nBrandy is a founder and Co-Director of Collective Space (an alternative performance and rehearsal venue in Toronto’s west end), founder and Co-Artistic Director of CCAFT (Contemporary Circus Arts Festival of Toronto), developer of Anandam’s Audience In Residence Program and curator/co-producer of the Body Brake series at Theatre Passe Muraille and co curator of  the new Contemporaneity series with Soraya Peerbaye.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "https://thedancecurrent.com/contributor/brandy-leary/",
        "id": 1805889,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Brandy Leary",
        "place_of_birth": " Toronto, Ontario, Canada",
        "popularity": 0.0071,
        "profile_path": "/rlBeoIX1JmPep6Mku3M3hDTSE6S.jpg"
    }
}