{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tMkziWBEHwXs0jdFhOrrW7oCPmR.jpg",
                "genre_ids": [
                    27,
                    14,
                    18
                ],
                "id": 310131,
                "original_language": "en",
                "original_title": "The Witch",
                "overview": "In 1630, a farmer relocates his family to a remote plot of land on the edge of a forest where strange, unsettling things happen. With suspicion and paranoia mounting, each family member's faith, loyalty and love are tested in shocking ways.",
                "popularity": 6.1289,
                "poster_path": "/zap5hpFCWSvdWSuPGAQyjUv2wAC.jpg",
                "release_date": "2016-02-19",
                "title": "The Witch",
                "video": false,
                "vote_average": 6.992,
                "vote_count": 7336,
                "character": "Coven Witch",
                "credit_id": "590348cd9251413e2100b19a",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Hope Terry",
            "R. Hope Terry"
        ],
        "biography": "Rebecca Hope Terry writes from the inside to out. When not writing, she is sculpting, or you may find her running through the wilds of Dundas Valley, digging up roots and foraging for mushrooms. She currently lives in Dundas, Ontario.\n\nHer first piece of public writing was a review of a Contemporary Dance piece in Vancouver, 1991. Her one woman show, which she wrote and performed in, was produced by the Traverse Theatre in Edinburgh, Scotland and co- produced by Volcano Theatre Company.\n\nMost recently, ​her short creative non-fiction piece, “Mom in a Jar”, was published by Feels zine. She is currently editing her memoir.\n\nurrently in her 34th year of performing, she is a versatile and respected artist throughout Canada, and has performed in over 100 theatres, in Canada and internationally. Her own creations have been presented throughout Canada, Britain and Scotland. She is the recipient of numerous Arts Council awards, including Dora nominations for best performance.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.rebeccahopeterry.com/",
        "id": 1805890,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Rebecca Hope Terry",
        "place_of_birth": "Dundas, Ontario",
        "popularity": 0.062,
        "profile_path": "/5uubLTKus1AY1B1Yzh6cGeCVgS1.jpg"
    }
}