{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/67HggiWaP9ZLv5sPYmyRV37yAJM.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749
                ],
                "id": 13,
                "original_language": "en",
                "original_title": "Forrest Gump",
                "overview": "A man with a low IQ has accomplished great things in his life and been present during significant historic events—in each case, far exceeding what anyone imagined he could do. But despite all he has achieved, his one true love eludes him.",
                "popularity": 15.8646,
                "poster_path": "/arw2vcBveWOVZr6pxd9XTd1TdQa.jpg",
                "release_date": "1994-06-23",
                "title": "Forrest Gump",
                "video": false,
                "vote_average": 8.5,
                "vote_count": 28632,
                "character": "School Bus Boy",
                "credit_id": "638efd1604733f0085d04b99",
                "order": 20
            },
            {
                "adult": false,
                "backdrop_path": "/yFkUPqBuUnbhYbQL8VFpTrAT9za.jpg",
                "genre_ids": [
                    18,
                    878,
                    9648
                ],
                "id": 686,
                "original_language": "en",
                "original_title": "Contact",
                "overview": "A radio astronomer receives the first extraterrestrial radio signal ever picked up on Earth. As the world powers scramble to decipher the message and decide upon a course of action, she must make some difficult decisions between her beliefs, the truth, and reality.",
                "popularity": 6.4553,
                "poster_path": "/bCpMIywuNZeWt3i5UMLEIc0VSwM.jpg",
                "release_date": "1997-07-11",
                "title": "Contact",
                "video": false,
                "vote_average": 7.435,
                "vote_count": 4708,
                "character": "Major Russell's Son",
                "credit_id": "5908c6f8c3a3685859010102",
                "order": 51
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Alexander Zemeckis is an American business owner, president, and developer of addiction recovery programs, as well as a former child actor. He is the son of director Robert Zemeckis and actress Mary Ellen Trainor.\n\nAlex earned a Bachelor of Arts degree from San Diego State University and a Master’s Degree in Spiritual Psychology from the University of Santa Monica. He has worked in the addiction treatment & mental health communities helping young adults find new ways to live.\n\nThroughout his career, Alex has worked in various direct care and administrative roles including sober coaching and companion work, admissions, business development and outreach and as a residential mentor for a prominent treatment program in Colorado.\n\nIn 2013, he launched The Grounds Recovery (for men) in San Diego putting into action the skills and lessons he learned throughout his own personal and professional journey. After nearly 8 years of successfully working with men at The Grounds, Alex soon learned that there was a strong need for women’s aftercare programs. Thus, he launched Mare’s House as the female component to The Grounds Recovery. As president & owner of The Grounds & Mare’s House, Alex personally oversees the admissions and business development departments of both programs.",
        "birthday": "1985-12-11",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1808925,
        "imdb_id": "nm0954754",
        "known_for_department": "Acting",
        "name": "Alexander Zemeckis",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.2032,
        "profile_path": null
    }
}