{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6WRrGYalXXveItfpnipYdayFkQB.jpg",
                "genre_ids": [
                    18,
                    53,
                    80
                ],
                "id": 1422,
                "original_language": "en",
                "original_title": "The Departed",
                "overview": "To take down South Boston's Irish Mafia, the police send in one of their own to infiltrate the underworld, not realizing the syndicate has done likewise. While an undercover cop curries favor with the mob kingpin, a career criminal rises through the police ranks. But both sides soon discover there's a mole among them.",
                "popularity": 13.4795,
                "poster_path": "/nT97ifVT2J1yMQmeq20Qblg61T.jpg",
                "release_date": "2006-10-04",
                "title": "The Departed",
                "video": false,
                "vote_average": 8.159,
                "vote_count": 15527,
                "character": "French's Wife",
                "credit_id": "61f58103c5ada500681afb7f",
                "order": 65
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Sarah Fearon is a performing artist working as an actress, comedian and writer. She is a graduate of New York University and Performing Arts High School in New York. Some of her feature films credits include The Departed, Dancing in September, Liebestraum and Reversal of Fortune.\n\nAs a playwright, she has recently won first place in the Players Theater Short Play Festival for TED Talks NYC, that was also featured in the First Irish Festival at the Cell theater in New York. Her cult classic character, \"Snazzy Peabody,\" a real estate legend in her own mind, can be seen in many short films selling various locations anywhere from The Highline to the Brooklyn Bridge.\n\nAs a Board Member of the Irish American Writers and Artists, Sarah has hosted many of the bi-monthly Salons as well as the Eugene O'Neill Lifetime Achivement award that went to John Patrick Shanley.\n\nHer original comedy has been featured on the stages of Gotham Comedy Club, Stand Up New York, Caroline's and The Metropolitan Room, Irish Arts Center \"Sundays at Seven\", NYU Glucksman Ireland House and the Rockaway Artists Alliance. Sarah is also a member of the Friars Club in NYC.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1808636,
        "imdb_id": "nm0269910",
        "known_for_department": "Acting",
        "name": "Sarah Fearon",
        "place_of_birth": null,
        "popularity": 0.1032,
        "profile_path": "/uhrv88VXwcobI66unDZcQGC9av8.jpg"
    }
}