{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lgBZlJ1LHQel5nneNQMoesmvc7l.jpg",
                "genre_ids": [
                    28,
                    12,
                    10752
                ],
                "id": 1271,
                "original_language": "en",
                "original_title": "300",
                "overview": "Based on Frank Miller's graphic novel, \"300\" is very loosely based the 480 B.C. Battle of Thermopylae, where the King of Sparta led his army against the advancing Persians; the battle is said to have inspired all of Greece to band together against the Persians, and helped usher in the world's first democracy.",
                "popularity": 10.66,
                "poster_path": "/h7Lcio0c9ohxPhSZg42eTlKIVVY.jpg",
                "release_date": "2007-03-07",
                "title": "300",
                "video": false,
                "vote_average": 7.191,
                "vote_count": 14202,
                "character": "Persian Emissary",
                "credit_id": "539d3246c3a3683b59002651",
                "order": 43
            },
            {
                "adult": false,
                "backdrop_path": "/lBDOPBbmI0mKqBAakiLZ0BdgzET.jpg",
                "genre_ids": [
                    18
                ],
                "id": 336000,
                "original_language": "en",
                "original_title": "The Glass Castle",
                "overview": "A young girl is raised in a dysfunctional family constantly on the run from the FBI. Living in poverty, she comes of age guided by her drunkard, ingenious father who distracts her with magical stories to keep her mind off the family's dire state, and her selfish, nonconformist mother who has no intention of raising a family, along with her younger brother and sister, and her other older sister. Together, they fend for each other as they mature in an unorthodox journey that is their family life.",
                "popularity": 5.0826,
                "poster_path": "/8NPP7mliHLlVMHce8SjApiRxgzm.jpg",
                "release_date": "2017-08-11",
                "title": "The Glass Castle",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 855,
                "character": "Ronnie",
                "credit_id": "58e3d0d5c3a368732602032e",
                "order": 29
            },
            {
                "adult": false,
                "backdrop_path": "/L7DIiAdP8DnNqOh7454ZrTYspR.jpg",
                "genre_ids": [
                    10402,
                    18,
                    10749
                ],
                "id": 630566,
                "original_language": "en",
                "original_title": "Clouds",
                "overview": "Young musician Zach Sobiech discovers his cancer has spread, leaving him just a few months to live. With limited time, he follows his dream and makes an album, unaware that it will soon be a viral music phenomenon.",
                "popularity": 3.4632,
                "poster_path": "/d0OdD1I8qAfETvE9Rp9Voq7R8LR.jpg",
                "release_date": "2020-10-09",
                "title": "Clouds",
                "video": false,
                "vote_average": 8.25,
                "vote_count": 1033,
                "character": "Doctor",
                "credit_id": "5f8c0c0cefd3c2003838f1d5",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/izNpxVcjKbF9BiYF4GVqxCOfewL.jpg",
                "genre_ids": [
                    18
                ],
                "id": 641662,
                "original_language": "en",
                "original_title": "Pieces of a Woman",
                "overview": "When a young mother's home birth ends in unfathomable tragedy, she begins a year-long odyssey of mourning that fractures relationships with loved ones in this deeply personal story of a woman learning to live alongside her loss.",
                "popularity": 3.1535,
                "poster_path": "/OgUfLlhfBFx5BPK6LzBWFvBW1w.jpg",
                "release_date": "2020-12-30",
                "title": "Pieces of a Woman",
                "video": false,
                "vote_average": 7.027,
                "vote_count": 1249,
                "character": "Judge",
                "credit_id": "5ffa077161bac4003cab0826",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Tyrone Benski",
            "Tyrone DeCosta Benskin",
            "Tyron Benskin",
            "Tyrone Berskin",
            "Tyrone Benskine"
        ],
        "biography": "Tyrone Benskin has been a significant presence in theatre, film, television and music for over 30 years. As part of the Canadian and International cultural landscape Tyrone has amassed an impressive resume and acclaim for a significant and varied body of work;, from no-nonsense cop to caring and devoted father, from ancient warrior to the characters showing the darkness of human nature. His numerous theatre credits include appearances on many of the celebrated stages across Canada.\n\nHis over 100 film and television credits include co-starring with Tori Spelling in the TV movie \"Mind over Murder\", the new Christmas classic \"The Christmas Choir\", \"The Wool Cap\" and the civil rights drama \"Deacons for Defense\" opposite Forrest Whitaker and Mr. Ossie Davis. Mr. Benskin also appeared in the NBC mini-series 10.5: Apocalypse and starred as Karl Lubinsky in the cult science fiction series \"Charlie Jade\" which aired in Canada, the US and internationally including South Africa, France, England and Japan. Feature films include the blockbuster hit \"300\", Bob Dylan bio-pic \"I'm not There\" and acclaimed independent films \"Peepers\" and \"Adam's Wall.\"\n\nFor over 5 years, Mr. Benskin served as Artistic Director of Black Theatre Workshop, Canada's oldest Black theatre company. He served President of the Board of Creations Etc., a youth arts and outreach organization as well as serving on the board several community based non-profit organizations. Mr. Benskin was twice elected to the post of National Vice President of ACTRA, Canada's national film and television actors union.\n\nOn May 2nd, 2011 Mr. Benskin was elected to the 41st Parliament of Canada as the Member for the diverse riding of Jeanne-Le Ber. Mr. Benskin was subsequently appointed to the post of \"Official Opposition Critic for Canadian Heritage\" by the Honorable Jack Layton. Mr. Benskin also serves as Deputy Critic for Official Languages and served on the Sub-Committee for International Human Rights. Benskin served as a Member of Canada's House of Commons for four and a half years returning to the big screen in 2016 in Bad Santa 2 and the small screen as recurring character Rev. Wardell Cobb in season 2 of The Art of More opposite Denis Quaid.",
        "birthday": "1958-12-29",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.reisler.ca/reisler-talent-men-Tyrone-Benskin.html",
        "id": 181247,
        "imdb_id": "nm0072419",
        "known_for_department": "Acting",
        "name": "Tyrone Benskin",
        "place_of_birth": "Bristol, England, UK",
        "popularity": 0.1611,
        "profile_path": "/jJ4xLfwYsK2iDL1Ge8u2FvlKCb9.jpg"
    }
}