{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/vXzqV2RtJlT9WhNEM4NYWCEC6ZI.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 142,
                "original_language": "en",
                "original_title": "Brokeback Mountain",
                "overview": "In 1960s Wyoming, two men develop a strong emotional and sexual relationship that endures as a lifelong connection complicating their lives as they get married and start families of their own.",
                "popularity": 9.8487,
                "poster_path": "/aByfQOQBNa4CMFwIgq3QrqY2ZHh.jpg",
                "release_date": "2005-10-22",
                "title": "Brokeback Mountain",
                "video": false,
                "vote_average": 7.785,
                "vote_count": 7274,
                "character": "Jolly Minister",
                "credit_id": "52fe421dc3a36847f800532b",
                "order": 16
            },
            {
                "adult": false,
                "backdrop_path": "/5zkrI7P70j8C03ThBOvrEG6VF8M.jpg",
                "genre_ids": [
                    37
                ],
                "id": 33,
                "original_language": "en",
                "original_title": "Unforgiven",
                "overview": "William Munny is a retired, once-ruthless killer turned gentle widower and hog farmer. To help support his two motherless children, he accepts one last bounty-hunter mission to find the men who brutalized a prostitute. Joined by his former partner and a cocky greenhorn, he takes on a corrupt sheriff.",
                "popularity": 7.5524,
                "poster_path": "/54roTwbX9fltg85zjsmrooXAs12.jpg",
                "release_date": "1992-08-07",
                "title": "Unforgiven",
                "video": false,
                "vote_average": 7.915,
                "vote_count": 4679,
                "character": "Tom Luckinbill",
                "credit_id": "56f81302c3a3686a61006ec5",
                "order": 27
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Larry Reese was born in 1951 in Fort Atkinson, Wisconsin. He grew up in Greeley Colorado then immigrated to Canada in 1960. His family moved to Dacca East Pakistan (now Bangladesh) in 1966. On a trip to Calcutta he had the opportunity to meet and learn about sitar from Ravi Shankar. On returning to Canada in 1968 Larry played guitar and recorded with several bands (Manna and Spiney Norman's Whooppee Band) and toured North America with the Canadian Rock Opera Company in 'Jesus Christ Superstar'.\n\nHe was the opening act for the Procol Harum LP \"Live With the Edmonton Symphony' and played sitar on \"In Held Twas I\". Larry got a BMUS. degree in Music Composition from the University of Alberta and wrote film scores for the NFB. He got his Master's Degree in Acting from Brandeis University, Massachusetes in 1978 and returned to Canada to work as an actor and teacher in theater and on film and TV. Larry has worked with such notables as Clint Eastwood, Ang Lee, James Caan, Heath Ledger, Michael Ironside and Gene Hackman, to name a few. He has appeared in a lead role the Canadian classic, 'The Hounds of Notre Dame' and is a producer, director and co-writer for the award winning independent feature, 'Naked Frailties'.\n\nHe now heads the Motion Picture Arts Program at Red Deer College. Many of his students have gone on to stellar careers in television and film. He lives with his family beside beautiful Sylvan Lake.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1814,
        "imdb_id": "nm0716039",
        "known_for_department": "Acting",
        "name": "Larry Reese",
        "place_of_birth": null,
        "popularity": 0.0495,
        "profile_path": "/1Fnypg5QU205cVfftD4KA5fmu1p.jpg"
    }
}