{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/r9oTasGQofvkQY5vlUXglneF64Z.jpg",
                "genre_ids": [
                    28,
                    35,
                    10751
                ],
                "id": 1029575,
                "original_language": "en",
                "original_title": "The Family Plan",
                "overview": "Dan Morgan is many things: a devoted husband, a loving father, a celebrated car salesman. He's also a former assassin. And when his past catches up to his present, he's forced to take his unsuspecting family on a road trip unlike any other.",
                "popularity": 24.0511,
                "poster_path": "/jLLtx3nTRSLGPAKl4RoIv1FbEBr.jpg",
                "release_date": "2023-12-14",
                "title": "The Family Plan",
                "video": false,
                "vote_average": 7.256,
                "vote_count": 1605,
                "character": "Kyle Morgan",
                "credit_id": "643fc0dcb0ba7e04fb131d71",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Van Crosby was born into a blended family in Indianapolis, Indiana. He is the youngest of four siblings, which include Jordan Crosby, Zach Fite and Haley Fite. He relocated from Fishers, Indiana, to Los Angeles at the age of 2 and soon began working in the entertainment industry, following in the footsteps of his sister Haley.\n\nCrosby appeared in his first national print job for Marsico Funds at 3 years old and his first national commercial at the age of 4 for Little Tikes. He has gone on to appear in several others over the years, including a recently aired Audi commercial. He has also guest starred in the series About a Boy and Criminal Minds.\n\nIn his spare time, Crosby enjoys making short films with his friends, playing computer games and learning new flips on his trampoline.",
        "birthday": "2002-11-08",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1818455,
        "imdb_id": "nm3147420",
        "known_for_department": "Acting",
        "name": "Van Crosby",
        "place_of_birth": "Indianapolis, Indiana, USA",
        "popularity": 1.0821,
        "profile_path": "/6KkrTzx6mIZxvI4My7vuL2gDDH9.jpg"
    }
}