{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wN3dgwkiWSLrMVukPQIeccv5EJ6.jpg",
                "genre_ids": [
                    878,
                    12
                ],
                "id": 168,
                "original_language": "en",
                "original_title": "Star Trek IV: The Voyage Home",
                "overview": "When a huge alien probe enters the galaxy and begins to vaporize Earth's oceans, Kirk and his crew must travel back in time in order to bring back whales and save the planet.",
                "popularity": 4.5468,
                "poster_path": "/xY5TzGXJOB3L9rhZ1MbbPyVlW5J.jpg",
                "release_date": "1986-11-26",
                "title": "Star Trek IV: The Voyage Home",
                "video": false,
                "vote_average": 7.157,
                "vote_count": 1561,
                "character": "Lt. Saavik",
                "credit_id": "52fe4221c3a36847f80066cf",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Robin Curtis (bornJune 15, 1956) is an American real estate broker and actress. She is most notable for replacing Kirstie Alley in the role of Vulcan Lieutenant Saavik in the films Star Trek III: The Search for Spock and Star Trek IV: The Voyage Home.\n\nAlthough her first appearance as Vulcan Lieutenant Saavik in Star Trek III: The Search for Spock was promoted as being her film debut, in fact Curtis had already made several film and made-for-television movie appearances. Her performance in the film drew mixed reception from Trek fans, and was followed by a brief appearance as Saavik in Star Trek IV: The Voyage Home.\n\nShe co-starred in the 1983 episode \"Short Notice\" during the first season of the Knight Rider television series. In 1991, she portrayed Carol Pulaski on the soap opera General Hospital. In 1993, Curtis portrayed an unrelated Vulcan character disguised as a Romulan (Tallera/T'Paal) in the two-part episode of Star Trek: The Next Generation \"Gambit,\" for which she was screen-tested instead of being given any special consideration. In the Babylon 5 episode \"Deathwalker\" (1994), she appeared as Abbai Ambassador Kalika.\n\nShe also appeared in the television series Dream On, Herman's Head, Night Court, MacGyver, Johnny Bago, and The Equalizer.\n\nCurtis's other film work includes Hexed, Ghost Story, Shootdown, In Love with an Older Woman, A White Thread, A Black Thread, and LBJ - The Early Years in which she played the role of Jacqueline Kennedy.\n\n*Source:* **Wikipedia**",
        "birthday": "1956-06-15",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1819,
        "imdb_id": "nm0193495",
        "known_for_department": "Acting",
        "name": "Robin Curtis",
        "place_of_birth": "New York Mills, Oneida County, New York, USA",
        "popularity": 0.1877,
        "profile_path": "/flSPFiJ4wE6WgI1mVqHp3wJtDYO.jpg"
    }
}