{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/42mSR48e4h6Zp5BkTUyWPYsAA1X.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 1883,
                "original_language": "en",
                "original_title": "Malcolm X",
                "overview": "A tribute to the controversial black activist and leader of the struggle for black liberation. He hit bottom during his imprisonment in the '50s, he became a Black Muslim and then a leader in the Nation of Islam. His assassination in 1965 left a legacy of self-determination and racial pride.",
                "popularity": 7.2691,
                "poster_path": "/o2s9ow0uRRm1BcF3teznk5twd90.jpg",
                "release_date": "1992-11-18",
                "title": "Malcolm X",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 1773,
                "character": "Speaker #2",
                "credit_id": "623be9347e9d5f008bf9450f",
                "order": 292
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Alfred Charles Sharpton Jr. (born October 3, 1954) is an American civil rights activist, Baptist minister, television/radio talk show host and a former White House adviser for President Barack Obama. In 2004, he was a candidate for the Democratic nomination for the U.S. presidential election. He hosts his own radio talk show, Keepin' It Real, and he makes regular guest appearances cable news television. In 2011, he was named the host of MSNBC's PoliticsNation, a nightly talk show. In 2015, the program was shifted to Sunday mornings.\n\nSharpton's supporters praise \"his ability and willingness to defy the power structure that is seen as the cause of their suffering\" and consider him \"a man who is willing to tell it like it is\". Former Mayor of New York City Ed Koch, a one-time foe, said that Sharpton deserves the respect he enjoys among black Americans: \"He is willing to go to jail for them, and he is there when they need him.\" President Barack Obama said that Sharpton is \"the voice of the voiceless and a champion for the downtrodden.\" A 2013 Zogby Analytics poll found that one quarter of African Americans said that Sharpton speaks for them.\n\nHis critics describe him as \"a political radical who is to blame, in part, for the deterioration of race relations\". Sociologist Orlando Patterson has referred to him as a racial arsonist, while liberal columnist Derrick Z. Jackson has called him the black equivalent of Richard Nixon and Pat Buchanan. Sharpton sees much of the criticism as a sign of his effectiveness. \"In many ways, what they consider criticism is complimenting my job,\" he said. \"An activist's job is to make public civil rights issues until there can be a climate for change.\"\n\n(Wikipedia)",
        "birthday": "1954-10-03",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 181934,
        "imdb_id": "nm0789314",
        "known_for_department": "Acting",
        "name": "Al Sharpton",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.1834,
        "profile_path": "/wN6Nyi4LYycBG7h1mm5MsN92tKa.jpg"
    }
}