{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6MbFN88F27WvGC9WhAXq5KUIgTj.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 1675,
                "original_language": "fr",
                "original_title": "La Nuit américaine",
                "overview": "A committed film director struggles to complete his movie while coping with a myriad of crises, personal and professional, among the cast and crew.",
                "popularity": 2.9412,
                "poster_path": "/e5xDrSx6zDEUlMe2dWKGhv88PDZ.jpg",
                "release_date": "1973-05-24",
                "title": "Day for Night",
                "video": false,
                "vote_average": 7.773,
                "vote_count": 622,
                "character": "Hotel Client (uncredited)",
                "credit_id": "6856d8f7de9cada829492fc1",
                "order": 26
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/6MbFN88F27WvGC9WhAXq5KUIgTj.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 1675,
                "original_language": "fr",
                "original_title": "La Nuit américaine",
                "overview": "A committed film director struggles to complete his movie while coping with a myriad of crises, personal and professional, among the cast and crew.",
                "popularity": 2.9412,
                "poster_path": "/e5xDrSx6zDEUlMe2dWKGhv88PDZ.jpg",
                "release_date": "1973-05-24",
                "title": "Day for Night",
                "video": false,
                "vote_average": 7.773,
                "vote_count": 622,
                "credit_id": "5846530bc3a36847f901f3d7",
                "department": "Production",
                "job": "Production Manager"
            },
            {
                "adult": false,
                "backdrop_path": "/9x3yIrAJOkYSs0SBKcGCQlwPSNm.jpg",
                "genre_ids": [
                    10749,
                    35,
                    18
                ],
                "id": 2433,
                "original_language": "fr",
                "original_title": "Les Demoiselles de Rochefort",
                "overview": "Delphine and Solange are two sisters living in Rochefort. Delphine is a dancing teacher and Solange composes and teaches the piano. Maxence is a poet and a painter. He is doing his military service. Simon owns a music shop, he left Paris one month ago to come back where he fell in love 10 years ago. They are looking for love, looking for each other, without being aware that their ideal partner is very close...",
                "popularity": 1.7891,
                "poster_path": "/jtxhyGaYhurH6KsjvP1jV3dDypz.jpg",
                "release_date": "1967-03-08",
                "title": "The Young Girls of Rochefort",
                "video": false,
                "vote_average": 7.682,
                "vote_count": 631,
                "credit_id": "5ee455f3a217c00022d08e05",
                "department": "Directing",
                "job": "Assistant Director"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Claude Miler"
        ],
        "biography": "Claude Miller (20 February 1942 – 4 April 2012) was a French film director, producer and screenwriter.\n\nClaude Miller was born to a Jewish family. A student at Paris' IDHEC film school from 1962 through 1963, Miller had his first practical cinematic experience while he was in uniform, serving with the Service Cinéma de l'Armée. From 1965 until 1974, Miller worked in assistant and supervisory capacities for many of France's major directors, including Robert Bresson and Jean-Luc Godard.\n\nHis principal mentor was François Truffaut, under whose tutelage Miller directed a trio of shorts and La meilleure façon de marcher (The Best Way to Walk, 1976), his first theatrical feature, a coming-of-age drama which bore traces of Truffaut's Les Mistons (1957) and The 400 Blows (1959). Miller received César nominations for Best Director and César Award for Best Screenplay, Dialogue or Adaptation for this film.\n\nHis subsequent films can also be perceived as homages to Truffaut, many even using the same production personnel. The following year he made Dites-lui que je l'aime, for which he received a second César nomination for Best Director. He won a César Award for Best Screenplay, Dialogue or Adaptation in 1981 for Garde à vue, and the Louis Delluc Prize in 1985 for L'Effrontée, for which he received another César nomination for Best Director. In 1983 he directed Mortelle randonnée. When Truffaut died in 1984 during the preparation of another feature about a confused, adolescent serial thief entangled with an older lover, La Petite Voleuse (The Little Thief), Miller took over the project, completing the film in 1988. The latter film was a considerable international success, and solidified Miller's status as one of France's major film-makers. On French television, Miller directed dozens of commercials and the six-part miniseries Traits de Mémoire (1976).\n\nAfter a four-year absence, Claude Miller returned to active filmmaking with The Accompanist (1992) and Le Sourire (1994). He had to wait until 1998 for his next major success: La Classe de Neige, the chilling story of a lonely boy on a school skiing holiday, which won the Jury Prize at the 1998 Cannes Film Festival. Later films Miller directed include Betty Fisher et autres histoires (2001) which Peter Bradshaw wrote that Miller \"endowed it with the fascination of an exotic, spiky, poisonous flower\", La Petite Lili (2003), and A Secret (2007). At the time of his death he was working on an adaptation of François Mauriac's Thérèse Desqueyroux. The film was selected to close the 2012 Cannes Film Festival.\n\nDescription above from the Wikipedia article Claude Miller, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1942-02-20",
        "deathday": "2012-04-04",
        "gender": 2,
        "homepage": null,
        "id": 18209,
        "imdb_id": "nm0002218",
        "known_for_department": "Directing",
        "name": "Claude Miller",
        "place_of_birth": "Paris, France",
        "popularity": 0.2074,
        "profile_path": "/c9h4B4kFWgU4Jf2ciUzoDVD4IOU.jpg"
    }
}