{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/o3GSSYr7AzrdcukNpQrqFEJNOjk.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 1628,
                "original_language": "fr",
                "original_title": "Jules et Jim",
                "overview": "In the carefree days before World War I, introverted Austrian author Jules strikes up a friendship with the exuberant Frenchman Jim and both men fall for the impulsive and beautiful Catherine.",
                "popularity": 2.8495,
                "poster_path": "/kuFjZlcZhQFDtIjuI3GQJjsQG03.jpg",
                "release_date": "1962-01-23",
                "title": "Jules and Jim",
                "video": false,
                "vote_average": 7.558,
                "vote_count": 1013,
                "character": "Albert",
                "credit_id": "52fe4306c3a36847f8034aab",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Bassiak",
            "Boris Bassiak",
            "Cyrus Bassiak",
            "Cyrus Rezvani"
        ],
        "biography": "Serge Rezvani (born Cyrus Rezvani in 1928) is a French painter, engraver, writer (novels, plays), as well as a songwriter-composer-performer (he describes himself as \"multidisciplinary\") He is also known by his pseudonym Cyrus Bassiak.\n\nBorn in Tehran, Rezvani is the son of a Persian father, Medjid-Khan Rezvani (1900–1962), and a Jewish mother who had immigrated from Russia. His mother moved with him to France when he was age seven and spoke only Russian. He attended a boarding school for Russian immigrants, where he learned French.\n\nRezvani has written over 40 novels, 15 plays, and two poetry collections. He is the author of more than 150 songs, including the famous Le Tourbillon, sung by Jeanne Moreau in the film Jules and Jim, as well as J'ai la mémoire qui flanche, also performed by Moreau (he signed these songs under pseudonym Cyrus Bassiak, which means \"barefoot\" in Russian). Rezvani also wrote two songs for Godart's Pierrot le fou: Jean-Paul Belmondo and Anna Karina sing, Jamais je ne t'ai dit que je t'aimerais toujours, ô mon amour and Ma ligne de chance.\n\nAfter losing his first wife, Lula, to Alzheimer's in 2004, in mid-2005, he re-established acquaintance with the French actress Marie-José Nat, who was then the widow of Michel Drach. The two couples had known each other and had briefly met in the 1960s. Serge and Marie-José married on 30 September 2005, aware (as they said) that they would have only a few more years to live, and he wrote a book about their relationship, Ultime amour. Rezvani lived with Marie-José Nat in Bonifacio until her death in October 2019.\n\nSource: Article \"Serge Rezvani\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1928-03-23",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 18221,
        "imdb_id": "nm0060288",
        "known_for_department": "Sound",
        "name": "Serge Rezvani",
        "place_of_birth": "Tehran, Iran",
        "popularity": 0.0679,
        "profile_path": "/pdsWS4IeiqGyyOFisI1OzyVAY8h.jpg"
    }
}