{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9LFk66Se0T3Uw2JPupYxAc6F2Gq.jpg",
                "genre_ids": [
                    18,
                    53
                ],
                "id": 210479,
                "original_language": "en",
                "original_title": "Locke",
                "overview": "Ivan Locke has worked hard to craft a good life for himself. Tonight, that life will collapse around him. On the eve of the biggest challenge of his career, Ivan receives a phone call that sets in motion a series of events that will unravel his family, job, and soul.",
                "popularity": 1.6959,
                "poster_path": "/tTREq5tTyYwmSLDRMhybJ82zXcX.jpg",
                "release_date": "2014-04-10",
                "title": "Locke",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 2785,
                "character": "Sister Margaret (voice)",
                "credit_id": "52fe4d7dc3a368484e1ebfe1",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/kfofK4GzJsJZhCShqZY438c8Y4Y.jpg",
                "genre_ids": [
                    35,
                    12,
                    10751
                ],
                "id": 116149,
                "original_language": "en",
                "original_title": "Paddington",
                "overview": "A young Peruvian bear travels to London in search of a home. Finding himself lost and alone at Paddington Station, he meets the kindly Brown family, who offer him a temporary haven.",
                "popularity": 5.5658,
                "poster_path": "/wpchRGhRhvhtU083PfX2yixXtiw.jpg",
                "release_date": "2014-11-24",
                "title": "Paddington",
                "video": false,
                "vote_average": 7.114,
                "vote_count": 3985,
                "character": "Geographers' Guild Receptionist",
                "credit_id": "55e419c392514137e600355f",
                "order": 21
            },
            {
                "adult": false,
                "backdrop_path": "/9rMSCFH9zhv1vILpEZQlUJs9iUm.jpg",
                "genre_ids": [
                    80,
                    28,
                    35
                ],
                "id": 4638,
                "original_language": "en",
                "original_title": "Hot Fuzz",
                "overview": "Former London constable Nicholas Angel finds it difficult to adapt to his new assignment in the sleepy British village of Sandford. Not only does he miss the excitement of the big city, but he also has a well-meaning oaf for a partner. However, when a series of grisly accidents rocks Sandford, Angel smells something rotten in the idyllic village.",
                "popularity": 6.2364,
                "poster_path": "/zPib4ukTSdXvHP9pxGkFCe34f3y.jpg",
                "release_date": "2007-02-14",
                "title": "Hot Fuzz",
                "video": false,
                "vote_average": 7.562,
                "vote_count": 7922,
                "character": "Tina",
                "credit_id": "56759e5392514179d400320a",
                "order": 31
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Alice Eva Lowe",
            "앨리스 로우"
        ],
        "biography": "An English actress and writer, mainly in comedy. She is known for her roles in the Garth Marenghi series and as the lead and co-writer of the 2012 film Sightseers. She wrote, directed and starred in the 2016 black comedy Prevenge, whilst pregnant herself.\n\nLowe was born in Coventry, West Midlands, England. She attended Kenilworth School and graduated from King's College, Cambridge, where she studied classics. At university she became involved in theatre and comedy.\n\nLowe began her career in surreal experimental theatre shows including City Haunts, Snowbound and Progress in Flying Machine co-devising and performed along with colleagues such as Robert Webb and David Mitchell.\n\nLowe worked under the directorship of Paul King, who has since directed her in The Mighty Boosh and Garth Marenghi's Darkplace. She was cast in Garth Marenghi's Fright Knight alongside fellow Cambridge graduates Richard Ayoade and Matt Holness and they were nominated for the Perrier Award at the Edinburgh Fringe in 2000. In 2001, she won an award for performing in the sequel to Fright Knight, Garth Marenghi's Netherhead, at the Edinburgh Festival Fringe.\n\nHer television credits include Channel 4's spoof horror comedy Garth Marenghi's Darkplace, Beth in the BBC comedy series My Life in Film, David Bowie in the BBC series Snuff Box, and a recurring role in Rob Brydon's Annually Retentive. She was part of the all-female comedy show Beehive along with Sarah Kendall, Barunka O'Shaughnessy and Clare Thomson which was aired on E4, and was a regular cast member of the CBBC show Horrible Histories during the second, third and fifth seasons. Her BBC Three pilot \"LifeSpam: My Child Is French\" was broadcast in 2009, and she co-wrote and starred in Channel 4's Orcadia. In February 2010, she appeared in and script-edited the pilot for a \"sort-of-sketch-show\" called Missing Scene.\n\nShe has also guest starred as Monkey in \"The Priest and the Beast\" episode of The Mighty Boosh, as Patricia in the \"Fifty-Fifty\" episode of The IT Crowd, a solicitor in the \"Travel Writer\" episode of Black Books, Madonna in an episode of Channel 4's Star Stories, and episodes of Little Britain, Come Fly with Me, Ruddy Hell! It's Harry and Paul, Beautiful People and This is Jinsy. She appeared in the music video for \"Bastardo\" by Charlotte Hatherley, directed by Edgar Wright.",
        "birthday": "1977-04-03",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.independenttalent.com/actors/alice-lowe/",
        "id": 182327,
        "imdb_id": "nm1546686",
        "known_for_department": "Acting",
        "name": "Alice Lowe",
        "place_of_birth": "Coventry, West Midlands, England, UK",
        "popularity": 0.2371,
        "profile_path": "/v4sRxLpRpHEd9vbk43wm9VL0v0K.jpg"
    }
}