{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/27e2IkJnwEqXoEx9WTY0aDON8L.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 1110358,
                "original_language": "fr",
                "original_title": "Yannick",
                "overview": "In the middle of a performance of the play \"Le Cocu\", a bad boulevard comedy at a Parisian theatre, Yannick gets up and interrupts the show to take the evening back in hand.",
                "popularity": 1.2736,
                "poster_path": "/vZtteptwaNpZmdB1YwlyXOmUVw9.jpg",
                "release_date": "2023-08-02",
                "title": "Yannick",
                "video": false,
                "vote_average": 7.073,
                "vote_count": 666,
                "character": "La préposée du vestiaire",
                "credit_id": "649c494eaf58cb00adc58770",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Agnès Hurstel (born 5 September 1990) is a French actress, comedian and radio columnist. She is co-creator, co-writer and lead actress of the series Jeune et Golri (2021–present), which won the award for best French series at Series Mania in August 2021.\n\nAgnès Hurstel was born on 5 September 1990 at Clinique Ambroise Paré in Toulouse. She obtained her baccalaureate in 2008 at the Lycée Français Charles de Gaulle. She completed a literary preparation course (hypokhâgne, khâgne) at the Lycée Chaptal in Paris followed by degrees in modern literature and theatre acting at the Université Sorbonne Nouvelle – Paris 3. She started performing stand-up in 2015.\n\nIn 2018, she replaced Alison Wheeler as a columnist on the France Inter radio show La Bande originale, hosted by Nagui.\n\nIn 2021, she played in the lead role Prune of the OCS series Jeune et Golri for which she is also co-creator and co-writer. The series won awards for best French series and best original score at the Series Mania festival in Lille.\n\nIn 2022, she played a main supporting role in the comedy film On sourit pour la photo by François Uzan. She also starred in the film Final Cut by Michel Hazanavicius, a remake of the Japanese film One Cut of the Dead (2017), which opened the Cannes Film Festival of the same year.\n\nSource: Article \"Agnès Hurstel\" from Wikipedia in English, licensed under CC-BY-SA.",
        "birthday": "1990-09-05",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1826078,
        "imdb_id": "nm7415049",
        "known_for_department": "Acting",
        "name": "Agnès Hurstel",
        "place_of_birth": "Toulouse, Haute-Garonne, France",
        "popularity": 0.1518,
        "profile_path": "/f1mq1z7L6uz1O0nAXOMOf8rQCqf.jpg"
    }
}