{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8aTHhowlxO3nBQjianlIyns1ZIt.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 156700,
                "original_language": "en",
                "original_title": "The Kings of Summer",
                "overview": "Joe Toy, on the verge of adolescence, finds himself increasingly frustrated by his single father, Frank's attempts to manage his life. Declaring his freedom once and for all, he escapes to a clearing in the woods with his best friend, Patrick, and a strange kid named Biaggio. He announces that they are going to build a house there, free from responsibility and parents. Once their makeshift abode is finished, the three young men find themselves masters of their own destiny, alone in the woods.",
                "popularity": 2.7825,
                "poster_path": "/6dcIbwJuxlEnzLe0EaGFvsh4ZdS.jpg",
                "release_date": "2013-01-19",
                "title": "The Kings of Summer",
                "video": false,
                "vote_average": 6.982,
                "vote_count": 1177,
                "character": "Biaggio's Dad",
                "credit_id": "59578ef39251410b8600981d",
                "order": 30
            },
            {
                "adult": false,
                "backdrop_path": "/kzXUQnrUnHUGHuwWbgf9KpoU3qr.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 544401,
                "original_language": "en",
                "original_title": "Cherry",
                "overview": "Cherry drifts from college dropout to army medic in Iraq - anchored only by his true love, Emily. But after returning from the war with PTSD, his life spirals into drugs and crime as he struggles to find his place in the world.",
                "popularity": 2.9009,
                "poster_path": "/pwDvkDyaHEU9V7cApQhbcSJMG1w.jpg",
                "release_date": "2021-02-26",
                "title": "Cherry",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1323,
                "character": "Turkish Guy (uncredited)",
                "credit_id": "5fee373b2dda890042f08f3d",
                "order": 97
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Michael Cipiti hails from The Land, Cleveland, and got his start professionally at the historic Cleveland Play House. He is of Italian descent, with roots in the boot.\n\nOpen to portraying a variety of roles, Cipiti still enjoys using his olive oil voice and guinea charm, which he has displayed in Gotti (Carlo Gambino) with John Travolta and Stacy Keach, Chicago Overcoat (Freddy Falzone) with Frank Vincent, The Sugar Wars, a documentary based on Cleveland mob boss Angelo Lonardo, among others.\n\nMichael has also had the pleasure of working on some national commercial spots with LeBron James.\n\nIn his spare time Michael is passionate about fitness, and spends a lot of time on the water kayaking.",
        "birthday": null,
        "deathday": null,
        "gender": 0,
        "homepage": null,
        "id": 1826013,
        "imdb_id": "nm1714784",
        "known_for_department": "Acting",
        "name": "Michael Cipiti",
        "place_of_birth": null,
        "popularity": 0.9844,
        "profile_path": "/53rz78IjCXDRMfqLXsnIvJTFCH.jpg"
    }
}