{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ddIkmH3TpR6XSc47jj0BrGK5Rbz.jpg",
                "genre_ids": [
                    10752,
                    28,
                    18
                ],
                "id": 374720,
                "original_language": "en",
                "original_title": "Dunkirk",
                "overview": "The story of the miraculous evacuation of Allied soldiers from Belgium, Britain, Canada and France, who were cut off and surrounded by the German army from the beaches and harbour of Dunkirk between May 26th and June 4th 1940 during World War II.",
                "popularity": 8.077,
                "poster_path": "/b4Oe15CGLL61Ped0RAS9JpqdmCt.jpg",
                "release_date": "2017-07-19",
                "title": "Dunkirk",
                "video": false,
                "vote_average": 7.449,
                "vote_count": 17006,
                "character": "Deal Sailor",
                "credit_id": "592ec8f9c3a368615700cdf7",
                "order": 39
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Calam Finbar Lynch (born 7 November 1994) is a British actor of Irish descent. His films include the Disney adaptation of Black Beauty (2020) and Terence Davies' Benediction (2021). On television, he appeared in the BBC One drama Mrs Wilson (2018) and is known for his role in the Netflix period drama Bridgerton (2022-present).\n\nIn his third and final year at Oxford, Lynch signed with an agent and appeared in Dunkirk. After graduating, he played Claudio in the Rose Theatre Kingston production of Much Ado About Nothing and Gordon Wilson, the son of the titular character played by Ruth Wilson in the BBC One miniseries Mrs Wilson. That same year, Lynch had a guest role as John-Paul O'Reilly in an episode of the Channel 4 sitcom Derry Girls. He appeared in Wife at the Kiln Theatre in 2019.\n\nIn 2022, it was announced that Lynch will appear in a recurring role in the second season of the Amazon Prime Video fantasy series The Lord of the Rings: The Rings of Power.",
        "birthday": "1994-11-07",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1826549,
        "imdb_id": "nm8208516",
        "known_for_department": "Acting",
        "name": "Calam Lynch",
        "place_of_birth": "Warwickshire, England, UK",
        "popularity": 0.2339,
        "profile_path": "/6Zkz6DF6tW96LYx0DDqxEPIc31P.jpg"
    }
}