{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8bXbZE8lBdV7W68AD7u5YNXKTOn.jpg",
                "genre_ids": [
                    18
                ],
                "id": 1640,
                "original_language": "en",
                "original_title": "Crash",
                "overview": "In post-Sept. 11 Los Angeles, tensions erupt when the lives of a Brentwood housewife, her district attorney husband, a Persian shopkeeper, two cops, a pair of carjackers and a Korean couple converge during a 36-hour period.",
                "popularity": 5.5836,
                "poster_path": "/86BdPC6RDX88NC880pLidKn2LCj.jpg",
                "release_date": "2005-05-06",
                "title": "Crash",
                "video": false,
                "vote_average": 7.214,
                "vote_count": 3658,
                "character": "Officer Johnson",
                "credit_id": "52fe4307c3a36847f8035075",
                "order": 14
            },
            {
                "adult": false,
                "backdrop_path": "/yFPaqqXMGsdOKit3fsAJ9tqPJRP.jpg",
                "genre_ids": [
                    80,
                    18,
                    53
                ],
                "id": 242582,
                "original_language": "en",
                "original_title": "Nightcrawler",
                "overview": "When Lou Bloom, desperate for work, muscles into the world of L.A. crime journalism, he blurs the line between observer and participant to become the star of his own story. Aiding him in his effort is Nina, a TV-news veteran.",
                "popularity": 18.4904,
                "poster_path": "/j9HrX8f7GbZQm1BrBiR40uFQZSb.jpg",
                "release_date": "2014-10-23",
                "title": "Nightcrawler",
                "video": false,
                "vote_average": 7.705,
                "vote_count": 11229,
                "character": "Jackie (uncredited)",
                "credit_id": "537a2b4cc3a3685e3200003f",
                "order": 38
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Bird York",
            "Kathleen \"Bird\" York"
        ],
        "biography": "Kathleen \"Bird\" York is an actress, screenwriter and Oscar nominated songwriter-recording artist. As a screenwriter, York has written projects for John Wells Warner Brothers, Sony, Paramount and has just completed a one hour pilot for Fox Television Studios. She is an alumni of the prestigious Showrunners Training Program facilitated by the Writers Guild of America and the Alliance of Motion Picture and Television Producers.\n\nYork achieved global recognition with her song \"In the Deep\", (co-written with Michael Becker) which appears on her album Wicked Little High and was written for the 2004 film Crash. \"In the Deep\" was nominated for the Academy Award for Best Song with York performing the song live at the 78th Academy Awards in 2006. Her self titled debut record was released in February 1999.\n\nAs an actress, York has starred in over a hundred film and television projects. York starred as a young Naomi Judd in Love Can Build a Bridge, the four hour NBC miniseries about Judd's life (the second highest rated event on NBC that year). Other credits include six seasons of the multi Emmy Award winning series The West Wing as Andrea Wyatt, Northern Lights with Diane Keaton, \"Cold Feet\" with Tom Waits, \"A Season In Purgatory\" opposite Patrick Dempsey, \"Nightjohn\" opposite Beau Bridges, and Oscar winner Crash. Independent film credits include Cries of Silence, The Big Day, Ball Don't Lie. York was a series regular in the ABC series Vengeance Unlimited as well as Aaron's Way for NBC. Recurring roles include Stephen Bochco's Murder One, The O.C and Desperate Housewives. She appeared on the cult hit Curb Your Enthusiasm as Larry David's masseuse \"Summer\" in the show's second season . Fall 2010 she will be seen in the NBC drama Chase and A&E's The Glades.\n\nOther music credits include the main theme song in Sony Pictures Seven Pounds, the televised concert Where Music Meets Film along with Joss Stone, Lindsay Buckingham and Babyface as well as featured song placements in House, 2010 season of American Idol, Nip/Tuck, CSI: NY, In Justice, Jake 2.0 and Everwood. She was the featured musical artist for the 2001 season of the CBS TV series Family Law writing and producing songs for numerous episodes.\n\nHer EP Have No Fear was released on December 19, 2008 and a completed full record will be released in early 2010.\n\nDescription above from the Wikipedia article Kathleen York, licensed under CC-BY-SA,full list of contributors on Wikipedia.",
        "birthday": "1975-05-11",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 18293,
        "imdb_id": "nm0948723",
        "known_for_department": "Acting",
        "name": "Kathleen York",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.4618,
        "profile_path": "/p2Yck53042nQrXgP4V1Hb1bcA9F.jpg"
    }
}