{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sGKUhw88FMH5gfz0E6BK2YOZ5se.jpg",
                "genre_ids": [
                    36,
                    18
                ],
                "id": 82695,
                "original_language": "en",
                "original_title": "Les Misérables",
                "overview": "An adaptation of the successful stage musical based on Victor Hugo's classic novel set in 19th-century France. Jean Valjean, a man imprisoned for stealing bread, must flee a relentless policeman named Javert. The pursuit consumes both men's lives, and soon Valjean finds himself in the midst of the student revolutions in France.",
                "popularity": 6.8718,
                "poster_path": "/6CuzBs2Lb8At7qQr64mLXg2RYRb.jpg",
                "release_date": "2012-12-18",
                "title": "Les Misérables",
                "video": false,
                "vote_average": 7.315,
                "vote_count": 5416,
                "character": "Majordomo",
                "credit_id": "52fe486d9251416c9108c22d",
                "order": 96
            },
            {
                "adult": false,
                "backdrop_path": "/6dyqfaPdeM5Z22ylw9ZTyjROBo7.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 45269,
                "original_language": "en",
                "original_title": "The King's Speech",
                "overview": "The King's Speech tells the story of the man who became King George VI, the father of Queen Elizabeth II. After his brother abdicates, George ('Bertie') reluctantly assumes the throne. Plagued by a dreaded stutter and considered unfit to be king, Bertie engages the help of an unorthodox speech therapist named Lionel Logue. Through a set of unexpected techniques, and as a result of an unlikely friendship, Bertie is able to find his voice and boldly lead the country into war.",
                "popularity": 5.0843,
                "poster_path": "/pVNKXVQFukBaCz6ML7GH3kiPlQP.jpg",
                "release_date": "2010-11-26",
                "title": "The King's Speech",
                "video": false,
                "vote_average": 7.735,
                "vote_count": 8986,
                "character": "Steward",
                "credit_id": "53fb6d4d0e0a267a6600821b",
                "order": 33
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            " John Warnby"
        ],
        "biography": "John Warnaby (6 November 1960 – 13 April 2024) was a British actor on stage, television and in films. In later life he became a Catholic priest.\n\nJohn Michael Warnaby was born on 6 November 1960. He attended St Teresa’s Primary School in the Birmingham suburb of Handsworth Wood, before going to St Philip’s College in Edgbaston from 1971 to 1979. Between 1979 and 1982 he read theology at Oriel College, Oxford.\n\nAfter university Warnaby worked for the Corporation of Lloyd’s as a regulator in the area of solvency and financial reporting. He set up an office in Atlanta, Georgia in the USA, where he worked with investors for two years. He continued to work in this field until 2000.\n\nWhile still working for Lloyd's, Warnaby embarked on a career as an actor.\n\nHis breakthrough came in 1988 in a stage adaptation of Tom Stoppard's radio play Artist Descending a Staircase, directed by Tim Luscombe, in which Warnaby played the young version of the character Donner (the older version being played by Frank Middlemass). It was first performed at the Kings Head, Islington, London, later transferring to the Duke of York's Theatre in the West End.\n\nWarnaby joined the RSC for the 1990/91 season in The Swan in Stratford and the Pit at the Barbican in London. He played Paris in Sam Mendes' production of Troilus and Cressida (played by Ralph Fiennes and Amanda Root) and doubled as the Earl of Lancaster and the Abbot of Neath in Gerard Murphy's production of Edward II (played by Simon Russell Beale). He also appeared in Richard Nelson's Two Shakespearean Actors, directed by Roger Michell, and The Shakespeare Revue, devised by Chris Luscombe.\n\nIn 1996 Warnaby appeared at the National Theatre, playing Napoleon Bonaparte and Boris Dubretskoy in Helen Edmundson's adaptation of Tolstoy's War and Peace, directed by Nancy Meckler.\n\nIn 2001 Warnaby played Freddie in Laurence Boswell's revival of Peter Nichols’ play A Day in the Death of Joe Egg at the Comedy Theatre in a cast which included Eddie Izzard, Victoria Hamilton and Prunella Scales.\n\nIn 2006 he appeared in the television adaptation of Alan Hollinghurst’s novel The Line of Beauty.\n\nIn Nicholas de Jongh's 2009 stage hit in London Plague Over England, Warnaby played both 1950s Home Secretary David Maxwell Fyfe and an acerbic theatre critic.\n\nIn later life, Warnaby retired from acting and trained as a Catholic priest. In 2013 he was sent to the Pontifical Beda College in Rome. On his ordination in 2017, his first appointment was as Assistant Priest at St Monica’s, Palmers Green. In 2019 he moved to St George’s, Sudbury as Assistant Priest. The following year he moved to St Joseph’s, Carpenders Park, initially as Assistant Priest and, from 2022, as Parish Priest.\n\nWarnaby died after a short illness on 13 April 2024, at the age of 63. His funeral took place in his own parish of St Joseph's. Cardinal Vincent Nichols, Archbishop of Westminster, presided over the Requiem Mass",
        "birthday": "1960-11-06",
        "deathday": "2024-04-13",
        "gender": 2,
        "homepage": null,
        "id": 183180,
        "imdb_id": "nm0912353",
        "known_for_department": "Acting",
        "name": "John Warnaby",
        "place_of_birth": "Birmingham, England, UK",
        "popularity": 0.091,
        "profile_path": null
    }
}