{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7QDWTqSGqI2Q5dOBtvT64MOhmwJ.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 930094,
                "original_language": "en",
                "original_title": "Red, White & Royal Blue",
                "overview": "After an altercation between Alex, the president's son, and Britain's Prince Henry at a royal event becomes tabloid fodder, their long-running feud now threatens to drive a wedge in U.S./British relations. When the rivals are forced into a staged truce, their icy relationship begins to thaw and the friction between them sparks something deeper than they ever expected.",
                "popularity": 10.1049,
                "poster_path": "/ta3ReqbdEcLJM3mcHMzbYFZI8v7.jpg",
                "release_date": "2023-07-27",
                "title": "Red, White & Royal Blue",
                "video": false,
                "vote_average": 7.967,
                "vote_count": 1424,
                "character": "King's Equerry",
                "credit_id": "64bf2a2a6d4c9700e275d116",
                "order": 26
            },
            {
                "adult": false,
                "backdrop_path": "/AaABt75ZzfMGrscUR2seabz4PEX.jpg",
                "genre_ids": [
                    28,
                    12,
                    14
                ],
                "id": 297762,
                "original_language": "en",
                "original_title": "Wonder Woman",
                "overview": "An Amazon princess comes to the world of Man in the grips of the First World War to confront the forces of evil and bring an end to human conflict.",
                "popularity": 15.1484,
                "poster_path": "/v4ncgZjG2Zu8ZW5al1vIZTsSjqX.jpg",
                "release_date": "2017-05-30",
                "title": "Wonder Woman",
                "video": false,
                "vote_average": 7.214,
                "vote_count": 20441,
                "character": "Kaiser Wilhelm II",
                "credit_id": "593bb725c3a3680ee000b850",
                "order": 19
            },
            {
                "adult": false,
                "backdrop_path": "/q9mF0HhnKT5deOIRAQSFjhLC8c1.jpg",
                "genre_ids": [
                    10751,
                    14,
                    12,
                    28
                ],
                "id": 420809,
                "original_language": "en",
                "original_title": "Maleficent: Mistress of Evil",
                "overview": "Maleficent and her goddaughter Aurora begin to question the complex family ties that bind them as they are pulled in different directions by impending nuptials, unexpected allies, and dark new forces at play.",
                "popularity": 6.7923,
                "poster_path": "/vloNTScJ3w7jwNwtNGoG8DbTThv.jpg",
                "release_date": "2019-10-16",
                "title": "Maleficent: Mistress of Evil",
                "video": false,
                "vote_average": 7.304,
                "vote_count": 6296,
                "character": "Doctor",
                "credit_id": "5ead96ba0b7316001e3e63ae",
                "order": 60
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Martin Bishop traded in his role as an industry bigwig to follow his dreams of making it as an actor.  Any manual on writing movie scripts will tell you that somewhere in the first few minutes you need a Big Event, an upheaval that tips the balance and sends the characters marching off into the story.\n\nFor Martin Bishop the Big Event came in April 2002. Then he was the chairman of QS firm Franklin + Andrews, negotiating an historic merger with engineering firm Mott MacDonald. The deal was due to be completed on the 19th, but last-minute complications arose. It was a tense time for Bishop. On the 21st, a major artery in his neck decided to down tools and he found himself flat on his back in a hospital bed.\n\nHe was OK, although he had to play his part in finishing negotiations by telephone from his hospital bed. Back on his feet in a few days, he showed up at the new company for his new job – as global head of customer service – and realised he wasn't up for it. He resigned.\n\nBishop had always been a keen amateur actor, taking many lead roles, latterly at the drama society at London's Hurlingham Club. Also, he'd always wondered how things might have been after schoolmate Kevin Whately (aka Lewis in Inspector Morse) switched to acting after a couple of years as an accountant. So, with Death's breath still chilly on his shoulder, it seemed natural to enrol at the GSA Conservatoire (formerly the Guildford School of Acting).\n\nHis television credits include roles in The Fugitives, Urban Legends, Brief Encounters, The Crown, Doctors, Belgravia, Optimisty:Karibskly sezon, The Nevers, Ted Lasso, The Sandman, Dangerous Liaisons, The Flatshare, Renegade Nell and EastEnders. Film roles include Legend, Mum's List, Wonder Woman, The Mummy, Holmes & Watson, Mr. Jones, Once Upon a Time in London, The Hustle, Maleficent: Mistress of Evil, Breaking Infinity, Hitmen and Red, White & Royal Blue. On stage, he appeared in productions of Macbeth, As You Like It, She Stoops to Conquer, The Confidential Clerk, A Christmas Carol, The Browning Version, Swan Song, Sam, The Highest Jumper of Them All, The Scottsboro Boys, The Rivals and Curtains.",
        "birthday": "1960-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1831379,
        "imdb_id": "nm1665050",
        "known_for_department": "Acting",
        "name": "Martin Bishop",
        "place_of_birth": "Parsons Green, London, England, UK",
        "popularity": 0.4744,
        "profile_path": "/9a0beQcrkxENGKWJ4z3th25JBjO.jpg"
    }
}