{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/f2Gdaux9j6FF39oNj0Cpfooje4m.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 9388,
                "original_language": "en",
                "original_title": "Thank You for Smoking",
                "overview": "Nick Naylor is a charismatic spin-doctor for Big Tobacco who'll fight to protect America's right to smoke -- even if it kills him -- while still remaining a role model for his 12-year old son. When he incurs the wrath of a senator bent on snuffing out cigarettes, Nick's powers of \"filtering the truth\" will be put to the test.",
                "popularity": 3.2289,
                "poster_path": "/cJpeM7U36diFinieBWNLVi0FlQz.jpg",
                "release_date": "2005-09-09",
                "title": "Thank You for Smoking",
                "video": false,
                "vote_average": 7.19,
                "vote_count": 2275,
                "character": "Dennis Miller",
                "credit_id": "5671a45f92514143ad0068af",
                "order": 24
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Dennis Miller is an American stand-up comedian, political commentator, actor, sports commentator, and television and radio personality. He is known for his critical assessments laced with pop culture references.  He rose to fame as a cast member of Saturday Night Live in 1985, and subsequently hosted a string of his own talk shows on HBO, CNBC and in syndication. He currently hosts a daily, three-hour, self-titled talk radio program, nationally syndicated by Westwood One.\n\nAlthough in his early years of fame he was perceived to be quite liberal and anti-Republican, in recent years, Miller has become known for his right leaning political opinions. He is a regular political commentator on Fox News Channel's The O'Reilly Factor in a segment called \"Miller Time\", and previously appeared on the network's Hannity & Colmes in a segment called \"Real Free Speech\".",
        "birthday": "1953-11-03",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 18326,
        "imdb_id": "nm0588222",
        "known_for_department": "Acting",
        "name": "Dennis Miller",
        "place_of_birth": "Pittsburgh, Pennsylvania, USA",
        "popularity": 0.4013,
        "profile_path": "/AdO5Dm8xyuYvXIQEuzpBi6nG9QF.jpg"
    }
}