{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bwyLycDaQdS3rS4crpbYssYLJRy.jpg",
                "genre_ids": [
                    878,
                    28
                ],
                "id": 8337,
                "original_language": "en",
                "original_title": "They Live",
                "overview": "A lone drifter stumbles upon a unique pair of sunglasses that reveal aliens are systematically gaining control of the Earth by masquerading as humans and lulling the public into submission.",
                "popularity": 6.5976,
                "poster_path": "/ngnybFTuopfbfmmEeX9jjBQQmF6.jpg",
                "release_date": "1988-11-04",
                "title": "They Live",
                "video": false,
                "vote_average": 7.299,
                "vote_count": 3235,
                "character": "Male Ghoulie (uncredited)",
                "credit_id": "593e9b0b9251410587031c91",
                "order": 44
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Swedish born producer / director / actor, has been working in the entertainment business for 40+ years.\n\nHe spent 10 years of that time working in Hollywood, Los Angeles & New York, mostly in front of the camera as an actor and model. He has been producing TV programs, documentaries and events in London, New Delhi, Abu Dhabi, Baghdad, Middle East, Belgrade, Santos, Gothenburg and Stockholm. Mr. Magg is the founder and president of TMTV-TRADEMARK TV, a production company producing TV programs and content concepts for the entertainment industry, specializing in international TV formats and feature documentaries.\n\nMr. Magg is also the founder and CEO of TM Trademark Media AB a Swedish Film & TV rights and distribution company. TM specializes in human rights and current affair documentaries, as well as charitable fundraising TV concepts worldwide.  Mr. Magg co-created and produced a fundraising Interactive TV format “Bridges of Hope”, a TV program for UNICEF and Nelson Mandela’s “Global Movement for Children”.  The show has been successfully broadcast in the Pan Arab market, during the month of Ramadan, by Abu Dhabi Channel & Emirates Satellite Channel.  He has also produced …i Hetluften (Hotspots in Sweden), 24 episodes “docutainment” travel-program. A team of explorers visiting all the regions in Sweden, traveling in a Hot-Air balloon, made for SVT (Swedish Television Network). Another high rated TV-program-series, in the docutainment genre, was “Can we borrow a cup of sugar?”. The program host traveled in Europe and knocked on ordinary people’s doors, comparing manners and customs, in all the new neighbor countries of Sweden. Produced when the Swedes joined the European Union -96 (SVT).\n\n2008 he co-created the “GreenLife Project”, for IIMSAM – (Permanent Observer to the United Nations Economic and Social Council). The project was aimed to help the malnourished children in Fallujah, Iraq. The project in Iraq was a success and is now implemented to help the children in need in Kenya, Africa.\n\nIn the past 15 years he has directed, produced, and co-produced 38 documentaries and new ones are constantly in progress. All of them have premiered on SVT (Swedish National Broadcast Channel).  Mr. Magg has a large network of international contacts in Film, Television and Telecom market. His favorite expression is “the only problem I know about is NO PROBLEM”.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1832292,
        "imdb_id": "nm3602263",
        "known_for_department": "Acting",
        "name": "Gunnar Magg",
        "place_of_birth": "Hägersten, Stockholm, Sweden",
        "popularity": 0.0493,
        "profile_path": "/l7K1u235TKNoAQiwdtguAVBheTE.jpg"
    }
}