{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hExTiLbfB93HwEwkeQxb3q4nHtQ.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 1643,
                "original_language": "it",
                "original_title": "Ultimo tango a Parigi",
                "overview": "A recently widowed American begins an anonymous sexual relationship with a young Parisian woman.",
                "popularity": 3.2499,
                "poster_path": "/dNgdUdNOWfHsZI3lDu6Epig7H2P.jpg",
                "release_date": "1972-12-15",
                "title": "Last Tango in Paris",
                "video": false,
                "vote_average": 6.932,
                "vote_count": 1284,
                "character": "Rosa",
                "credit_id": "52fe4307c3a36847f80352c9",
                "order": 15
            },
            {
                "adult": false,
                "backdrop_path": "/ysCpbgA1zxOmkb1IWKzwhTxDxk3.jpg",
                "genre_ids": [
                    27
                ],
                "id": 19204,
                "original_language": "it",
                "original_title": "...E tu vivrai nel terrore! L'aldilà",
                "overview": "A young woman inherits an old hotel in Louisiana where, following a series of supernatural \"accidents\", she learns that the building was built over one of the entrances to Hell.",
                "popularity": 1.6328,
                "poster_path": "/kMSZHq9VYQV1FCbM8nz2zrZShzx.jpg",
                "release_date": "1981-04-22",
                "title": "The Beyond",
                "video": false,
                "vote_average": 6.913,
                "vote_count": 621,
                "character": "Martha",
                "credit_id": "5e99989e19ab59001248e90b",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Veronica Lazăr (6 October 1938 – 8 June 2014) was a Romanian-born Italian actress.\n\nLazăr was born in Bucharest in 1938. She graduated from the Caragiale Academy of Theatrical Arts and Cinematography (where she also obtained a degree in psychology, which she practiced until 1994, dealing mainly in couples therapy) and subsequently played roles in Romanian theatre [notably a run of Right You Are (if you think so) in 1963-64]. She fled her home country to escape communism and eventually settled in Italy in 1965. She managed to learn the Italian language in only a few weeks and had planned to move on to the United States or Israel, but became entranced with Rome. There, she met and married Italian actor Adolfo Celi with whom she had two children, director Leonardo Celi and actress Alessandra Celi.\n\nShe made her screen debut as Marlon Brando's deceased wife in Bernardo Bertolucci's Last Tango in Paris (1972), and also appeared in some of the director's subsequent films, La Luna (1979), The Sheltering Sky (1990), and Besieged (1998).\n\nLazăr is probably best known internationally for her role as the demonic Mater Tenebrarum in Dario Argento's Inferno (1980), as well as the ill-fated Martha in Lucio Fulci's The Beyond (1981). She later appeared in Argento's The Stendhal Syndrome (1996) in a role that was removed from the North American version (though she is still billed in the end credits). Her other films included Michelangelo Antonioni's Identification of a Woman (1982), My Sister and I (1987), Towards Evening (1990), The Prince's Manuscript (2000) and Ginostra (2002). She had an extensive career in (mostly) Italian television, where she was often the lead or one of the lead characters. Lazăr headlined the 1978 adaptation of The Elective Affinities, Giacinta (1980) and was a big part of the 1989 BBC miniseries Summer's Lease. Her last role was that of the main character Lorenzo's loving grandmother in Bertolucci's Me and You (2012).\n\nVeronica Lazăr was a renowned woman of culture and a cultural ambassador between Italian and Romanian cinema (the latter, a position she began in 1989). She was a linguistic interpreter and was seen as a symbolic figure with a protective aura by her countrymen in both Italy and Romania. She was also president of the Itaro Art Foundation and was instrumental in its 2007 retrospective on Romanian cinema held in Rome and Pisa. She was heavily involved with the acting students at Teatro Valle and often would cook meals for them at her home and bring them to the theatre. The students there nicknamed her \"Nonna Veronica.\"\n\nLazăr also coordinated the construction of a hospital in Mali over the course of a year, on orders of the Ministry of Foreign Affairs. When she returned to Italy, she brought with her African fabrics, statues, and carpets, many of which were still in her home when she died. Lazăr loved to play cards, share with her friends, and had a special affinity for the sea. At her funeral, she wanted her 18-year-old niece, a career musician already, to play the theme from Schindler's List throughout the Jewish cemetery in Prima Porta where she was laid to rest.\n\nDescription above from the Wikipedia article Veronica Lazăr, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1938-10-06",
        "deathday": "2014-05-08",
        "gender": 1,
        "homepage": null,
        "id": 18339,
        "imdb_id": "nm0493691",
        "known_for_department": "Acting",
        "name": "Veronica Lazăr",
        "place_of_birth": "Bucharest, Romania",
        "popularity": 0.3777,
        "profile_path": "/dnKrX2ICWB4Pe4EsbCpA8O6Nard.jpg"
    }
}