{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hExTiLbfB93HwEwkeQxb3q4nHtQ.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 1643,
                "original_language": "it",
                "original_title": "Ultimo tango a Parigi",
                "overview": "A recently widowed American begins an anonymous sexual relationship with a young Parisian woman.",
                "popularity": 3.2499,
                "poster_path": "/dNgdUdNOWfHsZI3lDu6Epig7H2P.jpg",
                "release_date": "1972-12-15",
                "title": "Last Tango in Paris",
                "video": false,
                "vote_average": 6.932,
                "vote_count": 1284,
                "character": "Marcel",
                "credit_id": "52fe4307c3a36847f80352cd",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/izUQSU7tCcx0k4xU3VARcKqy3pn.jpg",
                "genre_ids": [
                    35
                ],
                "id": 22826,
                "original_language": "it",
                "original_title": "Il mostro",
                "overview": "A vicious serial sex killer is on the loose, and landscape gardener and shop-window outfitter Loris is the prime suspect, thanks to his unfortunate habit of getting caught in compromising situations (for which there is always a totally innocent explanation that the police fail to spot). Undercover policewoman Jessica is assigned by eccentric police psychologist Taccone to follow Loris.",
                "popularity": 1.576,
                "poster_path": "/6h6ahipPd84QcyFbnsEikLt7w3Z.jpg",
                "release_date": "1994-10-22",
                "title": "The Monster",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 621,
                "character": "il condomino distinto",
                "credit_id": "59a6c7e1c3a36827f900d353",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Массимо Джиротти"
        ],
        "biography": "Massimo Girotti (18 May 1918 – 5 January 2003) was an Italian film actor whose career spanned seven decades.\n\nBorn in Mogliano, in the province of Macerata, Girotti developed his athletic physique by swimming and playing polo. While studying engineering, he attracted the attention of Mario Soldati, who offered him a small part in the film Dora Nelson (1939), but it was not until later, in Alessandro Blasetti's La corona di ferro (The Iron Crown) (1941) and Roberto Rossellini's Un Pilota ritorna (A Pilot Returns) (1942), that he began to make an impression as a serious actor. In 1943 came a turning point in his career when Luchino Visconti cast him opposite the torrid Clara Calamai in Ossessione (Obsession), an earlier adaptation of the same novel on which Hollywood's The Postman Always Rings Twice is based. The film marked, in a sense, the birth of Italian neo-realism. Some of his notable post-war films include Caccia tragica (The Tragic Hunt) (1946) by Giuseppe De Santis and In nome della legge (1949) (In the Name of the Law) by Pietro Germi.\n\nIn 1950, he starred opposite Lucia Bosé in Michelangelo Antonioni's first full-length feature, Cronaca di un amore (Story of a Love Affair) (1950). In 1953, he played Spartacus in an Italian epic film known in the US as Sins of Rome and then, returned to work again for Visconti, in Senso (1954), giving perhaps the finest performance of his career. In the years which followed, he appeared in many mainly Italian films for directors such as Lizzani, Bolognini, Vittorio Cottafavi, Lattuada, but it was not until 1968 that he once again played a role worthy of his talents - that of the father in Pasolini's Teorema (Theorem) with Terence Stamp and Silvana Mangano. Two years later, Pasolini cast him as Creonte opposite Maria Callas in his Medea (1969). In 1972, he was in Bernardo Bertolucci's Last Tango in Paris. That same year he made a rare appearance in a horror film when he agreed to a supporting role in Baron Blood as a favor to its director Mario Bava.\n\nHe continued to act in character roles for the next thirty years. Some of the films he appeared in have been notable, including Joseph Losey's Monsieur Klein (1976) with Alain Delon and Jeanne Moreau, Art of Love (1983) by Walerian Borowczyk, the 1985 television miniseries Quo Vadis?, Roberto Benigni's Il mostro (The Monster) (1994).\n\nHe died in Rome of a heart attack after having just completed his last film, Ferzan Özpetek's La Finestra di fronte (Facing Windows) (2003).\n\nSource: Article \"Massimo Girotti\" from Wikipedia in English, licensed under CC-BY-SA.",
        "birthday": "1918-05-18",
        "deathday": "2003-01-05",
        "gender": 2,
        "homepage": null,
        "id": 18340,
        "imdb_id": "nm0320988",
        "known_for_department": "Acting",
        "name": "Massimo Girotti",
        "place_of_birth": "Mogliano, Macerata, Italy",
        "popularity": 0.857,
        "profile_path": "/89Q04Xk6UfhGtKCxs4OoW4kJ3MN.jpg"
    }
}