{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uxezSInaPoH20CyHx4TuY1LzGly.jpg",
                "genre_ids": [
                    16,
                    35,
                    10751,
                    10770,
                    878,
                    12,
                    28,
                    10402
                ],
                "id": 71689,
                "original_language": "en",
                "original_title": "Phineas and Ferb The Movie: Across the 2nd Dimension",
                "overview": "Phineas and Ferb get trapped in an alternate dimension where the evil Doofenshmirtz rules the tri-state area. They must find a way back home with the help of their pet platypus named Perry, who they discover is a secret agent.",
                "popularity": 3.9881,
                "poster_path": "/updMFSOZwEftfkJRpozwBlRlYI2.jpg",
                "release_date": "2011-08-05",
                "title": "Phineas and Ferb The Movie: Across the 2nd Dimension",
                "video": false,
                "vote_average": 7.095,
                "vote_count": 580,
                "character": "Carl in Disguise (voice)",
                "credit_id": "5eb63d377d2bc1001dfadafc",
                "order": 28
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Loni Love (born July 14, 1967) is an American comedian, Emmy and NAACP Image Award-winning talk show host, actress, TV personality, author, and former electrical engineer.\n\nAfter graduating high school, she worked for a time on the General Motors assembly line putting doors on 1993 Oldsmobile Cutlasses, work which ignited her interest in electrical engineering. She then received her bachelor's degree in electrical engineering from Prairie View A&M University in Texas. She started doing stand-up during her college years.\n\nShe found work as an engineer at Xerox in California and she continued to do stand-up after work in clubs and became a regular at the Laugh Factory. After eight years of working at Xerox, Love resigned to pursue comedy during a layoff to prevent someone else from losing their job.\n\nLove did a series on VH1 called I Love the 2000s in which she gives her view on pop culture highlights. She was also a panelist in the late-night talk show Chelsea Lately. Love also appeared in an episode of Supermarket Sweep on July 24, 2000.\n\nLove started her comedic career in 2003, after appearing on Star Search, reaching the finals and was chosen runner-up in a close competition to winner John Roy. She was awarded the Jury Prize for best stand-up at the 2003 US Comedy Arts Festival. Since then, she has appeared in films and numerous television shows.\n\nIn 2008 Love became the CNN correspondent for D. L. Hughley Breaks the News and covered the inauguration of President Barack Obama. Love was named \"Hot Comic\" for 2009 in Campus Activity magazine and one of the \"Top 10 Comics to Watch\" in both Variety and Comedy Central. In late 2009, Love recorded her first one-hour Comedy Central special, America's Sister, which aired on May 8, 2010. In July 2013, she released her first comedy advice book titled \"Love Him Or Leave Him But Don't Get Stuck With The Tab\".\n\nFrom July 15, 2013 to June 3, 2022, Love served as one of the co-hosts of the syndicated daytime talk show The Real originally alongside Adrienne Bailon, Tamar Braxton, Jeannie Mai, and Tamera Mowry. In 2018, Love and her Real co-hosts won the Daytime Emmy Award for Outstanding Entertainment Talk Show Host for their work.\n\nIn 2015, she appeared in the comedy film Paul Blart: Mall Cop 2, with Kevin James, and the action film Bad Asses on the Bayou, with Danny Trejo and Danny Glover. In 2016, she appeared as a contestant on the ninth season of Worst Cooks in America, competing for $50,000 for her chosen charity.\n\nIn 2020 during the COVID-19 pandemic, Love hosts a show on Instagram Live under the hashtag #quarantinewithloni. Since January 2021, Love has been a recurring guest judge on Season 13 of Rupaul's Drag Race.",
        "birthday": "1967-07-14",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 183490,
        "imdb_id": "nm1065902",
        "known_for_department": "Acting",
        "name": "Loni Love",
        "place_of_birth": "Detroit, Michigan, USA",
        "popularity": 0.1668,
        "profile_path": "/hXrXjEJHpqmNFOR7RDIrChbnGrq.jpg"
    }
}