{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ztiFxuG0gC6wQ8y7JZFYbCQyN4Y.jpg",
                "genre_ids": [
                    10751,
                    35,
                    10402,
                    16
                ],
                "id": 438695,
                "original_language": "en",
                "original_title": "Sing 2",
                "overview": "Buster and his new cast now have their sights set on debuting a new show at the Crystal Tower Theater in glamorous Redshore City. But with no connections, he and his singers must sneak into the Crystal Entertainment offices, run by the ruthless wolf mogul Jimmy Crystal, where the gang pitches the ridiculous idea of casting the lion rock legend Clay Calloway in their show. Buster must embark on a quest to find the now-isolated Clay and persuade him to return to the stage.",
                "popularity": 12.3504,
                "poster_path": "/aWeKITRFbbwY8txG5uCj4rMCfSP.jpg",
                "release_date": "2021-12-01",
                "title": "Sing 2",
                "video": false,
                "vote_average": 7.845,
                "vote_count": 4617,
                "character": "Linda Le Bon (voice)",
                "credit_id": "61c3e00121621d006474ff7b",
                "order": 17
            },
            {
                "adult": false,
                "backdrop_path": "/xUWf5xX0AnZgAnYXAMk03zTbsef.jpg",
                "genre_ids": [
                    35,
                    10749,
                    18
                ],
                "id": 508,
                "original_language": "en",
                "original_title": "Love Actually",
                "overview": "Eight very different couples deal with their love lives in various loosely interrelated tales all set during a frantic month before Christmas in London.",
                "popularity": 6.624,
                "poster_path": "/7QPeVsr9rcFU9Gl90yg0gTOTpVv.jpg",
                "release_date": "2003-09-07",
                "title": "Love Actually",
                "video": false,
                "vote_average": 7.105,
                "vote_count": 7038,
                "character": "Nancy the Caterer",
                "credit_id": "63a30b8d4f33ad008c025289",
                "order": 33
            },
            {
                "adult": false,
                "backdrop_path": "/bVmDpF2VzVivzH8GVFXfVJeRPd7.jpg",
                "genre_ids": [
                    35,
                    80,
                    18
                ],
                "id": 37495,
                "original_language": "en",
                "original_title": "Four Lions",
                "overview": "Four Lions tells the story of a group of British jihadists who push their abstract dreams of glory to the breaking point. As the wheels fly off, and their competing ideologies clash, what emerges is an emotionally engaging (and entirely plausible) farce.",
                "popularity": 4.5674,
                "poster_path": "/x4JzaRPXBs9wiHCe3e3ymXWuwfd.jpg",
                "release_date": "2010-05-07",
                "title": "Four Lions",
                "video": false,
                "vote_average": 6.95,
                "vote_count": 1199,
                "character": "Alice",
                "credit_id": "56674996c3a36808ec001c22",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/vpRMzPqHC03I7hPPET4Av2OT8dI.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 400617,
                "original_language": "en",
                "original_title": "Phantom Thread",
                "overview": "In 1950s London, a renowned dressmaker's meticulous lifestyle begins drastically changing as his relationship with his young muse intensifies.",
                "popularity": 5.4096,
                "poster_path": "/hgoWjp9Sh0MI97eAMZCnIoVfgvq.jpg",
                "release_date": "2017-12-25",
                "title": "Phantom Thread",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 3600,
                "character": "Lady Baltimore",
                "credit_id": "59ee0b4fc3a36871bc0297a4",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/wb34q3VgzHgL8frVMywrN3wXmqx.jpg",
                "genre_ids": [
                    27,
                    35
                ],
                "id": 747,
                "original_language": "en",
                "original_title": "Shaun of the Dead",
                "overview": "Shaun lives a supremely uneventful life, which revolves around his girlfriend, his mother, and, above all, his local pub. This gentle routine is threatened when the dead return to life and make strenuous attempts to snack on ordinary Londoners.",
                "popularity": 6.1682,
                "poster_path": "/dgXPhzNJH8HFTBjXPB177yNx6RI.jpg",
                "release_date": "2004-04-09",
                "title": "Shaun of the Dead",
                "video": false,
                "vote_average": 7.537,
                "vote_count": 8873,
                "character": "News Reporter (voice) (uncredited)",
                "credit_id": "5baa366dc3a36839fe018663",
                "order": 55
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Джулія Дейвіс"
        ],
        "biography": "Julia Charlotte L. Davis is an English actress, comedian, director and writer.  A nine-time BAFTA TV Award nominee, she won Best Comedy Writing for Hunderby in 2013 and the 2018 British Academy Television Award for Best Scripted Comedy for Sally4Ever. She has also received two RTS Awards and three British Comedy Awards. In addition to acting in her own works, she has appeared in a variety of other British television comedies, most notably portraying Dawn Sutcliffe in Gavin & Stacey (2007–2009, 2019, 2024). Her film roles include Love Actually (2003), Cemetery Junction (2010), Four Lions (2010), and Phantom Thread (2017).\n\nJulia Davis was born in Guildford, Surrey on August 25, 1966 Her mother was a secretary, and her father a civil servant. She grew up in Guildford, Surrey, before moving at the age of 14 to Bath in Somerset. She was raised in the Church of England.\n\nAfter studying for a degree in English and drama at the College of Ripon and York St John, she returned to Bath working \"dead-end jobs\", starting a comedy double-act The Sisters of Percy with her friend Jane Roth at a local theatre group. It grew into an improv troupe with Welsh radio DJ Rob Brydon and Ruth Jones.\n\nDavis decided to become a comedian after a long illness. She secured her first comedy commission, Five Squeezy Pieces, from BBC Radio 4 in 1998.\n\nThe series was an all-female sketch comedy show, with Meera Syal, Arabella Weir, Maria McErlane, and Claire Calman.\n\nShe first appeared on television in 1998 in the BBC sketch show Comedy Nation. During their radio sketch series Five Squeezy Pieces, Arabella Weir introduced Davis to Arthur Mathews and Graham Linehan who cast her as a regular cast member in the television sketch show Big Train (1998).  Her career gained a further boost in 1998 after she sent a tape of various characters to Steve Coogan, who invited her to write for and participate in his shows during his 1998 national tour. Chris Morris, director of the Big Train pilot, cast her for his 1997–1999 radio series Blue Jam, its successor March–April 2000 TV show Jam, and Brass Eye. Davis went on to appear in many comedy television shows including I'm Alan Partridge, I Am Not an Animal, Dr. Terrible's House of Horrible, Ideal and Nathan Barley.\n\nIn 2004 and 2005, Davis wrote and starred in two series of the BBC Three dark comedy Nighty Night. The show is centred on her character of peroxide \"blonde\" sociopathic beauty therapist Jill Tyrell.\n\nIn 2015, Davis and Marc Wootton created and starred in BBC Radio 4 comedy series Couples, about couples in therapy. It was reported in 2015 that Davis had been commissioned for a new series, Robin's Test, which was later renamed Camping.\n\nIn 2016, Davis wrote, directed and starred as shallow nymphomaniac \"Fay\" in Camping on Sky Atlantic. This was her directorial debut. At the 2017 BAFTA TV Awards, Camping was nominated for Best Scripted Comedy. In 2017, Davis was featured in the Paul Thomas Anderson film Phantom Thread as Lady Baltimore.",
        "birthday": "1966-08-25",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.independenttalent.com/actors/julia-davis/",
        "id": 1836,
        "imdb_id": "nm0204919",
        "known_for_department": "Acting",
        "name": "Julia Davis",
        "place_of_birth": "Guildford, Surrey, England, UK",
        "popularity": 0.9381,
        "profile_path": "/wsUNCSKoNQTgSdlr9FIeIR6hRAd.jpg"
    }
}