{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lMjY6kMBOHhloz2Ul16fLJn8xuw.jpg",
                "genre_ids": [
                    18,
                    10752
                ],
                "id": 591538,
                "original_language": "en",
                "original_title": "The Tragedy of Macbeth",
                "overview": "Macbeth, the Thane of Glamis, receives a prophecy from a trio of witches that one day he will become King of Scotland. Consumed by ambition and spurred to action by his wife, Macbeth murders his king and takes the throne for himself.",
                "popularity": 3.9462,
                "poster_path": "/tDNJEhcLbX3jIk3BMCur9pCdaVD.jpg",
                "release_date": "2021-12-05",
                "title": "The Tragedy of Macbeth",
                "video": false,
                "vote_average": 6.925,
                "vote_count": 822,
                "character": "Doctor",
                "credit_id": "616ca1f39715ae0088011826",
                "order": 21
            },
            {
                "adult": false,
                "backdrop_path": "/12RXkIWUXwOHXgAmlxJNIWRGrri.jpg",
                "genre_ids": [
                    37,
                    35,
                    18,
                    10402,
                    9648,
                    10749
                ],
                "id": 537996,
                "original_language": "en",
                "original_title": "The Ballad of Buster Scruggs",
                "overview": "Vignettes weaving together the stories of six individuals in the old West at the end of the Civil War. Following the tales of a sharp-shooting songster, a wannabe bank robber, two weary traveling performers, a lone gold prospector, a woman traveling the West to an uncertain future, and a motley crew of strangers undertaking a carriage ride.",
                "popularity": 7.5214,
                "poster_path": "/voxl654m7p36y8FLu8oQD7dfwwK.jpg",
                "release_date": "2018-11-09",
                "title": "The Ballad of Buster Scruggs",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 4225,
                "character": "Gilbert Longabaugh (segment \"The Gal Who Got Rattled\")",
                "credit_id": "5bef4a26c3a36818a302528a",
                "order": 34
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Lewis Jefferson Mays"
        ],
        "biography": "Jefferson Mays (born Lewis Jefferson Mays; June 8, 1965) is an American film, stage and television actor.\n\nMays was raised in Clinton, Connecticut with his parents, a naval intelligence officer and a children's librarian, and his siblings. Mays graduated from Yale College, where he received a Bachelor of Arts degree, and the University of California, San Diego, where he earned a Master of Fine Arts.\n\nMays appeared on Broadway in I Am My Own Wife, a Pulitzer Prize-winning play by Doug Wright, from November 2003 (previews) to October 31, 2004. He had appeared in the play Off-Broadway at Playwrights Horizons in May 2003, and at the La Jolla Playhouse in July 2001. \n\nMays won the 2004 Tony Award for Best Performance by a Leading Actor in a Play, the 2004 Drama Desk Award for Outstanding One-Person Show, an Obie Award, and a 2004 Theatre World Award for his solo performance. He also won the 2007 Helpmann Award for Best Male Actor in a Play for seasons of I Am My Own Wife in Australia in 2006.\n\nIn 2007, he appeared as Henry Higgins in a revival of Pygmalion and starred as Private Mason in a revival of Journey's End. In August 2009, Mays appeared at the Williamstown Theatre Festival in Quartermaine's Terms by Simon Grey.  \n\nMays starred in the 2013 Broadway musical A Gentleman's Guide to Love and Murder, in which he played eight roles. He won the Outer Critics Circle Award for Outstanding Actor in a Musical. He also was nominated for the Tony Award for Best Performance by a Leading Actor in a Musical and tied for the Drama Desk Award for Outstanding Actor in a Musical (with Neil Patrick Harris).",
        "birthday": "1965-06-08",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 183814,
        "imdb_id": "nm0563070",
        "known_for_department": "Acting",
        "name": "Jefferson Mays",
        "place_of_birth": "Connecticut, USA",
        "popularity": 0.1647,
        "profile_path": "/5W9RapvctoJpGfjaQFQHsaLlGc9.jpg"
    }
}