{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/eLqQ6RleEKUBbqsxQvfJK2iOuVy.jpg",
                "genre_ids": [
                    28,
                    35,
                    53
                ],
                "id": 457332,
                "original_language": "en",
                "original_title": "Hidden Strike",
                "overview": "Two elite soldiers must escort civilians through a gauntlet of gunfire and explosions.",
                "popularity": 4.9951,
                "poster_path": "/zsbolOkw8RhTU4DKOrpf4M7KCmi.jpg",
                "release_date": "2023-07-06",
                "title": "Hidden Strike",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 1022,
                "character": "Assistant Ning",
                "credit_id": "64c3797cec370c00e2a65ddd",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Neo Hou",
            "Minghao Hou",
            "Hou Ming Hao",
            "Hầu Minh Hạo",
            "هائو مینگ‌هو",
            "خائو مینگ‌خائو"
        ],
        "biography": "Neo Hou is a Chinese actor and pop singer from Beijing, China. He graduated from the Beijing Contemporary Music Academy (北京現代音樂研修學院). He debuted on December 12, 2014, as a member of the boy group Fresh Geek Youth (新鮮娛樂), releasing their first album \"UP 4 U.\" He left the group on January 11, 2016, to pursue a solo career in acting and music.\n\nBorn into a military family with a three-generation military background, he began learning the accordion at age four, winning several first-place awards in Beijing competitions over eight years. In 2012, at 15, he became a trainee at South Korea's SM Entertainment (SM엔터테인먼트) for a year and a half. He later returned to China in 2014 to join Shang Wenjie Studio (尚雯婕工作室), where he was selected as a trainee through Shang Laoban’s Trainee (尚老板的练习生).\n\nDuring his time with Fresh Geek Youth, the group won the Best New Group Award at the 22nd Eastern Wind and Cloud Music Awards (東風雲歌大獎) in 2015. In 2015, he also filmed his debut movie, \"Funny Soccer\" (笑林足球). In 2016, he released his first self-written single, \"Super Dad\" (超能奶爸), on July 11.\n\nHe won the Potential TV Actor of the Year award at the 2018 Tencent Video Starlight Awards (腾讯视频星光大赏) on December 18. He was affiliated with Black Gold Fashion (黑金時尚) during his time with Fresh Geek Youth from 2014 to 2016 and with Black Gold Entertainment (黑金娛樂) from 2016 to 2021. Since December 27, 2021, he has been with Hesong Media (和松传媒).",
        "birthday": "1997-08-03",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1844511,
        "imdb_id": "nm8889686",
        "known_for_department": "Acting",
        "name": "Hou Minghao",
        "place_of_birth": "Beijing, China",
        "popularity": 2.0966,
        "profile_path": "/qaVcbHiulXY47v6zhc4qbxNrnNm.jpg"
    }
}