{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5PfHGXosySGs0l1JfeREspy3v6G.jpg",
                "genre_ids": [
                    878,
                    28,
                    12
                ],
                "id": 1924,
                "original_language": "en",
                "original_title": "Superman",
                "overview": "Mild-mannered Clark Kent works as a reporter at the Daily Planet alongside his crush, Lois Lane. Clark must summon his superhero alter-ego when the nefarious Lex Luthor launches a plan to take over the world.",
                "popularity": 9.8184,
                "poster_path": "/d7px1FQxW4tngdACVRsCSaZq0Xl.jpg",
                "release_date": "1978-12-14",
                "title": "Superman",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 4067,
                "character": "1st Crewman",
                "credit_id": "57defa4fc3a3681dc8000e07",
                "order": 58
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Lawrence Trimble, born 1938 was a versatile actor of tremendous presence, a gifted writer, raconteur, wit, original thinker, music lover, explorer and sovereign citizen from Oregon who had a European sensibility and whose acting career was mostly based in the UK and Europe and also worked in the US.  He trained at Central School of Speech and Drama and joined the National Theatre, where he was the first American to be invited to be a permanent member, though he decided to move on after a few years.  In addition to some National Theatre productions, he worked with the Liverpool Playhouse where he had some starring parts in plays such as 'The Glass Menagerie' and 'Barefoot in the park', acted in some episodic television, often playing mysterious characters.  Self taught fluent in French from his years in France, he also co=starred in two French films, most famously 'Blanche' directed by Walerian Borowzcyck in which he played Nicholas, the beautiful, pure of heart, love-sick son of the Baron played by Michel Simon.  His scenes with the lead actress Ligia Branice are the most grippingly emotional within this extraordinary film that immerses one in the atmosphere and ethos of the Middle Ages in France and considered Borowzcyck's  masterpiece.  Blanche was an art house success rather than a commercial hit, critically acclaimed and  artistically respected.  Blanche played in the UK and around Europe, enjoying a year run at the Pullman in London.  After 'Blanche' Lawrence worked with Alain Fleischer in 'Les Rendevous au foret'  co-starring with Catherine Jourdan. Renée Gardès and Heinz Bennent.  He could have continued to work in French productions but decided to keep working in the UK where, in addition to acting on stage and some TV (The Saint and Father Brown), he did some ad hoc  journalism (Harpers & Queen), wrote album notes for jazz records and due to his rich deep voice, occasional voiceover work.  Lawrence was a cultural maverick and part of as well as integral to many scenes, socially and philosophically.  Lawrence was working in London in the 60's and 70's, then for a few years in the early 80's. It was during this time, finding the quality of work less interesting and inspiring than what was available in Europe, he became more immersed in writing, script writing in particular.  He was very much a history buff and socio-political critic, with Libertarian ideals at the same time as having a spiritual and romantic nature.  Lawrence wrote several scripts and collaborated on two which sadly he was not to be given credit for, which became hugely successful, but although his ideas and writing was integral to the  film(s) in question and their success, he was completely ghosted.  For legal reasons, it is not possible to say more than this, but the truth will come out one day.\n\nLawrence was  part of was the documentary made about Chet Baker directed by Bruce Weber.  The production looked for and found him and his contribution to the film is significant.  He is interviewed and provides key insights, and his voice and ideas narrates various footage which was included because of the topics he raised.  This bio is a work in progress which will be edited and added to by the author, one of Lawrence's two daughters.  Photographs will also be provided in due course.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 184752,
        "imdb_id": "nm0872869",
        "known_for_department": "Acting",
        "name": "Lawrence Trimble",
        "place_of_birth": null,
        "popularity": 0.1826,
        "profile_path": null
    }
}