{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9jxLUKbuDgYW8Ro94q50rLQQL0P.jpg",
                "genre_ids": [
                    12,
                    10751,
                    14
                ],
                "id": 11639,
                "original_language": "en",
                "original_title": "The Dark Crystal",
                "overview": "On another planet in the distant past, a Gelfling embarks on a quest to find the missing shard of a magical crystal and restore order to his world, before the grotesque race of Skeksis find and use the crystal for evil.",
                "popularity": 3.584,
                "poster_path": "/6g1Kh73qQRosyhRJpL3euQpMxOE.jpg",
                "release_date": "1982-12-17",
                "title": "The Dark Crystal",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 1187,
                "character": "General (voice)",
                "credit_id": "60f8b0a63103250046ce8330",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Michael Kilgarriff (born 16 June 1937)is a British actor, author and pianist from Brighton. As an actor, he is well known for his rich voice and height. His film and television roles include The Dark Crystal (1982) as the General, and the Doctor Who serials The Tomb of the Cybermen (1967), Robot (1974–75) and Attack of the Cybermen (1985).\n\nAt six feet five inches (1.96 m) tall, he is sought for certain roles, such as the Cyber Controller in Doctor Who, a role he played in 1967 and 1985. He appeared in the same series as an Ogron (1973) and as the eponymous K1 Robot in the story Robot (1974–75).\n\nHe returned to play the K1 robot in the Big Finish Productions Bernice Summerfield audio adventure The Relics of Jegg-Sau. He did voice work for The Twelve Tasks of Asterix as Obelix, the Jim Henson movie The Dark Crystal (1982) as SkekUng, the Garthim master (Named \"The General\" in the movie), was film director Joe Steiner in the UFO episode \"Conflict\", and played the part of the Green King in the BBC Television serial The Moon Stallion (1978). In 1979, he provided voices for several characters in the cult television adventure series \"Monkey\" when it was dubbed into English. These were invariably gruff, often villainous characters, including warlords and demons.",
        "birthday": "1937-06-16",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 184970,
        "imdb_id": "nm0453023",
        "known_for_department": "Acting",
        "name": "Michael Kilgarriff",
        "place_of_birth": "Brighton, East Sussex, England, UK",
        "popularity": 0.9167,
        "profile_path": null
    }
}