{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/acvE3RWjDLgvbL2RtcyzkrsAyNV.jpg",
                "genre_ids": [
                    80,
                    36,
                    18
                ],
                "id": 466420,
                "original_language": "en",
                "original_title": "Killers of the Flower Moon",
                "overview": "When oil is discovered in 1920s Oklahoma under Osage Nation land, the Osage people are murdered one by one—until the FBI steps in to unravel the mystery.",
                "popularity": 10.9118,
                "poster_path": "/dB6Krk806zeqd0YNp2ngQ9zXteH.jpg",
                "release_date": "2023-10-18",
                "title": "Killers of the Flower Moon",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 3761,
                "character": "2nd Insurance Man",
                "credit_id": "6532b4d3b2681f011ba483b9",
                "order": 143
            },
            {
                "adult": false,
                "backdrop_path": "/t1AHkwkmNK18mNJTfu3reeIc2fZ.jpg",
                "genre_ids": [
                    18,
                    53,
                    9648
                ],
                "id": 651070,
                "original_language": "en",
                "original_title": "A Fall from Grace",
                "overview": "When a law-abiding woman gets indicted for murdering her husband, her lawyer soon realizes that a larger conspiracy may be at work.",
                "popularity": 5.3238,
                "poster_path": "/h47JJZ015VF4neia33AFwTU37Yb.jpg",
                "release_date": "2020-01-17",
                "title": "A Fall from Grace",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 953,
                "character": "Detective Marshall Thomas",
                "credit_id": "5e397e91d1a8930016d01a99",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "James Healy"
        ],
        "biography": "James Healy Jr. Originally from Texas James began his acting career at the age of 15 doing local theatre and obtaining his first Theatrical Agent. He qualified to join the Screen Actors Guild with his first \"one liner\" on the \"who shot Jr\" episode of Dallas in 1980.\n\nA theatre major in college, James fell in love with Claire Barney-Healy, who he has been married to since 1984.\n\nNever giving up on his pursuit of being an actor, the need for a young married man to have a 9 to 5 job, lead James to become a police officer in 1983. During the next 30 years he worked as a patrol officer, SWAT team member, Detective, and Sergeant. In 2008 he became a Chief of Police and remained in that position until his retirement from Law Enforcement in 2016.\n\nSome of the first roles James booked when he moved to Los Angeles in 1995 were an ABC after school special and a small role on News Radio, where he was lucky to have met and worked with Phil Hartman. Other LA credits included The District, That's so Raven, The Division and Guest Roles on Will & Grace, Judging Amy and a recurring role on Even Stevens starring Shia Labeouf.\n\nJames, who has a master's degree in Criminal Justice, has also been a professor at the University of Texas at Arlington as well as an Instructor for the Regional Police Academy. Because of this, in 2006 James went to Afghanistan for a year working for the Dept. of State, hired to train Afghan Police Command Staff and Officers after the war.\n\nSince retiring James has gone back into acting full time! James spends a lot of time on the road. Recent Bookings include Dust with Sarah Paulson, Killers of the Flower Moon with Robert De Niro, Directed by Martin Scorsese, Law and Order SVU, Leverage, Billions, East NY, Bull, Manhunt and 6 episodes of the limited series, A Thousand Tomorrows.\n\nJames and Claire have one daughter, Virginia (Jenny) Rose Healy, born in 2003. There son James Healy III passed away in 1986.",
        "birthday": "1961-12-30",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1850474,
        "imdb_id": "nm0372289",
        "known_for_department": "Acting",
        "name": "James Healy Jr.",
        "place_of_birth": "San Antonio, Texas, USA",
        "popularity": 0.2624,
        "profile_path": "/m2mdOWVXSpqaa1WFe0RiFFzYR7N.jpg"
    }
}