{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/um7DVcGyLvImgAdn5JGpjIudYSV.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 454652,
                "original_language": "en",
                "original_title": "Colette",
                "overview": "After marrying a successful Parisian writer known commonly as Willy, Sidonie-Gabrielle Colette is transplanted from her childhood home in rural France to the intellectual and artistic splendor of Paris. Soon after, Willy convinces Colette to ghostwrite for him. She pens a semi-autobiographical novel about a witty and brazen country girl named Claudine, sparking a bestseller and a cultural sensation. After its success, Colette and Willy become the talk of Paris and their adventures inspire additional Claudine novels.",
                "popularity": 3.0312,
                "poster_path": "/z73Wer1DgObAwWnqZlOyeI33ROY.jpg",
                "release_date": "2018-09-21",
                "title": "Colette",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 922,
                "character": "Jeanne De Caillavet",
                "credit_id": "596664b4c3a368293b137db0",
                "order": 25
            },
            {
                "adult": false,
                "backdrop_path": "/b0PlSFdDwbyK0cf5RxwDpaOJQvQ.jpg",
                "genre_ids": [
                    80,
                    9648,
                    53
                ],
                "id": 414906,
                "original_language": "en",
                "original_title": "The Batman",
                "overview": "In his second year of fighting crime, Batman uncovers corruption in Gotham City that connects to his own family while facing a serial killer known as the Riddler.",
                "popularity": 21.1918,
                "poster_path": "/74xTEgt7R36Fpooo50r9T25onhq.jpg",
                "release_date": "2022-03-01",
                "title": "The Batman",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 11225,
                "character": "Carla",
                "credit_id": "60b3b14aa0664500413fad84",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Janine Harouni is a UK-based American stand-up comedian and actress.  Harouni was raised in Staten Island, New York City by a Lebanese-American father and a mother of Irish and Italian ancestry. In 2009, Harouni was grievously injured when a car crashed into a parked vehicle she was in, breaking her pelvis, femur, legs, and wrists. She moved to London in 2012.\n\nIn 2018, Harouni won the Laughing Horse New Act of the Year. She won the BBC New Comedy Award in 2019\n\nIn 2019, Harouni performed a well received debut show, Stand Up with Janine Harouni (Please Remain Seated) at the Edinburgh Festival Fringe.\n\nShe was nominated for the Best Newcomer Award at that year's Edinburgh Comedy Awards. She returned to the Fringe in 2023, performing Man'oushe while heavily pregnant, and was nominated for the main Edinburgh Comedy Award.\n\nHarouni played Thalia in the ITV show Buffering from 2021–2023, and appeared as Carla Diaz in The Batman (2022).",
        "birthday": "1988-01-03",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.janineharouni.com/",
        "id": 1850089,
        "imdb_id": "nm8940462",
        "known_for_department": "Acting",
        "name": "Janine Harouni",
        "place_of_birth": "Staten Island, New York, USA",
        "popularity": 0.1008,
        "profile_path": "/bQ8Ht9x4e75LtNg5PdphtCuAOcW.jpg"
    }
}