{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gKk8Bg4qpHfniAJC3phzCZpkaIg.jpg",
                "genre_ids": [
                    27,
                    14
                ],
                "id": 501170,
                "original_language": "en",
                "original_title": "Doctor Sleep",
                "overview": "Still scarred by the trauma he endured as a child at the Overlook Hotel, Dan Torrance faces the ghosts of the past when he meets Abra, a courageous teen who desperately needs his help -- and who possesses a powerful extrasensory ability called the \"shine\".",
                "popularity": 5.5697,
                "poster_path": "/p69QzIBbN06aTYqRRiCOY1emNBh.jpg",
                "release_date": "2019-10-30",
                "title": "Doctor Sleep",
                "video": false,
                "vote_average": 7.142,
                "vote_count": 4649,
                "character": "Apron Annie",
                "credit_id": "5bdc12750e0a26333a008dc8",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Originally from the US Virgin Island of St. Croix, actress Selena Anduze is the youngest of three children. She has been a performing artist since age 7. At age 9 she was the youngest performer to win the title of \"Miss U.S. Virgin Islands\" at the World Modeling Association (WMA) talent awards in New York City. Selena moved to the US as a teenager and performed in numerous regional theaters, while concentrating on an arts and sciences education. She graduated with a Bachelor of Arts from Wesleyan University and a Masters/PhD in Health Sciences from Clayton College. She also holds certifications in healing arts and writing. In addition to coaching and career consulting for fellow actors and artists, Selena sits on the Atlanta SAG-AFTRA board and two TV/Film committees as an advocate for diversity both in front of and behind the lens.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1853396,
        "imdb_id": "nm5992241",
        "known_for_department": "Acting",
        "name": "Selena Anduze",
        "place_of_birth": null,
        "popularity": 0.2638,
        "profile_path": "/15m6yIUm9NxFIwkVLR92Thri7nf.jpg"
    }
}