{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mRM2NB0i3wv4HqxXvwIjEVi4Qqq.jpg",
                "genre_ids": [
                    12,
                    18,
                    28
                ],
                "id": 254,
                "original_language": "en",
                "original_title": "King Kong",
                "overview": "In 1933 New York, an overly ambitious movie producer coerces his cast and hired ship crew to travel to mysterious Skull Island, where they encounter Kong, a giant ape who is immediately smitten with the leading lady.",
                "popularity": 9.3956,
                "poster_path": "/qVCZtwBGls866wBb4PAfYtAjyr8.jpg",
                "release_date": "2005-12-12",
                "title": "King Kong",
                "video": false,
                "vote_average": 6.89,
                "vote_count": 8185,
                "character": "Venture Crew - Helmsman",
                "credit_id": "5e9ea72eeec5b5001c416f2a",
                "order": 38
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Eteocles",
            "Chief Executioner",
            "Bledar"
        ],
        "biography": "Woolf and his family arrived in New Zealand in 1962 when he was 17. He had sung in rock bands in his native Dagenham in Essex since the age of 13, and after a few appearances at Auckland dance halls was signed to Zodiac Records and began recording.\n\nThroughout the 1970s he featured on a string of pop shows such as In the Groove, On the Beat Side, C'Mon and Happen Inn. Later, he had his own chat show, The Ray Woolf Show, which had its own live band and audience.\n\nWoolf also presented New Zealand children's show Playschool for 18 months, sticking by the philosophy of taking any opportunity that came his way. Hosting the show allowed Woolf more freedom than the structured pop shows he was used to.\n\nOne of his favourite acting roles was when he played the helmsman of the steamship Venture in Peter Jackson's Кинг Конг (2005), released in 2005. He had the occasional line in the movie but his actual screen time was quite short. He liked the job due to the good company on it.\n\nWoolf is a member of the New Zealand Order of Merit for services to entertainment and has also starred in shows like The Sound of Music (2004), West Side Story and The New Rocky Horror Show. He has collaborated with a range of musicians over the years, and some of his more ongoing gigs have been with the jazzy Rodger Fox Big Band.\n\nWoolf is on the pension these days but is still adamant that he will keep on entertaining and that nothing will change despite the regular pay cheques from the government.",
        "birthday": "1945-11-13",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.actors.co.nz/search/Ray-Woolf%20(MNZM)",
        "id": 1855326,
        "imdb_id": "nm0941167",
        "known_for_department": "Acting",
        "name": "Ray Woolf",
        "place_of_birth": "Great Britain",
        "popularity": 0.0286,
        "profile_path": "/jup9RBRRwMRL8av5BtpNZb1NoLg.jpg"
    }
}