{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/a53EGF0NzHRGKuRItsrtXBM8FCD.jpg",
                "genre_ids": [
                    35,
                    878,
                    14,
                    27
                ],
                "id": 36685,
                "original_language": "en",
                "original_title": "The Rocky Horror Picture Show",
                "overview": "After getting a flat tire in the middle of nowhere, newly engaged couple Brad and Janet encounter the eerie mansion of the flamboyant, seductive Dr. Frank-N-Furter and a variety of eccentric characters. Through elaborate dance and rock music, the mad scientist unveils his latest creation: a perfect, muscular man.",
                "popularity": 4.7666,
                "poster_path": "/3pyE6ZqDbuJi7zrNzzQzcKTWdmN.jpg",
                "release_date": "1975-08-14",
                "title": "The Rocky Horror Picture Show",
                "video": false,
                "vote_average": 7.445,
                "vote_count": 2954,
                "character": "The Transylvanians (uncredited)",
                "credit_id": "5d312f1a6a300b1834a5ae77",
                "order": 32
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Rufus Collins was a member of the renowned experimental theatre troupe, The Living Theatre, in the late 1960s and studied acting at the Central School of Speech and Drama in London, England, with a background in dance. In 1972, he was the choreographer for Robert Stigwood's U.K. stage production of Jesus Christ Superstar where he worked briefly with Richard O'Brien. Lasting friendship with various persons lead to his appearance in The Rocky Horror Picture Show in 1975 and Shock Treatment in 1981. Collins' next project had him join with Jim Sharman and Brian Thomson as director of their stage version Joseph and the Amazing Technicolor Dreamcoat. He followed that up by directing a revival of Hair. Rocky Horror fans may be amused to know he appeared in \"The Hunger\" with Susan Sarandon and Clifford DeYoung. Collins also appeared in a number of Andy Warhol films, including \"Kiss.\"",
        "birthday": "1935-08-11",
        "deathday": "1996-10-04",
        "gender": 2,
        "homepage": null,
        "id": 185950,
        "imdb_id": "nm0172659",
        "known_for_department": "Acting",
        "name": "Rufus Collins",
        "place_of_birth": "New York, New York",
        "popularity": 0.0773,
        "profile_path": "/m8pp3WlpEqASgQHIb6ACXRTyU94.jpg"
    }
}