{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/stiGp1XzkLSYdUUEWTyQOZRkr49.jpg",
                "genre_ids": [
                    18
                ],
                "id": 3782,
                "original_language": "ja",
                "original_title": "生きる",
                "overview": "Kanji Watanabe is a middle-aged man who has worked in the same monotonous bureaucratic position for decades. Learning he has cancer, he starts to look for the meaning of his life.",
                "popularity": 4.3494,
                "poster_path": "/dgNTS4EQDDVfkzJI5msKuHu2Ei3.jpg",
                "release_date": "1952-10-09",
                "title": "Ikiru",
                "video": false,
                "vote_average": 8.305,
                "vote_count": 1234,
                "character": "Jazz Bar Guest (uncredited)",
                "credit_id": "5eaaf00a514c4a00218dd7d8",
                "order": 58
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Hiroshi Koizumi"
        ],
        "biography": "Hiroshi Koizumi (小泉博, Koizumi Hiroshi, birth name written as 小泉 汪) (12 August 1926 – 31 May 2015) was a Japanese actor, best known for his starring role in the 1955 film Godzilla Raids Again as well as other Toho Studios monster movies. He was born in Japan. He is a graduate of Keio University in Tokyo.\n\nIn a 1999 interview with Steve Ryfle, Koizumi laments that while he stated he has easy parts to play, he felt he could have done more in his performances. Despite his roles where he usually plays a scientist, he plays a powerful role in Late Chrysanthemums, playing a young man that married an older wealthy woman to escape from the slums. On 31 May 2015, Koizumi died at a hospital in Tokyo from pneumonia at the age of 88.\n\nDescription above from the Wikipedia article Hiroshi Koizumi, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1926-08-12",
        "deathday": "2015-05-31",
        "gender": 2,
        "homepage": null,
        "id": 18607,
        "imdb_id": "nm0463590",
        "known_for_department": "Acting",
        "name": "Hiroshi Koizumi",
        "place_of_birth": "Kamakura, Japan",
        "popularity": 0.4433,
        "profile_path": "/37i54gRXt1mvLXt9K7dxlXmPee6.jpg"
    }
}