{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mSyQoValhBsJdq3JNGXJww2Q5yL.jpg",
                "genre_ids": [
                    35,
                    27,
                    53
                ],
                "id": 593643,
                "original_language": "en",
                "original_title": "The Menu",
                "overview": "A young couple travels to a remote island to eat at an exclusive restaurant where the chef has prepared a lavish menu, with some shocking surprises.",
                "popularity": 9.3763,
                "poster_path": "/fPtUgMcLIboqlTlPrq0bQpKK8eq.jpg",
                "release_date": "2022-11-17",
                "title": "The Menu",
                "video": false,
                "vote_average": 7.172,
                "vote_count": 5573,
                "character": "Chef (uncredited)",
                "credit_id": "637935db9ecf18007672a30f",
                "order": 23
            },
            {
                "adult": false,
                "backdrop_path": "/v8Nf6Y1qL1Q3PWTBezXNPPaXqza.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 556984,
                "original_language": "en",
                "original_title": "The Trial of the Chicago 7",
                "overview": "What was supposed to be a peaceful protest turned into a violent clash with the police. What followed was one of the most notorious trials in history.",
                "popularity": 3.4892,
                "poster_path": "/ahf5cVdooMAlDRiJOZQNuLqa1Is.jpg",
                "release_date": "2020-09-25",
                "title": "The Trial of the Chicago 7",
                "video": false,
                "vote_average": 7.677,
                "vote_count": 3175,
                "character": "Carl Oglesby",
                "credit_id": "5f1986a7db952d00349a61fe",
                "order": 75
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Born and Raised in Chicago, Michael can be seen alongside Best Actor Oscar Winner Eddie Redmayne (The Theory of Everything) and John Carroll Lynch (Fargo, AHS) in Oscar Winner Aaron Sorkin’s (The Social Network, Molly’s Game, Moneyball) 6 Time Oscar Nominated The Trial of the Chicago 7 where he plays Anti-Vietnam War Activist Carl Oglesby.  Michael appears as Rookie Officer Andres Garcia alongside series regular stars Marina Squerciatti (Kim Burgess) & Laroyce Hawkins (Kevin Atwater) in Dick Wolf’s Primetime Chicago PD.  Catch him around March Madness time when he shares the Capitol One screen with Samuel L. Jackson, Spike Lee and NBA Hall of Famers Charles Barkley & Larry Bird.  Michael trains Heidi Marshall in New York, Amy Lyndon (The Lyndon Technique) out of Studio City, CA and Rob Pralgo in Atlanta, GA.  Coming up you will catch Michael in Lucky Jack a Documentary by Michael Walsh, Directed by Bridget Smith and the Award Winning Drama Short, Lodestar, Written & Director by Max Clark.  Off Camera, Michael’s passion shift towards more philanthropic work focused on programs to stop hunger and homelessness.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.michaelalexanderdean.com/bio",
        "id": 1860786,
        "imdb_id": "nm7412368",
        "known_for_department": "Acting",
        "name": "Michael A. Dean",
        "place_of_birth": "Chicago, Illinois, U.S.",
        "popularity": 0.0352,
        "profile_path": "/18dCrDDqTPfjHS17bwbGVF4nFiu.jpg"
    }
}