{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yXnlw2SB0QhYUC4QDyuRZh3CQlU.jpg",
                "genre_ids": [
                    35,
                    80
                ],
                "id": 158,
                "original_language": "de",
                "original_title": "Knockin' on Heaven's Door",
                "overview": "Two young men, Martin and Rudi, both suffering from terminal cancer, get to know each other in a hospital room. They drown their desperation in tequila and decide to take one last trip to the sea. Drunk and still in pajamas they steal the first fancy car they find, a 60's Mercedes convertible. The car happens to belong to a bunch of gangsters, which immediately start to chase it, since it contains more than the pistol Martin finds in the glove box.",
                "popularity": 5.5324,
                "poster_path": "/dsY09zCxKDFjfV1oqXFJJpVrHdP.jpg",
                "release_date": "1997-02-20",
                "title": "Knockin' on Heaven's Door",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 548,
                "character": "Police Officer",
                "credit_id": "52fe4220c3a36847f8005f9f",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Markus Knüfken wuchs in Essen auf. Knüfken machte 1985 in Essen-Kettwig sein Abitur und zog dann nach München, um seinen Zivildienst anzutreten. 1987 arbeitete er für sechs Monate im Paketpostamt München, um sich eine halbjährige Reise nach Australien zu finanzieren.\n\nIm April 1988 kam er aus Australien zurück. Er machte den Taxischein und arbeitete als Dauerstatist bei der Bavaria Film für die ARD Reihe Rote Erde. Im Sommer 1990 begann er seine Ausbildung als Schauspieler bei der Schauspielschule Schauspiel München.\n\nNach drei Jahren schloss er die Ausbildung ab. Sein Anfänger-Engagement hatte er im Februar 1994 beim Stadttheater Herford. Zuvor drehte er jedoch bereits seine ersten Fernsehproduktionen. Seine erste große Rolle spielt Knüfken im November/Dezember 1993 als rechtsradikaler Skinhead in der Polizeiruf-110-Folge Samstags wenn Krieg ist unter der Regie von Roland Suso Richter. Es folgten Hauptrollen in Krimi-Reihen wie Tatort und Notruf Hafenkante.\n\nIm Jahr 1995 etablierte sich Markus Knüfken mit der Hauptrolle des Eddie Velten in der Serie Auf Achse. Seitdem hat er in vielen Fernsehfilmen, Serien aber auch Kinoproduktionen mitgespielt. Als seine persönlichen Lieblingsprojekte nennt Knüfken Bang Boom Bang und Doppelpack. Weitere bekannte Produktionen, an denen Knüfken mitwirkte, waren unter anderem Das merkwürdige Verhalten geschlechtsreifer Großstädter zur Paarungszeit und Knockin’ on Heaven’s Door.\n\nMarkus Knüfken war mit der niederländischen Schauspielerin Ellen ten Damme verheiratet. Er lebt seit 2003 in Hamburg und ist mit Andrea Lion verheiratet, mit der er ein Kind und eine Stieftochter hat.",
        "birthday": "1965-08-18",
        "deathday": null,
        "gender": 2,
        "homepage": "http://markusknuefken.de/",
        "id": 1861,
        "imdb_id": "nm0461878",
        "known_for_department": "Acting",
        "name": "Markus Knüfken",
        "place_of_birth": "Essen, Germany",
        "popularity": 0.0935,
        "profile_path": "/1OI4tuTCIRbyDeVPK9MJrCSUiZi.jpg"
    }
}