{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ouMbyjN1WJKyRqgvwovGl58e4eR.jpg",
                "genre_ids": [
                    18
                ],
                "id": 33511,
                "original_language": "en",
                "original_title": "Nowhere Boy",
                "overview": "A rebellious teenager, future Beatle John Lennon lives with his Aunt Mimi in working-class mid-1950s Liverpool, England. Mimi's husband suddenly dies, and John spies his mother Julia at the funeral. Despite Mimi's misgivings, John intends to have a real relationship with his mother. Julia introduces him to popular music and the banjo and, though a family conflict looms, young John is inspired to form his own band.",
                "popularity": 3.8807,
                "poster_path": "/1rFcosLtBnGL2ru0IPtwx3QSeKK.jpg",
                "release_date": "2009-12-25",
                "title": "Nowhere Boy",
                "video": false,
                "vote_average": 7.175,
                "vote_count": 834,
                "character": "Bobby Dykins",
                "credit_id": "52fe451f9251416c9102838f",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "David Mark Morrissey",
            "Ντέιβιντ Μόρισεϊ",
            "دیوید موریسی"
        ],
        "biography": "David Mark Morrissey (born 21 June 1964) is an English actor and director. Morrissey grew up in the Kensington and Knotty Ash areas of Liverpool. He learned to act at the Everyman Youth Theatre, alongside Ian Hart, Mark and Stephen McGann, and Cathy Tyson. At the age of 18, he and Hart were cast in the television series One Summer (1983), which won them recognition throughout the country. After making One Summer, Morrissey attended the Royal Academy of Dramatic Art before acting with the Royal Shakespeare Company and the National Theatre.\n\nThroughout the 1990s, he often portrayed policemen and soldiers, though took other defining roles such as Bradley Headstone in Our Mutual Friend (1998) and Christopher Finzi in Hilary and Jackie (1998). More film parts followed, including roles in Some Voices (2000) and Captain Corelli's Mandolin (2001), before he played the critically acclaimed roles of Stephen Collins in State of Play (2003) and Gordon Brown in The Deal (2003). The former won him a nomination at the British Academy Television Awards and the latter a Best Actor award at the Royal Television Society Awards. His film roles have not always been acclaimed; his appearance as the male lead in Basic Instinct 2 (2006) was widely criticised, and The Reaping (2007) bombed at the box office. Since then, he has had leading roles in Sense and Sensibility (2008), Red Riding (2009) and Five Days (2010), acted in the films Nowhere Boy (2009) and Centurion (2010), and produced and starred in the crime drama Thorne (2010). He returned to the stage in 2008 for a run of Neil LaBute's In a Dark Dark House and will take the title role in the Liverpool Everyman's production of Macbeth in 2011.\n\nAs a director Morrissey has helmed short films, and the dramas Sweet Revenge (2001) and Passer By (2004) for the BBC. His feature debut, Don't Worry About Me, premiered at the 2009 London Film Festival and was broadcast on BBC television in March 2010. He is married to the novelist Esther Freud, has three children and is a patron of numerous charities.\n\nDescription above from the Wikipedia article David Morrissey, licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": "1964-06-21",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 18616,
        "imdb_id": "nm0607375",
        "known_for_department": "Acting",
        "name": "David Morrissey",
        "place_of_birth": "Everton, Liverpool, England, UK",
        "popularity": 0.7255,
        "profile_path": "/gj7ENB9pBobXA3wMfw6uKcWr2GM.jpg"
    }
}