{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mRVzzlXswVmXWqCPni9JIla5fmj.jpg",
                "genre_ids": [
                    18
                ],
                "id": 3116,
                "original_language": "en",
                "original_title": "Midnight Cowboy",
                "overview": "Joe Buck is a wide-eyed hustler from Texas hoping to score big with wealthy New York City women; he finds a companion in Enrico \"Ratso\" Rizzo, an ailing swindler with a bum leg and a quixotic fantasy of escaping to Florida.",
                "popularity": 4.8818,
                "poster_path": "/f7YLzOxwWzeEdo7RhAlPSBTYa8.jpg",
                "release_date": "1969-05-25",
                "title": "Midnight Cowboy",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 1512,
                "character": "The Party",
                "credit_id": "595aa15b9251410bfa044668",
                "order": 37
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Paul Morrissey (February 23, 1938 - October 28, 2024) was an American film director, best-known for his association with Andy Warhol.\n\nMorrissey attended Ampleforth College, a private Roman Catholic boarding school and Fordham University, both Roman Catholic schools, and later served in the United States Army. A political conservative and self-described \"right-winger\", who has publicly protested against what he perceives as immorality and \"anti-Catholicism\", Morrissey's long-term collaboration with the low-keyed, apparently apolitical Warhol was viewed by many as \"a successful mismatch\", although both men did share some traits, i.e. both were practising Catholics from \"ethnic\" backgrounds (Warhol was of Rusyn descent and Morrissey is of Irish descent).\n\nMorrissey's bold, avant-garde direction in filmmaking is often attributed to his relationship with Warhol and The Factory, although Morrissey claimed in his memoir, Factory Days, that this is not the case.",
        "birthday": "1938-02-23",
        "deathday": "2024-10-28",
        "gender": 2,
        "homepage": null,
        "id": 18627,
        "imdb_id": "nm0607407",
        "known_for_department": "Directing",
        "name": "Paul Morrissey",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.2605,
        "profile_path": "/BHsQtEW3RGmDY6RZsaXCuJa8z9.jpg"
    }
}