{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/q0PBB2RCrOAZrZjqJKhL3ibTV8b.jpg",
                "genre_ids": [
                    16,
                    878,
                    28,
                    18
                ],
                "id": 75629,
                "original_language": "ja",
                "original_title": "ヱヴァンゲリヲン新劇場版:Q",
                "overview": "Fourteen years after Third Impact, Shinji Ikari awakens to a world he does not remember. He hasn't aged. Much of Earth is laid in ruins, NERV has been dismantled, and people who he once protected have turned against him. Befriending the enigmatic Kaworu Nagisa, Shinji continues the fight against the angels and realizes the fighting is far from over, even when it could be against his former allies. The characters' struggles continue amidst the battles against the angels and each other, spiraling down to what could inevitably be the end of the world.",
                "popularity": 3.015,
                "poster_path": "/d0s1xvykzl0kz7fP5S2ROYqphdz.jpg",
                "release_date": "2012-11-17",
                "title": "Evangelion: 3.0 You Can (Not) Redo",
                "video": false,
                "vote_average": 7.194,
                "vote_count": 870,
                "character": "Sakura Suzuhara (voice)",
                "credit_id": "52fe490ac3a368484e1178c3",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/yFZG86Zvdy6JuIlMW9eHxlVkct5.jpg",
                "genre_ids": [
                    16,
                    28,
                    12,
                    14,
                    878
                ],
                "id": 413594,
                "original_language": "ja",
                "original_title": "劇場版 ソードアート・オンライン -オーディナル・スケール-",
                "overview": "In 2026, four years after the infamous Sword Art Online incident, a revolutionary new form of technology has emerged: the Augma, a device that utilizes an Augmented Reality system. Unlike the Virtual Reality of the NerveGear and the Amusphere, it is perfectly safe and allows players to use it while they are conscious, creating an instant hit on the market. The most popular application for the Augma is the game Ordinal Scale, which immerses players in a fantasy role-playing game with player rankings and rewards.  Following the new craze, Kirito's friends dive into the game, and despite his reservations about the system, Kirito eventually joins them. While at first it appears to be just fun and games, they soon find out that the game is not all that it seems...",
                "popularity": 3.864,
                "poster_path": "/2szdEK0Mr0RG0nWGFVTseNQHbnP.jpg",
                "release_date": "2017-02-18",
                "title": "Sword Art Online: The Movie – Ordinal Scale",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 710,
                "character": "Shino Asada / Sinon (voice)",
                "credit_id": "57e58a93c3a3681beb00185c",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/5nkKy7eEDsXqsxFLJy3GxZhE90J.jpg",
                "genre_ids": [
                    16,
                    14,
                    18,
                    12
                ],
                "id": 476292,
                "original_language": "ja",
                "original_title": "さよならの朝に約束の花をかざろう",
                "overview": "Maquia is a member of a special race called the Iorph who can live for hundreds of years. However, Maquia has always felt lonely despite being surrounded by her people, as she was orphaned from a young age. She daydreams about the outside world, but dares not travel from her home due to the warnings of the clan's chief.  One day the kingdom of Mezarte invades her homeland. They already have what is left of the giant dragons, the Renato, under their control, and now their king wishes to add the immortality to his bloodline.  They ravage the Iorph homeland and kill most of its inhabitants. Caught in the midst of the attack, Maquia is carried off by one of the Renato. It soon dies, and she is left deserted in a forest, now truly alone save for the cries of a single baby off in the distance. Maquia finds the baby in a destroyed village and decides to raise him as her own, naming him Ariel. Although she knows nothing of the human world, how to raise a child that ages much faster than her.",
                "popularity": 2.59,
                "poster_path": "/hL3NqRE2ccR4Y2sYSJTrmalRjrz.jpg",
                "release_date": "2018-02-24",
                "title": "Maquia: When the Promised Flower Blooms",
                "video": false,
                "vote_average": 8.183,
                "vote_count": 667,
                "character": "Racine (voice)",
                "credit_id": "5a32b890c3a36814ab01bdf6",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/p6Yh10E46lXpj45XvG9Mwc4HZNi.jpg",
                "genre_ids": [
                    16,
                    28,
                    14
                ],
                "id": 20982,
                "original_language": "ja",
                "original_title": "劇場版 NARUTO -ナルト- 疾風伝",
                "overview": "Demons that once almost destroyed the world, are revived by someone. To prevent the world from being destroyed, the demon has to be sealed and the only one who can do it is the shrine maiden Shion from the country of demons, who has two powers; one is sealing demons and the other is predicting the deaths of humans. This time Naruto's mission is to guard Shion, but she predicts Naruto's death. The only way to escape it, is to get away from Shion, which would leave her unguarded, then the demon, whose only goal is to kill Shion will do so, thus meaning the end of the world. Naruto decides to challenge this \"prediction of death.\"",
                "popularity": 4.0012,
                "poster_path": "/vDkct38sSFSWJIATlfJw0l3QOIR.jpg",
                "release_date": "2007-08-04",
                "title": "Naruto Shippuden the Movie",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 1043,
                "character": "Shizuku (voice)",
                "credit_id": "5b8f39f8c3a36837f100413a",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/1EAxNqdkVnp48a7NUuNBHGflowM.jpg",
                "genre_ids": [
                    16,
                    28,
                    878,
                    18
                ],
                "id": 283566,
                "original_language": "ja",
                "original_title": "シン・エヴァンゲリオン劇場版:||",
                "overview": "In the aftermath of the Fourth Impact, stranded without their Evangelions, Shinji, Asuka and Rei find refuge in one of the rare pockets of humanity that still exist on the ruined planet Earth. There, each lives a life far different from their days as an Evangelion pilot. However, the danger to the world is far from over. A new impact is looming on the horizon—one that will prove to be the true end of Evangelion.",
                "popularity": 5.6973,
                "poster_path": "/md5wZRRj8biHrGtyitgBZo7674t.jpg",
                "release_date": "2021-03-08",
                "title": "Evangelion: 3.0+1.0 Thrice Upon a Time",
                "video": false,
                "vote_average": 8.204,
                "vote_count": 873,
                "character": "Sakura Suzuhara (voice)",
                "credit_id": "602c1f42ab5e340041a0c9f0",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "沢城 みゆき",
            "さわしろ みゆき",
            "ميوكي ساواشيرو"
        ],
        "biography": "Miyuki Sawashiro is a Japanese voice actress and narrator affiliated with Aoni Production. She has voiced in a number of Japanese anime dubs including as Petit Charat/Puchiko in Di Gi Charat, Mint in Galaxy Angel, Beelzebub in Beelzebub, Celty Sturluson in Durarara!!, Kurapika in Hunter x Hunter, Sinon in Sword Art Online, Ayane Yano in Kimi ni Todoke, Fujiko Mine in later installments of Lupin the Third, Queen in Mysterious Joker, Jun Sasada in Natsume's Book of Friends, Shinku in Rozen Maiden, Haruka Nanami in Uta no Prince-sama, Kotoha Isone in Yozakura Quartet, Kanbaru Suruga in Bakemonogatari, Jun Kanzato in Persona: Trinity Soul, and Lag Seeing in Tegami Bachi.",
        "birthday": "1985-06-02",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.aoni.co.jp/search/sawashiro-miyuki.html",
        "id": 186341,
        "imdb_id": "nm1328076",
        "known_for_department": "Acting",
        "name": "Miyuki Sawashiro",
        "place_of_birth": "Nagano, Japan",
        "popularity": 1.1933,
        "profile_path": "/11mGqwpmu8CoEy1YJgabj2g7MIv.jpg"
    }
}