{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/m2SXRnAd0d5N6qH2cbgluRgMX4z.jpg",
                "genre_ids": [
                    80,
                    53
                ],
                "id": 11016,
                "original_language": "en",
                "original_title": "Key Largo",
                "overview": "A hurricane swells outside, but it's nothing compared to the storm within the hotel at Key Largo. There, sadistic mobster Johnny Rocco holes up - and holds at gunpoint hotel owner James Temple, his widowed daughter-in-law Nora, and ex-GI Frank McCloud.",
                "popularity": 3.9939,
                "poster_path": "/rySfmQQZhS7RswOiJcJrww6FcHy.jpg",
                "release_date": "1948-07-16",
                "title": "Key Largo",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 554,
                "character": "Richard 'Curly' Hoff",
                "credit_id": "52fe43e39251416c75022091",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia\n\nThomas Gomez (July 10, 1905 – June 18, 1971) was an American actor.\n\nBorn Sabino Tomas Gomez in New York City, Gomez began his acting career in theater during the 1920s and was a student of the actor Walter Hampden. He made his first film Sherlock Holmes and the Voice of Terror in 1942 and by the end of his career had appeared in sixty films.\n\nGomez was the first Hispanic-American to be nominated for an Academy Award when he was nominated for his performance in the 1947 film Ride the Pink Horse. Directed by and starring Robert Montgomery, it was later used as the basis for an episode of the same name for the television series Robert Montgomery Presents in which Gomez reprised his role.\n\nHis other film roles include Who Done It? (1942), Key Largo (1948), Force of Evil (1948), The Conqueror (1956) and his final film Beneath the Planet of the Apes (1970). A frequent performer on television, Gomez also appeared in guest roles in such series as The Twilight Zone, Route 66, Dr. Kildare, Mr. Ed, Burke's Law, The Virginian, It Takes a Thief, Bewitched, The Rifleman, and Gunsmoke.\n\nGomez had many notable stage roles, such as the one in the original Broadway run of A Man for All Seasons.\n\nThomas Gomez died in Santa Monica, California, from injuries sustained in a car accident.",
        "birthday": "1905-07-10",
        "deathday": "1971-06-18",
        "gender": 2,
        "homepage": null,
        "id": 18646,
        "imdb_id": "nm0327089",
        "known_for_department": "Acting",
        "name": "Thomas Gomez",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.3375,
        "profile_path": "/B8xqQSXSFUjlXydqMN2w6WdFiV.jpg"
    }
}