{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sI6uCeF8mUlZx22mFfHSi9W3XQ9.jpg",
                "genre_ids": [
                    10749,
                    18,
                    35
                ],
                "id": 843527,
                "original_language": "en",
                "original_title": "The Idea of You",
                "overview": "40-year-old single mom Solène begins an unexpected romance with 24-year-old Hayes Campbell, the lead singer of August Moon, the hottest boy band on the planet. As they begin a whirlwind romance, it isn't long before Hayes' superstar status poses unavoidable challenges to their relationship, and Solène soon discovers that life in the glare of his spotlight might be more than she bargained for.",
                "popularity": 17.1844,
                "poster_path": "/Y5P4Q3q8nrruZ9aD3wXeJS2Plg.jpg",
                "release_date": "2024-05-02",
                "title": "The Idea of You",
                "video": false,
                "vote_average": 7.35,
                "vote_count": 1767,
                "character": "Eva",
                "credit_id": "65e76d8876eecf0187bf5fbb",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "ペリー・マットフェルド"
        ],
        "biography": "Miss Perry Mattfeld began her career at age 5 dancing ballet; she danced ballet exclusively for 9 years until she began her tutelage under Ms. Debbie Allen in Los Angeles. Under the direction of Ms. Allen, Perry broadened her technique to include multiple disciplines of dance. Perry was featured in Ms. Allen's World Premiere Musical, Alex in Wonderland. Perry is also proud to have been part of the original musical theatre cast at Mattel's American Girl Theater portraying American Girl Dolls, Kirsten Larson and Kit Kittredge. Perry performed over 164 shows for American Girl at the Grove in Los Angeles.\n\nThese theatrical performances led to Perry's current love of acting. Delighting in all the talented people she has been fortunate to meet in the endeavor, Perry has enjoyed various roles in film and television. Her third season episode opener as \"FrankenGirl\" for Disney's The Wizards of Waverly Place was seen by over 4.6 million viewers.\n\nPerry lives in Southern California with her family and puppy, Rowmeoh. She graduated Cum Laude from the University of Southern California (USC), School of Dramatic Arts with a B.F.A. in Acting and minor in Film Studies. You may have recognized her, as did Sports Illustrated, on the field and at promotional events as one of The World Famous USC Song Girls.",
        "birthday": "1994-03-03",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1869253,
        "imdb_id": "nm3018183",
        "known_for_department": "Acting",
        "name": "Perry Mattfeld",
        "place_of_birth": "California, USA",
        "popularity": 0.2921,
        "profile_path": "/7oM81wmfkM185bivpMx95HMWeQ7.jpg"
    }
}