{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wN3dgwkiWSLrMVukPQIeccv5EJ6.jpg",
                "genre_ids": [
                    878,
                    12
                ],
                "id": 168,
                "original_language": "en",
                "original_title": "Star Trek IV: The Voyage Home",
                "overview": "When a huge alien probe enters the galaxy and begins to vaporize Earth's oceans, Kirk and his crew must travel back in time in order to bring back whales and save the planet.",
                "popularity": 4.5468,
                "poster_path": "/xY5TzGXJOB3L9rhZ1MbbPyVlW5J.jpg",
                "release_date": "1986-11-26",
                "title": "Star Trek IV: The Voyage Home",
                "video": false,
                "vote_average": 7.157,
                "vote_count": 1561,
                "character": "Shore Patrolman",
                "credit_id": "672c64f7d98bbc3977ad15e7",
                "order": 44
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nJoseph John Lando (born December 9, 1961 in Prairie View, Illinois) is an American actor, most recognizable for playing Byron Sully on the TV series Dr. Quinn Medicine Woman.\n\nLando attended Stevenson High School in Lincolnshire, Illinois.\n\nOriginally working as a cook in a Hollywood restaurant while taking acting lessons, his first acting role was as a patrolman in Star Trek IV: The Voyage Home. He received attention from his role as Jake Harrison in the soap opera One Life to Live, and he went on to co-star in the popular drama Dr. Quinn, Medicine Woman as Michaela Quinn's love interest, Byron Sully. He has also appeared in the television series The Guiding Light and Higher Ground; the latter he executive produced. He has also appeared in various films, such as Seeds of Doubt (1996) and No Code of Conduct (1998). He has also played a small part in the series Summerland next to Lori Loughlin.\n\nHe is of Italian, Russian and Polish heritage.\n\nLando married his wife, Kirsten Barlow, on May 24, 1997. The couple have four children: Jack Neville Lando (born June 3, 1998), Christian Antonio Lando (born July 7, 2001), Kate Elizabeth Lando (born April 3, 2003), and William Joseph Lando (born July 20, 2007).\n\nDescription above from the Wikipedia article Joe Lando, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1961-12-09",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 18704,
        "imdb_id": "nm0484880",
        "known_for_department": "Acting",
        "name": "Joe Lando",
        "place_of_birth": "Prairie View, Illinois, USA",
        "popularity": 0.6474,
        "profile_path": "/mz2vnNMVC6la1ioP7fRBWcJcWMg.jpg"
    }
}