{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/vVpEOvdxVBP2aV166j5Xlvb5Cdc.jpg",
                "genre_ids": [
                    28,
                    53,
                    80
                ],
                "id": 458156,
                "original_language": "en",
                "original_title": "John Wick: Chapter 3 - Parabellum",
                "overview": "Super-assassin John Wick returns with a $14 million price tag on his head and an army of bounty-hunting killers on his trail. After killing a member of the shadowy international assassin’s guild, the High Table, John Wick is excommunicado, but the world’s most ruthless hit men and women await his every turn.",
                "popularity": 11.0033,
                "poster_path": "/ziEuG1essDuWuC5lpWUaw1uXY2O.jpg",
                "release_date": "2019-05-15",
                "title": "John Wick: Chapter 3 - Parabellum",
                "video": false,
                "vote_average": 7.446,
                "vote_count": 11215,
                "character": "Zero",
                "credit_id": "6489aab0e2726000c932c853",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Mark Dakaskos ",
            "Mark Alan Dacascos",
            "麥達卡史高斯",
            "Marc Dacascos",
            "Марк Дакаскос",
            "馬克·德可斯可",
            "مارک داکاسکوس",
            "馬克達卡斯可"
        ],
        "biography": "Mark Alan Dacascos (born February 26, 1964) is an American actor and martial artist. He won numerous karate and various styles of kung fu championships between the ages of 7 and 18. Beginning in January 2005, Dacascos has portrayed \"the Chairman\" on Food Network's television series Iron Chef America. This role was previously played by Takeshi Kaga in the original Japanese Iron Chef, and Dacascos' character is presented as Kaga's nephew, though the actors are not related. Dacascos went on to continue the role in Iron Chef Australia. His other roles include: Eric Draven in The Crow: Stairway to Heaven, Eubulon, the Advent Master, on Kamen Rider Dragon Knight, the lead role of \"Mani\" in the French film Brotherhood of the Wolf and the lead role of \"Crying Freeman\" in the film of the same name. Dacascos competed in season 9 of Dancing with the Stars. His partner was So You Think You Can Dance finalist Lacey Schwimmer. The pair was eliminated in the 7th episode. On November 2, 2010, CBS announced Dacascos was cast to reprise the role of Steve McGarrett's arch-nemesis, Wo Fat, in the modern remake of Hawaii Five-0.",
        "birthday": "1964-02-26",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.dacascos.com/",
        "id": 18702,
        "imdb_id": "nm0001092",
        "known_for_department": "Acting",
        "name": "Mark Dacascos",
        "place_of_birth": "Honolulu, Hawaii, USA",
        "popularity": 1.3987,
        "profile_path": "/trOACuJz1KzhB51qe6asaxRuxrh.jpg"
    }
}