{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/41Mlaj6wfjlF4wQaVH0tjfDXvMi.jpg",
                "genre_ids": [
                    18,
                    9648
                ],
                "id": 11020,
                "original_language": "en",
                "original_title": "Picnic at Hanging Rock",
                "overview": "In the early 1900s, Miranda attends a girls boarding school in Australia. One Valentine's Day, the school's typically strict headmistress treats the girls to a picnic field trip to an unusual but scenic volcanic formation called Hanging Rock. Despite rules against it, Miranda and several other girls venture off. It's not until the end of the day that the faculty realizes the girls and one of the teachers have disappeared mysteriously.",
                "popularity": 3.7852,
                "poster_path": "/7BAXwmFN4pZDNb9N6kzmAAwdssi.jpg",
                "release_date": "1975-09-02",
                "title": "Picnic at Hanging Rock",
                "video": false,
                "vote_average": 7.225,
                "vote_count": 836,
                "character": "Blanche Gifford",
                "credit_id": "52fe43e59251416c75022343",
                "order": 12
            },
            {
                "adult": false,
                "backdrop_path": "/kcK6wlt4TT1ETgr8mJhXgUg3HYE.jpg",
                "genre_ids": [
                    10752,
                    36,
                    18
                ],
                "id": 11646,
                "original_language": "en",
                "original_title": "Gallipoli",
                "overview": "Two Australian sprinters face the brutal realities of war when they are sent to fight in the Gallipoli campaign in the Ottoman Empire during World War I.",
                "popularity": 1.9838,
                "poster_path": "/un7VCqTmjrq3u75mQ204a8tofD4.jpg",
                "release_date": "1981-08-13",
                "title": "Gallipoli",
                "video": false,
                "vote_average": 7.05,
                "vote_count": 505,
                "character": "Waitress",
                "credit_id": "5f4480854142910038519424",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Jenny Lovell is an Australian theatre, television and film actress, and drama teacher, probably best known for her stint as Jenny Hartley in 44 episodes in the television series Prisoner. She is the daughter of Sydney actor and producer Nigel Lovell and actor and producer Patricia Lovell.\n\nLovell made her film debut in Picnic at Hanging Rock in 1975 and also appeared in the film Gallipoli, small screen appearances including four episodes of the soap opera A Country Practice and the police drama Blue Heelers, and a role in the horror film Darkness Falls (2003).[1][2] Lovell has performed internationally including at The Globe Theatre, London.[3]\n\nLovell was the inaugural General Manager of Impro Melbourne, an improvisational theatre (improv) company founded in 1996 in Melbourne, Australia. During her time with the company, Lovell produced, directed and starred in various improv formats, including many seasons of competition in Theatresports, when it was hosted at the Theatre Works independent theatre in St Kilda, Melbourne.\n\nFrom Wikipedia, the free encyclopedia",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 187133,
        "imdb_id": "nm0522552",
        "known_for_department": "Acting",
        "name": "Jenny Lovell",
        "place_of_birth": null,
        "popularity": 0.0474,
        "profile_path": null
    }
}