{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gL8WqjpbkoOdo1y3qkt4GUkdDhV.jpg",
                "genre_ids": [
                    35
                ],
                "id": 13386,
                "original_language": "it",
                "original_title": "Ricomincio da tre",
                "overview": "Gaetano, a young Neapolitan, decides to leave home, work and friends, to look for other moments of life and meet other people.",
                "popularity": 2.0188,
                "poster_path": "/lS0X9KScgkUbhiu6lOHBya8z9R2.jpg",
                "release_date": "1981-03-05",
                "title": "I'm Starting from Three",
                "video": false,
                "vote_average": 7.62,
                "vote_count": 688,
                "character": "Jeanne",
                "credit_id": "5a199013c3a3680b9a02e16c",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Jeanne Mas is a French pop singer. She is well known in France, Switzerland, Canada and Belgium for a number of hit singles released in the 1980s. Her first success was \"Toute première fois\" in 1984. This song was simultaneously released in the United Kingdom in English. Two of her singles charted at number one in France: \"Johnny, Johnny\" and \"En rouge et noir\" in 1985 and 1986, respectively. Her 1980's albums are good examples of the Euro disco electropop style popular in Continental Europe at the time, featuring synthesizers and very catchy melodies.\n\nJeanne Mas was born on 28 February 1958 in Alicante, Spain. She started studying languages at the University of Nanterre (near Paris). After one year studying Spanish and Italian, she took off for Italy giving up her studies at the university. She settled in Rome when she was only 18 years old. In Rome, she took dance and acting classes. She started landing small parts in commercials as well as in full-length films and she hosted her own show on a private channel: La Uomo TV. Music was her true passion.\n\nIn 1979, she signed her first contract with RCA Italia and recorded her first single \"On the Moon\", and toured with a rock group which was rather hardcore. She recorded several 45's, one in English and the others in Italian. In 1984, she signed a contract with EMI Music France. Roberto Zaneli and Romano Musumara wrote her first French hit \"Toute premiere fois\".\n\n\"Toute première fois\" It was an instant success: she sold more than 900,000 copies of the single which was played on the radio all the way until December.\n\nFrench people discovered a young woman on their TV screen entirely dressed in black, with jet-black hair, an emaciated face, and very pronounced make-up: a bland version of the punk look. Stimulating choreography with jerky gestures reinforced the image of a woman \"who wants some action\", almost aggressive. This striking combination of dance and image seduced the young public. The press, the radio, the television and even the discos grabbed hold of this phenomenon.\n\nAt the start of the following year, she successively released a second single \"Johnny, Johnny\" followed by an album simply called Jeanne Mas. To reach a wider audience, she asked Daniel Balavoine for help. He produced two of the songs for the album.\n\nAnother single \"Coeur en stéréo\" was a hit in its own right. In October, she played the Olympia club in Paris for the first time for four triumphant concerts. A few weeks later, she won the equivalent of a grammy for female performer of the year during the first Victoires de la musique. ...\n\nSource: Article \"Jeanne Mas\" from Wikipedia in english, licensed under CC-BY-SA.",
        "birthday": "1958-02-28",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.jeannemas.com/",
        "id": 1871156,
        "imdb_id": "nm0556005",
        "known_for_department": "Acting",
        "name": "Jeanne Mas",
        "place_of_birth": "Alicante, Comunidad Valenciana, Spain",
        "popularity": 0.0468,
        "profile_path": "/seOoAU3UHELlGhoO6lnlfDsA3rA.jpg"
    }
}