{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gmNX2bJuS7jLocgWPazIqaGMfwE.jpg",
                "genre_ids": [
                    99,
                    10402
                ],
                "id": 740996,
                "original_language": "ko",
                "original_title": "블랙핑크: 세상을 밝혀라",
                "overview": "Record-shattering Korean girl band BLACKPINK tell their story —  and detail the hard fought journey of the dreams and trials behind their meteoric rise.",
                "popularity": 2.2093,
                "poster_path": "/wwrvjmcgkDyB2RbCbIVLXZf82pl.jpg",
                "release_date": "2020-10-14",
                "title": "BLACKPINK: Light Up the Sky",
                "video": false,
                "vote_average": 8.2,
                "vote_count": 505,
                "character": "Self",
                "credit_id": "5f581f45befb090037550537",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "지수",
            "김지수",
            "金智秀",
            "คิม จี-ซู",
            "Kim Jisoo",
            "JISOO of BLACKPINK"
        ],
        "biography": "Kim Ji-soo (born January 3, 1995), known mononymously as JISOO, is a South Korean singer and actress. She is a member of the South Korean girl group Blackpink, formed by YG Entertainment, in August 2016. Outside of her music career, she made her acting debut with a cameo role in the 2015 series The Producers and played her first leading role in the JTBC series Snowdrop (2021–22), for which she won the Best Actress Award at the 2022 Seoul International Drama Awards.\n\nJISOO made her solo music debut with the single album Me on March 31, 2023. The album debuted at number one on the Circle Album Chart with 1.03 million copies sold in less than two days, becoming the best-selling album of all time by a female soloist in South Korea and the first to sell over a million copies.  In 2024, she established her own label named Blissoo.\n\nJISOO has been awarded several accolades throughout her career, including two Golden Disc Awards, three MAMA Awards, a Circle Chart Music Award, and the Seoul International Drama Award for Outstanding Korean Actress. She is the most-followed Korean actress on Instagram, and has been recognized for her impact on fashion as a global ambassador for Dior.",
        "birthday": "1995-01-03",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.blissoo.co.kr/en/",
        "id": 1875840,
        "imdb_id": "nm8707184",
        "known_for_department": "Acting",
        "name": "JISOO",
        "place_of_birth": "Gunpo, Gyeonggi, South Korea",
        "popularity": 0.6731,
        "profile_path": "/hfHbHfR8pj5UO6f8AaeIbbQvcXy.jpg"
    }
}