{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gmNX2bJuS7jLocgWPazIqaGMfwE.jpg",
                "genre_ids": [
                    99,
                    10402
                ],
                "id": 740996,
                "original_language": "ko",
                "original_title": "블랙핑크: 세상을 밝혀라",
                "overview": "Record-shattering Korean girl band BLACKPINK tell their story —  and detail the hard fought journey of the dreams and trials behind their meteoric rise.",
                "popularity": 2.2093,
                "poster_path": "/wwrvjmcgkDyB2RbCbIVLXZf82pl.jpg",
                "release_date": "2020-10-14",
                "title": "BLACKPINK: Light Up the Sky",
                "video": false,
                "vote_average": 8.2,
                "vote_count": 505,
                "character": "Self",
                "credit_id": "5f581f3c8c22c00037c83cf9",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Rosé",
            "Park Chae-young",
            "박채영",
            "朴彩英",
            "Roseanne Park",
            "Bak Chae-yeong",
            "Roje",
            "โรแซนน์ พัก",
            "พัก แช-ย็อง",
            "Blackpink",
            "Bak Chaeyeong",
            "Rojen Bak",
            "로젠 박",
            "로젠박",
            "Pak Ch'aeyŏng",
            "Rochen Pak"
        ],
        "biography": "Roseanne Park (born 11 February 1997), known mononymously as ROSÉ (로제), is a Korean-New Zealand singer and dancer based in South Korea. Born in New Zealand and raised in Australia, Rosé signed with South Korean label YG Entertainment following a successful audition in 2012 and trained for four years before debuting as a member of the girl group Blackpink in August 2016.\n\nIn March 2021, ROSÉ made her solo debut with her single album R. Its lead single \"On the Ground\" was a commercial success, peaking in the top five domestically and becoming the highest-charting song by a Korean female soloist on the US Billboard Hot 100, the ARIA Singles Chart and the UK Singles Chart. It was the first song by a Korean solo artist to top the Billboard Global 200 and the most-viewed music video in 24 hours on YouTube by a solo K-pop artist, which earned ROSÉ two Guinness World Records. The album's second single \"Gone\" peaked in the top ten in South Korea as well.\n\nIn 2024, she signed a management contract with The Black Label. ROSÉ has been acknowledged for her role in fashion as a global ambassador for Yves Saint Laurent, and became the first female Korean idol to attend the Met Gala in 2021.",
        "birthday": "1997-02-11",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.rosesarerosie.com",
        "id": 1875842,
        "imdb_id": "nm7986558",
        "known_for_department": "Acting",
        "name": "ROSÉ",
        "place_of_birth": "Auckland, New Zealand",
        "popularity": 0.4479,
        "profile_path": "/qAu8cDQto6hbYa3YmVWvEjH4vuM.jpg"
    }
}