{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mUYV0ZdsDEliGaQahcQH1F3grsP.jpg",
                "genre_ids": [
                    16,
                    10751,
                    12
                ],
                "id": 10674,
                "original_language": "en",
                "original_title": "Mulan",
                "overview": "To save her father from certain death in the army, a young woman secretly enlists in his place and becomes one of China's greatest heroines in the process.",
                "popularity": 13.2069,
                "poster_path": "/bj3iSjLlkwHtJrPmvHXa8P7edI9.jpg",
                "release_date": "1998-06-18",
                "title": "Mulan",
                "video": false,
                "vote_average": 7.905,
                "vote_count": 10094,
                "character": "Grandmother Fa (singing voice)",
                "credit_id": "52fe43a09251416c75017cf5",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/ioQYjcRnU54ir5ltgyS7k53zw5x.jpg",
                "genre_ids": [
                    18,
                    10751,
                    10402,
                    10749
                ],
                "id": 15121,
                "original_language": "en",
                "original_title": "The Sound of Music",
                "overview": "In the years before the Second World War, a tomboyish postulant at an Austrian abbey is hired as a governess in the home of a widowed naval captain with seven children, and brings a new love of life and music into the home.",
                "popularity": 9.2376,
                "poster_path": "/c6CrUZypAsBCaRWX0M3RVRDbhNS.jpg",
                "release_date": "1965-03-29",
                "title": "The Sound of Music",
                "video": false,
                "vote_average": 7.725,
                "vote_count": 3442,
                "character": "Sister Sophia",
                "credit_id": "52fe463c9251416c75071ab7",
                "order": 18
            },
            {
                "adult": false,
                "backdrop_path": "/bkahbHkwBSbIDtTm667Tu1ba2bu.jpg",
                "genre_ids": [
                    80,
                    18,
                    10749
                ],
                "id": 1725,
                "original_language": "en",
                "original_title": "West Side Story",
                "overview": "In the slums of the upper West Side of Manhattan, tensions are high as a gang of Polish-Americans compete against a gang of recently immigrated Puerto Ricans, but this doesn't stop two romantics from each gang falling in love.",
                "popularity": 2.4048,
                "poster_path": "/nzCMu6D5q60i2bVrIQ0DxlRSgCZ.jpg",
                "release_date": "1961-12-13",
                "title": "West Side Story",
                "video": false,
                "vote_average": 7.239,
                "vote_count": 1950,
                "character": "Maria (Singing Voice) (uncredited)",
                "credit_id": "620a4b6bf48b34497cec7a99",
                "order": 46
            },
            {
                "adult": false,
                "backdrop_path": "/xMoQjqa3JUc2unO4nF9PmM1JTQu.jpg",
                "genre_ids": [
                    10402,
                    35,
                    10749
                ],
                "id": 11113,
                "original_language": "en",
                "original_title": "My Fair Lady",
                "overview": "A snobbish phonetics professor agrees to a wager that he can take a flower girl and make her presentable in high society.",
                "popularity": 4.3206,
                "poster_path": "/bTXVc29lGSNclf94VIZ49W4gGKl.jpg",
                "release_date": "1964-12-01",
                "title": "My Fair Lady",
                "video": false,
                "vote_average": 7.499,
                "vote_count": 1368,
                "character": "Eliza Doolittle (singing voice) (uncredited)",
                "credit_id": "5d8247df869e75001e0bf861",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/tyj0QztA0PkYo6XauifWjkx7UVi.jpg",
                "genre_ids": [
                    16,
                    10751,
                    14,
                    12
                ],
                "id": 12092,
                "original_language": "en",
                "original_title": "Alice in Wonderland",
                "overview": "On a golden afternoon, wildly curious young Alice tumbles into the burrow and enters the merry, madcap world of Wonderland full of whimsical escapades.",
                "popularity": 8.3641,
                "poster_path": "/20cvfwfaFqNbe9Fc3VEHJuPRxmn.jpg",
                "release_date": "1951-07-28",
                "title": "Alice in Wonderland",
                "video": false,
                "vote_average": 7.188,
                "vote_count": 6057,
                "character": "Singing Flowers (voice) (uncredited)",
                "credit_id": "5e442e6b0c27100013832991",
                "order": 24
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Margaret Nixon McEathron"
        ],
        "biography": "\"Loverly\" soprano Marni Nixon has ensured herself a proper place in film history although most moviegoers would not recognize her if they passed her on the street. But if you heard her, that might be a horse of a different color. Marni is one of those unsung heroes (or should I say \"much sung\" heroes) whose incredible talents were given short shrift at the time. For those who think film superstars such as Deborah Kerr, Natalie Wood, and Audrey Hepburn possessed not only powerhouse dramatic talents but amazing singing voices as well...think again. Kerr's Anna in The King and I (1956), Natalie's Maria in West Side Story (1961), and Audrey's Eliza in My Fair Lady (1964) were all dubbed by the amazing Marni Nixon, and nowhere in the credits will you find that fact. Born Marni McEathron in Altadena, California, she was a former child actress and soloist with the Roger Wagner Chorale in the beginning. Trained in opera, yet possessing a versatile voice for pop music and easy standards as well, she not only sang for Arnold Schönberg and Igor Stravinsky but also recorded light songs. Marni made her Broadway musical debut in 1954 in a show that lasted two months but nothing came from it. In 1955, the singer contracted to dub Deborah Kerr in The King and I (1956) was killed in a car accident in Europe and a replacement was needed. Marni was hired...and the rest is history. Much impressed, the studios brought her in to \"ghost\" Ms. Kerr's voice once again in the classic tearjerker An Affair to Remember (1957). From there she went on to make Natalie Wood and Audrey Hepburn sound incredibly good with such classic songs as \"Tonight\" and \"Wouldn't It Be Loverly.\"\n\nShe finally appeared on screen in a musical in The Sound of Music (1965) starring Julie Andrews, who physically resembles Marni. The role is a small one, however, and she is only given a couple of solo lines in \"How Do You Solve a Problem Like Maria?\" as a singing nun. Marni's vocal career in films dissolved by the mid 1960s, but she continued on with concerts and in symphony halls, while billing herself as \"The Voice of Hollywood\" in one-woman cabaret shows. Throughout the years, she has played on the legit stage, including the lead roles in \"The King and I\" and \"The Sound of Music,\" and in her matronly years has been seen as Fraulein Schneider in \"Cabaret,\" and in the musicals \"Follies\" and \"70 Girls 70.\" Her last filmed singing voice was as the grandmother in the animated feature Mulan (1998) in the 1990s. Married three times, twice to musicians; one of her husbands, Ernest Gold, by whom she had three children, was a film composer and is best known for his Academy Award-winning epic Exodus (1960).\n\nMarni Nixon died  July 24, 2016 (age 86), in New York City, New York, USA",
        "birthday": "1930-02-22",
        "deathday": "2016-07-24",
        "gender": 1,
        "homepage": null,
        "id": 187678,
        "imdb_id": "nm0633262",
        "known_for_department": "Acting",
        "name": "Marni Nixon",
        "place_of_birth": "Altadena, California, USA",
        "popularity": 0.5952,
        "profile_path": "/76mZuCSred16BMfneYmmlXlbXeB.jpg"
    }
}