{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2va32apQP97gvUxaMnL5wYt4CRB.jpg",
                "genre_ids": [
                    14,
                    28,
                    80
                ],
                "id": 268,
                "original_language": "en",
                "original_title": "Batman",
                "overview": "Having witnessed his parents' brutal murder as a child, millionaire philanthropist Bruce Wayne fights crime in Gotham City disguised as Batman, a costumed hero who strikes fear into the hearts of villains. But when a deformed madman known as 'The Joker' seizes control of Gotham's criminal underworld, Batman must face his most ruthless nemesis ever while protecting both his identity and his love interest, reporter Vicki Vale.",
                "popularity": 10.8046,
                "poster_path": "/cij4dd21v2Rk2YtUQbV5kW69WB2.jpg",
                "release_date": "1989-06-21",
                "title": "Batman",
                "video": false,
                "vote_average": 7.234,
                "vote_count": 8201,
                "character": "Scientist",
                "credit_id": "5bbea2af0e0a2624c60013d0",
                "order": 43
            },
            {
                "adult": false,
                "backdrop_path": "/nWhCbmAcAhRHrR60zqpAFNET7p5.jpg",
                "genre_ids": [
                    18,
                    878
                ],
                "id": 1714,
                "original_language": "en",
                "original_title": "Fahrenheit 451",
                "overview": "In the future, the government maintains control of public opinion by outlawing literature and maintaining a group of enforcers, known as “firemen,” to perform the necessary book burnings. Fireman Montag begins to question the morality of his vocation…",
                "popularity": 1.6466,
                "poster_path": "/k2CTpexoS9MO9lKVFfnzwVdJuM.jpg",
                "release_date": "1966-09-07",
                "title": "Fahrenheit 451",
                "video": false,
                "vote_average": 7.11,
                "vote_count": 1018,
                "character": "Book Person: Machiavelli's 'The Prince' (uncredited)",
                "credit_id": "5edc45b8b42242002291e0b5",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Michael S. Creighton-Balfour",
            "Michael Creighton Balfour"
        ],
        "biography": "Michael Creighton Balfour (11 February 1918 – 24 October 1997) was an English actor, working mainly in British films and TV, following his TV debut in the BBC's The Marvellous History of St Bernard, in 1938. He was a recognisable face, often in small character parts and supporting roles, in nearly two hundred films and TV shows, from the 1940s to the 1990s, often playing comical heavies or otherwise shady characters notable for their \"loud\" clothes, sometimes convincingly cast as an American.\n\nHe worked for a roll call of film directors, including Tony Richardson, Pete Walker, Billy Wilder, Lewis Gilbert, Roman Polanski, Leslie Norman, Tim Burton, John Frankenheimer, François Truffaut, John Gilling, Stanley Donen, Ken Annakin, Cavalcanti, Lance Comfort, Terence Young, Gerald Thomas, Pasolini, John Paddy Carstairs, Terence Fisher, Val Guest, Frank Launder, John Huston, Basil Dearden and Howard Hawks.\n\nBalfour had parts in many popular TV shows of the era including Educated Evans, Mess Mates, Danger Man, The Avengers, Hancock's Half Hour, Dixon of Dock Green, Rogue's Gallery, Z-Cars, The Onedin Line, and the detective drama The Vise, playing Saber's assistant Barney O'Keefe.\n\nBalfour was also known as the passenger in a Jaguar XK120 car driven by actor Bonar Colleano when it crashed, killing Colleano. Balfour's injuries required him to have 98 stitches, but he was released from hospital in time to attend Colleano's funeral.\n\nAs his screen career began to slow down in the late 1970s, Michael Balfour went on tour with European circuses, as a clown. He founded Circus Hazzard, and created his own clown character. His son later became a circus manager.\n\nAs well as performing, Balfour was a dedicated painter and sculptor, and in later years turned increasingly to sculpture and the arts, even running his own gallery for a while. For his subjects, he frequently drew on his own family career as a circus clown",
        "birthday": "1918-02-11",
        "deathday": "1997-10-24",
        "gender": 2,
        "homepage": null,
        "id": 18763,
        "imdb_id": "nm0050163",
        "known_for_department": "Acting",
        "name": "Michael Balfour",
        "place_of_birth": "Dover, Kent, England, UK",
        "popularity": 0.0886,
        "profile_path": null
    }
}