{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/r17jFHAemzcWPPtoO0UxjIX0xas.jpg",
                "genre_ids": [
                    28,
                    53,
                    80
                ],
                "id": 324552,
                "original_language": "en",
                "original_title": "John Wick: Chapter 2",
                "overview": "John Wick is forced out of retirement by a former associate looking to seize control of a shadowy international assassins’ guild. Bound by a blood oath to aid him, Wick travels to Rome and does battle against some of the world’s most dangerous killers.",
                "popularity": 15.3196,
                "poster_path": "/hXWBc0ioZP3cN4zCu6SN3YHXZVO.jpg",
                "release_date": "2017-02-08",
                "title": "John Wick: Chapter 2",
                "video": false,
                "vote_average": 7.339,
                "vote_count": 13683,
                "character": "Earl",
                "credit_id": "57f905bfc3a36850d80029af",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/g1QkFTSkqA0Pq1p63jTsPIEA7zy.jpg",
                "genre_ids": [
                    18
                ],
                "id": 1246,
                "original_language": "en",
                "original_title": "Rocky Balboa",
                "overview": "When he loses a highly publicized virtual boxing match to ex-champ Rocky Balboa, reigning heavyweight titleholder Mason Dixon retaliates by challenging the Italian Stallion to a 10-round exhibition bout. To the surprise of his son and friends, Rocky agrees to come out of retirement and face an opponent who's faster, stronger and thirty years his junior. Rocky takes on Dixon in what will become the greatest fight in boxing history!",
                "popularity": 6.5881,
                "poster_path": "/byBlJvZwCqgtIwrZNv0pyE974jC.jpg",
                "release_date": "2006-12-20",
                "title": "Rocky Balboa",
                "video": false,
                "vote_average": 6.873,
                "vote_count": 3636,
                "character": "Robert's Friend",
                "credit_id": "5e73b735b1f68d0017dfc895",
                "order": 43
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Tobias Segal is an American actor, best known for his work on stage and in the independent film The Other America, which appeared at the SlamDance Film Festival and Philadelphia Film Festival in April 2004. In 2002 he became one of the youngest actors to win a Barrymore Award, which he won for Outstanding Supporting Actor in a play for his performance in Equus.[1] He appeared in The Bridge Project at Kevin Spacey's Old Vic Theatre (spring and summer 2009) under the direction of Sam Mendes, followed by a brief Broadway run of The Miracle Worker, before portraying Earl in the John Wick films John Wick: Chapter 2 and John Wick: Chapter 3 – Parabellum. In 2022, Segal portrayed the white version of Donald Glover's Earnest \"Earn\" Marks in the character's dream episodes of the third season of Atlanta, referred to as \"E\". He currently lives in Brooklyn, New York.",
        "birthday": "1986-05-12",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 187919,
        "imdb_id": "nm1708414",
        "known_for_department": "Acting",
        "name": "Tobias Segal",
        "place_of_birth": "Philadelphia, Pennsylvania, USA",
        "popularity": 0.1881,
        "profile_path": "/1I8JXa3OfbEYEOa3rBgiRE1x31H.jpg"
    }
}