{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2wS8pMZgvzq7kaZb5LHX54poQnA.jpg",
                "genre_ids": [
                    18,
                    27
                ],
                "id": 381283,
                "original_language": "en",
                "original_title": "mother!",
                "overview": "A couple's relationship is tested when uninvited guests arrive at their home, disrupting their tranquil existence.",
                "popularity": 4.1136,
                "poster_path": "/fjny9chXPx69ln1LMJxbwi5yHMt.jpg",
                "release_date": "2017-09-13",
                "title": "mother!",
                "video": false,
                "vote_average": 6.967,
                "vote_count": 6867,
                "character": "Hewer",
                "credit_id": "59b109c7c3a3682c48079380",
                "order": 34
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Ryan “Gitz Crazyboy” Derangé is a Siksikatsitapi (Blackfoot) and Dene youth facilitator born in Mohkínsstsisi (Calgary).  Gitz’s passion and purpose is helping the next generation through his work as a youth educator.  Since graduating high school, Gitz began working with youth and creating youth-focused programs.\n\nEver the activist for the environment and Indigenous rights, Gitz is known for his leadership and participation in the Idle No More movement, one of the largest Indigenous mobilizations in Canadian history.  A storyteller to his core, he has always had a deep connection to traditional teachings since his mother read to him as a child, he continues to be guided by the ancient wisdom the Elders carry.  Along with writing, Gitz loves to create music and enjoys being introduced to new sounds.  An avid world traveler, he has ventured to Germany, Ecuador, Guyana, Puerto Rico and sacred spaces all over North America.  He has spent most his life learning and living with different Indigenous nations all over the world, and incorporates these experiences in everything he does.\n\nCurrently Gitz resides in Calgary and is actively reconnecting with his Blackfoot roots.  He believes the truth of who we are is in the truth and mysteries our ancestors carried – through ceremonies, songs, medicine, love and laughter.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://gitzcrazyboy.com/",
        "id": 1883394,
        "imdb_id": "nm7417288",
        "known_for_department": "Acting",
        "name": "Gitz Crazyboy",
        "place_of_birth": "Mohkinstsis (Calgary), Alberta, Canada",
        "popularity": 0.0311,
        "profile_path": "/6609391h2nyxedKdwo7985FIOoC.jpg"
    }
}