{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/iFQzlUmO5QmMPcSHHDdfd522x33.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 7857,
                "original_language": "it",
                "original_title": "Amarcord",
                "overview": "In an Italian seaside town, young Titta gets into trouble with his friends and watches various local eccentrics as they engage in often absurd behavior. Frequently clashing with his stern father and defended by his doting mother, Titta witnesses the actions of a wide range of characters, from his extended family to Fascist loyalists to sensual women, with certain moments shifting into fantastical scenarios.",
                "popularity": 4.0547,
                "poster_path": "/6PcyPeenUgVb0S7htBKnW5xcVHy.jpg",
                "release_date": "1973-12-18",
                "title": "Amarcord",
                "video": false,
                "vote_average": 7.909,
                "vote_count": 1152,
                "character": "Aldina Cordini",
                "credit_id": "59b3c9cbc3a3684ef0012668",
                "order": 26
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Nella Gambini"
        ],
        "biography": "Nella C. Gambini was born in Ferrara in January 6, 1953, to cuban mother and roman father. Her first contact with the world art occurs at the age of ten, when she starts as singer in a cabaret-club of her hometown. Follow the theatrical debut, as actress, at the side of very important and oldest Emma Gramatica (sister of as much Anna and Irma), in a Niccodemi's drama. She acts with the high-level presence of Arnoldo Foà and Paola Borboni. Settled in Rome since 21th April 1966, she joins in the roman comic acting company leaded by the roman poet and actor Checco Durante. The experience in this contest, highly formative and satisfying, with the participation at several performances, both in \"Rossini's Theatre\" and \"Villa Aldobrandini\" in Rome, last for ten years. On December 28, 1975 she accompanies Checco Durante for the last time on stage, performing in \"The Discovery of America\" by Alberto Retti. With the Durante's death, which took place in Rome on 5 January, 1976 she breaks away from the company. Also in 1966, she begins her job in the cinema, in Cinecittà, where her father Biagio works as a professional acrobat and master of arms. Occur the first experiences as a stunt-woman and stunt double for many actresses and actors. She's skillfully executed in almost all fields, falls to leaps, stunt driver to truck, up to the master of arms and fencing. In 1977, when her father comes to retirement age, she abandoned the stunt-girl's activity. Active in doubles, as in dubbing track, in the film's sound recording, which at time were all strictly played in the dubbing room, lends voice to several teenagers and inexperienced actresses, to children, to simple supporting roles or voice-overs [some of actresses dubbed: Simonetta Stefanelli, Jenny Tamburi, Fiorella Mannoia, Anna Melato (in Film d'amore e d'anarchia); among the children: Renato Cestiè and Duilio Cruciani (in 1870, with Anna Magnani and Marcello Mastroianni)]. She takes on the films as actress, but always in supporting roles that do not allow to stand out as she deserves. The theater she allows instead important writings, compare with a wide variety of roles and genres, under the direction of renowned directors and prominent figures, including Aldo Trionfo, Renzo Giovampietro, Giancarlo Sbragia, Giuseppe Patroni Griffi. In the 80s she's assistant to Mrs. Monica Vitti, drama's professor at the Dramatic's Art National Academy \"Silvio D'Amico\" in Rome. Remains active as actress in film and television until 2000. In the three following years, provides as acting coach on the set of series and miniseries shoot in Cinecittà. In 2003, reached the retirement age, she lefts Cinecittà to devote exclusively to the theater.\n\nShe died on May 1, 2016 in Rome, Lazio, Italy",
        "birthday": "1953-01-01",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1884668,
        "imdb_id": "nm0303734",
        "known_for_department": "Acting",
        "name": "Donatella Gambini",
        "place_of_birth": "Ferrara, Italy",
        "popularity": 0.0168,
        "profile_path": null
    }
}