{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bYimqNnizPUCnL5HOdoCW02IGmH.jpg",
                "genre_ids": [
                    18,
                    35,
                    10749
                ],
                "id": 74643,
                "original_language": "fr",
                "original_title": "The Artist",
                "overview": "Hollywood, 1927: As silent movie star George Valentin wonders if the arrival of talking pictures will cause him to fade into oblivion, he sparks with Peppy Miller, a young dancer set for a big break.",
                "popularity": 3.1239,
                "poster_path": "/z68py0ZqPgeacGPG54AGVRbNBS7.jpg",
                "release_date": "2011-10-12",
                "title": "The Artist",
                "video": false,
                "vote_average": 7.45,
                "vote_count": 3366,
                "character": "Grip (uncredited)",
                "credit_id": "5ea2a6ec3faba0002044a740",
                "order": 60
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Calbert Victor Holstein"
        ],
        "biography": "Victor Holstein was born on April 9th, 1980 in Springfield, Illinois, USA. He is an actor and producer, known for Chicago Med (2015), Chicago P.D. (2014), Good Genes (2019) and Adventure Tom (2025). He is the youngest of five children, including triplet sisters. He graduated from Glenwood High School in Chatham, Illinois in 1998. He was four years old the first time he performed - as a singing cowboy in his family's traveling musical evangelism act, The Holstein Herd. Prior to a shift in his world view, he believed he was destined to be a music minister in the Nazarene Church, and actually attended two semesters of theology school before moving to Chicago to study theater at Columbia College Chicago where he earned a BA in Theater Arts in 2004. There he studied under Sheldon Patinkin and his gifted staff. Shortly after college, he moved to Los Angeles, where he worked as a set PA on the NBC show Las Vegas (2003). During this time, he also worked on many indie films, TV shows & soap operas, including a recurring role as a cop on Days of Our Lives (1965). He also continued his studies there at Second City Hollywood and Elizabeth Mestnik Studios for on-camera training, taught by Brad Greenquist. In 2014, he moved back to Chicago. He played Charles Lyon in the hit immersive show Southern Gothic in 2018-19 and then was in Timeline Theatre's Production of Oslo at the Broadway Playhouse downtown. In 2021, Victor understudied Steppenwolf Theatre's critically acclaimed remount of Bug, written by Tracy Letts, starring Carrie Coon & Namir Smallwood. Victor's most recent stage role was the ghost of Elvis Presley in Terry Spencer Hesser's play \"Christmas With Elvis\" at the Chopin Theatre in Chicago's Wicker Park, directed by Dexter Bullard.\n\nHe has a supporting role in the upcoming feature film Adventure Tom (2025), which has already screened at two festivals and is slated for release next year.",
        "birthday": "1980-04-09",
        "deathday": null,
        "gender": 2,
        "homepage": "https://resumes.breakdownexpress.com/258206-3621802-34567",
        "id": 1886240,
        "imdb_id": "nm2407903",
        "known_for_department": "Acting",
        "name": "Victor Holstein",
        "place_of_birth": "Springfield, Illinois, USA",
        "popularity": 0.0588,
        "profile_path": "/bMJMysCGgsHiiW7EltA6NKSKaJk.jpg"
    }
}