{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qJbMgG2ZkWOk7zdMfC4JVfEk10N.jpg",
                "genre_ids": [
                    80,
                    36,
                    53
                ],
                "id": 117,
                "original_language": "en",
                "original_title": "The Untouchables",
                "overview": "Elliot Ness, an ambitious prohibition agent, is determined to take down Al Capone. In order to achieve this goal, he forms a group given the nickname “The Untouchables”.",
                "popularity": 8.308,
                "poster_path": "/8BquGK22zCcsmBWiaIakaaPpSZb.jpg",
                "release_date": "1987-06-03",
                "title": "The Untouchables",
                "video": false,
                "vote_average": 7.756,
                "vote_count": 5922,
                "character": "Cop Cousin",
                "credit_id": "59b792b5c3a368159f00945f",
                "order": 19
            },
            {
                "adult": false,
                "backdrop_path": "/flzoI6jEw7J0X5x2rwOMZCwZ57I.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 14534,
                "original_language": "en",
                "original_title": "Rudy",
                "overview": "Rudy grew up in a steel mill town where most people ended up working, but wanted to play football at Notre Dame instead. There were only a couple of problems. His grades were a little low, his athletic skills were poor, and he was only half the size of the other players. But he had the drive and the spirit of 5 people and has set his sights upon joining the team.",
                "popularity": 3.7219,
                "poster_path": "/fAbfTCRpjHe2rprXBly55KL1dL9.jpg",
                "release_date": "1993-09-17",
                "title": "Rudy",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 706,
                "character": "High School Assistant Coach",
                "credit_id": "6847a3b92435c5cb9d3028de",
                "order": 26
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "An actor for many years, Sean began writing for the theatre as co-librettist for the musical Phantom of the Country Opera, which had its world premiere at the Marriott Theatre in Lincolnshire, Illinois.  He went on to debut five shows at the American Heartland Theatre in Kansas City –his comedies Beer for Breakfast and As Long As We Both Shall Live and his musicals (librettist/lyricist) Married Alive!, A Dog’s Life, and Another Night Before Christmas. In addition, Sean has had four world premieres at Peninsula Players Theatre in Wisconsin — Making God Laugh,  The Tin Woman, Now and Then and A Rock Sails By. The last of which was part of the statewide festival, “World Premiere Wisconsin”. His play LUCK! won an honorable mention from the National Writers Association’s Playwrighting Festival and was produced by the Epic Theatre Company.  His plays and musicals have gone on to hundreds of productions around the world, including China, England, Australia, Germany, Serbia, Russia, Ireland, Italy, and others.  Sean has been the Playwright in Residence at Centre Stage’s New Play Festival in South Carolina, the Playwright in Residence at Lamb Arts Regional Theatre in Iowa and twice served as an adjudicator for the Midwest Dramatists Conference. Longtime Chicago and New York City residents, Sean and his wife Kathy moved full time to Pennsylvania in ’22 when Kathy completed a 13-year run in Broadway’s “Wicked.”  In PA, they share a lovely home, canoe, and golf cart, as well as sweet memories of Sean’s recently passed on writing partner, excellent dog Hank.  His musical “Phantom of the Country Opera” has been published by MTI, and his other plays/musicals have been published by Playscripts, Inc. and Broadway Licensing. Sean is a proud member of Actors’ Equity Association, SAG/AFTRA and The Dramatists Guild.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://seangrennan.net/",
        "id": 1886575,
        "imdb_id": "nm0340271",
        "known_for_department": "Acting",
        "name": "Sean Grennan",
        "place_of_birth": "Chicago, Illinois, U.S.",
        "popularity": 0.0445,
        "profile_path": null
    }
}