{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lfMtVr5hkFeGy4dMaEf3XUQr76d.jpg",
                "genre_ids": [
                    12,
                    80,
                    18
                ],
                "id": 433498,
                "original_language": "en",
                "original_title": "Papillon",
                "overview": "Henri “Papillon” Charrière, a safecracker from the Parisian underworld, is wrongfully convicted and sentenced to life imprisonment in the penal colony of French Guiana, where he forges a strong friendship with Louis Dega, a counterfeiter who needs his protection.",
                "popularity": 5.0293,
                "poster_path": "/ahF5c6vyP8HWMqIwlhecbRALkjq.jpg",
                "release_date": "2017-09-07",
                "title": "Papillon",
                "video": false,
                "vote_average": 7.324,
                "vote_count": 2031,
                "character": "Lali",
                "credit_id": "5d68930f13af5f49abbbe1a2",
                "order": 27
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Lorena Mateo",
            "Lorena Andrea Mateo"
        ],
        "biography": "Lorena Andrea was born in London, to Spanish and Colombian parents. She developed a love for acting very early on, attending several Youth Theatre groups including the prestigious Anna Scher Theatre School. It was at this school where she embarked on her passion for performance which eventually lead to landing her first role in CBBC show The Pod (2007). Lorena has a strong background in sports and dance, she was in one of the top swimming teams in the country and won numerous competitions. A big martial arts enthusiast she practices MMA and teaches Body Combat. Fluent in both English and Spanish.\n\nLorena made her feature film debut in 2016 when she joined the cast of Jesters (2018) as Sofia, a Colombian student. She went on to co-star in films such as Horror remake Unhinged (2017) and House on Elm Lake (2017). She also appeared in Michael Noer's new rendition of the 1973 classic Papillon (2017) as Lali, a Wayuu Indian woman who rescues Papillon Charlie Hunnam and nurses him back to health.\n\nAndrea has also starred in several award winning short films such as Salaam-StDenis2015 (2016) portraying Hasna Aït Boulahcen, the infamous suicide bomber. Lithium (2016) a solo character spy drama and multi award-winning Signs of Silence (2016).\n\nIn early 2018, Lorena was cast as the female lead Lotsee opposite Chris Routhe in No Man's Land (2019) a Western/Action film set in late 1800's Texas, her first film in the USA. In the film, Lorena performs all her own stunts which include Horse Riding, Knife fighting and MMA.\n\nLorena stars in Netflix Original comic book series Warrior Nun (2020) as Sister Lth, released in 2020.",
        "birthday": "1994-04-12",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1887484,
        "imdb_id": "nm8460271",
        "known_for_department": "Acting",
        "name": "Lorena Andrea",
        "place_of_birth": "Camden, London, England",
        "popularity": 0.1637,
        "profile_path": "/jZhHfPt9HUyVdXuTvGLlcnympE5.jpg"
    }
}