{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/brENMyyhk13WLzKHBK20rBKx0u7.jpg",
                "genre_ids": [
                    35,
                    12,
                    10751,
                    14
                ],
                "id": 527435,
                "original_language": "en",
                "original_title": "The Christmas Chronicles",
                "overview": "Siblings Kate and Teddy try to prove Santa Claus is real, but when they accidentally cause his sleigh to crash, they have to save Christmas.",
                "popularity": 4.2607,
                "poster_path": "/5Il2EMSF2KecrUKZPuen6BZmaCP.jpg",
                "release_date": "2018-11-22",
                "title": "The Christmas Chronicles",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 2272,
                "character": "Mrs. Claus",
                "credit_id": "5bf73fd10e0a264320046199",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Goldie Jeanne Hawn (born November 21, 1945) is an American actress, director, producer, and occasional singer.  She started as a dancer, first in New York and then in Los Angeles. On the cast of TV's Laugh-In, the mod comedy show of the late 1960s, she flubbed jokes in a bikini and became one of the show's most popular co-stars. She then proved the ding-a-ling act was just an act -- she won an Oscar for a supporting role in Cactus Flower (1969, with Walter Matthau) and turned in a solid performance in Steven Spielberg's The Sugarland Express (1974).\n\nShe had her first blockbuster, Private Benjamin in 1980, and has since had a steady career as a leading lady in hits and misses, often acting as her own producer. Some of her movies include Shampoo (1975, starring Warren Beatty), Overboard (1987, with Kurt Russell), Bird on a Wire (1990, with Mel Gibson), Death Becomes Her (1992, with Bruce Willis), Housesitter (1992, with Steve Martin), The First Wives Club (1996, with Diane Keaton), and The Banger Sisters (2002, with Susan Sarandon), among many others.\n\nShe has been in a decades-long relationship with actor Kurt Russell and is the mother of actress Kate Hudson, actor Oliver Hudson, and actor Wyatt Russell.",
        "birthday": "1945-11-21",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 18892,
        "imdb_id": "nm0000443",
        "known_for_department": "Acting",
        "name": "Goldie Hawn",
        "place_of_birth": "Washington, D.C., USA",
        "popularity": 0.927,
        "profile_path": "/jbRj8m4jvHNDeZeu0I3p2g4sCXu.jpg"
    }
}