{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rfkIeCaIHhN3K5wjJJqKmfUjYp8.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 381284,
                "original_language": "en",
                "original_title": "Hidden Figures",
                "overview": "The untold story of Katherine G. Johnson, Dorothy Vaughan and Mary Jackson – brilliant African-American women working at NASA and serving as the brains behind one of the greatest operations in history – the launch of astronaut John Glenn into orbit. The visionary trio crossed all gender and race lines to inspire generations to dream big.",
                "popularity": 12.5756,
                "poster_path": "/9lfz2W2uGjyow3am00rsPJ8iOyq.jpg",
                "release_date": "2016-12-10",
                "title": "Hidden Figures",
                "video": false,
                "vote_average": 8.052,
                "vote_count": 10083,
                "character": "Wind Tunnel PA Announcer",
                "credit_id": "59bf041ac3a3682fd80074d3",
                "order": 41
            },
            {
                "adult": false,
                "backdrop_path": "/eyjWwMOgkq4nh0wMtyW8XPJ749H.jpg",
                "genre_ids": [
                    18
                ],
                "id": 109410,
                "original_language": "en",
                "original_title": "42",
                "overview": "In 1946, Branch Rickey, owner of the Brooklyn Dodgers, took a stand against Major League Baseball's infamous color line when he signed Jackie Robinson  to the team. The deal put both men in the crosshairs of the public, the press and even other players. Facing unabashed racism from every side, Robinson was forced to demonstrate tremendous courage and let his talent on the field wins over fans and his teammates – silencing his critics and forever changing the world by changing the game of baseball.",
                "popularity": 5.3153,
                "poster_path": "/iZ7jVGQWj3eBUdqwAPUlKk0BaS2.jpg",
                "release_date": "2013-04-12",
                "title": "42",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 1882,
                "character": "Reporter Three",
                "credit_id": "5f8e7470fed597003647bb4e",
                "order": 41
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Joseph Knezevich"
        ],
        "biography": "Joe earned a Bachelor of Fine Arts in acting from Florida State University and studied in London with members of the world renowned Complicite. Joe was an Associate Artist at Georgia Shakespeare for 16 seasons where he appeared in over 40 plays and taught in the education department.  He is also a frequent guest on the Alliance Stage and has taught in their education programs. Joe has also played at Horizon Theatre, Theatrical Outfit, Theatre in the Square, Aurora Theatre, Synchronicity, Théâtre du Rêve, Boise Contemporary Theatre, New Theatre, Arizona Theatre Company, and San Jose Rep.",
        "birthday": "1977-06-06",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.joeknezevich.com/",
        "id": 1890166,
        "imdb_id": "nm2374823",
        "known_for_department": "Acting",
        "name": "Joe Knezevich",
        "place_of_birth": "Miami, Florida, USA",
        "popularity": 0.1235,
        "profile_path": "/hw7loMaFeJqfxjyk4pRRGngAfbL.jpg"
    }
}