{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yriYPLqyFqPW0QXaegT1KmWXk9a.jpg",
                "genre_ids": [
                    878,
                    53
                ],
                "id": 1954,
                "original_language": "en",
                "original_title": "The Butterfly Effect",
                "overview": "A young man struggles to access sublimated childhood memories. He finds a technique that allows him to travel back into the past, to occupy his childhood body and change history. However, he soon finds that every change he makes has unexpected consequences.",
                "popularity": 8.8434,
                "poster_path": "/ea5iv7TWMh18fOKoRGgmtcg85Gx.jpg",
                "release_date": "2004-01-17",
                "title": "The Butterfly Effect",
                "video": false,
                "vote_average": 7.574,
                "vote_count": 7841,
                "character": "Teen Punk Girl",
                "credit_id": "66877ba1c03be2379d7acf0f",
                "order": 49
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Μάγκντα Απάνοβιτς"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nMagda Apanowicz (born November 8, 1985 height 5' 3\" (1,60 m)) is a Canadian actress, best known for her roles as Andy Jensen on the TV series Kyle XY and Lacy Rand on Caprica.\n\nApanowicz is of Polish descent and spent a year in Poland in the ninth grade. She studied at Vancouver Film School.\n\nShe became interested in acting at the age of 10, after her brother introduced her to Pulp Fiction. She began her career in 2002 with brief appearances in the TV series Jeremiah and John Doe. From 2007 to 2009, she played the role of Andy Jensen on Kyle XY. In 2008 she starred in the Hallmark Channel original movie Every Second Counts.\n\nIn 2009, Apanowicz was cast as Lacy Rand, a series regular, in the television drama Caprica alongside Eric Stoltz. She later appeared in Hellcats. In 2012, she guest starred in the second season of the Jane Espenson-scripted romantic comedy web series, Husbands. In 2013, Apanowicz began appearing in Continuum in the role of Emily.",
        "birthday": "1985-11-08",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 189026,
        "imdb_id": "nm1538095",
        "known_for_department": "Acting",
        "name": "Magda Apanowicz",
        "place_of_birth": "Vancouver, British Columbia, Canada",
        "popularity": 0.5613,
        "profile_path": "/lQxvUecNjdAL308nF7ASKIwlXCo.jpg"
    }
}