{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/e6DlxuwzeZozu6D3h636gyDAHLo.jpg",
                "genre_ids": [
                    16,
                    10751,
                    35
                ],
                "id": 449406,
                "original_language": "en",
                "original_title": "Vivo",
                "overview": "A music-loving kinkajou named Vivo embarks on the journey of a lifetime to fulfill his destiny and deliver a love song for an old friend.",
                "popularity": 3.5856,
                "poster_path": "/eRLlrhbdYE7XN6VtcZKy6o2BsOw.jpg",
                "release_date": "2021-07-30",
                "title": "Vivo",
                "video": false,
                "vote_average": 7.263,
                "vote_count": 733,
                "character": "Eva (voice)",
                "credit_id": "608752d58d22fc003f1f4470",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From comedy to drama, actress on the rise Olivia Trujillo has quickly made a name for herself in the entertainment industry bringing diverse and dynamic characters to life on screen. This year, Olivia can be seen starring in the independent thriller feature \"Borrego,\" opposite Lucy Hale and Nicholas Gonzalez. She will also lend her voice to \"Vivo,\" Sony Pictures Animation's first-ever musical adventure featuring all-new original songs from Lin-Manuel Miranda, alongside Zoe Saldana, Michael Rooker, Nicole Byer, and Gloria Estefan.\n\nIn television, Olivia exploded into our hearts and households with her breakout role in the critically acclaimed, Apple TV+ drama series \"For All Mankind\" as Aleida Rosales, an immigrant daughter raised by a single father after her mother's passing. Olivia has also made her mark in comedy, appearing on Comedy Central's \"Drunk History\" in 2019.\n\nBorn and raised in San Diego, California with roots in Spain, Mexico and Portugal. Olivia prides herself on being biliterate, speaking both Spanish and English. Olivia is passionate about mental health awareness and equality.\n\n- IMDb Mini Biography By: Anonymous",
        "birthday": "2004-10-12",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1891383,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Olivia Trujillo",
        "place_of_birth": "Florida, USA",
        "popularity": 0.1352,
        "profile_path": "/pMVTGkyLWP73k81Cpj1nG0LL2VR.jpg"
    }
}