{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3lIuv1CO8g5vwbQsYsTqYJJ44qN.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 5924,
                "original_language": "en",
                "original_title": "Papillon",
                "overview": "A man befriends a fellow criminal as the two of them begin serving their sentence on a dreadful prison island, which inspires the man to plot his escape.",
                "popularity": 5.5722,
                "poster_path": "/356oqQpug682OERsWV0bGZ0YxwQ.jpg",
                "release_date": "1973-12-16",
                "title": "Papillon",
                "video": false,
                "vote_average": 7.828,
                "vote_count": 2005,
                "character": "Antonio",
                "credit_id": "52fe442ec3a36847f8087135",
                "order": 12
            },
            {
                "adult": false,
                "backdrop_path": "/gT3hatcFDbZWUlLZ7TClRDhZ9Pa.jpg",
                "genre_ids": [
                    28,
                    18,
                    53
                ],
                "id": 5919,
                "original_language": "en",
                "original_title": "The Towering Inferno",
                "overview": "At the opening party of a colossal—but poorly constructed—skyscraper, a massive fire breaks out, threatening to destroy the tower and everyone in it.",
                "popularity": 4.4211,
                "poster_path": "/mFM1GbrRrT3DWUFFo8koSITFnYe.jpg",
                "release_date": "1974-12-14",
                "title": "The Towering Inferno",
                "video": false,
                "vote_average": 7.011,
                "vote_count": 975,
                "character": "Carlos",
                "credit_id": "59c7ff8a9251415b3205d364",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Gregg Sierra",
            "Dirk Peno",
            "Gregory Joseph Sierra",
            "Greg Sierra"
        ],
        "biography": "Gregory Sierra (January 25, 1937 – January 4, 2021) was a distinguished American actor, celebrated for his versatility and powerful presence on both television and film. Born on January 25, 1937, in New York City's Spanish Harlem, Sierra was of Puerto Rican descent and faced a challenging upbringing after being abandoned by his parents and raised by an aunt. Despite his early hardships, he found a path to acting after impressing at an impromptu audition for an acting school in Manhattan. Sierra's career began on stage, notably with the National Shakespeare Company and performances at the New York Shakespeare Festival. He transitioned to television in the late 1960s and quickly became a familiar face, first gaining major attention as Julio Fuentes, the memorable Puerto Rican neighbor on Sanford and Son, and then as Detective Sergeant Chano Amengual on Barney Miller—two roles that remain among his most enduring contributions to classic TV. Sierra's roster of work included appearances on The Flying Nun, Soap, Miami Vice, Hill Street Blues, Zorro and Son, and scores of guest roles on popular series such as All in the Family, The X-Files, and The Fresh Prince of Bel-Air. His film credits span genres and decades, featuring roles in Beneath the Planet of the Apes, Papillon, The Towering Inferno, and Deep Cover. Gregory Sierra was admired for bringing depth, nuance, and authenticity to every character he portrayed, endearing him to fans and earning the respect of peers. He passed away on January 4, 2021, in Laguna Woods, California, leaving behind a rich legacy in entertainment that spanned nearly fifty years.",
        "birthday": "1937-01-25",
        "deathday": "2021-01-04",
        "gender": 2,
        "homepage": null,
        "id": 18914,
        "imdb_id": "nm0797268",
        "known_for_department": "Acting",
        "name": "Gregory Sierra",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.4102,
        "profile_path": "/edEf7zRssGVAXt0XRKT8yOpG3gm.jpg"
    }
}