{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1RWLMyC9KcFfcaoViMiJGSSZzzr.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 100402,
                "original_language": "en",
                "original_title": "Captain America: The Winter Soldier",
                "overview": "After the cataclysmic events in New York with The Avengers, Steve Rogers, aka Captain America is living quietly in Washington, D.C. and trying to adjust to the modern world. But when a S.H.I.E.L.D. colleague comes under attack, Steve becomes embroiled in a web of intrigue that threatens to put the world at risk. Joining forces with the Black Widow, Captain America struggles to expose the ever-widening conspiracy while fighting off professional assassins sent to silence him at every turn. When the full scope of the villainous plot is revealed, Captain America and the Black Widow enlist the help of a new ally, the Falcon. However, they soon find themselves up against an unexpected and formidable enemy—the Winter Soldier.",
                "popularity": 8.6751,
                "poster_path": "/tVFRpFw3xTedgPGqxW0AOI8Qhh0.jpg",
                "release_date": "2014-03-20",
                "title": "Captain America: The Winter Soldier",
                "video": false,
                "vote_average": 7.655,
                "vote_count": 19406,
                "character": "Smithsonian Museum Visitor",
                "credit_id": "67cefe42d95e411dd02a8211",
                "order": 72
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "James E. Lewis"
        ],
        "biography": "James Lewis was born and raised in Washington, D.C. Lewis has recorded over 900 audio books, appeared on numerous commercials and tv shows including a recurring role on HBO's The Wire, and principal roles on America's Most Wanted. James has also appeared in several independent films, including Euphoria which won a gold medal at the Houston Film Festival, Red River which won a Paul Robeson award for lighting, and For Love of Liberty which won the 2011 NAACP Award for best documentary and boasted an all-star narration cast including Halle Berry, Bill Cosby, Mel Gibson, John Travolta and Robert Duvall. In addition, Lewis has lent his voice talents to bring to life such DC Comics characters as Green Lantern John Stewart, Nightwing, Firestorm, Jimmy Olsen and Clayface in the DC Comics audio adaption of Crisis on Infinite Earths which won him an Audiofile Award for best ensemble cast. James won a 2011 Aurora Award and Telly Award for Best Comic Performance in the web production \"I Can Live with That\". James is also the recipient of the prestigious Actors Center Award in Washington DC. In 2009, Lewis provided over 15-character voices for Fallout 3, which to date, has won multiple awards including Best Overall RPG, Best Overall Console Game, Overall Game of the Show for E3, GamePro Magazine \"PC Game of the Year, Game Developer's Choice Awards, Golden Joystick Awards, Best Xbox Game from Official Xbox Magazine, and Best PC Game from GameSpy to name a few. In 2018 Lewis' audiobook \"Who Is the Black Panther\" won audiobook of the year from Audiofile Magazine. In 2020 James was a silver Telly award for his work as both an actor and producer in the graphic novel \"Germ Warfare\" Additionally in 2020 James was nominated for 2 SOVAS awards for best Audiobook Narration and Best Audiobook Producer.",
        "birthday": "1962-09-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1892295,
        "imdb_id": "nm1721862",
        "known_for_department": "Acting",
        "name": "James Lewis",
        "place_of_birth": "Washington, District of Columbia, USA",
        "popularity": 0.0937,
        "profile_path": "/9ttAr9Kl3wD04Bmt6vmaLDEphQ3.jpg"
    }
}