{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3ejcvnHxMFfCbnFi736cXi1ChH1.jpg",
                "genre_ids": [
                    18
                ],
                "id": 4481,
                "original_language": "fr",
                "original_title": "Manon des sources",
                "overview": "In this, the sequel to Jean de Florette, Manon has grown into a beautiful young shepherdess living in the idyllic Provencal countryside. She plots vengeance on the men who greedily conspired to acquire her father's land years earlier.",
                "popularity": 2.1524,
                "poster_path": "/1qpu6Zc1PSDL3UbDNIZJ6YuhJDW.jpg",
                "release_date": "1986-11-19",
                "title": "Manon of the Spring",
                "video": false,
                "vote_average": 7.582,
                "vote_count": 537,
                "character": "Casimir",
                "credit_id": "5e53dc95f48b34001972b0b9",
                "order": 12
            },
            {
                "adult": false,
                "backdrop_path": "/qNBxyt60hnzBRSHo1uRkRU34fYE.jpg",
                "genre_ids": [
                    18
                ],
                "id": 4480,
                "original_language": "fr",
                "original_title": "Jean de Florette",
                "overview": "In a rural French village, an old man and his only remaining relative cast their covetous eyes on an adjoining vacant property. They need its spring water for growing their flowers, and are dismayed to hear that the man who has inherited it is moving in. They block up the spring and watch as their new neighbour tries to keep his crops watered from wells far afield through the hot summer. Though they see his desperate efforts are breaking his health and his wife and daughter's hearts, they think only of getting the water.",
                "popularity": 1.4467,
                "poster_path": "/r9UAevVU0lhRKNGlxXXUeKiRwtM.jpg",
                "release_date": "1986-08-27",
                "title": "Jean de Florette",
                "video": false,
                "vote_average": 7.689,
                "vote_count": 586,
                "character": "Casimir",
                "credit_id": "5e764edb357c0000134f90d3",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Pierre Nougaro (27 April 1904 in Toulouse - 26 October 1988 in Marseille) was a French operatic baritone, the father of the singer Claude Nougaro.\n\nAs a child, Nougaro enrolled in the evening classes of the Conservatoire de Toulouse at the instigation of his parents, who were themselves choristers. He obtained a first prize for singing.\n\nNougaro was director of the Théâtre Ledoux in Besançon in the 1950s and then of the Rennes theatre in 1958.\n\nIn Rennes, Nougaro increased audiences by expanding the repertoire, including operettas in the season, and a world premiere every year. He also brought in the famous opera stars.\n\nIn 1967, he retired from the Rennes theatre (later called the Opéra de Rennes).\n\nFrom the 1970s and for many years to come, his dramatic talent opened the door to a new career in television and film. He appeared in many TV movies, and in films directed by Claude Chabrol and Claude Berri among others.\n\nSource: Article \"Pierre Nougaro\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1904-04-27",
        "deathday": "1988-10-26",
        "gender": 2,
        "homepage": null,
        "id": 1892946,
        "imdb_id": "nm0636669",
        "known_for_department": "Acting",
        "name": "Pierre Nougaro",
        "place_of_birth": "Toulouse, Haute-Garonne, France",
        "popularity": 0.0718,
        "profile_path": "/tozWakEP0c08c4IssqEn9FQUCK4.jpg"
    }
}