{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4Yihb0wD1Jd2sQtNrKo9TOs8S3l.jpg",
                "genre_ids": [
                    80,
                    18,
                    35
                ],
                "id": 308639,
                "original_language": "en",
                "original_title": "Dope",
                "overview": "Malcolm is carefully surviving life in a tough neighborhood in Los Angeles while juggling college applications, academic interviews, and the SAT. A chance invitation to an underground party leads him into an adventure that could allow him to go from being a geek, to being dope, to ultimately being himself.",
                "popularity": 2.8771,
                "poster_path": "/n6u00imN7AX2NiyWUc5kTgHXmEf.jpg",
                "release_date": "2015-06-19",
                "title": "Dope",
                "video": false,
                "vote_average": 7.064,
                "vote_count": 1523,
                "character": "Dom's Crew 1",
                "credit_id": "6487ca5ee375c000e250baed",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Vincent Jamal Staples"
        ],
        "biography": "Vincent Jamal Staples (born July 2, 1993) is an American rapper and singer. He is a member of the hip hop trio Cutthroat Boyz alongside fellow California rappers Aston Matthews and Joey Fatts. Staples was once a close associate of Odd Future, Mike G and Earl Sweatshirt in particular. He is currently signed to Motown and Talib Kweli's Blacksmith Records.\n\nStaples rose to prominence with appearances on albums by Odd Future members and his collaborative mixtape titled Stolen Youth with producer Mac Miller. In October 2014, he released his debut EP Hell Can Wait, which included the singles \"Hands Up\" and \"Blue Suede\". His debut album, Summertime '06, was released in June 2015 to critical acclaim. He was also featured as a part of the XXL 2015 Freshman Class. His second album Big Fish Theory, which contains the singles \"BagBak\", \"Big Fish\" and \"Rain Come Down\", incorporates avant-garde, dance and electronic influences. It was released in June 2017 to further acclaim from critics. In November 2018, Staples released his third studio album, FM! In July 2021, he released his self-titled fourth studio album.\n\nDescription above from the Wikipedia article Vince Staples, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1993-07-02",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.vincestaples.com",
        "id": 1892921,
        "imdb_id": "nm6770906",
        "known_for_department": "Acting",
        "name": "Vince Staples",
        "place_of_birth": "Compton, California, USA",
        "popularity": 0.0809,
        "profile_path": "/5L143WPBERswBdO105pKrlWUtEC.jpg"
    }
}