{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/c2gcLDxniE0lNmT2a7CcQVuW6En.jpg",
                "genre_ids": [
                    12,
                    28,
                    53
                ],
                "id": 36557,
                "original_language": "en",
                "original_title": "Casino Royale",
                "overview": "Le Chiffre, a banker to the world's terrorists, is scheduled to participate in a high-stakes poker game in Montenegro, where he intends to use his winnings to establish his financial grip on the terrorist market. M sends Bond—on his maiden mission as a 00 Agent—to attend this game and prevent Le Chiffre from winning. With the help of Vesper Lynd and Felix Leiter, Bond enters the most important poker game in his already dangerous career.",
                "popularity": 16.5461,
                "poster_path": "/lMrxYKKhd4lqRzwUHAy5gcx9PSO.jpg",
                "release_date": "2006-11-14",
                "title": "Casino Royale",
                "video": false,
                "vote_average": 7.565,
                "vote_count": 11145,
                "character": "Arresting Officer",
                "credit_id": "64d7bf6b001bbd013aedcef6",
                "order": 46
            },
            {
                "adult": false,
                "backdrop_path": "/1UAjYFLLQYOzFd0Ud6YQq2HoubU.jpg",
                "genre_ids": [
                    18,
                    27,
                    80,
                    53
                ],
                "id": 398173,
                "original_language": "en",
                "original_title": "The House That Jack Built",
                "overview": "Failed architect, engineer and vicious murderer Jack narrates the details of some of his most elaborately orchestrated crimes, each of them a towering piece of art that defines his life's work as a serial killer for twelve years.",
                "popularity": 6.1736,
                "poster_path": "/bMUGNkPaHOurcBK9g3XpJx3fxuO.jpg",
                "release_date": "2018-07-05",
                "title": "The House That Jack Built",
                "video": false,
                "vote_average": 7.128,
                "vote_count": 2915,
                "character": "Police Officer 4",
                "credit_id": "64d7be71069f0e011e16673a",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Robert Jezek (born April 6, 1955) is a Canadian stage, film and television actor based in the United Kingdom.\n\nIn 1989, Jezek appeared as Sergeant Zbrigniev in the Doctor Who television serial Battlefield.\n\nHe is known for playing companion Frobisher in a range of Doctor Who audio dramas produced by Big Finish Productions and based on the BBC television series Doctor Who. In 2002, he guest-starred in Sarah Jane Smith: Ghost Town, an audio drama produced by the same company. He also lent his voice to the videogame The Getaway: Black Monday in 2004.\n\nHe has also had minor roles in films including playing a Rescue 1 technician in Event Horizon (1997) a police officer in Casino Royale (2006) and the Polish neighbour in Last Chance Harvey (2008). He has also appeared in a number of short films.\n\nIn April 2011, he appeared in British soap opera EastEnders, as the Polish father of a girl who was bullying Ben Mitchell (then Charlie Jones). He meets with Phil Mitchell (Steve McFadden) and Shirley Carter (Linda Henry) to discuss Tasha bullying Ben, and he agrees to talk to her. Ben since told Zsa Zsa Carter that Tasha is giving him no more problems.\n\nHe has also had guest appearances in British television dramas Shameless, The Bill and Holby City.\n\nJezek played the title role in the world theatre premier of Hayton on Homicide (2009) and is currently appearing in the West End in The Bodyguard.",
        "birthday": "1955-04-06",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.robertjezek.com/",
        "id": 189445,
        "imdb_id": "nm0422514",
        "known_for_department": "Acting",
        "name": "Robert Jezek",
        "place_of_birth": " Toronto, Ontario, Canada",
        "popularity": 0.0996,
        "profile_path": "/rFoshC4TeLkwJK8RqTrKnhVTAwG.jpg"
    }
}