{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fKrFGB96kVeJ9uE83Jc4fIWBgqO.jpg",
                "genre_ids": [
                    18,
                    10752
                ],
                "id": 1116,
                "original_language": "en",
                "original_title": "The Wind That Shakes the Barley",
                "overview": "In 1920s Ireland young doctor Damien O'Donovan prepares to depart for a new job in a London hospital. As he says his goodbyes at a friend's farm, British Black and Tans arrive, and a young man is killed. Damien joins his brother Teddy in the Irish Republican Army, but political events are soon set in motion that tear the brothers apart.",
                "popularity": 3.4732,
                "poster_path": "/9XquDdOGrlC0EAbPoOXALqS2dDh.jpg",
                "release_date": "2006-06-23",
                "title": "The Wind That Shakes the Barley",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 846,
                "character": "Sean",
                "credit_id": "59ce77dfc3a3686abc01a76c",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Máirtín de Cógáin, a renowned playwright and actor, is a singing, dancing, and story-telling bodhrán player who captivates audiences in his native Ireland and throughout the U.S. With his infectious personality, he effortlessly commands attention from concert halls to intimate porches. Descended from a long line of storytellers and boasting two CCÉ All-Ireland’s for Storytelling, Máirtín finds joy in nothing more than sharing his tales. Catch him spinning a few yarns and you’re in for a treat.\n\nWhen touring the globe with The Máirtín de Cógáin Project & The Fuchsia Band, Máirtín is also a true promoter of the Ballad. He is searching ever for those forgotten songs of old to give them new life, and also writes some of his own. Máirtín learned from famous Irish singers like Danni Maichi Ua Súilleabháin, Séamus Mac Mathúna, and Ciarán Dwyer. As a fluent speaker of Irish (Gaelic), his love for the ‘Teanga na Gael’ stems from his bilingual upbringing and education in primary & secondary schools taught in the medium of Irish.\n\nMáirtín is a multi-talented artist who has even earned a degree in the Irish language from University College Cork. He is not only a singer, storyteller, dancer, and bodhrán player on stage but also an actor who has appeared in the film The Wind that Shakes the Barley. Máirtín has co-written many productions with the Be Your Own Banana Theatre Company and notably played De Bogman off-broadway in NY.\n\nMáirtín is a seasoned bodhrán player who has learned from renowned musicians such as Eric Cunningham and Colm Murphy of The New and Old Dé Danann. He has shared his expertise in Bodhrán technique at various events including Catskills Irish Arts Week, August Irish Week, Kansas City Irish Fest, CelticFest Mississippi, Minnesota Irish Fair, and La Crosse IrishFest. Máirtín also offers private tutorials during his tours. Contact him to schedule a lesson and improve your skills.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://mairtinmusic.com/",
        "id": 1896857,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Máirtín de Cógáin",
        "place_of_birth": "County Cork, Ireland",
        "popularity": 0.0143,
        "profile_path": null
    }
}