{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/txzQ45okJz2fLUQTClCr2Vuk9Nt.jpg",
                "genre_ids": [
                    16,
                    35,
                    878
                ],
                "id": 7249,
                "original_language": "en",
                "original_title": "Futurama: Bender's Big Score",
                "overview": "The Planet Express crew return from cancellation, only to be robbed blind by hideous \"sprunging\" scam artists.  Things go from bad to worse when the scammers hack Bender, start traveling through time, and take Earth over entirely!  Will the crew be able to save the day, or will Bender's larcenous tendencies and their general incompetence doom them all?",
                "popularity": 1.5656,
                "poster_path": "/bmVE90IHvx4uXQgtbRtu4RyMWpt.jpg",
                "release_date": "2007-11-27",
                "title": "Futurama: Bender's Big Score",
                "video": false,
                "vote_average": 7.368,
                "vote_count": 719,
                "character": "Turanga Leela (voice)",
                "credit_id": "52fe4475c3a36847f80973c7",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/vpviitHyakuHAGlVJOR3fvzN0YP.jpg",
                "genre_ids": [
                    16,
                    35,
                    878,
                    10749
                ],
                "id": 12889,
                "original_language": "en",
                "original_title": "Futurama: The Beast with a Billion Backs",
                "overview": "Fresh off ripping space-time a new one at the end of \"Bender's Big Score,\" the Planet Express crew is back to mend the tear in reality, or (hopefully) at least not make it worse.  Beyond the tear, though, lurks a being of inconceivable...tentacularity.  What will become of Earth, and indeed, our universe, when faced with the Beast with a Billion Backs?",
                "popularity": 3.1303,
                "poster_path": "/2BW6JAW4wo7t5wD3WVfoijzosvt.jpg",
                "release_date": "2008-06-24",
                "title": "Futurama: The Beast with a Billion Backs",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 580,
                "character": "Turanga Leela (voice)",
                "credit_id": "52fe452b9251416c7504dedb",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/uZzVtRO2aV9gtFx9WHNZ2nR9z55.jpg",
                "genre_ids": [
                    16,
                    35,
                    878,
                    28,
                    14
                ],
                "id": 13253,
                "original_language": "en",
                "original_title": "Futurama: Bender's Game",
                "overview": "When Leela is insulted by a group of space-rednecks (like regular rednecks, but in space), she enters the Planet Express ship in a demolition derby. Leela emerges victorious, but when she brings the damaged ship home, and the Professor sees the fuel gauge, he's enraged by the hit he's going to take at the Dark Matter pump.  Now the crew have to find a way to break Mom's stranglehold on starship fuel, even if they have to wade through a Lord of the Rings-inspired fantasy-land to do it!",
                "popularity": 1.1082,
                "poster_path": "/bx8OVOBn5WP9TJJuOpRzyMCdzzb.jpg",
                "release_date": "2008-11-03",
                "title": "Futurama: Bender's Game",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 565,
                "character": "Turanga Leela (voice)",
                "credit_id": "52fe45539251416c75052ac9",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/xe4IIhJ0r3QjrKNPNEjVu3UtcZh.jpg",
                "genre_ids": [
                    16,
                    35,
                    878
                ],
                "id": 15060,
                "original_language": "en",
                "original_title": "Futurama: Into the Wild Green Yonder",
                "overview": "Leela becomes an outlaw when she and a group of ecologically-minded feminists attempt to save an asteroid of primitive life forms and the Violet Dwarf star from being destroyed, while Fry joins a secret society and attempts to stop a mysterious species known as the \"Dark Ones\" from destroying all life in the universe.",
                "popularity": 1.3899,
                "poster_path": "/oL6SymcxQE6TN9KrrbdyhlulnEG.jpg",
                "release_date": "2009-02-06",
                "title": "Futurama: Into the Wild Green Yonder",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 572,
                "character": "Turanga Leela (voice)",
                "credit_id": "52fe46359251416c75070c95",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Catherine Louise Sagal",
            "Mrs. C",
            "Katie Sagal",
            "Katy Sagal",
            "Katey Sagall",
            "Katey Sagel",
            "Κέιτι Σαγκάλ",
            "کیتی ساگال"
        ],
        "biography": "Catherine Louise \"Katey\" Sagal (born January 19, 1954) is an American actress, singer, and songwriter. She has had a successful and versatile career in both television and music, becoming a well-known and respected figure in the entertainment industry.\n\nSagal first gained recognition for her role as Peggy Bundy, the sassy and materialistic wife of Al Bundy, in the long-running sitcom \"Married... with Children\" (1987-1997). Her portrayal of Peggy Bundy showcased her comedic talent and made her a beloved character in the world of television.\n\nFollowing the success of \"Married... with Children,\" Sagal continued to thrive in the industry and took on a variety of roles in both comedic and dramatic projects. She has appeared in shows such as \"Futurama,\" where she provided the voice of Leela, and \"Sons of Anarchy,\" where she played the complex character Gemma Teller Morrow. Sagal's performances have earned her critical acclaim and various award nominations.\n\nIn addition to her acting career, Sagal is also a talented singer and songwriter. She has released several albums, showcasing her skills in genres such as rock and country. Sagal's musical talents have been featured on various television shows, including \"Sons of Anarchy,\" where she performed several songs.\n\nThroughout her career, Katey Sagal has proven her versatility and range as an actress, tackling both comedic and dramatic roles with equal aplomb. Her captivating performances and memorable characters have solidified her status as a respected and accomplished actress in the industry.",
        "birthday": "1954-01-19",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 18980,
        "imdb_id": "nm0005408",
        "known_for_department": "Acting",
        "name": "Katey Sagal",
        "place_of_birth": "Hollywood, Los Angeles, California, USA",
        "popularity": 1.7974,
        "profile_path": "/jdnBWdXlQG2Q2F6v9MPJkaWQ9Vd.jpg"
    }
}