{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7mmXWuBeNJiBO0NIOUWOuFve4Tb.jpg",
                "genre_ids": [
                    10402,
                    18
                ],
                "id": 424694,
                "original_language": "en",
                "original_title": "Bohemian Rhapsody",
                "overview": "Singer Freddie Mercury, guitarist Brian May, drummer Roger Taylor and bass guitarist John Deacon take the music world by storm when they form the rock 'n' roll band Queen in 1970. Hit songs become instant classics. When Mercury's increasingly wild lifestyle starts to spiral out of control, Queen soon faces its greatest challenge yet – finding a way to keep the band together amid the success and excess.",
                "popularity": 7.4737,
                "poster_path": "/lHu1wtNaczFPGFDTrjCSzeLPTKN.jpg",
                "release_date": "2018-10-24",
                "title": "Bohemian Rhapsody",
                "video": false,
                "vote_average": 7.968,
                "vote_count": 17296,
                "character": "VIP Party Guest (uncredited)",
                "credit_id": "5b03b3b40e0a2623c90244fc",
                "order": 53
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Johanna Thea's acting is characterised by her authenticity and playfulness. Born in Westminster and raised on the West Coast of Ireland, and while \"culturally Irish\", is of Jamaican, Indian, Swiss and English descent. The daughter of a professional international dancer/singer and a teacher/charity worker, she is the first actor in her family.\n\nPredominantly working in film, Johanna received an Honourable mention as Best Actress in the Independent Short Awards (LA, 2022), for her role in thriller \"Disquiet\". As Eva in British Indie thriller \"Resolve\" she was shortlisted for \"best actress in a web-series\" by Screennation (2018).\n\nPreviously, mental health awareness film \"Struggle\" won multiple awards, and her Irish debut \"When Next Possible Taka a U-Turn\" was shortlisted at both Catalyst & Linear international film festivals, winning Best LGBT+ Film of the year in 2019. \"The Wind Cries\" in which she plays Laurie Lovely, was shortlisted in Oscar qualifying festival Dances with Film (L.A.), which she attended.\n\nAn Honours BSc and MSc, Psychology and Neuroscience graduate (IOPPN), Johanna enjoys writing articles, scripts, and being a speaker on resilience and neurodiversity. \"If Only You Knew\", her autobiography in short stories, is available through Amazon, and her commissioned well-being articles are search-able online.\n\nAs a model (scouted at 16) she has worked for Range Rover, Meaty Bites (USA), the bark based Eco-friendly brand \"José Hendo\", Isabelle Deringo (during LA fashion week), appeared in campaigns for DIAGEO, TFI, Aviva Healthcare, etc., and as cover girl for DIVA magazine.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1898962,
        "imdb_id": "nm4811231",
        "known_for_department": "Acting",
        "name": "Johanna Thea",
        "place_of_birth": "Westminister - London - England - UK",
        "popularity": 0.1155,
        "profile_path": "/uDjPbp6FNRB0xjFxFmKTF4LLmJi.jpg"
    }
}