{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cJvUJEEQ86LSjl4gFLkYpdCJC96.jpg",
                "genre_ids": [
                    10752,
                    28
                ],
                "id": 1241436,
                "original_language": "en",
                "original_title": "Warfare",
                "overview": "A platoon of Navy SEALs embarks on a dangerous mission in Ramadi, Iraq, with the chaos and brotherhood of war retold through their memories of the event.",
                "popularity": 26.5978,
                "poster_path": "/srj9rYrjefyWqkLc6l2xjTGeBGO.jpg",
                "release_date": "2025-04-09",
                "title": "Warfare",
                "video": false,
                "vote_average": 7.139,
                "vote_count": 1007,
                "character": "Lt. MacDonald",
                "credit_id": "6616c5ddae6f09017b93dedc",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/scQf03Fm3jeyv4FH04qvi4fp4wh.jpg",
                "genre_ids": [
                    80,
                    35,
                    28
                ],
                "id": 402900,
                "original_language": "en",
                "original_title": "Ocean's Eight",
                "overview": "Debbie Ocean, a criminal mastermind, gathers a crew of female thieves to pull off the heist of the century at New York's annual Met Gala.",
                "popularity": 9.5652,
                "poster_path": "/MvYpKlpFukTivnlBhizGbkAe3v.jpg",
                "release_date": "2018-06-07",
                "title": "Ocean's Eight",
                "video": false,
                "vote_average": 6.968,
                "vote_count": 8525,
                "character": "Bus Boy",
                "credit_id": "59d6349d9251417f1e011d66",
                "order": 65
            },
            {
                "adult": false,
                "backdrop_path": "/kzXUQnrUnHUGHuwWbgf9KpoU3qr.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 544401,
                "original_language": "en",
                "original_title": "Cherry",
                "overview": "Cherry drifts from college dropout to army medic in Iraq - anchored only by his true love, Emily. But after returning from the war with PTSD, his life spirals into drugs and crime as he struggles to find his place in the world.",
                "popularity": 2.9009,
                "poster_path": "/pwDvkDyaHEU9V7cApQhbcSJMG1w.jpg",
                "release_date": "2021-02-26",
                "title": "Cherry",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1323,
                "character": "Cousin Joe",
                "credit_id": "5d9639bde329430024c41b8c",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Michael Gandolfini (born May 10, 1999) is an American actor. Gandolfini made his major film debut in Ocean's 8 (2018) and appeared in The Many Saints of Newark (2021), in which he played the role of Tony Soprano, which was originally portrayed by his father, James Gandolfini, in the television series The Sopranos.\n\nGandolfini was born on May 10, 1999, in New York City to actor James Gandolfini and Marcy Wudarski. He is of Italian, Polish, and Slovak heritage and has a younger half-sister from his father's second marriage. While he was a teenager, Gandolfini enjoyed performing, but his father advised against an acting career; he wanted him to pursue sports or \"be a director. They have the power,\" he said.\n\nHis father, James Gandolfini, died at age 51 of a heart attack in Rome on June 19, 2013.\n\nAfter his father's death, Michael Gandolfini decided to pursue acting. He enrolled at New York University after graduating from high school. After early auditions, he was cast in the HBO drama series The Deuce as Joey Dwyer. In 2019, he was cast in The Many Saints of Newark to play the young version of Tony Soprano, the role played by his father in the television series The Sopranos. Gandolfini had never watched the show. He described watching it while preparing for the role as an intense process. He was later cast in the Russo brothers' crime drama Cherry. In 2024, he was cast in Warfare, a war film written and directed by Ray Mendoza and Alex Garland.\n\nHe has been sober since 2017. As of January 2024, he has been in a relationship with fellow actress Mia Healey.\n\nDescription above from the Wikipedia article Michael Gandolfini, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1999-05-10",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1900369,
        "imdb_id": "nm6408859",
        "known_for_department": "Acting",
        "name": "Michael Gandolfini",
        "place_of_birth": "New York, New York",
        "popularity": 0.2747,
        "profile_path": "/28b4ER8m7AJ40vsgocFIhwTKkzp.jpg"
    }
}