{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ls3wjiOmWk8FAcfSqVrwPGpMzxR.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 434616,
                "original_language": "fr",
                "original_title": "Patients",
                "overview": "After a serious sport accident in a swimming pool, Ben, now an incomplete quadriplegic, arrives in a rehabilitation center. He meets with other handicapped persons (tetraplegics, paraplegics, traumatized crania), all victims of accidents, as well as a handicapped since his early childhood. They go through impotence, despair and resignation, with their daily struggle to learn how to move a finger or to hold a fork. Some of them slowly find a little mobility while others receive the verdict of the handicap for life. Despite everything, hope and friendship help them endure their difficulties.",
                "popularity": 1.4975,
                "poster_path": "/sv2Xdpk4nzY2qKAg5oG2qZkTrY9.jpg",
                "release_date": "2017-03-01",
                "title": "Patients",
                "video": false,
                "vote_average": 7.441,
                "vote_count": 617,
                "character": "Docteur Challes",
                "credit_id": "58775f5792514110350057c5",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nDominique Blanc (born 25 April 1956) is a French actress.\n\nShe was trained at the French Drama school, Cours Florent. In 1980, at the suggestion of Pierre Romans in whose class she was, Patrice Chéreau went to see her and engaged her for a performance of Henrik Ibsen's Peer Gynt. She remains one of Chéreau's preferred actresses.\n\nOne of the most critically acclaimed French actresses, Blanc has won four César Awards. One for Best Actress in 2000 for Stand-by (fr) and three for Best Actress in a Supporting Role: in 1990 for May Fools (Milou en mai), in 1992 for Indochine and in 1998 for Those Who Love Me Can Take the Train (Ceux qui m'aiment prendront le train) and has been nominated four more times. On 6 September 2008, she won the Volpi Cup for Best Actress at the 65th Venice Film Festival.",
        "birthday": "1956-04-25",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 19068,
        "imdb_id": "nm0086924",
        "known_for_department": "Acting",
        "name": "Dominique Blanc",
        "place_of_birth": "Lyon, Rhône, France",
        "popularity": 0.2612,
        "profile_path": "/yxy0yaSu7Zk7gecvjRJ55TBTze8.jpg"
    }
}