{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5YZbUmjbMa3ClvSW1Wj3D6XGolb.jpg",
                "genre_ids": [
                    878,
                    12,
                    28,
                    35
                ],
                "id": 447365,
                "original_language": "en",
                "original_title": "Guardians of the Galaxy Vol. 3",
                "overview": "Peter Quill, still reeling from the loss of Gamora, must rally his team around him to defend the universe along with protecting one of their own. A mission that, if not completed successfully, could quite possibly lead to the end of the Guardians as we know them.",
                "popularity": 16.4234,
                "poster_path": "/r2J02Z2OpNTctfOSN1Ydgii51I3.jpg",
                "release_date": "2023-05-03",
                "title": "Guardians of the Galaxy Vol. 3",
                "video": false,
                "vote_average": 7.931,
                "vote_count": 7651,
                "character": "Star Child",
                "credit_id": "64508274e942ee00e258f818",
                "order": 68
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Scarlett Juniper Blum"
        ],
        "biography": "Scarlett Blum is an American actor and dancer. The youngest member of a family of actors in Raleigh, North Carolina, Scarlett appeared in her first short film, \"Faces (Helene),\" when she was only 2 years old. Her parents, lifelong performers, met doing local theatre, so it surprised no one when Scarlett and her siblings all displayed talent as performers. By the age of four, Scarlett had acted in numerous theatrical productions ranging from Shakespearean tragedy to musical theatre. In fact, while they rehearsed \"Macbeth,\" the director, her mother, recognized Scarlett's preternatural focus as a skill that would translate well to film.\n\nScarlett booked her first regional commercial when she was four, but it was two years later, on the set of Fox's \"The Gifted,\" that she found her happy place. Cast and crew alike noted how Scarlett seamlessly slipped into character as the director said, \"Action!\" In fact, she so impressed the director with her performance in the first scene they shot, that he amended the script for her second scene, not only having Scarlett awake instead of asleep as originally scripted but assigning her dialogue as well.\n\nScarlett's fearless vulnerability in front of the camera landed her a pivotal role in a flashback episode in Season 9 of AMC's \"The Walking Dead\" (Her sister, Havana, played the same character, slightly older, in a Season 10 flashback episode). Soon after, Scarlett took on recurring roles in both HBO's \"The Outsider\" and Hulu's \"Reprisal\" demonstrating grounded performances and \"wisdom beyond her years.\" She enjoyed character arcs that spanned several episodes in both FOX's \"The Resident\" and NBC's \"Council of Dads.\" Scarlett also had a blast filming with Kristin Chenoweth in the Hallmark Channel's \"A Christmas Love Story.\"\n\nOff the set, Scarlett can be found at her dance studio studying various styles of dance as well as learning acrobatics. When she's not at the studio, Scarlett is likely dancing around her home, practicing acrobatics on the trampoline, or singing with her older brother and sister. An avid reader, Scarlett also enjoys chess, broccoli, and Roblox (not necessarily in that order).",
        "birthday": "2011-01-01",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1907258,
        "imdb_id": "nm7946304",
        "known_for_department": "Acting",
        "name": "Scarlett Blum",
        "place_of_birth": "Raleigh, North Carolina, USA",
        "popularity": 0.7065,
        "profile_path": "/5Dy1xkJYm9g03jRx5RVgOtVNoay.jpg"
    }
}