{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sU3gFo7Gn67zjtKXIvzJ4omcUbH.jpg",
                "genre_ids": [
                    36,
                    18,
                    12
                ],
                "id": 665,
                "original_language": "en",
                "original_title": "Ben-Hur",
                "overview": "In 25 AD, Judah Ben-Hur, a Jew in ancient Judea, opposes the occupying Roman empire.  Falsely accused by a Roman childhood friend-turned-overlord of trying to kill the Roman governor, he is put into slavery and his mother and sister are taken away as prisoners.",
                "popularity": 5.7433,
                "poster_path": "/m4WQ1dBIrEIHZNCoAjdpxwSKWyH.jpg",
                "release_date": "1959-11-18",
                "title": "Ben-Hur",
                "video": false,
                "vote_average": 7.886,
                "vote_count": 2943,
                "character": "The Lubian (uncredited)",
                "credit_id": "5605e9d3c3a368121b0003b8",
                "order": 40
            },
            {
                "adult": false,
                "backdrop_path": "/aheSIG4h3JNxWeDvdb1NxKzgjaM.jpg",
                "genre_ids": [
                    36,
                    10752,
                    18,
                    12
                ],
                "id": 967,
                "original_language": "en",
                "original_title": "Spartacus",
                "overview": "The rebellious Thracian Spartacus, born and raised a slave, is sold to Gladiator trainer Batiatus. After weeks of being trained to kill for the arena, Spartacus turns on his owners and leads the other slaves in rebellion. As the rebels move from town to town, their numbers swell as escaped slaves join their ranks. Under the leadership of Spartacus, they make their way to southern Italy, where they will cross the sea and return to their homes.",
                "popularity": 6.0939,
                "poster_path": "/r0Fgg1GyZgzokaiw2HFQv3oPaL2.jpg",
                "release_date": "1960-10-13",
                "title": "Spartacus",
                "video": false,
                "vote_average": 7.54,
                "vote_count": 2262,
                "character": "Soldier (uncredited)",
                "credit_id": "5601f62192514104a200028d",
                "order": 64
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/fik1HN9kxpD4CtEOXA4WUruwsg1.jpg",
                "genre_ids": [
                    37
                ],
                "id": 3114,
                "original_language": "en",
                "original_title": "The Searchers",
                "overview": "As a Civil War veteran spends years searching for a young niece captured by Indians, his motivation becomes increasingly questionable.",
                "popularity": 2.8078,
                "poster_path": "/jLBmgW0epNzJ1N9uzaVCjbyT94v.jpg",
                "release_date": "1956-05-16",
                "title": "The Searchers",
                "video": false,
                "vote_average": 7.703,
                "vote_count": 1494,
                "credit_id": "6438dcab81a7fc00e1fe1ddc",
                "department": "Crew",
                "job": "Stunts"
            },
            {
                "adult": false,
                "backdrop_path": "/agUD7Wp6LAwpaB3phx6yiRmFoSY.jpg",
                "genre_ids": [
                    37
                ],
                "id": 3089,
                "original_language": "en",
                "original_title": "Red River",
                "overview": "Following the Civil War, headstrong rancher Thomas Dunson decides to lead a perilous cattle drive from Texas to Missouri. During the exhausting journey, his persistence becomes tyrannical in the eyes of Matthew Garth, his adopted son and protégé.",
                "popularity": 4.5863,
                "poster_path": "/jyNTsAzrIWB441OtvfbgKtx1kFS.jpg",
                "release_date": "1948-09-17",
                "title": "Red River",
                "video": false,
                "vote_average": 7.339,
                "vote_count": 558,
                "credit_id": "64c86afa1fa1c800cdf62837",
                "department": "Crew",
                "job": "Stunts"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Clifford William Lyons",
            "Tex",
            "Cliff \"Tex\" Lyons"
        ],
        "biography": "Cliff Lyons was an American actor, stuntman and second-unit director, primarily of Westerns, particularly the films of John Ford and John Wayne. Lyons, the son of Garrett Thomas Lyons and Wilhamena Johnson Lyons, was raised on a South Dakota farm, though his family lived for a time in Memphis, TN, where he attended business school. An expert horseman, he gave up the notion of a business career and opted for the rodeo arena instead, touring the country;y and eventually reaching Los Angeles at the age of 21. With accomplished cowboys in great demand, Lyons quickly became involved in movies, working both as a stuntman and an actor. After only a couple of bit parts, he was signed by producer Bud Barsky to do seven inexpensive Westerns directed by Paul Hurst, with Lyons and Al Hoxie alternating as the hero and the heavy. Lyons and Hoxie alternated in another Western series produced by Morris R. Schlank, and, as Cliff 'Tex' Lyons, he seemed headed for minor stardom as a B-Western lead. However, Lyons' voice was not well-suited for sound and the talkie revolution confined him to small roles. As his small shot at stardom faded, however, his career as a stunt double for stars big and small was on the rise. He doubled such cowboy stars as Tom Mix, Ken Maynard, Buck Jones and Johnny Mack Brown. In 1936 he worked with John Wayne for the first and struck up a personal and business relationship that would remain strong for three decades. Wayne was influential in getting Lyons his first work as a second-unit director and in introducing Lyons to John Ford, for whom Lyons would do some of his finest work. Lyons' reputation as a stunt coordinator is comparable to that of acknowledged master Yakima Canutt, with whom Lyons partnered on numerous occasions. Perhaps Lyons' most impressive work was the massive and dynamic battle sequences of Wayne's The Alamo (1960). He was married from 1938 to 1955 to actress Beth Marion, with whom he had two sons. Cliff Lyons died in 1974 at 72, not long after coordinating stunts for Wayne's The Train Robbers (1973).\n\nDate of Birth  4 July  1901, near Clarno Township, Lake County, South Dakota\n\nDate of Death  6 January  1974, Los Angeles, California",
        "birthday": "1901-07-05",
        "deathday": "1974-01-06",
        "gender": 2,
        "homepage": null,
        "id": 190775,
        "imdb_id": "nm0529036",
        "known_for_department": "Acting",
        "name": "Cliff Lyons",
        "place_of_birth": "Clarno Township, Lake County, South Dakota, USA",
        "popularity": 0.098,
        "profile_path": "/pIY0P7eeSGtPcsdRM4YAqT4VEvj.jpg"
    }
}