{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mQC9OxFBGKJmk4tgzpmKO1nIZx5.jpg",
                "genre_ids": [
                    18,
                    10752
                ],
                "id": 1786,
                "original_language": "fr",
                "original_title": "Au revoir les enfants",
                "overview": "Au revoir les enfants tells a heartbreaking story of friendship and devastating loss concerning two boys living in Nazi-occupied France. At a provincial Catholic boarding school, the precocious youths enjoy true camaraderie—until a secret is revealed. Based on events from writer-director Malle’s own childhood, the film is a subtle, precisely observed tale of courage, cowardice, and tragic awakening.",
                "popularity": 3.3695,
                "poster_path": "/lXP90Vx7OcviBfbbokcaG6zVnPG.jpg",
                "release_date": "1987-10-07",
                "title": "Au Revoir les Enfants",
                "video": false,
                "vote_average": 7.524,
                "vote_count": 685,
                "character": "Jean Bonnet",
                "credit_id": "52fe4315c3a36847f8038ef7",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Raphaël Fejtö"
        ],
        "biography": "Raphaël Fejtö (born September 17, 1974) is a French actor, director, and author. He is most famous for co-starring in Louis Malle's semi-autobiographical 1987 motion picture Au revoir, les enfants (Goodbye, Children).\n\nFejtö is of Russian, Egyptian, and Lebanese ancestry. His grandfather was Ferenc Fejtő, a famous Hungarian historian and journalist.\n\nHis primary acting credit is in Au revoir, les enfants. He also wrote, directed, and starred in the 1996 short film 56 fois par semaine (56 Times A Week). He wrote and directed the French-language film Osmose (Osmosis) in 2003. His second motion picture, L'Age D'Homme (The Age of Man, which he also wrote), starred Romain Duris, Aïssa Maïga, and Clément Sibony and was released in 2007.\n\nHe is also the co-author and illustrator (with his mother, Nadja) of several children's books. Among these are Le Vélo de Jo (Jo's Bicycle), Petit George (Little George), and Roro le Pompier (Roro the Fireman).\n\nDescription above from the Wikipedia article Raphaël Fejtö, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1974-09-17",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 19072,
        "imdb_id": "nm0270830",
        "known_for_department": "Directing",
        "name": "Raphael Fejtö",
        "place_of_birth": "Paris, France",
        "popularity": 0.053,
        "profile_path": "/oFDhQm7oHULbODDcnx1KzXaby3o.jpg"
    }
}