{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yjlg8Gq3TAWlFSUxh7Icey8uM4P.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 10653,
                "original_language": "en",
                "original_title": "The Seven Year Itch",
                "overview": "With his family away for their annual summer holiday, a publishing executive decides to live a bachelor's life. The beautiful but ditzy blonde from the apartment above catches his eye and they soon start spending time together—maybe a little too much time!",
                "popularity": 1.7389,
                "poster_path": "/4oLqx0QbjWFzWtkxRmDLGH47CUJ.jpg",
                "release_date": "1955-06-03",
                "title": "The Seven Year Itch",
                "video": false,
                "vote_average": 7.063,
                "vote_count": 934,
                "character": "Waitress at Vegetarian Restaurant (uncredited)",
                "credit_id": "57437ba5c3a3685c4a0000e9",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Dora Matthews"
        ],
        "biography": "Plain, angular Doro Merande was one of those delightful character actresses you couldn't take your eyes off of, no matter how minuscule the part. She excelled at playing older than she was -- doting aunts, inveterate gossips, curt secretaries and small-minded townspeople -- all topped with an amusing warble in her voice and bristly eccentric edge. Too bad then that she wasn't used more in films, but she preferred live theater and based herself for the most part on the East Coast. She was born Dora Matthews in Kansas in 1892 and orphaned as a child. Growing up in boarding schools, she headed to New York and pursued an acting career immediately after finishing her education. She appeared long and hard on the stock stage before making it on Broadway at age 43. She settled there sparking over 25 Broadway plays in her lifetime, including a scene-stealing turn in the classic Thorton Wilder play \"Our Town\" which brought her to Hollywood to preserve the role on film. On and off she remained a delightful film and TV cameo player with roles in The Gazebo (1959), The Russians Are Coming, The Russians Are Coming (1966), and The Front Page (1974). She and star Enid Markey (Jane of the \"Tarzan\" film silents) starred together as pampering aunts in the sitcom Bringing Up Buddy (1960), but, despite promising ratings, the two veteran actresses did not get along and the series folded after only a season. Ms. Merande was also a recurring presence for Jackie Gleason on his variety show. She died, in fact, of a stroke while there in Miami to film an episode.\n\nDate of Birth 31 March 1892, Columbia, Kansas\n\nDate of Death 1 November 1975, New York City, New York  (stroke)",
        "birthday": "1892-03-29",
        "deathday": "1975-11-01",
        "gender": 1,
        "homepage": null,
        "id": 19097,
        "imdb_id": "nm0580109",
        "known_for_department": "Acting",
        "name": "Doro Merande",
        "place_of_birth": "Columbus, Kansas, USA",
        "popularity": 0.0921,
        "profile_path": "/nvrmUwbUJRgTh2UdiP060Mbk1fR.jpg"
    }
}