{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/syapU4X3vYBCdARyAOtz3g90hMt.jpg",
                "genre_ids": [
                    53,
                    18,
                    80
                ],
                "id": 1900,
                "original_language": "en",
                "original_title": "Traffic",
                "overview": "An exploration of the United States of America's war on drugs from multiple perspectives. For the new head of the Office of National Drug Control Policy, the war becomes personal when he discovers his well-educated daughter is abusing cocaine within their comfortable suburban home. In Mexico, a flawed, but noble policeman agrees to testify against a powerful general in league with a cartel, and in San Diego, a drug kingpin's sheltered trophy wife must learn her husband's ruthless business after he is arrested, endangering her luxurious lifestyle.",
                "popularity": 4.9867,
                "poster_path": "/v6YrfR1e2OUAYbXrJ7hv3EiGNcg.jpg",
                "release_date": "2000-12-27",
                "title": "Traffic",
                "video": false,
                "vote_average": 7.081,
                "vote_count": 2261,
                "character": "Senator Barbara Boxer",
                "credit_id": "5f846f68e93e95003612594c",
                "order": 71
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Senator Barbara Boxer",
            "Sen. Barbara Boxer",
            "Barbara Bouncer",
            "Barbara Sue Levy Boxer"
        ],
        "biography": "Barbara Sue Boxer (née Levy; born November 11, 1940) is an American politician and lobbyist who served in the United States Senate, representing California from 1993 to 2017. A member of the Democratic Party, she previously served as the U.S. representative for California's 6th congressional district from 1983 until 1993.\n\nBorn in Brooklyn, New York City, Boxer graduated from George W. Wingate High School and Brooklyn College. She worked as a stockbroker for several years before moving to California with her husband. During the 1970s, she worked as a journalist for the Pacific Sun and as an aide to U.S. Representative John L. Burton. She served on the Marin County Board of Supervisors for six years and became the board's first female president. With the slogan \"Barbara Boxer Gives a Damn\", she was elected to the United States House of Representatives in 1982, representing California's 6th district.\n\nBoxer won the 1992 election for the U.S. Senate. Running for a third term in 2004, she received 6.96 million votes, becoming the first person to ever get more than 6 million votes in a Senate election and set a record for the most votes in any U.S. Senate election in history, until her colleague, Dianne Feinstein, the senior senator from California, surpassed that number in her 2012 re-election. Boxer and Feinstein were the first female pair of U.S. Senators representing any state at the same time. Boxer was the ranking member of the Environment and Public Works Committee and the vice chair of the Select Committee on Ethics. She was also the Democratic Chief Deputy Whip. Boxer is known for her liberal perspectives.",
        "birthday": "1940-11-11",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 191182,
        "imdb_id": "nm0101526",
        "known_for_department": "Acting",
        "name": "Barbara Boxer",
        "place_of_birth": "New York, New York, USA",
        "popularity": 0.3418,
        "profile_path": "/7SOSLMSg7q3Oem2Hmulb4c1bvNF.jpg"
    }
}