{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uif5fUshJrXyyDzfpzp1DLw3N0S.jpg",
                "genre_ids": [
                    27,
                    53,
                    9648
                ],
                "id": 539,
                "original_language": "en",
                "original_title": "Psycho",
                "overview": "When larcenous real estate clerk Marion Crane goes on the lam with a wad of cash and hopes of starting a new life, she ends up at the notorious Bates Motel, where manager Norman Bates cares for his housebound mother.",
                "popularity": 8.4504,
                "poster_path": "/yz4QVqPx3h1hD1DfqqQkCq3rmxW.jpg",
                "release_date": "1960-06-22",
                "title": "Psycho",
                "video": false,
                "vote_average": 8.422,
                "vote_count": 10504,
                "character": "California Charlie",
                "credit_id": "52fe424fc3a36847f8014285",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "John R. Anderson"
        ],
        "biography": "John Robert Anderson (October 20, 1922 – August 7, 1992) A tall, sinewy, austere-looking character actor with silver hair, rugged features and a distinctive voice, John Robert Anderson appeared in hundreds of films and television episodes. Immensely versatile, he was at his best submerging himself in the role of historical figures (he impersonated Abraham Lincoln three times and twice baseball commissioner Judge Kenesaw Mountain Landis, men whom he strongly resembled). He was a familiar presence in westerns and science-fiction serials, usually as upstanding, dignified and generally benign citizens (a rare exception was his Ebonite interrogator in The Outer Limits (1963) episode \"Nightmare\"). He had a high opinion of Rod Serling and was proud to be featured in four episodes of The Twilight Zone (1959), most memorably as the tuxedo-clad angel Gabriel in \"A Passage for Trumpet\" (doing for Jack Klugman what Henry Travers did for James Stewart in It's a Wonderful Life (1946)).",
        "birthday": "1922-10-20",
        "deathday": "1992-08-07",
        "gender": 2,
        "homepage": null,
        "id": 19111,
        "imdb_id": "nm0026930",
        "known_for_department": "Acting",
        "name": "John Anderson",
        "place_of_birth": "Clayton, Illinois, USA",
        "popularity": 0.7709,
        "profile_path": "/wcliAvgKHkwUmxkMUIGETp9tk1d.jpg"
    }
}