{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3NfM0sRwVLnsQkCd5YBPGvM9a5v.jpg",
                "genre_ids": [
                    18,
                    53,
                    36
                ],
                "id": 80278,
                "original_language": "en",
                "original_title": "The Impossible",
                "overview": "In December 2004, close-knit family Maria, Henry and their three sons begin their winter vacation in Thailand. But the day after Christmas, the idyllic holiday turns into an incomprehensible nightmare when a terrifying roar rises from the depths of the sea, followed by a wall of black water that devours everything in its path. Though Maria and her family face their darkest hour, unexpected displays of kindness and courage ameliorate their terror.",
                "popularity": 6.9996,
                "poster_path": "/k0DLCiDbnYywOHiISALbl2EH2NE.jpg",
                "release_date": "2012-09-09",
                "title": "The Impossible",
                "video": false,
                "vote_average": 7.369,
                "vote_count": 6482,
                "character": "Tourist at Bus Station",
                "credit_id": "64dbebe8fe077a00aef5d375",
                "order": 35
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Ulf (Jean Loup) Pilblad was born in Stockholm, Sweden, and is a film producer, actor and script writer. In his childhood, he began early in theatre schools in Stockholm where he studied 8 years with different teachers. He also worked as an assistant to the operetta-singer and dancer, Hasse Funck, who had started an activity called Minifunckarna in 1965, where he educated children in acting!\n\nIn Bangkok since 1996, he has started his own company, a Destination Management Company, PCE Travel Consultants, and worked as Production and Location Manager for several Scandinavian TV productions. He has also participated in several acting workshops with Maurizio Mistretta, Fulvio Ianneo and John Marengo and participated in several performances with ALL SOUL Production Company in Thailand and Italy! One of the plays - True Story - is based on his personal experiences during the Tsunami 2004 which was played for the first time in the Art and Culture Festival \"Dramophone\" in Bologna (Italy) in June / July 2012.\n\nUlf has participated in the film The Impossible (2012) directed by Juan Antonio Bayona. In February 2013 he has participated in Bababoboa project Festival \"Paura-fear-klua\" at the TADU Art and Exhibition Center in Bangkok! In 2013 Ulf produced the film \"Fufu - 99 Minutes of Life\" in Thailand. He also played one of the main characters in the film: Roland. In 2014 he produced the film \"Fatima's Secret\" in Thailand. He also played one of the main characters in the film: Gogo.\n\nUlf is also owner, together Maurizio Mistretta and Patchanee Poonthong, and producer of the All Soul Production Co., Ltd. (Thailand), All Soul Production (France). He is also owner and President of the travel agencies AFS Chic Paris (France) and PCE Travel Consultants (Thailand).",
        "birthday": "1960-08-29",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1912145,
        "imdb_id": "nm5408201",
        "known_for_department": "Acting",
        "name": "Ulf Pilblad",
        "place_of_birth": " Stockholm,  Sweden",
        "popularity": 0.05,
        "profile_path": null
    }
}