{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gC0zFICTbsmJrUfAcHJl76nA0GC.jpg",
                "genre_ids": [
                    80,
                    53,
                    28
                ],
                "id": 8333,
                "original_language": "en",
                "original_title": "The Taking of Pelham One Two Three",
                "overview": "In New York, armed men hijack a subway car and demand a ransom for the passengers. Even if it's paid, how could they get away?",
                "popularity": 3.9958,
                "poster_path": "/vNhywp9w1DVG6BytxKp4kjtaaGC.jpg",
                "release_date": "1974-10-02",
                "title": "The Taking of Pelham One Two Three",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 576,
                "character": "Ptl. O'Keefe",
                "credit_id": "6223abc77c6de3004465e924",
                "order": 43
            },
            {
                "adult": false,
                "backdrop_path": "/oWWsuxplpHdwxVw2u6f3dGLKcvC.jpg",
                "genre_ids": [
                    35,
                    10751,
                    10402
                ],
                "id": 830784,
                "original_language": "en",
                "original_title": "Lyle, Lyle, Crocodile",
                "overview": "When the Primm family moves to New York City, their young son Josh struggles to adapt to his new school and new friends. All of that changes when he discovers Lyle — a singing crocodile who loves baths, caviar and great music — living in the attic of his new home. But when Lyle’s existence is threatened by evil neighbor Mr. Grumps, the Primms must band together to show the world that family can come from the most unexpected places.",
                "popularity": 3.552,
                "poster_path": "/dN6XnCEP3AO7N4XFOFyZ8V8kZF5.jpg",
                "release_date": "2022-10-07",
                "title": "Lyle, Lyle, Crocodile",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 621,
                "character": "Judge",
                "credit_id": "63b999e1c0a308007fc09df0",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "The dedication of Sal Viscuso to the craft of acting can be dated to a singular evening in 1967. A college freshman, he happened upon a teleplay of Ronald Ribman's CBS Playhouse: The Final War of Olly Winter (1967) and was so inspired by Ivan Dixon's Emmy-winning rendition of the title role that he entered the drama department the very next day, later explaining, \"I felt that there I had found my family.\" He earned his BA from the University of California at Davis, then went on to study with Olympia Dukakis at NYU School of the Arts, from which he graduated with an MFA.\n\nOpportunities presented themselves rapidly, and Sal made his film debut in the classic The Taking of Pelham One Two Three (1974). An introduction to Burt Metcalfe, associate producer of the iconic series M*A*S*H (1972), led to his move to Los Angeles, and soon Sal was a regular on NBC's sitcom The Montefuscos (1975). He was an off-screen loudspeaker announcer (as well as various other characters) on M*A*S*H (1972); appeared in Gene Wilder's homage to 1920's Hollywood, The World's Greatest Lover (1977); improvised in Robert Altman's Three Women (1977); and played multiple parts on the beloved Barney Miller (1975) (one of which was written especially for him by the show's creator, Danny Arnold).\n\nHe was also to feature in what TIME magazine has rated as one of the \"Top 100 TV shows of all time,\" Susan Harris's Soap (1977). His vocationally challenged Father Timothy Flotsky (and the show's depiction of one of the first openly gay characters on network television), created instant controversy that attracted 19 million viewers to the series premiere. Shortly thereafter, Sal commenced his professional association with the Bancroft/Brooks combine of talent, first appearing in Anne Bancroft's Fatso (1980), and then in Mel Brooks' Spaceballs (1987), about which he has remarked, \"I continue to get more attention from that project than from anything I've ever done!\"",
        "birthday": "1948-10-05",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 19136,
        "imdb_id": "nm0899601",
        "known_for_department": "Acting",
        "name": "Sal Viscuso",
        "place_of_birth": "Brooklyn, New York, USA",
        "popularity": 0.2479,
        "profile_path": "/jmblbzHDTcGcR0nI1zUifxfuq24.jpg"
    }
}