{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cDDyZ2qtBzNAepdTbgxKfFcxREl.jpg",
                "genre_ids": [
                    80,
                    18,
                    53
                ],
                "id": 4147,
                "original_language": "en",
                "original_title": "Road to Perdition",
                "overview": "Mike Sullivan works as a hit man for crime boss John Rooney. Sullivan views Rooney as a father figure, however after his son is witness to a killing, Mike Sullivan finds himself on the run in attempt to save the life of his son and at the same time looking for revenge on those who wronged him.",
                "popularity": 5.4556,
                "poster_path": "/loSpBeirRfTPJ3cMIqpQArstGhh.jpg",
                "release_date": "2002-07-12",
                "title": "Road to Perdition",
                "video": false,
                "vote_average": 7.352,
                "vote_count": 3800,
                "character": "Crime Scene Policeman",
                "credit_id": "56b16a69c3a3687e51000db2",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Lance Baker is an award winning Chicago based actor whose career has spanned over 25 years. Chicago credits include: Thom Pain (based on nothing) (Theater Wit); King Lear, Henry VIII and Amadeus (Chicago Shakespeare Theater); Invisible Man and Travesties (Court Theatre); The Agony and the Ecstasy of Steve Jobs (16th Street Theater); Becky Shaw and Hunger and Thirst (A Red Orchid Theatre); The Humans and Speed the Plow (American Theater Company); Mauritius and Lady (Northlight Theatre); A Steady Rain (Chicago Dramatists); Dollhouse and Lobby Hero (Goodman Theatre); Up Against It (Lookingglass Theatre); This is Our Youth and Dealer's Choice (Roadworks Productions); Mad Forest (Remains Theatre). Regional credits include: Around the World in 80 Days (Lookingglass Theatre/Kansas City Repertory); Fanny Brice: The Real Funny Girl (Asolo Repertory Theatre/Maltz Jupiter Theatre); Sleuth and The Fox on the Fairway (Theatre at the Center); and Ecstasy (Odyssey Theatre Ensemble). He has received one Joseph Jefferson Award and one After Dark Award. He was the director for The Earl and co-director of A Very Merry Unauthorized Children's Scientology Pageant, both at A Red Orchid Theatre, where he is an ensemble member. He has a B.F.A. in Acting from the Theatre School of DePaul University.",
        "birthday": "1972-05-02",
        "deathday": null,
        "gender": 2,
        "homepage": "https://lancebakeractor.wordpress.com/about/",
        "id": 191637,
        "imdb_id": "nm0048676",
        "known_for_department": "Acting",
        "name": "Lance Baker",
        "place_of_birth": "Chicago, Illinois, U.S",
        "popularity": 0.0409,
        "profile_path": null
    }
}