{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/i7bJjfaAIsUT0SYwSy9ahzJLrka.jpg",
                "genre_ids": [
                    35
                ],
                "id": 30197,
                "original_language": "en",
                "original_title": "The Producers",
                "overview": "Broadway producer Max Bialystock and his accountant, Leo Bloom, plan to make money by charming wealthy old biddies to invest in a production many times over the actual cost, and then put on a sure-fire flop, so nobody will ask for their money back – and what can be a more certain flop than a tasteless musical celebrating Hitler.",
                "popularity": 1.7137,
                "poster_path": "/9qCIkNWGuRj5lMyeOXwJs8z9nRz.jpg",
                "release_date": "1968-03-18",
                "title": "The Producers",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 833,
                "character": "Lorenzo St. DuBois (L.S.D.)",
                "credit_id": "52fe44049251416c910023a7",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/wSiBXaJ2PtlxUGH2waIxQZjFPhg.jpg",
                "genre_ids": [
                    28,
                    12,
                    35,
                    80
                ],
                "id": 11576,
                "original_language": "en",
                "original_title": "It's a Mad, Mad, Mad, Mad World",
                "overview": "A group of strangers come across a man dying after a car crash who proceeds to tell them about the $350,000 he buried in California. What follows is the madcap adventures of those strangers as each attempts to claim the prize for himself.",
                "popularity": 9.1287,
                "poster_path": "/j4mWzOisSHFkaqIkq34l2mm8a5K.jpg",
                "release_date": "1963-11-07",
                "title": "It's a Mad, Mad, Mad, Mad World",
                "video": false,
                "vote_average": 6.97,
                "vote_count": 637,
                "character": "Sylvester Marcus",
                "credit_id": "52fe445f9251416c750326a5",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Richard Schulefand"
        ],
        "biography": "Dick Shawn (December 1, 1923 – April 17, 1987) was an American actor.  Way ahead of his time most say, it was extremely difficult indeed to know how to properly tap into this man's eclectic talents. Shawn began inching toward the forefront during the be-bop 50s and early 60s with his odd penchant for playing cool cats. During his mild bid for film stardom, he was top-billed as a hip, laid back genie in the thoroughly dismal satire The Wizard of Baghdad (1960), but seemed to have better luck when taken in smaller doses. He fared quite well opposite another \"way-out-there\" comedian, Ernie  Kovacs, in Wake Me When It's Over (1960) as a hustling soldier out to make a buck in the Far East. Also on the plus side, he replaced Zero Mostel in the bawdy musical \"A Funny Thing Happened on the Way to the Forum\" on Broadway and stole a small scene in the all-star epic comedy It's a Mad Mad Mad Mad World (1963). By far, the one role that  completely overshadows all of his other hard work is his mock portrayal of a singing Adolf Hitler in the show-within-a-movie The Producers (1968). In the film, which starred Mostel and Gene Wilder as two con artists deliberately producing a stage \"bomb\" called \"Springtime for Hitler,\" Shawn sang the hammy, absurdly narcissistic song \"Love Power.\"  The movie finally captured Shawn in his element, but this stroke of genius of matching actor to role would never happen again for him. For the most part his roles came off slick and smarmy, and were stuck in mediocre material. Shawn won a huge fan base, however, touring in one-man stage shows which contained a weird mix of songs, sketches, satire, philosophy and even pantomime. A bright, innovative wit, one of his best touring shows was called \"The Second Greatest Entertainer in the  World.\" During the show's intermission, Shawn would lie visibly on the stage floor absolutely still during the entire time. By freakish coincidence, Shawn was performing at the University of California at San Diego in 1987 when he suddenly fell forward on the stage during one of his spiels about the Holocaust. The audience, of course, laughed, thinking it was just a part of his odd shtick. In actuality, the 63-year-old married actor with four children had suffered a fatal heart attack. A not-surprising end for this thoroughly offbeat and intriguing personality.",
        "birthday": "1923-12-01",
        "deathday": "1987-04-17",
        "gender": 2,
        "homepage": null,
        "id": 19178,
        "imdb_id": "nm0790071",
        "known_for_department": "Acting",
        "name": "Dick Shawn",
        "place_of_birth": "Buffalo, New York, USA",
        "popularity": 2.896,
        "profile_path": "/hqVdhAEQDcX42pa38pCw5S4SDMG.jpg"
    }
}