{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9guoVF7zayiiUq5ulKQpt375VIy.jpg",
                "genre_ids": [
                    16,
                    28,
                    14,
                    12
                ],
                "id": 592350,
                "original_language": "ja",
                "original_title": "僕のヒーローアカデミア THE MOVIE ヒーローズ：ライジング",
                "overview": "Class 1-A visits Nabu Island where they finally get to do some real hero work. The place is so peaceful that it's more like a vacation... until they're attacked by a villain with an unfathomable Quirk! His power is eerily familiar, and it looks like Shigaraki had a hand in the plan. But with All Might retired and citizens' lives on the line, there's no time for questions. Deku and his friends are the next generation of heroes, and they're the island's only hope.",
                "popularity": 4.0235,
                "poster_path": "/kpWsIkfXrnQ1pmR79qAHHq7DPxc.jpg",
                "release_date": "2019-12-20",
                "title": "My Hero Academia: Heroes Rising",
                "video": false,
                "vote_average": 8.2,
                "vote_count": 1226,
                "character": "Slice (voice)",
                "credit_id": "60d1d373a27502002fbe1036",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "美桜ちゃん",
            "میو ایمادا"
        ],
        "biography": "Imada Mio is a model, talent, actress, singer, and ex-gravure model. She was born in Fukuoka City, Fukuoka Prefecture on March 5, 1997. She currently belongs to the agency Content 3.\n\nWhen she was 16, she was scouted in Shintencho. For a time, she was a part of the model agency CGE. She became a part of the 3 person group Sagemon Girls in 2016 as the leader and center. She was recruited by BIGFACE (now Content 3) at the age of 19. She later moved to Tokyo and joined the agency with an interest in becoming an actress. Later that year, she would star in Nakagawa Shun's independent and acclaimed short film \"Kalanchoe\".\n\nOn November 7, 2018, she appeared in the role of the main character, Miki, for the LINE mystery game \"koToro\" and also starred in the commercials advertising it. In December, she won the Yahoo! Search Awards in the actress category.\n\nIn January of 2019, she became the image character for a car purchase and assessment service called \"Rabbit\". She's also ranked first in the \"2019 next break rankings\" on the information site \"Debut\". She pitched the opening pitch for the opening ceremony of the Softbank Hawks vs. the Seibu Lions on March 29. In April of 2019, she became the ambassador for a WiFi router alongside Sato Jiro.\n\nSince January 2020, she has been the campaign character for the brand AOKI's Ladies Freshers.\n\nOn August 31st, 2022, she was awarded her first \"Best Actress\" award for her performance as Tanaka Maririn in her first leading role in NTV drama series, \"Waru: Hataraku no ga Kakko Warui Nante Dare ga Itta?\" at 112th Television Drama Academy Awards.",
        "birthday": "1997-03-05",
        "deathday": null,
        "gender": 1,
        "homepage": "https://imadamio.com/",
        "id": 1919754,
        "imdb_id": "nm7242611",
        "known_for_department": "Acting",
        "name": "Mio Imada",
        "place_of_birth": "Fukuoka, Japan",
        "popularity": 2.8533,
        "profile_path": "/f7gPq6gv3LDrs3eN0FJY5hGpfyG.jpg"
    }
}