{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/t35dVtLN4H12XXtipJfIDEy2h7Y.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 3291,
                "original_language": "en",
                "original_title": "Good Night, and Good Luck.",
                "overview": "The story of journalist Edward R. Murrow's stand against Senator Joseph McCarthy's anti-communist witch-hunts in the early 1950s.",
                "popularity": 1.882,
                "poster_path": "/w4QSEno2xxHqMtSr3mPUhJpO3F2.jpg",
                "release_date": "2005-09-16",
                "title": "Good Night, and Good Luck.",
                "video": false,
                "vote_average": 7.077,
                "vote_count": 1045,
                "character": "Self (archive footage) (uncredited)",
                "credit_id": "63c7fcc6142ef1007d86f499",
                "order": 37
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Roy M. Cohn"
        ],
        "biography": "Roy Marcus Cohn (February 20, 1927 – August 2, 1986) was an American lawyer and prosecutor who came to prominence for his role as Senator Joseph McCarthy's chief counsel during the Army–McCarthy hearings in 1954, when he assisted McCarthy's investigations of suspected communists. In the late 1970s and during the 1980s, he became a prominent political fixer in New York City. He also represented and mentored the real estate developer and later U.S. President Donald Trump during his early business career.\n\nCohn was born in The Bronx in New York City and educated at Columbia University. He rose to prominence as a U.S. Department of Justice prosecutor at the espionage trial of Julius and Ethel Rosenberg, where he successfully prosecuted the Rosenbergs leading to their execution in 1953. As a prosecuting chief counsel during the trials, his reputation deteriorated during the late 1950s to late 1970s after McCarthy's downfall.\n\nIn 1986, he was disbarred by the Appellate Division of the New York State Supreme Court for unethical conduct after attempting to defraud a dying client by forcing the client to sign a will amendment leaving him his fortune. He died five weeks later from AIDS-related complications, having vehemently denied that he was suffering from HIV.\n\nDescription above from the Wikipedia article Roy Cohn, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1927-02-20",
        "deathday": "1986-08-02",
        "gender": 2,
        "homepage": null,
        "id": 1921133,
        "imdb_id": "nm0169946",
        "known_for_department": "Acting",
        "name": "Roy Cohn",
        "place_of_birth": "New York City, USA",
        "popularity": 0.4603,
        "profile_path": "/nlNzZQI7nTPgEAlw0hzoRvuLDNF.jpg"
    }
}