{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kN8SMfKfca655F97pqRnWPmFAiZ.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 550231,
                "original_language": "en",
                "original_title": "The Secret: Dare to Dream",
                "overview": "A widow with three children hires a handyman to fix her house during a major storm. When not doing home repairs, he shares his philosophy of believing in the power of the universe to deliver what we want.",
                "popularity": 2.612,
                "poster_path": "/5mCqEeBA0MW7H6akFrFQXJu68rU.jpg",
                "release_date": "2020-04-16",
                "title": "The Secret: Dare to Dream",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 634,
                "character": "Missy Wells",
                "credit_id": "5e4862e935811d001946af48",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Sarah Hoffmeister is a talented young actress who recently acquired her first major film role and can be seen starring alongside Katie Holmes in \"The Secret: Dare to Dream,\" based on the best-selling novel of the same name. Hoffmeister plays 'Missy Wells,' the moody teen-aged daughter of 'Miranda Wells' (Holmes). After the passing of their father and husband, the Wells family struggles to see the joy in life; that is, until 'Bray Johnson' (Josh Lucas) enters their lives. 'Missy Wells' transforms from a brooding teenager to an optimistic daughter who helps convince her mother to enter into a relationship with 'Bray' and to see the turning points in their life. Hoffmeister booked the role from a single self-tape, receiving the call that she had landed the job just a few weeks after submission.\n\nGrowing up on the beach in California, Sarah entered elementary school plays as a way to be involved in after school programs. Soon, she realized how much she loved performing and began to do community theater and background jobs to learn the ropes of being on a real film set. From there, her career began to climb as she started doing commercials and short films. Hoffmeister also had a guest-starring role in season two of the hit Fox TV show \"9-1-1\" as 'Jamie Cohen.' As her career continues to grow, Hoffmeister hopes to one day work with Margot Robbie and Emma Stone as she loves their versatility. In the future, Sarah wants to play a vast range of characters including action/sci-fi roles, drama, comedy.\n\nWhen she isn't acting, Sarah is heavily involved in giving back. Through her church youth group, Hoffmeister has helped aid hurricane relief efforts in Houston and will soon be traveling to Puerto Rico to do the same. As an avid surfer, Hoffmeister and her friends volunteer through A Walk on Water (AWOW), an organization that offers surf therapy for children with mental and physical disabilities. Volunteers spend time with the children, teaching them how to surf and bringing them to the calming aspects of the water. As she spends much of her free time in the ocean, Sarah hopes to become more involved in environmental awareness and encouraging others to help keep our environment clean. As a huge animal lover, Hoffmeister has donated to the ASPCA and African Wildlife Foundation, and she hopes to soon become involved with STAR Eco Station, an organization that helps house exotic animals smuggled into LAX.\n\nWith what little free time she has left after acting and volunteering, Sarah enjoys spending time at the beach. As a member of her high school's surf team, she frequently gets up early in the mornings to take to the ocean. Hoffmeister is also very involved in her local church and their youth group, through which she sings and plays the guitar in their band. She also loves to sing and play guitar and piano as hobbies outside of the youth group. Hoffmeister is hopeful that she will have a plentiful acting career ahead, through which she will have the financial means to help give back to the environment and help those who are less fortunate. Sarah believes that we need to see the world bigger than ourselves and that nothing is going to get done if we don't begin by helping each other.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1921279,
        "imdb_id": "nm5109998",
        "known_for_department": "Acting",
        "name": "Sarah Hoffmeister",
        "place_of_birth": "California, USA",
        "popularity": 0.1144,
        "profile_path": "/amXkxbrpJ7IpywEUvcVh5A0mX45.jpg"
    }
}