{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zP6pqpSRRiOCjjC5oWKZKkHqoSB.jpg",
                "genre_ids": [
                    18
                ],
                "id": 595,
                "original_language": "en",
                "original_title": "To Kill a Mockingbird",
                "overview": "Scout Finch, 6, and her older brother Jem live in sleepy Maycomb, Alabama, spending much of their time with their friend Dill and spying on their reclusive and mysterious neighbor, Boo Radley. When Atticus, their widowed father and a respected lawyer, defends a black man named Tom Robinson against fabricated rape charges, the trial and tangent events expose the children to evils of racism and stereotyping.",
                "popularity": 4.5981,
                "poster_path": "/gZycFUMLx2110dzK3nBNai7gfpM.jpg",
                "release_date": "1962-12-20",
                "title": "To Kill a Mockingbird",
                "video": false,
                "vote_average": 7.991,
                "vote_count": 2724,
                "character": "Spence Robinson (uncredited)",
                "credit_id": "55f304a4c3a3686d2700033b",
                "order": 32
            },
            {
                "adult": false,
                "backdrop_path": "/knYZcpl08qhiEPCytyNXOq7Z1oS.jpg",
                "genre_ids": [
                    80,
                    18,
                    9648,
                    53
                ],
                "id": 10633,
                "original_language": "en",
                "original_title": "In the Heat of the Night",
                "overview": "African-American Philadelphia police detective Virgil Tibbs is arrested on suspicion of murder by Bill Gillespie, the racist police chief of tiny Sparta, Mississippi. After Tibbs proves not only his own innocence but that of another man, he joins forces with Gillespie to track down the real killer. Their investigation takes them through every social level of the town, with Tibbs making enemies as well as unlikely friends as he hunts for the truth.",
                "popularity": 4.0963,
                "poster_path": "/1zjS7aSgvOX98BSWEsshDw3kxe5.jpg",
                "release_date": "1967-08-02",
                "title": "In the Heat of the Night",
                "video": false,
                "vote_average": 7.649,
                "vote_count": 1161,
                "character": "Endicott's Butler",
                "credit_id": "56cdf9a592514152ab0002a4",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Gester Hairston",
            "Jasper J. Hairston",
            "Jester J. Hairston"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nJester Joseph Hairston (July 9, 1901 – January 18, 2000) was an American composer, songwriter, arranger, choral conductor, and actor. He was regarded as a leading expert on Negro spirituals and choral music. His notable compositions include \"Amen,\" a gospel-tinged theme from the film Lilies of the Field and a 1963 hit for The Impressions, and the Christmas song \"Mary's Boy Child\".\n\nHe sang with the Hall Johnson Choir in Harlem for a time but was nearly fired from the all black choir because he had difficulty with the rural dialects that were used in some of the songs. He had to shed his Boston accent and relearn the country speech of his parents and grandparents. Johnson had told him, \"We're singing ain't and cain't and you're singing shahn't and cahn't and they don't mix in a spiritual.\" The Hall Johnson Choir performed in many Broadway shows including The Green Pastures. In 1936, they were asked to go to Hollywood to sing for the film The Green Pastures. At that time, a Russian composer, Dimitri Tiomkin, heard Jester and invited him to collaborate with him. This led to a thirty-year collaboration during which time Jester arranged and collected music for the movies. In 1939, Hairston married Margaret Swanigan. He also wrote and arranged spirituals for Hollywood films as well as for high school and college choirs around the country.\n\nHairston wrote the song \"Mary's Boy Child\" in 1956. He also arranged the song \"Amen\", which he dubbed for the Sidney Poitier film Lilies of the Field, and arranged traditional Negro spirituals. Most of Hairston's film work was in the field of composing, arranging, and choral conducting. Hairston also acted in over 20 films, mostly in small roles, some of which were uncredited. Among the films he appeared in were bit parts in some of the early Tarzan movies, St. Louis Blues, The Alamo, To Kill a Mockingbird, In the Heat of the Night, Lady Sings the Blues, I'm Gonna Git You Sucka and Being John Malkovich.\n\nIn 1961, the US State Department appointed Jester Hairston as Goodwill Ambassador. He traveled all over the world teaching and performing the folk music of the slaves. In the 1960s he held choral festivals with public high school choirs, introducing them to Negro Spiritual music, and sometimes leading several hundred students in community performances. His banter about the history of the songs along with his engaging personality and sense of humor endeared him to many students.\n\nHairston appeared on TV's The Amos 'n' Andy Show. He had the role of Leroy on the radio program and as Henry Van Porter on the television program. He also played the role of Wildcat on the show That's My Mama. In his senior years he appeared in the show Amen as Rolly Forbes. His last television appearance was in 1993 on an episode of Family Matters. Hairston also played the role of \"King Moses\" on radio for the Humphrey Bogart and Lauren Bacall show Bold Venture.\n\nHairston died in Los Angeles of natural causes in 2000 at age 98. Born in 1901, Hairston's life spanned each year of the 20th century. For his contribution to the television industry, Hairston has a star on the Hollywood Walk of Fame located at 6201 Hollywood Blvd. He is interred at Inglewood Park Cemetery, Inglewood, California.",
        "birthday": "1901-07-09",
        "deathday": "2000-01-18",
        "gender": 2,
        "homepage": null,
        "id": 192330,
        "imdb_id": "nm0354377",
        "known_for_department": "Acting",
        "name": "Jester Hairston",
        "place_of_birth": "Belews Creek, North Carolina, USA",
        "popularity": 0.3843,
        "profile_path": null
    }
}