{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2tcTm5oRlRN5fKFvY4Gbrwp8h38.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 363088,
                "original_language": "en",
                "original_title": "Ant-Man and the Wasp",
                "overview": "Just when his time under house arrest is about to end, Scott Lang once again puts his freedom at risk to help Hope van Dyne and Dr. Hank Pym dive into the quantum realm and try to accomplish, against time and any chance of success, a very dangerous rescue mission.",
                "popularity": 11.0667,
                "poster_path": "/cFQEO687n1K6umXbInzocxcnAQz.jpg",
                "release_date": "2018-07-04",
                "title": "Ant-Man and the Wasp",
                "video": false,
                "vote_average": 6.913,
                "vote_count": 13746,
                "character": "Tourist (uncredited)",
                "credit_id": "5a0ae447c3a3682128019a78",
                "order": 67
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "William Barbour",
            "Уильям Барбо"
        ],
        "biography": "William W Barbour is a Wilmington, North Carolina based actor with experience on over 200 movie and TV sets. He was a core teacher on the Netflix show 13 Reasons Why and performed on all episodes over the 4 year run. He worked on both Venom 1 and 2, Ant Man and the Wasp, Bumblebee, Sorry to Bother You, Matrix 4, as well as Ballers and Sense8 among many others. Bills most significant roles have been as Mayor Pilgrim in the recently released Maverick Films production Snow Black and as bad guy Drag in the soon to be released SOS. Barbour has experience not only as an actor but also with stunts, precision driver and as a stand in. In back of the camera he has served as an AD, script supervisor, producer and other crew positions. He is a highly decorated Air Force Lt. Col. and pilot with experience in Desert Storm, Iraqi Freedom, Somalia and numerous additional military conflicts. Bill has educational degrees including a Masters in Management as well as Political Science and Psychology degrees. He lettered in football at the University of Colorado, Boulder (CU) at linebacker playing for legendary coach Bill McCartney. William W. Barbour is married to the beautiful Brazilian actress/model Marcella Bragio. The couple have two children and live outside of Wilmington, North Carolina.",
        "birthday": "1961-07-28",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1923573,
        "imdb_id": "nm7722049",
        "known_for_department": "Acting",
        "name": "William W. Barbour",
        "place_of_birth": "Milwaukee, Wisconsin, USA",
        "popularity": 0.8773,
        "profile_path": "/pAqnTFZlnrVEdOzwvXu9jv0gwHZ.jpg"
    }
}