{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kLVWvnUdqQ07WjbAYGpmiD2ZFQa.jpg",
                "genre_ids": [
                    10402,
                    35,
                    10751,
                    14,
                    18
                ],
                "id": 10437,
                "original_language": "en",
                "original_title": "The Muppet Christmas Carol",
                "overview": "A retelling of the classic Dickens tale of Ebenezer Scrooge, miser extraordinaire. He is held accountable for his dastardly ways during night-time visitations by the Ghosts of Christmas Past, Present and Future.",
                "popularity": 3.2047,
                "poster_path": "/ssrV29QSVVJuemBHho0Qx7pFYak.jpg",
                "release_date": "1992-12-11",
                "title": "The Muppet Christmas Carol",
                "video": false,
                "vote_average": 7.42,
                "vote_count": 1071,
                "character": "Rat / Peter Cratchit / Old Joe / Swedish Chef (voice)",
                "credit_id": "5f3a40cba3b5e60034f3b539",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "​From Wikipedia, the free encyclopedia.\n\nDavid Rudman (born June 1st 1964) is a puppeteer, voice actor and producer, best known as a performer of many Sesame Street Muppet characters. He originated the role of Baby Bear, and has been nominated for two Emmy Awards for his work replacing Frank Oz in the role of Cookie Monster. However, Oz still comes in to record new material with Cookie Monster occasionally.\n\nRudman also took over as Richard Hunt's half of \"The Two Headed Monster\" after his death.\n\nHis first production was Rankin/Bass productions such as Rudolph's Shiny New Year.\n\nHe is currently the executive producer of Jack's Big Music Show on cable TV's Nick Jr. channel, and performs the voice of Jack, the lead character. He is also the executive producer, co-creator, and director of Bunnytown on cable TV's Playhouse Disney.\n\nRudman was the speaker at the 2005 graduation ceremony for the Illinois Institute of Art—Chicago. \n\nHe attended Highland Park High School and graduated in 1981. He has been a speaker at the school's biennial Focus on the Arts program since 2003. He attended college at the University of Connecticut in Storrs, CT. He continues to reside in Highland Park with his wife and three children.\n\nHe will also take over two roles once held by Richard Hunt: Scooter and Janice.\n\nDescription above from the Wikipedia article David Rudman, licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": "1964-06-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 192632,
        "imdb_id": "nm0748843",
        "known_for_department": "Acting",
        "name": "David Rudman",
        "place_of_birth": "Chicago, Illinois, USA",
        "popularity": 0.2869,
        "profile_path": "/lHk21OS9k5aeACDSYJFBaJgMrCP.jpg"
    }
}