{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/eWUJTW9HFDmlIACchS6Ohnk5Aom.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 323677,
                "original_language": "en",
                "original_title": "Race",
                "overview": "Based on the story of Jesse Owens, the athlete whose quest to become the greatest track and field athlete in history thrusts him onto the world stage of the 1936 Olympics, where he faces off against Adolf Hitler's vision of Aryan supremacy.",
                "popularity": 3.7794,
                "poster_path": "/3pKLVyz6LGQU8xEDhYHSHsfy5Bg.jpg",
                "release_date": "2016-02-19",
                "title": "Race",
                "video": false,
                "vote_average": 7.251,
                "vote_count": 1575,
                "character": "Beauty Parlor Boss",
                "credit_id": "66b4d83e8acaf4e6136d0227",
                "order": 51
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Lucinda Davis, a rising star, entered the profession in a rather unusual way. In 1998, despite having little acting experience, she made her debut on television in the YTV series Student Bodies. Then, in 1999, she unexpectedly received a call to audition for the lead role in YTV's Radio Active, which she ended up getting. Lucinda has an impressive list of accomplishments, including starring in the television series Seriously Weird, playing a lead role in the dramatic television movie Within These Walls alongside Ellen Burstyn and Laura Dern, and also starring in MTV's series Undressed. Additionally, she has had recurring roles in Naked Josh and Rumours and has appeared in feature films like The Wool Cap and The Secret. Lucinda has also showcased her talents in dance, theatre, and animation, lending her voice to projects such as Winx, Marsupilami, Station X, My Goldfish is Evil, and the video game Prince of Persia: The Two Thrones.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.reisler.ca/reisler-talent-women-Lucinda-Davis.html",
        "id": 192709,
        "imdb_id": "nm0205061",
        "known_for_department": "Acting",
        "name": "Lucinda Davis",
        "place_of_birth": "Montreal, Quebec, Canada",
        "popularity": 0.1639,
        "profile_path": "/kIAkLVJxK7nZTDx1qLjQ3kp4OYd.jpg"
    }
}