{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uxezSInaPoH20CyHx4TuY1LzGly.jpg",
                "genre_ids": [
                    16,
                    35,
                    10751,
                    10770,
                    878,
                    12,
                    28,
                    10402
                ],
                "id": 71689,
                "original_language": "en",
                "original_title": "Phineas and Ferb The Movie: Across the 2nd Dimension",
                "overview": "Phineas and Ferb get trapped in an alternate dimension where the evil Doofenshmirtz rules the tri-state area. They must find a way back home with the help of their pet platypus named Perry, who they discover is a secret agent.",
                "popularity": 4.2913,
                "poster_path": "/updMFSOZwEftfkJRpozwBlRlYI2.jpg",
                "release_date": "2011-08-05",
                "title": "Phineas and Ferb The Movie: Across the 2nd Dimension",
                "video": false,
                "vote_average": 7.095,
                "vote_count": 580,
                "character": "Mr. Johnson (voice)",
                "credit_id": "5eb63d4bcc277c00216af2a6",
                "order": 29
            },
            {
                "adult": false,
                "backdrop_path": "/yBDvgpyynDsbMyK21FoQu1c2wYR.jpg",
                "genre_ids": [
                    9648,
                    80,
                    53
                ],
                "id": 870028,
                "original_language": "en",
                "original_title": "The Accountant²",
                "overview": "When an old acquaintance is murdered, Wolff is compelled to solve the case. Realizing more extreme measures are necessary, Wolff recruits his estranged and highly lethal brother, Brax, to help. In partnership with Marybeth Medina, they uncover a deadly conspiracy, becoming targets of a ruthless network of killers who will stop at nothing to keep their secrets buried.",
                "popularity": 31.566,
                "poster_path": "/lUvfTcOZiK0sdcX0WNLPbMyKjGm.jpg",
                "release_date": "2025-04-23",
                "title": "The Accountant²",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 1359,
                "character": "Tomas' Lawyer",
                "credit_id": "680e5e693c718e8c5537fa17",
                "order": 29
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Todd Stashwick is an American actor and writer. He is known for his roles as Dale Malloy on The Riches (2007–2008) and Theodore Deacon on 12 Monkeys (2015–2018). He played Captain Liam Shaw in the third season of Star Trek: Picard (2023).\n\nStashwick was born in Chicago at the Swedish Covenant Hospital and was raised in the suburbs just outside of the city. As a child, he always loved making people laugh, and he aspired one day to perform at Chicago's famous The Second City. Soon after graduating from Illinois State University with a degree in theatre, he began performing at several local improvisational theatres, and his dream came true when he was hired in 1992 to tour nationally with The Second City. Following productions at The Second City Detroit and The Second City Northwest, he relocated to New York. He auditioned for Saturday Night Live the same year that fellow Second City alumnus David Koechner joined the cast.\n\nWork in film and television drew him to Los Angeles, where he shot several pilots and series, including recurring work on the series MDs, American Dreams, Rodney, and Still Standing. He had a significant supporting role on The Riches, playing Minnie Driver's nefarious cousin, until its cancellation in September 2008.\n\nIn May 2018, it was announced he was cast as Dr. Drakken in the Disney Channel film Kim Possible, based on the animated series. The film premiered on February 15, 2019.\n\nIn September 2020, Stashwick appeared as a guest on Studio 60 on the Sunset Stripmarathon fundraiser episode of The George Lucas Talk Show.\n\nStashwick is also the co-creator, along with DC and Marvel artist Dennis Calero, of the online web comic Devil Inside, which had its launch at the 2010 San Diego Comic-Con. He and Calero met because Dennis had illustrated Todd's character from Heroes into an online comic based on the series. The two decided to collaborate on their own title, which is being self-published once a week in traditional serialised strip form on Stashwick's personal website.\n\nDevil Inside tells \"the story of Jack Springheel. aka The Devil, who has a crisis of conscience. He blasts out of hell and lands in the Nevada desert. He does not want to go back; he wants to quit. But there are forces conspiring to drag him back to hell. If he doesn't use his mojo, he stays off the grid and they can't find him. But he is the Devil after all, and old habits die hard; not using his powers proves more difficult than he thought. A man caught between what he is and what he wants to be. He's trying to stay one step ahead of his adversaries.\"\n\nStashwick and Calero are in development with the Syfy channel with their pilot Clandestine. The two will develop and write the pilot script for the swashbuckling space adventure drama. They will also serve as co-executive producers. John Shiban will serve as script supervisor.\n\nStashwick and Amy Hennig co-wrote a video game set in the Star Wars universe for Electronic Arts and Visceral Games. It was later announced that the project was cancelled.\n\nDescription above from the Wikipedia article Todd Stashwick, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1968-10-16",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 19277,
        "imdb_id": "nm0823693",
        "known_for_department": "Acting",
        "name": "Todd Stashwick",
        "place_of_birth": "Chicago, Illinois, USA",
        "popularity": 0.4153,
        "profile_path": "/seKRXV2HMS36ip4SfQq6PLRiLL2.jpg"
    }
}