{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mgDv2dDihyetAcENxyf2tpXY245.jpg",
                "genre_ids": [
                    10402,
                    18
                ],
                "id": 1407,
                "original_language": "fr",
                "original_title": "La Môme",
                "overview": "From the mean streets of the Belleville district of Paris to the dazzling limelight of New York's most famous concert halls, Edith Piaf's life was a constant battle to sing and survive, to live and love. Raised in her grandmother's brothel, Piaf was discovered in 1935 by nightclub owner Louis Leplee, who persuaded her to sing despite her extreme nervousness. Piaf became one of France's immortal icons, her voice one of the indelible signatures of the 20th century.",
                "popularity": 3.028,
                "poster_path": "/3b9DAONAsFRhJKu25R33PE3VwDh.jpg",
                "release_date": "2007-02-14",
                "title": "La Vie en Rose",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 1667,
                "character": "Boxing ring corner-man",
                "credit_id": "5f08e99c1f98d100371c8869",
                "order": 64
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Robert Paturel is a French Savate boxer and RAID veteran, born in 1952 in Rueil-Malmaison. He won the French Boxing championship six times in France, and became a European champion in 1984.\n\nNicknamed \"Gorille\" (Gorilla), he is famous in France and often appears in newslets and movies teaching martial arts techniques.  Robert Paturel began his professional career as a pastrychef and then as a nightclubdoorman.\n\nHe became a policeman in the French Police Nationale in 1976. He was detached to the Instruction Company in 1980, as an expert in self-defense. He imported the tonfa to France - a Japanese baton - and codified its use in the official program of the French Tonfa-Safety Training (Formation française de tonfa-sécurité, FFTS); with this method being now taught in police academies.\n\nHe joined the élite RAID (Research, Assistance, Intervention, Dissuasion) in 1988, the police's specialintervention unit, where he served for 20 years as an operative, operational instructor and then negotiator. In 2002, he created the concpet of \"Boxe de Rue\" (Street Boxing), which stems from his practice of combat sports and his experience in the field. He also joined the Academy of Combat Arts (Académie des arts de combat, ADAC) of his friend Éric Quequet, as Street Boxing Expert, in charge of training for T.P.A.I, Negotiation, Tonfa and Telescopic baton. Over the past few years, Robert Paturel has acted in several films in which he was often also a technical advisor for themes such as intervention groups, combat and boxing; but also playing minor roles. Those movies include La Vie en rose, starring Marion Cotillard as Edith Piaf, and Taken 2, starring Liam Neeson.\n\nHe has published eight books, including L’esprit du combat and Tonfa sécurité. In 2010, Robert wrote his first novel, Les panthères noires de Bièvre; a work of fiction inspired by his experience with RAID. His autobiographical Mémoires du RAID (Memories of the RAID) was published in 2011. He also wrote the ADAC repository book - Boxe de rue, techniques et étude comportementale. In 2015, Robert published three books. The first being Le RAID à l'épreuve du feu, followed by Boxe de Rue II, sensibilisation et défense contre armes, ADAC's reference book and sequel to the first opus published in 2011. Finally, IMPACT 357 - Préparation physique pour intégrer les différentes forces d'interventions (Police Nationale, Armée, Sapeurs Pompiers), written with Christophe Pourcelot, deals with physical preparation for candidates to the different military and paramilitary special forces in France.\n\nIn 2015, Robert Paturel created the site Adrenalib.com, through which he offered the first online street boxing courses, in order to democratize the learning of self-defense among the civilian population. He also contributes occasionally to the Présentnewspaper.\n\nIn October 2016, he was called to become the spokesperson for the movement of non-unionized police officers during police demonstrations following the Molotov cocktail attack on four officers on 8 October 2016 in Viry-Châtillon. In the same year, Robert participated in the comedy movie Raid Dingue as a self-defense instructor to the protagonist, officer Johanna Pasquali (Alice Pol).\n\nSource: Article \"Robert Paturel\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1952-08-02",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1927467,
        "imdb_id": "nm2590161",
        "known_for_department": "Acting",
        "name": "Robert Paturel",
        "place_of_birth": "Rueil-Malmaison, Seine-et-Oise [now Hauts-de-Seine], France",
        "popularity": 0.0261,
        "profile_path": "/iSnC6aMhnKN96gp60R6gIMEJ9iM.jpg"
    }
}