{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jXZ2tyJl44yKvh22I6ooQwU5rFM.jpg",
                "genre_ids": [
                    35,
                    10749,
                    18
                ],
                "id": 164,
                "original_language": "en",
                "original_title": "Breakfast at Tiffany's",
                "overview": "Holly Golightly is an eccentric New York City playgirl determined to marry a Brazilian millionaire. But when young writer Paul Varjak moves into her apartment building, her past threatens to get in their way.",
                "popularity": 5.401,
                "poster_path": "/79xm4gXw4l7A5D0XukUOJRocFYQ.jpg",
                "release_date": "1961-10-06",
                "title": "Breakfast at Tiffany's",
                "video": false,
                "vote_average": 7.64,
                "vote_count": 4328,
                "character": "Holly Golightly",
                "credit_id": "52fe4221c3a36847f8006399",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/6f50k0bAekjxDvVvGC1SupJSzf4.jpg",
                "genre_ids": [
                    10749,
                    35,
                    18
                ],
                "id": 804,
                "original_language": "en",
                "original_title": "Roman Holiday",
                "overview": "Overwhelmed by her suffocating schedule, touring European princess Ann takes off for a night while in Rome. When a sedative she took from her doctor kicks in, however, she falls asleep on a park bench and is found by an American reporter, Joe Bradley, who takes her back to his apartment for safety. At work the next morning, Joe finds out Ann's regal identity and bets his editor he can get exclusive interview with her, but romance soon gets in the way.",
                "popularity": 5.7726,
                "poster_path": "/8lI9dmz1RH20FAqltkGelY1v4BE.jpg",
                "release_date": "1953-08-26",
                "title": "Roman Holiday",
                "video": false,
                "vote_average": 7.885,
                "vote_count": 2150,
                "character": "Princess Ann",
                "credit_id": "52fe4278c3a36847f8021503",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/jXPrGgk6PypAsv8IPq8NqlQi6ts.jpg",
                "genre_ids": [
                    35,
                    80,
                    10749
                ],
                "id": 3001,
                "original_language": "en",
                "original_title": "How to Steal a Million",
                "overview": "A woman must steal a statue from a Paris museum to help conceal her father's art forgeries.",
                "popularity": 5.5291,
                "poster_path": "/xaf3pwmITJvfz9Ab8DiGM8OOtBC.jpg",
                "release_date": "1966-07-13",
                "title": "How to Steal a Million",
                "video": false,
                "vote_average": 7.489,
                "vote_count": 623,
                "character": "Nicole Bonnet",
                "credit_id": "52fe437bc3a36847f80575a1",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/gj2TBYmOIy4E2GjMIpnbAEZNCQx.jpg",
                "genre_ids": [
                    35,
                    9648,
                    10749
                ],
                "id": 4808,
                "original_language": "en",
                "original_title": "Charade",
                "overview": "After Regina Lampert falls for the dashing Peter Joshua on a skiing holiday in the French Alps, she discovers upon her return to Paris that her husband has been murdered. Soon, she and Peter are giving chase to three of her late husband's World War II cronies, Tex, Scobie and Gideon, who are after a quarter of a million dollars the quartet stole while behind enemy lines.",
                "popularity": 3.3743,
                "poster_path": "/qqaPjC5FQidtKY65jbAKZPiOTaS.jpg",
                "release_date": "1963-12-01",
                "title": "Charade",
                "video": false,
                "vote_average": 7.669,
                "vote_count": 1452,
                "character": "Regina Lampert",
                "credit_id": "52fe43dbc3a36847f80745cd",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/3PYjmY1OiOq2LQ8ZvvLxzwbqIq.jpg",
                "genre_ids": [
                    53,
                    27
                ],
                "id": 11206,
                "original_language": "en",
                "original_title": "Wait Until Dark",
                "overview": "After a flight back home, Sam Hendrix returns with a doll he innocently acquired along the way. As it turns out, the doll is actually stuffed with heroin, and a group of criminals led by the ruthless Roat has followed Hendrix back to his place to retrieve it. When Hendrix leaves for business, the crooks make their move -- and find his blind wife, Susy, alone in the apartment. Soon, a life-threatening game begins between Susy and the thugs.",
                "popularity": 3.429,
                "poster_path": "/cNW3ewCB52KkxzSE47PcE5Bqvmr.jpg",
                "release_date": "1967-10-26",
                "title": "Wait Until Dark",
                "video": false,
                "vote_average": 7.351,
                "vote_count": 562,
                "character": "Susy Hendrix",
                "credit_id": "52fe44109251416c75027a65",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/xMoQjqa3JUc2unO4nF9PmM1JTQu.jpg",
                "genre_ids": [
                    10402,
                    35,
                    10749
                ],
                "id": 11113,
                "original_language": "en",
                "original_title": "My Fair Lady",
                "overview": "A snobbish phonetics professor agrees to a wager that he can take a flower girl and make her presentable in high society.",
                "popularity": 4.1451,
                "poster_path": "/bTXVc29lGSNclf94VIZ49W4gGKl.jpg",
                "release_date": "1964-12-01",
                "title": "My Fair Lady",
                "video": false,
                "vote_average": 7.499,
                "vote_count": 1368,
                "character": "Eliza Doolittle",
                "credit_id": "52fe43fb9251416c75024eab",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/ftNimlo6fP4WKRMWnF1ghX4fPUy.jpg",
                "genre_ids": [
                    35,
                    10749,
                    18
                ],
                "id": 6620,
                "original_language": "en",
                "original_title": "Sabrina",
                "overview": "Linus and David Larrabee are the two sons of a very wealthy family. Linus is all work – busily running the family corporate empire, he has no time for a wife and family. David is all play – technically he is employed by the family business, but never shows up for work, spends all his time entertaining, and has been married and divorced three times. Meanwhile, Sabrina Fairchild is the young, shy, and awkward daughter of the household chauffeur, who goes away to Paris for two years, and returns to capture David's attention, while falling in love with Linus.",
                "popularity": 4.2015,
                "poster_path": "/86ix9wBxiMAaISt4HpmXQm6Mlym.jpg",
                "release_date": "1954-09-01",
                "title": "Sabrina",
                "video": false,
                "vote_average": 7.505,
                "vote_count": 1294,
                "character": "Sabrina Fairchild",
                "credit_id": "52fe445fc3a36847f8091fcd",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/9VJh0YPms8QM8GYDvt5wtmRsCU5.jpg",
                "genre_ids": [
                    10402,
                    35,
                    10749
                ],
                "id": 13320,
                "original_language": "en",
                "original_title": "Funny Face",
                "overview": "A shy Greenwich Village book clerk is discovered by a fashion photographer and whisked off to Paris where she becomes a reluctant model.",
                "popularity": 2.3155,
                "poster_path": "/tzTjalpIz6NyFrWPPlOBFoBjb7z.jpg",
                "release_date": "1957-02-13",
                "title": "Funny Face",
                "video": false,
                "vote_average": 6.975,
                "vote_count": 708,
                "character": "Jo Stockton",
                "credit_id": "52fe455b9251416c75053aa3",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Одри Кэтлин Растон",
            "Audrey Kathleen Ruston",
            "Одри Хепберн",
            "Одрі Хепберн",
            "오드리 헵번",
            "奥黛丽·赫本",
            "奧黛麗·赫本",
            "آدری هپبورن"
        ],
        "biography": "Audrey Hepburn (born Audrey Kathleen Ruston) was an actress and humanitarian. Recognised as both a film and fashion icon, she was ranked by the American Film Institute as the third-greatest female screen legend from the Classical Hollywood cinema and was inducted into the International Best Dressed List Hall of Fame.\n\nBorn in Ixelles, Brussels, to an aristocratic family, Hepburn spent parts of her childhood in Belgium, England, and the Netherlands. She studied ballet with Sonia Gaskell in Amsterdam beginning in 1945, and with Marie Rambert in London from 1948. She began performing as a chorus girl in West End musical theatre productions and then had minor appearances in several films. She rose to stardom in the romantic comedy Roman Holiday (1953) alongside Gregory Peck, for which she was the first actress to win an Oscar, a Golden Globe Award, and a BAFTA Award for a single performance. That year, she also won a Tony Award for Best Lead Actress in a Play for her performance in Ondine.\n\nShe went on to star in a number of successful films such as Sabrina (1954), in which Humphrey Bogart and William Holden compete for her affection; Funny Face (1957), a musical where she sang her own parts; the drama The Nun's Story (1959); the romantic comedy Breakfast at Tiffany's (1961); the thriller-romance Charade (1963), opposite Cary Grant; and the musical My Fair Lady (1964). In 1967 she starred in the thriller Wait Until Dark, receiving Academy Award, Golden Globe, and BAFTA nominations. After that, she only occasionally appeared in films, one being Robin and Marian (1976) with Sean Connery. Her last recorded performances were in the 1990 documentary television series Gardens of the World with Audrey Hepburn for which she won a Primetime Emmy Award for Outstanding Individual Achievement – Informational Programming.\n\nHepburn won three BAFTA Awards for Best British Actress in a Leading Role. In recognition of her film career, she received BAFTA's Lifetime Achievement Award, the Golden Globe Cecil B. DeMille Award, the Screen Actors Guild Life Achievement Award, and the Special Tony Award. She remains one of only seventeen people who have won Academy, Emmy, Grammy, and Tony Awards. Later in life, Hepburn devoted much of her time to UNICEF, to which she had contributed since 1954. Between 1988 and 1992, she worked in some of the poorest communities of Africa, South America, and Asia. In December 1992, she received the US Presidential Medal of Freedom in recognition of her work as a UNICEF Goodwill Ambassador. A month later, she died of appendiceal cancer at her home in Tolochenaz, Vaud, Switzerland, at the age of 63.",
        "birthday": "1929-05-04",
        "deathday": "1993-01-20",
        "gender": 1,
        "homepage": null,
        "id": 1932,
        "imdb_id": "nm0000030",
        "known_for_department": "Acting",
        "name": "Audrey Hepburn",
        "place_of_birth": "Ixelles, Belgium",
        "popularity": 0.944,
        "profile_path": "/wg3RRHA5jV755dV0ksQ9g0Nc2xE.jpg"
    }
}