{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sGKUhw88FMH5gfz0E6BK2YOZ5se.jpg",
                "genre_ids": [
                    36,
                    18
                ],
                "id": 82695,
                "original_language": "en",
                "original_title": "Les Misérables",
                "overview": "An adaptation of the successful stage musical based on Victor Hugo's classic novel set in 19th-century France. Jean Valjean, a man imprisoned for stealing bread, must flee a relentless policeman named Javert. The pursuit consumes both men's lives, and soon Valjean finds himself in the midst of the student revolutions in France.",
                "popularity": 6.8937,
                "poster_path": "/6CuzBs2Lb8At7qQr64mLXg2RYRb.jpg",
                "release_date": "2012-12-18",
                "title": "Les Misérables",
                "video": false,
                "vote_average": 7.315,
                "vote_count": 5417,
                "character": "Magistrate",
                "credit_id": "52fe486c9251416c9108c161",
                "order": 33
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "David Cahn"
        ],
        "biography": "David Cann is an actor with a diverse and successful career in both theatre and television. After training at RADA he served his apprenticeship in the repertory system, appearing at many of Britain's grand old theatres in a wide range of roles. In plays ancient and modern, Shakespearean drama, musicals and pantomime, David developed into a leading man and character actor with a strong vocal technique and a firm grasp of many artistic styles; from the extreme naturalism of Lawrence's 'A Collier's Friday Night' through the high comedy of Sheridan's 'A School for Scandal' to the classical verse (not to mention the athletic sword-fighting) in 'Romeo and Juliet'.\n\nMoving into television David appeared in many shows including 'Sapphire and Steel' and 'Grange Hill'. In between these, he worked in small fringe theatres, such as the Gate in Notting Hill and the Croydon Warehouse, where such heart-warming pieces as Barrie Keeffe's 'My Girl' showed his subtlety in the more intimate space of studio theatre.\n\nIn the mid-90’s David auditioned for a small part in a new type of comedy pioneered by Chris Morris. The resulting series, 'Brass Eye', was hailed as a major breakthrough in TV style; satirising TV itself. Morris subsequently asked David to join a small team to develop the award-winning BBC radio series 'Blue Jam' and, in 1999, some of this material was filmed for television as 'Jam'. It is for his work in this surreal and iconic series that David is best known.\n\nOver many years David has developed a strong reputation working with new and emerging talent, helping writers to develop their scripts through workshops and rehearsed readings. This led to David working with young director Tamara Harvey who later asked David to take the leading role in Laura Wade's charming play about the Welsh poet WH Davies in the highly-praised production of 'Young Emma' at the Finborough Theatre in London in 2003.\n\nFor the BBC David became part of a notable storyline as Dot Cotton's cancer specialist in 'EastEnders' and again as Doctor Casper in the disturbing, futuristic drama-documentary 'If...we could stop the violence\n\nDavid’s film work includes appearances in 'Run, Fat Boy, Run', 'Attack The Block', 'The Iron Lady', 'Greed' and 'Rebecca'. On television David has appeared in 'Spooks' and 'Psychoville', 'Silent Witness' and 'The Javon Prince Show', but more recently 'Sex Education', 'It’s Kevin', 'Sally4Ever', 'Sick Note', 'Killing Eve' and 'The Baby'.",
        "birthday": "1956-11-12",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.davidcann.co.uk",
        "id": 193340,
        "imdb_id": "nm0134025",
        "known_for_department": "Acting",
        "name": "David Cann",
        "place_of_birth": "Westminster, London, England, UK",
        "popularity": 0.556,
        "profile_path": "/flss2pUh1RzwGEPTjLaaDoiGe6a.jpg"
    }
}