{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jXZ2tyJl44yKvh22I6ooQwU5rFM.jpg",
                "genre_ids": [
                    35,
                    10749,
                    18
                ],
                "id": 164,
                "original_language": "en",
                "original_title": "Breakfast at Tiffany's",
                "overview": "Holly Golightly is an eccentric New York City playgirl determined to marry a Brazilian millionaire. But when young writer Paul Varjak moves into her apartment building, her past threatens to get in their way.",
                "popularity": 5.401,
                "poster_path": "/79xm4gXw4l7A5D0XukUOJRocFYQ.jpg",
                "release_date": "1961-10-06",
                "title": "Breakfast at Tiffany's",
                "video": false,
                "vote_average": 7.64,
                "vote_count": 4328,
                "character": "Doc Golightly",
                "credit_id": "52fe4221c3a36847f80063a5",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/nRsr98MFztBGm532hCVMGXV6qOp.jpg",
                "genre_ids": [
                    12,
                    14,
                    10751
                ],
                "id": 630,
                "original_language": "en",
                "original_title": "The Wizard of Oz",
                "overview": "Young Dorothy finds herself in a magical world where she makes friends with a lion, a scarecrow and a tin man as they make their way along the yellow brick road to talk with the Wizard and ask for the things they miss most in their lives. The Wicked Witch of the West is the only thing that could stop them.",
                "popularity": 7.919,
                "poster_path": "/pfAZFD7I2hxW9HCChTuAzsdE6UX.jpg",
                "release_date": "1939-08-15",
                "title": "The Wizard of Oz",
                "video": false,
                "vote_average": 7.591,
                "vote_count": 5830,
                "character": "Tin Man (singing voice) (uncredited)",
                "credit_id": "65d3b3a1498bc2017a70be1c",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Christian Ludolf  Ebsen, Jr. "
        ],
        "biography": "Christian Ludolf \"Buddy\" Ebsen Jr. was an American actor and dancer, whose career spanned seven decades, including the role of Jed Clampett in the CBS television sitcom The Beverly Hillbillies (1962–1971) and the title character in the television detective drama Barnaby Jones (1973–1980), also on CBS. The SAG-AFTRA records also show him as Frank \"Buddy\" Ebsen.\n\nA performer for seven decades, he had starring roles as Jed Clampett in the long-running television series \"The Beverly Hillbillies\" and as the title character in the 1970s detective series \"Barnaby Jones\".\n\nEbsen was cast as the original Tin Man in 1939 film \"The Wizard of Oz\", but fell ill, reacting to the aluminum dust in his makeup, and was forced to drop out of the film.\n\nEbsen made his television debut on an episode of The Chevrolet Tele-Theatre in 1949. This led to television appearances in: Stars Over Hollywood, Gruen Guild Playhouse, four episodes of Broadway Television Theatre, Schlitz Playhouse of Stars, Corky and White Shadow, the H.J. Heinz Company's Studio 57, Screen Directors Playhouse, two episodes of Climax!, Tales of Wells Fargo, The Martha Raye Show, Playhouse 90, Westinghouse Desilu Playhouse, Johnny Ringo, two episodes of Bonanza, three episodes of Maverick (in which he portrayed assorted homicidal villains), and 77 Sunset Strip. Ebsen received wide television exposure when he played Georgie Russel, a role based on a historical person and companion to frontiersman Davy Crockett, in the Disneyland television miniseries Davy Crockett (1954–1955).\n\nIn the 1958–1959 season, Ebsen co-starred in the 26-episode half-hour NBC television adventure series Northwest Passage. This series was a fictionalized account of Major Robert Rogers, a colonial American fighter for the British in the French and Indian War. Ebsen played the role of Sergeant Hunk Marriner; Keith Larsen played Rogers.\n\nIn 1960, Ebsen appeared in episodes of the television series Rawhide, in the episodes \"The Pitchwagon\" and Tales of Wells Fargo, which he reprised in episodes of both series during 1962 in the roles of different characters. Also in 1960, Ebsen played in season 4 episode 30 of Have Gun, Will Travel called \"El Paso Stage\", as a corrupt marshal.\n\nFrom 1961 to 1962, Ebsen had a recurring role as Virge Blessing in the ABC drama series Bus Stop, the story of travelers passing through the bus station and diner in the fictitious town of Sunrise, Colorado. Robert Altman directed several episodes. Arthur O'Connell had played Virge Blessing in the earlier film version on which the series was loosely based. Ebsen also appeared as \"Mr. Dave\" Browne, a homeless hobo, on The Andy Griffith Show opposite Ron Howard, and as Jimbo Cobb in The Twilight Zone episode \"The Prime Mover\" (season 2, episode 21) in 1961.",
        "birthday": "1908-04-02",
        "deathday": "2003-07-06",
        "gender": 2,
        "homepage": null,
        "id": 1935,
        "imdb_id": "nm0001171",
        "known_for_department": "Acting",
        "name": "Buddy Ebsen",
        "place_of_birth": "Belleville, Illinois, USA",
        "popularity": 0.3993,
        "profile_path": "/iY3zvIzWDhsrcYoL6jjGONp4Wjv.jpg"
    }
}