{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uDDgaNppSCJm6kWDLl7vMeu8xcl.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 1440,
                "original_language": "en",
                "original_title": "Little Children",
                "overview": "The lives of two lovelorn spouses from separate marriages, a registered sex offender, and a disgraced ex-police officer intersect as they struggle to resist their vulnerabilities and temptations.",
                "popularity": 10.826,
                "poster_path": "/l2wTSP0Ifo9vY03nJEfkFBbT2S9.jpg",
                "release_date": "2006-10-06",
                "title": "Little Children",
                "video": false,
                "vote_average": 7.076,
                "vote_count": 1071,
                "character": "Sunbathing Model (uncredited)",
                "credit_id": "61ba10930443c90060ffd2ed",
                "order": 81
            },
            {
                "adult": false,
                "backdrop_path": "/qKWQ9IEDkMawD7sgKnIGCdFAhct.jpg",
                "genre_ids": [
                    53,
                    28,
                    18,
                    10752
                ],
                "id": 8963,
                "original_language": "en",
                "original_title": "Crimson Tide",
                "overview": "After the Cold War, a breakaway Russian republic with nuclear warheads becomes a possible worldwide threat. U.S. submarine Capt. Frank Ramsey signs on a relatively green but highly recommended Lt. Cmdr. Ron Hunter to the USS Alabama, which may be the only ship able to stop a possible Armageddon. When Ramsey insists that the Alabama must act aggressively, Hunter, fearing they will start rather than stop a disaster, leads a potential mutiny to stop him.",
                "popularity": 4.8617,
                "poster_path": "/21nqRJ6ofEgVvEl68J4O9V26Xzy.jpg",
                "release_date": "1995-05-12",
                "title": "Crimson Tide",
                "video": false,
                "vote_average": 7.181,
                "vote_count": 1871,
                "character": "Board of Inquiry Member (uncredited)",
                "credit_id": "6370d56aca4f67007ad9e4fb",
                "order": 55
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Upon high school graduation Marianne Hettinger, a native of Augsburg, Germany, came alone to New York, not knowing anyone and with only $800 in her pocket. With scholarships in acting, directing and dance at the National Shakespeare Conservatory, Alvin Ailey, Steps on Broadway, she worked her way up to becoming an award winning filmmaker, actor and professional Ballroom Dance Champion, appearing on Broadway,in  film and television and as a guest star with symphony orchestras across the US and Canada.\n\nAs an award winning filmmaker, Ms. Hettinger has written, directed and produced two feature films, “Mango Tango” and “Prince Harming” (currently in post-production), the short films “Saint Vitus Dance”,  “Strad For Lunch” and “Homeless in Washington” and developed her own TV talk show format, “Hallo New York” (13 episodes) where she interviews fascinating New Yorkers.\n\nMs. Hettinger has acted in over 20 films including Tim Robbins’ “The Cradle will Rock”, the CBS’ daytime series “As The World Turns”, and wrote and performed her one-person-show “Heaven & Earth”. Ms Hettinger performed a duet with Antonio Banderas on The Late Show with David Letterman and was personally invited by David Letterman to come back several times.\n\nMs. Hettinger has been teaching the only comprehensive ballroom dance program in a health club in the USA, the New York Health & Racquet Club, since 2005. Furthermore, she has taught at American Ballet Theatre, Dance Theatre of Harlem, Alvin Ailey and Steps on Broadway and privately coached celebrities including Antonio Bandera, with whom she danced a duet on the Late Show with David Letterman, Idina Menzel, Michael E. Knight and Ann Hampton Callaway and the cast of WPIX 11 among others.\n\nMs. Hettinger has dual citizenship, resides in NYC and is grateful to be in a country where everything feels possible.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.mariannehettinger.com",
        "id": 1935052,
        "imdb_id": "nm0381783",
        "known_for_department": "Acting",
        "name": "Marianne Hettinger",
        "place_of_birth": "Augsburg, Bavaria, Germany",
        "popularity": 0.0671,
        "profile_path": "/8xj6TZmglKdtyYOuFKDeHUYnVFp.jpg"
    }
}