{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jXZ2tyJl44yKvh22I6ooQwU5rFM.jpg",
                "genre_ids": [
                    35,
                    10749,
                    18
                ],
                "id": 164,
                "original_language": "en",
                "original_title": "Breakfast at Tiffany's",
                "overview": "Holly Golightly is an eccentric New York City playgirl determined to marry a Brazilian millionaire. But when young writer Paul Varjak moves into her apartment building, her past threatens to get in their way.",
                "popularity": 5.3197,
                "poster_path": "/79xm4gXw4l7A5D0XukUOJRocFYQ.jpg",
                "release_date": "1961-10-06",
                "title": "Breakfast at Tiffany's",
                "video": false,
                "vote_average": 7.64,
                "vote_count": 4328,
                "character": "Mr. Yunioshi",
                "credit_id": "52fe4221c3a36847f80063ad",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/lNmIAX1IuPIEPMHhLBEm4wmhYX0.jpg",
                "genre_ids": [
                    12,
                    16,
                    18,
                    10751
                ],
                "id": 10948,
                "original_language": "en",
                "original_title": "The Fox and the Hound",
                "overview": "When a feisty little fox named Tod is adopted into a farm family, he quickly becomes friends with a fun and adorable hound puppy named Copper. Life is full of hilarious adventures until Copper is expected to take on his role as a hunting dog -- and the object of his search is his best friend!",
                "popularity": 6.665,
                "poster_path": "/aC3k6XBaYnulGSkK8263ABjU3Md.jpg",
                "release_date": "1981-07-10",
                "title": "The Fox and the Hound",
                "video": false,
                "vote_average": 7.14,
                "vote_count": 3354,
                "character": "Tod (voice)",
                "credit_id": "52fe43d79251416c7502031f",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/wSiBXaJ2PtlxUGH2waIxQZjFPhg.jpg",
                "genre_ids": [
                    28,
                    12,
                    35,
                    80
                ],
                "id": 11576,
                "original_language": "en",
                "original_title": "It's a Mad, Mad, Mad, Mad World",
                "overview": "A group of strangers come across a man dying after a car crash who proceeds to tell them about the $350,000 he buried in California. What follows is the madcap adventures of those strangers as each attempts to claim the prize for himself.",
                "popularity": 8.0596,
                "poster_path": "/j4mWzOisSHFkaqIkq34l2mm8a5K.jpg",
                "release_date": "1963-11-07",
                "title": "It's a Mad, Mad, Mad, Mad World",
                "video": false,
                "vote_average": 6.97,
                "vote_count": 637,
                "character": "Ding 'Dingy' Bell",
                "credit_id": "52fe445f9251416c7503265b",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Joseph Yule Jr.",
            "Joe Yule Jr.",
            "Mickey Yule",
            "Mickey McGuire",
            "Michael McGuire",
            "Michael Rooney",
            "میکی رونی"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nMickey Rooney (born Joseph Yule Jr.; September 23, 1920 – April 6, 2014) was an American actor, vaudevillian, comedian, producer, and radio personality. In a career spanning nine decades and continuing until shortly before his death, he appeared in more than 300 films and was among the last surviving stars of the silent film era.\n\nAt the height of a career that was marked by declines and comebacks, Rooney performed the role of Andy Hardy in a series of 16 films in the 1930s and 1940s that epitomized American family values. A versatile performer, he became a celebrated character actor later in his career. Laurence Olivier once said he considered Rooney \"the best there has ever been\". Clarence Brown, who directed him in two of his earliest dramatic roles, National Velvet and The Human Comedy, said he was \"the closest thing to a genius I ever worked with\".\n\nRooney first performed in vaudeville as a child and made his film debut at the age of six. At 14, he played Puck in the play and later the 1935 film adaptation of A Midsummer Night's Dream. Critic David Thomson hailed his performance as \"one of the cinema's most arresting pieces of magic\". In 1938, he co-starred in Boys Town. At 19, he was the first teenager to be nominated for an Oscar for his leading role in Babes in Arms, and he was awarded a special Academy Juvenile Award in 1939. At the peak of his career between the ages of 15 and 25, he made 43 films, which made him one of Metro-Goldwyn-Mayer's most consistently successful actors and a favorite of MGM studio head Louis B. Mayer.\n\nRooney was the top box-office attraction from 1939 to 1941 and one of the best-paid actors of that era, but his career would never again rise to such heights. Drafted into the Army during World War II, he served nearly two years entertaining over two million troops on stage and radio and was awarded a Bronze Star for performing in combat zones. Returning from the war in 1945, he was too old for juvenile roles but too short to be an adult movie star, and was unable to get as many starring roles. Nevertheless, Rooney's popularity was renewed with well-received supporting roles in films such as Breakfast at Tiffany's (1961), Requiem for a Heavyweight (1962), It's a Mad, Mad, Mad, Mad World (1963), and The Black Stallion (1979). In the early 1980s, he returned to Broadway in Sugar Babies and again became a celebrated star. Rooney made hundreds of appearances on TV, including dramas, variety programs, and talk shows, and won an Emmy in 1982 plus a Golden Globe for his role in Bill (1981).",
        "birthday": "1920-09-23",
        "deathday": "2014-04-06",
        "gender": 2,
        "homepage": "https://www.mickeyrooney.com/",
        "id": 1937,
        "imdb_id": "nm0001682",
        "known_for_department": "Acting",
        "name": "Mickey Rooney",
        "place_of_birth": "Brooklyn, New York City, New York, USA",
        "popularity": 0.6168,
        "profile_path": "/eYuayEC3xhXQf3Z1Cy6AVMEcgZb.jpg"
    }
}