{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uov0QRXGEaIsVGis2ttJ1ax32Kc.jpg",
                "genre_ids": [
                    18,
                    10749,
                    14
                ],
                "id": 4688,
                "original_language": "en",
                "original_title": "Across the Universe",
                "overview": "When young dockworker Jude leaves Liverpool to find his estranged father in the United States, he is swept up by the waves of change that are re-shaping the nation. Jude falls in love with Lucy, who joins the growing anti-war movement. As the body count in Vietnam rises, political tensions at home spiral out of control and the star-crossed lovers find themselves in a psychedelic world gone mad.",
                "popularity": 2.9266,
                "poster_path": "/447c8Te3DXC46rQvDEixKGO4dS6.jpg",
                "release_date": "2007-09-14",
                "title": "Across the Universe",
                "video": false,
                "vote_average": 7.139,
                "vote_count": 1387,
                "character": "Protestor (uncredited)",
                "credit_id": "65f52754eb14fa0163b9ac53",
                "order": 51
            },
            {
                "adult": false,
                "backdrop_path": "/7Nwnmyzrtd0FkcRyPqmdzTPppQa.jpg",
                "genre_ids": [
                    80,
                    18,
                    35
                ],
                "id": 106646,
                "original_language": "en",
                "original_title": "The Wolf of Wall Street",
                "overview": "A New York stockbroker refuses to cooperate in a large securities fraud case involving corruption on Wall Street, corporate banking world and mob infiltration. Based on Jordan Belfort's autobiography.",
                "popularity": 27.2678,
                "poster_path": "/kW9LmvYHAaS9iA0tHmZVq8hQYoq.jpg",
                "release_date": "2013-12-25",
                "title": "The Wolf of Wall Street",
                "video": false,
                "vote_average": 8.028,
                "vote_count": 24976,
                "character": "Waiter (uncredited)",
                "credit_id": "65f5271fe039f1017d03262d",
                "order": 177
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Geoffrey Payne"
        ],
        "biography": "Geoffrey JD Payne was born in Warwick, New York and later raised in the artistic seaside community of Rockport, Massachusetts. At the age of 16, Payne attended a workshop in upstate NY to begin his training. There, he was scouted and went on to a mentorship for 3 years in musical theater.\n\nAt age 19, Payne was encouraged to branch out into New York City. After receiving a scholarship, he attended the Weist Barron School for TV & Film. In 2006, Payne began his immersive training at the prestigious Stella Adler Studio of Acting. Upon graduation in 2008, Geoffrey appeared in several Off-Broadway and Off-Off Broadway theater productions. Some credits include; \"Choose Your Grown Adventure\", \"This is Our Youth,\" \"Books On Tape,\" and \"Humans Anonymous\". At that time, Geoffrey co-founded The Altruistic Theater Company.\n\nSince 2016, Payne acted in a short film written by the Oscar winning writer Nicolas Giacobone and director Miguel J. Soliman entitled \"Desde El Principio\" (\"Birdman or The unexpected Virtue of Ignorance\" & \"The Revenant\"). Other short film credits include \"The Quiet\" and \"Boys & Toys\".\n\nGeoffrey's focusing his efforts on his current work entitled \"Headway\".",
        "birthday": "1982-12-05",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1939999,
        "imdb_id": "nm3283969",
        "known_for_department": "Acting",
        "name": "Geoffrey J.D. Payne",
        "place_of_birth": "Warwick, New York, USA",
        "popularity": 0.091,
        "profile_path": "/xCthpMojMZmFm2vx6tK9c82dee5.jpg"
    }
}