{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/u2bZhH3nTf0So0UIC1QxAqBvC07.jpg",
                "genre_ids": [
                    16,
                    10751,
                    12,
                    14
                ],
                "id": 109445,
                "original_language": "en",
                "original_title": "Frozen",
                "overview": "Young princess Anna of Arendelle dreams about finding true love at her sister Elsa’s coronation. Fate takes her on a dangerous journey in an attempt to end the eternal winter that has fallen over the kingdom. She's accompanied by ice delivery man Kristoff, his reindeer Sven, and snowman Olaf. On an adventure where she will find out what friendship, courage, family, and true love really means.",
                "popularity": 23.9417,
                "poster_path": "/itAKcobTYGpYT8Phwjd8c9hleTo.jpg",
                "release_date": "2013-11-20",
                "title": "Frozen",
                "video": false,
                "vote_average": 7.248,
                "vote_count": 17073,
                "character": "Elsa (voice)",
                "credit_id": "52fe4ab7c3a36847f81dddd3",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/qDQEQbgP3v7B9IYLAUcYexNrVYP.jpg",
                "genre_ids": [
                    10751,
                    16,
                    35,
                    12
                ],
                "id": 404368,
                "original_language": "en",
                "original_title": "Ralph Breaks the Internet",
                "overview": "Video game bad guy Ralph and fellow misfit Vanellope von Schweetz must risk it all by traveling to the World Wide Web in search of a replacement part to save Vanellope's video game, Sugar Rush. In way over their heads, Ralph and Vanellope rely on the citizens of the internet — the netizens — to help navigate their way, including an entrepreneur named Yesss, who is the head algorithm and the heart and soul of trend-making site BuzzzTube.",
                "popularity": 7.0486,
                "poster_path": "/iVCrhBcpDaHGvv7CLYbK6PuXZo1.jpg",
                "release_date": "2018-11-20",
                "title": "Ralph Breaks the Internet",
                "video": false,
                "vote_average": 7.168,
                "vote_count": 7833,
                "character": "Elsa (voice)",
                "credit_id": "596a84aa92514136a4017127",
                "order": 14
            },
            {
                "adult": false,
                "backdrop_path": "/eGljNfNCrPhFYG2RXXmmE0OKu5.jpg",
                "genre_ids": [
                    18,
                    53,
                    80
                ],
                "id": 473033,
                "original_language": "en",
                "original_title": "Uncut Gems",
                "overview": "A charismatic New York City jeweler always on the lookout for the next big score makes a series of high-stakes bets that could lead to the windfall of a lifetime. Howard must perform a precarious high-wire act, balancing business, family, and encroaching adversaries on all sides in his relentless pursuit of the ultimate win.",
                "popularity": 5.189,
                "poster_path": "/sg0xxJeb3u1C4kAxhSuTwTNpEDt.jpg",
                "release_date": "2019-08-30",
                "title": "Uncut Gems",
                "video": false,
                "vote_average": 7.16,
                "vote_count": 5028,
                "character": "Dinah Ratner",
                "credit_id": "5b9cbb50925141023c00919b",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/AoSZyb37ljMAxw0RdeQEBHKtgcc.jpg",
                "genre_ids": [
                    10751,
                    16,
                    12,
                    35,
                    14
                ],
                "id": 330457,
                "original_language": "en",
                "original_title": "Frozen II",
                "overview": "Elsa, Anna, Kristoff and Olaf head far into the forest to learn the truth about an ancient mystery of their kingdom.",
                "popularity": 10.9711,
                "poster_path": "/mINJaa34MtknCYl5AjtNJzWj8cD.jpg",
                "release_date": "2019-11-20",
                "title": "Frozen II",
                "video": false,
                "vote_average": 7.244,
                "vote_count": 10025,
                "character": "Elsa (voice)",
                "credit_id": "5e677d5455c926001562a5a6",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/hparEwMD2lW1P9JjnnxswaqP5fb.jpg",
                "genre_ids": [
                    16,
                    10751,
                    35,
                    14
                ],
                "id": 741074,
                "original_language": "en",
                "original_title": "Once Upon a Snowman",
                "overview": "The previously untold origins of Olaf, the innocent and insightful, summer-loving snowman are revealed as we follow Olaf’s first steps as he comes to life and searches for his identity in the snowy mountains outside Arendelle.",
                "popularity": 2.6609,
                "poster_path": "/hddzYJtfYYeMDOQVcH58n8m1W3A.jpg",
                "release_date": "2020-10-23",
                "title": "Once Upon a Snowman",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 551,
                "character": "Elsa (voice) (archive sound)",
                "credit_id": "5f8fccf7813cb60035ac57b1",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/uVlUu174iiKhsUGqnOSy46eIIMU.jpg",
                "genre_ids": [
                    18,
                    10749,
                    14
                ],
                "id": 402431,
                "original_language": "en",
                "original_title": "Wicked",
                "overview": "In the land of Oz, ostracized and misunderstood green-skinned Elphaba is forced to share a room with the popular aristocrat Glinda at Shiz University, and the two's unlikely friendship is tested as they begin to fulfill their respective destinies as Glinda the Good and the Wicked Witch of the West.",
                "popularity": 16.6828,
                "poster_path": "/2E1x1qcHqGZcYuYi4PzVZjzg8IV.jpg",
                "release_date": "2024-11-20",
                "title": "Wicked",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 2406,
                "character": "Wiz-O-Mania Super Star",
                "credit_id": "675afcea1fc28a646b734b42",
                "order": 41
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "이디나 멘젤",
            "Idina Kim Menzel",
            "Ίντινα Μένζελ",
            "伊迪娜·门泽尔",
            "伊迪娜‧曼佐",
            "ایدینا منزل"
        ],
        "biography": "Idina Kim Menzel (née Mentzel; born May 30, 1971) is an American actress and singer. Particularly known for her work in musicals on the Broadway stage and having achieved mainstream success across stage, film and music, Menzel has garnered the honorific title \"Queen of Broadway\" for her achievements. Her accolades include an American Music Award, a Billboard Music Award and a Tony Award, as well as nominations for three Drama League Awards and four Drama Desk Awards. In 2019, she was awarded a star on the Hollywood Walk of Fame for her contributions to live theatre.\n\nMenzel rose to prominence as a stage actress in 1996, making her Broadway debut playing Maureen Johnson in the rock musical Rent, which earned her a Tony Award nomination for Best Featured Actress in a Musical. After appearing in several smaller-scale stage and Off-Broadway productions, in 2003 Menzel originated the role of Elphaba in the Broadway musical Wicked, for which she won the Tony Award for Best Actress in a Musical. The popularity of the musical, Menzel's character and song \"Defying Gravity\" earned her a devoted following among theater fans. After leaving the show in 2005, she reprised the role in the musical's original West End production until the end of 2006, becoming the highest-paid actress in West End theatre history. In 2014, Menzel returned to Broadway as Elizabeth Vaughan in the musical If/Then, for which she received a third Tony Award nomination.\n\nMenzel began transitioning to film and television roles in the early 2000s. After reprising her role as Maureen in Rent's 2005 film adaptation, she was cast as Nancy Tremaine in Disney's musical fantasy film Enchanted (2007) and reprised her role in its sequel Disenchanted (2022). She had a recurring role as Shelby Corcoran on the musical television series Glee (2010–2013). Since 2013, Menzel has voiced Elsa in Disney's animated Frozen franchise. \"Let It Go\", a song she recorded for the first film, became widely popular upon release, winning an Academy Award for Best Original Song and reaching number five on the Billboard Hot 100, making her the first Tony Award-winning actor to have a top-10 song on the chart. Menzel also starred in the crime drama film Uncut Gems (2019) and in the jukebox musical film Cinderella (2021).\n\nAs a recording artist, Menzel has released six studio albums: Still I Can't Be Still (1998), Here (2004), I Stand (2008), Holiday Wishes (2014), idina. (2016), and Christmas: A Season of Love (2019).",
        "birthday": "1971-05-30",
        "deathday": null,
        "gender": 1,
        "homepage": "https://idinamenzel.com/",
        "id": 19394,
        "imdb_id": "nm0579953",
        "known_for_department": "Acting",
        "name": "Idina Menzel",
        "place_of_birth": "New York, New York, USA",
        "popularity": 0.7734,
        "profile_path": "/eGsyJmAZNV5tUU4RYy2DIRlFVpW.jpg"
    }
}