{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jx6jUMCLhRWB05ngVjaGxPpLq5x.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 5143,
                "original_language": "en",
                "original_title": "Hannah and Her Sisters",
                "overview": "Between two Thanksgivings, Hannah's husband falls in love with her sister Lee, while her hypochondriac ex-husband rekindles his relationship with her sister Holly.",
                "popularity": 2.175,
                "poster_path": "/gARgIRb2QFRFVrsziwWE389u1pK.jpg",
                "release_date": "1986-02-07",
                "title": "Hannah and Her Sisters",
                "video": false,
                "vote_average": 7.498,
                "vote_count": 1088,
                "character": "Evan",
                "credit_id": "52fe43f6c3a36847f807aadf",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Lloyd Benedict Nolan"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nLloyd Benedict Nolan (August 11, 1902 – September 27, 1985) was an American film and television actor.  Among his many roles, Nolan is remembered for originating the role of private investigator Michael Shayne in a series of 1940s B movies.\n\nNolan was born in San Francisco, California, the son of Margaret and James Nolan, who was a shoe manufacturer of Irish descent. He attended Santa Clara Preparatory School and Stanford University, flunking out of Stanford as a freshman \"because I never got around to attending any other class but dramatics.\" His parents disapproved of his choice of a career in acting, preferring that he join his father's shoe business, \"one of the most solvent commercial firms in San Francisco.\"\n\nNolan served in the United States Merchant Marine before joining the Dennis Players theatrical troupe in Cape Cod. He began his career on stage and was subsequently lured to Hollywood, where he played mainly doctors, private detectives, and policemen in many film roles.\n\nNolan also contributed solid and key character parts in numerous other films. One, The House on 92nd Street, was a startling revelation to audiences in 1945. It was a conflation of several true incidents of attempted sabotage by the Nazi regime (incidents which the FBI was able to thwart during World War II), and many scenes were filmed on location in New York City, unusual at the time. Nolan portrayed FBI Agent Briggs, and actual FBI employees interacted with Nolan throughout the film; he reprised the role in a subsequent 1948 movie, The Street with No Name.\n\nNolan appeared three times on NBC's Laramie Western series, as sheriff Tully Hatch in the episode \"The Star Trail (1959), as outlaw Matt Dyer in the episode \"Deadly Is the Night\" (1961)[5] and then as former Union Army General George Barton in the episode \"War Hero\" (1962).[6] On December 8, 1960, Nolan was cast as Dr. Elisha Pittman, in \"Knife of Hate\" on Dick Powell's Zane Grey Theatre. In the story line, Dr. Pittman removed one of the legs of Jack Hoyt (Robert Harland) after Hoyt sustained a gunshot wound from which infection was developing. Hoyt wants to marry Susan Pittman (Susan Oliver), but her father is at first unyielding on the matter.\n\nNolan starred in The Outer Limits episode \"Soldier\" written by Harlan Ellison. He appeared in the NBC Western Bonanza as LaDuke, a New Orleans detective. In 1967, Strother Martin and he guest-starred in the episode \"A Mighty Hunter Before the Lord\" of NBC's The Road West series, starring Barry Sullivan. Also in 1967, Nolan was a guest star in the popular Western TV series The Virginian, in the episode \"The Masquerade\" and in the first episode of Mannix.\n\nA long-time cigar and pipe smoker, Nolan died of lung cancer on September 27, 1985, at his home in Brentwood, California; he was 83. He is interred at the Westwood Village Memorial Park Cemetery in Westwood, Los Angeles, California.  CLR\n\nDescription above from the Wikipedia article Lloyd Nolan, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1902-08-11",
        "deathday": "1985-09-27",
        "gender": 2,
        "homepage": null,
        "id": 19411,
        "imdb_id": "nm0634313",
        "known_for_department": "Acting",
        "name": "Lloyd Nolan",
        "place_of_birth": "San Francisco, California, USA",
        "popularity": 1.886,
        "profile_path": "/tENzeS3MDaFbTdhD2xhyybAfKWP.jpg"
    }
}