{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/y2Ca1neKke2mGPMaHzlCNDVZqsK.jpg",
                "genre_ids": [
                    28,
                    35,
                    53
                ],
                "id": 718930,
                "original_language": "en",
                "original_title": "Bullet Train",
                "overview": "Unlucky assassin Ladybug is determined to do his job peacefully after one too many gigs gone off the rails. Fate, however, may have other plans, as Ladybug's latest mission puts him on a collision course with lethal adversaries from around the globe—all with connected, yet conflicting, objectives—on the world's fastest train.",
                "popularity": 14.001,
                "poster_path": "/j8szC8OgrejDQjjMKSVXyaAjw3V.jpg",
                "release_date": "2022-08-03",
                "title": "Bullet Train",
                "video": false,
                "vote_average": 7.427,
                "vote_count": 6910,
                "character": "Train Passenger (uncredited)",
                "credit_id": "631548b502842000830d9667",
                "order": 44
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Riria Niimura"
        ],
        "biography": "RiRia is an actor and a social influencer who has a background as a multi-international award-winning flutist. RiRia is originally from Tokyo, Japan, and moved to Los Angeles on their own when they were seventeen and taught themselves English. RiRia is best known for roles in the TV show \"Dollface\" (Hulu), \"Anime Crimes Division\" directed by Freddie Wong (Rocket Jump), \"Escape The Night\" by YouTube RED, and an upcoming film \"The Beginning & The Middle\" (2022) directed by Alexis G. Zall. At the age of three, RiRia started their career in music. RiRia made their first debut performance as a solo flutist with an orchestra at the age of ten. For a number of years, RiRia had competed at both national and international competitions where they were awarded over 20 times, the youngest in history. RiRia's recording was used at the 2010 Vancouver Olympics by its silver medal-winning figure skater, Mao Asada.",
        "birthday": "2000-11-27",
        "deathday": null,
        "gender": 3,
        "homepage": null,
        "id": 1942319,
        "imdb_id": "nm7316005",
        "known_for_department": "Acting",
        "name": "RiRia",
        "place_of_birth": "Tokyo Prefecture, Japan",
        "popularity": 0.223,
        "profile_path": "/sJv0lg6YkmPpH7PxXRyuWWUOgyz.jpg"
    }
}