{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rLchzndbDRy41J9X363pMePbV5x.jpg",
                "genre_ids": [
                    53,
                    27,
                    18
                ],
                "id": 546121,
                "original_language": "en",
                "original_title": "Run",
                "overview": "Chloe, a teenager who is confined to a wheelchair, is homeschooled by her mother, Diane. Chloe soon becomes suspicious of her mother and begins to suspect that she may be harboring a dark secret.",
                "popularity": 4.7005,
                "poster_path": "/ilHG4EayOVoYeKqslspY3pR4wzC.jpg",
                "release_date": "2020-11-20",
                "title": "Run",
                "video": false,
                "vote_average": 7.239,
                "vote_count": 2716,
                "character": "Doctor (uncredited)",
                "credit_id": "5e6581b1357c000011386015",
                "order": 14
            },
            {
                "adult": false,
                "backdrop_path": "/fYuWuPZyXSc3s0iPIZ4ZWpEremy.jpg",
                "genre_ids": [
                    18
                ],
                "id": 514439,
                "original_language": "en",
                "original_title": "Breakthrough",
                "overview": "Tragedy strikes when a woman named Joyce's son falls through the ice on a frozen lake and is trapped underwater for over 15 minutes. After being rushed to the hospital, the 14-year-old boy continues to fight for his life as Joyce, her husband and their pastor stay by his bedside and pray for a miracle.",
                "popularity": 5.1141,
                "poster_path": "/lUd2FNC8cMCcHyRMNZtVC48p3xH.jpg",
                "release_date": "2019-04-10",
                "title": "Breakthrough",
                "video": false,
                "vote_average": 7.647,
                "vote_count": 1121,
                "character": "Church Preacher (uncredited)",
                "credit_id": "67a1929feea89adf0902e66c",
                "order": 73
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Having gone to high school in the small northern Manitoba town of Thompson, Steve got involved with the local cable station run by Videon Cable. There, he was able to film and edit local broadcasts of City Council and School Board meetings as well as the town Hockey Games. This led to producing a video show for the station called \"Video Noize\" in which two dudes rocked out by head banging on a couch in a basement while bootlegged punk music played in the background.\n\nThe cable director saw potential and signed Steve up for a class at Native Communications Incorporated (NCI) where Steve learned how to create a production start to finish. some of these works included Crime Stoppers videos and a news story on Viking Helicopters who at the time carried out the water bombing on the forest fires that were active in the region that summer.\n\nNCI also had a radio channel which was played early morning on CBC television. Steve was an assistant DJ who provided character voices and wrote comedy material.\n\nFast forward to 1994 and while Steve finds himself in Seattle where he met a local comedy troupe that was working on Almost Live! the TV show. During this time Steve helped out on a few skits and also wrote, acted in and edited parts of one episode.\n\nSteve returned to Winnipeg, Manitoba , Canada in 1995 and begun working a professional career.\n\nIn 2017 Steve caught the acting bug once again and has recently found himself in several projects shooting in the Winnipeg area.",
        "birthday": "1973-01-18",
        "deathday": null,
        "gender": 2,
        "homepage": "https://bigspoonsphotos.weebly.com/stevepacaud.html",
        "id": 1942921,
        "imdb_id": "nm9148116",
        "known_for_department": "Acting",
        "name": "Steve Pacaud",
        "place_of_birth": "North Bay, Ontario, Canada",
        "popularity": 0.0589,
        "profile_path": "/iIWogIhKyZs5crxcHC3uuwtqCky.jpg"
    }
}