{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/orSiH0y4r0BwFxNdWhNKkgPocQx.jpg",
                "genre_ids": [
                    18,
                    35,
                    10749
                ],
                "id": 12919,
                "original_language": "en",
                "original_title": "Can't Buy Me Love",
                "overview": "Nerdy high schooler Ronald Miller rescues cheerleader Cindy Mancini from parental punishment after she accidentally destroys her mother's designer clothes. Ronald agrees to pay for the $1,000 outfit on one condition: that she will act as though they're a couple for an entire month. As the days pass, however, Cindy grows fond of Ronald, making him popular. But when Ronald's former best friend gets left behind, he realizes that social success isn't everything.",
                "popularity": 2.8466,
                "poster_path": "/qK3yiqo84U3twOOKOx81c407Hpr.jpg",
                "release_date": "1987-08-14",
                "title": "Can't Buy Me Love",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 686,
                "character": "Mrs. Mancini",
                "credit_id": "52fe452c9251416c7504e1e5",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Sharon Lee Forsmoe"
        ],
        "biography": "Sharon Farrell (born Sharon Forsmoe; December 24, 1940 – May 15, 2023) was an American television and film actress, and dancer. Originally beginning her career as a ballerina with the American Ballet Theatre company, Farrell made her film debut in 1959 in Kiss Her Goodbye, followed by roles in 40 Pounds of Trouble (1962), A Lovely Way to Die (1968), and the neo-noir Marlowe (1969). She worked prolifically in television, including recurring parts in the series Saints and Sinners (1962), Dr. Kildare (1965), and Hawaii Five-O (1980).\n\nFarrell was born in Sioux City, Iowa, to Hazel Ruth (née Huffman) and Darrel LaValle Forsmoe. She was of Norwegian descent, and was raised with sister, Dale Candice, in a Lutheran family. During her childhood, Farrell studied ballet and was involved in the theater department during high school. Farrell toured with the American Ballet Theatre Company as a dancer, which brought her to New York City.\n\nIn New York, Farrell began her acting career in the theater, appearing in productions of \"The Crucible\" and \"A View from the Bridge\". She made her film debut in 1959 in Kiss Her Goodbye, and went on to appear in a number of films in the 1960s, including 40 Pounds of Trouble, A Lovely Way to Die, and Marlowe.\n\nFarrell's television career began in the early 1960s, with appearances in such series as The Alfred Hitchcock Hour, Gunsmoke, and Dr. Kildare. She had a recurring role on the soap opera Saints and Sinners from 1962 to 1963, and starred in the short-lived series The Last Ride of the Dalton Gang in 1967. In 1980, she joined the cast of Hawaii Five-O, playing the role of Lori Wilson for two seasons.\n\nFarrell was also active in the horror genre, appearing in the films It's Alive (1974) and Night of the Comet (1984). She continued to work in television and film throughout the 1980s and 1990s, and her final film appearance was in the 2000 comedy Can't Buy Me Love.\n\nIn addition to her acting career, Farrell was also a dancer and choreographer. She taught dance at the University of California, Los Angeles, and was a member of the board of directors of the American Ballet Theatre.\n\nFarrell was married five times, to Andrew Prine, Ron DeBlasio, Steve Salkin, and Dale Trevillion. She had one son, Chance Boyer, from her marriage to Prine.\n\nFarrell died on May 15, 2023, at the age of 82, from natural causes. She was buried in Forest Lawn Memorial Park in Hollywood Hills, California.",
        "birthday": "1940-12-24",
        "deathday": "2023-05-15",
        "gender": 1,
        "homepage": null,
        "id": 19434,
        "imdb_id": "nm0268331",
        "known_for_department": "Acting",
        "name": "Sharon Farrell",
        "place_of_birth": "Sioux City, Iowa, U.S",
        "popularity": 0.3997,
        "profile_path": "/42dQ4WRePvqrdNwLjoRfimngWdo.jpg"
    }
}