{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6tAYyCxF0T5oUIH95zMBC3X3W5T.jpg",
                "genre_ids": [
                    10751,
                    14,
                    35
                ],
                "id": 668461,
                "original_language": "en",
                "original_title": "Slumberland",
                "overview": "A young girl discovers a secret map to the dreamworld of Slumberland, and with the help of an eccentric outlaw, she traverses dreams and flees nightmares, with the hope that she will be able to see her late father again.",
                "popularity": 2.4604,
                "poster_path": "/eCgBLNAFC4XDZ4DiyQ80PIJdSHU.jpg",
                "release_date": "2022-11-18",
                "title": "Slumberland",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 886,
                "character": "Agent Green",
                "credit_id": "62faf8db2441820093781495",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Reanne Weruche Opia",
            "Reanne Opia",
            "Reanne Weruche",
            "ウェルシュ・オピア",
            "ウェルチェ・オピア",
            "薇魯希・歐皮雅",
            "薇魯希 歐皮雅"
        ],
        "biography": "Reanne Weruche Opia (/wəˈruːtʃeɪ ˈoʊpiə/) (born April 11, 1987) is a British-Nigerian actress and entrepreneur. She is the founding CEO of the clothing line Jesus Junkie Clothing. She was nominated for a British Academy Television Award for her performance in the BBC miniseries I May Destroy You (2020).\n\nBorn in Lagos, Opia moved to South East London at the age of 13. Her father is an author and professor of social sciences and her mother is veteran Nigerian broadcaster and television host Ruth Benamaisia-Opia. Opia holds a degree in drama and sociology from the University of the West of England, Bristol.\n\nAfter making her television debut with a guest appearance in a 2010 episode of The Bill, Opia spent a year with the Renegade Theatre Company in Nigeria. Upon returning to England in 2012, she appeared in the Channel 4 crime drama Top Boy and the Channel 5 procedural Suspects.\n\nOpia gained prominence through her role as Cleopatra Ofoedo in the third series of the BBC comedy Bad Education and its 2015 spinoff film. Opia was nominated in 2015 in the Nollywood Actress of the Year category at the 2015 Nigeria Entertainment Awards for her role in the film When Love Happens. From 2019 to 2020, Opia was in the main cast of the Dave sitcom Sliced as Naomi.\n\nOpia starred as Terry Pratchard in Michaela Coel's BBC series I May Destroy You, which first aired in June 2020. For her performance, Opia was nominated for a British Academy Television Award and won a Black Reel Award. In 2022, she appeared in the ITV thriller Our House.",
        "birthday": "1987-04-11",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1948465,
        "imdb_id": "nm4030255",
        "known_for_department": "Acting",
        "name": "Weruche Opia",
        "place_of_birth": "Nigeria",
        "popularity": 0.2034,
        "profile_path": "/pPgIOuM9lRO1zH6eDnqDpf0w7da.jpg"
    }
}