{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4tdV5AeojEdbvn6VpeQrbuDlmzs.jpg",
                "genre_ids": [
                    16,
                    18,
                    12,
                    14
                ],
                "id": 916224,
                "original_language": "ja",
                "original_title": "すずめの戸締まり",
                "overview": "Suzume, 17, lost her mother as a little girl. On her way to school, she meets a mysterious young man. But her curiosity unleashes a calamity that endangers the entire population of Japan, and so Suzume embarks on a journey to set things right.",
                "popularity": 8.5962,
                "poster_path": "/yStW1TXF5s7Tbtu9KjIZEaWl6HL.jpg",
                "release_date": "2022-11-11",
                "title": "Suzume",
                "video": false,
                "vote_average": 7.91,
                "vote_count": 1540,
                "character": "(voice)",
                "credit_id": "641dae55ae6f0900ced7dac1",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Aimi Terakawa",
            "寺川愛美",
            "테라카와 아이미",
            "آیمی"
        ],
        "biography": "Aimi Terakawa,  professionally known under the mononym Aimi (愛美 Aimi), is a Japanese voice actress and singer from Hyōgo Prefecture who is affiliated with the talent agency Hibiki. After aspiring to become an entertainer for part of her life, she started her singing career in 2011 after winning an audition to become part of the Tantei Opera Milky Holmes franchise. That same year, she made her solo music debut with the release of her first single \"Tenshi no Clover\"; the title song was used as the opening theme to the anime series Astarotte no Omocha!.\n\nAimi is a member of the singing unit Feathers, together with fellow voice actress Ayasa Itō. She is best known as the voices of the idol Julia in the game The Idolmaster: Million Live!, and Kasumi Toyama in the multimedia franchise BanG Dream!; Aimi also performs as a live guitarist in BanG Dream! as part of the in-universe band Poppin'Party.",
        "birthday": "1991-12-25",
        "deathday": null,
        "gender": 1,
        "homepage": "https://hibiki-cast.jp/hibiki_f/aimi/",
        "id": 1950099,
        "imdb_id": "nm5331218",
        "known_for_department": "Acting",
        "name": "Aimi",
        "place_of_birth": "Kobe, Hyogo, Japan",
        "popularity": 0.7348,
        "profile_path": "/9mk1CHBZDmY2hh9BT5gb7yDMsQY.jpg"
    }
}