{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jllyc0pY7xFYLyjuCEP6pO7hm8t.jpg",
                "genre_ids": [
                    80,
                    35,
                    53
                ],
                "id": 9430,
                "original_language": "en",
                "original_title": "Go",
                "overview": "A supermarket clerk decides to step in for an absent drug dealer, setting off an explosive, comedic chain of events.",
                "popularity": 3.4864,
                "poster_path": "/kP0OOAa4GTZSUPW8fgPbk1OmKEW.jpg",
                "release_date": "1999-04-09",
                "title": "Go",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 766,
                "character": "Girl in Line (uncredited)",
                "credit_id": "63cef70ed6c30000f051b702",
                "order": 36
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "While the industry was breaking down all around her, Dana Schick was busy making a movie. Serving as lead actress and executive producer on the quarantine-inspired film, The Death of Us, this lady wasn't about to let a pandemic get her down.\n\nClassically trained, Dana has also played roles in plays from Shakespeare to Oscar Wilde, and has appeared in numerous movies and daytime and primetime TV shows. You may have seen her in Manifest and John Wick: Chapter 3 - Parabellum.\n\nDana began her acting education in the best way possible, on a scholarship with the world-renowned Lee Strasberg Film & Theatrical Institute at just 13 years of age. She blossomed into a talented performer right before Hollywood's finest, as acting greats Robert De Nero and Al Pacino would stop by to catch a glimpse of the next generation of talent.\n\nLater, Dana continued to build on her craft by training with the great teachers of her profession in Howard Fine, Ivanna Chubbuck, and Margie Haber.\n\nWhile acting remains her no. 1 passion, Dana's resume also features several stunt performances on productions such as 2001's Planet of the Apes and 2014's Swelter.\n\nDana's artistic ambitions revealed themselves at an early age. At just seven years old, she expressed her creative talents through music, when impressing her friends and family with her violin and flute performances. However, it wasn't until she joined a performing art school at 13 that her acting and dance talents emerged, and a future star was born.\n\nThanks to her perceived good looks, Dana's earlier years saw her became a high-fashion and runway model, with her resume including a photo shoot with the esteemed David LaChapelle. So while she can kick ass, don't worry...you can be damn sure she's going to look good doing it.\n\nWhen Dana commits to a project, she really commits. Make no mistake...she's in this business for the long haul. That focus and discipline may have something to do with the fact that her paternal roots lie in the military. The German blood she inherited from her father's side may help with that too.\n\nDana even manages to find a little time for herself on occasion. When she does, she enjoys reading, photography, learning, traveling, and getting lost on the Internet.\n\nDana looks forward to fulfilling her EGOT ambitions, performing alongside the likes of Glenn Close and Johnny Depp along the way.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1950920,
        "imdb_id": "nm3137314",
        "known_for_department": "Acting",
        "name": "Dana Schick",
        "place_of_birth": " Munich, Bavaria, Germany",
        "popularity": 0.9333,
        "profile_path": "/8PnlNY6aAmx9nA3j0VZXNN34W1t.jpg"
    }
}