{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rcJynPuUuSBuzOmahUTasliurzr.jpg",
                "genre_ids": [
                    18,
                    10749,
                    14
                ],
                "id": 15775,
                "original_language": "en",
                "original_title": "If Only",
                "overview": "After his impetuous musician girlfriend, Samantha, dies in an accident shortly after they had a fight (and nearly broke up), Ian Wyndham, a grief-stricken British businessman living in London gets a chance to relive the day all over again, in the hope of changing the events that led up to her getting killed.",
                "popularity": 3.7602,
                "poster_path": "/xVSqtdVanaPsZazNDFyIJSw0Mn6.jpg",
                "release_date": "2004-01-23",
                "title": "If Only",
                "video": false,
                "vote_average": 7.01,
                "vote_count": 607,
                "character": "Lavinia",
                "credit_id": "5dcc9ed5e263bb001771bb42",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Philippa J Haywood",
            "Philippa Haywood",
            "Phillipa Haywood",
            "피파 헤이우드",
            "琵琶·海伍德"
        ],
        "biography": "Philippa \"Pippa\" Haywood is an English actress who trained at Bristol Old Vic Theatre School.\n\nHaywood was born in Hatfield, Hertfordshire. She has an extensive television career which includes portraying the much put-upon Helen Brittas in the BBC One comedy series The Brittas Empire (1991-1997), Julie Chadwick in the 2007 BBC Two comedy Fear, Stress & Anger and the hot-tempered, sex-mad human resources director Joanna Clore in Green Wing (2004-2006), for which she won the \"best comedy female performance\" award at the 2005 Rose d'Or television festival in Lucerne, Switzerland).\n\nShe has also done many dramatic roles, including Jenny Thorne in the 1988 ITV drama serial The One Game, and Mrs. Upjohn in the 2008 Agatha Christie's Poirot episode \"Cat Among the Pigeons\". In 2002 Haywood was a guest star in the last episode of the first series of The Inspector Lynley Mysteries.\n\nIn 2007 she played the role of Veronica Gray in the first episode of the second series of Lewis and also had a guest role in a 2009 episode of Kingdom, and portrayed the disgraced Miss Bunting in several episodes of the first series of Mr Selfridge (2013). Since 2012 she has played one of the lead roles, Harriet, on the BBC One drama Prisoners' Wives, and costarred as Detective Superintendent Julie Dodson on the ITV drama series Scott & Bailey. In 2015 she appeared in the BBC TV adaptation of E.F. Benson's Mapp and Lucia, as Susan Wyse.\n\nIn 2015, Haywood took over the role of Helen Golightly in the long-running BBC Radio 4 comedy Clare in the Community. The character was previously played by Liza Tarbuck.\n\nHaywood has also worked in film and theatre. Recent stage credits include: House & Garden, Private Lives, A Midsummer Night's Dream, The Winter's Tale, Requiem and Landscape with Weapon at the National Theatre. She was then playing the lead role in Wanderlust at the Royal Court Jerwood Theatre Upstairs. On December 18th 2016 she starred in Midsomer Murders with Hugh Dennis.",
        "birthday": "1961-05-06",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 195274,
        "imdb_id": "nm0371846",
        "known_for_department": "Acting",
        "name": "Pippa Haywood",
        "place_of_birth": "Hatfield, Hertfordshire, England",
        "popularity": 0.2268,
        "profile_path": "/7mWc8C0kJylpBWK2P31XjbuwsGp.jpg"
    }
}