{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/oxcaIxASeu57f6VSn8awiXz6yZS.jpg",
                "genre_ids": [
                    35,
                    10749,
                    14
                ],
                "id": 570131,
                "original_language": "fr",
                "original_title": "Mon Inconnue",
                "overview": "A man tries to make his wife fall in love with him again, after waking up in an alternate reality where she never knew him.",
                "popularity": 3.8181,
                "poster_path": "/11CkMVD0dPjhAZPaf0u9VfS46lw.jpg",
                "release_date": "2019-01-18",
                "title": "Love at Second Sight",
                "video": false,
                "vote_average": 7.053,
                "vote_count": 838,
                "character": "Self",
                "credit_id": "62e5aa6ff1b571006133b38f",
                "order": 25
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "ხატია ბუნიათიშვილი"
        ],
        "biography": "Born in 1987 in Batumi, Georgia, pianist Khatia Buniatishvili began studying piano under her mother at the age of three. She gave her first concert with Tbilisi Chamber Orchestra when she was 6 and appeared internationally at age 10. Khatia studied in Tbilisi with Tengiz Amiredjibi and in Vienna with Oleg Maisenberg. Her older sister, Gvantsa Buniatishvili is also a pianist and they have played together on multiple occasions.\n\nBuniatishvili signed with Sony Classical as an exclusive artist in 2010. Her 2011 debut album included Liszt’s Sonata in B minor, Liebestraum No. 3, and Mephisto Waltz No. 1.\n\nIn 2012, Buniatishvili released her second album, Chopin, which featured solo piano works as well as Chopin's Piano Concerto No. 2 in F minor accompanied by the Orchestre de Paris and Paavo Järvi. The Guardian reported \"This is playing straight from the heart from one of today's most exciting and technically gifted young pianists.\"",
        "birthday": "1987-06-21",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.khatiabuniatishvili.com/",
        "id": 1952101,
        "imdb_id": "nm6371940",
        "known_for_department": "Acting",
        "name": "Khatia Buniatishvili",
        "place_of_birth": "Batumi, Batumi Oblast, Kutaisi Governorate, Russian Empire [now Autonomous Republic of Adjara, Republic of Georgia]",
        "popularity": 0.0983,
        "profile_path": "/enYot0KyWQtaoU0MN1HJ9AL8ql3.jpg"
    }
}