{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9T8sj5io4SGCBTHsk5H8LGcfKVe.jpg",
                "genre_ids": [
                    10749,
                    18
                ],
                "id": 419478,
                "original_language": "en",
                "original_title": "Midnight Sun",
                "overview": "Katie, a 17-year-old, has been sheltered since childhood and confined to her house during the day by a rare disease that makes even the smallest amount of sunlight deadly. Fate intervenes when she meets Charlie and they embark on a summer romance.",
                "popularity": 4.4215,
                "poster_path": "/vPG2zEKPXhovPW9S91SRnwr5JM1.jpg",
                "release_date": "2018-03-22",
                "title": "Midnight Sun",
                "video": false,
                "vote_average": 7.816,
                "vote_count": 3498,
                "character": "Zoe's Friend (uncredited)",
                "credit_id": "5a97e4c692514128a400f413",
                "order": 34
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Yobdee Marazzi"
        ],
        "biography": "Born in Ethiopia in 2007, Yobdee Marazzi is a rising star in the entertainment industry, making waves as an Ethiopian-Canadian film and television actress, as well as a dynamic dancer.  She stars as Tula Johnson in the Lifetime thriller Before Your Father Finds Us (2025), alongside Alexa PenaVega and Tahmoh Penikett. Known for her emotional depth, strong screen presence, and versatile performance skills, Yobdee continues to build a dynamic career in both film and television.  She began acting at the age of 7 when she was cast as a series regular in the ABC pilot Mix (2015). She went on to appear as Palesa in the crime drama ICE, and gained further recognition for her guest role as Maya in Season 4 of Virgin River (Netflix, 2022). In 2020, she was featured as a dancer in The Healing Powers of Dude (Netflix), showcasing her ability to blend storytelling with movement.\n\nBefore pursuing acting full-time, Yobdee was a competitive gymnast. Her passion for floor routines sparked her love of dance. She has trained extensively in hip hop, ballet, contemporary, jazz, lyrical, and musical theatre, with a primary focus on hip hop and urban dance. She has trained in Vancouver, Los Angeles, and New York, and has received numerous awards for her dance performances. Yobdee is also known for performing at charitable events and using her talent to support meaningful causes.\n\nOutside of acting and dance, Yobdee is active in her community and enjoys mentoring young performers. In her free time, she loves reading, singing, baking, decorating, and spending time with family and friends.\n\nYobdee brings authenticity, dedication, and heart to every role. With a strong foundation in both dramatic acting and movement, she continues to grow as a storyteller, committed to creating work that connects with audiences across genres.",
        "birthday": "2007-05-18",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1954639,
        "imdb_id": "nm7167298",
        "known_for_department": "Acting",
        "name": "Yobdee  Marazzi",
        "place_of_birth": "Addis Ababa, Ethiopia",
        "popularity": 0.1706,
        "profile_path": "/jo8TGkcayc1WDc9GFHa70EwB1v.jpg"
    }
}