{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yjGllQUm28R4X9xD9T5xMszirgw.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 235,
                "original_language": "en",
                "original_title": "Stand by Me",
                "overview": "After learning that a boy their age has been accidentally killed near their rural homes, four Oregon boys decide to go see the body. On the way, Gordie,  Vern, Chris and Teddy encounter a mean junk man and a marsh full of leeches, as they also learn more about one another and their very different home lives. Just a lark at first, the boys' adventure evolves into a defining event in their lives.",
                "popularity": 5.9784,
                "poster_path": "/vz0w9BSehcqjDcJOjRaCk7fgJe7.jpg",
                "release_date": "1986-08-08",
                "title": "Stand by Me",
                "video": false,
                "vote_average": 7.853,
                "vote_count": 6166,
                "character": "Ray Brower",
                "credit_id": "5a4ef94a0e0a2657740061d4",
                "order": 29
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/2ANHqBhbAhyIBRTLSVfENskpxon.jpg",
                "genre_ids": [
                    80,
                    27,
                    53
                ],
                "id": 1029281,
                "original_language": "en",
                "original_title": "Strange Darling",
                "overview": "Nothing is what it seems when a twisted one-night stand spirals into a serial killer’s vicious murder spree.",
                "popularity": 11.1815,
                "poster_path": "/kWNCRgt3ocv19bYO0sk7TRuZuFY.jpg",
                "release_date": "2024-08-14",
                "title": "Strange Darling",
                "video": false,
                "vote_average": 6.951,
                "vote_count": 702,
                "credit_id": "6512fa2c176a940100c592c6",
                "department": "Crew",
                "job": "Stunt Coordinator"
            },
            {
                "adult": false,
                "backdrop_path": "/aH5QhlVu7uMnLO9P432IcP8FyCI.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 1850,
                "original_language": "en",
                "original_title": "Man on the Moon",
                "overview": "The story of the life and career of eccentric avant-garde comedian, Andy Kaufman.",
                "popularity": 4.1341,
                "poster_path": "/msOZS07xRIFnapwp3fprGbKEAfT.jpg",
                "release_date": "1999-12-22",
                "title": "Man on the Moon",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 1868,
                "credit_id": "65693943b7d35200ea8c26a3",
                "department": "Crew",
                "job": "Stunt Double"
            },
            {
                "adult": false,
                "backdrop_path": "/iXlHfi9hq7nfSv31pBab8fpMfZh.jpg",
                "genre_ids": [
                    35,
                    10751,
                    14
                ],
                "id": 10830,
                "original_language": "en",
                "original_title": "Matilda",
                "overview": "Matilda Wormwood is an exquisite and intelligent little girl. Unfortunately, her parents, Harry and Zinnia misunderstand her because they think she is so different. As time passes, she finally starts school and has a kind teacher, loyal friends, and a sadistic headmistress. As she gets fed up with the constant cruelty, she begins to realize that she has a gift of telekinetic powers. After some days of practice, she suddenly turns the tables to stand up to Harry and Zinnia and outwit the headmistress.",
                "popularity": 6.6204,
                "poster_path": "/wYoDpWInsBEVSmWStnRH06ddoyk.jpg",
                "release_date": "1996-08-02",
                "title": "Matilda",
                "video": false,
                "vote_average": 7.165,
                "vote_count": 4618,
                "credit_id": "64a0b3b84a52f800af12244b",
                "department": "Crew",
                "job": "Stunts"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Kent Lutrell",
            "Kent Luttrell",
            "Ken Luttrell"
        ],
        "biography": "Kent Luttrell has been a Hollywood stuntman from a young age. Starting at age 19 in the movie \"Stand By Me\". He has doubled several stars in Film and TV including Danny DeVito, Johnathan Taylor Thomas, Corey Feldman, Michael J. Fox, David Gallagher, Joseph Mazzello and many more. He has performed stunt work throughout the US and Canada, with a few stints overseas. Predominately doubling for Danny DeVito for over 10 years. After moving from Portland to Los Angeles, Kent's resume and experience grew and he eventually found himself working steadily in the Hollywood stunt industry.\n\nKent has plenty of big budget experience. When he is not hitting the ground he can be seen stunt driving, high falling and the occasional body burn. Last seen on fire for a Widmer Brewing Company Commercial.\n\nWhen Kent is not actively doing the stunt work, he can be found coordinating stunts and innovating older stunt equipment and improving many of its designs. A certified welder and mechanical designer, Kent has manufactured all of his own and others equipment for many years. Including air rams, ratchets, cylinder decelerators and high fall air bags. Air bags and high falls became a passion for Kent and he built many sizes and types of air bags with his good friend Paul Dallas. Always innovating always looking ahead.",
        "birthday": "1965-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1954125,
        "imdb_id": "nm0527486",
        "known_for_department": "Crew",
        "name": "Kent W. Luttrell",
        "place_of_birth": "Portland, Oregon",
        "popularity": 0.1356,
        "profile_path": "/g1blFCUJRuREKXa7gNJ1QG6BIOH.jpg"
    }
}