{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ra9surFrWYvIL0pWcm3MrxmPhTg.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 90369,
                "original_language": "en",
                "original_title": "Now Is Good",
                "overview": "A girl dying of leukemia compiles a list of things she'd like to do before passing away. Topping the list is her desire to lose her virginity.",
                "popularity": 1.849,
                "poster_path": "/oOBHF6qWtMkzwpnrLDTKJPAb3zH.jpg",
                "release_date": "2012-09-19",
                "title": "Now Is Good",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1089,
                "character": "Phillippa",
                "credit_id": "5847b166c3a368141f005bb8",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Rakie Olufunmilayo Ayola"
        ],
        "biography": "Rakie Olufunmilayo Ayola  is a Welsh actress.\n\nShe was born in Cardiff in May 1968, to a Sierra Leonean mother and a Nigerian father, and was raised by her mother's cousin and his wife in the Ely district of the city.\n\nShe studied at Glan Ely High School, and was a member of the Orbit Youth Theatre, South Glamorgan Youth Theatre, South Glamorgan Youth Choir and the National Youth Theatre of Wales.\n\nShe went on to attend the Royal Welsh College of Music and Drama, studying for a three-year acting diploma.  In 2023 Rakie Ayola was the 18th recipient of the prestigious BAFTA Cymru Siân Phillips Award. At the same ceremony she also won the Bafta Cymru Best Actress Award for her performance in BBC1 series The Pact Season 2 on which she was an Executive Producer. In 2021 Rakie Ayola won BAFTA Best Supporting Actress for BBC1 film Anthony by Jimmy McGovern. Ayola has appeared in television shows including Kaos, The Pact Season 1, Grace, Shetland, No Offence, Midsomer Murders, Black Mirror, Noughts + Crosses, Doctor Who, Silent Witness and EastEnders, a number of Shakespearean theatrical performances and feature films such as Been So Long, Now Is Good, Great Moments in Aviation, The i Inside, Dredd, and Sahara. She appeared as Kyla Tyson in the BBC medical drama Holby City from its eighth to eleventh series.",
        "birthday": "1968-05-11",
        "deathday": null,
        "gender": 1,
        "homepage": "https://theartistspartnership.co.uk/artist/rakie-ayola/",
        "id": 195575,
        "imdb_id": "nm0043931",
        "known_for_department": "Acting",
        "name": "Rakie Ayola",
        "place_of_birth": "Cardiff, Wales, UK",
        "popularity": 0.399,
        "profile_path": "/oaLs5ACdurV2lij6GEidn0fSrUq.jpg"
    }
}