{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/d7YwLX0PnX8vsaaQq9bz93jczGw.jpg",
                "genre_ids": [
                    35,
                    10402
                ],
                "id": 37719,
                "original_language": "en",
                "original_title": "A Night at the Opera",
                "overview": "The Marx Brothers take on high society and the opera world to bring two lovers together. A sly business manager and two wacky friends of two opera singers help them achieve success while humiliating their stuffy and snobbish enemies.",
                "popularity": 2.1823,
                "poster_path": "/A4YDGfJwaG7aMxDVrVJsOHJ7ufK.jpg",
                "release_date": "1935-11-15",
                "title": "A Night at the Opera",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 519,
                "character": "Aviator (uncredited)",
                "credit_id": "64a0884cc390c5014e3c4a37",
                "order": 30
            },
            {
                "adult": false,
                "backdrop_path": "/2clBxxclZJ4OK1xzhmCCXHEfy3r.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 759,
                "original_language": "en",
                "original_title": "Gentlemen Prefer Blondes",
                "overview": "Lorelei Lee is a beautiful showgirl engaged to be married to the wealthy Gus Esmond, much to the disapproval of Gus' rich father, Esmond Sr., who thinks that Lorelei is just after his money. When Lorelei goes on a cruise accompanied only by her best friend, Dorothy Shaw, Esmond Sr. hires Ernie Malone, a private detective, to follow her and report any questionable behavior that would disqualify her from the marriage.",
                "popularity": 2.7271,
                "poster_path": "/fDozhst5HVJJcd3BM8ZOsKniO7Q.jpg",
                "release_date": "1953-07-14",
                "title": "Gentlemen Prefer Blondes",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1011,
                "character": "Waiter (uncredited)",
                "credit_id": "6574e43da84a47013821926b",
                "order": 129
            },
            {
                "adult": false,
                "backdrop_path": "/rsI82F7DadIQcrZyPbuwmkhN5ty.jpg",
                "genre_ids": [
                    35
                ],
                "id": 3034,
                "original_language": "en",
                "original_title": "Young Frankenstein",
                "overview": "A young neurosurgeon inherits the castle of his grandfather, the famous Dr. Victor von Frankenstein. In the castle he finds a funny hunchback, a pretty lab assistant and the elderly housekeeper. Young Frankenstein believes that the work of his grandfather was delusional, but when he discovers the book where the mad doctor described his reanimation experiment, he suddenly changes his mind.",
                "popularity": 3.9553,
                "poster_path": "/c6335WJCZO8NK5wehHk5sA9Cypv.jpg",
                "release_date": "1974-12-15",
                "title": "Young Frankenstein",
                "video": false,
                "vote_average": 7.867,
                "vote_count": 3247,
                "character": "Train Conductor",
                "credit_id": "568ea6b29251416b5200304e",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ralph Sedan",
            "Rolf Sedan",
            "Rolphe Sedan",
            "Edward Sedan"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nRolfe Sedan (January 20, 1896 – September 15, 1982) was an American character actor, best known for appearing in bit parts, often uncredited, usually portraying clerks, train conductors, postmen, cooks, waiters etc.  He began his career in show business as a nightclub and vaudeville performer and began acting in East Coast theatre. Sedan debuted on Broadway in 1916 and appeared in his first motion picture for Metro Pictures Corporation in 1921.\n\nHe became a prolific character actor and is probably best remembered by movie buffs as the hotel manager in Ninotchka (1939) starring Greta Garbo. Around the same time, he appeared in an uncredited role as the Emerald City's Balloon Ascensionist in The Wizard of Oz (1939). He returned to Broadway, performing in several different shows during the first half of the 1940s and in the 1950s began a sequence of guest roles in television series such as The Jack Benny Show. His most frequent TV work came from recurring roles as put-upon mail carriers (25 episodes as Mr. Beasley on The George Burns and Gracie Allen Show; 4 episodes as Mr. Briggs on The Addams Family). He was also seen as the train conductor in the film Young Frankenstein (1974). Rolfe Sedan remained active throughout a career that spanned more than six decades.",
        "birthday": "1896-01-20",
        "deathday": "1982-09-15",
        "gender": 2,
        "homepage": null,
        "id": 19552,
        "imdb_id": "nm0781232",
        "known_for_department": "Acting",
        "name": "Rolfe Sedan",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.1485,
        "profile_path": "/zB7AdnKPBpadzUuQUYQ877JyyXm.jpg"
    }
}