{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/suaEOtk1N1sgg2MTM7oZd2cfVp3.jpg",
                "genre_ids": [
                    53,
                    80,
                    35,
                    18
                ],
                "id": 680,
                "original_language": "en",
                "original_title": "Pulp Fiction",
                "overview": "A burger-loving hit man, his philosophical partner, a drug-addled gangster's moll and a washed-up boxer converge in this sprawling, comedic crime caper. Their adventures unfurl in three stories that ingeniously trip back and forth in time.",
                "popularity": 18.5743,
                "poster_path": "/vQWk5YBFWF4bZaofAbv0tShwBvQ.jpg",
                "release_date": "1994-09-10",
                "title": "Pulp Fiction",
                "video": false,
                "vote_average": 8.487,
                "vote_count": 29078,
                "character": "Fourth Man",
                "credit_id": "52fe426ac3a36847f801cb3f",
                "order": 44
            },
            {
                "adult": false,
                "backdrop_path": "/5HVwz8cImMEwcV2z1SMFyJHY51q.jpg",
                "genre_ids": [
                    18
                ],
                "id": 9609,
                "original_language": "en",
                "original_title": "Of Mice and Men",
                "overview": "Two drifters, one a gentle but slow giant, try to make money working the fields during the Depression so they can fulfill their dreams.",
                "popularity": 3.7043,
                "poster_path": "/qAHLUMZyoW3iwj2b01B2nKcePTA.jpg",
                "release_date": "1992-09-16",
                "title": "Of Mice and Men",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 681,
                "character": "Whitt",
                "credit_id": "5497fe0ac3a36802a9000f8e",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/g5haoqEqt5VwVwQKEkoXY9zqSxb.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 232672,
                "original_language": "en",
                "original_title": "Blended",
                "overview": "Recently divorced mom Lauren and widowed dad Jim let their friends push them into a blind date, which goes disastrously wrong. Unsurprisingly, neither wants to see the other ever again. However, fate intervenes when both Jim and Lauren, unbeknownst to each other, purchase one-half of the same vacation package at a South African resort for families, during spring break. They and their children are forced to share the same romantic suite and participate in a slew of family activities together.",
                "popularity": 9.1245,
                "poster_path": "/o2YrH9jS7CAfWjETHFeL0tth79E.jpg",
                "release_date": "2014-05-21",
                "title": "Blended",
                "video": false,
                "vote_average": 6.892,
                "vote_count": 3667,
                "character": "Georgina",
                "credit_id": "54e3e0c7925141195600a836",
                "order": 20
            },
            {
                "adult": false,
                "backdrop_path": "/1WRwy3EDc2LVtwauzIMMGVJLEI5.jpg",
                "genre_ids": [
                    18
                ],
                "id": 9787,
                "original_language": "en",
                "original_title": "Lords of Dogtown",
                "overview": "The radical true story behind three teenage surfers from Venice Beach, California, who took skateboarding to the extreme and changed the world of sports forever. Stacy Peralta, Tony Alva and Jay Adams are the Z-Boys, a bunch of nobodies until they create a new style of skateboarding that becomes a worldwide phenomenon. But when their hobby becomes a business, the success shreds their friendship.",
                "popularity": 9.7722,
                "poster_path": "/k2NiPfydLSwmk28C6qpvpJPuqtq.jpg",
                "release_date": "2005-06-03",
                "title": "Lords of Dogtown",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 772,
                "character": "Tranny",
                "credit_id": "610de58ab33903007421f456",
                "order": 57
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Robert Arquette",
            "Lex Arquette",
            "Eva Destruction"
        ],
        "biography": "Alexis Arquette (July 28, 1969 – September 11, 2016) was an American actress and transgender activist.\n\nBorn in Los Angeles, she was the fourth of five children to Lewis Arquette, an actor and director, and Brenda Olivia \"Mardi\" (née Nowak), an actress. Coming from a family deeply entrenched in the entertainment industry, Alexis was the sibling of actors Rosanna, Richmond, Patricia, and David Arquette. Her career began in her youth, appearing aged 12 in the music video \"She's a Beauty\" by The Tubes and making her screen debut in Down and Out in Beverly Hills (1986). Known for her versatility, Arquette often performed as a female impersonator under the name \"Eva Destruction\", before publicly sharing her transition process towards gender-affirming surgery. Her filmography includes a range of roles, from starring roles in small productions like Jumpin' at the Boneyard (1992), Things I Never Told You (1996) and I Think I Do (1997) to appearances in mainstream hits like Threesome, Pulp Fiction (both 1994), The Wedding Singer, Bride of Chucky (both 1998), She's All That (1999) and Blended (2014).\n\nArquette's personal life was marked by her vocal support for the transgender community and candidness about her own transition journey, which was documented in the film Alexis Arquette: She's My Brother. Despite facing health challenges, including contracting HIV in 1987 and later health complications, Arquette continued to be an active figure in entertainment and advocacy, until her death in 2016 aged 47.\n\nDescription above from the Wikipedia article Alexis Arquette, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1969-07-28",
        "deathday": "2016-09-11",
        "gender": 1,
        "homepage": null,
        "id": 19578,
        "imdb_id": "nm0000793",
        "known_for_department": "Acting",
        "name": "Alexis Arquette",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.7766,
        "profile_path": "/jNRBwGKXOZFWLI2ceff1sMUdxcE.jpg"
    }
}