{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/pZVrDhIPF30JTRSkal2Lfk7NwrI.jpg",
                "genre_ids": [
                    18,
                    27,
                    53
                ],
                "id": 31417,
                "original_language": "fr",
                "original_title": "Les Yeux sans visage",
                "overview": "Dr. Génessier is riddled with guilt after an accident that he caused disfigures the face of his daughter, the once beautiful Christiane, who outsiders believe is dead. Dr. Génessier, along with accomplice and laboratory assistant Louise, kidnaps young women and brings them to the Génessier mansion. After rendering his victims unconscious, Dr. Génessier removes their faces and attempts to graft them on to Christiane's.",
                "popularity": 1.6113,
                "poster_path": "/8y7Z9Gvcq52uOlJlUWyn2epGGRd.jpg",
                "release_date": "1960-01-11",
                "title": "Eyes Without a Face",
                "video": false,
                "vote_average": 7.573,
                "vote_count": 764,
                "character": "Police inspector",
                "credit_id": "52fe447c9251416c91012653",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/kKsy8sCjfOtfHPBT2i8z13bIRij.jpg",
                "genre_ids": [
                    80,
                    18,
                    35
                ],
                "id": 8073,
                "original_language": "fr",
                "original_title": "Bande à part",
                "overview": "Cinephile slackers Franz and Arthur spend their days mimicking the antiheroes of Hollywood noirs and Westerns while pursuing the lovely Odile. The misfit trio upends convention at every turn, be it through choreographed dances in cafés or frolicsome romps through the Louvre. Eventually, their romantic view of outlaws pushes them to plan their own heist, but their inexperience may send them out in a blaze of glory -- which could be just what they want.",
                "popularity": 1.8025,
                "poster_path": "/9oqyj79xmcypxLajJdefOtrYx64.jpg",
                "release_date": "1964-08-05",
                "title": "Band of Outsiders",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 586,
                "character": "Arthur",
                "credit_id": "52fe4491c3a36847f809d731",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Claude Espinasse",
            "Клод Брассер",
            "Клод Брассёр"
        ],
        "biography": "Claude Brasseur was born in Neuilly-sur-Seine as Claude Pierre Espinasse, the son of actor Pierre Brasseur and actress Odette Joyeux. He was the godson of Ernest Hemingway and the father of Alexandre Brasseur.\n\nHe was a member of the French bobsleigh team in the 60s and also a winning Paris-Dakar rally competitor, as co-pilot of Jacky Ickx.\n\nFrom the late 1950s until two years before his death, Brasseur appeared in overall 150 film and television productions. One of his film roles was as Arthur in Jean-Luc Godard's Bande à part (1964). Brasseur played the title role in the early 1970s historical crime television series The New Adventures of Vidocq. A big commerical success were the comedies La Boum (1980) and La Boum 2 (1982), in which he played the father of Sophie Marceau's teenage character.\n\nHe died on 22 December 2020, at the age of 84.",
        "birthday": "1936-06-15",
        "deathday": "2020-12-22",
        "gender": 2,
        "homepage": null,
        "id": 1958,
        "imdb_id": "nm0105475",
        "known_for_department": "Acting",
        "name": "Claude Brasseur",
        "place_of_birth": "Neuilly-sur-Seine, Hauts-de-Seine, France",
        "popularity": 0.248,
        "profile_path": "/oegptKdlPbpiDNL89jWUBh8jkDT.jpg"
    }
}