{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bodTQ7K68AopK2uQumsrSVT9g4A.jpg",
                "genre_ids": [
                    35,
                    10752
                ],
                "id": 8290,
                "original_language": "fr",
                "original_title": "La Grande Vadrouille",
                "overview": "During World War II, two French civilians and a downed British Bomber Crew set out from Paris to cross the demarcation line between Nazi-occupied Northern France and the South. From there they will be able to escape to England. First, they must avoid German troops – and the consequences of their own blunders.",
                "popularity": 2.3452,
                "poster_path": "/91l4Sf3WJwrb0tSVPsOqnBXG8E6.jpg",
                "release_date": "1966-12-08",
                "title": "Don't Look Now... We're Being Shot At!",
                "video": false,
                "vote_average": 7.934,
                "vote_count": 1402,
                "character": "Aircraftman Alan MacIntosh, Royal Air Force",
                "credit_id": "52fe449dc3a36847f80a02a3",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/kB9Y59YDMOFdm5LgSyTVj4b6hh6.jpg",
                "genre_ids": [
                    28,
                    53
                ],
                "id": 4909,
                "original_language": "en",
                "original_title": "The Day of the Jackal",
                "overview": "An international assassin known as ‘The Jackal’ is employed by disgruntled French generals to kill President Charles de Gaulle, with a dedicated gendarme on the assassin’s trail.",
                "popularity": 6.0815,
                "poster_path": "/vThgcb3JOj99yETg8WChuci4LV2.jpg",
                "release_date": "1973-05-16",
                "title": "The Day of the Jackal",
                "video": false,
                "vote_average": 7.541,
                "vote_count": 631,
                "character": "Gendarme at Tulle",
                "credit_id": "5dc67b3b9c24fc0018c0f8d7",
                "order": 51
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Michael Marshall ",
            "Майк Маршалл"
        ],
        "biography": "Michael Marshall (September 13, 1944 – June 2, 2005) was a French American actor.\n\nMarshall was born in Cedars-Sinai Medical Center, a hospital in Hollywood on September 13, 1944. When his parents divorced, his father made sure that he received an American education. He began studying law, but dreamed of becoming an actor. He later joined his mother in Paris. Marshall began to take drama classes from Raymond Griard and later directed his first film, Potato, in France under the direction of Robert Thomas, adapted from the play's eponymous Marcel Achard. He had already appeared in two films from overseas, the first was directed by his father, and the second by Vincente Minnelli. Gérard Oury, Marshall's step-father, offered him a role of a young Canadian airman in La Grande Vadrouille, as a doctor in Le Coup du parapluie. Marshall had a long, low-key career as a character actor in French cinema. On stage he starred in Croque-monsieur, Le Vallon, and Point de feu sans fumée. Marshall has also appeared in several television series.\n\nHe was the only child of American actor-director William Marshall and French actress Michèle Morgan and was the stepson of Gérard Oury as well as half-brother to Tonie Marshall. Marshall fathered six children. He died in Caen, France, aged 60, survived by his mother.\n\nSource: Article \"Mike Marshall (actor)\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1944-09-13",
        "deathday": "2005-06-02",
        "gender": 2,
        "homepage": null,
        "id": 19613,
        "imdb_id": "nm0551062",
        "known_for_department": "Acting",
        "name": "Mike Marshall",
        "place_of_birth": "Hollywood, Los Angeles, California, USA",
        "popularity": 0.189,
        "profile_path": "/lfQlTpasMJZQaAht6IE21dvAeuv.jpg"
    }
}