{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8mnXR9rey5uQ08rZAvzojKWbDQS.jpg",
                "genre_ids": [
                    16,
                    28,
                    12,
                    878
                ],
                "id": 324857,
                "original_language": "en",
                "original_title": "Spider-Man: Into the Spider-Verse",
                "overview": "Struggling to find his place in the world while juggling school and family, Brooklyn teenager Miles Morales is unexpectedly bitten by a radioactive spider and develops unfathomable powers just like the one and only Spider-Man. While wrestling with the implications of his new abilities, Miles discovers a super collider created by the madman Wilson \"Kingpin\" Fisk, causing others from across the Spider-Verse to be inadvertently transported to his dimension.",
                "popularity": 14.1819,
                "poster_path": "/iiZZdoQBEYBv6id8su7ImL0oCbD.jpg",
                "release_date": "2018-12-06",
                "title": "Spider-Man: Into the Spider-Verse",
                "video": false,
                "vote_average": 8.396,
                "vote_count": 16440,
                "character": "Tombstone (voice)",
                "credit_id": "5c065642c3a3685c370d72a0",
                "order": 21
            },
            {
                "adult": false,
                "backdrop_path": "/n2eUT4zQA2yYcKOgAFidgOyiFoH.jpg",
                "genre_ids": [
                    18,
                    37
                ],
                "id": 68718,
                "original_language": "en",
                "original_title": "Django Unchained",
                "overview": "With the help of a German bounty hunter, a freed slave sets out to rescue his wife from a brutal Mississippi plantation owner.",
                "popularity": 12.4836,
                "poster_path": "/7oWY8VDWW7thTzWh3OKYRkWUlD5.jpg",
                "release_date": "2012-12-25",
                "title": "Django Unchained",
                "video": false,
                "vote_average": 8.184,
                "vote_count": 27058,
                "character": "Red Louis (uncredited)",
                "credit_id": "67bb1488a4bf1c1928bedccb",
                "order": 115
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Krondon",
            "Marvin \"Krondon\" Jones III"
        ],
        "biography": "Marvin Jones III (born July 9, 1976), also known as Krondon, is an American rapper and actor from Los Angeles, California. He is a member of the group Strong Arm Steady, along with rappers Phil Da Agony and Mitchy Slick. As an actor Jones portrays the character Tobias Whale in The CW superhero television series Black Lightning, and voices Tombstone in the superhero film Spider-Man: Into the Spider-Verse.\n\nStrong Arm Steady formed in 2003, and released its debut album Deep Hearted in 2007 followed by the mixtape Gang Mentality, the conceptual album In Search of Stoney Jackson and their most recent installment, Arms & Hammers. Krondon's debut album, Everything’s Nothing, came out in 2013. Krondon collaborated with Shafiq Husayn (Sa-Ra Creative Partners) under the group name White Boiz, releasing the 2015 album Neighborhood Wonderful on Stones Throw Records.\n\nKrondon also ghostwrites for other rappers, such as Snoop Dogg, Dr. Dre, and Xzibit. Krondon maintains a friendship with Bishop T. D. Jakes and fellow actor Mahershala Ali. Jones grew up in South Central, Los Angeles. He is an African American with albinism.",
        "birthday": "1976-07-09",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1962692,
        "imdb_id": "nm3993304",
        "known_for_department": "Acting",
        "name": "Marvin Jones III",
        "place_of_birth": "California, USA",
        "popularity": 0.3072,
        "profile_path": "/nS4X8TP3idFsxDdV9UqTRbz585g.jpg"
    }
}