{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lD8dFIk9wDEvOwZw0RB47e346io.jpg",
                "genre_ids": [
                    10749,
                    18,
                    37
                ],
                "id": 698508,
                "original_language": "en",
                "original_title": "Redeeming Love",
                "overview": "A retelling of the biblical book of Hosea set against the backdrop of the California Gold Rush of 1850.",
                "popularity": 11.871,
                "poster_path": "/pDc2HxQtC0MlKD4QfRvmKREEyhc.jpg",
                "release_date": "2022-01-21",
                "title": "Redeeming Love",
                "video": false,
                "vote_average": 7.859,
                "vote_count": 651,
                "character": "Lucky",
                "credit_id": "5fa881a2c68b69003fa6d15c",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jamie-Lee O’Donnell"
        ],
        "biography": "Jamie-Lee O'Donnell is an actress known for her role as Michelle Mallon in Channel 4’s comedy series, Derry Girls.\n\nO’Donnell was born on 4 March 1987 in Derry, Northern Ireland. She attended St Anne's Primary School, St Cecilia's College, and North West Regional College.\n\nShe began acting at a young age in school plays. Upon graduation, she decided to pursue it professionally despite not being able to afford drama school. She instead studied performing arts at the De Montfort University campus in Bedfordshire, but did not complete the course. She began auditioning and dividing her time between England and home, taking part in theatrical productions and working as a dancer for promotions and pantomimes. She moved around in search of employment, also working as a barista and at one point taking on a corner shop, which failed as a business.\n\nBetween 2012 and 2015, O'Donnell played her first significant role as Eva Maguire, one of the main characters of the BBC2 NI series 6Degrees, after the end of which she took part in the film Urban & the Shed Crew, by Candida Brady.\n\nIn 2018, she starred in a theatre production I Told My Mum I Was Going on an RE Trip, by Julia Samuels, playing an underage girl who decides to undergo an abortion. The following year, she joined the cast of Girls and Dolls, a play by the Derry Girls creator Lisa McGee,[8] and acted in Martin McDonagh's The Cripple of Inishmaan at the Gaiety Theatre.\n\nO'Donnell landed the role of Michelle Mallon in Derry Girls, a sitcom by Channel 4, which gained international fame. Of her role as Michelle, she says, \"Michelle really thinks she's maybe just a bit too big for the place she was born in and she's ready to take on the world one swearword at a time. She's really feisty, really ballsy, doesn't really care about authority, just sort of up for anything and up for a laugh.\"\n\nO'Donnell and her fellow Derry Girls co-stars participated in the RTÉ fundraising special RTÉ Does Comic Relief, performing a sketch alongside Saoirse Ronan. All proceeds from the night went towards those affected by the COVID-19 pandemic.\n\nShe is a patron of the Liverpool-based youth theatre company 20 Stories High.",
        "birthday": "1987-03-04",
        "deathday": null,
        "gender": 1,
        "homepage": "https://theartistspartnership.co.uk/artist/jamie-lee-odonnell/",
        "id": 1963195,
        "imdb_id": "nm5324035",
        "known_for_department": "Acting",
        "name": "Jamie Lee O'Donnell",
        "place_of_birth": "Derry, Northern Ireland, UK",
        "popularity": 0.2484,
        "profile_path": "/irjGRKMiln023Y4Yvsqc7CYpnar.jpg"
    }
}