{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uO7N3fDn3nWSPiuJaau834QD1Gr.jpg",
                "genre_ids": [
                    80,
                    18,
                    53
                ],
                "id": 7291,
                "original_language": "fr",
                "original_title": "36 quai des Orfèvres",
                "overview": "In Paris, two cops are competing for the vacant job of chief of police, in the middle of the search for a gang of violent thieves. The movie is directed by Olivier Marchal, a former police officer who spent 12 years with the French police before creating this story, taken in part from real events of the 1980s.",
                "popularity": 2.2047,
                "poster_path": "/8TGPyv6wUg6zpJe0XfBf4pPwI2y.jpg",
                "release_date": "2004-11-24",
                "title": "36th Precinct",
                "video": false,
                "vote_average": 6.902,
                "vote_count": 617,
                "character": "Manou Berliner",
                "credit_id": "52fe4477c3a36847f8097b91",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "M.H. Demongeot",
            "Marielle Demongeot",
            "Mylène Nicole",
            "Mylène-Nicole Demongeot",
            "Marie-Hélène Demongeot ",
            "Милен Демонжо"
        ],
        "biography": "Mylène Demongeot (born Marie-Hélène Demongeot; 29 September 1935 – 1 December 2022) was a French film, television and theatre actress and author with a career spanning seven decades and more than 100 credits in French, Italian, English and Japanese speaking productions. Demongeot became a star at age 21 with her portrayal of Abigail Williams in The Crucible (1957) which garnered her a BAFTA Award for Most Promising Newcomer to Leading Film Roles nomination and the best actress prize at the socialist Karlovy Vary International Film Festival. Some other notable film roles include Elsa in Otto Preminger's Bonjour Tristesse (1958), alongside Deborah Kerr and David Niven, and as Milady de Winter in Les Trois Mousquetaires (1961).\n\nA \"veteran of cinema\" who started as one of the blond sex symbols of the 1950s and 1960s, she managed to avoid typecasting by exploring many film genres including thrillers, westerns, comedies, swashbucklers, period films and even pepla, such as Romulus and the Sabines (1961) opposite Roger Moore or Gold for the Caesars (1963).\n\nDemongeot also has a cult following based on the Fantomas trilogy, as Hélène Gurn opposite Louis de Funès and Jean Marais: Fantômas (1964), Fantômas Unleashed (1965) and Fantômas Against Scotland Yard (1967). Thirty years later, she starred again in another one of France's most successful comedy trilogies as Madame Pic in Fabien Onteniente's Camping (2006), Camping 2 (2010) and Camping 3 (2016).\n\nShe was twice nominated for Best Supporting Actress at the César Awards for 36 Quai des Orfèvres (2004) and French California (2006). In 2007, she was made a Commander of the Ordre des Arts et de Lettres of the French Republic. In 2017, she was inducted into the Légion d'Honneur by ethologist and neurologist Boris Cyrulnik, with the rank of Chevalier.\n\nShe remained popular until her passing from peritoneal cancer. At the time of her death, she was starring in Thomas Gilou's film Maison de retraite (2022) alongside Gérard Depardieu, one of the biggest box office hits of 2022 in France. Through an Élysée Palace official tribune, President Emmanuel Macron paid a long tribute to her which included : \"we salute the career of a great figure in the French Seventh Art, who knew how to shine in all its genres to move all French people\".\n\nDemongeot was born in September 1935 in Nice, Alpes-Maritimes, the daughter and only child of Alfred Jean Demongeot, born Nice, 30 January 1897 (himself the son of Marie Joseph Marcel Demongeot, career soldier, and Clotilde Faussonne di Clavesana, an Italian contessa) and Claudia Troubnikova, born 17 May 1904 in Kharkiv (Ukraine, Russian Empire). Her parents, both actors themselves, had met in Shanghai, China, where her half-brother, Léonid Ivantov, from the first marriage of her mother, was born, in Harbin on 17 December 1923.\n\nLike hundreds of other major European figures of stage and screen, she trained at the 'Cours Simon' in Paris where her classmates included Jean-Pierre Cassel, Claude Berri and Guy Bedos. She was a classically trained pianist and her first ambition was of becoming a professional. ...\n\nSource: Article \"Mylène Demongeot\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1935-09-29",
        "deathday": "2022-12-01",
        "gender": 1,
        "homepage": null,
        "id": 19646,
        "imdb_id": "nm0218634",
        "known_for_department": "Acting",
        "name": "Mylène Demongeot",
        "place_of_birth": "Nice, Alpes-Maritimes, France",
        "popularity": 0.457,
        "profile_path": "/5Wg8Rrplr4k7LWHSsTadJlDV7C6.jpg"
    }
}