{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fHDvGGPFry65ou79WLi6JsjCZrM.jpg",
                "genre_ids": [
                    35
                ],
                "id": 632856,
                "original_language": "en",
                "original_title": "Spirited",
                "overview": "Each Christmas Eve, the Ghost of Christmas Present selects one dark soul to be reformed by a visit from three spirits. But this season, he picked the wrong Scrooge. Clint Briggs turns the tables on his ghostly host until Present finds himself reexamining his own past, present and future.",
                "popularity": 3.1287,
                "poster_path": "/h3zAzTMs5EP3cKusOxFNGSFE1WI.jpg",
                "release_date": "2022-11-10",
                "title": "Spirited",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 676,
                "character": "Dancer",
                "credit_id": "67fbfe57ec22ba3b49d9579d",
                "order": 92
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Adam Kaplan was most recently seen as Gary on the new MAX series The Girls on the Bus. Other film and TV credits include Simon Lovewell on the acclaimed TV series The Big Leap (Fox/Hulu), Chad in Up Here (Hulu), Elsbeth (CBS), the feature film Somewhere In Queens (directed by Ray Romano), and Deception (ABC). He starred on Broadway in A Bronx Tale, directed by Robert De Niro and Jerry Zaks, opposite Academy Award nominee Chazz Palminteri. Other Broadway/National Tours: Kinky Boots (Charlie Price), Newsies (Jack Kelly u/s), Show Boat (NY Philharmonic and PBS). Shows regionally at Lyric of Opera of Chicago, Goodspeed, Flat Rock Playhouse and Music Theatre Wichita. Numerous concerts and productions internationally and across the US, including a solo performance for the Obamas at the White House. Adam is a proud alumni of Elon University (BFA Music Theatre). In addition to performing, Adam teaches around the country serving as a mentor for young artists.",
        "birthday": "1991-08-09",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.adamkaplanonline.com/",
        "id": 1967240,
        "imdb_id": "nm6271936",
        "known_for_department": "Acting",
        "name": "Adam Kaplan",
        "place_of_birth": "Westport, Connecticut, USA",
        "popularity": 0.0894,
        "profile_path": "/uM6US9RMC97vL5Qu4Q578KMnOIB.jpg"
    }
}