{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ufUAOM5aVizNf8d5YLoutqrrlhq.jpg",
                "genre_ids": [
                    878,
                    28,
                    12,
                    53
                ],
                "id": 336843,
                "original_language": "en",
                "original_title": "Maze Runner: The Death Cure",
                "overview": "Thomas leads his group of escaped Gladers on their final and most dangerous mission yet. To save their friends, they must break into the legendary Last City, a WCKD-controlled labyrinth that may turn out to be the deadliest maze of all. Anyone who makes it out alive will get answers to the questions the Gladers have been asking since they first arrived in the maze.",
                "popularity": 8.2843,
                "poster_path": "/drbERzlA4cuRWhsTXfFOY4mRR4f.jpg",
                "release_date": "2018-01-10",
                "title": "Maze Runner: The Death Cure",
                "video": false,
                "vote_average": 7.095,
                "vote_count": 8098,
                "character": "Nurse",
                "credit_id": "5a6faf04c3a36847f4006f9c",
                "order": 23
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Liza Scholtz is a film and television actress and writer born in Cape Town, South Africa. Liza studied acting for screen at The South African School of Motion Picture Medium & Live Performance (AFDA) in Cape Town. Where she completed her honors cum laude. Liza made her debut leading film role as Tatianna in the award winning feature film High Fantasy, which she also co-wrote. High Fantasy won the best feature film award at The Durban international film festival and had its world premier at The Toronto Film Festival. In 2021 Liza was invited by celebrated theatre director Brett Bailey to showcase her one woman poetry performance piece, at the acclaimed Constallations show. Liza can also be seen in Sapio Expo as Cass, Trackers as Ms Shah, Anna in the psychological thriller The Good Madam, Melinda Vargas in American Monsters, Bernice Myers in Origins, (The journey of Humankind), Lisa in the Sci-Fi South African comedy Die Vlieende Springbokkie, and the Nurse in The Maze Runner.",
        "birthday": "1991-10-14",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1969122,
        "imdb_id": "nm9220554",
        "known_for_department": "Acting",
        "name": "Liza Scholtz",
        "place_of_birth": "Cape Town, South Africa",
        "popularity": 0.9527,
        "profile_path": "/cE6Xz4xxUyEMKO2xqeGNL5g5w7Q.jpg"
    }
}