{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5nkKy7eEDsXqsxFLJy3GxZhE90J.jpg",
                "genre_ids": [
                    16,
                    14,
                    18,
                    12
                ],
                "id": 476292,
                "original_language": "ja",
                "original_title": "さよならの朝に約束の花をかざろう",
                "overview": "Maquia is a member of a special race called the Iorph who can live for hundreds of years. However, Maquia has always felt lonely despite being surrounded by her people, as she was orphaned from a young age. She daydreams about the outside world, but dares not travel from her home due to the warnings of the clan's chief.  One day the kingdom of Mezarte invades her homeland. They already have what is left of the giant dragons, the Renato, under their control, and now their king wishes to add the immortality to his bloodline.  They ravage the Iorph homeland and kill most of its inhabitants. Caught in the midst of the attack, Maquia is carried off by one of the Renato. It soon dies, and she is left deserted in a forest, now truly alone save for the cries of a single baby off in the distance. Maquia finds the baby in a destroyed village and decides to raise him as her own, naming him Ariel. Although she knows nothing of the human world, how to raise a child that ages much faster than her.",
                "popularity": 2.59,
                "poster_path": "/hL3NqRE2ccR4Y2sYSJTrmalRjrz.jpg",
                "release_date": "2018-02-24",
                "title": "Maquia: When the Promised Flower Blooms",
                "video": false,
                "vote_average": 8.183,
                "vote_count": 667,
                "character": "Soldier (voice)",
                "credit_id": "646f7c4771ffdf0148e05a2c",
                "order": 33
            },
            {
                "adult": false,
                "backdrop_path": "/xPpXYnCWfjkt3zzE0dpCNME1pXF.jpg",
                "genre_ids": [
                    16,
                    28,
                    14,
                    53
                ],
                "id": 635302,
                "original_language": "ja",
                "original_title": "劇場版「鬼滅の刃」無限列車編",
                "overview": "Tanjiro Kamado, joined with Inosuke Hashibira, a boy raised by boars who wears a boar's head, and Zenitsu Agatsuma, a scared boy who reveals his true power when he sleeps, boards the Infinity Train on a new mission with the Fire Hashira, Kyojuro Rengoku, to defeat a demon who has been tormenting the people and killing the demon slayers who oppose it!",
                "popularity": 40.849,
                "poster_path": "/h8Rb9gBr48ODIwYUttZNYeMWeUU.jpg",
                "release_date": "2020-10-16",
                "title": "Demon Slayer -Kimetsu no Yaiba- The Movie: Mugen Train",
                "video": false,
                "vote_average": 8.204,
                "vote_count": 4219,
                "character": "(voice)",
                "credit_id": "5f89bf6ba1353300351347c3",
                "order": 25
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "かさま じゅん",
            "笠間 淳"
        ],
        "biography": "Jun Kasama (笠間 淳, Kasama Jun, April 10) is a Japanese voice actor (seiyū) from Hiroshima Prefecture. He is affiliated with Haikyō. He speaks the Hiroshima dialect. His hobby is basketball.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://haikyo.co.jp/profile/profile.php?ActorID=12608",
        "id": 1971814,
        "imdb_id": "nm7658991",
        "known_for_department": "Acting",
        "name": "Jun Kasama",
        "place_of_birth": "Hiroshima, Japan",
        "popularity": 0.3142,
        "profile_path": "/x9H1klv1RrXaqyXAECx1rb56LFH.jpg"
    }
}