{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3EJJClmGZwu7e6nsj1l0OBNdXfT.jpg",
                "genre_ids": [
                    35
                ],
                "id": 33701,
                "original_language": "fr",
                "original_title": "Les Bronzés font du ski",
                "overview": "In this sequel to Les Bronzes (1978) summer has passed, but that doesn't mean the fun has to end for Bernard, Nathalie, Gigi, Jerome, Popeye, Jean-Claude, and Christiane.",
                "popularity": 2.0673,
                "poster_path": "/uTN0bp8yMUKesNTLXR1GnL2kLFs.jpg",
                "release_date": "1979-11-22",
                "title": "French Fried Vacation 2",
                "video": false,
                "vote_average": 7.344,
                "vote_count": 1233,
                "character": "Christiane",
                "credit_id": "52fe45319251416c9102a747",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/izUQSU7tCcx0k4xU3VARcKqy3pn.jpg",
                "genre_ids": [
                    35
                ],
                "id": 22826,
                "original_language": "it",
                "original_title": "Il mostro",
                "overview": "A vicious serial sex killer is on the loose, and landscape gardener and shop-window outfitter Loris is the prime suspect, thanks to his unfortunate habit of getting caught in compromising situations (for which there is always a totally innocent explanation that the police fail to spot). Undercover policewoman Jessica is assigned by eccentric police psychologist Taccone to follow Loris.",
                "popularity": 1.5063,
                "poster_path": "/6h6ahipPd84QcyFbnsEikLt7w3Z.jpg",
                "release_date": "1994-10-22",
                "title": "The Monster",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 621,
                "character": "Jolanda Taccone",
                "credit_id": "577cfd849251413b3e00293c",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Dominique Lavanan"
        ],
        "biography": "Dominique Lavanant (born 24 May 1944) is a César Award-winning French film and theatrical actress. She is known for her comedy skills especially with posh and distinguished characters like Rosalind Russell's; characters often defined by the adjective BCBG, bon chic bon genre, and which refers to a particular stereotype of the French upper middle class – to be conservative in both outlook and dress.\n\nDominique Lavanant achieved fame in the mid-1970s while filming Les bronzés with the acting troupe Le Splendid (Gérard Jugnot, Josiane Balasko, Michel Blanc, Thierry Lhermitte, Christian Clavier, Marie-Anne Chazel).Her stardom has kept growing ever since.\n\nHer filmography includes many successful films: Papy fait de la résistance, La boum, Trois hommes et un couffin, Les bronzés font du ski, Inspecteur la Bavure (alongside Gérard Depardieu).\n\nIn 1988, she was awarded Best supporting actress for her role in Agent trouble (with Catherine Deneuve).\n\nShe also starred in the long-lasting French TV series Sœur Thérèse.com (2002-2011) playing a former policer who became a nun but is still a committed detective.\n\nSource: Article \"Dominique Lavanant\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1944-05-24",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1972,
        "imdb_id": "nm0491763",
        "known_for_department": "Acting",
        "name": "Dominique Lavanant",
        "place_of_birth": "Morlaix, Finistère, France",
        "popularity": 0.1747,
        "profile_path": "/oXbT6gzZSJ7LSFr0L1n3TzW7Nfa.jpg"
    }
}