{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/42mSR48e4h6Zp5BkTUyWPYsAA1X.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 1883,
                "original_language": "en",
                "original_title": "Malcolm X",
                "overview": "A tribute to the controversial black activist and leader of the struggle for black liberation. He hit bottom during his imprisonment in the '50s, he became a Black Muslim and then a leader in the Nation of Islam. His assassination in 1965 left a legacy of self-determination and racial pride.",
                "popularity": 7.2691,
                "poster_path": "/o2s9ow0uRRm1BcF3teznk5twd90.jpg",
                "release_date": "1992-11-18",
                "title": "Malcolm X",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 1773,
                "character": "Elijah Muhammad",
                "credit_id": "52fe431dc3a36847f803b6fd",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Al Freeman",
            "Albert Cornelius Freeman Jr.",
            "Albert C. Freeman Jr."
        ],
        "biography": "Al Freeman, Jr. (March 21, 1934 – August 9, 2012) was an American actor and director. Freeman made appearances in many films, such as My Sweet Charlie, Finian's Rainbow, and Malcolm X, and television series such as The Cosby Show, Law & Order, Homicide: Life on the Street and The Edge of Night.  He is mostly recognized for his portrayal of Police Captain Ed Hall on the ABC soap opera, One Life to Live, a role he played from 1972 through 1985, with recurring roles in 1988 and 2000. He won a Daytime Emmy Award for Outstanding Lead Actor in a Drama Series for that role, the first African-American actor to be so honored. He left the show briefly to appear in the network's controversial sitcom Hot L Baltimore. During that period, \"Ed\" was played by another actor, Arthur Pendleton. He was also a director of One Life to Live, and was one of the first, if not the first, African-Americans to direct a soap opera.\n\nAfter leaving One Life to Live, Freeman appeared in the motion picture Down in the Delta. His Broadway theatre credits include Look to the Lilies, Blues for Mister Charlie, and Medea. His portrayal of Nation of Islam leader Elijah Muhammad in the motion picture Malcolm X earned him the 1995 NAACP Image Award for Outstanding Supporting Actor in a Motion Picture. Coincidently, he had previously played Malcolm X in the 1979 miniseries, Roots: The Next Generations.\n\nFreeman also taught acting as a professor at Howard University in Washington, D.C..\n\nDescription above from the Wikipedia article Al Freeman, Jr., licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1934-03-21",
        "deathday": "2012-08-09",
        "gender": 2,
        "homepage": null,
        "id": 19739,
        "imdb_id": "nm0293272",
        "known_for_department": "Acting",
        "name": "Al Freeman Jr.",
        "place_of_birth": "San Antonio, Texas, USA",
        "popularity": 0.4626,
        "profile_path": "/qLnfxKvvbjDRtFHDgGS1U9KC9SO.jpg"
    }
}