{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/n1Gh3MJAVvXmkgSDf3SOLlPCjag.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749
                ],
                "id": 9390,
                "original_language": "en",
                "original_title": "Jerry Maguire",
                "overview": "Jerry Maguire used to be a typical sports agent: willing to do just about anything he could to get the biggest possible contracts for his clients, plus a nice commission for himself. Then, one day, he suddenly has second thoughts about what he's really doing. When he voices these doubts, he ends up losing his job and all of his clients, save Rod Tidwell, an egomaniacal football player.",
                "popularity": 4.6233,
                "poster_path": "/lABvGN7fDk5ifnwZoxij6G96t2w.jpg",
                "release_date": "1996-12-13",
                "title": "Jerry Maguire",
                "video": false,
                "vote_average": 6.971,
                "vote_count": 3483,
                "character": "Mike Tirico",
                "credit_id": "60feef27db72c0005d7f7d1d",
                "order": 96
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Michael Todd Tirico"
        ],
        "biography": "Michael Todd Tirico (born December 13, 1966) is an American sportscaster. He is currently the lead play-by-play announcer for NBC Sunday Night Football, having replaced Al Michaels in 2022, and is set to become the lead play-by-play announcer for NBC's NBA coverage in 2025. Tirico is also the primary primetime host for the Olympics on NBC and the host of Triple Crown races on NBC.  From 1997 to 2006, Tirico served as lead announcer for the PGA Tour on ABC. From 2006 to 2015, Tirico served as a play-by-play announcer on ESPN's Monday Night Football. Tirico has called a multitude of sports in his career, including the NBA, NHL, college football and basketball, golf, tennis, and World Cup soccer.\n\nDescription above from the Wikipedia article Mike Tirico, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1966-12-13",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 1975053,
        "imdb_id": "nm0864237",
        "known_for_department": "Acting",
        "name": "Mike Tirico",
        "place_of_birth": "Whitestone, Queens, New York, USA",
        "popularity": 0.1389,
        "profile_path": "/pMnRiRTwK7Lpp82Oe5rSfLPsVbz.jpg"
    }
}