{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uif5fUshJrXyyDzfpzp1DLw3N0S.jpg",
                "genre_ids": [
                    27,
                    53,
                    9648
                ],
                "id": 539,
                "original_language": "en",
                "original_title": "Psycho",
                "overview": "When larcenous real estate clerk Marion Crane goes on the lam with a wad of cash and hopes of starting a new life, she ends up at the notorious Bates Motel, where manager Norman Bates cares for his housebound mother.",
                "popularity": 8.4504,
                "poster_path": "/yz4QVqPx3h1hD1DfqqQkCq3rmxW.jpg",
                "release_date": "1960-06-22",
                "title": "Psycho",
                "video": false,
                "vote_average": 8.422,
                "vote_count": 10504,
                "character": "Mrs. Chambers",
                "credit_id": "52fe424fc3a36847f801427d",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/6L1Co3uRWuoaqDxpWvGDvgXms7T.jpg",
                "genre_ids": [
                    18
                ],
                "id": 976,
                "original_language": "en",
                "original_title": "Sweet Smell of Success",
                "overview": "New York City newspaper writer J.J. Hunsecker holds considerable sway over public opinion with his Broadway column, but one thing that he can't control is his younger sister, Susan, who is in a relationship with aspiring jazz guitarist Steve Dallas. Hunsecker strongly disapproves of the romance and recruits publicist Sidney Falco to find a way to split the couple, no matter how ruthless the method.",
                "popularity": 5.3575,
                "poster_path": "/akzvV8JasNrgEl5iAP9K6zPHGJe.jpg",
                "release_date": "1957-07-04",
                "title": "Sweet Smell of Success",
                "video": false,
                "vote_average": 7.61,
                "vote_count": 539,
                "character": "Loretta Bartha (uncredited)",
                "credit_id": "6346868a6a300b007d21e375",
                "order": 63
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Lorene Tuttle"
        ],
        "biography": "​From Wikipedia, the free encyclopedia.  \n\nLurene Tuttle (August 29, 1907, Pleasant Lake, Indiana - May 28, 1986, Encino, California) was a character actress, who made transitions from vaudeville to radio, to films and television. Her most enduring impact was as one of network radio's most versatile actresses. Often appearing in 15 shows a week, comedies, dramas, thrillers, soap operas, and crime dramas, and she became known as the First Lady of Radio.\n\nHeaven Only Knows (1947) was her first film. She went on to roles in other films such as Orson Welles's Macbeth (1948), Mr. Blandings Builds His Dream House (1948) and Alfred Hitchcock's Psycho (1960), as the wife of Sheriff Chambers. In Don't Bother to Knock (1952) she portrayed a mother who lets a disturbed Marilyn Monroe babysit her daughter. The next year she appeared again with Marilyn in Niagara, as Mrs. Kettering. She had a rare starring role in Ma Barker's Killer Brood (1960). She played Grandma Pusser in the original Walking Tall film trilogy, and also appeared in horror films such as The Manitou (1978), starring Tony Curtis. Her final film role was in the 1983 film Testament.  Tuttle became a familiar face to millions of television viewers with more than 100 appearances from 1950 to 1986, often in the role of an inquisitive busybody. On television and in films, Tuttle streamlined herself into a pattern of roles between wise, loving wives/mothers or bristling matrons. She was familiar to the early television audience as wife/mother Lavinia (Vinnie) Day in Life with Father (1953–1955). Columnist Hedda Hopper called the selection of Leon Ames as Father and Tuttle as Mother \"what I consider 22 carat casting with two all-Americans.\"\n\nDescription above from the Wikipedia article Lurene Tuttle, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1907-08-20",
        "deathday": "1986-05-28",
        "gender": 1,
        "homepage": null,
        "id": 19781,
        "imdb_id": "nm0878354",
        "known_for_department": "Acting",
        "name": "Lurene Tuttle",
        "place_of_birth": "Pleasant Lake, Indiana, USA",
        "popularity": 0.4648,
        "profile_path": "/t0dLpAfrSECNGjtGsGiO4SQquVW.jpg"
    }
}