{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/x1ZKRyvB7QAXfYVgf5mUJzjPqfH.jpg",
                "genre_ids": [
                    28,
                    12,
                    53
                ],
                "id": 575264,
                "original_language": "en",
                "original_title": "Mission: Impossible - Dead Reckoning Part One",
                "overview": "Ethan Hunt and his IMF team embark on their most dangerous mission yet: To track down a terrifying new weapon that threatens all of humanity before it falls into the wrong hands. With control of the future and the world's fate at stake and dark forces from Ethan's past closing in, a deadly race around the globe begins. Confronted by a mysterious, all-powerful enemy, Ethan must consider that nothing can matter more than his mission—not even the lives of those he cares about most.",
                "popularity": 16.5998,
                "poster_path": "/NNxYkU70HPurnNCSiCjYAmacwm.jpg",
                "release_date": "2023-07-08",
                "title": "Mission: Impossible - Dead Reckoning Part One",
                "video": false,
                "vote_average": 7.521,
                "vote_count": 4610,
                "character": "Osprey Agent",
                "credit_id": "64ab4f5c6a344800ad7648a5",
                "order": 44
            },
            {
                "adult": false,
                "backdrop_path": "/zRKQW58MBEY078AxkHxEJzUskCl.jpg",
                "genre_ids": [
                    878,
                    12
                ],
                "id": 438631,
                "original_language": "en",
                "original_title": "Dune",
                "overview": "Paul Atreides, a brilliant and gifted young man born into a great destiny beyond his understanding, must travel to the most dangerous planet in the universe to ensure the future of his family and his people. As malevolent forces explode into conflict over the planet's exclusive supply of the most precious resource in existence-a commodity capable of unlocking humanity's greatest potential-only those who can conquer their fear will survive.",
                "popularity": 17.784,
                "poster_path": "/d5NXSklXo0qyIYkgV94XAgMIckC.jpg",
                "release_date": "2021-09-15",
                "title": "Dune",
                "video": false,
                "vote_average": 7.781,
                "vote_count": 13924,
                "character": "Female Fremen",
                "credit_id": "5e35cc0c4ca676001a513c4a",
                "order": 28
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Gloria is a Rose-Bruford trained, award-winning actor.\n\nTheatre credits include Paradise (National Theatre), for which she won first prize in the Ian Charleson Awards 2022, The Clinic (Almeida Theatre), Next Please: The Keyworker’s Cycle (Almeida Theatre), Maryland (Royal Court), A Christmas Carol (Old Vic), Girl from the North Country (Gielgud), Anthony & Cleopatra (National Theatre), Fanny and Alexander (Old Vic). Most recently Gloria played Cordelia in Yael Farber’s production of King Lear at the Almeida; her performance was singled out for praise.\n\nTV and film credits include series 1 and 2 of Good Omens for BBC/Amazon, Murder is Easy for the BBC, Outlander for Starz, Eric opposite Benedict Cumberbatch for Netflix, the feature films High Life, appearing alongside Robert Pattinson and Juliette Binoche, Mission Impossible: Dead Reckoning and Dune. Gloria played a supporting lead role in The Road Trip for Paramount+ in 2024 and recurs in A Cruel Love: The Ruth Ellis Story, a four-part serial for ITV, released March 2025.\n\nWINNER – First prize, Ian Charleson Awards 2022",
        "birthday": "1995-09-21",
        "deathday": null,
        "gender": 1,
        "homepage": "https://bristololdvic.org.uk/profile/gloria-obianyo",
        "id": 1982903,
        "imdb_id": "nm7950698",
        "known_for_department": "Acting",
        "name": "Gloria Obianyo",
        "place_of_birth": "Lewisham, London, England, UK",
        "popularity": 0.7662,
        "profile_path": "/8vRsNhtxFzYsHQItIKwcMW9flts.jpg"
    }
}