{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zJDnqXtGNHUmexiaWNa52Vslve5.jpg",
                "genre_ids": [
                    18,
                    10749,
                    36
                ],
                "id": 1904,
                "original_language": "en",
                "original_title": "Memoirs of a Geisha",
                "overview": "In the years before World War II, a penniless Japanese child is torn from her family to work as a maid in a geisha house.",
                "popularity": 4.2618,
                "poster_path": "/9twKlPKD5Qd2EXX8lohW4zL8zQ8.jpg",
                "release_date": "2005-12-06",
                "title": "Memoirs of a Geisha",
                "video": false,
                "vote_average": 7.656,
                "vote_count": 3199,
                "character": "Young Pumpkin",
                "credit_id": "52fe4320c3a36847f803c41b",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Zoë Weizenbaum",
            "Zoe Ruth Weizenbaum"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nZoë Weizenbaum (born September 21, 1991) is an American child actress.\n\nWeizenbaum was born in Seattle, Washington to a Jewish American mother and a Chinese father and was raised in the Jewish religion. She grew up from the age of two in Amherst, Massachusetts. For years, African Dance was her primary love. She also enjoyed being part of Amherst's local musical theatre productions. She was called for an audition for Missing in America after someone saw her perform in a local production of Peter Pan. Since finishing this movie, she has also had principal roles in 12 and Holding, directed by Michael Cuesta, and in Memoirs of a Geisha, directed by Rob Marshall. Weizenbaum attended Amherst Regional High School for her freshman year before she decided to return to Pioneer Valley Performing Arts Charter Public School where she went to middle school and is currently a student. Zoe can speak Mandarin learning through the Rosetta Stone program, as well as enrolling in intensive Chinese courses at Mount Holyoke College and Middlebury College's Summer Intensive Language Program. As of fall of 2010, Zoe is attending Middlebury College and is currently studying Japanese.\n\nShe is the granddaughter of computer scientist Joseph Weizenbaum.\n\nDescription above from the Wikipedia article Zoe Weizenbaum, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1991-09-21",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 19858,
        "imdb_id": "nm1494624",
        "known_for_department": "Acting",
        "name": "Zoe Weizenbaum",
        "place_of_birth": "Seattle, Washington, U.S.",
        "popularity": 0.0589,
        "profile_path": "/uOjKw0CfWE9pkep2kSPfMICaiPT.jpg"
    }
}