{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zJDnqXtGNHUmexiaWNa52Vslve5.jpg",
                "genre_ids": [
                    18,
                    10749,
                    36
                ],
                "id": 1904,
                "original_language": "en",
                "original_title": "Memoirs of a Geisha",
                "overview": "In the years before World War II, a penniless Japanese child is torn from her family to work as a maid in a geisha house.",
                "popularity": 4.5752,
                "poster_path": "/9twKlPKD5Qd2EXX8lohW4zL8zQ8.jpg",
                "release_date": "2005-12-06",
                "title": "Memoirs of a Geisha",
                "video": false,
                "vote_average": 7.656,
                "vote_count": 3199,
                "character": "Mother",
                "credit_id": "52fe4320c3a36847f803c417",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/7qsKE8GsgjreeQ2mTLd5oKZ7Tbf.jpg",
                "genre_ids": [
                    28,
                    18,
                    36,
                    10752
                ],
                "id": 11953,
                "original_language": "ja",
                "original_title": "影武者",
                "overview": "Akira Kurosawa's lauded feudal epic presents the tale of a petty thief who is recruited to impersonate Shingen, an aging warlord, in order to avoid attacks by competing clans. When Shingen dies, his generals reluctantly agree to have the impostor take over as the powerful ruler. He soon begins to appreciate life as Shingen, but his commitment to the role is tested when he must lead his troops into battle against the forces of a rival warlord.",
                "popularity": 3.3775,
                "poster_path": "/fJgqj9s8HNZz9zwX6femVJn8HEB.jpg",
                "release_date": "1980-04-26",
                "title": "Kagemusha",
                "video": false,
                "vote_average": 7.829,
                "vote_count": 694,
                "character": "Otsuyanokata",
                "credit_id": "52fe44a99251416c7503c851",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "桃井 かおり",
            "モモイカオリ"
        ],
        "biography": "Kaori Momoi  (桃井 かおり, Momoi Kaori, born April 8, 1952 in Tokyo, Japan) is a Japanese actress.\n\nMomoi was born in Tokyo, and at the young age of 12 traveled to London to study dance at the Royal Ballet Academy. After 3 years she returned to Tokyo, later graduating from Japan's Bungakuza School of Dramatic Arts. In 1971, Momoi debuted in director Kon Ichikawa's Ai Futatabi (To Love Again) beginning a career that has already spanned 35 years and over 60 films.\n\nAs an actress, she has worked with some of the most notable films directors in Japan, including Akira Kurosawa (Kagemusha, 1980), Tatsumi Kumashiro (Seishun no Satetsu, 1974), Yoji Yamada (The Yellow Handkerchief, 1977 and Otoko wa Tsuraiyo, 1979), Shohei Imamura (Why Not?, 1981), Shunji Iwai (Swallowtail Butterfly, 1996), Jun Ichikawa (Tokyo Yakyoku, 1997), Mitani Koki (Welcome Back, Mr. McDonald, 1997), Yoshimitsu Morita (Like Asura, 2003) and, most recently, Takashi Miike (IZO, Sukiyaki Western Django).\n\nShe has also performed in The Sun (2005) directed by Alexander Sokurov and appeared in director Rob Marshall's film Memoirs of a Geisha.\n\nFor her film performances in Japan, Momoi has won many awards. She has won the Japanese Academy Awards for Best Actress twice and Best Supporting Actress once and was selected Best Actress at the 1983 New York International Film Festival for her role in Giwaku (Suspicion).\n\nPopular among Japanese of all ages and a recognized trend setter, Momoi is never idle, pursuing various projects in producing, directing, screenwriting, and design in addition to her acting. She has also released some 15 record albums as a singer and is a much sought after essayist.\n\nShe won the award for best actress at the 7th Hochi Film Award for Giwaku.\n\nHer latest movie is Maris Martinson's movie \"Amaya\", which was released on September 17, 2010.\n\nDescription above from the Wikipedia article Kaori Momoi, licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": "1952-04-08",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 19857,
        "imdb_id": "nm0597390",
        "known_for_department": "Acting",
        "name": "Kaori Momoi",
        "place_of_birth": "Tokyo, Japan",
        "popularity": 1.6335,
        "profile_path": "/909739lEJUtsUetp6nnyaT7Ez8H.jpg"
    }
}