{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zJDnqXtGNHUmexiaWNa52Vslve5.jpg",
                "genre_ids": [
                    18,
                    10749,
                    36
                ],
                "id": 1904,
                "original_language": "en",
                "original_title": "Memoirs of a Geisha",
                "overview": "In the years before World War II, a penniless Japanese child is torn from her family to work as a maid in a geisha house.",
                "popularity": 4.2618,
                "poster_path": "/9twKlPKD5Qd2EXX8lohW4zL8zQ8.jpg",
                "release_date": "2005-12-06",
                "title": "Memoirs of a Geisha",
                "video": false,
                "vote_average": 7.656,
                "vote_count": 3199,
                "character": "Chiyo",
                "credit_id": "52fe4320c3a36847f803c403",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "おおご すずか",
            "오오고 스즈카",
            "سوزوکا اوهگو"
        ],
        "biography": "Ohgo began acting in 2000 when she was seven, then she joined Sunflower (Himawari), which is a theatrical company. She debuted with the company at the Meiji-za in Story of a National Thief.\n\nIn early 2005, Ohgo debuted in her first major film, Kita No Zeronen (北の零年, a.k.a. Year One in the North), directed by Isao Yukisada, with the well-known actor Ken Watanabe, where she played the role of Tae Komatsubara. In December 2005, she debuted in Hollywood with Memoirs of a Geisha, directed by Rob Marshall, where she played Sakamoto Chiyo, the child version of the main protagonist Nitta Sayuri (the adult version is played by Chinese actress Zhang Ziyi). During the same year, she also won the Japan Film Critics Award for Best Newcomer.\n\nIn 2006, Ohgo also starred in Baruto no Gakuen (バルトの楽園, a.k.a. Symphony of Joy), which was released in June 2006 and is set during World War I, where she plays a girl of mixed German-Japanese heritage trying to find her German father who may be held there.\n\nIn 2008, she began lending her voice to anime in Michiko to Hatchin as Hana (AKA: \"Hatchin\"). She also provided the voice Kaita in Professor Layton and the Diabolical Box.\n\nShe worked at CATARMAN until 2013.",
        "birthday": "1993-08-05",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 19855,
        "imdb_id": "nm1797214",
        "known_for_department": "Acting",
        "name": "Suzuka Ohgo",
        "place_of_birth": "Yokohama, Japan",
        "popularity": 1.4263,
        "profile_path": "/9lnTlEwU7qeTUl9gSFADyKFZjbN.jpg"
    }
}