{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/pjlxrd646cBYznHoPBWTzz6FujX.jpg",
                "genre_ids": [
                    28,
                    878,
                    18
                ],
                "id": 39254,
                "original_language": "en",
                "original_title": "Real Steel",
                "overview": "Charlie Kenton is a washed-up fighter who retired from the ring when robots took over the sport. After his robot is trashed, he reluctantly teams up with his estranged son to rebuild and train an unlikely contender.",
                "popularity": 13.891,
                "poster_path": "/4GIeI5K5YdDUkR3mNQBoScpSFEf.jpg",
                "release_date": "2011-09-28",
                "title": "Real Steel",
                "video": false,
                "vote_average": 7.061,
                "vote_count": 8729,
                "character": "Tak Mashido",
                "credit_id": "52fe47079251416c91067dfb",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/zJDnqXtGNHUmexiaWNa52Vslve5.jpg",
                "genre_ids": [
                    18,
                    10749,
                    36
                ],
                "id": 1904,
                "original_language": "en",
                "original_title": "Memoirs of a Geisha",
                "overview": "In the years before World War II, a penniless Japanese child is torn from her family to work as a maid in a geisha house.",
                "popularity": 4.2618,
                "poster_path": "/9twKlPKD5Qd2EXX8lohW4zL8zQ8.jpg",
                "release_date": "2005-12-06",
                "title": "Memoirs of a Geisha",
                "video": false,
                "vote_average": 7.656,
                "vote_count": 3199,
                "character": "Koichi",
                "credit_id": "5f337ab2ef8b32003713d595",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Born and raised in Washington D.C., Karl Yune is an American actor of Asian descent. After high school, Karl successfully started and sold an internet based consulting business and was accepted to Columbia University as a business major. His studying and love of Shakespeare during a literature course influenced him to switch his major to theater at the University's School of the Arts. While at Columbia, Yune won the role of Romeo in an off Broadway production of Romeo and Juliet and was later signed to a talent manager. Karl continued to work as a theater actor in New York City and won critical and rave reviews for his performance as Gloucester in a contemporary rendition of Shakespeare's Richard the III. While casting The Last Samurai, director Edward Zwick was impressed with Yune's audition tape and Karl went to Los Angeles for the first time to meet with the famed director. Zwick later informed Karl that the studio was to cast the film out of Japan, but encouraged Karl to move to Los Angeles as he saw promise in the young actor's talent. Inspired, Karl moved to Los Angeles, only to learn that he was offered a five year contract back in New York, on the popular daytime TV drama All My Children. Yune passed on the offer and soon booked his first lead role in the cult film Anacondas: The Hunt for the Blood Orchid. The following year Karl was picked by producer Steven Spielberg to play the memorable role of Koichi, the secret lover to Li Gong's Geisha Hatsumomo, in Memoirs of a Geisha, based on the international best selling novel. Karl continued to work in lead and supporting roles in award winning independent, foreign, and Hollywood films. In 2010, Karl was again chosen by producer Steven Spielberg and director Shawn Levy to star as Tak Mashido, the reclusive legend of the robot fighting world in the sci-fi drama Real Steel. Karl now resides in Los Angeles, California. His brother Rick is also a successful actor in Hollywood.",
        "birthday": "1975-04-16",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 19860,
        "imdb_id": "nm1400085",
        "known_for_department": "Acting",
        "name": "Karl Yune",
        "place_of_birth": "Washington, District of Columbia, USA",
        "popularity": 0.3162,
        "profile_path": "/4GI4p5aPfW0vI20IdJOcxD5BEqr.jpg"
    }
}