{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hUPgIibqZlwbhs4N08cPzzc4f5K.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 127585,
                "original_language": "en",
                "original_title": "X-Men: Days of Future Past",
                "overview": "The ultimate X-Men ensemble fights a war for the survival of the species across two time periods as they join forces with their younger selves in an epic battle that must change the past – to save our future.",
                "popularity": 13.1726,
                "poster_path": "/tYfijzolzgoMOtegh1Y7j2Enorg.jpg",
                "release_date": "2014-05-15",
                "title": "X-Men: Days of Future Past",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 15762,
                "character": "Female Traveler",
                "credit_id": "57f87c2992514125250018d5",
                "order": 66
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Jude runs the gamut, from Nurse Carol in Pet Semetary: Bloodlines, the quietly evil school nurse in Lucky McKee's The Woods to crazy mama Evelyn Kent in Richard Roy's Forbidden Secrets to the elegant Parisian traveller channelling James McAvoy and partnering with Jennifer Lawrence in X-Men: Days of Future Past. She played key roles in the popular television series: Regenisis II, Kojak, The Fifth Estate and Toi et Moi.\n\nShe is heard regularly on CBC radio, portraying Elsie Reford on Ideas and narrating short stories on Cinq À Six as well as working in radio drama. She also lends her voice to commercials and industrials including Air Canada (first-class international) for which she has won industry awards. She is a dialect specialist.\n\nClassically trained in Canada and internationally Jude has been instrumental in the development of new Canadian drama working with Peter Hinton, Paula Danckert and Eda Holmes among others. She enjoyed playing the lead role of Roxanne in the new play The Blood Harmonic which premiered in Montreal and was thrilled to have worked with her late-husband Gordon Masten and their Best Man, Ari Snyder on Counting The Ways …among others",
        "birthday": "1954-01-24",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.reisler.ca/reisler-talent-women-Jude-Beny.html",
        "id": 198751,
        "imdb_id": "nm0073084",
        "known_for_department": "Acting",
        "name": "Jude Beny",
        "place_of_birth": "Medicine Hat, Alberta, Canada",
        "popularity": 0.1866,
        "profile_path": "/y8d5rN2GCmrWSk0Q9rdI5PGm6NV.jpg"
    }
}