{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cvq9cRMDJIGzNpHaPVGFftqPcLj.jpg",
                "genre_ids": [
                    878,
                    53
                ],
                "id": 206487,
                "original_language": "en",
                "original_title": "Predestination",
                "overview": "Predestination chronicles the life of a Temporal Agent sent on an intricate series of time-travel journeys designed to prevent future killers from committing their crimes. Now, on his final assignment, the Agent must stop the one criminal that has eluded him throughout time and prevent a devastating attack in which thousands of lives will be lost.",
                "popularity": 5.1957,
                "poster_path": "/38Xr1JnV1ZcLQ55zmdSp6n475cZ.jpg",
                "release_date": "2014-08-28",
                "title": "Predestination",
                "video": false,
                "vote_average": 7.424,
                "vote_count": 6752,
                "character": "Darrin Stephens in Bewitched (archive footage) (uncredited)",
                "credit_id": "647f9cc7d4653700adabfaf6",
                "order": 68
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Дик Йорк",
            "Richard \"Dick\" Allen York",
            "Richard Allen York"
        ],
        "biography": "Richard Allen York (September 4, 1928 – February 20, 1992) was an American actor best known for his role as Darrin Stephens on the classic television sitcom Bewitched (1964–1972). His portrayal of the character made him a beloved figure in American television history.\n\nDick York was born in Fort Wayne, Indiana. He showed an early interest in acting and eventually moved to New York City to pursue a career in theater. Before his acting career took off, York worked various odd jobs, including as a radio announcer. His big break came in the 1950s when he began landing roles in both television and film.\n\nYork's early acting career was filled with roles in movies and television series. He appeared in films such as They Came to Cordura (1959) and The Man Who Shot Liberty Valance (1962), where he played small but significant parts. His television appearances also included guest spots on a number of popular series.\n\nHowever, it was his role as Darrin Stephens on Bewitched that brought him lasting fame. The show, which debuted in 1964, starred Elizabeth Montgomery as Samantha Stephens, a witch married to an ordinary man, Darrin. York played the first Darrin, a role he portrayed for the first five seasons of the show. The show became a massive hit and is remembered as one of the most iconic sitcoms of the 1960s. His portrayal of Darrin was beloved for his humorous and often exasperated reactions to the magical chaos caused by Samantha’s powers.\n\nIn 1969, due to health issues, York was forced to leave Bewitched during the sixth season. His departure was explained on the show by having Darrin suffer an illness that made him unable to continue working. Actor Dick Sargent replaced him in the role for the final three seasons, but York's version of Darrin remains the most fondly remembered by fans of the show.\n\nThroughout his life, Dick York struggled with health problems. In the early 1950s, he was diagnosed with a severe back injury that led to chronic pain. The pain became debilitating, and York became addicted to painkillers, which contributed to his departure from *Bewitched*. His health issues were often a private struggle, and they affected his career in the latter part of his life.\n\nYork married his wife, Joan Alt, in 1951, and they had three children together. Despite his professional struggles and health challenges, York remained committed to his family and enjoyed a relatively quiet life outside the public eye in his later years.\n\nDick York passed away on February 20, 1992, at the age of 63, from complications related to emphysema. His death was a great loss to the entertainment world, as he was widely regarded as a talented and beloved actor, especially for his work on Bewitched.",
        "birthday": "1928-09-04",
        "deathday": "1992-02-20",
        "gender": 2,
        "homepage": null,
        "id": 19877,
        "imdb_id": "nm0948685",
        "known_for_department": "Acting",
        "name": "Dick York",
        "place_of_birth": "Fort Wayne, Indiana, USA",
        "popularity": 0.3777,
        "profile_path": "/fRsK3N5u25kLvhm2vSTD34RJf0x.jpg"
    }
}