{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7Q44vznK8E9SYsdkmIanrLmydZn.jpg",
                "genre_ids": [
                    28,
                    80,
                    18,
                    36,
                    53
                ],
                "id": 6968,
                "original_language": "de",
                "original_title": "Der Baader Meinhof Komplex",
                "overview": "When German police viciously quell a protest against the shah of Iran, popular journalist Ulrike Meinhof rebels against her dishonest marriage, walks away from her children and joins radical anarchist Andreas Baader. Together with Baader's girlfriend, Gudrun Ensslin, they form the violent Red Faction Army, and together perpetrate a slew of terrorist attacks as a way of disrupting the fabric of what they see as an increasingly fascist state.",
                "popularity": 2.4953,
                "poster_path": "/AjwdjcVorNKScu682tDATn5duoy.jpg",
                "release_date": "2008-09-25",
                "title": "The Baader Meinhof Complex",
                "video": false,
                "vote_average": 6.976,
                "vote_count": 613,
                "character": "Peter-Jürgen Boock",
                "credit_id": "5342d8220e0a2679aa004357",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/daJjtHlqvph7R1Uw1DFUIF0FJe4.jpg",
                "genre_ids": [
                    28,
                    18,
                    36,
                    10752
                ],
                "id": 505954,
                "original_language": "ru",
                "original_title": "Т-34",
                "overview": "In 1944, a courageous group of Russian soldiers managed to escape from German captivity in a half-destroyed legendary T-34 tank. Those were the times of unforgettable bravery, fierce fighting, unbreakable love, and legendary miracles.",
                "popularity": 3.9014,
                "poster_path": "/wMO5XGq2ybhL3CdCEPJ8OXWbNZG.jpg",
                "release_date": "2018-12-27",
                "title": "T-34",
                "video": false,
                "vote_average": 7.154,
                "vote_count": 887,
                "character": "Klaus Jäger",
                "credit_id": "5acbc9360e0a2631a301b569",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/maxRhndtC4BJABvqRPvYNu69CHA.jpg",
                "genre_ids": [
                    28,
                    18,
                    36
                ],
                "id": 551271,
                "original_language": "en",
                "original_title": "Medieval",
                "overview": "The story of fifteenth century Czech icon and warlord, Jan Zizka, who defeated armies of the Teutonic Order and the Holy Roman Empire.",
                "popularity": 3.9121,
                "poster_path": "/eeUNWsdoiOijOZAMaWFDA5Pb1n8.jpg",
                "release_date": "2022-09-08",
                "title": "Medieval",
                "video": false,
                "vote_average": 6.899,
                "vote_count": 505,
                "character": "Conrad",
                "credit_id": "5bb0a7160e0a263a24012b0b",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Винценц Кифер"
        ],
        "biography": "Vinzenz Kiefer was born in 1979 in Weilburg/Lahn. He grew up in a small village between two farms. He loved chasing chickens as well as building cabins in the woods and playing with fire. His parents' video collection was also an early passion of his (later on he took care of it completely and since then, he has expanded it significantly). Movies like \"King of Kings\", \"Zorro\", \"Three Musketeers\", and \"Robin Hood\" were key experiences while he was a boy, as well as films about pirates. Later on titles like \"Batman\" and \"Legend\" would find his attention, and Vinzenz could be seen quite often in a Batman costume - or running around, painting big Zs on front doors. After trying to invent a time machine several times or to find diamonds in the forests or to dig a hole to the center of the earth (and failing each time, of course) he finally turned to every-day life and meeting people and finding friends. Learning by doing became to be one of his favorite principles, and he used it to get familiar with riding a motor scooter, smoking or finding his rank within the gang and impressing the girls. One day while visiting the Cologne film studios Vinzenz was crowded by a bunch of girls pleading for his autograph. Some people in a production studio watched this scene and invited him for an interview, after which he was offered a part in a TV series. Vinzenz declined because he did not feel ready to leave his home and his friends. But the production studio kept on asking him, and so, after finishing school, Vinzenz finally agreed to take this chance.",
        "birthday": "1979-01-29",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 19895,
        "imdb_id": "nm0452385",
        "known_for_department": "Acting",
        "name": "Vinzenz Kiefer",
        "place_of_birth": "Weilburg, Hesse, Germany",
        "popularity": 0.1516,
        "profile_path": "/lhc35D7it0OqlyBPUtrIz9WKn0s.jpg"
    }
}