{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dwxdn3ppDAn7QtaLlhGDEErWfg9.jpg",
                "genre_ids": [
                    18
                ],
                "id": 5708,
                "original_language": "en",
                "original_title": "Control",
                "overview": "The story of Joy Division’s lead singer Ian Curtis, from his schoolboy days in 1973 to his suicide on the eve of the band's first American tour in 1980.",
                "popularity": 2.7455,
                "poster_path": "/jOJiaOhwrDdwqTRZvZOhbndqHGp.jpg",
                "release_date": "2007-09-12",
                "title": "Control",
                "video": false,
                "vote_average": 7.533,
                "vote_count": 881,
                "character": "Ian's Father",
                "credit_id": "52fe441ac3a36847f808255f",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/sGKUhw88FMH5gfz0E6BK2YOZ5se.jpg",
                "genre_ids": [
                    36,
                    18
                ],
                "id": 82695,
                "original_language": "en",
                "original_title": "Les Misérables",
                "overview": "An adaptation of the successful stage musical based on Victor Hugo's classic novel set in 19th-century France. Jean Valjean, a man imprisoned for stealing bread, must flee a relentless policeman named Javert. The pursuit consumes both men's lives, and soon Valjean finds himself in the midst of the student revolutions in France.",
                "popularity": 6.9792,
                "poster_path": "/6CuzBs2Lb8At7qQr64mLXg2RYRb.jpg",
                "release_date": "2012-12-18",
                "title": "Les Misérables",
                "video": false,
                "vote_average": 7.315,
                "vote_count": 5415,
                "character": "Ensemble 'At the End of the Day'",
                "credit_id": "52fe486d9251416c9108c239",
                "order": 107
            },
            {
                "adult": false,
                "backdrop_path": "/bfh9Z3Ghz4FOJAfLOAhmc3ccnHU.jpg",
                "genre_ids": [
                    12,
                    14
                ],
                "id": 671,
                "original_language": "en",
                "original_title": "Harry Potter and the Philosopher's Stone",
                "overview": "Harry Potter has lived under the stairs at his aunt and uncle's house his whole life. But on his 11th birthday, he learns he's a powerful wizard—with a place waiting for him at the Hogwarts School of Witchcraft and Wizardry. As he learns to harness his newfound powers with the help of the school's kindly headmaster, Harry uncovers the truth about his parents' deaths—and about the villain who's to blame.",
                "popularity": 35.6553,
                "poster_path": "/wuMc08IPKEatf9rnMNXvIDxqP4W.jpg",
                "release_date": "2001-11-16",
                "title": "Harry Potter and the Philosopher's Stone",
                "video": false,
                "vote_average": 7.901,
                "vote_count": 28611,
                "character": "Lord Voldemort",
                "credit_id": "5bf9eca80e0a263ab3020c05",
                "order": 33
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Richard Bremmer (born January 27, 1953) is an English actor. Bremmer was born and brought up in Warwickshire.\n\nBremmer first began his career in the short film of Couples and Robbers before being in his first full-length film The Girl with Brains in Her Feet. He was the first to portray the character Lord Voldemort in Harry Potter and the Philosopher's Stone (with the footage he appears in being reused in Harry Potter and the Deathly Hallows – Part 2), in a flashback sequence where the famous villain arrived at the home of the titular character's parents to kill them, though Bremmer's face is never seen (later in the film, the character is CGI and voiced by Ian Hart, the actor who played Quirrell in the same film). He was cast as Skeld in The 13th Warrior and also appeared in the 2004 film Viper in the Fist, an adaptation of the novel of the same name by Hervé Bazin.\n\nBremmer's stage credits include A Midsummer Night's Dream, Julius Caesar, Rosencrantz and Guildenstern Are Dead, King Lear and MacBeth. He has appeared in movies such as the 2014 biographical drama Mr. Turner, the 2015 adventure-drama In the Heart of the Sea, the 2007 biographical drama Control, the 2003 action comedy Shanghai Knights and the 2001 comedy film Just Visiting. His television credits include the fantasy drama series Beowulf: Return to the Shieldlands, the historical drama series The Borgias, the adventure-drama series Crusoe, and the docudrama Dunkirk.",
        "birthday": "1953-01-27",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 19903,
        "imdb_id": "nm0107101",
        "known_for_department": "Acting",
        "name": "Richard Bremmer",
        "place_of_birth": "Warwickshire, England, UK",
        "popularity": 0.2505,
        "profile_path": "/f09d1qYMv3pSZnPwOBXDnqBizzR.jpg"
    }
}