{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gkXL5ka6ciU4A4KYSvLIAXtvh7k.jpg",
                "genre_ids": [
                    53,
                    18,
                    27
                ],
                "id": 10242,
                "original_language": "en",
                "original_title": "What Ever Happened to Baby Jane?",
                "overview": "A former child star torments her paraplegic sister in their decaying Hollywood mansion.",
                "popularity": 3.7595,
                "poster_path": "/msGYzyWwtjAaA3DScdgmvJ5MReG.jpg",
                "release_date": "1962-10-31",
                "title": "What Ever Happened to Baby Jane?",
                "video": false,
                "vote_average": 7.904,
                "vote_count": 1103,
                "character": "Clerk in Newspaper Department",
                "credit_id": "54c10b159251416e6000b133",
                "order": 24
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Robert Ball Watson",
            "The Crybaby of Hollywood"
        ],
        "biography": "Watson was a member of the Watson Family, famous in the early days of Hollywood as being a houseful of child actors. He was brother to Coy Watson Jr., Harry, Billy, Delmar, Garry, Vivian, Gloria, and Louise, all of whom acted in motion pictures.\n\nThe family, known as \"the first family of Hollywood\", lived by the Echo Park area of Los Angeles and Bobs attended nearby Belmont High School.\n\nThey were honored by the Hollywood Chamber of Commerce by placing the Watson family star on the Hollywood Walk of Fame, at 6674 Hollywood Blvd., Hollywood, California.\n\nWatson was best known for his role as \"Pee Wee\" in the 1938 Metro-Goldwyn-Mayer film Boys Town and its sequel Men of Boys Town (1941), both starring Spencer Tracy and Mickey Rooney. Tracy and Watson became good friends during the making of the first film, and Watson was reportedly Tracy's last visitor before his death in 1967. In 1939, Watson delivered a fine, tear-jerking performance as Pud, Lionel Barrymore's grandson, in the MGM film, On Borrowed Time. Watson later made guest appearances in many television programs, including The Twilight Zone, Lou Grant, The Beverly Hillbillies, Green Acres, and The Fugitive.\n\nIn addition to working in the motion pictures business, Watson went to Claremont School of Theology to become a Methodist minister, inspired from the movie Boys Town. He retired after 30 years of serving in Burbank and La Cañada, California.\n\nHe died of prostate cancer in 1999 at Laguna Beach, California.",
        "birthday": "1930-11-16",
        "deathday": "1999-06-27",
        "gender": 2,
        "homepage": null,
        "id": 199468,
        "imdb_id": "nm0914519",
        "known_for_department": "Acting",
        "name": "Bobs Watson",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.7573,
        "profile_path": "/1L62x1ZNs1gwECeKPmF6I0Tkv8K.jpg"
    }
}