{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3fChciF2G1wXHsyTfJD9y7uN6Il.jpg",
                "genre_ids": [
                    27,
                    18,
                    14
                ],
                "id": 628,
                "original_language": "en",
                "original_title": "Interview with the Vampire",
                "overview": "A vampire relates his epic life story of love, betrayal, loneliness, and dark hunger to an over-curious reporter.",
                "popularity": 8.2031,
                "poster_path": "/2162lAT2MP36MyJd2sttmj5du5T.jpg",
                "release_date": "1994-11-11",
                "title": "Interview with the Vampire",
                "video": false,
                "vote_average": 7.382,
                "vote_count": 6110,
                "character": "Paris Vampire",
                "credit_id": "647b416793828e013377a3bd",
                "order": 27
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Louise Salter"
        ],
        "biography": "Louise Kim Salter is a British actress who trained under the direction of Olivier-award winning Rebecca Frecknall at National Youth Theatre. Louise was awarded \"Best Actress\" for her leading roles in Butterfly (now available on Amazon Prime as part of the Girl Feels: Into the Blue anthology) and How to be Human, alongside Scottish BAFTA-winner Sophie Kennedy Clark. She also appeared alongside BAFTA-nominated Kierston Wareing and Nick Moran in the feature film, The Habit of Beauty.\n\nHow to be Human, her own short film in which she led and produced featured a BAFTA and Tony-award winning cast, screened worldwide at various film festivals including Encounters, Sitges and Raindance Film Festival, picked up multiple awards including \"Best Film\" at Miami Sci-fi and high praise from the founder of the British Independent Film Awards, who said \"movies can change the world, How to be Human certainly does\".\n\nLouise is now preparing to film her debut feature under her co-founded production company, Slowcooked (TellADifferentStory.com).\n\n\"Louise Salter is terrific\" - Nev Pierce, Film Critic",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 199723,
        "imdb_id": "nm5312316",
        "known_for_department": "Acting",
        "name": "Louise Kim Salter",
        "place_of_birth": "Gravesend, Kent, England, UK",
        "popularity": 0.0468,
        "profile_path": "/zrcWLUwp4wJ01dLsv155AlckKNZ.jpg"
    }
}