{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/w7MsyOpP003FYhsiTgVHa3rNsrz.jpg",
                "genre_ids": [
                    18,
                    12,
                    10751
                ],
                "id": 508763,
                "original_language": "en",
                "original_title": "A Dog's Way Home",
                "overview": "The adventure of Bella, a dog who embarks on an epic 400-mile journey home after she is separated from her beloved human.",
                "popularity": 3.7866,
                "poster_path": "/pZn87R7gtmMCGGO8KeaAfZDhXLg.jpg",
                "release_date": "2019-01-10",
                "title": "A Dog's Way Home",
                "video": false,
                "vote_average": 7.387,
                "vote_count": 1153,
                "character": "Grocery Store Woman",
                "credit_id": "65237625fd630000ad9edf02",
                "order": 24
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Kimi Alexander grew up in a small town in Ontario on the border of Minnesota. She was raised playing many sports including badminton, squash, and figure skating at a competitive level. She moved to Winnipeg, Manitoba to complete her Bachelor of Arts degree in Theatre and Film. After post-secondary, Alexander moved to Vancouver. She consistently trains in classes at an advanced level while working as a professional actress.  Alexander plays Sara in an upcoming episode of Supernatural and Scarlet in an upcoming episode of Charmed.  You can catch her in the newly Netflix released Chilling Adventures of Sabrina starring Kiernan Shipka and A Dogs Way Home starring Ashley Judd directed by Charles Martin Smith. She can also be seen as Eden on the CW's Life Sentence starring Lucy Hale and makes an appearance in ABC's new series Take Two starring Rachel Bilson.  Alexander plays Ava in the dark comedy Mallory Valerie Finkerstein (short), and led the short film Molly Masters as Molly - a young assassin in training. Her credits also include the CW show iZombie, Volition, Fun House, Narcoleap, The Road, Messiah Complex, Fallen Angel, The Followers (5 episodes,) The Night Girl and a supporting role in the independent feature film Idle Thoughts.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 1998286,
        "imdb_id": "nm7568890",
        "known_for_department": "Acting",
        "name": "Kimi Alexander",
        "place_of_birth": null,
        "popularity": 0.3835,
        "profile_path": "/51tQgVOOqpeq56BCIWwQZgJ9uwm.jpg"
    }
}