{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zRKQW58MBEY078AxkHxEJzUskCl.jpg",
                "genre_ids": [
                    878,
                    12
                ],
                "id": 438631,
                "original_language": "en",
                "original_title": "Dune",
                "overview": "Paul Atreides, a brilliant and gifted young man born into a great destiny beyond his understanding, must travel to the most dangerous planet in the universe to ensure the future of his family and his people. As malevolent forces explode into conflict over the planet's exclusive supply of the most precious resource in existence-a commodity capable of unlocking humanity's greatest potential-only those who can conquer their fear will survive.",
                "popularity": 17.784,
                "poster_path": "/d5NXSklXo0qyIYkgV94XAgMIckC.jpg",
                "release_date": "2021-09-15",
                "title": "Dune",
                "video": false,
                "vote_average": 7.781,
                "vote_count": 13924,
                "character": "Bene Gesserit Ancestor (voice)",
                "credit_id": "6195d0b9528b2e008b2e9ed6",
                "order": 37
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Marianne Evelyn Gabriel Faithfull",
            "ماریان فیث‌فول"
        ],
        "biography": "Marianne Evelyn Gabriel Faithfull (December 29, 1946 - January 30, 2025) was an English rock singer and actress. She achieved popularity in the 1960s with the release of her hit single \"As Tears Go By\" and became one of the lead female artists during the British Invasion in the United States.\n\nBorn in Hampstead, London, Faithfull began her career in 1964 after attending a Rolling Stones party, where she was discovered by Andrew Loog Oldham. Her debut album Marianne Faithfull (1965) (released simultaneously with her album Come My Way) was a commercial success followed by a number of albums on Decca Records. From 1966 to 1970, she had a highly publicised romantic relationship with Mick Jagger. Her popularity was further enhanced by her film roles, such as those in I'll Never Forget What's'isname (1967), The Girl on a Motorcycle (1968), and Hamlet (1969).",
        "birthday": "1946-12-29",
        "deathday": "2025-01-30",
        "gender": 1,
        "homepage": "http://www.mariannefaithfull.org.uk/",
        "id": 19995,
        "imdb_id": "nm0265717",
        "known_for_department": "Acting",
        "name": "Marianne Faithfull",
        "place_of_birth": "Hampstead, London, England, UK ",
        "popularity": 0.3377,
        "profile_path": "/mV8avpLE0BJVLQ97oyFNn1BS1n2.jpg"
    }
}