{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kiSderXBFLpkSp7dZ5RQkHOD5nh.jpg",
                "genre_ids": [
                    18,
                    35,
                    10749
                ],
                "id": 1555,
                "original_language": "fr",
                "original_title": "L'Auberge espagnole",
                "overview": "A strait-laced French student moves into an apartment in Barcelona with a cast of six other characters from all over Europe. Together, they speak the international language of love and friendship.",
                "popularity": 4.5365,
                "poster_path": "/baDm4V3Dqx2hNh7WF1NvGrHGgqQ.jpg",
                "release_date": "2002-06-19",
                "title": "The Spanish Apartment",
                "video": false,
                "vote_average": 7.126,
                "vote_count": 1176,
                "character": "William",
                "credit_id": "52fe42fdc3a36847f80321e5",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Kevin Brian Bishop is an English actor and comedian, best known for The Kevin Bishop Show, which he co-wrote with Lee Hupfield.\n\nBishop's first role was in Grange Hill. His second role, at age 16, was as Ben Quayle in Silent Witness. He played Stupid Brian in three episodes of My Family. He starred in Muppet Treasure Island as Jim Hawkins.\n\nIn 2005, he portrayed the late comedian Dudley Moore onstage in Pete and Dud: Come Again, a drama charting Moore's turbulent relationship with Peter Cook, which debuted at the Assembly Rooms as part of the Edinburgh Fringe before transferring to The Venue in London's West End in March 2006. In August 2007 he appeared as the title character in Channel 4's satirical spoof documentary \"Being Tom Cruise\", a spin-off of Star Stories. In September 2014, Bishop appeared in the one-man show Fully Committed at the Menier Chocolate Factory, in which he played forty characters.\n\nIn 2013, Bishop appeared in the American comedy series Super Fun Night, written by and starring Australian comedic actress Rebel Wilson. The show ran for one season.\n\nIn August 2016, Bishop starred in the revival of classic 1970s BBC sitcom Porridge. He played the role of Fletch, grandson of Ronnie Barker's original main character, locked up for cyber-crime. Originally a one-off, the show was commissioned to full series in October 2016. The first series was broadcast in October 2017 on a 6-week run on BBC One as well as the full series being released at the same time on BBC iPlayer.\n\nIn 2016, Bishop played Nigel Farage in a one-off BBC Two comedy series entitled Nigel Farage Gets His Life Back.\n\nIn 2017, Bishop became the speaking voice for 2-D, fictional lead singer of British virtual band Gorillaz",
        "birthday": "1980-06-18",
        "deathday": null,
        "gender": 2,
        "homepage": "https://anothertongue.com/artist/kevin-bishop",
        "id": 19996,
        "imdb_id": "nm0084107",
        "known_for_department": "Acting",
        "name": "Kevin Bishop",
        "place_of_birth": "Bromley, England, UK",
        "popularity": 0.3978,
        "profile_path": "/r4xMLMEunvpvG38eDFGYpNO1DGN.jpg"
    }
}