{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ztiFxuG0gC6wQ8y7JZFYbCQyN4Y.jpg",
                "genre_ids": [
                    10751,
                    35,
                    10402,
                    16
                ],
                "id": 438695,
                "original_language": "en",
                "original_title": "Sing 2",
                "overview": "Buster and his new cast now have their sights set on debuting a new show at the Crystal Tower Theater in glamorous Redshore City. But with no connections, he and his singers must sneak into the Crystal Entertainment offices, run by the ruthless wolf mogul Jimmy Crystal, where the gang pitches the ridiculous idea of casting the lion rock legend Clay Calloway in their show. Buster must embark on a quest to find the now-isolated Clay and persuade him to return to the stage.",
                "popularity": 12.3564,
                "poster_path": "/aWeKITRFbbwY8txG5uCj4rMCfSP.jpg",
                "release_date": "2021-12-01",
                "title": "Sing 2",
                "video": false,
                "vote_average": 7.845,
                "vote_count": 4617,
                "character": "Additional Voices (voice)",
                "credit_id": "6224dfbb85da120043c1f07d",
                "order": 28
            },
            {
                "adult": false,
                "backdrop_path": "/hgESQ2sK21j22Yode4w99jfwj44.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 491418,
                "original_language": "en",
                "original_title": "Instant Family",
                "overview": "When Pete and Ellie decide to start a family, they stumble into the world of foster care adoption. They hope to take in one small child but when they meet three siblings, including a rebellious 15 year old girl, they find themselves speeding from zero to three kids overnight.",
                "popularity": 4.4738,
                "poster_path": "/xYV1mODz99w7AjKDSQ7h2mzZhVe.jpg",
                "release_date": "2018-11-13",
                "title": "Instant Family",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 3099,
                "character": "Lita Viara",
                "credit_id": "5aea2868c3a3682c03001cea",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Julianna Gamiz is quickly becoming one of the most sought after young Latina actresses. She recently starred in the major Paramount film \"Instant Family\" as the adorable, scene-stealing \"Lita\", alongside an all-star cast including Mark Wahlberg, Rose Byrne and Octavia Spencer. She plays the youngest adopted daughter of two new parents and nails her performance as a super sweet, yet demanding young lady who keeps the cute coming. On the small screen, she starred in the Hulu series \"East Los High\" for three seasons as Isela Camayo, the daughter of the main character, who inspires the other teenagers in various situations on their life paths. She was cast as a regular performer at only two years old. Reprising this role, she also recently starred in the \"East Los High: The Movie\", which was the show's extended finale. In addition to this, Julianna shot a two-season recurring arc on \"Jane The Virgin, starring as the young version of the title character played by Gina Rodriguez. (IMDb Mini Biography By: Jacqueline Gamiz)",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 2000657,
        "imdb_id": "nm6423395",
        "known_for_department": "Acting",
        "name": "Julianna Gamiz",
        "place_of_birth": null,
        "popularity": 0.1156,
        "profile_path": "/njOvkRObymJohX5Dnczgisf7emF.jpg"
    }
}