{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bNxnk75NLddqqnblfjovGGyr71K.jpg",
                "genre_ids": [
                    18,
                    10751
                ],
                "id": 228203,
                "original_language": "en",
                "original_title": "McFarland, USA",
                "overview": "A track coach in a small California town transforms a team of athletes into championship contenders.",
                "popularity": 3.861,
                "poster_path": "/yyhniD8A7Mv6SOn8oo1Ba2K0mKc.jpg",
                "release_date": "2015-02-20",
                "title": "McFarland, USA",
                "video": false,
                "vote_average": 7.464,
                "vote_count": 880,
                "character": "Sonia Rosaldo",
                "credit_id": "54304591c3a36831ac000f2b",
                "order": 28
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Born and raised in Montebello, California, actress Chelsea Rendon has been a working actress since the age of 7, after booking a leading role in the feature film \"No Turning Back\", which went onto win multiple awards for her portrayal of Cristina. She continued to work on shows such as \"E.R.\", \"The Shield\", and \"Judging Amyas\" a child, and recently worked on Disney's \"McFarland, USA\", starred in Netflix original hit \"Bright\", and has recurred on Freeform's \"The Fosters\". Most recognized for her role as Ruthie in the Oscar-nominated film \"A Better Life\", Chelsea is taking a page from the same book and channeling a young, \"woke\" activist by the name of Mari in STARZ' upcoming drama \"Vida\". Chelsea stars alongside Mishel Prada and Melissa Barrera in the half-hour drama series focusing on two Mexican-American sisters from the east side of Los Angeles. As an actor who is attracted to empowering female roles, Chelsea draws inspiration from the likes of Viola Davis, Mariska Hargitay and Taraji P. Henson, and hopes to one day produce her content and try her hand in directing. Chelsea enjoys practicing karate, eating her way through the city's best tacos, and finding time to catch up on her favorite televi-sion shows.",
        "birthday": "1993-03-15",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 200065,
        "imdb_id": "nm0719371",
        "known_for_department": "Acting",
        "name": "Chelsea Rendon",
        "place_of_birth": "Montebello, California, USA",
        "popularity": 0.284,
        "profile_path": "/qvYQS2T0UXro4siqIfTIwnJCwsT.jpg"
    }
}