{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/twsxsfao6ZOVvT8LfudH603MMi6.jpg",
                "genre_ids": [
                    10751,
                    35,
                    16,
                    878
                ],
                "id": 519182,
                "original_language": "en",
                "original_title": "Despicable Me 4",
                "overview": "Gru and Lucy and their girls—Margo, Edith and Agnes—welcome a new member to the Gru family, Gru Jr., who is intent on tormenting his dad. Gru also faces a new nemesis in Maxime Le Mal and his femme fatale girlfriend Valentina, forcing the family to go on the run.",
                "popularity": 29.9883,
                "poster_path": "/wWba3TaojhK7NdycRhoQpsG0FaH.jpg",
                "release_date": "2024-06-20",
                "title": "Despicable Me 4",
                "video": false,
                "vote_average": 7.012,
                "vote_count": 2924,
                "character": "Patsy Prescott (voice)",
                "credit_id": "65b6c711a0b690017bcdaabe",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/5fxTB08O7CW1hAcN2MWOKodp1h1.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 615777,
                "original_language": "en",
                "original_title": "Babylon",
                "overview": "A tale of outsized ambition and outrageous excess, tracing the rise and fall of multiple characters in an era of unbridled decadence and depravity during Hollywood's transition from silent films to sound films in the late 1920s.",
                "popularity": 8.8545,
                "poster_path": "/wjOHjWCUE0YzDiEzKv8AfqHj3ir.jpg",
                "release_date": "2022-12-22",
                "title": "Babylon",
                "video": false,
                "vote_average": 7.38,
                "vote_count": 3486,
                "character": "Marion Davies",
                "credit_id": "6377d4bbfe6318008a7a5b27",
                "order": 77
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Chloe Rose Fineman (born July 20, 1988) is an American actress, writer, and comedian. She became a featured player on Saturday Night Live starting in its 45th season in September 2019. She was promoted to repertory status in 2021 at the beginning of season 47.\n\nAfter graduating from college, Fineman moved to Los Angeles, where she performed in The Groundlings troupe's Sunday Company. She also performed in \"Characters Welcome\" at the Upright Citizens Brigade Theatre. In 2018, she was recognized as a \"New Face\" at the Just for Laughs festival in Montreal, and she was nominated for Best Comedian at the 2019 Shorty Awards. Her television appearances include Jane the Virgin and Search Party.  She maintains an online presence known in particular for her celebrity impressions in front-facing camera comedy videos. On Instagram, she has posted celebrity impressions as well as clips from her Groundlings work and stand-up comedy. On YouTube, she has done character impressions. In 2018, Vulture critic Luke Kelly-Clyne wrote that after seeing Fineman do impressions of Meryl Streep and others, \"As I found out, that extra bit of genius she possesses – that intangible thing that takes a good impression to a great impression – is rooted in her ability to create entirely original characters who feel as real as anyone you've ever met,\" concluding, \"Chloe Fineman is absolutely one of the most talented new performers right now, and she's long overdue for a break.\"",
        "birthday": "1988-07-20",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 2000658,
        "imdb_id": "nm4806887",
        "known_for_department": "Acting",
        "name": "Chloe Fineman",
        "place_of_birth": "Berkeley, California, United States",
        "popularity": 0.4683,
        "profile_path": "/pzGIb2jkjeXGhOJryPf2n2w13lI.jpg"
    }
}