{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uCti2q8DbLknT1fBCXvhJSZ7Tks.jpg",
                "genre_ids": [
                    27
                ],
                "id": 21484,
                "original_language": "en",
                "original_title": "Possession",
                "overview": "A young woman left her family for an unspecified reason. The husband determines to find out the truth and starts following his wife. At first, he suspects that a man is involved. But gradually, he finds out more and more strange behaviors and bizarre incidents that indicate something more than a possessed love affair.",
                "popularity": 5.5774,
                "poster_path": "/lUFZsUuJ0YyhBXH8D2BFUd6wODm.jpg",
                "release_date": "1981-05-27",
                "title": "Possession",
                "video": false,
                "vote_average": 7.359,
                "vote_count": 1209,
                "character": "Margit Gluckmeister",
                "credit_id": "52fe441bc3a368484e00fd7b",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Margit Carstensen (29 February 1940 – 1 June 2023) was a German theatre and film actress, best known outside Germany for roles in the works of film director Rainer Werner Fassbinder.\n\nCarstensen was born and raised in the northern German city of Kiel. Upon graduation from the local high school in 1958, she studied acting at the Hochschule für Musik und Theater Hamburg. This education led to her first stage appearances in Kleve, Heilbronn, Münster, and Braunschweig. In 1965, Carstensen began a four-year engagement with the German Playhouse in Hamburg.\n\nIn 1969, she gained a local profile for her work in the Theater am Goetheplatz in Bremen, where she first met director Rainer Werner Fassbinder. She then worked under his direction in a comedy by the 18th-century Venetian Carlo Goldoni, The Coffee Shop (which was recorded for television in 1970), bringing her national attention in West Germany. She subsequently played the role of serial murderess Geesche Gottfried in the premiere of Fassbinder's own play Bremen Freedom (also televised, in 1972), and then in the title role of his Henrik Ibsen adaptation Nora Helmer (televised in 1974) derived from A Doll's House. Outside of theatre, Carstensen played leading roles in the Fassbinder films The Bitter Tears of Petra von Kant (1972), her best-known role for him; Martha (1974), analysing a traditional marriage in a contemporary setting; Fear of Fear (1975); Mother Küsters' Trip to Heaven (1975); Satan's Brew (1976); Chinese Roulette (1976) and Women in New York (1977). She also appeared in episodes of two Fassbinder television productions: Eight Hours Don't Make a Day (1972), and Berlin Alexanderplatz (1980).\n\nFrom 1973 to 1976, Carstensen held a steady acting engagement in Darmstadt. In 1977, she moved to West Berlin where she performed on the highly regarded Staatliche Schauspielbühnen. In 1982, she moved to Stuttgart in order to work with director Hansgünther Heyme, where she appeared in a series of plays directed by him.\n\nDuring this time, Carstensen also worked in international film productions, such as Andrzej Żuławski's Possession (1981) and Agnieszka Holland's Angry Harvest (1985); the latter was nominated for an Academy Award for Best Foreign Language Film. By the late 1980s, she had developed ongoing working relationships with German directors Werner Schroeter, Christoph Schlingensief, and Leander Haußmann.\n\nFor the 2003–04 season, Carstensen appeared in the Vienna Burgtheater, in the premiere of Elfriede Jelinek's play Bambiland under the direction of Schlingensief. During the 2007–08 season Carstensen assisted with the Austrian-German TV documentary Mr. Karl – A Person for People, directed by Kurt Mayer.\n\nIn 2016, she was still on television, appearing in the long-running series Tatort.\n\nCarstensen received many awards in her career. Among these were the 1973 German Film Awards (Gold), for her acting in The Bitter Tears of Petra von Kant, and the 2002 Bavarian Film Award, for her acting in Scherbentanz. In 1972 she was chosen by the German Film Critics Guild as Best Actress of the Year. In 2019, she was awarded the Götz-George-Preis for her life's work.\n\nDescription above from the Wikipedia article Margit Carstensen, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1940-02-29",
        "deathday": "2023-06-01",
        "gender": 1,
        "homepage": null,
        "id": 20017,
        "imdb_id": "nm0141380",
        "known_for_department": "Acting",
        "name": "Margit Carstensen",
        "place_of_birth": "Kiel, Germany",
        "popularity": 0.2433,
        "profile_path": "/hSCBZ1eoJpJaDg2pBRWxHmqSeKQ.jpg"
    }
}