{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5PfHGXosySGs0l1JfeREspy3v6G.jpg",
                "genre_ids": [
                    878,
                    28,
                    12
                ],
                "id": 1924,
                "original_language": "en",
                "original_title": "Superman",
                "overview": "Mild-mannered Clark Kent works as a reporter at the Daily Planet alongside his crush, Lois Lane. Clark must summon his superhero alter-ego when the nefarious Lex Luthor launches a plan to take over the world.",
                "popularity": 9.8184,
                "poster_path": "/d7px1FQxW4tngdACVRsCSaZq0Xl.jpg",
                "release_date": "1978-12-14",
                "title": "Superman",
                "video": false,
                "vote_average": 7.155,
                "vote_count": 4067,
                "character": "Lois Lane",
                "credit_id": "52fe4322c3a36847f803ce1d",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/ctzKCslTsMRsOJNvAm1Mw8ytiHY.jpg",
                "genre_ids": [
                    28,
                    12,
                    35,
                    18,
                    37
                ],
                "id": 9359,
                "original_language": "en",
                "original_title": "Maverick",
                "overview": "Bret Maverick is a gambler who would rather con someone than fight them, and needs an additional $3k in order to enter a winner-takes-all poker game beginning in a few days. He joins forces with a woman with a marvelous Southern accent, and the two try and enter the game.",
                "popularity": 4.5071,
                "poster_path": "/mTVbGGi5PIexmxVzeyFd2RYKwfM.jpg",
                "release_date": "1994-05-20",
                "title": "Maverick",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 1661,
                "character": "Margret Mary (uncredited)",
                "credit_id": "52fe44edc3a36847f80b24ef",
                "order": 56
            },
            {
                "adult": false,
                "backdrop_path": "/s46nIyQQtZZPI8kw7A71Iuauk57.jpg",
                "genre_ids": [
                    27,
                    9648
                ],
                "id": 16938,
                "original_language": "en",
                "original_title": "Black Christmas",
                "overview": "As the residents of the Pi Kappa Sigma sorority house prepare for the festive season, a stranger begins to harass them with a series of obscene phone calls.",
                "popularity": 1.9468,
                "poster_path": "/qqO98sdPgptFgCua3Z4uZDuPcmP.jpg",
                "release_date": "1974-10-11",
                "title": "Black Christmas",
                "video": false,
                "vote_average": 6.933,
                "vote_count": 864,
                "character": "Barb",
                "credit_id": "52fe46f99251416c75089b57",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "瑪歌潔泰",
            "Margaret Ruth Kidder",
            "マーゴット・キダー"
        ],
        "biography": "Margaret Ruth \"Margot\" Kidder (October 17, 1948 – May 13, 2018) was a Canadian-American actress, director, and activist whose career spanned over five decades. Her accolades include three Canadian Screen Awards and one Daytime Emmy Award. Though she appeared in an array of films and television, Kidder is most widely known for her performance as Lois Lane in the Superman film series, appearing in the first four films.\n\nBorn in Yellowknife to a Canadian mother and an American father, Kidder was raised in the Northwest Territories as well as several other Canadian provinces. She began her acting career in the 1960s appearing in low-budget Canadian films and television series, before landing a lead role in Quackser Fortune Has a Cousin in the Bronx (1970). She then played twins in Brian De Palma's cult thriller Sisters (1973), a sorority student in the slasher film Black Christmas (1974) and the titular character's girlfriend in the drama The Great Waldo Pepper (1975), opposite Robert Redford. In 1977, she was cast as Lois Lane in Richard Donner's Superman (1978), a role which established her as a mainstream actress. Her performance as Kathy Lutz in the blockbuster horror film The Amityville Horror (1979) gained her further mainstream exposure, after which she went on to reprise her role as Lois Lane in Superman II, III, and IV (1980–1987).\n\nThe 1990s were marked by significant health problems for Kidder: In 1990, she sustained serious injuries in a car accident that left her temporarily paralyzed, and she later had a highly publicized manic episode and nervous breakdown in 1996 stemming from bipolar disorder. By the 2000s, she maintained steady work in independent films and television, with guest-starring roles on Smallville, Brothers & Sisters and The L Word, and appeared in a 2002 Off-Broadway production of The Vagina Monologues. In 2015, she won a Daytime Emmy Award for her performance on the children's television series R.L. Stine's The Haunting Hour.",
        "birthday": "1948-10-17",
        "deathday": "2018-05-13",
        "gender": 1,
        "homepage": null,
        "id": 20011,
        "imdb_id": "nm0452288",
        "known_for_department": "Acting",
        "name": "Margot Kidder",
        "place_of_birth": "Yellowknife, Northwest Territories, Canada",
        "popularity": 0.5443,
        "profile_path": "/kLoOPBncRro2Dmy18ez25a39WyD.jpg"
    }
}