{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8K92dxdtyrhXB6fEnfGWmWnSFV7.jpg",
                "genre_ids": [
                    16,
                    12,
                    35,
                    10751,
                    14
                ],
                "id": 228326,
                "original_language": "en",
                "original_title": "The Book of Life",
                "overview": "The journey of Manolo, a young man who is torn between fulfilling the expectations of his family and following his heart. Before choosing which path to follow, he embarks on an incredible adventure that spans three fantastical worlds where he must face his greatest fears.",
                "popularity": 7.219,
                "poster_path": "/aotTZos5KswgCryEzx2rlOjFsm1.jpg",
                "release_date": "2014-10-01",
                "title": "The Book of Life",
                "video": false,
                "vote_average": 7.531,
                "vote_count": 2813,
                "character": "La Muerte as Old Woman (voice)",
                "credit_id": "5ac5679892514162b4000b21",
                "order": 35
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Тонита Кастро"
        ],
        "biography": "Tonita Castro (January 8, 1953 – May 8, 2016) was a Mexican-born American actress from Jalisco, Mexico.  Coming to the United States from Mexico in the late 1970s, Castro initially sought to become a teacher before securing a job at Radio Express. She'd go on to work there for over 20 years.\n\nCastro made the transfer to screen acting in 2005 in an appearance on the crime drama The Shield. She'd go on to make guest appearances in series like Glee, Little Britain USA, The Sarah Silverman Program, The Travelers, Two and a Half Men, Kroll Show, and Life in Pieces. Castro was a recurring cast member in the TV series \"Go On\" starring Matthew Perry in 2012-2013. In 2013, she was part of the main cast for the short lived sitcom Dads, which was executive produced by Seth MacFarlane. In film, Castro made appearances in Imagine That, Funny People, Our Family Wedding, Bad Ass, Seeking a Friend for the End of the World, The Book of Life, and In God's Time.\n\nDuring her stint on Life in Pieces, Castro began feeling ill, and was eventually diagnosed with stomach cancer. She died from the disease on May 8, 2016.",
        "birthday": "1953-01-15",
        "deathday": "2016-05-08",
        "gender": 1,
        "homepage": null,
        "id": 200163,
        "imdb_id": "nm1724709",
        "known_for_department": "Acting",
        "name": "Tonita Castro",
        "place_of_birth": "Jalisco, Mexico",
        "popularity": 0.1057,
        "profile_path": "/tFV4x2cHrOThsdlOS0eCy5sjv0R.jpg"
    }
}