{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hpzbQDjl2yzf6MwrYOrbDJCmojc.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 227,
                "original_language": "en",
                "original_title": "The Outsiders",
                "overview": "When two poor Greasers, Johnny and Ponyboy, are assaulted by a vicious gang, the Socs, and Johnny kills one of the attackers, tension begins to mount between the two rival gangs, setting off a turbulent chain of events.",
                "popularity": 4.4429,
                "poster_path": "/pl8Tf36TAOb2i561yPbQ9xl4P4D.jpg",
                "release_date": "1983-03-25",
                "title": "The Outsiders",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 1452,
                "character": "Greaser in Concession Stand",
                "credit_id": "5ccb9f4b925141047d2650cb",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Tom Hilmann",
            "Thomas Hillman",
            "Tom Hillman",
            "Thomas Hillmann"
        ],
        "biography": "Los Angeles Drama Critics Circle Award winner, Tom Hillmann recurs on the CW's \"Star-Crossed\" as series regular, Grey Damon's father.\n\nA native New Yorker, Tom grew up on the sunny shores of the Atlantic coast, went to college in the heartland, then ventured west to Los Angeles. Early in his career while trying to break into the business, he supported himself with odd jobs including painting address numbers on street curbs, playing a Power Ranger at children's parties, and even endured a short stint as a drug test specimen taker.\n\nHillmann studied with Peabody Award-winning director, Don Richardson at UCLA for a semester then was invited to his private class where he studied for several years.\n\nHis recurring guest star role opposite David Caruso in \"CSI: Miami\" originated in the pilot cross-over episode in the original \"CSI: Crime Scene Investigation\" directed by Danny Cannon.\n\nOther TV credits include \"Army Wives\" (recurring as Dr. Adam Harwood,) \"Burn Notice,\" \"One Tree Hill,\" \"K-Ville,\" and \"Recount.\"\n\nIn Los Angeles he has performed in numerous Equity theatre productions including lead roles in \"She Loves Me,\" \"Guys & Dolls,\" \"The 1940'S Radio Hour,\" \"Fiddler on the Roof,\" \"Into the Woods,\" \"See How They Run,\" \"A Christmas Carol,\" and \"The Traveling Lady.\"\n\nHe is married with three children and enjoys traveling, the arts, and pursuing a healthy lifestyle.  - IMDb Mini Biography",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.tomhillmann.com/",
        "id": 200406,
        "imdb_id": "nm0385092",
        "known_for_department": "Acting",
        "name": "Tom Hillmann",
        "place_of_birth": "New York, USA",
        "popularity": 0.1491,
        "profile_path": "/bEQHVXgncz6HSji4OUibxsWLpPC.jpg"
    }
}