{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/88sRqoxHPS9wnIKqryjUqm60sN6.jpg",
                "genre_ids": [
                    27,
                    9648,
                    53
                ],
                "id": 1933,
                "original_language": "en",
                "original_title": "The Others",
                "overview": "Grace is a religious woman who lives in an old house kept dark because her two children, Anne and Nicholas, have a rare sensitivity to light. When the family begins to suspect the house is haunted, Grace fights to protect her children at any cost in the face of strange events and disturbing visions.",
                "popularity": 6.2908,
                "poster_path": "/p8g1vlTvpM6nr2hMMiZ1fUlKF0D.jpg",
                "release_date": "2001-08-02",
                "title": "The Others",
                "video": false,
                "vote_average": 7.616,
                "vote_count": 6827,
                "character": "Nicholas Stewart",
                "credit_id": "52fe4323c3a36847f803d34f",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jimmy Bentley"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nJames Bentley is an actor who won a Young Artist Award for playing Nicholas Stewart in the 2001 psychological horror film The Others.\n\nIn 2004, Bentley played Michael Sellers in The Life and Death of Peter Sellers, Young Nero in Imperium: Nero and a double for John Sessions in Stella Street.\n\nBentley won the Nottingham New Theatre award for Best Actor in a Leading Role in 2013. He found further success in 2014 when he won the award for a second time running. In 2015 he became a fellow of the aforementioned theatre.\n\nHe is currently a backstage manager, his most previous engagement being 'Half a Sixpence'.\n\nDescription above from the Wikipedia article James Bentley, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1992-07-14",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 20052,
        "imdb_id": "nm0972848",
        "known_for_department": "Acting",
        "name": "James Bentley",
        "place_of_birth": null,
        "popularity": 0.3189,
        "profile_path": "/j12Uw41QPI4RtikIMEEErA5iJMo.jpg"
    }
}