{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/88sRqoxHPS9wnIKqryjUqm60sN6.jpg",
                "genre_ids": [
                    27,
                    9648,
                    53
                ],
                "id": 1933,
                "original_language": "en",
                "original_title": "The Others",
                "overview": "Grace is a religious woman who lives in an old house kept dark because her two children, Anne and Nicholas, have a rare sensitivity to light. When the family begins to suspect the house is haunted, Grace fights to protect her children at any cost in the face of strange events and disturbing visions.",
                "popularity": 6.2908,
                "poster_path": "/p8g1vlTvpM6nr2hMMiZ1fUlKF0D.jpg",
                "release_date": "2001-08-02",
                "title": "The Others",
                "video": false,
                "vote_average": 7.616,
                "vote_count": 6827,
                "character": "Mrs. Marlish",
                "credit_id": "52fe4323c3a36847f803d363",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/AqLcLsGGTzAjm3pCCq0CZCQrp6m.jpg",
                "genre_ids": [
                    12,
                    14
                ],
                "id": 12444,
                "original_language": "en",
                "original_title": "Harry Potter and the Deathly Hallows: Part 1",
                "overview": "Harry, Ron and Hermione walk away from their last year at Hogwarts to find and destroy the remaining Horcruxes, putting an end to Voldemort's bid for immortality. But with Harry's beloved Dumbledore dead and Voldemort's unscrupulous Death Eaters on the loose, the world is more dangerous than ever.",
                "popularity": 18.8359,
                "poster_path": "/iGoXIpQb7Pot00EEdwpwPajheZ5.jpg",
                "release_date": "2010-11-17",
                "title": "Harry Potter and the Deathly Hallows: Part 1",
                "video": false,
                "vote_average": 7.739,
                "vote_count": 19733,
                "character": "Mrs. Granger",
                "credit_id": "52fe44e19251416c750443eb",
                "order": 37
            },
            {
                "adult": false,
                "backdrop_path": "/eyn0vuN4IZjImE5Dws0iPhZrCMc.jpg",
                "genre_ids": [
                    18
                ],
                "id": 205220,
                "original_language": "en",
                "original_title": "Philomena",
                "overview": "A woman searches for her adult son, who was taken away from her decades ago when she was forced to live in a convent.",
                "popularity": 2.2975,
                "poster_path": "/eBUv2GmGdXmCk1AaSOmyiu70hN8.jpg",
                "release_date": "2013-11-01",
                "title": "Philomena",
                "video": false,
                "vote_average": 7.35,
                "vote_count": 1652,
                "character": "Sally Mitchell",
                "credit_id": "52fe4d04c3a368484e1d27bb",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "ミシェル・フェアリー",
            "米歇尔·费尔利",
            "میشل فیرلی"
        ],
        "biography": "Michelle Fairley (born 11 July 1963) is an actress from Northern Ireland. She is best known for playing Catelyn Stark in the HBO series Game of Thrones (2011–2013). She has since appeared in the USA Network series Suits (2013), the Fox series 24: Live Another Day (2014), the RTÉ miniseries Rebellion (2016), the science fiction series The Feed (2019), and the Sky Atlantic crime drama Gangs of London (2020–).\n\nFairley was born in Coleraine to parents Brian and Teresa Fairley, the second eldest of six children. Her father was a popular publican, owner of Fairley's Bar and several off-licences, in Northern Ireland during The Troubles, but Fairley remembers both Catholics and Protestants frequenting the pub.\n\nFairley appeared in a number of British television shows, including The Bill, Holby City and Casualty. Some of her earlier roles were as Cathy Michaels on ITV1's Inspector Morse in the episode titled \"The Way Through The Woods\" and as Nancy Phelan in Lovejoy in the episode 9 of Season 3 titled \"Smoke Your Nose\".\n\nShe took over the role of Mrs. Granger from Heather Bleasdale (who had played Mrs. Granger in Chamber of Secrets) in the Harry Potter and the Deathly Hallows films. From 2011 to 2013, Fairley starred as Catelyn Stark (née Tully) in the first three seasons of the HBO fantasy series Game of Thrones, replacing Jennifer Ehle who played the character in the original, unaired, pilot episode.\n\nFairley joined the cast of the USA Network series Suits for its third season, playing the recurring role of Dr. Ava Hessington, a chemical engineer and oil CEO accused of bribery, and after that, accused for murder. She played Margot Al-Harazi in 24: Live Another Day on Fox. Her film roles included The Invisible Woman (2013) and In the Heart of the Sea (2015). In 2014, Fairley was cast as Margaret Langston in the ABC TV Series Resurrection (2014-2015).\n\nIn 2017, it was announced Fairley would appear in a revival of Jim Cartwright's play Road at the Royal Court Theatre In 2018, she played Cassius in Julius Caesar at the Bridge Theatre, alongside David Calder, David Morrissey and Ben Whishaw. In 2019, Fairley led the Virgin Media and Amazon Prime science fiction series The Feed as Meredith Hatfield. As of June 2020, Fairley stars as Marian Wallace in the Sky Atlantic crime drama Gangs of London. She starred as Millie in the 2021 film Nobody Has To Know alongside Bouli Lanners. In 2023, Fairley starred as Princess Augusta in Queen Charlotte: A Bridgerton Story on Netflix. She also contributed to The Gone a TVNZ and RTE coproduction.",
        "birthday": "1963-07-11",
        "deathday": null,
        "gender": 1,
        "homepage": "https://cam.co.uk/talent/michelle-fairley/",
        "id": 20057,
        "imdb_id": "nm0265610",
        "known_for_department": "Acting",
        "name": "Michelle Fairley",
        "place_of_birth": "Coleraine, County Londonderry, Northern Ireland, UK",
        "popularity": 0.7839,
        "profile_path": "/eBKT3hf2W2YRwqgcKU92zfEttKp.jpg"
    }
}