{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hSRb0YhB4TaeIKgZtQbFuY3l0XM.jpg",
                "genre_ids": [
                    18,
                    10752
                ],
                "id": 143,
                "original_language": "en",
                "original_title": "All Quiet on the Western Front",
                "overview": "When a group of idealistic young men join the German Army during the Great War, they are assigned to the Western Front, where their patriotism is destroyed by the harsh realities of combat.",
                "popularity": 4.1542,
                "poster_path": "/1wZUB08igw8iLUgF1r4T6aJD65b.jpg",
                "release_date": "1930-04-29",
                "title": "All Quiet on the Western Front",
                "video": false,
                "vote_average": 7.741,
                "vote_count": 862,
                "character": "Paul Bäumer",
                "credit_id": "52fe421dc3a36847f80053ab",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Lewis Frederick Ayre III"
        ],
        "biography": "Lew Ayres was born in Minneapolis, Minnesota and raised in San Diego,  California. A college dropout, he was found by a talent scout in the  Coconut Grove nightclub in Los Angeles and entered Hollywood as a bit  player. He was leading man to Greta Garbo in The Kiss (1929), but it was the role of Paul Baumer in All Quiet on the Western Front  (1930) that was his big break. He was profoundly affected by the  anti-war message of that film, and when, in 1942, the popular star of Young Dr. Kildare  (1938) and subsequent Dr. Kildare films was drafted, he was a  conscientious objector. America was outraged, and theaters vowed never  to show his films again, but quietly he achieved the Medical Corps  status he had requested, serving as a medic under fire in the South  Pacific and as a chaplain's aid in New Guinea and the Phillipines. His  return to film after the war was undistinguished until Johnny Belinda (1948) - his role as the sympathetic physician treating the deaf-mute Jane Wyman  won him an Academy Award nomination as Best Actor. Subsequent movie  roles were scarce; an opportunity to play Dr. Kildare in television was  aborted when the network refused to honor his request for no cigarette  sponsorship. He continued to act, but in the 1970s put his long  experience into a project to bring to the west the philosophy of the  East - the resulting film, Altars of the World  (1976), while not a box-office success, won critical acclaim and a  Golden Globe Award. Lew Ayres died in Los Angeles, California on  December 30, 1996, just two days after his 88th birthday.",
        "birthday": "1908-12-28",
        "deathday": "1996-12-30",
        "gender": 2,
        "homepage": null,
        "id": 2007,
        "imdb_id": "nm0000817",
        "known_for_department": "Acting",
        "name": "Lew Ayres",
        "place_of_birth": "Minneapolis, Minnesota, USA",
        "popularity": 1.016,
        "profile_path": "/nNinKMWvSxrhiNMnMkbpUd4HEZO.jpg"
    }
}