{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/foS1hXCMagcl3GnK0hJHslNw9Ne.jpg",
                "genre_ids": [
                    53,
                    27,
                    9648,
                    18
                ],
                "id": 11482,
                "original_language": "en",
                "original_title": "Le locataire",
                "overview": "A quiet and inconspicuous man rents an apartment in Paris where he finds himself drawn into a rabbit hole of dangerous paranoia.",
                "popularity": 2.6188,
                "poster_path": "/4Qhzb1ICFMqE3isWoln497qSH7n.jpg",
                "release_date": "1976-05-26",
                "title": "The Tenant",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 1174,
                "character": "Man staring at Trelkovsky in the movie theatre (uncredited)",
                "credit_id": "66645735ea4670b74d91781f",
                "order": 38
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/foS1hXCMagcl3GnK0hJHslNw9Ne.jpg",
                "genre_ids": [
                    53,
                    27,
                    9648,
                    18
                ],
                "id": 11482,
                "original_language": "en",
                "original_title": "Le locataire",
                "overview": "A quiet and inconspicuous man rents an apartment in Paris where he finds himself drawn into a rabbit hole of dangerous paranoia.",
                "popularity": 2.6188,
                "poster_path": "/4Qhzb1ICFMqE3isWoln497qSH7n.jpg",
                "release_date": "1976-05-26",
                "title": "The Tenant",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 1174,
                "credit_id": "52fe44499251416c7502f5cf",
                "department": "Sound",
                "job": "Original Music Composer"
            },
            {
                "adult": false,
                "backdrop_path": "/5l3Xb2WQR0nXiVhbj5rAv0z4xsZ.jpg",
                "genre_ids": [
                    12,
                    18
                ],
                "id": 62204,
                "original_language": "fr",
                "original_title": "La Guerre du feu",
                "overview": "In the prehistoric world, a Cro-Magnon tribe depends on an ever-burning source of fire, which eventually extinguishes. Lacking the knowledge to start a new fire, the tribe sends three warriors on a quest for more. With the tribe's future at stake, the warriors make their way across a treacherous landscape full of hostile tribes and monstrous beasts. On their journey, they encounter Ika, a woman who has the knowledge they seek.",
                "popularity": 2.6316,
                "poster_path": "/tyzW1M00xfHKNtmTlT6wJ3F4pNr.jpg",
                "release_date": "1981-12-16",
                "title": "Quest for Fire",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 539,
                "credit_id": "688e9255b330b85a44a46178",
                "department": "Sound",
                "job": "Original Music Composer"
            },
            {
                "adult": false,
                "backdrop_path": "/jM6KRCEIIY1pGUIGemnp1rNY6ko.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 10102,
                "original_language": "fr",
                "original_title": "La Grande Bouffe",
                "overview": "Four friends gather at a villa with the intention of eating themselves to death.",
                "popularity": 2.9985,
                "poster_path": "/g4wOgslrQKprlQl927h0lQQ3P99.jpg",
                "release_date": "1973-05-16",
                "title": "La Grande Bouffe",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 525,
                "credit_id": "688e965a8c7fe394c961edec",
                "department": "Sound",
                "job": "Original Music Composer"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Philippe Sarde (born 21 June 1948) is a French film composer. Considered among the most versatile and talented French film composers of his generation, Sarde has scored over two hundred films, film shorts, and television mini-series. He received an Academy Award nomination for Tess (1979), and twelve César Award nominations, winning for Barocco (1976) and The Judge and the Assassin (1976). In 1993, Sarde received the Joseph Plateau Music Award.\n\nPhilippe Sarde was born 21 June 1948 in Neuilly-sur-Seine, Hauts-de-Seine, Île-de-France, France. His mother, Andrée Gabriel, was a singer in the Paris Opera. Through his mother's encouragement, he became interested in music from the early age of three. When he was four years old, he conducted a brief section of Carmen at the Paris Opera. At the age of five, he began experimenting with sound recording and made his first short films. Sarde loved both music and film, and had trouble deciding on his career direction.\n\nSarde entered the Paris Conservatory, where he studied harmony, counterpoint, fugue, and composition under Noël Gallon. At the age of seventeen, he directed a short 35-mm film in black and white, for which he composed the music, asking Vladimir Cosma to help him with the orchestration. At the age of eighteen, after writing songs for Régine, Sarde met Claude Sautet, who asked him to write the music for his film The Things of Life (1969). The experience established his career direction and initiated a long partnership with Sautet that spanned twenty-five years and eleven films.\n\nSarde also established close associations with directors Bertrand Tavernier, Pierre Granier-Deferre, Georges Lautner, André Téchiné, and Jacques Doillon. Sarde also collaborated with Roman Polanski on The Tenant and Tess, which garnered an Academy Award nomination, Bertrand Blier's on Beau-Père, Alain Corneau on Fort Saganne, and Marshall Brickman on Lovesick, The Manhattan Project, and Sister Mary Explains It All. In 1988, Sarde was a member of the jury at the Cannes Film Festival.\n\nFilm director Georges Lautner once observed that he was constantly amazed by the composer's ability to find a unique approach to each film that he scored. According to Yuri German, writing in the All Music Guide, Sarde's soundtracks are \"masterfully and unconventionally arranged\" and are often performed by such world-class musicians as Chet Baker, Stan Getz, Stéphane Grappelli, and Maurice Vander.\"\n\nIn April 1990, Sarde married Nave Florence, but they divorced the following year. In 1994, he married Clotilde Burre. They have two daughters, Ponette (born 1998) and Liza (born 1999). Both are enrolled in the seventeenth arrondissement of Paris. Sarde is the brother of producer Alain Sarde.\n\nSource: Article \"Philippe Sarde\" from Wikipedia in English, licensed under CC-BY-SA.",
        "birthday": "1948-06-21",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 20075,
        "imdb_id": "nm0006271",
        "known_for_department": "Sound",
        "name": "Philippe Sarde",
        "place_of_birth": "Neuilly-sur-Seine, Hauts-de-Seine, France",
        "popularity": 0.0889,
        "profile_path": "/hXtnCk9CAtUzn4pR1974EosvQOZ.jpg"
    }
}