{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fxXwBvym6DkqkO4AWn8OjwMfMc1.jpg",
                "genre_ids": [
                    35
                ],
                "id": 9421,
                "original_language": "fr",
                "original_title": "Le Dîner de cons",
                "overview": "For Pierre Brochant and his friends, Wednesday is “Idiots' Day”. The idea is simple: each person has to bring along an idiot. The one who brings the most spectacular idiot wins the prize. Tonight, Brochant is ecstatic. He has found a gem. The ultimate idiot, “A world champion idiot!”. What Brochant doesn’t know is that Pignon is a real jinx, a past master in the art of bringing on catastrophes...",
                "popularity": 3.7021,
                "poster_path": "/cv6neov6SMLjHytjiU0rgeugoPI.jpg",
                "release_date": "1998-04-15",
                "title": "The Dinner Game",
                "video": false,
                "vote_average": 7.766,
                "vote_count": 1987,
                "character": "Marlène Sasseur",
                "credit_id": "52fe44f5c3a36847f80b432d",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Catherine Hélène Germaine Frot",
            "Катрин Фро"
        ],
        "biography": "Catherine Frot (born 1 May 1956) is a French actress. A ten-time César Award nominee, she won the awards for Best Actress for Marguerite (2015) and Best Supporting Actress for Family Resemblances (1996). Her other films include Le Dîner de Cons (1998), La Dilettante (1999), and Haute Cuisine (2012).\n\nFrot was born in Paris, France, the daughter of an engineer and a mathematics teacher. Her younger sister, Dominique, is also an actress. Catherine demonstrated comic talent at an early age, and enrolled in the Versailles conservatory when she was fourteen and still at school. In 1974, she began her education at the Rue Blanche school and afterwards took up full-time studies at the conservatory.\n\nIn 1975, Frot appeared at the Festival d'Avignon with the Compagnie du Chapeau Rouge (Red Hat Company) which she founded with the help of others. From then on, Catherine put all her energy into theatre performances in roles such as the Présidente de Tourvel in the play Les Liaisons dangereuses in 1987. She performed in a number of classical plays such as La Cerisaie, directed by Peter Brook in 1982, and La Mouette directed by Pierre Pradinas in 1985.\n\nIn films, Frot won the César Award for Best Actress in a Supporting Role in 1996, for playing Yolande, 'the sweet silly wife of a provincial bully' in Cédric Klapisch's Un air de famille and was funny and moving as a wealthy, rebellious nuisance in La Dilettante (1999). In 7 ans de mariage, she played a prudish banker, wife and mother, who is drawn by her bored, sexually frustrated husband into the world of Parisian \"clubs échangistes\" (\"wife-swapping clubs\"). She is an officer of the Ordre national du Mérite.\n\nSource: Article \"Catherine Frot\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1956-05-01",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 20080,
        "imdb_id": "nm0296594",
        "known_for_department": "Acting",
        "name": "Catherine Frot",
        "place_of_birth": "Paris, France",
        "popularity": 0.3934,
        "profile_path": "/mLYcrvglYGoPEjwBB5jyUe2ku8e.jpg"
    }
}