{
    "movies": {
        "cast": [],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Sammy Davis",
            "Samuel George Davis Jr.",
            "Samuel George Davis",
            "The Will Maston Trio",
            "Will Maston Trio",
            "Sammy Jr. & Altovise",
            "Sammy Davis Jnr.",
            "Сэмми Дэвис мл.",
            "Sammy Davis, Jr."
        ],
        "biography": "Samuel George \"Sammy\" Davis, Jr. (December 8, 1925 – May 16, 1990) was an American entertainer.\n\nPrimarily a dancer and singer, Davis was a childhood vaudevillian who became known for his performances on Broadway and in Las Vegas, as a recording artist, television and film star, and as a member of Frank Sinatra's \"Rat Pack\".\n\nAt the age of three Davis began his career in vaudeville with his father and \"uncle\" as the Will Mastin Trio, toured nationally, and after military service, returned to the trio. Davis became an overnight sensation following a nightclub performance at Ciro's after the 1951 Academy Awards, with the trio, became a recording artist, and made his first film performances as an adult later that decade. In 1954, he lost his left eye in an automobile accident. Later the same year, he converted to Judaism. In 1960, he appeared in the first Rat Pack movie, Ocean's 11. After a starring role on Broadway in 1956's Mr Wonderful, Davis returned to the stage in 1964's Golden Boy, and in 1966 had his own TV variety show, The Sammy Davis Jr. Show. Davis's career slowed in the late sixties, but he had a hit record with \"The Candy Man\", in 1972, and became a star in Las Vegas.\n\nAs an African American, Davis was the victim of racism throughout his life, and was a large financial supporter of civil rights causes. Davis had a complex relationship with the African American community, and attracted criticism after physically embracing Richard Nixon in 1970. One day on a golf course with Jack Benny, he was asked what his handicap was. \"Handicap?\" he asked. \"Talk about handicap — I'm a one-eyed Negro Jew.\" This was to become a signature comment, recounted in his autobiography, and in countless articles.\n\nAfter reuniting with Sinatra and Dean Martin in 1987, Davis toured with them and Liza Minnelli internationally, before dying of throat cancer in 1990. He died in debt to the Internal Revenue Service, and his estate was the subject of legal battles.\n\nDavis was awarded the Spingarn Medal by the NAACP, and was nominated for a Golden Globe and an Emmy Award for his television performances. He was the recipient of the Kennedy Center Honors in 1987, and in 2001, he was posthumously awarded the Grammy Lifetime Achievement Award.\n\nDescription above from the Wikipedia article Sammy Davis, Jr., licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": "1925-12-08",
        "deathday": "1990-05-16",
        "gender": 2,
        "homepage": null,
        "id": 20156,
        "imdb_id": "nm0002035",
        "known_for_department": "Acting",
        "name": "Sammy Davis Jr.",
        "place_of_birth": "Harlem, Manhattan, New York City, New York, USA",
        "popularity": 0.3191,
        "profile_path": "/b6UVWbUBAR280fSC85FgyPSmxHe.jpg"
    }
}