{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hSRb0YhB4TaeIKgZtQbFuY3l0XM.jpg",
                "genre_ids": [
                    18,
                    10752
                ],
                "id": 143,
                "original_language": "en",
                "original_title": "All Quiet on the Western Front",
                "overview": "When a group of idealistic young men join the German Army during the Great War, they are assigned to the Western Front, where their patriotism is destroyed by the harsh realities of combat.",
                "popularity": 4.7579,
                "poster_path": "/1wZUB08igw8iLUgF1r4T6aJD65b.jpg",
                "release_date": "1930-04-29",
                "title": "All Quiet on the Western Front",
                "video": false,
                "vote_average": 7.741,
                "vote_count": 862,
                "character": "Albert Kropp",
                "credit_id": "52fe421dc3a36847f80053cb",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/ft8WRF2xqEwwGWa59naDUybKTAx.jpg",
                "genre_ids": [
                    18,
                    10752,
                    10749
                ],
                "id": 770,
                "original_language": "en",
                "original_title": "Gone with the Wind",
                "overview": "The spoiled daughter of a Georgia plantation owner conducts a tumultuous romance with a cynical profiteer during the American Civil War and Reconstruction Era.",
                "popularity": 7.332,
                "poster_path": "/lNz2Ow0wGCAvzckW7EOjE03KcYv.jpg",
                "release_date": "1939-12-15",
                "title": "Gone with the Wind",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 4191,
                "character": "Mounted Officer",
                "credit_id": "52fe4274c3a36847f801fe8d",
                "order": 41
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Billy Bakewell",
            "William Bakewell Jr.",
            "Bill Bakewell"
        ],
        "biography": "William Bakewell (May 2, 1908 – April 15, 1993), also known as Billy Bakewell, was an American actor, who achieved his greatest fame as one of the premiere juvenile performers of the late 1920s and early 1930s.\n\nBakewell, educated at Los Angeles Harvard Military School, began his film career as an extra in the silent movie Fighting Blood (1924), and went on to appear in some 170 films and television shows. He had supporting roles at the end of the silent era and reached the peak of his career around 1930. He is perhaps best remembered for playing German soldier Albert Kropp in the film classic All Quiet on the Western Front (1930), and Rodney Jordan, Joan Crawford's brother, in Dance, Fools, Dance (1931). He also co-starred in Gold Diggers of Broadway (1929) with Winnie Lightner and Lilyan Tashman. In 1933, he contributed to the founding of the Screen Actors Guild, and was member 44 of the original 50. He never achieved stardom after the Depression years, although he became familiar in dozens of films, including his short appearance as a mounted soldier in Gone with the Wind (1939) whom Scarlett O'Hara asks when the Yankee soldiers are coming to Atlanta.\n\nDuring World War II, he served in the U.S. Army with the rank of second lieutenant. He was stationed at the 73rd Evacuation Hospital and at the Radio Section of the Special Service Division as the Post Intelligence Officer. He also worked under the department that handled distribution of recorded programs to overseas station circuits.\n\nHe starred in the Columbia Pictures serial Hop Harrigan (1946), where he played a top Air Corps pilot. He also portrayed Major Tobias Norton and a Keelboat Race Master of Ceremonies in the phenomenally popular Disney series Davy Crockett (1954-1955).\n\nIn the 1960s, he guest starred in numerous situation comedy television series, including Guestward, Ho!, Pete and Gladys, Bringing Up Buddy, The Tab Hunter Show, Mister Ed, Leave It to Beaver, The Jack Benny Program, Petticoat Junction , and Hazel. He also was cast in episodes of Peter Gunn, Sea Hunt, Wagon Train, The Roaring 20s, The Virginian, Arrest and Trial, and 87th Precinct He played the Virginia statesman George Wythe in the episode \"George Mason\" in the 1965 NBC documentary series, Profiles in Courage. He made his last film in 1975.\n\nFor four decades, Bakewell served on the board of Motion Picture and Television Fund. He died on April 15, 1993 of leukemia at the age of 84.",
        "birthday": "1908-05-02",
        "deathday": "1993-04-15",
        "gender": 2,
        "homepage": null,
        "id": 2015,
        "imdb_id": "nm0049055",
        "known_for_department": "Acting",
        "name": "William Bakewell",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.3701,
        "profile_path": "/aQaCjcPXFBsoFRlZ0esLW7TxcZn.jpg"
    }
}