{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lNmIAX1IuPIEPMHhLBEm4wmhYX0.jpg",
                "genre_ids": [
                    12,
                    16,
                    18,
                    10751
                ],
                "id": 10948,
                "original_language": "en",
                "original_title": "The Fox and the Hound",
                "overview": "When a feisty little fox named Tod is adopted into a farm family, he quickly becomes friends with a fun and adorable hound puppy named Copper. Life is full of hilarious adventures until Copper is expected to take on his role as a hunting dog -- and the object of his search is his best friend!",
                "popularity": 6.2985,
                "poster_path": "/aC3k6XBaYnulGSkK8263ABjU3Md.jpg",
                "release_date": "1981-07-10",
                "title": "The Fox and the Hound",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 3354,
                "character": "Big Mama (voice)",
                "credit_id": "52fe43d79251416c75020327",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Pearl Mae Bailey"
        ],
        "biography": "Pearl Mae Bailey, born in Virginia on March 29, 1918, was an American actress and singer. Bailey began by singing and dancing in Philadelphia’s black nightclubs in the 1930s, and soon started performing in other parts of the East Coast. In 1941, during World War II, Bailey toured the country with the USO, performing for American troops. After the tour, she settled in New York. Her solo successes as a nightclub performer were followed by acts with such entertainers as Cab Calloway and Duke Ellington. In 1946, Bailey made her Broadway debut in St. Louis Woman. Bailey continued to tour and record albums in between her stage and screen performances. Her rendition of \"Takes Two to Tango\" hit the top ten in 1952. On November 19, 1952, Bailey married jazz drummer Louie Bellson in London. They adopted a child, Tony, in the mid-1950s, and subsequently a girl, Dee Dee J. Bellson, born April 20, 1960. In 1954, she took the role of Frankie in the film version of Carmen Jones, and her rendition of \"Beat Out That Rhythm on the Drum\" is one of the highlights of the film. She also starred in the Broadway musical House of Flowers. In 1959, she played the role of Maria in the film version of Porgy and Bess, starring Sidney Poitier and Dorothy Dandridge. Also that year, she played the role of \"Aunt Hagar\" in the movie St. Louis Blues, alongside Mahalia Jackson, Eartha Kitt, and Nat King Cole. Though she was originally considered for the part of Annie Johnson in the 1959 film Imitation of Life, the part went to Juanita Moore. A passionate fan of the New York Mets, Bailey sang the national anthem at Shea Stadium prior to game 5 of the 1969 World Series, and appears in the Series highlight film showing her support for the team. She also sang the national anthem prior to game 1 of the 1981 World Series between the New York Yankees and Los Angeles Dodgers at Yankee Stadium. Bailey, a Republican, was appointed by President Richard Nixon as America's \"Ambassador of Love\" in 1970. She attended several meetings of the United Nations and later appeared in a campaign ad for President Gerald Ford in the 1976 election. Also during the 1970s she had her own television show, and she also provided voices for animations such as Tubby the Tuba (1976) and Disney's The Fox and the Hound (1981). She returned to Broadway in 1975, playing the lead in an all-black production of Hello, Dolly!. At age 67, she earned a B.A. in theology from GeorgetownUniversity in Washington, D.C., in 1985. Later in her career, Bailey was a fixture as a spokesperson in a series of Duncan Hines commercials, singing \"Bill Bailey (Won't You Come Home)\". In her later years Bailey wrote several books: The Raw Pearl (1968), Talking to Myself (1971), Pearl's Kitchen (1973), and Hurry Up America and Spit (1976). In 1975 she was appointed special ambassador to the United Nations by President Gerald Ford. Her last book, Between You and Me (1989), details her experiences with higher education. In 1988 Bailey received the Presidential Medal of Freedom from President Ronald Reagan. On August 17, 1990, Bailey died of heart condition. She is buried at RollingGreenMemorial Park in West Chester, Pennsylvania. During her lifetime, she won a Tony Award for the title role in the all-black production of Hello, Dolly! in 1968. In 1986, she won a Daytime Emmy award for her performance as a fairy godmother in the ABC Afterschool Special, Cindy Eller: A Modern Fairy Tale.",
        "birthday": "1918-03-29",
        "deathday": "1990-08-17",
        "gender": 1,
        "homepage": null,
        "id": 20157,
        "imdb_id": "nm0047440",
        "known_for_department": "Acting",
        "name": "Pearl Bailey",
        "place_of_birth": "Newport News, Virginia, USA",
        "popularity": 0.2288,
        "profile_path": "/oX4MFLmCuZWQQctbgx4nsQtGJvG.jpg"
    }
}