{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gkyYZSevVI6zbGrLDmSo9Im88Qv.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 10322,
                "original_language": "en",
                "original_title": "Being There",
                "overview": "A simple-minded gardener named Chance has spent all his life in the Washington D.C. house of an old man. When the man dies, Chance is put out on the street with no knowledge of the world except what he has learned from television.",
                "popularity": 2.5453,
                "poster_path": "/3RO3jbCKEey2T9bYFkYt9xpwen9.jpg",
                "release_date": "1979-12-19",
                "title": "Being There",
                "video": false,
                "vote_average": 7.613,
                "vote_count": 1046,
                "character": "Louise",
                "credit_id": "52fe43599251416c7500cebb",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/gC0zFICTbsmJrUfAcHJl76nA0GC.jpg",
                "genre_ids": [
                    80,
                    53,
                    28
                ],
                "id": 8333,
                "original_language": "en",
                "original_title": "The Taking of Pelham One Two Three",
                "overview": "In New York, armed men hijack a subway car and demand a ransom for the passengers. Even if it's paid, how could they get away?",
                "popularity": 4.0318,
                "poster_path": "/vNhywp9w1DVG6BytxKp4kjtaaGC.jpg",
                "release_date": "1974-10-02",
                "title": "The Taking of Pelham One Two Three",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 576,
                "character": "Mayor's Nurse",
                "credit_id": "6223ab458d52c90068451e9f",
                "order": 39
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nRuth Attaway (June 28, 1910 – September 21, 1987) was an American film and stage actress. Among the films she appeared in include Raintree County (1957), Porgy and Bess (1959) and Being There (1979).\n\nAttaway was born on June 28, 1910, in Greenville, Mississippi. She was the daughter of physician W.A. Attaway, PhD. Her siblings included a sister, Florence and a brother, William. She graduated from the University of Illinois, where she majored in sociology.\n\nAttaway made her Broadway debut in 1936 in the Pulitzer Prize winning play, You Can't Take It with You. She was the first director of the New York Players Guild, a black repertory theater company formed in New York in 1945. From 1954 to 1955, she portrayed Anna Hicks in the play Mrs. Patterson at the National Theater. From 1964 to 1967, she was with the Repertory Society of Lincoln Center.\n\nAttaway made her film debut by portraying Moll in The President's Lady (1953), opposite Susan Hayward and Charlton Heston. She went on to play a variety of characters in film such as Philomena in The Young Don't Cry (1957), Serena Robbins in Porgy and Bess (1959), the Farmer's Wife in Terror in the City (1964), Edna in Conrack (1974) and Louise in Being There (1979).\n\nIn 1954, Attaway was within the cast of an unaired pilot titled Three's Company. She also played Delia in the 1978 television movie, The Bermuda Depths.\n\nAttaway was married to Allan Morrison, an editor of Ebony. He died on May 29, 1968, at the age of 51. Attaway died on September 21, 1987, in New York Hospital of injuries resulting from a Manhattan apartment fire. She was 77 years old.",
        "birthday": "1910-06-28",
        "deathday": "1987-09-21",
        "gender": 1,
        "homepage": null,
        "id": 20160,
        "imdb_id": "nm0040984",
        "known_for_department": "Acting",
        "name": "Ruth Attaway",
        "place_of_birth": "Greenville, Mississippi, USA",
        "popularity": 0.0516,
        "profile_path": "/jJJ52XIt0KMogDvvWjAA0c6rWsr.jpg"
    }
}