{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1l1013J6IQIipxN7KHTWipVngT0.jpg",
                "genre_ids": [
                    35,
                    16,
                    10751
                ],
                "id": 227973,
                "original_language": "en",
                "original_title": "The Peanuts Movie",
                "overview": "Snoopy embarks upon his greatest mission as he and his team take to the skies to pursue their arch-nemesis, while his best pal Charlie Brown begins his own epic quest.",
                "popularity": 6.0905,
                "poster_path": "/aiwdwnl7RFs1vcBanOKr13ye3wE.jpg",
                "release_date": "2015-11-05",
                "title": "The Peanuts Movie",
                "video": false,
                "vote_average": 6.936,
                "vote_count": 1724,
                "character": "Miss Othmar / Mrs. Little Red-Haired Girl (voice)",
                "credit_id": "5ac64ff092514162ae010df9",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Troy 'Trombone Shorty' Andrews",
            "Troy Michael Andrews",
            "Troy Andrews"
        ],
        "biography": "Troy Michael Andrews was a 4-year-old boy when he first-handed a trombone. That young player emulated the musicians he heard playing in the “second line” parades, most notably his older brother James, a skilled performer in his own right. Young Troy was so small, and his instrument was twice his size, that he earned the nickname “Trombone Shorty”. Over the years, he listened attentively to his elders who educated him on the New Orlean’s deeply-rooted musical traditions. His capable hands absorbed these lessons, and he practiced constantly. A band-leader at age 8 and touring musician at 10, Trombone Shorty’s horn became his passport that opened the doors to the world.\n\nRespectful of and inspired by the music’s history, Troy developed a foundation built upon the many musical traditions of his hometown (jazz, gospel, and R&B), and updated them with modern rock and hip-hop influences. In doing so, he has created his own style, one he calls “SupaFunkRock”.",
        "birthday": "1986-01-02",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.tromboneshorty.com",
        "id": 2016486,
        "imdb_id": "nm1661252",
        "known_for_department": "Acting",
        "name": "Trombone Shorty",
        "place_of_birth": "New Orleans, Louisiana, USA",
        "popularity": 0.0509,
        "profile_path": "/gEBMoiOmJ98Ur3cbcjDblwUhgUQ.jpg"
    }
}