{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/y3zUOMWRoI2vC4ck2GBJyFWhzyA.jpg",
                "genre_ids": [
                    35,
                    10751,
                    10749
                ],
                "id": 9820,
                "original_language": "en",
                "original_title": "The Parent Trap",
                "overview": "Hallie Parker and Annie James are identical twins who were separated at a young age due to their parents' divorce. Unbeknownst to their parents, the girls are sent to the same summer camp, where they meet, discover the truth about their relationship, and come up with a plan to switch places in an effort to reunite their mother and father.",
                "popularity": 12.468,
                "poster_path": "/p4dGmi8u9W0HHyVXcgWPoiFfKTF.jpg",
                "release_date": "1998-07-28",
                "title": "The Parent Trap",
                "video": false,
                "vote_average": 7.219,
                "vote_count": 4351,
                "character": "Elizabeth James",
                "credit_id": "52fe4534c3a36847f80c1e9f",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Natasha Jane Richardson"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nNatasha Jane Richardson (11 May 1963 – 18 March 2009) was an English actress of stage and screen. A member of the Redgrave family, she was the daughter of actress Vanessa Redgrave and director/producer Tony Richardson and the granddaughter of Michael Redgrave and Rachel Kempson. Early in her career, she portrayed Mary Shelley and Patty Hearst in feature films, and she received critical acclaim and a Theatre World Award for her Broadway debut in the 1993 revival of Anna Christie. She won the Tony Award for Best Performance by a Leading Actress in a Musical, the Drama Desk Award for Outstanding Actress in a Musical, and the Outer Critics Circle Award for her performance as Sally Bowles in the 1998 Broadway revival of Cabaret. Some of her notable films included Patty Hearst (1988), The Handmaid's Tale (1990), Nell (1994), The Parent Trap (1998) and Maid in Manhattan (2002).\n\nHer first marriage to filmmaker Robert Fox ended in divorce in 1992. In 1994, she married Irish actor Liam Neeson, whom she had met when the two appeared in Anna Christie. The couple had two sons, Micheál and Daniel. Richardson's father died of AIDS-related causes in 1991. She helped raise millions of dollars in the fight against AIDS through the charity amfAR, the American Foundation for AIDS Research. Richardson died in 2009 following a head injury sustained when she fell during a skiing lesson in Quebec.\n\nDescription above from the Wikipedia article Natasha Richardson, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1963-05-11",
        "deathday": "2009-03-18",
        "gender": 1,
        "homepage": null,
        "id": 20162,
        "imdb_id": "nm0001670",
        "known_for_department": "Acting",
        "name": "Natasha Richardson",
        "place_of_birth": "London, England, United Kingdom",
        "popularity": 1.1302,
        "profile_path": "/eQNhOUDQY4NZD2cbaUpltLxrcG.jpg"
    }
}