{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5nkKy7eEDsXqsxFLJy3GxZhE90J.jpg",
                "genre_ids": [
                    16,
                    14,
                    18,
                    12
                ],
                "id": 476292,
                "original_language": "ja",
                "original_title": "さよならの朝に約束の花をかざろう",
                "overview": "Maquia is a member of a special race called the Iorph who can live for hundreds of years. However, Maquia has always felt lonely despite being surrounded by her people, as she was orphaned from a young age. She daydreams about the outside world, but dares not travel from her home due to the warnings of the clan's chief.  One day the kingdom of Mezarte invades her homeland. They already have what is left of the giant dragons, the Renato, under their control, and now their king wishes to add the immortality to his bloodline.  They ravage the Iorph homeland and kill most of its inhabitants. Caught in the midst of the attack, Maquia is carried off by one of the Renato. It soon dies, and she is left deserted in a forest, now truly alone save for the cries of a single baby off in the distance. Maquia finds the baby in a destroyed village and decides to raise him as her own, naming him Ariel. Although she knows nothing of the human world, how to raise a child that ages much faster than her.",
                "popularity": 2.59,
                "poster_path": "/hL3NqRE2ccR4Y2sYSJTrmalRjrz.jpg",
                "release_date": "2018-02-24",
                "title": "Maquia: When the Promised Flower Blooms",
                "video": false,
                "vote_average": 8.183,
                "vote_count": 667,
                "character": "Hyke (voice)",
                "credit_id": "646f7ba217c44300fce18c5e",
                "order": 25
            },
            {
                "adult": false,
                "backdrop_path": "/b9qGMCOrMbxUjD6xDAYPoIPnYcC.jpg",
                "genre_ids": [
                    16,
                    28,
                    12,
                    14
                ],
                "id": 505262,
                "original_language": "ja",
                "original_title": "僕のヒーローアカデミア THE MOVIE ～2人の英雄～",
                "overview": "All Might and Deku accept an invitation to go abroad to a floating and mobile manmade city, called 'I-Island', where they research quirks as well as hero supplemental items at the special 'I-Expo' convention that is currently being held on the island. During that time, suddenly, despite an iron wall of security surrounding the island, the system is breached by a villain, and the only ones able to stop him are the students of Class 1-A.",
                "popularity": 4.5358,
                "poster_path": "/hC4nTxdhXqFWzgqynGvvXVMiMNp.jpg",
                "release_date": "2018-08-03",
                "title": "My Hero Academia: Two Heroes",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 1061,
                "character": "(voice)",
                "credit_id": "60ac91c50f36550029cd3bcc",
                "order": 37
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ryouta Iwasaki",
            "Ryōta Iwasaki",
            "いわさき りょうた",
            "岩崎 諒太"
        ],
        "biography": "Ryota Iwasaki (岩崎 諒太, Iwasaki Ryōta, July 1, 1986) is a Japanese voice actor born in Osaka Prefecture, Japan. He is affiliated with Atomic Monkey and is a member of the theater company Herohero Q Company (Gekidan Herohero Q Company, commonly known as Hero Q).",
        "birthday": "1986-07-01",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.atomicmonkey.jp/talent/iwasakiryouta",
        "id": 2019929,
        "imdb_id": "nm9220596",
        "known_for_department": "Acting",
        "name": "Ryota Iwasaki",
        "place_of_birth": "Osaka, Japan",
        "popularity": 0.4577,
        "profile_path": "/2aIpmhJ6R49ijYapEAeaAFS9U8g.jpg"
    }
}