{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hwUxHPkuUleJeoick4uZsrKDXxF.jpg",
                "genre_ids": [
                    16,
                    878,
                    10751,
                    12
                ],
                "id": 718789,
                "original_language": "en",
                "original_title": "Lightyear",
                "overview": "Legendary Space Ranger Buzz Lightyear embarks on an intergalactic adventure alongside a group of ambitious recruits and his robot companion Sox.",
                "popularity": 6.0412,
                "poster_path": "/b9t3w1loraDh7hjdWmpc9ZsaYns.jpg",
                "release_date": "2022-06-15",
                "title": "Lightyear",
                "video": false,
                "vote_average": 6.901,
                "vote_count": 3633,
                "character": "Airman Diaz (voice)",
                "credit_id": "62028b0496670e008f84c22a",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Efren Antonio Ramirez"
        ],
        "biography": "Efren Antonio Ramirez (born October 2, 1973) is an American actor. He is most known as Pedro in the feature film Napoleon Dynamite.\n\nInitially, his career consisted of guest star appearances on television, as he appeared in diverse roles on E.R., American Dad, Judging Amy, The District, MAD TV, and Scrubs.\n\nHowever, it was his memorable portrayal of Pedro in the feature film Napoleon Dynamite that dramatically launched what has become a hugely prolific acting career with an unusually diverse series of performances\n\nIn the years since that film was released, Efren Ramirez has appeared in scores of films and television shows including leading roles in the HBO film Walkout, with Edward James Olmos; Employee of the Month, opposite Dane Cook and Dax Shepard; and Crank and its sequel Crank: High Voltage, opposite Jason Statham (playing his own twin brother in the sequel). He has also appeared in other movies including Gamer with Gerard Butler; When in Rome with Kristen Bell; Crossing the Heart, opposite Kris Kristofferson; House of My Father, opposite Will Ferrell; HBO's Eastbound and Down with Danny McBride; and Perpetual Grace Ltd.\n\nHe appeared in FOX's The Grinder with Rob Lowe and voiced for the animated series Bordentown with Hank Azaria and Alex Bernstein, Hulu's Deadbeat with Tyler Labine, and the film Middleschool: The Worst Years of My Life, based on the James Patterson best seller.\n\nWhen he isn't filming, he is spinning records as a guest D.J. in clubs all across the country. He has published his first book, Direct Your Own Life . ",
        "birthday": "1973-10-02",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 20190,
        "imdb_id": "nm0708293",
        "known_for_department": "Acting",
        "name": "Efren Ramirez",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.5127,
        "profile_path": "/vo4IDt4NeNCHBXLz58Wjlx5994a.jpg"
    }
}