{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5AhkjcqqRxBdpYZ0TeOuTCuOUYq.jpg",
                "genre_ids": [
                    80,
                    53,
                    18
                ],
                "id": 429200,
                "original_language": "en",
                "original_title": "Good Time",
                "overview": "After a botched bank robbery lands his younger brother in prison, Connie Nikas embarks on a twisted odyssey through New York City's underworld to get his brother Nick out of jail.",
                "popularity": 2.7366,
                "poster_path": "/yE1c9hj5Hf8a9KplAdRdhADqUro.jpg",
                "release_date": "2017-08-11",
                "title": "Good Time",
                "video": false,
                "vote_average": 7.214,
                "vote_count": 2949,
                "character": "Arcade Guy (uncredited)",
                "credit_id": "5ae72b9e0e0a26105400bca5",
                "order": 83
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Edgar Morais is a Portuguese actor, director, screenwriter, and film editor living in New York. Edgar won the award for Best Actor at Prishtina International Film Festival and the Best Acting award at Cineuphoria for his performance in Albania's official Oscar submission A Cup of Coffee and New Shoes On, for which he received rave reviews from international press such as Variety and Screen International. His directorial works include Heatstroke which screened in competition at PÖFF Shorts, Maryland Film Festival, IndieLisboa and others and We Won't Forget which screened at over 25 festivals including Palm Springs ShortFest, Hamptons, Woodstock, Tirana, Dresden, Rooftop Films, IndieLisboa and Rio de Janeiro and went on to win the Grand Jury Prize and the award for Best Editing at Castrovillari, and the Honorable Mention at FEST New Directors New Films. The film was also nominated for a Portuguese Academy Award (Sophia) for Best Short Film and was selected as Vimeo Staﬀ Pick and Short of the Week.",
        "birthday": "1989-06-25",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2019944,
        "imdb_id": "nm2273354",
        "known_for_department": "Acting",
        "name": "Edgar Morais",
        "place_of_birth": "Coimbra, Portugal",
        "popularity": 0.084,
        "profile_path": "/pQuUrySXs6HEDyrLGnnA8zXrxxO.jpg"
    }
}