{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kzXUQnrUnHUGHuwWbgf9KpoU3qr.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 544401,
                "original_language": "en",
                "original_title": "Cherry",
                "overview": "Cherry drifts from college dropout to army medic in Iraq - anchored only by his true love, Emily. But after returning from the war with PTSD, his life spirals into drugs and crime as he struggles to find his place in the world.",
                "popularity": 3.3794,
                "poster_path": "/pwDvkDyaHEU9V7cApQhbcSJMG1w.jpg",
                "release_date": "2021-02-26",
                "title": "Cherry",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1323,
                "character": "Drill Sgt. Deco",
                "credit_id": "5fbe90abf9475b0040c5fb5d",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "José Pablo Cantillo"
        ],
        "biography": "​From Wikipedia, the free encyclopedia.  \n\nJose Pablo Cantillo (born March 30, 1979) is an American actor of Costa Rican descent. Jose Pablo Cantillo (known as 'Joey' in his HS days) grew up in Terre Haute, Indiana, and attended Terre Haute South Vigo High School where he was a tennis standout for all 4 years, leading the Terre Haute South Braves to a State Runner-Up finish in 1996. He attended Indiana University, and graduated in 2002 with a double major in Finance and Marketing. Cantillo then decided to pursue an acting career in New York City after taking some drama classes at IU. In late 2003, he moved to California, where he and his wife Kristi, and their 7-year-old daughter live in Santa Clarita, a town “that kind of reminds us of Terre Haute.” After doing off-Broadway plays in New York, Cantillo landed guest roles on popular television series from early 2000 to present. After 2006 he started getting supporting and large roles.",
        "birthday": "1979-03-30",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 20191,
        "imdb_id": "nm1504678",
        "known_for_department": "Acting",
        "name": "Jose Pablo Cantillo",
        "place_of_birth": "Marshfield, Wisconsin, USA",
        "popularity": 1.1427,
        "profile_path": "/qtNesvN1bAQ779gJBt3LYDsm8f7.jpg"
    }
}