{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3zCPI4JFc54xvLaJ71oI2KoP3az.jpg",
                "genre_ids": [
                    80,
                    9648,
                    53
                ],
                "id": 1949,
                "original_language": "en",
                "original_title": "Zodiac",
                "overview": "The Zodiac murders cause the lives of Paul Avery, David Toschi and Robert Graysmith to intersect.",
                "popularity": 7.951,
                "poster_path": "/6YmeO4pB7XTh8P8F960O1uA14JO.jpg",
                "release_date": "2007-03-02",
                "title": "Zodiac",
                "video": false,
                "vote_average": 7.528,
                "vote_count": 11041,
                "character": "Templeton Peck",
                "credit_id": "52fe4325c3a36847f803dd2d",
                "order": 18
            },
            {
                "adult": false,
                "backdrop_path": "/rGPoNNk4fvgG2mvkNAxJJPlszOu.jpg",
                "genre_ids": [
                    80,
                    18,
                    53
                ],
                "id": 11368,
                "original_language": "en",
                "original_title": "Blood Simple",
                "overview": "The owner of a seedy small-town Texas bar discovers that one of his employees is having an affair with his wife. A chaotic chain of misunderstandings, lies and mischief ensues after he devises a plot to have them murdered.",
                "popularity": 5.0904,
                "poster_path": "/svU6pu4lfHn0T5BVZchVxL58HB5.jpg",
                "release_date": "1984-03-26",
                "title": "Blood Simple",
                "video": false,
                "vote_average": 7.243,
                "vote_count": 1515,
                "character": "Ray",
                "credit_id": "52fe44329251416c7502c1f3",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/2olgnm402FuL7kQHUQwyRSj0SmD.jpg",
                "genre_ids": [
                    27,
                    878
                ],
                "id": 9426,
                "original_language": "en",
                "original_title": "The Fly",
                "overview": "When Seth Brundle makes a huge scientific and technological breakthrough in teleportation, he decides to test it on himself. Unbeknownst to him, a common housefly manages to get inside the device and the two become one.",
                "popularity": 6.143,
                "poster_path": "/8gZWMhJHRvaXdXsNhERtqNHYpH3.jpg",
                "release_date": "1986-08-15",
                "title": "The Fly",
                "video": false,
                "vote_average": 7.422,
                "vote_count": 4695,
                "character": "Stathis Borans",
                "credit_id": "52fe44f6c3a36847f80b4557",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/3nx1jkMcWlcjmlDgEDFzW1Tykv0.jpg",
                "genre_ids": [
                    18,
                    10752
                ],
                "id": 2604,
                "original_language": "en",
                "original_title": "Born on the Fourth of July",
                "overview": "Paralyzed in the Vietnam war, Ron Kovic becomes an anti-war and pro-human rights political activist after feeling betrayed by the country he fought for.",
                "popularity": 8.918,
                "poster_path": "/c5gSie6ZA90iBs62yNM5MV4y9R7.jpg",
                "release_date": "1989-12-20",
                "title": "Born on the Fourth of July",
                "video": false,
                "vote_average": 7.017,
                "vote_count": 1790,
                "character": "Marine Major - Vietnam",
                "credit_id": "55e8799bc3a3682c760029ae",
                "order": 35
            },
            {
                "adult": false,
                "backdrop_path": "/cq9N64ucEtfIc3eMxNr1VzY9LH9.jpg",
                "genre_ids": [
                    18
                ],
                "id": 37799,
                "original_language": "en",
                "original_title": "The Social Network",
                "overview": "In 2003, Harvard undergrad and computer programmer Mark Zuckerberg begins work on a new concept that eventually turns into the global social network known as Facebook. Six years later, Mark is one of the youngest billionaires ever, but his unprecedented success leads to both personal and legal complications when he ends up on the receiving end of two lawsuits, one involving his former friend.",
                "popularity": 8.6898,
                "poster_path": "/n0ybibhJtQ5icDqTp8eRytcIHJx.jpg",
                "release_date": "2010-10-01",
                "title": "The Social Network",
                "video": false,
                "vote_average": 7.37,
                "vote_count": 12634,
                "character": "Sy",
                "credit_id": "5643e582c3a36870e800393b",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/saa1scU6UIBJi9bMEvLNzXXKnDD.jpg",
                "genre_ids": [
                    18
                ],
                "id": 294016,
                "original_language": "en",
                "original_title": "Trumbo",
                "overview": "The career of screenwriter Dalton Trumbo is halted by a witch hunt in the late 1940s when he defies the anti-communist HUAC committee and is blacklisted.",
                "popularity": 5.8856,
                "poster_path": "/2RERIRnZkROSeHZAIf8PSxhzOqs.jpg",
                "release_date": "2015-10-27",
                "title": "Trumbo",
                "video": false,
                "vote_average": 7.158,
                "vote_count": 1619,
                "character": "Sam Wood",
                "credit_id": "566cf3a392514125d30052b5",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "John William Getz ",
            "جان گتز"
        ],
        "biography": "​John Getz (born October 15, 1946) is an American actor.  Getz dropped out of college to attend the American Conservatory Theater in San Francisco. While working in a winery, he helped found the Theater Company in Napa County, California. His location in the grape-growing Napa Valley led to Getz's television debut in a made-for-television horror film Killer Bees. Killer Bees starred Gloria Swanson, Craig Stevens, Kate Jackson, and Edward Albert. Getz then moved to New York City, where he became active in local theater while doing an 18-month stint as Neil Johnson on the soap opera Another World.\n\nGetz appeared in The Happy Hooker and followed up with several other roles before starring in the Coen Brothers' neo-noir thriller Blood Simple. He played the doomed lover of a married woman (Frances McDormand) who woefully misinterprets his increasingly complex circumstances.\n\nGetz also appeared in The Fly and The Fly II as Stathis Borans, a science magazine editor who pays a heavy price for his curiosity. Also in 1989, he played a Marine Corps Major in Born on the Fourth of July. In 1991, Getz appeared as the unpleasant boyfriend of professional women in Don't Tell Mom the Babysitter's Dead and Curly Sue. In 1990, Getz appeared as a crime boss in the Charlie Sheen and Emilio Estevez spoof Men At Work. In 1994, he appeared in the film Playmaker, starring Colin Firth and Jennifer Rubin.\n\nIn 2007, he had a role in David Fincher's film Zodiac. Also in 2007, he appeared in Bill Guttentag and Dan Sturman's documentary film Nanking as George Ashmore Fitch, head of the local YMCA and administrative director of the International Committee for the Nanking Safety Zone. Getz also had a role in Fincher's film The Social Network, about the founding of Facebook. He appeared in the suspense thriller Elevator as a Wall Street executive trapped in an elevator with a group of strangers, one of whom has a bomb. Written and produced by Marc Rosenberg and directed by Stig Svendsen, Elevator was released in July 2012. He appeared in Trumbo (2015) as director Sam Wood.\n\nThrough the decades, Getz has guest-starred in many television series, including Barney Miller and Three's Company, where he played Lee Tripper, brother of Jack Tripper. He has guest-starred in How I Met Your Mother, Prison Break, The King of Queens and Private Practice, and had recurring roles in Homeland, Timeless and Bosch.\n\nDescription above from the Wikipedia article John Getz, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1946-10-15",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 20211,
        "imdb_id": "nm0315288",
        "known_for_department": "Acting",
        "name": "John Getz",
        "place_of_birth": "Davenport, Iowa, U.S.",
        "popularity": 0.7588,
        "profile_path": "/NL52y1nH5SZMlJKfKpPBnofoJk.jpg"
    }
}