{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2vq5GTJOahE03mNYZGxIynlHcWr.jpg",
                "genre_ids": [
                    18,
                    28,
                    36
                ],
                "id": 359724,
                "original_language": "en",
                "original_title": "Ford v Ferrari",
                "overview": "American car designer Carroll Shelby and the British-born driver Ken Miles work together to battle corporate interference, the laws of physics, and their own personal demons to build a revolutionary race car for Ford Motor Company and take on the dominating race cars of Enzo Ferrari at the 24 Hours of Le Mans in France in 1966.",
                "popularity": 13.8559,
                "poster_path": "/dR1Ju50iudrOh3YgfwkAU1g2HZe.jpg",
                "release_date": "2019-11-13",
                "title": "Ford v Ferrari",
                "video": false,
                "vote_average": 8.007,
                "vote_count": 8493,
                "character": "German Commentator",
                "credit_id": "600cf8f3cb8028004102124e",
                "order": 54
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Aylam Orian (pronounced Eiy-lahm Or-yahn) was born in Cleveland, Ohio, to Israeli parents of Polish, Russian, and Romanian descent. Soon after his birth, the family moved back to Israel where he grew up as an artistic kid, taking up painting, sculpting, photography and playing the guitar. But it wasn't until after his military service of 4.5 years that he decided to give art a serious try and enrolled in Tel Aviv University Film School. A short film he made there, A Nightmare on Bialik Street (1994) (a witty homage to the famous Russian film Battleship Potemkin (1925)), won several prizes and was later shown at the Cannes Film Festival. While acting in his own films, Aylam caught the 'acting bug' and so in early 2000 he returned to the US to study acting at The Lee Strasberg Theatre and Film Institute, and later The Stella Adler Studio of Acting in New York.\n\nWhile a student at the Strasberg Institute, he was hired to organize and preserve Strasberg's extensive collections of materials on acting - a position he held for the next 9 years, before starting to teach there. Upon graduating, he made his TV debut in the A&E mini-series Between the Lines (2004) hosted by Robert Downey Jr., where he joined the ranks of Hillary Clinton, John Goodman and Priscilla Presley in reading unknown letters written by famous people - his was no other than a love letter written by a young Adolf Hitler. Soon after, he played the leading role of a fugitive on the popular Fox show America's Most Wanted: America Fights Back (1988). He also wrote, produced and played the leading role in the movement-theatre show and film Beautiful World... (2006). Other film and TV roles followed, such as in the independent films Color of Truth (2009), Joy Incorporated (2012), Keep the Lights On (2012), and The Cold Winter (2016); the CBS film In God's Name (2007), and the hit NBC comedy show 30 Rock (2006), before Aylam made his way to Los Angeles.\n\nThere, he kicked things into high gear with multiple co-star and guest-star roles on such shows as Code Black (2015), NCIS: Los Angeles (2009), Shooter (2016), and The Guest Book (2017), while also lending his multilingual skills to ADR on numerous other TV shows and films. In 2017, Aylam filmed a supporting role opposite Rosamund Pike in the upcoming thriller The Informer (2019), and the series regular role of the villain in the new installment of the \"Stargate\" franchise: Stargate Origins (2018).",
        "birthday": "1968-09-04",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2023611,
        "imdb_id": "nm2462441",
        "known_for_department": "Acting",
        "name": "Aylam Orian",
        "place_of_birth": "Cleveland, Ohio, USA",
        "popularity": 0.2544,
        "profile_path": "/7OK2pIpslIiZ482mL1xhvu7Igtk.jpg"
    }
}