{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bvpYJgsC5jcMJd43HRHXUQw7j5O.jpg",
                "genre_ids": [
                    18,
                    35,
                    36,
                    10749
                ],
                "id": 11673,
                "original_language": "fr",
                "original_title": "Cyrano de Bergerac",
                "overview": "Famed swordsman and poet Cyrano de Bergerac is in love with his cousin Roxane. He has never expressed his love for her as he his large nose undermines his self-confidence. Then he finds a way to express his love to her, indirectly.",
                "popularity": 2.6699,
                "poster_path": "/80XJ5UkGuYTKDuALeG03BLk1OT1.jpg",
                "release_date": "1990-03-28",
                "title": "Cyrano de Bergerac",
                "video": false,
                "vote_average": 7.33,
                "vote_count": 792,
                "character": "Christian de Neuvillette",
                "credit_id": "52fe44769251416c750359c7",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/cOUZMd2Cr6uOHcdCDJtWRgVN4aN.jpg",
                "genre_ids": [
                    18
                ],
                "id": 491472,
                "original_language": "en",
                "original_title": "At Eternity's Gate",
                "overview": "Famed but tormented artist Vincent van Gogh spends his final years in Arles, France, painting masterworks of the natural world that surrounds him.",
                "popularity": 2.7353,
                "poster_path": "/y4LvHQoX5YunHJ2EMBSjQvOkvD9.jpg",
                "release_date": "2018-11-15",
                "title": "At Eternity's Gate",
                "video": false,
                "vote_average": 6.96,
                "vote_count": 1498,
                "character": "The Director",
                "credit_id": "5bc2415592514179ca033cd9",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/pP1UeRZ7shy1llOUTnpXWISOokK.jpg",
                "genre_ids": [
                    36,
                    18,
                    53
                ],
                "id": 399121,
                "original_language": "fr",
                "original_title": "J'accuse",
                "overview": "In 1894, French Captain Alfred Dreyfus is wrongfully convicted of treason and sentenced to life imprisonment at the Devil’s Island penal colony.",
                "popularity": 2.2688,
                "poster_path": "/kqlzmKVBpGz7OMWfOXlK4y1m9Uz.jpg",
                "release_date": "2019-09-30",
                "title": "An Officer and a Spy",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 1547,
                "character": "Maître Leblois",
                "credit_id": "5dcea807cc277c0017e54c0b",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Венсан Перес",
            "Vicente Pérez",
            "Vincent Pérez",
            "Венсан Перез"
        ],
        "biography": "Born in Lausanne from a father of Spanish origin and a mother of German origin, Vincent Pérez (Vicente Pérez) spent a good part of his childhood in Penthaz and then in Cheseaux, Canton of Vaud. After studying photography at the Center Doret in Vevey, he studied dramatic art in Geneva, then at the Conservatoire and the school of Amandiers de Nanterre.\n\nVincent Pérez in 1991, at the 16th César ceremony. He is still a student when he begins the movie in 1985 in the Guardian of the Night. It is in 1990 that it imposes to the international level playing in Cyrano de Bergerac. He is quoted to the César of the best male hope. In 1991, it is found in Indochina, winner of the Oscar for the best film in foreign language. In the same year he won the Prix Jean-Gabin. Since then, he plays characters of romantic lovers in La Reine Margot, Fanfan, films that allow him to rub shoulders with major French actors. He subsequently plays in some thirty European or American films. He is quoted to the César for best actor in a supporting role 1998 for his interpretation in the Hunchback and the following year for Those who love me will take the train.\n\nVincent Pérez at the 2000 Cannes Film Festival. In 1992, he made his directorial debut with the short film \"L'échange\", nominated for the Jury Prize for short films in Cannes. He returned behind the camera in 1999 to realize \"Rien dire\" also cited in Cannes. In 2002, he made his first feature film Peau d'Ange, of which he is co-writer. He is the author of the script for La Forêt, a comic strip he makes with the renowned author Tiburce Oger, who revisits the myth of the forest of Brocéliande. In 2007, he realized Si j'étais toi produced by EuropaCorp. He is married to Karine Silla and had three children with her: Iman, May 2, 1999, and the twins Pablo and Tess in 2003. He is the father-in-law of Roxanne Depardieu, the fruit of the union of Karine Silla and Gerard Depardieu. He shared the life of Jacqueline Bisset then Carla Bruni-Sarkozy at the beginning of his career. In 2009, he participated in the song \"Beds are burning\", collective for the Copenhagen conference. In 2010, he was chosen alongside Virginie Ledoyen as a muse for the IKKS brand. His sister, who still lives in Switzerland, has made and marketed original hats that have had some success. Described [relevance challenged] In 2012, he publicly supports Chief Raoni in his fight against the Belo Monte Dam. Has manufactured and marketed original hats that have had some success. Described [relevance challenged] In 2012, he publicly supports Chief Raoni in his fight against the Belo Monte Dam. Has manufactured and marketed original hats that have had some success. Described [relevance challenged] In 2012, he publicly supports Chief Raoni in his fight against the Belo Monte Dam.\n\nInformation extracted from the article Vincent Perez of Wikipedia, license CC-BY-SA, complete list of contributors on Wikipedia.",
        "birthday": "1964-06-10",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 20239,
        "imdb_id": "nm0001641",
        "known_for_department": "Acting",
        "name": "Vincent Perez",
        "place_of_birth": "Lausanne, Vaud, Switzerland",
        "popularity": 0.2885,
        "profile_path": "/mpNv77WJ0kmi8vecBmRKQAdRzzo.jpg"
    }
}