{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xXhta1NIKn09IXy0mfp68cabdWS.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 466282,
                "original_language": "en",
                "original_title": "To All the Boys I've Loved Before",
                "overview": "Lara Jean's love life goes from imaginary to out of control when her secret letters to every boy she's ever fallen for are mysteriously mailed out.",
                "popularity": 7.1335,
                "poster_path": "/hKHZhUbIyUAjcSrqJThFGYIR6kI.jpg",
                "release_date": "2018-08-17",
                "title": "To All the Boys I've Loved Before",
                "video": false,
                "vote_average": 7.599,
                "vote_count": 8578,
                "character": "Owen Kavinsky",
                "credit_id": "5ad8f8949251412cff00252c",
                "order": 12
            },
            {
                "adult": false,
                "backdrop_path": "/qjhcTGnjxYJqwBGlDzZkYWmne6e.jpg",
                "genre_ids": [
                    10749,
                    35,
                    18
                ],
                "id": 614409,
                "original_language": "en",
                "original_title": "To All the Boys: Always and Forever",
                "overview": "Senior year of high school takes center stage as Lara Jean returns from a family trip to Korea and considers her college plans — with and without Peter.",
                "popularity": 2.9588,
                "poster_path": "/iepqdM52f4w75fNcvgRF5QoIAjm.jpg",
                "release_date": "2021-02-12",
                "title": "To All the Boys: Always and Forever",
                "video": false,
                "vote_average": 7.518,
                "vote_count": 1998,
                "character": "Owen",
                "credit_id": "60268a55bc2cb3003da87066",
                "order": 27
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Joey Pacheco is a Canadian citizen, who took an interest in acting at the age of 10. Even when Joey was just a little boy, he always loved entertaining his family and friends. Joey was first seen on the TV series \"Hip Hop with Travis Lim\", as a backup dancer in 2016. In 2017, he was cast as \"Young Eric\" in the LifetimeTV movie \"Menendez: Blood Brothers\". Joey's most recent role, was \"Owen Kavinsky\" (Peter's brother) in the Netflix movie \"To All The Boy's I've Loved Before\". By the age of 5, Joey started dancing, and performing in front of an audience at numerous dance competitions. After a few years of trying all styles, Joey found his passion for hip hop and tap. Joey has traveled all over the world with dance. Two of Joey's major awards have been, a Gold Medal in Ontario, at the \"Canadian Hip Hop Championships\", and a Silver Medal in Arizona, at \"Hip Hop International Championships\". He also represented Canada in 2017, for the Canadian Hip Hop Team in Denmark. Joey continues to train in scene study, audition technique, on camera technique, character development, hip hop, and tap.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2026156,
        "imdb_id": "nm8867657",
        "known_for_department": "Acting",
        "name": "Joey Pacheco",
        "place_of_birth": null,
        "popularity": 0.0327,
        "profile_path": "/xRGV0aeeEbKlpIcpVzWhG09WUxh.jpg"
    }
}