{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3ULzK4XTSC1wal11K7459fxnjjA.jpg",
                "genre_ids": [
                    53,
                    27
                ],
                "id": 482373,
                "original_language": "en",
                "original_title": "Don't Breathe 2",
                "overview": "The Blind Man has been hiding out for several years in an isolated cabin and has taken in and raised a young girl orphaned from a devastating house fire. Their quiet life together is shattered when a group of criminals kidnap the girl, forcing the Blind Man to leave his safe haven to save her.",
                "popularity": 4.3755,
                "poster_path": "/r7HEBkkRN93d3eFBZgPJfRaob5p.jpg",
                "release_date": "2021-08-12",
                "title": "Don't Breathe 2",
                "video": false,
                "vote_average": 7.023,
                "vote_count": 2693,
                "character": "Mother",
                "credit_id": "612493543a9650005c3769b8",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Fiona O'Shaughnessy is an Irish film, stage, and television actress.\n\nO'Shaughnessy was born in Galway. Her family moved to Reading, Berkshire, when she was 9. She returned to Galway a decade later where she pursued a career in theatre.\n\nShe dated Irish comedian David McSavage for a period of time.\n\nO'Shaughnessy's most notable stage role to date is that of Salome for the Gate Theatre in Dublin. Other stage work has included The Shaughraun for the Abbey Theatre in Dublin, which transferred to the West End's Albery Theatre in 2005. In 2006 she appeared in the UK premiere of Blackwater Angel by Jim Nolan at the Finborough Theatre, London. Other work for the Gate Theatre includes Arms and the Man, Oliver, The Importance of Being Earnest, Pride and Prejudice, Blythe Spirit, Present Laughter (which toured in Charleston, South Carolina), See You Next Tuesday, and Cat on a Hot Tin Roof. She played Cate in the Irish debut of Sarah Kane's play Blasted.\n\nHer film roles include Clara in Goldfish Memory, The Halo Effect, and The Stronger. Other theatre work includes playing Hilde Wangle in Lady from the Sea and Petra Stockman in Enemy of the People at the Arcola Theatre, London, and Amy in 'The Night Alive' at The Geffen Playhouse in Los Angeles. She starred as Jessica Hyde in the television series Utopia. In 2015, she starred with David Troughton in the comedy romantic horror film Nina Forever.",
        "birthday": "1979-01-01",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 20279,
        "imdb_id": "nm0642605",
        "known_for_department": "Acting",
        "name": "Fiona O'Shaughnessy",
        "place_of_birth": "Galway, Ireland",
        "popularity": 0.553,
        "profile_path": "/zUqAqtbNOJnKPTLHv4706P37b4d.jpg"
    }
}