{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xTWHFJgP5anqRipDig4LSa4DLqj.jpg",
                "genre_ids": [
                    16,
                    12,
                    35,
                    14
                ],
                "id": 532067,
                "original_language": "ja",
                "original_title": "映画 この素晴らしい世界に祝福を！紅伝説",
                "overview": "It is not strange that the Demon Lord's forces fear the Crimson Demons, the clan from which Megumin and Yunyun originate. Even if the Demon Lord's generals attack their village, the Crimson Demons can just easily brush them off with their supreme mastery of advanced and overpowered magic.  When Yunyun receives a seemingly serious letter regarding a potential disaster coming to her hometown, she immediately informs Kazuma Satou and the rest of his party. After a series of wacky misunderstandings, it turns out to be a mere prank by her fellow demon who wants to be an author. Even so, Megumin becomes worried about her family and sets out toward the Crimson Demons' village with the gang.  There, Kazuma and the others decide to sightsee the wonders of Megumin's birthplace. However, they soon come to realize that the nonsense threat they received might have been more than just a joke.",
                "popularity": 3.8637,
                "poster_path": "/fv5BgcfkpWh3V6Pb1qVlXESBOdl.jpg",
                "release_date": "2019-08-30",
                "title": "KONOSUBA – God's blessing on this wonderful world! Legend of Crimson",
                "video": false,
                "vote_average": 8.1,
                "vote_count": 579,
                "character": "Wiz (voice)",
                "credit_id": "5b3272869251413c7400fa57",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Yoshiko Horie",
            "یویی هوریه",
            "یویی هوری"
        ],
        "biography": "Yui Horie is a Japanese singer and voice actress. She is sometimes affectionately nicknamed \"Hocchan\" by her Japanese fans. She hosts a radio show called \"Horie Yui no Tenshi no Tamago\" and is the founding member of the singing group, Aice5.\n\nShe is one of a handful of Japanese idol voice actors that rose to prominence in the 2000s, whose popularity today has been attributed to their solid experience and long-term interaction with their fan base, as opposed to the contemporary norms of youth and beauty in the entertainment industry.  As a result of her ongoing success, she has performed solo at large music venues, such as the Nippon Budokan in 2009 and the Yoyogi National Gymnasium's First Stadium in 2015,  each with capacities of approximately 14,000 and 13,000 respectively. Her official fanclub is the \"Black Cat Alliance\".\n\nSome of her notable roles in anime include Naru Narusegawa in Love Hina, Multi in To Heart, Tohru Honda in Fruits Basket, Ai in Dōbutsu no Mori, Ayu Tsukimiya in Kanon, Yuki Cross in Vampire Knight, Miss Monochrome in Miss Monochrome, Minori Kushieda in Toradora!, Tsubasa Hanekawa in Monogatari, Chie Satonaka in Persona 4, Kōko Kaga in Golden Time, Carla in Fairy Tail and Wiz in KonoSuba.",
        "birthday": "1976-09-20",
        "deathday": null,
        "gender": 1,
        "homepage": "https://horie-yui.com",
        "id": 202806,
        "imdb_id": "nm0394679",
        "known_for_department": "Acting",
        "name": "Yui Horie",
        "place_of_birth": "Katsushika, Tokyo, Japan",
        "popularity": 1.3137,
        "profile_path": "/73yQlMWaiOMrhvPCNyOCbbCkILZ.jpg"
    }
}