{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7Q2CmqIVJuDAESPPp76rWIiA0AD.jpg",
                "genre_ids": [
                    28,
                    12,
                    18
                ],
                "id": 1011477,
                "original_language": "en",
                "original_title": "Karate Kid: Legends",
                "overview": "After a family tragedy, kung fu prodigy Li Fong is uprooted from his home in Beijing and forced to move to New York City with his mother. When a new friend needs his help, Li enters a karate competition – but his skills alone aren't enough. Li's kung fu teacher Mr. Han enlists original Karate Kid Daniel LaRusso for help, and Li learns a new way to fight, merging their two styles into one for the ultimate martial arts showdown.",
                "popularity": 58.618,
                "poster_path": "/AEgggzRr1vZCLY86MAp93li43z.jpg",
                "release_date": "2025-05-08",
                "title": "Karate Kid: Legends",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 848,
                "character": "Mia Lipani",
                "credit_id": "65e8d201713ea6017c52ff49",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Sadie Anne Stanley",
            "セイディー・スタンリー",
            "セイディ・スタンリー",
            "赛迪·斯坦利"
        ],
        "biography": "A dynamic and versatile performer, Sadie Stanley is quickly emerging as one of the entertainment industry's brightest young talents. Stanley's breakthrough role came as teen superhero Kim Possible, in the live-action Disney Channel Original Movie \"Kim Possible,\" based on the global hit animated series about an everyday high school girl who, in her spare time, saves the world from villains. Originally from Columbia, South Carolina, the role of the iconic Kim Possible character marked Stanley's first-ever network audition. After landing the title role, she went on to book guest-star appearances in \"The Goldbergs\", \"Dead to Me\", \"Room 104\" & the lead in Netflix's upcoming feature film The Sleepover. Stanley resides in Los Angeles.",
        "birthday": "2001-11-15",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 2030076,
        "imdb_id": "nm9642493",
        "known_for_department": "Acting",
        "name": "Sadie Stanley",
        "place_of_birth": "Columbia, South Carolina, USA",
        "popularity": 2.0232,
        "profile_path": "/zfjr9nkUTWJ2EekyiWmYdxscrSJ.jpg"
    }
}