{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/swWKDUbYMkcevlGZcpXqN6G7By3.jpg",
                "genre_ids": [
                    99
                ],
                "id": 191720,
                "original_language": "en",
                "original_title": "Jodorowsky's Dune",
                "overview": "In 1974, Chilean-French director Alejandro Jodorowsky embarked on the quixotic project of adapting Frank Herbert's influential novel Dune (1969) for the big screen. After investing two years, and millions of dollars, the gigantic project ended in failure; but the artists Jodorowsky brought together to carry it out continued to work together, and ended up laying the foundations for modern science fiction cinema.",
                "popularity": 2.5676,
                "poster_path": "/cVwyAK5clGBQYe7Gu6GsBsUiYh1.jpg",
                "release_date": "2013-08-30",
                "title": "Jodorowsky's Dune",
                "video": false,
                "vote_average": 7.82,
                "vote_count": 712,
                "character": "Self - Film Critic",
                "credit_id": "52fe4c909251416c910f8e51",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nDrew McWeeny (born May 26, 1970), also known by his pseudonym Moriarty, is a film critic, screenwriter, and the former west coast editor of the Ain't It Cool News website. In a December 2008 review of The Curious Case of Benjamin Button, McWeeny announced that he would be leaving Ain't It Cool News to work for HitFix.com.\n\nHe attended, but did not graduate from, Florida State University, instead choosing to focus on a career in entertainment in Los Angeles. He has two sons, Toshiro Lucas McWeeny, born in 2005 and Allen Miles McWeeny, born in 2008.\n\nMcWeeny was the subject of controversy in 1999 when a screenplay he had co-written was favorably reviewed by Harry Knowles on the website \"Ain't It Cool News\". In reviewing the script, Knowles did not disclose that McWeeny was a regular contributor to the website under the name \"Moriarty\". Film Threat magazine would later accuse Knowles of lacking journalistic integrity. At the time McWeeny was working as a closed caption editor at VITAC.\n\nMcWeeny, along with partner Scott Swan, has since become a working television writer, writing two episodes in the Masters of Horror series, both directed by John Carpenter. The pair also co-wrote the episode \"Skin and Bones\" for the NBC horror/suspense anthology television series Fear Itself. In May 2008 it was announced that \"Bat Out of Hell\", a motion picture written by McWeeny and Swan, would be directed by Joe Dante. He also continues to work as a film critic, though he has been banned from Twentieth Century Fox press screenings.\n\nDescription above from the Wikipedia article Drew McWeeny, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1970-05-26",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 203286,
        "imdb_id": "nm1055848",
        "known_for_department": "Acting",
        "name": "Drew McWeeny",
        "place_of_birth": null,
        "popularity": 0.6583,
        "profile_path": "/lZEJh0r355AYjW8kOL7FQhczvFx.jpg"
    }
}