{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jrudoaXcoLyHRPdolyOGemXgPEs.jpg",
                "genre_ids": [
                    36,
                    18
                ],
                "id": 369972,
                "original_language": "en",
                "original_title": "First Man",
                "overview": "A look at the life of the astronaut, Neil Armstrong, and the legendary space mission that led him to become the first man to walk on the Moon on July 20, 1969.",
                "popularity": 3.8495,
                "poster_path": "/i91mfvFcPPlaegcbOyjGgiWfZzh.jpg",
                "release_date": "2018-10-10",
                "title": "First Man",
                "video": false,
                "vote_average": 7.042,
                "vote_count": 5437,
                "character": "Young Rick Armstrong",
                "credit_id": "5aeaa8e7c3a3682dfe0010e8",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Gavin Hunter",
            "蓋文・華倫"
        ],
        "biography": "Gavin Warren was born in Houston, Texas in 2008, the youngest son of a family of five. As a child he played the piano and did gymnastics before, inspired by Adam Sandler, he decided he wanted to become an actor. In 2015, Warren won an acting and modeling competition, after which he was accepted into a local artist agency. This was followed by his first roles in the short film Two Wongs Make a White and in the film drama Back Roads, before Warren was seen in Damien Chazelle's film biography Awakening to the Moon alongside Ryan Gosling in 2018.\n\nIn order to focus on his acting career, Warren switched from public school to home schooling. In subsequent years, he made guest appearances in the television series Daybreak and NCIS: New Orleans, while he took on supporting roles in the films Mack (2019), A Hard Problem (2021) and 12 Mighty Orphans (2021). In 2023 he appeared in the eighth season of the horror series Fear the Walking Dead before playing a leading role in the horror film Night Swim the following year.\n\nHis other announced film projects include the thrillers The Descendant and Geechee, the drama film Unbreakable Boy and the crime film The Man in the White Van.\n\nWarren lives in Katy, Texas.\n\nIMDb mini bio by; yusufpiskin",
        "birthday": "2008-04-17",
        "deathday": null,
        "gender": 2,
        "homepage": "http://gavinwarren.com",
        "id": 2035115,
        "imdb_id": "nm8583232",
        "known_for_department": "Acting",
        "name": "Gavin Warren",
        "place_of_birth": "Houston, Texas, USA",
        "popularity": 0.2712,
        "profile_path": "/6nUuNaDEPURSFcJDu0QlLpb3uZP.jpg"
    }
}