{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/iiDGA97Kqt2dVU1deXQF06USBRu.jpg",
                "genre_ids": [
                    18,
                    28,
                    53,
                    80,
                    9648
                ],
                "id": 10775,
                "original_language": "cn",
                "original_title": "無間道",
                "overview": "Chan Wing Yan, a young police officer, has been sent undercover as a mole in the local mafia. Lau Kin Ming, a young mafia member, infiltrates the police force. Years later, their older counterparts, Chen Wing Yan and Inspector Lau Kin Ming, respectively, race against time to expose the mole within their midst.",
                "popularity": 4.9302,
                "poster_path": "/gix9thDBXfjJ8M7rYbihqbQGBcP.jpg",
                "release_date": "2002-12-12",
                "title": "Infernal Affairs",
                "video": false,
                "vote_average": 7.81,
                "vote_count": 1745,
                "character": "Young Lau Kin Ming",
                "credit_id": "52fe43b59251416c7501afd9",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/enNubozHn9pXi0ycTVYUWfpHZm.jpg",
                "genre_ids": [
                    18,
                    28,
                    80,
                    53
                ],
                "id": 155,
                "original_language": "en",
                "original_title": "The Dark Knight",
                "overview": "Batman raises the stakes in his war on crime. With the help of Lt. Jim Gordon and District Attorney Harvey Dent, Batman sets out to dismantle the remaining criminal organizations that plague the streets. The partnership proves to be effective, but they soon find themselves prey to a reign of chaos unleashed by a rising criminal mastermind known to the terrified citizens of Gotham as the Joker.",
                "popularity": 37.0978,
                "poster_path": "/qJ2tW6WMUDux911r6m7haRef0WH.jpg",
                "release_date": "2008-07-16",
                "title": "The Dark Knight",
                "video": false,
                "vote_average": 8.523,
                "vote_count": 34382,
                "character": "LSI VP",
                "credit_id": "560c262bc3a368680b006225",
                "order": 32
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Edison Chen Koon-Hei",
            "陳冠希",
            "진관희",
            "陈冠希",
            "Trần Quán Hy",
            "ادیسون چن",
            "اِدیسون چِن"
        ],
        "biography": "Edison Chen Koon-Hei (born 7 October 1980) is a Hong Kong-based Chinese Canadian film actor, rapper, Cantopop singer, model, record producer, fashion designer, and a pop icon. Chen is also the founder of CLOT Inc., and the CEO of Clot Media Division Limited. His native language is English, he is able to speak and sing Cantonese and Mandarin and also speaks conversational Japanese,which allows him to be a part of multiple entertainment industries around the world. On 21 February 2008 he publicly announced that he intended to step away \"indefinitely\" from the Hong Kong entertainment industry due to the sex photo scandal in 2008. However, he returned to the industry in 2010 and he stated \"indefinitely\" could mean 5 minutes or 2000 years.\n\nDescription above from the Wikipedia article Edison Chen, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1980-10-07",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 20372,
        "imdb_id": "nm0155211",
        "known_for_department": "Acting",
        "name": "Edison Chen",
        "place_of_birth": "Vancouver, Canada",
        "popularity": 3.2931,
        "profile_path": "/9JsNQ3m7oZLfmnql5I8qP1RC3sd.jpg"
    }
}