{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/k3AGi4UD8Ql2dKosXh6FrBSKm0s.jpg",
                "genre_ids": [
                    10402,
                    18,
                    10749,
                    80
                ],
                "id": 9762,
                "original_language": "en",
                "original_title": "Step Up",
                "overview": "Tyler Gage receives the opportunity of a lifetime after vandalizing a performing arts school, gaining him the chance to earn a scholarship and dance with an up and coming dancer, Nora.",
                "popularity": 4.8347,
                "poster_path": "/fmw52kXk2kN8AQil7tgOD41gt4Q.jpg",
                "release_date": "2006-08-11",
                "title": "Step Up",
                "video": false,
                "vote_average": 6.871,
                "vote_count": 3786,
                "character": "Nora Clark",
                "credit_id": "52fe4528c3a36847f80bf8ff",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/3I0ibLoqCBu3gCeN46wpnKL7gq6.jpg",
                "genre_ids": [
                    18,
                    35,
                    10402
                ],
                "id": 12763,
                "original_language": "en",
                "original_title": "Take the Lead",
                "overview": "A former professional dancer volunteers to teach dance in the New York public school system and, while his background first clashes with his students' tastes, together they create a completely new style of dance. Based on the story of ballroom dancer, Pierre Dulane.",
                "popularity": 3.3184,
                "poster_path": "/vkGSs0eeOOISEe9jddBZnRSkn46.jpg",
                "release_date": "2006-03-17",
                "title": "Take the Lead",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 715,
                "character": "Sasha",
                "credit_id": "536666230e0a2647d10037b4",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jenna Dewan Tatum",
            "Jenna Dewan-Tatum",
            "Jenna Lee Dewan ",
            "جنا دیوان"
        ],
        "biography": "Jenna Lee Dewan (born December 3, 1980) is an American actress and dancer. She started her career as a backup dancer for Janet Jackson, and later worked with artists including Christina Aguilera, Pink, and Missy Elliott. She is known for her role as Nora Clark in the 2006 film Step Up. She has also starred on the short-lived NBC series The Playboy Club and had a recurring role on the FX series American Horror Story: Asylum. She portrayed Freya Beauchamp on the Lifetime series Witches of East End, Lucy Lane in The CW series Supergirl and its spin-off, Superman & Lois and Joanna in Soundtrack on Netflix. Dewan has hosted the reality television shows World of Dance and Flirty Dancing and served as a judge on Come Dance with Me. She currently stars as Bailey on ABC's The Rookie. She also had a recurring role on the FOX medical drama The Resident.\n\nDewan was born in Hartford, Connecticut, the daughter of Nancy Bursch Smith (née Bursch) and Darryll Dewan, who was a running back on the 1972 Notre Dame football team. Her father is of Lebanese and Polish descent and her mother is of German and English ancestry. Her parents divorced when she was young and her mother remarried Claude Brooks Smith. During high school at Grapevine High School in Grapevine, Texas, Dewan was a varsity cheerleader. She graduated in 1999 and was voted prom queen her senior year. She went to University of Southern California and was a member of the California Gamma Chapter of Pi Beta Phi.\n\nDescription above from the Wikipedia article Jenna Dewan, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1980-12-03",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 20381,
        "imdb_id": "nm1564087",
        "known_for_department": "Acting",
        "name": "Jenna Dewan",
        "place_of_birth": "Hartford, Connecticut, USA",
        "popularity": 1.7337,
        "profile_path": "/8zZkN1ewGxN8MHiqB8lRmBle8yf.jpg"
    }
}