{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dLL90vskYFn1S89RZp5TUguK9wl.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 4982,
                "original_language": "en",
                "original_title": "American Gangster",
                "overview": "Loosely based on the criminal career of Frank Lucas, a gangster from La Grange, North Carolina, who smuggled heroin into the United States on American service planes returning from the Vietnam War, before being detained by a task force led by Newark Detective Richie Roberts.",
                "popularity": 8.2396,
                "poster_path": "/8sV6nWuKczuXRt0C6EWoXqJAj6G.jpg",
                "release_date": "2007-11-02",
                "title": "American Gangster",
                "video": false,
                "vote_average": 7.591,
                "vote_count": 5725,
                "character": "Richie's Attorney",
                "credit_id": "52fe43ebc3a36847f807842b",
                "order": 25
            },
            {
                "adult": false,
                "backdrop_path": "/ajKmVMSIr0BgRKn8tLSdIFrptTX.jpg",
                "genre_ids": [
                    18
                ],
                "id": 3558,
                "original_language": "en",
                "original_title": "Girl, Interrupted",
                "overview": "Set in the changing world of the late 1960s, Susanna Kaysen's prescribed \"short rest\" from a psychiatrist she had met only once becomes a strange, unknown journey into Alice's Wonderland, where she struggles with the thin line between normal and crazy. Susanna soon realizes how hard it is to get out once she has been committed, and she ultimately has to choose between the world of people who belong inside or the difficult world of reality outside.",
                "popularity": 4.9369,
                "poster_path": "/dOBdatHIVppvmRFw2z7bf9VKJr9.jpg",
                "release_date": "1999-12-21",
                "title": "Girl, Interrupted",
                "video": false,
                "vote_average": 7.568,
                "vote_count": 3987,
                "character": "Bonnie Gilcrest",
                "credit_id": "55a8e71a92514172ef0014dd",
                "order": 21
            },
            {
                "adult": false,
                "backdrop_path": "/6TjllWT3cGrPFyqDXurVZ3L8bBi.jpg",
                "genre_ids": [
                    9648,
                    53,
                    18
                ],
                "id": 745,
                "original_language": "en",
                "original_title": "The Sixth Sense",
                "overview": "Following an unexpected tragedy, child psychologist Malcolm Crowe meets a nine year old boy named Cole Sear, who is hiding a dark secret.",
                "popularity": 8.5538,
                "poster_path": "/vOyfUXNFSnaTk7Vk5AjpsKTUWsu.jpg",
                "release_date": "1999-08-06",
                "title": "The Sixth Sense",
                "video": false,
                "vote_average": 7.95,
                "vote_count": 12255,
                "character": "Visitor #5",
                "credit_id": "55d4b857c3a3685082002588",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Katherine Strickland"
        ],
        "biography": "Katherine Dee \"KaDee\" Strickland (born December 14, 1975) is an American actress.  She's best known for her roles as Debbie Strickland on Freeform's drama Cruel Summer, Linda Haverford on Hulu's drama Shut Eye, Christy Crawford on ABC's drama Secrets & Lies, Jillian Cartwright in Tyler Perry's The Family That Preys, Charlotte King on ABC's medical drama Private Practice, Robin in Fever Pitch (2005), Susan Williams in The Grudge, Tara in The Stepford Wives, Kristen in Something's Gotta Give, and Bonnie Gilcrest in Girl, Interrupted.\n\nShe began acting during high school, then she webt on to study acting in Philadelphia and New York City, where she obtained mostly small roles in film, television and theater projects, among them The Sixth Sense (1999). Her roles in the 2003 Hollywood films Anything Else and Something's Gotta Give led to her receiving significant parts in the horror pictures Anacondas and The Grudge (both 2004). In the period they were released, she was referred to as horror fandom's \"newest scream queen\", though her performances in both films received mixed critical reviews.\n\nIn 2005, she garnered positive critical comment for the romantic comedy Fever Pitch, and in 2007, she was a cast regular in the short-lived TV show The Wedding Bells and subsequently was added to the cast of Private Practice. She appears in the music video by Rascal Flatts \"Here Comes Goodbye\".\n\nShe met fellow actor Jason Behr on the set of The Grudge in 2004 and they married in 2006; they have a son, Atticus.\n\n​Some info from Wikipedia, the free encyclopedia.",
        "birthday": "1975-12-14",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 20388,
        "imdb_id": "nm0834380",
        "known_for_department": "Acting",
        "name": "KaDee Strickland",
        "place_of_birth": "Blackshear, Georgia, USA",
        "popularity": 0.4751,
        "profile_path": "/73xvqIpgGN4KqfFQJQR6q54I6FA.jpg"
    }
}