{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9lOtDZY6oy6qUlYH78fJ27RMkLP.jpg",
                "genre_ids": [
                    80,
                    53,
                    9648,
                    18
                ],
                "id": 479226,
                "original_language": "da",
                "original_title": "Journal 64",
                "overview": "Copenhagen, 2018. A frightening discovery is made in an old apartment. The subsequent investigation of Department Q leads them to an infamous institution for girls that was suddenly closed in the early sixties.",
                "popularity": 4.0212,
                "poster_path": "/uTdaeGpznkLfyhAzLlrdssD621R.jpg",
                "release_date": "2018-10-04",
                "title": "The Purity of Vengeance",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 520,
                "character": "Politibetjent (uncredited)",
                "credit_id": "5bb6379fc3a368150800f9ae",
                "order": 45
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Diem Camille Gbogou",
            "Diêm Camille G.",
            "Diem Camille"
        ],
        "biography": "Diêm Camille is an Ivorian actress and screenwriter.  In 2022, Diêm played the lead role Nikki, in the dramedy Bad Bitch (2022), a Danish TV series created and co-written by Diêm as well, and directed by Patricia Bbaale Bandak, and produced by the major Danish Broadcasting Corporation (DR). The series was critically acclaimed and Diêm was nominated for Best Actress and the show for Best Short-Format TV Series at the Danish Film Awards (Robert), as well as making Danish TV history, with the first series in Denmark with an African main cast.\n\nIn 2023, Diêm started filming the new TV series Alien: Earth (2025) as a main supporting role. The series' showrunner is Noah Hawley for FX/Hulu. This marks Diêm's second major international project, and on top of that being sci-fi, which she is hugely passionate about.\n\nDiêm has also been involved in numerous creative projects, notably portraying Abby in the short film Moder (2025), Fatima in You Know Nothing (2025), and Lola in No Place for a Kid (2025).",
        "birthday": "1992-03-24",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 2040125,
        "imdb_id": "nm8823857",
        "known_for_department": "Acting",
        "name": "Diêm Camille",
        "place_of_birth": "Abidjan, Ivory Coast",
        "popularity": 0.3866,
        "profile_path": "/ePmvfxI8BLkZ3tTlU5foYwHFB5W.jpg"
    }
}