{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/A29oACLcWmIo8RDzNH7GNQziBbG.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749
                ],
                "id": 450489,
                "original_language": "en",
                "original_title": "Irreplaceable You",
                "overview": "A stunning cancer diagnosis spurs Abbie to seek a future girlfriend for fiancé and childhood sweetheart Sam, who's clueless when it comes to dating.",
                "popularity": 2.1095,
                "poster_path": "/hkflwtWCJffdDSwg63fdDFbwOvS.jpg",
                "release_date": "2018-02-16",
                "title": "Irreplaceable You",
                "video": false,
                "vote_average": 6.95,
                "vote_count": 709,
                "character": "Sally",
                "credit_id": "64259cb237b3a90113657536",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Αλάννα Μάστερσον"
        ],
        "biography": "Alanna Masterson (born June 27, 1988) is an American actress, best known for her role as Tara Chambler in the AMC television series The Walking Dead.\n\nMasterson was born in New York City, to Carol Masterson and Joe Reaiche, a Lebanese-Australian former professional rugby league footballer with the Sydney Roosters and the South Sydney Rabbitohs. She is the younger sister to her brother, Jordan Masterson, and two half-brothers, Danny Masterson and Christopher Masterson. After some time on Long Island, the family later relocated to Los Angeles. She grew up around and was influenced by her older brothers who both starred in popular television shows in the late 1990s and early 2000s. Masterson's passion for acting came from spending a lot of time on set with her brothers and seeing the filming process.\n\nMasterson has portrayed Tara Chambler on the AMC TV series The Walking Dead, beginning in the show's fourth season. Masterson was promoted to a series regular for the fifth season and was added to the main credits in the seventh season. Additionally, she had a recurring role in the fourth season of the ABC series Mistresses.",
        "birthday": "1988-06-27",
        "deathday": null,
        "gender": 1,
        "homepage": "http://pinsta.me/alannamasterson",
        "id": 204031,
        "imdb_id": "nm1315153",
        "known_for_department": "Acting",
        "name": "Alanna Masterson",
        "place_of_birth": "Long Island, New York, USA",
        "popularity": 0.6284,
        "profile_path": "/u8iGQ1qpB1hg2Y72nX04nwiF6gV.jpg"
    }
}