{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5fxTB08O7CW1hAcN2MWOKodp1h1.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 615777,
                "original_language": "en",
                "original_title": "Babylon",
                "overview": "A tale of outsized ambition and outrageous excess, tracing the rise and fall of multiple characters in an era of unbridled decadence and depravity during Hollywood's transition from silent films to sound films in the late 1920s.",
                "popularity": 10.7094,
                "poster_path": "/wjOHjWCUE0YzDiEzKv8AfqHj3ir.jpg",
                "release_date": "2022-12-22",
                "title": "Babylon",
                "video": false,
                "vote_average": 7.38,
                "vote_count": 3486,
                "character": "Cello",
                "credit_id": "64ebb56d83901800e5d0bcc3",
                "order": 217
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Alexander Mansour is a composer, pianist, and cellist from Los Angeles California.\n\nAs a composer, Alex is passionate about writing for both the concert hall and the screen. Most recently, he scored an AFI Feature Documentary selection, \"Hesburgh\" (dir. Patrick Creadon), which just finished its theatrical distribution. His chamber music has been performed at the Bowdoin and Atlantic Music Festivals. He will study and premier a new commission at the Yale School of Music this summer (2020) for the Norfolk New Music Festival. A recent orchestral work (Fantasy Noir) was premiered by USC's Thornton Symphony in February 2020, and a prior orchestral work (Across the Sea) was commissioned and performed by the Notre Dame Symphony Orchestra in 2018. His music for media has been featured on NBC Broadcasts and Netflix original content. Over the years, he has been recognized twice an ASCAP Finalist in the Morton Gould Young Composer Competition and the Herb Alpert Young Jazz Composer Awards. Alex is very grateful to join the USC Thornton School of Music where he studies with Professor Donald Crockett in pursuit of the Masters in Music degree. He previously studied with John Liberatore at the University of Notre Dame, where he double majored in cello performance and film studies.\n\nAs a pianist, Alex arranged and played for Arturo Sandoval's Christmas album, performing with him at Walt Disney Concert Hall in 2018. He attended the 2019 BANFF International Workshop for Jazz and Creative Music, a program helmed by Vijay Iyer and Tyshawn Sorey and is the pianist of the USC Jazz Honors Combo.. As a cellist, Alex serves as principal of American Youth Symphony, and has joined the New York String Orchestra Seminar for their Christmas concerts at Carnegie Hall. He has also appeared on NPR's \"From the Top\". He has studied with Katinka Kleijn (CSO) and during an exchange in London, Richard Lester (Royal College of Music).",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.alexmansourmusic.com/",
        "id": 2041602,
        "imdb_id": "nm8914019",
        "known_for_department": "Sound",
        "name": "Alex Mansour",
        "place_of_birth": null,
        "popularity": 0.0538,
        "profile_path": "/pwRga3HV9TyLF96bNw8JYTxLIc9.jpg"
    }
}