{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mhgfOLtAiJk1nm3kKlkiUKl7e9M.jpg",
                "genre_ids": [
                    53,
                    80,
                    9648
                ],
                "id": 2252,
                "original_language": "en",
                "original_title": "Eastern Promises",
                "overview": "A Russian teenager living in London dies during childbirth but leaves clues in her diary that could tie her child to a rape involving a violent Russian mob family.",
                "popularity": 4.0437,
                "poster_path": "/dpiJWb4NrWgcOg2rusuLhDM0hTm.jpg",
                "release_date": "2007-09-14",
                "title": "Eastern Promises",
                "video": false,
                "vote_average": 7.356,
                "vote_count": 3514,
                "character": "Yuri",
                "credit_id": "52fe4346c3a36847f80479b3",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/ldPtMaobGaG7sSrKM1c9Vnd6UGq.jpg",
                "genre_ids": [
                    18,
                    9648,
                    53
                ],
                "id": 1985,
                "original_language": "en",
                "original_title": "The Constant Gardener",
                "overview": "Justin Quayle is a low-level British diplomat who has always gone about his work very quietly, not causing any problems. But after his radical wife Tessa is killed he becomes determined to find out why, thrusting himself into the middle of a very dangerous conspiracy.",
                "popularity": 9.5274,
                "poster_path": "/nkXq7V7mmJVbvwZGr3nxkHo7HkS.jpg",
                "release_date": "2005-08-31",
                "title": "The Constant Gardener",
                "video": false,
                "vote_average": 7.005,
                "vote_count": 1595,
                "character": "Tim Donohue",
                "credit_id": "52fe4328c3a36847f803ec77",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/egKntJKzEL6HgalIyQ0Q5cMmDOA.jpg",
                "genre_ids": [
                    53,
                    80,
                    9648
                ],
                "id": 65754,
                "original_language": "en",
                "original_title": "The Girl with the Dragon Tattoo",
                "overview": "Disgraced journalist Mikael Blomkvist investigates the disappearance of a weary patriarch's niece from 40 years ago. He is aided by the pierced, tattooed, punk computer hacker named Lisbeth Salander. As they work together in the investigation, Blomkvist and Salander uncover immense corruption beyond anything they have ever imagined.",
                "popularity": 5.7149,
                "poster_path": "/8bokS83zGdhaXgN9tjidUKmAftW.jpg",
                "release_date": "2011-12-14",
                "title": "The Girl with the Dragon Tattoo",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 7286,
                "character": "Detective Inspector Gustaf Morell",
                "credit_id": "53beb35f0e0a26158f004297",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "唐纳德·桑普特",
            "دونالد سامپتر"
        ],
        "biography": "Donald Sumpter (born 13 February 1943) is an English actor. He has appeared in film and television since the mid-1960s.  One of his early television appearances was the 1968 Doctor Who serial The Wheel in Space with Patrick Troughton as the Doctor. He appeared in Doctor Who again in the 1972 serial The Sea Devils with Jon Pertwee. He also appeared in the Doctor Who spin-off The Sarah Jane Adventures. His early film work included a lead role as real life British criminal Donald Neilson in the 1977 film, The Black Panther.\n\nHe also appeared in many television films and serials, including adaptations of Dickens' novels: Nicholas Nickleby in 2001, Great Expectations in 1999 and Bleak House in 1985. Also in 1985, he was remembered for the part of villain Ronnie Day in Big Deal. He played the part of suspected serial killer Alexander Bonaparte Cust in the (1992) Agatha Christie's Poirot episode, The ABC Murders. He has also appeared in episodes of Midsomer Murders, The Bill, Holby City, and A Touch of Frost. He also had a recurring role as Uncle Ginger in the Children's BBC series The Queen's Nose. He played Harold Chapple in Our Friends in the North, and portrayed the physicist Max Planck in Einstein and Eddington. He has also been seen as Kemp in the horror-drama series Being Human. In 2011 he portrayed Maester Luwin in the HBO series Game of Thrones.\n\nHis film appearances include The Constant Gardener (2005), K-19: The Widowmaker (2002), Enigma (2001) and Ultramarines: The Movie (2010).",
        "birthday": "1943-02-13",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 20425,
        "imdb_id": "nm0838910",
        "known_for_department": "Acting",
        "name": "Donald Sumpter",
        "place_of_birth": "Brixworth, Northamptonshire, England, UK",
        "popularity": 0.6718,
        "profile_path": "/jfdH7vojRZ3fRSesLF8K3tZwwtq.jpg"
    }
}