{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/w7MsyOpP003FYhsiTgVHa3rNsrz.jpg",
                "genre_ids": [
                    18,
                    12,
                    10751
                ],
                "id": 508763,
                "original_language": "en",
                "original_title": "A Dog's Way Home",
                "overview": "The adventure of Bella, a dog who embarks on an epic 400-mile journey home after she is separated from her beloved human.",
                "popularity": 3.7866,
                "poster_path": "/pZn87R7gtmMCGGO8KeaAfZDhXLg.jpg",
                "release_date": "2019-01-10",
                "title": "A Dog's Way Home",
                "video": false,
                "vote_average": 7.387,
                "vote_count": 1153,
                "character": "Drew",
                "credit_id": "5c5da7a40e0a264d6f673b8b",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Rolando Boyce was born and raised on the Southside of Chicago. He was the 1st born of his Panamanian family in the United States. He Graduated from Senn Metropolitian Academy High School where he was in the Drama Club. He attended Texas Southern University in Houston as a Pre-Pharmacy student before being called to duty as a Army Reservist in the Desert Storm War. He re-discovered his love for acting after returning to Chicago in 1996. Getting his start at Chicago's historic ETA & Black Ensemble Theatre. He had his break out role playing William in Kenneth Lonergan's Lobby Hero at the Goodman Theatre, as well as Lincoln in Susan Lori Parks Topdog/Underdog at Madison Repertory Theatre. After getting his 1st TV appearance on Fox's Pilot episode of Prison Break, He landed the role of Rufus (which he's most known) in R Kelly's Trapped in the Closet for which he recurred in several Chapters. It was on the set of Trapped where he met his on screen Wife LeShay Tomlinson and they made the Video Marriage a real one in 2008. He now resides in Los Angeles with his family. Rolando has been in many commercials, TV shows & Movies.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 204548,
        "imdb_id": "nm2096119",
        "known_for_department": "Acting",
        "name": "Rolando Boyce",
        "place_of_birth": "Chicago, Illinois, USA",
        "popularity": 0.8441,
        "profile_path": "/eo9jlvF3uLZTXyD2dJfzLZBbso2.jpg"
    }
}