{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/iKUwhA4DUxMcNKu5lLSbDFwwilk.jpg",
                "genre_ids": [
                    14,
                    28,
                    12
                ],
                "id": 453395,
                "original_language": "en",
                "original_title": "Doctor Strange in the Multiverse of Madness",
                "overview": "Doctor Strange, with the help of mystical allies both old and new, traverses the mind-bending and dangerous alternate realities of the Multiverse to confront a mysterious new adversary.",
                "popularity": 12.8724,
                "poster_path": "/ddJcSKbcp4rKZTmuyWaMhuwcfMz.jpg",
                "release_date": "2022-05-04",
                "title": "Doctor Strange in the Multiverse of Madness",
                "video": false,
                "vote_average": 7.247,
                "vote_count": 9777,
                "character": "Billy Maximoff",
                "credit_id": "624d92164cbe120065ba4861",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/6Z0FhoZM56YkuXhvklMTpc7rc5u.jpg",
                "genre_ids": [
                    27,
                    9648,
                    53
                ],
                "id": 423108,
                "original_language": "en",
                "original_title": "The Conjuring: The Devil Made Me Do It",
                "overview": "Paranormal investigators Ed and Lorraine Warren encounter what would become one of the most sensational cases from their files. The fight for the soul of a young boy takes them beyond anything they'd ever seen before, to mark the first time in U.S. history that a murder suspect would claim demonic possession as a defense.",
                "popularity": 55.3329,
                "poster_path": "/rQfX2xx8TUoNvyk892yKWNikJaM.jpg",
                "release_date": "2021-05-25",
                "title": "The Conjuring: The Devil Made Me Do It",
                "video": false,
                "vote_average": 7.394,
                "vote_count": 6230,
                "character": "David Glatzel",
                "credit_id": "5dfa812765686e00188c78cb",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Julian Hilliard (born 2011) is an American actor, best known for his roles in television and film, including The Haunting of Hill House (2018), WandaVision (2021), and Doctor Strange in the Multiverse of Madness (2022), the latter two in which he portrayed Billy Maximoff in the Marvel Cinematic Universe. Born in Dallas, Texas, Hilliard is the son of actress Arianne Martin and director/writer/producer Justin D. Hilliard.\n\nIn 2018, Hilliard played Young Luke Crain in the Netflix horror series The Haunting of Hill House, created by Mike Flanagan. His portrayal of the character earned him a Young Artist Award nomination for Best Performance in a Streaming Series or Film: Young Actor in 2019. The cast was nominated for an OFTA Television Award for Best Ensemble in a Motion Picture or Limited Series that same year.\n\nIn 2021, Hilliard was part of the cast of the Marvel Studios miniseries WandaVision, set in the Marvel Cinematic Universe and which aired on Disney+. He played Billy Maximoff, son of Wanda Maximoff (Elizabeth Olsen) and the Vision (Paul Bettany), and twin brother of Tommy (Jett Klyne). He later reprised the role in Doctor Strange in the Multiverse of Madness, released in 2022.\n\nIn 2021, Hilliard was part of the cast of The Conjuring: The Devil Made Me Do It, the third installment in The Conjuring franchise. He portrayed David Glatzel, a young boy who becomes the centre of a supernatural investigation led by paranormal investigators Ed and Lorraine Warren, played by Patrick Wilson and Vera Farmiga.\n\nDescription above from the Wikipedia article Julian Hilliard, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "2011-06-20",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2047847,
        "imdb_id": "nm6623135",
        "known_for_department": "Acting",
        "name": "Julian Hilliard",
        "place_of_birth": "Dallas, Texas, USA",
        "popularity": 1.346,
        "profile_path": "/lp1IJliBZb9OFP5KK09HjSGOsau.jpg"
    }
}