{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/69QJSMkm5Hh0x9fLElZ8hjv5N4P.jpg",
                "genre_ids": [
                    18,
                    28,
                    36
                ],
                "id": 14756,
                "original_language": "cn",
                "original_title": "葉問",
                "overview": "A semi-biographical account of Yip Man, the first martial arts master to teach the Chinese martial art of Wing Chun. The film focuses on events surrounding Ip that took place in the city of Foshan between the 1930s to 1940s during the Second Sino-Japanese War. Directed by Wilson Yip, the film stars Donnie Yen in the lead role, and features fight choreography by Sammo Hung.",
                "popularity": 3.473,
                "poster_path": "/ggTTUXZg7trvAhsVj3eyd65bAnh.jpg",
                "release_date": "2008-12-12",
                "title": "Ip Man",
                "video": false,
                "vote_average": 7.759,
                "vote_count": 3925,
                "character": "Zhou Qing Quan",
                "credit_id": "52fe46169251416c7506ca7b",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/6Zo212BjDdDMqRIqcaiWXn10hty.jpg",
                "genre_ids": [
                    28,
                    36,
                    18
                ],
                "id": 37472,
                "original_language": "cn",
                "original_title": "葉問2",
                "overview": "Having defeated the best fighters of the Imperial Japanese army in occupied Shanghai, Ip Man and his family settle in post-war Hong Kong. Struggling to make a living, Master Ip opens a kung fu school to bring his celebrated art of Wing Chun to the troubled youth of Hong Kong. His growing reputation soon brings challenges from powerful enemies, including pre-eminent Hung Gar master, Hung Quan.",
                "popularity": 0.7338,
                "poster_path": "/aC5nwtbadmJqvl4eVCJPno16Mx5.jpg",
                "release_date": "2010-04-29",
                "title": "Ip Man 2",
                "video": false,
                "vote_average": 7.459,
                "vote_count": 2373,
                "character": "Zhou Qing Quan",
                "credit_id": "52fe464c9251416c9104ff67",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Simon Yam Tat-Wah",
            "Ren Da-Hua",
            "Yam Tat-Wah",
            "Ren Dahua",
            "Nhậm Đạt Hoa",
            "Simon Yam",
            "سایمون یام",
            "سیمون یام",
            "Саймон Ям",
            "Рен Да-Хуа",
            "Рен Дахуа",
            "Саймон Ям Тат-Ва"
        ],
        "biography": "Simon Yam Tat-Wah (Chinese: 任達華) was born 19 March, 1955, is a veteran Hong Kong-based actor and film producer. He started off as a supermodel before becoming an actor in the mid 1970s. He then signed with the Hong Kong television network TVB, starring and co-starring in a number of television series prior to \"apply his trades\" in the film industry in 1987. His elder brother is Yam Tak-wing, a retired former Deputy Commissioner of Hong Kong Police\n\nIn 1989, he starred in the Japanese-Hong Kong co-production of Fainaru Faito - Saigo no Ichigeki (1989). This was the first of its kind in which English was spoken throughout the entire film. In 1992, Yam gained critical acclaim for his role as the maniacal Judge in the crime film Hap do Ko Fei (1992), where he faced off in a bloody battle against Chow Yun-Fat's character. In 1993, he starred as \"Dhalsim\" in the action-comedy film Chiu Kap Hok Hau Ba Wong (1993), a parody of Street Fighter directed by Jing Wong. In 1996, Yam began his role as Chiang Tin-Sung, the leader of the Hung Hing triads in the first three installments of the Goo Wak Chai: Yan Joi Gong Woo (1996) film series.\n\nIn 2000, Yam starred as Cheung-sun, the progenitor of all vampires, in the television series Ngo Wo Geun See Yau Gor Yue Wui II (2000), produced by ATV. In 2003, Yam made his Hollywood film debut in Tomb Raider 2: The Cradle of Life (2003) as Shaolin crime lord.\n\nYam received international acclaim for his performances in international film festival hits and box offices such as Chik Loh Goh Yeung (1992), Saat Po Long (2005), Hak Se Wooi (2005), Hak Se Wui: Yi Woo Wai Kwai (2006), Fong Juk (2006), Tomb Raider 2: The Cradle of Life (2003), Dodookdeul (2012).\n\nIn 2019 in the city of Zhongshan, during a China promotional event, Simon Yam was assaulted by an attacker who stabbed him in the chest and slashed his arms. The security guards arrested the attacker and Simon Yam was taken to the hospital until he made a full recovery.",
        "birthday": "1955-03-19",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 20519,
        "imdb_id": "nm0945189",
        "known_for_department": "Acting",
        "name": "Simon Yam",
        "place_of_birth": "Hong Kong, China",
        "popularity": 1.1288,
        "profile_path": "/eilxjMhfobctnzZ0kBcFmnqtFyd.jpg"
    }
}