{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8T0qNf0Kccen93L6GgvtGylheo3.jpg",
                "genre_ids": [
                    35,
                    18,
                    36
                ],
                "id": 140823,
                "original_language": "en",
                "original_title": "Saving Mr. Banks",
                "overview": "Author P.L. Travers looks back on her childhood while reluctantly meeting with Walt Disney, who seeks to adapt her Mary Poppins books for the big screen.",
                "popularity": 3.9502,
                "poster_path": "/4RkcUe5PKnYvrCwMjk8giUAoID7.jpg",
                "release_date": "2013-11-29",
                "title": "Saving Mr. Banks",
                "video": false,
                "vote_average": 7.346,
                "vote_count": 3375,
                "character": "Diarmuid Russell",
                "credit_id": "531351a7925141101f006036",
                "order": 14
            },
            {
                "adult": false,
                "backdrop_path": "/1XqIhsqnAozznGhxlGdI0GPcCro.jpg",
                "genre_ids": [
                    18,
                    10752
                ],
                "id": 423,
                "original_language": "en",
                "original_title": "The Pianist",
                "overview": "The true story of pianist Władysław Szpilman's experiences in Warsaw during the Nazi occupation. When the Jews of the city find themselves forced into a ghetto, Szpilman finds work playing in a café; and when his family is deported in 1942, he stays behind, works for a while as a laborer, and eventually goes into hiding in the ruins of the war-torn city.",
                "popularity": 8.4545,
                "poster_path": "/2hFvxCCWrTmCYwfy7yum0GKRi3Y.jpg",
                "release_date": "2002-09-17",
                "title": "The Pianist",
                "video": false,
                "vote_average": 8.381,
                "vote_count": 9679,
                "character": "Janina's Husband",
                "credit_id": "5783cbe1c3a368179500022f",
                "order": 37
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Ronan David Jackson Vibert (23 February 1964 – 22 December 2022) was an English actor who was known for his appearances in films and on British and American television.\n\nHe was born in Cambridge, on 23 February 1964,the son of Dilys (née Jackson) and David Vibert, both artists and brother Cevn Vibert. He lived in Penarth, South Wales, until he was 18, then attended the Royal Academy of Dramatic Art (RADA), graduating in 1985.\n\nVibert had a long career in theatre, radio, television and film.\n\nVibert appeared in episodes of Lovejoy, Chandler & Co, Between the Lines and the BBC's The Buccaneers, in ITV's Cadfael, Inspector Lewis and in Van der Valk. He appeared in Jeeves and Wooster as Wilmot, Lord Pershore ('Motty').\n\nStage credits included plays at the Bush Theatre, Hampstead Theatre, The Gate, Manchester Royal Exchange, Bristol Old Vic, The Barbican for the RSC, The Almeida and The Savoy West End. In 1996, Vibert appeared at the National Theatre for the third time, as Prince Andre in Helen Edmundson's adaptation of Leo Tolstoy's War and Peace. He played Maximilien Robespierre in the BBC's adaptation of The Scarlet Pimpernel with Richard E. Grant.\n\nVibert appeared in the Midsomer Murders episode \"Death in Chorus\". He also appeared in episodes of Waking The Dead and The Mrs Bradley Mysteries.\n\nHe also appeared in such TV series as Rome, ITV's Poirot, The Borgias, Emmy award winning miniseries Hatfields and McCoys with Kevin Costner and Bill Paxton, Penny Dreadful, The Lizzie Borden Chronicles, NCIS LA, Phillip K Dick's Electric Dreams and Carnival Row.\n\nAmong his many films are Shadow of the Vampire with John Malkovich and Willem Dafoe, The Cat's Meow directed by Peter Bogdanovich, the Oscar-winning The Pianist directed by Roman Polanski, Tomb Raider 2, Tristan and Isolde, The Snowman with Michael Fassbender and Saving Mr Banks with Tom Hanks and Emma Thompson, portraying the publisher Diarmuid Russell. He also appeared in The Grass Arena with Mark Rylance.\n\nVibert died at a Florida hospital on 22 December 2022, aged 58, following a brief illness",
        "birthday": "1964-02-23",
        "deathday": "2022-12-22",
        "gender": 2,
        "homepage": "http://www.vibertfamily.com/?page_id=4564",
        "id": 20523,
        "imdb_id": "nm0895812",
        "known_for_department": "Acting",
        "name": "Ronan Vibert",
        "place_of_birth": "Cambridge - Cambridgeshire - England - UK",
        "popularity": 0.2605,
        "profile_path": "/q8GWsSP36W8VmpwBn0HKWAjX2by.jpg"
    }
}