{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/A99WMiz0ASpH9coOFrxSEuwTWx0.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 840430,
                "original_language": "en",
                "original_title": "The Holdovers",
                "overview": "A curmudgeonly instructor at a New England prep school is forced to remain on campus during Christmas break to babysit the handful of students with nowhere to go. Eventually, he forms an unlikely bond with one of them — a damaged, brainy troublemaker — and with the school’s head cook, who has just lost a son in Vietnam.",
                "popularity": 4.1266,
                "poster_path": "/VHSzNBTwxV8vh7wylo7O9CLdac.jpg",
                "release_date": "2023-10-27",
                "title": "The Holdovers",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 2127,
                "character": "Pharmacist",
                "credit_id": "6503f406e0ca7f00ec8e7883",
                "order": 27
            },
            {
                "adult": false,
                "backdrop_path": "/6WRrGYalXXveItfpnipYdayFkQB.jpg",
                "genre_ids": [
                    18,
                    53,
                    80
                ],
                "id": 1422,
                "original_language": "en",
                "original_title": "The Departed",
                "overview": "To take down South Boston's Irish Mafia, the police send in one of their own to infiltrate the underworld, not realizing the syndicate has done likewise. While an undercover cop curries favor with the mob kingpin, a career criminal rises through the police ranks. But both sides soon discover there's a mole among them.",
                "popularity": 13.4795,
                "poster_path": "/nT97ifVT2J1yMQmeq20Qblg61T.jpg",
                "release_date": "2006-10-04",
                "title": "The Departed",
                "video": false,
                "vote_average": 8.159,
                "vote_count": 15527,
                "character": "Reporter (uncredited)",
                "credit_id": "55e78f109251413e4100037d",
                "order": 93
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ozy"
        ],
        "biography": "Osmani Rodriguez is one of seven siblings and was born in Camaguey, Cuba. He is of Lebanese and Italian descent, speaks Spanish fluently, and was blessed to become an American citizen.\n\nHe and his family immigrated to the Untied States in 1971 and they settled in Boston Massachusetts.\n\nOsmani's earliest roles began in theatre where he played \"Chino\" in West Side Story. Later he went on to play some of his favorite roles as \"Nicky Arnstien\" in Funny Girl, \"Mr. Fagin\" in Oliver, and \"Max\" in Lend Me a Tenor.\n\nHe and his wife, Rena, have produced and starred opposite each other in shows such as \"Michael\" in I Do, I Do! And the Miracle Worker.\n\nHe began to find interest and now loves to perform in print, commercial, and film work. To date he has played Principal roles in over eight national commercials. Some of which include the Principal Role as the \"Security Guard\" in the national commercial for American Express and the honor of playing opposite one of his favorite directors, Mr. Martin Scorsese (a dream come true), playing the \"Pharmacist\" for CVS, Principal in \"Jenny O\", and playing the \"Pepsi Worker\" for Pepsi Cola's national commercial, \"The Machine\".\n\nAnother dream come true, was playing the featured role of \"Carlos\" in the film, The Maiden Heist directed by Peter Hewitt and playing opposite some of his most favorite legend veteran actors: Morgan Freeman, Christopher Walken, William H. Macey, and Marcia Gay Harden.\n\nAmong some of his TV series experience was in the CBS Series \"Waterfront\" playing \"FBI Agent Ramirez\" with Billy Baldwin and filling in, two years in a row for George Lopez and Freddie Prince Jr. to help set up the NFL Opening Kick off games with White Cherry Entertainment.\n\nOn occasions, he may still be seen hosting the nationally televised eleven minute public service announcement for paternity acknowledgment.\n\nOsmani loves to spend his spare time with his beautiful wife Rena and his two blessings, his sons Osmani Jr. and Nathaniel.  IMDb Mini Biography By: Manager",
        "birthday": null,
        "deathday": null,
        "gender": 0,
        "homepage": "http://www.osmanir.com/",
        "id": 205231,
        "imdb_id": "nm2228499",
        "known_for_department": "Acting",
        "name": "Osmani Rodriguez",
        "place_of_birth": null,
        "popularity": 0.0814,
        "profile_path": null
    }
}