{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/aB5123I8MNi3NIg0t9RrP6A7Yla.jpg",
                "genre_ids": [
                    12,
                    18,
                    10751
                ],
                "id": 1997,
                "original_language": "en",
                "original_title": "Deux Frères",
                "overview": "Two tigers are separated as cubs and taken into captivity, only to be reunited years later as enemies by an explorer (Pearce) who inadvertently forces them to fight each other.",
                "popularity": 2.4086,
                "poster_path": "/5I2pRuJI3SZVsxP5iaorGaczzkI.jpg",
                "release_date": "2004-04-07",
                "title": "Two Brothers",
                "video": false,
                "vote_average": 7.105,
                "vote_count": 839,
                "character": "Mathilde Normandin",
                "credit_id": "52fe432ac3a36847f803f4fd",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Philippine Leroy Beaulieu",
            "Phillipine Leroy-Beaulieu",
            "Φιλιπίν Λίροϊ-Μπολιέ",
            "菲莉普帕妮·萊蘿伊-柏莉烏"
        ],
        "biography": "Philippine Leroy-Beaulieu is a French actress and the daughter of French actor Philippe Leroy-Beaulieu.\n\nAfter spending her childhood in Italy, she went to Paris at 16 to study drama against the advice of her parents; her father, actor Philippe Leroy-Beaulieu, especially tried to keep her from pursuing a career that followed in his footsteps but was unsuccessful. After appearing on the stage, she made her screen début in Roger Vadim's 1983 film Surprise Party. In 1985, she played her first major screen role (and earned a nomination for the César Award for Most Promising Actress), playing the distraught mother in Trois hommes et un couffin (Three Men And A Cradle). The success of Coline Serreau's comedy helped her film career and a string of parts in costume films followed such films as Andrzej Wajda's Les Possédés in 1988, Philippe Le Guay's Les Deux Fragonard, and Robert Enrico's and Richard T. Heffron's La Révolution Française(Mademoiselle Leroy-Beaulieu acted out the role of Charlotte Corday in the latter production), whose release in 1989 was timed to coincide with celebrations for the bi-centenary of the 1789 Revolution.\n\nShe starred in the title role of the French film Natalia, which was screened at the 1988 Cannes Film Festival.\n\nIn the United States, Leroy-Beaulieu first became known for the role of Fauve Mistral in the 1984 mini-series version of Judith Krantz's novel Mistral's Daughter.\n\nDescription above from the Wikipedia article Philippine Leroy-Beaulieu,  licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1963-04-25",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 20530,
        "imdb_id": "nm0503800",
        "known_for_department": "Acting",
        "name": "Philippine Leroy-Beaulieu",
        "place_of_birth": "Rome, Italy",
        "popularity": 0.3247,
        "profile_path": "/1wt9AWB8HQz23VDmcZA0tVQn0vx.jpg"
    }
}