{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/f8ng3EDMLkuTMupe4TjgiJS1r0S.jpg",
                "genre_ids": [
                    28,
                    9648,
                    878
                ],
                "id": 530254,
                "original_language": "ko",
                "original_title": "마녀",
                "overview": "Ja-yoon is a high school student who struggles with memory loss after she endured some unknown trauma during her childhood. While trying to uncover the truth, she is unwittingly dragged into a world of crime and finds herself on a journey that will awaken many secrets hidden deep within.",
                "popularity": 7.7323,
                "poster_path": "/4i2wo2ja5g2PmUxWa1a2eYIboZf.jpg",
                "release_date": "2018-06-27",
                "title": "The Witch: Part 1. The Subversion",
                "video": false,
                "vote_average": 7.891,
                "vote_count": 666,
                "character": "Koo Ja-yoon",
                "credit_id": "5b23d2940e0a265b4e00800b",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "김다미",
            "金多美",
            "کیم دامی",
            "Kim Dami"
        ],
        "biography": "Kim Da-mi ( (Korean: 김다미; born April 9, 1995) is a South Korean actress. She is best known for playing the titular role in the action-mystery film The Witch: Part 1. The Subversion (2018). She is also known for her role in the television series Itaewon Class (2020). She made her acting debut through the independent film 2017 Project With The Same Name, an omnibus feature film produced annually, playing the role of a woman recently involved in a breakup in the episode \"Hello, My Hard Work\". In 2018, she played the role of a high school student in mystery thriller film Marionette. The same year, she played the lead role of Koo Ja-yoon in the action-mystery film The Witch: Part 1. The Subversion, directed by Park Hoon-jung, where she was chosen from among 1,500 candidates who auditioned for the role. She received universal acclaim for her strong performance in a challenging role that included intense fighting scenes and winning many newcomer awards. Thanks to the success and popularity of The Witch: Part 1. The Subversion, a sequel is scheduled to be produced. In 2020, Kim Da-mi made her television debut in the cable series Itaewon Class, based on the webtoon of the same title.  Kim Da-mi won the Baeksang Arts Award for Best New Actress (TV) for her performance.\n\nIn March 2021, Kim was confirmed to join the SBS drama Our Beloved Summer with Choi Woo-shik, which premiered in December 2021. The drama reunited Kim with Choi after The Witch: Part 1. The Subversion (2018).",
        "birthday": "1995-04-09",
        "deathday": null,
        "gender": 1,
        "homepage": "http://andmarq.com/artist?=kim-da-mi",
        "id": 2053219,
        "imdb_id": "nm9913973",
        "known_for_department": "Acting",
        "name": "Kim Da-mi",
        "place_of_birth": "Seoul, South Korea",
        "popularity": 1.6468,
        "profile_path": "/nRGhwfuWqcTMoTmnhK4XmcRkZ6B.jpg"
    }
}