{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/eeMoFKxjjiCi6iep2GEZtSAMYIr.jpg",
                "genre_ids": [
                    18,
                    878
                ],
                "id": 19,
                "original_language": "de",
                "original_title": "Metropolis",
                "overview": "In a futuristic city sharply divided between the rich and the poor, the son of the city's mastermind meets a prophet who predicts the coming of a savior to mediate their differences.",
                "popularity": 3.0888,
                "poster_path": "/vZIJxGnjcswPCAa52jhbl01FQkV.jpg",
                "release_date": "1927-02-06",
                "title": "Metropolis",
                "video": false,
                "vote_average": 8.1,
                "vote_count": 2933,
                "character": "Creative Human - Man Who Convinces Babel (uncredited)",
                "credit_id": "52fe420fc3a36847f8000cb9",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Friedrich Wilhelm Alberti"
        ],
        "biography": "Fritz Alberti was a German actor.  He studied construction at the Technical University of Berlin, worked in the construction industry and was a government construction manager from 1904 to 1907. In 1906 he decided to become an actor and appeared in Kassel and at the National Theater in Mannheim. In 1922 he came to Berlin.\n\nSoon after, Alberti also received film roles and became a frequently used supporting actor. In 1928 alone he appeared in ten different films. He also continued to be on stage, for example at the Theater am Kurfürstendamm.\n\nHe joined the NSDAP on April 1, 1933 (membership number 1,667,025), became chief treasurer of the NSBO ​​film specialist group and head of film records. In this role, he arranged smaller roles, occasionally reprimanded artists who did not conform sufficiently, and checked requests for financial support from the Goebbels Foundation \" Künstlerdank \".\n\nAfter the end of the war, Alberti did not return to the stage, but instead worked as a voice actor and acting teacher.",
        "birthday": "1877-10-22",
        "deathday": "1954-09-15",
        "gender": 2,
        "homepage": null,
        "id": 20535,
        "imdb_id": "nm0016641",
        "known_for_department": "Acting",
        "name": "Fritz Alberti",
        "place_of_birth": "Hanau, Hesse, Germany",
        "popularity": 0.0884,
        "profile_path": "/qCQhv7RCYwEZJ8l0Hs0ToXZIAP7.jpg"
    }
}