{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5mQZqk2qSJCsYmvw1cQJLEcLNYM.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 64682,
                "original_language": "en",
                "original_title": "The Great Gatsby",
                "overview": "An adaptation of F. Scott Fitzgerald's Long Island-set novel, where Midwesterner Nick Carraway is lured into the lavish world of his neighbor, Jay Gatsby. Soon enough, however, Carraway will see through the cracks of Gatsby's nouveau riche existence, where obsession, madness, and tragedy await.",
                "popularity": 6.8688,
                "poster_path": "/nimh1rrDDLhgpG8XAYoUZXHYwb6.jpg",
                "release_date": "2013-05-09",
                "title": "The Great Gatsby",
                "video": false,
                "vote_average": 7.361,
                "vote_count": 12608,
                "character": "Catherine",
                "credit_id": "52fe46e3c3a368484e0a97e9",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Άντελεϊντ Κλέμενς",
            "애드레이드 크레멘스 "
        ],
        "biography": "Born and raised in Brisbane, Australia. Daughter of a British father. Clemens began working as an actress on Australian television while in high school. She guest-starred in a 2006 episode of Blue Water High as Juliet, and in 2007, she starred in the children's series Pirate Islands: The Lost Treasure of Fiji as Alison. Clemens played Harper in the Showtime drama Love My Way that year, and was nominated for the Graham Kennedy Award for Most Outstanding New Talent at the 2008 Logie Awards for the role. Clemens was seen in the 2008 MTV Networks Australia dramatic film, Dream Life, alongside Sigrid Thornton, Xavier Samuel, Linda Cropper and Andrew McFarlane.She had small roles in the television series All Saints, and the film X-Men Origins: Wolverine, in 2009. She became the face of Jan Logan's jewelery that year.Clemens relocated to Los Angeles, California in 2009. Clemens starred in the 2010 film, Wasted on the Young, as Xandrie. In 2012, Clemens starred in Camilla Dickinson, alongside Gregg Sulkin, Cary Elwes and Samantha Mathis. The drama was an adaptation of the 1951 novel of the same name by young-adult fiction author Madeleine L'Engle.She portrayed teenager Heather Mason in Silent Hill: Revelation 3D. The horror film was based on the survival horror video game Silent Hill 3, and was a sequel to the film Silent Hill.That year, Clemens also played a lead role as the young suffragette Valentine Wannop in Parade's End, a television mini-series adaptation of the Ford Madox Ford tetra-logy co-produced by HBO and BBC Two. Clemens appeared in the 2012 horror film, No One Lives, starring Luke Evans. She also appeared in the 2013 film, The Great Gatsby, based on F. Scott Fitzgerald's novel of the same name. She played Catherine, the sister of Myrtle Wilson, played by Isla Fisher. Clemens stars as Tawney Talbot in the 2013 Sundance Channel television miniseries, Rectify, created by Ray McKinnon. She will also star with Natalie Dormer, Stephen Graham and Zachary Quinto in the independent drama, The Girl Who Invented Kissing.",
        "birthday": "1989-11-30",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 205474,
        "imdb_id": "nm2564938",
        "known_for_department": "Acting",
        "name": "Adelaide Clemens",
        "place_of_birth": "Brisbane, Australia",
        "popularity": 0.7437,
        "profile_path": "/z8eA9Jh7IvDJoGHmhZj6FmJJ67C.jpg"
    }
}