{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8HKwxHZ23sW8wz4yb28IWnAM1M6.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 458423,
                "original_language": "en",
                "original_title": "Mamma Mia! Here We Go Again",
                "overview": "Five years after meeting her three fathers, Sophie Sheridan prepares to open her mother’s hotel. In 1979, young Donna Sheridan meets the men who each could be Sophie’s biological father.",
                "popularity": 5.2208,
                "poster_path": "/aWicerX4Y7n7tUwRAVHsVcBBpj2.jpg",
                "release_date": "2018-07-18",
                "title": "Mamma Mia! Here We Go Again",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 3473,
                "character": "Yumiko",
                "credit_id": "5a3bba8f925141547509af7e",
                "order": 23
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Naoko Mori (森 尚子 Mori Naoko?) (born November 19, 1971) is a British actress of Japanese descent known for roles as Sarah, Saffron's \"odd\" friend in Absolutely Fabulous, Mie Nishikawa in Casualty, and Toshiko Sato in Doctor Who and Torchwood.\n\nNaoko Mori was born on 29 November 1971 in Nagoya, Japan, to a Ryukyuan mother and a Japanese American father. When Mori was four years old, she moved to New Jersey due to her father's work. She returned to Japan when she was ten and moved to London two years later. When her parents were posted back to Japan, Mori was given the choice of either moving back to Japan with her parents or remaining in London on her own. She chose to stay in London, partly because she wanted to finish her GCSEs and gain some qualifications. She attended the Royal Russell School. Mori's father opened a bank account for her, handed her a cheque book and told her to find a flat or a bed sit for herself to live in. Mori said that being on her own at such a young age helped her to be a very independent person, although it was still a scary world to be faced so young.\n\nWhile studying for her A-levels, she auditioned and joined London's West End production of the Vietnam War musical Miss Saigon. She later went on to play Kim and became the first Japanese national to play a lead role in the West End. From 1993 to 1994, Mori had a regular role on the hospital drama Casualty as the hospital receptionist Mie Nishikawa. Film roles followed, including appearances in the 1997 musical comedy film Spice World and Topsy-Turvy (1999). Mori also appeared in the television programmes Thief Takers (1997), Judge John Deed (2001), Spooks (2002), Mile High (2003) and Powers (2004). In 1995, she had a small role as a Japanese computer hacker in the film Hackers. Mori had a major role in the 2005 BBC docu-drama Hiroshima, which contained dramatic re-enactments of the 1945 atomic bombings. Mori also provided the voice acting for the villainess Mai Hem for the game Perfect Dark Zero.\n\nIn 2005, Mori had a small role as Dr. Sato in the Doctor Who episode \"Aliens of London\". Producer Russell T Davies took note of her performance and decided to bring the character back as a regular in the first two series of the Doctor Who spin-off Torchwood. Mori's Torchwood character, Toshiko Sato, was killed in \"Exit Wounds\", the final episode of Torchwood's second series, but has not ruled out the possibility of returning to the show at a later date. Since her exit from the show, Mori has reprised the character in multiple Torchwood audio dramas by Big Finish Productions, some of them with her as a lead with a guest cast, but some with her as part of the team with the rest of the main cast.",
        "birthday": "1971-11-19",
        "deathday": null,
        "gender": 1,
        "homepage": "https://cam.co.uk/talent/naoko-mori/",
        "id": 205659,
        "imdb_id": "nm0605283",
        "known_for_department": "Acting",
        "name": "Naoko Mori",
        "place_of_birth": "Nagoya, Japan",
        "popularity": 0.2626,
        "profile_path": "/hUrrFXt0ncgnfX1cjxvjCZa6DHj.jpg"
    }
}