{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ntgpger7OwFNlEldxuvvFHDKzjW.jpg",
                "genre_ids": [
                    18,
                    80,
                    53
                ],
                "id": 1598,
                "original_language": "en",
                "original_title": "Cape Fear",
                "overview": "Sam Bowden is a small-town corporate attorney. Max Cady is a tattooed, cigar-smoking, Bible-quoting, psychotic rapist. What do they have in common? 14 years ago, Sam was a public defender assigned to Max Cady's rape trial, and he made a serious error: he hid a document from his illiterate client that could have gotten him acquitted. Now, the cagey Cady has been released, and he intends to teach Sam Bowden and his family a thing or two about loss.",
                "popularity": 6.3943,
                "poster_path": "/meJZAAuVcjic2ipvbOPz5UlE4P9.jpg",
                "release_date": "1991-11-13",
                "title": "Cape Fear",
                "video": false,
                "vote_average": 7.252,
                "vote_count": 3630,
                "character": "Corrections Officer",
                "credit_id": "55d60502c3a3685abc0030e8",
                "order": 17
            },
            {
                "adult": false,
                "backdrop_path": "/rmiG2uwcNoGFmBKMoa1pIcf514L.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 37165,
                "original_language": "en",
                "original_title": "The Truman Show",
                "overview": "An insurance salesman begins to suspect that his whole life is actually some sort of reality TV show.",
                "popularity": 16.1854,
                "poster_path": "/vuza0WqY239yBXOadKlGwJsZJFE.jpg",
                "release_date": "1998-06-04",
                "title": "The Truman Show",
                "video": false,
                "vote_average": 8.149,
                "vote_count": 19296,
                "character": "Security Guard",
                "credit_id": "5cd14d5ac3a3683697dd1d2d",
                "order": 36
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            " Antoni Cornacchione",
            "Antoni Carone"
        ],
        "biography": "Antoni Corone is an American actor and producer who lives in Hollywood, Florida. He was raised in Willoughby and Wickliffe, Ohio. When character player Corone launched his screen career in the mid-1980s, producers immediately foresaw a perfect niche for him, and started casting him as rugged, slightly imposing and domineering types - including club bouncers, security personnel, military men, and officers of the law. He bowed with a slate of roles in 1986, including the telemovie Charley Hannah, and eventually graduated to big-screen character actor with bit parts in such A-list Hollywood features as Blood and Wine, Striptease, Bad Boys II, and Out of Time. Corone rose to higher billing with a supporting turn in the Joaquin Phoenix/Mark Wahlberg crime saga We Own the Night. More recently, he can be seen in Reservation Road, 2008's Recount and the Paul Greengrass war drama, Green Zone.\n\nDescription above from the Wikipedia article Antoni Corone, licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 20562,
        "imdb_id": "nm0139175",
        "known_for_department": "Acting",
        "name": "Antoni Corone",
        "place_of_birth": "Willoughby, Ohio, USA",
        "popularity": 0.2987,
        "profile_path": "/85G9purVJGnYwu1wCVQO8ZNHr8Z.jpg"
    }
}