{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uj4vPPQBsD4HXoltTgPysfhm4Qn.jpg",
                "genre_ids": [
                    27,
                    9648,
                    53
                ],
                "id": 20345,
                "original_language": "it",
                "original_title": "L'uccello dalle piume di cristallo",
                "overview": "An American writer living in Rome witnesses an attempted murder that is connected to an ongoing killing spree in the city and conducts his own investigation, despite he and his girlfriend being targeted by the killer.",
                "popularity": 1.7218,
                "poster_path": "/dpALRkwodEIT7TGX9SqTgwVNn0i.jpg",
                "release_date": "1970-02-27",
                "title": "The Bird with the Crystal Plumage",
                "video": false,
                "vote_average": 7.146,
                "vote_count": 796,
                "character": "Sam Dalmas",
                "credit_id": "52fe43e2c3a368484e003d4f",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            " Peter Salerno",
            " Anthony Peter Musante Jr. ",
            "Anthony Peter Musante"
        ],
        "biography": "Tony Musante (1936-2013) was an American actor. Born Anthony Peter Musante, Jr. in Bridgeport, Connecticut, the son of Natalie Anne (née Salerno), a school teacher, and Anthony Peter Musante, an accountant, Musante attended Oberlin College and Northwestern University.\n\nMusante acted in numerous feature films, in the United States and elsewhere, including Italy. Among his body of work are the television series Toma (predecessor to Baretta) and the soap opera As The World Turns, and the 1975 Broadway play, P. S. Your Cat Is Dead!, for which he was nominated for a Drama Desk Award. He was nominated for an Emmy Award for his work in a 1975 episode of Medical Center, A Quality of Mercy. Musante also played Antonio \"Nino\" Schibetta, a feared Mafia boss and the Italian gang leader inside of Emerald City during the first season of the HBO critically acclaimed television series Oz.\n\nDescription above from the Wikipedia article Tony Musante, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1936-06-30",
        "deathday": "2013-11-26",
        "gender": 2,
        "homepage": null,
        "id": 20564,
        "imdb_id": "nm0615540",
        "known_for_department": "Acting",
        "name": "Tony Musante",
        "place_of_birth": "Bridgeport, Connecticut, USA",
        "popularity": 0.2076,
        "profile_path": "/5OrTFkBfDZzUHZ0m1wojAD83npu.jpg"
    }
}