{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/x085XrfEmU31QeXgMFttmuoGr0Y.jpg",
                "genre_ids": [
                    27,
                    53,
                    878
                ],
                "id": 170,
                "original_language": "en",
                "original_title": "28 Days Later",
                "overview": "Twenty-eight days after a killer virus was accidentally unleashed from a British research facility, a small group of London survivors are caught in a desperate struggle to protect themselves from the infected. Carried by animals and humans, the virus turns those it infects into homicidal maniacs -- and it's absolutely impossible to contain.",
                "popularity": 17.8409,
                "poster_path": "/sQckQRt17VaWbo39GIu0TMOiszq.jpg",
                "release_date": "2002-10-31",
                "title": "28 Days Later",
                "video": false,
                "vote_average": 7.235,
                "vote_count": 7832,
                "character": "Hannah",
                "credit_id": "52fe4222c3a36847f8006843",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Betty Curse"
        ],
        "biography": "Megan Burns (born June 25, 1986), also known as Betty Curse, is an English musician and actress.\n\nBurns was born in Liverpool, England. When Burns was 11 her grandmother sent her to acting classes. From there she received a part in the film Liam (2000). She won the Marcello Mastroianni Award at the Venice Film Festival for her performance. Danny Boyle saw this and cast her in his film 28 Days Later, where she played Hannah, one of the survivors of a deadly epidemic. Megan was cast in the film In2ruders, directed by Naeem Mahmood, also starring Tony Hadley and Caprice Bourret.\n\nBurns has since worked as a singer under the pseudonym Betty Curse. Her first single release was a double A-side, \"Met on the Internet\" and \"Excuse All the Blood\", released 29 May 2006. Her first album Hear Lies was released on 31 October 2006 via iTunes.\n\nThe CD version, Here Lies Betty Curse, was released in April 2007. The album's first single, \"God This Hurts\", was released in August 2007, shortly followed by \"Girl with Yellow Hair\" on 13 November. In 2006 she performed and won on a Halloween special of the children's television programme The Slammer with \"Girl With Yellow Hair\"",
        "birthday": "1986-06-25",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 2058,
        "imdb_id": "nm0122796",
        "known_for_department": "Acting",
        "name": "Megan Burns",
        "place_of_birth": "Liverpool, England, UK",
        "popularity": 0.7563,
        "profile_path": "/xOZbpZH5E6YlUvsM2DDd6iYpsnk.jpg"
    }
}