{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xwjVHxKKk2hb6CJX46U4Cv0Zq0a.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 10778,
                "original_language": "en",
                "original_title": "The Man Who Wasn't There",
                "overview": "A tale of murder, crime and punishment set in the summer of 1949. Ed Crane, a barber in a small California town, is dissatisfied with his life, but his wife Doris' infidelity and a mysterious opportunity presents him with a chance to change it.",
                "popularity": 3.1407,
                "poster_path": "/lrCgt8NNMyFsfmXyXiSSCRXNH4u.jpg",
                "release_date": "2001-10-26",
                "title": "The Man Who Wasn't There",
                "video": false,
                "vote_average": 7.527,
                "vote_count": 1653,
                "character": "Prisoner Visitor",
                "credit_id": "619f90f1b4a543008ebeb49d",
                "order": 35
            },
            {
                "adult": false,
                "backdrop_path": "/7ZJ8caqGFoqSclAfRueyU85udQD.jpg",
                "genre_ids": [
                    18
                ],
                "id": 1715,
                "original_language": "en",
                "original_title": "The Cider House Rules",
                "overview": "Homer is an orphan who was never adopted, becoming the favorite of orphanage director Dr. Larch. Dr. Larch imparts his full medical knowledge on Homer, who becomes a skilled, albeit unlicensed, physician. But Homer yearns for a self-chosen life outside the orphanage. What will Homer learn about life and love in the cider house? What of the destiny that Dr. Larch has planned for him?",
                "popularity": 5.9497,
                "poster_path": "/qAECAgqjSFRVZzEEGbFAZqZNiDh.jpg",
                "release_date": "1999-12-17",
                "title": "The Cider House Rules",
                "video": false,
                "vote_average": 7.076,
                "vote_count": 1218,
                "character": "Big Dot",
                "credit_id": "6610c9921fa1c8017cd1b85d",
                "order": 28
            },
            {
                "adult": false,
                "backdrop_path": "/6zIOO1NrTehQkDaNfvga4luSRQc.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 1548,
                "original_language": "en",
                "original_title": "Ghost World",
                "overview": "Two quirky, cynical teenaged girls try to figure out what to do with their lives after high school graduation. After they play a prank on an eccentric, middle aged record collector, one of them befriends him, which causes a rift in the girls’ friendship.",
                "popularity": 2.3001,
                "poster_path": "/uwKqnUPE4dSM0kKuMW0vXpURh2T.jpg",
                "release_date": "2001-07-20",
                "title": "Ghost World",
                "video": false,
                "vote_average": 7.082,
                "vote_count": 1489,
                "character": "Popcorn Customer",
                "credit_id": "5b1a14ed0e0a261f9000f365",
                "order": 47
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Born to upstate New York parents Nelson Binner and Gladys Witt, Mary Bogue was the fourth of five children. Her love of acting was apparent early in her life, when she acted out imagined scenes in the second story hallway of their home on Division Street. Moving to California in 1959 only fueled the fire and soon she tried out and got the part in Beauty and the Beast, a children's production at The Old Globe Theatre in San Diego. The bug followed her into junior and high school productions, but when she struck out on her own in the early 70s, she found it wasn't as easy as sitting at the world famous Schwab's on Sunset. Her first audition stopped her dead in her tracks for years when the \"casting director\" expected nudity.\n\nIt was only in 1990 that she returned to her first love, albeit slowly as she was a caregiver to 16 foster daughters. Only when she was cast in Antonio Bandera's directorial debut, Crazy in Alabama (1999)(which she was cut from) did she pursue this dream.",
        "birthday": "1954-12-31",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 2059762,
        "imdb_id": "nm0091929",
        "known_for_department": "Acting",
        "name": "Mary Bogue",
        "place_of_birth": "North Tonawanda, New York, USA",
        "popularity": 0.2175,
        "profile_path": "/u5elonZI8FnTuV3bK1sSyX28cYh.jpg"
    }
}