{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6zIOO1NrTehQkDaNfvga4luSRQc.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 1548,
                "original_language": "en",
                "original_title": "Ghost World",
                "overview": "Two quirky, cynical teenaged girls try to figure out what to do with their lives after high school graduation. After they play a prank on an eccentric, middle aged record collector, one of them befriends him, which causes a rift in the girls’ friendship.",
                "popularity": 2.2936,
                "poster_path": "/uwKqnUPE4dSM0kKuMW0vXpURh2T.jpg",
                "release_date": "2001-07-20",
                "title": "Ghost World",
                "video": false,
                "vote_average": 7.08,
                "vote_count": 1490,
                "character": "Fred Chatman",
                "credit_id": "5b1a12149251414bbb0115af",
                "order": 28
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Born Esserlaine Jones in Baton Rouge, La., JJ Bad Boy Jones began playing the guitar at age 5 and singing in a Baptist church choir soon after.\n\nAt 16 he took a job as a long-haul truck driver and started to compose lyrics as he drove.\n\nHe quit his day job after undergoing back surgery in 1996, Lyle said. He was almost 70 at the time.\n\nSmall in stature with a powerful voice, Jones arrived in Los Angeles in the late 1950s and began\n\nperforming in local clubs and bars.\n\nHe was faithful to the blues music he grew up with in the South, playing songs made popular by a number\n\nof his friends, particularly Albert King; King’s brother, B.B. King; Stevie Ray Vaughn; and Jones’ cousin,\n\nEddie “Guitar Slim” Jones.\n\nJones’ friends called him the “bad boy” of blues guitarists as a sign of respect, and he was dubbed J.J. by\n\nAlbert King as a compliment suggesting his own legendary brother.\n\nWith his band, “The Bad Boys,” Jones regularly performed at Harvelle’s Blues Club in Santa Monica,\n\nB.B. King’s Club at Universal City and Babe’s and Ricky’s Inn in Los Angeles.\n\n“J.J. was a fixture in the Los Angeles blues scene,” said Jan Garfinkle, who played keyboard with Jones’\n\nband for many years. “He played traditional blues and he was an excellent guitarist, even in his 70s.”\n\nJones recorded three albums. The best-known, “Ashes in the Wind” (Aries Records), was released in\n\n1998.",
        "birthday": "1927-01-03",
        "deathday": "2004-01-12",
        "gender": 2,
        "homepage": "https://www.jjbadboyjones.com/",
        "id": 2059756,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "J.J. 'Bad Boy' Jones",
        "place_of_birth": "Baton Rouge, Louisiana, USA",
        "popularity": 0.0658,
        "profile_path": null
    }
}