{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yYderAvjtKnYLBxKujVpmKTVlOM.jpg",
                "genre_ids": [
                    18,
                    10752
                ],
                "id": 600,
                "original_language": "en",
                "original_title": "Full Metal Jacket",
                "overview": "A pragmatic U.S. Marine observes the dehumanizing effects the U.S.-Vietnam War has on his fellow recruits from their brutal boot camp training to the bloody street fighting in Hue.",
                "popularity": 6.665,
                "poster_path": "/kMKyx1k8hWWscYFnPbnxxN4Eqo4.jpg",
                "release_date": "1987-06-26",
                "title": "Full Metal Jacket",
                "video": false,
                "vote_average": 8.123,
                "vote_count": 10970,
                "character": "Animal Mother",
                "credit_id": "52fe425bc3a36847f8017d43",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/uw4SnKFZ453Gxmj5XR5Susj8TNo.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 602,
                "original_language": "en",
                "original_title": "Independence Day",
                "overview": "Strange phenomena surface around the globe. The skies ignite. Terror races through the world's major cities. As these extraordinary events unfold, it becomes increasingly clear that a force of incredible magnitude has arrived. Its mission: total annihilation over the Fourth of July weekend. The last hope to stop the destruction is an unlikely group of people united by fate and unimaginable circumstances.",
                "popularity": 9.2492,
                "poster_path": "/p0BPQGSPoSa8Ml0DAf2mB2kCU0R.jpg",
                "release_date": "1996-06-25",
                "title": "Independence Day",
                "video": false,
                "vote_average": 6.896,
                "vote_count": 9961,
                "character": "Major Mitchell",
                "credit_id": "52fe425bc3a36847f8017fb7",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/kWYHKVCl2aD3kRco4eRUr4h6LsD.jpg",
                "genre_ids": [
                    18,
                    36,
                    10752,
                    28
                ],
                "id": 2024,
                "original_language": "en",
                "original_title": "The Patriot",
                "overview": "After proving himself on the field of battle in the French and Indian War, Benjamin Martin wants nothing more to do with such things, preferring the simple life of a farmer. But when his son Gabriel enlists in the army to defend their new nation, America, against the British, Benjamin reluctantly returns to his old life to protect his son.",
                "popularity": 11.183,
                "poster_path": "/fWZd815QxUCUcrWQZwUkAp9ljG.jpg",
                "release_date": "2000-06-28",
                "title": "The Patriot",
                "video": false,
                "vote_average": 7.181,
                "vote_count": 4087,
                "character": "Capt. Wilkins",
                "credit_id": "52fe432dc3a36847f80404ff",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/3aGsZdB5ud6LmU9lppwTLh2fqH1.jpg",
                "genre_ids": [
                    878,
                    28,
                    12,
                    53
                ],
                "id": 16320,
                "original_language": "en",
                "original_title": "Serenity",
                "overview": "When the renegade crew of Serenity agrees to hide a fugitive on their ship, they find themselves in an action-packed battle between the relentless military might of a totalitarian regime who will destroy anything – or anyone – to get the girl back and the bloodthirsty creatures who roam the uncharted areas of space. But... the greatest danger of all may be on their ship.",
                "popularity": 7.7428,
                "poster_path": "/4sqUOaPFoP2W81mq1UYqZqf5WzA.jpg",
                "release_date": "2005-09-25",
                "title": "Serenity",
                "video": false,
                "vote_average": 7.364,
                "vote_count": 3674,
                "character": "Jayne Cobb",
                "credit_id": "52fe46c59251416c75082feb",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/mmRY0ZtKtK3lP5TYmI2jDC4EpZa.jpg",
                "genre_ids": [
                    18
                ],
                "id": 16619,
                "original_language": "en",
                "original_title": "Ordinary People",
                "overview": "Beth, Calvin, and their son Conrad are living in the aftermath of the death of the other son. Conrad is overcome by grief and misplaced guilt to the extent of a suicide attempt. He is in therapy. Beth had always preferred his brother and is having difficulty being supportive to Conrad. Calvin is trapped between the two trying to hold the family together.",
                "popularity": 5.7713,
                "poster_path": "/tJVETEDAKgD3fEh88SHOvMvOQue.jpg",
                "release_date": "1980-09-19",
                "title": "Ordinary People",
                "video": false,
                "vote_average": 7.467,
                "vote_count": 656,
                "character": "Stillman",
                "credit_id": "52fe46e09251416c75086871",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "آدام بالدوین"
        ],
        "biography": "Appearing in dozens of films since 1980, Baldwin rose to prominence as the troubled outcast Ricky Linderman in My Bodyguard (1980) and moved on to bigger roles in D.C. Cab (1983), Full Metal Jacket (1987), Independence Day (1996), The Patriot (2000) and Serenity (2005)—in which he reprises his role as the mercenary Jayne Cobb from the television series Firefly. His other work includes Radio Flyer (1992), From the Earth to the Moon (1998), The X-Files (Knowle Rohrer), Smoke Jumpers (1996), The Cape, Men in Black: The Series, Stargate SG-1, Angel, The Inside, NCIS and the 2005 remake of The Poseidon Adventure. He also starred in the ABC series Day Break as Chad Shelten in 2006. Baldwin parodied the Ricky Linderman character in the 2008 film Drillbit Taylor. Baldwin won a SyFy Genre Award in 2006 for Best Supporting Actor/Television for his role as Jayne Cobb in the television series Firefly. Baldwin was cast as Clark Kent/Superman in the first DC animated universe movie, Superman: Doomsday, based on DC Comics' The Death of Superman and is currently co-starring in the NBC television show Chuck as NSA Agent John Casey. The show premiered September 24, 2007. Baldwin has a role as a voice actor in the Xbox 360 games Halo 3 and Halo 3: ODST, the latter putting him in the role of Cpl. Taylor \"Dutch\" Miles. Baldwin also appears as a voice actor in Half Life 2: Episode 2 for various resistance soldiers and citizens. Adam also appeared in Mass Effect 2, playing the role of Quarian marine Kal'Reegar. Baldwin was born in Chicago, Illinois and studied at New Trier Township High School East in Winnetka, Illinois. He has three children with his wife, Ami. He has been a registered voter with the Democratic Party since 1980, but admits reexamining his views after being given a copy of David Horowitz's book Radical Son. Politically, he considers himself a \"small government conservative libertarian\", and has contributed blogs to the Huffington Post and Big Hollywood. As a hobby, he also collects and posts links to varying viewpoints on his Twitter feed",
        "birthday": "1962-02-27",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2059,
        "imdb_id": "nm0000284",
        "known_for_department": "Acting",
        "name": "Adam Baldwin",
        "place_of_birth": "Winnetka, Illinois, Estados Unidos",
        "popularity": 1.3516,
        "profile_path": "/rtRCD2rl9k3RVgyv3cHaUJer0Ms.jpg"
    }
}