{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6zIOO1NrTehQkDaNfvga4luSRQc.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 1548,
                "original_language": "en",
                "original_title": "Ghost World",
                "overview": "Two quirky, cynical teenaged girls try to figure out what to do with their lives after high school graduation. After they play a prank on an eccentric, middle aged record collector, one of them befriends him, which causes a rift in the girls’ friendship.",
                "popularity": 2.2936,
                "poster_path": "/uwKqnUPE4dSM0kKuMW0vXpURh2T.jpg",
                "release_date": "2001-07-20",
                "title": "Ghost World",
                "video": false,
                "vote_average": 7.08,
                "vote_count": 1490,
                "character": "Blueshammer Member",
                "credit_id": "5b1a12e1c3a36848ed00d329",
                "order": 33
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Troubadour rocker Johnny Irion has solidified his reputation as one of the most spirited artists in the folk-rock genre. His career is steeped in authentic American punk & roots music, a heritage he embraced wholeheartedly before his 22-year marriage to Sarah Lee Guthrie and after. Collaborating with legends like Pete Seeger, Jeff Bridges, Wilco, Dawes, and The Mother Hips has been instrumental in shaping Johnny's musical journey. In 2018, Johnny captivated audiences with his acclaimed solo album \"Driving Friend,\" earning a stellar 4-star review in MOJO Magazine and gaining recognition in esteemed publications & news outlets like Rolling Stone and NPR. Notably, Jackson Browne invited Johnny to perform his song \"Hard Working People\" in Washington, DC, the album's tracks found a place on various playlists, underscoring the enduring appeal of his music.",
        "birthday": "1969-02-03",
        "deathday": null,
        "gender": 2,
        "homepage": "https://ragman.org/johnny-irion",
        "id": 2059760,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Johnny Irion",
        "place_of_birth": "Columbia, South Carolina",
        "popularity": 0.0306,
        "profile_path": "/8tOeWsWZWpleVQpZ0MEp1SXJxsU.jpg"
    }
}