{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5VuOmxGfqu7yf05q8Q6SUKOh7oe.jpg",
                "genre_ids": [
                    12,
                    18,
                    36
                ],
                "id": 169881,
                "original_language": "en",
                "original_title": "The Physician",
                "overview": "England, 1021. Rob Cole, a boy born in a miserable mining town, swears to become a physician and vanquish disease and death. His harsh path of many years, a quest for knowledge besieged by countless challenges and sacrifices, leads him to the remote Isfahan, in Persia, where he meets Ibn Sina, the greatest healer of his time.",
                "popularity": 3.2959,
                "poster_path": "/18eJr4Fc4HKymLgKLgGQbD37SPK.jpg",
                "release_date": "2013-12-25",
                "title": "The Physician",
                "video": false,
                "vote_average": 7.349,
                "vote_count": 1119,
                "character": "Davout Hosein",
                "credit_id": "55a5846092514171cd000038",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Fahri Yardim",
            "Fahri Ogün Yardim"
        ],
        "biography": "Fahri Yardim was born in Hamburg, Germany, the son of an academic family of Turkish extraction. Performing on stage in school productions he developed his love of acting. He trained at the Hamburger Bühnenstudio der darstellenden Künste (Hamburg Stage Studio of the Performing Arts) and appeared in theatre productions in Berlin and Hamburg. Fahri represents a generation that focuses on character rather than nationality. He is a naturalist who avoids ethnic stereotype, and his versatility is mirrored in his choice of roles: He portrayed an Anatolian in Almanya - Willkommen in Deutschland (2011), a Greek in Kebab Connection (2004), a German Sinte in Chiko(2008), a German in Mogadischu (2008), and a woman in Unter Frauen (2012). His most memorable roles include the Brunswick-set film 66/67 - Fairplay war gestern(2009). 2012 proved to be a peak year allowing him to demonstrate the range of his talent and his powerful, committed, discursive and nuanced personality. He played a priest in Marcus H. Rosenmüller's Wer's glaubt, wird selig (2012), an artist in Marc Rothemund's Mann tut was Mann kann (2012), a paramedic in Lars Becker's ZDF thrillerDie Geisterfahrer (2012), a doctor in the ProSieben crime drama Kreutzer kommt ... ins Krankenhaus (2012) and a detective in the Sat.1 thriller drama Hannah Mangold & Lucy Palm (2011). In 2013 he will appear with Ben Kingsley in the international movie version of Der Medicus (2013). In Austria he is a regular in the ORF police drama CopStories. And in March of 2013 he was Til Schweiger's partner in the first of several projected Tatort (1970) episodes.",
        "birthday": "1980-08-07",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 20619,
        "imdb_id": "nm1689177",
        "known_for_department": "Acting",
        "name": "Fahri Yardım",
        "place_of_birth": "Hamburg, Germany",
        "popularity": 0.2463,
        "profile_path": "/wO4U2qYkayOHwStZXWc5YHnnLCA.jpg"
    }
}