{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/55A2d6rWj0SYb52xKzx6DweiuEM.jpg",
                "genre_ids": [
                    35,
                    18,
                    80
                ],
                "id": 74306,
                "original_language": "en",
                "original_title": "God Bless America",
                "overview": "Fed up with the cruelty and stupidity of American culture, an unlikely duo goes on a killing spree, killing reality TV stars, bigots and others they find repugnant.",
                "popularity": 2.081,
                "poster_path": "/t8g7rIcFquJqsqwIISZ1L5zou1j.jpg",
                "release_date": "2012-05-11",
                "title": "God Bless America",
                "video": false,
                "vote_average": 6.974,
                "vote_count": 1002,
                "character": "Ashylee Chloe's BFF",
                "credit_id": "65008a63ffc9de0edf60e392",
                "order": 57
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Sammy Raye"
        ],
        "biography": "A native Texan, Samantha Droke was born on November 8th, 1987, in De Leon. She is the daughter of Lyndon and Synthia Droke. Samantha possessed a love of performing from a very young age. She started out singing and modeling and then her interests began to move towards acting. She truly believed that she was destined for the silver screen. Samantha began modeling and acting in plays and commercials locally. She was discovered by agent Nicole Connor at the tender age of fifteen. Within two weeks, she landed her first independent feature film, Truce (2005), directed by Matthew Marconi and co-starring alongside Buck Taylor (who played \"Newly\" in Gunsmoke (1955)) and Oscar-nominated actor George Kennedy from Cool Hand Luke (1967). After wrapping Truce (2005), she truly caught the bug. Her family sold everything they had but their clothes and moved to LA. At age seventeen, Samantha began to hit her stride. She landed a national commercial for Cingular Wireless and recently booked a guest-star role on the Hallmark Channel's Jane Doe: The Wrong Face (2005) (directed by Mark Griffiths) and a starring role in the feature film Don't Be Scared (2006) (directed and produced by Master P and Romeo Miller). Samantha also performs at the LA Connection Comedy Improv Club. Not only beautiful and intelligent, Samantha has the kind of drive and determination rarely seen in actors her age.",
        "birthday": "1987-11-08",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 206301,
        "imdb_id": "nm1534182",
        "known_for_department": "Acting",
        "name": "Samantha Droke",
        "place_of_birth": "De Leon, Texas, USA",
        "popularity": 0.3982,
        "profile_path": "/rC7axZ4EN8AGfGymEL8iUbR9n0L.jpg"
    }
}