{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hSd4jgQjx6GcRAB8ScOXPjKBagC.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 308084,
                "original_language": "en",
                "original_title": "Tangerine",
                "overview": "It's Christmas Eve in Tinseltown and Sin-Dee is back on the block. Upon hearing that her pimp boyfriend hasn't been faithful during the 28 days she was locked up, the working girl and her best friend, Alexandra, embark on a mission to get to the bottom of the scandalous rumor. Their rip-roaring odyssey leads them through various subcultures of Los Angeles, including an Armenian family dealing with their own repercussions of infidelity.",
                "popularity": 1.8711,
                "poster_path": "/EKLR5c61XQzBTeMokFrmS3kdt8.jpg",
                "release_date": "2015-07-10",
                "title": "Tangerine",
                "video": false,
                "vote_average": 6.893,
                "vote_count": 754,
                "character": "Parsimonious John",
                "credit_id": "5592d1fcc3a368774b001845",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "​From Wikipedia, the free encyclopedia\n\nScott Krinsky is a Los Angeles-based actor and comic best known for his role as Jeff Barnes on the hit TV series Chuck and his role as Darryl on The O.C.. He was born in Washington D.C. in 1968 and attended Salisbury University where he majored in Communication and Broadcast Journalism. He has also attended The Epicurean School of Culinary Arts in L.A. In addition to being an actor, he is a writer and a stand-up comedian who performs at The Comedy Store and Improv in L.A.\n\nDescription above from the Wikipedia article Scott Krinsky, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1968-11-24",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 206334,
        "imdb_id": "nm0471381",
        "known_for_department": "Acting",
        "name": "Scott Krinsky",
        "place_of_birth": "Washington, District of Columbia, USA",
        "popularity": 0.4428,
        "profile_path": "/tpmq8VSDTMpJuZdn2KDbNWdz594.jpg"
    }
}