{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8G6HCS82vNxgg5wp7oBDSk32XpF.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 558,
                "original_language": "en",
                "original_title": "Spider-Man 2",
                "overview": "Peter Parker is going through a major identity crisis. Burned out from being Spider-Man, he decides to shelve his superhero alter ego, which leaves the city suffering in the wake of carnage left by the evil Doc Ock. In the meantime, Parker still can't act on his feelings for Mary Jane Watson, a girl he's loved since childhood. A certain anger begins to brew in his best friend Harry Osborn as well...",
                "popularity": 8.9995,
                "poster_path": "/aGuvNAaaZuWXYQQ6N2v7DeuP6mB.jpg",
                "release_date": "2004-06-25",
                "title": "Spider-Man 2",
                "video": false,
                "vote_average": 7.296,
                "vote_count": 15733,
                "character": "Mr. Aziz",
                "credit_id": "52fe4252c3a36847f8015077",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/ojgXOhVi9Yk8irDpRfDkIzdD1LK.jpg",
                "genre_ids": [
                    35,
                    10749,
                    18
                ],
                "id": 18240,
                "original_language": "en",
                "original_title": "The Proposal",
                "overview": "When she learns she's in danger of losing her visa status and being deported, overbearing book editor Margaret Tate forces her put-upon assistant, Andrew Paxton, to marry her.",
                "popularity": 13.1931,
                "poster_path": "/aEqtJDj8MvSDQwzggvcOfFTZMw.jpg",
                "release_date": "2009-06-02",
                "title": "The Proposal",
                "video": false,
                "vote_average": 7.155,
                "vote_count": 7159,
                "character": "Bob Spaulding",
                "credit_id": "52fe476d9251416c75098e67",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/yJYFp97trLmcNAQb5A4SXXhNJU4.jpg",
                "genre_ids": [
                    35,
                    10749,
                    14,
                    18
                ],
                "id": 103332,
                "original_language": "en",
                "original_title": "Ruby Sparks",
                "overview": "Calvin is a young novelist who achieved phenomenal success early in his career but is now struggling with his writing – as well as his romantic life. Finally, he makes a breakthrough and creates a character named Ruby who inspires him. When Calvin finds Ruby, in the flesh, sitting on his couch about a week later, he is completely flabbergasted that his words have turned into a living, breathing person.",
                "popularity": 10.8776,
                "poster_path": "/zELurt0GVRkR5X5ymuk7KXUxhC8.jpg",
                "release_date": "2012-07-25",
                "title": "Ruby Sparks",
                "video": false,
                "vote_average": 7.119,
                "vote_count": 1694,
                "character": "Cyrus Modi",
                "credit_id": "52fe4a1cc3a36847f81ba323",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/l7gkk5K0NnVSqZ0Qr4zkNskH9AC.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 43923,
                "original_language": "en",
                "original_title": "It's Kind of a Funny Story",
                "overview": "A clinically depressed teenager gets a new start after he checks himself into an adult psychiatric ward.",
                "popularity": 3.4846,
                "poster_path": "/hQE4q8Szeaae4davgB7o8MTLmwr.jpg",
                "release_date": "2010-10-08",
                "title": "It's Kind of a Funny Story",
                "video": false,
                "vote_average": 6.959,
                "vote_count": 2390,
                "character": "Dr. Mahmoud",
                "credit_id": "584907ee92514119b600fece",
                "order": 12
            },
            {
                "adult": false,
                "backdrop_path": "/fBvSfLetWlAMevQVHa0nBDV1Fon.jpg",
                "genre_ids": [
                    28,
                    53
                ],
                "id": 1572,
                "original_language": "en",
                "original_title": "Die Hard: With a Vengeance",
                "overview": "New York detective John McClane is back and kicking bad-guy butt in the third installment of this action-packed series, which finds him teaming with civilian Zeus Carver to prevent the loss of innocent lives. McClane thought he'd seen it all, until a genius named Simon engages McClane, his new \"partner\" -- and his beloved city -- in a deadly game that demands their concentration.",
                "popularity": 6.5824,
                "poster_path": "/buqmCdFQEWwEpL3agGgg2GVjN2d.jpg",
                "release_date": "1995-05-19",
                "title": "Die Hard: With a Vengeance",
                "video": false,
                "vote_average": 7.273,
                "vote_count": 6369,
                "character": "Arab Cabbie",
                "credit_id": "5ab716ff0e0a261ff1016903",
                "order": 30
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            " Aasif Mandviwala",
            "아시프 맨드비",
            "阿西夫·曼迪維"
        ],
        "biography": "Aasif Hakim Mandviwala (known professionally as Aasif Mandvi; born March 5, 1966) is a British-American actor, comedian and author. He made his television debut as a doorman at the Miami Biltmore Hotel in the episode \"Line of Fire\" of the series Miami Vice.  In 2006, Mandvi auditioned for The Daily Show and was hired immediately and appeared on the show the same day. He began appearing as an occasional contributing correspondent on The Daily Show on August 9, 2006. On March 12, 2007, he was promoted to a regular correspondent. In October 2013, during a segment on The Daily Show, his interview with Don Yelton led to Yelton's resignation from the North Carolina Republican Party office.\n\nIn 2013, he was cast in a recurring role on the FOX romantic comedy, Us & Them. Beginning in June 2015, he portrayed Rafiq Massoud in the HBO comedy series The Brink. He also served as a writer and co-producer on the series. Also in 2015, he was the lead actor, co-writer and producer of the web series Halal in the Family, which premiered on Funny or Die. In 2016, he joined the climate change documentary show Years of Living Dangerously as one of its celebrity correspondents.\n\nBeginning in 2017, he had a short recurring role on Netflix's  A Series of Unfortunate Events as Montgomery \"Uncle Monty\" Montgomery, a herpetologist and distant relative of the Baudelaire children. In 2019, he starred in CBS' supernatural drama series Evil as Ben Shakir, a carpenter who works as a technical expert, equipment handler and debunker of supernatural phenomena. His other recurring roles include Oz, CSI, Tanner on Tanner, The Bedford Diaries, Jericho, Blue Bloods, Younger, and This Way Up. He hosted the game show Would I Lie to You? (2022).\n\nHe played minor roles in the films The Siege and Die Hard with a Vengeance. He played the doctor who diagnosed Paul Vitti's (Robert De Niro) panic attacks in Analyze This, and had a role as Mr. Aziz of \"Joe's Pizza\" in Spider-Man 2. He played the tone deaf doorman Khan in Music and Lyrics, a dentist alongside Ricky Gervais in Ghost Town, Bob Spaulding in The Proposal, and appeared in It's Kind of a Funny Story.\n\nIn M. Night Shyamalan's The Last Airbender (released in 2010) he played a major role as Commander Zhao. He played the role of Mr. Chetty in The Internship and Ash Vasudevan in Million Dollar Arm. He has appeared in other films including Random Hearts, Margin Call, Dark Horse, The Dictator, Ruby Sparks, Premium Rush, Movie 43, Mother's Day, Drunk Parents, and more.",
        "birthday": "1966-03-05",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 20644,
        "imdb_id": "nm0541902",
        "known_for_department": "Acting",
        "name": "Aasif Mandvi",
        "place_of_birth": "Mumbai, Maharashtra, India",
        "popularity": 0.4887,
        "profile_path": "/hoBCqgxK2JqV3MOQYncHRMfwu8V.jpg"
    }
}