{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dUOqB0JFIvoS1ZRj1bdY5mAd73R.jpg",
                "genre_ids": [
                    18,
                    53
                ],
                "id": 590854,
                "original_language": "pl",
                "original_title": "Sala samobójców. Hejter",
                "overview": "A duplicitous young man finds success in the dark world of social media smear tactics — but his virtual vitriol soon has violent real-life consequences.",
                "popularity": 1.4359,
                "poster_path": "/fX3XYJZLumDtTfncHY233Cwiorj.jpg",
                "release_date": "2020-03-06",
                "title": "The Hater",
                "video": false,
                "vote_average": 6.918,
                "vote_count": 568,
                "character": "'FitAneta'",
                "credit_id": "600ef4dcb5bc21003e92d56f",
                "order": 37
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Julia Wieniawa-Narkiewicz"
        ],
        "biography": "She took her first steps in acting as a teenager. She made her debut at the Roma Musical Theater in Warsaw.\n\nAt the age of fifteen, she went to first casting in her life and won it, getting a role in one of the most popular Polish series – “rodzinka.pl”. It gave her popularity and opened the door to further career.\n\nJulia made her debut on the big screen in Patryk Vega’s movie “Women of Mafia”. Later, she starred in a number of cinema productions – such as “Small World” (dir. Patryk Vega) or awarded at the Tribeca Film Festival – “Suicide Room: The Hater” (dir. Jan Komasa). The actress could also be seen in Netflix hits, which were appreciated by viewers around the world: “Nobody Sleeps In The Woods Tonight” (dir. Bartosz Kowalski), “All My Friends Are Dead” (dir. Jan Belcl) or “How I Fell in Love with a Gangster” (dir. Maciej Kawulski).\n\nShe played one of the leading roles in the TV series “Zawsze warto” awarded with Telekamera – one of the most important television awards in Poland.\n\nJulia Wieniawa also has a dubbing experience. She lent her voice to Cinderella in the Polish version of movie “Cinderella and the Secret Prince”, as well as Salma in the “Salma’s Big Wish”.\n\nThe actress has played theatrical roles as well. She appeared in the Television Theater production “Dołęga-Mostowicz. Kiedy zamykam oczy” (dir. Marek Bukowski) and in the play “Dom Lalki 2” (dir. Tomasz Dutkiewicz) staged at the capital’s Komedia Theatre. From February 2023, we can see her at the Garnizon Sztuki Theater in Warsaw in the play “Gra” directed by Norbert Rakowski.",
        "birthday": "1998-12-23",
        "deathday": null,
        "gender": 1,
        "homepage": "https://wieniawajulia.com/",
        "id": 2068758,
        "imdb_id": "nm8709489",
        "known_for_department": "Acting",
        "name": "Julia Wieniawa",
        "place_of_birth": "Warsaw, Poland",
        "popularity": 0.3933,
        "profile_path": "/egio8ZLv1WWdXQtCrcD1jWwe0ej.jpg"
    }
}