{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/y2FNZLHynsevBnVTocGW6c3pQpr.jpg",
                "genre_ids": [
                    18
                ],
                "id": 422,
                "original_language": "it",
                "original_title": "8½",
                "overview": "Guido Anselmi, a film director, finds himself creatively barren at the peak of his career. Urged by his doctors to rest, Anselmi heads for a luxurious resort, but a sorry group gathers—his producer, staff, actors, wife, mistress, and relatives—each one begging him to get on with the show. In retreat from their dependency, he fantasizes about past women and dreams of his childhood.",
                "popularity": 4.83,
                "poster_path": "/t8pFvll3cFrn5NmqZz2FawqIwPe.jpg",
                "release_date": "1963-02-14",
                "title": "8½",
                "video": false,
                "vote_average": 8.1,
                "vote_count": 2411,
                "character": "Matilde, Luisa's Sister",
                "credit_id": "5b31a3ffc3a3685311007f18",
                "order": 27
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Elisabetta Catalano (1944 – 4 January 2015) was an Italian fine-art photographer mostly specialized in black and white and color portraiture.  Catalano was born in Rome, and took up photography as an autodidact. In the early 1960s she started collaborating with news and fashion magazines including L'Espresso and the Italian edition of Vogue. In 1963 she documented the work of Federico Fellini, who offered a cameo in his current film, 8½. Fellini and Catalano would forge a friendship that resulted in Catalano shooting extensively the director on set. At about the same time, she met many visual artists associtated with the Arte povera movement like Alighiero Boetti, Pino Pascali, Jannis Kounellis, Eliseo Mattiacci and Cesare Tacchi. Catalano's first solo exhibition, Uomini, was held in 1973 at the Il Cortile Gallery in Rome and at the Galleria Milano in Milan. It consisted of portraits of male artists, including Joseph Beuys, Enrico Castellani, Sandro Chia, Luciano Fabro, Joseph Kosuth, Vettor Pisani, Emilio Prini, Fabio Mauri and others.\n\nIn 1978 the Polaroid Corporation commissioned her the exhibition Faces and Facades – a series of portraits of popular Italian film directors on Polaroid sheets. In 1980 she directed Bonjour Monsieur Lartigue, a short film about the French painter and photographer J.-H. Lartigue.\n\nIn the 1980s she held the exhibition People of the French culture at the Carnavalet Museum in Paris. The photographs in the show were later purchased by the Maison européenne de la photographie in Paris and placed in the institution's permanent collection. In 1992 the Galleria Nazionale d'Arte Moderna in Rome held a retrospective of her work called I ritratti (\"The Portraits\").\n\nCatalano's last exhibition, Le Collezioni, Non basta ricordare (\"The Collections, remembering is not enough\") was held at the MAXXI Museum in Rome in 2014.",
        "birthday": "1944-08-11",
        "deathday": "2015-01-04",
        "gender": 1,
        "homepage": null,
        "id": 2072452,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Elisabetta Catalano",
        "place_of_birth": "Rome, Lazio, Italy",
        "popularity": 0.0071,
        "profile_path": null
    }
}