{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xkaeirZBfs9nfz2TJoFHxyOLCcC.jpg",
                "genre_ids": [
                    18
                ],
                "id": 22683,
                "original_language": "en",
                "original_title": "Gifted Hands: The Ben Carson Story",
                "overview": "Gifted Hands: The Ben Carson Story is a movie based on the life story of world-renowned neurosurgeon Ben Carson from 1961 to 1987.",
                "popularity": 7.3137,
                "poster_path": "/4NxxtiqezjUmUxoDTOjO5FeJvFt.jpg",
                "release_date": "2009-02-07",
                "title": "Gifted Hands: The Ben Carson Story",
                "video": false,
                "vote_average": 7.8,
                "vote_count": 744,
                "character": "Med Student (uncredited)",
                "credit_id": "5f3f22ee19ab5900351e18dc",
                "order": 67
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Curtis Matzke is an independent filmmaker from central Michigan and founder of the media production company Unfurnished Films. Focusing primarily on writing and directing, he aims to contribute creatively and technically to the film arts through all phases of the production process. Curtis works as a freelance editor and videographer in Chicago, Illinois. In 2012, Curtis wrote and directed his first feature-length fiction film, Complex, which was shot with a micro-budget and recognized by several awards, including Best Narrative Feature at the Made-in-Michigan Film Festival. Curtis's work has screened at various venues nationally and internationally and he was named as Outstanding Lansing Filmmaker in 2011. In addition to his own productions, Curtis has worked independently and as part of a team on a variety of other fiction, nonfiction, and commercial film and video projects. Curtis has worked with various Chicago institutions, including Second City, Columbia College, and the Midwest Independent Film Festival. He is a member of IFP Chicago and the Sundance Institute. Curtis has a B.A. and an M.A. in Media Arts and Technology from Michigan State University with a concentration in Television, Cinema, and Radio, a minor in Film Studies, and a Specialization in Design.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2072293,
        "imdb_id": null,
        "known_for_department": "Directing",
        "name": "Curtis Matzke",
        "place_of_birth": null,
        "popularity": 0.0214,
        "profile_path": "/uHxNmDsWWPNHKR1Qc69je52NLk3.jpg"
    }
}