{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4fLZUr1e65hKPPVw0R3PmKFKxj1.jpg",
                "genre_ids": [
                    16,
                    35,
                    10751,
                    14,
                    10749
                ],
                "id": 976573,
                "original_language": "en",
                "original_title": "Elemental",
                "overview": "In a city where fire, water, land and air residents live together, a fiery young woman and a go-with-the-flow guy will discover something elemental: how much they have in common.",
                "popularity": 13.222,
                "poster_path": "/4Y1WNkd88JXmGfhtWR7dmDAo1T2.jpg",
                "release_date": "2023-06-14",
                "title": "Elemental",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 4958,
                "character": "Cinder (voice)",
                "credit_id": "6422e2cc2dc9dc00fd1c88f9",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Sheila Vosough Ommi",
            "Sheila Ommi",
            "Shila Vosough Ommi",
            "Shila Vossugh Ommi",
            "Sheila Vosough",
            "希拉·歐米"
        ],
        "biography": "Shila Vosough Ommi is an American actress, director, writer and producer who was born in Tehran, Iran, and grew up in Los Angeles. She has directed and produced award winning plays in Los Angeles, and for over a decade she toured internationally under the name Shila Vosough in an Iranian-American theater production company performing plays in Persian. Shila directed the feature film, 'Wake Up Sleeping Beauty', a psychological dramatic film about a young Iranian-American woman waking up from cultural trappings and 'curses,' and coming into her own power. It was produced by the Los Angeles County Department of Mental Health. A graduate of UCLA, Ommi received a Departmental Honors for a 'Bachelor of Science in Biological Anthropology' minoring in Biology, where she wrote a published thesis on 'Parental Investment Among Vervet Monkeys.' She later attended the Ruskin School of Acting where she studied under the tutelage of John Ruskin and Sir Anthony Hopkins. In addition to emceeing charities, hosting award shows, moderating and occasionally performing stand-up comedy, Ommi is also a prolific voice-over artist narrating documentaries and voicing characters in animated TV and web series.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 2073564,
        "imdb_id": "nm1937116",
        "known_for_department": "Acting",
        "name": "Shila Ommi",
        "place_of_birth": "Tehran, Iran",
        "popularity": 0.1238,
        "profile_path": "/i9m2RGrANNxidj0bVKlSs0zHPNX.jpg"
    }
}