{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5tb7RjF0OAAaiGDUXsuedvhoGqV.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 837881,
                "original_language": "en",
                "original_title": "She Said",
                "overview": "New York Times reporters Megan Twohey and Jodi Kantor break one of the most important stories in a generation — a story that helped launch the #MeToo movement and shattered decades of silence around the subject of sexual assault in Hollywood.",
                "popularity": 4.0153,
                "poster_path": "/jG4UI2dbNWlWtTTupjeU3fRJ5Fn.jpg",
                "release_date": "2022-11-17",
                "title": "She Said",
                "video": false,
                "vote_average": 7.224,
                "vote_count": 655,
                "character": "Vadim Rutman",
                "credit_id": "63974847d05a030085cbb749",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Thomas J. Pelphrey ",
            "Τομ Πέλφρεϊ",
            "톰 펠프레이",
            "湯姆·佩爾瑞",
            "تام پلفری"
        ],
        "biography": "Tom Pelphrey is an American actor. Tom was born and raised in New Jersey. He grew up in the town of Howell and attended the Fine and Performing Arts Center at Howell High school. He received a BFA in Acting from Mason Gross School of the Arts at Rutgers University where he also had the opportunity to study Shakespeare at the Globe Theatre in London, England.\n\nTom's first professional job was on the long running CBS daytime show, Guiding Light. In two and a half years on the show he was nominated for four consecutive Daytime Emmy Awards; he won twice. (2006, 2008) Since then he has worked in theater, television, and independent film. His first lead role in a film was playing the crystal meth addict David in Junction alongside Michael O'Keefe, David Zayas and Anthony Rapp. That led to lead roles in other features including the romantic comedy, Excuse Me for Living, where he worked with Jerry Stiller, Christopher Lloyd, Dick Cavett, and Robert Vaughn. He eventually became a series regular on the hit Cinemax show \"Banshee\" playing ex neo-nazi Kurt Bunker.\n\nTom is a founding member and the current Artistic Director of the Apothecary Theatre Company; a NYC based not-for-profit that develops and produces world premieres of new plays by up and coming playwrights. He made his Broadway debut in 2012 as Judy Garland's last husband, Mickey Deans, in the critically acclaimed \"End of the Rainbow\", directed by Tony Award winner Terry Johnson.",
        "birthday": "1982-07-28",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 207442,
        "imdb_id": "nm1670601",
        "known_for_department": "Acting",
        "name": "Tom Pelphrey",
        "place_of_birth": "Howell, New Jersey, USA",
        "popularity": 1.8363,
        "profile_path": "/eRmK7HvM5FK1Czx9oQspRERbf0o.jpg"
    }
}