{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/vAsFwNkxV0cHJWRJXkshg76rJRQ.jpg",
                "genre_ids": [
                    10751,
                    18
                ],
                "id": 43959,
                "original_language": "en",
                "original_title": "Soul Surfer",
                "overview": "The true story of teen surfer Bethany Hamilton, who lost her arm in a shark attack and courageously overcame all odds to become a champion again, through her sheer determination and unwavering faith.",
                "popularity": 3.4831,
                "poster_path": "/cvgRxrEupUFeJ0xzUExJo4dMXbL.jpg",
                "release_date": "2011-04-08",
                "title": "Soul Surfer",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 1196,
                "character": "Cydney Blanchard",
                "credit_id": "5f2ce8ed037264003883c21f",
                "order": 43
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Arlene Newman-Van Asperen"
        ],
        "biography": "Arlene Newman is an American actress and producer.\n\nShe has performed in many roles in both television and film including the hit television shows Lost, Marker, Fantasy Island and movies such as 10 Minutes, Poison Sky, Alice, and the faith based films Soul Surfer, My First Miracle and Romans Road. She has worked with a number of recognizable faces including academy award winning actor Lou Gossett Jr, Dennis Quaid, Quinton Aaron, Kevin Sorbo, Sean Patrick Flanery, Carrie Underwood, Jimmy Borges, Stephen Baldwin, Helen Hunt, Kent Faulcon, Glenn Plummer, Jeremy Sumpter, John Philbin, Emilie De Ravin, Branscombe Richmond, Kenny Lofton, Chris Carmack, Bethany Hamilton, Matt Rauch, Jason London, Craig T. Nelson and AnnaSophia Robb. She was very close to her mentor Mr. Radio \"Joe Franklin\" calling him her adopted grandfather.\n\nArlene grew up in New Hampshire, and spent some of her childhood in Alaska and Canada. As an adult, She has lived and worked in Italy and Japan. Her father is from Newfoundland Canada and her mother from New Hampshire. Growing up in a musical Scotch/Irish home, Arlene did her first TV appearance at the age of 5 on a show called \"The Uncle Guss Show\" filmed in New Hampshire. Her father is a bagpiper/minister and her mother a teacher. She started dance at a very young age and competed in many pageants, including winning the Miss Interline pageant and Mrs. Hawaii America pageant. Arlene found her passion for acting as a child. She started acting with a group of kids that would get together during the summer months. They would write plays, make costumes, then dance, sing and perform on a beach for all summer vacationers.\n\nShe would also spend a lot of time working with the children's ministry performing in the church. She started taking acting acting classes in grammar school and had the lead in several plays in high school. Her high school drama coach as well as her dance instructor encouraged her to continue acting after high school. She uses many of the personal experiences of working with foster children, prevent child abuse, and crisis pregnancy center to develop her characters. She works with several charities that are dear to her heart. She was the spokes person for \"Prevent Child Abuse in 2005. She works with Heart Gallery, St. Charles Home, Cards for Kids in Hospitals, and Aloha Pregnancy Center.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 2075883,
        "imdb_id": "nm3276886",
        "known_for_department": "Acting",
        "name": "Arlene Newman",
        "place_of_birth": null,
        "popularity": 0.1432,
        "profile_path": "/gY5HiCtmSYTSPLCyuA3KGBA1f1e.jpg"
    }
}