{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mZfkW31Y9a8DvISpO9nj5Tc7neo.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 4584,
                "original_language": "en",
                "original_title": "Sense and Sensibility",
                "overview": "The Dashwood sisters, sensible Elinor and passionate Marianne, whose chances at marriage seem doomed by their family's sudden loss of fortune.  When Henry Dashwood dies unexpectedly, his estate must pass on by law to his son from his first marriage, John and wife Fanny. But these circumstances leave Mr. Dashwood's current wife, and daughters Elinor, Marianne and Margaret, without a home and with barely enough money to live on. As Elinor and Marianne struggle to find romantic fulfillment in a society obsessed with financial and social status, they must learn to mix sense with sensibility in their dealings with both money and men.",
                "popularity": 5.1187,
                "poster_path": "/cBK2yL3HqhFvIVd7lLtazWlRZPR.jpg",
                "release_date": "1995-12-13",
                "title": "Sense and Sensibility",
                "video": false,
                "vote_average": 7.419,
                "vote_count": 1755,
                "character": "Lucy Steele",
                "credit_id": "52fe43cec3a36847f807104f",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Imogen Stubbs (born 20 February 1961) is an English actress and writer.\n\nHer first leading part was in Privileged (1982), followed by A Summer Story (1988). Her first play, We Happy Few, was produced in 2004. In 2008 she joined Reader's Digest as a contributing editor and writer of fiction.\n\nImogen Stubbs was born in Rothbury, Northumberland, lived briefly in Portsmouth, Hampshire, where her father was a naval officer, and then moved with her parents to London, where they lived on a vintage river barge on the Thames. She was educated at Cavendish Primary School, then at two independent schools: St Paul's Girls' School and Westminster School, and then Exeter College, Oxford, gaining a First Class degree.\n\nHer acting career started at Oxford, where she played Irina in a student production of Three Sisters at the Oxford Playhouse. After graduating, she enrolled at RADA, and while there had her first professional work, playing Sally Bowles in Cabaret at the Wolsey Theatre, Ipswich. In 1982 she also appeared in her first film, Privileged. Stubbs graduated from RADA in the same class as Jane Horrocks and Iain Glen, and later became an Associate Member of RADA.\n\nIn the 1980s Stubbs achieved success on stage with the Royal Shakespeare Company, notably as Desdemona in Othello, which was directed by Trevor Nunn. Other stage work includes Saint Joan at the Strand Theatre and Heartbreak House at the Haymarket, and in 1997 she played in a London production of A Streetcar Named Desire.\n\nIn 1988, Stubbs was a notable Ursula Brangwen in a BBC serialization of The Rainbow, and in 1993 and 1994 had the title role in Anna Lee. She played Lucy Steele in Sense and Sensibility (1995).\n\nIn July 2004, Stubbs's play We Happy Few, directed by Trevor Nunn and starring Juliet Stevenson and Marcia Warren, opened at the Gielgud Theatre, London, after a try-out in Malvern. In September 2008 Reader's Digest announced that she had joined the magazine as a contributing editor and writer of adventure stories.",
        "birthday": "1961-02-20",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 20769,
        "imdb_id": "nm0835916",
        "known_for_department": "Acting",
        "name": "Imogen Stubbs",
        "place_of_birth": "Newcastle Upon Tyne, England, UK",
        "popularity": 1.2691,
        "profile_path": "/gdhBQfUMZbEs1XH3qozHLXoYhzM.jpg"
    }
}