{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mDW6z7I6de6JbUgPOkAEZwKbg7G.jpg",
                "genre_ids": [
                    16,
                    10751,
                    10402,
                    14,
                    35
                ],
                "id": 901362,
                "original_language": "en",
                "original_title": "Trolls Band Together",
                "overview": "When Branch's brother, Floyd, is kidnapped for his musical talents by a pair of nefarious pop-star villains, Branch and Poppy embark on a harrowing and emotional journey to reunite the other brothers and rescue Floyd from a fate even worse than pop-culture obscurity.",
                "popularity": 8.5759,
                "poster_path": "/bkpPTZUdq31UGDovmszsg2CchiI.jpg",
                "release_date": "2023-10-12",
                "title": "Trolls Band Together",
                "video": false,
                "vote_average": 7.282,
                "vote_count": 932,
                "character": "Brandy (voice)",
                "credit_id": "653448998cfcc7012b3f8d4c",
                "order": 19
            },
            {
                "adult": false,
                "backdrop_path": "/rcUcYzGGicDvhDs58uM44tJKB9F.jpg",
                "genre_ids": [
                    16,
                    10751,
                    14,
                    28,
                    12
                ],
                "id": 527774,
                "original_language": "en",
                "original_title": "Raya and the Last Dragon",
                "overview": "Long ago, in the fantasy world of Kumandra, humans and dragons lived together in harmony. But when an evil force threatened the land, the dragons sacrificed themselves to save humanity. Now, 500 years later, that same evil has returned and it’s up to a lone warrior, Raya, to track down the legendary last dragon to restore the fractured land and its divided people.",
                "popularity": 9.844,
                "poster_path": "/5nVhgCzxKbK47OLIKxCR1syulOn.jpg",
                "release_date": "2021-03-03",
                "title": "Raya and the Last Dragon",
                "video": false,
                "vote_average": 7.824,
                "vote_count": 7032,
                "character": "Tail Chief (voice)",
                "credit_id": "6042e71a5b2f47005a22d936",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Patti Harrison (born October 31, 1990) is an American actress and comedian. She is best known for her roles in comedy series such as Shrill (2019–2021) and I Think You Should Leave with Tim Robinson (2019–present), as well as the comedy film Together Together (2021), with the latter earning her a nomination for the Independent Spirit Award for Best Female Lead.\n\nHarrison was born in Orient, Ohio, on October 31, 1990, the youngest of seven children of a Vietnamese mother and a White American father. Her father, a native of Detroit, was in the U.S. Army and met her mother during the Vietnam War when she was working as a janitor in his barracks. He died of a heart attack when Harrison was six years old. Her first involvement in comedy came from her participation in an improv team during her time at Ohio University, from which she did not graduate.\n\nHarrison moved to New York City to pursue a comedy career in 2015, but later moved to Los Angeles. She has said that her stand-up comedy style has changed drastically since her early days of performing, having initially felt anxious about making jokes about sex and her sexuality due to internalized transphobia stemming from being a trans woman. In an interview with Vogue, she described her comedic persona: \"I'm a nasty, stupid person—that's my voice. I'm an evil, shitty person on stage, in a very conscious way—the evil is punching up.\"\n\nIn 2017, Harrison gained wider prominence for her appearance on The Tonight Show Starring Jimmy Fallon, where she made jokes about then-President Donald Trump's ban on transgender people in the military. Since then, she has appeared in the television shows High Maintenance, I Think You Should Leave with Tim Robinson, Broad City, and Search Party, as well as the film A Simple Favor. In 2019, she began playing Ruthie in the Hulu comedy series Shrill after the show's co-creator and star Aidy Bryant contacted her through Instagram and encouraged her to audition. She later joined the team of writers for the animated comedy series Big Mouth during its fourth season.\n\nHarrison was named one of Variety magazine's \"10 Comics to Watch\" in 2019. Later that year, she co-hosted Comedy Central's digital series Unsend with Joel Kim Booster. She also co-hosts a podcast called A Woman's Smile with River L. Ramirez. In 2020, she co-starred in Yearly Departed, alongside other comedians such as Rachel Brosnahan and Ziwe Fumudoh. That same year, she began hosting a monthly show called Died & Gone to Heaven! at Largo in Los Angeles.\n\nIn February 2021, Harrison was banned from Twitter after a stunt in which she impersonated the account of Nilla Wafers in a parody of corporate pinkwashing, and in particular a tweet from the Oreo brand of cookies. The controversy led to her appearing on Jimmy Kimmel Live! to discuss it.  Later that year, she became the first transgender actor to take part in a Disney animated film when she voiced Tail Chief in Raya and the Last Dragon.\n\nShe also made her debut feature film leading role in Together Together, for which she earned a nomination for the Independent Spirit Award for Best Female Lead.",
        "birthday": "1990-10-31",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.unitedtalent.com/talent/comedy-touring/patti-harrison",
        "id": 2079729,
        "imdb_id": "nm8773928",
        "known_for_department": "Acting",
        "name": "Patti Harrison",
        "place_of_birth": "Orient, Ohio, USA",
        "popularity": 0.4411,
        "profile_path": "/n9h4QmVkRzdOVqKTQoQESIbDjuX.jpg"
    }
}