{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sAiTihJ8bjEqg8nYUIlTQUnVXuj.jpg",
                "genre_ids": [
                    37,
                    12
                ],
                "id": 2023,
                "original_language": "en",
                "original_title": "Hidalgo",
                "overview": "Set in 1890, this is the story of a Pony Express courier who travels to Arabia to compete with his horse, Hidalgo, in a dangerous race for a massive contest prize, in an adventure that sends the pair around the world...",
                "popularity": 4.6533,
                "poster_path": "/iGzENlBPYJEFWZnye4t3nqWSSp1.jpg",
                "release_date": "2004-02-04",
                "title": "Hidalgo",
                "video": false,
                "vote_average": 6.903,
                "vote_count": 1272,
                "character": "Sakr",
                "credit_id": "52fe432dc3a36847f804043b",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/y51M7Ca95sCXTCDvJaRP1uzxKbg.jpg",
                "genre_ids": [
                    10752,
                    28,
                    36
                ],
                "id": 652,
                "original_language": "en",
                "original_title": "Troy",
                "overview": "In year 1250 B.C. during the late Bronze age, two emerging nations begin to clash. Paris, the Trojan prince, convinces Helen, Queen of Sparta, to leave her husband Menelaus, and sail with him back to Troy. After Menelaus finds out that his wife was taken by the Trojans, he asks his brother Agamemnon to help him get her back. Agamemnon sees this as an opportunity for power. They set off with 1,000 ships holding 50,000 Greeks to Troy.",
                "popularity": 16.4153,
                "poster_path": "/a07wLy4ONfpsjnBqMwhlWTJTcm.jpg",
                "release_date": "2004-05-13",
                "title": "Troy",
                "video": false,
                "vote_average": 7.165,
                "vote_count": 10612,
                "character": "Agamemnon's Officer",
                "credit_id": "6097dc08b39e35003b19f6ae",
                "order": 35
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Adoni Maropakis"
        ],
        "biography": "Born and raised in Burgettstown, Pennsylvania, a small town near Pittsburgh. He is the middle son of Petro and Despina Maropis and is very close to his brothers, Sam and Chris.\n\nBeing an exceptional all-around athlete in high school (Burgettstown High-school in southwest Pennsylvania), it appeared Adoni would pursue a professional career in some sport. Turning down various athletic scholarships, he enrolled at West Virginia University and graduated magna cum laude with a Bachelor's Degree in Business Administration.\n\nBut, from years of being entertained by Adoni's impromptu comedic performances and impersonations which began when he was a small child, his father, Petro, told him that the suit and tie of the business world would probably choke him to death and encouraged Adoni to give acting a shot. Surprised, yet intrigued at this suggestion, Adoni enrolled at a performing arts school, Point Park College (now a University) in Pittsburgh, and studied acting, dialects, singing, and a bit of dance.\n\nHis first stage role was as a freshman, even though freshman weren't allowed to perform at the time, where they needed him as an \"Arabian Carrier\" in The Nutcracker Sweet. Not only did Adoni get to flex his muscles in that role, but he also played the \"Jack-in-the-Box\" in the same production. Some of his other memorable plays and musicals were: Working, Evita, Getting Out, You Can't Take it With You, and Little Shop of Horrors where he played the man-eating plant, \"Audrey II.\" After three years of theatre at Point Park, with the help of his younger brother Chris, he headed for Hollywood.\n\nAlthough Adoni is truly blessed with a more than usual dose of athletic ability and creative talent, what truly makes Adoni stand out is that he is a Type 1 Diabetic, and has been since he was 18 months old. His parents were told he would be weak and sickly, and in and out of hospitals his whole life. Ultimately, a renowned diabetic specialist told his father that most likely Adoni would be dead by the age of 25. As Adoni puts it, \"I get a kick out of someone saying I can't do it.\" This has been proven by his numerous athletic awards and championships throughout high-school and college which involved everything - strength, speed, quickness and finesse. The list includes: tennis, basketball, baseball, football, weightlifting, arm-wrestling, fitness, and his favorite pastime, which is table tennis (ping-pong). Adoni loves being creative with his workouts which involve only 30-45 minutes per day of either running, biking, aerobics, some martial arts, or what he calls his \"unique, unnatural, yet truly natural Cirque du Soleil/Tarzan workout\".\n\nSome of Adoni's diverse and memorable roles include: the flamboyant evil sorcerer, Quan Chi, in the TV show \"Mortal Kombat: Conquest\" (1998), the sarcastic undercover agent in The Gristle (2001), \"Abu-Fayed,\" in Season 6 of the Fox hit series \"24\" (2001) and the regal falcon-man in Hidalgo (2004), starring Viggo Mortensen. An inspiration to the world, Adoni will tell you that the most important ingredients to success and happiness are - love, laughter, and fitness! He credits his family and a few good friends with supplying all three.",
        "birthday": "1963-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.adoni-maropis.com/",
        "id": 20808,
        "imdb_id": "nm0549538",
        "known_for_department": "Acting",
        "name": "Adoni Maropis",
        "place_of_birth": "Pittsburgh, Pennsylvania, USA",
        "popularity": 0.2037,
        "profile_path": "/eMT9AihEqmnJdAqIqWvsWm590mn.jpg"
    }
}