{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sAiTihJ8bjEqg8nYUIlTQUnVXuj.jpg",
                "genre_ids": [
                    37,
                    12
                ],
                "id": 2023,
                "original_language": "en",
                "original_title": "Hidalgo",
                "overview": "Set in 1890, this is the story of a Pony Express courier who travels to Arabia to compete with his horse, Hidalgo, in a dangerous race for a massive contest prize, in an adventure that sends the pair around the world...",
                "popularity": 5.2524,
                "poster_path": "/iGzENlBPYJEFWZnye4t3nqWSSp1.jpg",
                "release_date": "2004-02-04",
                "title": "Hidalgo",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 1271,
                "character": "Aziz",
                "credit_id": "52fe432dc3a36847f8040423",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/n7p6UTAZtkeoHkwCO42BEQaMFJY.jpg",
                "genre_ids": [
                    18,
                    878,
                    12
                ],
                "id": 644,
                "original_language": "en",
                "original_title": "A.I. Artificial Intelligence",
                "overview": "David, a robotic boy—the first of his kind programmed to love—is adopted as a test case by a Cybertronics employee and his wife. Though he gradually becomes their child, a series of unexpected circumstances make this life impossible for David.",
                "popularity": 8.2869,
                "poster_path": "/8MZSGX5JORoO72EfuAEcejH5yHn.jpg",
                "release_date": "2001-06-29",
                "title": "A.I. Artificial Intelligence",
                "video": false,
                "vote_average": 7.047,
                "vote_count": 6385,
                "character": "Crowd Member",
                "credit_id": "5c23b021c3a368700eeff345",
                "order": 38
            },
            {
                "adult": false,
                "backdrop_path": "/xwjVHxKKk2hb6CJX46U4Cv0Zq0a.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 10778,
                "original_language": "en",
                "original_title": "The Man Who Wasn't There",
                "overview": "A tale of murder, crime and punishment set in the summer of 1949. Ed Crane, a barber in a small California town, is dissatisfied with his life, but his wife Doris' infidelity and a mysterious opportunity presents him with a chance to change it.",
                "popularity": 3.1407,
                "poster_path": "/lrCgt8NNMyFsfmXyXiSSCRXNH4u.jpg",
                "release_date": "2001-10-26",
                "title": "The Man Who Wasn't There",
                "video": false,
                "vote_average": 7.527,
                "vote_count": 1653,
                "character": "Jacques Carcanogues",
                "credit_id": "5e62b8aa8e2ba60016df1cbb",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Adam Alexi-Malle, born in Siena, Italy, comes from a diverse background—his father hails from Italy (Sardinia) while his mother is Palestinian-Spanish. Their family journey took them from London, England, to eventually settling in the United States. Starting as a musician from a young age, training extensively in piano and violin across prestigious institutions worldwide, he initially aimed for a career as a concert musician before transitioning to acting after studying at the Royal Academy of Dramatic Arts in London. His acting career encompasses a broad spectrum, featuring in films like \"Bowfinger,\" \"Hidalgo,\" and \"Failure To Launch,\" television appearances on shows such as \"The Sopranos,\" \"Alias,\" and \"24,\" and acclaimed stage performances in productions like \"Titanic\" and \"The Threepenny Opera\" on Broadway. Fluent in several languages, he's also ventured into voice acting for various platforms, including video games like \"Diablo 3\" and \"Assassin's Creed: Revelations,\" and as a staff narrator for Penguin Random House Audio. Beyond acting, he's the CEO of the multimedia production company JP²A²M:worldwide Entertainment Group, overseeing subsidiaries Siena Films, virtuosoTV, and the theatre company, Blistering Muses.",
        "birthday": "1964-09-24",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 20804,
        "imdb_id": "nm0018956",
        "known_for_department": "Acting",
        "name": "Adam Alexi-Malle",
        "place_of_birth": "Siena, Italy",
        "popularity": 0.1182,
        "profile_path": "/vA72gPPSNk51uo5u18Z2iJpM9Fw.jpg"
    }
}