{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rl95VDEP3nsUQmGzE0S1S7y6T0N.jpg",
                "genre_ids": [
                    10752,
                    28
                ],
                "id": 190859,
                "original_language": "en",
                "original_title": "American Sniper",
                "overview": "U.S. Navy SEAL Chris Kyle takes his sole mission—protect his comrades—to heart and becomes one of the most lethal snipers in American history. His pinpoint accuracy not only saves countless lives but also makes him a prime target of insurgents. Despite grave danger and his struggle to be a good husband and father to his family back in the States, Kyle serves four tours of duty in Iraq. However, when he finally returns home, he finds that he cannot leave the war behind.",
                "popularity": 8.8358,
                "poster_path": "/i1U46OwMc6vlm7OoSUKfqUH615e.jpg",
                "release_date": "2014-12-25",
                "title": "American Sniper",
                "video": false,
                "vote_average": 7.418,
                "vote_count": 13265,
                "character": "Dapper Navy Man",
                "credit_id": "547dc599c3a3685af3004a79",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Brando Matthew Eaton",
            "براندو ایتون"
        ],
        "biography": "Brando Eaton is an American actor known for his work in film and television. He was born on July 17, 1986, in Los Angeles, California. Eaton began his acting career at a young age and has since appeared in various notable projects.\n\nEaton's first significant role came in 2002 when he portrayed the character of Griffin Lowe in the film \"The Powder Puff Principle.\" He gained further recognition for his role as Drummer Hoffenbacker in the comedy film \"Alvin and the Chipmunks: The Squeakquel\" in 2009. His portrayal of the mischievous drummer added a comedic element to the popular family franchise.\n\nIn addition to his film work, Brando Eaton has made appearances on numerous television shows. He has had guest roles on series such as \"CSI: Miami,\" \"The Mentalist,\" and \"Dexter.\" He also appeared in the medical drama series \"Chicago Med\" as the recurring character of Bertram \"Bernie\" Caffrey.\n\nOne of Eaton's notable roles was on the TV series \"Dexter,\" where he played the character Jonah Mitchell, the troubled son of a murderer, in the show's fourth season. His performance garnered praise for its complexity and emotional depth.\n\nEaton has also taken part in independent film projects, showcasing his range as an actor. Some of his independent film credits include \"Bloomington\" and \"Balls Out: Gary the Tennis Coach.\"\n\nAside from acting, Brando Eaton is involved in other creative pursuits. He is a musician and singer-songwriter, displaying his musical talents outside of his acting career.",
        "birthday": "1986-07-17",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 208406,
        "imdb_id": "nm2343444",
        "known_for_department": "Acting",
        "name": "Brando Eaton",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.5528,
        "profile_path": "/dl6ZBzrd5CCgFOLBajResN1MeB8.jpg"
    }
}