{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dENLz9Np9EV5Ro8UIBhbKC8BmSS.jpg",
                "genre_ids": [
                    53,
                    28,
                    18,
                    878
                ],
                "id": 61791,
                "original_language": "en",
                "original_title": "Rise of the Planet of the Apes",
                "overview": "A highly intelligent chimpanzee named Caesar has been living a peaceful suburban life ever since he was born. But when he gets taken to a cruel primate facility, Caesar decides to revolt against those who have harmed him.",
                "popularity": 8.3976,
                "poster_path": "/cjLsuP75UDlRdJVMXzXg3TJ4umX.jpg",
                "release_date": "2011-08-03",
                "title": "Rise of the Planet of the Apes",
                "video": false,
                "vote_average": 7.337,
                "vote_count": 12321,
                "character": "Party Girl #2",
                "credit_id": "530ed2a9c3a368445f0001e4",
                "order": 27
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "تریسی اسپایریداکوس"
        ],
        "biography": "Tracy Spiridakos is a Canadian actress, best known for starring as Detective Hailey Upton in the hit Dick Wolf series \"Chicago P.D.\" for more than 7 seasons.\n\nSpiridakos was born in Winnipeg, Manitoba, to Greek-born parents. The family moved to the Greek town Skala, near Sparta, when she was four, and returned to Canada when she was nine. She strongly identifies with her Greek heritage and speaks fluent Greek. She graduated from Oak Park High School in Winnipeg in the year 2000.\n\nSpiridakos moved to Vancouver in 2007 to pursue acting, and within weeks landed her first television role, a small part on \"Supernatural\". She continued working in television, and in 2009, won her first starring role in \"Majority Rules!\". She made her feature film debut in 2011 with \"Rise of the Planet of the Apes\", and filmed the low-budget thriller, \"Kill For Me\", with Donal Logue and Katie Cassidy.\n\nFrom 2012-2014, Spiridakos starred as Charlotte \"Charlie\" Matheson on the NBC post-apocalyptic science fiction series \"Revolution\". She then guest starred on the critically acclaimed hit series \"Bates Motel\" before joining the cast of \"Chicago P.D\" at the end of its fourth season.",
        "birthday": "1988-02-20",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 208678,
        "imdb_id": "nm2702898",
        "known_for_department": "Acting",
        "name": "Tracy Spiridakos",
        "place_of_birth": "Winnipeg, Manitoba, Canada",
        "popularity": 0.7644,
        "profile_path": "/2OOEob2qdh8Mhvt5vV1RdLyZD4L.jpg"
    }
}