{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jw4SNkaSgbrO7VJPsZUZqbBg1Ph.jpg",
                "genre_ids": [
                    12,
                    18
                ],
                "id": 618588,
                "original_language": "en",
                "original_title": "Arthur the King",
                "overview": "Over the course of ten days and 435 miles, an unbreakable bond is forged between pro adventure racer Michael Light and a scrappy street dog companion dubbed Arthur. As the team is pushed to their outer limits of endurance in the race, Arthur redefines what victory, loyalty and friendship truly mean.",
                "popularity": 6.9676,
                "poster_path": "/zkKB3kOun5DKAkm61pHvLbrjxfa.jpg",
                "release_date": "2024-02-22",
                "title": "Arthur the King",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 837,
                "character": "Bear Grylls",
                "credit_id": "655606baea84c71093010c2b",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "贝尔 格里尔斯",
            "เอ็ดเวิร์ด ไมเคิล กริลส์ ",
            "Edward Michael Grylls",
            "Edward Michael \"Bear\" Grylls"
        ],
        "biography": "Edward Michael \"Bear\" Grylls (born 7 June 1974) is a British adventurer, writer and television presenter. He is widely known for his television series Man vs. Wild (2006–2011), originally titled Born Survivor: Bear Grylls  in the United Kingdom.\n\nGrylls is also involved in a number of  wilderness survival television series in the UK and US. In July 2009,  Grylls was appointed the youngest-ever Chief Scout in the UK at age 35.\n\nGrylls was born in Donaghadee, County Down, Northern Ireland.He grew up in Donaghadee until the age of four, when his family moved to Bembridge on the Isle of Wight.\n\nHe is the son of Conservative politician Sir Michael Grylls, who was implicated in the cash-for-questions affair, and Lady Sarah Grylls. Lady Grylls is the daughter of politician Patricia Ford, briefly an Ulster Unionist Party MP, and cricketer and businessman Neville Ford.  Grylls has one sibling, an elder sister, Lara Fawcett, a cardio-tennis  coach, who gave him the nickname 'Bear' when he was a week old.\n\nGrylls was educated at Ludgrove School and Eton College, where he helped start its first mountaineering club, and Birkbeck, University of London, where he graduated with a degree, obtained part-time, in Hispanic studies in 2002. He graduated from the University of West of England.\n\nFrom an early age, he learned to climb and sail with his father, who was a member of the prestigious Royal Yacht Squadron. As a teenager, he learned to skydive and earned a second dan black belt in Shotokan karate. At age eight he became a Cub Scout. He speaks English, Spanish, and French. He is a Christian, and has described his faith as the \"backbone\" in his life.\n\nGrylls married Shara Cannings Knight in 2000. They have three sons. In August 2015, it was reported that Grylls had deserted his young son, Jesse, on Saint Tudwal's Island along the North Wales coast, as the tide approached, leaving him to be rescued by the RNLI. The RNLI later criticised him for the stunt, saying its crew \"had not appreciated\" that a child would be involved.",
        "birthday": "1974-06-07",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 208629,
        "imdb_id": "nm2426012",
        "known_for_department": "Acting",
        "name": "Bear Grylls",
        "place_of_birth": "Donaghadee, County Down, Northern Ireland, UK",
        "popularity": 0.4613,
        "profile_path": "/vAjjR7b5lnip01W0OIjvaPynNON.jpg"
    }
}