{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xlIxMddSdqyxfY02CilOK4VKWR8.jpg",
                "genre_ids": [
                    10402,
                    18,
                    36
                ],
                "id": 14410,
                "original_language": "en",
                "original_title": "Notorious",
                "overview": "\"Notorious\" is the story of Christopher Wallace. Through raw talent and sheer determination, Wallace transforms himself from Brooklyn street hustler (once selling crack to pregnant women) to one of the greatest rappers of all time: The Notorious B.I.G. Follow his meteoric rise to fame and his refusal to succumb to expectations - redefining our notion of \"The American Dream.\"",
                "popularity": 2.5081,
                "poster_path": "/62NsZPgueSiE8y7dqtU3FSLFwYw.jpg",
                "release_date": "2009-01-16",
                "title": "Notorious",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 748,
                "character": "Suge Knight",
                "credit_id": "6166274e62fcd3008a0d974b",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/eGljNfNCrPhFYG2RXXmmE0OKu5.jpg",
                "genre_ids": [
                    18,
                    53,
                    80
                ],
                "id": 473033,
                "original_language": "en",
                "original_title": "Uncut Gems",
                "overview": "A charismatic New York City jeweler always on the lookout for the next big score makes a series of high-stakes bets that could lead to the windfall of a lifetime. Howard must perform a precarious high-wire act, balancing business, family, and encroaching adversaries on all sides in his relentless pursuit of the ultimate win.",
                "popularity": 5.189,
                "poster_path": "/sg0xxJeb3u1C4kAxhSuTwTNpEDt.jpg",
                "release_date": "2019-08-30",
                "title": "Uncut Gems",
                "video": false,
                "vote_average": 7.16,
                "vote_count": 5028,
                "character": "KG Bodyguard 1",
                "credit_id": "63383458944a57008425c2fc",
                "order": 25
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Sean Ringgold was born on November 3, 1977 and raised in Rockaway Beach, Queens, New York. Before becoming an actor, he spent many years working as a Body Guard for BET's 106 and Park. He is best known for playing Shaun Evans on the popular ABC Soap Opera, One Life to Live. His current projects include Orange Is The New Black, Billions, Shades of Blue, The Breaks, and Marvel's Luke Cage.\n\nIn 2009, staring as Marion \"Suge\" Knight, he made his big screen debut in the Notorious B.I.G. Biopic, Notorious. He has also starred in such films as American Gangster, The Smurfs and Before I Disappear. Sean can be seen in several upcoming projects, including No More Mr. Nice Guy, Wetlands and Roxanne Roxanne.\n\nHis television credits include Damages, Gotham, Gossip Girl, and Ugly Betty. Sean was featured in episodes of Law & Order: Special Victims Unit, and Criminal Intent. He has also had roles on the popular shows 30 Rock, Are We There Yet?, Taxi Brooklyn, The Carrie Diaries, NYC 22, Blue Bloods, and 106 & Park.\n\nAlongside his work in television and movies, Sean has also appeared in numerous national advertising campaigns and commercials for brands including Budweiser, Burger King, Dr. Scholl's, Dunkin Donuts, Delta Airlines, Kia, Fiat 500 by Gucci, Nexium, Nike, Tampax, Time Warner Cable and Spike TV.",
        "birthday": "1977-11-03",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.seanringgold.com/",
        "id": 208709,
        "imdb_id": "nm2548468",
        "known_for_department": "Acting",
        "name": "Sean Ringgold",
        "place_of_birth": "Rockaway Beach, Queens, New York City, New York, USA",
        "popularity": 0.085,
        "profile_path": "/amErsgNKPMz7ngUYLPRXnvAZgYC.jpg"
    }
}