{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ljTYcQ3pkzYF52Z8ev1Z1UThnPy.jpg",
                "genre_ids": [
                    35,
                    10749,
                    18
                ],
                "id": 519035,
                "original_language": "en",
                "original_title": "Nappily Ever After",
                "overview": "After an accident at the hair salon, Violet realizes she's not living life to the fullest. A soulful barber helps her put the pieces back together.",
                "popularity": 2.1946,
                "poster_path": "/lxXsGqxUwSxypffv8hn3r332jf4.jpg",
                "release_date": "2018-09-21",
                "title": "Nappily Ever After",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 812,
                "character": "",
                "credit_id": "5b52c7a80e0a26231c009598",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Kamille Leai",
            "Brittany Hall"
        ],
        "biography": "Brittany S. Hall was born on September 30th in Washington D.C. and raised in the D.C./MD area where she discovered her love for the performing arts. At an early age she began performing in school plays, community plays, and dance recitals. As a member of her high schools theatre group, Brittany wrote her first play which she performed with the group in front of the entire school during the Annual Holiday Rally. Brittany continued studying theatre in college where she studied as a Theatre Major at Frostburg State University.\n\nIn 2009, Brittany was cast in VH1's hit reality Show \"Real Chance of Love 2,\" where she was given the nickname \"Hot Wings.\"  She instantly became a favorite of producers and viewers and went on to be one of the winners of the show. In 2011, while living in New York City, Brittany found another stage in Stand Up Comedy. She performed at one of NYC's most popluar comedy clubs Laugh Lounge. After moving to Atlanta in 2013, Brittany found herself in front of the camera yet again, working under the stage name  \"Kamille Leai,\" she appeared as a lead in a number of music videos with artist such as Migos, Trevor Jackson, Luke James, Tank, and The Dream.  ​\n\nBrittany returned to her passion of acting in 2014 after studying at Atlanta's Premiere Actors Network. She appeared on series such as ABC's \"Ravenswood\", BET's \"Being Mary Jane\" and a supporting role in VH1's Drumline 2.  In 2015, she was cast for the recurring role of \"Rosalie\" on the USA series \"Satisfaction\". Her character returned for the second season as a series regular. It is also in 2015 when Brittany decided to stop working under her stage name.  In 2017, Brittany joined Season 3 of HBO's Ballers as Amber. She was upped to series regular for Season 4, which is now in production. She also appears alongside Sanaa Lathan in Netflix's original comedy \"Nappily Ever After.\" In 2018 Brittany founded ACTORS PLAY LA, a community organization and training facility for actors located in Hollywood, California.  Brittany resides in Los Angeles, Califorina where she continues her career in Film and Television and coaches new and experienced actors. She is Represented by APA, Stokes Management, and AWA.",
        "birthday": "1987-09-30",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.iambrittanyhall.com/",
        "id": 2088477,
        "imdb_id": "nm3593414",
        "known_for_department": "Acting",
        "name": "Brittany S. Hall",
        "place_of_birth": "Washington, District of Columbia, USA",
        "popularity": 0.1404,
        "profile_path": "/sIic0JYph8yUZndRZj5hwvvdCQY.jpg"
    }
}