{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kF5AeKG5XIZkAXY0kRgm57qEbJI.jpg",
                "genre_ids": [
                    18,
                    9648,
                    10749
                ],
                "id": 5165,
                "original_language": "it",
                "original_title": "L'avventura",
                "overview": "Claudia and Anna join Anna's lover, Sandro, on a boat trip to a remote volcanic island. When Anna goes missing, a search is launched. In the meantime, Sandro and Claudia become involved in a romance despite Anna's disappearance, though the relationship suffers from guilt and tension.",
                "popularity": 1.1303,
                "poster_path": "/7kUXAS8K7Ihw1T1mhARjnLuMVk3.jpg",
                "release_date": "1960-09-14",
                "title": "L'Avventura",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 720,
                "character": "Anna",
                "credit_id": "52fe43f8c3a36847f807b201",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Léa Massari",
            "Anna Maria Massatani",
            "Леа Массари"
        ],
        "biography": "Anna Maria Massetani better known as Lea Massari (30 June 1933 — 23 June 2025) was an Italian actress. When she was 22, she changed her name to Lea Massari after the death of her fiancé Leo. She studied architecture in Switzerland. Massari became a celebrity in art cinema for two roles, the missing girl Anna in Michelangelo Antonioni's L'avventura (1960), and as Clara, the mother of a sexually precocious 14-year-old boy named Laurent (Benoît Ferreux) in Louis Malle's Murmur of the Heart (1971). She worked in both Italian and French Cinema. Her career includes Sergio Leone's debut Il Colosso di Rodi, and international commercial films such as Les choses de la vie. She was a member of the jury at the Cannes Film Festival in 1975. She won Nastro d'Argento as Best Supporting Actress for her role in Francesco Rosi's Christ Stopped at Eboli.",
        "birthday": "1933-06-30",
        "deathday": "2025-06-23",
        "gender": 1,
        "homepage": null,
        "id": 20882,
        "imdb_id": "nm0557159",
        "known_for_department": "Acting",
        "name": "Lea Massari",
        "place_of_birth": "Roma, Lazio, Italy",
        "popularity": 1.3408,
        "profile_path": "/8H3v68W09PB469Rdlgnu4bprhbY.jpg"
    }
}