{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tnwMCH4yLBY4qpe6Nr4n66u4U3f.jpg",
                "genre_ids": [
                    28,
                    80,
                    53
                ],
                "id": 400535,
                "original_language": "en",
                "original_title": "Sicario: Day of the Soldado",
                "overview": "Agent Matt Graver teams up with operative Alejandro Gillick to prevent Mexican drug cartels from smuggling terrorists across the United States border.",
                "popularity": 9.2871,
                "poster_path": "/qcLYofEhNh51Sk1jUWjmKHLzkqw.jpg",
                "release_date": "2018-06-27",
                "title": "Sicario: Day of the Soldado",
                "video": false,
                "vote_average": 6.938,
                "vote_count": 3817,
                "character": "Rocking Man",
                "credit_id": "5b555bb3c3a3685c8e0100b9",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Nick's inspiration to perform was ignited in the 4th grade when his physical education teacher (Rudy Benton) discovered his ability to transform in and out of the personas of faculty members through comedic voice impressions. Rudy urged the school principal to throw together an impromptu assembly, and within a few hours, Nick found himself on stage, ready to share his hidden talent publicly for the first time.\n\nNick portrays Zebedee on the MovieGuide Award-winning series, The Chosen. He has also starred in the Oscar-qualifying film Madaran (Mothers), recurred on NBC's State of Affairs as Aleek Al Moosari, as a fan favorite, and voiced Grumpy Bear and Tenderheart Bear for the animated series Care Bears: Unlock The Magic. Nick is also the voice of Artichoke and Auntie Uncle on Netflix's Emmy-nominated animated series Buddy Thunderstruck. He has voiced a plethora of interactive games, including Dying Light as the voice of Savvy and Bilal and Skylanders as the voice of Fling Kong.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2090181,
        "imdb_id": "nm1753818",
        "known_for_department": "Acting",
        "name": "Nick Shakoour",
        "place_of_birth": null,
        "popularity": 0.6768,
        "profile_path": "/tSXc5io0r94bOmyCtomy3ZHDhZF.jpg"
    }
}