{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qNYL8EAUPvTaiW1hVavX1vIWVcl.jpg",
                "genre_ids": [
                    35,
                    80,
                    18
                ],
                "id": 489930,
                "original_language": "en",
                "original_title": "Blindspotting",
                "overview": "Collin must make it through his final three days of probation for a chance at a new beginning. He and his troublemaking childhood best friend, Miles, work as movers, and when Collin witnesses a police shooting, the two men’s friendship is tested as they grapple with identity and their changed realities in the rapidly-gentrifying neighborhood they grew up in.",
                "popularity": 4.047,
                "poster_path": "/x4DRZfTqOlmzNWAvy4vcKWkgEGL.jpg",
                "release_date": "2018-07-20",
                "title": "Blindspotting",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 693,
                "character": "Nancy",
                "credit_id": "5b555cc4c3a3685c8e010235",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/rQaHA74pevnGsxcKGaoZVGWe9TC.jpg",
                "genre_ids": [
                    16,
                    10751,
                    35,
                    14,
                    18
                ],
                "id": 508442,
                "original_language": "en",
                "original_title": "Soul",
                "overview": "Joe Gardner is a middle school teacher with a love for jazz music. After a successful audition at the Half Note Club, he suddenly gets into an accident that separates his soul from his body and is transported to the You Seminar, a center in which souls develop and gain passions before being transported to a newborn child. Joe must enlist help from the other souls-in-training, like 22, a soul who has spent eons in the You Seminar, in order to get back to Earth.",
                "popularity": 10.8093,
                "poster_path": "/pEz5aROvfy5FBW1OTlrDO3VryWO.jpg",
                "release_date": "2020-12-25",
                "title": "Soul",
                "video": false,
                "vote_average": 8.104,
                "vote_count": 10932,
                "character": "Melba (voice)",
                "credit_id": "5fe6033c31644b0040fb2cf4",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Margo Hall is an award winning actor, director, activist, educator, and newly appointed Artistic Director of the Lorraine Hansberry Theatre. She has graced Bay Area stages for 30 years as a performer and director. She recently appeared in the hit film BLINDSPOTTING with our own Oakland native Daveed Diggs and All Day and a Night on Netflix. She was last seen onstage in Exit Strategy at The Aurora Theater.\n\nShe recently directed How I Learned What I Learned at Marin Theatre Company, BARBECUE (which she also starred in) and Red Velvet for SF Playhouse and Brownsville, b-side for tray for Shotgun Players. Other acting credits include: Marin Theater Company- JAZZ, Skeleton Crew, Gem of the Ocean, Fences and Seven Guitars. California Shakespeare Theater- God Person of Szechwan, Black Odyssey, Fences, Twelfth Night, A Midsummer Night’s Dream, A Raisin in the Sun, A Winter’s Tale, American Night: the Ballad of Juan Jose and SPUNK. American Conservatory Theater- Ah, Wilderness!, Once in a Lifetime and Marcus; or the Secret of Sweet. Aurora Theater- Trouble in Mind. Shotgun Players- A World in a Woman’s Hands, and Word for Word-All Aunt Hagar’s Children and The Blues I’m Playing.\n\nHer writing credits include The People’s Temple at Berkeley Repertory Theater, which won the Glickman award for best new play in the Bay Area for 2005, and, Be Bop Baby, a Musical Memoir, a semi-autobiographical piece at Z Space, featuring the Marcus Shelby 15 piece Orchestra. She is a founding member of Campo Santo, a long standing multicultural San Francisco based theater company and has directed, performed and collaborated on several new plays with artists such as Naomi Iizuka, Phillip Kan Gotanda, Sean San Jose, Octavio Solis Luis Saguar, and Jessica Hagedorn. She is also a professor at UC Berkeley and Chabot College in the Theater Department.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.margohall.com/",
        "id": 2090203,
        "imdb_id": "nm0355863",
        "known_for_department": "Acting",
        "name": "Margo Hall",
        "place_of_birth": null,
        "popularity": 0.0256,
        "profile_path": "/jMTir1RryWo3oZhtRjxlKDWGR0K.jpg"
    }
}