{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sgsW7aqUXg4jG2GcoLKotSvp807.jpg",
                "genre_ids": [
                    18
                ],
                "id": 24226,
                "original_language": "en",
                "original_title": "The Verdict",
                "overview": "Frank Galvin is a down-on-his-luck lawyer and reduced to drinking and ambulance chasing, when a former associate reminds him of his obligations in a medical malpractice suit by serving it to Galvin on a silver platter—all parties are willing to settle out of court. Blundering his way through the preliminaries, Galvin suddenly realizes that the case should actually go to court—to punish the guilty, to get a decent settlement for his clients... and to restore his standing as a lawyer.",
                "popularity": 4.6861,
                "poster_path": "/m3DdNJZfBcsTiFe0SwsLChWavrG.jpg",
                "release_date": "1982-12-08",
                "title": "The Verdict",
                "video": false,
                "vote_average": 7.446,
                "vote_count": 674,
                "character": "Joseph Alito",
                "credit_id": "52fe448bc3a368484e028c75",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/jynfI114q3kOAbIiVjVfFFmttU2.jpg",
                "genre_ids": [
                    80,
                    18,
                    28
                ],
                "id": 101,
                "original_language": "fr",
                "original_title": "Léon",
                "overview": "Léon, the top hit man in New York, has earned a rep as an effective \"cleaner\". But when his next-door neighbors are wiped out by a loose-cannon DEA agent, he becomes the unwilling custodian of 12-year-old Mathilda. Before long, Mathilda's thoughts turn to revenge, and she considers following in Léon's footsteps.",
                "popularity": 11.642,
                "poster_path": "/bxB2q91nKYp8JNzqE7t7TWBVupB.jpg",
                "release_date": "1994-09-14",
                "title": "Léon: The Professional",
                "video": false,
                "vote_average": 8.301,
                "vote_count": 15445,
                "character": "1st Policeman",
                "credit_id": "57e6e871925141413f00cfa2",
                "order": 26
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Kent Broadhurst (born February 4, 1940) is an American actor, playwright, screenwriter and painter.\n\nHe has appeared in a number of off-Broadway and regional theater productions. Broadhurst has also acted in films, including The Verdict, Silkwood, and Silver Bullet, and in television productions including Babylon 5, Law & Order, War and Remembrance, and Kane and Abel.\n\nHis credits as a playwright include They're Coming To Make It Brighter, Lemons, The Eye of the Beholder, and The Habitual Acceptance of the Near Enough, all first produced at the Humana Festival at the Actors Theatre of Louisville. He wrote the screenplay for the 2001 television film Wild Iris.\n\nBroadhurst was born in St. Louis, Missouri. He graduated from the University of Nebraska in 1962, and now lives in New York.\n\nSource: Article \"Kent Broadhurst\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1940-02-04",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 20914,
        "imdb_id": "nm0110398",
        "known_for_department": "Acting",
        "name": "Kent Broadhurst",
        "place_of_birth": "St. Louis, Missouri, USA",
        "popularity": 0.1859,
        "profile_path": "/jcR9n3N6bCmsQbbpgFf1D3hmDdY.jpg"
    }
}