{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/t1ptcIJiPzxR4cM9q7i0RFizFd8.jpg",
                "genre_ids": [
                    12,
                    878,
                    10751
                ],
                "id": 173,
                "original_language": "en",
                "original_title": "20,000 Leagues Under the Sea",
                "overview": "A ship sent to investigate a wave of mysterious sinkings encounters the advanced submarine, the Nautilus, commanded by Captain Nemo.",
                "popularity": 3.4627,
                "poster_path": "/heAEH85fdxEgV98LizHbQCL95iZ.jpg",
                "release_date": "1954-12-23",
                "title": "20,000 Leagues Under the Sea",
                "video": false,
                "vote_average": 7.046,
                "vote_count": 929,
                "character": "Captain Nemo",
                "credit_id": "52fe4222c3a36847f8006a0f",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/fONtQBk12LGjQo4q6bXDROVQmTy.jpg",
                "genre_ids": [
                    53,
                    12
                ],
                "id": 213,
                "original_language": "en",
                "original_title": "North by Northwest",
                "overview": "Advertising man Roger Thornhill is mistaken for a spy, triggering a deadly cross-country chase.",
                "popularity": 3.6101,
                "poster_path": "/kNOFPQrel9YFCVzI0DF8FnCEpCw.jpg",
                "release_date": "1959-08-06",
                "title": "North by Northwest",
                "video": false,
                "vote_average": 7.982,
                "vote_count": 4292,
                "character": "Phillip Vandamm",
                "credit_id": "52fe4227c3a36847f80081d3",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/xGiqZw1AJJ6BZRNUT1XVBMBofnr.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 802,
                "original_language": "en",
                "original_title": "Lolita",
                "overview": "Humbert Humbert is a middle-aged British novelist who is both appalled by and attracted to the vulgarity of American culture. When he comes to stay at the boarding house run by Charlotte Haze, he soon becomes obsessed with Lolita, the woman's teenaged daughter.",
                "popularity": 5.01,
                "poster_path": "/8Puqbeh0D95DpXFWep1rmH78btu.jpg",
                "release_date": "1962-06-13",
                "title": "Lolita",
                "video": false,
                "vote_average": 7.316,
                "vote_count": 2152,
                "character": "Prof. Humbert Humbert",
                "credit_id": "52fe4278c3a36847f80213fb",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/sgsW7aqUXg4jG2GcoLKotSvp807.jpg",
                "genre_ids": [
                    18
                ],
                "id": 24226,
                "original_language": "en",
                "original_title": "The Verdict",
                "overview": "Frank Galvin is a down-on-his-luck lawyer and reduced to drinking and ambulance chasing, when a former associate reminds him of his obligations in a medical malpractice suit by serving it to Galvin on a silver platter—all parties are willing to settle out of court. Blundering his way through the preliminaries, Galvin suddenly realizes that the case should actually go to court—to punish the guilty, to get a decent settlement for his clients... and to restore his standing as a lawyer.",
                "popularity": 4.6861,
                "poster_path": "/m3DdNJZfBcsTiFe0SwsLChWavrG.jpg",
                "release_date": "1982-12-08",
                "title": "The Verdict",
                "video": false,
                "vote_average": 7.446,
                "vote_count": 674,
                "character": "Ed Concannon",
                "credit_id": "52fe448bc3a368484e028c17",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Джеймс Мейсон",
            "James Neville Mason",
            "Джеймс Невилл Мэйсон",
            "Джеймс Мэйсон",
            "جیمز میسون"
        ],
        "biography": "James Neville Mason, known as James Mason, was an accomplished English actor who made a significant impact on both British and American cinema. He was born on May 15, 1909, in Huddersfield, Yorkshire, England, and passed away on July 27, 1984, in Lausanne, Switzerland.\n\nMason's acting career began in the 1930s, where he initially gained recognition for his stage performances in London's West End. He made his film debut in 1935 with the British film \"Late Extra,\" marking the start of his illustrious on-screen journey.\n\nThroughout his career, Mason showcased his exceptional acting abilities, often portraying complex and morally ambiguous characters. His commanding presence, distinctive voice, and versatile range allowed him to effortlessly transition between genres, from dramas to thrillers and even period pieces.\n\nOne of Mason's most acclaimed performances came in 1945 when he starred as the troubled and enigmatic Johnny McQueen in the film \"Odd Man Out.\" His portrayal of the wounded Irish nationalist earned him widespread praise and established him as a respected leading man.\n\nMason's notable filmography includes memorable roles in films such as \"The Wicked Lady\" (1945), \"Pandora and the Flying Dutchman\" (1951), \"A Star Is Born\" (1954), \"North by Northwest\" (1959), and \"Lolita\" (1962). His ability to bring depth, sophistication, and complexity to his characters captivated audiences and garnered critical acclaim.\n\nBeyond his film career, Mason also dabbled in producing and directing. He co-produced and starred in the acclaimed film \"A Star Is Born,\" showcasing his multifaceted talent and creative vision.\n\nThroughout his life, Mason was recognized with numerous awards and nominations, including three Academy Award nominations for Best Actor. He was highly regarded by his peers and critics alike for his impeccable craft and his ability to elevate any production he was a part of.",
        "birthday": "1909-05-15",
        "deathday": "1984-07-27",
        "gender": 2,
        "homepage": null,
        "id": 2091,
        "imdb_id": "nm0000051",
        "known_for_department": "Acting",
        "name": "James Mason",
        "place_of_birth": "Huddersfield, Yorkshire, England, UK",
        "popularity": 0.9754,
        "profile_path": "/ivmJl4jLgYoxI93EPgBehund505.jpg"
    }
}