{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/x1eYwWTT8KbT8MvZBioxJ4ctZ35.jpg",
                "genre_ids": [
                    18
                ],
                "id": 1000492,
                "original_language": "fr",
                "original_title": "Je verrai toujours vos visages",
                "overview": "Since 2014, France's restorative justice programmes have offered a safe space for supervised dialogue between offenders and victims. Grégoire, Nawelle, and Sabine, victims of heists and violent robberies, agree to join one of these discussion groups alongside offenders Nassim, Issa, and Thomas, all convicted of violent robberies. Meanwhile Chloé, a victim of childhood sexual abuse, prepares for dialogue with her own agressor after learning he has moved back into town.",
                "popularity": 1.8139,
                "poster_path": "/zIgyDGsmIyMAf0ppg7QKTuIM1He.jpg",
                "release_date": "2023-03-29",
                "title": "All Your Faces",
                "video": false,
                "vote_average": 7.965,
                "vote_count": 636,
                "character": "Woman at SPIP",
                "credit_id": "6560725d2b113d010cc0be1a",
                "order": 25
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "After a scientific baccalaureate, Claire de La Rüe du Can trained at the Regional Conservatory of Tours in drama class while pursuing her degree in Art History at the François Rabelais University. In 2011, she played the title role in Tania, a short film by Giovanni Sportiello, which won the quality prize from the National Center for Cinema and Animated Image and earned her the prize for female interpretation at the Nice Festival. The same year, she joined the School of the National Theater of Strasbourg where she worked with, among others, Alexandre Gavras, David Lescot, Claudio Tolcachir, Frank Vercruyssen of the Flemish collective tg STAN and Éric Vigner.  Resident of the Comédie-Française since October 1, 2013, she made her debut there in the role of Ægiale in Psyché by Molière directed by Véronique Vella. In 2014, she played Ismene in Racine's Phèdre directed by Michael Marmarinos. At the same time, she interpreted Angélique in Le Malade imaginaire de Molière by Claude Stratz as well as another Angélique by Molière, that of George Dandin directed by Hervé Pierre.\n\nIn 2015, she played Amelia in La Maison de Bernarda Alba by Federico García Lorca under the direction of Lilo Baur and Viviane in Un fil à la patte by Feydeau directed by Jérôme Deschamps. Françoise Gillard asks her to take part in L'Autre, a choreographic show she is designing with Claire Richard. Arnaud Desplechin offered her the role of Bertha in Father by Strindberg and in 2016, Clément Hervieu-Léger offered her that of Hortense in Le Petit-Maîtrecorrected by Marivaux. She also plays in Lucrèce Borgia by Victor Hugo and Les Fourberies de Scapin by Molière, two productions by Denis Podalydès, as well as in L'Hôtel du Libre-Échange by Feydeau by Isabelle Nanty. David Lescot directs her in Les Ondes magnétiques, a text he wrote for the Troupe. In 2018-2019, she performed in three creations : L'Heureux Stratagème by Marivaux directed by Emmanuel Daumas, The Little Mermaid after Andersen directed by Géraldine Martineau and Hors la loi by and by Pauline Bureau , as well as that of the revival of Lucrèce Borgia by Victor Hugo by Denis Podalydès.\n\nIn 2019-2020, Claire de La Rüe du Can notably plays at the Théâtre du Vieux-Colombier in creations of Jules César by Shakespeare by Rodolphe Dana and Forums by Maël Piriou, Patrick Goujon and Hélène Grémillon by Jeanne Herry as well as in revivals of The Little Mermaid at the Studio-Théâtre and L'Heureux Stratagème at the Théâtre du Vieux-Colombier.\n\nOn screen, Claire de La Rüe du Can starred, in 2014, in Today, a short film by Anne-Sophie Rouvillois, then in Lola Pater, a film by Nadir Moknèche released in theaters in 2017. plays Dom Juan & Sganarelle, a film directed by Vincent Macaigne in 2016 for the collection “ La Comédie-Française makes its cinema ” co-produced by ARTE.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 2092445,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Claire de la Rüe du Can",
        "place_of_birth": null,
        "popularity": 0.0761,
        "profile_path": "/rPyxpuI55nih4qn0EaEwEUbH5ay.jpg"
    }
}