{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hrtjErTwP1AvNLDsIO5jTPOihAd.jpg",
                "genre_ids": [
                    28
                ],
                "id": 1102776,
                "original_language": "fr",
                "original_title": "AKA",
                "overview": "A steely special ops agent finds his morality put to the test when he infiltrates a crime syndicate and unexpectedly bonds with the boss' young son.",
                "popularity": 3.6212,
                "poster_path": "/exKj9XSFWLajZ6NI60Gxsj1qNuE.jpg",
                "release_date": "2023-04-28",
                "title": "AKA",
                "video": false,
                "vote_average": 6.873,
                "vote_count": 658,
                "character": "Moktar Al Tayeb",
                "credit_id": "644c9a71336e01054173d50d",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Kevin Layne was born in London to Allyson Williams MBE, a senior Midwife, and Vernon 'Fellows\" Williams, an entrepreneur and pioneer of London's world-famous Notting Hill Carnival. Layne grew up in Wembley, northwest London, and regularly visited his parents' native Trinidad and Tobago. As a teenager, Layne took a keen interest in acting, initially taking extra roles in shows such as Channel 4's 'Get up Stand Up' and television commercials. Having gained more life experience, Layne received the DaDAs (Dance and Drama Awards) scholarship from the Arts Educational School of Acting after having only auditioned 'once' in his entire life. Since graduating, with a Masters Degree in acting, Layne has appeared in several stage productions in London's West End, and has also featured in independent film productions, network television shows and Hollywood movie productions.",
        "birthday": "1979-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": "https://msftmanagement.com/project/kevin-layne/",
        "id": 2093764,
        "imdb_id": "nm6442861",
        "known_for_department": "Acting",
        "name": "Kevin Layne",
        "place_of_birth": "Wembley, London, England, UK",
        "popularity": 0.5709,
        "profile_path": "/7AMmJZfrGmdBuOKaTBNPYRLiJFA.jpg"
    }
}