{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/82a7AGF081PzFfoM8GAVGMvZNYK.jpg",
                "genre_ids": [
                    12,
                    14
                ],
                "id": 675,
                "original_language": "en",
                "original_title": "Harry Potter and the Order of the Phoenix",
                "overview": "Returning for his fifth year of study at Hogwarts, Harry is stunned to find that his warnings about the return of Lord Voldemort have been ignored. Left with no choice, Harry takes matters into his own hands, training a small group of students to defend themselves against the dark arts.",
                "popularity": 18.6683,
                "poster_path": "/5aOyriWkPec0zUDxmHFP9qMmBaj.jpg",
                "release_date": "2007-07-08",
                "title": "Harry Potter and the Order of the Phoenix",
                "video": false,
                "vote_average": 7.674,
                "vote_count": 20146,
                "character": "Lift (voice)",
                "credit_id": "52fe4268c3a36847f801c587",
                "order": 43
            },
            {
                "adult": false,
                "backdrop_path": "/AqLcLsGGTzAjm3pCCq0CZCQrp6m.jpg",
                "genre_ids": [
                    12,
                    14
                ],
                "id": 12444,
                "original_language": "en",
                "original_title": "Harry Potter and the Deathly Hallows: Part 1",
                "overview": "Harry, Ron and Hermione walk away from their last year at Hogwarts to find and destroy the remaining Horcruxes, putting an end to Voldemort's bid for immortality. But with Harry's beloved Dumbledore dead and Voldemort's unscrupulous Death Eaters on the loose, the world is more dangerous than ever.",
                "popularity": 18.8359,
                "poster_path": "/iGoXIpQb7Pot00EEdwpwPajheZ5.jpg",
                "release_date": "2010-11-17",
                "title": "Harry Potter and the Deathly Hallows: Part 1",
                "video": false,
                "vote_average": 7.739,
                "vote_count": 19733,
                "character": "Ministry Lift (voice)",
                "credit_id": "600f5c3bdd83fa00409523c9",
                "order": 84
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Daisy Haggard is a British actress and comedian. She is known for Doctor Who (2005) and Harry Potter and the Order of the Phoenix (2007) . She is the daughter of film director Piers Haggard and his wife Anna Sklovsky.\n\nShe was raised in Dulwich, South London, where she attended James Allen's Girls' School. She later attended the London Academy of Music and Dramatic Art.\n\nIn 1996, Haggard made her acting debut in an episode of ITV crime drama, The Ruth Rendell Mysteries. The episode was directed by her father, and during the auditions, the producer stated that he wanted to audition Daisy, despite opposition from her father, who did not want his daughter to become an actor.\n\nHaggard later graduated from the London Academy of Music and Dramatic Art. She appeared in the BBC Three sketch show Man Stroke Woman, and in the Channel 4 sitcom Green Wing as Emmy. She also made an appearance in an episode of Peep Show, playing a nurse who examines Mark Corrigan's testicles, and in the BBC Two comedy Psychoville by Reece Shearsmith and Steve Pemberton.\n\nIn the 2008 adaptation of Sense and Sensibility, Haggard portrayed the role of Miss Steele, the sister of Lucy Steele. In 2009, she played Donna Mitchell in an episode of the BBC crime drama Ashes to Ashes.\n\nHaggard was also the voice of the Ministry Lift in Harry Potter and the Order of the Phoenix and Harry Potter and the Deathly Hallows – Part 1. In 2010, she appeared in the CBC television film Abroad, playing Poppy Young.\n\nHaggard played Sophie in the Doctor Who episode \"The Lodger\", a role she reprised in \"Closing Time\".\n\nIn 2010, Haggard starred in the independent British film Honeymooner. In 2012, she starred in the short film Tooty's Wedding, which was later screened at the 2012 Sundance Film Festival. In 2011, she began appearing in the BBC/Showtime comedy Episodes. She portrayed the role of Myra Licht until the series ended in 2017.\n\nHaggard also appeared on the stage, including at the National Theatre and as the title character in Gina Gionfriddo's play Becky Shaw at the Almeida Theatre.\n\nIn July 2012, Sky One began airing the series Parents, in which Haggard played the role of Chrissie.\n\nIn 2013, she co-starred with Rose Byrne in the British romantic comedy I Give It a Year as Helen. In 2014, she was cast as Sam in the BBC comedy Uncle. In 2016, she appeared in \"Nosedive\", an episode of the anthology series Black Mirror.\n\nIn 2017, she appeared in the premiere production of Consent at the Royal National Theatre, London.\n\nIn April 2019, Haggard began playing the lead role of Miri Matteson in BBC Three sitcom Back to Life. The first series, consisting of six episodes, premiered on 15 April 2019 and was followed by a second series in 2021. She also co-wrote and created the series. In 2020 Haggard appeared in the comedy-drama Breeders as Ally.\n\nShe plays one of the leads in the 2023 series Boat Story alongside Paterson Joseph.",
        "birthday": "1978-03-22",
        "deathday": null,
        "gender": 1,
        "homepage": "https://theb-side.co.uk/management/daisy-haggard/",
        "id": 209458,
        "imdb_id": "nm0353579",
        "known_for_department": "Acting",
        "name": "Daisy Haggard",
        "place_of_birth": "Dulwich, London, England, UK",
        "popularity": 0.1474,
        "profile_path": "/10T4bAeX8AkjNFchad2mOPtAyuV.jpg"
    }
}