{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qg0OLFasb1kNrAhKjqh4zTW37pS.jpg",
                "genre_ids": [
                    18,
                    878,
                    53
                ],
                "id": 6479,
                "original_language": "en",
                "original_title": "I Am Legend",
                "overview": "Robert Neville is a scientist who was unable to stop the spread of the terrible virus that was incurable and man-made. Immune, Neville is now the last human survivor in what is left of New York City and perhaps the world. For three years, Neville has faithfully sent out daily radio messages, desperate to find any other survivors who might be out there. But he is not alone.",
                "popularity": 10.4486,
                "poster_path": "/iPDkaSdKk2jRLTM65UOEoKtsIZ8.jpg",
                "release_date": "2007-12-12",
                "title": "I Am Legend",
                "video": false,
                "vote_average": 7.212,
                "vote_count": 16267,
                "character": "Infected",
                "credit_id": "5bce2d300e0a265d39004d11",
                "order": 60
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/5AhkjcqqRxBdpYZ0TeOuTCuOUYq.jpg",
                "genre_ids": [
                    80,
                    53,
                    18
                ],
                "id": 429200,
                "original_language": "en",
                "original_title": "Good Time",
                "overview": "After a botched bank robbery lands his younger brother in prison, Connie Nikas embarks on a twisted odyssey through New York City's underworld to get his brother Nick out of jail.",
                "popularity": 2.7366,
                "poster_path": "/yE1c9hj5Hf8a9KplAdRdhADqUro.jpg",
                "release_date": "2017-08-11",
                "title": "Good Time",
                "video": false,
                "vote_average": 7.214,
                "vote_count": 2949,
                "credit_id": "5c2b9fc7c3a3682908a1530e",
                "department": "Crew",
                "job": "Stunt Double"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Greg Watkiss"
        ],
        "biography": "Born in Jamaica, West Indies, Greg Wattkis relocated to the U.S. as a child, where he pursued and excelled in a myriad of athletic pursuits,that included gymnastics, track and field, baseball and basketball.\n\nAs a result of his love for sports and continued physical training Greg began to pursue a career as an actor and stunt performer. His training in gymnastics, and various disciplines has afforded him the ability to perform the necessary work on film and television. He believes that there is always a lot more to learn, so he is always training.\n\nAfter appearing in the feature film \"I Am Legend\" he was honored to be among those nominated at the SAG Awards for \"Best Stunt Ensemble\".\n\nHe was also nominated for \"Hardest Hit in a Stunt\" by his peers at the Taurus World Stunt Awards for his work on \"Grown Ups 2\".\n\nHis continued training and experience drives his goal to work along side, and for the top of the industry in Film & Television and in the world of stunts. To date, he is a Stunt Coordinator, Stunt performer and Actor.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://resumes.breakdownexpress.com/130293-5478976-17664",
        "id": 2096301,
        "imdb_id": "nm1270546",
        "known_for_department": "Acting",
        "name": "Greg Wattkis",
        "place_of_birth": "Kingston, Jamaica, British West Indies",
        "popularity": 0.0214,
        "profile_path": null
    }
}