{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sgsW7aqUXg4jG2GcoLKotSvp807.jpg",
                "genre_ids": [
                    18
                ],
                "id": 24226,
                "original_language": "en",
                "original_title": "The Verdict",
                "overview": "Frank Galvin is a down-on-his-luck lawyer and reduced to drinking and ambulance chasing, when a former associate reminds him of his obligations in a medical malpractice suit by serving it to Galvin on a silver platter—all parties are willing to settle out of court. Blundering his way through the preliminaries, Galvin suddenly realizes that the case should actually go to court—to punish the guilty, to get a decent settlement for his clients... and to restore his standing as a lawyer.",
                "popularity": 4.3022,
                "poster_path": "/m3DdNJZfBcsTiFe0SwsLChWavrG.jpg",
                "release_date": "1982-12-08",
                "title": "The Verdict",
                "video": false,
                "vote_average": 7.446,
                "vote_count": 674,
                "character": "Maureen Rooney",
                "credit_id": "52fe448bc3a368484e028c5d",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Julia Anne Bovasso"
        ],
        "biography": "Julia Anne Bovasso (August 1, 1930 – September 14, 1991) was an American actress of stage, screen, and television.\n\nBovasso was born in Brooklyn, New York and raised in the Bensonhurst neighborhood of this borough, the daughter of Angela Mary (née Padovani) and Bernard Michael Bovasso, a teamster. She was Albanian-Italian-American.\n\nShe attended The High School of Music & Art in Manhattan.\n\nBovasso appeared in numerous films, including Saturday Night Fever (1977) as Florence Manero, the mother of John Travolta's character, Tony Manero. She reprised the role in the film's 1983 sequel Staying Alive. Before Saturday Night Fever, she appeared in the 1970 Otto Preminger film Tell Me That You Love Me, Junie Moon.\n\nIn addition to Staying Alive, she was in a number of films in the 1980s, including Willie & Phil (1980), The Verdict (1982), Daniel (1983), Off Beat (1986), Wise Guys (1986), Moonstruck (1987). In the 1990s, Bovasso was seen in Betsy's Wedding (1990) and My Blue Heaven (1990).\n\nOn-stage, Bavasso wrote and appeared in avant-garde productions off-Broadway such as Jean Genet's The Maids. For the latter, she won the first Best Actress Obie (Off-Broadway) Award in 1956, presented to her by Shelley Winters.\n\nBefore her film work, Bovasso established the experimental Tempo Playhouse at 4 St. Marks Place in Manhattan during the 1950s. There, she introduced works of the Theater of the Absurd, including works by the playwrights Jean Genet, Eugene Ionesco and Michel de Ghelderode, to the professional theater in the United States.\n\nBovasso also performed with The Living Theater and had a longstanding relationship with La Mama Experimental Theatre Club. From 1968 to 1975, she directed many of her own original works at La MaMa, including Gloria and Esperanza, Schubert's Last Serenade, The Moondreamers, Standard Safety, and The Nothing Kid.\n\nIn addition to her work as a director and actor, her playwriting credits include the four-hour play Gloria and Esperanza, which Village Voice theatre critic Jerry Tallmer described as \"a miracle, a mythopoetic fireworks display.\" A sought-after acting coach, Bovasso was known as an exacting instructor and her private New York workshops regularly included prominent performers. As per the DVD commentary, Bovasso coached both Cher and Olympia Dukakis on their Brooklyn accents in the film Moonstruck.\n\nIn earlier performances, she played Rose Corelli Fraser in the short-lived soap opera From These Roots. She was fired from that show due to a disagreement with producers.",
        "birthday": "1930-08-01",
        "deathday": "1991-09-14",
        "gender": 1,
        "homepage": null,
        "id": 20972,
        "imdb_id": "nm0100566",
        "known_for_department": "Acting",
        "name": "Julie Bovasso",
        "place_of_birth": "Brooklyn, New York, USA",
        "popularity": 0.202,
        "profile_path": "/uIu6hp2vWbLC9pzGuR3iv3XYYci.jpg"
    }
}