{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/t1ptcIJiPzxR4cM9q7i0RFizFd8.jpg",
                "genre_ids": [
                    12,
                    878,
                    10751
                ],
                "id": 173,
                "original_language": "en",
                "original_title": "20,000 Leagues Under the Sea",
                "overview": "A ship sent to investigate a wave of mysterious sinkings encounters the advanced submarine, the Nautilus, commanded by Captain Nemo.",
                "popularity": 3.4627,
                "poster_path": "/heAEH85fdxEgV98LizHbQCL95iZ.jpg",
                "release_date": "1954-12-23",
                "title": "20,000 Leagues Under the Sea",
                "video": false,
                "vote_average": 7.046,
                "vote_count": 929,
                "character": "Billy",
                "credit_id": "52fe4222c3a36847f8006a27",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/ft8WRF2xqEwwGWa59naDUybKTAx.jpg",
                "genre_ids": [
                    18,
                    10752,
                    10749
                ],
                "id": 770,
                "original_language": "en",
                "original_title": "Gone with the Wind",
                "overview": "The spoiled daughter of a Georgia plantation owner conducts a tumultuous romance with a cynical profiteer during the American Civil War and Reconstruction Era.",
                "popularity": 7.332,
                "poster_path": "/lNz2Ow0wGCAvzckW7EOjE03KcYv.jpg",
                "release_date": "1939-12-15",
                "title": "Gone with the Wind",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 4191,
                "character": "Johnny Gallagher",
                "credit_id": "52fe4274c3a36847f801fe61",
                "order": 29
            },
            {
                "adult": false,
                "backdrop_path": "/hwMWJ8G5173SGCHzrm0mVjvESaY.jpg",
                "genre_ids": [
                    27,
                    18
                ],
                "id": 13666,
                "original_language": "en",
                "original_title": "The Wolf Man",
                "overview": "After his brother's death, Larry Talbot returns home to his father and the family estate. Events soon take a turn for the worse when Larry is bitten by a werewolf.",
                "popularity": 1.3643,
                "poster_path": "/vG8fu5syTtQLzK1hQXyi3ugOPNF.jpg",
                "release_date": "1941-12-12",
                "title": "The Wolf Man",
                "video": false,
                "vote_average": 7.012,
                "vote_count": 645,
                "character": "Charles Conliffe",
                "credit_id": "52fe45889251416c75059d1d",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Joseph M. Kerrigan",
            "J. M. Kerrigan"
        ],
        "biography": "Joseph Michael Kerrigan (16 December 1884 – 29 April 1964), better known as J.M. Kerrigan, was an Irish character actor. Kerrigan was born in Dublin, Ireland. He worked as a newspaper reporter until 1907 when he joined the famous Abbey Players. There he became a stalwart, appearing in plays by Lady Gregory, William Butler Yeats and John Millington Synge (for whom he played the role of Shawn Keogh in The Playboy of the Western World. His first screen appearance was in the silent film Food of Love in 1916. By the 1920s he was appearing on Broadway, often in plays by Shakespeare, Ibsen, and Sheridan. He settled permanently in Hollywood in 1935, having been recruited along with several other Abbey performers, to appear in John Ford's The Informer. In that film and in Ford's The Long Voyage Home, he plays similar roles, that of a leech who attaches himself to men until they run out of money. Perhaps his best known role was in The General Died at Dawn, where he plays a character actually named Leach, in which he steals scenes from Gary Cooper, Madeleine Carroll and William Frawley. In it he plays a sinister little petty thief who, holding a gun on Cooper, says, \"I may be fat, but I'm agile.\" He had little screen time in films which he starred as minor roles, such as the \"First Drayman\" in Merely Mary Ann (1931) with Janet Gaynor. One of his most recognizable minor roles was in Gone with the Wind (1939), in which he played John Gallegher, the seemly jovial mill owner who whips his convict labour in to \"co-operation\". He appeared in Walt Disney's 20,000 Leagues Under the Sea (1954), the famous film version of Jules Verne's Twenty Thousand Leagues Under the Sea in a minor role at the beginning of the film. In 1946, he tried breaking into Broadway shows, playing the discombobulated leprechaun Jackeen J. O'Malley in the show \"Barnaby and Mr. O'Malley\", based on the Crockett Johnson comic strip. J. M. Kerrigan died in Hollywood on 29 April 1964, aged 79. Kerrigan has a star on the Hollywood Walk of Fame at 6621 Hollywood Blvd.",
        "birthday": "1884-12-16",
        "deathday": "1964-04-29",
        "gender": 2,
        "homepage": null,
        "id": 2099,
        "imdb_id": "nm0449858",
        "known_for_department": "Acting",
        "name": "J.M. Kerrigan",
        "place_of_birth": "Dublin, Ireland",
        "popularity": 0.1671,
        "profile_path": "/2AE4lldtdkQEEcRl647xlMTpvD8.jpg"
    }
}