{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/enNubozHn9pXi0ycTVYUWfpHZm.jpg",
                "genre_ids": [
                    18,
                    28,
                    80,
                    53
                ],
                "id": 155,
                "original_language": "en",
                "original_title": "The Dark Knight",
                "overview": "Batman raises the stakes in his war on crime. With the help of Lt. Jim Gordon and District Attorney Harvey Dent, Batman sets out to dismantle the remaining criminal organizations that plague the streets. The partnership proves to be effective, but they soon find themselves prey to a reign of chaos unleashed by a rising criminal mastermind known to the terrified citizens of Gotham as the Joker.",
                "popularity": 45.0503,
                "poster_path": "/qJ2tW6WMUDux911r6m7haRef0WH.jpg",
                "release_date": "2008-07-16",
                "title": "The Dark Knight",
                "video": false,
                "vote_average": 8.523,
                "vote_count": 34382,
                "character": "Passenger",
                "credit_id": "560c2d12c3a36868140069fa",
                "order": 71
            },
            {
                "adult": false,
                "backdrop_path": "/z0tHLAHWRYm7nbwf9CyAZv9sj2j.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 51828,
                "original_language": "en",
                "original_title": "One Day",
                "overview": "A romantic comedy centered on Dexter and Emma, who first meet during their graduation in 1988 and proceed to keep in touch regularly. The film follows what they do on July 15 annually, usually doing something together.",
                "popularity": 4.8615,
                "poster_path": "/iWPwEkIDAihT5EDPZxFmhtyVrtj.jpg",
                "release_date": "2011-03-02",
                "title": "One Day",
                "video": false,
                "vote_average": 7.425,
                "vote_count": 4389,
                "character": "Mrs. Major",
                "credit_id": "5914af86c3a368423c010855",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            " Lorna Gale",
            "Lorna Gee",
            "Lorna Gayle",
            "Lorna N Gayle"
        ],
        "biography": "Lorna N Gayle (born 14 April 1963), known professionally as Sutara Gayle, is a British actress and singer, known for appearing in the films Run Fatboy Run (2007), The Dark Knight (2008) and One Day (2011). In 2015, she played Shontal in the BBC Three sitcom Fried. As Lorna Gee, she won awards as a lovers rock reggae singer. Between 2021 and 2022, she played the role of Gloria Mason-Walker in Silent Witness.\n\nSince beginning her career in 2007, Gayle has appeared in films, on television and on stage. Gayle's first audition was for the tap-dancing play Stepping Out. She has also appeared in the West End musical Tina. She portrayed the role of Gloria Mason-Walker in Silent Witness on a recurring basis between 2021 and 2022. In 2022, she appeared in four episodes of Magpie Murders as Gemma Whiteley and as Kim Sullivan in the BBC drama Strike.\n\nWhilst on a trip to India with her brother in 2011, Gayle made some \"personal discoveries\" and was given a naming ceremony, in which she was given the name \"Sutara\" which has used professionally since 2020.",
        "birthday": "1963-04-14",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 209990,
        "imdb_id": "nm1452416",
        "known_for_department": "Acting",
        "name": "Sutara Gayle",
        "place_of_birth": "Lambeth, London, England, UK",
        "popularity": 0.1211,
        "profile_path": "/vtOeqxrUyOrjayBp989WQCQBDxF.jpg"
    }
}