{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8z9FAuMxfF3qg8uLZ2BUFCDmpbd.jpg",
                "genre_ids": [
                    10749,
                    35
                ],
                "id": 2064,
                "original_language": "en",
                "original_title": "While You Were Sleeping",
                "overview": "A transit worker pulls commuter Peter off railway tracks after he's mugged, but—while he's in a coma—his family mistakenly thinks she's Peter's fiancée, and she doesn't correct them. Things get more complicated when she falls for his brother, who's not quite sure that she's who she claims to be.",
                "popularity": 3.9413,
                "poster_path": "/qNGO3ETcNwlWqK2kNRpbJSJRlos.jpg",
                "release_date": "1995-04-21",
                "title": "While You Were Sleeping",
                "video": false,
                "vote_average": 7.021,
                "vote_count": 1896,
                "character": "Wanda",
                "credit_id": "5b67326f925141405409c4fe",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Ruth Rudnick, a graduate of Sarah Lawrence College and an alumni of The Second City Theater in Chicago, is an actress,  writer and improviser. Her career began in Boston at WZOU FM where she laughed for a living on the air as “the girl” on the Boston Morning Zoo, doing impressions, and making up the traffic reports. Next came Chicago where she co-wrote and performed in over fifteen reviews with other alumni that included Jane Morris, Steven Colbert and Steve Carell. Ruth can be seen as  Nurse Wanda in the film While You Were Sleeping and since moving to Los Angeles has been the lead of a network pilot (you’ve never seen it) and has guest starred on numerous television shows including Curb Your Enthusiasm and NCIS. She is a founding member of the All Girl Review and is currently near completion of her first book- a childhood memoir. Ruth is the founder of Lead With Your Art an organization dedicated to fostering and making available, her love of improvisation and the  arts to teenagers and young adults.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 2100335,
        "imdb_id": "nm0748873",
        "known_for_department": "Acting",
        "name": "Ruth Rudnick",
        "place_of_birth": null,
        "popularity": 0.1373,
        "profile_path": "/oe8SfQlvuRvHJLvfLzJswmH0V10.jpg"
    }
}