{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kWYHKVCl2aD3kRco4eRUr4h6LsD.jpg",
                "genre_ids": [
                    18,
                    36,
                    10752,
                    28
                ],
                "id": 2024,
                "original_language": "en",
                "original_title": "The Patriot",
                "overview": "After proving himself on the field of battle in the French and Indian War, Benjamin Martin wants nothing more to do with such things, preferring the simple life of a farmer. But when his son Gabriel enlists in the army to defend their new nation, America, against the British, Benjamin reluctantly returns to his old life to protect his son.",
                "popularity": 12.2458,
                "poster_path": "/fWZd815QxUCUcrWQZwUkAp9ljG.jpg",
                "release_date": "2000-06-28",
                "title": "The Patriot",
                "video": false,
                "vote_average": 7.181,
                "vote_count": 4090,
                "character": "Margaret Martin",
                "credit_id": "5acd5b210e0a26320a035710",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Mika Sue Boorem "
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nMika Juliette Boorem (born August 18, 1987) is an American actress who has appeared in the films Blue Crush (2002), Carolina (2003), Sleepover (2004), and Smile (2005).\n\nBoorem was born in Tucson, Arizona, the daughter of Benjamin and Holly Boorem, and has an older brother, Benjamin. Boorem began acting in local theater in Arizona, and subsequently moved to Los Angeles with her family, where she attended Lycée Français de Los Angeles. She has starred in the films Sleepover (2004) and Smile (2005). She had supporting roles in the films Jack Frost (1998), The Patriot (2000), Along Came a Spider (film) (2001), Hearts in Atlantis (2001), Blue Crush (2002) and Carolina (2003); and recurring roles on the TV series Dawson's Creek and Touched by an Angel. She also appeared in the Lifetime Movie drama, Augusta, Gone, The Initiation of Sarah, and a guest starring role in the House episode \"Insensitive.\" She also guest starred in an episode of Ghost Whisperer in 2008.\n\nBoorem has been nominated for a Teen Choice Award for Choice TV Sidekick (for her role on Dawson's Creek), and received four Young Artist Award nominations.\n\nIn 2008, Boorem was featured in David Cook's music video \"Light On\".",
        "birthday": "1987-08-18",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 21027,
        "imdb_id": "nm0095561",
        "known_for_department": "Acting",
        "name": "Mika Boorem",
        "place_of_birth": "Tucson, Arizona, USA",
        "popularity": 0.6264,
        "profile_path": "/gTnVjjDpyS2ZVPyDFaDipOUkDY8.jpg"
    }
}