{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2y2aqaScd7jsUee0ddI1iRNgwGq.jpg",
                "genre_ids": [
                    18,
                    14,
                    9648,
                    10749
                ],
                "id": 428449,
                "original_language": "en",
                "original_title": "A Ghost Story",
                "overview": "Recently deceased, a white-sheeted ghost returns to his suburban home to console his bereft wife, only to find that in his spectral state he has become unstuck in time, forced to watch passively as the life he knew and the woman he loves slowly slip away.",
                "popularity": 6.7472,
                "poster_path": "/rp5JPIyZi9sMob15l46zNQLe5cO.jpg",
                "release_date": "2017-04-24",
                "title": "A Ghost Story",
                "video": false,
                "vote_average": 7.087,
                "vote_count": 2403,
                "character": "Clara",
                "credit_id": "58db089a92514133b9001885",
                "order": 18
            },
            {
                "adult": false,
                "backdrop_path": "/4GPCnwvTbsDleH5QIOyDLMsK8a2.jpg",
                "genre_ids": [
                    28,
                    53,
                    878
                ],
                "id": 59967,
                "original_language": "en",
                "original_title": "Looper",
                "overview": "In the year 2044, time travel has not yet been invented but in 30 years it will have been. When the mob wants to get rid of someone, they will send their target into the past where a looper, a hired gun, like Joe is waiting to mop up. Joe is getting rich and life is good until the day the mob decides to close the loop, sending back Joe's future self for assassination.",
                "popularity": 3.912,
                "poster_path": "/sNjL6SqErDBE8OUZlrDLkexfsCj.jpg",
                "release_date": "2012-09-26",
                "title": "Looper",
                "video": false,
                "vote_average": 6.895,
                "vote_count": 10489,
                "character": "TK Billboard Girl (uncredited)",
                "credit_id": "611fe76c387651007316302f",
                "order": 34
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "브리 그랜트",
            "Brea Colleen Grant",
            "布瑞亞·格蘭特",
            "بریا گرنت"
        ],
        "biography": "Brea Colleen Grant (born 16 October 1981) is an American actress and writer who is best known for playing Daphne Millbrook in the NBC television series Heroes. She was born in Marshall, Texas, and holds Bachelor's and Master's degrees in American Studies from The University of Texas at Austin.\n\nHer acting career includes credits in an episode of Cold Case, three episodes of Friday Night Lights, as \"Junkie Girl\" (uncredited) in Max Payne, and as \"Rasha\" in SciFi's Battle Planet.\n\nBrea has also seen success in the world of comics. She created a comic book miniseries called We Will Bury You with her brother Zane Grant and artist Kyle Strahm. She continued her comic writing with the SuicideGirls comic miniseries, based on the pin-up Web site of the same name.\n\nDescription above from the Wikipedia article Brea Grant, licensed under CC-BY-SA, full list of contributors on Wikipedia.​",
        "birthday": "1981-10-16",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 210355,
        "imdb_id": "nm2647420",
        "known_for_department": "Acting",
        "name": "Brea Grant",
        "place_of_birth": "Marshall, Texas, USA",
        "popularity": 1.221,
        "profile_path": "/mrRs33aqbd3porc72LZRkk9ECJ0.jpg"
    }
}