{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cq9N64ucEtfIc3eMxNr1VzY9LH9.jpg",
                "genre_ids": [
                    18
                ],
                "id": 37799,
                "original_language": "en",
                "original_title": "The Social Network",
                "overview": "In 2003, Harvard undergrad and computer programmer Mark Zuckerberg begins work on a new concept that eventually turns into the global social network known as Facebook. Six years later, Mark is one of the youngest billionaires ever, but his unprecedented success leads to both personal and legal complications when he ends up on the receiving end of two lawsuits, one involving his former friend.",
                "popularity": 8.1277,
                "poster_path": "/n0ybibhJtQ5icDqTp8eRytcIHJx.jpg",
                "release_date": "2010-10-01",
                "title": "The Social Network",
                "video": false,
                "vote_average": 7.37,
                "vote_count": 12634,
                "character": "Beautiful Woman",
                "credit_id": "52fe466f9251416c91054749",
                "order": 63
            },
            {
                "adult": false,
                "backdrop_path": "/yizL4cEKsVvl17Wc1mGEIrQtM2F.jpg",
                "genre_ids": [
                    28,
                    878,
                    12
                ],
                "id": 588228,
                "original_language": "en",
                "original_title": "The Tomorrow War",
                "overview": "The world is stunned when a group of time travelers arrive from the year 2051 to deliver an urgent message: Thirty years in the future, mankind is losing a global war against a deadly alien species. The only hope for survival is for soldiers and civilians from the present to be transported to the future and join the fight. Among those recruited is high school teacher and family man Dan Forester. Determined to save the world for his young daughter, Dan teams up with a brilliant scientist and his estranged father in a desperate quest to rewrite the fate of the planet.",
                "popularity": 14.8499,
                "poster_path": "/34nDCQZwaEvsy4CFO5hkGRFDCVU.jpg",
                "release_date": "2021-09-03",
                "title": "The Tomorrow War",
                "video": false,
                "vote_average": 7.493,
                "vote_count": 3819,
                "character": "Conscription Officer Lauren Paveza",
                "credit_id": "608aa94e680be80029b479b7",
                "order": 37
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Felisha Terrell (born March 16, 1979) is an American film and television actress. Terrell grew up in Chicago, Illinois, went to college, and entered pharmaceutical sales after graduation. She was born to an African American father and Caucasian mother. In 2007, she relocated to Los Angeles to begin an acting career. It was there that she took acting classes which led to numerous acting opportunities. She is also the former fiance of Cincinnati Bengals' wide receiver Terrell Owens, and she made a guest appearance on his VH1 reality TV series, The T.O. Show. Terrell has had bit-parts in the movie Get Smart, and the TV series Entourage in 2008. In April 2009, her big break came when she began playing the contract role of Arianna Hernandez on the soap opera Days of Our Lives. On July 22, 2009 Soap Opera Digest announced that Terrell had been fired from the soap and will be replaced by former Passions star Lindsay Hartley.",
        "birthday": "1979-03-16",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 210334,
        "imdb_id": "nm3037819",
        "known_for_department": "Acting",
        "name": "Felisha Terrell",
        "place_of_birth": "Illinois, USA",
        "popularity": 0.4832,
        "profile_path": "/7VHzNKb3Nqvs4KzofCWhcfHyUVG.jpg"
    }
}