{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/nOWO66xzNdkslLlUhRfSo015hhP.jpg",
                "genre_ids": [
                    18,
                    10749,
                    14
                ],
                "id": 152603,
                "original_language": "en",
                "original_title": "Only Lovers Left Alive",
                "overview": "A depressed musician reunites with his lover. However, their romance, already played over several centuries, is disrupted by the arrival of her uncontrollable younger sister.",
                "popularity": 3.8599,
                "poster_path": "/6xY2MhYjFPb4xU3KlBJcFAJmMsF.jpg",
                "release_date": "2013-12-12",
                "title": "Only Lovers Left Alive",
                "video": false,
                "vote_average": 7.211,
                "vote_count": 2290,
                "character": "Yasmine",
                "credit_id": "5b6dc496925141404f121df0",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "ياسمين حمدان‎;"
        ],
        "biography": "Yasmine Hamdan (Arabic: ياسمين حمدان‎; born 1976) is a Lebanese singer, songwriter and actress, now based in Paris. She became known with Soapkills, the duo she founded with Zeid Hamdan (no relation) while she was still living in Beirut, Lebanon. The first album released by Soapkills was Bater (1999). Soapkills was one of the first independent electronic bands in the Middle East, and its innovative approach exerted a lasting influence. To this day, Yasmine Hamdan is considered an icon of underground music across the Arab world.  Hamdan had a cameo in Jim Jarmusch's film Only Lovers Left Alive alongside Tilda Swinton and Tom Hiddleston. She has written an original soundtrack for the theatre play Rituel pour une métamorphose by Syrian playwright Saadallah Wannous for a production at Comédie Française.\n\nDescription above from the Wikipedia article Yasmine Hamdan, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1976-01-01",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.yasminehamdan.com/",
        "id": 2104056,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Yasmine Hamdan",
        "place_of_birth": "Lebanon",
        "popularity": 0.0654,
        "profile_path": "/9nRMFFpNzWSXhkCRXcDbsdSX1ay.jpg"
    }
}