{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uYkQYnrAz8Gzw6WCmcFEAzhlJIA.jpg",
                "genre_ids": [
                    18
                ],
                "id": 426426,
                "original_language": "es",
                "original_title": "Roma",
                "overview": "In 1970s Mexico City, two domestic workers help a mother of four while her husband is away for an extended period of time.",
                "popularity": 1.5538,
                "poster_path": "/dtIIyQyALk57ko5bjac7hi01YQ.jpg",
                "release_date": "2018-11-21",
                "title": "Roma",
                "video": false,
                "vote_average": 7.63,
                "vote_count": 3995,
                "character": "Professor Zovek",
                "credit_id": "5b75945e0e0a265c270140d8",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": true,
        "also_known_as": [
            "Latin Lover",
            "Latino"
        ],
        "biography": "is a Mexican Luchador (professional wrestler) and actor. He is best known under his ring name Latin Lover, under which he is also credited in his acting career. Resendiz is best known for wrestling in the Mexican AAA promotion, but has also worked for the World Wrestling Federation (WWF) and currently works for the Perros del Mal and Consejo Mundial de Lucha Libre (CMLL) promotions under the ring name Latino. Resendiz and his partner Mariana Vallejo Isrrade won the very first Bailando por un Sueño dance competition in 2005. In late 2008 Latin Lover returned to wrestling, initially teasing that he would join the CMLL based group Los Perros del Mal, but in the end returned to AAA. At the Rey de Reyes (2009) tournament on March 15, 2009 he defeated Abismo Negro, Black Abyss and Dark Ozz to qualify for the final. In the final he was the last wrestler eliminated by the 2009 Rey de Reyes Electroshock.Following the Rey de Reyes tournament Latin Lover began teaming with Marco Corleone, a wrestler with a similar \"Ladies man\" character. The team challenged AAA World Tag Team Champions La Hermandad Extrema (Spanish for \"The Extreme Brotherhood\"; Nicho el Milinario and Joe Lider) in one of the featured events at Triplemania XVII, only to lose due to miscommunication between Latin Lover and Corleone.[12] On March 18, 2010, AAA announced in a press conference that they would no longer be booking Latin Lover, due to monetary issues and him no-showing the 2010 Rey de Reyes event where he was scheduled to be part of the main event. On April 11 Perros del Mal announced that Latin Lover would be joining the promotion and debuting the following month.[14] On June 4, 2010, Latin Lover returned to Consejo Mundial de Lucha Libre, brawling with Héctor Garza.[15] After not appearing again for CMLL for months, Latin Lover returned to the promotion on November 26, 2010, confronting Los Invasores, a rudo group led by Garza. He was then attacked by the group, before being saved by Shocker.[16] Upon returning to the promotion, Resendiz adopted the new ring name of Latino.\n\nLegal actions against AAA\n\nIn early April, 2010 ex-AAA wrestlers Histeria and El Alebrije sought legal action against AAA over the issues of name and ring character ownership as well as unfair termination by AAA. The two claim that they have wrestled for 13 years to create the characters and thus own them. The parties met in Mexico City’s Board of Concilation and Arbitration to see if a settlement can be reached or if the matter will be taken to court.The parties met for a second arbitration meeting in late April, 2010. This time the plaintiff group was joined by Latin Lover who, like Alebrije, Histeria and the others, claimed that he should be allowed to use the ring name on the independent circuit since he's worked as Latin Lover for 18 years and thus should be allowed to continue using it. After the meeting it was stated that all parties involved were cooperating over the matter",
        "birthday": "1967-10-25",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2104810,
        "imdb_id": "nm2089611",
        "known_for_department": "Acting",
        "name": "Victor Manuel Resendiz Ruiz",
        "place_of_birth": "Monterrey, Nuevo León, Mexico",
        "popularity": 1.4,
        "profile_path": "/vFM7nzUcoofuyyC5rQosuLz4ztD.jpg"
    }
}