{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bAdIO0Jt886Ad1eY9bDXXeCpXsV.jpg",
                "genre_ids": [
                    10749,
                    35,
                    18
                ],
                "id": 2028,
                "original_language": "en",
                "original_title": "Say Anything...",
                "overview": "Lloyd, an eternal optimist, seeks to capture the heart of Diane, an unattainable high school beauty and straight-A student. He surprises just about everyone-including himself-when she returns the sentiment. But Diane's over-possessive, divorced Dad disapproves and it's going to take more than just the power of love to conquer all.",
                "popularity": 11.5805,
                "poster_path": "/nkucKciFGSRalw6dJtsglWqOXMC.jpg",
                "release_date": "1989-04-14",
                "title": "Say Anything...",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 1044,
                "character": "Rebecca",
                "credit_id": "52fe432ec3a36847f80406a3",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/maeox8nZYIxAAE4SdyLA0VOXe1x.jpg",
                "genre_ids": [
                    16,
                    10751,
                    12,
                    14
                ],
                "id": 13179,
                "original_language": "en",
                "original_title": "Tinker Bell",
                "overview": "Journey into the secret world of Pixie Hollow and hear Tinker Bell speak for the very first time as the astonishing story of Disney's most famous fairy is finally revealed in the all-new motion picture \"Tinker Bell.\"",
                "popularity": 7.5092,
                "poster_path": "/3Ma0r1n8kfH7UaQMS7bJ9KsYUjT.jpg",
                "release_date": "2008-09-11",
                "title": "Tinker Bell",
                "video": false,
                "vote_average": 6.903,
                "vote_count": 1504,
                "character": "Vidia (voice)",
                "credit_id": "52fe45499251416c75051675",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/7a4WHNllmX5ZGR0MfYJDPhV69eM.jpg",
                "genre_ids": [
                    16,
                    878
                ],
                "id": 55931,
                "original_language": "en",
                "original_title": "The Animatrix",
                "overview": "Straight from the creators of the groundbreaking Matrix trilogy, this collection of short animated films from the world's leading anime directors fuses computer graphics and Japanese anime to provide the background of the Matrix universe and the conflict between man and machines. The shorts include Final Flight of the Osiris, The Second Renaissance, Kid's Story, Program, World Record, Beyond, A Detective Story and Matriculated.",
                "popularity": 4.7058,
                "poster_path": "/g52SOsTvdjzY8oPIn5znLJMzLHG.jpg",
                "release_date": "2003-05-09",
                "title": "The Animatrix",
                "video": false,
                "vote_average": 7.197,
                "vote_count": 1666,
                "character": "Jue (\"Final Flight of the Osiris\") / Manabu (\"Beyond\") (voice)",
                "credit_id": "52fe48e6c3a36847f817f781",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/2AeE4Op9qjDSXe8GbfCtlbHFxhL.jpg",
                "genre_ids": [
                    16,
                    10751,
                    14,
                    12
                ],
                "id": 75258,
                "original_language": "en",
                "original_title": "Secret of the Wings",
                "overview": "Tinkerbell wanders into the forbidden Winter woods and meets Periwinkle. Together they learn the secret of their wings and try to unite the warm fairies and the winter fairies to help Pixie Hollow.",
                "popularity": 7.301,
                "poster_path": "/5q72GagtB9NM4i3z7M40EXLb3ut.jpg",
                "release_date": "2012-08-17",
                "title": "Secret of the Wings",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 1316,
                "character": "Vidia (voice)",
                "credit_id": "52fe48f9c3a368484e114215",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/vcLpxfpfKCKGiTlUx83CzKxRDT2.jpg",
                "genre_ids": [
                    16,
                    10751
                ],
                "id": 175112,
                "original_language": "en",
                "original_title": "Tinker Bell and the Pirate Fairy",
                "overview": "Zarina, a smart and ambitious dust-keeper fairy who’s captivated by Blue Pixie Dust and its endless possibilities, flees Pixie Hollow and joins forces with the scheming pirates of Skull Rock, who make her captain of their ship. Tinker Bell and her friends must embark on an epic adventure to find Zarina, and together they go sword-to-sword with the band of pirates led by a cabin boy named James, who’ll soon be known as Captain Hook himself.",
                "popularity": 7.8415,
                "poster_path": "/81oxrsugqqs8sAVNX9fdlz57cVU.jpg",
                "release_date": "2014-02-13",
                "title": "Tinker Bell and the Pirate Fairy",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 1038,
                "character": "Vidia (voice)",
                "credit_id": "530b998e92514158ca000068",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/9s58ybtK5rj4QGmAtzOMzVeiY5P.jpg",
                "genre_ids": [
                    12,
                    16,
                    10751
                ],
                "id": 297270,
                "original_language": "en",
                "original_title": "Tinker Bell and the Legend of the NeverBeast",
                "overview": "An ancient myth of a massive creature sparks the curiosity of Tinker Bell and her good friend Fawn, an animal fairy who’s not afraid to break the rules to help an animal in need. But this creature is not welcome in Pixie Hollow — and the scout fairies are determined to capture the mysterious beast, who they fear will destroy their home. Fawn must convince her fairy friends to risk everything to rescue the NeverBeast.",
                "popularity": 6.5167,
                "poster_path": "/3S0mmmpYStB3GqodRghcfOt81wQ.jpg",
                "release_date": "2014-12-12",
                "title": "Tinker Bell and the Legend of the NeverBeast",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 1139,
                "character": "Vidia (voice)",
                "credit_id": "54dfc82bc3a36845510045ce",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/5rwcd24GGltKiqdPT4G2dmchLr9.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 579583,
                "original_language": "en",
                "original_title": "The King of Staten Island",
                "overview": "Scott has been a case of arrested development ever since his firefighter father died when he was seven. He's now reached his mid-20s having achieved little, chasing a dream of becoming a tattoo artist that seems far out of reach. As his ambitious younger sister heads off to college, Scott is still living with his exhausted ER nurse mother and spends his days smoking weed, hanging with the guys — Oscar, Igor and Richie — and secretly hooking up with his childhood friend Kelsey. But when his mother starts dating a loudmouth firefighter named Ray, it sets off a chain of events that will force Scott to grapple with his grief and take his first tentative steps toward moving forward in life.",
                "popularity": 5.9689,
                "poster_path": "/zQFjMmE3K9AX5QrBL1SXIxYQ9jz.jpg",
                "release_date": "2020-07-22",
                "title": "The King of Staten Island",
                "video": false,
                "vote_average": 7.018,
                "vote_count": 1067,
                "character": "Gina",
                "credit_id": "5d1c573e94d8a851623c6b2d",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Pam Adlon",
            "Pamela Segall",
            "Pam Segall",
            "Pamela Segall Adlon",
            "Pamela S. Adlon"
        ],
        "biography": "Pamela Adlon (née Segall; born July 9, 1966) is an American actress, voice actress, screenwriter, producer, director, and creator.\n\nShe voiced Bobby Hill on the animated comedy series King of the Hill (1997–2010), for which she won a Primetime Emmy Award, Ashley Spinelli on the animated comedy series Recess (1997–2003), and the title character from the Pajama Sam video game series. Her other voice work for cartoon series includes Bobby's World, Quack Pack, Jumanji (1996), Jungle Cubs, Recess, 101 Dalmatians: The Series, The Oblongs, Kid vs. Kat, Squirrel Boy, Pound Puppies, Bob's Burgers, Thundercats (2011), Rick and Morty, Big Mouth, and Human Resources. She provided the voice of Vidia in several Tinker Bell movies. She has also voiced for other animated movies including FernGully: The Last Rainforest, The Trumpet of the Swan and The Animatrix, as well as the movies from the TV cartoon series Recess.\n\nNotably, she provided the cry of Halley Wolowitz, Howard's daughter, which sounds near identical to the voice of Mrs. Wolowitz, Howard's mom, on The Big Bang Theory. She also provided the voice of Mrs Wolowitz on one episode of Young Sheldon.\n\nShe is known for her roles on the comedy-drama series Californication (2007–2014) and Louie (2010–2015), on which she was also a writer and producer. Since 2016, she has starred as Sam Fox on the FX comedy-drama series Better Things, which she also co-created, writes, produces and directs.\n\nHer movies include Say Anything..., The Adventures of Ford Fairlane, Bed of Roses, Sgt. Bilko, Bumblebee, and The King of Staten Island.",
        "birthday": "1966-07-09",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 21063,
        "imdb_id": "nm0781899",
        "known_for_department": "Acting",
        "name": "Pamela Adlon",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.8506,
        "profile_path": "/5eIRHUbNOH7ibXa0IfUfFvj5I5L.jpg"
    }
}