{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/iRB6VKJuFd88bk20hvLqlDzi4kP.jpg",
                "genre_ids": [
                    16,
                    10749,
                    18
                ],
                "id": 513347,
                "original_language": "zh",
                "original_title": "肆式青春",
                "overview": "The rigorous city life of China, while bustling and unforgiving, contains the everlasting memories of days past. Three stories told in three different cities, follow the loss of youth and the daunting realization of adulthood. Though reality may seem ever changing, unchangeable are the short-lived moments of one's childhood days. A plentiful bowl of noodles, the beauty of family and the trials of first love endure the inevitable flow of time, as three different characters explore the strength of bonds and the warmth of cherished memories. Within the disorder of the present world, witness these quaint stories recognize the comfort of the past, and attempt to revive the neglected flavors of youth.",
                "popularity": 2.4962,
                "poster_path": "/ueHeH5ergeHx27L4SCI9qlmwczA.jpg",
                "release_date": "2018-08-04",
                "title": "Flavors of Youth",
                "video": false,
                "vote_average": 6.873,
                "vote_count": 569,
                "character": "Xiao Ming (voice)",
                "credit_id": "5b71b7d392514168b610062b",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "坂 泰斗",
            "بان تایتو"
        ],
        "biography": "Taito Ban (坂 泰斗, Ban Taito, December 18, 1992) is a Japanese voice actor born in Fukuoka Prefecture who is affiliated with Office Osawa. Graduated from Pro-Fit Voice Actor Training Center, he was represented by Pro-Fit since April 2017 until he transferred to Office Osawa in January 2022 as the agency would end its talent management business in March 2022.",
        "birthday": "1992-12-18",
        "deathday": null,
        "gender": 2,
        "homepage": "https://osawa-inc.co.jp/men/bantaito/",
        "id": 2106489,
        "imdb_id": "nm9940378",
        "known_for_department": "Acting",
        "name": "Taito Ban",
        "place_of_birth": "Fukuoka, Japan",
        "popularity": 0.577,
        "profile_path": "/pSExEOVmjAujKUyJJJSxC1WEzOM.jpg"
    }
}