{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gheQryumBi4xF0giH9nLfdjvjjS.jpg",
                "genre_ids": [
                    10749,
                    18
                ],
                "id": 762975,
                "original_language": "en",
                "original_title": "Purple Hearts",
                "overview": "An aspiring musician agrees to a marriage of convenience with a soon-to-deploy Marine, but a tragedy soon turns their fake relationship all too real.",
                "popularity": 9.1613,
                "poster_path": "/4JyNWkryifWbWXJyxcWh3pVya6N.jpg",
                "release_date": "2022-07-29",
                "title": "Purple Hearts",
                "video": false,
                "vote_average": 8.07,
                "vote_count": 2743,
                "character": "Mila",
                "credit_id": "6270286ca24c5039390aa66d",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Kendall Chappelle "
        ],
        "biography": "Kendall Chappell was born in Ann Arbor, Michigan to elementary school teacher, Lauren Chappell, and business owner, Todd Chappell. She has two siblings, Kaylee, an illustrator, and Drew a scuba instructor.\n\nBefore Kendall became an actress, she stayed busy throughout high school swimming, running track, and played on the women's tennis team. Her summers were spent as a camp counselor at the Ann Arbor YMCA's Camp Algonquian, modeling for local photographers, and playing small roles in student and short films. Once accepted to the University of Michigan for a dual degree in Theater and Art & Design, she began to focus on acting and appeared in such feature length films as David Schwimmer's Trust (2010).\n\nThe summer after college, Kendall worked locally at a market and beer garden before moving to Los Angeles to pursue acting as a career. She immediately scored two lead roles in short films like Gisele (2014) which lead to future projects after receiving excellent feedback. Kendall continues to gain attention through her work and auditions which allows her to always have a project at hand.",
        "birthday": "1991-07-07",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.backstage.com/u/kendallchappell/",
        "id": 2108072,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Kendall Chappell",
        "place_of_birth": "Ann Arbor, Michigan",
        "popularity": 0.1175,
        "profile_path": "/uo7J9P2pFuKq1kuMt56QeQU37iX.jpg"
    }
}