{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dbztdWPy75hmCQeTylDLSM2smsi.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 10995,
                "original_language": "fr",
                "original_title": "L'Amant",
                "overview": "A poor French teenage girl engages in an illicit affair with a wealthy Chinese heir in 1920s Saigon. For the first time in her young life she has control, and she wields it deftly over her besotted lover throughout a series of clandestine meetings and torrid encounters.",
                "popularity": 4.6401,
                "poster_path": "/lgBGy8QaIFD9jQJWgi837czobEp.jpg",
                "release_date": "1992-01-22",
                "title": "The Lover",
                "video": false,
                "vote_average": 7.007,
                "vote_count": 723,
                "character": "Liner Pianist",
                "credit_id": "601df339544c410040fc852c",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Frédéric Auburtin (born 4 June 1962) is a French director, writer, actor and producer.\n\nFrédéric Auburtin was born and grew up in Marseille, where he studied music (piano, drums) and literature before turning to the cinema in the early 80s. He made his debut as an assistant director in the film Rouge midi, directed by Robert Guédiguian.\n\nIn the 80s and 90s he worked as an assistant director in several movies and with several directors, including Maurice Pialat (Under the Sun of Satan), Luigi Comencini (La Bohème), Richard Heffron (La Révolution française), Bertrand Blier (Merci la vie), Jean-Jacques Annaud (The Lover), Claude Berri (Germinal and Lucie Aubrac), Jean-Paul Rappeneau (The Horseman on the Roof) and Randall Wallace (The Man in the Iron Mask).\n\nIn 1999, he debuted as a director, co-directing Un pont entre deux rives with Gérard Depardieu, for which he also composed the soundtrack. During the 2000s he keep directing mostly for television, but also directed movies, including San-Antonio (2004) and Envoyés très spéciaux (2009). In 2006, he co-directed (again with Depardieu) the segment \"Quartier Latin\", written and starred by Gena Rowlands with Ben Gazzara and Gérard Depardieu, in the highly acclaimed movie Paris, je t'aime.\n\nIn 2014, he became widely known for directing the infamous movie United Passions. The film recounts the origins of the world-governing body of association football, Fédération Internationale de Football Association, and was ninety-percent funded by them. Released in North America at the peak of the scandals of the 2015 FIFA corruption case, the film grossed very badly in the box-office (a mere $918 in its opening weekend) and received overwhelming dislike from critics around the world. It's now considered one of the worst movies ever made and all the actors and Auburtin himself considered the film a \"disaster\".\n\nSource: Article \"Frédéric Auburtin\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1962-06-04",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 21126,
        "imdb_id": "nm0041474",
        "known_for_department": "Directing",
        "name": "Frédéric Auburtin",
        "place_of_birth": "Marseille, Bouches-du-Rhône, France",
        "popularity": 0.181,
        "profile_path": "/nm2dD0FP7Qq69u7sIWqhVPcGg4.jpg"
    }
}