{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fBvSfLetWlAMevQVHa0nBDV1Fon.jpg",
                "genre_ids": [
                    28,
                    53
                ],
                "id": 1572,
                "original_language": "en",
                "original_title": "Die Hard: With a Vengeance",
                "overview": "New York detective John McClane is back and kicking bad-guy butt in the third installment of this action-packed series, which finds him teaming with civilian Zeus Carver to prevent the loss of innocent lives. McClane thought he'd seen it all, until a genius named Simon engages McClane, his new \"partner\" -- and his beloved city -- in a deadly game that demands their concentration.",
                "popularity": 6.5824,
                "poster_path": "/buqmCdFQEWwEpL3agGgg2GVjN2d.jpg",
                "release_date": "1995-05-19",
                "title": "Die Hard: With a Vengeance",
                "video": false,
                "vote_average": 7.273,
                "vote_count": 6369,
                "character": "Jarvis",
                "credit_id": "52fe42ffc3a36847f803299b",
                "order": 35
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/4ppGUPBhWrMdYlIiJFmkplRQ9KJ.jpg",
                "genre_ids": [
                    10749,
                    18
                ],
                "id": 14533,
                "original_language": "en",
                "original_title": "Gia",
                "overview": "Gia Carangi meteorically rises to modeling fame in the late 1970s but becomes overconsumed by persistent loneliness and drug addiction.",
                "popularity": 2.5897,
                "poster_path": "/8KxvKGl8lQembejIadDP03qjEYT.jpg",
                "release_date": "1998-01-31",
                "title": "Gia",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 787,
                "credit_id": "52fe45fc9251416c75069441",
                "department": "Directing",
                "job": "Director"
            },
            {
                "adult": false,
                "backdrop_path": "/4ppGUPBhWrMdYlIiJFmkplRQ9KJ.jpg",
                "genre_ids": [
                    10749,
                    18
                ],
                "id": 14533,
                "original_language": "en",
                "original_title": "Gia",
                "overview": "Gia Carangi meteorically rises to modeling fame in the late 1970s but becomes overconsumed by persistent loneliness and drug addiction.",
                "popularity": 2.5897,
                "poster_path": "/8KxvKGl8lQembejIadDP03qjEYT.jpg",
                "release_date": "1998-01-31",
                "title": "Gia",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 787,
                "credit_id": "57809c95c3a368239e000154",
                "department": "Writing",
                "job": "Writer"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Michael Ivan Cristofer ",
            "Майкл Кристофер"
        ],
        "biography": "Michael Ivan Cristofer is an American playwright, filmmaker and actor. He received the Pulitzer Prize for Drama and the Tony Award for Best Play for The Shadow Box in 1977. He was awarded a Pulitzer Prize and an Antoinette Perry “Tony” Award for the Broadway production of his play, The Shadow Box. Subsequent to New York, the play was produced in every major American city and worldwide from Europe to the Far East.\n\nOther plays include Breaking Up at Primary Stages; Ice at Manhattan Theatre Club; Black Angel at Circle Repertory Company; The Lady and the Clarinet starring Stockard Channing, produced by the Mark Taper Forum, Long Wharf Theater, Off-Broadway and on the London Fringe, and Amazing Grace starring Marsha Mason which received the American Theater Critics Award as the best play produced in the United States during the 1996-97 season.\n\nHis film work includes the screenplays for The Shadow Box directed by Paul Newman (Golden Globe Award, Emmy nomination), Falling in Love, The Witches of Eastwick, The Bonfire of the Vanities, Breaking Up, and Casanova starring Heath Ledger. His directing credits include Gia starring Angelina Jolie, which was nominated for five Emmys and for which he won a Director’s Guild Award. He then directed Body Shots and Original Sin.\n\nFor eight years he worked as artistic advisor and finally co-artistic director of River Arts Repertory in Woodstock, New York, a company which produced new plays by writers such as Richard Nelson, Mac Wellman, Len Jenkin, Eric Overmeyer and many others. Also at River Arts, he wrote stage adaptations of the films Love Me or Leave Me and the legendary Casablanca, and directed Joanne Woodward in his own adaptation of Henrik Ibsen’s Ghosts. His most recent work for the theater, The Whore and Mr. Moore, is in workshop at the Actor’s Studio where he is a member.\n\nHe's had recurring roles as Truxton Spangler on AMC's Rubicon, as Jerry Rand on Smash, and as Phillip Price on Mr. Robot. His film roles include The Other Woman, Emoticon and The Adderall Diaries.",
        "birthday": "1945-01-22",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 21136,
        "imdb_id": "nm0188165",
        "known_for_department": "Acting",
        "name": "Michael Cristofer",
        "place_of_birth": "North Trenton, New Jersey, USA",
        "popularity": 0.2662,
        "profile_path": "/yWZr1U6A4UAatvgqvX1zmOgB92S.jpg"
    }
}