{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4ppGUPBhWrMdYlIiJFmkplRQ9KJ.jpg",
                "genre_ids": [
                    10749,
                    18
                ],
                "id": 14533,
                "original_language": "en",
                "original_title": "Gia",
                "overview": "Gia Carangi meteorically rises to modeling fame in the late 1970s but becomes overconsumed by persistent loneliness and drug addiction.",
                "popularity": 2.475,
                "poster_path": "/8KxvKGl8lQembejIadDP03qjEYT.jpg",
                "release_date": "1998-01-31",
                "title": "Gia",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 787,
                "character": "Therapist at Rehab",
                "credit_id": "643c956731d09b049e1cbfbc",
                "order": 35
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia.\n\nJoan Pringle (born June 2, 1945 in New York City, New York) is an American actress best known for playing vice principal \"Sybil Buchanan\" in the TV series The White Shadow. During the third and final season her character was promoted to principal. She also appeared in many TV shows ranging from The Waltons to Kojak.\n\nShe was married to fellow actor Theodore Wilson from January 1980 until his death in July 1991. She and Wilson co-starred in The White Shadow episode \"A Christmas Present\" and became engaged when the two were recurring characters on the ABC series That's My Mama.\n\nPringle starred as Ruth Marshall in the daytime drama Generations from 1989-1991 for NBC. Recent guest roles from film and television include Tyler Perry's Daddy's Girls and on Girlfriends as Carol Hart.\n\nShe also guest appeared in an episode of season 1 of Friends as Dr. Oberman in The One with the Sonogram at the End.\n\nJoan has since remarried to multi-media producer Vernon L. Bolling.\n\nDescription above from the Wikipedia article Joan Pringle, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1945-06-02",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 21144,
        "imdb_id": "nm0697824",
        "known_for_department": "Acting",
        "name": "Joan Pringle",
        "place_of_birth": "New York City, New York, U.S.",
        "popularity": 0.7923,
        "profile_path": "/3jhWnpiN1uZYtaCO7HUrqkKVwaP.jpg"
    }
}