{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/oWWsuxplpHdwxVw2u6f3dGLKcvC.jpg",
                "genre_ids": [
                    35,
                    10751,
                    10402
                ],
                "id": 830784,
                "original_language": "en",
                "original_title": "Lyle, Lyle, Crocodile",
                "overview": "When the Primm family moves to New York City, their young son Josh struggles to adapt to his new school and new friends. All of that changes when he discovers Lyle — a singing crocodile who loves baths, caviar and great music — living in the attic of his new home. But when Lyle’s existence is threatened by evil neighbor Mr. Grumps, the Primms must band together to show the world that family can come from the most unexpected places.",
                "popularity": 3.6191,
                "poster_path": "/dN6XnCEP3AO7N4XFOFyZ8V8kZF5.jpg",
                "release_date": "2022-10-07",
                "title": "Lyle, Lyle, Crocodile",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 621,
                "character": "Josh Primm",
                "credit_id": "614d394f88c6590066783476",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "윈슬로우 페글리",
            "溫斯洛·費格利",
            "温斯洛·费格雷"
        ],
        "biography": "Winslow was born into a family of actors: he is the son of actors Michael Fegley and Merce Tonne, and brother to actors August Fegley and Oakes Fegley.\n\nWinslow developed his skills in 2017 while starring in the stage production of A Billion Nights on Earth, a production he also added creative collaboration to, with avant-garde theatre director Thaddeus Phillips. The show was developed at the Buntport Theatre in Denver, CO, over the summer of 2017, then toured to sold out houses in Philadelphia in September 2017, and was featured as part of the Next Wave Festival at the Brooklyn Academy of Music in November that year, where it again sold out its run.\n\nIn 2018 Winslow landed his first television role, guest-starring on the hilarious TV-Land show Teachers. He then spent the spring filming 8 episodes of the Disney Channel series Fast Layne, as Mel (which debuted in 2019). After wrapping up on the limited series, he went directly into production in the title role of Timmy Failure: Mistakes Were Made directed by Academy Award-winner Tom McCarthy. It premiered at the Sundance Film Festival and then debuted in early 2020 as one of the first original features for the Disney+ streaming platform.\n\nIn the fall of 2018 Winslow co-starred in the Jacob Chase-helmed horror film Come Play, opposite Azhy Robertson and Gillian Jacobs (released fall 2020).\n\nIn 2019, he guest-starred as a preteen Sean in ABC's hit show The Good Doctor.\n\nIn the final months of 2020, Winslow returned to work filming Nightbooks, starring as Alex opposite Kristen Ritter and Lydia Jewett. The David Yarovesky-directed picture debuted in the Netflix Top 10 in the fall of 2021.\n\nIn the beginning of 2021, Winslow starred as Jake Doyle in what would be the HBO Max 2021 holiday hit 8-Bit Christmas with Neal Patrick Harris, Steve Zahn, and June Diane Raphael.",
        "birthday": "2009-01-23",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2115854,
        "imdb_id": "nm9121761",
        "known_for_department": "Acting",
        "name": "Winslow Fegley",
        "place_of_birth": "Allentown, Pennsylvania, USA ",
        "popularity": 0.2193,
        "profile_path": "/5f9dHDqrhDxxGLnfpt3nrOJUSqh.jpg"
    }
}