{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zeHB7aP46Xs3u4aFLuAq2GFeUGb.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 455207,
                "original_language": "en",
                "original_title": "Crazy Rich Asians",
                "overview": "An American-born Chinese economics professor accompanies her boyfriend to Singapore for his best friend's wedding, only to get thrust into the lives of Asia's rich and famous.",
                "popularity": 4.7521,
                "poster_path": "/1XxL4LJ5WHdrcYcihEZUCgNCpAW.jpg",
                "release_date": "2018-08-15",
                "title": "Crazy Rich Asians",
                "video": false,
                "vote_average": 7.063,
                "vote_count": 3804,
                "character": "Celine",
                "credit_id": "5b841f7a92514159dd043049",
                "order": 24
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "刘佳鎂",
            "刘佳镁",
            "Constance Lau",
            "Liu Jiamei"
        ],
        "biography": "Constance Lau is a theatre trained actor. She starred in her first movie titled \"Crazy Rich Asians\", playing the role of Celine Lim.\n\nA familiar face on TV and ATL media, Constance has acted in multiple TV commercials working with reputable brands such as Singtel and Marina Bay Sands. She has also starred in the local telemovie \"Love is Love; Sunrise\" playing the role of Shelley.\n\nWhilst pursuing her diploma in theatre, Constance worked concurrently as a radio presenter at local radio stations such as 98.7FM and Lush 99.5FM for two and a half years, where she hosted programs such as \"Say It With Music\" and \"The Evening Lush\".\n\nAs an emcee and interview host, she has hosted 'Meet and Greet' interviews with Korean celebrities like Kang Gary and Eric Nam.\n\nConstance has a fun loving and adventurous personality who embraces the thrill of trying new things.\n\nConstance loves being outdoors and learning about different cultures. When she's taking a break from work, she enjoys travelling to explore new places. She strongly believes travelling helps to open one's mind, and in turn gives one a fresh appreciation for Singapore, her hometown.",
        "birthday": "1991-04-08",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 2116402,
        "imdb_id": "nm8202582",
        "known_for_department": "Acting",
        "name": "Constance Lau",
        "place_of_birth": "Singapore",
        "popularity": 0.0495,
        "profile_path": "/jWQZ61cCrLRMn1FVOO1pLZRLNVw.jpg"
    }
}