{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kVd3a9YeLGkoeR50jGEXM6EqseS.jpg",
                "genre_ids": [
                    16,
                    28,
                    12,
                    878
                ],
                "id": 569094,
                "original_language": "en",
                "original_title": "Spider-Man: Across the Spider-Verse",
                "overview": "After reuniting with Gwen Stacy, Brooklyn’s full-time, friendly neighborhood Spider-Man is catapulted across the Multiverse, where he encounters the Spider Society, a team of Spider-People charged with protecting the Multiverse’s very existence. But when the heroes clash on how to handle a new threat, Miles finds himself pitted against the other Spiders and must set out on his own to save those he loves most.",
                "popularity": 19.881,
                "poster_path": "/8Vt6mWEReuy4Of61Lnj5Xj704m8.jpg",
                "release_date": "2023-05-31",
                "title": "Spider-Man: Across the Spider-Verse",
                "video": false,
                "vote_average": 8.341,
                "vote_count": 7888,
                "character": "Malala Windsor: Spider-UK (voice)",
                "credit_id": "647993bdcaef2d00df87b453",
                "order": 35
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Sofia Stuart",
            "Sofia Beatrice Barclay",
            "سوفیا بارکلی"
        ],
        "biography": "Sofia Beatrice Barclay (born 31 August 1988) is an English actress. Barclay was born in central London with her twin brother. She is the daughter of Ferzana and Aidan Barclay, and the granddaughter of Sir David Barclay. Barclay attended Westminster School. She took classes at the Square Theatre School in New York. Initially credited as Sofia Stuart, Barclay began her career in theatre. She played Desmonda in the 2012 Jack Studio Brockley production of Othello and went on the 2014 tour with The Two Worlds of Charlie F. She had further theatre roles as Anna in Future Conditional at the Old Vic in 2015 and Nathalie in Mosquitoes at the National Theatre in 2017. In 2018 and 2019, Barclay played Selina in the BBC Two legal sitcom Defending the Guilty and Alisha in the Hampstead Theatre production of Everyday I Make Greatness Happen, had a small role in the film In Darkness, and was cast as Adela Zal in a pilot for a potential NYPD Blue spin-off series on ABC. She then appeared in Julian Jarrold's Sulphur and White.\n\nBarclay had recurring roles as Zarina in the 2021 Channel 4 sitcom We Are Lady Parts and Dr Sullivan, Roy Kent's (Brett Goldstein) sister in the second and third seasons of the Apple TV+ sports comedy Ted Lasso. She originated the role of Maya in The Collaboration at the Young Vic in 2022. The following year, she played Suzy Ray in the romantic comedy Love Again and voiced Malala Windsor (Spider-UK) for the Marvel animated sequel Spider-Man: Across the Spider-Verse. In July 2024, it was announced Barclay would star opposite Leo Suter in a Lynley revival for BBC One and BritBox. She also played Safiya Zamil in the Apple TV+ thriller Prime Target.",
        "birthday": "1988-08-31",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.42mp.com/talent/sofia-barclay",
        "id": 2119084,
        "imdb_id": "nm6220968",
        "known_for_department": "Acting",
        "name": "Sofia Barclay",
        "place_of_birth": "London, England, UK",
        "popularity": 0.7538,
        "profile_path": "/9xL6keqdxerkEJ59dklSqUoMDrK.jpg"
    }
}