{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fO0qXJnBJYuWJ5dvWWGXfRF8MXA.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 382591,
                "original_language": "fr",
                "original_title": "Demain tout commence",
                "overview": "A man without attachments or responsibilities suddenly finds himself with an abandoned baby and leaves for London to try and find the mother. Eight years later after he and his daughter become inseparable Gloria's mother reappears.",
                "popularity": 3.279,
                "poster_path": "/aFgtdhuzgI2eqnIVWtRB03x3pnt.jpg",
                "release_date": "2016-12-07",
                "title": "Two Is a Family",
                "video": false,
                "vote_average": 7.737,
                "vote_count": 3008,
                "character": "Waiter at the party",
                "credit_id": "58ef8dbd925141420200ed7e",
                "order": 25
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Ruben Alves (born 9 January 1980) is a French-Portuguese actor, screenwriter and film director of Portuguese ancestry. He is best known for The Gilded Cage which he wrote and directed.\n\nAlves was born the son of Portuguese guest workers in Paris. At 20, he became a full-time actor and initially played minor roles in French television productions and in some short films.\n\nHis directorial debut, apart from a short film in 2002 'À l'abri des regards indiscrets', was in 2013 with the immigrant comedy La cage dorée. The film was inspired by his parents' biography, and Alves has a small guest role in the film as 'Miguel'. The movie has been a great success in France and Portugal, and has also been followed by a number of other countries, including Australia. In Portugal, it became in 2013 the most watched film of the year, with 755 000 viewings. In Germany he came as Portugal, mon amour in the cinemas. The film had 1.2m spectators in France and sold well internationally.\n\nThen Alves played in 2014 in Yves Saint Laurent, a biopic about the life of the fashion designer Yves Saint Laurent.\n\nIn 2017, he directed a documentary As Vozes do Fado (or \"The Voices of Fado\") with Christophe Fonseca, screened at the Le Lincoln Cinema, Paris. A cd \"Amália: Vozes do Fado\" was released later, a homage to Amália Rodrigues, a Fado singer.\n\nIn 2018, he started working on an upcoming comedy called Miss, by producer-director Hugo Gelin with co-star model Alex Wetter as a young man who sets his heart on winning the Miss France contest.\n\nIn 2017, he currently lives in Bairro Alto, Lisbon, where he used to take holidays when living in Paris.\n\nSource: Article \"Ruben Alves\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1980-01-09",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 212080,
        "imdb_id": "nm0023517",
        "known_for_department": "Acting",
        "name": "Ruben Alves",
        "place_of_birth": "Paris, France",
        "popularity": 0.8225,
        "profile_path": "/cQYmBoS9VOIF9cTZRq0nX0dHRWr.jpg"
    }
}