{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jOncZUo1ce3cOgBWPvnmpilzFUu.jpg",
                "genre_ids": [
                    35
                ],
                "id": 37653,
                "original_language": "fr",
                "original_title": "Les Trois Frères",
                "overview": "Three half-brothers are reunited at their mother's funeral. After being told of their inheritance they quickly spend the money, only to find out that they will not receive it after all. The men grow closer while deciding how to proceed.",
                "popularity": 2.0171,
                "poster_path": "/nPrUw2hLIt9uWrGwfKjr0AbGWgd.jpg",
                "release_date": "1995-12-13",
                "title": "The Three Brothers",
                "video": false,
                "vote_average": 6.945,
                "vote_count": 772,
                "character": "Le présentateur du Millionnaire",
                "credit_id": "654f2bed29383543f0b6b4d4",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jacky Nersessian",
            "Jackie Nercessian",
            "Jean-Patrick Narcisso"
        ],
        "biography": "Jacky Nercessian (or Nersessian (Armenian: Ժաքի Ներսեսյան), born November 16, 1950) is a French actor who is ethnically Armenian. One of his most known roles is Apkar in Mayrig by Henri Verneuil.\n\nNercessian was born in 1950 in Saint-Etienne. He graduated from the Department of Theology to become a Pastor in England. He has played both in cinema and TV – including the role of Mustafa Ismael Faruki in Long Journey (Golden Lion for the Best Feature Film, Venice IFF, 2004). Nercessian played in the Theatre of Renaissance for one season and later toured with the Last Call. In 2009 he starred in Everybody Loves Juliet at Splendid Theatre. In 2010, he appeared in Luc Besson’s blockbuster Extraordinary Adventures of Adèle Blanc-Sec.\n\nSource: Article \"Jacky Nercessian\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1950-11-16",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 212083,
        "imdb_id": "nm0626158",
        "known_for_department": "Acting",
        "name": "Jacky Nercessian",
        "place_of_birth": "Saint-Étienne, Loire, France",
        "popularity": 0.1182,
        "profile_path": "/mAOpMZqZ8Yj9ue3kPBoJYXPExzT.jpg"
    }
}