{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/aDKuDfEAYa2VENKd155D4ZoAl7c.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 48034,
                "original_language": "fr",
                "original_title": "Les Petits Mouchoirs",
                "overview": "Despite a traumatic event, a group of friends decide to go ahead with their annual beach vacation. Their relationships, convictions, sense of guilt and friendship are sorely tested. They are finally forced to own up to the little white lies they've been telling each other.",
                "popularity": 1.7512,
                "poster_path": "/djypJtQfUxeEMh6kc0aRzIoN9UR.jpg",
                "release_date": "2010-10-20",
                "title": "Little White Lies",
                "video": false,
                "vote_average": 7.109,
                "vote_count": 1588,
                "character": "Serveur hôtel Max",
                "credit_id": "5907f38b925141646c005396",
                "order": 26
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Benoît Petitjean (born in 1982) is a French actor and a horse rider.\n\nHe is a theatre and cinema actor, he initially trained under René Simon and completed several internships with director Jean Périmony to develop his acting skills. In 2005, he acted on the stage, in the play Grosse chaleur directed by Patrice Leconte. He was cast in several more roles in the 2000s. He then played in writer Feydeau's comic play L'Âge d'Or, directed in 2003 by Chantal Brière. In 2004, he played Hédiard in the musical Grosse Chaleur (Heat Wave), written by Laurent Ruquier. The young actor performs with Annick Alane, Catherine Arditi and Pierre Bénichou at the Théâtre de la Renaissance, Paris.\n\nHe has also acted in a few TV films, such as Préjudices, by Frédéric Berthe in 2006, also La nouvelle Clara and Chat bleu, chat noir, by Jean-Louis Lorenzi in 2006. In the cinema, the actor is noticed in the dramatic comedy Enfin veuve (Finally widow) by Isabelle Mergault. In 2008, he returned to the stage, notably to Bouffes Parisiens in Open Bed, directed by Charlotte de Turckheim.\n\nHe was in a Civil solidarity pact with French television presenter Laurent Ruquier until 2018.\n\nSource: Article \"Benoît Petitjean\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1982-01-21",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 212112,
        "imdb_id": "nm2346682",
        "known_for_department": "Acting",
        "name": "Benoît Petitjean",
        "place_of_birth": "Paris, France",
        "popularity": 0.0297,
        "profile_path": "/557K2019GHA0EV0MToULCzMeyyv.jpg"
    }
}