{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/umtxTkop7Ec9UFynjB7Z53lmkX1.jpg",
                "genre_ids": [
                    18,
                    10402
                ],
                "id": 1677,
                "original_language": "en",
                "original_title": "Ray",
                "overview": "Born on a sharecropping plantation in Northern Florida, Ray Charles went blind at seven. Inspired by a fiercely independent mom who insisted he make his own way, He found his calling and his gift behind a piano keyboard. Touring across the Southern musical circuit, the soulful singer gained a reputation and then exploded with worldwide fame when he pioneered coupling gospel and country together.",
                "popularity": 3.6721,
                "poster_path": "/tSPC7sO2XYNL9QcMmK88tuUALL5.jpg",
                "release_date": "2004-10-29",
                "title": "Ray",
                "video": false,
                "vote_average": 7.45,
                "vote_count": 2088,
                "character": "Mercedes",
                "credit_id": "57d1edb6c3a3684716000119",
                "order": 23
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Miss Dupree",
            "Ms. Dupree ",
            "Jedda 'Ms. Dupree' Jones",
            "Jedda Jones-Richards"
        ],
        "biography": "Comedian and actress Jedda Jones was born on August 8, 1952 in New Orleans, Louisiana to Audrey Lieteau and Louis J. White. She graduated from Xavier University Preparatory School in New Orleans, Louisiana in 1970 and received her B.A. degree from Tulane University in New Orleans, Louisiana in 1974.\n\nAfter graduation, Jones was recruited to work at Bell South in New Orleans. She was later promoted to manager and remained in that position for ten years. She left Bell South in 1985, and moved to New York to pursue a career in standup comedy. During this period, Jones also worked as a writer and wrote monologues and speeches for actress and comedian Marsha Warfield. She served as the head writer for two seasons of The Martha Warfield Show. Jones later appeared on The Sunday Comics television program on Fox and was a featured performer at Montreal’s Just For Laughs Comedy Festival. Jones made her television acting debut on the series New Attitude, in the role of Celina. In 1991, Jones was featured in Whoopi Goldberg’s HBO show Chez Whoopi. That same year, she portrayed Rubie Lin in the film Talkin’ Dirty After Dark and appeared as Sadie in the film Shattered, starring Tom Berenger and Bob Hoskins. In 1993, Jones was cast in Indecent Proposal, starring Woody Harrelson and Demi Moore. She also appeared in the film CB4 with Chris Rock and had a recurring role as Mrs. Lawrence in the series Tall Hopes. The following year, Jones had appearances on the television series Murphy Brown and Coach. From 1994 to 1998, Jones had two recurring roles in the television series Sister, Sister as Charlotte and Marjorie. In 1998, Jones appeared in Warren Beatty’s Bulworth starring Halle Berry. She was later cast in the role of Agnes in the film Catfish in Black Bean Sauce in 2000. In 2004, Jones portrayed Mercedes in Ray, starring Jamie Foxx as Ray Charles. The next year, she was cast in the film Treasure n tha Hood as Ms. Minne and made several recurring appearances as Miss Dupree on The Tom Joyner Show. In 2009, Jones was featured in the films The Final Destination and Bad Lieutenant: Port of Call New Orleans. Two years later, she was cast in the film Snatched.",
        "birthday": "1952-08-08",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 21249,
        "imdb_id": "nm0428332",
        "known_for_department": "Acting",
        "name": "Jedda Jones",
        "place_of_birth": "New Orleans, Louisiana, USA",
        "popularity": 0.1421,
        "profile_path": "/160fKIKu2R7pnLZQKk4CNwFjRDj.jpg"
    }
}