{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rKe3MR2u4ZZ0y9uKivzKJRrqBCe.jpg",
                "genre_ids": [
                    18,
                    10402
                ],
                "id": 537116,
                "original_language": "en",
                "original_title": "tick, tick... BOOM!",
                "overview": "On the brink of turning 30, a promising theater composer navigates love, friendship and the pressure to create something great before time runs out.",
                "popularity": 2.7737,
                "poster_path": "/DPmfcuR8fh8ROYXgdjrAjSGA0o.jpg",
                "release_date": "2021-11-11",
                "title": "tick, tick... BOOM!",
                "video": false,
                "vote_average": 7.617,
                "vote_count": 2182,
                "character": "Aspiring Composers and Lyricists",
                "credit_id": "61986677abdafc008f42b56b",
                "order": 78
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/bX5UVSVDOcuFMJh2zWN6gXbKswM.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 2056,
                "original_language": "en",
                "original_title": "The Station Agent",
                "overview": "When his only friend dies, a man born with dwarfism moves to rural New Jersey to live a life of solitude, only to meet a chatty hot dog vendor and a woman dealing with her own personal loss.",
                "popularity": 3.59,
                "poster_path": "/kjJg6eJa9I9flfHaJG67ecEv8YX.jpg",
                "release_date": "2003-12-05",
                "title": "The Station Agent",
                "video": false,
                "vote_average": 7.357,
                "vote_count": 717,
                "credit_id": "52fe4330c3a36847f8041295",
                "department": "Sound",
                "job": "Original Music Composer"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Stephen R. Schwartz"
        ],
        "biography": "Stephen Trask is an American musician and composer who graduated from Wesleyan University. He was the music director and house band member at the NYC club Squeezebox, where they performed with stars such as Debbie Harry, Lene Lovich and Joey Ramone.\n\nTrask composed the music and lyrics for the stage musical Hedwig and the Angry Inch (also a 2001 film), about a struggling rock star named Hedwig. Trask's real-life band Cheater performed as Hedwig's band \"The Angry Inch\". He received an Obie Award for the play and a Grammy Award nomination for the movie.\n\nIn 2014, the show saw its first Broadway incarnation, opening that April at the Belasco Theatre and winning the year's Tony Award for Best Revival of a Musical. The production closed on September 13, 2015. A national tour of the show began at San Francisco's Golden Gate Theatre on October 2, 2016.\n\nTrask has worked on five films with filmmaker Paul Weitz. He composed the score for 2004's In Good Company and 2006's American Dreamz, for which they also co-wrote the numerous songs the contestants sing, as well as the 2009 film Cirque du Freak: The Vampire's Assistant. Trask also scored the 2003 films Camp and The Station Agent, as well as Dreamgirls (2006), In the Land of Women (2007), The Savages (2007), and The Back-up Plan (2010), among other works. He scored the 2010 film Little Fockers, a sequel to both Meet the Parents (2000) and Meet the Fockers (2004). In 2013, Trask scored the films Lovelace, directed by Rob Epstein and Jeffery Friedman, and Admission, directed by Paul Weitz.\n\nImdb & Wikipedia mini bio by; yusufpiskin",
        "birthday": "1966-08-29",
        "deathday": null,
        "gender": 3,
        "homepage": "https://stephentrask.com/",
        "id": 21266,
        "imdb_id": "nm0871136",
        "known_for_department": "Sound",
        "name": "Stephen Trask",
        "place_of_birth": "  United States",
        "popularity": 0.0486,
        "profile_path": "/yAMFPbSwLxOezA6Lv9vfFXkI8PB.jpg"
    }
}