{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cemjdP7HrUyJAry85vRT19Hidbi.jpg",
                "genre_ids": [
                    27
                ],
                "id": 138,
                "original_language": "en",
                "original_title": "Dracula",
                "overview": "British estate agent Renfield travels to Transylvania to meet the mysterious Count Dracula, who is interested in leasing a castle in London. After Dracula enslaves Renfield and drives him to insanity, the pair sail to London together and Dracula, a secret vampire, begins preying on London socialites.",
                "popularity": 2.612,
                "poster_path": "/ueVSPt7vAba0XScHWTDWS5tNxYX.jpg",
                "release_date": "1931-02-12",
                "title": "Dracula",
                "video": false,
                "vote_average": 7.153,
                "vote_count": 1286,
                "character": "Doctor Seward",
                "credit_id": "52fe421dc3a36847f8005005",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Herbert Bunston (15 April 1874 – 27 February 1935) was an English stage and screen actor. He is remembered for his role as Dr. John Seward in the Broadway and film versions of Dracula.\n\nBunston was born in Charmouth and briefly attended Cranleigh School in Surrey before working as an actor. Bunston emigrated to the United States in 1922. His first Broadway appearance was Arthur Wing Pinero's The Enchanted Cottage in 1923. Other short-running roles in That Awful Mrs. Eaton! and Simon Called Peter were followed by a critically noticed role in a run of 260 performances of 1925's Young Woodley. On October 5, 1927, Bunston debuted as Dr John Seward in a Broadway production of Dracula alongside Bela Lugosi.\n\nBunston's other Broadway credits include Young Woodley (1925), Simon Called Peter (1924), That Awful Mrs. Eaton (1924), The Enchanted Cottage (1923), and Drink (1903).\n\nBunston's stage success led to a contract with Metro-Goldwyn-Mayer. Between 1929 and 1935 he had mainly character roles in over 30 films, and 1931 he re-created his Broadway role in the film adaptation of Dracula. Bunston married Emily Fox Chaffey (1866-1939) in 1898 and they had two children, Margaret, and John. Bunston died of a heart attack on February 27, 1935.",
        "birthday": "1874-04-15",
        "deathday": "1935-02-27",
        "gender": 2,
        "homepage": null,
        "id": 2126,
        "imdb_id": "nm0120557",
        "known_for_department": "Acting",
        "name": "Herbert Bunston",
        "place_of_birth": "Dorset, England, UK",
        "popularity": 0.3684,
        "profile_path": "/whHeDLpLArkSgxHzZyVbGEfcJNK.jpg"
    }
}