{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/pbm04tWNa8MkbPqJ33yrGVXTWAl.jpg",
                "genre_ids": [
                    18,
                    36,
                    80,
                    53,
                    28
                ],
                "id": 9829,
                "original_language": "en",
                "original_title": "United 93",
                "overview": "A real-time account of the events on United Flight 93, one of the planes hijacked on 9/11 that crashed near Shanksville, Pennsylvania when passengers foiled the terrorist plot.",
                "popularity": 4.4442,
                "poster_path": "/r3mdSgsnpoi4UiUufdybhjha68t.jpg",
                "release_date": "2006-04-28",
                "title": "United 93",
                "video": false,
                "vote_average": 7.102,
                "vote_count": 1559,
                "character": "Mark Bingham",
                "credit_id": "5a03390f92514111af01db64",
                "order": 20
            },
            {
                "adult": false,
                "backdrop_path": "/wWLUUGtemgrRyH24v8lAkSR58US.jpg",
                "genre_ids": [
                    10751,
                    10770,
                    12,
                    14
                ],
                "id": 506574,
                "original_language": "en",
                "original_title": "Descendants 3",
                "overview": "The teenagers of Disney's most infamous villains return to the Isle of the Lost to recruit a new batch of villainous offspring to join them at Auradon Prep.",
                "popularity": 5.579,
                "poster_path": "/7IRy0iHdaS0JI3ng4ZYlk5gLSFn.jpg",
                "release_date": "2019-08-02",
                "title": "Descendants 3",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 1570,
                "character": "Hades",
                "credit_id": "5d408965b87aec2c3d3ee39a",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Cheyenne Jackson (born July 12, 1975) is an American actor and singer. He started in regional theater when he moved to Seattle, and after moving to New York City, made his 2002 Broadway theatre debut understudying both male leads in the Tony Award-winning musical Thoroughly Modern Millie. In 2005, he originated his first Broadway leading role in All Shook Up earning him a Theatre World Award for \"Outstanding Broadway Debut\".\n\nIn films, Jackson portrayed 9/11 victim and hero Mark Bingham in the 2006 Academy Award nominated United 93 which earned him the Boston Society of Film Critics 2006 award for \"Best Ensemble Cast\". He has also appeared in the films Curiosity (2005), Hysteria (2010), The Green (opposite Julia Ormond and Illeana Douglas), and Price Check (with Parker Posey).\n\nOn television, he was a recurring series regular on NBC's 30 Rock, portraying Danny Baker, and on Fox's Glee as Vocal Adrenaline coach Dustin Goolsby. He has also guest starred on several series including Curb Your Enthusiasm, Lipstick Jungle, Life on Mars, Law & Order, and Ugly Betty. In 2008, Jackson played series lead Sebastian Kinglare for the Lifetime Television pilot Family Practice opposite Anne Archer and Beau Bridges. He has a starring role alongside Mayim Bialik in the sitcom Call Me Kat (2021).\n\nJackson has starred in several notable webisode series and in 2009 starred in a sold out one man show, \"Back to the Start.\" In 2008, he was named Out magazine's Entertainer of the year. He is an international ambassador for amfAR (The Foundation for AIDS Research) and a national ambassador and spokesperson for The Hetrick-Martin Institute.",
        "birthday": "1975-07-12",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 212828,
        "imdb_id": "nm2091145",
        "known_for_department": "Acting",
        "name": "Cheyenne Jackson",
        "place_of_birth": "Newport, Washington, USA",
        "popularity": 0.3608,
        "profile_path": "/o1yZF6R450iIpl4kZK0YEgm3mCj.jpg"
    }
}