{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ml8YBTJq7UkALfI022FWscCQuQW.jpg",
                "genre_ids": [
                    14,
                    35,
                    10751
                ],
                "id": 642885,
                "original_language": "en",
                "original_title": "Hocus Pocus 2",
                "overview": "29 years since the Black Flame Candle was last lit, the 17th-century Sanderson sisters are resurrected, and they are looking for revenge. Now it's up to three high school students to stop the ravenous witches from wreaking a new kind of havoc on Salem before dawn on All Hallow's Eve.",
                "popularity": 6.1416,
                "poster_path": "/7ze7YNmUaX81ufctGqt0AgHxRtL.jpg",
                "release_date": "2022-09-27",
                "title": "Hocus Pocus 2",
                "video": false,
                "vote_average": 7.187,
                "vote_count": 1747,
                "character": "Cassie",
                "credit_id": "616ca2e41089ba0044c29a09",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "莉莉亚·白金汉"
        ],
        "biography": "Lilia Buckingham (born April 9, 2003) is an American Internet personality, actress, dancer, author, and producer.\n\nBuckingham began acting in local musical theatre productions at a young age. She competitively danced with the MNR Dance Factory, where she met and befriended Mackenzie and Maddie Ziegler and began to grow her online platform. Together with her older brother Jack, they co-founded anti-cyberbullying organization Positively Social.\n\nBuckingham made her television debut in 2012 with a minor role in an episode of Modern Family. She began working with Brat in 2018, starring as Autumn Miller on the web series Dirt. The character has also made appearances in other series such as Chicken Girls, Total Eclipse and Zoe Valentine, as well as the 2019 Brat film Spring Breakaway. She also made several appearances on the network's talk show, Brat Chat.\n\nIn November 2018, Buckingham and Emily Skinner released a single, \"Denim Jacket\", and donated a portion of the proceeds to GLAAD.\n\nBuckingham voices Heather Masterson, the epistolary narrator of Brat series Crown Lake, which she co-produces with Sara Shepard. Her other filmmaking work includes directing and producing a music video for Jillian Shea Spaeder's 2019 single \"Something Better\", which received accolades at a number of film festivals. She and Spaeder, her then-girlfriend, wrote and starred in the short film Pink.\n\nBuckingham and Shepard went on to co-author a young adult novel, Influence, about the world of social media influencers.\n\nIn 2022, Buckingham starred in Meet Cute's series, A Pool For Love. The story is set at a public pool in Florida where Buckingham's character, Jordan, is the new head lifeguard. Marissa, the new girl on the block, joins the lifeguard team and turns Jordan's summer into chaos as she starts to explore her own sexuality and grow feelings for Marissa.",
        "birthday": "2003-04-09",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 2129491,
        "imdb_id": "nm5339815",
        "known_for_department": "Acting",
        "name": "Lilia Buckingham",
        "place_of_birth": "Beverly Hills, California, USA",
        "popularity": 0.2407,
        "profile_path": "/orShxWj84XBVW4zEMoNkYaVsnc5.jpg"
    }
}