{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cvq9cRMDJIGzNpHaPVGFftqPcLj.jpg",
                "genre_ids": [
                    878,
                    53
                ],
                "id": 206487,
                "original_language": "en",
                "original_title": "Predestination",
                "overview": "Predestination chronicles the life of a Temporal Agent sent on an intricate series of time-travel journeys designed to prevent future killers from committing their crimes. Now, on his final assignment, the Agent must stop the one criminal that has eluded him throughout time and prevent a devastating attack in which thousands of lives will be lost.",
                "popularity": 5.1957,
                "poster_path": "/38Xr1JnV1ZcLQ55zmdSp6n475cZ.jpg",
                "release_date": "2014-08-28",
                "title": "Predestination",
                "video": false,
                "vote_average": 7.424,
                "vote_count": 6752,
                "character": "Mrs. Stapleton",
                "credit_id": "52fe4d1fc3a368484e1d81d3",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "After commencing a university degree in Law, Madeleine caught the irrepressible acting bug and decided to defer her studies indefinitely. From an early age Madeleine has shown a flair for the arts, performing in front of family and friends at any given opportunity. Her talent for acting was rewarded in 1992 with entry into the NSW Talented Child Drama Ensemble, and has since been honed through years of study at such institutions as Swinburne University, Tamworth Conservatorium of Music and Riverina Drama Ensemble. She has also undertaken short courses at the highly esteemed NIDA, along with courses in Voice, Movement, Drama and musical theatre at various ensembles both in Victoria and interstate. In 1999 Madeleine was awarded the 'Be Your Best' Performance Scholarship from the Australian Drug Foundation. While Neighbours is her first full time television role, Madeleine's amateur theatre credits include Arsenic and Old Lace, Night Reflections, Theatre in the Raw, After Midnight Before Dawn, Bye Bye Birdie, None the Wiser, and Snow Queen among several others. Also a trained singer and dancer, Madeleine is looking forward to refining her craft on Australia's longest-running series, Neighbours.",
        "birthday": "1979-07-26",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 213144,
        "imdb_id": "nm0922210",
        "known_for_department": "Acting",
        "name": "Madeleine West",
        "place_of_birth": "Melbourne, Victoria, Australia",
        "popularity": 0.1768,
        "profile_path": "/buJ3lN6iDQBuuP9FwGgpT9WQxLt.jpg"
    }
}