{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dTGECn8He16tZeBHQTLf6rVydE8.jpg",
                "genre_ids": [
                    80,
                    53,
                    18
                ],
                "id": 302946,
                "original_language": "en",
                "original_title": "The Accountant",
                "overview": "As a math savant uncooks the books for a new client, the Treasury Department closes in on his activities and the body count starts to rise.",
                "popularity": 8.5578,
                "poster_path": "/fceheXB5fC4WrLVuWJ6OZv9FXYr.jpg",
                "release_date": "2016-10-13",
                "title": "The Accountant",
                "video": false,
                "vote_average": 7.129,
                "vote_count": 6974,
                "character": "French Bully (uncredited)",
                "credit_id": "56ad847ec3a3681c3b007fb4",
                "order": 57
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Daeg N. Faerch",
            "Daeg Neergaard Faerch",
            "Great Daeg"
        ],
        "biography": "Daeg Neergaard Faerch (born September 27, 1995), also known as GreatDaeg, is an American actor. He is perhaps best known for his portrayal of young Michael Myers in Rob Zombie's horror remake Halloween (2007). Faerch has also played in theatrical productions of Grapes of Wrath in which he played the role of Winfield, Marat/Sade in which he played the role of young Herald, Waiting for Godot playing the messenger, and Shakespeare Unabridged as a musical guest. He has performed in multiple Shakespeare productions, including Coriolanus, in which he played young Coriolanus, The Merry Wives of Windsor, and Hamlet. He also landed the role of Pincegurre in the French play L'Impromptu de Théophile, as well as a role in the comedy The Nerd, in which he played the character Thor Waldgrave. In addition to English, Faerch speaks French. More recently on YouTube Faerch has embarked on a career as a rapper; his albums include Stunt from the 6 (2018), Vlad (2019), Albino Animal (2019), Quarantime (2020), Wicked Wicked West (2020), and Pieces (2020).\n\nDescription above from the Wikipedia article Daeg Faerch, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1995-09-27",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 21317,
        "imdb_id": "nm1698761",
        "known_for_department": "Acting",
        "name": "Daeg Faerch",
        "place_of_birth": "San Diego, California, USA",
        "popularity": 0.8034,
        "profile_path": "/hXO449dEfMEJi8HOciQIKIqAmQr.jpg"
    }
}