{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yY76zq9XSuJ4nWyPDuwkdV7Wt0c.jpg",
                "genre_ids": [
                    28,
                    53,
                    878
                ],
                "id": 577922,
                "original_language": "en",
                "original_title": "Tenet",
                "overview": "Armed with only one word - Tenet - and fighting for the survival of the entire world, the Protagonist journeys through a twilight world of international espionage on a mission that will unfold in something beyond real time.",
                "popularity": 9.5361,
                "poster_path": "/aCIFMriQh8rvhxpN1IWGgvH0Tlg.jpg",
                "release_date": "2020-08-22",
                "title": "Tenet",
                "video": false,
                "vote_average": 7.175,
                "vote_count": 10477,
                "character": "Toby (uncredited)",
                "credit_id": "64bb85fee9da69012e0d7861",
                "order": 40
            },
            {
                "adult": false,
                "backdrop_path": "/ciKBP3tgzUxp7sHFNZxofBXUS8k.jpg",
                "genre_ids": [
                    28,
                    27,
                    53
                ],
                "id": 602223,
                "original_language": "en",
                "original_title": "The Forever Purge",
                "overview": "All the rules are broken as a sect of lawless marauders decides that the annual Purge does not stop at daybreak and instead should never end as they chase a group of immigrants who they want to punish because of their harsh historical past.",
                "popularity": 7.1296,
                "poster_path": "/lB068qa6bQ0QKYKyC2xnYGvYjl7.jpg",
                "release_date": "2021-06-30",
                "title": "The Forever Purge",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 2581,
                "character": "NFFA Soldier (uncredited)",
                "credit_id": "5f3d43f1afe22400336f1e15",
                "order": 12
            },
            {
                "adult": false,
                "backdrop_path": "/2vq5GTJOahE03mNYZGxIynlHcWr.jpg",
                "genre_ids": [
                    18,
                    28,
                    36
                ],
                "id": 359724,
                "original_language": "en",
                "original_title": "Ford v Ferrari",
                "overview": "American car designer Carroll Shelby and the British-born driver Ken Miles work together to battle corporate interference, the laws of physics, and their own personal demons to build a revolutionary race car for Ford Motor Company and take on the dominating race cars of Enzo Ferrari at the 24 Hours of Le Mans in France in 1966.",
                "popularity": 13.8559,
                "poster_path": "/dR1Ju50iudrOh3YgfwkAU1g2HZe.jpg",
                "release_date": "2019-11-13",
                "title": "Ford v Ferrari",
                "video": false,
                "vote_average": 8.007,
                "vote_count": 8493,
                "character": "Shelby Pit Smokey",
                "credit_id": "600cfa66006eee003c817dab",
                "order": 77
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Mark"
        ],
        "biography": "Mark Krenik was born to parents Bob and Rose and is the second oldest of 5 boys and one girl. A country boy, he grew up with a chainsaw in one hand and a gun in the other. Being the crazy \"Shark\", Northern California just seemed to small for him. At the young age of 19, Mark decided to join the United States Navy where there would be adventure around every corner. He served proudly for 6 yrs. During his service, he visited 35 Countries and was exceeding the training to become Americas finest war machine, a Navy Seal. In the Active Reserves and working three other jobs, Thyssen Steel, Model for Body Glove, Head Bouncer at El Paso Cantina, and earning extra money by Dancing against the Chippendales, Mark breathed his last one night at the age of twenty-five. Cardiac arrest. In the Veterans Hospital on his deathbed, Mark called out to GOD for a second chance. Doctors in bewilderment stepped back as Mark got up from his deathbed. Military and civilian tests concluded he was as strong as a Horse. Mark felt a higher calling and left the Military as a Decorated Veteran. He quit every job sold his house and moved to East LA. He appreciated that God had given him a second chance at life. He lived in a basement at a Church. On the streets, he made friends with the gangs and they trusted him. gang violence had dropped considerably in the local neighborhoods and some of the gang members were going to Church. His life started as an ACTOR when he was asked to do several plays for the local Churches. He is passionate about acting and directors have asked him to come back several times for other projects as well. He is a team player who comes to set giving 200%. He treats every project like it is a blockbuster.",
        "birthday": "1960-04-07",
        "deathday": "2020-10-08",
        "gender": 2,
        "homepage": null,
        "id": 2131774,
        "imdb_id": "nm8786755",
        "known_for_department": "Acting",
        "name": "Mark Krenik",
        "place_of_birth": null,
        "popularity": 1.1441,
        "profile_path": "/88KDiB7nNXh7arh5638W7UFNa0n.jpg"
    }
}