{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7Ww2p8mXVVOyj3RLKRg6GzeYIAv.jpg",
                "genre_ids": [
                    80,
                    18,
                    27
                ],
                "id": 13008,
                "original_language": "en",
                "original_title": "An American Crime",
                "overview": "The true story of suburban housewife Gertrude Baniszewski, who kept a teenage girl locked in the basement of her Indiana home during the 1960s.",
                "popularity": 2.7915,
                "poster_path": "/bLsE0sMI1bycBxZX7QNYghy5iyi.jpg",
                "release_date": "2007-07-27",
                "title": "An American Crime",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 740,
                "character": "Stephanie Baniszewski",
                "credit_id": "52fe452e9251416c7504e613",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "اسکاوت تیلور-کامپتون"
        ],
        "biography": "American actress and singer Scout Taylor-Compton began her acting career in 1998, with an appearance in the film A.W.O.L. with David Morse, and later in the short film Thursday Afternoon. She has appeared in numerous small television roles and in feature films that range from dramas to those in the horror genre. She went on to have small roles in both television and film including Ally McBeal, ER, Frasier, The Guardian and The Division. She appeared in several student films, commercials for Fuji Film and the Disney Cruise Line, and various skits on The Jay Leno Show.\n\nIn addition to taking vocal lessons and singing the theme song for her film Chicken Night (2001), Taylor-Compton is recording her debut rock album. Taylor-Compton had also provided voice over work in other films, including The Core (2003) and The Princess Diaries 2: Royal Engagement (2004). Taylor-Compton's was nomination for \"Best Performance in a TV Series - Recurring Young Actress\" for her portrayal of Clara in the television series Gilmore Girls. She made a comedic appearance in the film Four Fingers of the Dragon (2003) playing herself auditioning for a role in a fictional Kung Fu film. Later in 2004, she appeared in the teen comedy Sleepover, which had been her first large Hollywood film role. The cast of the film was nominated for \"Best Performance in a Feature Film - Young Ensemble Cast\" at the Young Artists.",
        "birthday": "1989-02-21",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 21318,
        "imdb_id": "nm0174021",
        "known_for_department": "Acting",
        "name": "Scout Taylor-Compton",
        "place_of_birth": "Long Beach, California, USA",
        "popularity": 0.633,
        "profile_path": "/2QmUKgO6Vsaz38CqXUsHINV8aZR.jpg"
    }
}