{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ycNyvi9gk4ZI2NLk4KBbseNZbfN.jpg",
                "genre_ids": [
                    99
                ],
                "id": 58496,
                "original_language": "en",
                "original_title": "Senna",
                "overview": "The remarkable story of Brazilian racing driver Ayrton Senna, charting his physical and spiritual achievements on the track and off, his quest for perfection, and the mythical status he has since attained, is the subject of Senna, a documentary feature that spans the racing legend's years as an F1 driver, from his opening season in 1984 to his untimely death a decade later.",
                "popularity": 2.9837,
                "poster_path": "/nZbLCbRoP6iJq5sr8daHQzjnzFh.jpg",
                "release_date": "2010-10-07",
                "title": "Senna",
                "video": false,
                "vote_average": 8.112,
                "vote_count": 1116,
                "character": "Self (archive footage)",
                "credit_id": "5fc989f066a7c3003f45fdf6",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Maria da Graça Meneghel",
            "Xuxa Meneghel"
        ],
        "biography": "Maria da Graça Xuxa Meneghel is a Brazilian television host, film actress, singer, model, and businesswoman. Her various shows have been broadcast in Portuguese, English, and Spanish worldwide, and her films are among the top earning Brazilian releases of all time, including the record-breaking box office hit \"Lua de Cristal\" (1990). As a singer, she is a two-time winner of the Latin Grammy Award for Best Children's Album, and her 1988 album \"Xou da Xuxa 3\" is listed in the Guiness Book of World Records as the best-selling children's album of all time.  She is also known for her epithet, the \"Queen of Children\".",
        "birthday": "1963-03-27",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.xuxa.com/",
        "id": 213256,
        "imdb_id": "nm0579430",
        "known_for_department": "Acting",
        "name": "Xuxa",
        "place_of_birth": "Santa Rosa, Rio Grande do Sul, Brazil",
        "popularity": 0.1407,
        "profile_path": "/sl1WfbuAxs4pchxSdKxrfld0LRM.jpg"
    }
}