{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xwgBHC2FgoIrQitl8jZwXXdsR9u.jpg",
                "genre_ids": [
                    35,
                    18,
                    53
                ],
                "id": 466272,
                "original_language": "en",
                "original_title": "Once Upon a Time... in Hollywood",
                "overview": "Los Angeles, 1969. TV star Rick Dalton, a struggling actor specializing in westerns, and stuntman Cliff Booth, his best friend, try to survive in a constantly changing movie industry. Dalton is the neighbor of the young and promising actress and model Sharon Tate, who has just married the prestigious Polish director Roman Polanski…",
                "popularity": 14.1788,
                "poster_path": "/wQKeS2JrsRF8XSfd9zqflrc5gad.jpg",
                "release_date": "2019-07-24",
                "title": "Once Upon a Time... in Hollywood",
                "video": false,
                "vote_average": 7.427,
                "vote_count": 14151,
                "character": "'Angel'",
                "credit_id": "5d5b81f460c75169a18d7b76",
                "order": 33
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Danielle Andrea Harris",
            "丹妮拉・哈里絲",
            "دنیل هریس"
        ],
        "biography": "Danielle Andrea Harris (born June 1, 1977) is an American actress. She is known as a \"scream queen\" for her roles in multiple horror films, including four entries in the Halloween franchise: two films as Jamie Lloyd (Halloween 4 and 5; 1988–89), and the Halloween remake and its sequel as Annie Brackett (2007–09). Other such roles include Tosh in Urban Legend (1998), Belle in Stake Land (2010), and Marybeth Dunston in the Hatchet series (2010–17). In 2012, she was inducted into the Fangoria Hall of Fame.\n\nHarris began her career as a child actress, with various appearances on television and prominent roles in films such as Marked for Death (1990), Don't Tell Mom the Babysitter's Dead (1991), The Last Boy Scout (1991), Free Willy (1993) and Daylight (1996). She is also known for her voice work, which includes playing Debbie Thornberry for the full run of the Nickelodeon series The Wild Thornberrys (1998–2004) and in the related films The Wild Thornberrys Movie (2002) and Rugrats Go Wild (2003).\n\nIn 2013, Harris made her feature directorial debut with the horror film Among Friends, after previously directing Madison (a segment in the unfinished anthology film Prank) in 2008 and a Stake Land companion short film in 2010.\n\nDescription above from the Wikipedia article Danielle Harris, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1977-06-01",
        "deathday": null,
        "gender": 1,
        "homepage": "http://danielleharris.org",
        "id": 21320,
        "imdb_id": "nm0364583",
        "known_for_department": "Acting",
        "name": "Danielle Harris",
        "place_of_birth": "Plainview, New York, USA",
        "popularity": 0.8206,
        "profile_path": "/rM2TrbTRZgtGmfIm6hDXuODDe0j.jpg"
    }
}