{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2nerKhF40OzjnGGOyzHcsAw8T53.jpg",
                "genre_ids": [
                    35,
                    18,
                    10752
                ],
                "id": 11902,
                "original_language": "sr",
                "original_title": "Подземље",
                "overview": "A group of Serbian socialists prepares for the war in a surreal underground filled by parties, tragedies, love and hate.",
                "popularity": 2.453,
                "poster_path": "/h8N6y13t4VusrDdH5PzTkwvBvgN.jpg",
                "release_date": "1995-05-13",
                "title": "Underground",
                "video": false,
                "vote_average": 7.736,
                "vote_count": 720,
                "character": "Mustafa",
                "credit_id": "55446598925141586d0036b8",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Branislav Lecic"
        ],
        "biography": "From Wikipedia, the free encyclopedia  Branislav Lečić (born 25 August 1955 in Šabac, Serbia, FPR Yugoslavia) is a Serbian actor, and politician. He graduated from the Faculty of Dramatic Arts of the University of Belgrade as an actor in 1978. Original founder of the \"My Serbia\" Movement, he is the President of the Christian Democratic Party of Serbia.  He has been very successful in theater, where he received several prizes. He's one of the founders of several of the most important theater groups that influenced theater of the former Yugoslavia. A member of the Yugoslav drama theater (Jugoslovensko dramsko pozorište) from 1980. He is divorced and a father of two.  Besides acting, he also took part in political life, being the leader of \"Plišana revolucija\" (Plush Revolution), during the reign of Slobodan Milošević. After the victory of the DOS in the 2000 presidential elections, he was named the Minister of culture in the government of the late Zoran Đinđić. After Čedomir Jovanović left Democratic Party (Serbia), Lečić followed, and became one of the founders of LDP. Soon afterwards, he left LDP, and founded the \"Moja Srbija\" (My Serbia) Movement, taking part in Serbian elections in 2008. In early 2010 he and his party merged into the Christian Democratic Party of Serbia. After the death of its founder and long-term leader Vladan Batić due to prolonged and progressive cancerous illness, Lecic was elected DHSS party president.  Lečić appears in Boris Malagurski's documentary film The Weight of Chains (2011).  Description above from the Wikipedia article Branislav Lečić, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1955-08-25",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 213382,
        "imdb_id": "nm0496118",
        "known_for_department": "Acting",
        "name": "Branislav Lečić",
        "place_of_birth": "Šabac, Serbia",
        "popularity": 0.2041,
        "profile_path": "/bj2i3x4GM6WUJS0mGh2ekkpk9Id.jpg"
    }
}