{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1z4auHDSf2Kh6OqOVmwbeWc2Jrn.jpg",
                "genre_ids": [
                    12,
                    10751,
                    18,
                    35
                ],
                "id": 8326,
                "original_language": "en",
                "original_title": "Holes",
                "overview": "A wrongfully convicted boy is sent to a brutal desert detention camp where he must dig holes in order to build character. What he doesn't know is that he is digging holes in order to search for a lost treasure hidden somewhere in the camp.",
                "popularity": 4.5328,
                "poster_path": "/o2Dm2mcE1qW8vT0bpsJO5OMBbqa.jpg",
                "release_date": "2003-04-18",
                "title": "Holes",
                "video": false,
                "vote_average": 6.876,
                "vote_count": 1458,
                "character": "Carla Morengo",
                "credit_id": "5643f226c3a36870e3004110",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "روما مافیا"
        ],
        "biography": "Roma Maffia (born May 31, 1958) is an American actress.\n\nMaffia began her acting career in Off-Broadway and Off-Off-Broadway productions. In 1994 she made her film debut playing the minor role of Carmen in director Ron Howard's film The Paper. Soon after, she landed a role on the television series Chicago Hope. Maffia's television career continued as she played 'Grace Alvarez,' the forensic pathologist for the Violent Crimes Task Force for four seasons on NBC's Profiler. She has had guest-star and recurring roles on shows such as ER, The West Wing, Law & Order and The Sopranos.\n\nHer most widely seen performances may be playing Seattle attorney Catherine Alvarez in the film Disclosure (1994), also starring Michael Douglas and Demi Moore, and her role on the show Nip/Tuck. She followed this up with a series of performances as Vanessa Galiano in the TV series, Law & Order and as Judge Victoria Peyton on ABC's Boston Legal.\n\nSince 2003 Maffia has appeared as Liz Cruz on the FX Network series Nip/Tuck, the anesthesiologist colleague of two dysfunctional plastic surgeons. Coincidentally, Maffia and Julian McMahon also worked on the TV show Profiler together.",
        "birthday": "1958-05-31",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 21366,
        "imdb_id": "nm0005173",
        "known_for_department": "Acting",
        "name": "Roma Maffia",
        "place_of_birth": "Manhattan, New York City, New York, USA",
        "popularity": 0.4386,
        "profile_path": "/oEfa2NUJJNo4zg74eB5oY86tyip.jpg"
    }
}