{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6OqfTNZBprTqScvNpssXP1lUYqm.jpg",
                "genre_ids": [
                    18,
                    10751
                ],
                "id": 293,
                "original_language": "en",
                "original_title": "A River Runs Through It",
                "overview": "The Maclean brothers, Paul and Norman, live a relatively idyllic life in rural Montana, spending much of their time fly fishing. The sons of a minister, the boys eventually part company when Norman moves east to attend college, leaving his rebellious brother to find trouble back home. When Norman finally returns, the siblings resume their fishing outings, and assess where they've been and where they're going.",
                "popularity": 6.3672,
                "poster_path": "/aVP45oS2cBL4WtZ1kB7r8uarruB.jpg",
                "release_date": "1992-10-09",
                "title": "A River Runs Through It",
                "video": false,
                "vote_average": 7.029,
                "vote_count": 1137,
                "character": "Helen Kane Impersonator (uncredited)",
                "credit_id": "6361700e0c3ec80079072023",
                "order": 44
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            " Camille Kampouris"
        ],
        "biography": "Camille Bonora (also known as Camille Kampouris; born May 13, 1956) is a former Muppet performer. She currently serves on the board of BibleMesh online theological studies, as well as a member of the Kairos Journal editorial board.\n\nBonora, a native of New Jersey, graduated from Catholic University of America, was a member of Phi Beta Kappa and initially worked in musical comedy and improvisational comedy. Bonora was also one of the puppeteers who performed The Muppets from 1985 to 1997. Bonora herself influenced Joey Mazzarino when she taught an improvisation class at Fordham University, and eventually introduced him to Jim Henson. Mazzarino later became the head writer for Sesame Street and also worked on The Adventures of Elmo in Grouchland, Muppets from Space, and Kermit's Swamp Years.\n\nIn 1996, she later retired from performing and co-founded the Kairos Journal with her husband Emmanuel A. Kampouris. She serves on its editorial board. The journal is an online tool to assist pastors and church leadership with Biblical references, historical precedents, quotations and writing, and commentary.\n\nDescription above from the Wikipedia article Camille Bonora, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1956-05-13",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 213896,
        "imdb_id": "nm0095151",
        "known_for_department": "Acting",
        "name": "Camille Bonora",
        "place_of_birth": "Morristown, New Jersey, USA",
        "popularity": 0.6126,
        "profile_path": "/8DTkPOh5tAgX6tmRp5Vf63uM1Oz.jpg"
    }
}