{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/20wSDAS6rUWhkZQ2PxPC9TRsAd1.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 11499,
                "original_language": "en",
                "original_title": "Frost/Nixon",
                "overview": "For three years after being forced from office, Nixon remained silent. But in summer 1977, the steely, cunning former commander-in-chief agreed to sit for one all-inclusive interview to confront the questions of his time in office and the Watergate scandal that ended his presidency. Nixon surprised everyone in selecting Frost as his televised confessor, intending to easily outfox the breezy British showman and secure a place in the hearts and minds of Americans. Likewise, Frost's team harboured doubts about their boss's ability to hold his own. But as the cameras rolled, a charged battle of wits resulted.",
                "popularity": 3.5386,
                "poster_path": "/z4cQ2mJxwPZUwVh97yX9oNsLLZQ.jpg",
                "release_date": "2008-10-15",
                "title": "Frost/Nixon",
                "video": false,
                "vote_average": 7.277,
                "vote_count": 1232,
                "character": "Farrah Fawcett",
                "credit_id": "614fcee6c3514c00436c83e0",
                "order": 26
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Stunningly beautiful blue eyed beauty of Swedish descent raised in Europe to California.Started as a Top Model from Magazine  covers to billboards with Google saying Yvette gets up to  60 million new fans a year.  Director Ron Howard gave her  first break in Hollywood casting her to play Farrah Fawcett in Academy Award winning film Frost/Nixon ?From there Adam Sandler casting her in his Comedy film to her  playing in a Sci Fi film premiering at Cannes Film Festival. To recently, Co-Starting with the late Ed Asner  in  Universal Pictures film “Santa Stole Our Dog”. as a Producer as well. Yvette is equally talented in arts from theatre, singing  to fine painting.She grew  up riding horses and scuba diving. And  her great love of animals and the planet has her being  Spokesperson to help save wildlife and nature for Defenders of Wildlife.",
        "birthday": "1991-11-12",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 2139018,
        "imdb_id": "nm2728720",
        "known_for_department": "Acting",
        "name": "Yvette Rachelle",
        "place_of_birth": null,
        "popularity": 1.9533,
        "profile_path": "/48UQyf4t7ITE7NWJvIxkvWYj8NR.jpg"
    }
}