{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/huZZBPyYUnMPCnrAFyJhnwYsQx9.jpg",
                "genre_ids": [
                    28,
                    878,
                    53
                ],
                "id": 7299,
                "original_language": "en",
                "original_title": "Equilibrium",
                "overview": "In a dystopian future, a totalitarian regime maintains peace by subduing the populace with a drug, and displays of emotion are punishable by death. A man in charge of enforcing the law rises to overthrow the system.",
                "popularity": 7.3992,
                "poster_path": "/eW3YrxOh3rd6PnRgMSftYoflvfe.jpg",
                "release_date": "2002-12-06",
                "title": "Equilibrium",
                "video": false,
                "vote_average": 7.044,
                "vote_count": 4747,
                "character": "Reading Room Proprietor",
                "credit_id": "59a5edae9251412f500143d3",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Brian Conley is one of the UK's most versatile and popular performers. He has become a household name thanks to such diverse characters as Dangerous Brian, Nick Frisby \"It's a puppet\", Doug Digby and the legendary Al Jolson. He was born and raised in West London and studied Performing Arts at The Barbara Speake Stage School and then at the age of 16 hit the road and made a living performing cabaret in nightclubs. He began his TV career as a warm up man for Terry Wogan, Noel Edmonds and Kenny Everett, but soon started appearing in front of the cameras with regular appearances in Five Alive and Live from the Palladium. He was soon snapped up by ITV and given his own starring vehicle to demonstrate his unique and versatile talents, this was Brian Conley - This Way Up which was followed by The Brian Conley Show.",
        "birthday": "1961-08-07",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.brianconley.com",
        "id": 213904,
        "imdb_id": "nm0174760",
        "known_for_department": "Acting",
        "name": "Brian Conley",
        "place_of_birth": "Paddington, London, England, UK",
        "popularity": 0.4521,
        "profile_path": "/oRqKVxNKSAN9vG7CIkU1bi3rldR.jpg"
    }
}