{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/djRD1jAXkUEQIFnG6fFFQAh9LD4.jpg",
                "genre_ids": [
                    53,
                    80,
                    18,
                    28
                ],
                "id": 10518,
                "original_language": "en",
                "original_title": "Marathon Man",
                "overview": "A graduate student and obsessive runner in New York is drawn into a mysterious plot involving his brother, a member of the secretive Division.",
                "popularity": 3.4461,
                "poster_path": "/uPNgubSiri2yvBQRPtP77ViYjN.jpg",
                "release_date": "1976-10-08",
                "title": "Marathon Man",
                "video": false,
                "vote_average": 7.174,
                "vote_count": 1145,
                "character": "Janeway",
                "credit_id": "52fe437f9251416c75012a21",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/mrTBoQTldI4BQXITBlKK9pO29ZK.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 12914,
                "original_language": "en",
                "original_title": "Stargate: Continuum",
                "overview": "Ba'al travels back in time and prevents the Stargate program from being started. SG-1 must somehow restore history.",
                "popularity": 6.4624,
                "poster_path": "/1rQUvblJHU8766FatqTtCMiRhph.jpg",
                "release_date": "2008-07-29",
                "title": "Stargate: Continuum",
                "video": false,
                "vote_average": 7.155,
                "vote_count": 548,
                "character": "President Henry Hayes",
                "credit_id": "52fe452c9251416c7504e139",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/vgnoBSVzWAV9sNQUORaDGvDp7wx.jpg",
                "genre_ids": [
                    12,
                    18,
                    878
                ],
                "id": 157336,
                "original_language": "en",
                "original_title": "Interstellar",
                "overview": "The adventures of a group of explorers who make use of a newly discovered wormhole to surpass the limitations on human space travel and conquer the vast distances involved in an interstellar voyage.",
                "popularity": 63.1735,
                "poster_path": "/gEU2QniE6E77NI6lCU6MxlNBvIx.jpg",
                "release_date": "2014-11-05",
                "title": "Interstellar",
                "video": false,
                "vote_average": 8.5,
                "vote_count": 37855,
                "character": "Williams",
                "credit_id": "54259750c3a3680876005f94",
                "order": 18
            },
            {
                "adult": false,
                "backdrop_path": "/y2DB71C4nyIdMrANijz8mzvQtk6.jpg",
                "genre_ids": [
                    28,
                    80,
                    18,
                    53
                ],
                "id": 49026,
                "original_language": "en",
                "original_title": "The Dark Knight Rises",
                "overview": "Following the death of District Attorney Harvey Dent, Batman assumes responsibility for Dent's crimes to protect the late attorney's reputation and is subsequently hunted by the Gotham City Police Department. Eight years later, Batman encounters the mysterious Selina Kyle and the villainous Bane, a new terrorist leader who overwhelms Gotham's finest. The Dark Knight resurfaces to protect a city that has branded him an enemy.",
                "popularity": 18.3339,
                "poster_path": "/hr0L2aueqlP2BYUblTTjmtn0hw4.jpg",
                "release_date": "2012-07-17",
                "title": "The Dark Knight Rises",
                "video": false,
                "vote_average": 7.787,
                "vote_count": 23537,
                "character": "President",
                "credit_id": "56219e78c3a3680e0e00a022",
                "order": 64
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "William Joseph Devane",
            "Γουίλιαμ Ντιβέιν",
            "ویلیام دیوان"
        ],
        "biography": "William Joseph Devane (born September 5, 1937) is an American film, television and theater actor,  known for his role as Greg Sumner on the primetime soap opera Knots Landing and as James Heller on the Fox serial drama 24, the role he reprised in Live Another Day. He is also known for his supporting roles in films such as McCabe & Mrs. Miller,  Family Plot), Marathon Man, Rolling Thunder and Space Cowboys.\n\nDevane began his acting career with the New York Shakespeare Festival where he performed in 15 plays. In 1966, Devane portrayed Robert F. Kennedy in the Off-Broadway spoof MacBird. He gained acclaim for his role as President John F. Kennedy in a television docudrama about the Cuban Missile Crisis, The Missiles of October, and again when he played blacklisted radio personality John Henry Faulk in the Emmy Award-winning TV movie Fear on Trial. He is widely known for his ten years as the ambitious and hardnosed politician-turned-corporate titan Greg Sumner on Knots Landing.\n\nIn 1994, Devane appeared as Al Capone in Lois & Clark: The New Adventures of Superman in an episode entitled \"That Old Gang of Mine\". He also had a recurring role on the CBS show Early Edition as the lead character's father. Devane appeared in the films McCabe & Mrs. Miller; Lady Liberty; Family Plot; Marathon Man; Rolling Thunder; Yanks; Testament; Timestalkers; Forgotten Sins; Exception to the Rule; Payback; Hollow Man and Space Cowboys.\n\nDevane has played members of the Presidential Cabinet on two evening dramas. In 2004, on The West Wing, he guest-starred as the Secretary of State and potential Vice-Presidential nominee. Devane appeared in several scenes with Martin Sheen; they also appeared together as President John F. Kennedy and his brother Robert, respectively, 30 years earlier in The Missiles of October. In 2005, he joined the cast of 24 as Secretary of Defense James Heller for seasons 4, 5 and 6.",
        "birthday": "1939-09-05",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 21416,
        "imdb_id": "nm0001137",
        "known_for_department": "Acting",
        "name": "William Devane",
        "place_of_birth": "Albany, New York, USA",
        "popularity": 1.2822,
        "profile_path": "/wCfPYMkAOCXM4RF1Pg6VhtKR50U.jpg"
    }
}