{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/v8Nf6Y1qL1Q3PWTBezXNPPaXqza.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 556984,
                "original_language": "en",
                "original_title": "The Trial of the Chicago 7",
                "overview": "What was supposed to be a peaceful protest turned into a violent clash with the police. What followed was one of the most notorious trials in history.",
                "popularity": 3.4892,
                "poster_path": "/ahf5cVdooMAlDRiJOZQNuLqa1Is.jpg",
                "release_date": "2020-09-25",
                "title": "The Trial of the Chicago 7",
                "video": false,
                "vote_average": 7.677,
                "vote_count": 3175,
                "character": "Sondra",
                "credit_id": "5f1986a8abdafc00394ceb8c",
                "order": 30
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Born and raised in Augusta, GA, Tiffany began dancing at the age of three. In the years following, she discovered a love for theater and music that augmented her passion to be a performing artist. She has trained for over two decades at prestigious liberal and performing arts institutions (including SMU, Yale, The Second City and Upright Citizens Brigade) and loves every minute of imitating life onstage, on set or in a rehearsal room.\n\nA former member of the Brierley Resident Acting Company at the Dallas Theater Center and featured actress at Kenny Leon’s True Colors Theatre, Tiffany appeared as Shenzi in the National Tour of The Lion King for two years (2015-2017). In 2018, Tiffany joined the Broadway musical, Waitress, spear-headed by Sara Bareilles, Jessie Nelson and Diane Paulus. In 2019, she was nominated by the Connecticut Critics Circle Awards as Best Featured Actress in a Play for her performance as Olivia in Twelfth Night at the Yale Repertory Theatre. Tiffany also played Ursula in New York Shakespeare in Park's critically acclaimed production of Much Ado About Nothing, directed by Kenny Leon.\n\nOn TV, she can be found co-starring in Donald Glover's FX hit, \"Atlanta\"; Netflix's \"Ozark\", \"The Haunting of Hill House\" and \"Pose\"; the OWN Network's \"Love Is ___\"; CBS's \"MacGyver\" \"Bull\" and \"Code Black\"; and in SyFy's \"Happy.\" She can also be seen guest-starring as Penelope Van Summers in the TNT drama, \"Claws\". Tiffany is a part of multiple series in the upcoming 2022 season as well.",
        "birthday": "1987-07-17",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.tiffanydenisehobbs.com",
        "id": 2145647,
        "imdb_id": "nm3157356",
        "known_for_department": "Acting",
        "name": "Tiffany Denise Hobbs",
        "place_of_birth": "Augusta, Georgia, USA",
        "popularity": 0.1363,
        "profile_path": "/1McX5l3Z51nWE4pwzjEpRCGSl8q.jpg"
    }
}