{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/y2BDd5QoOn73qSISWrg29sJD82n.jpg",
                "genre_ids": [
                    35
                ],
                "id": 425134,
                "original_language": "en",
                "original_title": "How to Be a Latin Lover",
                "overview": "An aging Latin lover gets dumped by his sugar mama and must fend for himself in a harsh world.",
                "popularity": 3.8207,
                "poster_path": "/tjCDa24gNZGhpsFRhKnN9x83rTj.jpg",
                "release_date": "2017-03-06",
                "title": "How to Be a Latin Lover",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 636,
                "character": "Celeste",
                "credit_id": "58223934c3a3680e3a002eb6",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "ラクエル・ウェルチ",
            "Jo Raquel Welch",
            "Jo Raquel Tejada",
            "راکوئل ولش"
        ],
        "biography": "Jo Raquel Welch (née Tejada; September 5, 1940 – February 15, 2023) was an American actress.\n\nWelch first garnered attention for her role in Fantastic Voyage (1966), after which she signed a long-term contract with 20th Century Fox. They lent her contract to the British studio Hammer Film Productions, for whom she made One Million Years B.C. (1966). Although Welch had only three lines of dialogue in the film, images of her in the doe-skin bikini became bestselling posters that turned her into an international sex symbol. She later starred in Bedazzled (1967), Bandolero! (1968), 100 Rifles (1969), Myra Breckinridge (1970), Hannie Caulder (1971), Kansas City Bomber (1972), The Last of Sheila (1973), The Three Musketeers (1973), The Wild Party (1975), and Mother, Jugs & Speed (1976). She made several television variety specials.\n\nThrough her portrayal of strong female characters, helping her break the mold of the traditional sex symbol, Welch developed a unique film persona that made her an icon of the 1960s and 1970s. Her rise to stardom in the mid-1960s was partly credited with ending Hollywood's vigorous promotion of the blonde bombshell.[1][2][3] Her love scene with Jim Brown in 100 Rifles also made cinematic history with their portrayal of interracial intimacy.[4] She won a Golden Globe Award for Best Motion Picture Actress in a Musical or Comedy in 1974 for her performance as Constance Bonacieux in The Three Musketeers and reprised the role in its sequel the following year. She was also nominated for a Golden Globe Award for Best Actress in Television Film for her performance in Right to Die (1987). Her final film was How to Be a Latin Lover (2017). In 1995, Welch was chosen by Empire magazine as one of the \"100 Sexiest Stars in Film History\". Playboy ranked Welch No. 3 on their \"100 Sexiest Stars of the Twentieth Century\" list.\n\nDescription above from the Wikipedia article Raquel Welch, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1940-09-05",
        "deathday": "2023-02-15",
        "gender": 1,
        "homepage": null,
        "id": 21462,
        "imdb_id": "nm0000079",
        "known_for_department": "Acting",
        "name": "Raquel Welch",
        "place_of_birth": "Chicago, Illinois, USA",
        "popularity": 1.3655,
        "profile_path": "/gsKsY1PlhZ8qGx54zq7ciswZ0zw.jpg"
    }
}