{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qxTw8OKJLRX1Xb5nR5CcIDnLKoq.jpg",
                "genre_ids": [
                    18,
                    53,
                    27
                ],
                "id": 44214,
                "original_language": "en",
                "original_title": "Black Swan",
                "overview": "The story of Nina, a ballerina in a New York City ballet company whose life, like all those in her profession, is completely consumed with dance. She lives with her retired ballerina mother Erica who zealously supports her daughter's professional ambition. When artistic director Thomas Leroy decides to replace prima ballerina Beth MacIntyre for the opening production of their new season, Swan Lake, Nina is his first choice.",
                "popularity": 7.3213,
                "poster_path": "/viWheBd44bouiLCHgNMvahLThqx.jpg",
                "release_date": "2010-12-03",
                "title": "Black Swan",
                "video": false,
                "vote_average": 7.688,
                "vote_count": 15010,
                "character": "Corps De Ballet",
                "credit_id": "5fd5662a29c626003fba8bd5",
                "order": 49
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Originally from Tuxedo Park, New York, Adrianna de Svastich began her ballet training under Leonid Kozlov in Ramsey, New Jersey. She was then accepted to The School of American Ballet in New York City, where she studied for five years. She also attended various summer programs with American Ballet Theatre, Miami City Ballet, and The Royal Ballet School in London. During her final year at SAB, she performed with the New York City Ballet in Balanchine's Serenade and Chopiniana, and in Susan Stroman's Double Feature. Ms. de Svastich was a member of Pennsylvania Ballet II for two years before becoming an Apprentice in August 2007. She was promoted to the Corps de Ballet in 2009, and continued to perform with PA Ballet through 2011. Her performing experience with Pennsylvania Ballet includes George Balanchine's The Nutcracker, Ballo Della Regina, The Four Temperaments, Square Dance, Theme and Variations, Concerto Barocco and Serenade; Jerome Robbins' The Concert; Christopher Wheeldon's Swan Lake and Carnival of the Animals; John Cranko's Romeo and Juliet; Matthew Neenan's Carmina Burana; Roland Petit's Carmen, Twyla Tharp's Push Comes To Shove; Ben Stevenson's Dracula; Frederick Ashton's La Fille Mal Gardee and Giselle, The Sleeping Beauty, and Cinderella. She was also featured as a Corps de Ballet dancer in the Academy Award winning film Black Swan.\n\nSince joining BalletFleming in 2011, she has danced numerous principal roles in Christopher Fleming's works including Christine in Gaspar, Cafe Music Pas de Deux, Virginia and Anabelle-Lee in The Myth and Madness of Edgar Allen Poe, and the title role in Alice in Wonderland. She was also featured in Meredith Rainey's Before the After, and Jenn Rose's The Missing Piece.\n\nMs. de Svastich has choreographed for the School of American Ballet Student Choreographic Workshop, Pennsylvania Ballet's Shut Up & Dance, and BalletFleming.\n\nIn addition to her career as a ballet dancer, Ms. de Svastich graduated Magna Cum Laude from the University of Pennsylvania with a BA in History in 2012.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 2150161,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Adrianna de Svastich",
        "place_of_birth": null,
        "popularity": 0.0379,
        "profile_path": "/lRXoC0YJIoMrsl12dUOwlMi3dmp.jpg"
    }
}