{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9AjG0YJLgDUtHl5KgrThHPhNNwZ.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 3083,
                "original_language": "en",
                "original_title": "Mr. Smith Goes to Washington",
                "overview": "After the death of a United States Senator, idealistic Jefferson Smith is appointed as his replacement in Washington. Soon, the naive and earnest new senator has to battle political corruption.",
                "popularity": 2.8482,
                "poster_path": "/nDjg1fbNyq15excNDl3acd2IqAk.jpg",
                "release_date": "1939-10-19",
                "title": "Mr. Smith Goes to Washington",
                "video": false,
                "vote_average": 7.843,
                "vote_count": 1118,
                "character": "Bill Griffith",
                "credit_id": "52fe4384c3a36847f8059fed",
                "order": 16
            },
            {
                "adult": false,
                "backdrop_path": "/wSiBXaJ2PtlxUGH2waIxQZjFPhg.jpg",
                "genre_ids": [
                    28,
                    12,
                    35,
                    80
                ],
                "id": 11576,
                "original_language": "en",
                "original_title": "It's a Mad, Mad, Mad, Mad World",
                "overview": "A group of strangers come across a man dying after a car crash who proceeds to tell them about the $350,000 he buried in California. What follows is the madcap adventures of those strangers as each attempts to claim the prize for himself.",
                "popularity": 8.0596,
                "poster_path": "/j4mWzOisSHFkaqIkq34l2mm8a5K.jpg",
                "release_date": "1963-11-07",
                "title": "It's a Mad, Mad, Mad, Mad World",
                "video": false,
                "vote_average": 6.97,
                "vote_count": 637,
                "character": "Police Chief Aloysius",
                "credit_id": "52fe445f9251416c750326dd",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia.  Carl William Demarest (February 27, 1892 – December 27, 1983) was an American character actor, known for playing Uncle Charley in My Three Sons. A veteran of World War I, Demarest became a prolific film and television actor, appearing in over 140 films, beginning in 1926 and ending in the 1970s. He frequently played crusty but good-hearted roles.  Demarest started in show business working in vaudeville, appearing with his wife Estelle Collette (real name Esther Zychlin) as \"Demarest and Colette\", then moved on to Broadway. Demarest worked regularly with director Preston Sturges, becoming part of a \"stock\" troupe of actors that Sturges repeatedly cast in his films. He appeared in ten films written by Sturges, eight of which were under his direction, including The Lady Eve, Sullivan's Travels and The Miracle of Morgan's Creek. Demarest was such a familiar figure at the Paramount studio that just his name was used in the movie Sunset Boulevard as a potential star for William Holden's unsold baseball screenplay.\n\nDemarest appeared with veteran western film star Roscoe Ates in the 1958 episode \"And the Desert Shall Blossom\" of CBS's Alfred Hitchcock Presents. In the story line, Ates and Demarest appear as old timers living in the Nevada desert. The local sheriff, played by Ben Johnson, appears with an eviction notice, but he agrees to let the pair stay on their property if they can make a dead rosebush bloom within the next month.\n\nIn 1959 Demarest was named the lead actor of the 18-week sitcom Love and Marriage on NBC in the 1959–1960 season. Demarest played William Harris, the owner of a failing music company who refuses to handle popular rock and roll music, which presumably might save the firm from bankruptcy. Joining Demarest on the series were Jeanne Bal, Murray Hamilton and Stubby Kaye.\n\nDemarest appeared as Police Chief Aloysius of the Santa Rosita Police Department in the film It's a Mad, Mad, Mad, Mad World (1963), as well as on a memorable episode (\"What's in the Box\") of Rod Serling's The Twilight Zone as a hen-pecked husband driven to the murder of his wife.\n\nHis most famous television role was in the ABC and then CBS sitcom My Three Sons from 1965 to 1972, playing Uncle Charley O'Casey. He replaced William Frawley, whose failing health had made procuring insurance impossible. Demarest had worked with Fred MacMurray previously in the films Hands Across the Table (1935), Pardon My Past (1945), On Our Merry Way (1948), and The Far Horizons (1955) and was a personal friend of MacMurray. Also, he worked with Irene Dunne in Never a Dull Moment (1950).",
        "birthday": "1892-02-27",
        "deathday": "1983-12-28",
        "gender": 2,
        "homepage": null,
        "id": 21510,
        "imdb_id": "nm0218131",
        "known_for_department": "Acting",
        "name": "William Demarest",
        "place_of_birth": "Saint Paul, Minnesota, USA",
        "popularity": 0.242,
        "profile_path": "/yNr9tzg17nMsrfxqriaWg7PEBlV.jpg"
    }
}