{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tbF57JNof8j3X14GhZtqafkrziU.jpg",
                "genre_ids": [
                    878,
                    12
                ],
                "id": 313106,
                "original_language": "en",
                "original_title": "Doctor Who: The Day of the Doctor",
                "overview": "In 2013, something terrible is awakening in London's National Gallery; in 1562, a murderous plot is afoot in Elizabethan England; and somewhere in space an ancient battle reaches its devastating conclusion. All of reality is at stake as the Doctor's own dangerous past comes back to haunt him.",
                "popularity": 1.2786,
                "poster_path": "/6c0CjymaupC5xerJCemuaSV4CLj.jpg",
                "release_date": "2013-11-23",
                "title": "Doctor Who: The Day of the Doctor",
                "video": false,
                "vote_average": 8.2,
                "vote_count": 761,
                "character": "McGillop",
                "credit_id": "55267027c3a3687df3003e58",
                "order": 20
            },
            {
                "adult": false,
                "backdrop_path": "/12RXkIWUXwOHXgAmlxJNIWRGrri.jpg",
                "genre_ids": [
                    37,
                    35,
                    18,
                    10402,
                    9648,
                    10749
                ],
                "id": 537996,
                "original_language": "en",
                "original_title": "The Ballad of Buster Scruggs",
                "overview": "Vignettes weaving together the stories of six individuals in the old West at the end of the Civil War. Following the tales of a sharp-shooting songster, a wannabe bank robber, two weary traveling performers, a lone gold prospector, a woman traveling the West to an uncertain future, and a motley crew of strangers undertaking a carriage ride.",
                "popularity": 6.5005,
                "poster_path": "/voxl654m7p36y8FLu8oQD7dfwwK.jpg",
                "release_date": "2018-11-09",
                "title": "The Ballad of Buster Scruggs",
                "video": false,
                "vote_average": 7.134,
                "vote_count": 4224,
                "character": "Englishman (segment \"The Mortal Remains\")",
                "credit_id": "5b88a5dcc3a3682e600028e3",
                "order": 45
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Jonjo O'Neill is an actor from Northern Ireland known for his stage and television work. O'Neill was born in Belfast, grew up in the Whiterock Road area and was educated at St Mary's Grammar School. Growing up he was passionate about musical theatre and was a member of Ulster Youth Theatre and performed with the Ulster Theatre Company. In 1996 at the age of 18 he won a place and a full scholarship to the Guildford School of Acting, and moved to England. His first television role was the year he graduated from drama school, in Extremely Dangerous (1999).\n\nA member of the Royal Shakespeare Company (RSC) 2009-2011 ensemble, his roles included Mercutio in Romeo and Juliet, Orlando in As You Like It, and Launcelot in Morte D'Arthur. His performances during the RSC's six-week residency at Park Avenue Armory in New York were hailed as \"forceful\" and \"irresistible.\" At the 2012 World Shakespeare Festival in Stratford-upon-Avon, O'Neill played the title role in Roxana Silbert's production of Richard III at the Swan Theatre.\n\nIn 2012 he won praise for his performance in Lucy Prebble's play The Effect at the Royal National Theatre headlining alongside Billie Piper, whom he later appeared alongside in the 2013 fiftieth anniversary episode of Doctor Who: \"The Day of the Doctor\". He also appeared in \"The Mortal Remains,\" the final vignette in the Coen brothers's film The Ballad of Buster Scruggs (2018).",
        "birthday": "1978-07-11",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 215460,
        "imdb_id": "nm1306019",
        "known_for_department": "Acting",
        "name": "Jonjo O'Neill",
        "place_of_birth": null,
        "popularity": 0.8042,
        "profile_path": "/obFPEAqPXCUkfroc2kcxxpfzmUG.jpg"
    }
}