{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fHuKwcrwltGlWn3510N1YO7vJ4I.jpg",
                "genre_ids": [
                    10749,
                    18
                ],
                "id": 1587,
                "original_language": "en",
                "original_title": "What's Eating Gilbert Grape",
                "overview": "Gilbert Grape is a small-town young man with a lot of responsibility. Chief among his concerns are his mother, who is so overweight that she can't leave the house, and his mentally impaired younger brother, Arnie, who has a knack for finding trouble. Settled into a job at a grocery store and an ongoing affair with local woman Betty Carver, Gilbert finally has his life shaken up by the free-spirited Becky.",
                "popularity": 6.3693,
                "poster_path": "/8r9yts6XHbB1xNLaPC6ExNAK1Qu.jpg",
                "release_date": "1993-12-17",
                "title": "What's Eating Gilbert Grape",
                "video": false,
                "vote_average": 7.666,
                "vote_count": 4099,
                "character": "Doug Carver",
                "credit_id": "54453e920e0a26633a007fba",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia.\n\nJoseph Cameron Finley (born August 30, 1987) is an American former child actor.\n\nFinley was born in Garland, Texas, the son of Lexa Iann (née Aulgur), a spiritual healer, and Charles David \"Chuck\" Finley, a software developer. He has two siblings, Taz and Stopher. When he was three, he was taken by his parents to an acting seminar near his home. He started his career when he was featured in several commercials, for things such as Shout, Taco Bell, and Brinks Security. Finley appeared in the films A Perfect World, What's Eating Gilbert Grape, Hope Floats, and Leave It to Beaver (as the title character). He continued acting until the age of 12. Cameron chose to quit acting so he could go to school full time and \"be a normal kid\". He currently attends UC San Diego. His last performance was a co-starring role in the TV movie One True Love with David Hasselhoff.\n\nDescription above from the Wikipedia article Cameron Finley, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1987-08-30",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 215830,
        "imdb_id": "nm0278026",
        "known_for_department": "Acting",
        "name": "Cameron Finley",
        "place_of_birth": "Garland, Texas",
        "popularity": 0.4072,
        "profile_path": "/yp1CHqsrRUy99YA8VlfILCeTJ26.jpg"
    }
}