{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ycNyvi9gk4ZI2NLk4KBbseNZbfN.jpg",
                "genre_ids": [
                    99
                ],
                "id": 58496,
                "original_language": "en",
                "original_title": "Senna",
                "overview": "The remarkable story of Brazilian racing driver Ayrton Senna, charting his physical and spiritual achievements on the track and off, his quest for perfection, and the mythical status he has since attained, is the subject of Senna, a documentary feature that spans the racing legend's years as an F1 driver, from his opening season in 1984 to his untimely death a decade later.",
                "popularity": 2.9837,
                "poster_path": "/nZbLCbRoP6iJq5sr8daHQzjnzFh.jpg",
                "release_date": "2010-10-07",
                "title": "Senna",
                "video": false,
                "vote_average": 8.112,
                "vote_count": 1116,
                "character": "Self (archive footage)",
                "credit_id": "5855d3e392514146c9034325",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Nigel Mansell, born on August 8, 1953, in Upton-upon-Severn, England, is a legendary British racing driver known for his tenacity and thrilling driving style. Mansell enjoyed a successful career in both Formula 1 and IndyCar, earning acclaim as one of the sport’s great competitors. His journey in F1 began in the early 1980s, and he gained prominence with Lotus before moving to Williams, where he achieved his greatest success.\n\nIn 1992, Mansell won the Formula 1 World Championship with Williams, dominating the season and becoming a national hero in the UK. The following year, he made a historic transition to the American IndyCar series, winning the championship in his debut season—a feat no other driver had accomplished at the time.\n\nKnown for his aggressive yet calculated style, Mansell holds a place among the most thrilling drivers in motorsport history. He retired from full-time racing in the mid-1990s but remains an influential figure in the racing world, recognized for his bold spirit and contributions to both Formula 1 and IndyCar.",
        "birthday": "1953-08-08",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 216287,
        "imdb_id": "nm0543748",
        "known_for_department": "Acting",
        "name": "Nigel Mansell",
        "place_of_birth": "Upton-upon-Severn, Worcestershire, England, UK",
        "popularity": 0.1189,
        "profile_path": "/i0WZONOIRc6x61LzQaB4vvGS1aU.jpg"
    }
}