{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xTWHFJgP5anqRipDig4LSa4DLqj.jpg",
                "genre_ids": [
                    16,
                    12,
                    35,
                    14
                ],
                "id": 532067,
                "original_language": "ja",
                "original_title": "映画 この素晴らしい世界に祝福を！紅伝説",
                "overview": "It is not strange that the Demon Lord's forces fear the Crimson Demons, the clan from which Megumin and Yunyun originate. Even if the Demon Lord's generals attack their village, the Crimson Demons can just easily brush them off with their supreme mastery of advanced and overpowered magic.  When Yunyun receives a seemingly serious letter regarding a potential disaster coming to her hometown, she immediately informs Kazuma Satou and the rest of his party. After a series of wacky misunderstandings, it turns out to be a mere prank by her fellow demon who wants to be an author. Even so, Megumin becomes worried about her family and sets out toward the Crimson Demons' village with the gang.  There, Kazuma and the others decide to sightsee the wonders of Megumin's birthplace. However, they soon come to realize that the nonsense threat they received might have been more than just a joke.",
                "popularity": 3.8637,
                "poster_path": "/fv5BgcfkpWh3V6Pb1qVlXESBOdl.jpg",
                "release_date": "2019-08-30",
                "title": "KONOSUBA – God's blessing on this wonderful world! Legend of Crimson",
                "video": false,
                "vote_average": 8.1,
                "vote_count": 579,
                "character": "Verdia the Dullahan (voice)",
                "credit_id": "620e3012f794ad001bab9792",
                "order": 27
            },
            {
                "adult": false,
                "backdrop_path": "/yFZG86Zvdy6JuIlMW9eHxlVkct5.jpg",
                "genre_ids": [
                    16,
                    28,
                    12,
                    14,
                    878
                ],
                "id": 413594,
                "original_language": "ja",
                "original_title": "劇場版 ソードアート・オンライン -オーディナル・スケール-",
                "overview": "In 2026, four years after the infamous Sword Art Online incident, a revolutionary new form of technology has emerged: the Augma, a device that utilizes an Augmented Reality system. Unlike the Virtual Reality of the NerveGear and the Amusphere, it is perfectly safe and allows players to use it while they are conscious, creating an instant hit on the market. The most popular application for the Augma is the game Ordinal Scale, which immerses players in a fantasy role-playing game with player rankings and rewards.  Following the new craze, Kirito's friends dive into the game, and despite his reservations about the system, Kirito eventually joins them. While at first it appears to be just fun and games, they soon find out that the game is not all that it seems...",
                "popularity": 3.864,
                "poster_path": "/2szdEK0Mr0RG0nWGFVTseNQHbnP.jpg",
                "release_date": "2017-02-18",
                "title": "Sword Art Online: The Movie – Ordinal Scale",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 710,
                "character": "Andrew Gilbert Mills / Agil (voice)",
                "credit_id": "57e58a6dc3a3681be30014e8",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/iRB6VKJuFd88bk20hvLqlDzi4kP.jpg",
                "genre_ids": [
                    16,
                    10749,
                    18
                ],
                "id": 513347,
                "original_language": "zh",
                "original_title": "肆式青春",
                "overview": "The rigorous city life of China, while bustling and unforgiving, contains the everlasting memories of days past. Three stories told in three different cities, follow the loss of youth and the daunting realization of adulthood. Though reality may seem ever changing, unchangeable are the short-lived moments of one's childhood days. A plentiful bowl of noodles, the beauty of family and the trials of first love endure the inevitable flow of time, as three different characters explore the strength of bonds and the warmth of cherished memories. Within the disorder of the present world, witness these quaint stories recognize the comfort of the past, and attempt to revive the neglected flavors of youth.",
                "popularity": 2.7448,
                "poster_path": "/ueHeH5ergeHx27L4SCI9qlmwczA.jpg",
                "release_date": "2018-08-04",
                "title": "Flavors of Youth",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 568,
                "character": "Steve (voice)",
                "credit_id": "5b71b8e7c3a368189d183014",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/keIqryt6u5qGVThjrzFURMsRTri.jpg",
                "genre_ids": [
                    12,
                    28,
                    16,
                    35,
                    14
                ],
                "id": 347201,
                "original_language": "ja",
                "original_title": "BORUTO -NARUTO THE MOVIE-",
                "overview": "The spirited Boruto Uzumaki, son of Seventh Hokage Naruto, is a skilled ninja who possesses the same brashness and passion his father once had. However, the constant absence of his father, who is busy with his Hokage duties, puts a damper on Boruto's fire. He ends up meeting his father's friend Sasuke, and requests to become... his apprentice!? The curtain on the story of the new generation rises!",
                "popularity": 3.7337,
                "poster_path": "/1k6iwC4KaPvTBt1JuaqXy3noZRY.jpg",
                "release_date": "2015-08-07",
                "title": "Boruto: Naruto the Movie",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 1626,
                "character": "Kinshiki (voice)",
                "credit_id": "612de159e8a3e10062449f96",
                "order": 23
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "安元洋贵",
            "やすもと ひろき",
            "야스모토 히로키",
            "安元 洋貴"
        ],
        "biography": "Hiroki Yasumoto (安元 洋貴, Yasumoto Hiroki, March 16, 1977) is a Japanese voice actor and narrator from Yamaguchi Prefecture. He belongs to Sigma Seven.",
        "birthday": "1977-03-16",
        "deathday": null,
        "gender": 2,
        "homepage": "https://sigma7.co.jp/actors/yasumoto_hiroki",
        "id": 216448,
        "imdb_id": "nm1948682",
        "known_for_department": "Acting",
        "name": "Hiroki Yasumoto",
        "place_of_birth": "Yamaguchi, Japan",
        "popularity": 0.9544,
        "profile_path": "/vNIGLl0wFmdhdnulMssQ1qyNeBs.jpg"
    }
}