{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lMjY6kMBOHhloz2Ul16fLJn8xuw.jpg",
                "genre_ids": [
                    18,
                    10752
                ],
                "id": 591538,
                "original_language": "en",
                "original_title": "The Tragedy of Macbeth",
                "overview": "Macbeth, the Thane of Glamis, receives a prophecy from a trio of witches that one day he will become King of Scotland. Consumed by ambition and spurred to action by his wife, Macbeth murders his king and takes the throne for himself.",
                "popularity": 3.9462,
                "poster_path": "/tDNJEhcLbX3jIk3BMCur9pCdaVD.jpg",
                "release_date": "2021-12-05",
                "title": "The Tragedy of Macbeth",
                "video": false,
                "vote_average": 6.925,
                "vote_count": 822,
                "character": "Banquo",
                "credit_id": "616ca0a9d43f010091e5aca0",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/sGKUhw88FMH5gfz0E6BK2YOZ5se.jpg",
                "genre_ids": [
                    36,
                    18
                ],
                "id": 82695,
                "original_language": "en",
                "original_title": "Les Misérables",
                "overview": "An adaptation of the successful stage musical based on Victor Hugo's classic novel set in 19th-century France. Jean Valjean, a man imprisoned for stealing bread, must flee a relentless policeman named Javert. The pursuit consumes both men's lives, and soon Valjean finds himself in the midst of the student revolutions in France.",
                "popularity": 6.8937,
                "poster_path": "/6CuzBs2Lb8At7qQr64mLXg2RYRb.jpg",
                "release_date": "2012-12-18",
                "title": "Les Misérables",
                "video": false,
                "vote_average": 7.315,
                "vote_count": 5417,
                "character": "Bamatabois",
                "credit_id": "52fe486c9251416c9108c11d",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            " 博迪·卡维尔"
        ],
        "biography": "Bertie Carvel is a British actor who has twice won a Laurence Olivier Award: for Best Actor in a Leading Role in a Musical for his role as Miss Trunchbull in Matilda the Musical, and for Best Actor in a Supporting Role for his performance as Rupert Murdoch in Ink. For the latter role, he won the Tony Award for Best Actor in a Featured Role in a Play.\n\nCarvel was born in Marylebone, London, England, on September 6, 1977. He studied English at the University of Sussex and then trained at the Royal Academy of Dramatic Art. After graduating from RADA in 2003, he began his professional acting career in the theatre.\n\nCarvel has appeared in numerous stage productions, both in the UK and the US. He has won numerous awards for his stage work, including two Laurence Olivier Awards, a Tony Award, and a Drama Desk Award. Some of his most notable stage roles include Miss Trunchbull in Matilda the Musical, Rupert Murdoch in Ink, and Jonathan Strange in Jonathan Strange & Mr Norrell.\n\nIn addition to his stage work, Carvel has also appeared in a number of television and film productions. Some of his most notable TV roles include Simon Foster in Doctor Foster, Adam Dalgliesh in Dalgliesh, and Thewlis in The Sister. He has also appeared in films such as The History Boys, The Woman in Black, and The Thick of It.",
        "birthday": "1977-09-06",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 216425,
        "imdb_id": "nm1584487",
        "known_for_department": "Acting",
        "name": "Bertie Carvel",
        "place_of_birth": "Marylebone, London, England, UK",
        "popularity": 1.1018,
        "profile_path": "/hahxQXeqj09AHcQRubde19XlBcy.jpg"
    }
}