{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1J28PJOkusMN5Ab9Q3oF310e11k.jpg",
                "genre_ids": [
                    10749,
                    18,
                    12
                ],
                "id": 175,
                "original_language": "fr",
                "original_title": "Le Grand Bleu",
                "overview": "Two men answer the call of the ocean in this romantic fantasy-adventure.  Jacques and Enzo are a pair of friends who have been close since childhood, and who share a passion for the dangerous sport of free diving. Professional diver Jacques opted to follow in the footsteps of his father, who died at sea when Jacques was a boy; to the bewilderment of scientists, Jacques harbors a remarkable ability to adjust his heart rate and breathing pattern in the water, so that his vital signs more closely resemble that of dolphins than men.  As Enzo persuades a reluctant Jacques to compete against him in a free diving contest -- determining who can dive deeper and longer without scuba gear -- Jacques meets Johana, a beautiful insurance investigator from America, and he finds that he must choose between his love for her and his love of the sea.",
                "popularity": 3.6063,
                "poster_path": "/3t5t7yaFiTJQlqxiTkXJMFZdkh3.jpg",
                "release_date": "1988-05-10",
                "title": "The Big Blue",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 1501,
                "character": "Novelli",
                "credit_id": "52fe4222c3a36847f8006bcd",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/1YMrOtrW7b4pL2lfD8UciZPOJGs.jpg",
                "genre_ids": [
                    18,
                    53
                ],
                "id": 974576,
                "original_language": "en",
                "original_title": "Conclave",
                "overview": "After the unexpected death of the Pope, Cardinal Lawrence is tasked with managing the covert and ancient ritual of electing a new one. Sequestered in the Vatican with the Catholic Church’s most powerful leaders until the process is complete, Lawrence finds himself at the center of a conspiracy that could lead to its downfall.",
                "popularity": 8.2405,
                "poster_path": "/m5x8D0bZ3eKqIVWZ5y7TnZ2oTVg.jpg",
                "release_date": "2024-10-25",
                "title": "Conclave",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 2895,
                "character": "Tedesco",
                "credit_id": "674860decab0a238dddcf09f",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "سرجیو کاستلیتو",
            "سِرجیو کاستلیتو"
        ],
        "biography": "Sergio Castellitto (born August 18, 1953) is an Italian actor, film director, and screenwriter.\n\nSergio Castellitto was born in Rome in 1953, to parents from Molise and Abruzzo, Southern Italy. After graduating from the Silvio D'Amico National Academy of Dramatic Art in 1978, he began his theatrical career in Italian public theater with Shakespeare's Measure for Measure at the Teatro di Roma and with roles in other plays such as La Madre by Brecht, Merchant of Venice, and Candelaio by Giordano Bruno. At the Teatro di Genova he starred in the roles of Tuzenbach in Chekhov's Three Sisters and Jean in Strindberg's Miss Julie, both under the direction of Otomar Krejka. In the coming years, he also starred in such theatrical productions as L'infelicità senza desideri and Piccoli equivoci at the Festival dei Due Mondi in Spoleto. He also appeared in Barefoot in the Park by Neil Simon. During his years in the theatre, he worked alongside many famous actors, including Luigi Squarzina, Aldo Trionfo, and Enzo Muzii.\n\nCastellitto began his film career in 1983 beside Marcello Mastroianni and Michel Piccoli in The General of the Dead Army by Luciano Tovoli. He interpreted many films like Sembra morto...ma è solo svenuto directed by Felice Farina, Piccoli equivoci by Ricky Tognazzi and Stasera a casa di Alice by Carlo Verdone. He became more famous with the films The Great Pumpkin by Francesca Archibugi and The Star Maker by Giuseppe Tornatore.\n\nIn the late 1980s, Castellitto appeared in several Italian television miniseries, including Un siciliano in Sicilia (1987), Cinque storie inquietanti (1987), Piazza Navona (1988), Cinéma (1988), and Come stanno bene insieme (1989). He also appeared in the miniseries Victoire, ou la douleur des femmes (2000).\n\nSuccess arrived with the films La famiglia, L'ultimo bacio, Caterina in the Big City, My Mother's Smile, Mostly Martha, and especially with Don't Move, written by his wife Margaret Mazzantini. Other films that he interpreted include Il regista di matrimoni by Marco Bellocchio and La stella che non c'è by Gianni Amelio.\n\nIn France, Castellitto played the male lead opposite Jeanne Balibar in Jacques Rivette's Va savoir (2001). His most recent accomplishment as an actor has been in his role as Padre Pio: Miracle Man, arguably the defining role of his career.\n\nThe first film that he directed is Libero Burro, followed by Don't Move. He played the role of the antagonist, King Miraz, in the film The Chronicles of Narnia: Prince Caspian.\n\nHis most recent film as director was Twice Born, which played at the Toronto Film Festival (2012), where it was not well received by much of the English speaking press.\n\nMost recently, Castellitto appeared in the television series In Treatment in the role of Giovanni.\n\nCastellitto is married to Margaret Mazzantini with four children, one of these is Pietro, actor and film director himself.\n\nSource: Article \"Sergio Castellitto\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1953-08-18",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2166,
        "imdb_id": "nm0144812",
        "known_for_department": "Acting",
        "name": "Sergio Castellitto",
        "place_of_birth": "Roma, Lazio, Italia",
        "popularity": 0.688,
        "profile_path": "/uq5xz7kinzgdclGOcechgfPBgYC.jpg"
    }
}