{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7mmXWuBeNJiBO0NIOUWOuFve4Tb.jpg",
                "genre_ids": [
                    10402,
                    18
                ],
                "id": 424694,
                "original_language": "en",
                "original_title": "Bohemian Rhapsody",
                "overview": "Singer Freddie Mercury, guitarist Brian May, drummer Roger Taylor and bass guitarist John Deacon take the music world by storm when they form the rock 'n' roll band Queen in 1970. Hit songs become instant classics. When Mercury's increasingly wild lifestyle starts to spiral out of control, Queen soon faces its greatest challenge yet – finding a way to keep the band together amid the success and excess.",
                "popularity": 7.4737,
                "poster_path": "/lHu1wtNaczFPGFDTrjCSzeLPTKN.jpg",
                "release_date": "2018-10-24",
                "title": "Bohemian Rhapsody",
                "video": false,
                "vote_average": 7.968,
                "vote_count": 17296,
                "character": "Truck Driver (uncredited)",
                "credit_id": "5c7d0badc3a36843ed1820d8",
                "order": 54
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Queen + Adam Lambert"
        ],
        "biography": "American singer, songwriter and actor. Since 2009, he has sold over 3 million albums and 5 million singles worldwide.\n\nLambert rose to fame in 2009 after finishing as runner-up on the eighth season of American Idol. Later that year, he released his debut album For Your Entertainment, which debuted at number three on the U.S. Billboard 200. The album spawned several singles, including \"Whataya Want from Me\", for which he received a Grammy nomination for \"Best Male Pop Vocal Performance\".\n\nIn 2012, Lambert released his second studio album Trespassing. The album premiered at number one on the U.S. Billboard 200, making him the first openly gay artist to top the album charts. In 2015, Lambert released his third album The Original High, which debuted at number three on the U.S. Billboard 200 and produced the single \"Ghost Town\".\n\nAlongside his solo career, Lambert has collaborated with rock band Queen as lead vocalist for Queen + Adam Lambert since 2011, including several worldwide tours from 2014 to 2020. Their first album, Live Around the World, released in October 2020, and debuted at number one on the UK Albums Chart.\n\nIn late 2019, Lambert founded the non-profit Feel Something Foundation, anchoring his ongoing philanthropy, LGBTQ+ and human rights activism. Its particular focus is support for organizations and projects that directly and disproportionately impact the LGBTQ+ community, including education and the arts, mental health, suicide prevention and homelessness.",
        "birthday": "1982-01-29",
        "deathday": null,
        "gender": 2,
        "homepage": "https://adamlambert.net",
        "id": 216728,
        "imdb_id": "nm2189338",
        "known_for_department": "Acting",
        "name": "Adam Lambert",
        "place_of_birth": "Indianapolis, Indiana, USA",
        "popularity": 0.318,
        "profile_path": "/dlSxFRPB5P6o3INrYeK1vxssRft.jpg"
    }
}