{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1J28PJOkusMN5Ab9Q3oF310e11k.jpg",
                "genre_ids": [
                    10749,
                    18,
                    12
                ],
                "id": 175,
                "original_language": "fr",
                "original_title": "Le Grand Bleu",
                "overview": "Two men answer the call of the ocean in this romantic fantasy-adventure.  Jacques and Enzo are a pair of friends who have been close since childhood, and who share a passion for the dangerous sport of free diving. Professional diver Jacques opted to follow in the footsteps of his father, who died at sea when Jacques was a boy; to the bewilderment of scientists, Jacques harbors a remarkable ability to adjust his heart rate and breathing pattern in the water, so that his vital signs more closely resemble that of dolphins than men.  As Enzo persuades a reluctant Jacques to compete against him in a free diving contest -- determining who can dive deeper and longer without scuba gear -- Jacques meets Johana, a beautiful insurance investigator from America, and he finds that he must choose between his love for her and his love of the sea.",
                "popularity": 3.3849,
                "poster_path": "/3t5t7yaFiTJQlqxiTkXJMFZdkh3.jpg",
                "release_date": "1988-05-10",
                "title": "The Big Blue",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 1501,
                "character": "Uncle Louis",
                "credit_id": "52fe4222c3a36847f8006bd1",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/rk56vslwBXUCcNlQ74s6gmpJqxa.jpg",
                "genre_ids": [
                    28,
                    53
                ],
                "id": 9322,
                "original_language": "fr",
                "original_title": "Nikita",
                "overview": "A beautiful felon, sentenced to life in prison for the murder of a policeman, is given a second chance – as a secret political assassin controlled by the government.",
                "popularity": 3.8617,
                "poster_path": "/1ulQDewUG4KKHOhpXdGKm3GdLFq.jpg",
                "release_date": "1990-02-21",
                "title": "Nikita",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 2040,
                "character": "The Embassy Attaché",
                "credit_id": "52fe44e7c3a36847f80b0fe9",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/7AvbU0ei7Fz21jqBL4tlgSufnMp.jpg",
                "genre_ids": [
                    53,
                    80,
                    18
                ],
                "id": 2721,
                "original_language": "fr",
                "original_title": "Z",
                "overview": "Amid a tense political climate, the opposition leader is killed in an apparent accident. When a prosecutor smells a cover-up, witnesses get targeted. A thinly veiled dramatization of the assassination of Greek politician Grigoris Lambrakis and its aftermath, “Z” captures the outrage at the US-backed junta that ruled Greece at the time of its release.",
                "popularity": 3.3259,
                "poster_path": "/dFAJyFNgvOv24f2RQyI9KDxjGr3.jpg",
                "release_date": "1969-02-26",
                "title": "Z",
                "video": false,
                "vote_average": 7.795,
                "vote_count": 580,
                "character": "Deputy Georges Pirou, friend of the Deputy",
                "credit_id": "5656590e92514109e8000b7e",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jean Bouisse",
            "Жан Буиз"
        ],
        "biography": "Jean Bouise (3 June 1929 – 6 July 1989) was a French actor.\n\nHe was born in Le Havre. In the 1950s he helped to found Théâtre de la Cité, and was a player in the company. He entered films in the 1960s, and played a supporting roles in The Shameless Old Lady, Z, L'Aveu, Out 1, The Return of the Tall Blond Man with One Black Shoe, Section spéciale, and Monsieur Klein. He received César nominations for his roles in Le vieux fusil and Le Juge Fayard dit Le Shériff, before winning the Best Supporting Actor award for Coup de tête. Subsequently, he appeared in Édith et Marcel, Le Dernier Combat, Subway, The Big Blue and La Femme Nikita. He died in Lyon.\n\nSource: Article \"Jean Bouise\" from Wikipedia in English, licensed under CC-BY-SA.    ",
        "birthday": "1929-06-03",
        "deathday": "1989-07-06",
        "gender": 2,
        "homepage": null,
        "id": 2168,
        "imdb_id": "nm0099366",
        "known_for_department": "Acting",
        "name": "Jean Bouise",
        "place_of_birth": "Le Havre, Seine-Maritime, France",
        "popularity": 0.289,
        "profile_path": "/oRUMbNX21qfcTmxodcn3SRqkoe6.jpg"
    }
}