{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uehwVV9xuALZ2SXeHGiX4Ay5dR7.jpg",
                "genre_ids": [
                    878,
                    16,
                    28
                ],
                "id": 618355,
                "original_language": "en",
                "original_title": "Superman: Red Son",
                "overview": "Set in the thick of the Cold War, Red Son introduces us to a Superman who landed in the USSR during the 1950s and grows up to become a Soviet symbol that fights for the preservation of Stalin’s brand of communism.",
                "popularity": 1.759,
                "poster_path": "/frSfz7olCSQsp2SmTyu2ciGGQiX.jpg",
                "release_date": "2020-02-24",
                "title": "Superman: Red Son",
                "video": false,
                "vote_average": 7.114,
                "vote_count": 862,
                "character": "Tour Guide (voice)",
                "credit_id": "5dd17cf0b76cbb00167bd49d",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Anna Vocino is an American actress, comic, voice over actress, Podcaster, producer, and cookbook author. She has her own website, Eat Happy Kitchen, featuring a blog with her own recreated gluten-free versions of comfort food favorites.\n\nAnna Vocino was a series regular on the original semi-improvised show Free Radio on VH1/Comedy Central. She has also appeared in The Crazy Ones, It’s Always Sunny in Philadelphia, Children’s Hospital, Jimmy Kimmel Live!, and The Lance Krall Show, a sketch comedy series for SpikeTV.\n\nShe has voice acted for Age of Wonderbeasts, KIPO, Spirit, Butterbean’s Cafe, Superman: Red Son, Ben 10, Sofia The First, Batman: The Killing Joke, DC Girls, 11.22.63, Austin & Ally, The Office, MTV's Celebrity Death Match, The Young & The Restless, Jimmy Kimmel Live!, and narrating series for Oxygen, TruTV, Halogen, WE, and numerous video games.\n\nJust a few of the video game characters she has voiced include Historia Crux the narrator (& other voices) in Final Fantasy XIII-2, Monica Elshett (& other voices) in Final Fantasy XV,  Éowyn - narrator in Guardians of Middle-Earth, Annabelle in Starcraft II: Wings of Liberty, Olga in Asura's Wrath, T'Mar in Star Trek, and General Purrsilla in Sushi Striker: The Way of Sushido.\n\nCurrent and past clients include promo-ing comedies and late night on NBC, TGIT on ABC, CBS, Nickelodeon, Fox Sports, Cartoon Network, and The Tennis Channel, plus hundreds of TV and radio spots for clients like Subaru, Best Western, Meow Mix, Bud Light, Best Buy, Toys R Us, Target, FedEx, Pergo Flooring, and McDonald’s.\n\nShe produced the cult-favorite podcast “Yoda and Me,” and currently produces and co-hosts “The Fitness Confidential” podcast. She also tours as a stand-up comedian.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "https://annavocino.com/",
        "id": 216965,
        "imdb_id": "nm1817943",
        "known_for_department": "Acting",
        "name": "Anna Vocino",
        "place_of_birth": "Virginia, USA",
        "popularity": 0.075,
        "profile_path": "/bRzRpuzBUI8C4JKSTeF7edCcCl8.jpg"
    }
}