{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1J28PJOkusMN5Ab9Q3oF310e11k.jpg",
                "genre_ids": [
                    10749,
                    18,
                    12
                ],
                "id": 175,
                "original_language": "fr",
                "original_title": "Le Grand Bleu",
                "overview": "Two men answer the call of the ocean in this romantic fantasy-adventure.  Jacques and Enzo are a pair of friends who have been close since childhood, and who share a passion for the dangerous sport of free diving. Professional diver Jacques opted to follow in the footsteps of his father, who died at sea when Jacques was a boy; to the bewilderment of scientists, Jacques harbors a remarkable ability to adjust his heart rate and breathing pattern in the water, so that his vital signs more closely resemble that of dolphins than men.  As Enzo persuades a reluctant Jacques to compete against him in a free diving contest -- determining who can dive deeper and longer without scuba gear -- Jacques meets Johana, a beautiful insurance investigator from America, and he finds that he must choose between his love for her and his love of the sea.",
                "popularity": 3.347,
                "poster_path": "/3t5t7yaFiTJQlqxiTkXJMFZdkh3.jpg",
                "release_date": "1988-05-10",
                "title": "The Big Blue",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 1501,
                "character": "Roberto",
                "credit_id": "52fe4222c3a36847f8006bd5",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/rk56vslwBXUCcNlQ74s6gmpJqxa.jpg",
                "genre_ids": [
                    28,
                    53
                ],
                "id": 9322,
                "original_language": "fr",
                "original_title": "Nikita",
                "overview": "A beautiful felon, sentenced to life in prison for the murder of a policeman, is given a second chance – as a secret political assassin controlled by the government.",
                "popularity": 4.1205,
                "poster_path": "/1ulQDewUG4KKHOhpXdGKm3GdLFq.jpg",
                "release_date": "1990-02-21",
                "title": "Nikita",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 2040,
                "character": "Rico",
                "credit_id": "52fe44e7c3a36847f80b0f89",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/k61xLJgPo7ScxHLLiBzTM9IDaB7.jpg",
                "genre_ids": [
                    18
                ],
                "id": 406,
                "original_language": "fr",
                "original_title": "La Haine",
                "overview": "After a chaotic night of rioting in a marginal suburb of Paris, three young friends, Vinz, Hubert and Saïd, wander around unoccupied waiting for news about the state of health of a mutual friend who has been seriously injured when confronting the police.",
                "popularity": 5.141,
                "poster_path": "/a6DGCZC2fHNr07tyRumM30ALEKE.jpg",
                "release_date": "1995-05-31",
                "title": "La Haine",
                "video": false,
                "vote_average": 8.084,
                "vote_count": 4287,
                "character": "Inspector 'Notre-Dame'",
                "credit_id": "5eae2dd527d9cc001dd067d8",
                "order": 42
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Marc Duret (born 28 September 1957 in Nice, Alpes-Maritimes, France) is a French actor.\n\nHaving previously played Cardinal Guillaume Briçonnet in the television series Borgia from 2011–14, Duret appeared as Joseph Duverney in the Starz series Outlander in 2016.\n\nDuret was nominated for a 1991 César Award for Most Promising Actor for his portrayal of Rico in the 1990 film La Femme Nikita, and later nominated for a 1994 Molière Award for Best Newcomer for his theatre performance in Les grandes personnes (The Grown Ups). Screen Junkies named Duret #1 of its \"10 Best French Movie Actors\".\n\nDuret studied drama at the Conservatoire national in Nice, the Conservatoire national supérieur d'art dramatique in Paris, Rose Bruford College in London, and the University at Albany, SUNY and the Stella Adler Conservatory in New York.\n\nSource: Article \"Marc Duret\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1957-09-28",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2170,
        "imdb_id": "nm0244019",
        "known_for_department": "Acting",
        "name": "Marc Duret",
        "place_of_birth": "Nice, Alpes-Maritimes, France",
        "popularity": 0.4367,
        "profile_path": "/jOLK1qN6z3P1dnxYPrYxe0OV0CE.jpg"
    }
}