{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1J28PJOkusMN5Ab9Q3oF310e11k.jpg",
                "genre_ids": [
                    10749,
                    18,
                    12
                ],
                "id": 175,
                "original_language": "fr",
                "original_title": "Le Grand Bleu",
                "overview": "Two men answer the call of the ocean in this romantic fantasy-adventure.  Jacques and Enzo are a pair of friends who have been close since childhood, and who share a passion for the dangerous sport of free diving. Professional diver Jacques opted to follow in the footsteps of his father, who died at sea when Jacques was a boy; to the bewilderment of scientists, Jacques harbors a remarkable ability to adjust his heart rate and breathing pattern in the water, so that his vital signs more closely resemble that of dolphins than men.  As Enzo persuades a reluctant Jacques to compete against him in a free diving contest -- determining who can dive deeper and longer without scuba gear -- Jacques meets Johana, a beautiful insurance investigator from America, and he finds that he must choose between his love for her and his love of the sea.",
                "popularity": 3.6063,
                "poster_path": "/3t5t7yaFiTJQlqxiTkXJMFZdkh3.jpg",
                "release_date": "1988-05-10",
                "title": "The Big Blue",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 1501,
                "character": "Priest",
                "credit_id": "52fe4222c3a36847f8006bdd",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/i7bJjfaAIsUT0SYwSy9ahzJLrka.jpg",
                "genre_ids": [
                    35
                ],
                "id": 30197,
                "original_language": "en",
                "original_title": "The Producers",
                "overview": "Broadway producer Max Bialystock and his accountant, Leo Bloom, plan to make money by charming wealthy old biddies to invest in a production many times over the actual cost, and then put on a sure-fire flop, so nobody will ask for their money back – and what can be a more certain flop than a tasteless musical celebrating Hitler.",
                "popularity": 2.0027,
                "poster_path": "/9qCIkNWGuRj5lMyeOXwJs8z9nRz.jpg",
                "release_date": "1968-03-18",
                "title": "The Producers",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 833,
                "character": "Carmen Ghia",
                "credit_id": "52fe44049251416c910023a3",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Andreas Voutsinas",
            "Ανδρέας Βουτσινάς"
        ],
        "biography": "Andreas Voutsinas (22 August 1930 – 8 June 2010) was a Sudanese-Greek actor and theater director. In the English-speaking world, he was best known for his roles in three Mel Brooks films, The Producers (1967), The Twelve Chairs (1970) and History of the World, Part I (1981).\n\nVoutsinas was born on 22 August 1932 in Khartoum, since there was a sizeable community of Greek settlers in Sudan at the time. His parents hailed from the Ionian Island of Kefalonia. They set up a pasta factory in the Anglo-Egyptian colony, \"reputedly supplying spaghetti to Italian forces\" during the Fascist invasion of Abyssinia. After the collapse of the business during WWII, Voutsinas moved with his mother to Athens.\n\nVoutsinas studied acting and costume design at the Old Vic School and drama and song at the Webber Douglas Academy in London, and, in 1957, joined The Actors Studio.\n\nVoutsinas directed more than 130 performances of classical and contemporary repertoire in London, Paris, New York, Canada and Greece. He worked as an actor and director on Broadway and acted in films by Jules Dassin and Luc Besson.\n\nVoutsinas, a life member of The Actor's Studio since 1957, spent many years working in summer stock theater and as an assistant to Studio co-founder Elia Kazan, before he met Jane Fonda, with whom he got involved and whom he cast in the leading part in The Fun Couple, his Broadway directorial debut in 1963.\n\nVoutsinas later followed Fonda to Hollywood where he coached her in a number of movies. He then started working as a coach for many others, including Faye Dunaway and Warren Beatty. Following Fonda to Paris to coach her in Roger Vadim's Barbarella, he decided to found Le Theatre Des Cinquante, an acting workshop based on the principles of Lee Strasberg. Many famous French actors and actresses started attending his classes, and at the same time he successfully began directing plays for the French theater.\n\nIn 1968, Voutsinas became the original Carmen Ghia after befriending Mel Brooks's wife, Anne Bancroft. She recommended him to Brooks and said Voutsinas would be perfect for the part. Voutsinas had a role in another Brooks feature, History of the World, Part I, playing the role of \"Bernaise\" in the French Revolution scenes.\n\nIt was not until the early 1980s that he eventually moved to his ancestral Greece, where he continued his career directing a wide range of repertoire from Tennessee Williams to Euripides, mainly for the State Theater of Northern Greece in Thessaloniki. His productions were also staged during summer in the Athens Festival in Herodion, as well as in the Epidaurus Festival. He continued working between the two countries while he appeared in many French and Greek films, including Le Grand Bleu (1988) and Safe Sex (1999).\n\nAndreas Voutsinas taught acting at the State Theatre of Northern Greece from 2002 to 2009.\n\nAfter a stroke he founded his own drama school in Thessaloniki, Superior Drama School Andreas Voutsinas.\n\nVoutsinas died of a respiratory tract infection on 8 June 2010 at age 79, after several days of hospitalization in Henry Dunant Hospital in Athens.\n\nSource: Article \"Andreas Voutsinas\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1932-08-22",
        "deathday": "2010-06-08",
        "gender": 2,
        "homepage": null,
        "id": 2172,
        "imdb_id": "nm0903867",
        "known_for_department": "Acting",
        "name": "Andréas Voutsinas",
        "place_of_birth": "Khartoum, Sudan",
        "popularity": 0.0955,
        "profile_path": "/oIPi22XvpHVKF577UaCs3dL31fJ.jpg"
    }
}