{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1J28PJOkusMN5Ab9Q3oF310e11k.jpg",
                "genre_ids": [
                    10749,
                    18,
                    12
                ],
                "id": 175,
                "original_language": "fr",
                "original_title": "Le Grand Bleu",
                "overview": "Two men answer the call of the ocean in this romantic fantasy-adventure.  Jacques and Enzo are a pair of friends who have been close since childhood, and who share a passion for the dangerous sport of free diving. Professional diver Jacques opted to follow in the footsteps of his father, who died at sea when Jacques was a boy; to the bewilderment of scientists, Jacques harbors a remarkable ability to adjust his heart rate and breathing pattern in the water, so that his vital signs more closely resemble that of dolphins than men.  As Enzo persuades a reluctant Jacques to compete against him in a free diving contest -- determining who can dive deeper and longer without scuba gear -- Jacques meets Johana, a beautiful insurance investigator from America, and he finds that he must choose between his love for her and his love of the sea.",
                "popularity": 3.6063,
                "poster_path": "/3t5t7yaFiTJQlqxiTkXJMFZdkh3.jpg",
                "release_date": "1988-05-10",
                "title": "The Big Blue",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 1501,
                "character": "Bonita",
                "credit_id": "52fe4222c3a36847f8006be1",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/v4d6PPfqHeUNSdcyBVQ2Xb8yBk0.jpg",
                "genre_ids": [
                    18,
                    53,
                    9648
                ],
                "id": 192,
                "original_language": "en",
                "original_title": "The Name of the Rose",
                "overview": "14th-century Franciscan monk William of Baskerville and his young novice arrive at a conference to find that several monks have been murdered under mysterious circumstances. To solve the crimes, William must rise up against the Church's authority and fight the shadowy conspiracy of monastery monks using only his intelligence; which is considerable.",
                "popularity": 4.2255,
                "poster_path": "/2BuVu0j6v2kNY2gGxtO3sDGyob2.jpg",
                "release_date": "1986-09-24",
                "title": "The Name of the Rose",
                "video": false,
                "vote_average": 7.494,
                "vote_count": 3165,
                "character": "The Girl",
                "credit_id": "52fe4225c3a36847f8007651",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Valentine Vargas"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nValentina Vargas (born December 31, 1964) is a Chilean-born actress. She developed most of her career in France, where she was raised.\n\nVargas began her career in the dramatic art within the workshop of Tania Balaschova in Paris and also later at the Yves Pignot School of Los Angeles. Her cinematographic career started via the filming of three of the most important works[dubious – discuss] in contemporary French cinema, namely Pierre Jolivet's Strictly Personal, Luc Besson's Big Blue and Jean-Jacques Annaud's The Name of the Rose. Over the years, Vargas also worked with Samuel Fuller in Street of No Return, Miguel Littín in Los náufragos and Alfredo Arieta in Fuegos.\n\nVargas is trilingual in Spanish, French and English. This has enabled her to pass without notice in films as varied as the cinematic horror film Hellraiser IV: Bloodline where she played the Cenobite Angelique, to the comedy Chili con carne of Thomas Gilou. She appeared opposite Jan Michael Vincent (Dirty Games), Malcolm McDowell and Michael Ironside (Southern Cross), and James Remar (The Tigress).\n\nAfter her performance in Bloody Mallory where she played \"the malicious one\", she turned to playing roles for television. Initially she played in a version of Les Liaisons dangereuses directed by Josée Dayan. She starred in this production with Catherine Deneuve, Rupert Everett, Leelee Sobieski and Nastassja Kinski.",
        "birthday": "1964-12-31",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.valentinavargas.com",
        "id": 2173,
        "imdb_id": "nm0889926",
        "known_for_department": "Acting",
        "name": "Valentina Vargas",
        "place_of_birth": "Santiago, Chile",
        "popularity": 0.3879,
        "profile_path": "/kS45i62uoGlnd9HmxTaA0DjiLk2.jpg"
    }
}