{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hvINcZ57JNLHylfjTVB6hd0Uefz.jpg",
                "genre_ids": [
                    18,
                    36,
                    10752
                ],
                "id": 613,
                "original_language": "de",
                "original_title": "Der Untergang",
                "overview": "In April of 1945, Germany stands at the brink of defeat with the Russian Army closing in from the east and the Allied Expeditionary Force attacking from the west. In Berlin, capital of the Third Reich, Adolf Hitler proclaims that Germany will still achieve victory and orders his generals and advisers to fight to the last man. When the end finally does come, and Hitler lies dead by his own hand, what is left of his military must find a way to end the killing that is the Battle of Berlin, and lay down their arms in surrender.",
                "popularity": 5.6256,
                "poster_path": "/cP1ElGjBhbZAAqmueXjHDKlSwiP.jpg",
                "release_date": "2004-09-16",
                "title": "Downfall",
                "video": false,
                "vote_average": 7.855,
                "vote_count": 4055,
                "character": "Walter Hewel",
                "credit_id": "52fe425dc3a36847f8018be7",
                "order": 20
            },
            {
                "adult": false,
                "backdrop_path": "/7Q44vznK8E9SYsdkmIanrLmydZn.jpg",
                "genre_ids": [
                    28,
                    80,
                    18,
                    36,
                    53
                ],
                "id": 6968,
                "original_language": "de",
                "original_title": "Der Baader Meinhof Komplex",
                "overview": "When German police viciously quell a protest against the shah of Iran, popular journalist Ulrike Meinhof rebels against her dishonest marriage, walks away from her children and joins radical anarchist Andreas Baader. Together with Baader's girlfriend, Gudrun Ensslin, they form the violent Red Faction Army, and together perpetrate a slew of terrorist attacks as a way of disrupting the fabric of what they see as an increasingly fascist state.",
                "popularity": 2.4484,
                "poster_path": "/AjwdjcVorNKScu682tDATn5duoy.jpg",
                "release_date": "2008-09-25",
                "title": "The Baader Meinhof Complex",
                "video": false,
                "vote_average": 6.975,
                "vote_count": 612,
                "character": "Siegfried Buback",
                "credit_id": "53c7c859c3a3686260003abd",
                "order": 25
            },
            {
                "adult": false,
                "backdrop_path": "/bxQT6xCjejpGtgKl0QH8WUtrs33.jpg",
                "genre_ids": [
                    18,
                    53
                ],
                "id": 7735,
                "original_language": "de",
                "original_title": "Die Welle",
                "overview": "A school teacher discusses types of government with his class. His students find it too boring to repeatedly go over national socialism and believe that dictatorship cannot be established in modern Germany. He starts an experiment to show how easily the masses can become manipulated.",
                "popularity": 3.7627,
                "poster_path": "/vtJ4u0fpTZhibxAJHzXtcdCxhsL.jpg",
                "release_date": "2008-03-13",
                "title": "The Wave",
                "video": false,
                "vote_average": 7.487,
                "vote_count": 3456,
                "character": "Tim's Vater",
                "credit_id": "53e02563c3a3686c4d002f4a",
                "order": 26
            },
            {
                "adult": false,
                "backdrop_path": "/zb6fM1CX41D9rF9hdgclu0peUmy.jpg",
                "genre_ids": [
                    18,
                    36,
                    10752
                ],
                "id": 424,
                "original_language": "en",
                "original_title": "Schindler's List",
                "overview": "The true story of how businessman Oskar Schindler saved over a thousand Jewish lives from the Nazis while they worked as slaves in his factory during World War II.",
                "popularity": 14.6569,
                "poster_path": "/sF1U4EUQS8YHUYjNl3pMGNIQyr0.jpg",
                "release_date": "1993-12-15",
                "title": "Schindler's List",
                "video": false,
                "vote_average": 8.566,
                "vote_count": 16703,
                "character": "SS Bureaucrat",
                "credit_id": "5a47d78b925141031a001910",
                "order": 70
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Alexander G.Held",
            "Gerald Alexander Held"
        ],
        "biography": "Gerald Alexander Held (born 19 October 1958) is a German actor. He is internationally best known for his historical depictions, as Walther Hewel in the 2004 film Der Untergang, Robert Mohr in the 2005 film Sophie Scholl - Die letzten Tage and as state prosecutor Siegfried Buback in the 2008 film Der Baader Meinhof Komplex.\n\nDuring his school years, Held was a solo singer of the Regensburger Domspatzen, and played football for TSV 1860 München, winning five youth championships. He finished his acting training at the Otto Falckenberg School of the Performing Arts in Munich, and then joined the Munich Kammerspiele. Further engagements at the Staatsschauspiel Hannover, the Freien Volksbühne Berlin, the Theater Basel, and the Salzburg Festival followed.\n\nIn 1993, Held was cast by director Klaus Emmerich in Morlock in his first television film role. Since then he has appeared in numerous cinema and TV productions, including Steven Spielberg's Schindler's List, Marc Rothemund's Sophie Scholl - The Last Days, and Oliver Hirschbiegel's Downfall. In the Sat.1 series Der Bulle von Tölz with Ottfried Fischer, he played a Social Democratic Party of Germany Bundestag member, who mostly has to look after his opponents in the \"Bavarian Unity Party\".\n\nIn 2007, he starred alongside Iris Berben as the greedy villain Heinrich von Strahlberg in the two-part TV film Afrika, mon amour. In 2008, he played Alois Kugler, the opponent of Brandner Kaspar, in the film of the same name, directed by Joseph Vilsmaier. In 2009, he played the politically tactical abbot Kuno in the Margarethe von Trottas film Vision alongside Barbara Sukowa, Heino Ferch, and Hannah Herzsprung, and in the same year, he was seen in Sönke Wortmann's Pope Joan as the Frankish Emperor Lothar I. In 2010, he played the Attorney General Dr. Sasse alongside Ulrich Tukur in Dieter Wedel's two-part TV film Greed. Since 2010, he has starred in the crime series Stralsund as the head commissioner Karl Hidde. Since 2014, he has played the lead role of head commissioner Ludwig Schaller in the crime series München Mord.\n\nHeld's father was actor José Held, who died in 1974. From December 2005, Held was married to German actress Patricia Gräfin Fugger von Babenhausen (1961–2014).\n\nSource: Article \"Alexander Held\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1958-10-19",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 21743,
        "imdb_id": "nm0374901",
        "known_for_department": "Acting",
        "name": "Alexander Held",
        "place_of_birth": "Munich, Germany",
        "popularity": 0.2495,
        "profile_path": "/zE9NoMX4657qMX52EMFah9pHYSI.jpg"
    }
}