{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kchiiKCtsOg0VoFUpLnu1H98AX.jpg",
                "genre_ids": [
                    12,
                    16,
                    18,
                    10751
                ],
                "id": 9837,
                "original_language": "en",
                "original_title": "The Prince of Egypt",
                "overview": "The strong bond between two brothers is challenged when their chosen responsibilities set them at odds, with extraordinary consequences.",
                "popularity": 6.9747,
                "poster_path": "/2xUjYwL6Ol7TLJPPKs7sYW5PWLX.jpg",
                "release_date": "1998-12-16",
                "title": "The Prince of Egypt",
                "video": false,
                "vote_average": 7.296,
                "vote_count": 4137,
                "character": "Young Miriam (voice)",
                "credit_id": "52fe4537c3a36847f80c2b37",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Eden Sonja Jane Riegel"
        ],
        "biography": "Eden Sonja Jane Riegel (born January 1, 1981) is an American actress. She portrayed Bianca Montgomery in the daytime drama All My Children, and propelled the character into a gay icon, as well as a popular figure within the medium. Nominated previously on multiple occasions, she received a Daytime Emmy Award for the role in 2005.\n\nIn addition to her work on All My Children, Riegel has guest starred in several prime time shows, as well as film, and starred as character \"Eden\" in the web series Imaginary Bitches. She assumed the role of Heather Stevens on The Young and the Restless from April 2010 to November 2011.\n\nRiegel is also a prolific voice actress, providing the voices for many video games and animated projects. She is the voice director for Disney's animated TV series Amphibia, The Owl House and The Ghost and Molly McGee.\n\nDescription above from the Wikipedia article Eden Riegel, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1981-01-01",
        "deathday": null,
        "gender": 1,
        "homepage": "https://edenriegel.com",
        "id": 217524,
        "imdb_id": "nm0726180",
        "known_for_department": "Acting",
        "name": "Eden Riegel",
        "place_of_birth": "Washington, D.C., USA",
        "popularity": 0.7313,
        "profile_path": "/vrJcfeTk6nNboL05eT2MGHANTww.jpg"
    }
}