{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8HKwxHZ23sW8wz4yb28IWnAM1M6.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 458423,
                "original_language": "en",
                "original_title": "Mamma Mia! Here We Go Again",
                "overview": "Five years after meeting her three fathers, Sophie Sheridan prepares to open her mother’s hotel. In 1979, young Donna Sheridan meets the men who each could be Sophie’s biological father.",
                "popularity": 5.2208,
                "poster_path": "/aWicerX4Y7n7tUwRAVHsVcBBpj2.jpg",
                "release_date": "2018-07-18",
                "title": "Mamma Mia! Here We Go Again",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 3473,
                "character": "Ensemble Performer",
                "credit_id": "5fa344d621621d003ef0c7b4",
                "order": 212
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Amy Trigg (born 28 November 1992) is a British actress and writer. She is best known for the role of Agnes in The Little Big Things, for which she won the Olivier Award as Best Actress in a Supporting Role in a musical in 2024. Trigg was born with spina bifida and uses a wheelchair. She grew up in Witham, Essex and loved theatre from a very young age. She trained at Mountview Academy of Theatre Arts, graduating in 2013, and was the first wheelchair user to graduate from a performance course at the academy.  Trigg's first role was Laura in The Glass Menagerie at Nottingham Playhouse in 2016. Her casting in this role was part of a project called Ramps on the Moon, funded by the Arts Council and aimed at highlighting disabled artists and performers. Trigg was also cast as Sally in The Who's Tommy in 2017, part of the same Art Council's project and touring across the UK the same year. She was part of the 2019 Royal Shakespeare Company season in the roles of Juliet in Measure for Measure and Biondella in The Taming of the Shrew. In an interview with the RSC she highlighted the importance of representation for audiences, as \"it's still uncommon to have wheelchair-using actors onstage\". During her time with the RSC she also wrote a regular blog as part of the Whispers from the Wings series, where she shares her experience, as well as chat with fellow cast members. n July 2023 full cast for the musical The Little Big Things was announced, with Trigg joining in the role of Agnes. The show is based on the best-selling memoir of Henry Fraser of the same name. Trigg won the Olivier Award for Best Actress in a Supporting Role in a Musical for this role in 2024, becoming the first disabled actor to win in this category (and only second to win an Olivier Award). The musical was added to the streaming platform \"National Theatre at home\" in April 2024, after its extended run and closure in March of the same year.",
        "birthday": "1992-11-28",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.casarotto.co.uk/clients/amy-trigg",
        "id": 2176674,
        "imdb_id": "nm7478688",
        "known_for_department": "Acting",
        "name": "Amy Trigg",
        "place_of_birth": null,
        "popularity": 0.0459,
        "profile_path": "/kRqVqJYdq48JNtAswtLyHPhQpvg.jpg"
    }
}