{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9AjG0YJLgDUtHl5KgrThHPhNNwZ.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 3083,
                "original_language": "en",
                "original_title": "Mr. Smith Goes to Washington",
                "overview": "After the death of a United States Senator, idealistic Jefferson Smith is appointed as his replacement in Washington. Soon, the naive and earnest new senator has to battle political corruption.",
                "popularity": 2.8661,
                "poster_path": "/nDjg1fbNyq15excNDl3acd2IqAk.jpg",
                "release_date": "1939-10-19",
                "title": "Mr. Smith Goes to Washington",
                "video": false,
                "vote_average": 7.846,
                "vote_count": 1117,
                "character": "Reporter (uncredited)",
                "credit_id": "555f2522c3a36868f600278e",
                "order": 97
            },
            {
                "adult": false,
                "backdrop_path": "/ruF3Lmd4A8MHbnEBE6lxPMbsHGL.jpg",
                "genre_ids": [
                    9648,
                    18
                ],
                "id": 15,
                "original_language": "en",
                "original_title": "Citizen Kane",
                "overview": "Newspaper magnate Charles Foster Kane is taken from his mother as a boy and made the ward of a rich industrialist. As a result, every well-meaning, tyrannical or self-destructive move he makes for the rest of his life appears in some way to be a reaction to that deeply wounding event.",
                "popularity": 6.1449,
                "poster_path": "/sav0jxhqiH0bPr2vZFU0Kjt2nZL.jpg",
                "release_date": "1941-04-17",
                "title": "Citizen Kane",
                "video": false,
                "vote_average": 8.0,
                "vote_count": 5751,
                "character": "Photographer (uncredited)",
                "credit_id": "586be98c9251415d2d007cd0",
                "order": 89
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Robert Y. Dudley"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nRobert Dudley (September 13, 1869 – September 15*, 1955) was a dentist turned film character actor who, in his 35-year career, appeared in more than 115 films.\n\nDudley was born in Cincinnati, Ohio and was educated at Lake Forest College in Evanston, Illinois and Chicago, where he majored in oral surgery. In 1917 he appeared in his first film, Seven Keys to Baldpate, and then made three other silent films through 1921. After 1922 he worked consistently, appearing in three or four films a year, and making the transition to sound films in 1929 with The Bellamy Trial. Dudley often played characters with a quick temper, including jurors, shopkeepers, ticket agents, court clerks and justices of the peace, as well as an occasional farmer, hobo, or laborer. His performances in these small parts were frequently uncredited.\n\nIn the 1940s, Dudley was part of Preston Sturges' unofficial \"stock company\" of character actors, appearing in six films written and directed by Sturges. His most distinctive and memorable role for Sturges was the \"Wienie King\" in 1942's The Palm Beach Story, the funny little self-made rich man with a big hat who spontaneously bankrolls Claudette Colbert and Joel McCrea on their escapade.\n\nThe 5' 9\" Dudley, who was the founder of the \"Troupers Club of Hollywood\", was married to Elaine Anderson, and they had two girls, Jewell and Patricia Lee.\n\nHe made his final film, As Young as You Feel, in 1951, and died in 1955 in San Clemente, California.\n\n*[TMDb note: The California Death Index indicates that Mr. Dudley died on 12 November 1955. That date should therefore be considered accurate and official.]",
        "birthday": "1889-09-12",
        "deathday": "1955-11-12",
        "gender": 2,
        "homepage": null,
        "id": 217770,
        "imdb_id": "nm0240159",
        "known_for_department": "Acting",
        "name": "Robert Dudley",
        "place_of_birth": "Cincinnati, Ohio, USA",
        "popularity": 0.0776,
        "profile_path": "/qe9QRGhhfRXjavUSIAQfh9r1Cu6.jpg"
    }
}