{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3O5tanjVJGo8sgxC0Y8A1ecFB6d.jpg",
                "genre_ids": [
                    12,
                    35,
                    10751,
                    14
                ],
                "id": 420814,
                "original_language": "en",
                "original_title": "Christopher Robin",
                "overview": "Christopher Robin, the boy who had countless adventures in the Hundred Acre Wood, has grown up and lost his way. Now it’s up to his spirited and loveable stuffed animals, Winnie The Pooh, Tigger, Piglet, and the rest of the gang, to rekindle their friendship and remind him of endless days of childlike wonder and make-believe, when doing nothing was the very best something.",
                "popularity": 2.6729,
                "poster_path": "/i6Ytex4d3CdfIKJFxB5v5vh24vb.jpg",
                "release_date": "2018-08-01",
                "title": "Christopher Robin",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 2821,
                "character": "Red-Haired Boy",
                "credit_id": "67ea40a0700a6a94c6e57ac1",
                "order": 65
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Rupert Turnbull is a British actor who began his professional career at the age of five. He quickly gained recognition for his captivating performances and ability to embody diverse characters across film, television, and stage.\n\nTurnbull's early career was marked by notable roles in acclaimed television series. He first appeared as Petey Worth, the son of Genevieve O'Reilly and Tim Roth's characters, in the Sky Atlantic series \"Tin Star.\" This role took him to Canada for filming and marked the beginning of his international work. He subsequently travelled to Budapest for \"The Alienist,\" Belfast for \"Mrs Wilson,\" and Belgium for the ITV series \"Professor T,\" where he was a series regular for all three seasons.\n\nTurnbull's transition to the big screen was equally impressive. He landed a lead role as Barnaby Hargreaves, the son of Anna Chancellor and Hugh Dennis, in the Christmas film \"Nativity Rocks.\" He further showcased his versatility by voicing Tiny Tim in the animated Timeless Films/Netflix production of \"Scrooge,\" alongside a star-studded cast including Olivia Colman and Luke Evans.\n\nTurnbull's talent extends beyond the screen to the stage. He notably played Guido 'Fawksey' Marx, the son of Nancy Carroll and Rory Kinnear's characters, in the Bridge Theatre's inaugural production of \"Young Marx.\" This performance was broadcast in cinemas worldwide via National Theatre Live, further expanding his global reach.\n\nIn 2023, Turnbull took on the challenging lead role of Isaac in the feature film \"Daddy's Head,\" directed by Benjamin Barfoot. The film premiered at Fantastic Fest in Austin, Texas, and was released as a Shudder Original in October 2024, garnering critical acclaim for Turnbull's performance.\n\nIMDb Mini Bio by; yusufpiskin",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2179338,
        "imdb_id": "nm9052409",
        "known_for_department": "Acting",
        "name": "Rupert Turnbull",
        "place_of_birth": " London, United Kingdom",
        "popularity": 0.1854,
        "profile_path": "/ugBI99ISNXQRVUJybMXniSWmYUk.jpg"
    }
}