{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4zzWj2pVmkjN9yjsQesEEnNtlZ4.jpg",
                "genre_ids": [
                    28,
                    53,
                    80
                ],
                "id": 94329,
                "original_language": "id",
                "original_title": "Serbuan Maut",
                "overview": "Deep in the heart of Jakarta's slums lies an impenetrable safe house for the world's most dangerous killers and gangsters. Until now, the run-down apartment block has been considered untouchable to even the bravest of police. Cloaked under the cover of pre-dawn darkness and silence, an elite swat team is tasked with raiding the safe house in order to take down the notorious drug lord that runs it.  But when a chance encounter with a spotter blows their cover and news of their assault reaches the drug lord, the building's lights are cut and all the exits blocked. Stranded on the sixth floor with no way out, the unit must fight their way through the city's worst to survive their mission. Starring Indonesian martial arts sensation Iko Uwais.",
                "popularity": 3.9181,
                "poster_path": "/Abnm1Ws3JH0ReCfEhLMPwPcMcGO.jpg",
                "release_date": "2012-03-22",
                "title": "The Raid",
                "video": false,
                "vote_average": 7.405,
                "vote_count": 3643,
                "character": "Machete Gang #1",
                "credit_id": "5e46e4422da84600110488d0",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Alfridus Godfred Eon"
        ],
        "biography": "Alfridus Godfred Eon, known as Godfred Orindeod, is an Indonesian actor, architect, and martial artist. Godfred is a former Tarung Derajat athlete. He made his acting debut in the film The Raid, which was released in Indonesia in 2012. Throughout his acting career, he has frequently appeared in action films. He gained widespread attention after starring as the lead in the film Kaka Boss (2024).\n\nAs an architect, Godfred has worked on interior design projects, one of which earned the Best Interior Design Award from Unilever. He has also worked on several interior design projects for government ministry offices. Godfred has a strong background in martial arts, specifically in Tarung Derajat. He won a gold medal at the 2004 National Sports Week (PON), representing the East Java contingent. Currently, he serves as a Tarung Derajat coach. He was also appointed as part of the Competition and Refereeing Division of the Tarung Derajat Sports Family in Jakarta for the 2016 term.\n\nGodfred ventured into acting by starring in the action film The Raid. During the casting test, Godfred accidentally hit Iko Uwais, causing Uwais' right kneecap to shift. Throughout his acting career, Godfred has frequently starred in action films. He gained significant recognition after playing the lead role in the musical comedy-drama film Kaka Boss in 2024.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2182288,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Godfred Orindeod",
        "place_of_birth": "Kloangpopot, Nusa Tenggara Timur, Indonesia",
        "popularity": 0.3645,
        "profile_path": "/vZEayI3XYguwUnV1lZXj3phqMuD.jpg"
    }
}