{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1fL2S8LKxCVE9KoPRBXeagmBtex.jpg",
                "genre_ids": [
                    27,
                    53
                ],
                "id": 1114513,
                "original_language": "en",
                "original_title": "Speak No Evil",
                "overview": "When an American family is invited to spend the weekend at the idyllic country estate of a charming British family they befriended on vacation, what begins as a dream holiday soon warps into a snarled psychological nightmare.",
                "popularity": 9.6942,
                "poster_path": "/dA4N6uWOnEMgbxXwFX7qX7adzs8.jpg",
                "release_date": "2024-09-11",
                "title": "Speak No Evil",
                "video": false,
                "vote_average": 7.186,
                "vote_count": 1724,
                "character": "Mike",
                "credit_id": "66189aece0ec51016349f42a",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/bO7uK55yHE7hZobRN798rytCQuq.jpg",
                "genre_ids": [
                    18
                ],
                "id": 522369,
                "original_language": "en",
                "original_title": "Sorry We Missed You",
                "overview": "Ricky and his family have been fighting an uphill struggle against debt since the 2008 financial crash. An opportunity to wrestle back some independence appears with a shiny new van and the chance to run a franchise as a self-employed delivery driver. It's hard work, and his wife's job as a carer is no easier. The family unit is strong but when both are pulled in different directions everything comes to breaking point.",
                "popularity": 1.9977,
                "poster_path": "/jNvlqNDnXH8aqBeiBxNNP0wWWO3.jpg",
                "release_date": "2019-10-04",
                "title": "Sorry We Missed You",
                "video": false,
                "vote_average": 7.336,
                "vote_count": 787,
                "character": "Ricky",
                "credit_id": "5c06c7e5c3a36861f90f5512",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Кріс Хітченс"
        ],
        "biography": "Kristian Bartholomew Hitchen is an English actor, best known for his role in the Ken Loach directed feature Sorry We Missed You for which he received a nomination for best actor at the British Independent Film Awards.\n\nBorn in Salford on 28 April 1974, Hitchen studied dancing as a child and tried to break into acting after leaving school but, after meeting his wife, he left the industry and started a plumbing business.\n\nHe returned to acting after visiting a retreat just before his 40th birthday and had small roles in 4 O'Clock Club and Coronation Street before landing the part of Ricky in Ken Loach's Sorry We Missed You. He has since appeared in Anne Boleyn as the Duke of Norfolk, The Long Shadow, Trigger Point and the film Speak No Evil alongside James McAvoy.",
        "birthday": "1974-04-28",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2188560,
        "imdb_id": "nm1106944",
        "known_for_department": "Acting",
        "name": "Kris Hitchen",
        "place_of_birth": "Salford, Lancashire, England, UK",
        "popularity": 0.3561,
        "profile_path": "/7HBX75MKwwoiFnLFMS2YKtiPQIB.jpg"
    }
}