{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mujUrk2diGe5vRCb3kdpHZeobRs.jpg",
                "genre_ids": [
                    53
                ],
                "id": 6145,
                "original_language": "en",
                "original_title": "Fracture",
                "overview": "A husband is on trial for the attempted murder of his wife, in what is seemingly an open/shut case for the ambitious district attorney trying to put him away. However, there are surprises for both around every corner, and, as a suspenseful game of cat-and-mouse is played out, each must manipulate and outwit the other.",
                "popularity": 9.9234,
                "poster_path": "/qNen8x5gaikjIg9CFihgxYcJwQe.jpg",
                "release_date": "2007-04-19",
                "title": "Fracture",
                "video": false,
                "vote_average": 7.261,
                "vote_count": 4093,
                "character": "Norman Foster",
                "credit_id": "52fe4440c3a36847f808b099",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Joshua Collins Stamberg (born January 4, 1970) is an American actor. He was a regular cast member in the Lifetime comedy-drama series Drop Dead Diva from 2009 to 2012 and later had recurring roles on Parenthood, The Affair, and WandaVision.\n\nStamberg was born in Washington, D.C., the son of journalist Susan Stamberg and Louis C. Stamberg. He attended the University of Wisconsin–Madison.\n\nStamberg appeared in numerous television shows, including Nashville, Law & Order, CSI: Miami, Grey's Anatomy, and Parenthood. He also appeared in the Lie to Me pilot. Stamberg appears as S.W.O.R.D. Director Tyler Hayward in the WandaVision Marvel series on Disney+. His film appearances include Fracture, Must Love Dogs, and Kate & Leopold.\n\nIn 2020, Stamberg appeared as a guest on Studio 60 on the Sunset Strip and in the marathon fundraiser episode of The George Lucas Talk Show.\n\nHe was married to actress Myndy Crist. They have two daughters.\n\nDescription above from the Wikipedia article Josh Stamberg, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1970-01-04",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 21882,
        "imdb_id": "nm0821817",
        "known_for_department": "Acting",
        "name": "Josh Stamberg",
        "place_of_birth": "Washington, District of Columbia, USA",
        "popularity": 0.9075,
        "profile_path": "/h3WKQr0771BfvrDWpqxOVUlZCOm.jpg"
    }
}