{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zd3p7GKopxH4rIjGoDQ1ugalUtx.jpg",
                "genre_ids": [
                    16,
                    10751,
                    10770,
                    12
                ],
                "id": 13382,
                "original_language": "en",
                "original_title": "Rudolph the Red-Nosed Reindeer",
                "overview": "Sam the snowman tells us the story of a young red-nosed reindeer who, after being ousted from the reindeer games because of his glowing nose, teams up with Hermey, an elf who wants to be a dentist, and Yukon Cornelius, the prospector. They run into the Abominable Snowman and find a whole island of misfit toys. Rudolph vows to see if he can get Santa to help the toys, and he goes back to the North Pole on Christmas Eve. But Santa's sleigh is fogged in. But when Santa looks over Rudolph, he gets a very bright idea...",
                "popularity": 1.4002,
                "poster_path": "/xjAElUhXuc7zFJPj3qUHjcySNsE.jpg",
                "release_date": "1964-12-06",
                "title": "Rudolph the Red-Nosed Reindeer",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 619,
                "character": "Head Elf / Spotted Elephant / Other Toys (voice)",
                "credit_id": "52fe45629251416c750548d5",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Carl Banas, born on January 23, 1929 in Toronto, is a retired radio personality and actor. He is well-known for his voice roles in popular shows like Rudolph the Red-Nosed Reindeer, Rocket Robin Hood, and The Raccoons: Let’s Dance!\n\nApart from his voice acting career, Carl Banas also appeared on television as a police detective named Byron James in the series Wojeck. He lent his voice to various TV series and features, showcasing his talent and versatility.\n\nIn addition to his on-screen work, Banas was a beloved radio personality on different Toronto radio stations. His deep voice, smooth manner, and captivating stories about Toronto made him a favorite among listeners.\n\nBanas also made his mark in the world of commercials and cartoons, recording voices for numerous TV advertisements and animated shows. Interestingly, he is one of the three surviving cast members from Spider-Man, along with Paul Soles (Spider-Man) and Alfie Scopp (Stan Patterson). All three of them also lent their voices to Rudolph the Red-Nosed Reindeer, with Banas portraying the head elf among other characters.",
        "birthday": "1929-01-23",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 219027,
        "imdb_id": "nm0051552",
        "known_for_department": "Acting",
        "name": "Carl Banas",
        "place_of_birth": " Toronto, Ontario, Canada",
        "popularity": 0.6374,
        "profile_path": "/3mfvy178KRrKp7JKqwejCMACwEp.jpg"
    }
}