{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/e7cTxDnHGQIozy0Os5r6HauL1Gz.jpg",
                "genre_ids": [
                    10402,
                    18,
                    35
                ],
                "id": 10654,
                "original_language": "en",
                "original_title": "Hair",
                "overview": "Upon receiving his draft notice and leaving his family ranch in Oklahoma, Claude heads to New York and befriends a tribe of long-haired hippies on his way to boot camp.",
                "popularity": 2.7009,
                "poster_path": "/z0ctToyPWCB2RgIkMpD6RhRKAeH.jpg",
                "release_date": "1979-03-15",
                "title": "Hair",
                "video": false,
                "vote_average": 7.28,
                "vote_count": 696,
                "character": "Dancer",
                "credit_id": "64fdd830e0ca7f00ae3e3620",
                "order": 61
            },
            {
                "adult": false,
                "backdrop_path": "/4i3Amppd6eW5Qkhjv4gdHk3CCoE.jpg",
                "genre_ids": [
                    36,
                    10402,
                    18
                ],
                "id": 279,
                "original_language": "en",
                "original_title": "Amadeus",
                "overview": "Disciplined Italian composer Antonio Salieri becomes consumed by jealousy and resentment towards the hedonistic and remarkably talented young Salzburger composer Wolfgang Amadeus Mozart.",
                "popularity": 5.9174,
                "poster_path": "/1n5VUlCqgmVax1adxGZm8oCFaKc.jpg",
                "release_date": "1984-09-19",
                "title": "Amadeus",
                "video": false,
                "vote_average": 8.026,
                "vote_count": 4488,
                "character": "Dancer",
                "credit_id": "667978d3baba664776d9788a",
                "order": 65
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Richard Colton performed with Twyla Tharp Dance from 1977 to 1988 and was a member of the Joffrey Ballet and American Ballet Theatre. He was a guest performer and teacher with the White Oak Dance Project, directed by Mikhail Baryshnikov, and has staged the works of Twyla Tharp for the Paris Opera Ballet, American Ballet Theatre, and Twyla Tharp Dance, where he served as rehearsal director. Mr. Colton appeared in the films Hair and Amadeus, directed by Milos Foreman, the PBS Great Performances presentation of \"The Catherine Wheel,\" and on Broadway in Singing in the Rain. Mr. Colton currently co-directs SPENCER/COLTON, a company of dancers and actors formed in 1989 to perform his work in collaboration with Amy Spencer. The company, based in Boston, has been presented by Jacobs Pillow, Boston Dance Umbrella, the American Repertory Theater Fall Festival, Harvard Summer Dance Performance Series, Lincoln Center Out-of-Doors, and New York's Dance Theater Workshop. Mr. Colton has choreographed the A.R.T. productions of The Cherry Orchard; Henry V; The Threepenny Opera, directed by Ron Daniels; and Ubu Rock, directed by Andrei Belgrader. Each year since 1989, in collaboration with Amy Spencer, he has created an original dance-theater work with the actors of the American Repertory Theater/Moscow Art Theater Institute for Advanced Theater Training at Harvard University. Mr. Colton has choreographed productions for Trinity Repertory Theatre, Boston Conservatory Dance Theatre, and the Boston Ballet. He is currently on the faculty of the Boston Conservatory and co-directs the dance program at Concord Academy.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2191218,
        "imdb_id": "nm0173313",
        "known_for_department": "Acting",
        "name": "Richard Colton",
        "place_of_birth": "Hudson, New York, U.S.",
        "popularity": 0.0143,
        "profile_path": null
    }
}