{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4i3Amppd6eW5Qkhjv4gdHk3CCoE.jpg",
                "genre_ids": [
                    36,
                    10402,
                    18
                ],
                "id": 279,
                "original_language": "en",
                "original_title": "Amadeus",
                "overview": "Disciplined Italian composer Antonio Salieri becomes consumed by jealousy and resentment towards the hedonistic and remarkably talented young Salzburger composer Wolfgang Amadeus Mozart.",
                "popularity": 5.9174,
                "poster_path": "/1n5VUlCqgmVax1adxGZm8oCFaKc.jpg",
                "release_date": "1984-09-19",
                "title": "Amadeus",
                "video": false,
                "vote_average": 8.026,
                "vote_count": 4488,
                "character": "Dancer",
                "credit_id": "66797a1d645d3186d4d97f53",
                "order": 74
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "William Whitener has performed worldwide and on Broadway with The Joffrey Ballet, Twyla Tharp Dance, Bob Fosse's Dancin', New York City Opera and Martha Clarke's Garden of Earthly Delights. He choreographed over sixty dances for Boston Ballet, Pacific Northwest Ballet, Kansas City Ballet, the Royal Winnipeg Ballet, Les Ballets Jazz de Montreal, Ballet Hispanico, Seattle Repertory Theater, Seattle Opera and John Curry's Ice Theatre. He has also created dances for stage and television for Ann Reinking, Tommy Tune, Bill Irwin and Faith Prince and staged the debut of American Ballroom Theater at The Kennedy Center and BAM. Mr. Whitener has set Twyla Tharp's ballets in the U.S and France and assisted Mr. Robbins with pre-production for Jerome Robbins' Broadway. He served as Artistic Director for the Royal Winnipeg Ballet, Les Ballets Jazz de Montreal and Kansas City Ballet. He was an evaluator for the International Ballet Competition in Jackson, Mississippi, a jury member of Benois de la Danse and has served on a variety of panels including the NEA and Pew Charitable Trust Fund. He has taught ballet, modern dance and composition at Harvard University Summer Dance, Cornish College of the Arts, University of Washington, Pacific Northwest Ballet and was the Director of Dance at Concord Academy. In 2021, Mr. Whitener became a member of The Advisory Board for The Ann Reinking Scholarship Program and joined The Clive and Valerie Barnes Foundation as an Awards Panelist",
        "birthday": "1951-08-17",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.williamwhitener.com/",
        "id": 2191219,
        "imdb_id": "nm1500859",
        "known_for_department": "Acting",
        "name": "William Whitener",
        "place_of_birth": "Seattle, WA, USA",
        "popularity": 0.0143,
        "profile_path": null
    }
}