{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yFkUPqBuUnbhYbQL8VFpTrAT9za.jpg",
                "genre_ids": [
                    18,
                    878,
                    9648
                ],
                "id": 686,
                "original_language": "en",
                "original_title": "Contact",
                "overview": "A radio astronomer receives the first extraterrestrial radio signal ever picked up on Earth. As the world powers scramble to decipher the message and decide upon a course of action, she must make some difficult decisions between her beliefs, the truth, and reality.",
                "popularity": 6.2788,
                "poster_path": "/bCpMIywuNZeWt3i5UMLEIc0VSwM.jpg",
                "release_date": "1997-07-11",
                "title": "Contact",
                "video": false,
                "vote_average": 7.435,
                "vote_count": 4709,
                "character": "British Anchor",
                "credit_id": "5908c615925141643b010e31",
                "order": 31
            }
        ],
        "crew": []
    },
    "details": {
        "adult": true,
        "also_known_as": [
            "Ian Timothy Whitcomb"
        ],
        "biography": "Ian Timothy Whitcomb (10 July 1941 – 19 April 2020) was an English entertainer, singer-songwriter, record producer, writer, broadcaster and actor. As part of the British Invasion, his hit song \"You Turn Me On\" reached number 8 on the Billboard Hot 100 chart in 1965.\n\nHe wrote several books on popular music, beginning with After the Ball, published by Penguin Books (Britain) and Simon & Schuster (United States) in 1972. He accompanied his singing by playing the ukulele and, through his records, concerts, and film work, helped to stimulate the revival of interest in the instrument. His re-creation of the music played aboard the RMS Titanic in the film of that name won a Grammy Award in 1998 for package design and a nomination for Whitcomb's liner notes (Titanic: Music as Heard on the Fateful Voyage).",
        "birthday": "1941-07-10",
        "deathday": "2020-04-19",
        "gender": 2,
        "homepage": null,
        "id": 219237,
        "imdb_id": "nm0924369",
        "known_for_department": "Acting",
        "name": "Ian Whitcomb",
        "place_of_birth": "Woking, Surrey, England, UK",
        "popularity": 0.648,
        "profile_path": "/raTbVYRwxgIP455N9w1XHW0fVoT.jpg"
    }
}