{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/syapU4X3vYBCdARyAOtz3g90hMt.jpg",
                "genre_ids": [
                    53,
                    18,
                    80
                ],
                "id": 1900,
                "original_language": "en",
                "original_title": "Traffic",
                "overview": "An exploration of the United States of America's war on drugs from multiple perspectives. For the new head of the Office of National Drug Control Policy, the war becomes personal when he discovers his well-educated daughter is abusing cocaine within their comfortable suburban home. In Mexico, a flawed, but noble policeman agrees to testify against a powerful general in league with a cartel, and in San Diego, a drug kingpin's sheltered trophy wife must learn her husband's ruthless business after he is arrested, endangering her luxurious lifestyle.",
                "popularity": 4.9867,
                "poster_path": "/v6YrfR1e2OUAYbXrJ7hv3EiGNcg.jpg",
                "release_date": "2000-12-27",
                "title": "Traffic",
                "video": false,
                "vote_average": 7.081,
                "vote_count": 2261,
                "character": "DEA Representative",
                "credit_id": "5f8471eacba36f003735dc25",
                "order": 92
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Michael Siegel"
        ],
        "biography": "Mike Siegel is a professional stand-up comedian, TV host and actor. For nine years, he could be seen nationally every week hosting TBS network’s TBS Movie EXTRA, and has hosted numerous network shows including HGTV’s  If Walls Could Talk and What You Get For the Money; GSN Live on the Game Show Network; and The Next GAC Star on GAC.\n\nMike's 1/2 hour comedy special, \"Have Jokes Will Travel,\" can currently be seen on DrybarComedy.com and YouTube. He has performed stand-up comedy on many network television shows, including Last Comic Standing (NBC), The Late Late Show (CBS), Late Friday (NBC), Comedy Showcase with Louie Anderson (NBC), Stand-up, Stand-up (Comedy Central), and Friday Night (NBC). He also made numerous appearances as a panelist on E! network’s hit show Chelsea Lately.\n\nMike’s also been seen on the small screen as an actor. He was a recurring guest star on the CBS drama JAG, and had supporting roles in such shows as Mike and Molly (CBS), Rules of Engagement (ABC) , 24 (FOX),  Prison Break (FOX), Better Off Ted (ABC), Less Than Perfect (ABC), Eve (UPN), Strong Medicine (Lifetime), Andy Richter Controls the Universe (FOX), and Sabrina (WB).",
        "birthday": "1967-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.funnymike.com/",
        "id": 2202521,
        "imdb_id": "nm0796987",
        "known_for_department": "Acting",
        "name": "Mike Siegel",
        "place_of_birth": "Chicago, Illinois, U.S.",
        "popularity": 0.2005,
        "profile_path": "/4dBDdK039bOB0zEzdRMlTmOdcSc.jpg"
    }
}