{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hSmX0ZyYZk2ECIWtJ1JSHINPZIK.jpg",
                "genre_ids": [
                    9648,
                    80,
                    53
                ],
                "id": 910,
                "original_language": "en",
                "original_title": "The Big Sleep",
                "overview": "Private Investigator Philip Marlowe is hired by wealthy General Sternwood regarding a matter involving his youngest daughter Carmen. Before the complex case is over, Marlowe sees murder, blackmail, deception, and what might be love.",
                "popularity": 3.8525,
                "poster_path": "/lraHo9D8c0YWfxsKqT5P5sVqMKN.jpg",
                "release_date": "1946-08-23",
                "title": "The Big Sleep",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 1091,
                "character": "Chief Inspector Bernie Ohls",
                "credit_id": "52fe428bc3a36847f80271bb",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/ihoQaiMFAz4YCTAaSIsQjRknsNH.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 3085,
                "original_language": "en",
                "original_title": "His Girl Friday",
                "overview": "Walter Burns is an irresistibly conniving newspaper publisher desperate to woo back his paper’s star reporter, who also happens to be his estranged wife. She’s threatening to quit and settle down with a new beau, but, as Walter knows, she has a weakness: she can’t resist a juicy scoop.",
                "popularity": 3.8745,
                "poster_path": "/lu86Y9zTPH3neCiUzLzHCEFHf7f.jpg",
                "release_date": "1940-01-18",
                "title": "His Girl Friday",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 878,
                "character": "Sanders",
                "credit_id": "52fe4384c3a36847f805a191",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/dYv4io2HcRMxFGgnErTbvpqSGXe.jpg",
                "genre_ids": [
                    53,
                    9648,
                    10749
                ],
                "id": 4174,
                "original_language": "en",
                "original_title": "Spellbound",
                "overview": "When Dr. Anthony Edwardes arrives at a Vermont mental hospital to replace the outgoing hospital director, Dr. Constance Peterson, a psychoanalyst, discovers Edwardes is actually an impostor. The man confesses that the real Dr. Edwardes is dead and fears he may have killed him, but cannot recall anything. Dr. Peterson, however is convinced his impostor is innocent of the man's murder, and joins him on a quest to unravel his amnesia through psychoanalysis.",
                "popularity": 3.8203,
                "poster_path": "/dPAox7jGScLBvxKLeRptJIBF7v.jpg",
                "release_date": "1945-11-08",
                "title": "Spellbound",
                "video": false,
                "vote_average": 7.419,
                "vote_count": 924,
                "character": "Det. Sgt. Gillespie",
                "credit_id": "52fe43b0c3a36847f8067ea3",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "John Regis Toomey",
            "John Francis Regis Toomey"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nJohn Regis Toomey (August 13, 1898 – October 12, 1991) was an American film and television actor.\n\nBorn in Pittsburgh, Pennsylvania, USA, he was one of four children of Francis X. and Mary Ellen Toomey and attended Peabody High School. He initially pondered a law career, but acting won out and he established himself as a musical stage performer.\n\nEducated in dramatics at the University of Pittsburgh, where he became a brother of Sigma Chi, Toomey began as a stock actor and eventually made it to Broadway. Toomey was a singer on stage until throat problems (acute laryngitis) while touring in Europe stopped that aspect of his career. In 1929, Toomey first began appearing in films. He initially started out as a leading man, but found more success as a character actor (sans his toupee).\n\nToomey appeared in over 180 films, including classics such as The Big Sleep with Humphrey Bogart. In 1956, he appeared as a judge, with Chuck Connors as \"Andy\", in the third episode, \"The Nevada Nightingale\", of the NBC anthology series The Joseph Cotten Show. Toomey thereafter appeared in another anthology series too as the character \"Harry\" in the 1960 episode \"The Doctor and the Redhead\", with Dick Powell and Felicia Farr, of CBS's The DuPont Show with June Allyson. In the 1961–1962 television season, he appeared in a supporting role with George Nader in the syndicated crime drama Shannon about insurance investigators. From 1963–1966, Toomey was one of the stars of the ABC crime drama, Burke's Law, starring Gene Barry. He played Sergeant Les Hart, one of the detectives assisting the murder investigations of the millionaire police captain Amos Burke. He also guest-starred on dozens of television programs, including the \"Shady Deal at Sunny Acres\" episode of Maverick.\n\nIn 1941, Toomey appeared in You're in the Army Now, in which he and Jane Wyman had the longest screen kiss in cinema history: 3 minutes and 5 seconds.",
        "birthday": "1898-08-11",
        "deathday": "1991-10-12",
        "gender": 2,
        "homepage": null,
        "id": 22093,
        "imdb_id": "nm0867538",
        "known_for_department": "Acting",
        "name": "Regis Toomey",
        "place_of_birth": "Pittsburgh, Pennsylvania, USA",
        "popularity": 0.5175,
        "profile_path": "/fBaA8glCL6YOMX8O58a3s3yJy4P.jpg"
    }
}