{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9AjG0YJLgDUtHl5KgrThHPhNNwZ.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 3083,
                "original_language": "en",
                "original_title": "Mr. Smith Goes to Washington",
                "overview": "After the death of a United States Senator, idealistic Jefferson Smith is appointed as his replacement in Washington. Soon, the naive and earnest new senator has to battle political corruption.",
                "popularity": 2.8661,
                "poster_path": "/nDjg1fbNyq15excNDl3acd2IqAk.jpg",
                "release_date": "1939-10-19",
                "title": "Mr. Smith Goes to Washington",
                "video": false,
                "vote_average": 7.843,
                "vote_count": 1118,
                "character": "Senate Reporter (uncredited)",
                "credit_id": "52fe4384c3a36847f805a043",
                "order": 52
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "William Sterling Hart"
        ],
        "biography": "Robert Sterling, born William Sterling Hart (November 13, 1917 – May 30, 2006) was an American film and television actor.\n\nThe son of baseball player and umpire Bill Hart, he was born in New Castle, Pennsylvania. He attended the University of Pittsburgh and worked as a clothing salesman before pursuing an acting career.\n\nAfter signing with Columbia Pictures in 1939, he changed his name to Robert Sterling to avoid confusion with silent western star William S. Hart. In 1941, Sterling went to MGM. He worked steadily as a supporting player for several years. After serving in World War II as an Army Air Force flight instructor, he returned to Hollywood, but by the end of the decade, his film career had faltered. He did, however, play the non-singing role of Steve Baker, opposite Ava Gardner as Julie, in the hit MGM 1951 film version of Show Boat.\n\nSterling later revived his acting career on the small screen with numerous appearances on Television.",
        "birthday": "1917-11-13",
        "deathday": "2006-05-30",
        "gender": 2,
        "homepage": null,
        "id": 22091,
        "imdb_id": "nm0827577",
        "known_for_department": "Acting",
        "name": "Robert Sterling",
        "place_of_birth": "New Castle, Pennsylvania, USA",
        "popularity": 0.2347,
        "profile_path": "/h2sO7GgeSQiRkDzx0YJtK2QtNNN.jpg"
    }
}