{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/odKqOY6VE6C59YAdGHB0b5Havye.jpg",
                "genre_ids": [
                    10751,
                    12,
                    14
                ],
                "id": 615666,
                "original_language": "en",
                "original_title": "A Boy Called Christmas",
                "overview": "An ordinary young boy called Nikolas sets out on an extraordinary adventure into the snowy north in search of his father who is on a quest to discover the fabled village of the elves, Elfhelm. Taking with him a headstrong reindeer called Blitzen and a loyal pet mouse, Nikolas soon meets his destiny in this magical and endearing story that proves nothing is impossible…",
                "popularity": 2.8109,
                "poster_path": "/1sRejtiHOZGggZd9RcmdqbapLM5.jpg",
                "release_date": "2021-11-24",
                "title": "A Boy Called Christmas",
                "video": false,
                "vote_average": 7.315,
                "vote_count": 765,
                "character": "Nikolas",
                "credit_id": "6160eac4c8a2d4008c84428c",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Henry Lawfull is a rising star set to make a name for himself on the golden screen. He has just wrapped on star-studded feature film THE SCURRY alongside Rhys Ifans, Ella Purnell and Paapa Essiedu, and directed by Craig Roberts.\n\nHe also joins the thriller film ON THE SEA in a leading role alongside Barry Ward, directed by Helen Walsh, and has just wrapped on the 8-part series THE COUNT OF MONTE CRISTO as series regular Gaston.  He has also just been seen in Daniel Kaluuya's new feature THE KITCHEN, which was chosen as the closing film at the London Film Festival 2023. Henry also previously starred as the lead in the Christmas movie A BOY CALLED CHRISTMAS opposite acting greats including Dame Maggie Smith, Jim Broadbent & Toby Jones",
        "birthday": "2006-07-13",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2209728,
        "imdb_id": "nm9993535",
        "known_for_department": "Acting",
        "name": "Henry Lawfull",
        "place_of_birth": "United Kingdom",
        "popularity": 0.626,
        "profile_path": "/csiZffsmwifkFrd91APNnJwCCw1.jpg"
    }
}