{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/k2ZdjMXmqnw4RJeh8cwxCvcznJZ.jpg",
                "genre_ids": [
                    18
                ],
                "id": 50014,
                "original_language": "en",
                "original_title": "The Help",
                "overview": "Aibileen Clark is a middle-aged African-American maid who has spent her life raising white children and has recently lost her only son; Minny Jackson is an African-American maid who has often offended her employers despite her family's struggles with money and her desperate need for jobs; and Eugenia \"Skeeter\" Phelan is a young white woman who has recently moved back home after graduating college to find out her childhood maid has mysteriously disappeared. These three stories intertwine to explain how life in Jackson, Mississippi revolves around \"the help\"; yet they are always kept at a certain distance because of racial lines.",
                "popularity": 11.3368,
                "poster_path": "/3kmfoWWEc9Vtyuaf9v5VipRgdjx.jpg",
                "release_date": "2011-08-09",
                "title": "The Help",
                "video": false,
                "vote_average": 8.204,
                "vote_count": 8680,
                "character": "Jolene French",
                "credit_id": "52fe47b5c3a36847f8144077",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/2sE6hrwfn9IV7eDlMvpIb9q1EWy.jpg",
                "genre_ids": [
                    35,
                    10402,
                    10749
                ],
                "id": 114150,
                "original_language": "en",
                "original_title": "Pitch Perfect",
                "overview": "College student Beca knows she does not want to be part of a clique, but that's exactly where she finds herself after arriving at her new school. Thrust in among mean gals, nice gals and just plain weird gals, Beca finds that the only thing they have in common is how well they sing together. She takes the women of the group out of their comfort zone of traditional arrangements and into a world of amazing harmonic combinations in a fight to the top of college music competitions.",
                "popularity": 5.6111,
                "poster_path": "/gsFoJk9g8W3zgaipRrrURk7LbiF.jpg",
                "release_date": "2012-09-28",
                "title": "Pitch Perfect",
                "video": false,
                "vote_average": 7.28,
                "vote_count": 6698,
                "character": "Aubrey Posen",
                "credit_id": "52fe4b46c3a36847f81fb80b",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Anna Ragsdale Camp",
            "안나 캠프",
            "애나 캠프",
            "Άνα Καμπ",
            "アンナ・キャンプ",
            "آنا کمپ",
            "Anne Camp"
        ],
        "biography": "Anna Ragsdale Camp (born September 27, 1982) is an American actress, model and singer. She is known for her role as Sarah Newlin in True Blood, and her recurring roles in Mad Men, The Good Wife, and The Mindy Project. She is also known for her role as Aubrey Posen in Pitch Perfect (2012), Pitch Perfect 2 (2015), and Pitch Perfect 3 (2017). She made her Broadway debut in the 2008 production of A Country House and played Jill Mason in the 2008 Broadway revival of Equus. In 2012, she was nominated for a Drama Desk Award for her performance in the Off-Broadway play All New People. Camp played Jane Hollander, a researcher for the fictitious News of the Week magazine in the Amazon series Good Girls Revolt. She also had a role in the 2011 film The Help.",
        "birthday": "1982-09-27",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 221098,
        "imdb_id": "nm2319871",
        "known_for_department": "Acting",
        "name": "Anna Camp",
        "place_of_birth": "Aiken, South Carolina, USA",
        "popularity": 1.7539,
        "profile_path": "/32H0SJbTK3tvLVgf3X1aiaUdcxe.jpg"
    }
}