{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/iKUwhA4DUxMcNKu5lLSbDFwwilk.jpg",
                "genre_ids": [
                    14,
                    28,
                    12
                ],
                "id": 453395,
                "original_language": "en",
                "original_title": "Doctor Strange in the Multiverse of Madness",
                "overview": "Doctor Strange, with the help of mystical allies both old and new, traverses the mind-bending and dangerous alternate realities of the Multiverse to confront a mysterious new adversary.",
                "popularity": 13.4427,
                "poster_path": "/ddJcSKbcp4rKZTmuyWaMhuwcfMz.jpg",
                "release_date": "2022-05-04",
                "title": "Doctor Strange in the Multiverse of Madness",
                "video": false,
                "vote_average": 7.248,
                "vote_count": 9770,
                "character": "Rintrah (voice)",
                "credit_id": "61bf69eaa84ff700417e14df",
                "order": 16
            },
            {
                "adult": false,
                "backdrop_path": "/vDQwbN2ymkMQ8ldL3Sc275FGBw3.jpg",
                "genre_ids": [
                    10752,
                    36,
                    53
                ],
                "id": 530915,
                "original_language": "en",
                "original_title": "1917",
                "overview": "At the height of the First World War, two young British soldiers must cross enemy territory and deliver a message that will stop a deadly attack on hundreds of soldiers.",
                "popularity": 9.7606,
                "poster_path": "/iZf0KyrE25z1sage4SYFLCCrMi9.jpg",
                "release_date": "2019-12-25",
                "title": "1917",
                "video": false,
                "vote_average": 7.987,
                "vote_count": 12990,
                "character": "Private Atkins",
                "credit_id": "649e6c0c091e62012d9eb195",
                "order": 25
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "애덤 휴질"
        ],
        "biography": "Adam Hugill is an award-winning actor from Yorkshire who starred in the BAFTA-winning 2022 BBC drama series ‘Sherwood’ opposite David Morrissey and Adeel Akhtar.  He played Scott Rowley, a serial killer who terrorised a Nottinghamshire village with a crossbow. He reprised the role in the acclaimed second series in 2024.  He gained industry recognition when winning Best Actor in a Musical at The Stage Debut Awards for ‘Standing at the Sky’s Edge’ when it premiered at the Sheffield Crucible in 2019. More recently on stage he played Harry Maguire in the National Theatre’s 2024 production of Olivier Award-winning play ‘Dear England’ by James Graham, as well as major roles in award-winning historical play '1536' at The Almeida in 2025 and in ‘Reykjavik’ at the Hampstead Theatre in late 2024.\n\nHis breakthrough role was in 2019 when he landed the role of Private Atkins in Sam Mendes’ epic war film ‘1917’, which went on to win 3 Academy Awards, 2 Golden Globes and 7 BAFTAs. The British film also starred Colin Firth, George Mackay and Andrew Scott.  2025 saw him in a major role in the BBC One adaptation of Agatha Christie’s ‘Towards Zero’, which also starred Anjelica Houston, Oliver Jackson-Cohen and Matthew Rhys. He played Mac, the mysterious gentleman's valet to Oliver Jackson-Cohen's character.\n\nOther film credits include ‘How to Stop a Recurring Dream’, which won a number of awards on the independent film circuit, and the gothic horror film ‘The Banishing’. In 2022 he was the voice of Rintrah, a minotaur-like being, in Marvel Studios’ superhero film ‘Doctor Strange in the Multiverse of Madness’, which starred Benedict Cumberbatch.  In 2021 he starred as leading character Constable Carrot Ironfoundersson in BBC America’s action-fantasy series ‘The Watch’, based on the book by Terry Pratchett. Additional TV credits include BBC drama series ‘World on Fire’ and DC Comics crime action series ‘Pennyworth’.  Adam hails from Doncaster and speaks with a light South Yorkshire accent which he can strengthen or lose as required.  He is comfortable with most Northern accents, in particular East Yorkshire & Manchester, and other accents in his repertoire include Scottish, General American, London and West Country. He uses a neutral or RP accent in much of his acting and has an excellent Nottingham accent which he learned for his role in Sherwood.",
        "birthday": "1997-07-22",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.independenttalent.com/actors/adam-hugill/",
        "id": 2211274,
        "imdb_id": "nm9273822",
        "known_for_department": "Acting",
        "name": "Adam Hugill",
        "place_of_birth": "Doncaster, Yorkshire, England, UK",
        "popularity": 0.3223,
        "profile_path": "/o0XToJB2MrTtNm5n2g3UYxcMNrV.jpg"
    }
}