{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zDvBalLNASMJ8MtlQPDaRE9VINF.jpg",
                "genre_ids": [
                    80,
                    9648,
                    53,
                    28,
                    18
                ],
                "id": 2163,
                "original_language": "en",
                "original_title": "Breakdown",
                "overview": "On their cross-country drive, a married couple, Jeff and Amy Taylor, experience car trouble after their SUV breaks down. Stranded in the New Mexico desert, the two catch a break when a passing truck driver offers Amy a ride to a nearby café to call for help. Meanwhile, Jeff is able to fix the car and make his way to the café, but Amy isn't there. He tracks down the trucker -- who tells the police he's never seen Jeff or his wife before. Jeff then begins a desperate, frenzied search for Amy.",
                "popularity": 3.3422,
                "poster_path": "/m3VB59ppr1RlpxNUYRUfZTgjgU.jpg",
                "release_date": "1997-05-02",
                "title": "Breakdown",
                "video": false,
                "vote_average": 6.904,
                "vote_count": 1014,
                "character": "Earl",
                "credit_id": "52fe433cc3a36847f8044bfb",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/zmuRxro8AxPDjACjXTIIDCUNwDl.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749
                ],
                "id": 9675,
                "original_language": "en",
                "original_title": "Sideways",
                "overview": "Two middle-aged men embark on a spiritual journey through Californian wine country. One is an unpublished novelist suffering from depression, and the other is only days away from walking down the aisle.",
                "popularity": 3.4529,
                "poster_path": "/zOsaxYLgvZVU7cJBpPn8CuE0MrP.jpg",
                "release_date": "2004-10-22",
                "title": "Sideways",
                "video": false,
                "vote_average": 7.111,
                "vote_count": 1756,
                "character": "Cammi's Husband",
                "credit_id": "52fe4519c3a36847f80bc773",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/n2eUT4zQA2yYcKOgAFidgOyiFoH.jpg",
                "genre_ids": [
                    18,
                    37
                ],
                "id": 68718,
                "original_language": "en",
                "original_title": "Django Unchained",
                "overview": "With the help of a German bounty hunter, a freed slave sets out to rescue his wife from a brutal Mississippi plantation owner.",
                "popularity": 12.4836,
                "poster_path": "/7oWY8VDWW7thTzWh3OKYRkWUlD5.jpg",
                "release_date": "2012-12-25",
                "title": "Django Unchained",
                "video": false,
                "vote_average": 8.184,
                "vote_count": 27058,
                "character": "Big John Brittle",
                "credit_id": "52fe479fc3a368484e0d1311",
                "order": 25
            },
            {
                "adult": false,
                "backdrop_path": "/cWczNud8Y8i8ab0Z4bxos4myWYO.jpg",
                "genre_ids": [
                    16,
                    10751,
                    12
                ],
                "id": 38757,
                "original_language": "en",
                "original_title": "Tangled",
                "overview": "Feisty teenager Rapunzel, who has long and magical hair, wants to go and see sky lanterns on her eighteenth birthday, but she's bound to a tower by her overprotective mother. She strikes a deal with Flynn Rider, a charming wanted thief, and the duo set off on an action-packed escapade.",
                "popularity": 17.5039,
                "poster_path": "/ym7Kst6a4uodryxqbGOxmewF235.jpg",
                "release_date": "2010-11-24",
                "title": "Tangled",
                "video": false,
                "vote_average": 7.611,
                "vote_count": 11925,
                "character": "Captain of the Guard (voice)",
                "credit_id": "53254b82c3a36824b500886a",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/fny1B9hmVilFtU3RRjkMZffBjUi.jpg",
                "genre_ids": [
                    878,
                    10749,
                    18
                ],
                "id": 9663,
                "original_language": "en",
                "original_title": "Starman",
                "overview": "When an alien takes the form of a young widow's husband and asks her to drive him from Wisconsin to Arizona, the government tries to stop them.",
                "popularity": 4.6072,
                "poster_path": "/cgDeFWkYi6e9FT5RiQPCbQ9HlXZ.jpg",
                "release_date": "1984-12-13",
                "title": "Starman",
                "video": false,
                "vote_average": 6.946,
                "vote_count": 923,
                "character": "Cop #2",
                "credit_id": "5c8c38fac3a3686119475574",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Mike Gainey ",
            "Mike Connor Gainey ",
            "M. C. Gainey",
            "MC Gainey",
            "М. К. Гейни",
            "Michael Connor Gainey",
            "ام. سی. گینی"
        ],
        "biography": "​From Wikipedia, the free encyclopedia\n\nMike Connor Gainey (born January 18, 1948) is an American film and television actor whose distinctive mustache, 6'2½\" height, and threatening look have given him supporting roles as Southern/Southwestern types, thugs, and criminals. M.C. Gainley attended the University of Southern Mississippi prior to moving to California. He worked as an undertaker's apprentice before he decided to study acting. In the early 1970s he attended the American Conservatory Theater in San Francisco along with Ken Hixon. In 1981, he made his big-screen debut in the Steve Martin musical Pennies from Heaven. Since the early 1980s he has been in over 50 movies and made for TV movies, including Breakdown, Two Idiots in Hollywood, Con Air, The Mighty Ducks, Are We There Yet, Terminator 3, Sideways, and 2005's The Dukes of Hazzard. He was one of the stars of the short-lived television series Against the Law. He has guest starred on over 40 television shows, including The Dukes of Hazzard, Knight Rider, Designing Women, The Adventures of Brisco County, Jr., Walker, Texas Ranger, CSI, Cheers, Days of our Lives, The X-Files, Desperate Housewives, Burn Notice, The Fresh Prince of Bel-Air, and had a role as Tom Friendly on the series Lost, a character who appeared in 20 episodes, as many as some former main cast members. He also played the murderous drug dealer Bo Crowder in a recurring role in the 2010 season of the hit FX TV show Justifed. He attended the 2007 Emmys with Lost's show runners Damon Lindelof and Carlton Cuse. Gainey played Kurtz/The Wizard in the controversial road-revenge film Apocalypse Oz, a film containing no original dialogue as it is all taken from Apocalypse Now or The Wizard of Oz. In 2007 he appeared in a trio of films including Mr. Woodcock, Wild Hogs, and the sci/horror film Unearthed; in 2010 he appeared in Love Ranch. In 2010, he voiced one of the characters of the animated musical film Tangled as Captain of the Palace Guard.",
        "birthday": "1948-01-18",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 22132,
        "imdb_id": "nm0301370",
        "known_for_department": "Acting",
        "name": "M.C. Gainey",
        "place_of_birth": "Jackson, Mississippi, USA",
        "popularity": 0.738,
        "profile_path": "/nM82se0lOFbOhhj3J6tRFcdEydO.jpg"
    }
}