{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zDvBalLNASMJ8MtlQPDaRE9VINF.jpg",
                "genre_ids": [
                    80,
                    9648,
                    53,
                    28,
                    18
                ],
                "id": 2163,
                "original_language": "en",
                "original_title": "Breakdown",
                "overview": "On their cross-country drive, a married couple, Jeff and Amy Taylor, experience car trouble after their SUV breaks down. Stranded in the New Mexico desert, the two catch a break when a passing truck driver offers Amy a ride to a nearby café to call for help. Meanwhile, Jeff is able to fix the car and make his way to the café, but Amy isn't there. He tracks down the trucker -- who tells the police he's never seen Jeff or his wife before. Jeff then begins a desperate, frenzied search for Amy.",
                "popularity": 2.9695,
                "poster_path": "/m3VB59ppr1RlpxNUYRUfZTgjgU.jpg",
                "release_date": "1997-05-02",
                "title": "Breakdown",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 1015,
                "character": "Billy",
                "credit_id": "52fe433cc3a36847f8044bff",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/qHXdyDBgetOyetVkWGzHYGp7L72.jpg",
                "genre_ids": [
                    12,
                    18,
                    36
                ],
                "id": 7305,
                "original_language": "en",
                "original_title": "Alive",
                "overview": "The amazing true story of a Uruguayan rugby team's plane that crashed in the middle of the Andes mountains, and their immense will to survive and pull through alive, forced to do anything and everything they could to stay alive on meager rations and through the freezing cold.",
                "popularity": 3.4042,
                "poster_path": "/uQACcCZqd7WCTRin9xRIW5gr1bd.jpg",
                "release_date": "1993-01-15",
                "title": "Alive",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 1513,
                "character": "Bobby François",
                "credit_id": "599885bac3a3682b810138f8",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nJack Noseworthy, Jr. (born December 21, 1964) is an American actor, whose most visible movie roles were perhaps A Place for Annie, Event Horizon and U-571.\n\nJack graduated from Lynn English High School in 1982 and attended Boston Conservatory, from where he has a BFA.\n\nNoseworthy was in Bon Jovi's music video \"Always\", with Carla Gugino and Keri Russell. He co-starred with Meryl Streep in the Public Theater's 2006 production of Mother Courage and Her Children. He also starred in a short-lived MTV drama series, Dead at 21. In December 2005, he originated the role of Armand in the musical Lestat during its pre-Broadway run at the Curran Theatre in San Francisco, but left the production during its first week of previews (he was replaced by actor Drew Sarich). He is also the only male actor to play Peter Pan in the musical adaptation, though he was only an understudy. He has Scottish ancestry.\n\nNoseworthy made his debut as a nightclub performer in September 2006, at the Metropolitan Room in New York City. His nightclub act, titled \"You Don't Know Jack!\", is directed by Gary Griffin. He is also in a Burbank musical at the Colony Theater called No Way To Treat A Lady written by Douglas J. Cohen. It opened on April 18, 2009.\n\nDescription above from the Wikipedia article Jack Noseworthy, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1964-12-21",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 22133,
        "imdb_id": "nm0005276",
        "known_for_department": "Acting",
        "name": "Jack Noseworthy",
        "place_of_birth": "Lynn, Massachusetts, USA",
        "popularity": 0.9558,
        "profile_path": "/gB89s2gEp2NL0vcYwegyxvV2oBn.jpg"
    }
}