{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/s2bqHApZlliCuwgyHod0qucrYqZ.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 2164,
                "original_language": "en",
                "original_title": "Stargate",
                "overview": "An interstellar teleportation device, found in Egypt, leads to a planet with humans resembling ancient Egyptians who worship the god Ra.",
                "popularity": 7.9019,
                "poster_path": "/4T6Po0XnZlevmhfPh3ZfEs5butR.jpg",
                "release_date": "1994-10-28",
                "title": "Stargate",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 3591,
                "character": "Catherine",
                "credit_id": "52fe433cc3a36847f8044ccb",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/8aqTmCHLkktH7RZNALeaOMneHSl.jpg",
                "genre_ids": [
                    27,
                    35
                ],
                "id": 16281,
                "original_language": "en",
                "original_title": "Creepshow",
                "overview": "Five grisly tales from a 1950s-style comic, including a murdered father rising from beyond, a bizarre meteor, a vengeful husband, a mysterious crate's occupant, and a plague of cockroaches.",
                "popularity": 2.7208,
                "poster_path": "/4SoyTCEpsgLjX6yAyMsx3AsAyRQ.jpg",
                "release_date": "1982-11-10",
                "title": "Creepshow",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 1089,
                "character": "Aunt Bedelia (segment \"Father's Day\")",
                "credit_id": "58bb47e1c3a368664d029fa9",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Elsa Viveca Torstensdotter Lindfors"
        ],
        "biography": "Viveca Lindfors (1920-1995) was a renowned Swedish-American actress known for her versatility and captivating performances on stage, in film, and on television. Born in Uppsala, Sweden, Lindfors developed a passion for the performing arts from a young age, honing her craft at the prestigious Royal Dramatic Theatre in Stockholm.\n\nIn 1946, Lindfors was brought to Hollywood by Warner Brothers in the hope that she would become a new Greta Garbo or Ingrid Bergman - two of Sweden's most famous cinematic exports. This marked the beginning of a prolific international career that would span several decades. Lindfors went on to appear in a wide range of acclaimed films, including the film noir classic \"I'll Cry Tomorrow\" and the psychological thriller \"The Addams Family.\"\n\nBeyond her on-screen work, Lindfors was also a respected theater actress, garnering critical acclaim for her portrayals of iconic roles such as Hedda Gabler and Medea. Her versatility and emotional depth were widely praised, and she was known for her ability to bring nuance and complexity to even the most challenging characters.\n\nIn addition to her acting work, Lindfors was also a dedicated educator and mentor, sharing her expertise and passion for the performing arts with aspiring actors and directors. She taught at several prestigious institutions, including the Actors Studio in New York, and was instrumental in nurturing the next generation of theatrical talent.\n\nThroughout her career, Lindfors received numerous accolades and honors, including a Primetime Emmy Award for her performance in the television film \"Testimony of Two Men.\" She was also recognized with a Lifetime Achievement Award from the Swedish Film Institute, cementing her status as one of the most respected and influential Swedish actors of the 20th century.",
        "birthday": "1920-12-29",
        "deathday": "1995-10-25",
        "gender": 1,
        "homepage": null,
        "id": 22137,
        "imdb_id": "nm0511798",
        "known_for_department": "Acting",
        "name": "Viveca Lindfors",
        "place_of_birth": "Uppsala, Uppsala län, Sweden",
        "popularity": 0.5192,
        "profile_path": "/5gs8qdR66iRG60hX3kmRTvP2AWF.jpg"
    }
}