{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2sE6hrwfn9IV7eDlMvpIb9q1EWy.jpg",
                "genre_ids": [
                    35,
                    10402,
                    10749
                ],
                "id": 114150,
                "original_language": "en",
                "original_title": "Pitch Perfect",
                "overview": "College student Beca knows she does not want to be part of a clique, but that's exactly where she finds herself after arriving at her new school. Thrust in among mean gals, nice gals and just plain weird gals, Beca finds that the only thing they have in common is how well they sing together. She takes the women of the group out of their comfort zone of traditional arrangements and into a world of amazing harmonic combinations in a fight to the top of college music competitions.",
                "popularity": 5.6111,
                "poster_path": "/gsFoJk9g8W3zgaipRrrURk7LbiF.jpg",
                "release_date": "2012-09-28",
                "title": "Pitch Perfect",
                "video": false,
                "vote_average": 7.28,
                "vote_count": 6698,
                "character": "Fat Amy",
                "credit_id": "52fe4b46c3a36847f81fb803",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/agoBZfL1q5G79SD0npArSlJn8BH.jpg",
                "genre_ids": [
                    35,
                    10752,
                    18
                ],
                "id": 515001,
                "original_language": "en",
                "original_title": "Jojo Rabbit",
                "overview": "A World War II satire that follows a lonely German boy whose world view is turned upside down when he discovers his single mother is hiding a young Jewish girl in their attic. Aided only by his idiotic imaginary friend, Adolf Hitler, Jojo must confront his blind nationalism.",
                "popularity": 6.7292,
                "poster_path": "/1mqL7VG4Ix8wmxwypmCA1HTHBky.jpg",
                "release_date": "2019-10-18",
                "title": "Jojo Rabbit",
                "video": false,
                "vote_average": 8.0,
                "vote_count": 9960,
                "character": "Fraulein Rahm",
                "credit_id": "5b0476b1925141095c02fb6f",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "레벨 윌슨",
            "Rebel Melanie Elizabeth Wilson",
            "瑞貝爾・威爾森",
            "رِبل ویلسون",
            "瑞貝爾威爾森"
        ],
        "biography": "Rebel Melanie Elizabeth Wilson (born March 2, 1980) is an Australian actress, comedian, writer, and producer. After graduating from the Australian Theatre for Young People in 2003, she began appearing as Toula in the Special Broadcasting Service (SBS) comedy series Pizza (2003–2007; 2019), and subsequently appeared in the sketch comedy series The Wedge (2006–2007). Wilson wrote, produced and starred in the musical comedy series Bogan Pride (2008). The following year, she won the Tropfest best actress award for her role in Bargain and made a guest appearance in City Homicide. Shortly after moving to the United States, Wilson appeared as Brynn in the feature film Bridesmaids (2011).\n\nIn 2012, Wilson appeared in the films What to Expect When You're Expecting, Struck by Lightning, and Bachelorette, which led to Variety naming her one of their “Top Ten Comics to Watch for 2012”. She also played the role of Fat Amy in the musical comedy Pitch Perfect film series (2012–2017), which earned her several award nominations and wins, including the MTV Movie Award for Best Breakthrough Performance and a Teen Choice Award for Choice Movie Actress. In 2016, Wilson appeared in the films How to Be Single and Grimsby.\n\nWilson wrote and starred in Super Fun Night (2013), a television sitcom that aired for one season on ABC. In 2019, she starred in her first lead role as Natalie in Isn't It Romantic, and went on to play Penny Rust in The Hustle, Jennyanydots in Cats, and Fraulein Rahm in Jojo Rabbit.",
        "birthday": "1980-03-02",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 221581,
        "imdb_id": "nm2313103",
        "known_for_department": "Acting",
        "name": "Rebel Wilson",
        "place_of_birth": "Sydney, New South Wales, Australia",
        "popularity": 0.9398,
        "profile_path": "/yuyRg1WaY616Uux3vP9ONsUjQTS.jpg"
    }
}