{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kVsFGeyGwK7gCY72sFjczY4dmDs.jpg",
                "genre_ids": [
                    18
                ],
                "id": 809140,
                "original_language": "en",
                "original_title": "Father Stu",
                "overview": "The true-life story of boxer-turned-priest. When an injury ends his amateur boxing career, Stuart Long moves to Los Angeles to find money and fame. While scraping by as a supermarket clerk, he meets Carmen, a Sunday school teacher who seems immune to his bad-boy charm. Determined to win her over, the longtime agnostic starts going to church to impress her. However, a motorcycle accident leaves him wondering if he can use his second chance to help others, leading to the surprising realization that he's meant to be a Catholic priest.",
                "popularity": 2.4068,
                "poster_path": "/pLAeWgqXbTeJ2gQtNvRmdIncYsk.jpg",
                "release_date": "2022-04-13",
                "title": "Father Stu",
                "video": false,
                "vote_average": 7.158,
                "vote_count": 665,
                "character": "Bar Patron",
                "credit_id": "62a66d967e12f02ff6612eb3",
                "order": 38
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Bryan Kreutz is an actor, TV director, producer and writer. Bryan began acting at age eight, although his first role was as baby Jesus when he was an infant in theater. He was thrust into the lead role of Balthazar, one of the three wise men, in a church play, his first dialogue role. He has also been intrigued by the production and direction of both plays and film. As a teen, he produced, co-wrote, and starred in a fan film Star Trek series that spawned 60 episodes.\n\nAt a young age, Bryan was an innovator, talent director, and self-starter. He organized neighborhood activities like street hockey and baseball home run derby leagues. Complete with stats and a full production of graphics, sound, and post-game analysis while he produced the taping of a neighborhood hockey all-star-game.\n\nBryan attended the Broadcast Center in Clayton, Missouri, where he excelled in Journalism and Voice-overs. After graduating, he landed his first radio job, at the age of 20, just outside of Peoria, Illinois. He was the Sports Director there, where he hosted the Saturday morning call in sports show, and conducted interviews with coaches. In addition, he did play by play voice for the station's local sports programs. After a several year hiatus from acting, producing, directing, and radio voice-overs, Bryan returned to Radio as a producer in 2006 at KJSL in St. Louis. At the same station a year later he wrote and voiced his own live weekly segment as a Star Trek Analyst on the Bob Wells Show from Dec 2007 - May 2010. In 2010 he became the Director and producer of the Christian Television Network (CTN) affiliate program, Revolution 618, in which he also played an integral part of producing and creating the concept of the program. On May 3, 2011 another CTN Premiere credited Bryan as Director, and then as Executive Producer for a Co-Created TV program Rescued Nation TV. It was released to viewers on the CTN network and later on CW affiliates. Culminating over 50 TV episodes as a producer and director for two different TV talk shows in two years. After Bryan's first two years producing television he ventured into producing film for the first time shortly thereafter. In 2013 Bryan and Brayden Patterson were the creative engine for To Inflict, its themes, story and concepts. To Inflict is a short film with the screenplay and dialogue written and directed by Elizabeth Wiegard.\n\nIn addition to being credited as a producer for To Inflict, Bryan appeared in his second small film role as an actor, appearing as a customer making a purchase in a coffee shop.\n\nBryan plays a supporting character named Brody in Up on High Ground, a syndicated TV series, now in re-runs that is also on PureFlix.com. He directed a large portion of the episodes as well as produced and had a hand in writing every aired episode.\n\nThe film scene is no stranger to Bryan, in 2015 he played the spit bag passenger while next to Kate Upton in the William H. Macy film The Layover and TV Talk show host Larry Thrunklemann in the Tom Green comedy film \"Interviewing Monsters and Bigfoot\"",
        "birthday": "1977-09-30",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 222080,
        "imdb_id": "nm3840743",
        "known_for_department": "Acting",
        "name": "Bryan Kreutz",
        "place_of_birth": "St. Louis, Missouri, USA",
        "popularity": 0.0382,
        "profile_path": "/mmnZ0NapazAgzmQpJYgi9MMJ6UF.jpg"
    }
}