{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mrTBoQTldI4BQXITBlKK9pO29ZK.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 12914,
                "original_language": "en",
                "original_title": "Stargate: Continuum",
                "overview": "Ba'al travels back in time and prevents the Stargate program from being started. SG-1 must somehow restore history.",
                "popularity": 8.1092,
                "poster_path": "/1rQUvblJHU8766FatqTtCMiRhph.jpg",
                "release_date": "2008-07-29",
                "title": "Stargate: Continuum",
                "video": false,
                "vote_average": 7.157,
                "vote_count": 549,
                "character": "Major General Hank Landry",
                "credit_id": "52fe452c9251416c7504e129",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/hPHahVM3JDlE0Zexu6avavypk0g.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 13001,
                "original_language": "en",
                "original_title": "Stargate: The Ark of Truth",
                "overview": "SG-1 searches for an ancient weapon which could help them defeat the Ori, and discover it may be in the Ori's own home galaxy. As the Ori prepare to send ships through to the Milky Way to attack Earth, SG-1 travels to the Ori galaxy aboard the Odyssey. The International Oversight committee have their own plans and SG-1 finds themselves in a distant galaxy fighting two powerful enemies.",
                "popularity": 5.1718,
                "poster_path": "/kIqsCdZBmKYuPwaDnrFYzK1gqlM.jpg",
                "release_date": "2008-03-11",
                "title": "Stargate: The Ark of Truth",
                "video": false,
                "vote_average": 7.144,
                "vote_count": 536,
                "character": "Maj. Gen. Henry Landry",
                "credit_id": "52fe452d9251416c7504e3e3",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/n1Gh3MJAVvXmkgSDf3SOLlPCjag.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749
                ],
                "id": 9390,
                "original_language": "en",
                "original_title": "Jerry Maguire",
                "overview": "Jerry Maguire used to be a typical sports agent: willing to do just about anything he could to get the biggest possible contracts for his clients, plus a nice commission for himself. Then, one day, he suddenly has second thoughts about what he's really doing. When he voices these doubts, he ends up losing his job and all of his clients, save Rod Tidwell, an egomaniacal football player.",
                "popularity": 5.3048,
                "poster_path": "/lABvGN7fDk5ifnwZoxij6G96t2w.jpg",
                "release_date": "1996-12-13",
                "title": "Jerry Maguire",
                "video": false,
                "vote_average": 6.971,
                "vote_count": 3483,
                "character": "Matt Cushman (uncredited)",
                "credit_id": "546eebfd92514112e7001235",
                "order": 117
            },
            {
                "adult": false,
                "backdrop_path": "/yUyuDacqA0IhWqEbPQPXBsEIbPX.jpg",
                "genre_ids": [
                    18
                ],
                "id": 661914,
                "original_language": "en",
                "original_title": "One Night in Miami...",
                "overview": "In the aftermath of Cassius Clay's defeat of Sonny Liston in 1964, the boxer meets with Malcolm X, Sam Cooke and Jim Brown to change the course of history in the segregated South.",
                "popularity": 2.3653,
                "poster_path": "/1DLUb9PTDqXMSgsD7RmiJs7ZJIx.jpg",
                "release_date": "2020-12-25",
                "title": "One Night in Miami...",
                "video": false,
                "vote_average": 7.023,
                "vote_count": 659,
                "character": "Mr. Carlton",
                "credit_id": "5e5a61ac9b86160013f73d54",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "鮑·布里吉斯",
            "Lloyd Vernet \"Beau\" Bridges III",
            "Lloyd Vernet Bridges III",
            "Бо Бриджес",
            "بو بریجز",
            "بو بریجیز"
        ],
        "biography": "Lloyd Vernet \"Beau\" Bridges (born December 9, 1941) is an American actor and director. He is a three-time Emmy, two-time Golden Globe and one-time Grammy Award winner, as well as a two-time Screen Actors Guild Award nominee. He was awarded a star on the Hollywood Walk of Fame on April 7, 2003, for his contributions to the television industry. He is the son of actor Lloyd Bridges and elder brother of fellow actor Jeff Bridges.\n\nIn 1948, he had an uncredited role in Force of Evil, and No Minor Vices, while in 1949, he played in the film The Red Pony. In the 1962–1963 television season, he and his brother, Jeff, appeared on their father's series, The Lloyd Bridges Show. He appeared in other television series too, including National Velvet (1962), The Fugitive (1963), Bonanza (1967), Mr. Novak (1963), and The Loner (1966). He appeared in such feature films during that time as The Landlord (1970), The Other Side of the Mountain (1975), Greased Lightning (1977), Norma Rae (1979), Heart Like a Wheel (1983), and The Hotel New Hampshire (1984).\n\nIn 1989, in perhaps his best-known role, he starred in The Fabulous Baker Boys. In the 1993–94 television season, he appeared with his father in the 15-episode series Harts of the West. In 1998, he starred as Judge Bob Gibbs in the one-season Maximum Bob on ABC. He had a recurring role in the Showtime series Beggars and Choosers (1999–2000).\n\nIn 2001, he guest-starred as Daniel McFarland, in two episodes in Will & Grace. From 2002 to 2003, he took on the role of Senator Tom Gage in The Agency. In January 2005, he was cast as Major General Hank Landry in Stargate SG-1. He also played the character in five episodes of the spin-off series Stargate Atlantis, as well as the two direct to DVD films Stargate: The Ark of Truth and Stargate: Continuum, both in 2008. In 2005, he guest-starred as Carl Hickey in My Name Is Earl; later, his character became recurring. He received a 2007 Emmy Award nomination for his performance. In 2009, he guest-starred as Eli Scruggs on the 100th episode of Desperate Housewives and received an Emmy Award nomination for his performance.\n\nIn 2011, he guest-starred in Brothers and Sisters, and in Franklin & Bash. In 2012, he took on the role of J.B. Biggley in the hit revival of the Broadway musical How to Succeed in Business Without Really Trying. In 2013, he became a major character on the CBS television show The Millers. He has had several roles in movies since then including Underdog Kids (2015), and Lawless Range (2016). He has also had guest roles on the shows Masters of Sex (2013–2016) and Code Black (2016).",
        "birthday": "1941-12-09",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2222,
        "imdb_id": "nm0000977",
        "known_for_department": "Acting",
        "name": "Beau Bridges",
        "place_of_birth": "Los Angeles, California, USA ",
        "popularity": 1.0654,
        "profile_path": "/Aiezvt0Uj2Ka9QVW3GvuRLkNS2V.jpg"
    }
}