{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/eU7IfdWq8KQy0oNd4kKXS0QUR08.jpg",
                "genre_ids": [
                    878,
                    12,
                    28
                ],
                "id": 1061474,
                "original_language": "en",
                "original_title": "Superman",
                "overview": "Superman, a journalist in Metropolis, embarks on a journey to reconcile his Kryptonian heritage with his human upbringing as Clark Kent.",
                "popularity": 233.0212,
                "poster_path": "/wPLysNDLffQLOVebZQCbXJEv6E6.jpg",
                "release_date": "2025-07-09",
                "title": "Superman",
                "video": false,
                "vote_average": 7.503,
                "vote_count": 3176,
                "character": "Cleavis Thornwaite",
                "credit_id": "686d921469fa3110009a4a02",
                "order": 28
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Michael Ian Black (born Michael Ian Schwartz; August 12, 1971) is an American comedian, actor, writer and director. He has starred in several TV comedy series, including The State, Ed, Viva Variety, Stella, Another Period and Michael & Michael Have Issues. He is also a prominent poker player, appearing on Celebrity Poker Showdown several times. He released a well-received children's book, Chicken Cheeks, in 2009.\n\nBlack was born in Chicago, Illinois, to Jill and Robert Schwartz, a store owner and an executive, respectively. His family is Jewish. He grew up in Hillsborough Township, New Jersey, where he attended Hillsborough High School. His parents divorced when he was three years old; his mother, Jill, later came out as a lesbian. Black's father died at age 39 due to a head injury apparently suffered in an assault and allergic reaction during subsequent surgery.\n\nHis birth name, Schwartz, is derived from the German word schwarz, which means black. He changed his name to Michael Ian Black to avoid confusion with the actor Mike Schwartz.\n\nBlack briefly attended New York University, but dropped out to portray Raphael in the promotional campaign for the Teenage Mutant Ninja Turtles concert tour.",
        "birthday": "1971-08-12",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.michaelianblack.org/",
        "id": 22224,
        "imdb_id": "nm0085438",
        "known_for_department": "Acting",
        "name": "Michael Ian Black",
        "place_of_birth": "Chicago, Illinois, USA",
        "popularity": 0.1298,
        "profile_path": "/qAOJfAK6VjV7ugRfy1zbud14OkQ.jpg"
    }
}