{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/v0rI995IpYNZQaqlIYBmodP0f82.jpg",
                "genre_ids": [
                    878,
                    18
                ],
                "id": 244267,
                "original_language": "en",
                "original_title": "I Origins",
                "overview": "A molecular biologist's study of the human eye has far-reaching implications about humanity's scientific and spiritual beliefs.",
                "popularity": 4.2863,
                "poster_path": "/2P31jhd1dWUAPD8dmnSrwkQ8CNN.jpg",
                "release_date": "2014-07-18",
                "title": "I Origins",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 3327,
                "character": "Karen",
                "credit_id": "52fe4eefc3a36847f82b1acb",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Brit Heyworth Marling"
        ],
        "biography": "Brit Heyworth Marling (born August 7, 1982) is an American writer, producer, director, and actress. After majoring in economics at Georgetown University, Brit moved to Los Angeles with friends Mike Cahil and Zal Batmanglij to pursue screenplay writing and acting. Marling was born in Chicago, Illinois. She was named \"Brit\" after her Norwegian maternal great-grandmother. She graduated from Georgetown University in 2005 with degrees in economics and studio art, and was her class Valedictorian.\n\nFollowing graduation from Georgetown, Marling spent a summer interning for the investing banking firm Goldman Sachs. She later turned down a job offer from the firm, opting instead to move to Cuba with friend and director Mike Cahill to film the documentary Boxers and Ballerinas.\n\nIt was for this documentary that Marling first gained recognition in 2004; having co-written the film with Mike Cahill and Nicholas Shumaker and co-directed with Mike Cahill. Marling also co-wrote, co-produced, and acted in the 2011 films Sound of My Voice and Another Earth. Both of these films were featured at the 2011 Sundance Film Festival, with Another Earth winning the Alfred P. Sloan Prize for outstanding film with science, technology or math as a major theme. In 2012, she played Richard Gere's daughter in Arbitrage. In 2013, she collaborated with Sundance once again on her lead role in The East alongside Elliot Page and Alexander Skarsgård.",
        "birthday": "1982-08-07",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 222330,
        "imdb_id": "nm1779870",
        "known_for_department": "Acting",
        "name": "Brit Marling",
        "place_of_birth": "Chicago, Illinois, USA",
        "popularity": 0.6824,
        "profile_path": "/38pSHsK7DKdOYmdeBOKqyunA45e.jpg"
    }
}