{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wyv2Y9vXYJwJzF6cNVuVwVOsOUj.jpg",
                "genre_ids": [
                    28,
                    12,
                    18,
                    14,
                    53
                ],
                "id": 397567,
                "original_language": "ko",
                "original_title": "신과함께-죄와 벌",
                "overview": "Having died unexpectedly, firefighter Ja-hong is taken to the afterlife by 3 afterlife guardians. Only when he passes 7 trials over 49 days and proves he was innocent in human life, he’s able to reincarnate, and his 3 afterlife guardians are by his side to defend him in trial.",
                "popularity": 5.8822,
                "poster_path": "/gJSvIsI6oQfFim0PGyuuiCYfqKs.jpg",
                "release_date": "2017-12-20",
                "title": "Along with the Gods: The Two Worlds",
                "video": false,
                "vote_average": 8.1,
                "vote_count": 1110,
                "character": "Club Man",
                "credit_id": "5ffea611594c94003d8ee040",
                "order": 24
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "나철",
            "Na Cheol",
            "罗哲"
        ],
        "biography": "Na Chul was a South Korean actor and stage actor under UL Entertainment.\n\nNa made his debut in the play “Anne’s Diary” in 2010.\n\nHe continued acting in several short films as well as independent movies prior to his well known roles in “Along with the Gods: The Two Worlds” (2017), Extreme Job (2019) and “1987: When The Day Comes” (2017).\n\nIn recent years, he had gained even more popularity through his roles in various hit television series such as Vincenzo, Hospital Playlist 2, D.P, Little Women and Weak Hero Class1.\n\nHe was heavily praised for his performance in the latter, by both audience and critics.\n\nAccording to media outlets, his posthumous work is the upcoming movie “Concrete Utopia“, with co-stars such as Lee Byung-hun, Park Seo-joon and Park Bo-young.\n\nOn January 21, 2023, Na Chul passed away in the hospital while receiving treatment after his health had significantly deteriorated in recent times.\n\nHe was 36 years old.\n\nHe did not have a partner or children to leave behind.",
        "birthday": "1986-12-24",
        "deathday": "2023-01-21",
        "gender": 2,
        "homepage": null,
        "id": 2228586,
        "imdb_id": "nm12382711",
        "known_for_department": "Acting",
        "name": "Na Chul",
        "place_of_birth": null,
        "popularity": 0.525,
        "profile_path": "/dftI6GDSoAXHr3S9fDTPotoNuv.jpg"
    }
}