{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/vDKRMZGFTKP9nQolzeSB1rB1w6p.jpg",
                "genre_ids": [
                    18,
                    36,
                    10752
                ],
                "id": 324786,
                "original_language": "en",
                "original_title": "Hacksaw Ridge",
                "overview": "WWII American Army Medic Desmond T. Doss, who served during the Battle of Okinawa, refuses to kill people and becomes the first Conscientious Objector in American history to receive the Congressional Medal of Honor.",
                "popularity": 17.0287,
                "poster_path": "/wuz8TjCIWR2EVVMuEfBnQ1vuGS3.jpg",
                "release_date": "2016-10-07",
                "title": "Hacksaw Ridge",
                "video": false,
                "vote_average": 8.193,
                "vote_count": 14313,
                "character": "Tex Lewis",
                "credit_id": "65946536ce4ddc6e647ded1a",
                "order": 12
            },
            {
                "adult": false,
                "backdrop_path": "/kPKwqHl2rYsi9rFWJWA6afKdmlT.jpg",
                "genre_ids": [
                    18,
                    53,
                    37
                ],
                "id": 400090,
                "original_language": "en",
                "original_title": "The Nightingale",
                "overview": "In 1825, Clare, a 21-year-old Irish convict, chases a British soldier through the rugged Tasmanian wilderness, bent on revenge for a terrible act of violence he committed against her family. She enlists the services of an Aboriginal tracker who is also marked by trauma from his own violence-filled past.",
                "popularity": 2.9554,
                "poster_path": "/9nRpZmvdEgq8hMu1rNyc90XQtH6.jpg",
                "release_date": "2018-09-23",
                "title": "The Nightingale",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 615,
                "character": "Aidan",
                "credit_id": "5c50320f92514151a95a938c",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Michael Sheasby is an AFI/AACTA nominated actor, best known for his work in Mel Gibson's \"Hacksaw Ridge\", Jennifer Kent's \"The Nightingale\" and the BBC's \"The Luminaries\". Micheal was born in Pietermaritzburg, KwaZulu-Natal, South Africa, and immigrated to Sydney, Australia with his family in 2001. After graduating from the National Institute of Dramatic Arts (NIDA) in 2010, Michael began his career leading on stage at the Sydney Opera House in roles such as King Henry in Shakespeare's Henry V, and Valentine Coverly in Tom Stoppard's Arcadia. Since turning his attention to screen, Michael has played roles such as Tex Lewis in Mel Gibson's Hacksaw Ridge, Walter Moody in the BBC's The Luminaries, and Aidan Carrol in Jennifer Kent's The Nightingale which received the Special Jury Prize at the Venice Film Festival in 2018, and was also selected for Sundance Film Festival 2019. Michael won the Casting Guild of Australia's Rising Star Award in 2018. In 2019, Michael was nominated for an AFI/ACCTA Award for Best Supporting Actor for his work in The Nightingale.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2229725,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Michael Sheasby",
        "place_of_birth": null,
        "popularity": 0.0803,
        "profile_path": "/vg4MwdHrHQHotX6ZfVWFfZFkZ3Z.jpg"
    }
}