{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sGKUhw88FMH5gfz0E6BK2YOZ5se.jpg",
                "genre_ids": [
                    36,
                    18
                ],
                "id": 82695,
                "original_language": "en",
                "original_title": "Les Misérables",
                "overview": "An adaptation of the successful stage musical based on Victor Hugo's classic novel set in 19th-century France. Jean Valjean, a man imprisoned for stealing bread, must flee a relentless policeman named Javert. The pursuit consumes both men's lives, and soon Valjean finds himself in the midst of the student revolutions in France.",
                "popularity": 6.8937,
                "poster_path": "/6CuzBs2Lb8At7qQr64mLXg2RYRb.jpg",
                "release_date": "2012-12-18",
                "title": "Les Misérables",
                "video": false,
                "vote_average": 7.315,
                "vote_count": 5417,
                "character": "Ensemble 'Master of the House'",
                "credit_id": "52fe486e9251416c9108c2e1",
                "order": 148
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Kerry Jane Townsend (born 6 May 1979), better known by her maiden name Kerry Ellis, is an English actress and singer who is best known for her work in musical theatre and subsequent crossover into music. Born and raised in Suffolk, Ellis began performing at an early age before attending Laine Theatre Arts from the age of 16.  Ellis made her first professional stage appearance in 1998 and went on to make her West End debut in the 2001 revival of My Fair Lady as Martine McCutcheon's understudy in the role of Eliza Doolittle. After meeting Queen guitarist Brian May in 2002, she landed the role of Meat in the original London cast of We Will Rock You and has subsequently played lead roles in West End musicals Les Misérables, Wicked (which also took her to Broadway) and Oliver! as well as appearing in national tours and concert productions of musicals like Miss Saigon, Chess, The War of the Worlds and RENT. Ellis, who has received several awards and nominations for her performances, has fast become recognised as the First Lady of West End musicals. She has also worked sporadically in film and television.  Despite her misfortune on The Voice UK in 2012, Ellis had been expanding her repertoire as a solo artist in collaboration with May since 2002. She has released a studio album Anthems (2010), which reached number 15 on the UK Albums Chart, as well as an extended play Wicked in Rock (2008) and a live album Acoustic by Candlelight (2013). In addition to headlining solo concert tours like Anthems: The Tour and The Born Free Tour, and singing in concerts across the world, Ellis also appears as a featured artist on several albums and is featured on three cast albums. With May, she also involves herself in charity work with the Born Free Foundation.",
        "birthday": "1979-05-06",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.kerryellis.com/",
        "id": 223044,
        "imdb_id": "nm2827177",
        "known_for_department": "Acting",
        "name": "Kerry Ellis",
        "place_of_birth": null,
        "popularity": 0.0286,
        "profile_path": "/vkCXoRIkmaB29ztDPUxYPqVk1pw.jpg"
    }
}