{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/y0eyUFB8dBLKjbQFeAgFMiklQDq.jpg",
                "genre_ids": [
                    18
                ],
                "id": 1254,
                "original_language": "fr",
                "original_title": "Je vais bien, ne t'en fais pas",
                "overview": "A 19-year-old searches for her twin brother after he runs away from home, following a fight with their father.",
                "popularity": 1.5668,
                "poster_path": "/yD6skMZZq0Rgn2NhI9dk4B2Dipu.jpg",
                "release_date": "2006-09-06",
                "title": "Don't Worry, I'm Fine",
                "video": false,
                "vote_average": 7.206,
                "vote_count": 593,
                "character": "Paul Tellier",
                "credit_id": "52fe42eac3a36847f802c9eb",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/eWYrrdCKd4bjOKB9DB0HtRUhI1o.jpg",
                "genre_ids": [
                    18
                ],
                "id": 5528,
                "original_language": "fr",
                "original_title": "Les Choristes",
                "overview": "In 1940s France, a new teacher at a school for disruptive boys gives hope and inspiration.",
                "popularity": 6.0653,
                "poster_path": "/hUl7gSvkGygyk9wt3zy5NqpC5bb.jpg",
                "release_date": "2004-03-17",
                "title": "The Chorus",
                "video": false,
                "vote_average": 7.731,
                "vote_count": 2507,
                "character": "Chabert",
                "credit_id": "52fe440cc3a36847f807f4ff",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Kadour Merad",
            "카드 므라드"
        ],
        "biography": "Kad Merad is a French-Algerian filmmaker and actor who has acted both on stage and on screen.\n\nKad Merad was born in Sidi Bel Abbès, Algeria, on March 27, 1964 to an Algerian father and a French mother.\n\nDuring his teens, he played drums and sang with various rock bands. Soon afterwards, he started playing as an animator in Club Med alongside the Gigolo Brothers troop.\n\nIn 1990, he was hired by Ouï FM, the Paris Rock genre station where he met Olivier Baroux. The duet most known as Kad &amp; Olivier began working together and started their own show, the Rock'n Roll Circus,  introducing some of their most famous sketches (Pamela Rose, Teddy Porc  Fidèle...). The early success of the show allowed them to meet Jean-Luc Delarue who brought their act to TV.\n\nIn 1999, they began appearing on the French Satellite TV channel Comédie+ on their own show, La Grosse Emission. At the same time, Merad started his Cinema career with a lot of secondary roles.\n\nIn 2003, he scored his First box-office success with Mais Qui a tué Pamela Rose?, co-written with Baroux.\n\nIn 2007, Kad received the César Award for Best Supporting Actor for his role in Je vais Bien, ne t'en fais pas! and appears in AaRON's film soundtrack video clip. His best challenger was Dany Boon. During the shooting of Bienvenue chez les Ch'tis, this friendly struggle was a running joke between the two of them.\n\nThat same year, he made his first appearance with Les Enfoirés music troop and is still one of its members. He was also inducted as the Godfather of the Telethon.\n\nThe next year, he starred as Phillipe Abrams in the French movie Bienvenue chez les Ch'tis.  The film was a surprise - and phenomenal - success in France and  Europe, becoming the best-attended movie ever made in France, with 21  million moviegoers.",
        "birthday": "1964-03-27",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 22306,
        "imdb_id": "nm0580101",
        "known_for_department": "Acting",
        "name": "Kad Merad",
        "place_of_birth": "Sidi Bel Abbes, Algeria",
        "popularity": 0.4326,
        "profile_path": "/2hgcdLF0GqtzUGUFATH9AwLfS7J.jpg"
    }
}