{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2pnfUSFqUPn9F4mzl1MLKrlnNbU.jpg",
                "genre_ids": [
                    35,
                    80
                ],
                "id": 25253,
                "original_language": "fr",
                "original_title": "Les Tontons flingueurs",
                "overview": "An aging gangster, Fernand Naudin is hoping for a quiet retirement when he suddenly inherits a fortune from an old friend, a former gangster supremo known as the Mexican. If he is ambivalent about his new found wealth, Fernand is positively nonplussed to discover that he has also inherited his benefactor’s daughter, Patricia. Unfortunately, not only does Fernand have to put up with the thoroughly modern Patricia and her nauseating boyfriend, but he also had to contend with the Mexican’s trigger-happy former employees, who are determined to make a claim.",
                "popularity": 1.7675,
                "poster_path": "/1uYCIsMpX7FtWu2xO1YMIAQYvLR.jpg",
                "release_date": "1963-11-27",
                "title": "Crooks in Clover",
                "video": false,
                "vote_average": 7.747,
                "vote_count": 526,
                "character": "Pascal",
                "credit_id": "52fe44c0c3a368484e034ad7",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/aDi4GqSYi4pcTvS7A9AuXLuhUVQ.jpg",
                "genre_ids": [
                    35,
                    80
                ],
                "id": 25866,
                "original_language": "fr",
                "original_title": "Le Corniaud",
                "overview": "In this Franco-Italian gangster parody, a shopkeeper on his way to an Italian holiday suffers a crash that totals his car. The culprit can only compensate his ruined trip by driving an American friend's car from Naples to Bordeaux, but as it happens to be filled with such contraband as stolen money, jewelry and drugs, the involuntary and unwitting companions in crime soon attract all but recreational attention from the \"milieu\".",
                "popularity": 2.6704,
                "poster_path": "/kGFE3U01sMApp5Q7h0akEvdTwPK.jpg",
                "release_date": "1965-03-24",
                "title": "The Sucker",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 674,
                "character": "Mickey, 'le bègue'",
                "credit_id": "52fe44e0c3a368484e03c0d3",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/sv8nSUSXb7ldLOg4dm6KDIDdSEU.jpg",
                "genre_ids": [
                    35,
                    36
                ],
                "id": 14257,
                "original_language": "fr",
                "original_title": "La Folie des grandeurs",
                "overview": "Don Sallust is the minister of the King of Spain. Being disingenuous, hypocritical, greedy and collecting the taxes for himself, he is hated by the people he oppresses. Accused by The Queen, a beautiful princess Bavarian, of having an illegitimate child to one of her maids of honor, he was stripped of his duties and ordered to retire to a monastery.",
                "popularity": 1.747,
                "poster_path": "/uJtEs9WRqyEREvdkS470n593z03.jpg",
                "release_date": "1971-12-08",
                "title": "Delusions of Grandeur",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 714,
                "character": "Marquis del Basto",
                "credit_id": "53ab2aac0e0a26761c000406",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/DNb1rBm6R75IJ88PKOd0wfCHm6.jpg",
                "genre_ids": [
                    12,
                    35,
                    14
                ],
                "id": 526,
                "original_language": "en",
                "original_title": "Ladyhawke",
                "overview": "Captain Etienne Navarre is a man on whose shoulders lies a cruel curse. Punished for loving each other, Navarre must become a wolf by night whilst his lover, Lady Isabeau, takes the form of a hawk by day. Together, with the thief Philippe Gaston, they must try to overthrow the corrupt Bishop and in doing so break the spell.",
                "popularity": 4.1684,
                "poster_path": "/vJA2Fhw2uBMiVFdBde2kH7kZ2gw.jpg",
                "release_date": "1985-03-27",
                "title": "Ladyhawke",
                "video": false,
                "vote_average": 7.006,
                "vote_count": 1192,
                "character": "Bishop's Secretary",
                "credit_id": "593af7a79251411ee90115ee",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Vernon Vernons",
            "Van Tenney",
            "Enrico Venantino Venantini"
        ],
        "biography": "Venantino Venantini (17 April 1930 – 9 October 2018) was an Italian film actor. He was the father of Victoria Venantini and Luca Venantini and appeared in more than 140 films between 1954 and 2018.\n\nHe made his debut in the cinema with an appearance in Un giorno in pretura under the direction of Steno and he had his first important role in Odissea Nuda (1961), directed by Franco Rossi. Among the almost 150 films he performed in, some became cult favorites such as Les Tontons flingueurs, Amore libero - Free Love, Black Emanuelle and City of the Living Dead.\n\nHe acted with actors such as Lino Ventura, Yves Montand, Alain Delon and Gérard Depardieu and for directors such as Ettore Scola, Luciano Salce and Dino Risi and for French film directors such as Georges Lautner, Gérard Oury and Claude Lelouch.\n\nSource: Article \"Venantino Venantini\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1930-04-17",
        "deathday": "2018-10-09",
        "gender": 2,
        "homepage": null,
        "id": 22312,
        "imdb_id": "nm0892891",
        "known_for_department": "Acting",
        "name": "Venantino Venantini",
        "place_of_birth": "Fabriano, Marche, Italy",
        "popularity": 0.3189,
        "profile_path": "/rjyM8jlWK6D3PF7PRNSdguo52a9.jpg"
    }
}