{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/o1JapnInSBCgedfWnj15ytjGC70.jpg",
                "genre_ids": [
                    18
                ],
                "id": 519010,
                "original_language": "es",
                "original_title": "Dolor y gloria",
                "overview": "Salvador Mallo, a filmmaker in the twilight of his career, remembers his life: his mother, his lovers, the actors he worked with. The sixties in a small village in Valencia, the eighties in Madrid, the present, when he feels an immeasurable emptiness, facing his mortality, the incapability of continuing filming, the impossibility of separating creation from his own life. The need of narrating his past can be his salvation.",
                "popularity": 2.4769,
                "poster_path": "/cMlueArJXXwZbeLpb4NhC3pxmBk.jpg",
                "release_date": "2019-03-22",
                "title": "Pain and Glory",
                "video": false,
                "vote_average": 7.384,
                "vote_count": 1843,
                "character": "Eduardo",
                "credit_id": "5c531d1992514116fc532419",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "“I was 12 years old when I set foot on a stage for the very first time,” Spanish actor César Vicente says. “It was the year-end dance at my school. I realized [then] that performing would be part of my life; it allowed me to be confident in a way that I wasn’t before.” Chasing that sense of invincibility, Vicente enrolled in the dramatic arts program at Sevilla’s Viento Sur Teatro. Following four years of intensive training there, he soon began landing parts. These included the role of Elías, a clever groundskeeper at an all-girls finishing school, in the 2018 series A Different View, and a young Hernán Cortez, the Spanish imperialist who defeated the Aztecs, in the 2019 historical drama series Hernán.\n\nThough each of those characters played a role in Vicente’s development, it was his role as Eduardo, a local laborer learning to read and write, in Pedro Almodóvar’s 2019 film Pain and Glory, that put him on the global map. “My experience as Eduardo was the most wonderful time of my life,” he says. “It was an opportunity to develop my hidden potential and to put into practice the skills I had learned in the Academy.”\n\nEduardo is an ancillary but potent figure in the life of Salvador Mallo—the film’s protagonist and a loose analog for its director. In building the character, Vicente met with Almodóvar on multiple occasions. “[Almodóvar] described the character meticulously to get the most out of my abilities,” Vicente says. “It [was] an honor to play this important role in the director’s life.”\n\nVicente’s mission is not only to be a conduit to a filmmaker’s vision, but also to prove his craft. “I am always trying to learn from the mistakes I make. Even if I keep failing, I never give up,” he says. For instance, his next red carpet will likely be a smoother affair than that of the Pain and Glory premiere: “That was a challenge,” he recalls. “All the recognition and promotion was fun but very intense for me.” If his parting sentiment is any indication, Vicente is ready to savor the spotlight that awaits him: “I feel a burning desire to conquer the world.”",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2231204,
        "imdb_id": "nm10169302",
        "known_for_department": "Acting",
        "name": "César Vicente",
        "place_of_birth": null,
        "popularity": 0.1974,
        "profile_path": "/bGnQnttEvXQG2Yqd2bpYE32sLE2.jpg"
    }
}