{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wRxLAw4l17LqiFcPLkobriPTZAw.jpg",
                "genre_ids": [
                    28,
                    53,
                    80
                ],
                "id": 697843,
                "original_language": "en",
                "original_title": "Extraction 2",
                "overview": "Back from the brink of death, highly skilled commando Tyler Rake takes on another dangerous mission: saving the imprisoned family of a ruthless gangster.",
                "popularity": 9.2251,
                "poster_path": "/7gKI9hpEMcZUQpNgKrkDzJpbnNS.jpg",
                "release_date": "2023-06-09",
                "title": "Extraction 2",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 2678,
                "character": "Mikheil",
                "credit_id": "6846ff5b9e85afcb97342a52",
                "order": 26
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/mDfJG3LC3Dqb67AZ52x3Z0jU0uB.jpg",
                "genre_ids": [
                    12,
                    28,
                    878
                ],
                "id": 299536,
                "original_language": "en",
                "original_title": "Avengers: Infinity War",
                "overview": "As the Avengers and their allies have continued to protect the world from threats too large for any one hero to handle, a new danger has emerged from the cosmic shadows: Thanos. A despot of intergalactic infamy, his goal is to collect all six Infinity Stones, artifacts of unimaginable power, and use them to inflict his twisted will on all of reality. Everything the Avengers have fought for has led up to this moment - the fate of Earth and existence itself has never been more uncertain.",
                "popularity": 28.3997,
                "poster_path": "/7WsyChQLEftFiDOVTGkv3hFpyyt.jpg",
                "release_date": "2018-04-25",
                "title": "Avengers: Infinity War",
                "video": false,
                "vote_average": 8.236,
                "vote_count": 30963,
                "credit_id": "64d46dfebf31f201c94cd4f4",
                "department": "Crew",
                "job": "Utility Stunts"
            },
            {
                "adult": false,
                "backdrop_path": "/7RyHsO4yDXtBv1zUU3mTpHeQ0d5.jpg",
                "genre_ids": [
                    12,
                    878,
                    28
                ],
                "id": 299534,
                "original_language": "en",
                "original_title": "Avengers: Endgame",
                "overview": "After the devastating events of Avengers: Infinity War, the universe is in ruins due to the efforts of the Mad Titan, Thanos. With the help of remaining allies, the Avengers must assemble once more in order to undo Thanos' actions and restore order to the universe once and for all, no matter what consequences may be in store.",
                "popularity": 16.039,
                "poster_path": "/ulzhLuWrPK07P1YkdWQLZnQh1JL.jpg",
                "release_date": "2019-04-24",
                "title": "Avengers: Endgame",
                "video": false,
                "vote_average": 8.238,
                "vote_count": 26748,
                "credit_id": "6846f8c1aea1e1fdf9fd6060",
                "department": "Crew",
                "job": "Stunts"
            },
            {
                "adult": false,
                "backdrop_path": "/6G2fLCVm9fiLyHvBrccq6GSe2ih.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 284053,
                "original_language": "en",
                "original_title": "Thor: Ragnarok",
                "overview": "Thor is imprisoned on the other side of the universe and finds himself in a race against time to get back to Asgard to stop Ragnarok, the destruction of his home-world and the end of Asgardian civilization, at the hands of a powerful new threat, the ruthless Hela.",
                "popularity": 9.7909,
                "poster_path": "/rzRwTcFvttcN1ZpX2xv4j3tSdJu.jpg",
                "release_date": "2017-10-02",
                "title": "Thor: Ragnarok",
                "video": false,
                "vote_average": 7.583,
                "vote_count": 21406,
                "credit_id": "6846fdc2b6a9aac54e1ea92d",
                "department": "Crew",
                "job": "Stunts"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Matthew Laborde"
        ],
        "biography": "Matt LaBorde is a British-born stunt performer and actor. Growing up near RAF Northolt in London, he began his journey in action sports as a youth, spending hours clay pigeon shooting and eventually becoming the head trapper at a gun club. Seeking an escape from the rough council estate environment, he later joined the military, where he excelled in national military skills and running competitions. That same discipline paved the way for his certification as a personal trainer—a role in which he honed his ability to connect across diverse backgrounds while conditioning actors and public clients alike.\n\nLaBorde's entry into the stunt profession was marked by his rigorous qualification through the British Stunt Register, demonstrating mastery across six main disciplines: formation skydiving, gymnastics, fencing, trampolining, kickboxing, and swimming, as well as horse riding training. His varied skill set includes precision driving, martial arts, aerial work, firearms and weapon handling, rigging, water safety, and comedic acting—all underscored by formal training in disciplines ranging from kickboxing to industrial rope access.\n\nDespite suffering a serious skydiving accident early in his career—which sidelined him for months and compelled him to rebuild financially and educationally—LaBorde pursued higher education vigorously. Having left school at the age of 14 without qualifications, he later earned a Public Relations HND, a degree in product design, and an MA in advertising. He is currently completing an MA in Comedy Writing for Film and TV at Falmouth University (2023–2025).\n\nLaBorde has built an impressive portfolio in film and television. His film credits encompass high-profile blockbusters such as Avengers: Infinity War, Avengers: Endgame, Black Adam, Extraction II, The Walking Dead, The Falcon and the Winter Soldier, and She-Hulk: Attorney at Law. Notably, he received award recognition for his contribution to Avengers: Endgame. He continued his relationship with Marvel Studios, doubling Tom Hiddleston's Loki for six episodes of Loki Season 1 (2021).  LaBorde's multifaceted abilities and adaptability have earned him roles beyond stunts. He has performed as a fight coordinator, stunt coordinator, visual effects artist, and actor in productions like Keepsake, By Night's End, and Extraction II. Proficient across disciplines, he remains legally and HSE qualified.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2231990,
        "imdb_id": "nm5379637",
        "known_for_department": "Crew",
        "name": "Matt LaBorde",
        "place_of_birth": null,
        "popularity": 0.0932,
        "profile_path": "/kjBmjGEGsYdkAdqW7jBOgQINwms.jpg"
    }
}