{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fozq5WDVQQZ8C1K3rrvgB6IM5O9.jpg",
                "genre_ids": [
                    18
                ],
                "id": 489418,
                "original_language": "fr",
                "original_title": "Pupille",
                "overview": "Théo is given up for adoption by his biological mother on the very day he is born. After this anonymous birth, the mother has two months to change her mind… Or not. The child welfare services and adoption service spring into action… The former have to take care of the baby and support it during this limbo-like time, this period of uncertainty, while the latter must find a woman to become his adoptive mother. She is called Alice, and she has spent the last ten years fighting to have a child.",
                "popularity": 3.2158,
                "poster_path": "/andgp8cnHZPAwx3zPUDaZ0pn6Go.jpg",
                "release_date": "2018-12-05",
                "title": "In Safe Hands",
                "video": false,
                "vote_average": 7.429,
                "vote_count": 520,
                "character": "PFS service head",
                "credit_id": "6307a5f36e938a009237823a",
                "order": 33
            },
            {
                "adult": false,
                "backdrop_path": "/pP1UeRZ7shy1llOUTnpXWISOokK.jpg",
                "genre_ids": [
                    36,
                    18,
                    53
                ],
                "id": 399121,
                "original_language": "fr",
                "original_title": "J'accuse",
                "overview": "In 1894, French Captain Alfred Dreyfus is wrongfully convicted of treason and sentenced to life imprisonment at the Devil’s Island penal colony.",
                "popularity": 2.203,
                "poster_path": "/kqlzmKVBpGz7OMWfOXlK4y1m9Uz.jpg",
                "release_date": "2019-09-30",
                "title": "An Officer and a Spy",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 1547,
                "character": "Henry",
                "credit_id": "5d037d140e0a260b0acc0d2d",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Grégory Gadebois (born 24 July 1976) is a French actor.\n\nBefore his career as an actor begin, he worked as a mover.\n\nHe studied at the CNSAD in the class of Catherine Hiegel and Dominique Valadié. He was a member of the Comédie-Française from 2006 to 2012.\n\nIn 2012, he won the César Award for Most Promising Actor for Angel & Tony directed by Alix Delaporte. He received two other nominations, first in 2013 for Best Actor for One of a Kind and then in 2019 for Best Supporting Actor for An Officer and a Spy.\n\nIn 2014, he won the Molière Award for Best One Man Show for his work on the play Flowers for Algernon, directed by Anne Kessler.\n\nHis mother was a school teacher and told him to start doing theater. He is the eldest of three children. He grew up without the presence of his father.\n\nHe met his wife, Clémentine, during the filming of Angel & Tony, in 2009. She worked on the movie as a production assistant.\n\nSource: Article \"Grégory Gadebois\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1976-07-24",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 223532,
        "imdb_id": "nm1687610",
        "known_for_department": "Acting",
        "name": "Grégory Gadebois",
        "place_of_birth": "Gruchet-le-Valasse, Seine-Maritime, France",
        "popularity": 0.3661,
        "profile_path": "/AvF337m0eGL9JLPEgG6Dy1T2Zu4.jpg"
    }
}