{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/P4bGyJQF0shAcRku3I2perNUQR.jpg",
                "genre_ids": [
                    28,
                    80
                ],
                "id": 23483,
                "original_language": "en",
                "original_title": "Kick-Ass",
                "overview": "Dave Lizewski is an unnoticed high school student and comic book fan who one day decides to become a super-hero, even though he has no powers, training or meaningful reason to do so.",
                "popularity": 8.3621,
                "poster_path": "/iHMbrTHJwocsNvo5murCBw0CwTo.jpg",
                "release_date": "2010-03-26",
                "title": "Kick-Ass",
                "video": false,
                "vote_average": 7.123,
                "vote_count": 11999,
                "character": "Medic",
                "credit_id": "5e1b38246a300b00165c5291",
                "order": 29
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Rusty Bentley "
        ],
        "biography": "Russell Bentley is an English-born actor and voice actor. He was born in London, moved to Boston where he spent his youth until relocating to the UK at age 10; he is a dual US/UK citizen. As an actor, he is equally at home with many UK and US dialects.\n\nHe trained as an actor at the Royal Central School of Speech and Drama and received a scholarship to train at the prestigious Carnegie Mellon University in Pittsburgh where he received an MFA in acting.\n\nHis film credits include Kick Ass, Proof, and Lost Battalion. His TV credits include Dr. Who, EastEnders, Footballers, and Watergate.  He provided voice narration for season 6 of ID's true-crime series Web of Lies.\n\nRussell has provided voices for video games as well as countless campaigns including SportPesa, Shell, Barclays, Amazon and Virgin to name but a handful. He has narrated hundreds of Audio Books including Colm Toibin’s ‘The Story of the Night’ for Penguin, Ken Follett’s ‘ Night Over Water’ and ‘The Leopards of Normandy’ trilogy for Hodder Headline. His narration for Wilkie Collins’ No Name has earned him an Audie nomination.\n\nHe received a Sony award for his work on the BBC radio 4 series ‘Voyage’ directed by Dirk Maggs and appeared on Radio 3’s Woody Allen season in ‘The Whore of Mensa.’",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2237689,
        "imdb_id": "nm1485880",
        "known_for_department": "Acting",
        "name": "Russell Bentley",
        "place_of_birth": "London, England, UK",
        "popularity": 0.0387,
        "profile_path": "/1Q754CQvEJbtBJb0JzbrR1J9J5E.jpg"
    }
}