{
    "movies": {
        "cast": [],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Stephen Kevin Bannon",
            "Stephen Bannon",
            "Stephen K. Bannon"
        ],
        "biography": "Stephen Kevin Bannon (born November 27, 1953) is an American media executive, political strategist, and former investment banker. He served as the White House's chief strategist in the administration of U.S. President Donald Trump during the first seven months of Trump's term. He is a former executive chairman of Breitbart News and previously served on the board of the now-defunct data-analytics firm Cambridge Analytica.\n\nIn August 2020, Bannon and three others were arrested and charged with conspiracy to commit mail fraud and money laundering in connection with the We Build the Wall campaign. The defendants allegedly enriched themselves, despite promising that all contributions would go to building a wall. Bannon pleaded not guilty and was pardoned by Trump before his trial date.\n\nBannon was held in contempt of Congress in October 2021 after he refused to comply with a subpoena issued by the United States House Select Committee on the January 6 Attack, the House of Representatives committee investigating the 2021 United States Capitol attack. He was indicted by a federal grand jury on two criminal charges of contempt of Congress. In July 2022, he was convicted on both counts in a jury trial. The two counts each carry a minimum of 30 days to a maximum of one year of incarceration as well as a $100–100,000 fine.\n\nOn September 8, 2022, Steve Bannon was charged with state-level money laundering and conspiracy counts in New York related to a \"We Build The Wall\" fundraising campaign to build a wall on the US-Mexico border. On the same day, Bannon turned himself in to the authorities. He had previously been spared from federal prosecution in that case because of a pardon by former president Donald Trump on the last day of his presidency in 2021.\n\nDescription above from the Wikipedia article Steve Bannon, licensed under CC BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1953-11-27",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 223736,
        "imdb_id": "nm0052442",
        "known_for_department": "Acting",
        "name": "Steve Bannon",
        "place_of_birth": "Norfolk, Virginia, USA",
        "popularity": 0.1086,
        "profile_path": "/pLfnDZvXofoArdO3xtgQ7qch8s6.jpg"
    }
}