{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cDtefl7KGnKrDziEUXetMnztvqr.jpg",
                "genre_ids": [
                    28,
                    53
                ],
                "id": 1573,
                "original_language": "en",
                "original_title": "Die Hard 2",
                "overview": "One year after his heroics in Los Angeles, John McClane is an off-duty cop who is the wrong guy in the wrong place at the wrong time. On a snowy Christmas Eve, as he waits for his wife's plane to land at Washington Dulles International Airport, terrorists take over the air traffic control system in a plot to free a South American army general and drug smuggler being flown into the US to face drug charges. It's now up to McClane to take on the terrorists, while coping with an inept airport police chief, an uncooperative anti-terrorist squad, and the life of his wife and everyone else trapped in planes circling overhead.",
                "popularity": 9.1325,
                "poster_path": "/lDFO7D4MdbhjOwaPwe18QG69Rt0.jpg",
                "release_date": "1990-07-03",
                "title": "Die Hard 2",
                "video": false,
                "vote_average": 6.958,
                "vote_count": 6090,
                "character": "Major Grant",
                "credit_id": "52fe42ffc3a36847f8032a47",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/vsCIw7ARCKQVPT2K2hkkFVl7yo5.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 9602,
                "original_language": "en",
                "original_title": "Coming to America",
                "overview": "An African prince decides it’s time for him to find a princess... and his mission leads him and his most loyal friend to Queens, New York. In disguise as an impoverished immigrant, the pampered prince quickly finds himself a new job, new friends, new digs, new enemies and lots of trouble.",
                "popularity": 10.3431,
                "poster_path": "/8YZiA1o264dk0cr1USyMdph6SZl.jpg",
                "release_date": "1988-06-29",
                "title": "Coming to America",
                "video": false,
                "vote_average": 6.878,
                "vote_count": 4542,
                "character": "Cleo McDowell",
                "credit_id": "52fe450fc3a36847f80ba1cd",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/eGljNfNCrPhFYG2RXXmmE0OKu5.jpg",
                "genre_ids": [
                    18,
                    53,
                    80
                ],
                "id": 473033,
                "original_language": "en",
                "original_title": "Uncut Gems",
                "overview": "A charismatic New York City jeweler always on the lookout for the next big score makes a series of high-stakes bets that could lead to the windfall of a lifetime. Howard must perform a precarious high-wire act, balancing business, family, and encroaching adversaries on all sides in his relentless pursuit of the ultimate win.",
                "popularity": 5.189,
                "poster_path": "/sg0xxJeb3u1C4kAxhSuTwTNpEDt.jpg",
                "release_date": "2019-08-30",
                "title": "Uncut Gems",
                "video": false,
                "vote_average": 7.16,
                "vote_count": 5028,
                "character": "Neighbor 33F",
                "credit_id": "6338380c6728a800825c5dcd",
                "order": 71
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jon Amos",
            "Johnny Amos",
            "John A. Amos Jr."
        ],
        "biography": "John Amos (December 27, 1939 – August 21, 2024) was an American actor and retired football player. He is best known for his role as the adult Kunta Kinte in the landmark miniseries \"Roots\" and for portraying James Evans Sr. on the CBS television series \"Good Times.\" He was nominated for a Primetime Emmy Award and an NAACP Image Award. On film, he played numerous supporting roles in movies such as \"The Beastmaster\" (1982), \"Coming to America\" (1988), \"Lock Up\" (1989), \"Die Hard 2\" (1990) and \"Coming 2 America\" (2021).\n\nPrior to acting, he played on the Colorado State Rams football team and in 1964, he signed a free agent contract with the American Football League's Denver Broncos and in 1967 signed a free agent contract with the American Football League's Kansas City Chiefs. Both of these contracts did not land him a spot on the teams and played a final season in the Continental Football League with the Victoria Steelers before pursuing acting.",
        "birthday": "1939-12-27",
        "deathday": "2024-08-21",
        "gender": 2,
        "homepage": null,
        "id": 22384,
        "imdb_id": "nm0025309",
        "known_for_department": "Acting",
        "name": "John Amos",
        "place_of_birth": "Newark, New Jersey, USA",
        "popularity": 1.368,
        "profile_path": "/b2zYGkMG28wYDHC9CunfYAeoeMQ.jpg"
    }
}