{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tb0uo01w2kDHiQwTszsLlSusAm4.jpg",
                "genre_ids": [
                    28,
                    878,
                    27
                ],
                "id": 315011,
                "original_language": "ja",
                "original_title": "シン・ゴジラ",
                "overview": "When a massive, gilled monster emerges from the deep and tears through the city, the government scrambles to save its citizens.  A rag-tag team of volunteers cuts through a web of red tape to uncover the monster's weakness and its mysterious ties to a foreign superpower.  But time is not on their side - the greatest catastrophe to ever befall the world is about to evolve right before their very eyes.",
                "popularity": 7.8766,
                "poster_path": "/jPNShaWZMpVF0iQ7j1dvTuZLD20.jpg",
                "release_date": "2016-07-29",
                "title": "Shin Godzilla",
                "video": false,
                "vote_average": 7.218,
                "vote_count": 1449,
                "character": "Kayoko Ann Patterson : US special envoy",
                "credit_id": "560893a9c3a368586f001844",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "石原里美",
            "이시하라 사토미",
            "ساتومی ایشی هارا"
        ],
        "biography": "Satomi Ishihara, a prominent Japanese actress, has made significant marks in both film and television. Born on December 24, 1986, in Tokyo, Japan, Ishihara quickly rose to fame in the Japanese entertainment industry due to her compelling performances and versatile acting skills.\n\nShe gained widespread recognition for her roles in major films such as \"Shin Godzilla\" and the live-action adaptation of \"Attack on Titan,\" where her performances were critically acclaimed for adding depth and emotion to the films. Apart from her successful film career, Ishihara has also starred in a variety of TV dramas that have been popular both domestically and internationally. Notable among these is \"Shitsuren Chocolatier,\" a romantic drama series that further solidified her status as a leading actress in Japan.\n\nBeyond her professional life, Ishihara has been involved in high-profile relationships, including a notable relationship with Yuji Maeda, the president of the IT company \"SHOWROOM\". This relationship was highlighted during their stay at a luxury hotel in Taketomijima, which attracted significant media attention. Ishihara continues to be a significant figure in Japanese media, contributing to various genres and continuously engaging her audience with new and challenging roles.",
        "birthday": "1986-12-24",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.horipro.co.jp/ishiharasatomi/",
        "id": 224664,
        "imdb_id": "nm1595000",
        "known_for_department": "Acting",
        "name": "Satomi Ishihara",
        "place_of_birth": " Tokyo, Japan",
        "popularity": 2.5138,
        "profile_path": "/gFBK1fHFLA8qJvSohrfXuuOflwu.jpg"
    }
}