{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/edH2sKM63YiSEOWoaJPN87a71dZ.jpg",
                "genre_ids": [
                    18
                ],
                "id": 777245,
                "original_language": "en",
                "original_title": "Women Talking",
                "overview": "A group of women in an isolated religious colony struggle to reconcile their faith with a series of sexual assaults committed by the colony's men.",
                "popularity": 1.873,
                "poster_path": "/wcTc9GveMMjAdHSlzdE0FaRCtqi.jpg",
                "release_date": "2022-12-23",
                "title": "Women Talking",
                "video": false,
                "vote_average": 6.873,
                "vote_count": 649,
                "character": "Census Driver",
                "credit_id": "628e3d0ab6abc412979f7984",
                "order": 19
            },
            {
                "adult": false,
                "backdrop_path": "/rUAZnGMgISkZYJU8o7kuSNj3mPl.jpg",
                "genre_ids": [
                    28,
                    35,
                    10749
                ],
                "id": 22538,
                "original_language": "en",
                "original_title": "Scott Pilgrim vs. the World",
                "overview": "As bass guitarist for a garage-rock band, Scott Pilgrim has never had trouble getting a girlfriend; usually, the problem is getting rid of them. But when Ramona Flowers skates into his heart, he finds she has the most troublesome baggage of all: an army of ex-boyfriends who will stop at nothing to eliminate him from her list of suitors.",
                "popularity": 9.4823,
                "poster_path": "/g5IoYeudx9XBEfwNL0fHvSckLBz.jpg",
                "release_date": "2010-08-12",
                "title": "Scott Pilgrim vs. the World",
                "video": false,
                "vote_average": 7.49,
                "vote_count": 8203,
                "character": "Party Goer",
                "credit_id": "5fb843a079a1c300409f5432",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Will Seatle Bowes"
        ],
        "biography": "Will Bowes is a Canadian Actor, Filmmaker and Musician. After a role in Scott Pilgrim vs. the World (2010), Will guest starred as Thomas Faron on \"Degrassi: The Next Generation\" (2001) and has a supporting role in the horror/thriller, House at the End of the Street (2012), opposite Academy Award Nominee Jennifer Lawrence. Will began his acting career at 14, landing a recurring role on Disney's \"Naturally, Sadie\" (2005) and has since garnered many television credits including \"Connor Undercover\" (2009), \"The Latest Buzz\" (2007), \"How to Be Indie\" (2009), \"Life with Derek\" (2005), \"Unnatural History\" (2010), \"Testees\" (2008), \"Bakugan Battle Brawlers\" (2007) and \"Jane and the Dragon\" (2005). Apart from acting, Will is also an award winning Filmmaker. He Wrote and Directed the short film, Split Focus (2010), which toured festivals in Toronto, Boston, California, L.A, New York and Las Vegas. He received a Silver Award at the 2010 California Film Awards, an Honorable Mention at the 2010 Los Angeles Movie Awards and a Golden Ace Award at the 2011 Las Vegas Film Festival. He also beat out thousands of other entrants, winning Cineplex's Scene Directors Chair Contest, having his video broadcast in Cineplex theaters nationwide. As a Singer/Songwriter, Will has been making music since he was a child. At 11 years old, he released an original single in Canada, \"September Cry\", in response to the 9/11 tragedies. He plays in a band while also writes and records original material. Will graduated from Claude Watson and the Etobicoke School of the Arts in Toronto, attending the Radio and Television Arts program at Ryerson University.  IMDb Mini Biography By: OAZ",
        "birthday": "1990-06-14",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.willbowes.com",
        "id": 224724,
        "imdb_id": "nm2012029",
        "known_for_department": "Acting",
        "name": "Will Bowes",
        "place_of_birth": " London, Ontario, Canada",
        "popularity": 0.0953,
        "profile_path": "/s6tlxodwcvTAYSpcvB1mt5S09hL.jpg"
    }
}