{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5rwcd24GGltKiqdPT4G2dmchLr9.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 579583,
                "original_language": "en",
                "original_title": "The King of Staten Island",
                "overview": "Scott has been a case of arrested development ever since his firefighter father died when he was seven. He's now reached his mid-20s having achieved little, chasing a dream of becoming a tattoo artist that seems far out of reach. As his ambitious younger sister heads off to college, Scott is still living with his exhausted ER nurse mother and spends his days smoking weed, hanging with the guys — Oscar, Igor and Richie — and secretly hooking up with his childhood friend Kelsey. But when his mother starts dating a loudmouth firefighter named Ray, it sets off a chain of events that will force Scott to grapple with his grief and take his first tentative steps toward moving forward in life.",
                "popularity": 5.7274,
                "poster_path": "/zQFjMmE3K9AX5QrBL1SXIxYQ9jz.jpg",
                "release_date": "2020-07-22",
                "title": "The King of Staten Island",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 1067,
                "character": "Firefighter Gardner",
                "credit_id": "5ee4945b0cb3350020bbc55b",
                "order": 51
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Hank Strong is an actor who earned his name as a bodybuilder and a celebrity bodyguard in his younger years. Standing six feet six inches tall and weighing in at 270lbs, this actor is more than meets the eye. This beefcake may be all muscle but is also a former NYU student flexing his biggest muscle, his brain. Don't mistake this actor for a theatre geek. The young talent is tough too and isn't afraid to go full \"beast mode.\" Hank Strong's athleticism has enabled him to perform almost all of his own stunts in various roles. He commands an audience bringing a physical presence to the set that is clearly displayed on the screen.\n\nHank Strong was born and raised in Brooklyn, New York. His street savvy background prepared him for his recurring role as \"Big Dick Buster\" in The Godfather of Harlem. The series is based on the true story of drug kingpin Bumpy Johnson\" who is played by the Oscar Award winning Forrest Whitaker. In the comedy series, The Last OG, he plays 90's hood legend, John Booknight, a gangster notorious for knocking out enemies with one punch. Strong was casted as Carlo, the leader of an elite security squad employed by a mad scientist on an episode of The Blacklist, a hit show on NBC,. His former years as a celebrity bodyguard gave the actor an unfair advantage at that casting call, but don't be fooled!\n\nMore than muscles, he is not just a character actor playing the brute, the bad guy, the gangster, or the bodyguard. In the feature film, \"King of Staten Island,\" Strong plays firefighter, Sandy Gardner. After seeing this movie, Howard Stern the most moving scene was the fire fighting scene that Hank Strong stars in. Shortly after, Strong secured a role in Gotham, an action crime drama television series produced by the Warner Brothers based on DC Comics Batman Franchise showcases classic characters many of us know such as: Batman, Penguin, and the Riddler to name a few. From superstar to super villain, the actor plays the role of \"Lunkhead\" a sinister criminal with only bad intentions. In this role, he is able to live out childhood dreams surviving fights with both the Joker and Bruce Wayne, but ultimately meets his demise when he clashes with Catwoman. Though his character, \"Lunkhead,\" meets his end, that is not the end of Strong. The actor has all the ingredients that make for a promising career with longevity. Hank Strong demonstrates a broad range of a countless possibilities for the future with a resume boasting a substantial list of various roles in an expansive scope.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2249049,
        "imdb_id": "nm9279792",
        "known_for_department": "Acting",
        "name": "Hank Strong",
        "place_of_birth": "Brooklyn, New York, USA",
        "popularity": 0.2322,
        "profile_path": "/kP0qR3jgJGMtpUjBlkiqD7XkF2b.jpg"
    }
}