{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zYM9IbF08gB1Ip3Qee19HPvNY8T.jpg",
                "genre_ids": [
                    28,
                    18,
                    53,
                    80,
                    9648
                ],
                "id": 9386,
                "original_language": "en",
                "original_title": "In the Line of Fire",
                "overview": "Veteran Secret Service agent Frank Horrigan is a man haunted by his failure to save President Kennedy while serving protection detail in Dallas. Thirty years later, a man calling himself \"Booth\" threatens the life of the current President, forcing Horrigan to come back to protection detail to confront the ghosts from his past.",
                "popularity": 4.169,
                "poster_path": "/3NvOFpmyECI3DNExYMtFIRcGMsu.jpg",
                "release_date": "1993-07-08",
                "title": "In the Line of Fire",
                "video": false,
                "vote_average": 6.965,
                "vote_count": 1685,
                "character": "Jack Okura",
                "credit_id": "55e643afc3a3685f8e000a94",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/1pOp56fSV4XySjaGrhb6NPD2n4r.jpg",
                "genre_ids": [
                    18,
                    36,
                    28
                ],
                "id": 10423,
                "original_language": "en",
                "original_title": "Dragon: The Bruce Lee Story",
                "overview": "This film is a glimpse into the life, love and the unconquerable spirit of the legendary Bruce Lee. From a childhood of rigorous martial arts training, Lee realizes his dream of opening his own kung-fu school in America. Before long, he is discovered by a Hollywood producer and begins a meteoric rise to fame and an all too short reign as one the most charismatic action heroes in cinema history.",
                "popularity": 2.3536,
                "poster_path": "/lxhsdC8wuGgQf0gKCt8wyHHxGcQ.jpg",
                "release_date": "1993-05-07",
                "title": "Dragon: The Bruce Lee Story",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 768,
                "character": "History Teacher",
                "credit_id": "5968bb879251412b5201ed14",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "كلَيد كوساتسو"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nClyde Kusatsu (born September 13, 1948) is a U.S. actor.\n\nKusatsu was born and raised in Honolulu, Hawaii, where he attended ʻIolani School. Kusatsu began acting in Honolulu summer stock, and after studying theatre at Northwestern University, started to make his mark on the small screen in the mid-1970s. Usually mustachioed, with a dapper, professional air, he has most often played doctors, but his repertoire has included a generous sampling of teachers (usually college professors), businessmen, detectives, church ministers and other intelligent, middle-class types. With his quiet, wry line delivery, Kusatsu made a memorably clever and hilarious sparring partner for Archie Bunker (Carroll O'Connor) on several episodes of All in the Family as the Reverend Chong, refusing to baptize Archie's grandson without the permission of the boy's parents. During this period Kusatsu also worked with the Asian American theatre group East West Players in Los Angeles.\n\nKusatsu was subsequently a regular on several series, but neither the adventure Bring 'Em Back Alive (1982–83) nor the Hawaiian-set medical drama Island Son (1989–90) (in which he played one of Richard Chamberlain's colleagues) lasted very long. His many television movies have included the film adaptation of Farewell to Manzanar (1976), about Japanese American internment during World War II. Other M.O.W.s and mini-series have been \"And The Sea Will Tell\", and \"American Tragedy\" playing Judge Lance Ito. He had a memorable role in the \"Baa Baa Black Sheep\" episode \"Prisoners of War\" as a downed Japanese fighter pilot in the Pacific (1976). (Kusatsu also guest-starred on an episode of Lou Grant on Japanese internment in the U.S.); Golden Land (1988), a Hollywood-set drama based on a William Faulkner story; and the AIDS drama And the Band Played On (1993). He appeared in four M*A*S*H episodes and later starred in the short-lived A.B.C. series All American Girl (1994–1995), the first East Asian familiar sitcom in the U.S.\n\nFeature roles, beginning with Midway (1976), have generally been small, but in the 1990s Kusatsu had roles in Dragon: The Bruce Lee Story (1993, as a history teacher) and In the Line of Fire (1993, as a Secret Service agent). He appeared as a high school English teacher in American Pie (1999). Other recent films have been \"ShopGirl\" as Mr. Agasa, and in Sydney Pollack's The Interpreter (2005) as Lee Wu, head of security for the United Nations Headquarters. He currently plays the recurring role of Dr. Dennis Okamura on the CBS soap opera The Young and the Restless. Kusatsu starred in Harold &amp; Kumar Escape from Guantanamo Bay (2008) as Mr. Lee.\n\nKusatsu is married to Gayle Kusatsu; they have two sons, Kevin and Andrew.\n\nDescription above from the Wikipedia article Clyde Kusatsu, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1948-09-13",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2249,
        "imdb_id": "nm0476226",
        "known_for_department": "Acting",
        "name": "Clyde Kusatsu",
        "place_of_birth": "Honolulu, Hawaii, USA",
        "popularity": 0.799,
        "profile_path": "/5dTSe1F9cnReZGHYzbCbVy7vbcf.jpg"
    }
}