{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/okAHapFqs7Gx9wI8avrMVXVRUzU.jpg",
                "genre_ids": [
                    18,
                    10752
                ],
                "id": 53457,
                "original_language": "fr",
                "original_title": "Elle s'appelait Sarah",
                "overview": "On the night of 16 July 1942, ten year old Sarah and her parents are being arrested and transported to the Velodrome d'Hiver in Paris where thousands of other jews are being sent to get deported. Sarah however managed to lock her little brother in a closet just before the police entered their apartment. Sixty years later, Julia Jarmond, an American journalist in Paris, gets the assignment to write an article about this raid, a black page in the history of France. She starts digging archives and through Sarah's file discovers a well kept secret about her own in-laws.",
                "popularity": 1.108,
                "poster_path": "/peGUaf6HrX7jSi1HifX64QJb7pm.jpg",
                "release_date": "2010-09-16",
                "title": "Sarah's Key",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 696,
                "character": "Self (archive footage) (uncredited)",
                "credit_id": "5eb2b071caab6d0023dbf3d0",
                "order": 64
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "ジャック・シラク",
            "جاك شيراك",
            "Жак Ширак"
        ],
        "biography": "Jacques Chirac, born November 29, 1932 in Paris and died September 26, 2019 in the same city, was a senior French civil servant and statesman.\n\nHe was Prime Minister from 1974 to 1976, then again from 1986 to 1988, and President of the Republic from 1995 to 2007. After studying at the Institut d'Études Politiques de Paris and the École Nationale d'Administration (ENA), he joined the office of Prime Minister Georges Pompidou in 1962 as a special adviser. He was elected Member of Parliament for Corrèze within the Gaullist majority and appointed Secretary of State four times and Minister four times, starting in 1967.\n\nChirac was subsequently chosen as Prime Minister by Valéry Giscard d'Estaing in 1974. Two years later, having had poor relations with Giscard, he resigned from Prime Minister's office and launched the Rally for the Republic (RPR), a political party claiming to be Gaullist. While continuing his career as an elected official in Corrèze, he became Mayor of Paris in 1977 and ran in the 1981 presidential election.\n\nAfter the right-wing victory in the 1986 legislative elections, he was appointed by Socialist President François Mitterrand to serve as Prime Minister once again. He was thus the first head of government under a cohabitation regime under the Fifth Republic and, at the same time, the only politician to have served as Prime Minister twice under the same regime. He was defeated in the second round of the 1988 presidential election by the incumbent president, then became leader of the opposition, despite subsequently facing the growing popularity of Édouard Balladur.\n\nIn 1995, he was elected Head of State with 52.6% of the vote in the second round, defeating Socialist Lionel Jospin. He initially governed with the right-wing majority he acquired in 1993. The beginning of his first term was marked by a pension and social security reform that was massively contested and partially abandoned, and by the recognition of the French state's responsibility for the persecution and deportation of Jews during the Occupation. Following the dissolution of the National Assembly in 1997, he lost his majority in Parliament and was forced into cohabitation with Lionel Jospin, during which a referendum was held establishing the five-year presidential term: Jacques Chirac was thus the last president of the Fifth Republic to have served a seven-year term.\n\nIn the 2002 presidential election, he was re-elected for a five-year term with 82.2% of the vote in the second round, benefiting from a \"republican front\" against the National Front candidate, Jean-Marie Le Pen. During his second term, after launching the Union for a Popular Movement (UMP), he led the international opposition to the Iraq War launched by US President George W. Bush in 2003 and campaigned for a \"yes\" vote in the 2005 referendum on the European Constitution, which resulted in a \"no\" victory.\n\nAt the end of his presidency in 2007, faced with low popularity and a succession of electoral defeats, and weakened by a stroke in 2005, he decided not to seek a third term. On June 9, 2008, the \"Chirac Foundation\" for sustainable development and intercultural dialogue was launched.\n\nJacques Chirac died in Paris on September 26, 2019.",
        "birthday": "1932-11-29",
        "deathday": "2019-09-26",
        "gender": 2,
        "homepage": "https://www.elysee.fr/jacques-chirac",
        "id": 225582,
        "imdb_id": "nm0158105",
        "known_for_department": "Acting",
        "name": "Jacques Chirac",
        "place_of_birth": "Paris, France",
        "popularity": 0.0621,
        "profile_path": "/c0ckSdaB4IurFscsfF1VUzLOEvI.jpg"
    }
}