{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5VuOmxGfqu7yf05q8Q6SUKOh7oe.jpg",
                "genre_ids": [
                    12,
                    18,
                    36
                ],
                "id": 169881,
                "original_language": "en",
                "original_title": "The Physician",
                "overview": "England, 1021. Rob Cole, a boy born in a miserable mining town, swears to become a physician and vanquish disease and death. His harsh path of many years, a quest for knowledge besieged by countless challenges and sacrifices, leads him to the remote Isfahan, in Persia, where he meets Ibn Sina, the greatest healer of his time.",
                "popularity": 3.2959,
                "poster_path": "/18eJr4Fc4HKymLgKLgGQbD37SPK.jpg",
                "release_date": "2013-12-25",
                "title": "The Physician",
                "video": false,
                "vote_average": 7.349,
                "vote_count": 1119,
                "character": "Mirdin's Mother",
                "credit_id": "6387531ba410c800c887209e",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Fatima Harandi",
            "Raouia",
            "Fatima Hernadi"
        ],
        "biography": "Fatima Hernadi is a Moroccan actress known for the name Raouia, born in Azemmour(1951). She moved to Casablanca to finish her studies at the Chawki high school, where she joined the Mansour Theatre Company, with which she won the award for best actress for the play ‘Failers’ at the national festival of theatre called ‘perdant’. Until 1978, she entered the cinema world, with the director Mohamed El Abazi, in his film ‘Atlas Treasures’. She acted in a 2004 film entitled ‘Yeux Secs’ with Narjiss Nejjar, a role that introduced her to Moroccan cinema. She won the best ‘Starlet’ at the Territorial Festival of Spectacle for her role in ‘Saga, The Story of Men Who Never Come Back’. She was chosen as a member of the jury of the 16th edition of the International Film Festival of Marrakech.",
        "birthday": "1951-01-01",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 2255783,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Fatima Herandi Raouya",
        "place_of_birth": null,
        "popularity": 0.3633,
        "profile_path": "/loPS803u2MDubbvk29xD5WumNFd.jpg"
    }
}