{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7ldtxkVW93dTVKRrA2Fe0CSl0S1.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 11798,
                "original_language": "en",
                "original_title": "This Is England",
                "overview": "A story about a troubled boy growing up in England, set in 1983. He comes across a few skinheads on his way home from school, after a fight. They become his new best friends, even like family. Based on experiences of director Shane Meadows.",
                "popularity": 0.9961,
                "poster_path": "/bmhVn89BoAAIziFklH3TusE26H0.jpg",
                "release_date": "2007-04-27",
                "title": "This Is England",
                "video": false,
                "vote_average": 7.481,
                "vote_count": 1331,
                "character": "Woody",
                "credit_id": "52fe44879251416c75038087",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/1tqzKtAWMRURxPTvs1hzcSOoKxe.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 234200,
                "original_language": "en",
                "original_title": "Pride",
                "overview": "In 1984, a group of LGBT activists decide to raise money to support the National Union of Mineworkers during their lengthy strike. There is only one problem: the Union seems embarrassed to receive their support.",
                "popularity": 3.2875,
                "poster_path": "/mrITqHNw0XzT7egAPByDuiE3QZf.jpg",
                "release_date": "2014-09-12",
                "title": "Pride",
                "video": false,
                "vote_average": 7.704,
                "vote_count": 1357,
                "character": "Mike",
                "credit_id": "53b205750e0a26598c0091da",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Joe Gilgun"
        ],
        "biography": "Joseph William Gilgun (born 9 March 1984) is an English actor known for several roles, including that of Vinnie O'Neill in the Sky One series Brassic, Eli Dingle in the ITV soap opera Emmerdale, Jamie Armstrong in the long-running ITV soap opera Coronation Street, Woody in the film This Is England (2006) and its subsequent spin-off series, and Rudy Wade in E4's Misfits. From 2016 to 2019, he starred in the AMC television adaptation of the Vertigo comic Preacher as the Irish vampire Cassidy.\n\nGilgun was born in Chorley, Lancashire, to Judith and Andrew Gilgun. He grew up in Rivington, Lancashire, as part of a working-class family with his two younger sisters, Jennie Seddon and Rosie Thomson. Gilgun attended Rivington VA Primary School and Southlands High School. He has dyslexia and ADHD, which he describes as the \"biggest pain of [his] life\" and in interviews has openly discussed depression and anxiety. He started drama workshops at the age of eight, following advice from an educational psychologist, and was described as having \"exceptional talent\". He also trained at the Laine Johnson Theatre School and the Oldham Theatre Workshop. When he was 10, he got his first TV acting role in Coronation Street. He stayed with the show until he was thirteen years old.\n\nGilgun studied A-Levels at Runshaw College. Outside of odd jobs and a few roles in small theatre productions, Gilgun worked as a plasterer until returning to acting full-time with Emmerdale in 2006.",
        "birthday": "1984-03-09",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.hamiltonhodell.co.uk/talent/joseph-gilgun/",
        "id": 225610,
        "imdb_id": "nm0318543",
        "known_for_department": "Acting",
        "name": "Joseph Gilgun",
        "place_of_birth": "Chorley, Lancashire, England, UK",
        "popularity": 1.3564,
        "profile_path": "/A8wFwzX8ejdfgeNG7OPbz87ZCrs.jpg"
    }
}