{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/vNPY4oCSUp7CxbHkKJNRx1fmCl0.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 497828,
                "original_language": "en",
                "original_title": "Triangle of Sadness",
                "overview": "A celebrity model couple are invited on a luxury cruise for the uber-rich, helmed by an unhinged, alcoholic captain. What first appears Instagrammable ends catastrophically, leaving the survivors stranded on a desert island in a struggle of hierarchy.",
                "popularity": 5.6944,
                "poster_path": "/k9eLozCgCed5FGTSdHu0bBElAV8.jpg",
                "release_date": "2022-09-18",
                "title": "Triangle of Sadness",
                "video": false,
                "vote_average": 7.045,
                "vote_count": 2561,
                "character": "Jarmo",
                "credit_id": "5e2afa83c56d2d001349eb82",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Per Henrik Dorsin",
            "亨里克多爾辛"
        ],
        "biography": "Per Henrik Dorsin (born 20 November 1977, Lidingö Municipality, Stockholm County, Sweden) is a Swedish actor, comedian, singer and revue-artist. Dorsin started his career as an extra in the 1995, film Vinterviken. He started his television career in the satire-show Detta har hänt in 1998. He then worked as a revue-artist and dramatist, he produced the revue Slängar av sleven, and has participated in shows with the theatre group Stockholms blodbad. He also worked with the SVT entertainment show Säpop, and he has been part of the TV4 comedy show Parlamentet. In 2007, he won the Karamelodiktstipendiet by Povel Ramel. In 2014, Dorsin toured with the comedy play Henrik Dorsin – näktergalen från Holavedsvägen. And since 2014, Dorsin runs the theater Scalateatern in Stockholm.\n\nHis younger brother is former football player Mikael Dorsin. He is married to comedian Hanna Dorsin.",
        "birthday": "1977-11-20",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 225636,
        "imdb_id": "nm2172895",
        "known_for_department": "Acting",
        "name": "Henrik Dorsin",
        "place_of_birth": "Lidingö, Stockholms län, Sweden",
        "popularity": 0.1628,
        "profile_path": "/xCy1BDKAeGNCV6V1ntyYvo3kBB0.jpg"
    }
}