{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3EJJClmGZwu7e6nsj1l0OBNdXfT.jpg",
                "genre_ids": [
                    35
                ],
                "id": 33701,
                "original_language": "fr",
                "original_title": "Les Bronzés font du ski",
                "overview": "In this sequel to Les Bronzes (1978) summer has passed, but that doesn't mean the fun has to end for Bernard, Nathalie, Gigi, Jerome, Popeye, Jean-Claude, and Christiane.",
                "popularity": 2.0673,
                "poster_path": "/uTN0bp8yMUKesNTLXR1GnL2kLFs.jpg",
                "release_date": "1979-11-22",
                "title": "French Fried Vacation 2",
                "video": false,
                "vote_average": 7.344,
                "vote_count": 1233,
                "character": "Co-owner of the apartment who leaves late",
                "credit_id": "59342d1f9251417dea0217d2",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Michel Such, born in 1944 in Algiers, is a French actor, screenwriter and director.\n\nMichel Such entered the film industry somewhat by chance. \"I was working in a bistro, the Santa Cruz, on rue Saint-André-des-Arts in Paris, near a film school. I met people behind the bar who allowed me to get a foot in the door in the profession,\" he explains. Michel Such went on stage and made his mark there. One day while he was working on a medium-length film by director Luc Béraud, the latter's assistant fell ill. \"I gave him a helping hand and he never left me. He was the one who introduced me to Claude Miller, Patrice Leconte and the others.\" Claude and Annie Miller were particularly important to him. \"They followed me and helped me when I moved on to directing. »\n\nMichel Such, becomes one of the essential supporting actors of French cinema, with very popular films like The Best Way to Walk, Les Bronzés or even Come to My Place, I Live with a Copine. Subscribed to supporting roles, silhouettes and appearances, everyone has already seen him at least once. He is the one who takes the scrabble on the face in \"Les Bronzés font du ski\", the one who goes underwater on water skis in \"Les Bronzés\", the killer in \"Garde à vue\", a policeman in \"Mes meilleurs copains\", a patient in \"Chouchou\" with Gad Elmaleh, the man with the briefcase in \"Mortal hike\" or the shoe salesman in \"Police Python 357\" by Alain Corneau...\n\nMichel who was assistant director to Luc Béraud, Claude Miller, Patrice Leconte, Gérard Vergez, Jean-Marie Poiré, Jean-Louis Leconte, James Cellan Jones etc, will direct three short films: Elli Fat Mat (1990), Vagues À L'Âme (1992) and Vingt-Trois Rue Des Francs Bourgeois (1995), and a feature, Oranges Amères, released in theaters in 1997. The story of Angèle, a pied-noir, who falls in love with Saïd, an Algerian, after the Second World War. The film received the SACD Beaumarchais Prize for the screenplay (1996), as well as the Audience Award at the Montpellier Mediterranean Film Festival in 1996.\n\nMichel Such has been directing the amateur theatre troupe Saujon Comédia, in Saujon in Charente-Maritime, since the end of the 1990s.",
        "birthday": "1944-08-15",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 225653,
        "imdb_id": "nm0837039",
        "known_for_department": "Acting",
        "name": "Michel Such",
        "place_of_birth": "Algiers, Algeria",
        "popularity": 0.1066,
        "profile_path": "/9eyMfDSSvVVlHdHAPnV7hwePS1u.jpg"
    }
}