{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gh9YcpJ01IsrwGkB3IK8K3LWQ25.jpg",
                "genre_ids": [
                    18,
                    28,
                    10752
                ],
                "id": 517093,
                "original_language": "ru",
                "original_title": "Балканский рубеж",
                "overview": "After the NATO bombing of Yugoslavia in 1999, the Yugoslav army pulls out of Kosovo region, leaving Serbian people at the mercy of the Albanian UCK. A small band of soldiers must take over the Slatina airport, and hold it until the Russian peacekeepers arrive.",
                "popularity": 6.7478,
                "poster_path": "/okiB4NUriKKbGjAtVSzveicPTtu.jpg",
                "release_date": "2019-03-21",
                "title": "Balkan Line",
                "video": false,
                "vote_average": 7.459,
                "vote_count": 558,
                "character": "Goran Milić",
                "credit_id": "5acb11470e0a2631fa00b3fc",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Гойко Митич",
            "Goyko Mitic",
            "Georg Mitic"
        ],
        "biography": "Gojko Mitić (was born June 13, 1940, in Strojkovce near Leskovac, Morava Banovina, Kingdom of Yugoslavia) is a Serbian director, actor, stuntman, and author. He lives in Berlin.\n\nHe is known for a numerous series of Red Westerns from the GDR DEFA Studios, featuring Native Americans as the heroes, rather than white settlers as in John Ford's Westerns. Beginning with The Sons of Great Bear (1966), Mitić starred in 12 films of this type between 1966 and 1984. He contributed to the popular image of Native Americans in German-speaking countries.\n\nIn an attempt to move away from his fame based on these Westerns, Mitić in his later career increasingly sought to appear in other genres, on film, on television, and on stage. Among other roles, he played Spartacus on stage and presented several TV shows.\n\nHe also played Karl May's Winnetou in seasons at the \"Karl-May-Festspiele\" until 2006 in Bad Segeberg near Hamburg, Germany. In one episode he played a role at the German television program, Schloss Einstein.\n\nBulgarian punk rock & ska group Hipodil composed a song, Bate Goiko, dedicated to Gojko Mitić. In 2010, he received the Brothers Karić Award in Serbia.\n\n(from Wikipedia)",
        "birthday": "1940-06-13",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 22588,
        "imdb_id": "nm0593900",
        "known_for_department": "Acting",
        "name": "Gojko Mitić",
        "place_of_birth": "Strojkovce near Leskovac, Morava Banovina, Kingdom of Yugoslavia",
        "popularity": 0.6565,
        "profile_path": "/mPHF1GvdLVDJXtRq7X0Qe4uKFl.jpg"
    }
}