{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dcyPj11c00lOhMESAVWtJKzlHt4.jpg",
                "genre_ids": [
                    18
                ],
                "id": 250538,
                "original_language": "en",
                "original_title": "The Good Lie",
                "overview": "A young refugee of the Sudanese Civil War who wins a lottery for relocation to the United States with three other lost boys. Encountering the modern world for the first time, they develop an unlikely friendship with a brash American woman assigned to help them, but the young man struggles to adjust to this new life and his feelings of guilt about the brother he left behind.",
                "popularity": 2.1143,
                "poster_path": "/yAhoeIwwtPxJ7uf9HLIMHIqWFnL.jpg",
                "release_date": "2014-09-10",
                "title": "The Good Lie",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 543,
                "character": "Paul",
                "credit_id": "54ec9a32c3a3686d58001b68",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jal Jok"
        ],
        "biography": "In the war-torn region of Southern Sudan, Emmanuel Jal was born into the life of a child solider on an unknown date in the early 1980s. Through unbelievable struggles, Emmanuel managed to survive and emerge as a recording artist, achieving worldwide acclaim for his unique style of hip hop with its message of peace and reconciliation born out of his personal experiences. Emmanuel has released four studio albums: Gua, Ceasefire, Warchild and See Me Mama.\n\nEmmanuel's live appearances have included Live 8 , Nelson Mandela's 90th Birthday Concert and the One Concert for his Holiness the Dalai Lama. He has performed with acts such as Faithless, Razorlight, Supergrass and Fat Boy Slim in Europe and has toured the United States as part of the National Geographic All Roads Film Festival, in which he performed in New York, Washington DC, Los Angeles and New Orleans. Jal also performed with Moby and Five for Fighting in the 2007 live concert film, with Alicia Keys at her Black Ball in New York and more recently with Joss Stone at the Melbourne Festival closing Concert, 2011 and Peter Gabriel at the 20th anniversary celebrations for WITNESS, 2012.\n\nEmmanuel is in demand as a speaker and has addressed the UN, US Congress, the Carter Centre and the highest tiers of several governments. He has been involved with the British Council, Clinton Global Initiative, Adolescent Girls Initiative (World Bank in association with the Nike Foundation), Child Soldiers Initiative and the launch of Ericsson's Refugees Reunited Software. He was one of the faces of Amnesty International's 2010 World Refugee Day Campaign and appeared at Alicia Keys' Keep a Child Alive Black Ball 2010 in London.\n\nIn 2008 a full-length documentary on his life was released. The film, Warchild, won 12 prestigious film festival awards worldwide. In the same year, his autobiography, also called Warchild, was published by Little Brown.\n\nEmmanuel Jal appears as the adult lead in the major motion picture Africa United, a Pathé, UK Film Council and BBC Films presentation in association with Warner Bros, released in October 2010. In 2013 Emmanuel was cast as one of lead characters in 'The Good Lie' alongside Reese Witherspoon. The film follows the journey of three 'Lost Boys' from South Sudan to the US, due for worldwide release through Warner Bros in February 2014.\n\nEmmanuel's music has been used in films, documentary and TV including: Blood Diamond, Girl Rising, ER and National Geographic.  IMDb Mini Biography By: Emmanuel Jal",
        "birthday": "1980-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": "http://emmanueljal.com/",
        "id": 226057,
        "imdb_id": "nm2897500",
        "known_for_department": "Acting",
        "name": "Emmanuel Jal",
        "place_of_birth": "Tonj - South Sudan",
        "popularity": 0.0214,
        "profile_path": null
    }
}