{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5vuQnRJURp6rZoEEnhW0HC7DBQc.jpg",
                "genre_ids": [
                    10749,
                    35,
                    18
                ],
                "id": 3109,
                "original_language": "en",
                "original_title": "The Quiet Man",
                "overview": "An American man returns to the village of his birth in Ireland, where he finds love and conflict.",
                "popularity": 2.1903,
                "poster_path": "/u3B1hVKHE56yBRoxF3Nk9uxHdYN.jpg",
                "release_date": "1952-07-21",
                "title": "The Quiet Man",
                "video": false,
                "vote_average": 7.321,
                "vote_count": 564,
                "character": "Rev. Cyril 'Snuffy' Playfair",
                "credit_id": "52fe4387c3a36847f805b0eb",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia.\n\nArthur Shields (15 February 1896 - 27 April 1970) was an Irish stage and film actor.\n\nBorn into an Irish Protestant family in Portobello, Dublin, he started acting in the Abbey Theatre when still a young man. He was the younger brother of actor Barry Fitzgerald. An Irish nationalist, he fought in the Easter Uprising of 1916. He was captured and was interned in Frongoch, North Wales. He afterwards returned to the Abbey theatre. In 1936 John Ford brought him to the United States to act in a film version of The Plough and the Stars.\n\nHe later returned to the U.S. and for health reasons, he decided to reside in California. He died at his home in Santa Barbara, California, aged 74.\n\nSome of his memorable roles were in John Ford films. Shields portrayed the Reverend Playfair in Ford's The Quiet Man, opposite John Wayne, Maureen O'Hara and his brother, Barry Fitzgerald. He played Dr. Laughlin in She Wore a Yellow Ribbon with Wayne and Joanne Dru, and appeared yet again with Wayne and Barry Fitzgerald in Ford's Long Voyage Home. His other films include: Little Nellie Kelly, The Keys of the Kingdom, The Fabulous Dorseys, Gallant Journey, The Shocking Miss Pilgrim, Drums Along the Mohawk, Lady Godiva, National Velvet and The River.\n\nDescription above from the Wikipedia article Arthur Shields, licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": "1896-02-15",
        "deathday": "1970-04-27",
        "gender": 2,
        "homepage": null,
        "id": 22603,
        "imdb_id": "nm0793168",
        "known_for_department": "Acting",
        "name": "Arthur Shields",
        "place_of_birth": "Dublin, Ireland",
        "popularity": 0.2751,
        "profile_path": "/skFqVhpntMZOCnOrpi6QvZESmZe.jpg"
    }
}