{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/orXMq2jZy8wFmePv7zXS2Kor7Ug.jpg",
                "genre_ids": [
                    37,
                    27,
                    18
                ],
                "id": 294963,
                "original_language": "en",
                "original_title": "Bone Tomahawk",
                "overview": "During a shootout in a saloon, Sheriff Hunt injures a suspicious stranger. The doctor's assistant, wife of the local foreman, tends to him in prison. That night, the town is attacked and they both disappear—only the arrow of a cannibal tribe is found. Hunt and a few of his men go in search of the prisoner and the foreman's wife.",
                "popularity": 3.0127,
                "poster_path": "/4MmTHpn2Y8emqvBgvOjufImUmKZ.jpg",
                "release_date": "2015-10-23",
                "title": "Bone Tomahawk",
                "video": false,
                "vote_average": 6.871,
                "vote_count": 2382,
                "character": "Wolf Skull",
                "credit_id": "58e20f8a92514127e800a772",
                "order": 23
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Raw Le'Jba"
        ],
        "biography": "Raw Leiba was born in Newark, New Jersey to a Brazilian mother and an African American/Native American father. His father Robert was a US Army Veteran and served with the famed Tuskegee Airmen in WWII and his uncle is former NY Giant hall of famer Roosevelt Brown.  Leiba attended high school in NJ and later moved to Tempe, Arizona where he attended  High School. Possessing a 4.3 second 40 yard dash speed and a 44 inch vertical jump he soon got the attention of Arizona State University basketball assistant coaches and Head Football coach John Cooper. He signed with Arizona State under the condition that he be allowed to play both football and basketball for the school. After graduating he went to Spain to play professional basketball for Barcelona EL of the European League where he played a full season. After being waived in his second season Leiba took an invitation to the NFL San Diego Chargers mini-camp where he impressed coaches with his tremendous speed and leaping ability. He made the \"Practice Squad\" but was soon released when he told head coach Bobby Ross that he wanted to be an actor and could no longer commit to sports.  Leiba gained national attention when he won the the TLC'S reality action show Help Wanted, a spin-off of ABC TV'S The Next Action Hero, where competitors compete in acting and stunt roles. Leiba again showed his great athleticism and the guile that he is known for but coupled that with great acting ability.  Raw Leiba has gone on to do major movies and motion pictures and is also one of the top Sportsmodels in the world",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 226112,
        "imdb_id": "nm2836170",
        "known_for_department": "Acting",
        "name": "Raw Leiba",
        "place_of_birth": "Newark, New Jersey, USA ",
        "popularity": 0.1119,
        "profile_path": null
    }
}