{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xBSwwkAYl9h8QVG2OxNpSaSgJwr.jpg",
                "genre_ids": [
                    10749,
                    18
                ],
                "id": 43949,
                "original_language": "en",
                "original_title": "Flipped",
                "overview": "When Juli meets Bryce in the second grade, she knows it's true love. After spending six years trying to convince Bryce the same, she's ready to give up - until he starts to reconsider.",
                "popularity": 5.208,
                "poster_path": "/6zDYFigohwncqFL00MKbFV01dWb.jpg",
                "release_date": "2010-08-06",
                "title": "Flipped",
                "video": false,
                "vote_average": 8.0,
                "vote_count": 3178,
                "character": "Matt Baker",
                "credit_id": "58a9b044c3a3680bdc008786",
                "order": 25
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Shane Steven Harper"
        ],
        "biography": "​Shane Harper standing in at 6' 2\" (1.88 m) was born on February 14, 1993 (Aquarius) as Shane Steven Harper. He is a male American actor, dancer and singer. Shane began dancing, singing, and acting in community theater at the age of 9. He was offered agency representation in the spring of 2006, at a regional dance competition. Shane obtained a black belt in Kempo Karate, and is an accomplished musician and songwriter, as well as a professionally trained dancer. After booking the first 3 jobs that he auditioned for, he continued to work hard, and pursued a career in the entertainment industry. Shane has become an established actor in television and feature films. He is best known as his role as Spencer Walsh in the Disney Channel's teen sitcom Good Luck Charlie and as a principal dancer in High School Musical 2. He has also been seen in the season 4 of Wizards of Waverly Place guest starring as \"Fidel\". His self-titled debut album was released on April 12, 2011. He resides in Los Angeles, Ca.",
        "birthday": "1993-02-14",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 226371,
        "imdb_id": "nm2436499",
        "known_for_department": "Acting",
        "name": "Shane Harper",
        "place_of_birth": "La Jolla, San Diego, California, USA",
        "popularity": 0.484,
        "profile_path": "/4hZDzXBDeUbs8bxYevJEmXNVhyE.jpg"
    }
}