{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/nLFxvLokHe3bQmrmAfljIfax2jQ.jpg",
                "genre_ids": [
                    878,
                    80
                ],
                "id": 185,
                "original_language": "en",
                "original_title": "A Clockwork Orange",
                "overview": "In a near-future Britain, young Alexander DeLarge and his pals get their kicks beating and raping anyone they please. When not destroying the lives of others, Alex swoons to the music of Beethoven. The state, eager to crack down on juvenile crime, gives an incarcerated Alex the option to undergo an invasive procedure that'll rob him of all personal agency. In a time when conscience is a commodity, can Alex change his tune?",
                "popularity": 9.0838,
                "poster_path": "/4sHeTAp65WrSSuc05nRBKddhBxO.jpg",
                "release_date": "1971-12-19",
                "title": "A Clockwork Orange",
                "video": false,
                "vote_average": 8.185,
                "vote_count": 13337,
                "character": "Mrs. Alexander",
                "credit_id": "52fe4224c3a36847f80071ed",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/rgy1Nf2kf7UodG4BI6awfQqttac.jpg",
                "genre_ids": [
                    18,
                    10749,
                    10752
                ],
                "id": 907,
                "original_language": "en",
                "original_title": "Doctor Zhivago",
                "overview": "The life of a Russian physician and poet who, although married to another, falls in love with a political activist's wife and experiences hardship during World War I and then the October Revolution.",
                "popularity": 4.3467,
                "poster_path": "/r0Iv2BiCFYDnzc6uU1q3AJ56igT.jpg",
                "release_date": "1965-12-22",
                "title": "Doctor Zhivago",
                "video": false,
                "vote_average": 7.542,
                "vote_count": 1206,
                "character": "Amelia",
                "credit_id": "57bcebd5c3a3682237008d04",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Adrienne Corri (born 13 November 1930 in Edinburgh, Scotland) is an actress of Italian parentage.\n\nShe is probably best known for her role as the rape victim Mrs. Alexander in the 1971 Stanley Kubrick film A Clockwork Orange, and for her appearances as Valerie in Jean Renoir's The River (1951) and as Lara's mother in David Lean's Dr. Zhivago (1965). She appeared in many horror and suspense films in the 1950s until the 1970s including Devil Girl from Mars, The Tell-Tale Heart, A Study in Terror and Vampire Circus. She also appeared as Therese Duval in Revenge of the Pink Panther. She also was in the 1969 science fiction movie Moon Zero Two and in the 1969 Twelfth Night, directed by John Sichel, as the Countess Olivia opposite Alec Guinness as Malvolio.\n\nHer numerous television credits include Angelica in Sword of Freedom (1958), a regular role in A Family At War and You're Only Young Twice, a 1971 television play by Jack Trevor Story, as Mena in the Doctor Who story \"The Leisure Hive\" and guest starred as the mariticidal Liz Newton in the UFO episode \"The Square Triangle\".\n\nShe had a major stage career. There is a story that, when the audience booed on the first night of John Osborne's The World Of Paul Slickey, Corri responded with her own abuse: she raised two fingers to the audience and shouted \"Go fuck yourselves\".\n\nCorri has married and divorced twice, to the actors Daniel Massey (1961-1967) and Derek Fowlds.\n\nHer book The Search for Gainsborough (Jonathan Cape: 1984) contained much original research, including examination of banking records, and made a plausible case for 1726 as his birth year.\n\nDescription above from the Wikipedia article  Adrianne Corri, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1930-11-13",
        "deathday": "2016-03-13",
        "gender": 1,
        "homepage": null,
        "id": 2265,
        "imdb_id": "nm0180920",
        "known_for_department": "Acting",
        "name": "Adrienne Corri",
        "place_of_birth": "Glasgow, Lanarkshire, Scotland, UK",
        "popularity": 0.5789,
        "profile_path": "/jlwXRVJUscG3GnYGfBXT5KDCbss.jpg"
    }
}