{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/nLFxvLokHe3bQmrmAfljIfax2jQ.jpg",
                "genre_ids": [
                    878,
                    80
                ],
                "id": 185,
                "original_language": "en",
                "original_title": "A Clockwork Orange",
                "overview": "In a near-future Britain, young Alexander DeLarge and his pals get their kicks beating and raping anyone they please. When not destroying the lives of others, Alex swoons to the music of Beethoven. The state, eager to crack down on juvenile crime, gives an incarcerated Alex the option to undergo an invasive procedure that'll rob him of all personal agency. In a time when conscience is a commodity, can Alex change his tune?",
                "popularity": 9.0838,
                "poster_path": "/4sHeTAp65WrSSuc05nRBKddhBxO.jpg",
                "release_date": "1971-12-19",
                "title": "A Clockwork Orange",
                "video": false,
                "vote_average": 8.185,
                "vote_count": 13337,
                "character": "Chief Guard",
                "credit_id": "52fe4224c3a36847f80071f1",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/txXPooNu7fr4YhLwx7AlXkU0PnN.jpg",
                "genre_ids": [
                    10752,
                    18,
                    36
                ],
                "id": 11202,
                "original_language": "en",
                "original_title": "Patton",
                "overview": "\"Patton\" tells the tale of General George S. Patton, famous tank commander of World War II. The film begins with Patton's career in North Africa and progresses through the invasion of Germany and the fall of the Third Reich. Side plots also speak of Patton's numerous faults such his temper and habit towards insubordination.",
                "popularity": 4.0879,
                "poster_path": "/8IRufbzhMJSdlmD0cnTWERCtTN2.jpg",
                "release_date": "1970-01-25",
                "title": "Patton",
                "video": false,
                "vote_average": 7.48,
                "vote_count": 1147,
                "character": "Field Marshal Sir Bernard Law Montgomery",
                "credit_id": "52fe440f9251416c750278a7",
                "order": 17
            },
            {
                "adult": false,
                "backdrop_path": "/6w5vhyn1ostgMva0wR63WQezi7P.jpg",
                "genre_ids": [
                    80,
                    53,
                    27
                ],
                "id": 573,
                "original_language": "en",
                "original_title": "Frenzy",
                "overview": "London is terrorized by a vicious sex killer known as The Necktie Murderer. Following the brutal slaying of his ex-wife, down-on-his-luck Richard Blaney is suspected by the police of being the killer. He goes on the run, determined to prove his innocence.",
                "popularity": 6.8424,
                "poster_path": "/zDUR4PY5kyp2hpvbTvWSGiXVmgg.jpg",
                "release_date": "1972-05-25",
                "title": "Frenzy",
                "video": false,
                "vote_average": 7.104,
                "vote_count": 943,
                "character": "Sergeant Spearman",
                "credit_id": "5e403a8c9603310017ed8bc8",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Michael Hammond Bates"
        ],
        "biography": "​From Wikipedia, the free encyclopedia\n\nMichael Hammond Bates was an Indian-born English actor. He was educated at Uppingham School in Rutland and St Catharine's College, Cambridge. \n\nBates served as a Major serving with the Brigade of Gurkhas in Burma before his discharge at the end of World War II. In 1953, while an ensemble member with the Stratford Festival in Stratford, Ontario, he appeared in Richard III and All's Well That End's Well. In 1956 he appeared in Hotel Paradiso which starred Alec Guinness, at the Winter Garden Theatre in London.\n\nHe appeared in many UK television series including Last of the Summer Wine from 1973 to 1975 as Cyril Blamire and It Ain't Half Hot Mum from 1974 to 1977 as Rangi Ram, as well as many others. His role as Rangi Ram caused some controversy as it required Bates to be made-up with fake tan to look like an Indian, which he took to naturally as he was born in India and spoke the Hindi language fluently. On radio he played a variety of characters in the BBC's long-running comedy series The Navy Lark. These were: Able Seaman Ginger, Lt. Bates, Rear Admiral Ironbridge, the Padre and Captain Ignatius Aloysius Atchison.\n\nBates' film roles include Battle of Britain (1969) as Warrant Officer Warwick, Oh! What a Lovely War (1969) as a Lance-corporal, Patton (1970) as Field Marshal Sir Bernard Law Montgomery (to whom he bore a striking resemblance), Frenzy (1972) by Alfred Hitchcock, and the Stanley Kubrick film A Clockwork Orange (1971). On stage, he did Shakespeare at Stratford and the Old Vic and made a big impression as Inspector Truscott in the West End production of Loot by Joe Orton in 1966. He died of cancer in Cambridge, aged 57.\n\nDescription above from the Wikipedia article Michael Bates (actor), licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1920-12-04",
        "deathday": "1978-01-11",
        "gender": 2,
        "homepage": null,
        "id": 2267,
        "imdb_id": "nm0060988",
        "known_for_department": "Acting",
        "name": "Michael Bates",
        "place_of_birth": "Jhansi, British India (now Jhansi, Uttar Pradesh, India)",
        "popularity": 0.5163,
        "profile_path": "/53ciikCHIcr1thlDFvQtzNNbFAd.jpg"
    }
}