{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/nDfZN2q1IPGaLiwAgr9sU209MU5.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 489925,
                "original_language": "en",
                "original_title": "Eighth Grade",
                "overview": "Thirteen-year-old Kayla endures the tidal wave of contemporary suburban adolescence as she makes her way through the last week of middle school — the end of her thus far disastrous eighth grade year — before she begins high school.",
                "popularity": 3.5162,
                "poster_path": "/xTa9cLhGHfQ7084UvoPQ2bBXKqd.jpg",
                "release_date": "2018-01-19",
                "title": "Eighth Grade",
                "video": false,
                "vote_average": 7.16,
                "vote_count": 1591,
                "character": "Mr. McDaniel",
                "credit_id": "5a1fa894925141032608c97f",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Greg Crowe was born at the US Naval Hospital in Yokosuka, Japan. But because of the International Dateline, he is never absolutely certain when exactly he should celebrate his birthday when in the US. Greg's father was an NCO in the Navy, and his family moved to San Diego, California before Greg was a year old. In the summer in which he was five years old, his family moved to Maryland, where he spent the remainder of his formative years.\n\nGreg only relatively recently realized he wanted to be an actor when he grew up (whenever that might be). In the last few years he has played everything from a corrupt senator to a quirky coworker to a nerdy boyfriend to an angry, angry squirrel. His favorite roles are ones that test his abilities and push them farther than he thought possible.",
        "birthday": "1965-03-13",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 226780,
        "imdb_id": "nm2958826",
        "known_for_department": "Acting",
        "name": "Greg Crowe",
        "place_of_birth": "Yokosuka, Japan",
        "popularity": 0.0538,
        "profile_path": "/mvoDSIzPAndlcWgnXC6uOXm0ZRs.jpg"
    }
}