{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7Q44vznK8E9SYsdkmIanrLmydZn.jpg",
                "genre_ids": [
                    28,
                    80,
                    18,
                    36,
                    53
                ],
                "id": 6968,
                "original_language": "de",
                "original_title": "Der Baader Meinhof Komplex",
                "overview": "When German police viciously quell a protest against the shah of Iran, popular journalist Ulrike Meinhof rebels against her dishonest marriage, walks away from her children and joins radical anarchist Andreas Baader. Together with Baader's girlfriend, Gudrun Ensslin, they form the violent Red Faction Army, and together perpetrate a slew of terrorist attacks as a way of disrupting the fabric of what they see as an increasingly fascist state.",
                "popularity": 2.0897,
                "poster_path": "/AjwdjcVorNKScu682tDATn5duoy.jpg",
                "release_date": "2008-09-25",
                "title": "The Baader Meinhof Complex",
                "video": false,
                "vote_average": 6.976,
                "vote_count": 613,
                "character": "Gudrun Ensslin",
                "credit_id": "52fe446cc3a36847f80951f1",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Йоханна Вокалек"
        ],
        "biography": "Johanna Wokalek (born March 3, 1975) is a German stage and film actress. A student of Klaus Maria Brandauer, she received critical recognition and three newcomer awards for her performance in the play Rose Bernd. Wokalek is best known for her award-winning appearances in the German films Hierankl, Barfuss, and The Baader Meinhof Complex. She received the Bambi award for her portrayal of the Red Army Faction member Gudrun Ensslin in 2008. She played the lead role in the film Pope Joan in 2009.\n\nDescription above from the Wikipedia article Johanna Wokalek, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1975-03-03",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.johanna-wokalek.com",
        "id": 22687,
        "imdb_id": "nm0937557",
        "known_for_department": "Acting",
        "name": "Johanna Wokalek",
        "place_of_birth": "Freiburg im Breisgau, Baden-Württemberg, Germany",
        "popularity": 0.1918,
        "profile_path": "/b0uEVTTHgQnR43x3BeNfOGJ0iKw.jpg"
    }
}