{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/27ZkYMWynuK2qiDP6awc3MsCaOs.jpg",
                "genre_ids": [
                    10749,
                    18
                ],
                "id": 527641,
                "original_language": "en",
                "original_title": "Five Feet Apart",
                "overview": "Seventeen-year-old Stella spends most of her time in the hospital as a cystic fibrosis patient. Her life is full of routines, boundaries and self-control — all of which get put to the test when she meets Will, an impossibly charming teen who has the same illness. There's an instant flirtation, though restrictions dictate that they must maintain a safe distance between them. As their connection intensifies, so does the temptation to throw the rules out the window and embrace that attraction.",
                "popularity": 6.8548,
                "poster_path": "/kreTuJBkUjVWePRfhHZuYfhNE1T.jpg",
                "release_date": "2019-03-14",
                "title": "Five Feet Apart",
                "video": false,
                "vote_average": 8.2,
                "vote_count": 5773,
                "character": "Jason",
                "credit_id": "5c93ece892514173037455e6",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": true,
        "also_known_as": [],
        "biography": "Brett is a 22 year old actor who began his career at the age of three landing ads for Kraft, BGE, Huntington Learning Center, Nickelodeon World Wide  Day of Play, and many other commercials.  As he developed his talents, Brett started working on more serious projects such as a principal reenactment roll on America’s Most Wanted, and Baltimore’s Center Stage production of Caroline or Change, all while attending  primary and middle school.  During his mid teen years, Brett continued his passion of acting  and was extremely active  in high school activities such as participating in student government projects, working as the basketball statistician,  playing  football, soccer, golf  and singing in the Annapolis Area Christian School’s  traveling choir,  all the while studying his acting skills in the evenings and auditioning.  Brett graduated high school and became a student at the prestigious Morehouse College in Atlanta, Ga.  While  deciding to take a break to determine his major, he landed the role of Fleance ( Son of Lord Banquo) in Shakespeare’s Macbeth,  Directed by,  Liesl Tommy at the Shakespeare Theater Company in 2017.  Brett currently juggles his full time status as a communications major  all while landing his first feature Lionsgate film by Justin Baldoni, Five Feet Apart, where he played the role of (Jason).  Brett gives all thanks to God and thanks his church, family and friends for all their support during this journey.",
        "birthday": "1997-05-22",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2270491,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Brett Austin Johnson",
        "place_of_birth": "Bowie - Maryland - USA",
        "popularity": 0.6,
        "profile_path": "/6alxzlqJTZgB1F1fXzAXGMFRuV.jpg"
    }
}