{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/nLFxvLokHe3bQmrmAfljIfax2jQ.jpg",
                "genre_ids": [
                    878,
                    80
                ],
                "id": 185,
                "original_language": "en",
                "original_title": "A Clockwork Orange",
                "overview": "In a near-future Britain, young Alexander DeLarge and his pals get their kicks beating and raping anyone they please. When not destroying the lives of others, Alex swoons to the music of Beethoven. The state, eager to crack down on juvenile crime, gives an incarcerated Alex the option to undergo an invasive procedure that'll rob him of all personal agency. In a time when conscience is a commodity, can Alex change his tune?",
                "popularity": 9.0838,
                "poster_path": "/4sHeTAp65WrSSuc05nRBKddhBxO.jpg",
                "release_date": "1971-12-19",
                "title": "A Clockwork Orange",
                "video": false,
                "vote_average": 8.185,
                "vote_count": 13337,
                "character": "Georgie",
                "credit_id": "52fe4224c3a36847f80071f9",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "James Marcus was a British actor. His first appearance on TV was the BBC show Hello, Good Evening and Welcome (1968). He is best known for his performance as Georgie, one of the droogs in Stanley Kubrick's controversial film A Clockwork Orange (1971) and for playing the lead role of station chief Sidney Tate in the 1986 TV movie and the subsequent first three seasons of ITV drama London's Burning from 1988 to 1990. In 1989, Marcus wrote and directed the movie Tank Malling starring Ray Winstone and Amanda Donohoe. In August 2024, the actors union Equity announced that Marcus had passed away. It later transpired that he had died some four years previously on 4th May, 2020.",
        "birthday": "1942-06-23",
        "deathday": "2020-05-04",
        "gender": 2,
        "homepage": null,
        "id": 2270,
        "imdb_id": "nm0546118",
        "known_for_department": "Acting",
        "name": "James Marcus",
        "place_of_birth": "Romford, Essex, England, UK",
        "popularity": 0.1689,
        "profile_path": "/keW0TRtGZ15oA12jsEYfqeLEq8v.jpg"
    }
}