{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/nLFxvLokHe3bQmrmAfljIfax2jQ.jpg",
                "genre_ids": [
                    878,
                    80
                ],
                "id": 185,
                "original_language": "en",
                "original_title": "A Clockwork Orange",
                "overview": "In a near-future Britain, young Alexander DeLarge and his pals get their kicks beating and raping anyone they please. When not destroying the lives of others, Alex swoons to the music of Beethoven. The state, eager to crack down on juvenile crime, gives an incarcerated Alex the option to undergo an invasive procedure that'll rob him of all personal agency. In a time when conscience is a commodity, can Alex change his tune?",
                "popularity": 9.6432,
                "poster_path": "/4sHeTAp65WrSSuc05nRBKddhBxO.jpg",
                "release_date": "1971-12-19",
                "title": "A Clockwork Orange",
                "video": false,
                "vote_average": 8.185,
                "vote_count": 13337,
                "character": "Pete",
                "credit_id": "630e0c6663536a0077b7fe95",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Michael Tarn (born December 18, 1951) is a British actor. He is best known for playing Pete in Stanley Kubrick's film A Clockwork Orange (1971).\n\nTarn was cast as Pete in A Clockwork Orange and was the only actor in the gang who was a true teenager (16–17 years old) at the time of production, the others being in their mid- to late 20s. Subsequently, he appeared in John Mackenzie's film Made (1972), and had lead roles in It's A Lovely Day Tomorrow, directed by John Goldschmidt, and the name role in Zigger Zagger, directed by Ron Smedley. After guest appearances in a succession of TV series he was cast in Where There's Brass for Yorkshire Television. Unknown to him his then agent had negotiated him out of the series and his career as a film and TV actor was effectively over. He made a few brief appearances over the next 20 years including Crimewatch, The Knock, and the final one in 2000 when he played the part of Vic in Shooters for Coolbean Productions, directed by Colin Teague and written by and starred in by Louis Dempsey and Terence Howard with Emily Watson, Gerard Butler, amongst a host of other well-known British actors. Amongst his theatre credits included spells with both the RSC and National Theatre Companies, with critically acclaimed parts as Rick in \"Sticks and Bones\" with Peter Weller, Rex in \"City Sugar\" by Stephen Poliakoff at the Comedy Theatre with Adam Faith. Jaques in \"Jaques and His Master\" by Milan Kundera, and Sam in \"Crossing Delancey\" by Susan Sandler. His more recent years have been taken up as a freelance director and drama practitioner, and he currently lives in Spain.",
        "birthday": "1951-12-18",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2271,
        "imdb_id": "nm0850533",
        "known_for_department": "Acting",
        "name": "Michael Tarn",
        "place_of_birth": null,
        "popularity": 0.1793,
        "profile_path": "/34dqPwJtsB3CrXShZA8zhm7pq0c.jpg"
    }
}