{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sBOenwOZGRN5nZZGw4TxwtnfrEf.jpg",
                "genre_ids": [
                    28,
                    35,
                    14
                ],
                "id": 899112,
                "original_language": "en",
                "original_title": "Violent Night",
                "overview": "When a team of mercenaries breaks into a wealthy family compound on Christmas Eve, taking everyone inside hostage, the team isn’t prepared for a surprise combatant: Santa Claus is on the grounds, and he’s about to show why this Nick is no saint.",
                "popularity": 4.6421,
                "poster_path": "/e8CpMgdyihz9Td7amQDqubPuzfN.jpg",
                "release_date": "2022-11-30",
                "title": "Violent Night",
                "video": false,
                "vote_average": 7.253,
                "vote_count": 2350,
                "character": "Linda",
                "credit_id": "620b06eda402c10030cf0651",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/b6ZJZHUdMEFECvGiDpJjlfUWela.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 284054,
                "original_language": "en",
                "original_title": "Black Panther",
                "overview": "King T'Challa returns home to the reclusive, technologically advanced African nation of Wakanda to serve as his country's new leader. However, T'Challa soon finds that he is challenged for the throne by factions within his own country as well as without. Using powers reserved to Wakandan kings, T'Challa assumes the Black Panther mantle to join with ex-girlfriend Nakia, the queen-mother, his princess-kid sister, members of the Dora Milaje (the Wakandan 'special forces') and an American secret agent, to prevent Wakanda from being dragged into a world war.",
                "popularity": 10.6294,
                "poster_path": "/uxzzxijgPIY7slzFvMotPv8wjKA.jpg",
                "release_date": "2018-02-13",
                "title": "Black Panther",
                "video": false,
                "vote_average": 7.369,
                "vote_count": 22816,
                "character": "Nigerian Woman #2",
                "credit_id": "62ddd19b58361b004ca56549",
                "order": 42
            },
            {
                "adult": false,
                "backdrop_path": "/yizL4cEKsVvl17Wc1mGEIrQtM2F.jpg",
                "genre_ids": [
                    28,
                    878,
                    12
                ],
                "id": 588228,
                "original_language": "en",
                "original_title": "The Tomorrow War",
                "overview": "The world is stunned when a group of time travelers arrive from the year 2051 to deliver an urgent message: Thirty years in the future, mankind is losing a global war against a deadly alien species. The only hope for survival is for soldiers and civilians from the present to be transported to the future and join the fight. Among those recruited is high school teacher and family man Dan Forester. Determined to save the world for his young daughter, Dan teams up with a brilliant scientist and his estranged father in a desperate quest to rewrite the fate of the planet.",
                "popularity": 14.8499,
                "poster_path": "/34nDCQZwaEvsy4CFO5hkGRFDCVU.jpg",
                "release_date": "2021-09-03",
                "title": "The Tomorrow War",
                "video": false,
                "vote_average": 7.493,
                "vote_count": 3819,
                "character": "Diablo",
                "credit_id": "5dcaf11499259c001587fc96",
                "order": 12
            },
            {
                "adult": false,
                "backdrop_path": "/rStbi6Sm1JWk4S3pCqULUY7GMDB.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 506528,
                "original_language": "en",
                "original_title": "Harriet",
                "overview": "The extraordinary tale of Harriet Tubman's escape from slavery and transformation into one of America's greatest heroes. Her courage, ingenuity and tenacity freed hundreds of slaves and changed the course of history.",
                "popularity": 4.088,
                "poster_path": "/rsUs58bDqpJJxZSOebZOMN9gzw2.jpg",
                "release_date": "2019-11-01",
                "title": "Harriet",
                "video": false,
                "vote_average": 7.305,
                "vote_count": 861,
                "character": "Jane",
                "credit_id": "5e105926663b8700158130e4",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Alexis Louder, born in Detroit, Michigan, is a captivating and versatile actor known for her magnetic presence on both stage and screen. With a passion for storytelling ingrained in her from a young age, Louder pursued her dreams with unwavering determination.\n\nShe honed her craft at the University of Michigan, where she delved into theater and performance, mastering the art of bringing characters to life. Louder's commitment to her artistry shone through in her performances, earning her recognition and acclaim within the industry.\n\nHer breakout role came in the acclaimed television series \"Watchmen,\" where she portrayed the fierce and determined character of Ruth Williams. She recently starred in the feature film \"Cop Shop\" a 70s grindhouse-style action flick with a (hopefully) star-making performance from Alexis.\n\nKnown for her ability to embody diverse roles with grace and conviction, Louder continues to captivate audiences with her compelling performances. Her dedication to her craft and her commitment to telling stories that resonate with authenticity mark her as a rising star in the entertainment industry, leaving an indelible mark on every project she touches.",
        "birthday": "1991-08-24",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 2273501,
        "imdb_id": "nm6951875",
        "known_for_department": "Acting",
        "name": "Alexis Louder",
        "place_of_birth": "Charlotte, North Carolina, USA",
        "popularity": 0.2477,
        "profile_path": "/fCLuN1yyzMYPIuw7WndyYQ02cfv.jpg"
    }
}