{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mFV1JHptSBFX4x1K1Qz4Zqb4MwB.jpg",
                "genre_ids": [
                    35,
                    80
                ],
                "id": 10141,
                "original_language": "en",
                "original_title": "Dirty Rotten Scoundrels",
                "overview": "Con artist Lawrence Jamieson is a longtime resident of a luxurious coastal resort, where he enjoys the lavish fruits of his deceptions -- that is, until a competitor, Freddy Benson, shows up. When the new guy's lowbrow tactics impinge on his own sophisticated work and believing him to be the infamous conman 'The Jackal', Lawrence resolves to get rid of him. Confident of his own duplicitous talents, he challenges Freddy to a winner-takes-all competition: whoever swindles their latest mark, American heiress Janet Colgate, out of $50,000 first can stay, while the other must leave town.",
                "popularity": 2.865,
                "poster_path": "/3176xH21fSetstKpEtAD1giHbyT.jpg",
                "release_date": "1988-12-14",
                "title": "Dirty Rotten Scoundrels",
                "video": false,
                "vote_average": 7.094,
                "vote_count": 935,
                "character": "English Sailor #2",
                "credit_id": "544c52860e0a2608c200106f",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Hepburn Harrison-Graham"
        ],
        "biography": "Hepburn Harrison-Graham worked as a professional actor from 1979 to 1991, appearing in a variety of films and TV programmes, including Dirty Rotten Scoundrels, Cry Freedom, The Firm and EastEnders. His stage work included a season at the Royal Shakespeare Company. In 1992 Hepburn began working for BBC radio sport as a junior broadcaster and progressed into becoming an assistant producer. During the formative years of BBC Radio 5 live Hepburn produced a wide range of sports shows including Hoops, an original programme about English basketball.  Sports America, an insight into American sport, and Sunday Sport.\n\nDuring this period he also devised and produced a number of documentaries, most notably Across the White Line a four part series that charted the history of black footballers in England.\n\nIn 1996 he worked as a  producer at  the Olympic Games in Atlanta  where, among other duties, he produced a critically acclaimed documentary on Martin Luther King. Later that year he became boxing producer, working on many world title fights including Lennox Lewis v Mike Tyson.\n\nHepburn eventually became a programme editor, before being made editor in chief of BBC Radio 5 live Sports Extra. He now works as a freelance tutor in sports media, hoping to inspire the next generation of journalists with the art of radio production.",
        "birthday": "1959-06-30",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 227341,
        "imdb_id": "nm0334073",
        "known_for_department": "Acting",
        "name": "Hepburn Graham",
        "place_of_birth": "Oxford, Oxfordshire, England, UK",
        "popularity": 0.0882,
        "profile_path": "/1l2sgr8CEZcpqmSQxCYrFKGyB3R.jpg"
    }
}