{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/leHpAsKAJGnNuv5EPAUZUbqrRxq.jpg",
                "genre_ids": [
                    28,
                    12,
                    80,
                    53
                ],
                "id": 10975,
                "original_language": "cn",
                "original_title": "飛鷹計劃",
                "overview": "Hired by a Spanish baron, Hong Kong treasure hunter Jackie, a.k.a. \"Asian Hawk\" and his entourage seek WWII Nazi gold buried in the Sahara Desert.",
                "popularity": 6.3893,
                "poster_path": "/vkj5JxVgY1ZYhX4pBHHgwdRNEkl.jpg",
                "release_date": "1991-02-07",
                "title": "Operation Condor",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 594,
                "character": "Ada",
                "credit_id": "52fe43db9251416c75020d35",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Carol 'Do Do' Cheng",
            "Carol Cheng Yu-Ling",
            "Чэн Юй Лин",
            "Чжэн Юй Лин",
            "Zheng Yu Ling",
            "Кэрол Чэн",
            "Do 姐",
            "کارول چنگ",
            "Carol Cheng",
            "鄭裕玲",
            "郑裕玲"
        ],
        "biography": "Carol Cheng Yu-Ling (Chinese: 鄭裕玲) is a Hong Kong actress. She began her career in the 1970s working on a number of Television Broadcasts Limited series. She has also hosted the Hong Kong version of the game show The Weakest Link. In 1983, she made her debut along with Chow Yun-fat, with whom she would later become romantically involved. After her film debut her output became so prolific that at one point she was working on nine films simultaneously, leading her to have the nickname \"Nine films Cheng.\" It was also during this very prolific time in her career that she became the highest paid actress in the region, beating out Maggie Cheung, Anita Mui and Michelle Yeoh, who rounded up the top 5. In 2000, after not appearing on screen for 6 years, she returned to television with a critically acclaimed performance in the sitcom, \"War of Genders\". It immediately become the highest rated show for the network, TVB and garnered Cheng a Best Actress trophy at the annual awards. She is the highest-paid female employee of TVB.\n\n... taken from Wikipedia, credits to the original author.",
        "birthday": "1957-09-09",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 227778,
        "imdb_id": "nm0155546",
        "known_for_department": "Acting",
        "name": "Carol Cheng",
        "place_of_birth": "Hong Kong, British Crown Colony [now China]",
        "popularity": 3.3275,
        "profile_path": "/fnbJTW1jf93T8pexvjWNjOxW3gq.jpg"
    }
}