{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4i3Amppd6eW5Qkhjv4gdHk3CCoE.jpg",
                "genre_ids": [
                    36,
                    10402,
                    18
                ],
                "id": 279,
                "original_language": "en",
                "original_title": "Amadeus",
                "overview": "Disciplined Italian composer Antonio Salieri becomes consumed by jealousy and resentment towards the hedonistic and remarkably talented young Salzburger composer Wolfgang Amadeus Mozart.",
                "popularity": 5.9174,
                "poster_path": "/1n5VUlCqgmVax1adxGZm8oCFaKc.jpg",
                "release_date": "1984-09-19",
                "title": "Amadeus",
                "video": false,
                "vote_average": 8.026,
                "vote_count": 4488,
                "character": "Leporello",
                "credit_id": "57d0b46bc3a3684b3e001dbe",
                "order": 77
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Карел Эффа"
        ],
        "biography": "Karel Effa, originally named Karel Effenberger (May 23, 1922 in Prague - June 11, 1993 in Prague), was a Czech actor.\n\nAs a professional soldier during World War II, he served in the Government Army during the Protectorate of Bohemia and Moravia, which was deployed to Italy. Here he later ran to the Czechoslovak troops fighting on the side of the Western Allies. After the war, he remained in the army with the rank of sergeant, playing and singing for two years in the newly formed Army Art Ensemble of Vít Nejedlý. From there he went to the Theater of Satire, from there to the Theater of State Film, from there to the Music Theater in Karlín, from where he briefly jumped to the ABC Theater to return to the Karlín Theater. He has been a member of the Semafor Theater since 1979.\n\nKarel Effa was a very prominent comedian who created 71 smaller and episodic film roles during his life - such as the villain Pancho Kid in the Czech comedy Lemonade Joe or Horse Opera, the black Gustav in Zeman's famous film The Stolen Airship, or the treasure keeper in the fairy tale film Proud princess. Karel Effa worked for many years as a member of the Czechoslovak State Film Ensemble, resp. Film studio in Barrandov, he also performed in the Theater in Fidlovačka, or in the former musical theater in Prague's Nusle, he also worked in the post-war Theater of Satire.\n\nIn addition to performing in theater and film, he has given six thousand touring performances during his lifetime, where he has used his folk humor, playing the guitar and singing tramp songs. He also remained a hiker all his life, he went to Brdy, often to the settlement of Ztracenka.\n\nIn 1964, he became a founding member of the Department of Friends and Supporters of Slavia, which aimed to save and lift football Slavia, which at the time lived in the Second Football League.",
        "birthday": "1922-05-23",
        "deathday": "1993-06-11",
        "gender": 2,
        "homepage": null,
        "id": 227727,
        "imdb_id": "nm0250551",
        "known_for_department": "Acting",
        "name": "Karel Effa",
        "place_of_birth": "Praha, Československo",
        "popularity": 0.1855,
        "profile_path": "/azvg0ZZQ6YjRnw6kq1o3jSX1g6R.jpg"
    }
}