{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/21YsCNMub5455NQCn3jh9SmRFyG.jpg",
                "genre_ids": [
                    12,
                    18
                ],
                "id": 87827,
                "original_language": "en",
                "original_title": "Life of Pi",
                "overview": "The story of an Indian boy named Pi, a zookeeper's son who finds himself in the company of a hyena, zebra, orangutan, and a Bengal tiger after a shipwreck sets them adrift in the Pacific Ocean.",
                "popularity": 5.9366,
                "poster_path": "/iLgRu4hhSr6V1uManX6ukDriiSc.jpg",
                "release_date": "2012-11-20",
                "title": "Life of Pi",
                "video": false,
                "vote_average": 7.407,
                "vote_count": 13407,
                "character": "Santosh Patel",
                "credit_id": "52fe49db9251416c910bb0c5",
                "order": 4
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/21YsCNMub5455NQCn3jh9SmRFyG.jpg",
                "genre_ids": [
                    12,
                    18
                ],
                "id": 87827,
                "original_language": "en",
                "original_title": "Life of Pi",
                "overview": "The story of an Indian boy named Pi, a zookeeper's son who finds himself in the company of a hyena, zebra, orangutan, and a Bengal tiger after a shipwreck sets them adrift in the Pacific Ocean.",
                "popularity": 5.9366,
                "poster_path": "/iLgRu4hhSr6V1uManX6ukDriiSc.jpg",
                "release_date": "2012-11-20",
                "title": "Life of Pi",
                "video": false,
                "vote_average": 7.407,
                "vote_count": 13407,
                "credit_id": "52fe49db9251416c910bb0ed",
                "department": "Crew",
                "job": "Production Office Assistant"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "阿迪爾・胡賽恩"
        ],
        "biography": "Adil Hussain is an Indian actor who has worked in Indian cinema, including art house cinema and mainstream Bollywood, as well as international cinema, in films such as The Reluctant Fundamentalist and Life of Pi (both 2012). He received National Film Awards (Special Jury) at the 2017 National Film Awards for Hotel Salvation and Maj Rati Keteki. He has starred in English, Hindi, Assamese, Bengali, Tamil, Marathi, Malayalam, Norwegian and French films.\n\nBorn in Goalpara, Assam in 1963, where his father was the headmaster of a high secondary school, Hussain was the youngest of seven children.\n\nIn an interview he described his multiethnic background, as his maternal grandfather was Iraqi while his maternal grandmother had Assamese, English and Italian roots.\n\nHussain acted in school plays.\n\nHe left home at age 18 to study philosophy at B. Borooah College, Guwahati, he started acting in college plays and performing as a stand-up comedian.\n\nHe also mimicked popular Bollywood actors in between the performances of a local stand-up comedian group, the Bhaya Mama Group. He worked as a stand-up comedian for six years, joined a mobile theatre and also did some local cinema, before moving to Delhi, where he studied at National School of Drama (1990–1993).\n\nHe also studied at the Drama Studio London on a Charles Wallace India Trust Scholarship.\n\nAfter his return to India in 1994, Hussain joined the mobile 'Hengul Theater' in Assam, where he worked for three years, before moving to Delhi. He started his stage career in Delhi, though he continued training under Khalid Tyabji. After Tyabji he trained with Swapan Bose at Sri Aurobindo Ashram, Puducherry, before starting training with Dilip Shankar in Delhi.\n\nAs an actor, he first received acclaim in Othello: A Play in Black and White (1999), which was awarded the Edinburgh Fringe First, and later Goodbye Desdemona also directed by Roysten Abel. He remained the artistic director and Trainer of the Society for Artists and Performers in Hampi from 2004 to 2007, and a visiting faculty at Royal Conservatory of Performing Arts, The Hague. He is also a visiting faculty at his alma mater, the National School of Drama.\n\nIn 2004, he made his Bengali film debut along with Soha Ali Khan in the period drama Iti Srikanta, where he played the lead role.\n\nOn television, he appeared in the lead role, in the detective series Jasoos Vijay (2002–2003), produced by BBC World Service Trust.\n\nThough he had appeared in a few Assamese films, did a small roles in Vishal Bhardwaj's Kaminey and Sona Jain's For Real, it was his role in Abhishek Chaubey's Ishqiya (2010) that got him attention in Bollywood, though his first major role was in Saif Ali Khan-Kareena Kapoor Khan starrer Agent Vinod released in early 2012. In the same year, he appeared in Italian director Italo Spinelli's Gangor, Mira Nair's The Reluctant Fundamentalist, and Ang Lee's Life of Pi.\n\nHe next appeared alongside Sridevi in the comedy drama English Vinglish (2012), and also received critical acclaim for his role in Lessons in Forgetting at the New Jersey Independent South Asian Cine Fest. After these he acted in Aditya Bhattacharya's Bombay Most Wanted and Partho Sen-Gupta's Sunrise. ...\n\nSource: Article \"Adil Hussain\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1963-10-05",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 227849,
        "imdb_id": "nm1300009",
        "known_for_department": "Acting",
        "name": "Adil Hussain",
        "place_of_birth": "Goalpara, Assam, India",
        "popularity": 1.2947,
        "profile_path": "/eCWVa1pH7mmz0i9Q0l4VEKs7g6m.jpg"
    }
}