{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4zJ9w3lZcZI3mBXcNiq6s8bqpDO.jpg",
                "genre_ids": [
                    18,
                    10749,
                    80
                ],
                "id": 2786,
                "original_language": "fr",
                "original_title": "Pierrot le fou",
                "overview": "Pierrot escapes his boring society and travels from Paris to the Mediterranean Sea with Marianne, a girl chased by hit-men from Algeria. They lead an unorthodox life, always on the run.",
                "popularity": 2.2434,
                "poster_path": "/i124H6iQB4CawrgFW9aZaZs7OBO.jpg",
                "release_date": "1965-11-05",
                "title": "Pierrot le Fou",
                "video": false,
                "vote_average": 7.368,
                "vote_count": 896,
                "character": "Gangster (uncredited)",
                "credit_id": "52fe436dc3a36847f80535a1",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/bodTQ7K68AopK2uQumsrSVT9g4A.jpg",
                "genre_ids": [
                    35,
                    10752
                ],
                "id": 8290,
                "original_language": "fr",
                "original_title": "La Grande Vadrouille",
                "overview": "During World War II, two French civilians and a downed British Bomber Crew set out from Paris to cross the demarcation line between Nazi-occupied Northern France and the South. From there they will be able to escape to England. First, they must avoid German troops – and the consequences of their own blunders.",
                "popularity": 2.3452,
                "poster_path": "/91l4Sf3WJwrb0tSVPsOqnBXG8E6.jpg",
                "release_date": "1966-12-08",
                "title": "Don't Look Now... We're Being Shot At!",
                "video": false,
                "vote_average": 7.934,
                "vote_count": 1402,
                "character": "Otto Weber, elegant SS gruppenführer",
                "credit_id": "52fe449dc3a36847f80a030b",
                "order": 20
            },
            {
                "adult": false,
                "backdrop_path": "/okdg55jhsr9k1F2lxsZoQncrLZL.jpg",
                "genre_ids": [
                    18,
                    10749,
                    10752,
                    36
                ],
                "id": 3175,
                "original_language": "en",
                "original_title": "Barry Lyndon",
                "overview": "An Irish rogue uses his cunning and wit to work his way up the social classes of 18th century England, transforming himself from the humble Redmond Barry into the noble Barry Lyndon.",
                "popularity": 6.1938,
                "poster_path": "/x2JQCgLjieWOwvImeGtLmuNgsrq.jpg",
                "release_date": "1975-12-18",
                "title": "Barry Lyndon",
                "video": false,
                "vote_average": 8.003,
                "vote_count": 2995,
                "character": "Prussian Officer",
                "credit_id": "5ab8def1925141395e02e4e7",
                "order": 29
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Hans Meyer (21 July 1925 – 3 April 2020) was a South African actor born to German parents. In Britain, he was known for his portrayal of Hauptmann Franz Ulmann in the television series Colditz (1972–1974).\n\nMeyer was born in Paulpietersburg, Natal Province, Union of South Africa in July 1925. He worked initially as a model where he posed for book covers until a friend in Germany working for an advertising agency lined up his first work as an actor, a television advert for Puschkin Vodka. The brand became Germany's best selling vodka and Meyer became known as \"Frank S. Thorn\" The Puschkin Man. He was hired by Anatole Litvak as an extra for his film The Night of the Generals.\n\nIn the 1960s, he played supporting roles in numerous French films alongside French cinema stars such as Lino Ventura, Alain Delon and Jean-Paul Belmondo. In 1966, he was engaged for La grande vadrouille, where he embodied an angry SS representative. In 1968 he played in the action thriller The Devil's Garden by Yves Boisset. In 1969, he took on the role of Sheriff Blade in the thriller Les Étrangers, shot in Spain. In 1970 he played in the Western Cannon for Cordoba, in the role of the Swedish major Svedborg, the leader of a private mercenary army. In 1975 he had a small role in Stanley Kubrick's film adaptation of Barry Lyndon.\n\nIn the 1970s, Meyer also worked for television. He played a continuous series role in the British television series Colditz. In 1978, he appeared in the mini-series Holocaust (miniseries) - The History of the Weiss Family; in it, he played the SS official Ernst Kaltenbrunner. In the TV movie The Girlfriend from Childhood (L'amie d'enfance, 1981) from the Commissaire Moulin- series, he played the assassin, whom Yves Rénier and title heroine Claude Jade ultimately put to the test. He then appeared in other television series. He later appeared in Steven Spielberg and George Lucas's The Young Indiana Jones Chronicles as well as the French cult movie Brotherhood of the Wolf.\n\nMeyer died in Neuilly-sur-Seine, France on 3 April 2020 at the age of 94.\n\nSource: Article \"Hans Meyer (actor)\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1925-07-21",
        "deathday": "2020-04-03",
        "gender": 2,
        "homepage": null,
        "id": 22796,
        "imdb_id": "nm0583141",
        "known_for_department": "Acting",
        "name": "Hans Meyer",
        "place_of_birth": "Paulpietersburg KwaZulu/Natal, South Africa",
        "popularity": 0.2608,
        "profile_path": "/lD7vYorodY6dSJ20VxsOSfjt90Y.jpg"
    }
}