{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jLeOzQLZJEpmAMDnfKMmORFGuV.jpg",
                "genre_ids": [
                    9648,
                    27
                ],
                "id": 591275,
                "original_language": "en",
                "original_title": "Fear Street: 1666",
                "overview": "In 1666, a colonial town is gripped by a hysterical witch-hunt that has deadly consequences for centuries to come, and it's up to teenagers in 1994 to finally put an end to their town's curse, before it's too late.",
                "popularity": 6.0954,
                "poster_path": "/rmEPtz3Ufzol2VWUAZYzOFaBio3.jpg",
                "release_date": "2021-07-14",
                "title": "Fear Street: 1666",
                "video": false,
                "vote_average": 7.101,
                "vote_count": 1869,
                "character": "Lizzie / Kate",
                "credit_id": "5ca542ec9251415ed96b7cba",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/oMnJhVFr0xVfxy4HPBt1LDKoFgV.jpg",
                "genre_ids": [
                    27,
                    9648
                ],
                "id": 591274,
                "original_language": "en",
                "original_title": "Fear Street: 1978",
                "overview": "In 1978, two rival groups at Camp Nightwing must band together to solve a terrifying mystery when horrors from their towns' history come alive.",
                "popularity": 8.5384,
                "poster_path": "/5dNTxhoGDTHHGqUTdxcr4H1dqlU.jpg",
                "release_date": "2021-07-08",
                "title": "Fear Street: 1978",
                "video": false,
                "vote_average": 7.187,
                "vote_count": 2081,
                "character": "Kate Schmidt (archive footage)",
                "credit_id": "5ca543040e0a261b8fb4d423",
                "order": 35
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Actress, model, writer and entrepreneur Julia Rehwald was born on November 22, 1995, in California.  Rehwald is of biracial ethnicity; her father is American while her mother is from the Philippines.\n\nWhen she was younger, she attended St. Francis High School. From a young age, she was interested in acting and theater . After graduating from high school, she moved to New York to study acting at the Tisch School of the Arts. Before landing roles in movies, she worked as a waitress in a restaurant.  Rehwlad’s career began as a model in New York and her first commercial was for I.K.E.A. in 2017. She continued auditioning for roles in television and movies. She then landed her debut role as a movie actress in the 2017 short film “Where’s Darren,” directed by Greyson Horst. While she did receive other offers after the movie, her next short film, “Mukbang Masarap,” was only released in 2019. It was after this that Rehwald received her breakout role in the Netflix movie “Fear Street” which was released on the platform in 2020. Her popularity grew after she landed the role of Tashigi from One Piece live action adaptation.",
        "birthday": "1995-11-22",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 2280510,
        "imdb_id": "nm10200499",
        "known_for_department": "Acting",
        "name": "Julia Rehwald",
        "place_of_birth": "Sacramento, California, USA",
        "popularity": 1.4146,
        "profile_path": "/vkWc4jBWywVfni6fw3x8R2iH0gU.jpg"
    }
}