{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lIXNL1uoEyuTLqaTAqtBYoc71WF.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 2196,
                "original_language": "en",
                "original_title": "Death at a Funeral",
                "overview": "A myriad of outrageous calamities befalls an eccentric English clan with more than a few skeletons in its closets when the family's patriarch dies an unexpected death.",
                "popularity": 4.336,
                "poster_path": "/xyTxrJnjbSJQzcbKIP6S1uqLuxy.jpg",
                "release_date": "2007-08-17",
                "title": "Death at a Funeral",
                "video": false,
                "vote_average": 6.902,
                "vote_count": 1822,
                "character": "Howard",
                "credit_id": "52fe4340c3a36847f8045d25",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/sQbpfYoGiEBUnr8tBjHP51heNNT.jpg",
                "genre_ids": [
                    10751,
                    16,
                    35,
                    12
                ],
                "id": 263109,
                "original_language": "en",
                "original_title": "Shaun the Sheep Movie",
                "overview": "When Shaun decides to take the day off and have some fun, he gets a little more action than he bargained for. A mix up with the Farmer, a caravan and a very steep hill lead them all to the Big City and it's up to Shaun and the flock to return everyone safely to the green grass of home.",
                "popularity": 3.1034,
                "poster_path": "/1GMvKNy2Ht5QwI0oV0ycYnxzWdC.jpg",
                "release_date": "2015-02-05",
                "title": "Shaun the Sheep Movie",
                "video": false,
                "vote_average": 6.971,
                "vote_count": 1448,
                "character": "Nuts (voice)",
                "credit_id": "55e416d3c3a368419a003654",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/AgYlP6g4vrNn1sVsAIvflW3TfJU.jpg",
                "genre_ids": [
                    10751,
                    16,
                    12,
                    35,
                    878
                ],
                "id": 422803,
                "original_language": "en",
                "original_title": "A Shaun the Sheep Movie: Farmageddon",
                "overview": "When an alien with amazing powers crash-lands near Mossy Bottom Farm, Shaun the Sheep goes on a mission to shepherd the intergalactic visitor home before a sinister organization can capture her.",
                "popularity": 1.6645,
                "poster_path": "/p08FoXVFgcRm5QZBaGj0VKa2W2Y.jpg",
                "release_date": "2019-09-26",
                "title": "A Shaun the Sheep Movie: Farmageddon",
                "video": false,
                "vote_average": 6.923,
                "vote_count": 558,
                "character": "Nuts (voice)",
                "credit_id": "5d83d56aa284eb0285eb2e3e",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/7WJjFviFBffEJvkAms4uWwbcVUk.jpg",
                "genre_ids": [
                    14,
                    12
                ],
                "id": 451048,
                "original_language": "en",
                "original_title": "Jungle Cruise",
                "overview": "Dr. Lily Houghton enlists the aid of wisecracking skipper Frank Wolff to take her down the Amazon in his dilapidated boat. Together, they search for an ancient tree that holds the power to heal – a discovery that will change the future of medicine.",
                "popularity": 8.2027,
                "poster_path": "/3UPz63cGsAQlYQnkOHfAbUhl1O3.jpg",
                "release_date": "2021-07-28",
                "title": "Jungle Cruise",
                "video": false,
                "vote_average": 7.329,
                "vote_count": 5908,
                "character": "Sir James Hobbs-Coddington",
                "credit_id": "60afa3f18ee49c003fde78f3",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/uKb22E0nlzr914bA9KyA5CVCOlV.jpg",
                "genre_ids": [
                    18,
                    10749,
                    14
                ],
                "id": 402431,
                "original_language": "en",
                "original_title": "Wicked",
                "overview": "In the land of Oz, ostracized and misunderstood green-skinned Elphaba is forced to share a room with the popular aristocrat Glinda at Shiz University, and the two's unlikely friendship is tested as they begin to fulfill their respective destinies as Glinda the Good and the Wicked Witch of the West.",
                "popularity": 16.6828,
                "poster_path": "/xDGbZ0JJ3mYaGKy4Nzd9Kph6M9L.jpg",
                "release_date": "2024-11-20",
                "title": "Wicked",
                "video": false,
                "vote_average": 6.931,
                "vote_count": 2406,
                "character": "Governor Thropp",
                "credit_id": "675aaf9accf4df966822c80b",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Andy Nyman is an English actor and magician.\n\nNyman first came to note with his performance as a hard nosed director in Musical! and then as Keith Whitehead in the cult film of the Martin Amis novel, Dead Babies. He has played lead roles in Jon Avnet's Emmy award winning film Uprising (NBC) as a Polish freedom fighter and in Coney Island Baby as a gay French gun dealer. In 2006, he played Gordon in the cult hit Severance. Most recently he played Patrick, a sleazy reality show producer in Charlie Brooker's E4 horror satire Dead Set, and suffers the most violent death in the series, being decapitated and disembowelled.\n\nNyman currently has four films due for release over the next 18 months: London-based romantic comedy Are You Ready for Love?; a bio-pic of 70s Dutch rock group Herman Brood, Wild Romance; and improvised gangster thriller Played where he stars opposite Vinnie Jones, Val Kilmer and Gabriel Byrne. The film was released by Lionsgate Entertainment in 2007. Nyman appeared as one of the leads in the latest Frank Oz movie, Death at a Funeral. He stars opposite Matthew Macfadyen, Ewen Bremner, and Keeley Hawes. The movie was released by MGM in 2007.\n\nNyman is also a magician and the co-creator and co-writer of the Derren Brown TV shows Derren Brown - Mind Control and Trick of the Mind. He and Brown wrote \"Russian Roulette\", \"Séance\", and \"Messiah\", as well as three series of the \"Trick of the Mind\" series. He also co-wrote and co-directed four of Brown's stage shows, all of which have toured and played the West End. For \"Something Wicked This Way Comes\" they were awarded the 2006 Olivier Award for Best Entertainment. Their fourth show Enigma was also nominated for an Olivier Award.\n\nNyman won the award for best actor at the 2006 Cherbourg-Octeville Festival of Irish & British Film for his role as Colin Frampton in Shut Up and Shoot Me. He was nominated for Lew Grade Award at the 2007 BAFTA Awards for his work on \"Derren Brown: The Heist\". He shared the nomination with fellow collaborators Derren Brown, Simon Mills, and Ben Caron.\n\nIn December 2008 he appeared in BBC Four's supernatural drama series Crooked House.\n\nIn February 2010 he co-wrote (with Jeremy Dyson), directed and starred in the horror play Ghost Stories.\n\nIn April 2011 he starred in a new British sitcom, Campus.",
        "birthday": "1966-04-13",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 22810,
        "imdb_id": "nm0638762",
        "known_for_department": "Acting",
        "name": "Andy Nyman",
        "place_of_birth": "Leicester, Leicestershire, England, UK",
        "popularity": 0.5034,
        "profile_path": "/9bN9RVoPWmsmV3VBI7hp4VKD9Kg.jpg"
    }
}