{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mabuNsGJgRuCTuGqjFkWe1xdu19.jpg",
                "genre_ids": [
                    28,
                    12,
                    16,
                    10751
                ],
                "id": 260513,
                "original_language": "en",
                "original_title": "Incredibles 2",
                "overview": "Elastigirl springs into action to save the day, while Mr. Incredible faces his greatest challenge yet – taking care of the problems of his three children.",
                "popularity": 22.17,
                "poster_path": "/9lFKBtaVIhP7E2Pk0IY1CwTKTMZ.jpg",
                "release_date": "2018-06-14",
                "title": "Incredibles 2",
                "video": false,
                "vote_average": 7.454,
                "vote_count": 13263,
                "character": "Additional Voices (voice)",
                "credit_id": "682f43c26152715384684881",
                "order": 77
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Toya Turner is a Jamaican-American, who grew up in Chicago, Illinois. She is a proud student of the British American Drama Academy (BADA) at Oxford University.\n\nToya has honed her acting skills in Shakespearean classics including Olivia in Twelfth Night, Mercutio in Romeo & Juliet and Alonzo in The Tempest. She also developed a voiceover career with major brands such as McDonalds, Dove, Auto Zone, Walmart and Coca-Cola just to name a few.\n\nToya's first job on camera was working with Rosie O'Donnell & Ruby Dee in Sony Pictures Lifetime Movie America. She continued to build experience by starring in several independent films and then returned to television and showed off her improv skills on NBC's hit show \"Chicago Fire\" & Netflix’s \"Easy\".\n\nSince finishing her program at BADA she has had huge success as a principal in several commercials. One being for McDonald's Super Bowl commercial campaign \"Pay With Lovin'\", where she was also made into a famous meme.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.iamtoya.com/",
        "id": 228364,
        "imdb_id": "nm2623841",
        "known_for_department": "Acting",
        "name": "Toya Turner",
        "place_of_birth": "Chicago, Illinois, USA",
        "popularity": 0.2656,
        "profile_path": "/iY6ZIEoi7awz69CzvkOgN0YB05l.jpg"
    }
}