{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/okAHapFqs7Gx9wI8avrMVXVRUzU.jpg",
                "genre_ids": [
                    18,
                    10752
                ],
                "id": 53457,
                "original_language": "fr",
                "original_title": "Elle s'appelait Sarah",
                "overview": "On the night of 16 July 1942, ten year old Sarah and her parents are being arrested and transported to the Velodrome d'Hiver in Paris where thousands of other jews are being sent to get deported. Sarah however managed to lock her little brother in a closet just before the police entered their apartment. Sixty years later, Julia Jarmond, an American journalist in Paris, gets the assignment to write an article about this raid, a black page in the history of France. She starts digging archives and through Sarah's file discovers a well kept secret about her own in-laws.",
                "popularity": 1.108,
                "poster_path": "/peGUaf6HrX7jSi1HifX64QJb7pm.jpg",
                "release_date": "2010-09-16",
                "title": "Sarah's Key",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 696,
                "character": "Sarah Starzynski, child",
                "credit_id": "52fe4867c3a36847f8165843",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Mélusine Mayance (born 21 March 1999 in Paris) is a French actress.\n\nShe is best known for her role in the 2010 French-Language film \"Sarah's Key\", in which she portrayed the childhood version of the story's main character \"Sarah Starzynski\" (whose life story is uncovered and told by Kristin Scott Thomas's character many decades after the end of the second world war). Known in French as Elle s'appelait Sarah, the historical fiction film is set in 1942 France, in the midst of the second world war. Mélusine's character is a young Jewish child whose family is rounded up and arrested in downtown Paris during the Vel' d'Hiv Roundup before being sent to Auschwitz for extermination. Mayance rose to success while starring in films such as Vive Les Vacances! and Ricky in which she plays the half-sister of an infant boy who grows a pair of wings.",
        "birthday": "1999-03-21",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 228884,
        "imdb_id": "nm3274621",
        "known_for_department": "Acting",
        "name": "Mélusine Mayance",
        "place_of_birth": "Paris, France",
        "popularity": 0.1882,
        "profile_path": "/sKhdwhnfHSXWBLFii89PvPZtIWC.jpg"
    }
}