{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/l1Z9PLy8AXiqlZmFEgiGWeSFdSX.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 777270,
                "original_language": "en",
                "original_title": "Belfast",
                "overview": "Buddy is a young boy on the cusp of adolescence, whose life is filled with familial love, childhood hijinks, and a blossoming romance. Yet, with his beloved hometown caught up in increasing turmoil, his family faces a momentous choice: hope the conflict will pass or leave everything they know behind for a new life.",
                "popularity": 3.2271,
                "poster_path": "/4xs6nHNBjYpRymw8ZQmnVIbJ8Xa.jpg",
                "release_date": "2021-11-12",
                "title": "Belfast",
                "video": false,
                "vote_average": 7.057,
                "vote_count": 1592,
                "character": "Billy Clanton",
                "credit_id": "6135a9eecede690060f973f7",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/jD0mmfqPRpvJUaPdpLl1vMj38CA.jpg",
                "genre_ids": [
                    36,
                    18,
                    10752
                ],
                "id": 284689,
                "original_language": "en",
                "original_title": "Testament of Youth",
                "overview": "Testament of Youth is a powerful story of love, war and remembrance, based on the First World War memoir by Vera Brittain, which has become the classic testimony of that war from a woman’s point of view. A searing journey from youthful hopes and dreams to the edge of despair and back again, it’s a film about young love, the futility of war and how to make sense of the darkest times.",
                "popularity": 5.3153,
                "poster_path": "/a6kFsaDCulCLfYHmKLDKTYaddM4.jpg",
                "release_date": "2015-01-16",
                "title": "Testament of Youth",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 771,
                "character": "Victor Richardson",
                "credit_id": "53dbac16c3a36821c3000ede",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/v8zOcynvSd6IW3FzZrvst2HJ53s.jpg",
                "genre_ids": [
                    80,
                    53
                ],
                "id": 276907,
                "original_language": "en",
                "original_title": "Legend",
                "overview": "Suave, charming and volatile, Reggie Kray and his unstable twin brother Ronnie start to leave their mark on the London underworld in the 1960s. Using violence to get what they want, the siblings orchestrate robberies and murders while running nightclubs and protection rackets. With police Detective Leonard \"Nipper\" Read hot on their heels, the brothers continue their rapid rise to power and achieve tabloid notoriety.",
                "popularity": 8.0515,
                "poster_path": "/4shf5Alq4KWCKqrAAQe0JGJHYp5.jpg",
                "release_date": "2015-09-09",
                "title": "Legend",
                "video": false,
                "vote_average": 7.054,
                "vote_count": 4060,
                "character": "Frank Shea",
                "credit_id": "54cc1b7b92514147550000c2",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "کالین مورگان"
        ],
        "biography": "Colin Morgan is an actor from Northern Ireland. He is known for playing the title character in the BBC fantasy series Merlin (2008–2012), Leo Elster in Humans (2015–2018), and Billy Clanton in Kenneth Branagh's Belfast (2021).\n\nMorgan made his London theatre debut in 2007 as the title character in DBC Pierre's Vernon God Little. He went on to appear in the theatre productions Pedro Almodóvar's Todo sobre mi madre (\"All About My Mother\") in 2007, Thomas Babe's A Prayer for My Daughter in 2008, Pedro Miguel Rozo's Our Private Life in 2011, Step in Time at The Old Vic 24 Hour Musicals Celebrity Gala in 2012, Shakespeare's The Tempest in 2013, and Jez Butterworth's Mojo during 2013 and 2014.\n\nIn July 2008, Screen International named Morgan as a \"Star of Tomorrow\". For his performance in Merlin, Morgan was nominated for Outstanding Actor (Drama) in the Monte Carlo TV Festival Awards in 2009, 2010, and 2011, and Best Actor in Drama Performance: Male in the National Television Awards in 2013.",
        "birthday": "1986-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 228866,
        "imdb_id": "nm2959880",
        "known_for_department": "Acting",
        "name": "Colin Morgan",
        "place_of_birth": "Armagh, Northern Ireland, UK",
        "popularity": 0.9593,
        "profile_path": "/jeSLhhfUIZR3UQGGhtYTk0J2I5.jpg"
    }
}