{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/syapU4X3vYBCdARyAOtz3g90hMt.jpg",
                "genre_ids": [
                    53,
                    18,
                    80
                ],
                "id": 1900,
                "original_language": "en",
                "original_title": "Traffic",
                "overview": "An exploration of the United States of America's war on drugs from multiple perspectives. For the new head of the Office of National Drug Control Policy, the war becomes personal when he discovers his well-educated daughter is abusing cocaine within their comfortable suburban home. In Mexico, a flawed, but noble policeman agrees to testify against a powerful general in league with a cartel, and in San Diego, a drug kingpin's sheltered trophy wife must learn her husband's ruthless business after he is arrested, endangering her luxurious lifestyle.",
                "popularity": 4.9867,
                "poster_path": "/v6YrfR1e2OUAYbXrJ7hv3EiGNcg.jpg",
                "release_date": "2000-12-27",
                "title": "Traffic",
                "video": false,
                "vote_average": 7.081,
                "vote_count": 2261,
                "character": "Reporter (uncredited)",
                "credit_id": "5f8473ffcba36f003535ea56",
                "order": 117
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Sonia Debreczeni is an accomplished performer with additional credits as a newscaster and host, as well as a much sought after voiceover talent. She primarily works in the NYC to Richmond corridor and was honored to have been chosen as a Presidential Inaugural Parade Announcer and as The National Desert Storm and Desert Shield Memorial Groundbreaking Ceremony Host Reporter. As an anchor / reporter, Sonia conducted in-depth interviews with numerous politicians, newsmakers & celebrities. Sonia is the recipient of industry honors and awards for outstanding reporting and innovative journalism. Sonia can be seen in several television shows, commercials, industrials and print ads. Sonia is a first-generation Hungarian who speaks English, Hungarian and some German and Spanish. She is a huge advocate of paying it forward whenever she can.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.soniadebreczeni.com/",
        "id": 2288894,
        "imdb_id": "nm7453146",
        "known_for_department": "Acting",
        "name": "Sonia Debreczeni",
        "place_of_birth": null,
        "popularity": 0.0214,
        "profile_path": "/3ebASCKG7fJzcaXlUXb4s3U7mix.jpg"
    }
}