{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qjhcTGnjxYJqwBGlDzZkYWmne6e.jpg",
                "genre_ids": [
                    10749,
                    35,
                    18
                ],
                "id": 614409,
                "original_language": "en",
                "original_title": "To All the Boys: Always and Forever",
                "overview": "Senior year of high school takes center stage as Lara Jean returns from a family trip to Korea and considers her college plans — with and without Peter.",
                "popularity": 2.9588,
                "poster_path": "/iepqdM52f4w75fNcvgRF5QoIAjm.jpg",
                "release_date": "2021-02-12",
                "title": "To All the Boys: Always and Forever",
                "video": false,
                "vote_average": 7.518,
                "vote_count": 1998,
                "character": "Mollie",
                "credit_id": "60268a014a4bfc0041a73afb",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Molly Grace is an Australian born actress based in Melbourne. She has a contagious energy and a true passion for acting. Molly has fantastic instincts and professionalism that drives her to expand her emotional range and deliver consistent, compelling and truthful performances. Molly has worked with a wide range of people, including a younger version of a tortured cellist played by Allison Williams (Get Out, Girls) in the Richard Shepard (Dom Hemingway, The Matador, Girls) film, THE PERFECTION. THE PERFECTION required Molly to learn to play the Cello, a considerable challenge in 3 weeks, which left her in awe of the professional players. After her time on THE PERFECTION, Molly remarked that \"it was amazing to work with such well-respected artists. There was so much happening, and it was so much fun. At the end of filming I had a super proud moment of, 'Oh my gosh, I just did that!'\". More recently, she worked on TO ALL THE BOYS I'VE LOVED BEFORE 2 & 3 (with Lana Condor & Noah Centineo) and enjoyed the collaboration and camaraderie of the large and diverse cast of young actors. Molly is incredibly dedicated to her craft and continues to train and hone her skills. She can't imagine life without acting.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "https://lmcm.com.au/actors/#/actors/88556",
        "id": 2289068,
        "imdb_id": "nm9678145",
        "known_for_department": "Acting",
        "name": "Molly Grace",
        "place_of_birth": "\tMelbourne, Australia",
        "popularity": 0.1056,
        "profile_path": "/nGYmDMlK2E8mKYx9LRkUAbIEAgh.jpg"
    }
}