{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sRXMmeNHTSWRYdDz3zaHNyyPJ0u.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749
                ],
                "id": 7326,
                "original_language": "en",
                "original_title": "Juno",
                "overview": "Faced with an unplanned pregnancy, sixteen year old high-schooler, Juno MacGuff, makes an unusual decision regarding her unborn child.",
                "popularity": 5.36,
                "poster_path": "/jNIn2tVhpvFD6P9IojldI3mNYcn.jpg",
                "release_date": "2007-12-05",
                "title": "Juno",
                "video": false,
                "vote_average": 7.052,
                "vote_count": 7374,
                "character": "Chemistry Teacher",
                "credit_id": "56ccd345c3a368276b000110",
                "order": 18
            },
            {
                "adult": false,
                "backdrop_path": "/yTweHAwEokqAgZg1Io8e0zCJQvt.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 22947,
                "original_language": "en",
                "original_title": "Up in the Air",
                "overview": "Corporate downsizing expert Ryan Bingham spends his life in planes, airports, and hotels, but just as he’s about to reach a milestone of ten million frequent flyer miles, he meets a woman who causes him to rethink his transient life.",
                "popularity": 3.905,
                "poster_path": "/f4PpmOZHFWSJBTF0kX4cOW5TLiK.jpg",
                "release_date": "2009-12-04",
                "title": "Up in the Air",
                "video": false,
                "vote_average": 6.882,
                "vote_count": 3780,
                "character": "Conference DJ",
                "credit_id": "609b09092afb25007ae72272",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Lucas MacFadden",
            "Lucas Christian McFadden",
            "DJ Cut Chemist"
        ],
        "biography": "Born Lucas Macfadden in Hollywood, CA, Cut Chemist has been recording and performing for nearly 30 years. Known as a turntablist, he started his journey into djing at age 11. By the time he was 14 year old, Cut started recording with his friends (including Chali 2na of Jurassic 5) in an inclosed sun patio that his dad converted into a small make-shift recording studio. By age 21, Cut was a founding member of both the rap group Jurassic 5 and the Grammy award winning Latin funk outfit, Ozomatli. His involvement with both groups helped develop a taste for music and rhythms from around the world while keeping his passion for the hip hop tradition. His mix-tapes and remixes became critically acclaimed. His ‘Chemist’ moniker was fully realized with his instrumental, Lesson 6: The Lecture. In the years following, Cut started a series of mix cds with DJ Shadow using all 45s. Brainfreeze, Product Placement and The Hard Sell, the last of which debuted and headlined at the world famous Hollywood Bowl.\n\nCut’s solo album journey would begin with The Audience is Listening which was released on Warner Bros in 2006. Following his major label stint, he decided to create his own boutique label that would allow him more freedom. Sound Of The Police, Funk Off Mega Mix & his sophomore solo album, Die Cut were his most notable releases. Although these albums may sound very different from one another, they all have a single thing that ties them together - Cut Chemist pushes boundaries on all of them, testing our musical palates while introducing us to obscure musical finds.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.cutchemist.com/",
        "id": 229679,
        "imdb_id": "nm0532188",
        "known_for_department": "Acting",
        "name": "Cut Chemist",
        "place_of_birth": "Hollywood, CA",
        "popularity": 0.0338,
        "profile_path": "/qiJYNV8hJ5IlRJYodwI3r0Y9IQs.jpg"
    }
}