{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2QSZ4CPd8AoljAL76qM30dFft07.jpg",
                "genre_ids": [
                    28,
                    53
                ],
                "id": 545609,
                "original_language": "en",
                "original_title": "Extraction",
                "overview": "A hardened gun-for-hire's latest mission becomes a soul-searching race to survive when he's sent into Bangladesh to rescue a drug lord's kidnapped son.",
                "popularity": 6.9977,
                "poster_path": "/nygOUcBKPHFTbxsYRFZVePqgPK6.jpg",
                "release_date": "2020-04-23",
                "title": "Extraction",
                "video": false,
                "vote_average": 7.309,
                "vote_count": 6332,
                "character": "Ovi Mahajan",
                "credit_id": "5cc576400e0a2633d0ec7b56",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            " Rudraksh Jaiswal"
        ],
        "biography": "Rudhraksh Jaiswal is a young and effervescent boy who kickstarted his career in the year 2013, as he bagged the role of Sahadeva in the magnum opus Mahabharta. At a very young age, his parents recognized and acknowledged his brimming passion for dance and acting. Being a student of Billabong International School, Mumbai, Rudhraksh has always been very hardworking and dedicated towards his profession. He has maintained a clean balance between his studies and his acting commitments. Playing the role of Sahadeva, the youngest among the five Pandavas, his role demanded him to be a guy who was mischievous yet naughty. Besides, doing justice to this role, Rudhraksh was a part of several shows being conducted in the Shiamak Davar Dance Academy. Widening his multi-faceted and prodigious journey, Rudhraksh stepped into the world of films, with films like Noor (2017), The Tenant being added into his kitty. He has worked with several artists and is considered to be a very fine actor.",
        "birthday": "2003-09-19",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2298804,
        "imdb_id": "nm7287299",
        "known_for_department": "Acting",
        "name": "Rudhraksh Jaiswal",
        "place_of_birth": "Mumbai, India",
        "popularity": 0.3631,
        "profile_path": "/nIiqv0pbRwKeG7Ar42UrLgEBuYW.jpg"
    }
}