{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ycNyvi9gk4ZI2NLk4KBbseNZbfN.jpg",
                "genre_ids": [
                    99
                ],
                "id": 58496,
                "original_language": "en",
                "original_title": "Senna",
                "overview": "The remarkable story of Brazilian racing driver Ayrton Senna, charting his physical and spiritual achievements on the track and off, his quest for perfection, and the mythical status he has since attained, is the subject of Senna, a documentary feature that spans the racing legend's years as an F1 driver, from his opening season in 1984 to his untimely death a decade later.",
                "popularity": 2.9837,
                "poster_path": "/nZbLCbRoP6iJq5sr8daHQzjnzFh.jpg",
                "release_date": "2010-10-07",
                "title": "Senna",
                "video": false,
                "vote_average": 8.112,
                "vote_count": 1116,
                "character": "Self",
                "credit_id": "52fe4965c3a36847f8197eab",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Reginaldo Leme, born on July 28, 1945, in Campinas, Brazil, is a renowned Brazilian sports journalist and commentator, particularly celebrated for his extensive coverage of Formula 1. Leme’s career in motorsport journalism began in the 1970s, and he became a central figure in Rede Globo’s Formula 1 team, bringing in-depth analysis, insider knowledge, and captivating commentary to Brazilian fans for over four decades.\n\nKnown for his professionalism and deep understanding of racing, Leme covered the careers of legendary Brazilian drivers such as Emerson Fittipaldi, Nelson Piquet, and Ayrton Senna. His insights and behind-the-scenes access made him one of Brazil’s most respected motorsport journalists. Reginaldo is also the author of several books on Formula 1, sharing stories and insights from the paddock and Brazil’s rich racing history.\n\nIn 2019, he left Globo but continued his work in motorsport journalism, contributing to various platforms. Leme’s legacy is celebrated for bringing Formula 1 closer to Brazilian fans and making a lasting impact on motorsport coverage in Brazil.",
        "birthday": "1945-07-28",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 229846,
        "imdb_id": "nm1464543",
        "known_for_department": "Acting",
        "name": "Reginaldo Leme",
        "place_of_birth": "Campinas, São Paulo, Brasil",
        "popularity": 0.0193,
        "profile_path": "/4J17rfpqY8NASlVvcamB695Z9tU.jpg"
    }
}