{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ycNyvi9gk4ZI2NLk4KBbseNZbfN.jpg",
                "genre_ids": [
                    99
                ],
                "id": 58496,
                "original_language": "en",
                "original_title": "Senna",
                "overview": "The remarkable story of Brazilian racing driver Ayrton Senna, charting his physical and spiritual achievements on the track and off, his quest for perfection, and the mythical status he has since attained, is the subject of Senna, a documentary feature that spans the racing legend's years as an F1 driver, from his opening season in 1984 to his untimely death a decade later.",
                "popularity": 2.9837,
                "poster_path": "/nZbLCbRoP6iJq5sr8daHQzjnzFh.jpg",
                "release_date": "2010-10-07",
                "title": "Senna",
                "video": false,
                "vote_average": 8.112,
                "vote_count": 1116,
                "character": "Self",
                "credit_id": "52fe4965c3a36847f8197eb3",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "John Bisignano is an American sports journalist and television commentator known for his work in Formula 1 and international sports coverage. Born in New York, Bisignano began his career as a journalist covering a range of sports before becoming a familiar face in motorsport broadcasting. He gained international recognition in the 1980s and 1990s as a reporter and pit-lane commentator for ESPN’s Formula 1 coverage, where his in-depth knowledge, engaging style, and close relationships with drivers gave audiences unique insights into the F1 world.\n\nBisignano worked with top networks, including ABC, ESPN, and later with Speed Channel, covering events like the Olympic Games and various motorsport series. His dynamic interviewing style and ability to bring stories from the track to the screen helped popularize Formula 1 in the United States. Beyond broadcasting, Bisignano also authored books and produced content focusing on motorsport and its personalities.\n\nHe remains respected for his contributions to American Formula 1 broadcasting and his role in connecting U.S. audiences with the global racing scene.",
        "birthday": "1946-04-17",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 229851,
        "imdb_id": "nm6037589",
        "known_for_department": "Acting",
        "name": "John Bisignano",
        "place_of_birth": "New York City, New York",
        "popularity": 0.2099,
        "profile_path": "/uTBCQRJxPIZM6RjqfAanKppvFHM.jpg"
    }
}