{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xlIxMddSdqyxfY02CilOK4VKWR8.jpg",
                "genre_ids": [
                    10402,
                    18,
                    36
                ],
                "id": 14410,
                "original_language": "en",
                "original_title": "Notorious",
                "overview": "\"Notorious\" is the story of Christopher Wallace. Through raw talent and sheer determination, Wallace transforms himself from Brooklyn street hustler (once selling crack to pregnant women) to one of the greatest rappers of all time: The Notorious B.I.G. Follow his meteoric rise to fame and his refusal to succumb to expectations - redefining our notion of \"The American Dream.\"",
                "popularity": 2.5081,
                "poster_path": "/62NsZPgueSiE8y7dqtU3FSLFwYw.jpg",
                "release_date": "2009-01-16",
                "title": "Notorious",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 748,
                "character": "Mister Cee",
                "credit_id": "6848513d293e9467949f5552",
                "order": 21
            },
            {
                "adult": false,
                "backdrop_path": "/uov0QRXGEaIsVGis2ttJ1ax32Kc.jpg",
                "genre_ids": [
                    18,
                    10749,
                    14
                ],
                "id": 4688,
                "original_language": "en",
                "original_title": "Across the Universe",
                "overview": "When young dockworker Jude leaves Liverpool to find his estranged father in the United States, he is swept up by the waves of change that are re-shaping the nation. Jude falls in love with Lucy, who joins the growing anti-war movement. As the body count in Vietnam rises, political tensions at home spiral out of control and the star-crossed lovers find themselves in a psychedelic world gone mad.",
                "popularity": 2.069,
                "poster_path": "/447c8Te3DXC46rQvDEixKGO4dS6.jpg",
                "release_date": "2007-09-14",
                "title": "Across the Universe",
                "video": false,
                "vote_average": 7.139,
                "vote_count": 1387,
                "character": "Football Player",
                "credit_id": "6848526424c39ef4e51eb13a",
                "order": 54
            },
            {
                "adult": false,
                "backdrop_path": "/tOkSenL74N23O4S7wjJSUHz7Aeh.jpg",
                "genre_ids": [
                    80,
                    18,
                    53
                ],
                "id": 388,
                "original_language": "en",
                "original_title": "Inside Man",
                "overview": "When an armed, masked gang enter a Manhattan bank, lock the doors and take hostages, the detective assigned to effect their release enters negotiations preoccupied with corruption charges he is facing.",
                "popularity": 8.6347,
                "poster_path": "/ffMUgkDZICNiyaws1Jkv8qG8uFW.jpg",
                "release_date": "2006-03-17",
                "title": "Inside Man",
                "video": false,
                "vote_average": 7.398,
                "vote_count": 6057,
                "character": "ESU Officer",
                "credit_id": "684853394490128c133fcfd4",
                "order": 65
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Billy-D",
            "Edwin Romell Freeman Jr."
        ],
        "biography": "Edwin Freeman was born in Brooklyn, New York and raised in nearby Queens, New York. As a youngster he received numerous awards and commendations for art and had one of his drawings displayed in the Queens Museum of Art in Flushing, Queens, New York. In 1988 Edwin won a citywide art contest for Fire Safety held by the New York Fire Department and was awarded by Mayor Ed Koch on April 13th in a well publicized ceremony. Edwin grew up playing sports and while in Junior High School, had a short stint with the neighborhood youth football team, which was cut short due to an injury. In 1992 Edwin began a rap career under his nickname Billy-D, which was given to him by his friends, because of his smooth laid back demeanor and charming personality. He recorded three independent albums, All About the Money (1999), Take it to the Bank (2001) and Crunk Muzik (2005). In September of 2005 he had a chance to relive his dreams as a football player when he was cast for a role as a football player in Julie Taymor's \"Across the Universe.\"",
        "birthday": "1978-05-07",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2301976,
        "imdb_id": "nm2185570",
        "known_for_department": "Acting",
        "name": "Edwin Freeman",
        "place_of_birth": "Brooklyn, New York, U.S.",
        "popularity": 0.0297,
        "profile_path": null
    }
}