{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/213Gdu9zjGsVeWQl6p5gJrBq8n8.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 74879,
                "original_language": "tr",
                "original_title": "Bir Zamanlar Anadolu'da",
                "overview": "A group of men lead a search for a victim of a murder to whom a suspect named Kenan and his mentally challenged brother confessed. However, the search is proving more difficult than expected as Kenan is fuzzy as to the body's location. As the group continues looking, its members can't help but chat among themselves about everyday life, which ultimately leads to conversations about their deepest existential concerns and secrets.",
                "popularity": 1.5857,
                "poster_path": "/o08n2xyXGTkzKy122TTNat57SHb.jpg",
                "release_date": "2011-09-23",
                "title": "Once Upon a Time in Anatolia",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 503,
                "character": "Şoför Arap Ali",
                "credit_id": "52fe48e3c3a368484e1102e1",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Taylan graduated in theatre from Hacettepe University State Conservatory. He is best known for his role as Iskender in the hit surreal comedy series Leyla ile Mecnun and other films.\n\nBetween 1989 and 1993, he worked at the Diyarbakir State Theatre. In 1993 and 1994, he worked with Roberto Ciulli at the Theatre an Der Ruhr in Germany. Taylan has since worked in many theatrical projects with Yücel Erten. He became General Secretary of the Devlet Tiyatrolari Sanatcilari Dernegi or DETIS (State Theatre Artists' Association) and served in the position until he resigned in 2006. In 2002, he won the Ismet Küntay award for Best Director for the play Misafir Sahneleyisi.\n\n- IMDb Mini Biography By: yusufpiskin",
        "birthday": "1965-09-12",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 230759,
        "imdb_id": "nm1488529",
        "known_for_department": "Acting",
        "name": "Ahmet Mümtaz Taylan",
        "place_of_birth": "Ankara, Türkiye",
        "popularity": 0.5147,
        "profile_path": "/7BcirImyPmuD8PxMVKPx6xefunW.jpg"
    }
}