{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1yWn9A2LN0uRGudIg0bV2Np6T69.jpg",
                "genre_ids": [
                    10752,
                    28,
                    18
                ],
                "id": 9289,
                "original_language": "en",
                "original_title": "The Longest Day",
                "overview": "The retelling of June 6, 1944, from the perspectives of the Germans, US, British, Canadians, and the Free French. Marshall Erwin Rommel, touring the defenses being established as part of the Reich's Atlantic Wall, notes to his officers that when the Allied invasion comes they must be stopped on the beach. \"For the Allies as well as the Germans, it will be the longest day\"",
                "popularity": 3.5233,
                "poster_path": "/5zmvEofdIlgXrQl9A7e5IOzlnFU.jpg",
                "release_date": "1962-09-25",
                "title": "The Longest Day",
                "video": false,
                "vote_average": 7.594,
                "vote_count": 977,
                "character": "U.S. Army Ranger",
                "credit_id": "5e50e91c35811d00175530e1",
                "order": 49
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Thomas Adrian Sands is an American pop music singer and actor. Working in show business as early as 1949, Sands became an overnight sensation and instant teen idol when he appeared on Kraft Television Theater in January 1957 as \"The Singin' Idol\". The song from the show, \"Teen-Age Crush\", reached No. 2 on the Billboard Hot 100 and No. 1 on Cashbox.\n\nSands's initial recordings achieved little in the way of sales but in early 1957 he was given the opportunity to star in an episode of Kraft Television Theatre called \"The Singing Idol\".  On the show, his song presentation of a Joe Allison composition called \"Teen-Age Crush\" went over big with the young audience and, released as a single by Capitol Records, it went to No. 2 on the Billboard Hot 100 record chart and No. 1 on the Cashbox chart. It became a gold record. His track, \"The Old Oaken Bucket\", peaked at No. 25 on the UK Singles Chart in 1960. He released his debut album Steady Date with Tommy Sands. Sands' sudden fame brought an offer to sing at the Academy Awards show. He did another episode of Kraft Television Theatre, \"Flesh and Blood\" playing the son of a gangster. He also made \"The Promse\" for Zane Grey Theatre playing the son of Gary Merrill.\n\nSands' teen idol looks landed him a motion-picture contract with 20th Century Fox to star in a 1958 musical drama called Sing, Boy, Sing, the feature film version of \"The Singin' Idol\". Fox had enjoyed success with films starring other teen idols such as Elvis Presley and Pat Boone but Sing, Boy, Sing was a financial failure. Sands supported Pat Boone in a musical for Fox, Mardi Gras , which was a moderate hit. He also released the albums Sands Storm, This Thing Called Love, and When I'm Thinking of You. His later albums included Sands at the Sands and Dream with Me. From May to November 1960 he served in the US Air Force Reserves.\n\nSands' second lead role in a feature was in the teen comedy Love in a Goldfish Bowl with Fabian Forte, which was not a success. More popular was a fantasy musical he made at Disney, Babes in Toyland, co-starring with Annette Funicello. That year he and Funicello sang the Sherman Brothers' title song from the Walt Disney release of The Parent Trap. Sands had married Nancy Sinatra whose father Frank offered Sands a role in Come Blow Your Horn but he turned it down. Sands studied acting in New York.\n\nSands appeared alongside Fred Astaire in \"Blow High, Blow Clear\" for Alcoa Theatre. Later in 1963, Sands made several appearances on Wagon Train including \"The Davey Baxter Story\", \"The Gus Morgan Story\" (with Peter Falk), and \"The Bob Stuart Story\". Sands guest starred on Kraft Suspense Theatre, Combat!, Valentine's Day), Mr Novak, Branded, and Hawaii Five-O.",
        "birthday": "1937-08-27",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 23086,
        "imdb_id": "nm0762378",
        "known_for_department": "Acting",
        "name": "Tommy Sands",
        "place_of_birth": "Chicago, Illinois, USA",
        "popularity": 0.6997,
        "profile_path": "/2iqhwj7ZBUd9lIw6G8yiijZtfb1.jpg"
    }
}