{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ZtcGMc204JsNqfjS9lU6udRgpo.jpg",
                "genre_ids": [
                    28,
                    18
                ],
                "id": 911430,
                "original_language": "en",
                "original_title": "F1",
                "overview": "Racing legend Sonny Hayes is coaxed out of retirement to lead a struggling Formula 1 team—and mentor a young hotshot driver—while chasing one more chance at glory.",
                "popularity": 171.1139,
                "poster_path": "/9PXZIUsSDh4alB80jheWX4fhZmy.jpg",
                "release_date": "2025-06-25",
                "title": "F1",
                "video": false,
                "vote_average": 7.828,
                "vote_count": 2106,
                "character": "Carlos Sainz",
                "credit_id": "668aa036815b985121182605",
                "order": 67
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Carlos Sainz Vázquez de Castro",
            "Carlos Sainz Jnr",
            "カルロス・サインツ・バスケス・デ・カストロ"
        ],
        "biography": "Carlos Sainz Vázquez de Castro (born 1 September 1994) is a Spanish racing driver in Formula One.  In 2012, Sainz raced in the British and European Formula 3 championships for Carlin. He raced for DAMS in the 2014 Formula Renault 3.5 season, winning the championship before moving to F1 with Toro Rosso. Sainz joined Renault for the 2017 and 2018 seasons, before moving to McLaren for the 2019 season, while at the same time ending his contract with Red Bull Racing. At the 2019 Brazilian Grand Prix Sainz took his maiden Formula One podium finish with third. Sainz moved to Ferrari at the end of the 2020 season. At the 2022 British Grand Prix, Sainz took his maiden Formula One pole position and career win. He achieved his second Formula One win at the 2023 Singapore Grand Prix, after starting on pole position for the fifth time in his career. After missing the 2024 Saudi Arabian Grand Prix due to appendicitis, Sainz scored another Formula One win at the following 2024 Australian Grand Prix starting from second.\n\nBorn in Madrid, he is the son of Carlos Sainz Sr., a double World Rally Champion.\n\nDescription above from the Wikipedia article Carlos Sainz Jr., licensed under CC-BY-SA",
        "birthday": "1994-09-01",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.carlossainz.es/en/",
        "id": 2309871,
        "imdb_id": "nm4419678",
        "known_for_department": "Acting",
        "name": "Carlos Sainz Jr.",
        "place_of_birth": "Madrid, Spain",
        "popularity": 0.7138,
        "profile_path": "/xA65q4vYUPEv59m3dD1Vwxiz4SL.jpg"
    }
}