{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5INPBiKVRsyp9kgHfsC0cTfvKFH.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 565310,
                "original_language": "en",
                "original_title": "The Farewell",
                "overview": "A headstrong Chinese-American woman returns to China when her beloved grandmother is given a terminal diagnosis. Billi struggles with her family's decision to keep grandma in the dark about her own illness as they all stage an impromptu wedding to see grandma one last time.",
                "popularity": 5.2017,
                "poster_path": "/7ht2IMGynDSVQGvAXhAb83DLET8.jpg",
                "release_date": "2019-07-12",
                "title": "The Farewell",
                "video": false,
                "vote_average": 7.419,
                "vote_count": 1474,
                "character": "Lu Jian",
                "credit_id": "5cd607aa0e0a262e03cabd2c",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Xiaojie Lin",
            "林晓杰"
        ],
        "biography": "Diana Lin (also called Xiaojie Lin) is a Chinese Australian actress. For her performance in Under the Skin she was nominated for the 1994 AFI Award for Best Actress in a Leading Role in a Television Drama.\n\nLin began her career in China where from 14 years old she started training for the Chinese Beijing Opera Company as a singer before going to Shanghai and taking up acting with the city's Theatre Academy. She started taking on film roles such as Shang Jie with the Pearl River Film Studio in Guangzhou. She migrated to Australia in the early 1990s, basing herself in Sydney. Her first featured role there was in the fifth episode of 1993's anthology TV series Under The Skin. Soon after she moved away from acting due to the lack of good Asian roles. She made her return to acting in The Family Law. She then went on to land a major role in the 2019 American film The Farewell.",
        "birthday": "1962-01-01",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 2309752,
        "imdb_id": "nm1257707",
        "known_for_department": "Acting",
        "name": "Diana Lin",
        "place_of_birth": "Harbin, Heilongjiang Province, China",
        "popularity": 0.1876,
        "profile_path": "/yus3vnVL3y1Pvw3jGpb5vM2IXVl.jpg"
    }
}