{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7TlGXrB4WQ3wbpOCUQnBXseCuOl.jpg",
                "genre_ids": [
                    18,
                    14,
                    10749
                ],
                "id": 144,
                "original_language": "de",
                "original_title": "Der Himmel über Berlin",
                "overview": "Two angels, Damiel and Cassiel, glide through the streets of Berlin, observing the bustling population, providing invisible rays of hope to the distressed but never interacting with them. When Damiel falls in love with lonely trapeze artist Marion, the angel longs to experience life in the physical world, and finds -- with some words of wisdom from actor Peter Falk -- that it might be possible for him to take human form.",
                "popularity": 3.9421,
                "poster_path": "/iZQs2vUeCzvS1KfZJ6uYNCGJBBV.jpg",
                "release_date": "1987-09-23",
                "title": "Wings of Desire",
                "video": false,
                "vote_average": 7.783,
                "vote_count": 1411,
                "character": "Cassiel",
                "credit_id": "52fe421ec3a36847f800546f",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/zGgIlpKE2xP18bhCGsnn79vh80j.jpg",
                "genre_ids": [
                    18,
                    36,
                    10752
                ],
                "id": 387,
                "original_language": "de",
                "original_title": "Das Boot",
                "overview": "A German submarine hunts allied ships during the Second World War, but it soon becomes the hunted. The crew tries to survive below the surface, while stretching both the boat and themselves to their limits.",
                "popularity": 4.05,
                "poster_path": "/u8FhQPncOAkwcei2OI9orPWhV6K.jpg",
                "release_date": "1981-09-17",
                "title": "Das Boot",
                "video": false,
                "vote_average": 8.085,
                "vote_count": 2345,
                "character": "Phillip Thomsen",
                "credit_id": "5308f4e2c3a3684213002a20",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Otto Sander (German: [ˈɔtoː ˈzandɐ]; June 30, 1941 – September 12, 2013) was a German film, theater, and voice actor.\n\nSander grew up in Kassel, where he graduated in 1961 from the Friedrichgymnasium. After leaving school he spent his military service in 1961/62 with the Bundesmarine and left as reserve fenrik. Sander then studied theatre science, history of art and philosophy. In 1965 he made his acting debut at the Düsseldorfer chamber plays. After his first film work in the same year he abandoned his studies in 1967, and went to Munich to become a full-time actor.\n\nHis career is closely connected with the Schaubühne theatre in Berlin under the direction of Peter Stein. From 1980 onwards Sander appeared on several of Berlin's theatre stages, among others at the Schillertheater in 1981, at the Freie Volksbühne in 1985 and in 1989 at the Komödie am Kurfürstendamm. More recently he starred in Hauptmann von Köpenick at the Schauspielhaus Bochum (2004).\n\nIn 1990, he was a member of the Jury at the 40th Berlin International Film Festival.\n\nAmong his best-known film roles are the angel Cassiel in Wings of Desire and its sequel Faraway, So Close! by Wim Wenders, and a shell-shocked U-boat commander, Kapitänleutnant Philipp Thomsen, in Wolfgang Petersen's Das Boot. Sander also appeared in The Tin Drum (1979) as a trumpeter and in Comedian Harmonists, a biopic about the musical group of the same name. He also played a professor in the movie The Promise about the division of Berlin by the wall. In 1999 he played a role in Rosa von Praunheim's movie The Einstein of Sex.",
        "birthday": "1941-06-30",
        "deathday": "2013-09-12",
        "gender": 2,
        "homepage": null,
        "id": 2311,
        "imdb_id": "nm0761420",
        "known_for_department": "Acting",
        "name": "Otto Sander",
        "place_of_birth": "Hanover, Germany",
        "popularity": 0.1634,
        "profile_path": "/bUkS0RolDURiBd2u9OptIHzDK45.jpg"
    }
}