{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7TlGXrB4WQ3wbpOCUQnBXseCuOl.jpg",
                "genre_ids": [
                    18,
                    14,
                    10749
                ],
                "id": 144,
                "original_language": "de",
                "original_title": "Der Himmel über Berlin",
                "overview": "Two angels, Damiel and Cassiel, glide through the streets of Berlin, observing the bustling population, providing invisible rays of hope to the distressed but never interacting with them. When Damiel falls in love with lonely trapeze artist Marion, the angel longs to experience life in the physical world, and finds -- with some words of wisdom from actor Peter Falk -- that it might be possible for him to take human form.",
                "popularity": 3.5495,
                "poster_path": "/iZQs2vUeCzvS1KfZJ6uYNCGJBBV.jpg",
                "release_date": "1987-09-23",
                "title": "Wings of Desire",
                "video": false,
                "vote_average": 7.782,
                "vote_count": 1412,
                "character": "Marion",
                "credit_id": "52fe421ec3a36847f8005473",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Solveig Dommartin (May 16, 1961 in Constantine, Algeria – January 11, 2007 in Paris) was a French-German actress.\n\nHer acting career began in the theatre with \"Compagnie Timothee Laine\" and with the \"Theater Labor Warschau\". She had her first experiences with film as an assistant of Jacques Rozier.\n\nHer debut as a film actress was Wings of Desire (1987) under Wim Wenders. She was able to learn the challenging circus acrobatics in only eight weeks, and performed the full role without using a stunt double. She co-authored Until the End of the World (1991) with Wenders and travelled around the world with him in search of locations for the project.\n\nWim Wenders said about Until the End of the World:\n\n\"Solveig Dommartin and I had written the story of our film together, and we thought that we only had the right to enter into such a sacred area like a persons's dreams, if we would bring something into the work that was sacred to ourselves\".\n\nDommartin died of a heart attack in 2007, aged 45. She was survived by her daughter, Venus.\n\nDescription above from the Wikipedia article Solveig Dommartin, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1961-05-16",
        "deathday": "2007-01-11",
        "gender": 1,
        "homepage": null,
        "id": 2312,
        "imdb_id": "nm0231652",
        "known_for_department": "Acting",
        "name": "Solveig Dommartin",
        "place_of_birth": "Constantine, France [now Algeria]",
        "popularity": 0.1798,
        "profile_path": "/tUMenHJ42z0HNesgn0TFvTWrjpF.jpg"
    }
}