{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7TlGXrB4WQ3wbpOCUQnBXseCuOl.jpg",
                "genre_ids": [
                    18,
                    14,
                    10749
                ],
                "id": 144,
                "original_language": "de",
                "original_title": "Der Himmel über Berlin",
                "overview": "Two angels, Damiel and Cassiel, glide through the streets of Berlin, observing the bustling population, providing invisible rays of hope to the distressed but never interacting with them. When Damiel falls in love with lonely trapeze artist Marion, the angel longs to experience life in the physical world, and finds -- with some words of wisdom from actor Peter Falk -- that it might be possible for him to take human form.",
                "popularity": 3.9421,
                "poster_path": "/iZQs2vUeCzvS1KfZJ6uYNCGJBBV.jpg",
                "release_date": "1987-09-23",
                "title": "Wings of Desire",
                "video": false,
                "vote_average": 7.783,
                "vote_count": 1411,
                "character": "Homer",
                "credit_id": "52fe421ec3a36847f8005477",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/87wqeMeUeMRLjsE1IWNKJcPlpuC.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 289,
                "original_language": "en",
                "original_title": "Casablanca",
                "overview": "In Casablanca, Morocco in December 1941, a cynical American expatriate meets a former lover, with unforeseen complications.",
                "popularity": 5.0551,
                "poster_path": "/oyGRZVIthHJjc98ekKpeWpDh8Ws.jpg",
                "release_date": "1943-01-15",
                "title": "Casablanca",
                "video": false,
                "vote_average": 8.155,
                "vote_count": 5717,
                "character": "Pickpocket",
                "credit_id": "52fe4233c3a36847f800b86f",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Курт Буа"
        ],
        "biography": "From Wikipedia, the free encyclopedia.  Curt Bois (April 5, 1901 – December 25, 1991) was a German actor. He is best remembered for his performance as the Pickpocket in Casablanca (1942).\n\nBois was born in Berlin and began acting in 1907, becoming one of the film world's first child actors, with a role in the silent movie Bauernhaus und Grafenschloß. In 1909, he played the title role in Der Kleine Detektiv ('The Little Detective').\n\nBois' acting career spanned eighty years, a span reached by few other actors. His final performance was in 1987's Der Himmel über Berlin (Wings of Desire). Bois performed in theatre, cabaret, musicals, silent film and \"talkies\" over his career as an actor.\n\nIn 1934, Bois was forced to leave his home for the United States, where he found work on stage on Broadway. By 1937, he had found his way to Hollywood, and began acting in American pictures, the best-known of which was Casablanca (1942), with a single speech warning about pickpockets as \"vultures everywhere\". After World War II Bois decided it was safe to return to Germany, which he did in 1950. He finished his life and career in Germany, first in the East, and finally in the West. Bois died in Berlin, the city of his birth, at the age of ninety.\n\nDescription above from the Wikipedia article Curt Bois, licensed under CC-BY-SA, full list of contributors on Wikipedia.     ",
        "birthday": "1901-04-05",
        "deathday": "1991-12-25",
        "gender": 2,
        "homepage": null,
        "id": 2313,
        "imdb_id": "nm0092290",
        "known_for_department": "Acting",
        "name": "Curt Bois",
        "place_of_birth": "Berlin, Germany",
        "popularity": 0.216,
        "profile_path": "/r7C49zEsGX7uG7SlcRegJlNGUI2.jpg"
    }
}