{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yJIRptBDdt92JS4decYj5HL3Q60.jpg",
                "genre_ids": [
                    53,
                    80,
                    28
                ],
                "id": 197950,
                "original_language": "fr",
                "original_title": "La French",
                "overview": "Newly transferred to the bustling port city of Marseille to assist with a crackdown on organized crime, energetic young magistrate Pierre Michel is given a rapid-fire tutorial on the ins and outs of an out-of-control drug trade. Pierre's wildly ambitious mission is to take on the French Connection, a highly organized operation that controls the city's underground heroin economy and is overseen by the notorious —and reputedly untouchable— Gaetan Zampa. Fearless, determined and willing to go the distance, Pierre plunges into an underworld world of insane danger and ruthless criminals.",
                "popularity": 2.3242,
                "poster_path": "/kIkmaZATFP4RkQSiWgyL6KGOTq6.jpg",
                "release_date": "2014-12-03",
                "title": "The Connection",
                "video": false,
                "vote_average": 7.123,
                "vote_count": 901,
                "character": "Dora Meurisse",
                "credit_id": "60d0c9e19e4586007dbdd811",
                "order": 32
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Barbara Cabrita (born 9 May 1982) is a French-Portuguese actress, born in Trappes in the department of Yvelines.\n\nBarbara was born to Portuguese immigrant parents. She began as a model at 16 years old. At 20 years old she plays in the sitcom Le Groupe and she became well known with the television series R.I.S, police scientifique, aired on first French TV channel, TF1.\n\nSource: Article \"Barbara Cabrita\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1982-05-09",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 231427,
        "imdb_id": "nm1044951",
        "known_for_department": "Acting",
        "name": "Barbara Cabrita",
        "place_of_birth": "Trappes, Yvelines, France",
        "popularity": 0.4153,
        "profile_path": "/dGdVF0w0Z8F5afNB9Vqee4f8QHa.jpg"
    }
}