{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cS45swrlrTJijH1RblBLe8LlW2p.jpg",
                "genre_ids": [
                    80,
                    18,
                    53
                ],
                "id": 37094,
                "original_language": "en",
                "original_title": "Falling Down",
                "overview": "An ordinary man frustrated with the various flaws he sees in society begins to psychotically and violently lash out against them.",
                "popularity": 6.4707,
                "poster_path": "/7ujqyF96Zg3rfrsh9M0cEF0Yzqj.jpg",
                "release_date": "1993-02-26",
                "title": "Falling Down",
                "video": false,
                "vote_average": 7.387,
                "vote_count": 3853,
                "character": "Suzie the Stripper",
                "credit_id": "61b28d04c175b20087e60628",
                "order": 47
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Susie Singer Carter is a multi-award-winning writer, director, producer, actor, and Alzheimer’s/caregiver advocate. She wrote, directed, and produced the 2018 Oscar-qualified short, My Mom and the Girl, starring Valerie Harper, using her personal experience to shed a heartfelt, uplifting light on caring for a loved one with Alzheimer’s. She also wrote and produced “Bratz: The Movie” (Lionsgate) and co-produced “Soul Surfer” (Sony). Her acclaimed podcasts include “Love Conquers Alz”—named 2020 Best Podcast by New Media Film Festival and 2024 Best Dementia Podcast by Goodpods—and the horror/comedy, “I Love Lucifer”, nominated for Best Audio Fiction by the Indie Series Awards. Her latest screenplay, “RUN”, is in pre-production with Phiphen Pictures. Most recently, Susie wrote, directed, and produced “No Country for Old People, a Nursing Home Exposé”. After her mother suffered and died from neglect and abuse in a 5-star facility, she felt morally compelled to expose a broken system through a cautionary tale meant to spark reform. The film received the 2024 Gold Anthem Award for Awareness. A passionate advocate, Susie emceed the San Fernando Valley Walk to End Alzheimer’s and proudly carried a purple flower for her late mother. She also hosts the WGAW’s 3rd & Fairfax Podcast.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 231661,
        "imdb_id": "nm0802053",
        "known_for_department": "Acting",
        "name": "Susie Singer Carter",
        "place_of_birth": "Los Angeles, California, United States",
        "popularity": 0.0858,
        "profile_path": "/coj9MD1gUgwWIwMz4PCSRaE4pPj.jpg"
    }
}