{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5BxrMNGl3YDiWgHCVJu8iLQoJDM.jpg",
                "genre_ids": [
                    28,
                    12,
                    18
                ],
                "id": 445651,
                "original_language": "en",
                "original_title": "The Darkest Minds",
                "overview": "After a disease kills 98% of America's children, the surviving 2% develop superpowers and are placed in internment camps. A 16-year-old girl escapes her camp and joins a group of other teens on the run from the government.",
                "popularity": 6.3281,
                "poster_path": "/8NdQneXBYVbBKt81bFhXiyThe0h.jpg",
                "release_date": "2018-07-25",
                "title": "The Darkest Minds",
                "video": false,
                "vote_average": 7.031,
                "vote_count": 2875,
                "character": "Slip Kid (uncredited)",
                "credit_id": "5fb19fddc15f89003f855c0f",
                "order": 49
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Katie Hubbard, a performing arts student at the highly competitive School for Creative and Performing Arts (SCAPA), Lexington, KY knew acting was her passion from the age of three years old.\n\nKatie has a decade of training and experience in performing arts with Lexington Children's Theatre, University of Kentucky's Academy of Creative Excellence (ACE) and Stage Right Acting.\n\nKatie loves being on set and has gone on to film roles on major motion pictures to supporting and lead roles in student films, shorts and feature films including the Emmy Award winning THE ADJUSTMENT, International Indie Family Film Award Winner GHOST IN THE FAMILY and CADIA: THE WORLD WITHIN featuring Corbin Bernsen and James Phelps.\n\nShe also was featured in several television series runs, local commercials, has interviewing and broadcast experience and is signed on to many projects throughout 2019. Katie also has a love of fashion and enjoys her time as a print and runway model.\n\nKatie's awards include Best Child Actress and Fan Favorite Award at the International Christian Film Festival, 2017 for her role in JENKINS' CHOICE.\n\nKatie enjoys her friends, loves the outdoors and all animals.\n\nHer skills include Singing (Alto), Swimming, Horseback Riding, and Improvisation.\n\nOne of Katie's proudest moments was traveling to Los Angeles to compete in an international talent competition - IMTA. She received many awards, one of which was being named a finalist for Pre-Teen Actor of the Year. Katie is represented by CESD, Los Angeles.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "https://resumes.actorsaccess.com/katiehubbard",
        "id": 2316789,
        "imdb_id": "nm8887517",
        "known_for_department": "Acting",
        "name": "Katie Hubbard",
        "place_of_birth": "Kentucky, USA",
        "popularity": 0.0286,
        "profile_path": "/vlfcgE6Z7tVeog0i1fYE7YrfkRU.jpg"
    }
}