{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ft8WRF2xqEwwGWa59naDUybKTAx.jpg",
                "genre_ids": [
                    18,
                    10752,
                    10749
                ],
                "id": 770,
                "original_language": "en",
                "original_title": "Gone with the Wind",
                "overview": "The spoiled daughter of a Georgia plantation owner conducts a tumultuous romance with a cynical profiteer during the American Civil War and Reconstruction Era.",
                "popularity": 7.332,
                "poster_path": "/lNz2Ow0wGCAvzckW7EOjE03KcYv.jpg",
                "release_date": "1939-12-15",
                "title": "Gone with the Wind",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 4191,
                "character": "Minister (uncredited)",
                "credit_id": "555ab7cb925141620e000efb",
                "order": 113
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "William Stack has been often mistaken as British in the scant bio  information available on him - he could imitate many a British accent.  He was actually born in Oregon. But like many Americans who wished to  become serious stage actors and seeing New York as overly competitive,  he went to London as a young man. Not much is known about his career  there, but with many theaters (almost fifty) and companies around, the  opportunities for a talented young man were there. From the craze for  post cards with the subject of photos - and especially those of actors  that ensued between about 1890 and 1914, there exist pictures of  Stack  as Hamlet. So Stack did find initial success, and by 1918 he tried his  hand in the budding British silent film industry with not much initial  interest - just one film that year and another in 1922, then back to the  stage.\n\nBut by 1930 Stack was back in America - and not to  Broadway (perhaps in a touring company, but at least not on record as a  principal), as was a stage actor's usual course. He did end up in early  Hollywood sound pictures - those with marginal sound quality - first  with Fredric March  as the star in Sarah and Son  (1930). With a rich stage actor's voice and accents to apply where  needed - and appreciated as audio technology improved - he appeared in  from four to ramping up to as many as ten pictures per year through the  1930s. Moving into his 50s, bald and dignified, his roles were focused  as featured character pieces - assured doctors, lawyers, judges, nobles,  and several butlers. He was one of the Crawley clan in Becky Sharp  (1935), the first feature-length three-color film. He perhaps gained  press from being in one movie of some scandalous notoriety - Tarzan and His Mate (1934) in which Maureen O'Sullivan  appeared to swim nude (somebody else in a body stocking). Although he  had a few lines as a white hunter, in this and other films (of note,  MGM's first and most famous version of Mutiny on the Bounty, 1935),  Stack was not credited for his always believable characterizations.\n\nThe  year 1936 provided Stack with some his most memorable historical roles.  He played the French general Montcalm of the French and Indian War in  the popular The Last of the Mohicans  (1936) with Randolph Scott. The same year he played a much richer character in the film adaptation of the play Mary of Scotland (1936) directed by John Ford.  Along with an assemblage of some of the best character actors of  Hollywood, Stack played one among a rogues' gallery of self-seeking  Scottish lords who included: Robert Barrat, Gavin Muir (another American who spent time in England and was often thought to be British), and Ian Keith.  Stack is able to be most Shakespearean, vying in Scottish brogue with  his fellow conspirators as the sly Lord Ruthven. Although Stack appeared  in many of the best A pictures of the later 1930s, many did not give  credit for his great acting skills. There were only a few movies into  the 1940s, before he retired - leaving film history all the richer for  his screen presence.",
        "birthday": "1882-03-05",
        "deathday": "1949-01-15",
        "gender": 2,
        "homepage": null,
        "id": 233117,
        "imdb_id": "nm0821054",
        "known_for_department": "Acting",
        "name": "William Stack",
        "place_of_birth": "Baker, Oregon, USA",
        "popularity": 0.078,
        "profile_path": "/dZNE09yARf0PadD4zWwLRO5a6B.jpg"
    }
}