{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zxttikp0SNEtF4vWsg70Vs6McFi.jpg",
                "genre_ids": [
                    10749,
                    878,
                    18
                ],
                "id": 152601,
                "original_language": "en",
                "original_title": "Her",
                "overview": "In the not so distant future, Theodore, a lonely writer, purchases a newly developed operating system designed to meet the user's every need. To Theodore's surprise, a romantic relationship develops between him and his operating system. This unconventional love story blends science fiction and romance in a sweet tale that explores the nature of love and the ways that technology isolates and connects us all.",
                "popularity": 9.802,
                "poster_path": "/eCOtqtfvn7mxGl6nfmq4b1exJRc.jpg",
                "release_date": "2013-12-18",
                "title": "Her",
                "video": false,
                "vote_average": 7.846,
                "vote_count": 14751,
                "character": "Commuter (uncredited)",
                "credit_id": "6290fa9eed2ac216b8e80e87",
                "order": 38
            }
        ],
        "crew": []
    },
    "details": {
        "adult": true,
        "also_known_as": [
            "Alia Janine Dailey-Willis"
        ],
        "biography": "Alia Janine is a New York City comedian, actress, writer, producer,  and podcaster. She was born and raised in Milwaukee, Wisconsin, and has lived all over the U.S. Alia moved to NYC from Los Angeles in 2013 to pursue a career in comedy, she hosts the How to Do Drugs podcast and runs her own production company, Hardcore Comedy Entertainment that produces national comedy and variety shows, including the Hardcore Comedy Show.\r\n\r\nBefore comedy Alia had an eclectic array of professions, including; bar/restaurant manager, data entry, factory worker, armored car driver, private investigator, and for 10 years, Alia was an adult entertainment performer. From feature dancer to adult model and actress, Alia did it all. She worked in pornographic video from 2009 until her retirement from the industry in 2012.\r\n\r\nTo help her comedy career, Alia had taken courses at UCB (Upright Citizen's Brigade), Manhattan Comedy School, and Rick Crom's Comedy School. Since  her switch in careers, Alia has performed at some of the city's best comedy clubs including; The Stand, The Comedy Cellar, Stand Up NY, and  Gotham Comedy Club. She has had the privilege of performing with some of today's hottest comedians like; Dave Attell, Jay Oakerson, Christian  Finnegan, Monroe Martin, Brody Stevens, Yannis Pappas, Jay Pharoah, Brian Redban, Duncan Trussell, and Sam Tripoli.\r\n\r\nAlia has  delighted her fans by appearing on many popular national radio shows  including Sirius XM's Sway in the Morning, The Jason Ellis Show, The Judith Regan Show, Derek and Romaine, The Jay Thomas Show, and \"My Wife Hates Me\" with comedians Rich Vos and Bonnie MacFarlane. Likewise, she  has appeared on many popular podcasts including, The Legion of Skanks, Two White Guys, The Mad Scientist Party Hour and the Ploof is in the Pudding. She has been featured on hip-hop star 50 Cent's website  Thisis50.com, Vice.com, and The Daily Dot. She has also written blogs and appeared on the comedy website LaughSpin.com.\r\n\r\nAlia was nominated by the AVN (Adult Video News) Awards for Mainstream Star of the Year in 2015 for her transition into comedy from the adult industry,  has been named “The Funniest Porn Star on Earth,” by TheHuffingtonPost.com, and has been featured on hip-hop star 50 Cent’s website Thisis50.com, Vice.com, the Village Voice, NY Post, the New York Times, and The Daily Dot. She has also written blogs and appeared on the comedy websites Interrobang and LaughSpin. \r\n\r\nAlia has an A.S. in Criminal Justice and a B.A. in Psychology. She graduated with high honors in 2018 and is inducted into numerous national and international programs honor societies.",
        "birthday": "1978-11-12",
        "deathday": null,
        "gender": 1,
        "homepage": "https://aliajanine.com/",
        "id": 233388,
        "imdb_id": "nm3682950",
        "known_for_department": "Acting",
        "name": "Alia Janine",
        "place_of_birth": "Milwaukee, Wisconsin, USA",
        "popularity": 1.529,
        "profile_path": "/kl2rgTYR0hjjJRXtt056W6Z30mZ.jpg"
    }
}