{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lD8dFIk9wDEvOwZw0RB47e346io.jpg",
                "genre_ids": [
                    10749,
                    18,
                    37
                ],
                "id": 698508,
                "original_language": "en",
                "original_title": "Redeeming Love",
                "overview": "A retelling of the biblical book of Hosea set against the backdrop of the California Gold Rush of 1850.",
                "popularity": 11.7755,
                "poster_path": "/pDc2HxQtC0MlKD4QfRvmKREEyhc.jpg",
                "release_date": "2022-01-21",
                "title": "Redeeming Love",
                "video": false,
                "vote_average": 7.859,
                "vote_count": 651,
                "character": "Michael",
                "credit_id": "5ea9c10f07291c0025ec34c8",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "톰 루이스"
        ],
        "biography": "With undeniable screen presence and an instinct for gripping performances, Tom Lewis is making his mark as one of the most compelling new names in film, television, and theatre.\n\nHailing from Yorkshire, England, Tom trained at the Royal Academy of Dramatic Art (RADA) on a full scholarship. He made his film debut as the lead in Universal Pictures Redeeming Love, a sweeping romance set in the Gold Rush era - a story of fate, resilience, and second chances.\n\nWhilst still a teenager at RADA, Tom landed a role in HBO's hit series Gentleman Jack opposite Suranne Jones. He's since starred in the PBS crime thriller Patience, AMC's supernatural drama A Discovery of Witches and the viral #1 music video Lewis Capaldi: Wish You the Best, which shattered streaming records.\n\nBeyond the screen, Tom brings the same intensity to the stage, leading acclaimed productions for companies like Headlong, Bristol Old Vic, and Hampstead Theatre.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2336109,
        "imdb_id": "nm9348659",
        "known_for_department": "Acting",
        "name": "Tom Lewis",
        "place_of_birth": "Yorkshire, England, UK",
        "popularity": 0.778,
        "profile_path": "/dObnebCSLeQo9cv8GqXqwEjVR1f.jpg"
    }
}