{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rOwEWgbryAxp7D1xpzREqh3EOTX.jpg",
                "genre_ids": [
                    27
                ],
                "id": 259693,
                "original_language": "en",
                "original_title": "The Conjuring 2",
                "overview": "Lorraine and Ed Warren travel to north London to help a single mother raising four children alone in a house plagued by malicious spirits.",
                "popularity": 49.0392,
                "poster_path": "/zEqyD0SBt6HL7W9JQoWwtd5Do1T.jpg",
                "release_date": "2016-06-08",
                "title": "The Conjuring 2",
                "video": false,
                "vote_average": 7.295,
                "vote_count": 8827,
                "character": "Mrs. More",
                "credit_id": "66aef528e12b82f4dba0e692",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Kate Cook is a London based actor descended from the famous Beerbohm family who's members include the actor manager Herbert Beerbohm Tree and his half brother Max Beerbohm, caricaturist and writer. She is therefore mostly British with a hint of German and Lithuanian. She grew up in the countryside with her parents and two sisters, where she became a dab hand at horse riding and lawn mowing before moving to London to attend drama school.\n\nAfter her training at Arts Ed and a short spell in the acting profession she stepped aside to bring up her two children before returning via an MA in Text and Performance at Kings College/RADA. Here she discovered a passion for writing, a skill which saw her trawling the London comedy scene as a stand up comic before penning her own one-woman show, Invisible Woman, which she performed to great acclaim at the Edinburgh Festival, Brighton, London and France.\n\nShe then got the role of Mrs More in the cult horror hit Conjuring 2: The Enfield Poltergeist. More recently she has appeared for the BBC in Years and Years, Call the Midwife and Eastenders and can be seen in Seasons 5 and 6 of the Netflix series The Crown in which she plays Susie Orbach, Princess Diana's therapist.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.weaudition.com/katecook",
        "id": 2337318,
        "imdb_id": "nm3473289",
        "known_for_department": "Acting",
        "name": "Kate Cook",
        "place_of_birth": null,
        "popularity": 0.0822,
        "profile_path": "/aRMgwQY4kDPGjShPhnh4cuenpDn.jpg"
    }
}