{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3ejcvnHxMFfCbnFi736cXi1ChH1.jpg",
                "genre_ids": [
                    18
                ],
                "id": 4481,
                "original_language": "fr",
                "original_title": "Manon des sources",
                "overview": "In this, the sequel to Jean de Florette, Manon has grown into a beautiful young shepherdess living in the idyllic Provencal countryside. She plots vengeance on the men who greedily conspired to acquire her father's land years earlier.",
                "popularity": 2.1524,
                "poster_path": "/1qpu6Zc1PSDL3UbDNIZJ6YuhJDW.jpg",
                "release_date": "1986-11-19",
                "title": "Manon of the Spring",
                "video": false,
                "vote_average": 7.582,
                "vote_count": 537,
                "character": "Bernard Olivier, teacher",
                "credit_id": "52fe43c5c3a36847f806e547",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/xS0rl1YrVt51ztzjRf6qoIPZ7TA.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 542178,
                "original_language": "en",
                "original_title": "The French Dispatch",
                "overview": "The staff of an American magazine based in France puts out its last issue, with stories featuring an artist sentenced to life imprisonment, student riots, and a kidnapping resolved by a chef.",
                "popularity": 4.5924,
                "poster_path": "/6JXR3KJH5roiBCjWFt09xfgxHZc.jpg",
                "release_date": "2021-10-21",
                "title": "The French Dispatch",
                "video": false,
                "vote_average": 7.027,
                "vote_count": 2782,
                "character": "Chou-fleur",
                "credit_id": "5e42e2639603310017f176a9",
                "order": 30
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Hippolyte Girardot (born Frédéric Girardot; 10 October 1955) is a French actor, film director and screenwriter.\n\nA loner, Hippolyte Girardot set out to be an illustrator. He dreamt of working as production designer on the film set and tempted his chance at the entrance exam to the Arts Déco. While there, he was offered the project of a series of shorts working with a group of adolescents from the suburbs in a workshop setting. Even if he made his first appearance on the silver screen as the son of actor Claude Rich in \"John's Wife\" by Yannick Bellon, who was a friend of his mother's, he still had no intention of becoming an actor and continued to take on the various jobs proposed.\n\nHippolyte Girardot developed a taste for acting while filming \"The Destiny of Juliette\" (1983) by Aline Issermann, and again with the same director for \"L'Amant magnifique\". He got his first nods from the profession when he was nominated for Most Promising Young Actor in 1985 for \"Le Bon Plaisir\", continuing his career with Godard (\"First Name: Carmen\") and other A film projects, notably in \"Fort Saganne\" and \"Jean de Florette II\" in which he plays a school teacher in love with Emmanuelle Beart. His film acclaim arrived in 1990 with \"A World Without Pity\", a disenchanted observation of society by Eric Rochant; his character Hippo resonated with an entire generation: ironically aimless yet charming.\n\nThe following year, Girardot landed the lead role playing a photographer taken hostage in Lebanon in \"Out of Life\" by Maroun Bagdadi. He incarnated the mysterious seducer (\"After Love\", \"The Scent of Yvonne\"), but more often found himself performing in comedies: completely crazy in \"Barjo\" and unemployed in \"Long Live the Republic\" (1997) by close collaborator, Eric Rochant.\n\nAfter working for the television for a few years, his return to film was acclaimed in \"Rashevski's Tango\" in 2003. Joining the Desplechin film universe, Hippolyte Girardot gave notable performances as a business man in \"Playing 'In the Company of Men'\", a crooked lawyer involved in drugs in \"Kings and Queen\" (2004) and Anne Consigny's husband in \"A Christmas Tale\". Other renowned directors with whom he has collaborated include Pascal Bonitzer and Pascale Ferran (\"Lady Chatterley\"), and in 2006, he juggled a formidable acting career, appearing in no less than six films. After his role as a shaddy doctor in \"Crime Is Our Business\", his roles began to become more and more original: the alter ego of Jerome Clement in \"Later\" by Amos Gitai and Nanni Moretti's partner in \"Quiet Chaos\". He had a spell at co-directing with Nobuhiro Suwa for the film \"Yuki & Nina\", a touchy look at childhood that was presented at the Directors' Fortnight in 2009. Continuing to accept roles in films with a political message, he will appear in \"Les Mains en l'air\", which denounces Italian fascism in the year 2067, and take the lead in the dark comedy \"Dernier étage gauche gauche\" in which he plays a bailiff taken hostage in a housing projects building, both films to be released in 2010.",
        "birthday": "1955-10-10",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 23388,
        "imdb_id": "nm0320762",
        "known_for_department": "Acting",
        "name": "Hippolyte Girardot",
        "place_of_birth": "Boulogne-Billancourt, Hauts-de-Seine, France",
        "popularity": 0.2167,
        "profile_path": "/2n4CBW1GEUTkUnNv2HxPpFMnRNm.jpg"
    }
}