{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/aDKuDfEAYa2VENKd155D4ZoAl7c.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 48034,
                "original_language": "fr",
                "original_title": "Les Petits Mouchoirs",
                "overview": "Despite a traumatic event, a group of friends decide to go ahead with their annual beach vacation. Their relationships, convictions, sense of guilt and friendship are sorely tested. They are finally forced to own up to the little white lies they've been telling each other.",
                "popularity": 1.8541,
                "poster_path": "/djypJtQfUxeEMh6kc0aRzIoN9UR.jpg",
                "release_date": "2010-10-20",
                "title": "Little White Lies",
                "video": false,
                "vote_average": 7.109,
                "vote_count": 1588,
                "character": "La copine lesbienne de Marie",
                "credit_id": "52fe4753c3a36847f812f8bf",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/Ng3bVep7dL8qQiWhWQlSo2OvpZ.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 25205,
                "original_language": "fr",
                "original_title": "Le Concert",
                "overview": "A former world-famous conductor of the Bolshoï orchestra, known as \"The Maëstro\", Andreï Filipov had seen his career publicly broken by Leonid Brezhnev for hiring Jewish musicians and now works cleaning the concert hall where he once directed. One day, he intercepts an official invitation from the prestigious Théâtre du Châtelet. Through a series of mad antics, he reunites his old orchestra, now composed of old alcoholic musicians, and flies to perform in Paris and complete the Tchaikovsky concerto interrupted 30 years earlier. For the concerto, he engages a young violin soloist with whom he has an unexpected connection.",
                "popularity": 2.3958,
                "poster_path": "/nMIDVIq7p2mcvolG93FH4Ku3aYJ.jpg",
                "release_date": "2009-11-04",
                "title": "The Concert",
                "video": false,
                "vote_average": 7.237,
                "vote_count": 514,
                "character": "Secretaire Duplessis",
                "credit_id": "5936931e9251416c0100d0f7",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/7hcoMi2AMRvPC7YnGm41k3Wcgvy.jpg",
                "genre_ids": [
                    18,
                    53,
                    80,
                    9648
                ],
                "id": 10795,
                "original_language": "fr",
                "original_title": "Ne le dis à personne",
                "overview": "A man receives a mysterious email appearing to be from his wife, who was murdered years earlier. As he frantically tries to find out whether she's alive, he finds himself being implicated in her death.",
                "popularity": 4.9671,
                "poster_path": "/fr2wEeO1H8dzx6EDfzYTRBIvZaE.jpg",
                "release_date": "2006-11-01",
                "title": "Tell No One",
                "video": false,
                "vote_average": 7.229,
                "vote_count": 1450,
                "character": "Bruno's friend",
                "credit_id": "593bd85392514105e200c4a1",
                "order": 37
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Sarah Martins",
            "سارا مارتینز"
        ],
        "biography": "Sara Martins (born 19 August 1977) is a Portuguese-French actress. She is known in France for her roles on television and in film and theatre. She also appeared as Detective Sergeant Camille Bordey in the joint British-French crime comedy-drama Death in Paradise, filmed in Guadeloupe, a French overseas department. She left the show halfway through series 4 (January 2015). She later returned to Season 10 E6 to reprise her role temporarily, and again in Series 13 Episode 1, in a video call with Neville.\n\nMartins was born in Faro, in the Portuguese region of Algarve, and is of Cape Verdean descent. She moved to France at the age of three. She studied ballet in her youth and was the first person of African descent to join the Lyon Opera. She learned that she would be unable to advance to the Paris Opera, where the corps was expected to look alike and there were no other black dancers. Instead, she received her Baccalauréat with a theater option. After receiving a DEUG in law, at age 20 she studied at the École de théâtre Les Enfants Terribles in Paris. Then, she completed an acting degree at the French National Academy of Dramatic Arts. She learned English through U2 lyrics as a teenager.\n\nShortly after graduating from high school, Martins was hired by Roger Planchon for a local production of Le Radeau de la Méduse at the Théâtre National Populaire in Villeurbanne. She appeared in a play at the Young Vic in London called Le Costume (The Suit) and in a French-language production of David Mamet’s Race.\n\nMartins' television debut was in 2001, in the French police series Maigret and Police District. She appeared in the series Pigalle, la nuit as Fleur. While filming Death in Paradise, Martins worked on the French TV crime series Détectives in lead role of Nora Abadie.\n\nShe appeared in the film Paris, je t'aime (2006) in the segment Parc Monceau, the 17th arrondissement.\n\nIn April 2011, BBC One announced that Martins would appear in the crime comedy-drama Death in Paradise, co-produced with France Télévisions. The series was Martins' debut in both comedy and on British television. Martins did have experience playing a police officer. Death in Paradise premiered on 25 October 2011. Martins played Camille Bordey, a detective sergeant on the fictional Caribbean island of Saint-Marie. Camille and other local officers help British Detective Inspector Richard Poole (played by Ben Miller in the first two series) solve murders. During a stunt for a first series episode, Martins tore her achilles tendon. She has said that during the production of Death in Paradise she discovered that some of her mannerisms are distinctly French.\n\nThe third series killed off Inspector Poole in the first episode and he was replaced by another British Detective Inspector, Humphrey Goodman (played by Kris Marshall). The fourth episode of the fourth series \"Until Death Do You Part\", was Martins' last; her character was written out as moving to Paris. Of her departure from the show, she is quoted as saying: \"I’ve loved everything about the show. But the only way to grow in life is to take risks, even if it means losing something you love, or leaving a place that’s comfortable\". In 2021, she and Miller returned for a two-part episode. ...\n\nSource: Article \"Sara Martins\" from Wikipedia in English, licensed under CC-BY-SA.",
        "birthday": "1977-08-19",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 23390,
        "imdb_id": "nm0554120",
        "known_for_department": "Acting",
        "name": "Sara Martins",
        "place_of_birth": "Faro, Portugal",
        "popularity": 1.6153,
        "profile_path": "/hvW2YMMkonRk3WBsBBx1pDo7dkY.jpg"
    }
}