{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dPJ6Phs6crwoVXiLHntQk2lHz2T.jpg",
                "genre_ids": [
                    18,
                    28,
                    53,
                    80
                ],
                "id": 21191,
                "original_language": "es",
                "original_title": "Sin nombre",
                "overview": "Sayra, a Honduran teen, hungers for a better life. Her chance for one comes when she is reunited with her long-estranged father, who intends to emigrate to Mexico and then enter the United States. Sayra's life collides with a pair of Mexican gangmembers who have boarded the same American-bound train.",
                "popularity": 4.5028,
                "poster_path": "/dubZwiGWp6TwYNGYtyGEUC7XAin.jpg",
                "release_date": "2009-03-20",
                "title": "Sin Nombre",
                "video": false,
                "vote_average": 7.602,
                "vote_count": 717,
                "character": "El Pícaro",
                "credit_id": "5c6f3ac0c3a3683fb4cba09d",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Harold Torres (Born March 15, 1991 at Mexico City,) is a Mexican actor, known for his performances in the leading roles in the television series Run Coyote Run broadcast on the FX channel and ZeroZeroZero. Harold Torres graduated from a BFA in acting at the Centro Universitario de Teatro (CUT or University Theater Center) at the UNAM (Mexico's National Autonomous University). He has participated in more than 30 feature films amongst them are Norteado, La Cebra, González falsos profetas, Espiral, Los Bañistas and Colosio el Asesinato. For television, he has participated in La ruta blanca for Imagen TV, Niño Santo and Crónica de castas for Canal Once, Texas Rising for the History Channel and Run Coyote Run and Sitiados Mexico for Fox, as well as Ingobernable for Netflix. He has been directed by María Novaro, Everardo Gout, Carlos Bolado and Julián Hernández, Marcel Sisniega, Nicolás Pereda and Rodrigo Plá. He was selected to participate at the Berlinale Talent Campus in 2011 and has been nominated in three occasions for the Ariel award as best actor in Norteado by Rigoberto Perezcano (2010) González falsos Profetas by Cristian Díaz Pardo (2014) and La Carga by Alan Jonsson (2015). In 2009 he was awarded as best actor at the Bratislava Film Festival for Norteado, and at the Morelia International Film Festival for González, falsos profetas for which he also won a Diosa de Plata award in 2015 for best actor.",
        "birthday": "1991-03-15",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 234070,
        "imdb_id": "nm2386306",
        "known_for_department": "Acting",
        "name": "Harold Torres",
        "place_of_birth": "Mexico City, Distrito Federal, Mexico",
        "popularity": 0.3512,
        "profile_path": "/lOAED2Que041vtPP0bKuBYE2xVr.jpg"
    }
}