{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6EO11KoiMMG29ISaQrm2G5DCe1X.jpg",
                "genre_ids": [
                    9648,
                    27,
                    53
                ],
                "id": 838209,
                "original_language": "ko",
                "original_title": "파묘",
                "overview": "After tracing the origin of a disturbing supernatural affliction to a wealthy family's ancestral gravesite, a team of paranormal experts relocates the remains—and soon discovers what happens to those who dare to mess with the wrong grave.",
                "popularity": 9.172,
                "poster_path": "/6dasJ58GGFcC62H9KuukAryltUp.jpg",
                "release_date": "2024-02-22",
                "title": "Exhuma",
                "video": false,
                "vote_average": 7.553,
                "vote_count": 554,
                "character": "Yoon Bong-gil",
                "credit_id": "62f5e797f9183a0091b73189",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "이도현",
            "李到晛",
            "Lim Dong-hyun",
            "임동현",
            "لی دو هیون",
            "لی دوهیون",
            "Ли До Хён",
            "Ли До-хён"
        ],
        "biography": "Lim Dong-hyun, better known as Lee Do-hyun (이도현) is a South Korean actor and model managed by Yuehua Entertainment. He is known for his prominent roles in Sweet Home, Hotel del Luna, and 18 Again.\n\nLee Do-hyun made his acting debut in the 2017 black comedy Prison Playbook, in which he portrayed the young version of Jung Kyung-ho's character.\n\nIn 2018, Lee was cast in the romantic television series Still 17 as a member of the high school's rowing club as well as the second male lead's best friend. For his performance, he was nominated in the \"Character of the Year\" category at the 2018 SBS Drama Awards alongside Ahn Hyo-seop and Jo Hyun-sik. The three actors performed g.o.d's One Candle during the ceremony. The same year, Lee also appeared in Clean with Passion for Now, playing the female lead's younger brother and a promising Taekwondo athlete.\n\nIn 2019, Lee joined the cast of the dark fantasy television series Hotel del Luna which became one of the highest-rated Korean dramas in cable television. He also made a special appearance in tvN's The Great Show. Lee starred in Scouting Report, the fifth drama of KBS Drama Special's tenth season, for which he won the \"Best Actor in a One-Act/Special/Short Drama Award\" at the 33rd KBS Drama Awards.\n\nIn 2020, Lee starred in the romantic comedy 18 Again, based on the American film 17 Again, where he played Zac Efron's counterpart. This was Lee's first lead role in his career, albeit a joint lead role he shared with Yoon Sang-hyun. Later that year, he also starred as Lee Eun-hyuk, the second leading male character in Netflix's Sweet Home, adapted from the webtoon of the same name.",
        "birthday": "1995-04-11",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2341408,
        "imdb_id": "nm9946376",
        "known_for_department": "Acting",
        "name": "Lee Do-hyun",
        "place_of_birth": "Goyang, Gyeonggi, South Korea",
        "popularity": 0.897,
        "profile_path": "/1iDRxID6mHf8rftDG0kLWzfXvQA.jpg"
    }
}