{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/aCNfKTJstRM5LjbLRy2s3cOnNkE.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 167581,
                "original_language": "de",
                "original_title": "Freier Fall",
                "overview": "A promising career with the police, a baby on the way... Marc's life seems to be right on track. Then he meets fellow policeman Kay and during their regular jogs Marc experiences a never-before-felt sense of ease and effortlessness – and what it means to fall in love with another man.",
                "popularity": 3.1227,
                "poster_path": "/77n2MlfdzgIlktWvvVS9Zvdx00q.jpg",
                "release_date": "2013-05-27",
                "title": "Free Fall",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 816,
                "character": "Bettina Bischoff",
                "credit_id": "52fe4cb5c3a36847f823b615",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Katharina Schüttler (born 20 October 1979) is a German television and film actress. Her film debut was in the movie Die Lok in 1992. She is best known internationally for leading roles as Clara Rosenbaum in The Promise (2011) and as Greta Müller in the television drama Generation War (2013).\n\nSchüttler grew up in Cologne. Her father is an actor, director and former theatre director and her mother is a playwright. After high school she studied acting at the Hanover University of Music, Drama and Media from 1999 to 2003.\n\nIn 2002, she played the title role in the German premiere of the play Lolita in a staging of Peter Kestmüller at the Schauspiel Hannover.\n\nKatharina Schüttler preferably plays radical roles in which people are torn in existential situations.\n\nIn 2006, she was awarded by the critics survey of the magazine Theater Today 2006.\n\nSource: Article \"Katharina Schüttler\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1979-10-20",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 2343,
        "imdb_id": "nm0778348",
        "known_for_department": "Acting",
        "name": "Katharina Schüttler",
        "place_of_birth": "Köln, Germany",
        "popularity": 0.3637,
        "profile_path": "/flIGG4GZ1r8IsrpvsuVV0LegK59.jpg"
    }
}