{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/t1AHkwkmNK18mNJTfu3reeIc2fZ.jpg",
                "genre_ids": [
                    18,
                    53,
                    9648
                ],
                "id": 651070,
                "original_language": "en",
                "original_title": "A Fall from Grace",
                "overview": "When a law-abiding woman gets indicted for murdering her husband, her lawyer soon realizes that a larger conspiracy may be at work.",
                "popularity": 5.4372,
                "poster_path": "/h47JJZ015VF4neia33AFwTU37Yb.jpg",
                "release_date": "2020-01-17",
                "title": "A Fall from Grace",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 953,
                "character": "Reporter",
                "credit_id": "5e397f0e0c271000137474c5",
                "order": 26
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Michelle D. Bratcher"
        ],
        "biography": "Michelle Davidson was born in St. Louis, Missouri. She graduated from the University of Missouri School of Journalism. Michelle is known for TV roles in \"House of Cards\" (Netflix) \"Halt and Catch Fire\" (AMC) and \"Boss\" (Starz). Her feature film credits include \"Lucky,\" \"Last Ounce of Courage\" and \"Nailbiter.\"\n\nMichelle co-wrote the thriller \"Arbor Demon\" with director and frequent collaborator Patrick Rea. The creature-feature, starring Fiona Dourif and Jake Busey, premiered at Fright Fest UK in 2016 and screened at New York Horror Film Festival, St. Louis International Film Festival, Fantasporto in Portugal and Belgium Horror Film Festival.\n\nMichelle wrote, directed and produced the Mid-America Emmy Award winning comedic short film \"A Senior Moment,\"also recognized with a Celtx Seed Grant. She is also a regional Emmy award-winning writer/producer for the web series \"Unreal Housewives of Kansas City.\"",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 2345411,
        "imdb_id": "nm2976354",
        "known_for_department": "Acting",
        "name": "Michelle Davidson",
        "place_of_birth": null,
        "popularity": 0.1664,
        "profile_path": "/nm7MYTZ5vP1HhbJG1wpxKYUALXJ.jpg"
    }
}