{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sGuFLx1g3lmNMj7O7CUWdMcziz4.jpg",
                "genre_ids": [
                    18,
                    80,
                    53
                ],
                "id": 575452,
                "original_language": "it",
                "original_title": "Il traditore",
                "overview": "Palermo, Sicily, 1980. Mafia member Tommaso Buscetta decides to move to Brazil with his family fleeing the constant war between the different clans of the criminal organization. But when, after living several misfortunes, he is forced to return to Italy, he makes a bold decision that will change his life and the destiny of Cosa Nostra forever.",
                "popularity": 1.7158,
                "poster_path": "/bjb1zKlyw85hYwDXzz2UM6XqjUU.jpg",
                "release_date": "2019-05-23",
                "title": "The Traitor",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 1382,
                "character": "Cesare",
                "credit_id": "5d7c2cb80745e1000d0546b5",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "PierGiorgio Bellocchio",
            "Piergiorgio Bellocchio"
        ],
        "biography": "The son of director Marco Bellocchio and actress Gisella Burinato, Pier Giorgio Bellocchio made his acting debut at the age of six years, starring alongside their parents in the film Holiday in Vacanze in Val Trebbia and Salto nel vuoto in 1980. Except for the short film directed Elena by his father, Pier Giorgio Bellocchio will return to acting only in 1999 with La Balie. In 2003 he staged the play Traces. \n\nIn addition to starring in the films of his father Mark, Pier Giorgio Bellocchio also collaborated as a producer, taking care of the financial aspects of the films. He also supervised the production of other films such as video clips. As a director, he debuted in 1994 with DeGenerazione, film shot in several coats by numerous Italian directors. Bellocchio specifically directed the segment titled Arrivano i nostri.",
        "birthday": "1974-04-16",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 234821,
        "imdb_id": "nm0069168",
        "known_for_department": "Acting",
        "name": "Pier Giorgio Bellocchio",
        "place_of_birth": "Rome, Italy",
        "popularity": 0.1869,
        "profile_path": "/hZTd1cLRnlB9eibCZTeBq1UvDOQ.jpg"
    }
}