{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8f9dnOtpArDrOMEylpSN9Sc6fuz.jpg",
                "genre_ids": [
                    12,
                    14
                ],
                "id": 674,
                "original_language": "en",
                "original_title": "Harry Potter and the Goblet of Fire",
                "overview": "When Harry Potter's name emerges from the Goblet of Fire, he becomes a competitor in a grueling battle for glory among three wizarding schools—the Triwizard Tournament. But since Harry never submitted his name for the Tournament, who did? Now Harry must confront a deadly dragon, fierce water demons and an enchanted maze only to find himself in the cruel grasp of He Who Must Not Be Named.",
                "popularity": 21.6101,
                "poster_path": "/fECBtHlr0RB3foNHDiCBXeg9Bv9.jpg",
                "release_date": "2005-11-16",
                "title": "Harry Potter and the Goblet of Fire",
                "video": false,
                "vote_average": 7.801,
                "vote_count": 21439,
                "character": "Parvati Patil",
                "credit_id": "52fe4268c3a36847f801c35f",
                "order": 51
            },
            {
                "adult": false,
                "backdrop_path": "/82a7AGF081PzFfoM8GAVGMvZNYK.jpg",
                "genre_ids": [
                    12,
                    14
                ],
                "id": 675,
                "original_language": "en",
                "original_title": "Harry Potter and the Order of the Phoenix",
                "overview": "Returning for his fifth year of study at Hogwarts, Harry is stunned to find that his warnings about the return of Lord Voldemort have been ignored. Left with no choice, Harry takes matters into his own hands, training a small group of students to defend themselves against the dark arts.",
                "popularity": 18.6683,
                "poster_path": "/5aOyriWkPec0zUDxmHFP9qMmBaj.jpg",
                "release_date": "2007-07-08",
                "title": "Harry Potter and the Order of the Phoenix",
                "video": false,
                "vote_average": 7.674,
                "vote_count": 20147,
                "character": "Parvati Patil",
                "credit_id": "52fe4268c3a36847f801c5bf",
                "order": 55
            },
            {
                "adult": false,
                "backdrop_path": "/urDWNffjwmNi5IQaezw9GwqkUXa.jpg",
                "genre_ids": [
                    12,
                    14
                ],
                "id": 767,
                "original_language": "en",
                "original_title": "Harry Potter and the Half-Blood Prince",
                "overview": "As Lord Voldemort tightens his grip on both the Muggle and wizarding worlds, Hogwarts is no longer a safe haven. Harry suspects perils may even lie within the castle, but Dumbledore is more intent upon preparing him for the final battle fast approaching. Together they work to find the key to unlock Voldemorts defenses and to this end, Dumbledore recruits his old friend and colleague Horace Slughorn, whom he believes holds crucial information. Even as the decisive showdown looms, romance blossoms for Harry, Ron, Hermione and their classmates. Love is in the air, but danger lies ahead and Hogwarts may never be the same again.",
                "popularity": 18.4717,
                "poster_path": "/z7uo9zmQdQwU5ZJHFpv2Upl30i1.jpg",
                "release_date": "2009-07-15",
                "title": "Harry Potter and the Half-Blood Prince",
                "video": false,
                "vote_average": 7.683,
                "vote_count": 20121,
                "character": "Parvati Patil",
                "credit_id": "52fe4273c3a36847f801fb69",
                "order": 43
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "​Shefali Chowdhury (born 20 June, 1988) is a Welsh actress originally from Denbigh, Wales. She was brought up in a Muslim family, along with five siblings, of whom she is the youngest. Shefali is of Bengali origin; her parents immigrated to England from Sylhet, Bangladesh in the 1980s, when many Bengalis migrated to the UK. She plays Harry Potter's Yule Ball date, Parvati Patil, in Harry Potter and the Goblet of Fire. Daniel Radcliffe, who plays Harry Potter in the film, spoke at the launch of Goblet of Fire in London and said, \"I had a dance scene with Shefali. She was completely gorgeous.\"  She also appeared in an uncredited role in a Tamil film Kannathil Muthamittal.  Shefali landed the coveted role of Parvati Patil whilst she was still a student in her final year at Waverley School in Birmingham. She did four A Levels, in English Language, Literature, Sociology, and Religious Studies at The Sixth Form College, Solihull. Her studies coincided with shooting of the current instalment of Harry Potter and the Order of the Phoenix, where she reprised her role as Parvati Patil.  Despite Parvati's relatively small role in the book, Chowdhury was able to reprise her role for film adaptation of Harry Potter and the Half-Blood Prince.[1]. She did not, however, appear in either part of the adaptation of Harry Potter and the Deathly Hallows.  She is currently studying Photography in Birmingham, UK.  ((Biography from the Harry Potter Wiki))",
        "birthday": "1988-06-20",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 234925,
        "imdb_id": "nm1715231",
        "known_for_department": "Acting",
        "name": "Shefali Chowdhury",
        "place_of_birth": "Denbigh, Denbighshire, Wales",
        "popularity": 0.086,
        "profile_path": "/tj2UrD1uSdK1P2v0w65Ps5wuACU.jpg"
    }
}