{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/vamhMTvh9m9zFHDoR0v1nRtf6T4.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 429617,
                "original_language": "en",
                "original_title": "Spider-Man: Far From Home",
                "overview": "Peter Parker and his friends go on a summer trip to Europe. However, they will hardly be able to rest - Peter will have to agree to help Nick Fury uncover the mystery of creatures that cause natural disasters and destruction throughout the continent.",
                "popularity": 16.3518,
                "poster_path": "/4q2NNj4S5dG2RLF9CpXsej7yXl.jpg",
                "release_date": "2019-06-28",
                "title": "Spider-Man: Far From Home",
                "video": false,
                "vote_average": 7.402,
                "vote_count": 16338,
                "character": "Sebastian",
                "credit_id": "5d1909908a84d2001bcc625a",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Sebastian Viveros",
            "Sebastián Capitán Viveros",
            "Себастьян Капитан Виверос"
        ],
        "biography": "Sebastián Viveros graduated from Drama Centre London in 2016 with a BA in Acting and is represented by CAM, Sam Boyd. He was born in Mexico and moved around USA with his family and grew up mainly in Geneva, Switzerland where he finished high school and became a Swiss national. He is fluent in Spanish, English and French. He wanted to be an actor since he was 10 years old and every choice in his life is guided towards that dream. He has appeared in Spider-Man 'Far From Home' and played Oscar in the Olivier nominee for best play in 2019 and Evening Standard award winner for best play called 'Sweat' written by Lynn Nottage and directed by Lynette Linton which transferred from the Donmar Warehouse to the Gielgud Theatre West end. He can also be seen in Cobra Cyberwar Season 2, Eternals (Marvel), The 355 and Halo TV Series. He is incredibly dedicated. driven and passionate about his craft and has vowed to himself to help make the world a better place through his art.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2351641,
        "imdb_id": "nm10808756",
        "known_for_department": "Acting",
        "name": "Sebastián Viveros",
        "place_of_birth": "Mexico",
        "popularity": 0.1889,
        "profile_path": "/szDZssPtpGwcWS2WsSIDvCNngnO.jpg"
    }
}