{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/eBmIaAm1CkBuuyIUQYorhQKzTTg.jpg",
                "genre_ids": [
                    80,
                    18,
                    9648
                ],
                "id": 3580,
                "original_language": "en",
                "original_title": "Changeling",
                "overview": "Los Angeles, 1928. When single mother Christine Collins leaves for work, her son vanishes without a trace. Five months later, the police reunite mother and son. But when Christine suspects that the boy returned to her isn't her child, her quest for truth exposes a world of corruption.",
                "popularity": 4.1584,
                "poster_path": "/y9Qi39dL3PceGCH8afyC7QrhbhI.jpg",
                "release_date": "2008-10-24",
                "title": "Changeling",
                "video": false,
                "vote_average": 7.584,
                "vote_count": 4314,
                "character": "News Vendor",
                "credit_id": "56cc99e0c3a3683b150001d0",
                "order": 49
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Zachary \"Zach\" Mills (born December 26, 1995) is an American teen actor.\n\nMills has appeared in many film and television productions. These include a brief appearance in the television series Scrubs and guest starring roles in such shows as Malcolm in the Middle, Eleventh Hour, Numb3rs, Ghost Whisperer and October Road. His first significant supporting role in a film was as Adrien Brody's son in the 2006 film, Hollywoodland. In 2007 he appeared in the Hallmark movie The Valley of Light, and that year would also mark his leading role in Mr. Magorium's Wonder Emporium, in which he acted alongside Dustin Hoffman and Natalie Portman. In 2008 he appeared in a leading role in the film Kit Kittredge: An American Girl, and a supporting role as a news vendor in the Clint Eastwood-directed Changeling. Zach is also in Super 8.",
        "birthday": "1995-12-26",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 23533,
        "imdb_id": "nm1517875",
        "known_for_department": "Acting",
        "name": "Zach Mills",
        "place_of_birth": "Lakewood, Ohio, USA",
        "popularity": 0.9171,
        "profile_path": "/rdMYlbLiSdQdpnqqttAk0oIocaE.jpg"
    }
}