{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4cp40IyTpFfsT2IKpl0YlUkMBIR.jpg",
                "genre_ids": [
                    18,
                    35,
                    10749
                ],
                "id": 1064213,
                "original_language": "en",
                "original_title": "Anora",
                "overview": "A young sex worker from Brooklyn gets her chance at a Cinderella story when she meets and impulsively marries the son of an oligarch. Once the news reaches Russia, her fairytale is threatened as his parents set out to get the marriage annulled.",
                "popularity": 19.5237,
                "poster_path": "/cgXk2tNYhJZLXdBDO5DidAVzQ82.jpg",
                "release_date": "2024-10-14",
                "title": "Anora",
                "video": false,
                "vote_average": 7.052,
                "vote_count": 2630,
                "character": "Diamond",
                "credit_id": "65c626642d531a0163c5f98a",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Lindsey Elaine Normington (born 24 July 1996) is an actress, director, writer, and stripper best known for her role as Diamond, the antagonistic coworker of the titular character in Sean Baker's Palme d'Or and Academy Award-winning film Anora (2024). She also organized the first unionized strip club in the United States.\n\nNormington grew up in Rockford, Michigan. At age 7, she saw a high school production of Little Shop of Horrors which inspired her to perform in plays and musicals all throughout her childhood and teenage years. She graduated from Grand Valley State University (GVSU) in 2018, where she played Sally Bowles in a college production of Cabaret.  In 2018, as a senior at GVSU, she created a one-person show called Figurehead that was an official selection at the 2019 United Solo Festival in New York City, where she earned the award of Best Emerging Actress\n\nIn 2023, Normington co-directed the narrative short How To (Without A Doubt) Get Rich And Famous In LA that won the Open Projector Night award from the Grand Rapids Film Society.\n\nNormington has appeared on television as a background dancer in The Idol and Blindspotting, in music videos for Five Finger Death Punch, Ghost, girl in red and She Past Away, as well as a lead actress in several short films. In 2024, she played a supporting role in Anora. In 2025, she had a speaking role in the HBO series Hacks and was added to the cast of Margot's Got Money Troubles.\n\nIn 2023, she played an active role in organizing the only unionized strip club in the United States, the Star Garden in Hollywood.",
        "birthday": "1996-06-24",
        "deathday": null,
        "gender": 1,
        "homepage": "https://lindseynormington.com/",
        "id": 2353434,
        "imdb_id": "nm7919330",
        "known_for_department": "Acting",
        "name": "Lindsey Normington",
        "place_of_birth": "Grand Rapids, Michigan, USA ",
        "popularity": 1.0919,
        "profile_path": "/hgPwq6MBIlSMO4zmx9cLMndSITc.jpg"
    }
}