{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/czfbhgM0cjFqPt4ARofDKgRHCyj.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 5967,
                "original_language": "fr",
                "original_title": "Les Parapluies de Cherbourg",
                "overview": "This simple romantic tragedy begins in 1957. Guy Foucher, a 20-year-old French auto mechanic, has fallen in love with 17-year-old Geneviève Emery, an employee in her widowed mother's chic but financially embattled umbrella shop. On the evening before Guy is to leave for a two-year tour of combat in Algeria, he and Geneviève make love. She becomes pregnant and must choose between waiting for Guy's return or accepting an offer of marriage from a wealthy diamond merchant.",
                "popularity": 2.8325,
                "poster_path": "/tAgTf64XKK5ir7w5C7dnB53jWWG.jpg",
                "release_date": "1964-02-19",
                "title": "The Umbrellas of Cherbourg",
                "video": false,
                "vote_average": 7.406,
                "vote_count": 836,
                "character": "Madame Emery (singing voice)",
                "credit_id": "5e0d5fcd68b1ea00187e1be5",
                "order": 17
            },
            {
                "adult": false,
                "backdrop_path": "/9x3yIrAJOkYSs0SBKcGCQlwPSNm.jpg",
                "genre_ids": [
                    10749,
                    35,
                    18
                ],
                "id": 2433,
                "original_language": "fr",
                "original_title": "Les Demoiselles de Rochefort",
                "overview": "Delphine and Solange are two sisters living in Rochefort. Delphine is a dancing teacher and Solange composes and teaches the piano. Maxence is a poet and a painter. He is doing his military service. Simon owns a music shop, he left Paris one month ago to come back where he fell in love 10 years ago. They are looking for love, looking for each other, without being aware that their ideal partner is very close...",
                "popularity": 1.7891,
                "poster_path": "/jtxhyGaYhurH6KsjvP1jV3dDypz.jpg",
                "release_date": "1967-03-08",
                "title": "The Young Girls of Rochefort",
                "video": false,
                "vote_average": 7.682,
                "vote_count": 631,
                "character": "Judith (singing voice)",
                "credit_id": "5ee443855b4fed00216488ff",
                "order": 49
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Christiane Legrand (21 August 1930 – 1 November 2011) was a French soprano.\n\nLegrand was born in Paris. Her father Raymond Legrand was a conductor and composer renowned for hits such as Irma la douce, and her mother was Marcelle Ter-Mikaëlian (sister of conductor Jacques Hélian), who married Legrand in 1929. Her maternal grandfather was of Armenian descent and considered a member of the bourgeoisie. Legrand studied piano and classical music from the time she was four. Jazz critic and composer André Hodeir discovered her in 1957, and she became the lead singer in the most notable French jazz vocal groups of the 1960s, including Les Double Six.\n\nLegrand was the original lead soprano of The Swingle Singers and was the vocalist who dubbed the part of Madame Emery in Les parapluies de Cherbourg, the music for which was composed by her brother Michel Legrand. She also sang the part of Judith in his Les demoiselles de Rochefort. Her commercial recordings of music for the concert hall included a recording of Laborinthus II of Luciano Berio.\n\nLegrand sang the lead role on the French Disney recording of the score to the film Mary Poppins (1964) and lent her talents to numerous other film projects. Legrand was the featured soprano on the track \"Fires (Which Burn Brightly)\" on the 1973 Procol Harum album Grand Hotel.\n\nHer niece Victoria Legrand is a member of the American indie pop group Beach House. Another niece, Eugénie Angot, is an equestrian.\n\nSource: Article \"Christiane Legrand\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1930-08-21",
        "deathday": "2011-11-01",
        "gender": 1,
        "homepage": null,
        "id": 2358597,
        "imdb_id": "nm0499435",
        "known_for_department": "Sound",
        "name": "Christiane Legrand",
        "place_of_birth": "Aix-les-Bains, Savoie, France",
        "popularity": 0.0621,
        "profile_path": "/hDHwMV66SqDlNcLxkddUvgAUsYp.jpg"
    }
}