{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4avmIRBBOs9b4DKoenf8SWWJJP7.jpg",
                "genre_ids": [
                    53,
                    36,
                    18
                ],
                "id": 726759,
                "original_language": "en",
                "original_title": "Tetris",
                "overview": "In 1988, American video game salesman Henk Rogers discovers the video game Tetris. When he sets out to bring the game to the world, he enters a dangerous web of lies and corruption behind the Iron Curtain.",
                "popularity": 6.2189,
                "poster_path": "/4F2QwCOYHJJjecSvdOjStuVLkpu.jpg",
                "release_date": "2023-03-15",
                "title": "Tetris",
                "video": false,
                "vote_average": 7.659,
                "vote_count": 1528,
                "character": "Belikov",
                "credit_id": "63db4d97a6c10400ab20d637",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Олег Штефанко",
            "Oleg Stefanko",
            "Oleh Stefan",
            "Oleg Stefan"
        ],
        "biography": "After graduating from high school in 1976, he entered the Shchepkin Theatre School in Moscow. As a second-year student, he played two roles on the stage of the Maly Theatre. In 1979, his television and film career began. After graduating from theatre school in 1980, he was accepted into the troupe of the Academic Maly Theatre of the USSR, where he played with such actors as Smoktunovsky, Tsarev, Ilyinsky, Zharov, the Solomin brothers, and Martsevich. He worked on radio, television, and in cinema. He toured many cities in the Soviet Union with his solo concert program. In 1985-1986, he served in the ranks of the USSR Armed Forces in the Moscow region in the engineering troops. On the stage of the Maly Theatre, he played in more than 20 plays. Some of them are: Long Day's Journey into Night, Agony, Cyrano de Bergerac, and The Shore. In early 1992, Stefanko emigrated to the United States. Living in New York, he mastered new professions: waiter, taxi driver, bartender, car dealer; security guard, kickboxer; was engaged in the sale of insurance policies. At the same time, he worked in the modeling business, theater, played on the stage of the \"Theater of New York City\". In New York, Oleg starred in his first American film. In 1994, he moved to Los Angeles, worked in television and film. He was accepted into two American acting guilds: SAG - Screen Actors Guild and AFTRA - American Federation of Television and Radio Artists. In Los Angeles, he continued his education at the \"L.A. Actors Circle Theater School\". Having received American citizenship, he changed his last name to Oleg Stefan. Under this name, he starred in 14 Hollywood films, working with such actors as Robert De Niro, Michael York, Gene Hackman, Sigourney Weaver, Jude Law, James Belushi, Leonardo DiCaprio, Matt Damon, Alec Baldwin, Vincent Perez, Julia Roberts, Clive Owen, Paul Giamatti, Tom Wilkinson, Denis O'Hea and others. He later returned to Russia, where he continued acting. Oleg Stefanko gained wide fame for his role as Leonid Zubov in the TV series \"The Forester\". In total, Stefanko has 76 film and television works, in 54 of which he played the leading roles. Personal life: First wife - Larisa Stefanko, Daughter - Kristina, Son - John (Ivan), born in the late 1990s. It was decided to call him Ivan. But after some time his name was changed to John, as it sounds better to Americans. Second wife - Anna Stefanko.",
        "birthday": "1959-09-07",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.olegstefan.com",
        "id": 235858,
        "imdb_id": "nm0795470",
        "known_for_department": "Acting",
        "name": "Oleg Stefan",
        "place_of_birth": "Stalino, Ukrainian SSR, USSR",
        "popularity": 0.1718,
        "profile_path": "/7wiitTeEVVmyFls0UjiY7lbTrhN.jpg"
    }
}