{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dwVF2gVQLfdbTLlDf2gteqa93gw.jpg",
                "genre_ids": [
                    10751,
                    18,
                    35
                ],
                "id": 340270,
                "original_language": "en",
                "original_title": "The Healer",
                "overview": "The film follows a man with an unwanted gift for healing who meets a teenager with cancer who helps him to find himself.",
                "popularity": 3.2185,
                "poster_path": "/mwBsg7cFE7GwDPKP4Pv26w2Txmp.jpg",
                "release_date": "2017-02-17",
                "title": "The Healer",
                "video": false,
                "vote_average": 7.176,
                "vote_count": 522,
                "character": "Cecilia",
                "credit_id": "555518bbc3a368776f0007a4",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/VmGW4KFH975SicUzF4vwoHhSov.jpg",
                "genre_ids": [
                    16,
                    28,
                    12,
                    14,
                    27,
                    878
                ],
                "id": 408220,
                "original_language": "en",
                "original_title": "Justice League Dark",
                "overview": "When innocent civilians begin committing unthinkable crimes across Metropolis, Gotham City and beyond, Batman must call upon mystical counterparts to eradicate this demonic threat to the planet; enter Justice League Dark. This team of Dark Arts specialists must unravel the mystery of Earth's supernatural plague and contend with the rising, powerful villainous forces behind the siege—before it's too late for all of mankind.",
                "popularity": 2.691,
                "poster_path": "/gWcTaDFXDrOAPfVzfBFz0Aya5BE.jpg",
                "release_date": "2017-01-24",
                "title": "Justice League Dark",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1094,
                "character": "Zatanna (voice)",
                "credit_id": "5797988f9251411b5900025f",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/A95j1q2bYsvRfIdCiTPPvNJVfjI.jpg",
                "genre_ids": [
                    16,
                    28,
                    878,
                    12,
                    14
                ],
                "id": 618344,
                "original_language": "en",
                "original_title": "Justice League Dark: Apokolips War",
                "overview": "Earth is decimated after intergalactic tyrant Darkseid has devastated the Justice League in a poorly executed war by the DC Super Heroes. Now the remaining bastions of good – the Justice League, Teen Titans, Suicide Squad and assorted others – must regroup, strategize and take the war to Darkseid in order to save the planet and its surviving inhabitants.",
                "popularity": 3.4634,
                "poster_path": "/c01Y4suApJ1Wic2xLmaq1QYcfoZ.jpg",
                "release_date": "2020-05-05",
                "title": "Justice League Dark: Apokolips War",
                "video": false,
                "vote_average": 8.2,
                "vote_count": 1510,
                "character": "Zatanna (voice)",
                "credit_id": "5e7cd97e6c74b94e95ca7e75",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "کامیلا لودینگتون"
        ],
        "biography": "Camilla Luddington (born 15 December 1983) is a British actress. Born and raised near London in Berkshire, England, her love of acting began when she started performing for her family and directing her younger brother at age 5. By 11 she had her first agent and appeared in local theatre productions. While continuing with theatre, she studied in the Theatre Arts program at the prestigious Italia Conti Academy in London, before coming to Hollywood in 2007.\n\nCamilla burst into the acting world in the iconic role of Kate Middleton in the Lifetime movie \"William and Kate.\" Airing the week of the Royal Wedding, the ratings were the second highest in Lifetime's history, and the movie proved to be a worldwide success. Luddington portrays another iconic woman, Lara Croft, in the video game \"Tomb Raider,\" produced by Crystal Dynamics. She was praised for giving \"Tomb Raider\" a much needed reboot. Within 48 hours of the game's release in March of 2013, it sold over 1 million copies. Luddington had a major recurring role opposite David Duchovny and Evan Handler on the critically acclaimed Showtime series, \"Californication,\" in 2012, portraying sweet English nanny Lizzie, an aspiring actress who would do whatever it takes to make it in L.A. In 2012 she also recurred on the award-winning HBO series \"True Blood,\" as Claudette, a fairy who helps protects Sookie (Anna Paquin) and educates her on the world of fairies.\n\nLuddington has appeared in various television series, including, \"The Defenders,\" \"CSI: Crime Scene Investigation,\" \"The Forgotten,\" Nickelodeon's \"Big Time Rush\" and \"Days of our Lives.\" She co-wrote, co-directed and appeared in a short comedy \"The Filming of Shakey Willis.\"\n\nLuddington currently resides in Los Angeles.",
        "birthday": "1983-12-15",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 236021,
        "imdb_id": "nm2569832",
        "known_for_department": "Acting",
        "name": "Camilla Luddington",
        "place_of_birth": "Ascot, Berkshire, England, UK",
        "popularity": 0.9374,
        "profile_path": "/yP2DTQNWlFZI7etcbkHCdW6XEPk.jpg"
    }
}