{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sjfbZVKRGh84lNxhqvuhdvovh18.jpg",
                "genre_ids": [
                    35
                ],
                "id": 2292,
                "original_language": "en",
                "original_title": "Clerks",
                "overview": "Convenience and video store clerks Dante and Randal are sharp-witted, potty-mouthed and bored out of their minds. So in between needling customers, the counter jockeys play hockey on the roof, visit a funeral home and deal with their love lives.",
                "popularity": 2.4328,
                "poster_path": "/9IiSgiq4h4siTIS9H3o4nZ3h5L9.jpg",
                "release_date": "1994-10-19",
                "title": "Clerks",
                "video": false,
                "vote_average": 7.385,
                "vote_count": 2612,
                "character": "Dante",
                "credit_id": "52fe434bc3a36847f8049275",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/9qaTlXgurqg85Ya5AW4Ab8RixqD.jpg",
                "genre_ids": [
                    35
                ],
                "id": 2295,
                "original_language": "en",
                "original_title": "Clerks II",
                "overview": "A calamity at Dante and Randall's shops sends them looking for new horizons - but they ultimately settle at Mooby's, a fictional Disney-McDonald's-style fast-food empire.",
                "popularity": 3.817,
                "poster_path": "/cLSW0nW94XT0DmBS69ublcLfQ9c.jpg",
                "release_date": "2006-07-21",
                "title": "Clerks II",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 1404,
                "character": "Dante",
                "credit_id": "52fe434bc3a36847f8049493",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/wXzdoMyLYvz7AoXPGx5STZ1XZDd.jpg",
                "genre_ids": [
                    14,
                    35,
                    12
                ],
                "id": 1832,
                "original_language": "en",
                "original_title": "Dogma",
                "overview": "An abortion clinic worker with a special heritage is called upon to save the existence of humanity from being negated by two renegade angels trying to exploit a loophole and reenter Heaven.",
                "popularity": 4.7678,
                "poster_path": "/xI5beD8Td79E2uZNAxgd1gWWOEd.jpg",
                "release_date": "1999-10-04",
                "title": "Dogma",
                "video": false,
                "vote_average": 6.925,
                "vote_count": 2645,
                "character": "Grant Hicks",
                "credit_id": "52fe4318c3a36847f8039ee3",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "布莱恩·奥哈罗兰",
            "Brian C. O'Halloran",
            "Brian Christopher O'Halloran"
        ],
        "biography": "​From Wikipedia, the free encyclopedia.\n\nBrian Christopher O'Halloran (born December 20, 1969) is an American actor best known for his roles in Kevin Smith's View Askewniverse films, notably as Dante Hicks in Smith's debut film Clerks and its 2006 sequel, Clerks II. Aside from this, he has made small appearances in most of Smith's films, either as his Clerks character Dante Hicks or one of Dante's cousins.\n\nO'Halloran was born in Manhattan, New York City, and lived in Old Bridge Township, New Jersey since the age of 13. A first-generation American, both his parents emigrated from Ireland. His father died when O'Halloran was 15 years old.\n\nO'Halloran is the lead actor in Vulgar (2000), an obscure movie about a small town clown who is traumatized after he is attacked during one of his performances.\n\nHe has worked on theatre productions since high school. He has said on the subject of doing theatre:\n\n“\tOh, yeah. It's the best training you can do, as an actor. To be in front of a live audience. There's no 'Stop, wait, oh geez, what was that line again?' It just sharpens your reflexes. It sharpens your interaction. And it definitely sharpens your memory because you have to know an entire show from beginning to end.\t”\n\nSince Clerks, O'Halloran has primarily been a stage actor, working with the Boomerang Theatre Company, the New Jersey Repertory Company and the Tri-State Actors Theatre, among others. He is currently a resident of Staten Island.\n\nDescription above from the Wikipedia article Brian O'Halloran, licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": "1969-12-20",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 23629,
        "imdb_id": "nm0641168",
        "known_for_department": "Acting",
        "name": "Brian O'Halloran",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.244,
        "profile_path": "/c8bhTxVxhN4DMrJeCnu5usutbY5.jpg"
    }
}