{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xkfXO0Zswvvlbs0FlxH3TA4qji3.jpg",
                "genre_ids": [
                    12,
                    18,
                    37
                ],
                "id": 13041,
                "original_language": "es",
                "original_title": "El Topo",
                "overview": "El Topo decides to confront warrior Masters on a trans-formative desert journey he begins with his 6 year old son, who must bury his childhood totems to become a man.",
                "popularity": 2.4115,
                "poster_path": "/4ea7sUzZaQNRuIm4M6EqWLQWfnX.jpg",
                "release_date": "1970-12-18",
                "title": "El Topo",
                "video": false,
                "vote_average": 7.073,
                "vote_count": 623,
                "character": "The Colonel",
                "credit_id": "52fe45319251416c7504ec17",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/oUceCsSe255ZKXCMsHhqXM1xuUp.jpg",
                "genre_ids": [
                    18
                ],
                "id": 8327,
                "original_language": "es",
                "original_title": "La montaña sagrada",
                "overview": "The Alchemist assembles together a group of people from all walks of life to represent the planets in the solar system. The occult adept's intention is to put his recruits through strange mystical rites and divest them of their worldly baggage before embarking on a trip to Lotus Island. There they ascend the Holy Mountain to displace the immortal gods who secretly rule the universe.",
                "popularity": 2.8686,
                "poster_path": "/mP5FGQbNjFkrjcZ6AVHrvokPRe5.jpg",
                "release_date": "1973-11-29",
                "title": "The Holy Mountain",
                "video": false,
                "vote_average": 7.537,
                "vote_count": 960,
                "character": "Fon's Father (uncredited)",
                "credit_id": "5efa9fd1cffeed003605bf61",
                "order": 26
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "David Silva Guglielmeti",
            "David Silva Jr.",
            "Давид Сильва"
        ],
        "biography": "David Silva was born on October 9, 1917 in Mexico City, Distrito Federal, Mexico as David Silva Guglielmeti. Of Swiss-Italian and French descent on his mother's side, David Silva was born in Mexico City on October 8, 1917, to David Silva Ramírez, an outstanding singer and operatic singing teacher, and Aída Guglielmeti Travesí, of North American origin. Because his father worked alongside Enrico Caruso, part of David's childhood was spent in the United States, and it was not until his father's retirement that the family returned to Mexico, where he began his studies at the French-English School in Mexico City, and later studied at the National School of Jurisprudence of the UNAM, where he did not finish his studies because of his participation as an extra in the film Bajo el cielo de México, at the express invitation of his school friends.\n\nIn his beginnings as an actor, he worked as an extra in several film productions, but he did not achieve the fame and recognition he longed for. Because working as an extra he could not achieve the fame he wanted, he formed a union in favor of the \"extras\", however, this instead of benefiting him affected him because he was banned for a little more than a year.  His great opportunity in the golden age of Mexican cinema was when Emilio \"El Indio\" Fernández gave him the starring role in the film \"La isla de la pasión\" (Passion Island) alongside Pedro Armendáriz. In 1947 he won an Ariel for his role as \"Kid Terranova\" in the film Campeón Sin Corona, leaving Pedro Armendáriz as the loser.\n\nDue to his interpretations of popular characters, David was nominated two more times as best actor in the film Esquina Bajan in 1949 and Espaldas Mojadas in 1956.\n\nThe glory years of this leading man of the golden age of Mexican cinema passed into tragedy. In 1971 he suffered an automobile accident, resulting in a serious injury to his left leg.  During his treatment, doctors discovered that he had diabetes; David Silva's health became complicated and he had to undergo surgery to amputate his leg and save his life. In 1976 the disease continued to progress and his right leg had to be amputated as well. The condition became more complicated, leading the great actor to his death on September 21, 1976, in Mexico City.",
        "birthday": "1917-10-09",
        "deathday": "1976-09-21",
        "gender": 2,
        "homepage": null,
        "id": 236273,
        "imdb_id": "nm0798270",
        "known_for_department": "Acting",
        "name": "David Silva",
        "place_of_birth": "Mexico City, Distrito Federal, Mexico",
        "popularity": 0.0972,
        "profile_path": "/gwivUANcAuH2jNQHC0grZRRgN08.jpg"
    }
}