{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rcUcYzGGicDvhDs58uM44tJKB9F.jpg",
                "genre_ids": [
                    16,
                    10751,
                    14,
                    28,
                    12
                ],
                "id": 527774,
                "original_language": "en",
                "original_title": "Raya and the Last Dragon",
                "overview": "Long ago, in the fantasy world of Kumandra, humans and dragons lived together in harmony. But when an evil force threatened the land, the dragons sacrificed themselves to save humanity. Now, 500 years later, that same evil has returned and it’s up to a lone warrior, Raya, to track down the legendary last dragon to restore the fractured land and its divided people.",
                "popularity": 9.9088,
                "poster_path": "/5nVhgCzxKbK47OLIKxCR1syulOn.jpg",
                "release_date": "2021-03-03",
                "title": "Raya and the Last Dragon",
                "video": false,
                "vote_average": 7.824,
                "vote_count": 7033,
                "character": "Boun (voice)",
                "credit_id": "6010213b0e597b003e33c39d",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/zBkHCpLmHjW2uVURs5uZkaVmgKR.jpg",
                "genre_ids": [
                    10751,
                    12,
                    35,
                    14
                ],
                "id": 585245,
                "original_language": "en",
                "original_title": "Clifford the Big Red Dog",
                "overview": "As Emily struggles to fit in at home and at school, she discovers a small red puppy who is destined to become her best friend. When Clifford magically undergoes one heck of a growth spurt, becomes a gigantic dog and attracts the attention of a genetics company, Emily and her Uncle Casey have to fight the forces of greed as they go on the run across New York City. Along the way, Clifford affects the lives of everyone around him and teaches Emily and her uncle the true meaning of acceptance and unconditional love.",
                "popularity": 6.1658,
                "poster_path": "/30ULVKdjBcQTsj2aOSThXXZNSxF.jpg",
                "release_date": "2021-11-10",
                "title": "Clifford the Big Red Dog",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 1774,
                "character": "Owen Yu",
                "credit_id": "60db2012dbf14400234f69d7",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Izaac Lushan Wang"
        ],
        "biography": "Izaac Wang is an American actor, recognized for his roles in the movies Good Boys (2019) and Raya and the Last Dragon (2021). His film career began with the TV Land series Teachers, followed by his first movie role as Soren in the Universal Pictures comedy Good Boys. In June 2019, he was cast as Owen Yu in the Paramount Pictures film Clifford the Big Red Dog. The following year, in June 2020, he appeared in the Lionsgate film Think Like a Dog. He gained further recognition in March 2021 for his portrayal of Boun in the Walt Disney Pictures animated film Raya and the Last Dragon. Additionally, in February 2021, Wang secured the role of Sam Wing in the HBO Max streaming series Gremlins: Secrets of the Mogwai, which premiered in 2023.\n\nAs of July 2024, Wang is pursuing his studies at the Los Angeles County High School for the Arts, a specialized institution for performing arts.\n\nIMDB mini bio by; yusufpiskin",
        "birthday": "2007-10-22",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2362044,
        "imdb_id": "nm9865565",
        "known_for_department": "Acting",
        "name": "Izaac Wang",
        "place_of_birth": "Minnesota, USA",
        "popularity": 0.2906,
        "profile_path": "/4vYS9NuDUFhzT9B9pFyjDTeNZiY.jpg"
    }
}