{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sjfbZVKRGh84lNxhqvuhdvovh18.jpg",
                "genre_ids": [
                    35
                ],
                "id": 2292,
                "original_language": "en",
                "original_title": "Clerks",
                "overview": "Convenience and video store clerks Dante and Randal are sharp-witted, potty-mouthed and bored out of their minds. So in between needling customers, the counter jockeys play hockey on the roof, visit a funeral home and deal with their love lives.",
                "popularity": 2.5644,
                "poster_path": "/9IiSgiq4h4siTIS9H3o4nZ3h5L9.jpg",
                "release_date": "1994-10-19",
                "title": "Clerks",
                "video": false,
                "vote_average": 7.385,
                "vote_count": 2612,
                "character": "Chewlie's Rep",
                "credit_id": "52fe434bc3a36847f8049291",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Scott Schiaffo was born in Passaic, New Jersey. Independent film fans know him best as the \"Chewlies Gum Guy\" from Kevin Smith's 1994 independent cult classic \"Clerks\".\n\nSchiaffo is an actor/musician who plays guitar, keyboards, bass, and harmonica. Schiaffo has appeared in several feature films as well as many shorts since his big screen debut in the seminal cult comedy \"Clerks\".\n\nHe's appeared alongside Michael DeLorenzo in \"The Garden State\", Selma Blair in \"The Broccoli Theory\" and Ethan Suplee in \"Vulgar\" He was featured in the View Askew produced - Lions Gate distributed motion picture \"Vulgar\". \"Vulgar\" has gone on to become a cult classic and one of Lions Gate's most controversial releases to date.\n\nSchiaffo played the lead, Mike Tobin in Tom Zanca's crime thriller \"Linger\" which enjoyed a winning response at many film festivals.\n\nScott played the lead \"Mo Fletcher\" in the independent comedy feature \"Idiots Are Us\" which won Best Comedy Feature at the 2006 New York Film and Video Festival.\n\nHe can be seen in the B & W short \"I Got Stuff\" and the live Jule Carey DVD \"Love It Live\"\n\nSchiaffo and many of his Clerks cast mates were featured in AMC's Comic Book Men Season 3 EP 11 \"Pinheads\".\n\nSchiaffo released a book of collected poetry and short stories called \"Vicious Dogs Attack Me in Sleepless Nights of Summer\" and in 2020 the Audible version read by the author was released worldwide.\n\nSchiaffo released an audio CD called \"The Shoestring Serenade\" which is a collection of instrumental film music culled from over 2 decades of original film music he composed & produced. Proceeds from the sale of this collection go to the Angels of Animals rescue in Clifton, New Jersey.\n\nIn 2021 Schiaffo was tapped to reprise his role as the Chewlies Gum Rep in Kevin Smith's much anticipated sequel film Clerks III. See less",
        "birthday": "1963-12-04",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 23634,
        "imdb_id": "nm0771269",
        "known_for_department": "Acting",
        "name": "Scott Schiaffo",
        "place_of_birth": "Passaic, New Jersey, USA",
        "popularity": 0.0286,
        "profile_path": "/mGOg4ehXhDN0s65P2oJFESDM8CP.jpg"
    }
}