{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8WIufsaJgm7VWgAc5ALWdJ8v2kB.jpg",
                "genre_ids": [
                    14,
                    27,
                    35
                ],
                "id": 766,
                "original_language": "en",
                "original_title": "Army of Darkness",
                "overview": "Ash, a handsome, shotgun-toting, chainsaw-armed department store clerk, is time warped backwards into England's Dark Ages, where he romances a beauty and faces legions of the undead.",
                "popularity": 4.8105,
                "poster_path": "/xsgTuAtR2zSH8Umg3jWZcZjlDpe.jpg",
                "release_date": "1992-10-31",
                "title": "Army of Darkness",
                "video": false,
                "vote_average": 7.255,
                "vote_count": 3336,
                "character": "Henry's Man",
                "credit_id": "5d32aba42f8d094522d8631a",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Micheal Kenney was born on 20 September 1956 in Moorhead, Minnesota, USA. He is an actor, known for Army of Darkness (1992).\n\nAbout me. I guess my fifteen minutes of fame is being a glorified extra part in Sam Raimi's ARMY OF DARKNESS. I'm credited as Henry's Man and I'm the guy running away and getting an arrow in the back. That was my first time on a film set and it shows. I was Script Dept. Manager at Hollywood Book and Poster Company for several years. RIP Eric Caidin. I was the Lead Movie Coder at OTX for ten years. OTX became IPSOS OTX and then MPG WORLDWIDE MOTION PICTURE GROUP. After the bosses disappeared in the middle of the night I ended up as a coder at Screen Engine/ASI. As far as as writing goes I optioned a screenplay to Jeff Balis of \"Waiting\" and his partner Rhoades Rader of \"Dodgeball\". Sadly it never went anywhere. Nowadays I am writing my own brand of movie - very serious sarcastic comedies.",
        "birthday": "1956-09-20",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.stage32.com/profile/592331/about",
        "id": 2366018,
        "imdb_id": "nm0448495",
        "known_for_department": "Acting",
        "name": "Micheal Kenney",
        "place_of_birth": "Moorhead, Minnesota, USA",
        "popularity": 0.0071,
        "profile_path": null
    }
}