{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8WIufsaJgm7VWgAc5ALWdJ8v2kB.jpg",
                "genre_ids": [
                    14,
                    27,
                    35
                ],
                "id": 766,
                "original_language": "en",
                "original_title": "Army of Darkness",
                "overview": "Ash, a handsome, shotgun-toting, chainsaw-armed department store clerk, is time warped backwards into England's Dark Ages, where he romances a beauty and faces legions of the undead.",
                "popularity": 4.8105,
                "poster_path": "/xsgTuAtR2zSH8Umg3jWZcZjlDpe.jpg",
                "release_date": "1992-10-31",
                "title": "Army of Darkness",
                "video": false,
                "vote_average": 7.255,
                "vote_count": 3336,
                "character": "Tower Guard",
                "credit_id": "5d32ae076a300b5922af8ee4",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Rad Milo is known for One Night at McCool's (2001), Army of Darkness (1992) and African Mystique. Rad Milo is an actor who worked as regular background actor on Star Trek: The Next Generation and Star Trek: Voyager and in Star Trek Generations. He received no credit for his appearances. His uniform from Voyager was sold off on the It's A Wrap! sale and auction on eBay and was also worn by Derek McGrath. [1](X) With the name tag Richard Milo, his uniform from Star Trek: The Next Generation was also sold on eBay. Milo played supporting roles in Army of Darkness (1992, with Ian Abercrombie, Patricia Tallman, and stunts by Chuck Borden, Eddie Braun, George Colucci, B.J. Davis, Chris Doyle, Maria Kelly, Steven Lambert, Lane Leavitt, Gene LeBell, Ken Lesco, Dennis Madalone, Tom Morga, John Nowak, Tim Trella, and Brian J. Williams), and One Night at McCool's (2001, with Ric Sarabia, Tim de Zarn, and stunts by Manny Perry and Steve Rizzo). He also appeared in the Frasier episode \"Call Me Irresponsible\" (1993, with Kelsey Grammer and Tory Christopher).",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2366021,
        "imdb_id": "nm0590450",
        "known_for_department": "Acting",
        "name": "Rad Milo",
        "place_of_birth": null,
        "popularity": 0.0558,
        "profile_path": null
    }
}