{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8WIufsaJgm7VWgAc5ALWdJ8v2kB.jpg",
                "genre_ids": [
                    14,
                    27,
                    35
                ],
                "id": 766,
                "original_language": "en",
                "original_title": "Army of Darkness",
                "overview": "Ash, a handsome, shotgun-toting, chainsaw-armed department store clerk, is time warped backwards into England's Dark Ages, where he romances a beauty and faces legions of the undead.",
                "popularity": 4.8105,
                "poster_path": "/xsgTuAtR2zSH8Umg3jWZcZjlDpe.jpg",
                "release_date": "1992-10-31",
                "title": "Army of Darkness",
                "video": false,
                "vote_average": 7.255,
                "vote_count": 3336,
                "character": "Old Woman",
                "credit_id": "5d32a8b9caab6d1640a7ae35",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Sara Shearer received her BA in Theatre Art from UCLA and then completed a two year course at the Webber-Douglas Academy of Dramatic Art in London. She has appeared in over 100 plays and some of her favorite roles include Lady Bracknell in The Importance of Being Earnest, Madam Arcati in Blithe Spirit, Sister Jeanne in The Devils, Hecuba in The Trojan Women and Amanda in The Glass Menagerie. Musicals include Adelaide in Guys and Dolls, Bonnie in Anything Goes, Naughty Nancy in Little Mary Sunshine and Kim in Bye Bye Birdie. Sara was most recently seen on the GRT stage as Ethel in The Curious Savage. Her previous GRT credits include Olga in You Can’t Take It With You and Sadie in 70, Girls, 70. Film work includes “Army of Darkness” directed by Sam Raimi and “Mr. Church” with Eddie Murphy directed by Bruce Beresford. Sara has the leading role in “The Interval” a short film directed by Amanda Dow which garnered six awards in 2023 festivals including Best Director, Cannes World Art Festival and Best Director Paris Awards Film Festival. However, Sara’s greatest claim to fame may be her role as the very nasty grandmother in the 2021 Bud Light Seltzer Lemonade commercial.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "https://thegrouprep.com/project/sara-shearer/",
        "id": 2366015,
        "imdb_id": "nm0790460",
        "known_for_department": "Acting",
        "name": "Sara Shearer",
        "place_of_birth": "Sherman Oaks, California, USA",
        "popularity": 0.0991,
        "profile_path": "/AMCZUZpUXqZ49tAdoGXM0A2nwC.jpg"
    }
}