{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/drUgiqUfxmCCNZ9i0eeTEPqeDF.jpg",
                "genre_ids": [
                    35,
                    27
                ],
                "id": 46838,
                "original_language": "en",
                "original_title": "Tucker and Dale vs. Evil",
                "overview": "Two hillbillies are suspected of being killers by a group of paranoid college kids camping near the duo's West Virginian cabin. As the body count climbs, so does the fear and confusion as the college kids try to seek revenge against the pair.",
                "popularity": 4.1838,
                "poster_path": "/8shwLEDzajJGSfLgbpac8x8xn1U.jpg",
                "release_date": "2010-01-22",
                "title": "Tucker and Dale vs. Evil",
                "video": false,
                "vote_average": 7.388,
                "vote_count": 2944,
                "character": "Chuck",
                "credit_id": "52fe470fc3a36847f81213d1",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Travis Nelson is a Canadian actor. He is known for his role as Riley in the comedy series The Lake.\n\nNelson was born on September 8, 1990, in Fort St. John, British Columbia. Nelson began his acting career in 2009, when he made his television acting debut in the drama series Wild Roses. In 2010, Nelson made his feature film debut in the black comedy horror film Tucker & Dale vs. Evil, in which he played Chuck. On the same year, he made his television film debut in Meteor Storm, in which he played the role of Brad.\n\nNelson appeared as Brandon Hessner in the narrative mobile application Haunting Melissa, and repeated his role in the horror thriller film Dark Hearts.\n\nNelson's break-out role came in 2019, when he appeared in the romantic comedy television film Mistletoe Magic, in which he played Mark. In 2020, Nelson starred with Celeste Desjardins in the thriller television films Obsession: Her Final Vengeance, Obsession: Escaping My Ex and Obsession: Stalked by My Lover, in which he played Blake Collins.\n\nIn the same year, Nelson starred in the drama series I Am Syd Stone, in which he played the lead role as Syd Stone. Also the same year, Nelson starred in the romantic comedy drama television film Homemade Christmas as Kurt.\n\nIn 2021, Nelson appeared as Eddie in the crime drama series Clarice. On the same year, Nelson starred in the television film Secretly Santa with Alicia Dea Josipovic.\n\nIn 2022, Nelson appeared as Thomas in the romantic comedy drama film Tehranto.\n\nNelson was cast in the role of Riley, the love interest of lead character Justin, in the comedy series The Lake.",
        "birthday": "1990-09-08",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 236702,
        "imdb_id": "nm3303404",
        "known_for_department": "Acting",
        "name": "Travis Nelson",
        "place_of_birth": "Fort St. John, British Columbia, Canada",
        "popularity": 0.2678,
        "profile_path": "/y5aSsFzlsW21qjXb2gxdla8rsKc.jpg"
    }
}