{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/92tLofRwuX0mdqcybPz03xhpIgS.jpg",
                "genre_ids": [
                    9648,
                    53,
                    18
                ],
                "id": 663260,
                "original_language": "fr",
                "original_title": "Boîte noire",
                "overview": "Mathieu is a young and talented black box analyst on a mission to solve the reason behind the deadly crash of a brand new aircraft. Yet, when the case is closed by authorities, Mathieu cannot help but sense there is something wrong with the evidence. As he listens to the tracks again, he starts detecting some seriously disturbing details. Could the tape have been modified? Going against his boss' orders, Mathieu begins his own rogue investigation - an obsessional and dangerous quest for truth that will quickly threaten far more than his career...",
                "popularity": 3.2567,
                "poster_path": "/nNY5YnqCsMEggz2Z0kCl4Fclc1N.jpg",
                "release_date": "2021-09-08",
                "title": "Black Box",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1342,
                "character": "Alain Roussin",
                "credit_id": "61362fa9da9ef20066107cef",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Grégori Dérangère"
        ],
        "biography": "Grégori Derangère (born 27 March 1971) is a French actor.\n\nDerangère was born in Montpellier where his parents finished their medicine studies. He moved to Moscow and French Guiana during his childhood and then to Paris.\n\nHe studied acting at the Cours Florent when he was 21 years old in Paris and at École nationale supérieure des arts et techniques du théâtre in Lyon. At 25, he acted in his first film, Éric Rochant's Anna Oz, with Charlotte Gainsbourg and Gérard Lanvin.\n\nIn 1999, he played his first major role in 30 ans by Laurent Perrin with Arielle Dombasle, Julie Depardieu, Laurent Lucas and Anne Brochet.\n\nIn 2002, he was nominated for a César Award for Most Promising Actor for playing a soldier in François Dupeyron's The Officers' Ward with Sabine Azéma, Éric Caravaca and André Dussollier.\n\nIn 2004, he won the César Award for Most Promising Actor for his performance as Frédéric Auger in Jean-Paul Rappeneau's Bon Voyage.\n\nGregori is one of the ambassadors of Nicolas Hulot's foundation.\n\nSource: Article \"Grégori Derangère\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1971-03-27",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 23670,
        "imdb_id": "nm0246362",
        "known_for_department": "Acting",
        "name": "Grégori Derangère",
        "place_of_birth": "Montpellier, France",
        "popularity": 0.1072,
        "profile_path": "/hGil5CTnudDlDaCdvIWfGT7jsdG.jpg"
    }
}