{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/saESlYSTAGjr8gkyjoGb7omH0hf.jpg",
                "genre_ids": [
                    18
                ],
                "id": 901563,
                "original_language": "fr",
                "original_title": "Close",
                "overview": "Two 13-year-old boys spend an idyllic summer together, but their connection is put to the test when they become the subject of speculation at school.",
                "popularity": 3.7199,
                "poster_path": "/dlMNnWs7Mz8Nk5AC447Ew1tD5pn.jpg",
                "release_date": "2022-11-01",
                "title": "Close",
                "video": false,
                "vote_average": 7.794,
                "vote_count": 908,
                "character": "Sophie",
                "credit_id": "619c9c0170b44400424cbcb1",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/vGZTyglSEzL7evznmyIAoubsKiM.jpg",
                "genre_ids": [
                    18,
                    80,
                    10752
                ],
                "id": 430424,
                "original_language": "fr",
                "original_title": "Au revoir là-haut",
                "overview": "In November 1918, a few days before the Armistice, when Lieutenant Pradelle orders a senseless attack, he causes a useless disaster; but his outrageous act also binds the lives of two soldiers who have nothing more in common than the battlefield: Édouard saves Albert, although at a high cost. They become companions in misfortune who will attempt to survive in a changing world. Pradelle, in his own way, does the same.",
                "popularity": 1.6429,
                "poster_path": "/pkO5YoznMR9neuHVzhxHK9JJpAj.jpg",
                "release_date": "2017-10-25",
                "title": "See You Up There",
                "video": false,
                "vote_average": 7.846,
                "vote_count": 1314,
                "character": "Madeleine Péricourt",
                "credit_id": "5854157fc3a36827a502dc05",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Émilie Dequenne (29 August 1981 – 16 March 2025) was a Belgian actress. She first gained attention for playing the title character in the film Rosetta (1999), which earned her the Cannes Film Festival Award for Best Actress. She then went on to star in many films such as Brotherhood of the Wolf (2001), The Light (2004), The Girl on the Train (2009), Our Children (2012), Not My Type (2014) and This Is Our Land (2017).\n\nDequenne won the Best Actress award at the 1999 Cannes Film Festival for her debut film performance in the Palme d'Or-winning film Rosetta. Dequenne became more well-known with worldwide audiences following her role in Brotherhood of the Wolf, a $29 million-budgeted film that grossed more than $70 million in theaters worldwide. In 2009 she played the lead in André Téchiné's La Fille du RER alongside Catherine Deneuve. She starred in the French thriller film The Pack, which premiered at the 2010 Cannes Film Festival.\n\nIn 2012, she won the Un Certain Regard Award for Best Actress award at the 2012 Cannes Film Festival for her role in the film Our Children. The film also scored her a Magritte Award for Best Actress and a nomination for a Satellite Award for Best Actress.\n\nSource: Article \"Émilie Dequenne\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1981-08-29",
        "deathday": "2025-03-16",
        "gender": 1,
        "homepage": null,
        "id": 23671,
        "imdb_id": "nm0220183",
        "known_for_department": "Acting",
        "name": "Émilie Dequenne",
        "place_of_birth": "Belœil, Belgique",
        "popularity": 0.6476,
        "profile_path": "/aNGdK8n9GCzgHbxcucqdgmKM8lR.jpg"
    }
}