{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/v4d6PPfqHeUNSdcyBVQ2Xb8yBk0.jpg",
                "genre_ids": [
                    18,
                    53,
                    9648
                ],
                "id": 192,
                "original_language": "en",
                "original_title": "The Name of the Rose",
                "overview": "14th-century Franciscan monk William of Baskerville and his young novice arrive at a conference to find that several monks have been murdered under mysterious circumstances. To solve the crimes, William must rise up against the Church's authority and fight the shadowy conspiracy of monastery monks using only his intelligence; which is considerable.",
                "popularity": 4.2255,
                "poster_path": "/2BuVu0j6v2kNY2gGxtO3sDGyob2.jpg",
                "release_date": "1986-09-24",
                "title": "The Name of the Rose",
                "video": false,
                "vote_average": 7.494,
                "vote_count": 3164,
                "character": "Remigio da Varagine",
                "credit_id": "52fe4225c3a36847f8007645",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Helmut Qualtinger was born in Vienna, Austria. He initially studied medicine, but quit university to become a newspaper reporter and film critic for local press, while beginning to write texts for cabaret performances and theater plays. Qualtinger debuted as an actor at a student theater and attended the Max Reinhardt Seminar as a guest student.\n\nBeginning in 1947, he appeared in cabaret performances. In 1949, Qualtinger's first theatrical play, Jugend vor den Schranken, was staged in Graz. Up to 1960, Qualtinger collaborated on various cabaret programmes with the Namenlosen Ensemble made up of Gerhard Bronner, Carl Merz, Louise Martini, Peter Wehle, Georg Kreisler, and Michael Kehlmann.\n\nQualtinger was famous for his practical jokes. In 1951, he managed to launch a false report in several newspapers announcing a visit to Vienna of a (fictional) famous Inuit poet named Kobuk (author of \"The Burning Igloo\"). The reporters who assembled at the railway station however were to witness Qualtinger, in fur coat and cap, stepping from the train. Asked about his \"first impressions of Vienna\", the \"Inuit poet\" commented in broad Viennese dialect, \"Haaaßis'sdo - [It's hot here]\".\n\nThe short one-man play Der Herr Karl, written by Qualtinger and Carl Merz and performed by Qualtinger in 1961, made the author known across German-speaking countries. \"Herr Karl\", a grocery store clerk, tells the story of his life to an imaginary colleague - from the days of the Habsburg empire, the First Austrian Republic, the Austrofascist regime leading up to the Anschluss (annexation) by Nazi Germany, World War II and finally military occupation by Allied forces in the 1950s, seen from the perspective of a one who is a prototypical opportunist. Qualtinger's portrayal of the petit-bourgeois Nazi collaborator came at a time when \"normality\" had just been restored and Austrians' involvement in the Nazi movement was being downplayed and \"forgotten\", making many enemies for the author, who even received anonymous threats of murder.\n\nBeginning in the 1970s, Qualtinger frequently performed recitals of his own and other texts, including excerpts from Adolf Hitler's Mein Kampf and Karl Kraus' Die letzten Tage der Menschheit (The Last Days of Mankind). These recitals were highly popular and resulted in several records being published.\n\nQualtinger played countless theater, TV and film parts, making his final appearance in The Name of the Rose in 1986, along with Sean Connery.\n\nQualtinger died in Vienna on 29 September 1986, of a liver condition.\n\nFrom Wikipedia, the free encyclopedia",
        "birthday": "1928-10-08",
        "deathday": "1986-09-29",
        "gender": 2,
        "homepage": null,
        "id": 2367,
        "imdb_id": "nm0702818",
        "known_for_department": "Acting",
        "name": "Helmut Qualtinger",
        "place_of_birth": "Vienna, Austria",
        "popularity": 0.4304,
        "profile_path": "/mSa4MUwnNKjgzZbDEddnIaawT9C.jpg"
    }
}