{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xTWHFJgP5anqRipDig4LSa4DLqj.jpg",
                "genre_ids": [
                    16,
                    12,
                    35,
                    14
                ],
                "id": 532067,
                "original_language": "ja",
                "original_title": "映画 この素晴らしい世界に祝福を！紅伝説",
                "overview": "It is not strange that the Demon Lord's forces fear the Crimson Demons, the clan from which Megumin and Yunyun originate. Even if the Demon Lord's generals attack their village, the Crimson Demons can just easily brush them off with their supreme mastery of advanced and overpowered magic.  When Yunyun receives a seemingly serious letter regarding a potential disaster coming to her hometown, she immediately informs Kazuma Satou and the rest of his party. After a series of wacky misunderstandings, it turns out to be a mere prank by her fellow demon who wants to be an author. Even so, Megumin becomes worried about her family and sets out toward the Crimson Demons' village with the gang.  There, Kazuma and the others decide to sightsee the wonders of Megumin's birthplace. However, they soon come to realize that the nonsense threat they received might have been more than just a joke.",
                "popularity": 3.8637,
                "poster_path": "/fv5BgcfkpWh3V6Pb1qVlXESBOdl.jpg",
                "release_date": "2019-08-30",
                "title": "KONOSUBA – God's blessing on this wonderful world! Legend of Crimson",
                "video": false,
                "vote_average": 8.1,
                "vote_count": 579,
                "character": "Shikobei (voice)",
                "credit_id": "620e30101ad93b006fd3510a",
                "order": 22
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "やすだ りくや",
            "安田 陸矢",
            "ریکویا یاسودا"
        ],
        "biography": "Rikuya Yasuda (安田 陸矢, Yasuda Rikuya, August 19, 1998) is a Japanese voice actor born in Nara Prefecture affiliated with Arts Vision.",
        "birthday": "1998-08-19",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.artsvision.co.jp/talent/14409/",
        "id": 2369259,
        "imdb_id": "nm10711485",
        "known_for_department": "Acting",
        "name": "Rikuya Yasuda",
        "place_of_birth": "Nara, Japan",
        "popularity": 0.3946,
        "profile_path": "/eZCxGqkEibJkUEhLO9Xp4zNDlY3.jpg"
    }
}