{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/eGljNfNCrPhFYG2RXXmmE0OKu5.jpg",
                "genre_ids": [
                    18,
                    53,
                    80
                ],
                "id": 473033,
                "original_language": "en",
                "original_title": "Uncut Gems",
                "overview": "A charismatic New York City jeweler always on the lookout for the next big score makes a series of high-stakes bets that could lead to the windfall of a lifetime. Howard must perform a precarious high-wire act, balancing business, family, and encroaching adversaries on all sides in his relentless pursuit of the ultimate win.",
                "popularity": 5.189,
                "poster_path": "/sg0xxJeb3u1C4kAxhSuTwTNpEDt.jpg",
                "release_date": "2019-08-30",
                "title": "Uncut Gems",
                "video": false,
                "vote_average": 7.16,
                "vote_count": 5028,
                "character": "Julia De Flore",
                "credit_id": "5d3acabdab684974f590db0d",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "茱莉亞·福克斯"
        ],
        "biography": "Julia Fox (born February 2, 1990) is an Italian-American actress and filmmaker. She is best known for her debut performance in the 2019 film Uncut Gems, for which she was nominated for the Breakthrough Actor Award at the 2019 Gotham Awards.\n\nFox was born in Milan, Italy, to an Italian mother and an American father. Fox spent her early years living with her grandfather. At the age of six, she moved to New York City with her father and lived in Yorkville, Manhattan. She worked several service jobs, including at a shoe store, an ice cream shop, and a pastry shop. Fox attended City-As-School High School and worked as a dominatrix for six months.\n\nPrior to her role in Uncut Gems, Fox was a clothing designer and launched a successful women's knitwear line, Franziska Fox, with her friend Briana Andalore. She also worked as a model, posing for the last nude edition of Playboy in 2015, and as an exhibiting painter and photographer. She self-published two books of photography, Symptomatic of a Relationship Gone Sour: Heartburn/Nausea, published in 2015, and PTSD, published in 2016.  In 2017, Fox hosted an art exhibit titled \"R.I.P. Julia Fox'\", which featured silk canvases painted with her own blood.\n\nFox made her feature film debut in the 2019 Safdie brothers film Uncut Gems, playing a showroom saleswoman and mistress of the film's protagonist Howard Ratner (played by Adam Sandler), an erratic jewelry dealer and gambling addict. Fox had known the Safdie brothers for almost a decade after meeting Josh Safdie through a chance encounter at a cafe in SoHo, Manhattan.\n\nFox also wrote and directed Fantasy Girls, a short film about a group of teenage girls involved in sex work living in Reno, Nevada. She starred in Ben Hozie's PVT Chat, playing a cam girl named Scarlet. She also played Vanessa Capelli in Oscar-winning director Steven Soderbergh's period crime thriller No Sudden Move, which was shot during the COVID-19 pandemic.\n\nFox married Peter Artemiev, a private pilot based out of Brighton Beach, Brooklyn, in November 2018. They reside in Yorkville, Manhattan. On February 14, 2021, Fox announced the birth of her son.",
        "birthday": "1990-02-02",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 2371446,
        "imdb_id": "nm9681752",
        "known_for_department": "Acting",
        "name": "Julia Fox",
        "place_of_birth": "Milan, Italy",
        "popularity": 1.1768,
        "profile_path": "/AwipgBalCBiOfwXKssxM0NQlz33.jpg"
    }
}