{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/11V6JMreBokxvTZTsxmSQsibaRb.jpg",
                "genre_ids": [
                    28,
                    80,
                    53
                ],
                "id": 13809,
                "original_language": "en",
                "original_title": "RocknRolla",
                "overview": "When a Russian mobster sets up a real estate scam that generates millions of pounds, various members of London's criminal underworld pursue their share of the fortune. Various shady characters, including Mr One-Two, Stella the accountant, and Johnny Quid, a druggie rock-star, try to claim their slice.",
                "popularity": 2.2938,
                "poster_path": "/i7eyngqjdvKB7NvrWtCjjTNNq8N.jpg",
                "release_date": "2008-09-04",
                "title": "RocknRolla",
                "video": false,
                "vote_average": 6.95,
                "vote_count": 3096,
                "character": "Cookie",
                "credit_id": "52fe45a49251416c7505d65f",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/uc8FwdCQi3eD7JIbyiZuzo5n6Jv.jpg",
                "genre_ids": [
                    18,
                    28,
                    80
                ],
                "id": 18533,
                "original_language": "en",
                "original_title": "Bronson",
                "overview": "A young man who was sentenced to 7 years in prison for robbing a post office ends up spending 30 years in solitary confinement. During this time, his own personality is supplanted by his alter ego, Charles Bronson.",
                "popularity": 2.5225,
                "poster_path": "/6diyyGIbBNiANsdIaCGtyv4IofR.jpg",
                "release_date": "2009-03-13",
                "title": "Bronson",
                "video": false,
                "vote_average": 6.973,
                "vote_count": 2557,
                "character": "Paul Daniels",
                "credit_id": "52fe47849251416c7509c3ef",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/kfofK4GzJsJZhCShqZY438c8Y4Y.jpg",
                "genre_ids": [
                    35,
                    12,
                    10751
                ],
                "id": 116149,
                "original_language": "en",
                "original_title": "Paddington",
                "overview": "A young Peruvian bear travels to London in search of a home. Finding himself lost and alone at Paddington Station, he meets the kindly Brown family, who offer him a temporary haven.",
                "popularity": 7.2892,
                "poster_path": "/wpchRGhRhvhtU083PfX2yixXtiw.jpg",
                "release_date": "2014-11-24",
                "title": "Paddington",
                "video": false,
                "vote_average": 7.114,
                "vote_count": 3990,
                "character": "Andre the Thief",
                "credit_id": "543e259d0e0a266f8e001998",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Matthew King",
            "맷 킹"
        ],
        "biography": "Matt King (born 31 January 1968) is an English actor, writer of BBC sitcom Whites and comedian. He is known for his role as self-absorbed musician Super Hans in the Bafta-winning British sitcom Peep Show.\n\nHe has played many characters, including Elton John and Terry Venables, in the Bafta-nominated comedy series Star Stories, and starred in his own self-penned sketch show Dogface, also on Channel 4. He has appeared in cult comedy series Look Around You. King stars in the Australian TV series Spirited, playing the role of Henry Mallet.\n\nAs a stand-up comedian he has appeared at the Edinburgh festival and at the Melbourne International Comedy Festival. One of his shows was disrupted by the fact that he had a devastating car crash immediately before the show started, but the show went on.\n\nHe co-starred in the movie Inkheart, co-stars in the Guy Ritchie film Rocknrolla, the British film Bronson, and has a lead role in fantasy thriller Malice in Wonderland. He has also appeared in the third series of Doctor Who as Peter Streete in The Shakespeare Code and was a regular character in the hit BBC production Jekyll playing computer expert Freeman. He played a ticket tout in the acclaimed independent short film \"Brussels\" by Misha Manson-Smith.\n\nIn 2010 he appeared in London Boulevard alongside Colin Farrell, Keira Knightly and Ray Winston. He plays driver and bodyguard to Winston's character, Rob Gant.\n\nHe appears in the third series of Skins, playing Cook's father.\n\nDescription above from the Wikipedia article Matt King, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1968-01-31",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 23776,
        "imdb_id": "nm0455057",
        "known_for_department": "Acting",
        "name": "Matt King",
        "place_of_birth": "Watford, England, UK",
        "popularity": 0.4612,
        "profile_path": "/1WGWqW8j9bCG6YwnLPF8N4CZDjY.jpg"
    }
}