{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xXBnM6uSTk6qqCf0SRZKXcga9Ba.jpg",
                "genre_ids": [
                    10752,
                    28,
                    18
                ],
                "id": 516486,
                "original_language": "en",
                "original_title": "Greyhound",
                "overview": "A first-time captain leads a convoy of allied ships carrying thousands of soldiers across the treacherous waters of the \"Black Pit\" to the front lines of WWII. With no air cover protection for 5 days, the captain and his convoy must battle the surrounding enemy Nazi U-boats in order to give the allies a chance to win the war.",
                "popularity": 6.7107,
                "poster_path": "/kjMbDciooTbJPofVXgAoFjfX8Of.jpg",
                "release_date": "2020-07-09",
                "title": "Greyhound",
                "video": false,
                "vote_average": 7.415,
                "vote_count": 3124,
                "character": "Harry",
                "credit_id": "5f0cd1fbf48b34003505396b",
                "order": 23
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Dominic Keating (born 1 July 1962) is an English television, film and theatre actor, known for his portrayal as Lt. Malcolm Reed on Star Trek: Enterprise.\n\nKeating was born in Leicester to an Irish father; his grandfather, a brigadier, was awarded an OBE. His first stage performance was in primary school, playing a character in The Ragged School. He then attended Uppingham School.\n\nAfter graduating from the University College London with First Class Honours in History, he tried various jobs before deciding to be a professional actor. To obtain his Equity card, Keating worked in a drag act called Feeling Mutual.\n\nAs of 2005, Keating maintains homes in both London and Los Angeles. He enjoys golf, swimming, music, boogie boarding, tennis, reading and traveling.",
        "birthday": "1962-07-01",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.dominickeating.com",
        "id": 23790,
        "imdb_id": "nm0444098",
        "known_for_department": "Acting",
        "name": "Dominic Keating",
        "place_of_birth": "Leicester, Leicestershire, England, UK",
        "popularity": 0.4536,
        "profile_path": "/eRe4BJz9fTztlRKikDRHhmss6ee.jpg"
    }
}