{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ZtcGMc204JsNqfjS9lU6udRgpo.jpg",
                "genre_ids": [
                    28,
                    18
                ],
                "id": 911430,
                "original_language": "en",
                "original_title": "F1",
                "overview": "Racing legend Sonny Hayes is coaxed out of retirement to lead a struggling Formula 1 team—and mentor a young hotshot driver—while chasing one more chance at glory.",
                "popularity": 171.1139,
                "poster_path": "/9PXZIUsSDh4alB80jheWX4fhZmy.jpg",
                "release_date": "2025-06-25",
                "title": "F1",
                "video": false,
                "vote_average": 7.8,
                "vote_count": 2107,
                "character": "Esteban Ocon",
                "credit_id": "668aa43e999c8fe31b3fd516",
                "order": 62
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Esteban José Jean-Pierre Ocon-Khelfane"
        ],
        "biography": "Esteban José Jean-Pierre Ocon-Khelfane (born 17 September 1996) is a French racing driver, currently competing in Formula One for Haas.\n\nGraduating from karting to junior formulae in 2012, Ocon won his first championship at the 2014 FIA Formula 3 European Championship with Prema Racing, ahead of Tom Blomqvist and eventual three-time World Champion Max Verstappen. He then won the 2015 GP3 Series with ART Grand Prix.\n\nA member of the Mercedes Junior Team from 2015 to 2019, Ocon made his Formula One debut at the 2016 Belgian Grand Prix with Manor, replacing Rio Haryanto for the remainder of the 2016 season. He moved to Force India—who later became Racing Point—in 2017, partnering Sergio Pérez. Ocon left Racing Point at the end of 2018, and became a reserve driver for Mercedes in 2019. He signed for Renault in 2020, taking his maiden career podium at the 2020 Sakhir Grand Prix. Ocon then partnered Fernando Alonso at the re-branded Alpine team in 2021, taking his maiden race win at the Hungarian Grand Prix. After a podium-less 2022 season, during which he became the first teammate to outscore Alonso in the championship since Jenson Button in 2015, Ocon scored his third podium at the 2023 Monaco Grand Prix.\n\nAs of the 2024 Azerbaijan Grand Prix, Ocon has achieved one race win and three podiums in Formula One. Ocon is set to leave Alpine at the end of the 2024 season to join Haas.\n\nEsteban Ocon was born in Évreux, Normandy to Sabrina Khelfane and Laurent Ocon, a mechanic who owns a garage in Évreux. His paternal family is originally from Málaga. While competing in karting, his parents decided to sell their family home, which included his father's garage, to fund his karting career. After selling the house, they lived and travelled to races in a caravan Ocon also used as a motor home. As of 2022, Ocon lives in Geneva, Switzerland. Besides his native French language, Ocon also speaks English, Spanish and Italian.\n\nOcon entered karting in 2006, when he finished eighth in the Minime class of the French Championship. He won the championship in 2007 and continued his success by winning the Cadet class in 2008 ahead of Anthoine Hubert and Pierre Gasly. He then spent three years racing in the KF3 category and competed in the Spanish Championship and Italian Open Masters. He won the French KF3 title in 2010 and finished as runner-up in the WSK Euro Series in 2011 behind Max Verstappen.\n\nAt the age of 14, Ocon was signed by Gravity Sports management, a sister company of Renault F1 team.\n\nIn 2012, Ocon made his debut in single-seaters, taking part in the Eurocup Formula Renault 2.0 with Koiranen Motorsport. He finished fourteenth with four point-scoring finishes, including being on the podium at his home round at Circuit Paul Ricard. He also contested a partial campaign in the Formula Renault 2.0 Alps with Koiranen, finishing seventh with two podiums, both of which came at the Red Bull Ring.\n\nHe remained in the series for 2013, switching to the ART Junior Team. He recorded one pole position and won two races including at Circuit Paul Ricard, finishing the season in third place behind Pierre Gasly and Oliver Rowland. A partial campaign in the Northern European Cup produced a race win at the Hockenheimring and two further podiums. ...\n\nSource: Article \"Esteban Ocon\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1996-09-17",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.esteban-ocon.com",
        "id": 2380357,
        "imdb_id": "nm6930169",
        "known_for_department": "Acting",
        "name": "Esteban Ocon",
        "place_of_birth": "Evreux, Eure, France",
        "popularity": 0.0794,
        "profile_path": "/4T7tQWJ3BX8dc3prqh0JF6HhZRL.jpg"
    }
}