{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/v4yVTbbl8dE1UP2dWu5CLyaXOku.jpg",
                "genre_ids": [
                    12,
                    14,
                    10749,
                    10751
                ],
                "id": 420817,
                "original_language": "en",
                "original_title": "Aladdin",
                "overview": "A kindhearted street urchin named Aladdin embarks on a magical adventure after finding a lamp that releases a wisecracking genie while a power-hungry Grand Vizier vies for the same lamp that has the power to make their deepest wishes come true.",
                "popularity": 9.4595,
                "poster_path": "/ykUEbfpkf8d0w49pHh0AD2KrT52.jpg",
                "release_date": "2019-05-22",
                "title": "Aladdin",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 10349,
                "character": "Mother",
                "credit_id": "5d4e1d250d5d8500153de5d7",
                "order": 29
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Elif Yesil"
        ],
        "biography": "Elif Knight is an award-winning actress and director. She received the prestigious Patricia Rothermere Evening Standard Theatre Award, in and joint award and presented by Sir Richard Attenborough, who later mentored her during the early stages of her career.\n\nA graduate of a leading drama school, Elif has continued to refine her craft through extensive training with renowned coach Jack Waltzer from The Actors Studio. Over the course of 10 years, she trained with Jack in both Paris and London and became his assistant in 2014. Elif’s approach to method acting draws from the teachings of legends such as Stella Adler, Lee Strasberg, and Sanford Meisner—mentors to actors like Robert De Niro and Sigourney Weaver, with whom Jack Waltzer worked closely.\n\nIn addition to acting, Elif developed a passion for directing, particularly focusing on helping actors elevate their performances through deeper emotional and psychological understanding.\n\nHer recent acting credits include Gangs of London for HBO, the feature film Room 7 (2021), and the ITV/StudioCanal series No Return. Elif is also an accomplished writer and is currently pitching a comedy TV series centered around mistaken identity.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.elifknight.org/",
        "id": 2382768,
        "imdb_id": "nm1552725",
        "known_for_department": "Acting",
        "name": "Elif Knight",
        "place_of_birth": "Konya, Central Anatolia, Turkey",
        "popularity": 0.0357,
        "profile_path": "/wqTAflAynwqqJpAiRYXFmi8wPTq.jpg"
    }
}