{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/92tLofRwuX0mdqcybPz03xhpIgS.jpg",
                "genre_ids": [
                    9648,
                    53,
                    18
                ],
                "id": 663260,
                "original_language": "fr",
                "original_title": "Boîte noire",
                "overview": "Mathieu is a young and talented black box analyst on a mission to solve the reason behind the deadly crash of a brand new aircraft. Yet, when the case is closed by authorities, Mathieu cannot help but sense there is something wrong with the evidence. As he listens to the tracks again, he starts detecting some seriously disturbing details. Could the tape have been modified? Going against his boss' orders, Mathieu begins his own rogue investigation - an obsessional and dangerous quest for truth that will quickly threaten far more than his career...",
                "popularity": 3.2567,
                "poster_path": "/nNY5YnqCsMEggz2Z0kCl4Fclc1N.jpg",
                "release_date": "2021-09-08",
                "title": "Black Box",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1342,
                "character": "Lucas' Mother (voice)",
                "credit_id": "625152e32f1be024b2c82880",
                "order": 31
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Axelle Laffont (born 24 July 1970) is a French actress and comedian.\n\nShe was born in Marseille. She is both the granddaughter of publisher Robert Laffont, and the daughter of Patrice Laffont, television presenter, and Catherine Laporte. She is also the stepdaughter of Édouard Molinaro who married her mother in 1982.\n\nAxelle Laffont participated in La Matinale d'Arthur from 1996 to 1999, but became known by intervening in La Grosse Émission from 1999 to 2000 and then presenting in 2000 and 2001 a very special weather and staggered in the show Nulle part ailleurs on Canal+, based on sketches and burlesque disguises.\n\nShe also appeared in series such as Un gars, une fille, Caméra Café, H (Season 1 Episode 12: A Red Flacon) and Kaamelott (Book 3 Episode 5: Sefriane of Aquitaine).\n\nShe makes a one-woman show La Folie du spectacle on a production by Serge Hazanavicius and Maurice Barthelemy of Robins des bois from 2002 to 2005.\n\nIn 2007, she co-wrote and co-produced Mariage surprise.\n\nFrom September 2007 to January 2008, she regularly appeared in the program On n'est pas couché hosted by Laurent Ruquier on Saturday nights on France 2.\n\nIn 2009, she wrote the comic, Marny. In February 2010, she released her first album Axelle Laffont in translation, which incorporates American standards translated into French.\n\nShe also appeared on France Inter's Le Fou du roi. In 2012, she plays Smoke this cigarette at the Théâtre des Mathurins. In September 2015, she returned on stage with the one woman show HyperSensible, directed by Charles Templon.\n\nSource: Article \"Axelle Laffont\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1970-07-24",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 238401,
        "imdb_id": "nm0480831",
        "known_for_department": "Acting",
        "name": "Axelle Laffont",
        "place_of_birth": "Marseille, Bouches-du-Rhône, France",
        "popularity": 0.1152,
        "profile_path": "/m2dpiEjvcCXzacVF0W5t2p4PEdc.jpg"
    }
}