{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wygUDDRNpeKUnkekRGeLCZM93tA.jpg",
                "genre_ids": [
                    878,
                    28,
                    12,
                    53
                ],
                "id": 199,
                "original_language": "en",
                "original_title": "Star Trek: First Contact",
                "overview": "The Borg, a relentless race of cyborgs, are on a direct course for Earth. Violating orders to stay away from the battle, Captain Picard and the crew of the newly-commissioned USS Enterprise E pursue the Borg back in time to prevent the invaders from changing Federation history and assimilating the galaxy.",
                "popularity": 5.08,
                "poster_path": "/iqhHe893Vcf07jNkNQ31tu85dKG.jpg",
                "release_date": "1996-11-22",
                "title": "Star Trek: First Contact",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1852,
                "character": "Lieutenant Commander Geordi La Forge",
                "credit_id": "52fe4226c3a36847f8007ba7",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/bRCP3D2QuR1UiFue6DCyznmRnyc.jpg",
                "genre_ids": [
                    878,
                    16,
                    12,
                    18
                ],
                "id": 22855,
                "original_language": "en",
                "original_title": "Superman/Batman: Public Enemies",
                "overview": "United States President Lex Luthor uses the oncoming trajectory of a Kryptonite meteor to frame Superman and declare a $1 billion bounty on the heads of the Man of Steel and his ‘partner in crime’, Batman. Heroes and villains alike launch a relentless pursuit of Superman and Batman, who must unite—and recruit help—to try and stave off the action-packed onslaught, stop the meteor Luthors plot.",
                "popularity": 4.2257,
                "poster_path": "/izvMc22ywSLFWUXZEIuJJ8dms75.jpg",
                "release_date": "2009-09-29",
                "title": "Superman/Batman: Public Enemies",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 680,
                "character": "Black Lightning (voice)",
                "credit_id": "52fe4452c3a368484e01c7eb",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Levar Burton",
            "Levardis Robert Martyn Burton Jr. "
        ],
        "biography": "Levardis Robert Martyn Burton Jr. (born February 16, 1957) is an American actor, director, and television host. He played Geordi La Forge in Star Trek: The Next Generation (1987–1994), Kunta Kinte in the ABC miniseries Roots (1977), and was the host of the PBS Kids educational television series Reading Rainbow for 23 years (1983–2006). Burton received 12 Daytime Emmy Awards and a Peabody Award as host and executive producer of Reading Rainbow.\n\nHis other roles include Cap Jackson in Looking for Mr. Goodbar (1977), Donald Lang in Dummy (1979), Tommy Price in The Hunter (1980), which earned him an NAACP Image Award for Outstanding Actor in a Motion Picture, and Martin Luther King Jr. in Ali (2001). Burton received the Grammy Award for Best Spoken Word Album at the 42nd Annual Grammy Awards for his narration of the book The Autobiography of Martin Luther King Jr. In 1990, he was honored for his accomplishments in television with a star on the Hollywood Walk of Fame.\n\nFrom 2017 until 2024, Burton created and hosted the podcast LeVar Burton Reads, often described as \"Reading Rainbow for adults\". In October 2024, Burton appeared as the host of the Trivial Pursuit television game show broadcast on The CW network and streaming online.",
        "birthday": "1957-02-16",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2390,
        "imdb_id": "nm0000996",
        "known_for_department": "Acting",
        "name": "LeVar Burton",
        "place_of_birth": "Landstuhl, Rhineland Palatinate, Germany",
        "popularity": 0.4292,
        "profile_path": "/tC74tISKpFGmJkrw24MMLix5nNa.jpg"
    }
}