{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/j1xaeJZOEOiVBD1rk3dg4YaAk23.jpg",
                "genre_ids": [
                    28,
                    12,
                    18,
                    10751
                ],
                "id": 1885,
                "original_language": "en",
                "original_title": "The Karate Kid",
                "overview": "New Jersey teen Daniel LaRusso moves to Los Angeles with his mother, and soon strikes up a relationship with Ali. He quickly finds himself the target of bullying by a group of thugs, led by Ali's ex-boyfriend Johnny, who study karate at the Cobra Kai dojo under ruthless sensei John Kreese. Fortunately, Daniel befriends Mr. Miyagi, an unassuming repairman who just happens to be a martial arts master himself. Miyagi takes Daniel under his wing, training him in a more compassionate form of karate for self-defense and, later, preparing him to compete against the brutal Cobra Kai.",
                "popularity": 6.137,
                "poster_path": "/1mp4ViklKvA0WXXsNvNx0RBuiit.jpg",
                "release_date": "1984-06-22",
                "title": "The Karate Kid",
                "video": false,
                "vote_average": 7.209,
                "vote_count": 4470,
                "character": "Lucille LaRusso",
                "credit_id": "52fe431ec3a36847f803b855",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Randy M. 'Randee' Heller (born June 10, 1947) is an American television and film actress. Her most notable roles were in the film The Karate Kid and one of its sequels, as Daniel LaRusso's mother, and on the 1970s serial sitcom Soap as Jodie Dallas's roommate Alice, one of the first recurring lesbian characters in television history. She also had a starring role as Carol in the 1979 made-for-TV movie, Can You Hear the Laughter? The Story of Freddie Prinze. She had a recurring role on the series Mad Men as Don Draper's elderly secretary Ida Blankenship.\n\nDescription above from the Wikipedia article Randee Heller, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1947-06-10",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 23916,
        "imdb_id": "nm0375374",
        "known_for_department": "Acting",
        "name": "Randee Heller",
        "place_of_birth": "Brooklyn, New York, USA",
        "popularity": 0.4586,
        "profile_path": "/asb43syJO1U8SEpcBbfK1On3ECf.jpg"
    }
}