{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yJIRptBDdt92JS4decYj5HL3Q60.jpg",
                "genre_ids": [
                    53,
                    80,
                    28
                ],
                "id": 197950,
                "original_language": "fr",
                "original_title": "La French",
                "overview": "Newly transferred to the bustling port city of Marseille to assist with a crackdown on organized crime, energetic young magistrate Pierre Michel is given a rapid-fire tutorial on the ins and outs of an out-of-control drug trade. Pierre's wildly ambitious mission is to take on the French Connection, a highly organized operation that controls the city's underground heroin economy and is overseen by the notorious —and reputedly untouchable— Gaetan Zampa. Fearless, determined and willing to go the distance, Pierre plunges into an underworld world of insane danger and ruthless criminals.",
                "popularity": 2.5193,
                "poster_path": "/kIkmaZATFP4RkQSiWgyL6KGOTq6.jpg",
                "release_date": "2014-12-03",
                "title": "The Connection",
                "video": false,
                "vote_average": 7.123,
                "vote_count": 901,
                "character": "Inspector José Alvarez",
                "credit_id": "55146ed79251410462002461",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/sIJTdyF6JFbIz5mENPpeSlCKYyB.jpg",
                "genre_ids": [
                    14,
                    35,
                    10749
                ],
                "id": 59436,
                "original_language": "en",
                "original_title": "Midnight in Paris",
                "overview": "While on a trip to Paris with his fiancée's family, a nostalgic screenwriter finds himself mysteriously going back to the 1920s every day at midnight.",
                "popularity": 5.2502,
                "poster_path": "/4wBG5kbfagTQclETblPRRGihk0I.jpg",
                "release_date": "2011-05-11",
                "title": "Midnight in Paris",
                "video": false,
                "vote_average": 7.521,
                "vote_count": 7491,
                "character": "1920's Partygoer",
                "credit_id": "55ee8649c3a3682c5d01a1f0",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "귀욤 고익스"
        ],
        "biography": "Guillaume Gouix (born 30 November 1983) is a French actor, director and screenwriter. He started in the limited television series Gone for Good (2021).\n\nGuillaume Gouix learned acting at the Conservatory of Marseille, then at the Regional School of actors of Cannes.\n\nOn stage, he works often with directors of Didier Galas, Jean-Pierre Vincent and Bruno Bayen.\n\nGouix made his big screen debut in the film \"Deuxième quinzaine de juillet\" directed by Christophe Reichert. He is also known for the role of Serge in the TV Series The Returned.\n\nSince 2014, Gouix has been in a relationship with French actress Alysson Paradis. In September 2015, the couple's first child, a son, was born. On 22 April 2022, Paradis announced that she's expecting her second child with Gouix.\n\nSource: Article \"Guillaume Gouix\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1983-11-30",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 239118,
        "imdb_id": "nm0332267",
        "known_for_department": "Acting",
        "name": "Guillaume Gouix",
        "place_of_birth": "Aix-en-Provence, Bouches-du-Rhône, France",
        "popularity": 0.2905,
        "profile_path": "/caQHHQaVmfHHvbchMxB9kJ6JSDm.jpg"
    }
}