{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mGBmiWmi7JqeTWnrPicRbkXcsuO.jpg",
                "genre_ids": [
                    99
                ],
                "id": 410718,
                "original_language": "en",
                "original_title": "Before the Flood",
                "overview": "A look at how climate change affects our environment and what society can do to prevent the demise of endangered species, ecosystems, and native communities across the planet.",
                "popularity": 1.0583,
                "poster_path": "/u0EfH2zsp6rLOvEKVvWGgzGRQn3.jpg",
                "release_date": "2016-10-21",
                "title": "Before the Flood",
                "video": false,
                "vote_average": 7.687,
                "vote_count": 798,
                "character": "Self (archive footage)",
                "credit_id": "6505517a3cd12c00ad8a826b",
                "order": 41
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Joseph Linus Barton (born September 15, 1949) is an American politician. A member of the Republican Party, he represented Texas's 6th congressional district in the U.S. House of Representatives from 1985 to 2019. The district included Arlington, part of Fort Worth, and several small towns and rural areas south of the Dallas–Fort Worth Metroplex. He was also a member of the Tea Party Caucus. In 2014, Barton became the longest-serving member of the Texas congressional delegation.\n\nBarton described himself as \"a constant defender of conservative ideals and values\". He advocated for deregulation of the electricity and natural gas industries, and served as vice-chairman of the House Energy and Commerce Committees. He denied that manmade carbon emissions had contributed to global warming, was a proponent of the use of fossil fuels, voted in favor of the May 2017 GOP plan to replace Obamacare, supported President Donald Trump's ban on immigration from certain predominantly Muslim nations, and supported the death penalty for people caught spying. Barton led a successful effort to repeal the oil export ban in the House in 2017. His environmental record of defending industries against tighter pollution controls earned him the nickname \"Smokey Joe.\"\n\nBarton came to national prominence after telling a citizen at a town hall meeting to \"shut up.\" He came to national attention again when sexually explicit photos that he had shared with women surfaced online in 2017. In November 2017, Barton announced that he would not seek re-election in 2018.",
        "birthday": "1949-09-15",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2392846,
        "imdb_id": "nm10842357",
        "known_for_department": "Acting",
        "name": "Joe Barton",
        "place_of_birth": "Waco, Texas, USA",
        "popularity": 0.787,
        "profile_path": "/n9z4wtczQRFII1bWbZFxUHV5YpP.jpg"
    }
}