{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wygUDDRNpeKUnkekRGeLCZM93tA.jpg",
                "genre_ids": [
                    878,
                    28,
                    12,
                    53
                ],
                "id": 199,
                "original_language": "en",
                "original_title": "Star Trek: First Contact",
                "overview": "The Borg, a relentless race of cyborgs, are on a direct course for Earth. Violating orders to stay away from the battle, Captain Picard and the crew of the newly-commissioned USS Enterprise E pursue the Borg back in time to prevent the invaders from changing Federation history and assimilating the galaxy.",
                "popularity": 5.1108,
                "poster_path": "/iqhHe893Vcf07jNkNQ31tu85dKG.jpg",
                "release_date": "1996-11-22",
                "title": "Star Trek: First Contact",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1852,
                "character": "Commander Beverly Crusher",
                "credit_id": "52fe4226c3a36847f8007baf",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/xwVkihNJYn6wR8Sip1aoIz5ax35.jpg",
                "genre_ids": [
                    28,
                    12,
                    53
                ],
                "id": 1669,
                "original_language": "en",
                "original_title": "The Hunt for Red October",
                "overview": "A new technologically-superior Soviet nuclear sub, the Red October, is heading for the U.S. coast under the command of Captain Marko Ramius. The American government thinks Ramius is planning to attack. Lone CIA analyst Jack Ryan has a different idea: he thinks Ramius is planning to defect, but he has only a few hours to find him and prove it - because the entire Russian naval and air commands are trying to find Ramius, too. The hunt is on!",
                "popularity": 5.5254,
                "poster_path": "/yVl7zidse4KiWtGMqHFtZCx4X3N.jpg",
                "release_date": "1990-03-02",
                "title": "The Hunt for Red October",
                "video": false,
                "vote_average": 7.376,
                "vote_count": 3445,
                "character": "Caroline Ryan",
                "credit_id": "59b14f4d92514107af086694",
                "order": 54
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Cheryl Gates McFadden (born March 2, 1949) is an American actress and choreographer.\n\nShe is best known for portraying the character of Dr. Beverly Crusher in the television and film series Star Trek: The Next Generation. She attended Brandeis University earning B.A Cum Laude in Theater Arts. After graduating from Brandeis, she moved to Paris and studied theater with actor Jacques LeCoq. Before Star Trek: The Next Generation, she was mostly known as a choreographer, often working on Jim Henson productions including the films The Dark Crystal, for which she was a choreographer, Labyrinth, for which she served as Director of Choreography and Puppet Movement, and The Muppets Take Manhattan, in which she has a brief on-screen appearance.\n\nAs a way of distinguishing her acting work from her choreography, she is usually credited as \"Gates McFadden\" as an actress and \"Cheryl McFadden\" as a choreographer. She appeared briefly in the Woody Allen film Stardust Memories, and in The Hunt for Red October as Jack Ryan's wife Cathy, though most of her scenes were cut in post-production. In 1987, McFadden was cast as Dr. Beverly Crusher on Star Trek: The Next Generation.\n\nThe Crusher character was slated to be Captain Jean-Luc Picard's love interest, and this aspect of the character is what attracted McFadden to the role. Another important aspect of the character was being a widow balancing motherhood and a career. McFadden left after the first season, in part because series executive producer Gene Roddenberry was never enthusiastic about casting McFadden in the first place.\n\nRoddenberry also wanted to give the role of ship's doctor to actress Diana Muldaur, with whom he had worked on the original Star Trek series and other occasions. Muldaur's character, Dr. Katherine Pulaski, proved very unpopular with fans and left the show after the second season. McFadden was approached to return for the third season. At first she was hesitant, but after a phone call from co-star Patrick Stewart, McFadden was persuaded to reprise her role.",
        "birthday": "1949-03-02",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 2392,
        "imdb_id": "nm0000533",
        "known_for_department": "Acting",
        "name": "Gates McFadden",
        "place_of_birth": "Cuyahoga Falls, Ohio, USA",
        "popularity": 0.4147,
        "profile_path": "/wlI6dlvncTFZMJWmz8hRIYyci3J.jpg"
    }
}