{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/myikoqu8Z2gtE7TaBgk9r6fB9MF.jpg",
                "genre_ids": [
                    18
                ],
                "id": 1040,
                "original_language": "it",
                "original_title": "Il gattopardo",
                "overview": "As Garibaldi's troops begin the unification of Italy in the 1860s, an aristocratic Sicilian family grudgingly adapts to the sweeping social changes undermining their way of life. Proud but pragmatic Prince Don Fabrizio Salina allows his war hero nephew, Tancredi, to marry Angelica, the beautiful daughter of gauche, bourgeois Don Calogero, in order to maintain the family's accustomed level of comfort and political clout.",
                "popularity": 3.1711,
                "poster_path": "/riSUxwoK3xjkOgy6YJSvPhi7cO6.jpg",
                "release_date": "1963-03-27",
                "title": "The Leopard",
                "video": false,
                "vote_average": 7.751,
                "vote_count": 886,
                "character": "(uncredited)",
                "credit_id": "65ff57ea7f6c8d01496d14af",
                "order": 42
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Marie-Jeanne Bellon-Downey"
        ],
        "biography": "Marie Bell (23 December 1900 – 14 August 1985), born Marie-Jeanne Bellon-Downey, was a French tragedian, comic actor and stage director. She was the director of the Théâtre du Gymnase in Paris from 1962 onwards, and this theatre now bears her name.\n\nMarie Bell was born on 23 December 1900 in Bègles near Bordeaux (France). With her Irish father, she spent her childhood between Bordeaux and England.\n\nBell was a classical actress. She also appeared in avant-garde theatre, Jean Genet in particular.\n\nHer interpretation of the role of Phèdre is highly noted : \"Voir Marie Bell dans Phèdre est une chance unique pour quiconque veut savoir ce qu'est le génie français.\" André Malraux\n\nDuring the German Occupation of France (1940–1944), she participated in the French resistance as one of nine directors of the Front national du théâtre. She was awarded the decoration of the Légion d'honneur by President Charles de Gaulle.\n\nBell married Jean Chevrier, who was also an actor.\n\nBell died on 14 August 1985 in Neuilly-sur-Seine, Hauts-de-Seine, France. She was buried alongside her husband Jean Chevrier at the Monaco Cemetery not far from Josephine Baker.\n\nSource: Article \"Marie Bell\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1900-12-23",
        "deathday": "1985-08-14",
        "gender": 1,
        "homepage": null,
        "id": 239232,
        "imdb_id": "nm0068372",
        "known_for_department": "Acting",
        "name": "Marie Bell",
        "place_of_birth": "Bordeaux, Gironde, France",
        "popularity": 0.0586,
        "profile_path": "/hp8eQUXm8vGyLSwUgdRDLnifRWk.jpg"
    }
}