{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/BBVAUchYvkmPThVIqipgAfabfl.jpg",
                "genre_ids": [
                    18
                ],
                "id": 614,
                "original_language": "sv",
                "original_title": "Smultronstället",
                "overview": "Crotchety retired doctor Isak Borg travels from Stockholm to Lund, Sweden, with his pregnant and unhappy daughter-in-law, Marianne, in order to receive an honorary degree from his alma mater. Along the way, they encounter a series of hitchhikers, each of whom causes the elderly doctor to muse upon the pleasures and failures of his own life. These include the vivacious young Sara, a dead ringer for the doctor's own first love.",
                "popularity": 4.0207,
                "poster_path": "/iyTD2QnySNMPUPE3IedZQipSWfz.jpg",
                "release_date": "1957-08-28",
                "title": "Wild Strawberries",
                "video": false,
                "vote_average": 8.103,
                "vote_count": 1721,
                "character": "Sigbritt",
                "credit_id": "57cd9de2c3a36868d9004155",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Giovanna Petré Thunholm"
        ],
        "biography": "Ann-Mari Birgitta Bengtsdotter Petré is a Swedish actress. She made her acting debut at 18, in \"Flottans muntergökar\" (1955). She was born into a family of artists. Gio Petré studied for a year at Gösta Terserus theatre school in Stockholm. In 1956 she was accepted at the Royal Dramatic Theatre School and graduated in 1959. The character she portrayed on the silver screen was often the sensual, provocative and dangerous blonde. Some of her more famous role interpretations in films are as \"Mannequin\" in \"Vaxdockan\", \"Diana\" in \"Diana går på jakt\" and as \"Inger\" in \"Den onda cirkeln\". Gio Petré has, up till now, appeared in 27 feature films and television productions.",
        "birthday": "1937-11-01",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 239289,
        "imdb_id": "nm0678469",
        "known_for_department": "Acting",
        "name": "Gio Petré",
        "place_of_birth": " Stockholm, Stockholms län, Sweden",
        "popularity": 0.122,
        "profile_path": "/p99WFGiDZhg5MLQXY2rz6C1wK4q.jpg"
    }
}