{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/j1xaeJZOEOiVBD1rk3dg4YaAk23.jpg",
                "genre_ids": [
                    28,
                    12,
                    18,
                    10751
                ],
                "id": 1885,
                "original_language": "en",
                "original_title": "The Karate Kid",
                "overview": "New Jersey teen Daniel LaRusso moves to Los Angeles with his mother, and soon strikes up a relationship with Ali. He quickly finds himself the target of bullying by a group of thugs, led by Ali's ex-boyfriend Johnny, who study karate at the Cobra Kai dojo under ruthless sensei John Kreese. Fortunately, Daniel befriends Mr. Miyagi, an unassuming repairman who just happens to be a martial arts master himself. Miyagi takes Daniel under his wing, training him in a more compassionate form of karate for self-defense and, later, preparing him to compete against the brutal Cobra Kai.",
                "popularity": 6.137,
                "poster_path": "/1mp4ViklKvA0WXXsNvNx0RBuiit.jpg",
                "release_date": "1984-06-22",
                "title": "The Karate Kid",
                "video": false,
                "vote_average": 7.209,
                "vote_count": 4470,
                "character": "Dutch",
                "credit_id": "52fe431ec3a36847f803b865",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Chadwick S. \"Chad\" McQueen (born December 28, 1960) was an American actor, film producer, martial artist and race car driver. He was born in Los Angeles, California to actor Steve McQueen and Filipino-born actress Neile Adams.\n\nMcQueen began his career as an actor, playing the character Dutch in The Karate Kid and The Karate Kid Part II. His further acting work included main roles in direct-to-video action films including Martial Law, Death Ring, and Red Line. He also worked as a producer, winning a Telly Award for his documentary Filming at Speed. After his retirement from acting, McQueen appeared as himself on various television programs related to motorsports, including Hot Rod TV and Celebrity Rides.\n\nAttempts were made to arrange for him to reprise his role as Dutch in the series Cobra Kai, but commitments to his company, McQueen Racing, and problems with his racing injuries, prevented this. He almost appeared in the show's final season before backing out due to scheduling conflicts.\n\nMcQueen dated Jill Henderson White Pasceri in the 1980s, a USEF Equestrian rider and horse trainer. He was married to Stacia Toten from 1987 to 1990. The couple had a son, Steven R. McQueen (b. 1988), also an actor. McQueen married Jeanie Galbraith in 1993.[\n\nMcQueen died from organ failure at his ranch in Palm Desert, California on September 11, 2024, at the age of 63. According to a friend, Arthur Barens, McQueen had never fully recovered from an injury he sustained in a fall in 2020.\n\nDescription above from the Wikipedia article Chad McQueen, licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": "1960-12-28",
        "deathday": "2024-09-11",
        "gender": 2,
        "homepage": null,
        "id": 23920,
        "imdb_id": "nm0574337",
        "known_for_department": "Acting",
        "name": "Chad McQueen",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.2774,
        "profile_path": "/wHU54LIBJwxjnNvmc6sofdiy8Bi.jpg"
    }
}