{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/j7rl2LphIbC88FppTfwJ5Gxj9kX.jpg",
                "genre_ids": [
                    27
                ],
                "id": 11906,
                "original_language": "it",
                "original_title": "Suspiria",
                "overview": "An American newcomer to a prestigious German ballet academy comes to realize that the school is a front for something sinister amid a series of grisly murders.",
                "popularity": 5.5305,
                "poster_path": "/5ya8jTbNZTrCFUx9OwpNBjCivXY.jpg",
                "release_date": "1977-02-01",
                "title": "Suspiria",
                "video": false,
                "vote_average": 7.488,
                "vote_count": 3043,
                "character": "Figurant (uncredited)",
                "credit_id": "5e8d0025a1a9ba0016b39b43",
                "order": 28
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Marina Pierro (born 9 October 1956, or 1960) is an Italian actress, model, writer, and film director, who is best known for her artistic relationship with Polish filmmaker Walerian Borowczyk (1923-2006). She has been described as an \"erotic icon of auteur cinema\".\n\nPierro's film career began with minor roles in several Italian films in 1976, most notably Luchino Visconti's final film, L'innocente (The Innocent). She appeared in Dario Argento's supernatural horror film Suspiria (1977) as an uncredited extra before her first prominent role as the self-styled stigmatic nun Sister Veronica in Walerian Borowczyk's 1978 film Interno di un Convento (Behind Convent Walls), based upon Stendhal's Promenades dans Rome (1829). Pierro and Borowczyk's collaboration lasted approximately ten years and comprised five completed films and one foray into episodic television.  Pierro's appearances on screen have been fleeting since the late 1980s, but she has directed three short films since - In Versi (2008, also starring), Himorogi (2012, also writer/producer), and Floaters (2016, also writer/producer).",
        "birthday": "1956-10-09",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 239337,
        "imdb_id": "nm0682679",
        "known_for_department": "Acting",
        "name": "Marina Pierro",
        "place_of_birth": "Boscotrecase, Naples, Italy",
        "popularity": 0.4996,
        "profile_path": "/u52gZquc1BszJ1uRbsVMFql9Jyc.jpg"
    }
}