{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7AvbU0ei7Fz21jqBL4tlgSufnMp.jpg",
                "genre_ids": [
                    53,
                    80,
                    18
                ],
                "id": 2721,
                "original_language": "fr",
                "original_title": "Z",
                "overview": "Amid a tense political climate, the opposition leader is killed in an apparent accident. When a prosecutor smells a cover-up, witnesses get targeted. A thinly veiled dramatization of the assassination of Greek politician Grigoris Lambrakis and its aftermath, “Z” captures the outrage at the US-backed junta that ruled Greece at the time of its release.",
                "popularity": 3.3259,
                "poster_path": "/dFAJyFNgvOv24f2RQyI9KDxjGr3.jpg",
                "release_date": "1969-02-26",
                "title": "Z",
                "video": false,
                "vote_average": 7.795,
                "vote_count": 580,
                "character": "Heroic Bricklayer",
                "credit_id": "5656583f92514109e8000b48",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Морис Баке"
        ],
        "biography": "Maurice Baquet is a cellist, actor, sportsman and French entertainer, born May 26, 1911 in Villefranche-sur-Saône and died July 8, 2005 in Noisy-le-Grand. Maurice Baquet was married twice: with Jacqueline Figus (1920-2011) from October 31, 1944 to June 20, 1959, with whom they had a daughter, Sophie, and with Maria Yakimova from February 20, 1964 until her death. The couple had four children: Anne, Gregori. All of them, as well as Sophie, born from her first marriage, are actors and singers — Stéphane, light designer and Dimitri, show producer. ...\n\nA native of Beaujolais, he took cello lessons at the Lyon conservatory and then those in Paris where he was in the same class as Henri Betti, Paul Bonneau, Léo Chauliac, Henri Dutilleux, Louiguy, Pierre Spiers and Raymond Trouard and where he won first prize. This did not prevent him from failing the entrance examination for the orchestra of the Paris Opera, which motivated him to give up a classical career.\n\nHowever, he does not leave his cello behind. On the contrary, the instrument accompanies him throughout his life and we remember the wink that Joseph Losey allowed him during a short but moving sequence in Monsieur Klein. In the early 1930s, he rubbed shoulders with Pierre and Jacques Prévert, Roger Blin and joined the famous October Group, an agitprop group, closely linked to the French Communist Party. He set up his career as an actor there and devoted himself to beautiful texts, in particular the poems of Aragon and Paul Éluard. In 1935, he made his first feature film under the direction of Marc Allégret, Les Beaux Jours. A filmography of more than 80 titles follows. His head as a resourceful and facetious kid also earned him the role of Bibi Fricotin, then that of Ribouldingue in two films by Marcel Aboulker.\n\nAt the theater, he plays in the operettas Andalousie and Gipsy by Francis Lopez. He also performed at the cabaret, sometimes accompanied on tap dance by Jacqueline Figus, his wife since 1944.\n\nHe also participated in ski mountaineering competitions, as well as more humorous performances, such as his ski descent from the stairs of the Butte Montmartre in 1946. In the same vein, he also skied down the stairs from the Maison de la Radio, following a bet. In 1947, he presented with the whimsical Saint-Granier a bicycle-ski allowing to go down the slopes. Friend of Roger Frison-Roche, we find him in the credits of Premier de cordée (1944). In 1955, he co-directed Stars and Tempests with Gaston Rébuffat and Georges Tairraz, which won the Grand Prix at the Trente Festival. On July 13, 1956, he made the first ascent of the south-east face of the Aiguille du Midi in Chamonix with Gaston Rébuffat, sequences of which can be seen in Entre terre et ciel.\n\nHe was also a friend of Robert Doisneau, who photographed him extensively6 and with whom he produced a work entitled Ballade pour violoncelle et chambre noire, which testifies to their friendship.\n\nHe died at the age of 94 and is buried in the cemetery of Beauregard (Ain).",
        "birthday": "1911-05-26",
        "deathday": "2005-07-08",
        "gender": 2,
        "homepage": "https://www.discogs.com/fr/artist/656574-Maurice-Baquet",
        "id": 239398,
        "imdb_id": "nm0052703",
        "known_for_department": "Acting",
        "name": "Maurice Baquet",
        "place_of_birth": "Villefranche-sur-Saône, Rhône, France",
        "popularity": 0.1272,
        "profile_path": "/kDoxH2SlJhVkUC97SmFkHu9x3Dz.jpg"
    }
}