{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wygUDDRNpeKUnkekRGeLCZM93tA.jpg",
                "genre_ids": [
                    878,
                    28,
                    12,
                    53
                ],
                "id": 199,
                "original_language": "en",
                "original_title": "Star Trek: First Contact",
                "overview": "The Borg, a relentless race of cyborgs, are on a direct course for Earth. Violating orders to stay away from the battle, Captain Picard and the crew of the newly-commissioned USS Enterprise E pursue the Borg back in time to prevent the invaders from changing Federation history and assimilating the galaxy.",
                "popularity": 5.08,
                "poster_path": "/iqhHe893Vcf07jNkNQ31tu85dKG.jpg",
                "release_date": "1996-11-22",
                "title": "Star Trek: First Contact",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1852,
                "character": "Counselor Deanna Troi",
                "credit_id": "52fe4226c3a36847f8007bb3",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/8bXbZE8lBdV7W68AD7u5YNXKTOn.jpg",
                "genre_ids": [
                    18
                ],
                "id": 1640,
                "original_language": "en",
                "original_title": "Crash",
                "overview": "In post-Sept. 11 Los Angeles, tensions erupt when the lives of a Brentwood housewife, her district attorney husband, a Persian shopkeeper, two cops, a pair of carjackers and a Korean couple converge during a 36-hour period.",
                "popularity": 4.6466,
                "poster_path": "/86BdPC6RDX88NC880pLidKn2LCj.jpg",
                "release_date": "2005-05-06",
                "title": "Crash",
                "video": false,
                "vote_average": 7.214,
                "vote_count": 3660,
                "character": "Shereen",
                "credit_id": "52fe4307c3a36847f8035069",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "مارینا سیرتیس"
        ],
        "biography": "Marina Sirtis (born 29 March 1955) is an English-American actress. She is best known for her role as Counselor Deanna Troi on the television series Star Trek: The Next Generation and the four feature films that followed.\n\nBiography\n\nMarina Sirtis was born in the East End of London, the daughter of working class Greek parents Despina, a tailor's assistant, and John Sirtis. She was brought up in Harringay, North London and emigrated to the U.S. in 1986, later becoming a naturalized U.S. citizen. She auditioned for drama school against her parents' wishes, ultimately being accepted to the Guildhall School of Music and Drama. She is married to rock guitarist Michael Lamper (21 June 1992 – present). Her younger brother, Steve, played football in Greece and played for Columbia University in the early 1980s. Marina herself is an avowed supporter of Tottenham Hotspur F.C.\n\nCareer\n\nSirtis started her career as a member of the repertory company at the Connaught Theatre, Worthing, West Sussex in 1976. Directed by Nic Young, she appeared in Joe Orton's What the Butler Saw and as Ophelia in Hamlet.\n\nBefore her role in Star Trek, Sirtis was featured in supporting roles in several films. In the 1983 Faye Dunaway film The Wicked Lady, she engaged in a whip fight with Dunaway. In the Charles Bronson sequel Death Wish 3, Sirtis's character is a rape victim. In the film Blind Date, she appears as a prostitute who is murdered by a madman.\n\nOther early works include numerous guest starring roles on British television series. Sirtis appeared in Raffles (1977), Hazell (1978), Minder (1979), the Jim Davidson sitcom Up the Elephant and Round the Castle (1985) and The Return of Sherlock Holmes (1986) among other things. She also played the stewardess in the famous 1979 Cinzano Bianco television commercial starring Leonard Rossiter and Joan Collins, in which Collins was splattered with drink.",
        "birthday": "1955-03-29",
        "deathday": null,
        "gender": 1,
        "homepage": "http://marinasirtis.tv",
        "id": 2393,
        "imdb_id": "nm0000642",
        "known_for_department": "Acting",
        "name": "Marina Sirtis",
        "place_of_birth": "London, England, UK",
        "popularity": 0.7101,
        "profile_path": "/xMrHyXrv21suNglAHD24GDY7Uhx.jpg"
    }
}