{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4HXiEsWUEMzJNFwjJv6oUaocqJU.jpg",
                "genre_ids": [
                    10752,
                    18,
                    10749
                ],
                "id": 468224,
                "original_language": "en",
                "original_title": "Tolkien",
                "overview": "England, early 20th century. The future writer and philologist John Ronald Reuel Tolkien (1892-1973) and three of his schoolmates create a strong bond between them as they share the same passion for literature and art, a true fellowship that strengthens as they grow up, but the outbreak of World War I threatens to shatter it.",
                "popularity": 5.9598,
                "poster_path": "/A7eYO3t7oZQdfJj5KlJBI7GhT9H.jpg",
                "release_date": "2019-05-03",
                "title": "Tolkien",
                "video": false,
                "vote_average": 6.937,
                "vote_count": 1471,
                "character": "Young Christopher Wiseman",
                "credit_id": "5d64bb98ad50f06b08453ef3",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ty Peter Moffett",
            "Ty Moffett"
        ],
        "biography": "Ty Peter Tennant (né Martin-Moffett; born 27 March 2002) is a British television actor. He is known for his roles as Tom Gresham in the science fiction series War of the Worlds (2019–present) and young Aegon II Targaryen in the HBO fantasy series House of the Dragon (2022).\n\nTennant had a brief cameo in the 2013 comedy spoof The Five(ish) Doctors Reboot. He later made his feature film debut in 2019 as a younger version of Tom Glynn-Carney's Christopher Wiseman in Tolkien. That same year, he began starring in the science fiction series War of the Worlds as Tom Gresham, the younger brother of Daisy Edgar-Jones' character Emily. He also made a guest appearance in an episode of the BBC One soap opera Casualty.\n\nIn 2021, Tennant and Sebastian Croft were cast as the Dead Boy Detectives Edwin Paine and Charles Rowland respectively in season 3 of the DC Universe series Doom Patrol. He had a cameo in Around the World in 80 Days. Tennant once again played a young Tom Glynn-Carney, this time as Aegon II Targaryen in the 2022 HBO fantasy series House of the Dragon, a Game of Thrones prequel and adaptation of George R. R. Martin's companion book Fire and Blood. In 2023, Tennant played the role of Raffy in Channel 4's standalone drama Consent.",
        "birthday": "2002-03-27",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2396945,
        "imdb_id": "nm6122080",
        "known_for_department": "Acting",
        "name": "Ty Tennant",
        "place_of_birth": "London, England, UK",
        "popularity": 0.5132,
        "profile_path": "/3CFIRzZJBBEOoadaZBykGDHutaK.jpg"
    }
}