{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/g5gwbwR98yN1TvycqHCJZhCPa7O.jpg",
                "genre_ids": [
                    18,
                    14
                ],
                "id": 2323,
                "original_language": "en",
                "original_title": "Field of Dreams",
                "overview": "Ray Kinsella is an Iowa farmer who hears a mysterious voice telling him to turn his cornfield into a baseball diamond. He does, but the voice's directions don't stop -- even after the spirits of deceased ballplayers turn up to play.",
                "popularity": 2.7502,
                "poster_path": "/vL7F8T9B6r4Uztpe1Hw4o63I1m1.jpg",
                "release_date": "1989-04-21",
                "title": "Field of Dreams",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 1579,
                "character": "Beulah Gasnick",
                "credit_id": "52fe434ec3a36847f804a56f",
                "order": 17
            },
            {
                "adult": false,
                "backdrop_path": "/smK3ud9IKSLVuRXdKauJ9p0DwNB.jpg",
                "genre_ids": [
                    35,
                    80,
                    18
                ],
                "id": 2322,
                "original_language": "en",
                "original_title": "Sneakers",
                "overview": "When shadowy U.S. intelligence agents blackmail a reformed computer hacker and his eccentric team of security experts into stealing a code-breaking 'black box' from a Soviet-funded genius, they uncover a bigger conspiracy. Now, he and his 'sneakers' must save themselves and the world economy by retrieving the box from their blackmailers.",
                "popularity": 12.6313,
                "poster_path": "/l2pIGwCvpZEpBuMb55YBl6A04Jv.jpg",
                "release_date": "1992-09-09",
                "title": "Sneakers",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 979,
                "character": "Dr. Elena Rhyzkov",
                "credit_id": "5612c93d9251414ec6006613",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ann Leslie Garlington ",
            "لی گارلیگتون"
        ],
        "biography": "Ann Leslie \"Lee\" Garlington (born July 20, 1953) is an American actress. She's known for her roles as Kirsten, Rose Nylund's (Betty White) daughter in the final season of The Golden Girls, Ronnie - the mistress of Joey Tribbiani's father on Friends, and a recurring role as Brenda Baxworth on Everwood. She was one of the stars of the series Lenny.\n\nShe has guest starred in a number of notable television series, including The West Wing, 7th Heaven, 8 Simple Rules, CSI: Crime Scene Investigation, Judging Amy, Will & Grace, Matlock, L.A. Law, The Practice, Quantum Leap, Home Improvement, Boston Legal, Roseanne, Get a Life, Profiler, Medium, Buffy the Vampire Slayer, Two and a Half Men, Lie to Me and among other series.  She also appeared in the sequels to Alfred Hitchcock's Psycho, Psycho II (1983) and Psycho III (1986). She starred alongside Sylvester Stallone and Brigitte Nielsen in the action/thriller Cobra (1986). In Sneakers (1992), she appeared as Dr. Elena Rhyzkov, a Czechoslovakian mathematics scientist, in a scene with Robert Redford.\n\nShe was originally intended to play the lead female role in Seinfeld. She was the female regular in the pilot episode, \"The Seinfeld Chronicles\", playing the waitress Claire at Pete's Luncheonette. When the series was picked up, however, it was decided that having the female lead be from such a different social status compared to the rest of the cast would be unworkable, so the character of Claire was dropped and replaced by Elaine Benes.\n\nIn 2018, she received a Primetime Emmy Award nomination for Outstanding Actress in a Short Form Comedy or Drama Series for her role as Darlene in Broken.",
        "birthday": "1953-07-20",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 23975,
        "imdb_id": "nm0307600",
        "known_for_department": "Acting",
        "name": "Lee Garlington",
        "place_of_birth": "Teaneck, New Jersey, USA",
        "popularity": 0.7835,
        "profile_path": "/8hkdeBX6K2QUsH1kuVGfSyTiZod.jpg"
    }
}