{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rbmJvTsPzVDszka97NguVUALUoh.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 423646,
                "original_language": "de",
                "original_title": "Aus dem Nichts",
                "overview": "Katja's life collapses after the deaths of her husband and son in a bomb attack. After a time of mourning and injustice, Katja seeks revenge.",
                "popularity": 1.5679,
                "poster_path": "/AdH8xoP2wAFZDMWiSoCGoLa0DUr.jpg",
                "release_date": "2017-11-23",
                "title": "In the Fade",
                "video": false,
                "vote_average": 6.906,
                "vote_count": 845,
                "character": "Frau Sebnem",
                "credit_id": "58ef83fcc3a368266b00ccec",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Şiir Eloğlu"
        ],
        "biography": "Eloğlu moved from Istanbul to Cologne as a four year old. The name \"Şiir\" is derived from her father, Metin Eloğlu (1927–1985), a painter and lyricist, who was awarded with important literature awards in the 1960s and 1970s.\n\nAfter graduating from high school in Cologne, Eloğlu studied for four years at the Hochschule für Musik Saar in Saarbrücken. Her first engagements then took her to theatres in Erlangen, Oberhausen, and Cologne.\n\nIn 1991, she made her first film with Kinofilm, Happy Birthday, Türke!, directed by Doris Dörrie and acted with Ulrike Folkerts in her first scene. Eloğlu became known to a wider audience between 1993 and 1996 by her role of young assistant doctor Dr. Nesrin Ergün in the RTL series Stadtklinik.\n\nAt the end of 1997, she moved to Berlin. She followed TV and cinema productions as well as theater engagements, among others at the Düsseldorfer Schauspielhaus, where she acted in Antigone and Seven Against Thebes.\n\nHer first international film production was the Swiss film 180° – Wenn deine Welt plötzlich Kopf steht, which was filmed by director Cihan Inan in Zürich. The international cast included Sophie Rois, Christopher Buchholz, Sabine Timoteo, and Michael Neuenschwander. The film ran at festivals in Antalya, Saarbrücken, Sudbury, and Marrakesh, as well as in the Spanish Ourense, where it received an award for Best Screenplay.\n\nShe was featured in Almanya - Welcome to Germany, directed by Yasemin Şamdereli, as Leyla Yılmaz. The film was awarded the Deutscher Filmpreis.\n\nFrom 2014 to 2015, she played the architect Suna Kaya in the soap opera Lindenstraße.",
        "birthday": "1965-12-07",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 239799,
        "imdb_id": "nm0255517",
        "known_for_department": "Acting",
        "name": "Şiir Eloğlu",
        "place_of_birth": "Istanbul, Turkey",
        "popularity": 0.0659,
        "profile_path": "/bkL8kf2XPuLFNeZdO6IceRijkbW.jpg"
    }
}