{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/37y53Jt8K6MvN6s4zJVFa61luO2.jpg",
                "genre_ids": [
                    10749,
                    18
                ],
                "id": 851644,
                "original_language": "ko",
                "original_title": "20세기 소녀",
                "overview": "In 1999, a teen girl keeps close tabs on a boy in school on behalf of her deeply smitten best friend – then she gets swept up in a love story of her own.",
                "popularity": 9.509,
                "poster_path": "/od22ftNnyag0TTxcnJhlsu3aLoU.jpg",
                "release_date": "2022-10-06",
                "title": "20th Century Girl",
                "video": false,
                "vote_average": 8.166,
                "vote_count": 761,
                "character": "Adult Na Bo-ra",
                "credit_id": "620758d3cb802800ca666bc8",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "한효주",
            "Han Hyo Joo",
            "Hyo-ju Han ",
            "Han  Hyo-ju ",
            "Hyo-joo Han",
            "Han Hyo Ju",
            "韓孝周",
            "ハン・ヒョジュ",
            "韩孝周",
            "هان هیۆ جو",
            "韩孝珠",
            "هان هیو جو"
        ],
        "biography": "Han Hyo-Joo (한효주) was born on February 22, 1987 in Cheongju, Chungcheongbuk-do, South Korea. Her mother worked as an elementary school teacher before becoming an inspector for public schools and her father worked in the military. As a child, Han Hyo-Joo was good in sports and enjoyed track & field. In her sophomore year of high school, Han Hyo-Ju moved to Seoul and attended Bulgok High School. Although her father, conservative & strict, opposed her move to Seoul she was able to go forth with her wishes. After high school, Han Hyo-Joo majored in theatre at Dongguk University. According to Han Hyo-Ju, her personality fits her blood type-A classification: calm, doesn't get angry easily, & able to endure without a lot of expression.  In 2003, Han Hyo-Ju won the grand prize for the Miss Bing-geure contest, which attracted the attention from the entertainment world (Bing-geure is a Korean food company). In 2005, Han Hyo-Ju received her first acting roles in the MBC sitcom “Nonstop 5” and the movie “My Boss, My Teacher”. Her debut performances went largely unnoticed. In 2006 Han Hyo-Ju received her first leading role in the KBS2 drama “Spring Waltz”. Director Yun Seok-Ho of “Spring Waltz” stated that he first got the idea to cast Han Hyo-Joo after browsing the Internet and coming across her picture. Yun Seok-Ho felt she still held the purity of a child and a sense of mysteriousness which suited her character well. Han Hyo-Joo also stated that working on “Spring Waltz” was difficult, largely due to her inexperience in acting.  Han Hyo-Joo's first leading performance in a feature film came with the 2006 independent film “Ad Lib Night,” helmed by well-regarded director Lee Yoon-Ki. Han Hyo-Joo's experience working on “Ad Lib Night” went far more smoothly than her first leading role in a drama series. Han Hyo-Joo recalled that the one month shoot seemed to zoom by and wished it could have lasted longer. Her performance was enthusiastically received by critics and Han Hyo-Joo received “Best Actress” awards from the 26th Korean Movie Critics Organization and the 20th Singapore International Film Festival.  Han Hyo-Joo's commercial break-out role came with her performance in the popular 2009 SBS drama series “Brilliant Legacy,” alongside actor/singer Lee Seung-Ki. The drama series, mixing a healthy dose of Korean melodrama with a Charles Dickens' “Great Expectations” like storyline, captured the attention of Koreans throughout the summer of 2009. “Brilliant Legacy”regularly received ratings in excess of 40% and catapulted Han Hyo-Joo as one of the more popular young actresses in Korea. With her popularity, media reports and gossip magazines began to speculate on who Han Hyo-Joo was dating.  In 2010, Han Hyo-Joo branched out of her comfort zone and took the lead role in the MBC historical drama series “Dong Yi”.",
        "birthday": "1987-02-22",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 240145,
        "imdb_id": "nm2174122",
        "known_for_department": "Acting",
        "name": "Han Hyo-joo",
        "place_of_birth": "Cheongju, North Chungcheong, South Korea",
        "popularity": 0.9336,
        "profile_path": "/4E7NuJsR7AnMYAefFSHkj4cftdf.jpg"
    }
}