{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/v4YV4ne1nwNni35iz4WmpZRZpCD.jpg",
                "genre_ids": [
                    28,
                    18,
                    36
                ],
                "id": 724495,
                "original_language": "en",
                "original_title": "The Woman King",
                "overview": "The story of the Agojie, the all-female unit of warriors who protected the African Kingdom of Dahomey in the 1800s with skills and a fierceness unlike anything the world has ever seen, and General Nanisca as she trains the next generation of recruits and readies them for battle against an enemy determined to destroy their way of life.",
                "popularity": 24.7701,
                "poster_path": "/438QXt1E3WJWb3PqNniK0tAE5c1.jpg",
                "release_date": "2022-09-16",
                "title": "The Woman King",
                "video": false,
                "vote_average": 7.643,
                "vote_count": 2227,
                "character": "Esi",
                "credit_id": "63bb10b6aede590094944b89",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/dq18nCTTLpy9PmtzZI6Y2yAgdw5.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 497698,
                "original_language": "en",
                "original_title": "Black Widow",
                "overview": "Natasha Romanoff, also known as Black Widow, confronts the darker parts of her ledger when a dangerous conspiracy with ties to her past arises. Pursued by a force that will stop at nothing to bring her down, Natasha must deal with her history as a spy and the broken relationships left in her wake long before she became an Avenger.",
                "popularity": 9.5215,
                "poster_path": "/7JPpIjhD2V0sKyFvhB9khUMa30d.jpg",
                "release_date": "2021-07-07",
                "title": "Black Widow",
                "video": false,
                "vote_average": 7.192,
                "vote_count": 10764,
                "character": "Widow",
                "credit_id": "5d7c1da4d5191f2f513dfb3f",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "The Samurider"
        ],
        "biography": "Shaina West is an actress known for Black Widow (2020).\n\nShaina West is a real life super-hero, with a back-story to rival any Avenger and an alter-ego determined to change the stereotype of black women on screen. After being involved in a motorcycle accident aged just 20, inspired by her passion for Japanese culture and love of Anime, Shaina got out of her plaster-casts and back into the gym. Determined to be strong and fight for what she believed in, through sheer dedication and hard work Shaina taught herself martial arts to be in spirit just like the anime characters that had made her feel heroic, shortly after The Samurider was born. Shaina was discovered by Martin Hancock of the Hancock Agency and later introduced to Paul Byram (Paul Byram Associates) to help establish Shaina as an actor and performer in the television and film industry.",
        "birthday": "1994-08-23",
        "deathday": null,
        "gender": 1,
        "homepage": "https://thesamurider.com",
        "id": 2410230,
        "imdb_id": "nm10964538",
        "known_for_department": "Acting",
        "name": "Shaina West",
        "place_of_birth": "England, UK",
        "popularity": 0.2371,
        "profile_path": "/xZCejrHeHtKQVwbcMeLlLGQs4iQ.jpg"
    }
}