{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uUJp5I4IbzuhdUiEx4R9OAoFpbz.jpg",
                "genre_ids": [
                    27,
                    9648
                ],
                "id": 951491,
                "original_language": "en",
                "original_title": "Saw X",
                "overview": "Between the events of 'Saw' and 'Saw II', a sick and desperate John Kramer travels to Mexico for a risky and experimental medical procedure in hopes of a miracle cure for his cancer, only to discover the entire operation is a scam to defraud the most vulnerable. Armed with a newfound purpose, the infamous serial killer returns to his work, turning the tables on the con artists in his signature visceral way through devious, deranged, and ingenious traps.",
                "popularity": 5.3106,
                "poster_path": "/u7Lp1Hi8aBS73jv4KRMIv5aK4ax.jpg",
                "release_date": "2023-09-27",
                "title": "Saw X",
                "video": false,
                "vote_average": 7.206,
                "vote_count": 2188,
                "character": "Diego",
                "credit_id": "639d96a9be6d88007f172a76",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Joshua Ernesto Okamoto Brambila"
        ],
        "biography": "Joshua Okamoto is a Japanese-born Mexican actor graduated from the Acting and Performing Arts Career at CasAzul Argos (2015-2018). Since he was a child he used to watch the rehearsals of his mother, Elizabeth Brambila Barba, a renowned theater actress. His younger brother, Yojath Alejandro Okamoto Brambila, is also an actor.\n\nBorn July 17, 1995 in Saitama (Japan) to a Japanese father and Mexican mother. Okamoto lived in Japan until he was 3 years old meanwhile his mother was working as a theater actress and translator. He moved with his family to Guadalajara, (Mexico), where he grew up and was registrated in as Mexican under the name of Joshua Ernesto Okamoto Brambila. His mother, the theater actress Elizabeth 'Liz' Brambila, introduced him to the world of acting, having to accompany her to her theater rehearsals since he was a child. He studied acting at CasAzul Artes Escénicas Argos in Tlalnepantla de Baz, Estado de México.  In theater he has participated in the stagings: \"41 Detonaciones contra la puerta de un Clóset\" (2019) under the direction of Martín Acosta, dramaturgy by David Gaitán and Sara Pinedo, at Teatro el Milagro (2019); \"Quiero Volverme Supernova\" (2019) at Foro Lucerna del Teatro Milán directed by Alonso Iñiguez, written by Joserra Zúñiga; \"Décimo Primera Noche de Combate\" (2019) dramaturgy by Artús Chávez, at Teatro de la Ciudad Esperanza Iris.\n\nHe also presented a collective creation at Foro 37, under the direction of Mariana Granados, called \"Hombres\" (2018). She was part of \"Musas Huérfanas\" (2017) under the direction of Viridiana Olvera.\n\nIn television he was part of \"Yo soy Yo\" (first Season) produced by Canal Once, \"Narcos\" (Fourth Season) produced by Netflix with the character \"Manuel\" and will soon premiere \"El Club\" series produced by Argos also for the Netflix platform.\n\nIn film, he has participated in the following feature films: \"Club de los Insomnes\" directed by Sergio Goyri Jr. and José Eduardo Giordano and \"Con olor a Guanajuato\" directed by Alejandro Sánchez. He will join to the Saw Franchise in  Saw X (2023) as Dr. Diego, directed by Kevin Greutert.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2412563,
        "imdb_id": "nm9785578",
        "known_for_department": "Acting",
        "name": "Joshua Okamoto",
        "place_of_birth": "Saitama, Japan",
        "popularity": 0.1894,
        "profile_path": "/v0sfdrxVzZ6vWNjZFsotscaU8Et.jpg"
    }
}