{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/29mZ5bR5m2w3xuvwJH7BHMFQQwH.jpg",
                "genre_ids": [
                    10749,
                    18
                ],
                "id": 664413,
                "original_language": "pl",
                "original_title": "365 dni",
                "overview": "A woman falls victim to a dominant mafia boss, who imprisons her and gives her one year to fall in love with him.",
                "popularity": 4.7839,
                "poster_path": "/6KwrHucIE3CvNT7kTm2MAlZ4fYF.jpg",
                "release_date": "2020-02-07",
                "title": "365 Days",
                "video": false,
                "vote_average": 7.011,
                "vote_count": 9273,
                "character": "Karolina",
                "credit_id": "5edeadd5aad9c2002028ba6d",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Natalia Magdalena Janoszek"
        ],
        "biography": "Natalia Magdalena Janoszek is a Polish television personality, actress, and singer, known for her diverse career spanning various entertainment platforms. Born in Bielsko-Biala, Poland, UK.Janoszek graduated from her hometown's Nicolaus Copernicus 1st General Secondary School.\n\nShe gained initial recognition through her participation in numerous beauty pageants, representing Poland internationally. Her successful pageant career led to opportunities in the entertainment industry.\n\nJanoszek's acting career took her to India, where she experienced the world of Bollywood firsthand. Her experiences are documented in her book, \"Behind the Scenes of Bollywood.\" She has acted in both Indian and Polish films, as well as television shows. Beyond acting, Janoszek has showcased her talents on various Polish television programs. She has competed in popular shows like \"Dancing with the Stars\" and \"Your Face Sounds Familiar,\" demonstrating her versatility as a performer.\n\nJanoszek has ventured into the music industry, making her singing debut during a New Year's Eve concert. She has also been involved in politics, running for the Bielsko-Biala City Council in 2014. She gained bigger recognition with a lead role in the drama \"Chicken Curry Law\". The story throws light on the severe social problem of women's safety and depicts the law fight of a foreigner, against corruption. In 2020 she appeared in the Netflix production \"365 Days\" and the Hollywood comedy \"The Swing of Things\" next to Luke Wilson. In 2022 she was on the Polish version of Dancing with the Stars and in 2023 Your Face Sounds Familiar TV shows.\n\nIn summary, Natalia Magdalena Janoszek is a multifaceted entertainer with a diverse career encompassing acting, singing, dancing, and television appearances. Her journey has been marked by both successes and challenges, solidifying her status as a prominent figure in Polish entertainment.\n\nTMDB mini biography by: Ashvin Borad",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 2422425,
        "imdb_id": "nm5361849",
        "known_for_department": "Acting",
        "name": "Natalia Janoszek",
        "place_of_birth": "Bielsko-Biala, Slaskie, Poland",
        "popularity": 0.6816,
        "profile_path": "/6siewETlitj18fcmUqojyyf8qDz.jpg"
    }
}