{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3fChciF2G1wXHsyTfJD9y7uN6Il.jpg",
                "genre_ids": [
                    27,
                    18,
                    14
                ],
                "id": 628,
                "original_language": "en",
                "original_title": "Interview with the Vampire",
                "overview": "A vampire relates his epic life story of love, betrayal, loneliness, and dark hunger to an over-curious reporter.",
                "popularity": 7.1751,
                "poster_path": "/2162lAT2MP36MyJd2sttmj5du5T.jpg",
                "release_date": "1994-11-11",
                "title": "Interview with the Vampire",
                "video": false,
                "vote_average": 7.382,
                "vote_count": 6110,
                "character": "Estelle",
                "credit_id": "5767fee89251410931000302",
                "order": 33
            },
            {
                "adult": false,
                "backdrop_path": "/2Mlw0JRNZHXLYxbeJ0LmiCCTiok.jpg",
                "genre_ids": [
                    14,
                    18
                ],
                "id": 34647,
                "original_language": "en",
                "original_title": "Enter the Void",
                "overview": "This psychedelic tour of life after death is seen entirely from the point of view of Oscar, a young American drug dealer and addict living in Tokyo with his prostitute sister, Linda. When Oscar is killed by police during a bust gone bad, his spirit journeys from the past -- where he sees his parents before their deaths -- to the present -- where he witnesses his own autopsy -- and then to the future, where he looks out for his sister from beyond the grave.",
                "popularity": 4.137,
                "poster_path": "/krKnsfvSJM1PL40tLicRhVQ6kuG.jpg",
                "release_date": "2010-05-05",
                "title": "Enter the Void",
                "video": false,
                "vote_average": 7.304,
                "vote_count": 1887,
                "character": "Suzy",
                "credit_id": "5ca93836c3a3683f54602309",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Sara Stockbridge (born Sarah Jane Stockbridge on 14 November 1965 in Woking, Surrey, England)  is an English model and actress who achieved a certain level of high fashion notoriety in the mid to late 1980s as the muse of designer Vivenne Westwood. Bleached blonde and green-eyed, she epitomized Westwood's obsession with Royal style at the time, often seen out in a velvet and tweed crown based on the one Queen Elizabeth II wears. Stockbridge's naughty take on Marilyn Monroe, with smudged red lipstick, hair worn up in pin-curls, tight sweaters and heels was one of the iconic 'looks' of the late 80s. She was featured on the cover of i-d magazine and Blitz magazine among others, though she was never fully embraced by the more mainstream high-fashion world. Her modelling career was cut short by the birth of her son, Max, in 1990. She has a daughter named Lelu. Her children have different fathers. Sara's father was a civil engineer. Sara and her brother spent their early childhood with their family living in Trinidad, Bahrain, and Peru before returning to Woking in the late 1970s. Sara modelled as Tank Girl for a series of promotional photos to help her gain the part of Tank Girl in the movie of the same name. Although she was unsuccessful in getting the part, the photos themselves became well known and for a time they were seen on the covers of magazines such as ELLE, Vogue and The Face. She appeared as a shorn headed dominatrix in the British comedy film U.F.O. In the film Oh Marbella! she plays the rich wife of a businessman at a nude resort in Spain, quite unlike her real self she has claimed in trailers. Stockbridge is still active in the modelling / acting world, and recently she returned for appearances on Westwood's runways, and in British Vogue as her muse. Her first novel Hammer was published in 2009, and has been given a contract to write another book.\n\nDescription above from the Wikipedia article Sara Stockbridge,  licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1965-11-14",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 24241,
        "imdb_id": "nm0830767",
        "known_for_department": "Acting",
        "name": "Sara Stockbridge",
        "place_of_birth": "Woking, Surrey, England, UK.",
        "popularity": 0.0764,
        "profile_path": "/rIZ1FAagg0cvmPUhWUJZWCLnTwB.jpg"
    }
}