{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6MKr3KgOLmzOP6MSuZERO41Lpkt.jpg",
                "genre_ids": [
                    35,
                    80,
                    12
                ],
                "id": 337404,
                "original_language": "en",
                "original_title": "Cruella",
                "overview": "In 1970s London amidst the punk rock revolution, a young grifter named Estella is determined to make a name for herself with her designs. She befriends a pair of young thieves who appreciate her appetite for mischief, and together they are able to build a life for themselves on the London streets. One day, Estella’s flair for fashion catches the eye of the Baroness von Hellman, a fashion legend who is devastatingly chic and terrifyingly haute. But their relationship sets in motion a course of events and revelations that will cause Estella to embrace her wicked side and become the raucous, fashionable and revenge-bent Cruella.",
                "popularity": 11.2552,
                "poster_path": "/hjS9mH8KvRiGHgjk6VUZH7OT0Ng.jpg",
                "release_date": "2021-05-26",
                "title": "Cruella",
                "video": false,
                "vote_average": 7.987,
                "vote_count": 9719,
                "character": "Restaurant Valet",
                "credit_id": "60b261b8c49048002a0f3c2a",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Jack is a New Zealand based Actor. He is known for his work in AMC's The Making of the Mob: Chicago, South Pacific Pictures Shortland Street as Tank Reid, and NZ Screentime's In A Flash.\n\nJack attended Te Kura Toi Whakaari o Aotearoa: NZ Drama School, graduating with a Bachelor of Performing Arts, majoring in acting for stage and screen in November 2015.\n\nJack is travels between NZ and LA and is represented by Johnson & Laird Management.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://johnsonlaird.com/our-actors/Jack-Barry",
        "id": 2426997,
        "imdb_id": "nm6517268",
        "known_for_department": "Acting",
        "name": "Jack Barry",
        "place_of_birth": null,
        "popularity": 0.0932,
        "profile_path": "/A1YjxMNVt3LWcIRrAb3RW2WEc2q.jpg"
    }
}