{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6IFTmhNh9kmwd5ix53OdlSphPYl.jpg",
                "genre_ids": [
                    35,
                    80
                ],
                "id": 623,
                "original_language": "en",
                "original_title": "A Fish Called Wanda",
                "overview": "While a diamond advocate attempts to steal a collection of diamonds, troubles arise when he realises he’s not the only one after the collection.",
                "popularity": 5.4089,
                "poster_path": "/hkSGFNVfEEUXFCxRZDITFHVhUlu.jpg",
                "release_date": "1988-07-15",
                "title": "A Fish Called Wanda",
                "video": false,
                "vote_average": 7.204,
                "vote_count": 2298,
                "character": "Bartlett",
                "credit_id": "597e1f729251415d8d01b2dc",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Kenneth Campbell"
        ],
        "biography": "Kenneth Victor Campbell (10 December 1941 – 31 August 2008) was an English writer, actor, director and comedian known for his work in experimental theatre.He has been called \"a one-man dynamo of British theatre.\"  \n\nCampbell achieved notoriety in the 1970s for his nine-hour adaptation of the science-fiction trilogy Illuminatus! and his 22-hour staging of Neil Oram's play cycle The Warp. The Guinness Book of Records listed the latter as the longest play in the world.  The Independent said that, \"In the 1990s, through a series of sprawling monologues packed with arcane information and freakish speculations on the nature of reality, he became something approaching a grand old man of the fringe, though without ever discarding his inner enfant terrible.\"  The Times labelled Campbell a one-man whirlwind of comic and surreal performance.  The Guardian, in a posthumous tribute, judged him to be \"one of the most original and unclassifiable talents in the British theatre of the past half-century. A genius at producing shows on a shoestring and honing the improvisational capabilities of the actors who were brave enough to work with him.\"   The artistic director of the Liverpool Everyman and Playhouse said, \"He was the door through which many hundreds of kindred souls entered a madder, braver, brighter, funnier and more complex universe.\"  ",
        "birthday": "1941-12-10",
        "deathday": "2008-08-31",
        "gender": 2,
        "homepage": null,
        "id": 24271,
        "imdb_id": "nm0132631",
        "known_for_department": "Acting",
        "name": "Ken Campbell",
        "place_of_birth": "Ilford, Essex, England, UK",
        "popularity": 0.1881,
        "profile_path": "/vnDf7qSyuZ5EsVPKNNeocvnA0Qo.jpg"
    }
}