{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4VgyburZo88ocO1aSRFm0i5H5VX.jpg",
                "genre_ids": [
                    35
                ],
                "id": 760,
                "original_language": "fr",
                "original_title": "Les Aventures de Rabbi Jacob",
                "overview": "In this riot of frantic disguises and mistaken identities, Victor Pivert, a blustering, bigoted French factory owner, finds himself taken hostage by Slimane, an Arab rebel leader. The two dress up as rabbis as they try to elude not only assasins from Slimane's country, but also the police, who think Pivert is a murderer. Pivert ends up posing as Rabbi Jacob, a beloved figure who's returned to France for his first visit after 30 years in the United States. Adding to the confusion are Pivert's dentist-wife, who thinks her husband is leaving her for another woman, their daughter, who's about to get married, and a Parisian neighborhood filled with people eager to celebrate the return of Rabbi Jacob.",
                "popularity": 2.62,
                "poster_path": "/oYuCFxS2BGCHNGuv9No0GoP2DZf.jpg",
                "release_date": "1973-10-17",
                "title": "The Mad Adventures of Rabbi Jacob",
                "video": false,
                "vote_average": 7.401,
                "vote_count": 1012,
                "character": "Pump attendant",
                "credit_id": "5962ade09251410a590dd4e2",
                "order": 15
            },
            {
                "adult": false,
                "backdrop_path": "/mSwyH7ix20lqdKmPx7682gALwGu.jpg",
                "genre_ids": [
                    35
                ],
                "id": 4727,
                "original_language": "fr",
                "original_title": "Le Gendarme de Saint-Tropez",
                "overview": "The ambitious police officer Cruchot is transferred to St. Tropez. He's struggling with crimes such as persistent nude swimming, but even more with his teenage daughter, who's trying to impress her rich friends by telling them her father was a millionaire and owned a yacht in the harbor.",
                "popularity": 1.6983,
                "poster_path": "/6510K6Y8eYLf9FJ7O4xaOnwhn2u.jpg",
                "release_date": "1964-09-08",
                "title": "Le Gendarme de Saint-Tropez",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 893,
                "character": "Prince's advisor (uncredited)",
                "credit_id": "5e125f278741c400173ce85a",
                "order": 30
            },
            {
                "adult": false,
                "backdrop_path": "/qodtpClU5xHfaTjQBPnt37OGRBd.jpg",
                "genre_ids": [
                    35
                ],
                "id": 761,
                "original_language": "fr",
                "original_title": "L'Aile ou la Cuisse",
                "overview": "Charles Duchemin, a well-known gourmet and publisher of a famous restaurant guide, is waging a war against fast food entrepreneur Tri- catel to save the French art of cooking. After having agreed to appear on a talk show to show his skills in naming food and wine by taste, he is confronted with two disasters: his son wants to become a clown rather than a restaurant tester and he, the famous Charles Duchemin, has lost his taste!",
                "popularity": 2.8995,
                "poster_path": "/ywkIu5l3iAgPZvLFEVBDYxLouH8.jpg",
                "release_date": "1976-10-27",
                "title": "The Wing or the Thigh?",
                "video": false,
                "vote_average": 7.205,
                "vote_count": 926,
                "character": "Baggage Handler",
                "credit_id": "5e883fb36dc6c00013815e8f",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Paolo Bisciglia",
            "Paul Bissiglia "
        ],
        "biography": "Paul Bisciglia (30 July 1928 – 18 April 2010) was a French film actor.\n\nThroughout his acting career, Bisciglia appeared in more than one-hundred feature films. He made his debut in the 1950 film Trois télégrammes. What followed was several uncredited roles, before landing a much larger part in drama Clara de Montargis. During the fifties, he appeared in many drama films, including the award-winning Avant le déluge, with Antoine Balpêtré, and again several more uncredited roles. During the sixties, Bisciglia began to appear more frequently in television series and television films, although he was included in many films such as The Wretches, with Michèle Morgan, Les vieux de la vieille, with Pierre Fresnay, Paris nous appartient, Le signe du lion, and in 1966, he appeared in his first leading role in Alain Cuniot's L'or et le plomb.\n\nIn 1969, Bisciglia had a small role in the horror film La vampire nue, the second feature film from director Jean Rollin. It was Bisciglia's first of several times working with Rollin. He worked with the director again in the successful films Requiem pour un vampire, with Marie-Pierre Castel and Mireille D'Argent, Les démoniaques, Lèvres de sang, and the zombie classic Les Raisins de la Mort, with Marie-Georges Pascal.\n\nHis career continued through the seventies and eighties, such as the Golden Globe-nominated Les aventures de Rabbi Jacob, Club privé pour couples avertis, with Philippe Gasté of Jean Rollin's Requiem pour un vampire, Verdict, with Sophia Loren, L'aile ou la cuisse, Family Rock, and he voiced in three animated films Astérix et la surprise de César (Asterix vs. Caesar), Astérix chez les Bretons (Asterix in Britain) and Astérix et le coup du menhir (Asterix and the Big Fight). Bisciglia's acting career continued until 1999, during which he appeared in two final feature films, Profil bas and Montana Blues.\n\nBisciglia also had a successful television career appearing in a number of television series and films. He made his first appearance in the 1957 television film L'équipage au complet. His television films include Elle s'abaisse pour vaincre, Les fiancés de Loches, Claudine à Paris and the television film remeke Les liaisons dangereuses. His television series credits include Le théâtre de la jeunesse, Rocambole, Les saintes chéries, Schulmeister, espion de l'empereur, Les brigades du Tigre, De mémoire d'homme, Les cinq dernières minutes, Désiré Lafarge, Commissaire Moulin, Les enquêtes du commissaire Maigret and Julien Fontanes, magistrat.\n\nSource: Article \"Paul Bisciglia\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1928-07-30",
        "deathday": "2010-04-18",
        "gender": 2,
        "homepage": null,
        "id": 24303,
        "imdb_id": "nm0083910",
        "known_for_department": "Acting",
        "name": "Paul Bisciglia",
        "place_of_birth": "Algiers, Alger, France [now Algeria]",
        "popularity": 0.0696,
        "profile_path": "/rRpleKwfHaT1plFAPkZ9B9rlIt9.jpg"
    }
}