{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fzJgCQh2NBnUYlms8EGyr4bPNz3.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 900,
                "original_language": "en",
                "original_title": "Bringing Up Baby",
                "overview": "David Huxley is waiting to get a bone he needs for his museum collection. Through a series of strange circumstances, he meets Susan Vance, and the duo have a series of misadventures which include a leopard called Baby.",
                "popularity": 3.6146,
                "poster_path": "/vTNNOtemaYmtx3k2NpsLMRJKEwZ.jpg",
                "release_date": "1938-02-18",
                "title": "Bringing Up Baby",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 1022,
                "character": "Horace Applegate",
                "credit_id": "52fe428ac3a36847f8026b51",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Charlie Ruggles",
            "Charles Sherman Ruggles"
        ],
        "biography": "Charles Ruggles had one of the longest careers in Hollywood, lasting more than 60 years and encompassing more than 100 films. He made his film debut in 1914 in The Patchwork Girl of Oz (1914) and worked steadily after that. He was memorably paired with Mary Boland in a series of comedies in the early 1930s, and was one of the standouts in the all-star comedy If I Had a Million (1932), as a harried, much-put-upon man who finally goes berserk in a china shop. Ruggles' slight stature and distinctive mannerisms - his fluttery, jumpy manner of speaking, his often befuddled look whenever events seemed about to overwhelm him, which was often - endeared him to generations of moviegoers. Memorable as Maj. Applegate the big-game hunter in the classic screwball comedy Bringing Up Baby (1938). Many will remember him as the narrator of the \"Aesop's Fables\" segment of the animated cartoon The Bullwinkle Show (1961). He was the brother of director Wesley Ruggles.",
        "birthday": "1886-02-08",
        "deathday": "1970-12-23",
        "gender": 2,
        "homepage": null,
        "id": 2436,
        "imdb_id": "nm0749476",
        "known_for_department": "Acting",
        "name": "Charles Ruggles",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.2889,
        "profile_path": "/auirQUnJ5kKBTl2p6kHtkJBNeo1.jpg"
    }
}