{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/h0jlcOISKcrVG4IE4p5IyZGrMhn.jpg",
                "genre_ids": [
                    35,
                    80
                ],
                "id": 212,
                "original_language": "en",
                "original_title": "Arsenic and Old Lace",
                "overview": "Mortimer Brewster, a newspaper drama critic, playwright, and author known for his diatribes against marriage, suddenly falls in love and gets married;  but when he makes a quick trip home to tell his two maiden aunts, he finds out his aunts' hobby - killing lonely old men and burying them in the cellar!",
                "popularity": 1.4542,
                "poster_path": "/xG1GEEQGgExKl0WT5sRo1Arst5D.jpg",
                "release_date": "1944-09-01",
                "title": "Arsenic and Old Lace",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 985,
                "character": "Mr. Witherspoon",
                "credit_id": "52fe4227c3a36847f8008133",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/wSiBXaJ2PtlxUGH2waIxQZjFPhg.jpg",
                "genre_ids": [
                    28,
                    12,
                    35,
                    80
                ],
                "id": 11576,
                "original_language": "en",
                "original_title": "It's a Mad, Mad, Mad, Mad World",
                "overview": "A group of strangers come across a man dying after a car crash who proceeds to tell them about the $350,000 he buried in California. What follows is the madcap adventures of those strangers as each attempts to claim the prize for himself.",
                "popularity": 8.0596,
                "poster_path": "/j4mWzOisSHFkaqIkq34l2mm8a5K.jpg",
                "release_date": "1963-11-07",
                "title": "It's a Mad, Mad, Mad, Mad World",
                "video": false,
                "vote_average": 6.97,
                "vote_count": 637,
                "character": "Mr. Dinckler",
                "credit_id": "52fe445f9251416c75032709",
                "order": 30
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "E.E. Horton",
            "Edward Horton",
            "Edward Everett Horton Jr."
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nEdward Everett Horton Jr. (March 18, 1886 – September 29, 1970) was an American character actor. He had a long career in film, theater, radio, television, and voice work for animated cartoons.  Horton began his stage career in 1906, singing and dancing and playing small parts in vaudeville and in Broadway productions. In 1919, he moved to Los Angeles, California, where he began acting in Hollywood films. His first starring role was in the comedy Too Much Business (1922), but he portrayed the lead role of an idealistic young classical composer in the drama Beggar on Horseback (1925). In the late 1920s, he starred in two-reel silent comedies for Educational Pictures, and made the transition to talking pictures with Educational in 1929. As a stage-trained performer, he found more film work easily, and appeared in some of Warner Bros.' early talkies, including The Terror (1928) and Sonny Boy (1929).\n\nHorton initially used his given name, Edward Horton, professionally. His father persuaded him to adopt his full name professionally, reasoning that other actors might be named Edward Horton, but only one named Edward Everett Horton. Horton soon cultivated his own special variation of the time-honored double take (an actor's reaction to something, followed by a delayed, more extreme reaction). In Horton's version, he would smile ingratiatingly and nod in agreement with what just happened; then, when realization set in, his facial features collapsed entirely into a sober, troubled mask.\n\nHorton starred in many comedy features in the 1930s, usually playing a mousy fellow who put up with domestic or professional problems to a certain point, and then finally asserted himself for a happy ending. He is best known, however, for his work as a character actor in supporting roles. These include The Front Page (1931), Trouble in Paradise (1932), Alice in Wonderland (1933), The Gay Divorcee (1934, the first of several Astaire/Rogers films in which Horton appeared), Top Hat (1935), Danger - Love at Work (1937), Lost Horizon (1937), Holiday (1938), Here Comes Mr. Jordan (1941), Arsenic and Old Lace (1944), Pocketful of Miracles (1961), It's a Mad, Mad, Mad, Mad World (1963), and Sex and the Single Girl (1964). His last role was in the comedy film Cold Turkey (1971), in which his character communicated only through facial expressions.",
        "birthday": "1886-03-17",
        "deathday": "1970-09-29",
        "gender": 2,
        "homepage": null,
        "id": 2437,
        "imdb_id": "nm0002143",
        "known_for_department": "Acting",
        "name": "Edward Everett Horton",
        "place_of_birth": "Brooklyn, New York City, New York, USA",
        "popularity": 0.2736,
        "profile_path": "/wtoC3cXLStuYmiEUVQavdvbh5Js.jpg"
    }
}