{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/k6xQZq2jkA7xRpvyy2kLWprFwIN.jpg",
                "genre_ids": [
                    18,
                    53,
                    878
                ],
                "id": 1902,
                "original_language": "es",
                "original_title": "Abre los ojos",
                "overview": "Handsome 25-year-old Cesar had it all -- a successful career, expensive cars, a swank bachelor's pad, and an endless string of beautiful and willing women -- until he is thrown into a strange psychological mystery after a car accident scars his face and lands him in prison.",
                "popularity": 3.4655,
                "poster_path": "/orjSy9xEGI9jxrtodACH04gANmF.jpg",
                "release_date": "1997-12-19",
                "title": "Open Your Eyes",
                "video": false,
                "vote_average": 7.46,
                "vote_count": 1115,
                "character": "Duvernois",
                "credit_id": "52fe4320c3a36847f803c2cd",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/yYUGy4MDM6jbJoamlfo3HT6Guhy.jpg",
                "genre_ids": [
                    80,
                    53,
                    18
                ],
                "id": 11826,
                "original_language": "en",
                "original_title": "Sexy Beast",
                "overview": "Ex-safecracker Gal Dove has served his time behind bars and is blissfully retired to a Spanish villa paradise with a wife he adores. The idyll is shattered by the arrival of his nemesis Don Logan, intent on persuading Gal to return to London for one last big job.",
                "popularity": 1.3508,
                "poster_path": "/xTfCZTzhgHNAR1pf5D49WH4buI5.jpg",
                "release_date": "2000-09-13",
                "title": "Sexy Beast",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 829,
                "character": "Spanish Official",
                "credit_id": "59da15dd92514125140412bb",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "G. Barray",
            "Gerard Barray",
            "Жерар Баррэ",
            "Gérard Marcel Louis Baraillé"
        ],
        "biography": "Gérard Barray (born 2 November 1931 in Toulouse) is a French actor.\n\nBarray's parents split up quickly and his mother, who came from Montauban decided to return to her hometown with her little boy. Around the age of 15, he discovered a passion for jazz; he participated in a few shows in nightclubs while pursuing his studies and obtained a bachelor's degree at the Faculty of Toulouse. Camille Ricard, an actress and teacher at the Conservatory of Toulouse, who advised him to go to Paris with a letter of recommendation for a friend, Noel Roquevert. Barray enrolled at the Cours Simon, a drama school in Paris. Four years later, Gérard Barray won the Jury  It will then excel in the roles of knights with a big heart. He starred as D'Artagnan, Pardaillan, Surcouf and Scaramouche. In total there practice gender in a dozen feature films, most of which are box-office success, widely known abroad. Besides films swashbuckling as Pardaillan and Scaramouche and adventure films like Surcouf, Barray turned police commissioner in two San Antonio movies. In 1969, he starred beside young actress Claude Jade in \"The Witness\". He played Van Britten, a mysterious museum curator who seduces a young English teacher. It was his last major role.\n\nFor Claude Berri he played in Le Cinéma de papa (1970) as Richard, a super star and rather temperamental actor. His comeback in 1997 was in Alejandro Amenabar's \"Abre los ojos\" as Devernois, a TV man.\n\nGérard Barray was appointed an Officer in the Order of Arts and Letters in January 2010.\n\nSource: Article \"Gérard Barray\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1931-11-02",
        "deathday": "2024-02-14",
        "gender": 2,
        "homepage": null,
        "id": 24404,
        "imdb_id": "nm0056768",
        "known_for_department": "Acting",
        "name": "Gérard Barray",
        "place_of_birth": "Toulouse, Haute-Garonne, France",
        "popularity": 0.8568,
        "profile_path": "/mkdYGZprcyfiWxZniSYCcRwh4iu.jpg"
    }
}