{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sp99ZzKz6Zv7nX95XDJmhNA4LVI.jpg",
                "genre_ids": [
                    35,
                    18,
                    9648
                ],
                "id": 975773,
                "original_language": "en",
                "original_title": "Wicked Little Letters",
                "overview": "When the denizens of Littlehampton – including conservative Edith – begin receiving letters full of hilarious profanities, rowdy Irish migrant Rose is charged with the crime. Suspecting something amiss, the town's women band together to investigate.",
                "popularity": 3.2315,
                "poster_path": "/scAU7YudKNVeZlOfgSEWntAUSJ.jpg",
                "release_date": "2024-02-23",
                "title": "Wicked Little Letters",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 548,
                "character": "Nancy Gooding",
                "credit_id": "6335be8b2cde9800927dcf3b",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "アリーシャ・ウィアー",
            "آلیشا ویر"
        ],
        "biography": "Alisha Weir (born on September 26, 2009) is an  Irish actress and singer. She grew up in the South Dublin suburb of Knocklyon, where her passion for the arts blossomed at a young age. Inspired by her older sisters' drama classes, she joined in on the fun and soon discovered her own talent for acting.\n\nAlisha cut her teeth on stage, appearing in productions like \"Once\" at Dublin's Olympia Theatre. Her captivating stage presence even landed her a spot on Ireland's popular \"The Late Late Toy Show,\" where she wowed audiences with a rendition of Justin Timberlake's \"True Colors.\"\n\nHer big break came in 2018 when she made her feature film debut in the thriller \"Don't Leave Home,\" quickly followed by a role in the crime drama \"Darklands.\" At just 11 years old, Alisha was cast in the coveted role of Matilda Wormwood in the film adaptation of the hit musical \"Matilda.\" Her star continued to rise when she portrayed the titular lead in the 2024 horror film \"Abigail,\" and she will portray Dorthy in the 2025 musical film \"Wicked: For Good.\"",
        "birthday": "2009-09-26",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 2442117,
        "imdb_id": "nm10341836",
        "known_for_department": "Acting",
        "name": "Alisha Weir",
        "place_of_birth": "Dublin, Ireland",
        "popularity": 0.5655,
        "profile_path": "/3Qzc4J3zFPw8BGtj0O91Bdutzo1.jpg"
    }
}