{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mApegAM7DCZvsKVfWAtavubycMU.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749
                ],
                "id": 40794,
                "original_language": "it",
                "original_title": "Mine vaganti",
                "overview": "Tommaso is the youngest son of the Cantones, a large, traditional southern Italian family operating a pasta-making business since the 1960s. On a trip home from Rome, where he studies literature and lives with his boyfriend, Tommaso decides to tell his parents the truth about himself. But when he is finally ready to come out in front of the entire family, his older brother Antonio ruins his plans.",
                "popularity": 1.3069,
                "poster_path": "/gYSXvD0sB2MRXF5YreSWtdcW4Jv.jpg",
                "release_date": "2010-02-12",
                "title": "Loose Cannons",
                "video": false,
                "vote_average": 7.272,
                "vote_count": 795,
                "character": "La nonna",
                "credit_id": "52fe45a3c3a36847f80d2395",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Isabella Redi"
        ],
        "biography": "Ilaria Occhini (28 March 1934 – 20 July 2019) was an Italian stage, television and film actress. She appeared in more than 30 films.\n\nBorn in Florence, niece and daughter of novelists, Occhini started her film career at 19 with the Luciano Emmer's comedy film Terza Liceo with the stage name Isabella Redi, then attended the Accademia d'Arte Drammatica in Rome, graduating in 1957. The same year she back to acting with Mario Monicelli's Il medico e lo stregone, and at the same time she debuted on stage with Luchino Visconti's La ragazza delle smirne and had her first leading role in the Anton Giulio Majano's TV series Jane Eyre. In 1959 she appeared in the television adaptation The Vicar of Wakefield.\n\nHer mother, Gioconda Papini (1910-1954), was one of the two daughters of writer Giovanni Papini and his wife Giacinta Giovagnoli, the other being writer Viola Paszkowski Papini. Her father was writer, art historian and journalist Barna Occhini (pseudonym of Carlo Luigi Occhini) (1905-1978), the son of senator Pier Ludovico Occhini and his wife Maria Luisa Tettamanzi.\n\nOcchini obtained her major successes on stage, working several times with Luchino Visconti, then joining the Piccolo Teatro of Naples, where she received large critical appreciation by interpreting classical and contemporary authors. She was also a constant presence of RAI television series, and also starred in many films, but rarely in leading roles.\n\nIn 1992 Occhini won the Nastro d'Argento for best supporting role for her performance in Benvenuti in Casa Gori. In 2008 she was awarded Best Actress at the Locarno International Film Festival for her role in Mar Nero. In 2010 she won a David di Donatello for Best Supporting Actress for her role in Loose Cannons; the same year she was awarded with a special Nastro d'Argento for her career.\n\nShe married screenwriter and author Raffaele La Capria, with whom she had a daughter, Alexandra.\n\nSource: Article \"Ilaria Occhini\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1934-03-28",
        "deathday": "2019-07-20",
        "gender": 1,
        "homepage": null,
        "id": 24424,
        "imdb_id": "nm0643642",
        "known_for_department": "Acting",
        "name": "Ilaria Occhini",
        "place_of_birth": "Florence, Italy",
        "popularity": 0.1529,
        "profile_path": "/mwcr03O81GDEdSKLW7Nm9rR11An.jpg"
    }
}