{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rStbi6Sm1JWk4S3pCqULUY7GMDB.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 506528,
                "original_language": "en",
                "original_title": "Harriet",
                "overview": "The extraordinary tale of Harriet Tubman's escape from slavery and transformation into one of America's greatest heroes. Her courage, ingenuity and tenacity freed hundreds of slaves and changed the course of history.",
                "popularity": 3.9938,
                "poster_path": "/rsUs58bDqpJJxZSOebZOMN9gzw2.jpg",
                "release_date": "2019-11-01",
                "title": "Harriet",
                "video": false,
                "vote_average": 7.305,
                "vote_count": 861,
                "character": "Anger (8)",
                "credit_id": "63d653d612b10e00851c1408",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/dq18nCTTLpy9PmtzZI6Y2yAgdw5.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 497698,
                "original_language": "en",
                "original_title": "Black Widow",
                "overview": "Natasha Romanoff, also known as Black Widow, confronts the darker parts of her ledger when a dangerous conspiracy with ties to her past arises. Pursued by a force that will stop at nothing to bring her down, Natasha must deal with her history as a spy and the broken relationships left in her wake long before she became an Avenger.",
                "popularity": 9.4013,
                "poster_path": "/7JPpIjhD2V0sKyFvhB9khUMa30d.jpg",
                "release_date": "2021-07-07",
                "title": "Black Widow",
                "video": false,
                "vote_average": 7.191,
                "vote_count": 10767,
                "character": "Street Kid",
                "credit_id": "60ea7400ce5d82005f5f128a",
                "order": 59
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "아리아 브룩스"
        ],
        "biography": "Aria Brooks, a native of Atlanta, follows her passion for performing through the arts. She loves to sing, dance, act and write songs and stories. Her passion for singing and acting has afforded her opportunities to perform with professional theaters, and sing alongside greats such as Jennifer Hudson. She started in musical theatre at the age of 6, and at 10, decided to pursue a career in on-camera acting. She has since been signed to reputable agencies and is best known as a cast member of Nickelodeon's reboot of \"All That\". Aria has also worked alongside Cynthia Erivo in the award-winning film, \"Harriet\" and starred in Dolly Parton's \"Heartstrings\" on Netflix. She can be seen opposite Lisa Kudrow and Joshua Bassett in the Disney+ film, \"Better Nate Than Ever\". You can also catch her in the upcoming season of High School Musical: The Musical: The Series as a recurring guest star.\n\nOutside of her work in the TV/Film industry, Aria is also a recording artist, having released her single \"Am I Next?\" in an effort to speak out about social injustice and to raise awareness about other important issues. She also released her debut music projects, \"castles pt 1\" and \"castles (pt 2)\", where she shares her personal journey through mental health struggles and challenges, as well as her growth and triumphs. Both EPs can be found on all streaming platforms.",
        "birthday": "2006-11-27",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 2443554,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Aria Brooks",
        "place_of_birth": "Atlanta, Georgia, USA",
        "popularity": 0.072,
        "profile_path": "/6mQ0J7DuBuqqBoX8xW6OzS76DZr.jpg"
    }
}