{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/nLLYm9qPtE6WwFSzDOHMUUfytcx.jpg",
                "genre_ids": [
                    35,
                    10402,
                    18
                ],
                "id": 304410,
                "original_language": "fr",
                "original_title": "La Famille Bélier",
                "overview": "The whole Bélier family is deaf, except for sixteen year old Paula who is the important translator in her parents' day to day life especially when it comes to matters concerning the family farm. When her music teacher discovers she has a fantastic singing voice and she gets an opportunity to enter a big Radio France contest the whole family's future is set up for big changes.",
                "popularity": 3.0856,
                "poster_path": "/kAQeZUZ1pMTSjSF3d6eBZClFGgN.jpg",
                "release_date": "2014-12-17",
                "title": "The Bélier Family",
                "video": false,
                "vote_average": 6.933,
                "vote_count": 2405,
                "character": "Fabien Thomasson",
                "credit_id": "546cc5e19251413056001b34",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/vo9MRyCMBAdSqZgkI70AfVg8ISI.jpg",
                "genre_ids": [
                    12,
                    10751,
                    18
                ],
                "id": 754067,
                "original_language": "fr",
                "original_title": "Mystère",
                "overview": "Stéphane decides to move to the beautiful mountains of Cantal in order to reconnect with his 8-year-old daughter, Victoria, who has been silent since her mother's disappearance. During a walk in the forest, a shepherd gives Victoria a puppy named \"Mystery\" who will gradually give her a taste for life. But very quickly, Stéphane discovers that the animal is in reality a wolf… Despite the warnings and the danger of this situation, he cannot bring himself to separate his daughter from this seemingly harmless ball of hair.",
                "popularity": 3.1124,
                "poster_path": "/xXZ4yhyss7DGrp7a1EVHaAStfwr.jpg",
                "release_date": "2021-12-15",
                "title": "Vicky and Her Mystery",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 508,
                "character": "Thierry",
                "credit_id": "5f8a2dd5a13533003613d211",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Éric Elmosnino"
        ],
        "biography": "Éric Elmosnino (born 2 May 1964) is a French actor and musician. He is known internationally for portraying Serge Gainsbourg in Gainsbourg, for which he won the César Award for Best Actor.\n\nHe studied at the National Conservatory of Dramatic Art. After leaving the Conservatory, he worked at the Théâtre Nanterre-Amandiers with Jean-Pierre Vincent.\n\nIn 1992 he played Christian Ribet, a friend of Guillaume de Tonquédec, in the film Tableau d'honneur (Honour Roll) by Charles Nemes. In 2006, he played in the theater as Edward Bond, directed by Alain Francon, at the Avignon Festival and the Théâtre de la Colline in Paris. In January 2008, he performed in a show at the Theatre Antoine in Paris for Yasmina Reza's God of Carnage.\n\nSource: Article \"Éric Elmosnino\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1964-05-02",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 24465,
        "imdb_id": "nm0255475",
        "known_for_department": "Acting",
        "name": "Eric Elmosnino",
        "place_of_birth": "Suresnes, Hauts-de-Seine, France",
        "popularity": 0.2041,
        "profile_path": "/tBiMY94OLEUWbBaH7GJtAZ3TY37.jpg"
    }
}