{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/pZVrDhIPF30JTRSkal2Lfk7NwrI.jpg",
                "genre_ids": [
                    18,
                    27,
                    53
                ],
                "id": 31417,
                "original_language": "fr",
                "original_title": "Les Yeux sans visage",
                "overview": "Dr. Génessier is riddled with guilt after an accident that he caused disfigures the face of his daughter, the once beautiful Christiane, who outsiders believe is dead. Dr. Génessier, along with accomplice and laboratory assistant Louise, kidnaps young women and brings them to the Génessier mansion. After rendering his victims unconscious, Dr. Génessier removes their faces and attempts to graft them on to Christiane's.",
                "popularity": 1.6113,
                "poster_path": "/8y7Z9Gvcq52uOlJlUWyn2epGGRd.jpg",
                "release_date": "1960-01-11",
                "title": "Eyes Without a Face",
                "video": false,
                "vote_average": 7.573,
                "vote_count": 764,
                "character": "Professor Génessier",
                "credit_id": "52fe447c9251416c91012633",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Пьер Брассёр",
            "Пьер Брассер",
            "Pierre-Albert Espinasse"
        ],
        "biography": "Pierre Brasseur, born Pierre-Albert Espinasse (22 December 1905, Paris – 16 August 1972, Bruneck, Italy) was a French actor.\n\nHe was the son of actor Georges Espinasse and actress Germaine Brasseur while the latter was married to Albert Brasseur. His grandfather, Jules Brasseur, was an actor as well. The family tradition of using the name Brasseur was continued by his son Claude and his grandson Alexandre.\n\nRenowned for playing outsized characters, Brasseur is probably best known in the anglophone world for his (semi-fictionalised) portrayal of the actor Frédérick Lemaître in Les Enfants du Paradis (Children of Paradise, 1945) and as Docteur Génessier (more subdued) in the horror film Eyes Without a Face (Les Yeux sans visage, 1960) co-starring with Alida Valli.\n\nOn May 30, 1927, Brasseur performed the spoken role of the Narrator in the world premiere of Igor Stravinsky's opera-oratorio Oedipus rex.\n\nDescription above from the Wikipedia article Pierre Brasseur, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1905-12-22",
        "deathday": "1972-08-16",
        "gender": 2,
        "homepage": null,
        "id": 24476,
        "imdb_id": "nm0105482",
        "known_for_department": "Acting",
        "name": "Pierre Brasseur",
        "place_of_birth": "Paris, France",
        "popularity": 0.3121,
        "profile_path": "/n15deEWYZZrzbaozdGSL9kxl8lI.jpg"
    }
}