{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zQyNGzYD144sbFKrfBP8mFwqDxn.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 6003,
                "original_language": "en",
                "original_title": "Romeo and Juliet",
                "overview": "Romeo Montague and Juliet Capulet fall in love against the wishes of their feuding families. Driven by their passion, the young lovers defy their destiny and elope, only to suffer the ultimate tragedy.",
                "popularity": 2.797,
                "poster_path": "/vaBQKLbSWkXGTOlsz9ARdJP4lvg.jpg",
                "release_date": "1968-04-02",
                "title": "Romeo and Juliet",
                "video": false,
                "vote_average": 7.415,
                "vote_count": 697,
                "character": "Mercutio",
                "credit_id": "52fe4435c3a36847f80889cf",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/7Mnj6if9FUC7yTZaeAgoDNQnnwn.jpg",
                "genre_ids": [
                    18,
                    10752
                ],
                "id": 19067,
                "original_language": "en",
                "original_title": "The Duellists",
                "overview": "In 1800, as Napoleon Bonaparte rises to power in France, a rivalry erupts between Armand and Gabriel, two lieutenants in the French Army, over a perceived insult. For over a decade, they engage in a series of duels amidst larger conflicts, including the failed French invasion of Russia in 1812, and shifts in the political and social systems of Europe.",
                "popularity": 3.5172,
                "poster_path": "/s9sPhcfD4LtrIGwix11bKtl9VLR.jpg",
                "release_date": "1977-08-31",
                "title": "The Duellists",
                "video": false,
                "vote_average": 7.256,
                "vote_count": 584,
                "character": "Amiable Second",
                "credit_id": "52fe47b79251416c750a3251",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "​From Wikipedia, the free encyclopedia\n\nJohn McEnery (1943-2019) was a British actor and writer.\n\nAt age 20 he found his first stage work, spending three seasons with the Everyman Theatre in Liverpool. He joined the British National Theatre Company in 1966. He trained at the Bristol Old Vic Theatre School.\n\nHe starred alongside Claude Jade and Jean-Pierre Cassel in Gérard Brach's bittersweet The Boat on the Grass about a girl between two friends and appeared as Mercutio in Franco Zeffirelli's Romeo and Juliet. He was nominated for a BAFTA for the latter performance. He also appeared in the film Nicholas and Alexandra. In 2008, he appeared in a guest role in Sidetracked, the first episode of Wallander.\n\nIn 1998 he wrote the play Merry Christmas, Mr. Burbage in honour of the 400th anniversary of the creation of the Globe Theatre.\n\nMcEnery is survived by two daughters, Phoebe and Chloe, by his former wife, actress Stephanie Beacham. One of his brothers is actor Peter McEnery, and another is photographer David McEnery.\n\nDescription above from the Wikipedia article John McEnery, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1943-11-01",
        "deathday": "2019-04-12",
        "gender": 2,
        "homepage": null,
        "id": 24498,
        "imdb_id": "nm0568491",
        "known_for_department": "Acting",
        "name": "John McEnery",
        "place_of_birth": "Birmingham, England",
        "popularity": 0.3406,
        "profile_path": "/vzVsCjZlsejxLx65fsHczRfsBJe.jpg"
    }
}