{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/iB1tCWl4MKl6OO1kMBD5LxM5BmJ.jpg",
                "genre_ids": [
                    14,
                    18,
                    9648
                ],
                "id": 14696,
                "original_language": "ja",
                "original_title": "雨月物語",
                "overview": "In 16th century Japan, peasants Genjuro and Tobei sell their earthenware pots to a group of soldiers in a nearby village, in defiance of a local sage's warning against seeking to profit from warfare. Genjuro's pursuit of both riches and the mysterious Lady Wakasa, as well as Tobei's desire to become a samurai, run the risk of destroying both themselves and their wives, Miyagi and Ohama.",
                "popularity": 3.1302,
                "poster_path": "/r8RiuKTIYIJBjczBVsfeP5C00CJ.jpg",
                "release_date": "1953-03-26",
                "title": "Ugetsu",
                "video": false,
                "vote_average": 7.998,
                "vote_count": 611,
                "character": "Miyagi",
                "credit_id": "5e7da214f794ad0011ef973a",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "다나카 키누요",
            "کینو تاناکا"
        ],
        "biography": "Kinuyo Tanaka (田中 絹代 Tanaka Kinuyo, 29 November 1909 – 21 March 1977) was a Japanese actress and director.\n\nTanaka was born in Shimonoseki, Yamaguchi Prefecture, Japan. She became a leading actress at seventeen years old, appearing in Heinosuke Gosho's An Embarrassing Dream in 1927. She proceeded to take leading parts in, among others, Yasujirō Ozu's I Graduated, But... in 1929, Gosho's Aiyoku no ki in 1930, and in 1931, Japan's first talkie, The Neighbor's Wife and Mine, directed by Gosho.\n\nShe had a close working relationship with director Kenji Mizoguchi, having parts in 15 of his films, including leading roles in The Life of Oharu (1952), Ugetsu (1953) and Sansho the Bailiff (1954). Their working relationship ended when Mizoguchi countered a recommendation from the Directors Guild of Japan for the Nikkatsu studio to hire her as a director. Despite this, the production of her second film as director went ahead, but Tanaka never forgave Mizoguchi, and the reasons for his behaviour are unclear. She also played Noboru Yasumoto's mother in Akira Kurosawa's Red Beard (1965). For her portrayal in Kei Kumai's Sandakan N° 8 she won the Best Actress Award at the 25th Berlin International Film Festival in 1975. Her last screen appearance was in 1976 in Kei Kumai's Kita No Misaki.\n\nTanaka was the second Japanese woman who worked as a film director, after Sakane Tazuko (1904‐1975). Her first directing job was on the film Love Letter in 1953, and she made five further films in that role.",
        "birthday": "1909-11-28",
        "deathday": "1977-03-21",
        "gender": 1,
        "homepage": null,
        "id": 24551,
        "imdb_id": "nm0849011",
        "known_for_department": "Acting",
        "name": "Kinuyo Tanaka",
        "place_of_birth": "Shimonoseki, Yamaguchi, Japan",
        "popularity": 0.6818,
        "profile_path": "/1OnULAXSOskknSCxTzx3Naqoe5O.jpg"
    }
}