{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5rwcd24GGltKiqdPT4G2dmchLr9.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 579583,
                "original_language": "en",
                "original_title": "The King of Staten Island",
                "overview": "Scott has been a case of arrested development ever since his firefighter father died when he was seven. He's now reached his mid-20s having achieved little, chasing a dream of becoming a tattoo artist that seems far out of reach. As his ambitious younger sister heads off to college, Scott is still living with his exhausted ER nurse mother and spends his days smoking weed, hanging with the guys — Oscar, Igor and Richie — and secretly hooking up with his childhood friend Kelsey. But when his mother starts dating a loudmouth firefighter named Ray, it sets off a chain of events that will force Scott to grapple with his grief and take his first tentative steps toward moving forward in life.",
                "popularity": 5.9619,
                "poster_path": "/zQFjMmE3K9AX5QrBL1SXIxYQ9jz.jpg",
                "release_date": "2020-07-22",
                "title": "The King of Staten Island",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 1067,
                "character": "Joanne",
                "credit_id": "5dcf1a19ecbde900183628a3",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "寶琳·夏勒梅"
        ],
        "biography": "Pauline Hope Chalamet (born January 25, 1992) is an American-French actress and producer. She made her feature film debut in Judd Apatow's comedy, The King of Staten Island (2020). From 2021 to 2025, she starred in the HBO Max comedy series The Sex Lives of College Girls.\n\nChalamet is a co-founder of the production company Gummy Films, which was established in 2019. Through the company, she has co-produced and starred in the dark comedy film What Doesn't Float (2023).\n\nDescription above from the Wikipedia article Pauline Chalamet, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1992-01-25",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 2458820,
        "imdb_id": "nm6955492",
        "known_for_department": "Acting",
        "name": "Pauline Chalamet",
        "place_of_birth": "New York, New York, USA",
        "popularity": 1.2574,
        "profile_path": "/mVbbrdZJEccGsSWCQtoDXsxi3Ek.jpg"
    }
}