{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2Kkqmy3EpXqBDqv1vvsNXX3pwww.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 42269,
                "original_language": "it",
                "original_title": "C'eravamo tanto amati",
                "overview": "Three partisans bound by a strong friendship return home after the war, but the clash with everyday reality puts a strain on their bond.",
                "popularity": 1.7523,
                "poster_path": "/zGGWYpiKNwjpKxelPxOMqJnUgDs.jpg",
                "release_date": "1974-12-21",
                "title": "We All Loved Each Other So Much",
                "video": false,
                "vote_average": 8.3,
                "vote_count": 619,
                "character": "Nicola Palumbo",
                "credit_id": "52fe45f8c3a36847f80e50ad",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Stefano Sattaflores"
        ],
        "biography": "Stefano Satta Flores (14 January 1937 – 22 October 1985) was an Italian actor and voice actor.\n\nBorn in Naples, Italy, Satta Flores graduated from the Centro Sperimentale di Cinematografia in the Italian capital city of Rome. He began acting in amateur dramatics at the Piccolo Teatro, where he acted in Shakespeare and Sbragia plays. He made his cinema debut in the film The Lizards (I basilischi), premiered by filmmaker Lina Wertmüller in 1963.\n\nIn 1971, Satta Flores appeared in the film Four Flies on Grey Velvet but did not really establish himself in cinema until 1974, when he appeared in Ettore Scola's film We All Loved Each Other So Much where he shared leading roles with Stefania Sandrelli, Vittorio Gassman, Nino Manfredi, Aldo Fabrizi and Giovanna Ralli.\n\nSatta Flores also appeared in the 1973 films The Funny Face of the Godfather and Teresa the Thief. His last film appearance before his death was in One Hundred Days in Palermo. He was best known for playing a variety of roles in more than 60 films. He was also a voice dubber. His role as the smuggler and rakish hero Han Solo (portrayed by Harrison Ford) in the Italian dub of the Star Wars original trilogy was instrumental in establishing the importance of star power in Italian voice acting. He also used his voice talents in Alien, as the fearless Captain Dallas, as well as in 10, as the romantically-obsessed songwriter George Webber.\n\nAn eloquent spokesman on artistic and social issues of the day, he also was a respected playwright and occasionally acted in television programs. A political commitment, he founded the company I compagni di scena (The Companions of the Scene) with which he devoted himself to research work on alternative tests.\n\nSatta Flores died in Rome on 22 October 1985 at the age of 48, following complications from leukemia treatment. In the Italian version of Star Wars: The Force Awakens, the voice of Han Solo was passed on to Harrison Ford's regular Italian dub actor Michele Gammino.\n\nDescription above from the Wikipedia article Stefano Satta Flores, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1937-01-14",
        "deathday": "1985-10-22",
        "gender": 2,
        "homepage": null,
        "id": 24606,
        "imdb_id": "nm0766370",
        "known_for_department": "Acting",
        "name": "Stefano Satta Flores",
        "place_of_birth": "Naples, Campania, Italy",
        "popularity": 0.1442,
        "profile_path": "/9PifLAPYRIcEbeqj5WPb7bk3w9k.jpg"
    }
}