{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cLZxnkj75cGBK1tLTMyIudOZYZk.jpg",
                "genre_ids": [
                    99
                ],
                "id": 1777,
                "original_language": "en",
                "original_title": "Fahrenheit 9/11",
                "overview": "Michael Moore's view on how the Bush administration allegedly used the tragic events on 9/11 to push forward its agenda for unjust wars in Afghanistan and Iraq.",
                "popularity": 3.7204,
                "poster_path": "/1WQgOCJj22zF7Bsr0pIBgGBr71q.jpg",
                "release_date": "2004-06-25",
                "title": "Fahrenheit 9/11",
                "video": false,
                "vote_average": 7.084,
                "vote_count": 1460,
                "character": "Self (archive footage)",
                "credit_id": "64d46646d100b600e267e97d",
                "order": 49
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Patsy Takemoto Mink",
            "Patsy Matsu Mink"
        ],
        "biography": "Patsy Matsu Mink (née Takemoto; December 6, 1927 – September 28, 2002) was an American attorney and politician from the U.S. state of Hawaii. She served in the United States House of Representatives for 24 years as a member of the Democratic Party, initially from 1965 to 1977, and again from 1990 until her death in 2002. She was the first woman of color and the first Asian-American woman elected to Congress, and is known for her work on legislation advancing women's rights and education.\n\nMink was a third-generation Japanese American, having been born and raised on the island of Maui. After graduating as valedictorian of the Maui High School class in 1944, she attended the University of Hawaiʻi at Mānoa for two years and subsequently enrolled at the University of Nebraska, where she experienced racism and worked to have segregation policies eliminated. After illness forced her to return to Hawaii to complete her studies there, she applied to 12 medical schools to continue her education but was rejected by all of them. Following a suggestion by her employer, she opted to study law and was accepted at the University of Chicago Law School in 1948. While there, she met and married a graduate student in geology, John Francis Mink. When they graduated in 1951, Patsy Mink was unable to find employment and after the birth of their daughter in 1952, the couple moved to Hawaii.",
        "birthday": "1927-12-06",
        "deathday": "2002-09-28",
        "gender": 1,
        "homepage": null,
        "id": 2460653,
        "imdb_id": "nm1743015",
        "known_for_department": "Acting",
        "name": "Patsy Mink",
        "place_of_birth": "Maui, Hawaii, USA",
        "popularity": 0.0261,
        "profile_path": "/qVe3fCwwgJ4L9lcyAzil6648KMZ.jpg"
    }
}