{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4BOgSGwEEHZuDhiHUOsrXaJBqoc.jpg",
                "genre_ids": [
                    36,
                    18,
                    28
                ],
                "id": 617653,
                "original_language": "en",
                "original_title": "The Last Duel",
                "overview": "King Charles VI declares that Knight Jean de Carrouges settle his dispute with his squire, Jacques Le Gris, by challenging him to a duel.",
                "popularity": 5.247,
                "poster_path": "/zjrJE0fpzPvX8saJXj8VNfcjBoU.jpg",
                "release_date": "2021-10-13",
                "title": "The Last Duel",
                "video": false,
                "vote_average": 7.422,
                "vote_count": 3604,
                "character": "Jean de Carrouges III",
                "credit_id": "62f105b8df857c007fb084af",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/y2DB71C4nyIdMrANijz8mzvQtk6.jpg",
                "genre_ids": [
                    28,
                    80,
                    18,
                    53
                ],
                "id": 49026,
                "original_language": "en",
                "original_title": "The Dark Knight Rises",
                "overview": "Following the death of District Attorney Harvey Dent, Batman assumes responsibility for Dent's crimes to protect the late attorney's reputation and is subsequently hunted by the Gotham City Police Department. Eight years later, Batman encounters the mysterious Selina Kyle and the villainous Bane, a new terrorist leader who overwhelms Gotham's finest. The Dark Knight resurfaces to protect a city that has branded him an enemy.",
                "popularity": 17.5242,
                "poster_path": "/hr0L2aueqlP2BYUblTTjmtn0hw4.jpg",
                "release_date": "2012-07-17",
                "title": "The Dark Knight Rises",
                "video": false,
                "vote_average": 7.8,
                "vote_count": 23539,
                "character": "2 Star Air Force General",
                "credit_id": "56219c1c9251413a740041a2",
                "order": 48
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "올리버 코튼"
        ],
        "biography": "After training at the Drama Centre London, he has worked extensively at the Royal National Theatre playing in many productions including The Royal Hunt of the Sun, Rosencrantz and Guildenstern Are Dead, Much Ado About Nothing, As You Like It, Oedipus, In His Own Write, Hamlet, Tamburlaine, No Man's Land, The Passion, Despatches, Half Life, The World Turned Upside Down, Julius Caesar, The Madras House, The Man With the Flower in His Mouth, Tales from the Vienna Woods, The Crucible, Piano, Troilus and Cressida, Money, Summerfolk, The Villain's Opera, Life x 3.\n\nAt the Royal Court Theatre, he has appeared in The Local Stigmatic, The Duchess of Malfi, Man is Man, The Enoch Show, Erronenous Zones, The Tutor by Brecht, Lear and Bingo by Edward Bond and Piano/Forte by Terry Johnson.\n\nHe was a founder member of Joint Stock appearing in their inaugural production The Speakers by Heathcote Williams. At The Royal Shakespeare Company he has played in The Marrying of Ann Leete, Henry VI, Edward IV, Richard III, The Plain Dealer, Some Americans Abroad by Richard Nelson, Brand by Ibsen.\n\nHis West End appearances include The Homecoming by Harold Pinter, Children of a Lesser God by Mark Medoff, Benefactors by Michael Frayn (in whose Liberty Hall he also appeared in at the Greenwich Theatre), An Ideal Husband by Oscar Wilde, Life x 3 by Yasmina Reza, and Brand by Ibsen. He has also played the title role in King Lear at the Southwark Playhouse and Malvolio in Shakespeare's Globe's all-male production of Twelfth Night.\n\nHis many TV appearances have included The Borgias (Cesare Borgia), David Copperfield, The Year of the French, The Play on One, Redemption, Poirot, The Camomile Lawn, Westbeach, Zorro, Sharpe's Battle, Rhodes, All Quiet on the Preston Front, Innocents, Judge John Deed, Inspector Lynley, Waking the Dead, M.I.T.: Murder Investigation Team, Beastly Games, Sensitive Skin, Midsomer Murders, Hotel Babylon.\n\nHis films include Here We Go Round the Mulberry Bush, The Day Christ Died, Firefox, Oliver Twist, The Sicilian, Eleni, Hiding Out, Christopher Columbus, Son of the Pink Panther, The Innocent Sleep, Phoenix Blue, The Opium War, Beowulf, Baby Blue, The Dancer Upstairs, Shanghai Knights, The Bone Collector, Raindogs, Colour Me Kubrick.",
        "birthday": "1944-06-20",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 24627,
        "imdb_id": "nm0183122",
        "known_for_department": "Acting",
        "name": "Oliver Cotton",
        "place_of_birth": "London, England, UK",
        "popularity": 0.1387,
        "profile_path": "/2I2W2hpNPRWpidKyRDGJ3p0hSRc.jpg"
    }
}