{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/b0PlSFdDwbyK0cf5RxwDpaOJQvQ.jpg",
                "genre_ids": [
                    80,
                    9648,
                    53
                ],
                "id": 414906,
                "original_language": "en",
                "original_title": "The Batman",
                "overview": "In his second year of fighting crime, Batman uncovers corruption in Gotham City that connects to his own family while facing a serial killer known as the Riddler.",
                "popularity": 20.696,
                "poster_path": "/74xTEgt7R36Fpooo50r9T25onhq.jpg",
                "release_date": "2022-03-01",
                "title": "The Batman",
                "video": false,
                "vote_average": 7.659,
                "vote_count": 11222,
                "character": "Pallbearer (uncredited)",
                "credit_id": "6337ed5f944a57008425aa4a",
                "order": 81
            },
            {
                "adult": false,
                "backdrop_path": "/13Nz8EchKRdCgJcKdEoJAnpiVn2.jpg",
                "genre_ids": [
                    28,
                    12,
                    14
                ],
                "id": 791373,
                "original_language": "en",
                "original_title": "Zack Snyder's Justice League",
                "overview": "Determined to ensure Superman's ultimate sacrifice was not in vain, Bruce Wayne aligns forces with Diana Prince with plans to recruit a team of metahumans to protect the world from an approaching threat of catastrophic proportions.",
                "popularity": 13.7837,
                "poster_path": "/tnAuB8q5vv7Ax9UAEje5Xi4BXik.jpg",
                "release_date": "2021-03-18",
                "title": "Zack Snyder's Justice League",
                "video": false,
                "vote_average": 8.11,
                "vote_count": 10399,
                "character": "Policeman London (Uncredited)",
                "credit_id": "63bcf813f8595800f71f8af8",
                "order": 121
            },
            {
                "adult": false,
                "backdrop_path": "/prH7Lmo7V9GuMbhCaDCSa6kvZvs.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 4347,
                "original_language": "en",
                "original_title": "Atonement",
                "overview": "As a 13-year-old, fledgling writer Briony Tallis irrevocably changes the course of several lives when she accuses her older sister's lover of a crime he did not commit.",
                "popularity": 6.4137,
                "poster_path": "/hMRIyBjPzxaSXWM06se3OcNjIQa.jpg",
                "release_date": "2007-02-27",
                "title": "Atonement",
                "video": false,
                "vote_average": 7.642,
                "vote_count": 4465,
                "character": "Soldier (uncredited)",
                "credit_id": "605694de5c071b003d4f4e32",
                "order": 48
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Craig Douglas (born on February 7, 1986) in Middlesbrough, United Kingdom, He is an Award-winning Screenwriter and Film Director. Due to earlier school grades he was refused entry to a TV and Film Production course at Teesside University, so over the years he studied the work of Steven Spielberg, James Cameron and Martin Scorsese, which taught him how to make films and write screenplays, to which he owes his success to.\n\nWhen he was a child he started writing short stories with his younger brother Callum, they would go on to make short videos and clips for friends and family.\n\nThey went on to start their own production company CCD Productions, using this label on videos and clips made for local companies. In 2019 Craig founded a new production company Pine Barrens Pictures, this he named after his favourite episode of the globally successful HBO show The Sopranos. In 2021 he formed the distribution and production company Douglasfilm Ltd.\n\nHe was a Kickstarter contributor on the Documentary Cleanin' Up The Town: Remembering Ghostbusters. He had a brief cameo in the highly rated BBC show Peaky Blinders. He has a number of titles on his resume including films that featured Doctor Who and The Hobbit star Sylvester McCoy and monster actor Doug Jones. In 2020 he featured in the true crime documentary Lee Duffy: Too Far, Too Soon. In September 2019 he signed on to the Dollar Baby Project writing the short film The Woman In The Room which is based on the short story by the best selling Horror writer Stephen King.",
        "birthday": "1986-02-07",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2463642,
        "imdb_id": "nm5940174",
        "known_for_department": "Acting",
        "name": "Craig Douglas",
        "place_of_birth": "Middlesbrough, England, UK",
        "popularity": 0.0546,
        "profile_path": "/hoSisBDgkdqNs6ITXg9spiVmwkk.jpg"
    }
}