{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qxTw8OKJLRX1Xb5nR5CcIDnLKoq.jpg",
                "genre_ids": [
                    18,
                    53,
                    27
                ],
                "id": 44214,
                "original_language": "en",
                "original_title": "Black Swan",
                "overview": "The story of Nina, a ballerina in a New York City ballet company whose life, like all those in her profession, is completely consumed with dance. She lives with her retired ballerina mother Erica who zealously supports her daughter's professional ambition. When artistic director Thomas Leroy decides to replace prima ballerina Beth MacIntyre for the opening production of their new season, Swan Lake, Nina is his first choice.",
                "popularity": 7.3213,
                "poster_path": "/viWheBd44bouiLCHgNMvahLThqx.jpg",
                "release_date": "2010-12-03",
                "title": "Black Swan",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 15010,
                "character": "Dancer (uncredited)",
                "credit_id": "5fd566c1006b010040de4ec7",
                "order": 55
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Alyson Cambridge is an American operatic soprano. In addition to opera, she sings classical song, jazz, and American songbook and popular song. She is also known for her work as a model, actress, and host.\n\nIn 2003 Cambridge won the Metropolitan Opera National Council Auditions, becoming the competition's youngest Grand Prize winner ever. She made her Metropolitan Opera debut the following year in Carmen. She was also awarded First Prize in the 2003 Licia Albanese-Puccini Foundation International Voice Competition, First Prize in the 2004 George London Foundation Award, and the Régine Crespin Award at the 2008 Elardo International Opera Competition.\n\nIn 2010, her debut recording, From the Diary of Sally Hemings, was released, and made its premier at Weill Recital Hall at Carnegie Hall. In 2016, Cambridge released her second solo album, with the jazz standards and American popular song-based Until Now. Her third album, Sisters in Song, with soprano Nicole Cabell and the Lake Forest Symphony, will be released in September 2018. She has served as brand ambassador for Swiss luxury watch and jewelry designer Chopard, as well as for fashion designers Vivianne Tam and Monika Chiang. In 2018, Cambridge is performing on Broadway, as one of the lead vocalists in Rocktopia, which fuses iconic 20th-century rock with classical masterpieces.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.alysoncambridge.com/",
        "id": 2465685,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Alyson Cambridge",
        "place_of_birth": "Arlington, Virginia",
        "popularity": 0.0286,
        "profile_path": "/r3DYl8jfrDTuWOIimeIXMuggItQ.jpg"
    }
}