{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bvpYJgsC5jcMJd43HRHXUQw7j5O.jpg",
                "genre_ids": [
                    18,
                    35,
                    36,
                    10749
                ],
                "id": 11673,
                "original_language": "fr",
                "original_title": "Cyrano de Bergerac",
                "overview": "Famed swordsman and poet Cyrano de Bergerac is in love with his cousin Roxane. He has never expressed his love for her as he his large nose undermines his self-confidence. Then he finds a way to express his love to her, indirectly.",
                "popularity": 2.6699,
                "poster_path": "/80XJ5UkGuYTKDuALeG03BLk1OT1.jpg",
                "release_date": "1990-03-28",
                "title": "Cyrano de Bergerac",
                "video": false,
                "vote_average": 7.33,
                "vote_count": 792,
                "character": "Count of Guiche",
                "credit_id": "52fe44769251416c750359cb",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Жак Вебер"
        ],
        "biography": "Jacques Weber is a French actor, director and writer.\n\nWeber joined the Conservatoire national supérieur d'art dramatique at the age of 20, and won the Prix d'Excellence when he left. He joined Robert Hossein in Rheims, and began a rich theatrical career and a sporadic cinema career.\n\nMarcel Cravenne hired him in 1970 for Tartuffe. In 1972, he was Haroun in Faustine et le Bel Été and played the role of Hugo in État de siège by Costa-Gavras. He was seduced by Claude Jade in Le Malin Plaisir (1975), and by Anicée Alvina in Une femme fatale (1976). The young actor with much sex-appeal (he appeared in Le Malin Plaisir completely naked) was in Bel Ami (1983) after the 1885 novel by Guy de Maupassant in the adaptation by Pierre Cardinal. On television, he was, among others, Le Comte de Monte-Cristo by Denys de La Patellière and Judge Antoine Rives in the show by Gilles Béhat. Noticeable on film as Comte de Guiche in Cyrano de Bergerac (1990) and Don Juan (1998), where he seduces Emmanuelle Béart. In 2008, he joined Isabelle Adjani in a televised adaptation of Figaro which he directed for France 3.\n\nFrom 1979 to 1985, he appeared at the Centre dramatique national in Lyon (Théâtre du 8th), and from 1986 to 2001, the Théâtre de Nice, Centre dramatique national Nice-Côte d'Azur. He has starred and directed in many of the great roles of classical theatre, including Cyrano, where he excelled for many seasons.\n\nJacques Weber published Des petits coins de paradis in October 2009, his first work, which relates to his work as an artist and his friends.\n\nHe is married to Christine Weber and has three children: two sons, Tommy and Stanley, and one daughter, Kim.\n\nSource: Article \"Jacques Weber\" from Wikipedia in english, licensed under CC-BY-SA 3.0.",
        "birthday": "1949-08-23",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 24683,
        "imdb_id": "nm0916616",
        "known_for_department": "Acting",
        "name": "Jacques Weber",
        "place_of_birth": "Paris, France",
        "popularity": 0.3293,
        "profile_path": "/xORNQKmduTsIc1Sq40mnOz3Zo5K.jpg"
    }
}