{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jkYdRAhshaRwiRAB4KdDz1Ocj4e.jpg",
                "genre_ids": [
                    28,
                    80,
                    35,
                    53
                ],
                "id": 10536,
                "original_language": "en",
                "original_title": "The Italian Job",
                "overview": "Charlie's got a 'job' to do. Having just left prison he finds one of his friends has attempted a high-risk job in Torino, Italy, right under the nose of the mafia. Charlie's friend doesn't get very far, so Charlie takes over the 'job'. Using three Mini Coopers, a couple of Jaguars, and a bus, he hopes to bring Torino to a standstill, steal a fortune in gold and escape in the chaos.",
                "popularity": 2.6317,
                "poster_path": "/8NOw3HPHkcBndJW2K6ofbcSb7WD.jpg",
                "release_date": "1969-06-02",
                "title": "The Italian Job",
                "video": false,
                "vote_average": 6.993,
                "vote_count": 804,
                "character": "Yellow",
                "credit_id": "56032eaec3a3685523002b2d",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Robert Thomas Powell"
        ],
        "biography": "Robert Powell (born June 1, 1944) is an English actor. In 1964, he started his acting career while attending Manchester  University. In 1967, he made his film debut, and later landed his first starring role in The Italian Job (1969). Some of his well known movies include Franco Ziefirelli's \"Jesus of Nazareth\" (1977), Ken Russell's Tommy (1975) and Mahler (1974), the remake of The Thirty Nine Steps (1978), and the popular TV series \"Doomwatch\"  (1970). Robert married on 29th August, 1975 to Barbara 'Babs' Lord.  They now have a son and a daughter. In 1982, Robert won the Best Actor award at the Venice Film Festival for his performance in Imperative (1982). He won the best actor award at the Paris Film Festival for Harlequin (1980). For his portrayal of Jesus in Jesus of Nazareth he received best actor awards  from TV Times and Italian TV Times, the international arts prize at the  Fiuggi Film Festival, grand prize at the Saint-Vincent Film Festival,  and a nomination as best actor from The Irish Academy of Film and  Television arts. In reference to his role as Jesus in Jesus of Nazareth,  Robert said, \"I hope Jesus Christ will be the last in my line of  sensitive young men for quite a while.\".",
        "birthday": "1944-06-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 24682,
        "imdb_id": "nm0694293",
        "known_for_department": "Acting",
        "name": "Robert Powell",
        "place_of_birth": "Salford, Manchester, England, UK",
        "popularity": 0.5826,
        "profile_path": "/seHIncPS18PLjhEPqy4ZdeZ6lsU.jpg"
    }
}