{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bodTQ7K68AopK2uQumsrSVT9g4A.jpg",
                "genre_ids": [
                    35,
                    10752
                ],
                "id": 8290,
                "original_language": "fr",
                "original_title": "La Grande Vadrouille",
                "overview": "During World War II, two French civilians and a downed British Bomber Crew set out from Paris to cross the demarcation line between Nazi-occupied Northern France and the South. From there they will be able to escape to England. First, they must avoid German troops – and the consequences of their own blunders.",
                "popularity": 2.3452,
                "poster_path": "/91l4Sf3WJwrb0tSVPsOqnBXG8E6.jpg",
                "release_date": "1966-12-08",
                "title": "Don't Look Now... We're Being Shot At!",
                "video": false,
                "vote_average": 7.934,
                "vote_count": 1402,
                "character": "Mother Superior of the Hospices de Beaune",
                "credit_id": "52fe449dc3a36847f80a02b3",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Mary Marquet (born Micheline Marguerite Delphine Marquet; 14 April 1895 – 29 August 1979) was a French stage and film actress.\n\nMarquet came from a family of artists: her parents were actors, an aunt was a star dancer at the Paris Opera, and another was an official at the Comédie-Française. She entered the National Superior Conservatory of Dramatic Art in 1913 and studied under Paul Mounet. She failed her final exams, but was immediately engaged in the company of Sarah Bernhardt, who was a great friend of the family. She went on play alongside her in The Eugene Morand cathedral.\n\nShe became established with her role in L'Aiglon by Edmond Rostand, whose mistress she became from 1915 to his death in 1918. She made her film debut in 1914 in a silent film, Les Frères ennemis, which was never finished. Her first major film role was in Sappho, produced by Léonce Perret in 1932. After World War I, she joined the Comédie-Française in 1923 where she stayed for over twenty years, before moving to the boulevard Theatre.\n\nDuring the World War II, throughout the occupation, she sought the protection of German officers to protect her son who had told her of his intention to join the Resistance. The response was his arrest and deportation to Buchenwald concentration camp where he died aged 21. This was possibly the cause of her problems at the time of the Liberation when, due to her alleged relations with the enemy, Marquet was arrested and sent to Drancy and then to Fresnes. She was later released for lack of evidence.\n\nIn the 1950s, she turned to poetry recital, while continuing her career in theater on the boulevards. She worked for ORTF in the Maigret episodes of Les Cinq Dernières Minutes and Les Saintes Chéries and in the television adaptation of Lucien Leuwen, the novel by Stendhal.\n\nParallel to her acting career, as an antiquarian she ran a stand for many years at the Swiss Village, an important antique market in Paris where she demonstrated her skills as a saleswoman, mixing theatrical memorabilia with commercial interests.\n\nAmong her most successful parts in over forty films, were her roles in, Landru in 1962, Claude Chabrol, La Grande Vadrouille in 1966 by Gérard Oury, and Casanova in 1975 by Federico Fellini. After these three minor parts she played important roles in La vie de château (1966) the mother of Philippe Noiret and the stepmother of Catherine Deneuve and the Le malin plaisir (1975) with Claude Jade and Anny Duperey.\n\nMary Marquet and Victor Francen on their wedding day in 1934.\n\nHer first lover was Edmond Rostand around 1915, living together for three years. In 1920 she married Maurice Escande, the future director of the house of Molière, ending in divorce in 1921, before meeting Firmin Gémier, the director of the new Théâtre National Populaire, who was still married but whose wife was barren. In 1922, Marquet gave birth to their son.\n\nBefore the death of Gémier in 1933, Marquet became the mistress of the president of the then Council, André Tardieu, in a semi-official liaison. Having broken up with Tardieu, she married Victor Francen. The couple separated after seven years together. Marquet died of heart attack at the age of 84 in her apartment in the Rue Carpeaux, She is buried in Montmartre Cemetery.\n\nSource: Article \"Mary Marquet\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1895-04-14",
        "deathday": "1979-08-29",
        "gender": 1,
        "homepage": null,
        "id": 24686,
        "imdb_id": "nm0549806",
        "known_for_department": "Acting",
        "name": "Mary Marquet",
        "place_of_birth": "Leningrad, USSR [now St. Petersburg, Russia]",
        "popularity": 0.1554,
        "profile_path": "/n7nHQg4DhxHB0A1iaPOr3bdNKS6.jpg"
    }
}