{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/u7kuUaySqXBVAtqEl9vkTkAzHV9.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 20453,
                "original_language": "hi",
                "original_title": "3 Idiots",
                "overview": "Rascal. Joker. Dreamer. Genius... You've never met a college student quite like \"Rancho.\" From the moment he arrives at India's most prestigious university, Rancho's outlandish schemes turn the campus upside down—along with the lives of his two newfound best friends. Together, they make life miserable for \"Virus,\" the school’s uptight and heartless dean. But when Rancho catches the eye of the dean's daughter, Virus sets his sights on flunking out the \"3 idiots\" once and for all.",
                "popularity": 5.2285,
                "poster_path": "/66A9MqXOyVFCssoloscw79z8Tew.jpg",
                "release_date": "2009-12-23",
                "title": "3 Idiots",
                "video": false,
                "vote_average": 8.003,
                "vote_count": 2532,
                "character": "Suhas Tandon",
                "credit_id": "5ddfde353faba000130680c2",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Olivier Sanjay Lafont (born 31 October 1979) is a French actor, author and screenwriter based in Paris. He is French, lived and worked in India for 30 years, and had an American international education, graduating from Colgate University, USA with BAs in Theatre and English Literature and academic distinction. Natively bilingual in English and French, speaking fluent Hindi and basic Spanish, he has acted in several Bollywood and Hollywood films, over 100 television commercials and advertising campaigns, and more than 100 voice overs and dubs.  The first feature film he wrote premiered at the Toronto Film Festival and went on to win seven awards at international film festivals. He has sold several other feature film screenplays and written for comedy shows.",
        "birthday": "1979-10-31",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2469878,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Olivier Lafont",
        "place_of_birth": null,
        "popularity": 0.4276,
        "profile_path": null
    }
}