{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kGzFbGhp99zva6oZODW5atUtnqi.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 240,
                "original_language": "en",
                "original_title": "The Godfather Part II",
                "overview": "In the continuing saga of the Corleone crime family, a young Vito Corleone grows up in Sicily and in 1910s New York. In the 1950s, Michael Corleone attempts to expand the family business into Las Vegas, Hollywood and Cuba.",
                "popularity": 16.2247,
                "poster_path": "/hek3koDUyRQk7FIhPXsa6mT2Zc3.jpg",
                "release_date": "1974-12-20",
                "title": "The Godfather Part II",
                "video": false,
                "vote_average": 8.6,
                "vote_count": 13187,
                "character": "Mrs. Andolini",
                "credit_id": "55c0e6259251410f2a001d22",
                "order": 26
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Maria Carta (24 June 1934 – 22 September 1994) was a Sardinian folk music singer-songwriter. She also performed in film and theatre. In 1975 she wrote a book of poetry, Canto rituale (Ritual Song).\n\nThroughout her 25-year career she covered the richly diverse genres of traditional music of her native Sardinia (Cantu a chiterra, ninne nanne—children's lullabies, gosos, Gregorian chants, and more), often updating them with a modern and personal touch. She succeeded in bringing Sardinian folk music into wider popular awareness in demonstrations at a national level in Italy (like the Canzonissima in 1974) as well as internationally (especially in France and the United States).\n\nMaria Carta won the Miss Sardinia beauty contest in 1957 and later participated in the national Miss Italy competition.\n\nAround 1960, she moved to Rome where she met the screenwriter Salvatore Laurani whom she later married. She attended the Centro Nazionale di Studi di Musica Popolare, directed by Diego Carpitella, at the National Academy of Santa Cecilia and at the same time she pursued a musical and ethnographic research path with important productions and collaborations.\n\nIn 1971, she made two albums: Sardegna canta and Paradiso in re, and in the meantime she attended the ethnomusicologist Gavino Gabriel. The same year RAI broadcast the television documentary Incontro con Maria Carta (photography by Franco Pinna and texts by Velia Magno), in which she sang and recited with Riccardo Cucciolla.\n\nIn 1972, she played at the Teatro Argentina in Rome in the Medea by Franco Enriquez. The same year she met Amália Rodrigues, with whom she held a concert at the Teatro Sistina. In 1973, the two artists made a tour in Sardinia.\n\nIn 1974, she participated in Canzonissima, interpreting the traditional Sardinian Ave Maria Deus ti salvet Maria. She reached the final and was ranked second in the group of folk music with the song Amore disisperadu. In 1975, she held an important concert at the Bolshoi Theatre in Moscow. In 1976, she served as Communal Councilwoman for the Italian Communist Party, in the city council of Rome and remained in office until 1981.\n\nIn 1980, she participated in the Festival d'Avignon; in 1987 she performed in St. Patrick's Cathedral in New York City; and in 1988 in St. Mary's Cathedral in San Francisco.\n\nShe caught the attention of such directors as Francis Ford Coppola – who gave her the first of two of her widely-seen film roles as the mother of Vito Corleone in The Godfather Part II (1974) – and Franco Zeffirelli, who cast her as Martha, the sister of Lazarus, in Jesus of Nazareth (1977).\n\nIn 1985, she was awarded, as songwriter, the Targo Tenco for dialectal/regional music.\n\nIn the last years of her life, Carta gave her time to the University of Bologna where she conducted a series of classes and advised student theses on which she had relevant personal, human experience and scholarly background.\n\nIn 1991, the President of Italy, Francesco Cossiga, named her a \"Commendatore della Repubblica\" (\"Knight of the Republic\"), similar to the British CBE.\n\nSource: Article \"Maria Carta\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1934-06-24",
        "deathday": "1994-09-22",
        "gender": 1,
        "homepage": null,
        "id": 24697,
        "imdb_id": "nm0141404",
        "known_for_department": "Acting",
        "name": "Maria Carta",
        "place_of_birth": "Siligo, Sardinia, Italy",
        "popularity": 0.1832,
        "profile_path": "/ifWc3ofLuTWwnC3oMcBU5ceUBFp.jpg"
    }
}