{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/92tb8mgjgL1S2KwrZezyPHPkQ3R.jpg",
                "genre_ids": [
                    12,
                    10751,
                    14
                ],
                "id": 13597,
                "original_language": "en",
                "original_title": "Labyrinth",
                "overview": "When Sarah is forced to babysit her half-brother Toby, she inadvertently summons the Goblin King who whisks Toby away to his castle at the center of a labyrinth. Sarah enters into a bargain with the Goblin King where she is given just thirteen hours to solve the labyrinth and rescue Toby, or else lose him forever.",
                "popularity": 5.6745,
                "poster_path": "/hbSdA1DmNA9IlfVoqJkIWYF2oYm.jpg",
                "release_date": "1986-06-27",
                "title": "Labyrinth",
                "video": false,
                "vote_average": 7.277,
                "vote_count": 2573,
                "character": "Firey 5",
                "credit_id": "5de2dadba61de10011e4be18",
                "order": 33
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Rollin Krewson"
        ],
        "biography": "Rollie Krewson (sometimes credited as \"Rollin Krewson\") is a puppet designer and builder known for her work on various Muppet productions. She interned with Jim Henson's company in the mid-1970s. Although she now works primarily as a designer/builder, she began as a performer, doing small bits on The Muppet Show and other projects.\n\nShe has contributed to almost every Henson production since her arrival, and to this day carries her skills through on Sesame Street. Krewson was the designer for Julia, Sesame's autistic Muppet character.\n\nKrewson has received seven Daytime Emmy Awards for her contributions on Sesame Street and has been nominated many times for her work on other Henson productions.\n\nDescription above from the Wikipedia article Rollie Krewson, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 2471836,
        "imdb_id": "nm0471109",
        "known_for_department": "Acting",
        "name": "Rollie Krewson",
        "place_of_birth": null,
        "popularity": 0.0297,
        "profile_path": "/ztkMEJO6dgcqWoNzEl8bOMbKfki.jpg"
    }
}