{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zQyNGzYD144sbFKrfBP8mFwqDxn.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 6003,
                "original_language": "en",
                "original_title": "Romeo and Juliet",
                "overview": "Romeo Montague and Juliet Capulet fall in love against the wishes of their feuding families. Driven by their passion, the young lovers defy their destiny and elope, only to suffer the ultimate tragedy.",
                "popularity": 2.797,
                "poster_path": "/vaBQKLbSWkXGTOlsz9ARdJP4lvg.jpg",
                "release_date": "1968-04-02",
                "title": "Romeo and Juliet",
                "video": false,
                "vote_average": 7.415,
                "vote_count": 697,
                "character": "Balthazar",
                "credit_id": "56ac0db3c3a3681c3f0047db",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia. \n\n \n\nKeith Skinner (born 1949) is a British actor who worked in cinema and television.\n\nHis career began when he starred as Bruno in the 1966 film Mademoiselle, and more notably perhaps in Franco Zeffirelli's 1968 film Romeo and Juliet as Balthasar, Romeo's manservant and trusted friend. He appears at various stages in the film including galloping on horseback to tell Romeo (played by Leonard Whiting) of Juliet's \"death\" and accompanies Romeo back to Verona again on horseback towards the end of the film.\n\nSkinner starred in one episode of The Jazz Age in 1968, he played Harry Lampton in five episodes of the early seventies' TV series Man at the Top, as well as appearing in three episodes of Z Cars from 1969 to 1972. He went on to appear in an episode of Play for Today, one episode of Out of the Unknown in 1971, in two episodes of So it Goes in 1973, in two episodes of Beryl's Lot (1973-1976) and then in 1976 in the film The Slipper and the Rose: The Story of Cinderella.\n\nIn 1977, Skinner played the obsessed boy in the TV mini series Jesus of Nazareth. In 1980, he starred in John Loesser's musical Guys and Dolls. In 1985, Skinner appeared in an episode of Doctor Who.\n\nIn 2001, Skinner worked on the film From Hell as an historical consultant.\n\nIn 2004, Skinner gave up acting and is now a crime historian.\n\nDescription above from the Wikipedia article Keith Skinner, licensed under CC-BY-SA,full list of contributors on Wikipedia.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 24720,
        "imdb_id": "nm0804275",
        "known_for_department": "Acting",
        "name": "Keith Skinner",
        "place_of_birth": null,
        "popularity": 0.1025,
        "profile_path": "/qrPzvLNggOSYGqAcpSQmjZ72Eq2.jpg"
    }
}