{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/j4irvwRLITgGr6vcP8NIKCUA67y.jpg",
                "genre_ids": [
                    27,
                    53,
                    14
                ],
                "id": 9003,
                "original_language": "en",
                "original_title": "Hellraiser",
                "overview": "Hedonist Frank Cotton finds a mysterious puzzle box that summons the Cenobites, who open the doors to a dominion where pain and pleasure are indivisible.",
                "popularity": 3.6149,
                "poster_path": "/3Z0oPHyLnk3Vx6ZMC1MiVwIrKhO.jpg",
                "release_date": "1987-09-11",
                "title": "Hellraiser",
                "video": false,
                "vote_average": 6.878,
                "vote_count": 2705,
                "character": "Frank the Monster",
                "credit_id": "52fe44d0c3a36847f80ab8f9",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Oliver Smith (born 29 May 1952) is an English actor known for his work in the horror genre, particularly for his role as Frank the Monster in Hellraiser, directed by Clive Barker. In this film, Smith portrayed the skinless, reanimated form of Frank Cotton, the main antagonist. The role of Frank in his living form was portrayed by Sean Chapman, while Andrew Robinson played Frank disguised in Larry Cotton’s skin. Smith’s performance, enhanced by extensive makeup and effects by artist Bob Keen, became a significant aspect of the film.\n\nSmith reprised his role as Skinless Frank in the sequel, Hellbound: Hellraiser II, and also portrayed Mr. Browning, a mentally ill patient. He has participated in several documentaries and interviews discussing the films’ production and impact on horror cinema.\n\nIn addition to his horror roles, Smith appeared in notable projects such as Saul in the TV miniseries Jesus of Nazareth and Drak in the series Doctor Who. He voiced Ronan the Accuser in the video game Lego Marvel Super Heroes 2 and appeared in the short films Dark Ditties Presents The Offer and Dark Ditties Presents Finders Keepers.\n\nSmith also narrated a commercial for the DVD and Blu-ray releases of Life in 2010.",
        "birthday": "1952-05-29",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 24737,
        "imdb_id": "nm0809483",
        "known_for_department": "Acting",
        "name": "Oliver Smith",
        "place_of_birth": null,
        "popularity": 0.1559,
        "profile_path": "/uEiLPXACTyKcLv0bNa2Zzw3Owrr.jpg"
    }
}