{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8UZfEjAlFq1iUiAkHMkJViq4ZO0.jpg",
                "genre_ids": [
                    53,
                    9648,
                    27
                ],
                "id": 11033,
                "original_language": "en",
                "original_title": "Dressed to Kill",
                "overview": "After witnessing a mysterious woman brutally slay a homemaker, prostitute Liz Blake finds herself trapped in a dangerous situation. While the police thinks she is the murderer, the real killer is intent on silencing her only witness.",
                "popularity": 3.0956,
                "poster_path": "/oy1m5dd44foNrxV8U9l6Walx82V.jpg",
                "release_date": "1980-07-25",
                "title": "Dressed to Kill",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 1038,
                "character": "TV Reporter (uncredited)",
                "credit_id": "61613250fe5c9100441f52de",
                "order": 22
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Paul DeCeglie was born to a middle class family in Brooklyn, N.Y. He aspired to become an FBI agent even while studying TV and Journalism at Brooklyn College, CUNY, where he was managing editor of ken, a college newspaper. But his life took a surprising turn when his resonant voice attracted the attention of a radio executive who immediately hired DeCeglie as a newscaster on American Radio News. He went on to cover the first two manned space shots from Cape Canaveral, the JFK inauguration, the UN Congo Crisis, and other events.\n\nAfter honing his news-writing skills, DeCeglie transitioned into newspaper reporting for the daily Journal of Commerce and later for the American Banker. Following a year as Editor of the National League Journal in Washington, D.C., he was recruited to edit the California Savings and Loan Journal in Los Angeles. His vast Hollywood connections led to his being cast as an extra and actor in TV and movie roles, ultimately leading to his being elected President of the 6,700-member Screen Extras Guild (SEG). His term was highlighted by his efforts to merge the Extra’s union into the Screen Actors Guild.\n\nAfter serving four years as SEG President, DeCeglie returned to writing--freelancing for The New York Times, Entrepreneur, Business Start-Ups, and California Business, as well as writing for a number of public relations firms across the U.S.  In 2001, he began a brief retirement in Thailand, but soon was drafted once again into the world of publishing (Pattaya Today and Pattaya Trader) and continued writing for the next 20 years.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2474001,
        "imdb_id": "nm10119858",
        "known_for_department": "Acting",
        "name": "Paul DeCeglie",
        "place_of_birth": "Brooklyn, New York, USA",
        "popularity": 0.0453,
        "profile_path": null
    }
}