{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mGBmiWmi7JqeTWnrPicRbkXcsuO.jpg",
                "genre_ids": [
                    99
                ],
                "id": 410718,
                "original_language": "en",
                "original_title": "Before the Flood",
                "overview": "A look at how climate change affects our environment and what society can do to prevent the demise of endangered species, ecosystems, and native communities across the planet.",
                "popularity": 1.0583,
                "poster_path": "/u0EfH2zsp6rLOvEKVvWGgzGRQn3.jpg",
                "release_date": "2016-10-21",
                "title": "Before the Flood",
                "video": false,
                "vote_average": 7.687,
                "vote_count": 798,
                "character": "Self (archive footage)",
                "credit_id": "64cd9f8e85090f010690bc3e",
                "order": 37
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/lO5c0zG8s1dBPHcRparpNlNGWU9.jpg",
                "genre_ids": [
                    18
                ],
                "id": 394117,
                "original_language": "en",
                "original_title": "The Florida Project",
                "overview": "The story of a precocious six year-old and her ragtag group of friends whose summer break is filled with childhood wonder, possibility and a sense of adventure while the adults around them struggle with hard times.",
                "popularity": 4.2876,
                "poster_path": "/bnSTP1PY2fDyat0eUa4QouuGV7F.jpg",
                "release_date": "2017-10-06",
                "title": "The Florida Project",
                "video": false,
                "vote_average": 7.429,
                "vote_count": 2947,
                "credit_id": "64cd9d954d679100acefdd65",
                "department": "Crew",
                "job": "Thanks"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Richard Lynn Scott (né Myers, born December 1, 1952) is an American attorney, businessman, and politician serving as the junior United States senator from Florida since 2019. A member of the Republican Party, he was the 45th governor of Florida from 2011 to 2019.\n\nScott is a graduate of the University of Missouri–Kansas City and the Dedman School of Law at Southern Methodist University. In 1987, after serving in the United States Navy and becoming a law firm partner, he co-founded Columbia Hospital Corporation. Columbia later merged with another corporation to form Columbia/HCA, which eventually became the nation's largest for-profit health care company. Scott was pressured to resign as chief executive of Columbia/HCA in 1997. During his tenure as chief executive, the company defrauded Medicare, Medicaid, and other federal programs. The Department of Justice won 14 felony convictions against the company, which was fined $1.7 billion in what was at the time the largest healthcare fraud settlement in U.S. history. Following his departure from Columbia/HCA, Scott became a venture capitalist and pursued other business interests. In 2009, he founded Conservatives for Patients' Rights.",
        "birthday": "1952-12-01",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.rickscott.senate.gov",
        "id": 2478254,
        "imdb_id": "nm4508411",
        "known_for_department": "Acting",
        "name": "Rick Scott",
        "place_of_birth": "Bloomington, Illinois, USA",
        "popularity": 0.1537,
        "profile_path": "/9uJZdFfOxrpjtHMYuJvd3QWNHaN.jpg"
    }
}