{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gj2TBYmOIy4E2GjMIpnbAEZNCQx.jpg",
                "genre_ids": [
                    35,
                    9648,
                    10749
                ],
                "id": 4808,
                "original_language": "en",
                "original_title": "Charade",
                "overview": "After Regina Lampert falls for the dashing Peter Joshua on a skiing holiday in the French Alps, she discovers upon her return to Paris that her husband has been murdered. Soon, she and Peter are giving chase to three of her late husband's World War II cronies, Tex, Scobie and Gideon, who are after a quarter of a million dollars the quartet stole while behind enemy lines.",
                "popularity": 3.5562,
                "poster_path": "/qqaPjC5FQidtKY65jbAKZPiOTaS.jpg",
                "release_date": "1963-12-01",
                "title": "Charade",
                "video": false,
                "vote_average": 7.669,
                "vote_count": 1452,
                "character": "(uncredited)",
                "credit_id": "55e100b49251416bf700046c",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Chantal de Guerre",
            "Chantal Deguerre"
        ],
        "biography": "Chantal Goya (born Chantal Deguerre on June 10, 1942 in Saigon) is a French singer and actress.\n\nChantal Goya started her career as a yé-yé girl, singing a catchy mid-'60s hybrid of girl-group pop and French chanson. She also enjoyed a career as a French New Wave actress; she had a starring role as Madeleine in the 1966 Jean-Luc Godard film Masculin, féminin and in Jean-Daniel Pollet's L'amour c'est gai, l'amour c'est triste (Love is joy, love is sad).\n\nSince 1975, she has become mostly known as a singer for children. Together with her husband, songwriter and composer Jean-Jacques Debout, and with a talented team of designers and costume people, she does shows for and with children. The main themes are dreams and traveling. Her usual character is Marie-Rose, a mix between a maid and an older sister (reminiscent of Julie Andrews in both The Sound of Music and Mary Poppins).\n\nDescription above from the Wikipedia article Chantal Goya, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1942-06-10",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 24801,
        "imdb_id": "nm0333014",
        "known_for_department": "Acting",
        "name": "Chantal Goya",
        "place_of_birth": "Saigon, Vietnam",
        "popularity": 0.2492,
        "profile_path": "/oBxDt0Y1bOhmQLE3PqOvuRW11UP.jpg"
    }
}