{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sfoaAbgEQlQI8dBFJsiIdXiLI7x.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 595975,
                "original_language": "fr",
                "original_title": "La Belle Époque",
                "overview": "Victor, a disillusioned 60-something whose marriage is on the rocks, opts to relive the week of his life when, 40 years earlier, he met his true love through a company that allows customers to return to the time period of their choosing.",
                "popularity": 2.2901,
                "poster_path": "/eHojoVxYRyqGABgoiTYyfkYqTra.jpg",
                "release_date": "2019-11-06",
                "title": "La Belle Époque",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 1036,
                "character": "Pierre",
                "credit_id": "5cc71ef00e0a2678a0f02c36",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Pierre Marie Denis Arditi"
        ],
        "biography": "Pierre Arditi (born 1 December 1944) is an award-winning French film and stage actor. He is the brother of French actress Catherine Arditi.\n\nHe has often played romantic, womanizing roles, similar to those played by Marcello Mastroianni.\n\nIn 1987 he won a César Award for Best Actor in a Supporting Role for his role in Mélo, and in 1994, a César Award for Best Actor for his role in Smoking/No Smoking.\n\nAlthough his work has primarily been in French film and theater, Arditi is known in the Anglophone world as the French voice of Christopher Reeve. Arditi dubbed Christopher Reeve on the French-language version of the three first Superman movies by Richard Donner and Richard Lester (See the French Wikipedia article on Pierre Arditi for more information). Because of the added footage in the DVD Special Edition of Donner's Superman, the movie had to be re-dubbed with a different voice actor, much to the chagrin of the generation of moviegoers who had grown up with the original soundtrack and identified Superman's voice with Arditi's. He also provided the French voice for Reeve in the comedy/whodunit Deathtrap. Finally, he was the voice of the documentary serie Untamed Africa, written and produced by Frederic Lepage.\n\nHe was made Chevalier (Knight) of the Légion d'honneur in 2002. He was made Chevalier (Knight) of the Ordre national du Mérite on 7 April 1994, and promoted Officier (Officer) in 2005.\n\nDescription above from the Wikipedia article Pierre Arditi, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1944-12-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 24816,
        "imdb_id": "nm0034079",
        "known_for_department": "Acting",
        "name": "Pierre Arditi",
        "place_of_birth": "Paris, France",
        "popularity": 0.1674,
        "profile_path": "/kLvyrJkfcGUKzn3rHI0SYX5uPwj.jpg"
    }
}