{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bXPKTWAuRO8Mu5rLCORFagX0YZ1.jpg",
                "genre_ids": [
                    53,
                    9648
                ],
                "id": 574,
                "original_language": "en",
                "original_title": "The Man Who Knew Too Much",
                "overview": "A couple vacationing in Morocco with their young son accidentally stumble upon an assassination plot. When the child is kidnapped to ensure their silence, they have to take matters into their own hands to save him.",
                "popularity": 3.1649,
                "poster_path": "/gy8YBRjCQRIT9x9G9F5fpnFD4xw.jpg",
                "release_date": "1956-05-16",
                "title": "The Man Who Knew Too Much",
                "video": false,
                "vote_average": 7.456,
                "vote_count": 1476,
                "character": "Louis Bernard",
                "credit_id": "52fe4254c3a36847f8015cd3",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/jMT2nS6ou3xwzp1XX40v8rJKl7U.jpg",
                "genre_ids": [
                    35
                ],
                "id": 15097,
                "original_language": "fr",
                "original_title": "La Cité de la peur",
                "overview": "A second-class horror movie has to be shown at Cannes Film Festival, but, before each screening, the projectionist is killed by a mysterious fellow, with hammer and sickle, just as it happens in the film to be shown.",
                "popularity": 3.4282,
                "poster_path": "/xaTVWUrPbGM4SgrLOaaWLeUEafI.jpg",
                "release_date": "1994-03-09",
                "title": "Fear City: A Family-Style Comedy",
                "video": false,
                "vote_average": 7.468,
                "vote_count": 1304,
                "character": "Mr. Mireille, the 2nd projectionist",
                "credit_id": "52fe46399251416c750714d7",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Daniel Yves Alfred Gélin",
            "Daniel Gelin"
        ],
        "biography": "Daniel Yves Alfred Gélin (19 May 1921 – 29 November 2002) was a French actor.\n\nGélin was born in Angers, Maine-et-Loire, the son of Yvonne (née Le Méner) and Alfred Ernest Joseph Gélin.\n\nWhen he was ten, his family moved to Saint-Malo where Daniel went to college until he was expelled for 'uncouthness'. His father then found him a job in a shop that sold cans of salted cod. It was seeing the shooting of Marc Allégret's film Entrée des artistes that triggered his desire to go to Paris to train to be an actor. He trained at the Cours Simon in Paris before entering the Conservatoire national d'art dramatique. There he met Louis Jouvet and embarked on a theatrical career. He made his first film appearance in 1940 in Miquette and for several years was an extra or played small roles in French films. He appeared with Jean Gabin and Marlene Dietrich in Martin Roumagnac (1946).\n\nHe won his first leading role in Rendez-vous de juillet (1949). From that time, he went on to appear in more than 150 films, including Max Ophüls' films La Ronde (1950) and Le Plaisir (1952), Jacques Becker's Édouard et Caroline (1951), Sacha Guitry's films Si Versailles m'était conté (Royal Affairs in Versailles) (1954) and Napoléon (1955), Alfred Hitchcock's The Man Who Knew Too Much (1956), Jean Cocteau's Le Testament d'Orphée (1960), Le souffle au cœur (Murmur of the Heart) (1971), and La Nuit de Varennes (That Night in Varennes) (1982). He also wrote and directed one film, The Long Teeth, in 1952.\n\nGélin was a leading man in French cinema during the 1950s, but his career declined with the coming of the New Wave. He worked in theater for several years, but later found new success on screen as a character actor. He appeared extensively in French films and television productions from the 1970s until his death, often playing cynical characters or grumpy old men.\n\nIn 1946, Gélin married actress Danièle Delorme with whom he had a son, actor, director and producer Xavier Gélin. They divorced in 1954. While still married to Delorme, he had an affair with 17 year old model Marie Christine Schneider that produced a daughter, Maria Schneider. Due to his status as a married man, Gélin could not recognize Maria as his daughter. He visited the child several times but eventually severed his relationship with her mother. Maria Schneider and Daniel Gélin reconnected when she was sixteen and came to visit him. They remained in contact, although their relationship was irregular.\n\nGélin was married to model Sylvie Hirsch from 1954 until their divorce in 1968. This marriage produced three children, Pascal (who died aged one year), Fiona , and Manuel, the latter two also becoming actors. In 1973, he remarried to Lydie Zaks with whom he had a daughter, Laura.\n\nGélin died in Paris on 29 November 2002 of kidney failure.\n\nSource: Article \"Daniel Gélin\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1921-05-19",
        "deathday": "2002-11-29",
        "gender": 2,
        "homepage": null,
        "id": 24814,
        "imdb_id": "nm0004625",
        "known_for_department": "Acting",
        "name": "Daniel Gélin",
        "place_of_birth": "Angers, Maine-et-Loire, France",
        "popularity": 0.3333,
        "profile_path": "/i5zZUU4IhqmJ8EZtbBy2hDRrAyl.jpg"
    }
}