{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fxXwBvym6DkqkO4AWn8OjwMfMc1.jpg",
                "genre_ids": [
                    35
                ],
                "id": 9421,
                "original_language": "fr",
                "original_title": "Le Dîner de cons",
                "overview": "For Pierre Brochant and his friends, Wednesday is “Idiots' Day”. The idea is simple: each person has to bring along an idiot. The one who brings the most spectacular idiot wins the prize. Tonight, Brochant is ecstatic. He has found a gem. The ultimate idiot, “A world champion idiot!”. What Brochant doesn’t know is that Pignon is a real jinx, a past master in the art of bringing on catastrophes...",
                "popularity": 3.7021,
                "poster_path": "/cv6neov6SMLjHytjiU0rgeugoPI.jpg",
                "release_date": "1998-04-15",
                "title": "The Dinner Game",
                "video": false,
                "vote_average": 7.766,
                "vote_count": 1987,
                "character": "Lucien Cheval",
                "credit_id": "52fe44f5c3a36847f80b4325",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Daniel Prévot",
            "Denis Forestier",
            "Daniel Prevost"
        ],
        "biography": "Daniel Prévost (born 20 October 1939) is a French actor, comedian and writer.\n\nDaniel Prévost, alias Denis Forestier, was born to Micheline Chevalier and Mohand Ait Salem. His father was of Berber descent from Algeria (Kabylie region), a fact which he did not discover until later life.\n\nHe is the father of actors Sören Prévost, Erling Prévost and Christophe Prévost.\n\nAfter attending drama school in Paris, Prévost made his theatre début alongside the likes of Michel Serrault in Un certain M. Blot. In his early beginnings he both performed alongside Boby Lapointe and became acquainted with Jean Yanne, later becoming one of the latter's favourite actors.\n\nAlthough his television and cinema career began in the 1960s, it was in the 1970s that he found fame through Jacques Martin's satirical news programme Le petit rapporteur, the part for which he is best known.\n\nHe excelled as an evilly leering tax inspector – \"he'd audit his own mother\" in Francis Veber's 1998 comedy Le Dîner de Cons for which he won the César Award for best supporting actor.\n\nSource: Article \"Daniel Prévost\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1939-10-20",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 24832,
        "imdb_id": "nm0699545",
        "known_for_department": "Acting",
        "name": "Daniel Prévost",
        "place_of_birth": "Garches, Seine-et-Oise [now Hauts-de-Seine], France",
        "popularity": 0.2258,
        "profile_path": "/oXgHTf056G7gjS290Nadn05CbPT.jpg"
    }
}