{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bh5jnK2SeUw7iTbg9QHIi24S01Q.jpg",
                "genre_ids": [
                    18,
                    16,
                    10749,
                    10752,
                    36
                ],
                "id": 378108,
                "original_language": "ja",
                "original_title": "この世界の片隅に",
                "overview": "Japan, 1943, during World War II. Young Suzu leaves her village near Hiroshima to marry and live with her in-laws in Kure, a military harbor. Her creativity to overcome deprivation quickly makes her indispensable at home. Inhabited by an ancestral wisdom, Suzu impregnates the simple gestures of everyday life with poetry and beauty. The many hardships, the loss of loved ones, the frequent air raids of the enemy, nothing alters her enthusiasm…",
                "popularity": 3.731,
                "poster_path": "/9Z4H4M2F8OQTB04YC1Opds8MFBb.jpg",
                "release_date": "2016-11-12",
                "title": "In This Corner of the World",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 587,
                "character": "Domoto (voice)",
                "credit_id": "5df65fe70d1e7f001371be31",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "世弥 きくよ"
        ],
        "biography": "Kikuyo Semi's acting journey began with her enrollment at the renowned \"New Theater Club Marui Actor Training School\" under the guidance of Nobuo Kaneko. Subsequently, Semi joined \"The Super Company\" led by Rui Takemura, marking the start of her illustrious career. She further expanded her horizons by becoming part of \"Lilliput Army\" in Osaka under the leadership of Nakajima. With a passion for nurturing young talents, Semi established the \"Semi-Seminar Theater Course\" and initiated her own production performances. Over the years, she has continued to excel in both theater and voice acting.",
        "birthday": "1962-01-01",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www12.plala.or.jp/semishop/semihp20.htm",
        "id": 2483018,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Kikuyo Semi",
        "place_of_birth": "Asakusa, Tokyo, Japan",
        "popularity": 0.0071,
        "profile_path": "/7YYcKYZBdP516IezmAJ8z3zjlmX.jpg"
    }
}