{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3G1Q5xF40HkUBJXxt2DQgQzKTp5.jpg",
                "genre_ids": [
                    16,
                    35,
                    10751,
                    14
                ],
                "id": 568124,
                "original_language": "en",
                "original_title": "Encanto",
                "overview": "The tale of an extraordinary family, the Madrigals, who live hidden in the mountains of Colombia, in a magical house, in a vibrant town, in a wondrous, charmed place called an Encanto. The magic of the Encanto has blessed every child in the family—every child except one, Mirabel. But when she discovers that the magic surrounding the Encanto is in danger, Mirabel decides that she, the only ordinary Madrigal, might just be her exceptional family's last hope.",
                "popularity": 14.6612,
                "poster_path": "/4j0PNHkMr5ax3IA8tjtxcmPU3QT.jpg",
                "release_date": "2021-10-13",
                "title": "Encanto",
                "video": false,
                "vote_average": 7.584,
                "vote_count": 9865,
                "character": "Luisa Madrigal (voice)",
                "credit_id": "60e6ff384ca676005e1a6d00",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Darrow was born in Miami, Florida. She is of Cuban descent. As a teenager, she would listen to songs by Lin-Manuel Miranda and watched Disney films. Darrow's first film role was Sarah in the 2019 film Feast of the Seven Fishes, directed by Robert Tinnell. She rose to fame in 2021 acting in the Disney animated feature film Encanto as the voice of Luisa Madrigal. She sang one of the film's most popular songs, \"Surface Pressure,\" which was certified platinum by the RIAA and peaked at number 8 on the Billboard Hot 100 chart in early 2022. Darrow voiced Mimi in Grand Theft Auto Online's 2021 update \"Los Santos Tuners.\"",
        "birthday": "1995-01-07",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 2489411,
        "imdb_id": "nm8731846",
        "known_for_department": "Acting",
        "name": "Jessica Darrow",
        "place_of_birth": "Miami, Florida, USA",
        "popularity": 0.3833,
        "profile_path": "/rJojc1ZUasEnUxSk7lL42RxyQbP.jpg"
    }
}