{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/csCSd8gftDRax0tiuo4VZJ9UaOo.jpg",
                "genre_ids": [
                    10752,
                    18,
                    53
                ],
                "id": 15383,
                "original_language": "fr",
                "original_title": "L'Armée des ombres",
                "overview": "Betrayed by an informant, Philippe Gerbier finds himself trapped in a torturous Nazi prison camp. Though Gerbier escapes to rejoin the Resistance in occupied Marseilles, France, and exacts his revenge on the informant, he must continue a quiet, seemingly endless battle against the Nazis in an atmosphere of tension, paranoia and distrust.",
                "popularity": 3.3563,
                "poster_path": "/aqNZWM9bspt8zaDvVRIRiWxRVJ7.jpg",
                "release_date": "1969-09-10",
                "title": "Army of Shadows",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 689,
                "character": "Camp Commander",
                "credit_id": "52fe46549251416c75074e4f",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Alain Mottet (30 December 1928 in Lyon, France – 31 October 2017 in Paris, France) was a French actor.\n\nAlain Mottet appeared in dozens of films, often in secondary roles. He appeared in three films with José Giovanni. In 1965, he played the main role in L'Affaire de la malle à Gouffé. In 1969, in L'Armée des ombres, he was responsible for the prison camp where Lino Ventura, alias Philippe Gerbier, was imprisoned.\n\nFor television, he played Flambart, the police officer who chased Eugène François Vidocq relentlessly, played by Bernard Noël in the TV series Vidocq in 1967. He regularly worked with director Abder Isker including on several episodes of Au théâtre ce soir. One of his most notable TV roles was as Shazénian in the fairytale Shéhérazade, shown at the end of 1971: on a flying horse, he walks with Claude Jade into the night sky.\n\nIn parallel to his screen career, he also continued to work on stage, most notably in plays by Jean Le Poulain, Roger Planchon, André Barsacq and Georges Wilson. He was part of the cast of the Comédie-Française from 1986 to 1988.\n\nMarried to Françoise Hirsch (1930-2017), until his death on 31 October 2017, he is the father of Christine Mottet and actor and musician Pierre Mottet.\n\nSource: Article \"Alain Mottet\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1928-12-30",
        "deathday": "2017-10-31",
        "gender": 2,
        "homepage": null,
        "id": 24907,
        "imdb_id": "nm0609526",
        "known_for_department": "Acting",
        "name": "Alain Mottet",
        "place_of_birth": "Lyon, Rhône, France",
        "popularity": 0.1469,
        "profile_path": "/fpUA7PrGzrOYoh0sFNJHicud2EU.jpg"
    }
}