{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/28vvMlh490bxipmhkbYTQissiof.jpg",
                "genre_ids": [
                    35,
                    10752,
                    10749
                ],
                "id": 198,
                "original_language": "en",
                "original_title": "To Be or Not to Be",
                "overview": "During the Nazi occupation of Poland, an acting troupe becomes embroiled in a Polish soldier's efforts to track down a German spy.",
                "popularity": 2.8853,
                "poster_path": "/dDQRpEoyjHT4fzw9cNklIvZuXYg.jpg",
                "release_date": "1942-03-06",
                "title": "To Be or Not to Be",
                "video": false,
                "vote_average": 7.8,
                "vote_count": 779,
                "character": "Maria Tura",
                "credit_id": "52fe4225c3a36847f8007ac5",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Кэрол Ломбард",
            "Carol Lombard",
            "Jane Peters",
            "Jane Alice Peters"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nCarole Lombard (born Jane Alice Peters, October 6, 1908 – January 16, 1942) was an American film actress. She was particularly noted for her energetic, often off-beat roles in the screwball comedies of the 1930s. She was the highest-paid star in Hollywood in the late 1930s. She was the third wife of actor Clark Gable.\n\nLombard was born into a wealthy family in Fort Wayne, Indiana, but was raised in Los Angeles by her single mother. At 12, she was recruited by the film director Allan Dwan and made her screen debut in A Perfect Crime (1921). Eager to become an actress, she signed a contract with the Fox Film Corporation at age 16, but mainly played bit parts. She was dropped by Fox after a car accident left a scar on her face. Lombard appeared in 15 short comedies for Mack Sennett between 1927 and 1929, and then began appearing in feature films such as High Voltage and The Racketeer. After a successful appearance in The Arizona Kid (1930), she was signed to a contract with Paramount Pictures.\n\nParamount quickly began casting Lombard as a leading lady, primarily in drama films. Her profile increased when she married William Powell in 1931, but the couple divorced after two years. A turning point in Lombard's career came when she starred in Howard Hawks' pioneering screwball comedy Twentieth Century (1934). The actress found her niche in this genre, and continued to appear in films such as Hands Across the Table (1935) (forming a popular partnership with Fred MacMurray), My Man Godfrey (1936), for which she was nominated for the Academy Award for Best Actress, and Nothing Sacred (1937). At this time, Lombard married \"the King of Hollywood\", Clark Gable, and the supercouple gained much attention from the media. Keen to win an Oscar, at the end of the decade, Lombard began to move towards more serious roles. Unsuccessful in this aim, she returned to comedy in Alfred Hitchcock's Mr. & Mrs. Smith (1941) and Ernst Lubitsch's To Be or Not to Be (1942)—her final film role.\n\nLombard's career was cut short when she died at the age of 33 in an airplane crash on Mount Potosi, Nevada while returning from a war bond tour. Today, she is remembered as one of the definitive actresses of the screwball comedy genre and American comedy, and ranks among the American Film Institute's greatest female stars of classic Hollywood cinema.",
        "birthday": "1908-10-06",
        "deathday": "1942-01-16",
        "gender": 1,
        "homepage": null,
        "id": 2491,
        "imdb_id": "nm0001479",
        "known_for_department": "Acting",
        "name": "Carole Lombard",
        "place_of_birth": "Fort Wayne, Indiana, USA",
        "popularity": 0.353,
        "profile_path": "/bPKG7DlExGyyl76A4OcGhO84P2L.jpg"
    }
}