{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/28vvMlh490bxipmhkbYTQissiof.jpg",
                "genre_ids": [
                    35,
                    10752,
                    10749
                ],
                "id": 198,
                "original_language": "en",
                "original_title": "To Be or Not to Be",
                "overview": "During the Nazi occupation of Poland, an acting troupe becomes embroiled in a Polish soldier's efforts to track down a German spy.",
                "popularity": 2.842,
                "poster_path": "/dDQRpEoyjHT4fzw9cNklIvZuXYg.jpg",
                "release_date": "1942-03-06",
                "title": "To Be or Not to Be",
                "video": false,
                "vote_average": 7.828,
                "vote_count": 779,
                "character": "Greenberg",
                "credit_id": "52fe4225c3a36847f8007ad1",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/wqgZSvgoctaadgwUdPYVsksivxn.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749
                ],
                "id": 20334,
                "original_language": "en",
                "original_title": "The Shop Around the Corner",
                "overview": "Two employees at a gift shop can barely stand one another, without realising that they are falling in love through the post as each other's anonymous pen pal.",
                "popularity": 3.5227,
                "poster_path": "/dZ1aEzGYRiqJwPfjS6VL7wUkHmF.jpg",
                "release_date": "1940-01-12",
                "title": "The Shop Around the Corner",
                "video": false,
                "vote_average": 8.1,
                "vote_count": 766,
                "character": "Pirovitch",
                "credit_id": "52fe43e2c3a368484e003b11",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Феликс Брессарт"
        ],
        "biography": "From Wikipedia, the free encyclopedia.  Felix Bressart (March 2, 1892 – March 17, 1949) was a German-American actor of stage and screen.\n\nFelix Bressart (pronounced \"BRESS-ert\") was born in East Prussia, Germany (now part of Russia) and was already a very experienced stage actor when he had his film debut in 1928. He started off as a supporting actor, e.g. as the Bailiff in the box-office hit Die Drei von der Tankstelle (1930), but had soon established himself in leading roles of minor movies. After the Nazis seized power in 1933, Jewish-born Bressart had to leave Germany and continued his career in German-speaking movies in Austria, where Jewish artists were still relatively safe. After no fewer than 30 films in eight years, he emigrated to the United States.\n\nOne of Bressart's former European colleagues was Joe Pasternak, now a successful Hollywood producer. Bressart's first American film was Three Smart Girls Grow Up (1939), a vehicle for Universal Pictures' top attraction, Deanna Durbin. Pasternak also selected the reliable Bressart to perform in a screen test opposite Pasternak's newest discovery, Gloria Jean. The influential German community in Hollywood helped to establish Bressart in America, as his earliest American movies were directed by Ernst Lubitsch, Henry Koster, and Wilhelm Thiele (director of Die Drei von der Tankstelle).\n\nBressart scored a great success in Lubitsch's Ninotchka, produced at Metro-Goldwyn-Mayer. MGM signed Bressart to a studio contract in 1939. Most of his MGM work consisted of featured roles in major films like Edison, the Man.\n\nHe combined his mildly inflected East European accent with a soft-spoken delivery to create kindly, friendly characters, as in Lubitsch's To Be or Not to Be, in which he sensitively recites Shylock's famous \"Hath not a Jew eyes?\" speech from The Merchant of Venice. Lubitsch also directed Bressart to similar effect in The Shop Around the Corner.\n\nBressart soon became a popular character actor in films like Blossoms in the Dust (1941), The Seventh Cross (1944), and Without Love (1945). Perhaps his largest role was in RKO Radio Pictures' \"B\" musical comedy Ding Dong Williams, filmed in 1945. Bressart, billed third, played the bemused supervisor of a movie studio's music department, and appeared in formal wear to conduct Chopin's \"Fantasie Impromptu.\"\n\nAfter almost 40 Hollywood pictures, Felix Bressart suddenly died of leukemia at the age of 57. His last film was My Friend Irma (1949), the movie version of a popular radio show. Bressart died during production, forcing the producers to finish the film with Hans Conried. In the final film, Conried speaks throughout, but Bressart is still seen in the long shots.\n\nDescription above from the Wikipedia article Felix Bressart, licensed under CC-BY-SA,full list of contributors on Wikipedia.     ",
        "birthday": "1892-03-02",
        "deathday": "1949-03-17",
        "gender": 2,
        "homepage": null,
        "id": 2494,
        "imdb_id": "nm0107795",
        "known_for_department": "Acting",
        "name": "Felix Bressart",
        "place_of_birth": "Eydtkuhnen, East Prussia, Germany [now Chernyshevskoe, Russia]",
        "popularity": 0.1453,
        "profile_path": "/h8Ac7m2toKeDCt2VjNV7s9ytgo7.jpg"
    }
}