{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wDLgGI6Rswo30YkWoM6TGq0VWVy.jpg",
                "genre_ids": [
                    35,
                    18,
                    14,
                    10749
                ],
                "id": 13198,
                "original_language": "en",
                "original_title": "Wristcutters: A Love Story",
                "overview": "Zia, distraught over breaking up with his girlfriend, decides to end it all. Unfortunately, he discovers that there is no real ending, only a run-down afterlife that is strikingly similar to his old one, just a bit worse. Discovering that his ex-girlfriend has also \"offed\" herself, he sets out on a road trip to find her.",
                "popularity": 4.1179,
                "poster_path": "/qModiIR60IMLP28ruGZluQOtsOj.jpg",
                "release_date": "2007-10-19",
                "title": "Wristcutters: A Love Story",
                "video": false,
                "vote_average": 6.966,
                "vote_count": 580,
                "character": "Messiah Bodyguard",
                "credit_id": "65cfbd93967cc70164fe2e50",
                "order": 37
            },
            {
                "adult": false,
                "backdrop_path": "/80uHK2xWwjlOxmfJ1wQB09omAht.jpg",
                "genre_ids": [
                    10749,
                    35,
                    80,
                    14
                ],
                "id": 854,
                "original_language": "en",
                "original_title": "The Mask",
                "overview": "When timid bank clerk Stanley Ipkiss discovers a magical mask containing the spirit of the Norse god Loki, his entire life changes. While wearing the mask, Ipkiss becomes a supernatural playboy exuding charm and confidence which allows him to catch the eye of local nightclub singer Tina Carlyle. Unfortunately, under the mask's influence, Ipkiss also robs a bank, which angers junior crime lord Dorian Tyrell, whose goons get blamed for the heist.",
                "popularity": 10.4293,
                "poster_path": "/yd3wjLLeQHJ3oRDy4wwiNNFVyLW.jpg",
                "release_date": "1994-07-29",
                "title": "The Mask",
                "video": false,
                "vote_average": 6.969,
                "vote_count": 10735,
                "character": "Orlando",
                "credit_id": "5ded445f025764001452e168",
                "order": 38
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/yzQ0mkz1OUJKtUK1NWp53jiGcaJ.jpg",
                "genre_ids": [
                    35,
                    878,
                    12
                ],
                "id": 926,
                "original_language": "en",
                "original_title": "Galaxy Quest",
                "overview": "For four years, the courageous crew of the NSEA protector - \"Commander Peter Quincy Taggart\", \"Lt. Tawny Madison and \"Dr.Lazarus\" - set off on a thrilling and often dangerous mission in space...and then their series was cancelled! Now, twenty years later, aliens under attack have mistaken the Galaxy Quest television transmissions for \"historical documents\" and beam up the crew of has-been actors to save the universe. With no script, no director and no clue, the actors must turn in the performances of their lives.",
                "popularity": 2.144,
                "poster_path": "/fZXSwgZknp81vmciTb86rw0MejV.jpg",
                "release_date": "1999-12-25",
                "title": "Galaxy Quest",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 2384,
                "credit_id": "65728aa34b6d9d00ad1e5159",
                "department": "Crew",
                "job": "Stunts"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Nils A. Stewart",
            "Nils Stewart",
            "Nils Allen Stuart",
            "نیلس آلن استوارت"
        ],
        "biography": "Nils Allen Stewart (Born July 19th, 1961) is an American Actor and stuntman with nearly 300 credits to his name on-screen and for stunt work. When on screen he is often typecast as a thug, henchmen, enforcer or some kind of tough role. He is perhaps best remembered for his role as Orlando, The righthand man of Dorian Tyrell (played Peter Greene), in the 1994 Oscar nominated comedy The Mask which starred Jim Carrey and Cameron Diaz.  Stewart began his acting career with roles in such films as the action film \"Cop and A Half\" (1993) with Burt Reynolds, the Dan Aykroyd comedy \"Coneheads\" (1993) and the action flick \"The Shadow\" (1994) with Alec Baldwin. He also appeared in the Robert Patrick action picture \"Double Dragon\" (1994) and the action movie \"Soul of the Avenger\" (1995) with Mark Pellegrino. In the nineties and the early 2000s, Stewart devoted his time to various credits, such as \"The Chamber\" (1996) starring Chris O'Donnell, \"The Quest\" (1996) and \"Meet Wally Sparks\" (1997). He also worked on \"Hitman's Run\" (2000) starring Eric Roberts. Stewart continued to exercise his talent in the early 2000s, taking on a mix of projects like \"Undisputed\" (2002), the Adam Sandler and Jack Nicholson box office smash \"Anger Management\" (2003) and \"Brick\" with Joseph Gordon-Levitt (2006). His credits also expanded to \"Eragon\" with Ed Speleers (2006) and \"Man of Faith\" (2006) starring Damian Chapa. Most recently, Stewart worked on the Thomas Horn adventure for the whole family \"Space Warriors\" (2013). He is married to Renee Steward and they have 4 children. He is the father of Booboo and Fivel Stewart.",
        "birthday": "1961-07-19",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 24968,
        "imdb_id": "nm0829699",
        "known_for_department": "Acting",
        "name": "Nils Allen Stewart",
        "place_of_birth": null,
        "popularity": 0.5226,
        "profile_path": "/qeTM6yMFJeP9dhudYGAKduzaoGD.jpg"
    }
}