{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/28vvMlh490bxipmhkbYTQissiof.jpg",
                "genre_ids": [
                    35,
                    10752,
                    10749
                ],
                "id": 198,
                "original_language": "en",
                "original_title": "To Be or Not to Be",
                "overview": "During the Nazi occupation of Poland, an acting troupe becomes embroiled in a Polish soldier's efforts to track down a German spy.",
                "popularity": 2.8853,
                "poster_path": "/dDQRpEoyjHT4fzw9cNklIvZuXYg.jpg",
                "release_date": "1942-03-06",
                "title": "To Be or Not to Be",
                "video": false,
                "vote_average": 7.8,
                "vote_count": 779,
                "character": "Professor Alexander Siletsky",
                "credit_id": "52fe4225c3a36847f8007ad9",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Stanley Charles Ridges",
            "Stanley C. Ridges"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nStanley Ridges (17 July 1890 – 22 April 1951) was a British-born actor who made his mark in films by playing a wide assortment of character parts.\n\nBorn 17 July 1890 in Southampton, Hampshire, England, UK, Stanley Ridges became a protégé of Beatrice Lillie, a star of musical stage comedies, and spent many years learning and honing his craft on the stage. Eventually making his way to America, Ridges began as a song-and-dance man on Broadway, but later turned to dramatic roles onstage, appearing in such plays as Maxwell Anderson's Mary of Scotland (as Lord Morton) and Valley Forge (as Lieutenant Colonel Lucifer Tench), becoming a romantic leading man.\n\nRidges' silent film debut was in Success (1923). With his excellent diction and rich speaking voice, he easily made the transition into sound films, with his career taking off at age 43, in Crime Without Passion (1934), with Claude Rains. Ridges found himself cast in character roles, as his greying hair put his romantic leading man days at an end. His most best known roles were probably two different characters in one film, one of them the kindly Professor Kingsley and the other the murderous Red Cannon in the thriller Black Friday (1940). The Jekyll and Hyde transformations gave Ridges a chance to display his acting ability.\n\nRidges was often cast in supporting roles in many classic films, and played the lead only once, in the B-picture False Faces (1943).\n\nAmong Ridges's other film roles were as the Scotland Yard inspector who is shadowing Charles Laughton in the film The Suspect (1944), as Major Buxton (Gary Cooper's commanding officer) in Sergeant York (1942), as Professor Siletsky in To Be or Not to Be (also 1942), and as Cary Travers Grayson, the official White House physician in Wilson (1944).\n\nBy 1950, he had just begun appearing in television anthologies such as Studio One and Philco Television Playhouse. His last feature film, the Ginger Rogers comedy The Groom Wore Spurs, in which he played a mobster, was released a month before he died.\n\nStanley Ridges died 22 April 1951, in Westbrook, Connecticut, aged 60.",
        "birthday": "1890-07-17",
        "deathday": "1951-04-22",
        "gender": 2,
        "homepage": null,
        "id": 2496,
        "imdb_id": "nm0725897",
        "known_for_department": "Acting",
        "name": "Stanley Ridges",
        "place_of_birth": "Southampton, Hampshire, England, UK",
        "popularity": 0.2523,
        "profile_path": "/cL10nYNDpZru4Smqy9EfkBLUh4O.jpg"
    }
}