{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/czfbhgM0cjFqPt4ARofDKgRHCyj.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 5967,
                "original_language": "fr",
                "original_title": "Les Parapluies de Cherbourg",
                "overview": "This simple romantic tragedy begins in 1957. Guy Foucher, a 20-year-old French auto mechanic, has fallen in love with 17-year-old Geneviève Emery, an employee in her widowed mother's chic but financially embattled umbrella shop. On the evening before Guy is to leave for a two-year tour of combat in Algeria, he and Geneviève make love. She becomes pregnant and must choose between waiting for Guy's return or accepting an offer of marriage from a wealthy diamond merchant.",
                "popularity": 2.6586,
                "poster_path": "/tAgTf64XKK5ir7w5C7dnB53jWWG.jpg",
                "release_date": "1964-02-19",
                "title": "The Umbrellas of Cherbourg",
                "video": false,
                "vote_average": 7.406,
                "vote_count": 836,
                "character": "Geneviève Emery (singing voice)",
                "credit_id": "5e0d5f6b8586780018c1be4b",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Danielle Licari is a French singer who was active in the 1960s and 1970s. She's now remembered primarily as the vocalist in Concerto pour une Voix.\n\nIn 1964, she dubbed the singing in the movie The Umbrellas of Cherbourg for the role of Geneviève Emery, played by Catherine Deneuve.\n\nFrom 1965 to 1967 she sang in the vocal trio Les Fizz with Jackie Castan and Nadine Doukhan, two other ex-Djinns Singers. Backed by Jacques Denjean's orchestra, the band released three EP.\n\nIn 1968, she recorded \"Treize jours en France\", composed by Francis Lai; she also recorded a second version of \"Love Story\" dedicated to her by the same composer.\n\nIn 1969, she recorded her greatest hit, \"Concerto pour une Voix\". The album has sold over 15 million copies.\n\nIn 1972, she submitted her song \"Au cœur d'une chanson\" to compete in the Eurovision contest representing France. The French committee selected Betty Mars and her song \"Come-Comedie\" instead.\n\nIn 1972, she represented France in the \"World Popular Song Festival\" held in Tokyo, Japan. Her song \"Une Vie\" was a finalist.\n\nIn 1973, she participated as a vocalist to an album considered as a masterpiece of French chanson: the symphonic, dark and epic Il n'y a plus rien (There is nothing anymore) by singer-songwriter Léo Ferré.\n\nIn July 1978, she sang with the Quebec Symphony Orchestra and the choir of St-Dominique Church. The piece chosen was a musical drama called Concerto pour Helene, in honour of Helene Boule, the wife of the founder of Quebec City, as part of the city's 370th anniversary celebrations. The work was composed by Claude Léveillée.\n\nIn 1982, she voiced Princess Aurora in the French dub of Sleeping Beauty.\n\nWyclef Jean sampled \"Concerto Pour Une Voix\" in his 1997 song \"Apocalypse.\"\n\nShe has sold over 20 million copies of her albums during her career. Her songs are found in easy listening CD compilations worldwide.\n\nHer characteristic singing style lacked lyrics, communicating emotions through sounds, the way a violin would. This may have fueled her popularity in non-French speaking countries like Germany, Spain, Mexico, Brazil, Japan and Korea. She used her voice like a musical instrument giving a soft, unique dream-like tone. She has been called la voz de la sirena (\"the voice of a Siren\"). Most of her recordings are arrangements of classical themes composed originally for instruments rather than voice, while the arrangements consist generally of large orchestral ensembles mixed with a pop-rock band instrumentation. She incorporated pop-rock elements that made her music appealing. Her singing style influenced Japanese Anime soundtracks of the 1980s such as Seiji Yokoyama (Saint Seiya).\n\nSource: Article \"Danielle Licari\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1936-11-30",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 2496414,
        "imdb_id": "nm1061234",
        "known_for_department": "Acting",
        "name": "Danielle Licari",
        "place_of_birth": "Boulogne-sur-Mer, Pas-de-Calais, France",
        "popularity": 0.0363,
        "profile_path": "/o73RY0qda2zBbxeo6PjV35jLONf.jpg"
    }
}