{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sGOw65ZmfgGfistCjuNsazjs6j9.jpg",
                "genre_ids": [
                    37,
                    18,
                    12
                ],
                "id": 281957,
                "original_language": "en",
                "original_title": "The Revenant",
                "overview": "In the 1820s, a frontiersman, Hugh Glass, sets out on a path of vengeance against those who left him for dead after a bear mauling.",
                "popularity": 9.7586,
                "poster_path": "/ji3ecJphATlVgWNY0B0RVXZizdf.jpg",
                "release_date": "2015-12-25",
                "title": "The Revenant",
                "video": false,
                "vote_average": 7.536,
                "vote_count": 18675,
                "character": "Powaqa",
                "credit_id": "5e0faaf76f43ec0014588bfd",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Melaw Nakehk'o's professional acting debut in The Revenant is the natural progression of her distinguished career as an artist and community leader. Born in Canada's north, raised in the community of Liidlii Kue, Melaw comes from a long line of tribal leaders of the Dehcho Dene & Denesuline people.\n\nMelaw attended the prestigious Institute of American Indian Arts in Santa Fe, where she earned a degree in 2 dimensional arts. Melaw is also recognized for her exemplary work in revitalizing traditional Indigenous artistic practices, with contemporary applications of ancient techniques. Her work in reviving and teaching moosehide tanning techniques has initiated a resurgence of the practice and shaped a broader community building movement within Canada. She is a Founding Member of Dene Nahjo, and is a regular instructor at the Dechinta Centre for Research and Learning, a land-based university program.\n\nMelaw has three sons and lives in Yellowknife, Northwest Territories, Canada.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 2498673,
        "imdb_id": "nm7506216",
        "known_for_department": "Acting",
        "name": "Melaw Nakehk'o",
        "place_of_birth": null,
        "popularity": 0.2767,
        "profile_path": "/m52aGnTKiiJm2wlzLQE6G3yVlWw.jpg"
    }
}