{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/he0XbwtxDiRnPERvboWMkvXFdAJ.jpg",
                "genre_ids": [
                    18,
                    53
                ],
                "id": 807196,
                "original_language": "en",
                "original_title": "Boiling Point",
                "overview": "A head chef balances multiple personal and professional crises at a popular restaurant in London.",
                "popularity": 3.4418,
                "poster_path": "/kdkk7OBnIL1peW2zwcAAp6O54Jo.jpg",
                "release_date": "2021-07-05",
                "title": "Boiling Point",
                "video": false,
                "vote_average": 7.233,
                "vote_count": 659,
                "character": "Andrea",
                "credit_id": "60d5c84a9979d2002f7ad476",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Lauryn Ajufo is an English actress. She was nominated for a British Independent Film Award for her role in the film Boiling Point (2021). She was named a 2022 Screen International Star of Tomorrow and appeared on the Evening Standard list of Londoners to watch.\n\nAjufo was born in Southwark, London. She is of Nigerian descent. She attended the BRIT School and joined the Youth Theatre at the Theatre Royal Stratford East.\n\nAjufo was discovered in 2018 through a monologue slam competition. Philip Barantini cast her as Renee in his 2019 short film Boiling Point and gave her a role in his 2020 debut feature Villain. That same year, she made her television debut with a guest appearance in the soap opera Holby City. Ajufo went on to reprise her Boiling Point role in its 2021 feature length adaptation, this time playing Andrea alongside Stephen Graham. For her performance, Ajufo received critical acclaim and was nominated for the British Independent Film Award for Breakthrough Performance.\n\nIn 2022, Ajufo starred as Misha Morris in the Netflix science fiction series The Last Bus and Neve in the ITVX and ITV2 teen drama Tell Me Everything. She is set to reunite with Barantini, starring opposite Chaneil Kular in Accused. She also has upcoming roles in the series Everything Now and the film Luther: The Fallen Sun, both on Netflix.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 2498635,
        "imdb_id": "nm10251159",
        "known_for_department": "Acting",
        "name": "Lauryn Ajufo",
        "place_of_birth": "Southwark, London, England, UK",
        "popularity": 0.1346,
        "profile_path": "/pOlYVDxNcxPcK4F0U2eo8KMKxpr.jpg"
    }
}