{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5zTwAcnI3zCJ0mucPPnoBtkSWEV.jpg",
                "genre_ids": [
                    35,
                    10749,
                    80
                ],
                "id": 239,
                "original_language": "en",
                "original_title": "Some Like It Hot",
                "overview": "Two musicians witness a mob hit and struggle to find a way out of the city. Their only opportunity comes in the form of joining an all-girl band as they prepare to leave on a tour. The two disguise themselves as women and struggle to keep their identities secret as they deal with the problems this brings.",
                "popularity": 6.0458,
                "poster_path": "/hVIKyTK13AvOGv7ICmJjK44DTzp.jpg",
                "release_date": "1959-03-19",
                "title": "Some Like It Hot",
                "video": false,
                "vote_average": 8.096,
                "vote_count": 3670,
                "character": "Gangster (uncredited)",
                "credit_id": "5e128dc38741c400173d331f",
                "order": 28
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Ted Christy is a great example of somebody whose profession could take you all over the world and help you live life to the fullest. Both Ted and his brother Vic Christy were what you would call enhancement talents for the NWA and various other wrestling promotions. Their main jobs were to make the good guys look great without doing too much to take away from the appeal of the good guys popularity or momentum.\n\nHe started out wrestling really young in the NWA, and various promotions based in Puerto Rico, Australia, and other countries throughout the world. Like many wrestlers, he couldn't stay in one territory too long or the fans would get tired of seeing him. He was known to be a really good guy and somebody who could take a good joke.\n\nThrough his wrestling, he was able to obtain roles in a few movies in the early 1950s and he also managed to appear in an episode of the Twilight Zone portraying a wrestler on television screen. Christy continued to wrestle throughout the early 1960s when eventually he decided to retire. It was through his friendship with Mike Mazurki and other athletes that he was able to get into the Screen Extras Guild. This lead to him being cast as an extra and the occasional stunt double for Joe E. Ross on the television show It's About Time.\n\nWhen It's About Time was canceled after one season, Christy found himself appearing in an assortment of roles that were typically either a cowboy on shows like Gunsmoke or a hood on criminal shows like Kojak. His rough looking appearance made both he and his brother naturals to appear in Gunsmoke where he was well liked by the various crew members that worked with him.\n\nThough Christy passed away in 1976, he left lasting legacy of an entertainer who wrestled in front of thousands of people for over 30 years and who later transitioned into television and movies where he excelled at playing various roles while making many friends along the way.",
        "birthday": "1909-11-25",
        "deathday": "1976-09-11",
        "gender": 2,
        "homepage": null,
        "id": 2501540,
        "imdb_id": "nm0160722",
        "known_for_department": "Acting",
        "name": "Ted Christy",
        "place_of_birth": "California, USA",
        "popularity": 0.1793,
        "profile_path": null
    }
}