{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wygUDDRNpeKUnkekRGeLCZM93tA.jpg",
                "genre_ids": [
                    878,
                    28,
                    12,
                    53
                ],
                "id": 199,
                "original_language": "en",
                "original_title": "Star Trek: First Contact",
                "overview": "The Borg, a relentless race of cyborgs, are on a direct course for Earth. Violating orders to stay away from the battle, Captain Picard and the crew of the newly-commissioned USS Enterprise E pursue the Borg back in time to prevent the invaders from changing Federation history and assimilating the galaxy.",
                "popularity": 5.08,
                "poster_path": "/iqhHe893Vcf07jNkNQ31tu85dKG.jpg",
                "release_date": "1996-11-22",
                "title": "Star Trek: First Contact",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1852,
                "character": "Borg Queen",
                "credit_id": "52fe4226c3a36847f8007b5f",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Alice Maud Krige",
            "آلیس کریج"
        ],
        "biography": "Alice Maud Krige is a South African actress and producer. Her first feature film role was as the Gilbert and Sullivan singer Sybil Gordon in the 1981 Academy Award-winning film Chariots of Fire. Since then, she has played a variety of roles in a number of genres. Krige first played the role of the Borg Queen in the motion picture Star Trek: First Contact and reprised the role for the final episode of the television series Star Trek: Voyager. A year after the series ended, she reprised the role in \"Borg Invasion 4-D\" at Star Trek: The Experience.\n\nShe attended Rhodes University in Grahamstown where she pursued an undergraduate degree in psychology and literature, but quickly turned to acting, earning an honors degree in drama from Rhodes, before a moving to London to pursue a new career path. Once in England, she studied drama at the London Central School of Speech and Drama before making her acting performance debut in the 1979 BBC Play for Today.  \n\nAfter achieving critical acclaim for her role in Chariot's of Fire, and continued to star and support in both film and stage theater throughout the 1980s.  This eclectic trend continued into the 1990s before turning to television for both starring and reoccurring minor roles in prominent television series.  In addition, she continued to make sporadic convention appearances and was recently awarded an honorary doctorate in literature from Rhodes University.  Alice Krige is married to writer/director, Paul Schoolman, and lives what she describes as an \"itinerant\" lifestyle. Although she and her husband maintain a permanent home in the United States, they spend much of their time living and working abroad.",
        "birthday": "1954-06-28",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 2506,
        "imdb_id": "nm0000481",
        "known_for_department": "Acting",
        "name": "Alice Krige",
        "place_of_birth": "Upington, South Africa",
        "popularity": 1.4303,
        "profile_path": "/gwkI4FAYnhkp9NWV3meATzQql0v.jpg"
    }
}