{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/93iDrZmjDF01Tn3PxOYL8Zz9hBM.jpg",
                "genre_ids": [
                    80,
                    53
                ],
                "id": 11657,
                "original_language": "fr",
                "original_title": "Le Cercle rouge",
                "overview": "When French criminal Corey gets released from prison, he resolves to never return. He is quickly pulled back into the underworld, however, after a chance encounter with escaped murderer Vogel. Along with former policeman and current alcoholic Jansen, they plot an intricate jewel heist. All the while, quirky Police Commissioner Mattei, who was the one to lose custody of Vogel, is determined to find him.",
                "popularity": 1.3966,
                "poster_path": "/w56La43IJnGpLepgqfGCAZsbQPp.jpg",
                "release_date": "1970-10-19",
                "title": "Le Cercle Rouge",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 679,
                "character": "Policeman",
                "credit_id": "52fe44729251416c75035147",
                "order": 17
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/7AvbU0ei7Fz21jqBL4tlgSufnMp.jpg",
                "genre_ids": [
                    53,
                    80,
                    18
                ],
                "id": 2721,
                "original_language": "fr",
                "original_title": "Z",
                "overview": "Amid a tense political climate, the opposition leader is killed in an apparent accident. When a prosecutor smells a cover-up, witnesses get targeted. A thinly veiled dramatization of the assassination of Greek politician Grigoris Lambrakis and its aftermath, “Z” captures the outrage at the US-backed junta that ruled Greece at the time of its release.",
                "popularity": 2.7224,
                "poster_path": "/dFAJyFNgvOv24f2RQyI9KDxjGr3.jpg",
                "release_date": "1969-02-26",
                "title": "Z",
                "video": false,
                "vote_average": 7.8,
                "vote_count": 580,
                "credit_id": "56565f99c3a3681982006317",
                "department": "Crew",
                "job": "Stunt Coordinator"
            },
            {
                "adult": false,
                "backdrop_path": "/1yWn9A2LN0uRGudIg0bV2Np6T69.jpg",
                "genre_ids": [
                    10752,
                    28,
                    18
                ],
                "id": 9289,
                "original_language": "en",
                "original_title": "The Longest Day",
                "overview": "The retelling of June 6, 1944, from the perspectives of the Germans, US, British, Canadians, and the Free French. Marshall Erwin Rommel, touring the defenses being established as part of the Reich's Atlantic Wall, notes to his officers that when the Allied invasion comes they must be stopped on the beach. \"For the Allies as well as the Germans, it will be the longest day\"",
                "popularity": 3.4967,
                "poster_path": "/5zmvEofdIlgXrQl9A7e5IOzlnFU.jpg",
                "release_date": "1962-09-25",
                "title": "The Longest Day",
                "video": false,
                "vote_average": 7.594,
                "vote_count": 977,
                "credit_id": "65ae7fb467b613010c60252c",
                "department": "Crew",
                "job": "Stunts"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ivan Chiffre"
        ],
        "biography": "Yvan Chiffre (3 March 1936 – 27 September 2016) was a French director, producer, and stunt coordinator. He is the father of Philippe Chiffre, Romain Chiffre and the grand father of César Chiffre.\n\nHe was the stunt coordinator of Thunderball and Triple Cross by Terence Young, Is Paris Burning? by René Clément, Z by Costa Gavras, Hotel Paradiso by Peter Glenville.\n\nHe was also the official stunt double of Jean Marais and Alain Delon, was stunt man on the Longest Day, and stunt double of Cary Grant in Charade, Sterling Hayden in Poppies Are Also Flowers, Eddie Constantine in Lucky Jo and many others...\n\nHe also contributed to major French films like Zorro by Duccio Tessari, La Grande Vadrouille by Gérard Oury, Le Cercle Rouge by Jean-Pierre Melville, and more than 200 others.\n\nIn 1992, he published an autobiography A l'ombre des stars, about his stuntman life.\n\nIn 2014, he received in Paris the UNESCO prize.\n\nIn 2017, the Academy Award, Oscars In Memoriam honors Yvan Chiffre for his life achievement.\n\nSource: Article \"Yvan Chiffre\" from Wikipedia in English, licensed under CC-BY-SA.",
        "birthday": "1936-03-03",
        "deathday": "2016-09-27",
        "gender": 2,
        "homepage": null,
        "id": 251203,
        "imdb_id": "nm0157352",
        "known_for_department": "Acting",
        "name": "Yvan Chiffre",
        "place_of_birth": "Rousson, Gard, France",
        "popularity": 0.1283,
        "profile_path": "/lkM5LpYBxYVVUVZVmW0W6ppry5j.jpg"
    }
}