{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4js6VLf6qHWUbW42BpXiQKPBP7t.jpg",
                "genre_ids": [
                    35,
                    27
                ],
                "id": 814,
                "original_language": "en",
                "original_title": "An American Werewolf in London",
                "overview": "American tourists David and Jack are savaged by an unidentified vicious animal whilst hiking on the Yorkshire Moors. Retiring to the home of a beautiful nurse to recuperate, David soon experiences disturbing changes to his mind and body.",
                "popularity": 4.013,
                "poster_path": "/hVEqUASJmCQaolkKFEySCHZ8uKG.jpg",
                "release_date": "1981-08-21",
                "title": "An American Werewolf in London",
                "video": false,
                "vote_average": 7.408,
                "vote_count": 2546,
                "character": "Shop Owner (uncredited)",
                "credit_id": "654cd9535a5ed000c6ad02de",
                "order": 57
            },
            {
                "adult": false,
                "backdrop_path": "/2ZbYjD4j3RzUZ7PvPb8toKQeF4.jpg",
                "genre_ids": [
                    37
                ],
                "id": 336,
                "original_language": "it",
                "original_title": "Giù la testa",
                "overview": "At the beginning of the 1913 Mexican Revolution, greedy bandit Juan Miranda and idealist John H. Mallory, an Irish Republican Army explosives expert on the lam from the British, fall in with a band of revolutionaries plotting to strike a national bank. When it turns out that the government has been using the bank as a hiding place for illegally detained political prisoners -- who are freed by the blast -- Miranda becomes a revolutionary hero against his will.",
                "popularity": 3.376,
                "poster_path": "/l91bdMjPYUXRLjOnBosxCGickKa.jpg",
                "release_date": "1971-10-29",
                "title": "Duck, You Sucker",
                "video": false,
                "vote_average": 7.701,
                "vote_count": 1129,
                "character": "Conductor (uncredited)",
                "credit_id": "5e21c96d2811a10013a2113f",
                "order": 33
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Simon van Collem (Amsterdam, March 27, 1919 - Amsterdam, June 21, 1989) was a Dutch journalist and television maker who focused on film journalism.\n\nVan Collem worked as a sales manager at a film company in the 1950s. He was asked by Volkskrant editor Bob Bertina to write a series of articles about the history of the Dutch film industry. The series of articles under the title De oude draaidoos appeared in the Volkskrant from December 24, 1954 and led to the invitation in 1958 to make television programs for the VPRO under the title Uit de oude draaidoos. In 1959, Van Collem also wrote the book Uit de oud Draaidoos, which, despite its juicy anecdotes and atmospheric descriptions, was for many years the most important book on Dutch film history. Film historians later ruled that it contained several inaccuracies.\n\nUntil 1970 he made his film column for the VPRO. That year he switched to the AVRO where he continued the program under the title Avroskoop. In 1975 he moved to TROS and the program was renamed Simonskoop.\n\nVan Collem died in 1989 in the harness due to cardiac arrest during the gala premiere of the James Bond film License to Kill in the Amsterdam cinema Theater Tuschinski, shortly after he had interviewed Bond actor Timothy Dalton.\n\n(From Dutch Wikipedia)",
        "birthday": "1919-03-27",
        "deathday": "1989-06-21",
        "gender": 2,
        "homepage": null,
        "id": 2512805,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Simon van Collem",
        "place_of_birth": "Amsterdam, Noord-Holland, Netherlands",
        "popularity": 0.0071,
        "profile_path": "/2aTN9mJiTLjRYpv0wI1l60bkGrC.jpg"
    }
}