{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1yWn9A2LN0uRGudIg0bV2Np6T69.jpg",
                "genre_ids": [
                    10752,
                    28,
                    18
                ],
                "id": 9289,
                "original_language": "en",
                "original_title": "The Longest Day",
                "overview": "The retelling of June 6, 1944, from the perspectives of the Germans, US, British, Canadians, and the Free French. Marshall Erwin Rommel, touring the defenses being established as part of the Reich's Atlantic Wall, notes to his officers that when the Allied invasion comes they must be stopped on the beach. \"For the Allies as well as the Germans, it will be the longest day\"",
                "popularity": 3.5233,
                "poster_path": "/5zmvEofdIlgXrQl9A7e5IOzlnFU.jpg",
                "release_date": "1962-09-25",
                "title": "The Longest Day",
                "video": false,
                "vote_average": 7.594,
                "vote_count": 977,
                "character": "Father Louis Roulland",
                "credit_id": "52fe44e2c3a36847f80afcaf",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jean-Louis Bernard Barrault"
        ],
        "biography": "Jean-Louis Barrault (8 September 1910, Le Vésinet, Yvelines – 22 January 1994) was a French actor, director and mime artist, training that served him well when he portrayed the 19th-century mime Jean-Gaspard Deburau (Baptiste Debureau) in Marcel Carné's 1945 film Les Enfants du Paradis (Children of Paradise).\n\nJean-Louis Barrault studied with Charles Dullin in whose troupe he acted from 1933 to 1935. At 25 years of age, he met and studied with the mime Étienne Decroux. From 1940 to 1946 he was a member of the Comédie-Française, where he directed productions of Paul Claudel's Le Soulier de satin and Jean Racine's Phèdre, two plays that made his reputation.\n\nOver his career, he acted in nearly 50 movies including Les beaux jours, Jenny, L'Or dans la Montagne and Sous les Yeux d'occident.\n\nIn 1940, he married the actress Madeleine Renaud. They founded a number of theatres together and toured extensively, including in South America.\n\nHe was the uncle of actress Marie-Christine Barrault and sometime sponsor of Peter Brook. He died from a heart attack in Paris at the age of 83. Jean-Louis Barrault is buried with his wife Madeleine Renaud in the Passy Cemetery in Paris.\n\nJean-Louis Barrault, Reflections on the Theatre:\n\n    \"In fact it is the simplest things that are the most tricky to do well. To read, for example. To be able to read exactly what is written without omitting anything that is written and at the same time without adding anything of one's own. To be able to capture the exact context of the words one is reading. To be able to read!\"\n\nBarrault from Melinda Camber Porter's Through Parisian Eyes: Reflections on Contemporary French Arts and Culture:\n\n    \"When I wake up in the morning I want to feel hungry for life. Desire is what drives me. When I go to sleep, I feel I have experienced a small death, so that I can wake up in the morning renewed and reborn.\"\n\nDescription above from the Wikipedia article Jean-Louis Barrault, licensed under CC-BY-SA, full list of contributors on Wikipedia.​",
        "birthday": "1910-09-08",
        "deathday": "1994-01-22",
        "gender": 2,
        "homepage": null,
        "id": 25155,
        "imdb_id": "nm0056761",
        "known_for_department": "Acting",
        "name": "Jean-Louis Barrault",
        "place_of_birth": "Le Vésinet, Yvelines, Île-de-France, France",
        "popularity": 0.1305,
        "profile_path": "/37KmUtpgLFSLBNsQqoRElnE17jX.jpg"
    }
}