{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/oyatchDPpS4I9jpIIezFJGrmXcR.jpg",
                "genre_ids": [
                    18
                ],
                "id": 499,
                "original_language": "fr",
                "original_title": "Cléo de 5 à 7",
                "overview": "Agnès Varda eloquently captures Paris in the sixties with this real-time portrait of a singer set adrift in the city as she awaits test results of a biopsy. A chronicle of the minutes of one woman’s life, Cléo from 5 to 7 is a spirited mix of vivid vérité and melodrama, featuring a score by Michel Legrand and cameos by Jean-Luc Godard and Anna Karina.",
                "popularity": 2.995,
                "poster_path": "/oelBStY4xpguaplRv15P3Za7Xsr.jpg",
                "release_date": "1962-04-11",
                "title": "Cléo from 5 to 7",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 727,
                "character": "The Flower Vendor / Actress in Silent Film",
                "credit_id": "5cb09319c3a3683c2bac8bf7",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Gabrielle Girard",
            "Danièle Girard",
            "Gabrielle Danièle Marguerite Andrée Girard",
            "Даниэль Делорм"
        ],
        "biography": "Gabrielle Danièle Marguerite Andrée Girard (9 October 1926 – 17 October 2015), known by her stage name Danièle Delorme, was a French actress and film producer, famous for her roles in films directed by Marc Allégret, Julien Duvivier or Yves Robert.\n\nDelorme was born in Levallois-Perret, Hauts-de-Seine, one of four children to the well-known painter, poster-maker and theater-designer André Girard and his wife Andrée (nee Jouan). Girard maintained a studio in Venice in 1936–37 and in Manhattan in 1938. Back in France he was not called up in 1939. After the Battle of France, M. Girard removed to Antibes, then a free-zone and set up a network which provided recruiting and spying work for the French resistance. It was during this time that young Delorme began her acting career.\n\nIn 1940 at the age of 14 Delorme began acting and played a series of minor roles before she began acting in film. Two years later, owing to her father's contacts, she was able at 16 years old (at the time using the name Danièle Girard) to secure a bit part in The Beautiful Adventure (La Belle aventure (1942)).\n\nTwo years later director Marc Allégret again used Delorme, this time in a large role. This time she performed on the stage name she would use for the rest of her career, Danièl Delorme. One story developed that she took the name in order to hide from the Gestapo her relationship to her father. But the suggestion came from character actor Bernard Blier, who performed with her in her second film to take the name from the heroine of Victor Hugo's play Marion Delorme. (Delorme would co-star with Blier two decades later in the philosophical courtroom criminal drama, The Seventh Juror (Le septième juré (1962)).\n\nDuring the first decade of her career Delorme played delicate, demure, bright young women, roles for which she was physically fitted. Her first husband Daniel Gélin, who also performed in The Beautiful Adventure, said she had \"the face of a little girl, an upturned nose with passionate nostrils, the lips of a child, the body of a woman and a certain way about her that turns heads.\" Richard W. Seaver of the New York Times described her as \"a winsome wisp of an actress, with her soft smile and grey eyes.\" These features landed her a breakthrough role in Miquette et sa mère (1949). In 1949, she also played the title role in Gigi (1949 film), before Leslie Caron's success in the same role in the American (musical) version (Gigi (1958 film)) .\n\nAlso notable was her performance as femme fatale in Julien Duvivier's Voici le temps des assassin (1956) (Deadlier Than the Male in the US and Twelve Hours to Live in the UK), co-starring with Jean Gabin.\n\nIn 1960 Delorme joined more than 140 intellectuals, teachers, writers and celebrities in signing a manifesto supporting the right of French conscripts to refuse military service in Algeria. As a result, the French government on 28 September issued a ban against all signatories from appearing on state-run radio or television or in state-run theaters. At the same time the information minister said that another cabinet order was in preparation that would deny government funding to any film project in which any signatory appeared. ...\n\nSource: Article \"Danièle Delorme\" from Wikipedia in English, licensed under CC-BY-SA.",
        "birthday": "1926-10-09",
        "deathday": "2015-10-18",
        "gender": 1,
        "homepage": null,
        "id": 25178,
        "imdb_id": "nm0217735",
        "known_for_department": "Acting",
        "name": "Danièle Delorme",
        "place_of_birth": "Levallois-Perret, Hauts-de-Seine, France",
        "popularity": 0.1578,
        "profile_path": "/rNimWZqbgiNl4XqFDWpZwysOVaR.jpg"
    }
}