{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xS0rl1YrVt51ztzjRf6qoIPZ7TA.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 542178,
                "original_language": "en",
                "original_title": "The French Dispatch",
                "overview": "The staff of an American magazine based in France puts out its last issue, with stories featuring an artist sentenced to life imprisonment, student riots, and a kidnapping resolved by a chef.",
                "popularity": 4.9015,
                "poster_path": "/6JXR3KJH5roiBCjWFt09xfgxHZc.jpg",
                "release_date": "2021-10-21",
                "title": "The French Dispatch",
                "video": false,
                "vote_average": 7.025,
                "vote_count": 2789,
                "character": "Cadet #1",
                "credit_id": "6167b8d681c7be0043a6e4a8",
                "order": 285
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Toheeb Gbolabo O. Jimoh (born 15 April 1997) is an English actor. He earned a Primetime Emmy Award nomination for his performance as Sam Obisanya in the Apple TV+ series Ted Lasso (2020–2023). He is also known for his roles in the BBC One biographical film Anthony (2020) and the Amazon Prime series The Power (2023). Jimoh was born on 15 April 1997 in Brixton, South London to parents of Nigerian descent. He moved to Nigeria as a toddler and returned to London when he was seven. He attended The Norwood School before going on to train at the Guildhall School of Music and Drama, graduating in 2018.\n\nJimoh was a relative newcomer to acting when he was cast to play Anthony Walker, the victim of a 2005 racist attack, in BBC One's Anthony, which imagines Walker's life if he had not been killed. His portrayal was called \"utterly magnetic\". He then portrayed Marcus in the Amazon series The Feed.\n\nJimoh was in a stage production of A Midsummer Night's Dream at the Sheffield Crucible and in 2020, was one of six performers in the Almeida Theatre's Christmas Play Nine Lessons and Carols, the theatre's first production post London's COVID-19 lockdown.\n\nWhen Jimoh auditioned for Ted Lasso, the character of Sam Obisanya was written as Ghanaian, but his background was changed to Nigerian to match Jimoh's own. His performance has received praise, with his character called the \"heartbeat\" of the show.\n\nJimoh portrays another Nigerian character, journalist Tunde, in the Amazon thriller series The Power, based on Naomi Alderman's novel of the same name. He also has a small part in the Wes Anderson film The French Dispatch. Jimoh played Romeo in a summer 2023 production of Romeo and Juliet at the Almeida Theatre in London. In 2024, Jimoh played Hal in Player Kings, an adaption of Shakespeare's Henry IV part 1 and 2 by Robert Icke which also co-stars Ian McKellen and Richard Coyle.",
        "birthday": "1997-04-15",
        "deathday": null,
        "gender": 2,
        "homepage": "https://theb-side.co.uk/management/toheeb-jimoh/",
        "id": 2519330,
        "imdb_id": "nm8504865",
        "known_for_department": "Acting",
        "name": "Toheeb Jimoh",
        "place_of_birth": "Brixton, London, England, UK",
        "popularity": 0.3696,
        "profile_path": "/5GB3bH07gpcxm9TygOTIOCytmeS.jpg"
    }
}