{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/w5IDXtifKntw0ajv2co7jFlTQDM.jpg",
                "genre_ids": [
                    878,
                    9648,
                    12
                ],
                "id": 62,
                "original_language": "en",
                "original_title": "2001: A Space Odyssey",
                "overview": "Humanity finds a mysterious object buried beneath the lunar surface and sets off to find its origins with the help of HAL 9000, the world's most advanced super computer.",
                "popularity": 12.3573,
                "poster_path": "/ve72VxNqjGM69Uky4WTo2bK6rfq.jpg",
                "release_date": "1968-04-02",
                "title": "2001: A Space Odyssey",
                "video": false,
                "vote_average": 8.065,
                "vote_count": 12026,
                "character": "Dr. Roy Michaels",
                "credit_id": "52fe4212c3a36847f8001a37",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/icvgQHxrKEDx92VQ5WHiEmEAUKH.jpg",
                "genre_ids": [
                    53,
                    27,
                    878
                ],
                "id": 11336,
                "original_language": "en",
                "original_title": "The Dead Zone",
                "overview": "Johnny Smith is a schoolteacher with his whole life ahead of him but, after leaving his fiancee's home one night, is involved in a car crash which leaves him in a coma for 5 years. When he wakes, he discovers he has an ability to see into the past, present and future life of anyone with whom he comes into physical contact.",
                "popularity": 2.1294,
                "poster_path": "/9yTVaeS8eIkOpbwIycVFm7EQrgF.jpg",
                "release_date": "1983-10-21",
                "title": "The Dead Zone",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 1719,
                "character": "Herb Smith",
                "credit_id": "52fe44299251416c7502ae89",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Sean Sullivan (December 26, 1921 – June 3, 1985) was a Canadian actor. He is most noted for his stage and television performances in productions of David French's play Of the Fields, Lately, for which he won an ACTRA Award in 1977 as Best Television Actor for the CBC Television film; and his film performances in Springhill, for which he won a Canadian Film Award as Best Actor in a Non-Feature Film in 1972, and The Boy in Blue, for which he received a posthumous Genie Award nomination for Best Supporting Actor at the 7th Genie Awards in 1986.\n\nBorn and raised in Toronto, Ontario, he began his career as an actor when a stage play he appeared in in his 20s, Golden Boy, reached the finals of the Dominion Drama Festival. He soon began appearing in CBC Television productions, including episodes of the drama anthology series Playbill, CBC Summer Theatre, Folio and General Motors Theatre. His film roles included Nobody Waved Good-bye, The Young Ones, Why Rock the Boat?, 125 Rooms of Comfort, One Man, The Silent Partner, Atlantic City and The Grey Fox.",
        "birthday": "1921-12-26",
        "deathday": "1985-06-03",
        "gender": 2,
        "homepage": null,
        "id": 252,
        "imdb_id": "nm0838330",
        "known_for_department": "Acting",
        "name": "Sean Sullivan",
        "place_of_birth": "Toronto, Ontario, Canada",
        "popularity": 0.173,
        "profile_path": null
    }
}