{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8NT7h1CxdXapqt6hdLhfFcoZJAU.jpg",
                "genre_ids": [
                    28,
                    35,
                    80,
                    14
                ],
                "id": 9470,
                "original_language": "cn",
                "original_title": "功夫",
                "overview": "It's the 1940s, and the notorious Axe Gang terrorizes Shanghai. Small-time criminals Sing and Bone hope to join, but they only manage to make lots of very dangerous enemies. Fortunately for them, kung fu masters and hidden strength can be found in unlikely places. Now they just have to take on the entire Axe Gang.",
                "popularity": 8.5007,
                "poster_path": "/exbyTbrvRUDKN2mcNEuVor4VFQW.jpg",
                "release_date": "2004-02-10",
                "title": "Kung Fu Hustle",
                "video": false,
                "vote_average": 7.478,
                "vote_count": 2976,
                "character": "Axe Gang Vice General",
                "credit_id": "52fe44fbc3a36847f80b5b67",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "林雪",
            "Pa Suet",
            "Lin Xue",
            "Fei Suet",
            "Lam Sho",
            "Lam Sue",
            "S. Lam",
            "Xue Lin",
            "임설",
            "Suet Lam",
            "Lâm Tuyết",
            "Lam Suet",
            "لام سوئت"
        ],
        "biography": "Lam Suet (Chinese: 林雪, born on 8 July 1964) was born in Tianjin,  and came to Hong Kong as a youth in 1979 to receive inheritance money  left by his grandfather. Soon after all the money had been squandered  and Lam had to work various odd jobs to make a living.\n\nIn the mid-eighties he got employment on movie sets through the help  of friends. He has done different roles, from lighting and props to  stage manager and set and script supervisor.\n\nLam gradually developed an interest in acting and by his own account,  pestered various directors until they relented and gave him tiny roles.  There are two pivotal persons in Lam's acting career. The first is Stephen Chow, who befriended him in his early days as a crew member and cast him in movies like The God of Cookery (1996) and Kung Fu Hustle.\n\nThe second person is director Johnnie To. Lam has been in over 80 films since 1996 and at least 20 of those have been directed or produced by To.\n\nKnown for his weight and size, his roles are often as a bumbling  secondary character providing comic relief from the most intense nature  of To's films. He is perhaps most famous for his various supporting  roles in To's films, notably as the bumbling taxi driver Yip in the  award winning film Breaking News (2004).\n\nThe most notable To-Lam collaborations include The Mission, which garnered Lam Best Supporting Actor nominations at the Hong Kong Film Awards and the Golden Horse Award, and PTU. Lam was nominated for a Golden Horse Award for Best Supporting Actor and took home the Golden Bauhinia Award for Best Supporting Actor for his role in PTU. He has also had interesting roles in movies like Wu yen (2001), as the effeminate Prime Minister, and in Diva - Ah Hey (2003), in which he played Charlene Choi's  loving and supportive father. Lam has been married for almost a decade.  His wife is 10 years his junior and is from the same hometown.",
        "birthday": "1964-07-08",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 25251,
        "imdb_id": "nm0482695",
        "known_for_department": "Acting",
        "name": "Lam Suet",
        "place_of_birth": "Tianjin, China",
        "popularity": 1.3294,
        "profile_path": "/5ZvphtA3dwsDu81lF3TV8rIwt4l.jpg"
    }
}