{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ovxdPoXYb3raXOAqokCqkCR83Jx.jpg",
                "genre_ids": [
                    35,
                    10749,
                    18
                ],
                "id": 2469,
                "original_language": "es",
                "original_title": "¡Átame!",
                "overview": "After being released from a mental hospital, a troubled young man tracks down an actress he once had sex with and forces her into captivity, determined to make her part of his life.",
                "popularity": 2.715,
                "poster_path": "/4eNyqA543ixNCME8pcADgP9wb1i.jpg",
                "release_date": "1990-01-22",
                "title": "Tie Me Up! Tie Me Down!",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 649,
                "character": "Bailarín tango",
                "credit_id": "52fe435ac3a36847f804dc49",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Manuel Bandera nació el día 12 de diciembre del año 1960 en Málaga.\n\nSus  primeros trabajos fueron en Málaga, donde participó en varias obras de  teatro, marchándose luego a Madrid para estudiar baile y educación  física, lo que le ha facilitado protagonizar diversas obras musicales,  como “Cabaret” o ”Chicago”.  En los escenarios ha representado, aparte de musicales,  tanto a los clásicos, como “Eurípides” como a autores contemporáneos, como en “Trampa para pájaros”, pasando por dramas históricos como “Mariana Pineda”.\n\nSu  popularidad sin embargo se la dió el cine, que lo convirtió en un  rostro famoso en el año 1989, cuando le surgió la oportunidad de  participar en el largometraje Las cosas del querer de Jaime Chávarri y  compartiendo cartel con Ángela Molina, La película tuvo una secuela, que  también protagonizó.  \n\nAl año siguiente rodó con Pedro Almodóvar,  que lo escogió para un pequeño papel en la película ¡Átame!. Más tarde  volvería a trabajar a las órdenes del director manchego en el  largometraje Kika.\n\nDel resto de su filmografía destacan “Tirano Banderas”, de José Luis García Sánchez, “Valparaíso”, de Mariano Andrade, “Bámbola”, de Bigas Luna, Más allá del jardín, de Pedro Olea o Pajarico, de Carlos Saura  En  lo que hace referencia a la televisión, debutó en este medio en el año  1990, al participar en la serie de Vicente Escrivá Réquiem por Granada.  Al cabo de unos años participó en la serie “El Super, historias de todos los días”, en el papel de Ramón.\n\nEn los últimos tiempos ha participado en series tan exitosas como “Bandolera” o en la prestigiosa telenovela “Amar en tiempos revueltos”, en la que daba vida a Ramón Rivas, personaje que representaba el dueño de unos almacenes.\n\nEs de destacar que participó en el concurso de televisión “Mira quien baila”, resultando ganador de la 7ª edición.\n\nEn cuanto a su vida personal sse casó con Marisol, con la cual tiene un hijo.",
        "birthday": "1960-12-12",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 25266,
        "imdb_id": "nm0051706",
        "known_for_department": "Acting",
        "name": "Manuel Bandera",
        "place_of_birth": null,
        "popularity": 0.0877,
        "profile_path": "/loIMegz0B3nqkpmqzgy280hUdKC.jpg"
    }
}