{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/13Nz8EchKRdCgJcKdEoJAnpiVn2.jpg",
                "genre_ids": [
                    28,
                    12,
                    14
                ],
                "id": 791373,
                "original_language": "en",
                "original_title": "Zack Snyder's Justice League",
                "overview": "Determined to ensure Superman's ultimate sacrifice was not in vain, Bruce Wayne aligns forces with Diana Prince with plans to recruit a team of metahumans to protect the world from an approaching threat of catastrophic proportions.",
                "popularity": 13.7837,
                "poster_path": "/tnAuB8q5vv7Ax9UAEje5Xi4BXik.jpg",
                "release_date": "2021-03-18",
                "title": "Zack Snyder's Justice League",
                "video": false,
                "vote_average": 8.11,
                "vote_count": 10399,
                "character": "Young Icelandic Woman",
                "credit_id": "60541de6031a1d009b9501ca",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "FURA"
        ],
        "biography": "is an Icelandic singer, composer, and multimedia artist, based in Seyðisfjörður. Her music has been featured in several films and has seen multiple international collaborations. Performing under the artist alias FURA, Björt has toured around Europe and released her debut album 'Poems of the Past' in collaboration with Janus Rasmussen and Hallur Jónsson, in 2016. A year later she made her first appearance on the white screen, taking on a small acting and singing role in the Hollywood blockbuster, Justice league.  Björt studied music and holds a degrees in project management & creative businesses from the Kaospilot school in Aarhus, Denmark. She is currently pursuing a master's degree in crisis governance.\n\nBjört has mixed her artistic mindset together with her entrepreneurial skills on several occasions. In the year 2000, she co-founded Iceland's LungA Art Festival in Seyðisfjörður, followed by the establishment of the LungA School in 2013. Björt has worked for both school and festival from the beginning, serving as a director for both for many years. In 2013 Björt also co-founded HEIMA residency in Seyðisfjörður, which she was a part of running until spring 2023.  While Björt has been a globetrotter with her music for over a decade, she has recently shifted her focus to visual art. Her performative works aimes to engage multiple senses simultaneously, a characteristic that extends into her visual art.",
        "birthday": "1984-03-27",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.bjort.love",
        "id": 2532067,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Björt Sigfinnsdóttir",
        "place_of_birth": "Iceland",
        "popularity": 0.1108,
        "profile_path": "/laRn4UrB4qrLhM1BrbGPC0r7w9h.jpg"
    }
}