{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1WRwy3EDc2LVtwauzIMMGVJLEI5.jpg",
                "genre_ids": [
                    18
                ],
                "id": 9787,
                "original_language": "en",
                "original_title": "Lords of Dogtown",
                "overview": "The radical true story behind three teenage surfers from Venice Beach, California, who took skateboarding to the extreme and changed the world of sports forever. Stacy Peralta, Tony Alva and Jay Adams are the Z-Boys, a bunch of nobodies until they create a new style of skateboarding that becomes a worldwide phenomenon. But when their hobby becomes a business, the success shreds their friendship.",
                "popularity": 12.3584,
                "poster_path": "/k2NiPfydLSwmk28C6qpvpJPuqtq.jpg",
                "release_date": "2005-06-03",
                "title": "Lords of Dogtown",
                "video": false,
                "vote_average": 7.102,
                "vote_count": 773,
                "character": "James Smith (uncredited)",
                "credit_id": "610ed93f263462005d092af7",
                "order": 102
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Eric West is a global powerhouse—a multifaceted rising superstar whose undeniable talent, charisma, and influence have catapulted him to the forefront of entertainment. A force to be reckoned with, he is an award-winning actor, Billboard-chart-topping singer, songwriter, producer, dancer, and international model, with a magnetic presence that captivates audiences on screen and off. West has firmly established himself as one of Hollywood’s most electrifying rising stars, dominating across film, television, music, fashion, and media.\n\nWest’s undeniable star power is underscored by accolades and recognition from some of the most prestigious names in entertainment. In 2013, Cosmopolitan crowned him \"Hottest Actor,\" cementing his place as one of Hollywood's most compelling talents. He was named a \"Style Icon and Innovator\" by GQ, seamlessly blending fashion with his powerful presence. He is a recipient of Vibe Magazine’s \"Next Award,\" awarded alongside Chadwick Boseman, and he earned the Essence Magazine \"New and Next: Ones to Watch\" honor, alongside industry trailblazers The Weeknd and Zendaya. His gripping performance in the USA Network's Satisfaction, created by Sean Jablonski (Nip/Tuck) earned him a Shorty Award nomination for Best Actor, and his standout role in the acclaimed series Labeled earned him the Best Ensemble Cast in a Comedy Award.\n\nOn the big screen, West has delivered a string of performances that have garnered critical acclaim. His explosive role alongside Bruce Willis and Chad Michael Murray in the action-packed thriller Fortress elevated his status, earning him multiple accolades and international recognition. West also starred in the hit Amazon comedy Just for Showmace and the box-office sensation The Hurler: A Champion’s Tale, a film that became a cultural phenomenon in the UK and Ireland. He has made high-profile appearances on The Late Show with Stephen Colbert, Watch What Happens Live, Wendy Williams Show, and been profiled in American Latino, as well as gracing major stages like the MTV Video Music Awards and the Style Awards.\n\nIn music, West continues to break barriers. His 2025 collaboration with Samuel Mancini and Kedward Avilés on the Jimmy Jam & Terry Lewis-penned track \"Tú Eliges (Choose)\" shattered records, soaring to #1 on the Billboard Latin Singles Chart and making waves in the UK, where it debuted in the Top 50 of the UK Singles Chart—an extraordinary achievement for a Spanish-language song. His creative genius extended further when he co-produced and co-wrote eight tracks on Mancini’s album Feed the Fire, which rocketed into the Top 40 of Billboard’s Top Albums Chart, solidifying West’s place as a driving force in the music industry.\n\nBeyond his unparalleled success across film, television, and music, West’s influence extends into the world of fashion. His impeccable style has earned him features in iconic outlets like GQ, Esquire, Variety, Time, Vanity Fair and The Hollywood Reporter, while his global reach has been showcased in major international ad campaigns for brands like Coach, Lexus, Cotton, LG, Sprite, Intel, and Oakley.\n\nWest is not just a star—he is an unstoppable global phenomenon whose influence continues to shape the entertainment world. A true style icon of his generation, his unmatched versatility and dynamic presence make him one of the most influential and in-demand talents.",
        "birthday": "1983-05-18",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.eric-west.com",
        "id": 2540473,
        "imdb_id": "nm0922064",
        "known_for_department": "Acting",
        "name": "Eric West",
        "place_of_birth": "Brooklyn, NY",
        "popularity": 0.0681,
        "profile_path": "/yELVmp8eQvUSpB2GdkeEQcO4YOG.jpg"
    }
}