{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2clBxxclZJ4OK1xzhmCCXHEfy3r.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 759,
                "original_language": "en",
                "original_title": "Gentlemen Prefer Blondes",
                "overview": "Lorelei Lee is a beautiful showgirl engaged to be married to the wealthy Gus Esmond, much to the disapproval of Gus' rich father, Esmond Sr., who thinks that Lorelei is just after his money. When Lorelei goes on a cruise accompanied only by her best friend, Dorothy Shaw, Esmond Sr. hires Ernie Malone, a private detective, to follow her and report any questionable behavior that would disqualify her from the marriage.",
                "popularity": 2.7271,
                "poster_path": "/fDozhst5HVJJcd3BM8ZOsKniO7Q.jpg",
                "release_date": "1953-07-14",
                "title": "Gentlemen Prefer Blondes",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1011,
                "character": "Ship Passenger (uncredited)",
                "credit_id": "6574e3234bfa5401387f49d0",
                "order": 116
            },
            {
                "adult": false,
                "backdrop_path": "/zAL3LOswagN9onjN8DPcNFTqKuD.jpg",
                "genre_ids": [
                    18
                ],
                "id": 705,
                "original_language": "en",
                "original_title": "All About Eve",
                "overview": "From the moment she glimpses her idol at the stage door, Eve Harrington is determined to take the reins of power away from the great actress Margo Channing. Eve maneuvers her way into Margo's Broadway role, becomes a sensation and even causes turmoil in the lives of Margo's director boyfriend, her playwright and his wife. Only the cynical drama critic sees through Eve, admiring her audacity and perfect pattern of deceit.",
                "popularity": 2.0482,
                "poster_path": "/blBzZaatPWVuWpXEnPscMA4Xp6m.jpg",
                "release_date": "1950-11-09",
                "title": "All About Eve",
                "video": false,
                "vote_average": 8.076,
                "vote_count": 1604,
                "character": "Sarah Siddons Awards Guest (uncredited)",
                "credit_id": "636a4b7a4c1bb0007d28d865",
                "order": 39
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Foster Phinney dedicated much of his life to the motion picture business. Fresh out of high school, his suave and sophisticated appearance made it possible for him to break into the film business. He started appearing in scenes that required dress extras while still collecting an occasional paycheck as a soldier. Phinney faces an unusual problem, his elegant appearance made him an unlikely candidate to appear in the trenches in Hollywood's war time films but it enabled him to appear in socialite scenes that usually required much older men. This led him to garnering work as a stand-in in films in the 1940s and 1950s.\n\nBy the time the 1950s rolled around, Phinney got his big break. He became the regular stand-in for Kirk Douglas. Douglas was so kind to him that Douglas considered him his good luck charm and gave him little roles in all of his films. While his work was steady, it was Douglas who got Phinney steady work as an assistant director. This began a second career where he worked as the assistant director on many shows including The Beverly Hillbillies where he had a character named after him.\n\nIn the late 1970s, Phinney decided to retire leaving behind a multifaceted career which included being an extra, a bit part actor, an assistant director, and even a director.",
        "birthday": "1916-04-29",
        "deathday": "1985-10-01",
        "gender": 2,
        "homepage": null,
        "id": 2544019,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Foster H. Phinney",
        "place_of_birth": "Columbus, Ohio, USA",
        "popularity": 0.0143,
        "profile_path": null
    }
}