{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4XM8DUTQb3lhLemJC51Jx4a2EuA.jpg",
                "genre_ids": [
                    28,
                    80,
                    53,
                    12,
                    9648
                ],
                "id": 385687,
                "original_language": "en",
                "original_title": "Fast X",
                "overview": "Over many missions and against impossible odds, Dom Toretto and his family have outsmarted, out-nerved and outdriven every foe in their path. Now, they confront the most lethal opponent they've ever faced: A terrifying threat emerging from the shadows of the past who's fueled by blood revenge, and who is determined to shatter this family and destroy everything—and everyone—that Dom loves, forever.",
                "popularity": 27.5052,
                "poster_path": "/fiVW06jE7z9YnO4trhaMEdclSiC.jpg",
                "release_date": "2023-05-17",
                "title": "Fast X",
                "video": false,
                "vote_average": 7.027,
                "vote_count": 6036,
                "character": "Lead Cartel Thug",
                "credit_id": "646abbdb57530e0788ae51d9",
                "order": 30
            },
            {
                "adult": false,
                "backdrop_path": "/7QDWTqSGqI2Q5dOBtvT64MOhmwJ.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 930094,
                "original_language": "en",
                "original_title": "Red, White & Royal Blue",
                "overview": "After an altercation between Alex, the president's son, and Britain's Prince Henry at a royal event becomes tabloid fodder, their long-running feud now threatens to drive a wedge in U.S./British relations. When the rivals are forced into a staged truce, their icy relationship begins to thaw and the friction between them sparks something deeper than they ever expected.",
                "popularity": 10.1049,
                "poster_path": "/ta3ReqbdEcLJM3mcHMzbYFZI8v7.jpg",
                "release_date": "2023-07-27",
                "title": "Red, White & Royal Blue",
                "video": false,
                "vote_average": 7.967,
                "vote_count": 1424,
                "character": "Brazilian Reporter",
                "credit_id": "648444b599259c00c5b47288",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ben-Hur Santos"
        ],
        "biography": "Ben Santos is a South American actor & award winning director. He started his career on the stage of the Brazilian National Theatre (Teatro do CIC). He left his hometown, Florianópolis in south Brazil to graduate in Journalism at the Adventist University boarding college in São Paulo. During his time in college he was connected to the performing arts team joining the theatre and filming productions.\n\nHe moved to London in 2010 driving his career towards film and television. In 2015 he moved temporarily to Los Angeles developing his acting and film production skills. Whilst in America he joined a summer class at Harvard University in Boston improving his English grammar, writing and elocution, returning to the UK in 2017 to continue his work.\n\nHis last project, the short drama \"Breaking Brexit\" released in 2020, won two Awards for \"Best Short Drama\" and \"Best First Time Director\" and other nominations in American and European film festivals. Recently he has been working in some major Hollywood and UK productions.",
        "birthday": "1985-01-08",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2545367,
        "imdb_id": "nm8552036",
        "known_for_department": "Acting",
        "name": "Ben Santos",
        "place_of_birth": "Florianópolis, Santa Catarina, Brazil",
        "popularity": 0.052,
        "profile_path": "/jjVqqt2e2b4TgBnrjHwYkKpvSBN.jpg"
    }
}