{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4fynFAYPPYCkyIdt0bsCwWn3Hxv.jpg",
                "genre_ids": [
                    18,
                    36,
                    10749
                ],
                "id": 5544,
                "original_language": "fr",
                "original_title": "Hiroshima mon amour",
                "overview": "The deep conversation between a Japanese architect and a French actress forms the basis of this celebrated French film, considered one of the vanguard productions of the French New Wave. Set in Hiroshima after the end of World War II, the couple -- lovers turned friends -- recount, over many hours, previous romances and life experiences. The two intertwine their stories about the past with pondering the devastation wrought by the atomic bomb dropped on the city.",
                "popularity": 2.9268,
                "poster_path": "/vjP7eX9c0xUD5i5dTRaP3NYC8iN.jpg",
                "release_date": "1959-06-10",
                "title": "Hiroshima Mon Amour",
                "video": false,
                "vote_average": 7.698,
                "vote_count": 863,
                "character": "Lui",
                "credit_id": "52fe440cc3a36847f807f571",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Okada Eiji",
            "Эйдзи Окада"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nEiji Okada (13 June 1920 Chōshi, Chiba, Japan – 14 September 1995 Japan) was a Japanese film actor. Okada served in the Japanese army during World War II, and was a miner and traveling salesman before becoming an actor.\n\nInternationally, his best-remembered roles include Lui (\"him,\" in French) in the film Hiroshima mon amour (1959), directed by Alain Resnais, and the entomologist Niki Junpei in Hiroshi Teshigahara's Woman in the Dunes (1964), an adaptation of Kōbō Abe's novel.\n\nOkada was married to Aiko Wasa, with whom he ran a theatre company in Japan. He died on September 14, 1995 of heart failure, at the age of 75.\n\nDescription above from the Wikipedia article Eiji Okada, licensed under CC-BY-SA, full list of contributors on Wikipedia.​",
        "birthday": "1920-06-13",
        "deathday": "1995-09-14",
        "gender": 2,
        "homepage": null,
        "id": 25466,
        "imdb_id": "nm0645402",
        "known_for_department": "Acting",
        "name": "Eiji Okada",
        "place_of_birth": "Chōshi, Chiba Prefecture, Japan",
        "popularity": 1.6392,
        "profile_path": "/mQb4kOYl1WlISWZOStAhm13DHdQ.jpg"
    }
}