{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/aQ2ZbNqIaecoQsryNe33UmDtms.jpg",
                "genre_ids": [
                    12,
                    10751,
                    14,
                    35,
                    10749
                ],
                "id": 2493,
                "original_language": "en",
                "original_title": "The Princess Bride",
                "overview": "In this enchantingly cracked fairy tale, the beautiful Princess Buttercup and the dashing Westley must overcome staggering odds to find happiness amid six-fingered swordsmen, murderous princes, Sicilians and rodents of unusual size. But even death can't stop these true lovebirds from triumphing.",
                "popularity": 5.7612,
                "poster_path": "/dvjqlp2sAhUeFjUOfQDgqwpphHj.jpg",
                "release_date": "1987-09-25",
                "title": "The Princess Bride",
                "video": false,
                "vote_average": 7.685,
                "vote_count": 4810,
                "character": "Fezzik",
                "credit_id": "52fe435ac3a36847f804df6d",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "André the Giant",
            "André Roussimoff",
            "Géant Ferré",
            "Jean Ferré",
            "Monster Roussimoff",
            "\"The Giant\" Jean Ferre",
            "André René Roussimoff"
        ],
        "biography": "André René Roussimoff, known worldwide as André the Giant, was a French professional wrestler and actor who gained international fame due to his extraordinary size, the result of a medical condition known as acromegaly (gigantism). Born on May 19, 1946, in Coulommiers, France, he was nicknamed “The Eighth Wonder of the World” and became one of the most iconic figures in professional wrestling during the 1970s and 1980s.\n\nRoussimoff began his wrestling career in 1966 in France under the name Jean Ferré, and his size quickly drew the attention of international promoters. In 1971, he moved to North America, where he was promoted by Vincent J. McMahon, founder of the World Wide Wrestling Federation (WWWF), as a global attraction. Renamed André the Giant, he remained one of the most popular wrestlers in the world for over a decade, known for his imposing presence and gentle demeanor.\n\nThroughout his career, André wrestled in various territories and promotions worldwide, including Japan, Canada, Europe, Australia, and the United States. He was a central figure in the wrestling boom of the 1980s, starring in one of the most iconic rivalries in sports entertainment history: his feud with Hulk Hogan, which culminated at the historic WrestleMania III (1987) before more than 93,000 fans. In that match, Hogan famously body-slammed André in what became known as the body slam heard around the world, a defining moment in WWF history.\n\nIn 1988, André briefly won the WWF World Championship, only to immediately “sell” the title to Ted DiBiase in a storyline that led to the championship being declared vacant. In the following years, his health declined due to complications from acromegaly, though he remained active in the ring, particularly in Japan and Mexico with promotions such as All Japan Pro Wrestling and UWA.\n\nParallel to wrestling, André pursued an acting career. His most beloved role was Fezzik in the film The Princess Bride (1987), a character he cherished and which cemented his status as a beloved figure outside the ring. He also appeared in other productions, such as Conan the Destroyer, The Six Million Dollar Man, and The Fall Guy, among others.\n\nIn his personal life, André was known for his generosity, reserved personality, and legendary drinking feats—stories of which became part of wrestling folklore. He had a daughter, Robin Christensen, and spent his final years on a ranch in North Carolina. He passed away on January 28, 1993, in a Paris hotel due to heart failure, shortly after attending his father's funeral.\n\nHis legacy endures as one of the most recognized and beloved figures in wrestling history. He was the first-ever inductee into the WWF Hall of Fame in 1993 and has been honored through documentaries, books, films, video games, and the creation of the André the Giant Memorial Battle Royal, an annual WWE event. He also inspired the visual artist Shepard Fairey, creator of the iconic “Obey” street art campaign.\n\nAndré the Giant was not just a wrestling legend but also a symbol of resilience, spectacle, and humanity in an industry defined by drama and exaggeration. His story is that of a man whose physical greatness was matched by a remarkable human spirit.",
        "birthday": "1946-05-19",
        "deathday": "1993-01-27",
        "gender": 2,
        "homepage": null,
        "id": 25504,
        "imdb_id": "nm0000764",
        "known_for_department": "Acting",
        "name": "André Roussimoff",
        "place_of_birth": "Coulommiers, France",
        "popularity": 0.3325,
        "profile_path": "/A1A3RjFq5e0QghWU3vLrhyQdjwu.jpg"
    }
}