{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4EdN5rIT43xcqi4IVRrhxiDOz6z.jpg",
                "genre_ids": [
                    18,
                    10749,
                    80
                ],
                "id": 152742,
                "original_language": "it",
                "original_title": "La migliore offerta",
                "overview": "Virgil Oldman is a world renowned antiques expert and auctioneer. An eccentric genius, he leads a solitary life, going to extreme lengths to keep his distance from the messiness of human relationships. When appointed by the beautiful but emotionally damaged Claire to oversee the valuation and sale of her family’s priceless art collection, Virgil allows himself to form an attachment to her – and soon he is engulfed by a passion which will rock his bland existence to the core.",
                "popularity": 4.3878,
                "poster_path": "/ibDGPgUZn6vxHiSgt2xeQyFp8Np.jpg",
                "release_date": "2013-01-01",
                "title": "The Best Offer",
                "video": false,
                "vote_average": 7.806,
                "vote_count": 2941,
                "character": "Fred",
                "credit_id": "52fe4b299251416c910d1e49",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Phillip Jackson",
            "필립 잭슨",
            "Филип Джексон",
            "فیلیپ جکسون"
        ],
        "biography": "Philip Jackson (born 18 June 1948) is an English actor, known for his many television and film roles, most notably as Chief Inspector Japp in the television series Agatha Christie's Poirot and as Abbot Hugo, one of the recurring adversaries in the cult 1980s series Robin of Sherwood.\n\nJackson was born in Retford, Nottinghamshire. He started acting while studying Drama and German at the University of Bristol, and has worked in the theatre in Leeds, Liverpool and London. His stage work includes Pozzo in Samuel Beckett's Waiting for Godot at the Queen's Theatre in the West End in 1991 and Willy Loman in Arthur Miller's Death of a Salesman at the West Yorkshire Playhouse, Leeds in 2010. He was nominated for a Screen Actors Guild Award for his role in Little Voice (1998).\n\nHis television appearances have included Coronation Street, Robin of Sherwood, A Touch of Frost, Foyle's War, Midsomer Murders, Heartbeat, Little Britain, Hamish Macbeth, Raised by Wolves and Last of the Summer Wine. He has also appeared in the films Scum, Paul McCartney's Give My Regards to Broad Street, Brassed Off, Mike Bassett: England Manager, \"Grow Your Own\", and My Week with Marilyn. He also appeared in the music video of A-Ha's \"Take On Me\"",
        "birthday": "1948-06-18",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 25532,
        "imdb_id": "nm0413946",
        "known_for_department": "Acting",
        "name": "Philip Jackson",
        "place_of_birth": "Retford, Nottinghamshire, England, UK",
        "popularity": 0.6813,
        "profile_path": "/eC7p4UAj6xB4TtQ4cPcIJtubPnw.jpg"
    }
}