{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kpPp3HxKdQpDBCJZzijntdK3k0X.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 203,
                "original_language": "en",
                "original_title": "Mean Streets",
                "overview": "A small-time hood must choose from among love, friendship and the chance to rise within the mob.",
                "popularity": 3.1944,
                "poster_path": "/rzVTH9ylCw0owKkMZQVz2Eve97E.jpg",
                "release_date": "1973-10-14",
                "title": "Mean Streets",
                "video": false,
                "vote_average": 7.079,
                "vote_count": 2183,
                "character": "Tony DeVienazo",
                "credit_id": "52fe4226c3a36847f8007dcd",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/pNjh59JSxChQktamG3LMp9ZoQzp.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 278,
                "original_language": "en",
                "original_title": "The Shawshank Redemption",
                "overview": "Imprisoned in the 1940s for the double murder of his wife and her lover, upstanding banker Andy Dufresne begins a new life at the Shawshank prison, where he puts his accounting skills to work for an amoral warden. During his long stretch in prison, Dufresne comes to be admired by the other inmates -- including an older prisoner named Red -- for his integrity and unquenchable sense of hope.",
                "popularity": 28.9882,
                "poster_path": "/9cqNxx0GxF0bflZmeSMuL5tnGzr.jpg",
                "release_date": "1994-09-23",
                "title": "The Shawshank Redemption",
                "video": false,
                "vote_average": 8.7,
                "vote_count": 28883,
                "character": "Snooze",
                "credit_id": "542eb4c90e0a2625a6000007",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Clark Katz"
        ],
        "biography": "From Wikipedia, the free encyclopedia. David Aaron Proval (born May 20, 1942) is an American actor, known for his roles as Richie Aprile on the HBO television series The Sopranos and as Tony DeVienazo in the 1973 Martin Scorsese film Mean Streets opposite Robert De Niro and Harvey Keitel.\n\nProval was born in Brooklyn, New York of Jewish heritage,  the son of actress Clara Katz of Romanian origin.  He has appeared in such feature films as The Shawshank Redemption, Mob Queen, Four Rooms, UHF, Innocent Blood, The Siege, a cameo appearance in Smokin' Aces, and has had recurring roles in television shows such as Picket Fences, Boomtown and Everybody Loves Raymond. In 1977 his voice was heard in the cult animated film WIZARDS, as the robot assassin Necron 99.\n\nIn 2008, David Proval starred in the comedy City of Shoulders and Noses. The film is being produced by Sybil Danning, George Parra, and Tommy Ardolino.\n\nDescription above from the Wikipedia article David Proval, licensed under CC-BY-SA,full list of contributors on Wikipedia.    ",
        "birthday": "1942-05-20",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2555,
        "imdb_id": "nm0698998",
        "known_for_department": "Acting",
        "name": "David Proval",
        "place_of_birth": "Brooklyn, New York City, New York, USA",
        "popularity": 1.041,
        "profile_path": "/xD9mcTYEmkFLKAE9T9d3AFP50f3.jpg"
    }
}