{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kpPp3HxKdQpDBCJZzijntdK3k0X.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 203,
                "original_language": "en",
                "original_title": "Mean Streets",
                "overview": "A small-time hood must choose from among love, friendship and the chance to rise within the mob.",
                "popularity": 2.9297,
                "poster_path": "/rzVTH9ylCw0owKkMZQVz2Eve97E.jpg",
                "release_date": "1973-10-14",
                "title": "Mean Streets",
                "video": false,
                "vote_average": 7.075,
                "vote_count": 2187,
                "character": "Giovanni Cappa",
                "credit_id": "52fe4226c3a36847f8007dd9",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/2fmLLKSEzdfk41Iz76ewoKhyWgb.jpg",
                "genre_ids": [
                    35
                ],
                "id": 8469,
                "original_language": "en",
                "original_title": "Animal House",
                "overview": "At a 1962 College, Dean Vernon Wormer is determined to expel the entire Delta Tau Chi Fraternity, but those troublemakers have other plans for him.",
                "popularity": 2.805,
                "poster_path": "/fWooBbipMRIKeSRhEzmeaDV0T8H.jpg",
                "release_date": "1978-07-28",
                "title": "Animal House",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 1593,
                "character": "Mayor Carmine DePasto",
                "credit_id": "52fe44acc3a36847f80a3921",
                "order": 12
            },
            {
                "adult": false,
                "backdrop_path": "/qQGHkmLWPcMGkKws78pFh14SzUo.jpg",
                "genre_ids": [
                    18,
                    36,
                    10749
                ],
                "id": 8095,
                "original_language": "en",
                "original_title": "Cleopatra",
                "overview": "Determined to hold on to the throne, Cleopatra seduces the Roman emperor Julius Caesar. When Caesar is murdered, she redirects her attentions to his general, Marc Antony, who vows to take power—but Caesar’s successor has other plans.",
                "popularity": 3.9112,
                "poster_path": "/bj7rUGUewofA9cpHt1h36gvDFfy.jpg",
                "release_date": "1963-06-12",
                "title": "Cleopatra",
                "video": false,
                "vote_average": 7.04,
                "vote_count": 800,
                "character": "Apollodorus",
                "credit_id": "5a5ac0009251413f6e015a3e",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia.\n\nCesare Danova (March 1, 1926 - March 19, 1992), born Cesare Deitinger in Bergamo, Italy, was a television and screen actor. He adopted the stage name Danova when he turned to acting in Rome at the end of World War II. He migrated to the United States in the 1950s to make the film Don Giovanni (Don Juan) in 1955. He was contracted to MGM in 1956.\n\nOther appearances include The Man Who Understood Women. He tested for a part in Ben Hur, but his big break was the role of Apollodorus, Cleopatra's personal servant in the 1963 film, Cleopatra directed by Joseph Mankiewicz and starring Elizabeth Taylor, Richard Burton and Rex Harrison. While the original script called for a major role for Danova, who was to form a trio of Cleopatra's lovers alongside Harrison's Caesar and Burton's Marc Antony. Though a number of scenes featuring Taylor and Danova were shot, the script was revised and the role truncated as the Burton-Taylor affair made tabloid headlines. What remained was little more than a cameo.\n\nThe following year he starred as Count Elmo Mancini in Viva Las Vegas as Elvis Presley's rival for both Ann Margaret's Rusty Martin and for the Las Vegas Grand Prix (predictably losing both to Elvis's Lucky Jackson).\n\nIn 1967, Danova had another break with the TV series, Garrison's Gorillas, in which he played the role of Actor. Clearly inspired by the hit film, The Dirty Dozen and the hit TV series Mission: Impossible, the series had an ensemble cast but, unfortunately, only ran for 26 episodes. Two of his best roles were as the neighborhood mafia Don, Giovanni Cappa, in Martin Scorsese's Mean Streets (1973) and as the corrupt town mayor, Carmine DePasto, in National Lampoon's Animal House (1978). He also acted in three episodes of The Rifleman, and regularly appeared as a guest star on numerous television series, including Murder, She Wrote, Maude, Falcon Crest, and the revival of Mission: Impossible (1988–90).\n\nHe died of a heart attack at the Academy of Motion Picture Arts and Sciences headquarters in Los Angeles while attending a meeting of the Foreign Language Film committee. His mausoleum is in Valhalla Memorial Park Cemetery.\n\nDanova was married twice and had two sons, Marco &amp; Fabrizio, by his first wife, Pamela. He was an expert horseman, avid polo player, and an excellent archer.\n\nDescription above from the Wikipedia article Cesare Danova, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1926-03-01",
        "deathday": "1992-03-19",
        "gender": 2,
        "homepage": null,
        "id": 2558,
        "imdb_id": "nm0200488",
        "known_for_department": "Acting",
        "name": "Cesare Danova",
        "place_of_birth": "Bergamo, Italy",
        "popularity": 0.293,
        "profile_path": "/fJVMpl25lXnd6gwiLxMV1thVFsh.jpg"
    }
}