{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/oog0DJtSuPnWoSTYM7cKmAFbeuU.jpg",
                "genre_ids": [
                    27,
                    9648,
                    18
                ],
                "id": 16372,
                "original_language": "en",
                "original_title": "The Innocents",
                "overview": "A young governess for two children becomes convinced that the house and grounds are haunted by ghosts and that the children are being possessed.",
                "popularity": 3.0858,
                "poster_path": "/idqvLBmlEHUITMnQ0EJ6Yb5TpVw.jpg",
                "release_date": "1961-11-24",
                "title": "The Innocents",
                "video": false,
                "vote_average": 7.466,
                "vote_count": 627,
                "character": "Flora",
                "credit_id": "52fe46cc9251416c75083e73",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "帕梅拉·富兰克林",
            "پاملا فرانکلین"
        ],
        "biography": "Pamela Franklin is a British actress who appeared in films from 1961 until 1976.\n\nFranklin was born in Yokohama, Japan, and grew up in the Far East, where her father was a trader. She was sent to the Elmhurst School of Ballet in England. She made her film debut at the age of 11 in The Innocents (1961), and her television debut in the Wonderful World of Disney's, The Horse Without a Head. She received favourable critical notices for her portrayal of an unusually worldly teenager in the suspense film The Nanny (1965).\n\nHer first adult role was as a kidnap victim in The Night of the Following Day. Probably her best-known role was as \"Sandy\" in The Prime of Miss Jean Brodie (1969), for which she won the National Board of Review award for Best Supporting Actress. In the same year she starred in the John Huston movie Sinful Davey, with a young John Hurt, which was not successful and failed to boost her career.\n\nAs an adult, she became somewhat typecast in horror films, after her performance in the occult thriller The Legend of Hell House. Her last film role was in The Food of the Gods, although she made television appearances until 1981.\n\nShe married actor Harvey Jason in 1971, and they live in Hollywood with their two children.",
        "birthday": "1950-02-03",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 25635,
        "imdb_id": "nm0291512",
        "known_for_department": "Acting",
        "name": "Pamela Franklin",
        "place_of_birth": "Yokohama, Japan",
        "popularity": 0.7583,
        "profile_path": "/gNmhS5ewaND7PjuXZ5MTcut26mj.jpg"
    }
}