{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8JaU1ez5TSrRSmncB0Xh2YQavXP.jpg",
                "genre_ids": [
                    18,
                    53,
                    12
                ],
                "id": 204,
                "original_language": "fr",
                "original_title": "Le Salaire de la peur",
                "overview": "In a run-down South American town, four men are paid to drive trucks loaded with nitroglycerin into the jungle through to the oil field. Friendships are tested and rivalries develop as they embark upon the perilous journey.",
                "popularity": 3.0486,
                "poster_path": "/dZyZSosIlWcpQkV0f7pXcrV2TQV.jpg",
                "release_date": "1953-04-22",
                "title": "The Wages of Fear",
                "video": false,
                "vote_average": 8.019,
                "vote_count": 1010,
                "character": "Mario Livi",
                "credit_id": "52fe4226c3a36847f8007e43",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/7AvbU0ei7Fz21jqBL4tlgSufnMp.jpg",
                "genre_ids": [
                    53,
                    80,
                    18
                ],
                "id": 2721,
                "original_language": "fr",
                "original_title": "Z",
                "overview": "Amid a tense political climate, the opposition leader is killed in an apparent accident. When a prosecutor smells a cover-up, witnesses get targeted. A thinly veiled dramatization of the assassination of Greek politician Grigoris Lambrakis and its aftermath, “Z” captures the outrage at the US-backed junta that ruled Greece at the time of its release.",
                "popularity": 3.1277,
                "poster_path": "/dFAJyFNgvOv24f2RQyI9KDxjGr3.jpg",
                "release_date": "1969-02-26",
                "title": "Z",
                "video": false,
                "vote_average": 7.791,
                "vote_count": 579,
                "character": "The Deputy, a doctor",
                "credit_id": "52fe4368c3a36847f8051ed9",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/qNBxyt60hnzBRSHo1uRkRU34fYE.jpg",
                "genre_ids": [
                    18
                ],
                "id": 4480,
                "original_language": "fr",
                "original_title": "Jean de Florette",
                "overview": "In a rural French village, an old man and his only remaining relative cast their covetous eyes on an adjoining vacant property. They need its spring water for growing their flowers, and are dismayed to hear that the man who has inherited it is moving in. They block up the spring and watch as their new neighbour tries to keep his crops watered from wells far afield through the hot summer. Though they see his desperate efforts are breaking his health and his wife and daughter's hearts, they think only of getting the water.",
                "popularity": 1.6442,
                "poster_path": "/r9UAevVU0lhRKNGlxXXUeKiRwtM.jpg",
                "release_date": "1986-08-27",
                "title": "Jean de Florette",
                "video": false,
                "vote_average": 7.689,
                "vote_count": 586,
                "character": "César Soubeyran, aka 'le Papet'",
                "credit_id": "52fe43c5c3a36847f806e499",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/3ejcvnHxMFfCbnFi736cXi1ChH1.jpg",
                "genre_ids": [
                    18
                ],
                "id": 4481,
                "original_language": "fr",
                "original_title": "Manon des sources",
                "overview": "In this, the sequel to Jean de Florette, Manon has grown into a beautiful young shepherdess living in the idyllic Provencal countryside. She plots vengeance on the men who greedily conspired to acquire her father's land years earlier.",
                "popularity": 2.4672,
                "poster_path": "/1qpu6Zc1PSDL3UbDNIZJ6YuhJDW.jpg",
                "release_date": "1986-11-19",
                "title": "Manon of the Spring",
                "video": false,
                "vote_average": 7.582,
                "vote_count": 537,
                "character": "César Soubeyran,  aka \"le Papet\"",
                "credit_id": "52fe43c5c3a36847f806e53b",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/93iDrZmjDF01Tn3PxOYL8Zz9hBM.jpg",
                "genre_ids": [
                    80,
                    53
                ],
                "id": 11657,
                "original_language": "fr",
                "original_title": "Le Cercle rouge",
                "overview": "When French criminal Corey gets released from prison, he resolves to never return. He is quickly pulled back into the underworld, however, after a chance encounter with escaped murderer Vogel. Along with former policeman and current alcoholic Jansen, they plot an intricate jewel heist. All the while, quirky Police Commissioner Mattei, who was the one to lose custody of Vogel, is determined to find him.",
                "popularity": 1.5694,
                "poster_path": "/w56La43IJnGpLepgqfGCAZsbQPp.jpg",
                "release_date": "1970-10-19",
                "title": "Le Cercle Rouge",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 679,
                "character": "Jansen",
                "credit_id": "52fe44729251416c750350ef",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/sv8nSUSXb7ldLOg4dm6KDIDdSEU.jpg",
                "genre_ids": [
                    35,
                    36
                ],
                "id": 14257,
                "original_language": "fr",
                "original_title": "La Folie des grandeurs",
                "overview": "Don Sallust is the minister of the King of Spain. Being disingenuous, hypocritical, greedy and collecting the taxes for himself, he is hated by the people he oppresses. Accused by The Queen, a beautiful princess Bavarian, of having an illegitimate child to one of her maids of honor, he was stripped of his duties and ordered to retire to a monastery.",
                "popularity": 1.6367,
                "poster_path": "/uJtEs9WRqyEREvdkS470n593z03.jpg",
                "release_date": "1971-12-08",
                "title": "Delusions of Grandeur",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 714,
                "character": "Blaze, Don Sallust's valet",
                "credit_id": "52fe45df9251416c750656c3",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ivo Livi",
            "Yves Livi",
            "Yves Montant",
            "ایو مونتان"
        ],
        "biography": "Ivo Livi (13 October 1921 – 9 November 1991), better known as Yves Montand, was an Italian-born French actor and singer. He is said to be one of France's greatest 20th-century artists.\n\nMontand was born Ivo Livi in Stignano, a small village in the hills of Monsummano Terme, Italy, to Giovanni Livi, a broom manufacturer. Montand's mother Giuseppina Simoni was a devout Catholic. The family left Italy for France in 1923 following fascist Benito Mussolini's rise to power. He grew up in Marseille, where, as a young man, he worked in his sister's beauty salon (Salon de Coiffure), as well as later on the docks. He began a career in show business as a music-hall singer. In 1944, he was discovered by Édith Piaf in Paris; she made him part of her act.\n\nMontand achieved international recognition as a singer and actor, starring in many films. He is recognised for crooner style songs, with those about Paris becoming instant classics. He was one of the best known performers at Bruno Coquatrix's Paris Olympia music hall, and toured with musicians including Didi Duprat. In October 1947, he sang \"Mais qu'est-ce que j'ai?\" (music by Henri Betti and lyrics by Édith Piaf) at the Théâtre de l'Étoile. Betti also asked him to sing \"C'est si bon\" but Montand refused. Following the success of the recording of this song by the Sœurs Étienne in 1948, he decided to record it. Montand was also very popular in the Soviet Union and Eastern Europe, where he did a concert tour in 1956-57.\n\nDuring his career, Montand acted in American motion pictures as well as on Broadway. He was nominated for a César Award for Best Actor in 1980 for I comme Icare and again in 1984 for Garçon! In 1986, after his international box-office draw power had fallen off considerably, the 65-year-old Montand gave one of his best remembered performances, as the scheming uncle in Jean de Florette, co-starring Gérard Depardieu, and Manon des Sources (both 1986), co-starring Emmanuelle Béart. The film was a worldwide critical hit and revived Montand's profile in the United States, where he made an appearance on Late Night with David Letterman.\n\nIn 1951, he married Simone Signoret, and they co-starred in several films throughout their careers. The marriage was, by all accounts, fairly harmonious, lasting until her death in 1985, although Montand had a number of well-publicised affairs, notably with American actress Marilyn Monroe, with whom he starred in one of her final films, Let's Make Love. He was the stepfather to Signoret's daughter from her previous marriage, Catherine Allégret.\n\nMontand's only child, a son named Valentin, by his second wife, Carole Amiel (b. 1960), was born in 1988. In a paternity suit that caused commotion across France, another woman accused Montand of being the father of her daughter and went to court to obtain a DNA sample from him. Montand refused, but the woman persisted even after his death. In a court ruling that made international headlines, the woman won the right to have Montand exhumed and a sample taken. The results indicated that he was not the girl's biological father.\n\nHe supported left-wing causes during the 1950s and 1960s, and attended Communist festivals and meetings. ...\n\nSource: Article \"Yves Montand\" from Wikipedia in English, licensed under CC-BY-SA.",
        "birthday": "1921-10-13",
        "deathday": "1991-11-09",
        "gender": 2,
        "homepage": "http://www.yves-montand-site-officiel.com/",
        "id": 2565,
        "imdb_id": "nm0598971",
        "known_for_department": "Acting",
        "name": "Yves Montand",
        "place_of_birth": "Monsummano Terme, Pistoia, Tuscany, Italy",
        "popularity": 0.4728,
        "profile_path": "/wewmvQm200D2jD14G4YjSmg0WVb.jpg"
    }
}