{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8JaU1ez5TSrRSmncB0Xh2YQavXP.jpg",
                "genre_ids": [
                    18,
                    53,
                    12
                ],
                "id": 204,
                "original_language": "fr",
                "original_title": "Le Salaire de la peur",
                "overview": "In a run-down South American town, four men are paid to drive trucks loaded with nitroglycerin into the jungle through to the oil field. Friendships are tested and rivalries develop as they embark upon the perilous journey.",
                "popularity": 3.0486,
                "poster_path": "/dZyZSosIlWcpQkV0f7pXcrV2TQV.jpg",
                "release_date": "1953-04-22",
                "title": "The Wages of Fear",
                "video": false,
                "vote_average": 8.019,
                "vote_count": 1010,
                "character": "Linda",
                "credit_id": "52fe4226c3a36847f8007e53",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/rcEUuRtr0dFL078bNeXL8pQqrMK.jpg",
                "genre_ids": [
                    53,
                    9648
                ],
                "id": 827,
                "original_language": "fr",
                "original_title": "Les Diaboliques",
                "overview": "The cruel and abusive headmaster of a boarding school, Michel Delassalle, is murdered by an unlikely duo -- his meek wife and the mistress he brazenly flaunts. The women become increasingly unhinged by a series of odd occurrences after Delassalle's corpse mysteriously disappears.",
                "popularity": 1.5504,
                "poster_path": "/jE8ygUYBUGyUcM4sR6iinPqYeDK.jpg",
                "release_date": "1955-01-29",
                "title": "Diabolique",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 1029,
                "character": "Christina Delassalle",
                "credit_id": "52fe427dc3a36847f8022b67",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Vera Clouzot",
            "Vera Gibson Amado"
        ],
        "biography": "Véra Gibson-Amado, known professionally as Véra Clouzot, (30 December 1913 – 15 December 1960) was a Brazilian-French film actress and screenwriter. She is known for playing Linda in The Wages of Fear (1953), Christina Delassalle in Les Diaboliques (1955), and Lucie in Les Espions (1957). Clouzot also co-wrote the screenplay for La Vérité (1960). Her husband, director Henri-Georges Clouzot, named his production company after her, Véra Films.\n\nClouzot was born Véra Gibson-Amado in Rio de Janeiro, Brazil, to Alice do Rego Barros and Gilberto Amado, a Brazilian congressman, writer, journalist, lawyer and ex-President of the United Nations' International Law Committee. Writer Jorge Amado was her second cousin.\n\nIn 1941, Véra met French actor Léo Lapara, a member of the theater company of Louis Jouvet who toured in Brazil during World War II. Vera married the actor, taking part in the company's South American tour that lasted almost four years.\n\nAfter World War II, Vera settled in Paris. Louis Jouvet took over the direction of the Athenée Theater, while she continued to do small roles.\n\nVéra met film director Henri-Georges Clouzot through her then-husband, Léo Lapara, who had minor parts in Quai des Orfèvres (1947) and Return to Life (1949), in the segment directed by Clouzot, \"Le Retour de Jean\".\n\nVéra worked as a continuity assistant on Clouzot's Miquette (1950), and they married in 1950. Clouzot named his production company, Véra Films, after his wife. She made only three films, all directed by her husband. The sole female role in The Wages of Fear (1953), Linda, is played by Véra. Clouzot wrote the role specifically for his wife, as the character does not exist in the original novel. The Wages of Fear is about a South American town where a group of desperate men are offered money to drive trucks carrying nitroglycerin through rough terrain to put out an oil well fire. The Wages of Fear was the 4th highest-grossing film in France in 1953, and was seen by nearly 7 million spectators.\n\nThe most notable of Clouzot's films starring Véra was the classic thriller, Les Diaboliques (1955), co-starring Simone Signoret. She also starred in Les Espions (1957), and co-wrote the screenplay for the film La Vérité (1960), which was also directed by her husband.\n\nClouzot and Véra took a film crew with them to Véra's homeland in Brazil for their honeymoon, where Clouzot made his first attempt at directing a documentary film. The Brazilian government took issue with Clouzot filming the poverty of people in the favelas rather than the more picturesque parts of Brazil. The film was never finished because the costs became too high. Clouzot became fascinated with the region and wrote a book, Le cheval des dieux, recounting his trip.\n\nVéra died in Paris in 1960, aged 46, from a heart attack, shortly after the filming of La Vérité. Henri-Georges Clouzot fell into a depression over her death. After her funeral, he moved to Tahiti, but returned to France in December 1961. She is buried in the Montmartre Cemetery in Paris.\n\nSource: Article \"Véra Clouzot\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1913-12-30",
        "deathday": "1960-12-15",
        "gender": 1,
        "homepage": null,
        "id": 2569,
        "imdb_id": "nm0167243",
        "known_for_department": "Acting",
        "name": "Véra Clouzot",
        "place_of_birth": "Rio de Janeiro, Rio de Janeiro, Brazil",
        "popularity": 0.2248,
        "profile_path": "/7UfaPPjJiwRngLCfirPHjNzv98X.jpg"
    }
}