{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fYuWuPZyXSc3s0iPIZ4ZWpEremy.jpg",
                "genre_ids": [
                    18
                ],
                "id": 514439,
                "original_language": "en",
                "original_title": "Breakthrough",
                "overview": "Tragedy strikes when a woman named Joyce's son falls through the ice on a frozen lake and is trapped underwater for over 15 minutes. After being rushed to the hospital, the 14-year-old boy continues to fight for his life as Joyce, her husband and their pastor stay by his bedside and pray for a miracle.",
                "popularity": 5.1141,
                "poster_path": "/lUd2FNC8cMCcHyRMNZtVC48p3xH.jpg",
                "release_date": "2019-04-10",
                "title": "Breakthrough",
                "video": false,
                "vote_average": 7.647,
                "vote_count": 1121,
                "character": "Cheering Crowd / Church Member (uncredited)",
                "credit_id": "67a1925eeea89adf0902e64d",
                "order": 72
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Cindy Myskiw"
        ],
        "biography": "Cindy Myskiw, is a Canadian Actor, Producer, Director, Writer. She's had 2 speaking roles now in Hallmark Movies. She was involved in the Co-Creation of a Talk Show called \"Big Talk\" which she also Directed, Produced and Co-Hosted. \"Big Talk\" which aired on Shaw Spotlight TV. She Directed/wrote and acted in her first show film \"A Prairie Christmas\" She played Mrs. Karen Grimsley on the award-winning television series Millworth. Millworth won first place for a Narrative at the Real to Reel Film Festival in 2016. She Directed 2 Episodes and Produced Several as well as being in charge of hiring and placing all Background in 8 episodes. She produced and acted in \"Rage Can Kill\" which just won one of the 8 MB ACTRA MIP Grants. Born Cindy Rose Durocher, Daughter of Rene and Jane Durocher, the 5 child of 7 other siblings. She had a difficult childhood with divorced parents in her early teens. But she feels all her trials and tribulations have helped form her into the person that she is today. She has been married for 38 years (yes to the same man lol) and they have 4 children. Two are theirs biologically and 2 are adopted. She started acting back in 2004/5 with a community theatre group. That is where she fell in love with acting and started looking at it in a more professional level.\n\nDirector Statement: \"My desire to create work in the Winnipeg Film/Television industry is strong. We are a talented group of people in Manitoba.\" By: Cindy Myskiw",
        "birthday": "1963-11-15",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.imdb.com/name/nm4333154/",
        "id": 2573828,
        "imdb_id": "nm4333154",
        "known_for_department": "Acting",
        "name": "Cindy Rose Myskiw",
        "place_of_birth": "Winnipeg, Manitoba, Canada",
        "popularity": 0.0327,
        "profile_path": "/yjm0iJZRa512itPruykvICrvzAc.jpg"
    }
}