{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/41ZWAGMttCr74dq7sAeh44QSJTQ.jpg",
                "genre_ids": [
                    28,
                    18,
                    36,
                    10752
                ],
                "id": 14433,
                "original_language": "en",
                "original_title": "Zulu",
                "overview": "In 1879, during the Anglo-Zulu War, man-of-the-people Lt. Chard and snooty Lt. Bromhead are in charge of defending the isolated and vastly outnumbered Natal outpost of Rorke's Drift from tribal hordes.",
                "popularity": 2.6628,
                "poster_path": "/9V7tl1kIb67ZPRRNlUdy3JvqEiA.jpg",
                "release_date": "1964-01-22",
                "title": "Zulu",
                "video": false,
                "vote_average": 7.389,
                "vote_count": 540,
                "character": "Margareta Witt",
                "credit_id": "52fe45f29251416c75067fd5",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Ulla Jacobsson (23 May 1929, Mölndal – 20 August 1982, Vienna, buried at the Wiener Zentralfriedhof) was a Swedish actress who is perhaps best known for playing one of the very few female roles in the film Zulu.\n\nJacobsson was born in Gothenburg, Sweden. Originally a stage actress, she started appearing in English language films in the early 1960s and tended to play serious and anxious looking characters. She first become known internationally for nude scenes in One Summer of Happiness. Other notable roles include Ingmar Bergman's Smiles of a Summer Night, The Heroes of Telemark and la Servante. A role in the American film Love Is a Ball was an attempt to make her a sex symbol. She won the German Film Award for Supporting Actress in Alle Jahre wieder (1967).\n\nShe was married to Austrian ethnologist Hans Winfried Rohsmann (1918–2002). Jacobsson's film career tailed off in the 1970s, and she died in Vienna, Austria from bone cancer at age 53.\n\nDescription above from the Wikipedia article Ulla Jacobsson, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1929-05-23",
        "deathday": "1982-08-20",
        "gender": 1,
        "homepage": null,
        "id": 25888,
        "imdb_id": "nm0414965",
        "known_for_department": "Acting",
        "name": "Ulla Jacobsson",
        "place_of_birth": "Gothenburg, Västra Götalands län, Sweden",
        "popularity": 0.238,
        "profile_path": "/g0b7ECTx7MThMCuuIwLhVUpmxg2.jpg"
    }
}