{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/udIE8Cdon9wnYmVIOFYrBPfA2Mq.jpg",
                "genre_ids": [
                    14,
                    16,
                    35,
                    80
                ],
                "id": 856,
                "original_language": "en",
                "original_title": "Who Framed Roger Rabbit",
                "overview": "'Toon star Roger is worried that his wife Jessica is playing pattycake with someone else, so the studio hires detective Eddie Valiant to snoop on her. But the stakes are quickly raised when Marvin Acme is found dead and Roger is the prime suspect.",
                "popularity": 5.972,
                "poster_path": "/lYfRc57Kx9VgLZ48iulu0HKnM15.jpg",
                "release_date": "1988-06-22",
                "title": "Who Framed Roger Rabbit",
                "video": false,
                "vote_average": 7.531,
                "vote_count": 5937,
                "character": "Bullet #3 (voice)",
                "credit_id": "5e87d80824f2ce001365ce20",
                "order": 42
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "James Roby Gallant",
            "James Gallant"
        ],
        "biography": "James “Jim” Roby Gallant was born on December 24, 1930 in Marion, Ohio.\n\nJim’s passion for broadcasting, radio and television was the path to his life-long CAREER that spanned 59 years in the entertainment industry. Jim was a professional disc jockey, a radio and TV staff announcer and a radio and TV newsman. Early in Jim’s career, he worked at WFMJ. Jim also worked in major markets including Dayton, Norfolk, Chicago, New Haven, Philadelphia, Cleveland, Columbus, Cincinnati, Kansas City, and Miami, and spent the last 30 years working in Los Angeles as a voice-over artist, doing commercials and working in theatre, television and film.\n\nJim was also the host of his own TV show, Jim Gallant Connecticut Bandstand, out of New Haven, Conn. Jim was known as “the voice” in Kansas City. He was a host on Encore cable TV in Los Angeles. Jim was a member of the Screen Actors Guild (SAG) and the American Federation of Television and Radio Artists (AFTRA).\n\nHe passed away on Tuesday, May 6, 2014.",
        "birthday": "1930-12-24",
        "deathday": "2014-05-06",
        "gender": 2,
        "homepage": null,
        "id": 2588751,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Jim Gallant",
        "place_of_birth": "Marion, Ohio, United States of America",
        "popularity": 0.0311,
        "profile_path": "/lCZlwhUiPMJ6I0J2Zjmm3qSDYZr.jpg"
    }
}