{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/w7Z4BVMin49voNN61IUWyN9DopV.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 86837,
                "original_language": "fr",
                "original_title": "Amour",
                "overview": "Georges and Anne are in their eighties. They are cultivated, retired music teachers. Their daughter, who is also a musician, lives abroad with her family. One day, Anne has a stroke, and the couple's bond of love is severely tested.",
                "popularity": 3.2873,
                "poster_path": "/19hyCudualHxCD0GrEngqsi0wBF.jpg",
                "release_date": "2012-09-20",
                "title": "Amour",
                "video": false,
                "vote_average": 7.756,
                "vote_count": 1690,
                "character": "Alexandre",
                "credit_id": "5e96fe5f30f79c0012d89445",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Alexandre Tharaud (born 9 December 1968) is a French pianist. He is active on the concert stage and has released a large and diverse discography.\n\nBorn in Paris, Tharaud discovered the music scene through his mother who was a dance teacher at the Opéra de Paris, and his father, an amateur director and singer of operettas. Tharaud thus appeared as a child in theatres around northern France, where the family spent many weekends. His grandfather was a violinist in Paris in the 1920s and 1930s. At the initiative of his parents, Alexandre started his piano studies at the age of five, and he entered Conservatory of the 14th Arrondissement, where his teacher was Carmen Taccon-Devenat, a student of Marguerite Long.\n\nHe entered the Conservatoire de Paris at the age of 14 where he won first prize for piano in the class of Germaine Mounier when he was 17 years old. With Theodor Paraskivesco, he mastered the piano, and he sought and received advice from Claude Helffer, Leon Fleisher and Nikita Magaloff. In 1987, he won third prize at the Maria Canals International Competition in Barcelona and, a year later, the Senigallia Competition in Italy. In 1989, he was awarded 2nd prize at the ARD International Music Competition in Munich. His career developed quickly in Europe as well as in North America and Japan.\n\nIn 2009, he took part in a show devoted to Erik Satie with actor François Morel. Alongside the singer Juliette, he organised a Satie Day at the Cité de la musique, recorded for France Télévisions. He has also worked with the French composer Thierry Pécou, performing the première of his first piano concerto in October 2006 at the Théâtre des Champs-Élysées and later recording it.\n\nIn 2012, Tharaud took part in the French film Amour by Michael Haneke where he played himself, alongside Jean-Louis Trintignant, Emmanuelle Riva and Isabelle Huppert, although he said that it would not be the start of a film career for him.\n\nThe New York Times described his Bach playing at a recital in 2005 as \"crisply articulated and vividly etched\".\n\nIn 2015 Tharaud starred as the central performer at the Prinsengrachtconcert in Amsterdam.\n\nFollowing Piano intime: conversations avec Nicolas Southon (Philippe Rey, 2013), in 2017 Tharaud published a second book entitled Montrez-moi vos mains (Show me your hands) (Grasset, 2017), in which he recounts his career, methods of working, relationships with colleagues, variations in audiences around the world, and his personal feelings about a musician's life. ...\n\nSource: Article \"Alexandre Tharaud\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1968-12-09",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2602385,
        "imdb_id": "nm1225096",
        "known_for_department": "Sound",
        "name": "Alexandre Tharaud",
        "place_of_birth": "Paris, France",
        "popularity": 0.0669,
        "profile_path": "/hxzdqnBOYp6z9oAyWbDIWXKVwlt.jpg"
    }
}