{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gC0zFICTbsmJrUfAcHJl76nA0GC.jpg",
                "genre_ids": [
                    80,
                    53,
                    28
                ],
                "id": 8333,
                "original_language": "en",
                "original_title": "The Taking of Pelham One Two Three",
                "overview": "In New York, armed men hijack a subway car and demand a ransom for the passengers. Even if it's paid, how could they get away?",
                "popularity": 3.9958,
                "poster_path": "/vNhywp9w1DVG6BytxKp4kjtaaGC.jpg",
                "release_date": "1974-10-02",
                "title": "The Taking of Pelham One Two Three",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 576,
                "character": "Lt. Rico Patrone",
                "credit_id": "52fe44a0c3a36847f80a0c39",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Gerald Isaac Stiller",
            "Stiller & Meara"
        ],
        "biography": "Gerald Isaac Stiller (June 8, 1927 – May 11, 2020) was an American actor and comedian. He spent many years as part of the comedy duo Stiller and Meara with his wife, Anne Meara, to whom he was married for over 60 years until her death in 2015. Stiller saw a late-career resurgence starting in 1993, playing George Costanza's father Frank on the sitcom Seinfeld, a part which earned him an Emmy nomination. The year Seinfeld went off the air, Stiller began his role as the eccentric Arthur Spooner on the CBS comedy series The King of Queens, another role that garnered widespread acclaim.\n\nStiller appeared together with his son Ben Stiller in films such as Zoolander, Heavyweights, Hot Pursuit, The Heartbreak Kid, and Zoolander 2. He also performed voice-over work for films and television, including The Lion King 1½ and Planes: Fire and Rescue. In his later career, Stiller became known for portraying grumpy and eccentric characters who were nevertheless beloved.",
        "birthday": "1927-06-08",
        "deathday": "2020-05-11",
        "gender": 2,
        "homepage": null,
        "id": 26042,
        "imdb_id": "nm0005467",
        "known_for_department": "Acting",
        "name": "Jerry Stiller",
        "place_of_birth": "Brooklyn, New York City, New York, USA",
        "popularity": 0.5771,
        "profile_path": "/eGymLHTpIyxKyBjACsNTpEof6y4.jpg"
    }
}