{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mrTBoQTldI4BQXITBlKK9pO29ZK.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 12914,
                "original_language": "en",
                "original_title": "Stargate: Continuum",
                "overview": "Ba'al travels back in time and prevents the Stargate program from being started. SG-1 must somehow restore history.",
                "popularity": 8.1092,
                "poster_path": "/1rQUvblJHU8766FatqTtCMiRhph.jpg",
                "release_date": "2008-07-29",
                "title": "Stargate: Continuum",
                "video": false,
                "vote_average": 7.155,
                "vote_count": 548,
                "character": "Vala Mal Doran",
                "credit_id": "52fe452c9251416c7504e11f",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/hPHahVM3JDlE0Zexu6avavypk0g.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 13001,
                "original_language": "en",
                "original_title": "Stargate: The Ark of Truth",
                "overview": "SG-1 searches for an ancient weapon which could help them defeat the Ori, and discover it may be in the Ori's own home galaxy. As the Ori prepare to send ships through to the Milky Way to attack Earth, SG-1 travels to the Ori galaxy aboard the Odyssey. The International Oversight committee have their own plans and SG-1 finds themselves in a distant galaxy fighting two powerful enemies.",
                "popularity": 5.1718,
                "poster_path": "/kIqsCdZBmKYuPwaDnrFYzK1gqlM.jpg",
                "release_date": "2008-03-11",
                "title": "Stargate: The Ark of Truth",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 535,
                "character": "Vala Mal Doran",
                "credit_id": "52fe452d9251416c7504e3e7",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/mOtKQlXdL5J4lwqcSFlkZmgmFeZ.jpg",
                "genre_ids": [
                    16,
                    35,
                    10751,
                    37,
                    12
                ],
                "id": 44896,
                "original_language": "en",
                "original_title": "Rango",
                "overview": "When Rango, a lost family pet, accidentally winds up in the gritty, gun-slinging town of Dirt, the less-than-courageous lizard suddenly finds he stands out. Welcomed as the last hope the town has been waiting for, new Sheriff Rango is forced to play his new role to the hilt.",
                "popularity": 8.5805,
                "poster_path": "/A5MP1guV8pbruieG0tnpPIbaJtt.jpg",
                "release_date": "2011-03-02",
                "title": "Rango",
                "video": false,
                "vote_average": 6.882,
                "vote_count": 6807,
                "character": "Angelique (voice)",
                "credit_id": "52fe46a2c3a36847f8109adf",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/8EKxPfuEMg1qP0E1r1ZAk56J7MP.jpg",
                "genre_ids": [
                    28,
                    16,
                    878,
                    14
                ],
                "id": 76589,
                "original_language": "en",
                "original_title": "Justice League: Doom",
                "overview": "An adaptation of Mark Waid's \"Tower of Babel\" story from the JLA comic. Vandal Savage steals confidential files Batman has compiled on the members of the Justice League, and learns all their weaknesses.",
                "popularity": 2.4767,
                "poster_path": "/seCbcjdZYUl8SRKjeWfyi2ngzFj.jpg",
                "release_date": "2012-02-28",
                "title": "Justice League: Doom",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 901,
                "character": "Cheetah (voice)",
                "credit_id": "52fe4942c3a368484e1227ab",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Claudia Lee Black",
            "کلودیا بلک"
        ],
        "biography": "Claudia Lee Black is an Australian actress and voice actress, best known for her portrayals of Aeryn Sun in Farscape, Vala Mal Doran in Stargate SG-1 and Sharon \"Shazza\" Montgomery in the film Pitch Black. She has had prominent roles in video games, such as Chloe Frazer in Uncharted, Morrigan in Dragon Age, Admiral Daro'Xen and Matriarch Aethyta in Mass Effect and Samantha Byrne in Gears of War 3, Gears of War 4, and Gears of War 5. She also had a recurring role as Dahlia in The Originals and starred as Dr. Sabine Lommers in The CW's Containment.  Black was born and raised in a Jewish family in Sydney, New South Wales, Australia. She studied at the Anglican Kambala School, in Sydney. She has lived in Australia, New Zealand, Spain, the United Kingdom, Canada and the United States. Her parents are Australian medical academics Jules and Judy Black.\n\nSince 2007, Black has been a prolific video game voice actress. She has gained particular attention for her work with BioWare's Dragon Age and Mass Effect series. Her son Odin Black voiced her Dragon Age character's son in Dragon Age: Inquisition. She also played Chloe Frazer in the Uncharted series.\n\nIn 2014 she voices the vendor Tess Everis in the game Destiny and again in 2017 for Destiny 2 and she she had a voice-over role in Rick and Morty as Ma-Sha in the episode \"Rasing Gazorpaso\". In 2016, she appeared in Call of Duty: Infinite Warfare as Engineer Audrey \"Mac\" MaCallum and n 2008, she narrated the audiobook \"Swallowing Darkness\" by Laurell K. Hamilton.\n\nThis page is based on a Wikipedia article written by contributors. Text is available under the CC BY-SA 4.0 license; additional terms may apply.",
        "birthday": "1972-10-11",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 26054,
        "imdb_id": "nm0085227",
        "known_for_department": "Acting",
        "name": "Claudia Black",
        "place_of_birth": "Sydney, New South Wales, Australia",
        "popularity": 0.7204,
        "profile_path": "/7bwHbuv81Q1ytQkJL1g8JLHrdrN.jpg"
    }
}