{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cy7ymUaMEWRoig7LWXpfzaaw2vv.jpg",
                "genre_ids": [
                    18
                ],
                "id": 147,
                "original_language": "fr",
                "original_title": "Les Quatre Cents Coups",
                "overview": "For young Parisian boy Antoine Doinel, life is one difficult situation after another. Surrounded by inconsiderate adults, including his neglectful parents, Antoine spends his days with his best friend, Rene, trying to plan for a better life. When one of their schemes goes awry, Antoine ends up in trouble with the law, leading to even more conflicts with unsympathetic authority figures.",
                "popularity": 3.1065,
                "poster_path": "/12PuU23kkDLvTd0nb8hMlE3oShB.jpg",
                "release_date": "1959-06-03",
                "title": "The 400 Blows",
                "video": false,
                "vote_average": 8.024,
                "vote_count": 2226,
                "character": "Gilberte's Lover (uncredited)",
                "credit_id": "65b70f2d1089ba0164f7d4c6",
                "order": 33
            },
            {
                "adult": false,
                "backdrop_path": "/oi7D7gBwTpaDqSx9jaXmkT7Yaai.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 269,
                "original_language": "fr",
                "original_title": "À bout de souffle",
                "overview": "A small-time thief steals a car and impulsively murders a motorcycle policeman. Wanted by the authorities, he attempts to persuade a girl to run away to Italy with him.",
                "popularity": 2.9267,
                "poster_path": "/9Wx0Wdn2EOqeCZU4SP6tlS3LOml.jpg",
                "release_date": "1960-03-16",
                "title": "Breathless",
                "video": false,
                "vote_average": 7.517,
                "vote_count": 1904,
                "character": "A Journalist (uncredited)",
                "credit_id": "560189c9c3a368372b0017a5",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Jean Douchet (January 19, 1929 – November 22, 2019) was a French film director, historian, film critic and teacher who began his career in the early 1950s at Gazette du Cinéma and Cahiers du cinema with members of the future French New Wave.\n\nAs a journalist Douchet wrote extensively about New Wave filmmakers, as well as such directors as Alfred Hitchcock, F. W. Murnau, Kenji Mizoguchi, Vincente Minnelli, Akira Kurosawa, Jean-Luc Godard and Jean-Daniel Pollet. He enabled Serge Daney to begin working for Cahiers. He also acted in small roles for such directors as Godard, Rohmer, François Truffaut, Jean Eustache, Jacques Rivette, Jean Pierre Lefebvre and François Ozon. He taught at the Institut des Hautes Études Cinématographiques and his students included Ozon, Émilie Deleuze and Xavier Beauvois. He was also involved with the Cinémathèque Française and regularly hosts screenings and events. For the Cinémathèque's 2010 tribute to the then recently deceased Éric Rohmer he made the documentary Claude et Éric, an interview with Claude Chabrol about Rohmer's early days at Cahiers du cinema.\n\nOn November 22, 2019, the Cinémathèque Française announced that Jean Douchet had died at age 90.\n\nSource: Article \"Jean Douchet\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1929-01-19",
        "deathday": "2019-11-22",
        "gender": 2,
        "homepage": null,
        "id": 260837,
        "imdb_id": "nm0234749",
        "known_for_department": "Acting",
        "name": "Jean Douchet",
        "place_of_birth": "Arras, Pas-de-Calais, France",
        "popularity": 0.0286,
        "profile_path": "/dtgf5Eo8CCNq8gub1LWxlMWTaFP.jpg"
    }
}