{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rOJb0yQOCny0bPjg8bCLw8DyAD7.jpg",
                "genre_ids": [
                    35,
                    12,
                    878
                ],
                "id": 550988,
                "original_language": "en",
                "original_title": "Free Guy",
                "overview": "A bank teller discovers he is actually a background player in an open-world video game, and decides to become the hero of his own story. Now, in a world where there are no limits, he is determined to be the guy who saves his world his way before it's too late.",
                "popularity": 11.4114,
                "poster_path": "/6PFJrMvoQwBxQITLYHj09VeJ37q.jpg",
                "release_date": "2021-08-11",
                "title": "Free Guy",
                "video": false,
                "vote_average": 7.471,
                "vote_count": 9267,
                "character": "Lazarbeam",
                "credit_id": "5e9f167e1f331900244c7f71",
                "order": 33
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "LazarBeam",
            "LazarLazar",
            "Lazerbeam"
        ],
        "biography": "Lannan Eacott (born December 14, 1994), better known by his online alias LazarBeam, is an Australian YouTuber, professional gamer and internet personality, known primarily for his Let's Play videos, \"comedic riffs\" and use of memes. Eacott is a member of the entertainment collective known as Click, alongside other Australian YouTubers.\n\nEacott began making slow motion demolition videos in 2014, while working in his family's construction business. After registering his current YouTube channel in 2015, Eacott primarily posted Let's Play and challenge videos of various video games. As his channel grew, his style of video content diversified to include more vlog and comedy style videos. His channel experienced substantial growth in popularity when he began posting videos of Fortnite Battle Royale in 2018. In December 2019, Eacott was acknowledged as YouTube's eighth most-viewed content creator of the year, with 2 billion views in 2019.\n\nAs of March 2020, his YouTube channel has reached over 13 million subscribers and 4.5 billion video views, ranking as the fourth most-subscribed and third most-viewed channel on the platform from Australia.",
        "birthday": "1994-12-14",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2610063,
        "imdb_id": "nm7878598",
        "known_for_department": "Acting",
        "name": "Lannan Eacott",
        "place_of_birth": "New South Wales, Australia",
        "popularity": 0.0971,
        "profile_path": "/f7LrrVNVrjRm3aN9lctqb78rowP.jpg"
    }
}