{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/exnFsbb9c3fDutTsgtJSWcDmZm0.jpg",
                "genre_ids": [
                    18,
                    10749,
                    80
                ],
                "id": 511809,
                "original_language": "en",
                "original_title": "West Side Story",
                "overview": "Two youngsters from rival New York City gangs fall in love, but tensions between their respective friends build toward tragedy.",
                "popularity": 6.3099,
                "poster_path": "/yfz3IUoYYSY32tkb97HlUBGFsnh.jpg",
                "release_date": "2021-12-08",
                "title": "West Side Story",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 1662,
                "character": "Pachanga Dancer",
                "credit_id": "66a946007c1f118c004e2fd5",
                "order": 123
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Isaias Badilla is an actor and filmmaker. Born and raised in Costa Rica, Isaias grew up surrounded by the magic of cinema, thanks to his two older brothers who instilled in him a deep appreciation for the art form.\n\nAfter 5 years of classical music training, his journey took an exciting turn when he joined the Taller Nacional de Teatro in Costa Rica. In 2018, Isaias made a bold move, crossing borders to pursue his dreams in the United States. He completed his senior year and embarked on a transformative experience at The American Academy of Dramatic Arts NY in 2019.\n\nIsaias’ talent shines on both the big screen and the stage. Some of his acting work has been seen in over thirty different film festivals worldwide. Notably, he starred in the short film “Ñaños,” which received official selection at the 2022 Tribeca Festival.  His New York and International Theater credits have demonstrated his versatility in roles such as Connor Murphy in Querido Evan (Dear Evan Hansen), Jonathan Baransky in the Off-Broadway revival of “Dream On, Baransky”, Sebastian in “Danse Macabre”, Aisymnetes in “Raving Reason”, Alfonso LeChien in “The Gnarly Narwhal”, Miguel in “The Window Washer”, and even the multifaceted Marcellus/Guildenstern/Osric in “Hamlet”.\n\nIn 2024, Isaias and his brothers took their passion to the next level by founding Purple Duck LLC. This independent film production company seeks to explore and challenge the boundaries of cinema through the power of creativity and storytelling.",
        "birthday": "2000-04-13",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2621973,
        "imdb_id": "nm9599884",
        "known_for_department": "Acting",
        "name": "Isaias Badilla",
        "place_of_birth": "Heredia, Costa Rica",
        "popularity": 1.4385,
        "profile_path": "/etXSpx6iKoS7DF4FkQIJtzfPqtC.jpg"
    }
}