{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/a8230eNW59hSOkj5XrRpzMMh0WT.jpg",
                "genre_ids": [
                    18,
                    53,
                    80
                ],
                "id": 4836,
                "original_language": "en",
                "original_title": "Layer Cake",
                "overview": "When a seemingly straight-forward drug deal goes awry, XXXX has to break his die-hard rules and turn up the heat, not only to outwit the old regime and come out on top, but to save his own skin...",
                "popularity": 3.6557,
                "poster_path": "/rDOxXteqxALBaSa3V3zTjGJuyWB.jpg",
                "release_date": "2004-09-30",
                "title": "Layer Cake",
                "video": false,
                "vote_average": 6.912,
                "vote_count": 2221,
                "character": "Jimmy Price",
                "credit_id": "52fe43ddc3a36847f8074f63",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/4hfcpHmMEgmFTdnVx4XCtM6dgCG.jpg",
                "genre_ids": [
                    14,
                    12,
                    28,
                    10751,
                    10749
                ],
                "id": 102651,
                "original_language": "en",
                "original_title": "Maleficent",
                "overview": "A beautiful, pure-hearted young woman, Maleficent has an idyllic life growing up in a peaceable forest kingdom, until one day when an invading army threatens the harmony of the land. She rises to be the land's fiercest protector, but she ultimately suffers a ruthless betrayal – an act that begins to turn her heart into stone. Bent on revenge, Maleficent faces an epic battle with the invading King's successor and, as a result, places a curse upon his newborn infant Aurora. As the child grows, Maleficent realizes that Aurora holds the key to peace in the kingdom – and to Maleficent's true happiness as well.",
                "popularity": 12.703,
                "poster_path": "/bDG3yei6AJlEAK3A5wN7RwFXQ7V.jpg",
                "release_date": "2014-05-28",
                "title": "Maleficent",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 13412,
                "character": "King Henry",
                "credit_id": "52fe4a0cc3a36847f81b5cef",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/9rMSCFH9zhv1vILpEZQlUJs9iUm.jpg",
                "genre_ids": [
                    80,
                    28,
                    35
                ],
                "id": 4638,
                "original_language": "en",
                "original_title": "Hot Fuzz",
                "overview": "Former London constable Nicholas Angel finds it difficult to adapt to his new assignment in the sleepy British village of Sandford. Not only does he miss the excitement of the big city, but he also has a well-meaning oaf for a partner. However, when a series of grisly accidents rocks Sandford, Angel smells something rotten in the idyllic village.",
                "popularity": 6.2364,
                "poster_path": "/zPib4ukTSdXvHP9pxGkFCe34f3y.jpg",
                "release_date": "2007-02-14",
                "title": "Hot Fuzz",
                "video": false,
                "vote_average": 7.562,
                "vote_count": 7922,
                "character": "James Reaper",
                "credit_id": "569e6ed2c3a36858cb0065fc",
                "order": 15
            },
            {
                "adult": false,
                "backdrop_path": "/h1bNQ2MZzKLuKa7N0nOuSXlgMwT.jpg",
                "genre_ids": [
                    18,
                    53,
                    10752
                ],
                "id": 2253,
                "original_language": "en",
                "original_title": "Valkyrie",
                "overview": "Wounded in Africa during World War II, Nazi Col. Claus von Stauffenberg returns to his native Germany and joins the Resistance in a daring plan to create a shadow government and assassinate Adolf Hitler. When events unfold so that he becomes a central player, he finds himself tasked with both leading the coup and personally killing the Führer.",
                "popularity": 4.0294,
                "poster_path": "/8eoRtXswC8IQDsqW7iJWO56NhAv.jpg",
                "release_date": "2008-12-25",
                "title": "Valkyrie",
                "video": false,
                "vote_average": 6.945,
                "vote_count": 3877,
                "character": "Field Marshal Wilhelm Keitel",
                "credit_id": "585333c0c3a36806a701b29e",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/wONHmd6x0UW6AV1DLzxlNwH9sQn.jpg",
                "genre_ids": [
                    53,
                    36,
                    18
                ],
                "id": 393624,
                "original_language": "en",
                "original_title": "Official Secrets",
                "overview": "The true story of British intelligence whistleblower Katharine Gun who—prior to the 2003 Iraq invasion—leaked a top-secret NSA memo exposing a joint US-UK illegal spying operation against members of the UN Security Council. The memo proposed blackmailing member states into voting for war.",
                "popularity": 3.5061,
                "poster_path": "/lyCGqSkT3PqLYQXiWs4FCVJBAYW.jpg",
                "release_date": "2019-08-30",
                "title": "Official Secrets",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 1037,
                "character": "Judge Hyam",
                "credit_id": "5acf66310e0a26320a05c0ba",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            " Ken Cranham ",
            "Кеннет Крэнем"
        ],
        "biography": "Scottish born actor Kenneth Cranham is one of the most recognisable character actors in Britain. Having trained at the National Youth Theatre and RADA, Cranham first came to prominence as Noah Claypole in the 1968 Carol Reed musical Oliver! In the late '70s, Cranham memorably played Sapper Salt in Euston Films' Danger UXB, before taking the title role in the popular postwar set period comedy drama Shine on Harvey Moon. His most famous film role from around this time was Dr. Philip Channard in Hellraiser II. In more recent years he has starred in the HBO series Rome, as well as the films Hot Fuzz, Layer Cake, Valkyrie, Made in Dagenham, Maleficent and Film Stars Don't Die In Liverpool.  Among many stage credits are West End productions of Entertaining Mr Sloane, Loot, An Inspector Calls (both transferring to Broadway), The Ruffian on the Stair, The Birthday Party and Gaslight (at the Old Vic). For his role as Inspector Goole in An Inspector Calls, he was nominated for a Laurence Olivier Award. In 2016, Cranham won the Olivier Award for Best Actor in a Play for his role as Andre in Florian Zeller's The Father. The play originated at the Theatre Royal Bath's Ustinov Studio in the Autumn of 2014, before touring the country and transferring to the West End in the Summer of 2015, and returning to the Duke of York's Theatre in Spring 2016. The play received an unprecedented five star review from every leading national press publication, and Cranham's performance was described as \"the performance of his life\"  His first wife was actress Diana Quick. He has two daughters: Nancy Cranham with actress Charlotte Cornwell, and Kathleen Cranham with his second wife, actress Fiona Victory, whom he met on the set of Shine on Harvey Moon.",
        "birthday": "1944-12-12",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 26258,
        "imdb_id": "nm0186469",
        "known_for_department": "Acting",
        "name": "Kenneth Cranham",
        "place_of_birth": "Dunfermline - Scotland - UK",
        "popularity": 1.0325,
        "profile_path": "/9lzTbNgaoArlxpEkYtWQfOyiYwu.jpg"
    }
}