{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bcT8CaBIj086WVD7K529h78eujb.jpg",
                "genre_ids": [
                    10751,
                    35,
                    12,
                    16,
                    14
                ],
                "id": 508439,
                "original_language": "en",
                "original_title": "Onward",
                "overview": "In a suburban fantasy world, two teenage elf brothers embark on an extraordinary quest to discover if there is still a little magic left out there.",
                "popularity": 5.7238,
                "poster_path": "/f4aul3FyD3jv3v4bul1IrkWZvzq.jpg",
                "release_date": "2020-02-29",
                "title": "Onward",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 6366,
                "character": "Officer Avel (voice)",
                "credit_id": "5eb1a832f74f5f001f9509f9",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "George Psarras is an actor, musician, composer and sound designer from the San Francisco Bay Area. Mr. Psarras was just seen on General Hospital and recently wrapped the film Tapawingo along with his twin brother Paul Psarras, where they play the eccentric Glenn and Ben Gratton respectively. The film stars Jon Heder, Kim Matula, Billy Zane, Gina Gershon and others. Look out for it in 2022!\n\nOn the stage, recent credits include The Humans (Richard Saad) at San Jose Stage Company and Silent Sky (Peter Shaw) at City Lights Theater Company, Between Riverside and Crazy (Lt. Caro) at San Jose Stage Company, and Finks (Sgt at Arms, Piano Player) at TheatreWorks Silicon Valley. Mr. Psarras recently made his feature film debut in Disney Pixar's Onward, in March of 2020. He recently made his television debut as a co-star in the TNT show The Last Ship directed by Peter Weller. He was also in the video game NBA2K16 directed by Spike Lee.\n\nOther recent roles include Bassanio in The Merchant of Venice, Brock in Ideation and Merrick in The Elephant Man, all at City Lights Theater Company in San Jose, California. He was also seen at TheatreWorks Silicon Valley in Water By The Spoonful (Prof Aman, Ghost, swing-Elliot), and Anna in the Tropics. He has worked with Crowded Fire Theatre, Golden Thread Productions, and Dragon Productions. Other City Lights credits include Dr. Jekyll and Mr. Hyde (Dr. Jekyll), Build (Kip), Amadeus (Mozart), Spacebar: A Broadway Play by Kyle Sugarman (Playboy/Fancee Magee), Aphrodisiac (Avery), August: Osage County (Little Charles), Compleat Female Stage Beauty (Charles II), The Three Musketeers (Aramis), and First Person Shooter (Tommy/Billy).  In 2013, he was a co-creative director and performer at El Capitan Theater in Hollywood for The Gabby Awards, an awards ceremony celebrating the talents and achievements of notable Greek Americans. He also participated in the 2017 Gabby Awards at Carnegie Hall. Mr. Psarras has also been playing Greek music with his former band Fotia and with his twin brother Paul Psarras since 1998 in cities around the country including  San Francisco, San Jose, Las Vegas, Honolulu, Los Angeles, Chicago, New York as well as others.\n\nMr. Psarras is the resident sound designer/composer at City Lights Theater Company of San Jose where he has designed over fifty shows. He is a winner of four Theatre Bay Area Awards for Outstanding Sound Design for Eurydice, Dr. Jekyll and Mr. Hyde, Truce: A Christmas Wish From The Great War, and Amadeus.  Mr. Psarras also works in film, television (The Last Ship), voice over (Pixar) and commercials (Toyota).",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.georgepsarras.com/",
        "id": 2626627,
        "imdb_id": "nm6144523",
        "known_for_department": "Acting",
        "name": "George Psarras",
        "place_of_birth": null,
        "popularity": 0.0752,
        "profile_path": "/4wao8vC3gsBAWKruOnhywEEeuXU.jpg"
    }
}