{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/32V4uHVRU2fbDsQl1dsYsZm3uba.jpg",
                "genre_ids": [
                    80,
                    35
                ],
                "id": 107,
                "original_language": "en",
                "original_title": "Snatch",
                "overview": "Unscrupulous boxing promoters, violent bookies, a Russian gangster, incompetent amateur robbers, and supposedly Jewish jewellers fight to track down a priceless stolen diamond.",
                "popularity": 8.264,
                "poster_path": "/kJZoAHq1SLDdWjeNGtlHAnGpmFV.jpg",
                "release_date": "2000-09-01",
                "title": "Snatch",
                "video": false,
                "vote_average": 7.817,
                "vote_count": 9473,
                "character": "Tyrone",
                "credit_id": "52fe4219c3a36847f8003c25",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/c2gcLDxniE0lNmT2a7CcQVuW6En.jpg",
                "genre_ids": [
                    12,
                    28,
                    53
                ],
                "id": 36557,
                "original_language": "en",
                "original_title": "Casino Royale",
                "overview": "Le Chiffre, a banker to the world's terrorists, is scheduled to participate in a high-stakes poker game in Montenegro, where he intends to use his winnings to establish his financial grip on the terrorist market. M sends Bond—on his maiden mission as a 00 Agent—to attend this game and prevent Le Chiffre from winning. With the help of Vesper Lynd and Felix Leiter, Bond enters the most important poker game in his already dangerous career.",
                "popularity": 16.5461,
                "poster_path": "/lMrxYKKhd4lqRzwUHAy5gcx9PSO.jpg",
                "release_date": "2006-11-14",
                "title": "Casino Royale",
                "video": false,
                "vote_average": 7.564,
                "vote_count": 11143,
                "character": "Infante",
                "credit_id": "53ac2a4b0e0a26760f001f8f",
                "order": 22
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Born in London, in the early seventies, Ade tried his hand at various trades; from selling shoes, tickets for concerts, managing bands, to publishing an international horse racing magazine. Ade was known by Guy Ritchie who cast him as Tyrone the getaway driver in Snatch (2000). He then set off on the European press jaunt & traveled to the United States to preview the movie, addressing the audience at Harry Knowles' 24hr film festival at The Alamo, Texas. Ade has since been involved with several other film and TV projects; notably as Infante in the Bond movie Casino Royale (2006) and Madonna's directorial debut Filth and Wisdom (2008).\n\nHe knew Guy Ritchie for several years prior to both their endeavours into the motion picture world. He & Guy became reacquainted just before the release of Guy's showstopper \"Lock Stock...\" at which point Guy politely informed Ade of his new project, titled at that time \"Diamonds\" now known as Snatch (2000). He was always a character that appealed to Guy and as the the days progressed during the shooting, Guy realised that he had discovered a real diamond in the rough.",
        "birthday": "1970-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2627,
        "imdb_id": "nm0011744",
        "known_for_department": "Acting",
        "name": "Ade",
        "place_of_birth": "Crouch End, London, England, UK",
        "popularity": 0.065,
        "profile_path": "/vDLKOLFlGkoLkEbc3RlVmwnw70y.jpg"
    }
}