{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/pRBCb6Hs6Xo4diXwpnBTcwMizE.jpg",
                "genre_ids": [
                    80,
                    53
                ],
                "id": 1485,
                "original_language": "en",
                "original_title": "Get Carter",
                "overview": "Jack Carter is a small-time hood working in London. When word reaches him of his brother's death, he travels to Newcastle to attend the funeral. Refusing to accept the police report of suicide, Carter seeks out his brother’s friends and acquaintances to learn who murdered his sibling and why.",
                "popularity": 2.9415,
                "poster_path": "/3AytAYzJuPmS4Wo8X3jcsaN4oM3.jpg",
                "release_date": "1971-02-03",
                "title": "Get Carter",
                "video": false,
                "vote_average": 6.999,
                "vote_count": 525,
                "character": "Sid Fletcher",
                "credit_id": "5792aaafc3a36828a60033c0",
                "order": 14
            },
            {
                "adult": false,
                "backdrop_path": "/okdg55jhsr9k1F2lxsZoQncrLZL.jpg",
                "genre_ids": [
                    18,
                    10749,
                    10752,
                    36
                ],
                "id": 3175,
                "original_language": "en",
                "original_title": "Barry Lyndon",
                "overview": "An Irish rogue uses his cunning and wit to work his way up the social classes of 18th century England, transforming himself from the humble Redmond Barry into the noble Barry Lyndon.",
                "popularity": 6.1938,
                "poster_path": "/x2JQCgLjieWOwvImeGtLmuNgsrq.jpg",
                "release_date": "1975-12-18",
                "title": "Barry Lyndon",
                "video": false,
                "vote_average": 8.003,
                "vote_count": 2995,
                "character": "Recruiting Soldier",
                "credit_id": "5ab8ddf4c3a368179d00cbd8",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "John Binden"
        ],
        "biography": "John 'Biffo' Bindon was a British actor and bodyguard (most notoriously for Led Zeppelin on their 1977 US tour, which he was subsequently sacked from for violent behaviour) with close links to the London underworld and a celebrated party trick; \"I'd hang five half-pint beer glasses on me manhood. Everyone would ask how it's done beforehand so I'd put them out of their misery and thread my old chap through the handles of the glasses\". The son of a London cab driver, Bindon was sentenced to Borstal twice in his youth and gained his nickname 'Biffo' from his propensity for starting fights. Spotted by Ken Loach in a London pub, Bindon got his acting break with the 1967 film Poor Cow. Roles in classic British films like Performance, Get Carter and Quadrophenia would follow, with Bindon often typecast as a gangland heavy. In 1968, Bindon met Vicki Hodge, a baronet's daughter turned model and actress, who introduced him to British aristocracy. This led to close and controversial links with Princess Margaret and her holiday hideaway of the Caribbean island resort of Mustique. Bindon and his alleged relationship with Princess Margaret is a major plot element in the 2008 crime film The Bank Job.  Also in 1968, Bindon was awarded the Queen's Award for Bravery for diving off Putney Bridge into the River Thames to rescue a drowning man - although some said he had pushed the man in and only rescued him when a policeman appeared. In 1979, Bindon stood trial for the murder of London gangster John Darke. Bindon's successful defence (bolstered by a character witness appearance from actor Bob Hoskins) argued that Darke's death was in self-defence, saying Bindon was in fear of his life as he was being blackmailed about losing drug money and cocaine worth thousands of pounds. Despite being acquitted, Bindon struggled to find work in the entertainment industry as his reputation was now tarnished. He died of an AIDS-related illness in 1993, having spent the later years of his life as a virtual recluse in Belgravia.",
        "birthday": "1943-10-04",
        "deathday": "1993-10-10",
        "gender": 2,
        "homepage": null,
        "id": 262950,
        "imdb_id": "nm0082843",
        "known_for_department": "Acting",
        "name": "John Bindon",
        "place_of_birth": "London, England, UK",
        "popularity": 0.5268,
        "profile_path": "/98xK1Ys58WtGGqb94ozRYpeapbe.jpg"
    }
}