{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8WIufsaJgm7VWgAc5ALWdJ8v2kB.jpg",
                "genre_ids": [
                    14,
                    27,
                    35
                ],
                "id": 766,
                "original_language": "en",
                "original_title": "Army of Darkness",
                "overview": "Ash, a handsome, shotgun-toting, chainsaw-armed department store clerk, is time warped backwards into England's Dark Ages, where he romances a beauty and faces legions of the undead.",
                "popularity": 4.8105,
                "poster_path": "/xsgTuAtR2zSH8Umg3jWZcZjlDpe.jpg",
                "release_date": "1992-10-31",
                "title": "Army of Darkness",
                "video": false,
                "vote_average": 7.255,
                "vote_count": 3336,
                "character": "Peasant Woman (uncredited)",
                "credit_id": "5eb8ae5fbbe1dd0022823211",
                "order": 39
            },
            {
                "adult": false,
                "backdrop_path": "/plWyKqUIenzqFjMrs1gu7Gjygfq.jpg",
                "genre_ids": [
                    53,
                    9648
                ],
                "id": 402,
                "original_language": "en",
                "original_title": "Basic Instinct",
                "overview": "Catherine, a novelist with an insatiable sexual appetite, becomes a prime suspect when her boyfriend is brutally murdered -- a crime she had described in her latest story.",
                "popularity": 6.4523,
                "poster_path": "/76Ts0yoHk8kVQj9MMnoMixhRWoh.jpg",
                "release_date": "1992-03-20",
                "title": "Basic Instinct",
                "video": false,
                "vote_average": 6.929,
                "vote_count": 4127,
                "character": "Classmate (uncredited)",
                "credit_id": "5ec1c93ecdf2e600204f095b",
                "order": 42
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Patricia Ann Isgate"
        ],
        "biography": "Patricia Anne Isgate-Hayward a former restaurateur and Director of Income who moved into film production in the late 1980s, has given audiences visually stunning and entertaining movies. Her first independent feature film \"together and alone\" debuted in the 1997 Sundance Festival marked the founding of Texas Trouble Entertainment with former partner Duane Whitaker. The company made \"Camp Utopia\" a campy teen horror featuring rock legend Stephen Pearcy of the group 'Ratt\" before disbanding in 2006. Isgate-Hayward ventured out on her own to produced the Drama \"Cold Ones\" aka \"Dead Letters\" starring Thomas C. Howell and Kim Darby in 2007. Isgate-Hayward met filmmaker Tammi Sutton on the 4th of July in 2005 and formed Southern Belle Pictures an all female powerhouse production company. Patricia was born on May 13, 1966 in Landstuhl, Germany on an American Air force base. She is the 3rd and youngest child of Billy Ed and Ruby Nell Isgate - after moving to Texas her father ran Houston Lighting and Power for GE and her mother ran the Isgate home. Due to being highly hyper active and imaginative child she never could stand still for long and had to find ways to amuse herself. Patricia would wash cars in the neighborhood, gather her friends and sisters, rehearse and put on plays for the neighborhood kids charging a quarter per person to entertain them and herself. In 1974 her beloved father passed away and after living for a year on the family sailboat her mother moved the family to Florida. A solid B-student, Isgate opened her first restaurant at age 16 before she moved on to the University of Texas, Austin where she started studying business, and quickly started modeling to pay the bills. Her first job out of college was as an assistant to a phone-sales-closer in an office that was raided by the feds on January 28 1986. \"As we waited to see the fate of our jobs we watched in horror as the Space Shuttle Challenger exploded\". Seeing just how short life could be she didn't waste time and landed the Director of Income position at Survival Insurance in Los Angeles. Isgate-Hayward left Survival for \"The Foundry\", the commercial, television and music video division of Propaganda Films where she worked as Julian Lennon's assistant on his \"Salt Water\" video, a first A.D. and directed a commercial for the Virginia State Lottery. She realized her love for all aspects of filmmaking, landed acting roles in several films and when asked by Director Sam Raimi \"to pay more attention to her role in the film \"The Army of Darkness\", than his, (behind the camera)\" she realized that she needed to make her mark as a producer. Patricia soon developed a gift for hands on production and connections with named actors and distributors. She has an eye for interesting material and cast and works close to her directors in hand picking their cast. With her combined experience, talent for filmmaking and being known for delivering on her word Isgate-Hayward never stands still.",
        "birthday": "1966-05-13",
        "deathday": null,
        "gender": 0,
        "homepage": null,
        "id": 2633862,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Patricia Anne Isgate-Hayward",
        "place_of_birth": " Landstuhl, West Germany",
        "popularity": 0.0662,
        "profile_path": null
    }
}