{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/foS1hXCMagcl3GnK0hJHslNw9Ne.jpg",
                "genre_ids": [
                    53,
                    27,
                    9648,
                    18
                ],
                "id": 11482,
                "original_language": "en",
                "original_title": "Le locataire",
                "overview": "A quiet and inconspicuous man rents an apartment in Paris where he finds himself drawn into a rabbit hole of dangerous paranoia.",
                "popularity": 2.6188,
                "poster_path": "/4Qhzb1ICFMqE3isWoln497qSH7n.jpg",
                "release_date": "1976-05-26",
                "title": "The Tenant",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 1174,
                "character": "Simon",
                "credit_id": "5415aa2e0e0a261c270022c4",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Romain Bouteille (24 March 1937 – 31 May 2021) was a French playwright, actor, comedian, and singer.\n\nRomain Bouteille is the author of nearly thirty plays of anarchist inspiration. In 1968, he met Coluche. Together, they founded the troupe Café de la Gare. The same year, he separated from his partner Sotha who married Patrick Dewaere. Both are members of the troupe.\n\nBouteille was married to the actress Saïda Churchill, with whom he has lived for thirty years. After spending three years in Marseilles where their son Shams was born, in 1997, they settled in Beauce, in Étampes. In December 2014, together they created a fifty-seat theater, a sort of “Left Bank” cabaret called Les Grands Solistes. About fifty artists, including François Rollin, Albert Meslay, Clair Jaz, Didier Porte, Marc Gélas, Fred Saurel, Paul Adam, Vincent Roca, Christophe Guybet, but also, in another register, Jean Vocat, Frédéric Hulné, Prune Lichtlé, have already happened there.\n\nSource: Article \"Romain Bouteille\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1937-03-24",
        "deathday": "2021-05-31",
        "gender": 2,
        "homepage": null,
        "id": 26370,
        "imdb_id": "nm0100283",
        "known_for_department": "Acting",
        "name": "Romain Bouteille",
        "place_of_birth": "Paris, France",
        "popularity": 0.0368,
        "profile_path": "/pMcroHHgkdsZrnvdoKdsshsjUdS.jpg"
    }
}