{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/BOeORWljjIPGuCwUgLls24ctF3.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 437586,
                "original_language": "en",
                "original_title": "mid90s",
                "overview": "In 1990s Los Angeles, a 13-year-old spends his summer navigating between a troubled home life and a crew of new friends he meets at a skate shop.",
                "popularity": 3.9427,
                "poster_path": "/9Tw0Y3DK5kGIU9X1yw3Q9gCkOlb.jpg",
                "release_date": "2018-10-19",
                "title": "mid90s",
                "video": false,
                "vote_average": 7.487,
                "vote_count": 1698,
                "character": "Driver",
                "credit_id": "669eb7e340429b5a69e530ab",
                "order": 29
            },
            {
                "adult": false,
                "backdrop_path": "/xxBV7ZyywpBBEdQbuen7Rp3RIIp.jpg",
                "genre_ids": [
                    878,
                    35,
                    27
                ],
                "id": 1694,
                "original_language": "en",
                "original_title": "Re-Animator",
                "overview": "Conducting clandestine experiments within the morgue at Miskatonic University, scientist Herbert West reveals to a fellow graduate student his groundbreaking work concerning the re-animation of fresh corpses.",
                "popularity": 3.188,
                "poster_path": "/1hY6AUl92cL9GdZx031UWFiGETt.jpg",
                "release_date": "1985-10-18",
                "title": "Re-Animator",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 1574,
                "character": "One Arm Man Corpse",
                "credit_id": "669eb931145486ec934bf206",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Craig Reed, Performer with a Disability, (PWD), lost his right arm in a car accident at the age of 20 months. His cowboy jacket sleeve caught the door handle in a 4 door sedan with suicide rear doors when he was crawling over to the front seat. The jacket sleeve caught the door handle and out Craig went hanging by his sleeve and being dragged like a tether ball. Craig now refers to this accident as his first stunt job. However, since he wasn't in the Screen Actors Guild at that time, he wasn't paid and no residuals for that effort! Now he is in SAG and his work covers Television, Film and a Music Video. Craig also has special Prosthetic equipment for stunt work, hand and arm blow offs with squibs. Craig was born in Whittier California, attended elementary school in Whittier and La Habra High School in Orange County. He also Graduated from Cal State University Fullerton with a Bachelor's degree in Business Management. Craig's debut movie roll was in the Baby Blue Marine with Jan Micheal Vincent and a new comber in the movies, Richard Gere. Craig played a Army Corporal in the \"Victory Lounge\", a bar. Craig brings a new dynamic to any Film, TV, or Music Video. Take 1 Scene 1!",
        "birthday": "1949-10-23",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2637083,
        "imdb_id": "nm0717279",
        "known_for_department": "Acting",
        "name": "Craig Reed",
        "place_of_birth": "Whittier, California, USA",
        "popularity": 0.0143,
        "profile_path": null
    }
}