{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/k7135cfORy0T7evjsH8F1Koaxg5.jpg",
                "genre_ids": [
                    35
                ],
                "id": 19494,
                "original_language": "en",
                "original_title": "Nine to Five",
                "overview": "Three female employees of a sexist, egotistical, lying, hypocritical bigot find a way to turn the tables on him.",
                "popularity": 3.0544,
                "poster_path": "/3nm6kWMFzxGtJb4UEuDB0lDWpcD.jpg",
                "release_date": "1980-12-18",
                "title": "Nine to Five",
                "video": false,
                "vote_average": 6.928,
                "vote_count": 525,
                "character": "Janitress",
                "credit_id": "6223f175a24c500062e4dce1",
                "order": 36
            }
        ],
        "crew": []
    },
    "details": {
        "adult": true,
        "also_known_as": [],
        "biography": "Esther Sutherland (August 29, 1932 – December 31, 1986) was an American film actress who made a name for herself in several features of the 1970s and 1980s often portraying nurses, maids, spinster aunts, Jamaican women, cleaning ladies, and matriarch types.\n\nShe was born on August 29, 1932, in New York City, New York. Upon graduating from high school, she began her career as a jazz and gospel singer in various New York nightclubs and churches and later appeared in several well known theatre productions both on and off Broadway, some of which included The Piano Lesson, A Raisin in the Sun, Blues for Mister Charlie, Black Nativity, Dutchman, and revivals of Cabin in the Sky and Porgy and Bess. After two decades of professional singing and theatre work, she moved out to Los Angeles in 1968 and made her film debut in the dramatic feature Riverrun. She found a great deal of success in film and television, and went on to appear in such syndicated programs as Kojak, Sanford and Son, The Jeffersons, Hill Street Blues, Archie Bunker's Place and Lou Grant. She also appeared in such feature films as 9 to 5, The Goodbye Girl, Stir Crazy, and Young Doctors in Love. Her last appearance was in the 1985 film UFOria. She appeared alongside to such equally established performers as Pam Grier, Gene Wilder, Redd Foxx, Dolly Parton, Richard Pryor, and Marsha Mason. She continued to sing professionally and was often seen in several theatre productions in the Los Angeles Dinner Theatre circuit until her unexpected death on New Year's Eve 1986 from undisclosed causes. Her survivors included only two younger brothers, in-laws, and nieces and nephews, who spread her cremains off the Los Angeles coast. She was 54 at the time of her death. Aside from performing, Sutherland was a devout Methodist, a staunch Democrat, and she also enjoyed writing poetry, painting in oils, sculpting, and was a volunteer in narrating audiobooks for the blind.",
        "birthday": "1932-08-29",
        "deathday": "1986-12-31",
        "gender": 1,
        "homepage": null,
        "id": 2640274,
        "imdb_id": "nm0840089",
        "known_for_department": "Acting",
        "name": "Esther Sutherland",
        "place_of_birth": "New York City, New York",
        "popularity": 1.003,
        "profile_path": "/U2Pi14ZSpmFULwymXuk0zhTHWu.jpg"
    }
}