{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/nvrQW1NmhkQ7B4FjNik7uqMOldP.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749
                ],
                "id": 10860,
                "original_language": "en",
                "original_title": "Steel Magnolias",
                "overview": "A young beautician, newly arrived in a small Louisiana town, finds work at the local salon, where a small group of women share a close bond of friendship and welcome her into the fold.",
                "popularity": 2.2992,
                "poster_path": "/7ExUSN9s9gX9bhVM17zDLEizano.jpg",
                "release_date": "1989-11-15",
                "title": "Steel Magnolias",
                "video": false,
                "vote_average": 7.197,
                "vote_count": 688,
                "character": "Owen Jenkins",
                "credit_id": "52fe43c59251416c7501d81f",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nJames William McCutcheon (May 23, 1924 - January 9, 2002) was an American character actor known for his roles in film, television, and theatre, several of which won him Emmy and Tony awards.\n\nMcCutcheon was born in Russell, Kentucky, the son of Florence Louise (née Elam) and Robert Kenna McCutcheon, who was a railroad conductor. McCutcheon's first major role was Leo the Leprechaun on The Howdy Doody Show. He followed this appearance with a recurring role (from 1984 to 1992) as Uncle Wally on the children's television series Sesame Street, for which he won an Emmy.\n\nMcCutcheon was also active in film and on the stage. His first film appearance was in 1964's Santa Claus Conquers the Martians; later on, he was seen in movies including Family Business and Steel Magnolias. McCutcheon's theatre credits include a role as Moonface Martin in Anything Goes, which won him a Tony for Best Performance by a Featured Actor in a Musical. Other stage appearances include You Can't Take It With You and The Man Who Came to Dinner.\n\nMcCutcheon had three children, Carol, Jay, and Kenna.\n\nMcCutcheon died in 2002 of natural causes, at age 77.\n\nDescription above from the Wikipedia article Bill McCutcheon, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1924-05-23",
        "deathday": "2002-01-09",
        "gender": 2,
        "homepage": null,
        "id": 26486,
        "imdb_id": "nm0567343",
        "known_for_department": "Acting",
        "name": "Bill McCutcheon",
        "place_of_birth": "Russell, Kentucky, United States",
        "popularity": 0.1062,
        "profile_path": "/gznYkW1WMRFkgKn1NSPUGtzEqWY.jpg"
    }
}