{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/MMSI9WzRmOdqXarevQ3Kqnytrx.jpg",
                "genre_ids": [
                    12,
                    28,
                    53,
                    878
                ],
                "id": 8810,
                "original_language": "en",
                "original_title": "Mad Max 2",
                "overview": "Max Rockatansky returns as the heroic loner who drives the dusty roads of a postapocalyptic Australian Outback in an unending search for gasoline. Arrayed against him and the other scraggly defendants of a fuel-depot encampment are the bizarre warriors commanded by the charismatic Lord Humungus, a violent leader whose scruples are as barren as the surrounding landscape.",
                "popularity": 6.5059,
                "poster_path": "/l1KVEhkGDpWRzQ0VqIhZqDDuOim.jpg",
                "release_date": "1981-12-24",
                "title": "Mad Max 2",
                "video": false,
                "vote_average": 7.387,
                "vote_count": 3964,
                "character": "Wez",
                "credit_id": "52fe44b9c3a36847f80a6a61",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Vernon George Wells"
        ],
        "biography": "Vernon George Wells (born 31 December 1945) is an Australian film and television actor who has built his career around action-type films, most often cast as a villain. He began appearing on Australian television shows in the mid-1970s, such as Homicide and Matlock Police and All The Rivers Run.\n\nHe is best known to international audiences for his role of \"Wez\", in the 1981 science fiction action film Mad Max 2: The Road Warrior. After Mad Max 2, Wells began appearing in Hollywood films, such as the military action film Commando (1985) (as Bennett), which starred Arnold Schwarzenegger, and the science fiction comedy Innerspace (1987), which starred Martin Short, Dennis Quaid and Meg Ryan. In the 2000s, Wells acted in the television series Power Rangers: Time Force portraying the series' main villain 'Ransik'.\n\nDescription above from the Wikipedia article Vernon Wells(actor), licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1945-12-31",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 26491,
        "imdb_id": "nm0920460",
        "known_for_department": "Acting",
        "name": "Vernon Wells",
        "place_of_birth": "Rushworth, Victoria, Australia",
        "popularity": 0.4226,
        "profile_path": "/rpKjskAbftBMFi1HWZ0Jo6lZgod.jpg"
    }
}