{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3tWw50B1xXlCnJ9A7NX4nNzZF4j.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 350,
                "original_language": "en",
                "original_title": "The Devil Wears Prada",
                "overview": "Andy moves to New York to work in the fashion industry. Her boss is extremely demanding, cruel and won't let her succeed if she doesn't fit into the high class elegant look of their magazine.",
                "popularity": 11.9396,
                "poster_path": "/8912AsVuS7Sj915apArUFbv6F9L.jpg",
                "release_date": "2006-06-29",
                "title": "The Devil Wears Prada",
                "video": false,
                "vote_average": 7.393,
                "vote_count": 12508,
                "character": "Paparazzo (uncredited)",
                "credit_id": "5f503236498ef90037a22b4f",
                "order": 47
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Matthew Owen Murray",
            "Matthew Murray"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nMatthew Owen \"Matt\" Murray (born September 18, 1989) is an American actor.\n\nThe youngest of eight siblings, Murray was born in Detroit, Michigan. After graduating from high school, he moved to Toronto, and then Los Angeles, to pursue an acting career.\n\nMurray began his career in 2012 with guest roles in television series such as The Firm and Suits. He subsequently played the recurring role of Officer Duncan Moore in the police drama series Rookie Blue (2014–2015). In 2015, Murray played Brian in the short-lived television series Kevin from Work. In 2016, Murray starred in the recurring role of Tony in the USA Network series Eyewitness. On March 1, 2017, the series was canceled after one season. In 2017, Murray played a supporting role in the CBS sitcom 9JKL; the series received negative reviews from critics. On May 12, 2018, the series was canceled after one season.\n\nIn 2017, Murray was featured prominently in the third season of the web series Teenagers. As part of an ensemble cast that includes Emmanuel Kabongo, Chloe Rose, and Raymond Ablack, he won the award for Best Ensemble at the 2018 HollyWeb Festival, and also received a nomination for Best Ensemble at the 9th annual Indie Series Awards.",
        "birthday": "1989-09-18",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2653362,
        "imdb_id": "nm5248879",
        "known_for_department": "Acting",
        "name": "Matt Murray",
        "place_of_birth": "Detroit, Michigan, USA",
        "popularity": 0.7402,
        "profile_path": "/1cDWWE4KjQM8or1ZFQ88jsA9Zmq.jpg"
    }
}