{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5a7lMDn3nAj2ByO0X1fg6BhUphR.jpg",
                "genre_ids": [
                    12,
                    28,
                    878
                ],
                "id": 333339,
                "original_language": "en",
                "original_title": "Ready Player One",
                "overview": "When the creator of a popular video game system dies, a virtual contest is created to compete for his fortune.",
                "popularity": 13.382,
                "poster_path": "/pU1ULUq8D3iRxl1fdX2lZIzdHuI.jpg",
                "release_date": "2018-03-28",
                "title": "Ready Player One",
                "video": false,
                "vote_average": 7.585,
                "vote_count": 16246,
                "character": "Leslee",
                "credit_id": "5ab937179251414d31004144",
                "order": 71
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Cara Pifko (born March 15, 1976) is a Canadian actress known primarily for her work on television shows produced by the Canadian Broadcasting Corporation.\n\nPifko was born in Toronto, Ontario. A graduate of the National Theatre School of Canada, she started acting at the age of 8 and worked all through the 1990s, but it was in 2000 that she landed her first starring role, in the series Our Hero, which was aimed at young teens. Her first acting role was The Elephant Show hosted by Sharon, Lois, and Bram in which she was present in all seasons.\n\nIn 2004 she showed her dramatic range by appearing as a foreign aid worker in the acclaimed mini-series Human Cargo. Pifko then landed the lead role in the legal drama This is Wonderland, which garnered her a Gemini Award in 2005 for best actress. In early 2006, she appeared as Isolda in Tarragon Theatre's production of Léo. In 2007 she starred in the Lifetime TV movie I Me Wed. In 2009, she joined the soap opera General Hospital as the recurring character of Louise Addison.\n\nIn 2010 Cara lent her voice to Suu, a pink Twi'lek in the \"Deserter\" episode, and as scientist Sionver Boll in \"The Zillo Beast\" and \"The Zillo Beast Strikes Back\" episodes of Star Wars: The Clone Wars. She also voiced Yeoman Kelly Chambers in the video games Mass Effect 2 and Mass Effect 3.\n\nIn 2016 she joined the Season 2 cast of Better Call Saul as recurring character Paige Novick, senior legal counsel for Mesa Verde Bank and Trust, and friend of Kim Wexler.\n\nCara also voiced Suu Lawquane in Star Wars: The Bad Batch.",
        "birthday": "1976-03-15",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 265855,
        "imdb_id": "nm0682999",
        "known_for_department": "Acting",
        "name": "Cara Pifko",
        "place_of_birth": "Toronto, Ontario, Canada",
        "popularity": 0.2707,
        "profile_path": "/oe6Xx56bpVYpcTJJNJFbzN0PWfA.jpg"
    }
}