{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8jSzjgJFhV7nA5hG2LSq2qaG1BN.jpg",
                "genre_ids": [
                    36,
                    18,
                    9648,
                    53
                ],
                "id": 411728,
                "original_language": "en",
                "original_title": "The Professor and the Madman",
                "overview": "Professor James Murray begins work compiling words for the first edition of the Oxford English Dictionary in the mid 19th century, and receives over 10,000 entries from a patient at Broadmoor Criminal Lunatic Asylum, Dr. William Minor.",
                "popularity": 2.5379,
                "poster_path": "/gtGCDLhfjW96qVarwctnuTpGOtD.jpg",
                "release_date": "2019-03-07",
                "title": "The Professor and the Madman",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 1227,
                "character": "Benjamin Jowett",
                "credit_id": "6295179fa410c815a35faf9c",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/6dyqfaPdeM5Z22ylw9ZTyjROBo7.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 45269,
                "original_language": "en",
                "original_title": "The King's Speech",
                "overview": "The King's Speech tells the story of the man who became King George VI, the father of Queen Elizabeth II. After his brother abdicates, George ('Bertie') reluctantly assumes the throne. Plagued by a dreaded stutter and considered unfit to be king, Bertie engages the help of an unorthodox speech therapist named Lionel Logue. Through a set of unexpected techniques, and as a result of an unlikely friendship, Bertie is able to find his voice and boldly lead the country into war.",
                "popularity": 5.0843,
                "poster_path": "/pVNKXVQFukBaCz6ML7GH3kiPlQP.jpg",
                "release_date": "2010-11-26",
                "title": "The King's Speech",
                "video": false,
                "vote_average": 7.735,
                "vote_count": 8986,
                "character": "Stanley Baldwin",
                "credit_id": "53fb6c5b0e0a267a750083c7",
                "order": 32
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Anthony Andrews made his West End theater debut at the Apollo Theatre as one of twenty young schoolboys in Alan Bennett's \"Forty Years On\" with John Gielgud. He began his career at the Chichester Festival Theatre in the UK. His theater credits include spells with the New Shakespeare Company - \"Romeo and Juliet\" and \"A Midsummer Night's Dream\". The Royal National Theatre production of Stephen Poliakoff's \"Coming in to Land\" with Maggie Smith, directed by Peter Hall, the much-acclaimed Greenwich Theatre production of Robin Chapman's \"One of Us\" and, as \"Pastor Manders\", in Robin Phillips's highly acclaimed production of Henrik Ibsen's \"Ghosts\" at the Comedy Theatre in London, produced by Bill Kenwright.\n\nAnthony's first television appearance was in The Wednesday Play: A Beast with Two Backs  (1968) by Dennis Potter, which was part of The Wednesday Play (1964) series. His first leading role in a series was as the title character in the BBC's The Fortunes of Nigel (1974) by Sir Walter Scott. Subsequently, he distinguished himself in various television classics playing \"Mercutio\" in Romeo & Juliet (1978) and starred in three different plays in the \"Play of the Month\" (1976) series, including playing \"Charles Harcourt\" in \"London Assurance\". He also starred in Danger UXB (1979), in which he played bomb disposal hero \"Brian Ash\".\n\nMost famously, he received worldwide recognition for his portrayal of the doomed \"Sebastian Flyte\" in Brideshead Revisited  (1981) for which he won a BAFTA in the UK, the Golden Globe award in the USA and an Emmy nomination for Best Actor.\n\nAnthony's since gone on to star in Jewels  (1992), for which he received another Golden Globe nomination.\n\nMost recently, Anthony has received tremendous acclaim for his outstanding portrayal of \"Count Fosco\" in \"The Woman In White\" at the Palace Theatre in London's West End.\n\nAs a producer, he co-produced Lost in Siberia\n\n(1991), which translates as \"Lost in Siberia\", filmed entirely in Russia, which received a Golden Globe nomination for Best Foreign Film and Haunted (1995), produced by his own production company, Double 'A' Films.",
        "birthday": "1948-01-12",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 26659,
        "imdb_id": "nm0000762",
        "known_for_department": "Acting",
        "name": "Anthony Andrews",
        "place_of_birth": "London, England, UK",
        "popularity": 2.0404,
        "profile_path": "/s1iDb6hqRpAyGScWa1X0lA9RSb3.jpg"
    }
}