{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4FnbeuCnsN3MT6omPrivl2ttJ8o.jpg",
                "genre_ids": [
                    18,
                    10752,
                    36
                ],
                "id": 1061699,
                "original_language": "en",
                "original_title": "The Six Triple Eight",
                "overview": "During World War II, the US Army's only all-Black, all-women battalion takes on an impossible mission: sorting through a three-year backlog of 17 million pieces of mail that hadn't been delivered to American soldiers and finish within six months.",
                "popularity": 3.8913,
                "poster_path": "/7tvAnzZj9e9AjdoHaN9jshm2Cjw.jpg",
                "release_date": "2024-12-06",
                "title": "The Six Triple Eight",
                "video": false,
                "vote_average": 7.541,
                "vote_count": 564,
                "character": "Officer (uncredited)",
                "credit_id": "688226152c5aa3134538ef11",
                "order": 26
            },
            {
                "adult": false,
                "backdrop_path": "/q9mF0HhnKT5deOIRAQSFjhLC8c1.jpg",
                "genre_ids": [
                    10751,
                    14,
                    12,
                    28
                ],
                "id": 420809,
                "original_language": "en",
                "original_title": "Maleficent: Mistress of Evil",
                "overview": "Maleficent and her goddaughter Aurora begin to question the complex family ties that bind them as they are pulled in different directions by impending nuptials, unexpected allies, and dark new forces at play.",
                "popularity": 6.7741,
                "poster_path": "/vloNTScJ3w7jwNwtNGoG8DbTThv.jpg",
                "release_date": "2019-10-16",
                "title": "Maleficent: Mistress of Evil",
                "video": false,
                "vote_average": 7.304,
                "vote_count": 6298,
                "character": "Servant (uncredited)",
                "credit_id": "6882284d50915a744e245ae1",
                "order": 84
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/b0PlSFdDwbyK0cf5RxwDpaOJQvQ.jpg",
                "genre_ids": [
                    80,
                    9648,
                    53
                ],
                "id": 414906,
                "original_language": "en",
                "original_title": "The Batman",
                "overview": "In his second year of fighting crime, Batman uncovers corruption in Gotham City that connects to his own family while facing a serial killer known as the Riddler.",
                "popularity": 21.1918,
                "poster_path": "/74xTEgt7R36Fpooo50r9T25onhq.jpg",
                "release_date": "2022-03-01",
                "title": "The Batman",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 11225,
                "credit_id": "6882356b1d76c9aaa9f77b3e",
                "department": "Crew",
                "job": "Stand In"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Rachel Sophia Anthony, born in Hammersmith London, is of Caribbean and Central American Heritage. Her parents spotted her talent as a child, getting her involved in dance, performing arts and talent shows. Whilst living in Grenada, Rachel-Sophia did pageantry, representing the island at the Miss Caribbean pageant as an Ambassador for the country.\n\nShe further pursued her performing and dance, at Joseph Chamberlain College, Birmingham whilst also attending acting workshops. Her first featured role was in the Doctor Who Christmas Special 2007, also featuring Ms Kylie Minogue.\n\nRachel-Sophia’s career has since evolved, in commercial campaigns, film and television. Her most recent roles were in Master of None 3, Netflix, written and directed by Emmy Award/Golden Globe winning Director Aziz Ansari and Lena Waithe. Followed by her role in This Sceptred Isle (This England), as Lola.\n\nOther work includes, as Joyce speaking double in Call the Midwife, Donda West (Kanye’s mother), not yet released and Doctors, Get Mille Black as the Mummy, due for release on HBO & Channel 4 this year, ITV2 Stand up Comedy sketch as the mother and Black Mirror (new season). Also played the roles of Barry White and Rick James’s mother, on the Autopsy television dramas, Reelz television.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 2667270,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Rachel Sophia-Anthony",
        "place_of_birth": "Hammersmith, London, UK",
        "popularity": 0.0379,
        "profile_path": "/qYlFgX8qJoa1GQX8cpTzQlrczoE.jpg"
    }
}