{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9CkI4VsYF8qJWfZpPqwZnBctb3M.jpg",
                "genre_ids": [
                    18
                ],
                "id": 50270,
                "original_language": "it",
                "original_title": "Paprika",
                "overview": "Mimma starts working in Madame Colette’s brothel to help her boyfriend financially. There she is rechristened “Paprika,” and falls in love with her first client, naval officer Franco. Despite this attraction, she begins her climb through the sex trade, residing in Italy’s most illustrious brothels.",
                "popularity": 19.1822,
                "poster_path": "/A2VdIkrwBtfbZphrzxpIvEfetjl.jpg",
                "release_date": "1991-02-13",
                "title": "Paprika",
                "video": false,
                "vote_average": 7.144,
                "vote_count": 546,
                "character": "Prince Ascanio Del Bardo",
                "credit_id": "6164303f50733c006483cbc7",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "John Steiner (born 7 January 1941 in Chester) is an English actor. Tall, thin and gaunt, Steiner attended the Royal Academy of Dramatic Arts and worked for a few years at the BBC. Steiner featured in a lead role in a television production of Design for Living by Noel Coward. Later he found further work primarily in films. In the late 1960s, Steiner was hired to play a part in the spaghetti western Tepepa. He found himself in demand in Italy and relocated there, specializing in playing villains in a great number of Italian B-movies and exploitation films. John Steiner has appeared in various genres of movies, including horror films and police actioners. He also became a favorite of famed Italian filmmaker Tinto Brass featuring in Salon Kitty alongside Ingrid Thulin and Helmut Berger.\n\nSteiner was in very steady demand until the late 1980s. As the Italian film industry dwindled, Steiner retired from acting in 1991 and relocated to California, where he became a real estate agent.\n\nIn the late 1990s a special magazine was started by Cranston McMillan's Also Press. Titled, John Steiner the zine was dedicated to Steiner's film, TV and stage work, featured reviews and helping fans trace prints of his more obscure Italian work, the publication triggered new interest in the happily retired star. Selling mainly in mainland Europe and the USA the zine ran until successfully 2005. A special large format issue ended the run. McMillan remains the best authority on John Steiner and has promised that his long awaited definitve work on the actors career will be with publishers soon.\n\nSteiner has recently contributed to DVD extras on some of his films and given interviews about his Italian work.\n\nDescription above from the Wikipedia article John Steiner, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1941-01-07",
        "deathday": "2022-07-31",
        "gender": 2,
        "homepage": null,
        "id": 26700,
        "imdb_id": "nm0825952",
        "known_for_department": "Acting",
        "name": "John Steiner",
        "place_of_birth": "Chester, Cheshire, England, UK",
        "popularity": 0.2611,
        "profile_path": "/esKMm8Izkba1PR2PMjLUcEdVdE3.jpg"
    }
}