{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2hABgVIhalvUB30Z2kIPVv8YX9n.jpg",
                "genre_ids": [
                    28,
                    12,
                    10752
                ],
                "id": 1654,
                "original_language": "en",
                "original_title": "The Dirty Dozen",
                "overview": "12 American military prisoners in World War II are ordered to infiltrate a well-guarded enemy château and kill the Nazi officers vacationing there. The soldiers, most of whom are facing death sentences for a variety of violent crimes, agree to the mission and the possible commuting of their sentences.",
                "popularity": 5.0242,
                "poster_path": "/tFWWsuhp22zJ6OG6QepJIiPUfeF.jpg",
                "release_date": "1967-06-15",
                "title": "The Dirty Dozen",
                "video": false,
                "vote_average": 7.596,
                "vote_count": 1257,
                "character": "Roscoe Lever",
                "credit_id": "55e1e6f692514162c800005c",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Stuart W. Cooper (born 1942) is an American filmmaker, actor and writer.\n\nCooper was a resident of the United Kingdom in the 1960s and 1970s where his most notable film appearance was as one of The Dirty Dozen, Roscoe Lever, in 1967. His other film roles included I'll Never Forget What's'isname (1967) as one of Oliver Reed's film crew, and Subterfuge (1968) starring Gene Barry and Joan Collins.\n\nOverlord, his 1975 WWII collage docudrama, originally failed to get US theatrical distribution and was only shown there in select screenings and on television (including a run on California's Z Channel in 1982, which was highlighted in the acclaimed 2004 TV documentary film Z Channel: A Magnificent Obsession).\n\nHis 1974 film Little Malcolm was entered into the 24th Berlin International Film Festival, where it won the Silver Bear. The following year, Overlord won the Silver Bear – Special Jury Prize at the 25th Berlin Festival.",
        "birthday": "1942-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 26708,
        "imdb_id": "nm0003837",
        "known_for_department": "Directing",
        "name": "Stuart Cooper",
        "place_of_birth": "Hoboken, New Jersey, USA",
        "popularity": 0.1661,
        "profile_path": null
    }
}