{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/y2Ca1neKke2mGPMaHzlCNDVZqsK.jpg",
                "genre_ids": [
                    28,
                    35,
                    53
                ],
                "id": 718930,
                "original_language": "en",
                "original_title": "Bullet Train",
                "overview": "Unlucky assassin Ladybug is determined to do his job peacefully after one too many gigs gone off the rails. Fate, however, may have other plans, as Ladybug's latest mission puts him on a collision course with lethal adversaries from around the globe—all with connected, yet conflicting, objectives—on the world's fastest train.",
                "popularity": 14.001,
                "poster_path": "/j8szC8OgrejDQjjMKSVXyaAjw3V.jpg",
                "release_date": "2022-08-03",
                "title": "Bullet Train",
                "video": false,
                "vote_average": 7.426,
                "vote_count": 6913,
                "character": "Angelina Young",
                "credit_id": "61c1ff9a21621d00437b7711",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Emelina Adams is an accomplished model, actress, digital influencer, and former Miss Nevada USA 2016. She grew up taking all honor and AP classes while earning a cumulative GPA of 3.8 her senior year of high school. Because of her ability to excel in academics she was an active member of the National Honor Society for her junior and senior year of high school.  She was one of 200 students that were invited (based on her academics) to be a student ambassador in a program called People To People where she was able to study abroad to Australia after completing her junior year of high school.  Emelina earned the 4 year Academic Excellence Scholarship to the University of Arizona. She graduated with a Bachelor of Arts degree in psychology with a pre-law thematic minor. While attending U of A Emelina was a member of Gamma Phi Beta.  Her love of culture and travel led her to study abroad her junior year to Rome in 2013 through a student program called CEA. While studying abroad she was able to travel to 8 other countries (she has been to a total of 13 countries all over the world).  After graduating from college Emelina won the title of Miss Nevada USA 2016 and went on to compete for the title of Miss USA. During her reign she worked with various charities and organizations including Make-A-Wish, Girl Scouts, Boys & Girls Club, Solutions Recovery Center, and many more.  Emelina is currently building up her TV/film resume as well as pursuing modeling in Los Angeles. Her love of beauty and fashion has given her the chance to work with big brands such as Revolve and L'Oreal. After years of staying persistent Emelina was offered a contract with her dream agency Wilhelmina Models. She has consistently been taken acting classes at The Groundlings School, Shaan Sharma Studio, Ivana Chubbuck Studio, and is currently enrolled in Graham Shiels Studio. She had a lead role in her first acting opportunity in a feature film called Blood Pageant that will be released in 2019.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 2672331,
        "imdb_id": "nm7883974",
        "known_for_department": "Acting",
        "name": "Emelina Adams",
        "place_of_birth": null,
        "popularity": 0.0997,
        "profile_path": "/9tJ9O2TiO0LHLxAJnj2iYIrlLWf.jpg"
    }
}