{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/h0jlcOISKcrVG4IE4p5IyZGrMhn.jpg",
                "genre_ids": [
                    35,
                    80
                ],
                "id": 212,
                "original_language": "en",
                "original_title": "Arsenic and Old Lace",
                "overview": "Mortimer Brewster, a newspaper drama critic, playwright, and author known for his diatribes against marriage, suddenly falls in love and gets married;  but when he makes a quick trip home to tell his two maiden aunts, he finds out his aunts' hobby - killing lonely old men and burying them in the cellar!",
                "popularity": 1.4542,
                "poster_path": "/xG1GEEQGgExKl0WT5sRo1Arst5D.jpg",
                "release_date": "1944-09-01",
                "title": "Arsenic and Old Lace",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 985,
                "character": "Officer Patrick O'Hara",
                "credit_id": "52fe4227c3a36847f800812b",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/3Yz8IcUBPZ8zDff0ktHZk24Rot0.jpg",
                "genre_ids": [
                    18
                ],
                "id": 261,
                "original_language": "en",
                "original_title": "Cat on a Hot Tin Roof",
                "overview": "An alcoholic ex-football player drinks his days away, having failed to come to terms with his sexuality and his real feelings for his football buddy who died after an ambiguous accident. His wife is crucified by her desperation to make him desire her: but he resists the affections of his wife. His reunion with his father—who is dying of cancer—jogs a host of memories and revelations for both father and son.",
                "popularity": 2.0195,
                "poster_path": "/5djZZECgqDGuSI1INmrdAcGRBb0.jpg",
                "release_date": "1958-08-29",
                "title": "Cat on a Hot Tin Roof",
                "video": false,
                "vote_average": 7.656,
                "vote_count": 786,
                "character": "Gooper",
                "credit_id": "52fe422fc3a36847f800a6c9",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/fzJgCQh2NBnUYlms8EGyr4bPNz3.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 900,
                "original_language": "en",
                "original_title": "Bringing Up Baby",
                "overview": "David Huxley is waiting to get a bone he needs for his museum collection. Through a series of strange circumstances, he meets Susan Vance, and the duo have a series of misadventures which include a leopard called Baby.",
                "popularity": 3.6146,
                "poster_path": "/vTNNOtemaYmtx3k2NpsLMRJKEwZ.jpg",
                "release_date": "1938-02-18",
                "title": "Bringing Up Baby",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 1022,
                "character": "Circus Roustabout (uncredited)",
                "credit_id": "52fe428ac3a36847f8026b89",
                "order": 15
            },
            {
                "adult": false,
                "backdrop_path": "/9AjG0YJLgDUtHl5KgrThHPhNNwZ.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 3083,
                "original_language": "en",
                "original_title": "Mr. Smith Goes to Washington",
                "overview": "After the death of a United States Senator, idealistic Jefferson Smith is appointed as his replacement in Washington. Soon, the naive and earnest new senator has to battle political corruption.",
                "popularity": 2.8482,
                "poster_path": "/nDjg1fbNyq15excNDl3acd2IqAk.jpg",
                "release_date": "1939-10-19",
                "title": "Mr. Smith Goes to Washington",
                "video": false,
                "vote_average": 7.843,
                "vote_count": 1118,
                "character": "Sweeney Farrell (uncredited)",
                "credit_id": "52fe4384c3a36847f805a01b",
                "order": 56
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "John Elmer Carson"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nJohn Elmer \"Jack\" Carson (October 27, 1910 – January 2, 1963) was a Canadian-born, American film actor, with a film career spanning the 1930s, 1940s, and 1950s. Though he was primarily used in supporting roles for comic relief, his work in films such as Mildred Pierce (1945) and Cat on a Hot Tin Roof (1958) displayed his mastery of \"straight\" dramatic actor roles as well. He worked for RKO and MGM (cast opposite Myrna Loy and William Powell in Love Crazy), but most of his memorable work was for Warner Bros. His trademark character was the wisecracking know-it-all, typically and inevitably undone by his own smug cockiness.  Carson initially landed bit roles at RKO Radio Pictures in films such as Bringing Up Baby (1938), starring Cary Grant and Katharine Hepburn.\n\nAn early standout role for Carson was as a mock-drunk undercover G-Man opposite Richard Cromwell in Universal Pictures's anti-Nazi action drama entitled Enemy Agent. This led to contract-player status with Warner Brothers shortly thereafter. While there, he was teamed with Dennis Morgan in a number of films, supposedly to compete with Paramount's popular Bing Crosby - Bob Hope Road to … pictures.\n\nMost of his work at Warner Brothers was limited to light comedy work with Morgan, and later Doris Day (who in her autobiography would credit Carson as one of her early Hollywood mentors). Critics generally agree that Carson's best work was in Mildred Pierce (1945), where he played the perpetually scheming Wally Fay opposite Joan Crawford in the title role. Also in 1945, he played the role of Harold Pierson, the second husband of Louise Randall, played by Rosalind Russell, in Roughly Speaking. Another role which won accolades for him was as publicist Matt Libby in A Star is Born (1954). One of his last film roles was as the older brother \"Gooper\" in Cat on a Hot Tin Roof (1958).\n\nHis TV appearances, extending into the early 1960s, included The Martha Raye Show, The Guy Mitchell Show, and The Polly Bergen Show in 1957; Alcoa Theatre and Bonanza (Season 1, Ep.9: \"Mr. Henry Comstock\") in 1959; Thriller (\"The Big Blackout\") in 1960; and The Twilight Zone (Season 2, Ep. 14: \"The Whole Truth\") in 1961.\n\nOn February 8, 1960, Carson received two stars on the Hollywood Walk of Fame for his contributions to the television and radio industry. The television star is located at 1560 Vine Street, the radio star is at 6361 Hollywood Boulevard.\n\nIn 1983, after his death, Jack Carson was inducted into the Wisconsin Performing Artists Hall of Fame along with his film pal, Dennis Morgan, who was also from Wisconsin.",
        "birthday": "1910-10-27",
        "deathday": "1963-01-02",
        "gender": 2,
        "homepage": null,
        "id": 2672,
        "imdb_id": "nm0007217",
        "known_for_department": "Acting",
        "name": "Jack Carson",
        "place_of_birth": "Carman, Manitoba, Canada",
        "popularity": 0.3515,
        "profile_path": "/lOYGfx1zbsrhpqzL1svLE1LmFYe.jpg"
    }
}