{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wWLUUGtemgrRyH24v8lAkSR58US.jpg",
                "genre_ids": [
                    10751,
                    10770,
                    12,
                    14
                ],
                "id": 506574,
                "original_language": "en",
                "original_title": "Descendants 3",
                "overview": "The teenagers of Disney's most infamous villains return to the Isle of the Lost to recruit a new batch of villainous offspring to join them at Auradon Prep.",
                "popularity": 5.579,
                "poster_path": "/7IRy0iHdaS0JI3ng4ZYlk5gLSFn.jpg",
                "release_date": "2019-08-02",
                "title": "Descendants 3",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 1570,
                "character": "Dancer / Chorus Performer",
                "credit_id": "5ee248804c1bb0001fa43bb7",
                "order": 30
            },
            {
                "adult": false,
                "backdrop_path": "/qjhcTGnjxYJqwBGlDzZkYWmne6e.jpg",
                "genre_ids": [
                    10749,
                    35,
                    18
                ],
                "id": 614409,
                "original_language": "en",
                "original_title": "To All the Boys: Always and Forever",
                "overview": "Senior year of high school takes center stage as Lara Jean returns from a family trip to Korea and considers her college plans — with and without Peter.",
                "popularity": 2.9588,
                "poster_path": "/iepqdM52f4w75fNcvgRF5QoIAjm.jpg",
                "release_date": "2021-02-12",
                "title": "To All the Boys: Always and Forever",
                "video": false,
                "vote_average": 7.518,
                "vote_count": 1998,
                "character": "Prom-Posal Dancer #4",
                "credit_id": "6026acf3c5ada50040813d7e",
                "order": 39
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Danielle Brokopp fell in love with dance and the performing arts at a very young age. Starting at age six she has been trained in various styles such as ballet, jazz, tap, contemporary, hip hop, lyrical and musical theatre.\n\nIn 2012 she moved to Vancouver, BC from her hometown of Winnipeg, MB to further her dance training and pursue her career. She has been a member of The Source Dance Company, KTL Co., and Illustrative Society. Danielle has had the opportunity to train in Los Angeles, New York, Toronto, Atlanta and Las Vegas.\n\nDanielle has been a dancer featured in TV/films such as \"Descendants 3\" (Disney), \"Zoey's Extraordinary Playlist\" (NBC), \"Riverdale\" (The CW), \"Legends of Tomorrow\" (The CW), \"Charmed\" (the CW), \"Freaky Friday\" (Disney), \"The Flash\" (The CW), \"Lucifer\" (The CW), \"To All The Boys 3\" (Netflix), \"Motherland\" (BBC), \"Death of a Cheerleader\" (Lifetime) and \"Bravetown\" (Entertainment One). Live performances include Janet Jackson's world tour in Vancouver and Air Canada Vacations.\n\nDanielle has been fortunate to have worked closely with choreographers Brian Friedman, Gil Duldulao, Mandy Moore, Jillian Meyers, Bobby Newberry, Jamal Sims, Zach Woodlee, Heather Laura Gray, John Carrafa, Kelly Konno, Louise Hradsky, Jeffrey Mortensen, Morgan Tanner, and Stacey Tookey.\n\nDanielle resides in Vancouver, BC and is continuing to train and further her career as a professional dancer.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 2674923,
        "imdb_id": "nm9112430",
        "known_for_department": "Acting",
        "name": "Danielle Brokopp",
        "place_of_birth": null,
        "popularity": 0.0071,
        "profile_path": "/b0AsjbsTpjQSk7dGa7ojie2KbI2.jpg"
    }
}