{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wWLUUGtemgrRyH24v8lAkSR58US.jpg",
                "genre_ids": [
                    10751,
                    10770,
                    12,
                    14
                ],
                "id": 506574,
                "original_language": "en",
                "original_title": "Descendants 3",
                "overview": "The teenagers of Disney's most infamous villains return to the Isle of the Lost to recruit a new batch of villainous offspring to join them at Auradon Prep.",
                "popularity": 5.579,
                "poster_path": "/7IRy0iHdaS0JI3ng4ZYlk5gLSFn.jpg",
                "release_date": "2019-08-02",
                "title": "Descendants 3",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 1570,
                "character": "Dancer / Chorus Performer",
                "credit_id": "5ee24961197de400208eb28c",
                "order": 39
            },
            {
                "adult": false,
                "backdrop_path": "/qjhcTGnjxYJqwBGlDzZkYWmne6e.jpg",
                "genre_ids": [
                    10749,
                    35,
                    18
                ],
                "id": 614409,
                "original_language": "en",
                "original_title": "To All the Boys: Always and Forever",
                "overview": "Senior year of high school takes center stage as Lara Jean returns from a family trip to Korea and considers her college plans — with and without Peter.",
                "popularity": 2.9588,
                "poster_path": "/iepqdM52f4w75fNcvgRF5QoIAjm.jpg",
                "release_date": "2021-02-12",
                "title": "To All the Boys: Always and Forever",
                "video": false,
                "vote_average": 7.518,
                "vote_count": 1998,
                "character": "Prom-Posal Dancer #2",
                "credit_id": "6026acb91d019100424e16e3",
                "order": 37
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Sara Formosa"
        ],
        "biography": "Born and raised in the greater Vancouver area, Sarah Formosa has always had a love for performing and began dancing at the age of three. Upon graduation, she decided to go a more classical route after being accepted to the prestigious Alonzo King LINES Ballet Training Program in 2014 in San Francisco, California. Since Sarah's return to Vancouver in 2016, she has widened her lens, and works in all styles of dance as a freelance contemporary artist and on camera in film and television. On screen, Sarah has had the pleasure of working with Netflix (Julie and the Phantoms), HBO Max (Star Struck: A Cinderella Story), Disney (Descendants 3), Nickelodeon (Blurt), Lifetime (Death of a Cheerleader) and The ABC Network (Once Upon a Time). She is grateful to have shared the space with the amazing Michelle Johnston, Kenny Ortega and Jamal Sims during these experiences. As a live performer, Sarah had the opportunity to join Wanting Qu as a dancer and choreographer for her set for the Albatross Music Festival in Vancouver. She has worked with the Vancouver Opera (Kelly Robinson/Joshua Beamish) and is a currently a performer with 'The Smoke Show' (Jen Oleksiuk).\n\nAs a contemporary dance artist, Sarah has had the opportunity to work with David Harvey, Ralph Escamillan, Heather Dotto, Heather Laura Gray, Jennifer Mcleish-Lewis, Alameda Civic Ballet Company, The Vancouver Opera (Joshua Beamish), Company Joe Ink (Joe Laughlin) and the response. Dance Company (Amber Funk-Barton). She is honoured to currently be working with the following Vancouver based companies TWObigsteps Collective, Vision Impure (Noam Gagnon), WAREhaus Dance Collective (Meghan Hunter), Raven Spirit Dance Company (Starr Muranko), Wen Wei Dance (Wen Wei Wang) and Action at a Distance (Vanessa Goodman). In the summer of 2019, Sarah took part in Springboard Danse Montreal (Alexandra Wells) where she had the opportunity to perform an excerpt of Crystal Pite's 'Betroffenheit' staged by Eric Beauchesne.\n\nIn January of 2018, Sarah had her first choreographic residency with Dances for a Small Stage and her work has since been presented by Small Stage and Dancing on the Edge Vancouver.\n\nMost recently, Sarah has started her journey as an actor and is happy to be working and training with AMAW Studios under Frank Zotter and Justine Warrington. Sarah is inspired by all art mediums including voice work and as a high-level gymnast. She is excited to add acting to her bag of tricks and will continue to work and learn to become the best artist she can be.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.sarahformosa.com",
        "id": 2674929,
        "imdb_id": "nm7479676",
        "known_for_department": "Acting",
        "name": "Sarah Formosa",
        "place_of_birth": "Vancouver, British Columbia, Canada",
        "popularity": 0.0322,
        "profile_path": "/vLTZ84PyBBfVrXH7JHmSwZLeeWd.jpg"
    }
}