{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/pzMrxeP9XkKOtQVUBPTq5yk4ck5.jpg",
                "genre_ids": [
                    12,
                    35,
                    18,
                    14
                ],
                "id": 116745,
                "original_language": "en",
                "original_title": "The Secret Life of Walter Mitty",
                "overview": "A timid magazine photo manager who lives life vicariously through daydreams embarks on a true-life adventure when a negative goes missing.",
                "popularity": 6.7989,
                "poster_path": "/tY6ypjKOOtujhxiSwTmvA4OZ5IE.jpg",
                "release_date": "2013-12-18",
                "title": "The Secret Life of Walter Mitty",
                "video": false,
                "vote_average": 7.204,
                "vote_count": 7911,
                "character": "Soccer Playing Sherpa",
                "credit_id": "5ee5a2690cb3350020bca2b4",
                "order": 60
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Sherpa Phurba",
            "Phurba Tashi Sherpa Mendewa",
            "फूर्वा तासी शेर्पा",
            "Phurba Tashi"
        ],
        "biography": "Phurba Tashi Sherpa Mendewa (फूर्वा तासी शेर्पा) is a Nepalese Sherpa mountaineer known for his numerous ascents of major Himalayan peaks. These include 21 ascents of Mount Everest, six on Cho Oyu, eight on Manaslu, and one each on Shishapangma and Lhotse.\n\nPhurba Tashi was born in Khumjung, Nepal, 10 kilometers from Everest's base camp. He grew up in a family of climbers, watching his father and uncles go on climbing expeditions with international mountaineers. His first successful summit of an eight-thousander was Cho Oyu in 1998. The next year, at age 28, Tashi summitted Mount Everest for the first time.\n\nIn 2000, he accompanied Marco Siffredi up Cho Oyu for the first snowboard descent of that mountain. The two became friends, with Tashi later visiting Siffredi in Chamonix before accompanying him for both his successful Everest ascents. After a nearly 13 hour climb on their second summit of Everest, on September 8, 2002, Phurba encouraged Siffredi to abandon his attempt to be the first to snowboard the Hornbein Couloir. Siffredi refused, and was eventually lost on the mountain.\n\nFrom 2006-2007, Tashi was featured in the Discovery Channel series Everest: Beyond the Limit. Appearing in 11 episodes, he appears more episodes than anyone else in the series. In the first season of the Discovery Channel series (2006), he was shown carrying double-amputee Mark Inglis down a portion of the lower descent on his back.\n\nIn 2007, he reached the summit three times in that single season. That year, as a result of urging by expedition leader Russell Brice, Tashi agreed to accompany David Tait on his mission to complete the first double traverse of Everest, climbing the north route to the summit, descending on the south side, resting for three days, and then repeating the trip in reverse. Once at Base Camp on the south side of the mountain, however, Tait decided to bow out of the return traverse. Tait said that his decision was influenced by his belief that Phurba Tashi was a far superior climber and would have allowed him all the glory had they continued. Tait summited Everest for a third time in May 2009, again accompanied by Tashi (his 15th summit).\n\nPhurba Tashi completed his 21st summit of Mount Everest in May 2013 while working for Kishan Rai Mountain Experience, matching the record then held by Apa Sherpa. The record was broken in 2018 by Kami Rita Sherpa.",
        "birthday": "1971-05-24",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.mountexperience.com/russell-brice/",
        "id": 2678059,
        "imdb_id": "nm3106578",
        "known_for_department": "Acting",
        "name": "Phurba Tashi Sherpa",
        "place_of_birth": "Khumbu, Nepal",
        "popularity": 0.0193,
        "profile_path": "/3moTelskzWdnJFpf10n2DRqhd7P.jpg"
    }
}