{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3YzVtvNERQOIJXnrcWv3xhj5EMT.jpg",
                "genre_ids": [
                    18,
                    53
                ],
                "id": 55,
                "original_language": "es",
                "original_title": "Amores perros",
                "overview": "A fatalistic car crash in Mexico city sets off a chain of events in the lives of three people: a supermodel, a young man wanting to run off with his sister-in-law, and a homeless man. Their lives are catapulted into unforeseen situations instigated by the seemingly inconsequential destiny of a dog.",
                "popularity": 3.6704,
                "poster_path": "/n3QrQvLM7lZ9AGExvG89OREkCXW.jpg",
                "release_date": "2000-06-16",
                "title": "Amores Perros",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 2743,
                "character": "Tía Luisa",
                "credit_id": "52fe4211c3a36847f8001765",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "With 35 years of artistic career, Rosa María Bianchi is one of the most respected actresses in the industry due to the quality of her performances.  Trained in the ranks of the University Theater Center (CUT), as well as at the National Institute of Fine Arts, she began her career in the television field thanks to projects such as “Monte Calvario”, “Cuna de lobos”, “The Strange Return of Diana Salazar” and “Teresa”.\n\nThanks to her versatility, Bianchi has been part of different television projects as well as plays that have allowed her to explore different facets, as she did in “The Shadow of the Caudillo”, “Women Who Dream of Horses”, “Now and in the hour”, “Puppets”, “I”, “The divine Sarah” and “Jacques and his master”. In film she has worked in more than 20 different productions such as “Amores Perros”, directed in 2000 by Oscar winner Alejandro González Iñárritu, “Por la libre”, “Nicotina”, a film that awarded her an Ariel for Best Actress in 2004, “Out of Heaven”, “Dying on Sunday”, “Sultans of the South”, “The Misfits”, “What a shame your life”, “You will know what to do with me”, “Faust” among others.",
        "birthday": "1948-02-18",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 268,
        "imdb_id": "nm0080657",
        "known_for_department": "Acting",
        "name": "Rosa María Bianchi",
        "place_of_birth": "Buenos Aires, Argentina",
        "popularity": 0.1476,
        "profile_path": "/sTHKx5UvklFgF3uRqHDFmm3vUzz.jpg"
    }
}