{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6TjllWT3cGrPFyqDXurVZ3L8bBi.jpg",
                "genre_ids": [
                    9648,
                    53,
                    18
                ],
                "id": 745,
                "original_language": "en",
                "original_title": "The Sixth Sense",
                "overview": "Following an unexpected tragedy, child psychologist Malcolm Crowe meets a nine year old boy named Cole Sear, who is hiding a dark secret.",
                "popularity": 8.5538,
                "poster_path": "/vOyfUXNFSnaTk7Vk5AjpsKTUWsu.jpg",
                "release_date": "1999-08-06",
                "title": "The Sixth Sense",
                "video": false,
                "vote_average": 8.0,
                "vote_count": 12255,
                "character": "Vincent Grey",
                "credit_id": "52fe426fc3a36847f801e75f",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "NKOTB",
            "New Kids on the Block",
            "Donald Wahlberg ",
            "دانی والبرگ"
        ],
        "biography": "Donald Edmond \"Donnie\" Wahlberg, Jr. (born August 17, 1969) is an American singer-songwriter, actor, film producer, and record producer. One of his siblings is actor Mark Wahlberg and he is married to comedian/actress Jenny McCarthy.\n\nHe is a founding member of the popular 1980s and 1990s boy band New Kids on the Block.\n\nHe's most known for his TV role as Det. Danny Reagan on Blue Bloods, for which he was nominated for a People's Choice Award for Favorite TV Crime Drama Actor in 2017. He's also known for his roles as Donnie on the sitcom Return of the Mac, Det. Horst Cali on The Kill Point, Paul Rader on Runaway, Det. Joel Stevens on Boomtown, Lt. C. Carwood Lipton on the award-winning miniseries Band of Brothers, and Chris Scott on Big Apple.\n\nGraham Yost, executive producer and writer of Boomtown, had worked with him in Band of Brothers and was so impressed by his performance that he wrote the role of Joel Stevens specifically for him.\n\nHe's taken part in the reality shows Donnie Loves Jenny, Wahlburgers, Rock This Boat: New Kids on the Block, and The Masked Singer. He is narrator of HLN's true crime show Very Scary People. He is executive producer and narrator of the reality series Boston's Finest, in part produced by his company Donnie D. Productions.\n\nHe's known for his film roles as Det. Eric Matthews in the Saw film series (starting in Saw II), Shane in Zookeeper, Det. Teddy Riley in Righteous Kill, Commander Burton in Annapolis, Douglas 'Duddits' Cavell in Dreamcatcher, and Vincent Grey in The Sixth Sense. He's also had roles in TV movies including The Taking of Pelham One Two Three (1998 TV movie), as well as Kings of South Beach, and Bunker Hill.\n\nAs of 2011, he is the host of an internet radio show on Friday nights at 8 pm PST called \"DDUB's R&B Back Rub\" on Cherry Tree Radio.",
        "birthday": "1969-08-17",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2680,
        "imdb_id": "nm0005531",
        "known_for_department": "Acting",
        "name": "Donnie Wahlberg",
        "place_of_birth": "Dorchester, Boston, Massachusetts, USA",
        "popularity": 1.0774,
        "profile_path": "/8OQTlgl7eGAFlKTF2o8rZZT0MoF.jpg"
    }
}