{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/eTvN54pd83TrSEOz6wbsXEJktCV.jpg",
                "genre_ids": [
                    10752,
                    28,
                    53
                ],
                "id": 882569,
                "original_language": "en",
                "original_title": "Guy Ritchie's The Covenant",
                "overview": "During the war in Afghanistan, a local interpreter risks his own life to carry an injured sergeant across miles of grueling terrain.",
                "popularity": 8.0703,
                "poster_path": "/kVG8zFFYrpyYLoHChuEeOGAd6Ru.jpg",
                "release_date": "2023-04-19",
                "title": "Guy Ritchie's The Covenant",
                "video": false,
                "vote_average": 7.738,
                "vote_count": 2870,
                "character": "Haadee",
                "credit_id": "6204224c87f3f200960a8347",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/f0ACHVpV707zqu4etZrXnWNdSgL.jpg",
                "genre_ids": [
                    28,
                    80,
                    53
                ],
                "id": 866398,
                "original_language": "en",
                "original_title": "The Beekeeper",
                "overview": "One man's campaign for vengeance takes on national stakes after he is revealed to be a former operative of a powerful and clandestine organization known as Beekeepers.",
                "popularity": 14.9877,
                "poster_path": "/A7EByudX0eOzlkQ2FIbogzyazm2.jpg",
                "release_date": "2024-01-08",
                "title": "The Beekeeper",
                "video": false,
                "vote_average": 7.289,
                "vote_count": 3772,
                "character": "Scammer #3 - Barry",
                "credit_id": "659fe870945d36012aaeb321",
                "order": 26
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Rezo Diako"
        ],
        "biography": "Reza Diako is an English/Persian actor of Austrian nationality and Iranian origin. He has taken over the role of 'Apostle Philip' in the worldwide influential TV series \"The Chosen.\" A historical drama based on the life of Jesus and those who knew him, the popular series returns in February via its fourth season with a singular viewing experience releasing bi-weekly in theaters. On the big screen, Reza has two upcoming projects: the indie film \"The Astronaut\" (Kate Mara and Laurence Fishburne) as 'Ethan Marshall' the director of NASA and \"Reading Lolita in Tehran\" alongside award-winning actress Golshifteh Farahani and Zar Mir Ebrahimi. The film is based on the best-selling memoir, and Reza portrays 'Bahri', an intellectual literature student caught in the middle of his role as a leading member of the student Islamic society at the University of Allameh Tabatabei in Tehran, and his deep love and respect for both literature for his professor, Azar Nafisi (Golshifteh Farahani), under the backdrop of the early days of Iranian Revolution and the Iran/Iraq War in the early 1980s.\n\nIn 2018, Reza was cast as ' Harry Razavi' in \"Transparent,\" a feature film about homelessness in Central London. He subsequently had lead roles as ' Misha' in \"Tummyache,\" a feature film about an ex-famous child actor struggling with addiction, winning several festival awards, and as 'Eli' in Son of Man, a theatre production reflecting on the life of Jesus Christ during his adolescence. He was later featured in the theatre production, Fatherless Son, a drama about gang violence in the streets of London.\n\nReza then made his way into mainstream TV and Film projects. He was cast as a regular for both seasons of Apple TV's Original International Emmy Award winning drama, \"Tehran,\" in the regular role of 'Shahin.' He also played 'Henri' in ITV's new series, \"A Spy Among Friends,\" and featured in the BBC series, \"Around the World in 80 Days\" and in \"The Son,\" directed by Florian Zeller.\n\nMore recently,Reza appeared in Sundance's 2023 Audience Award and Best Screenwriter Award winning film, \"The Persian Version,\" as 'Hamid.' He also played series regular, 'Zak,' in HBO Max and Sky Atlantic's second season of \"I Hated Suzie.\" He can also be seen in MBC1 and Shahid Series, \"London Class,\" in the regular role of 'Aslan,' in a story about an Iranian family close to the King of Iran, the Shah, who was forced to take refuge in London after the Shah's downfall in 1978. Reza also appears in the role of 'Haadee,' in Guy Ritchie's feature, \"The Covenant\" and in the Netflix Drama, \"The Diplomat,\" in the role of 'Basir.'",
        "birthday": "1993-05-06",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2681182,
        "imdb_id": "nm8509566",
        "known_for_department": "Acting",
        "name": "Reza Diako",
        "place_of_birth": "Geneva, Switzerland",
        "popularity": 1.0385,
        "profile_path": "/z3f2f2Pl2Uw4JZLPhFnwosNR4sV.jpg"
    }
}