{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fxXwBvym6DkqkO4AWn8OjwMfMc1.jpg",
                "genre_ids": [
                    35
                ],
                "id": 9421,
                "original_language": "fr",
                "original_title": "Le Dîner de cons",
                "overview": "For Pierre Brochant and his friends, Wednesday is “Idiots' Day”. The idea is simple: each person has to bring along an idiot. The one who brings the most spectacular idiot wins the prize. Tonight, Brochant is ecstatic. He has found a gem. The ultimate idiot, “A world champion idiot!”. What Brochant doesn’t know is that Pignon is a real jinx, a past master in the art of bringing on catastrophes...",
                "popularity": 3.7021,
                "poster_path": "/cv6neov6SMLjHytjiU0rgeugoPI.jpg",
                "release_date": "1998-04-15",
                "title": "The Dinner Game",
                "video": false,
                "vote_average": 7.766,
                "vote_count": 1987,
                "character": "Juste Leblanc",
                "credit_id": "52fe44f5c3a36847f80b4321",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Francis Huster (born 8 December 1947) is a French stage, film and television actor, film director and scriptwriter. Francis Huster was born in Neuilly-sur-Seine. He studied acting at the Conservatoire of the 17th arrondissement of Paris, at the Cours Florent and at the Conservatoire national (1968), where he had René Simon and later Antoine Vitez as teachers. He joined the Comédie-Française in 1971, became sociétaire in 1977, and left this institution in 1982. He later founded the theater group Compagnie Francis Huster, of which the following actors have been members: Clotilde Courau, Valérie Crunchant, Christiana Réali, Estelle Skornik, Valentine Varela, Olivier Martinez, Mathieu Carriere.\n\nDescription above from the Wikipedia article Francis Huster, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1947-12-08",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 26887,
        "imdb_id": "nm0404091",
        "known_for_department": "Acting",
        "name": "Francis Huster",
        "place_of_birth": "Neuilly-sur-Seine, Seine [now Hauts-de-Seine], France",
        "popularity": 0.3008,
        "profile_path": "/v2q1DoC8HPOKzo8uRpllC7nnRhQ.jpg"
    }
}