{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/neeNHeXjMF5fXoCJRsOmkNGC7q.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 872585,
                "original_language": "en",
                "original_title": "Oppenheimer",
                "overview": "The story of J. Robert Oppenheimer's role in the development of the atomic bomb during World War II.",
                "popularity": 18.113,
                "poster_path": "/8Gxv8gSFCU0XGDykEGv7zR1n2ua.jpg",
                "release_date": "2023-07-19",
                "title": "Oppenheimer",
                "video": false,
                "vote_average": 8.05,
                "vote_count": 10702,
                "character": "Richard Tolman",
                "credit_id": "6328d10ea3b5e60091f5086c",
                "order": 40
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Tom Jenkins started out this life by wanting to be either an FBI agent or a rock star. Learning at age 8 that being a 'G-Man' required higher math skills and bad suits, he quickly settled on a musical path, playing drums in various rock and jazz bands in his formative years.\n\nBorn in Kentucky and raised in West Virginia, Tom's parents' always said, \"Son, you have no where to go but up!\" Secretly, they meant out, so Tom moved to Florida after college and caught the acting bug, as well as all the other bugs, mosquitoes and slimy, crawly things that the Sunshine State had to offer.\n\nAfter honing his acting 'chops' in Florida, and an appearance on Nickelodeon's, 'Clarissa Explains it All', Tom moved to Los Angeles. Described as, \"Amusingly limber\"; \" So familiar, my dog and I have known him for years\"; and \"The thinking woman's crumpet,\" (his favorite!) these are just a few of the tasty morsels that describe Tom's adeptness at comedy, serio- comedy, and delicious every -man characters. (When referred to as a 'crumpet', Tom embarked on a food theme that is still somewhat useful, at least for the purposes of this bio)\n\nA veteran of over 50 commercials, with national brands such as Allstate, Activia, Ford, Rite Aid,Toyota, Kay Jewelers and Hallmark, several network television appearances, including 'Criminal Minds' and 'Days of our Lives' (4 times!) and selected film 'shorts' ( or 'cuts'; the food theme endures!) Tom is always looking to lend his common-man affability to any role.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2692405,
        "imdb_id": "nm4715939",
        "known_for_department": "Acting",
        "name": "Tom Jenkins",
        "place_of_birth": null,
        "popularity": 0.374,
        "profile_path": "/xnLWHpvteDUwyEsrGoajHrs476V.jpg"
    }
}