{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4zJ9w3lZcZI3mBXcNiq6s8bqpDO.jpg",
                "genre_ids": [
                    18,
                    10749,
                    80
                ],
                "id": 2786,
                "original_language": "fr",
                "original_title": "Pierrot le fou",
                "overview": "Pierrot escapes his boring society and travels from Paris to the Mediterranean Sea with Marianne, a girl chased by hit-men from Algeria. They lead an unorthodox life, always on the run.",
                "popularity": 2.1625,
                "poster_path": "/i124H6iQB4CawrgFW9aZaZs7OBO.jpg",
                "release_date": "1965-11-05",
                "title": "Pierrot le Fou",
                "video": false,
                "vote_average": 7.368,
                "vote_count": 896,
                "character": "Samuel Fuller (uncredited)",
                "credit_id": "52fe436dc3a36847f80535a5",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Sam Fuller",
            "사무엘 풀러",
            "새뮤얼 풀러"
        ],
        "biography": "Samuel Michael Fuller (August 12, 1912 – October 30, 1997) was an American screenwriter, novelist and film director known for low-budget genre movies with controversial themes.\n\nHe was born Samuel Michael Fuller in Worcester, Massachusetts, the son of Benjamin Rabinovitch, a Jewish immigrant  from Russia, and Rebecca Baum, a Jewish immigrant from Poland. After immigrating to America, the family's surname was changed from Rabinovitch to \"Fuller\" possibly by inspiration of a Doctor who arrived in America on the Mayflower.  At the age of 12, he began working in journalism  as a newspaper  copyboy. He became a crime reporter  in New York City at age 17, working for the New York Evening Graphic. He broke the story of Jeanne Eagels' death.  He wrote pulp novels and screenplays  from the mid-1930s onwards. Fuller also became a screenplay  ghostwriter  but would never tell interviewers which screenplays that he ghost-wrote explaining \"that's what a ghost writer is for\".\n\nDuring World War II, Fuller joined the United States Army infantry. He was assigned to the 16th Infantry Regiment, 1st Infantry Division, and saw heavy fighting. He was involved in landings in Africa, Sicily, and Normandy  and also saw action in Belgium and Czechoslovakia. In 1945 he was present at the liberation of the German concentration camp at Falkenau  and shot 16 mm footage which was used later in the documentary Falkenau: The Impossible. For his service, he was awarded the Bronze Star, the Silver Star, and the Purple Heart.  Fuller used his wartime experiences as material in his films, especially in The Big Red One (1980), a nickname of the 1st Infantry Division.\n\nAfter his controversial film \"White Dog\" was shelved by Paramount pictures, Fuller moved to France, and never directed another American film. Fuller eventually returned to America. He died of natural causes in his California home. In November 1997, the Directors Guild held a three hour memorial in his honor, hosted by Curtis Hanson, his long time friend and co-writer on White Dog. He was survived by his wife Christa and daughter Samantha.",
        "birthday": "1912-08-12",
        "deathday": "1997-10-30",
        "gender": 2,
        "homepage": null,
        "id": 26959,
        "imdb_id": "nm0002087",
        "known_for_department": "Directing",
        "name": "Samuel Fuller",
        "place_of_birth": "Worcester, Massachusetts, USA",
        "popularity": 0.2234,
        "profile_path": "/qlDY0qaBfNynnvKNfueIgVUgWeG.jpg"
    }
}