{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qUGYUpDHpeNSjFXSrZpVpAWaTuL.jpg",
                "genre_ids": [
                    28,
                    16,
                    80,
                    9648
                ],
                "id": 537056,
                "original_language": "en",
                "original_title": "Batman: Hush",
                "overview": "A mysterious new villain known only as Hush uses a gallery of villains to destroy Batman's crime-fighting career as well as Bruce Wayne's personal life, which has been further complicated by a relationship with Selina Kyle/Catwoman.",
                "popularity": 3.6695,
                "poster_path": "/eiVQORVyVuNNZHPAELuWtlXoQsD.jpg",
                "release_date": "2019-07-19",
                "title": "Batman: Hush",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 920,
                "character": "Amanda Waller (voice)",
                "credit_id": "5d32d4f12f8d095259da0320",
                "order": 12
            },
            {
                "adult": false,
                "backdrop_path": "/azGxfdKvIhJeSusazngZlbQziIa.jpg",
                "genre_ids": [
                    878,
                    28,
                    16,
                    14
                ],
                "id": 487242,
                "original_language": "en",
                "original_title": "Suicide Squad: Hell to Pay",
                "overview": "It’s batter up at Belle Reve and that can only mean that Amanda Waller, the penitentiary’s cold and calculating warden, has a mission that only the damned will take on. It’s time to unleash Task Force X again, stacked with seasoned vets such as Deadshot, Captain Boomerang and Harley Quinn, these crafty criminals are joined by newcomers Copperhead, Killer Frost and the martial art master, Bronze Tiger! With the target objective being a mystical object so powerful that they’re willing to risk their own lives to steal it, you can be sure it will be collision of chaos, gunfire and attitudes. So, take aim for a raging road trip with the Suicide Squad!",
                "popularity": 4.4676,
                "poster_path": "/va1IgsZeWBbKLsZcFwz3CM1MkMu.jpg",
                "release_date": "2018-03-23",
                "title": "Suicide Squad: Hell to Pay",
                "video": false,
                "vote_average": 7.105,
                "vote_count": 688,
                "character": "Amanda Waller (voice)",
                "credit_id": "60fbdbd9848eb90086715c8a",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Vanessa L. William",
            "Vanessa Lynn Williams",
            "ونسا ویلیامز"
        ],
        "biography": "An American pop-R&B recording artist, producer, dancer, model, and actress. In 1983, she became the first woman of African-American descent to be crowned Miss America, but a scandal involving nude photographs caused her to relinquish her title early. Williams rebounded by launching a career as an entertainer, earning Grammy, Emmy, and Tony Award nominations.\n\nWilliams released her debut album The Right Stuff in 1988, which spawned the hits \"The Right Stuff,\" a #1 on Hot Dance Songs, and \"Dreamin',\" a #1 on R&B and #8 on Billboard Hot 100. Her second studio album, The Comfort Zone, in 1991 topped the Billboard R&B Album Chart, and spawned the number-one hit, \"Save the Best for Last.\"\n\nIn 1994 she debuted on Broadway in the musical Kiss of the Spider Woman. In 1995 she recorded the Oscar-winner for Best Original Song, \"Colors of the Wind,\" from the Disney animated feature film Pocahontas. It went on to reach #4 on the Billboard Hot 100.\n\nWilliams's first major movie role was as the star of the feature film Eraser in 1996. She also starred in the movies Soul Food, Dance with Me, The Adventures of Elmo in Grouchland, Shaft and Johnson Family Vacation.\n\nFrom 2006 to 2010 she played the role of self-absorbed diva and former supermodel Wilhelmina Slater in the ABC comedy series Ugly Betty. In 2009, Williams released her eighth studio album, The Real Thing. In 2010 she joined the ensemble cast of the series Desperate Housewives as spoiled rich woman Renee Perry.",
        "birthday": "1963-03-18",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.vanessawilliams.com",
        "id": 27011,
        "imdb_id": "nm0001853",
        "known_for_department": "Acting",
        "name": "Vanessa Williams",
        "place_of_birth": "Tarrytown, New York, USA",
        "popularity": 1.0833,
        "profile_path": "/30O1Af0wy6UBt8EpVRuq28tTGoT.jpg"
    }
}