{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/d3eUH2Cb9C121I43kpYaPjyEDq1.jpg",
                "genre_ids": [
                    18
                ],
                "id": 290542,
                "original_language": "en",
                "original_title": "You're Not You",
                "overview": "A drama centered on a classical pianist who has been diagnosed with ALS and the brash college student who becomes her caregiver.",
                "popularity": 2.1651,
                "poster_path": "/jvrdukoeCuVckHlbAxU0MPoIzPI.jpg",
                "release_date": "2014-10-10",
                "title": "You're Not You",
                "video": false,
                "vote_average": 7.404,
                "vote_count": 814,
                "character": "Tom",
                "credit_id": "540900190e0a263a0d0009be",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/7JrXKA5vkyqITySzbx8iZB89ivk.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 6023,
                "original_language": "en",
                "original_title": "P.S. I Love You",
                "overview": "A young widow discovers that her late husband has left her 10 messages intended to help ease her pain and start a new life.",
                "popularity": 3.8952,
                "poster_path": "/x6M9nlTpgpI4AOw0tMkOAVbhL5z.jpg",
                "release_date": "2007-11-15",
                "title": "P.S. I Love You",
                "video": false,
                "vote_average": 7.186,
                "vote_count": 3376,
                "character": "Leprechaun",
                "credit_id": "596a2d97925141486b00c05d",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Michael Doyle"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nMike Doyle is an American actor, screenwriter, director and producer. He is best known for his recurring roles in the television series Law &amp; Order: Special Victims Unit, playing Forensics Tech Ryan O'Halloran, and Oz, playing Adam Guenzel.\n\nIt was on the set of Oz that Doyle met George Morfogen, whom he would cast in Shiner, a short film written, produced and directed by Doyle that debuted at the 2006 Tribeca Film Festival. Doyle also wrote and produced the 2003 limited-release film Cutter.\n\nDoyle played Lt. Cmdr. Tom Palatonio in the 2005 action film Phantom Below, which is notable for having been released in multiple versions under multiple names which included or excluded gay content depending on the edit (the gay-themed edit was released under the title Tides of War). Also in 2005, he plays a gay coffee barista named Andy in 29th and Gay.\n\nOn June 2, 2009, The New York Times published an article about Doyle and his tendency to die on screen during his acting roles. His seventh death, in the season 10 finale of Law and Order Special Victims Unit, ended a successful six year run as forensic tech Ryan O’Halloran on the show.\n\nHe recently guest starred in the Criminal Minds episode, \"A Rite of Passage\", as well as the In Plain Sight episode, \"Coma Chameleon\". He also appeared alongside Nicole Kidman and Aaron Eckhart in Rabbit Hole.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 27107,
        "imdb_id": "nm0236451",
        "known_for_department": "Acting",
        "name": "Mike Doyle",
        "place_of_birth": null,
        "popularity": 1.051,
        "profile_path": "/vWvYo2T80nz0F4hcXRBDpawUBo0.jpg"
    }
}