{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4b2t4F8Ho5H0wKvylvOA7F2KbVr.jpg",
                "genre_ids": [
                    12,
                    18
                ],
                "id": 20766,
                "original_language": "en",
                "original_title": "The Road",
                "overview": "A father and his son walk alone through burned America. Nothing moves in the ravaged landscape save the ash on the wind and water. It is cold enough to crack stones and, when the snow falls, it is gray. Their destination is the warmer south, although they don't know what, if anything, awaits them there.",
                "popularity": 5.7116,
                "poster_path": "/qLaXnLzqleBWQtjvZ6JGVSaKoC3.jpg",
                "release_date": "2009-11-25",
                "title": "The Road",
                "video": false,
                "vote_average": 7.017,
                "vote_count": 4040,
                "character": "Friendly Woman",
                "credit_id": "52fe43f8c3a368484e008981",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/izNpxVcjKbF9BiYF4GVqxCOfewL.jpg",
                "genre_ids": [
                    18
                ],
                "id": 641662,
                "original_language": "en",
                "original_title": "Pieces of a Woman",
                "overview": "When a young mother's home birth ends in unfathomable tragedy, she begins a year-long odyssey of mourning that fractures relationships with loved ones in this deeply personal story of a woman learning to live alongside her loss.",
                "popularity": 3.1713,
                "poster_path": "/OgUfLlhfBFx5BPK6LzBWFvBW1w.jpg",
                "release_date": "2020-12-30",
                "title": "Pieces of a Woman",
                "video": false,
                "vote_average": 7.027,
                "vote_count": 1249,
                "character": "Eva Woodward",
                "credit_id": "5e46358a9603310013f6bec8",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/vftMyaxyKlNKU5kdsKRlQLc57hY.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 523781,
                "original_language": "en",
                "original_title": "Words on Bathroom Walls",
                "overview": "Diagnosed with a mental illness halfway through his senior year of high school, a witty, introspective teen struggles to keep it a secret while falling in love with a brilliant classmate who inspires him to open his heart and not be defined by his condition.",
                "popularity": 3.0963,
                "poster_path": "/sTtcwfTjE9jaU0928xjUXNtmmyr.jpg",
                "release_date": "2020-08-21",
                "title": "Words on Bathroom Walls",
                "video": false,
                "vote_average": 7.8,
                "vote_count": 633,
                "character": "Beth",
                "credit_id": "5f0fa23bdcf87500359d3c6e",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Molly Parker (born June 30, 1972) is a Canadian actress. She garnered critical attention for her portrayal of a necrophiliac medical student in the controversial drama Kissed (1996). She subsequently starred in the television thriller Intensity (1997) before landing her first major American film role in the drama Waking the Dead (2000). She gained further notice for her role as a Las Vegas escort in the drama The Center of the World (2001), for which she was nominated for the Independent Spirit Award for Best Female Lead.\n\nIn the early 2000s, Parker had lead roles in several films, including Max (2002), Pure (2002), and Nine Lives (2005). Beginning in 2004, she starred as Alma Garret on the HBO Western series Deadwood, appearing in all three seasons. She subsequently appeared in the post-apocalyptic thriller The Road (2009), and the independent drama Trigger (2010). In 2011, she appeared as a recurring guest star in the sixth season of Dexter, before being cast as politician Jacqueline Sharp on the Netflix series House of Cards in 2014. The role earned Parker a nomination for the Primetime Emmy Award for Outstanding Guest Actress in a Drama Series.\n\nHer subsequent film roles include the drama American Pastoral (2016) and two Netflix-produced features: the crime drama Small Crimes, and the Stephen King adaptation 1922 (both 2017). She also starred in Errol Morris's docudrama miniseries Wormwood. From 2018 to 2021, she starred as Maureen Robinson in Lost in Space, a Netflix-produced remake of the 1965 TV series.\n\nDescription above from the Wikipedia article Molly Parker, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1972-06-30",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 27125,
        "imdb_id": "nm0662504",
        "known_for_department": "Acting",
        "name": "Molly Parker",
        "place_of_birth": "Maple Ridge, British Columbia, Canada",
        "popularity": 2.6007,
        "profile_path": "/yxDfAinBmVkx8HHzRlJz4KvSnf8.jpg"
    }
}