{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/v4YV4ne1nwNni35iz4WmpZRZpCD.jpg",
                "genre_ids": [
                    28,
                    18,
                    36
                ],
                "id": 724495,
                "original_language": "en",
                "original_title": "The Woman King",
                "overview": "The story of the Agojie, the all-female unit of warriors who protected the African Kingdom of Dahomey in the 1800s with skills and a fierceness unlike anything the world has ever seen, and General Nanisca as she trains the next generation of recruits and readies them for battle against an enemy determined to destroy their way of life.",
                "popularity": 24.7701,
                "poster_path": "/438QXt1E3WJWb3PqNniK0tAE5c1.jpg",
                "release_date": "2022-09-16",
                "title": "The Woman King",
                "video": false,
                "vote_average": 7.643,
                "vote_count": 2227,
                "character": "Villager (uncredited)",
                "credit_id": "63bb1241fc31d3008bce5d00",
                "order": 43
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Princess Lashun Elmore is a native of Atlanta, GA. where she currently shares her life with her loving husband and their four sons. Princess continued her studies as an actor at the Alliance Theatre in Atlanta and is currently a Master adult student of the Chubbuck Technique studies taught by Life Coach /Chubbuck Accredited Certified Acting Coach Jonna Naegele.  Princess is also a certified acting Coach for Adults and Children under the Coach Jonna Naegele Chubbuck technique program, “Artistic Heights Academy”, operated by Jonna Naegele in Atlanta, Ga.  Princess started acting at a very young age as a Stage Theatrical performer and she is currently a full-time TV/Film actress and has been on this journey for over 18 years. She has performed in several local stage Productions throughout the Atlanta and Southeast area as well as appeared on several TV shows and Films throughout the Southeast as well as in the Midwest and LA regions.  Princess TV/Film credits currently are: Paramount film, “Naked Gun”-2024, Netflix film, “Beverly Hills Cop: Axel Foley,”-2024, BET+ Original Movie, “Incision”- 2024, Peacock Original Series, “OddMan Out”-2024, Lifetime featured film “Single Black Female 2” - 2023, Pureflix featured faith-based film “Divine Influencer”-2023, National Geographic channel “Genius”, Season 4, BET Featured Film, “Love, Marry, Kill”,-2023, ABC TV series, “The Wonder Years”,-2023, BET+ TV series, “Tyler Perry’s, All the Queens Men”-2024, Orion Production Motion Picture, \"TILL\" -2022,”Lifetime Movie titled, “You Can Never Go Home Again,” NBC TV series show, “Chicago Med”, The CW TV series, “Dynasty”, Showtime TV series, “ The Chi, AllBlk New TV series, “Wicked City”, BET- HER Health Initiatives for Breast Cancer TV series “The Waiting Room”-2022, BET+ Film \"Business of Christmas 2\", Hallmark Christmas film, “Everytime a Bell Rings”, a new TVOne Christmas film, “A Christmas Prayer”, a Podcast Thriller Voiceover interaction series, “The Time Keeper”, and other various TV Shows, Indie Films and Industrials.  Princess is also currently the Spokesperson for “Rockingham Insurance” in the Virginia and Pennsylvania areas. Princess has definitely enjoyed her journey thus far and she is currently striving to continue a successful career as a working actress.  Princess shares her struggles and her determination through this journey with others that may be interested in the entertainment industry so they will know not only the sacrifices but a strong dedication and commitment it takes to be successful and to never give up on your dreams no matter what. Princess truly believe that her success is because of her Faith in God, God’s Favor over her life and her unwavering Trust and belief in God’s holy word.  Her prayer is to just be known for her love of the arts and dedication and commitment to the industry and how grateful she has been for all the opportunities God has allowed for open doors to enter into her life and her career.",
        "birthday": "1971-04-03",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 2714815,
        "imdb_id": "nm8032581",
        "known_for_department": "Acting",
        "name": "Princess Elmore",
        "place_of_birth": "Atlanta, Georgia, USA",
        "popularity": 0.8329,
        "profile_path": "/nySrx66WF1nYUmA25LTjedNwQIt.jpg"
    }
}