{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tHR34A5n0my4maACNdLpWGd6QYq.jpg",
                "genre_ids": [
                    18,
                    53
                ],
                "id": 698948,
                "original_language": "en",
                "original_title": "Thirteen Lives",
                "overview": "Based on the true nail-biting mission that captivated the world. Twelve boys and the coach of a Thai soccer team explore the Tham Luang cave when an unexpected rainstorm traps them in a chamber inside the mountain. Entombed behind a maze of flooded cave tunnels, they face impossible odds. A team of world-class divers navigate through miles of dangerous cave networks to discover that finding the boys is only the beginning.",
                "popularity": 8.5127,
                "poster_path": "/yi5KcJqFxy0D6yP8nCfcF8gJGg5.jpg",
                "release_date": "2022-07-18",
                "title": "Thirteen Lives",
                "video": false,
                "vote_average": 7.87,
                "vote_count": 1368,
                "character": "Captain Arnont",
                "credit_id": "62f2d29a594c940082cfb510",
                "order": 26
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Teerapat Satjakul",
            "Theerapart Sajjakul",
            "Tui",
            "Tui Teerapat Satjakul",
            "Theerapat Sajakul",
            "Tui Theerapart Sajjakul",
            "Teerapat Sajakul",
            "Theerapat Satjakul",
            "Tui Teerapat Sajakul",
            "ตุ้ย"
        ],
        "biography": "Thiraphat Sajakul, nicknamed Tui, is a Thai singer, actor, and radio station manager. He is the son of a former football club president, politician, and actor Wanatthana Satjakul. He completed his undergrad in the Faculty of Economics at Thammasat University, Thailand, then continued to study at the Art Institute of Seattle in America.\n\nAfter returning to Thailand, Tui began modeling for an advertisement label called Black Label. Later, he made his debut in the series \"Karm See Tarn Dorn\". In addition, Tui released his first album with RPG in 2001 title \"Teerapat\" making his mark in the music industry.\n\nHe married actress and model Anna Natasha Plianwithee on December 20, 2008. Their son, Titan, was born on October 3, 2010.",
        "birthday": "1973-08-25",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2715237,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Theerapat Sajakul",
        "place_of_birth": "Bangkok, Thailand",
        "popularity": 0.1606,
        "profile_path": "/tXwgi2csgYmO8uV7JLcAjkLSBp1.jpg"
    }
}