{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uaEfEkb2tjl4hN1oaSyzcxt4cEg.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 439,
                "original_language": "it",
                "original_title": "La dolce vita",
                "overview": "Episodic journey of journalist Marcello who struggles to find his place in the world, torn between the allure of Rome's elite social scene and the stifling domesticity offered by his girlfriend, all the while searching for a way to become a serious writer.",
                "popularity": 4.2869,
                "poster_path": "/2KU52apQyvyZuPsqEGMcWb4BKu2.jpg",
                "release_date": "1960-02-05",
                "title": "La Dolce Vita",
                "video": false,
                "vote_average": 8.066,
                "vote_count": 1955,
                "character": "Man in Sunglasses That Helps Nadia Strip (uncredited)",
                "credit_id": "5e994f220582240013afbb19",
                "order": 115
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Umberto Orsini (born 2 April 1934, in Novara) is an Italian stage, television and film actor.\n\nBorn in Novara, Orsini gave up his career as notary to attend the Accademia Nazionale di Arte Drammatica Silvio D'Amico. In the late 1950s, he emerged as a talented stage actor, and in 1960, for the theatrical representation of L'Arialda, he worked for the first time with Luchino Visconti. After a few secondary roles (that include Federico Fellini's La Dolce Vita), Orsini debuted in a leading role in 1962 with the film Il mare, directed by Giuseppe Patroni Griffi. In 1969, he was awarded with the Nastro d'Argento for Best Supporting Actor for his performance in Visconti's The Damned. In 2008, he was nominated to David di Donatello for Best Supporting Actor for his role in Il mattino ha l'oro in bocca.\n\nSource: Article \"Umberto Orsini\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1934-04-02",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 27166,
        "imdb_id": "nm0650753",
        "known_for_department": "Acting",
        "name": "Umberto Orsini",
        "place_of_birth": "Novara, Piedmont, Italy",
        "popularity": 0.7315,
        "profile_path": "/hMDyTrHNtVMiyIsWfImpTQf85jo.jpg"
    }
}