{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tcx15vswrQJCGET5lGxESQ4J5LG.jpg",
                "genre_ids": [
                    10752,
                    36,
                    12
                ],
                "id": 57212,
                "original_language": "en",
                "original_title": "War Horse",
                "overview": "On the brink of the First World War, Albert's beloved horse Joey is sold to the Cavalry by his father. Against the backdrop of the Great War, Joey begins an odyssey full of danger, joy, and sorrow, and he transforms everyone he meets along the way. Meanwhile, Albert, unable to forget his equine friend, searches the battlefields of France to find Joey and bring him home.",
                "popularity": 4.4341,
                "poster_path": "/3aRHhvvngFPJFy5uAjo7GVr3PhL.jpg",
                "release_date": "2011-12-25",
                "title": "War Horse",
                "video": false,
                "vote_average": 7.296,
                "vote_count": 3519,
                "character": "Motorbike Rider",
                "credit_id": "638c79f6c3aa3f0084cd0e18",
                "order": 28
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Justin Brett trained at the Central School of Speech & Drama. Aside from acting and improvisation (which he also coaches), he also performs as a comedian, and co-runs Duke’s Comedy Club. Theatre includes: alt. Johnny Cash in Million Dollar Quartet (West End); Dame in Robin Hood and the Babes in the Wood (Theatr Clywd); Dick Barton in Dick Barton, Special Agent and Captain Tempest in Return to the Forbidden Planet (Oldham Coliseum and Tour); Dame inBeauty and the Beast and Ugly Sister in Cinderella (New Wolsey; Oxford Playhouse); Lost in The Stars (Royal Festival Hall); October Plenty (Globe); Blue/Orange (Octagon, Bolton – Nominated Best Actor, MEN Awards); East Lynne (New Vic, Stoke); The Real Thing(Manchester Library); 101 Dalmatians (Chester Gateway); Strangers on a Train, Blue/Orange, Arms and the Man (Keswick); The Champion of Paribanou, My Sister Sadie, This Is Where We Came In (Stephen Joseph Theatre, Scarborough); A Small Family Business (West Yorkshire Playhouse); Christmas on Mars (Finborough); The Rivals (Bath); The Revenger`s Tragedy (Bridewell); Deirdre of the Sorrows(Riverside Studios); Jinx, Other Lives, Clowns (Orange Tree).T.V. credits include: Hilary Devey’s Interns; Peep Show; Doctors; EastEnders; Topsy and Tim; Pulling; Gory Greek Gods; Dombey & Son;The Queen’s Nose; The Bill; London`s Burning; Ghoul-Lashed; Spooky.Film includes: War Horse (Steven Spielberg); Gulliver’s Travels; The Fallen; Brothers; Randall’s Flat.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://showstopperthemusical.com/company/justin-brett/",
        "id": 2720565,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Justin Brett",
        "place_of_birth": "North London, England, UK",
        "popularity": 0.1372,
        "profile_path": null
    }
}