{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yFZG86Zvdy6JuIlMW9eHxlVkct5.jpg",
                "genre_ids": [
                    16,
                    28,
                    12,
                    14,
                    878
                ],
                "id": 413594,
                "original_language": "ja",
                "original_title": "劇場版 ソードアート・オンライン -オーディナル・スケール-",
                "overview": "In 2026, four years after the infamous Sword Art Online incident, a revolutionary new form of technology has emerged: the Augma, a device that utilizes an Augmented Reality system. Unlike the Virtual Reality of the NerveGear and the Amusphere, it is perfectly safe and allows players to use it while they are conscious, creating an instant hit on the market. The most popular application for the Augma is the game Ordinal Scale, which immerses players in a fantasy role-playing game with player rankings and rewards.  Following the new craze, Kirito's friends dive into the game, and despite his reservations about the system, Kirito eventually joins them. While at first it appears to be just fun and games, they soon find out that the game is not all that it seems...",
                "popularity": 4.319,
                "poster_path": "/2szdEK0Mr0RG0nWGFVTseNQHbnP.jpg",
                "release_date": "2017-02-18",
                "title": "Sword Art Online: The Movie – Ordinal Scale",
                "video": false,
                "vote_average": 7.695,
                "vote_count": 711,
                "character": "Additional Voice",
                "credit_id": "64656db9006b010147e8643f",
                "order": 27
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "蟹江 俊介",
            "かにえ しゅんすけ"
        ],
        "biography": "Shunsuke Kanie (蟹江 俊介, Kanie Shunsuke, January 4, 1991) is a Japanese voice actor born in Chita, Aichi prefecture. He is affiliated with Aoni Production. He graduated from Tokyo Announce Gakuin and Amusement Media Academy.",
        "birthday": "1991-01-04",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.aoni.co.jp/search/kanie-shunsuke.html",
        "id": 2724026,
        "imdb_id": "nm8903273",
        "known_for_department": "Acting",
        "name": "Shunsuke Kanie",
        "place_of_birth": "Chita, Aichi, Japan",
        "popularity": 0.08,
        "profile_path": "/vg1iXLtfNl2SySHxIhfrpfnX9Vr.jpg"
    }
}