{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/edH2sKM63YiSEOWoaJPN87a71dZ.jpg",
                "genre_ids": [
                    18
                ],
                "id": 777245,
                "original_language": "en",
                "original_title": "Women Talking",
                "overview": "A group of women in an isolated religious colony struggle to reconcile their faith with a series of sexual assaults committed by the colony's men.",
                "popularity": 1.7474,
                "poster_path": "/wcTc9GveMMjAdHSlzdE0FaRCtqi.jpg",
                "release_date": "2022-12-23",
                "title": "Women Talking",
                "video": false,
                "vote_average": 6.872,
                "vote_count": 650,
                "character": "Neitje",
                "credit_id": "6315498a7fcab30091dd248f",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Liv McNeil is an artist, filmmaker, and actor. In 2020, as a grade 9 student, Liv produced, shot, edited, and starred in a short film illustrating the effects of the COVID-19 lockdown on teens' mental health. This passion project, titled \"Numb\" hit a global nerve, reaching millions, and garnering Liv Film Festival awards and accolades from across the globe. This \"gut punch\" film thrust Liv to center stage, putting her in touch with many creative industry heavyweights. Sarah Polley, called \"Numb\" the \"best film I've seen in 2020\". Sarah then asked Liv to read for a part in her project \"Women Talking\". Liv jumped at the chance, landing the role of Neitje, a teenage girl who sketches her way out of the trauma they endured in their colony. Liv's original artwork is featured throughout the film. Liv has gone on to other projects including her latest, shooting and editing a behind-the-scenes Documentary on Sofia Coppola's film Priscilla, released in 2023 on the A24 app. Liv is actively studying film production and is searching for new opportunities in her career.",
        "birthday": null,
        "deathday": null,
        "gender": 0,
        "homepage": "https://www.imdb.com/name/nm14003158/",
        "id": 2728905,
        "imdb_id": "nm14003158",
        "known_for_department": "Directing",
        "name": "Liv McNeil",
        "place_of_birth": null,
        "popularity": 0.0214,
        "profile_path": null
    }
}