{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/70uUnpfe7en9x011UjpZoub101l.jpg",
                "genre_ids": [
                    99,
                    18,
                    80
                ],
                "id": 1430,
                "original_language": "en",
                "original_title": "Bowling for Columbine",
                "overview": "This is not a film about gun control. It is a film about the fearful heart and soul of the United States, and the 280 million Americans lucky enough to have the right to a constitutionally protected Uzi. From a look at the Columbine High School security camera tapes to the home of Oscar-winning NRA President Charlton Heston, from a young man who makes homemade napalm with The Anarchist's Cookbook to the murder of a six-year-old girl by another six-year-old. Bowling for Columbine is a journey through the US, through our past, hoping to discover why our pursuit of happiness is so riddled with violence.",
                "popularity": 5.1555,
                "poster_path": "/5AlgeysilsfLdEwlTlYO7fqgsLn.jpg",
                "release_date": "2002-10-09",
                "title": "Bowling for Columbine",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 1614,
                "character": "Self (archive footage)",
                "credit_id": "650266151bf266013a75e3b9",
                "order": 29
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Jessica Beth Savitch (February 1, 1947 – October 23, 1983) was an American television journalist who was the weekend anchor of NBC Nightly News and daily newsreader for NBC News during the late 1970s and early 1980s. Savitch was one of the first women to anchor an evening network newscast solo, following in the footsteps of Marlene Sanders of ABC News and Catherine Mackin of NBC News. She also hosted PBS's public affairs program Frontline from its January 1983 debut until her death as a passenger in an automobile accident later that year.\n\nShortly before her death in October 1983, Savitch gave a broadcast of NBC News Digest in which her delivery was erratic and she appeared to be under the influence of an illicit substance. The incident caused widespread speculation that she was abusing drugs. Savitch died three weeks later by drowning after the car she was riding in as a passenger was accidentally driven into a canal during a heavy rainstorm. No drugs and very little alcohol were present in either her system or that of her friend who was driving.\n\nIn life, Savitch was renowned for her audience appeal and her skill as an on-camera news reader, although she drew criticism for her relative lack of journalism experience. Prior to joining NBC News, she was a popular local anchorwoman in Philadelphia and before that, while working at a Houston television station, she was the first female news anchor in the South. Posthumously, Savitch became the subject of two biographies, television documentaries, and a television film entitled Almost Golden: The Jessica Savitch Story.\n\nThe 1996 feature film Up Close & Personal starring Michelle Pfeiffer and Robert Redford was very loosely based on her life. Savitch's experiences as a pioneer anchorwoman also helped inspire Will Ferrell to make the 2004 film Anchorman: The Legend of Ron Burgundy.",
        "birthday": "1947-02-01",
        "deathday": "1983-10-23",
        "gender": 2,
        "homepage": null,
        "id": 2736211,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Jessica Savitch",
        "place_of_birth": "Wilmington, Delaware, USA",
        "popularity": 0.0387,
        "profile_path": "/pMEOV7rxuUOhmaFcEnsx5DBXOkS.jpg"
    }
}