{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mLihPIodzSenkZtiUauDy4e9hRs.jpg",
                "genre_ids": [
                    10751,
                    14,
                    10770,
                    12,
                    10402
                ],
                "id": 417320,
                "original_language": "en",
                "original_title": "Descendants 2",
                "overview": "When the pressure to be royal becomes too much for Mal, she returns to the Isle of the Lost where her archenemy Uma, Ursula's daughter, has taken her spot as self-proclaimed queen.",
                "popularity": 6.7944,
                "poster_path": "/qoNlGfQmFZ37Gf5fRBaCTLlOZtx.jpg",
                "release_date": "2017-07-21",
                "title": "Descendants 2",
                "video": false,
                "vote_average": 7.347,
                "vote_count": 1724,
                "character": "Dancer and Chorus Performer",
                "credit_id": "600f789722e480003e079afe",
                "order": 63
            },
            {
                "adult": false,
                "backdrop_path": "/qegwTsiVjrNY9nwkwzLJQ5r4204.jpg",
                "genre_ids": [
                    35,
                    14,
                    878
                ],
                "id": 416494,
                "original_language": "en",
                "original_title": "Status Update",
                "overview": "After being uprooted by his parents' separation and unable to fit into his new hometown, a teenager stumbles upon a magical app that causes his social media updates to come true.",
                "popularity": 2.7445,
                "poster_path": "/E4twRNScyq3g6tRpvK6X8LdD1z.jpg",
                "release_date": "2018-02-09",
                "title": "Status Update",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 553,
                "character": "Dancer",
                "credit_id": "67264ab71f61a4a8e8259a11",
                "order": 39
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Born and raised in Vancouver, BC, Joe Tuliao has established himself as an innovative choreographer and creative director in the entertainment industry. At the start of a young age, Joe’s passion for dance and performing escalated which led him to rise to the top of his field. Joe’s style ranges from Hip hop, Popping, Locking, Jazz, Contemporary and Tango. By trailblazing and pioneering, Joe has earned numerous opportunities in the entertainment industry.\n\nJoe is known for his work choreographing for Rupaul’s Secret Celebrity Drag Race, telecommunications company ‘Bell Media’ commercial, Disney’s ‘Mech-X4’, Assistant Choreographer for Nickelodeon Movie Musical: 'The J Team' starring Jojo Siwa (Emmy nominated for 'Outstanding Choreography'), and a commercial ad for NIKE Sportswear. Most recently, Joe has choreographed for a LIONSGATE feature film with director Adele Lim, writer of ‘Crazy Rich Asians’ & produced by Seth Rogen of PointGrey Pictures. He has also co-choreographed a performance for artist/actor Darren Criss, for the fashion show of global brand, SHEIN. Joe has also worked on-screen for  numerous films such as; Disney’s  ‘Descendants 2 & 3’ with Director Kenny Ortega, ‘Freaky Friday’, Lifetime’s ‘Britney Ever After’, NBC’s ‘Zoey's Extraordinary Playlist’, and CW’s ‘Riverdale’, to name a few.\n\nJoe recently has expanded his work in theater and will be choreographing ‘The Legend of Georgia Mcbride’ produced by the Arts Club. Joe changed the game by producing and directing innovative live dance shows: ‘AWAKEN’, ‘TRANSCEND’, and ‘MANTRA’. Joe is the co-producer of 'Innovate Dance Film Showcase', an event that features the works of Canadian filmmakers & choreographers.  Joe has also toured around the world teaching at conventions and workshops in China, Europe, United States, and Canada. As an established Asian choreographer in Vancouver and Los Angeles, Joe's purpose is to create positive change in the entertainment industry and advocate diversity & inclusion through his leadership, authenticity, and creativity.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.joetuliao.com/",
        "id": 2739561,
        "imdb_id": "nm8708256",
        "known_for_department": "Acting",
        "name": "Joe Tuliao",
        "place_of_birth": "Vancouver, British Columbia, Canada",
        "popularity": 0.0143,
        "profile_path": "/7HwS2yGD8iB3COpgWXH8EVSl8Ic.jpg"
    }
}