{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/c2gcLDxniE0lNmT2a7CcQVuW6En.jpg",
                "genre_ids": [
                    12,
                    28,
                    53
                ],
                "id": 36557,
                "original_language": "en",
                "original_title": "Casino Royale",
                "overview": "Le Chiffre, a banker to the world's terrorists, is scheduled to participate in a high-stakes poker game in Montenegro, where he intends to use his winnings to establish his financial grip on the terrorist market. M sends Bond—on his maiden mission as a 00 Agent—to attend this game and prevent Le Chiffre from winning. With the help of Vesper Lynd and Felix Leiter, Bond enters the most important poker game in his already dangerous career.",
                "popularity": 16.5461,
                "poster_path": "/lMrxYKKhd4lqRzwUHAy5gcx9PSO.jpg",
                "release_date": "2006-11-14",
                "title": "Casino Royale",
                "video": false,
                "vote_average": 7.564,
                "vote_count": 11144,
                "character": "Tomelli",
                "credit_id": "53ac2a820e0a26761c001f95",
                "order": 23
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Urbano Barberini Riario Sforza Colonna di Sciarra",
            "Урбано Барберини"
        ],
        "biography": "Urbano Barberini Riario Sforza Colonna di Sciarra (born 18 September 1961), best known as Urbano Barberini or sometimes Urbano Barberini Sforza, is an Italian actor. He is also a translator, theater producer and artistic director. He is fluent in Italian and French languages and is mostly known for starring or appearing in many horror, fantasy and drama films, including the cult classic Dèmoni (Demons).\n\nHis most recognized role in the English-speaking countries was in his work in Dario Argento's film Opera though in the English dubbing, his voice was replaced with another actor's deeper voice. The only DVD that retains his original voice on the English dub is the UK release from Arrow Films.",
        "birthday": "1961-09-18",
        "deathday": null,
        "gender": 2,
        "homepage": "https://solieassociati.it/attori/urbano_barberini",
        "id": 27398,
        "imdb_id": "nm0053519",
        "known_for_department": "Acting",
        "name": "Urbano Barberini",
        "place_of_birth": "Rome, Lazio, Italy",
        "popularity": 1.4342,
        "profile_path": "/k9lvP2OpPHGTwzKFjUYl4Z9Iweu.jpg"
    }
}