{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lmVtUoozJqZdXRB3pFM5aOzZprk.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 380225,
                "original_language": "it",
                "original_title": "La pazza gioia",
                "overview": "Two mental patients with opposite personalities ditch their Tuscan hospital and embark on an unpredictable exploration of the real world.",
                "popularity": 2.6753,
                "poster_path": "/pSVdOFu22jGWRHyCoJwIJTYuDBD.jpg",
                "release_date": "2016-05-17",
                "title": "Like Crazy",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 887,
                "character": "Luciana Brogi coniugata Morelli",
                "credit_id": "65f0ca5a470ead017e9b182e",
                "order": 40
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Anna Maria Galiena",
            "Anna Galienna",
            "آنا گالینا"
        ],
        "biography": "Anna Galiena (born 22 December 1954) is an Italian actress, best known to English-speaking audiences for her appearances in Le Mari de la coiffeuse, Jamón, jamón and Being Human. her youth, Galiena starred in numerous off and on-Broadway shows, including several revivals of Shakespeare plays. She had made over a dozen films, mainly in her native Italy before her role in Le Mari de la coiffeuse brought her to international attention. She went on to appear in Bigas Luna's Jamón, jamón and went on to make her mainstream Hollywood debut in the Bill Forsyth-directed Being Human starring Robin Williams. The film was, however, a massive flop.\n\nSince then, Galiena has worked in European cinema, where she is consistently in demand. With over 50 films and many television appearances to her credit, she currently has several films in production, including a prominent supporting role in the film Virgin Territory, starring Hayden Christensen and Mischa Barton. She stars alongside Joaquim de Almeida and Ben Gazzara in the thriller Christopher Roth.\n\nIn 2007 she was a member of the jury at the 29th Moscow International Film Festival",
        "birthday": "1954-12-22",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 27391,
        "imdb_id": "nm0302105",
        "known_for_department": "Acting",
        "name": "Anna Galiena",
        "place_of_birth": "Roma, Lazio, Italy",
        "popularity": 0.7052,
        "profile_path": "/rJKizpOOVV0ZsdFss20wNqaS2NG.jpg"
    }
}