{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sTgavNm82pTaZR9U2NQZ1J2FrJz.jpg",
                "genre_ids": [
                    35,
                    18,
                    10751
                ],
                "id": 788,
                "original_language": "en",
                "original_title": "Mrs. Doubtfire",
                "overview": "Loving but irresponsible dad Daniel Hillard, estranged from his exasperated spouse, is crushed by a court order allowing only weekly visits with his kids. When Daniel learns his ex needs a housekeeper, he gets the job -- disguised as a British nanny. Soon he becomes not only his children's best pal but the kind of parent he should have been from the start.",
                "popularity": 5.8994,
                "poster_path": "/shHrSmXS5140o6sQzgzXxn3KqSm.jpg",
                "release_date": "1993-11-24",
                "title": "Mrs. Doubtfire",
                "video": false,
                "vote_average": 7.196,
                "vote_count": 6349,
                "character": "Bus Driver",
                "credit_id": "52fe4276c3a36847f80209e7",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Sydney Walker was an American character actor of stage and screen and voice artist, with a career that spanned over five decades. He is most known for Prelude to a Kiss (elderly man Meg Ryan's character switches bodies with), and as the bus driver on Mrs. Doubtfire.\n\nWalker made his Broadway debut as the Archbishop of Canterbury in the famous 1960 production of Jean Anouilh's \"Beckett,\" which starred Laurence Olivier and Anthony Quinn. He subsequently appeared in 22 Broadway productions from 1960 to 1973.\n\nWalker made his movie debut in the Kirk Douglas movie A Lovely Way to Die (1968) and played the doctor in Love Story (1970). He made five appearances on the CBS Radio Mystery Theater in 1974. His last film was Getting Even with Dad (1994), but his most famous movie role came two years earlier in the film adaptation of Prelude to a Kiss (1992), in which he reprized the role of the Old Man he had assayed in the 1988 Berkeley Repertory production of the Craig Lucas play.",
        "birthday": "1921-05-05",
        "deathday": "1994-09-30",
        "gender": 2,
        "homepage": null,
        "id": 27447,
        "imdb_id": "nm0908246",
        "known_for_department": "Acting",
        "name": "Sydney Walker",
        "place_of_birth": "Philadelphia, Pennsylvania, USA",
        "popularity": 0.1443,
        "profile_path": "/1cpTr6tdsJYsdxExkIyoukZuVKb.jpg"
    }
}