{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/y0ludgr1EvyXcT1lv2M0m621LQ6.jpg",
                "genre_ids": [
                    10751,
                    12,
                    14,
                    10770,
                    10402
                ],
                "id": 277217,
                "original_language": "en",
                "original_title": "Descendants",
                "overview": "A present-day idyllic kingdom where the benevolent teenage son of King Adam and Queen Belle offers a chance of redemption for the troublemaking offspring of Disney's classic villains: Cruella De Vil (Carlos), Maleficent (Mal), the Evil Queen (Evie) and Jafar (Jay).",
                "popularity": 5.9062,
                "poster_path": "/65DkgHPSLVjgr6IYkpY9Aqqqid5.jpg",
                "release_date": "2015-07-31",
                "title": "Descendants",
                "video": false,
                "vote_average": 7.146,
                "vote_count": 2434,
                "character": "Happy Student (uncredited)",
                "credit_id": "60a092a3b0ba7e003f6bfb4c",
                "order": 64
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "You can see Ben recurring as \"Michael Siletti\" on TNT's Murder In the First, \"Zach\" on Teen Wolf, \"James\" on Grey's Anatomy, \"Nathan\" on Sullivan & Son, \"Evan Braun\" on Criminal Minds, \"James (recurring)\" on Shake It Up, \"Owen (recurring)\" on Lab Rats, \"Camden\" on Richie Rich, \"Todd\" in Tales of Halloween Feature Film, \"Nicholas\" (series regular) on Bad Family/Fox Pilot, \"Zuke (lead\")\" on There Goes the Planet Pilot, Johnny on \"Cozmos\", and \"Adam (lead)\" on Cartoon Networks Live Action Pilot Attention Students.\n\nBen is also a writer, finishing his first pilot script when he was just 16, and completing a full table read of his script at Second City. He also writes sketch comedy, sitcom spec, and completed writing two more pilots by the age of 19.\n\nBen is in the Improv Conservatory Program at Second City, and has been continually working on honing his comedic and improvisational skills since the age of 13. He's trained at Second City, The Groundlings, and LA Connection.\n\nBen enjoys visiting new Escape Rooms, Parkour/Free Running, and trains at various gyms in Los Angeles when he's not acting or writing.",
        "birthday": "1996-05-23",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2749570,
        "imdb_id": "nm4122931",
        "known_for_department": "Acting",
        "name": "Ben Stillwell",
        "place_of_birth": "Jacksonville, Florida, USA",
        "popularity": 0.4291,
        "profile_path": "/i7edLItnAkpYcqRNwyRfnNzDVgq.jpg"
    }
}