{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/iYqoT9VBGdGTuLl3cjfbG7ZXDkP.jpg",
                "genre_ids": [
                    99,
                    18
                ],
                "id": 656690,
                "original_language": "en",
                "original_title": "The Social Dilemma",
                "overview": "This documentary-drama hybrid explores the dangerous human impact of social networking, with tech experts sounding the alarm on their own creations.",
                "popularity": 4.607,
                "poster_path": "/jdmagxKK7g2rPkdltC7Kga2MBbp.jpg",
                "release_date": "2020-01-26",
                "title": "The Social Dilemma",
                "video": false,
                "vote_average": 7.442,
                "vote_count": 1681,
                "character": "Self",
                "credit_id": "5f40887219ab5900341cd117",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Тристан Харрис"
        ],
        "biography": "Tristan Harris is an American computer scientist, and businessperson. He is the president and a co-founder of the Center for Humane Technology. Earlier, he worked as a design ethicist at Google. He received his degree from Stanford, where he studied ethics of human persuasion.  Called the \"closest thing Silicon Valley has to a conscience,\" by The Atlantic magazine, Tristan Harris spent three years as a Google Design Ethicist developing a framework for how technology should \"ethically\" steer the thoughts and actions of billions of people from screens. He is now co-founder of the Center for Humane Technology, whose mission is to reverse 'human downgrading' and re-align technology with humanity.\n\nAdditionally, he is co-host of the Your Undivided Attention podcast with co-founder, Aza Raskin. Tristan has been profiled in Vanity Fair New Establishment Top 10 in the Valley in 2019, Fortune's 40 under 40 for work on reforming technology in 2018, Rolling Stone magazine one of 25 People Shaping the World in 2017 and has been featured on TED, The Atlantic, 60 Minutes, The New York Times, Associated Press, Wall Street Journal and many more.\n\n\"Tristan Harris is probably the strongest voice in technology pointing where the industry needs to go,\" says Marc Benioff of Salesforce in the WSJ. \"This is a call to arms and everyone needs to hear him now.\"",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2750818,
        "imdb_id": "nm9038510",
        "known_for_department": "Acting",
        "name": "Tristan Harris",
        "place_of_birth": null,
        "popularity": 0.2333,
        "profile_path": "/v0eY3sQUaV5zLKU07tkhN2ec51q.jpg"
    }
}