{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/u7i1XtbOubq0xwRy2Zbgmox6g9W.jpg",
                "genre_ids": [
                    18
                ],
                "id": 220,
                "original_language": "en",
                "original_title": "East of Eden",
                "overview": "In the Salinas Valley in and around World War I, Cal Trask feels he must compete against overwhelming odds with his brother for the love of their father. Cal is frustrated at every turn, from his reaction to the war, how to get ahead in business and in life, and how to relate to his estranged mother.",
                "popularity": 4.6974,
                "poster_path": "/xv1MZVIop0SQqwLUymgE5eb2LFl.jpg",
                "release_date": "1955-04-10",
                "title": "East of Eden",
                "video": false,
                "vote_average": 7.55,
                "vote_count": 775,
                "character": "Sam the Sheriff",
                "credit_id": "52fe4228c3a36847f80086bd",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/3Yz8IcUBPZ8zDff0ktHZk24Rot0.jpg",
                "genre_ids": [
                    18
                ],
                "id": 261,
                "original_language": "en",
                "original_title": "Cat on a Hot Tin Roof",
                "overview": "An alcoholic ex-football player drinks his days away, having failed to come to terms with his sexuality and his real feelings for his football buddy who died after an ambiguous accident. His wife is crucified by her desperation to make him desire her: but he resists the affections of his wife. His reunion with his father—who is dying of cancer—jogs a host of memories and revelations for both father and son.",
                "popularity": 2.0195,
                "poster_path": "/5djZZECgqDGuSI1INmrdAcGRBb0.jpg",
                "release_date": "1958-08-29",
                "title": "Cat on a Hot Tin Roof",
                "video": false,
                "vote_average": 7.656,
                "vote_count": 786,
                "character": "Harvey 'Big Daddy' Pollitt",
                "credit_id": "52fe422fc3a36847f800a6b3",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/zd3p7GKopxH4rIjGoDQ1ugalUtx.jpg",
                "genre_ids": [
                    16,
                    10751,
                    10770,
                    12
                ],
                "id": 13382,
                "original_language": "en",
                "original_title": "Rudolph the Red-Nosed Reindeer",
                "overview": "Sam the snowman tells us the story of a young red-nosed reindeer who, after being ousted from the reindeer games because of his glowing nose, teams up with Hermey, an elf who wants to be a dentist, and Yukon Cornelius, the prospector. They run into the Abominable Snowman and find a whole island of misfit toys. Rudolph vows to see if he can get Santa to help the toys, and he goes back to the North Pole on Christmas Eve. But Santa's sleigh is fogged in. But when Santa looks over Rudolph, he gets a very bright idea...",
                "popularity": 1.4097,
                "poster_path": "/xjAElUhXuc7zFJPj3qUHjcySNsE.jpg",
                "release_date": "1964-12-06",
                "title": "Rudolph the Red-Nosed Reindeer",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 619,
                "character": "Sam the Snowman (voice)",
                "credit_id": "52fe45629251416c750548a7",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Burl Icle Ivanhoe Ives",
            "Бёрл Айвз"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nBurl Icle Ivanhoe Ives (June 14, 1909 – April 14, 1995) was an American singer and actor of stage, screen, radio and television.\n\nIves began as an itinerant singer and banjoist, and launched his own radio show, The Wayfaring Stranger, which popularized traditional folk songs. In 1942 he appeared in Irving Berlin's This Is the Army, and then became a major star of CBS radio. In the 1960s he successfully crossed over into country music, recording hits such as \"A Little Bitty Tear\" and \"Funny Way of Laughin'\". A popular film actor through the late 1940s and '50s, Ives's best-known film roles included parts in So Dear to My Heart (1949) and Cat on a Hot Tin Roof (1958), as well as Rufus Hannassey in The Big Country (1958), for which he won an Academy Award for Best Supporting Actor.\n\nIves is often remembered for his voice-over work as Sam the Snowman, narrator of the classic 1964 Christmas television special Rudolph the Red-Nosed Reindeer, which continues to air annually around Christmas.",
        "birthday": "1909-06-14",
        "deathday": "1995-04-14",
        "gender": 2,
        "homepage": null,
        "id": 2753,
        "imdb_id": "nm0412322",
        "known_for_department": "Acting",
        "name": "Burl Ives",
        "place_of_birth": "Hunt City, Illinois, USA",
        "popularity": 1.3162,
        "profile_path": "/qRefQVFPdXwkHLLgDLFPeRgcLu4.jpg"
    }
}