{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8Xb0LfbdrS2pwDYyMkUiawzbGBu.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 2623,
                "original_language": "en",
                "original_title": "An Officer and a Gentleman",
                "overview": "Zack Mayo is an aloof, taciturn man who aspires to be a navy pilot. Once he arrives at training camp for his 13-week officer's course, Mayo runs afoul of abrasive, no-nonsense drill Sergeant Emil Foley. Mayo is an excellent cadet, but a little cold around the heart, so Foley rides him mercilessly, sensing that the young man would be prime officer material if he weren't so self-involved. Zack's affair with a working girl is likewise compromised by his unwillingness to give of himself.",
                "popularity": 3.8023,
                "poster_path": "/69adZbLeRk5TNQ3e0008dMnde9p.jpg",
                "release_date": "1982-07-28",
                "title": "An Officer and a Gentleman",
                "video": false,
                "vote_average": 7.019,
                "vote_count": 1146,
                "character": "Perryman",
                "credit_id": "52fe4360c3a36847f804fc45",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Гарольд Сильвестр"
        ],
        "biography": "Harold Sylvester (born February 10, 1949) is an American film and television actor.\n\nSylvester was born in New Orleans, Louisiana. A graduate of New Orleans' St. Augustine High School and Tulane University, Sylvester is best known for his role on the TV series Married... with Children as Griff, the co-worker and friend of Al Bundy at the shoe store. Harold's other TV roles include the short-lived 1981 series Walking Tall, Today's F.B.I., Mary, and Shaky Ground. The most recent TV show he starred in was The Army Show. Sylvester had a recurring role on the TV series City of Angels.\n\nHis well known film roles are An Officer and a Gentleman (1982), Uncommon Valor (1983), Innerspace (1987), Corrina, Corrina (1994), and Missing Brendan (2003). Sylvester has made guest appearances on shows, ranging from Hill Street Blues to Murder, She Wrote to NYPD Blue.\n\nSylvester attended Tulane University on a basketball scholarship and graduated in 1972 with a degree in theater and psychology. He was the first African-American ever to receive an athletic scholarship from Tulane.",
        "birthday": "1949-02-10",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 27540,
        "imdb_id": "nm0843221",
        "known_for_department": "Acting",
        "name": "Harold Sylvester",
        "place_of_birth": "New Orleans, Louisiana",
        "popularity": 0.2258,
        "profile_path": "/s2DpaxOxSt2H1SpVwJFXGbWg6wr.jpg"
    }
}