{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qfJ6aJKRPUZ7kYOp7iuzl5jkyX5.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 2639,
                "original_language": "en",
                "original_title": "Deconstructing Harry",
                "overview": "Writer Harry Block draws inspiration from people he knows, and from events that happened to him, sometimes causing these people to become alienated from him as a result.",
                "popularity": 4.3178,
                "poster_path": "/i7Z5DdznqANJUjqWISEFu9bw6J7.jpg",
                "release_date": "1997-12-12",
                "title": "Deconstructing Harry",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 995,
                "character": "Jane",
                "credit_id": "52fe4361c3a36847f804ff33",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/zwJFfKQdfiptK2GY6N8GkZFrAxJ.jpg",
                "genre_ids": [
                    27,
                    53
                ],
                "id": 7340,
                "original_language": "en",
                "original_title": "Carrie",
                "overview": "Withdrawn and sensitive teen Carrie White faces taunting from classmates at school and abuse from her fanatically pious mother. When strange occurrences start happening around Carrie, she begins to suspect that she has supernatural powers.",
                "popularity": 5.9683,
                "poster_path": "/uc3OvgmbnYaS5Y0BOjSmC1EmSz1.jpg",
                "release_date": "1976-11-03",
                "title": "Carrie",
                "video": false,
                "vote_average": 7.322,
                "vote_count": 4057,
                "character": "Sue Snell",
                "credit_id": "52fe447ac3a36847f80985c5",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/syapU4X3vYBCdARyAOtz3g90hMt.jpg",
                "genre_ids": [
                    53,
                    18,
                    80
                ],
                "id": 1900,
                "original_language": "en",
                "original_title": "Traffic",
                "overview": "An exploration of the United States of America's war on drugs from multiple perspectives. For the new head of the Office of National Drug Control Policy, the war becomes personal when he discovers his well-educated daughter is abusing cocaine within their comfortable suburban home. In Mexico, a flawed, but noble policeman agrees to testify against a powerful general in league with a cartel, and in San Diego, a drug kingpin's sheltered trophy wife must learn her husband's ruthless business after he is arrested, endangering her luxurious lifestyle.",
                "popularity": 5.8777,
                "poster_path": "/v6YrfR1e2OUAYbXrJ7hv3EiGNcg.jpg",
                "release_date": "2000-12-27",
                "title": "Traffic",
                "video": false,
                "vote_average": 7.081,
                "vote_count": 2261,
                "character": "Barbara Wakefield",
                "credit_id": "5b28ac250e0a2659d70028aa",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/udIE8Cdon9wnYmVIOFYrBPfA2Mq.jpg",
                "genre_ids": [
                    14,
                    16,
                    35,
                    80
                ],
                "id": 856,
                "original_language": "en",
                "original_title": "Who Framed Roger Rabbit",
                "overview": "'Toon star Roger is worried that his wife Jessica is playing pattycake with someone else, so the studio hires detective Eddie Valiant to snoop on her. But the stakes are quickly raised when Marvin Acme is found dead and Roger is the prime suspect.",
                "popularity": 5.972,
                "poster_path": "/lYfRc57Kx9VgLZ48iulu0HKnM15.jpg",
                "release_date": "1988-06-22",
                "title": "Who Framed Roger Rabbit",
                "video": false,
                "vote_average": 7.531,
                "vote_count": 5937,
                "character": "Jessica Rabbit (singing voice) (uncredited)",
                "credit_id": "5b28abe79251412c6600219f",
                "order": 50
            },
            {
                "adult": false,
                "backdrop_path": "/aQFBJPlPv8wAe4qUWDMQC7CN9Za.jpg",
                "genre_ids": [
                    18,
                    36,
                    10752
                ],
                "id": 10142,
                "original_language": "en",
                "original_title": "Casualties of War",
                "overview": "During the Vietnam War, a soldier finds himself the outsider of his own squad when they unnecessarily kidnap a female villager.",
                "popularity": 6.5647,
                "poster_path": "/3SerZUDoU9TMCXMsQqiXvSWm0uL.jpg",
                "release_date": "1989-08-18",
                "title": "Casualties of War",
                "video": false,
                "vote_average": 7.157,
                "vote_count": 942,
                "character": "Girl on the Train (voice) (uncredited)",
                "credit_id": "611b90091bf876005e5ba9b2",
                "order": 41
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Amy Davis Irving (born September 10, 1953) is an American actress and singer, who worked in film, stage, and television. Her accolades include an Obie Award, two Golden Globe Award nominations, and one Academy Award nomination.\n\nBorn in Palo Alto, California, to actors Jules Irving and Priscilla Pointer, Irving spent her early life in San Francisco before her family relocated to New York City during her teenage years. In New York, she made her Broadway debut in The Country Wife (1965–1966) at age 13. Irving subsequently studied theater at San Francisco's American Conservatory Theater and at the London Academy of Music and Dramatic Art before making her feature film debut in Brian De Palma's Carrie (1976), followed by a lead role in the 1978 supernatural thriller The Fury (1978).\n\nIn 1980, Irving appeared in a Broadway production of Amadeus before being cast in Yentl (1983), for which she was nominated for an Academy Award for Best Supporting Actress. In 1988, she received an Obie Award for her Off-Broadway performance in a production of The Road to Mecca, and was nominated for a Golden Globe Award for her performance in the comedy Crossing Delancey (1988). Irving went on to appear in the original Broadway production of Broken Glass (1994) and the revival of Three Sisters (1997). In film, she starred in the ensemble comedy Deconstructing Harry (1997), and reprised her role in The Rage: Carrie 2 (1999) before co-starring opposite Michael Douglas in Steven Soderbergh's crime-drama Traffic (2000). She subsequently appeared in the independent films Thirteen Conversations About One Thing (2001) and Adam (2009). From 2006 to 2007, she starred in the Broadway production of The Coast of Utopia. In 2018, she reunited with Soderbergh, appearing in a supporting role in his horror film Unsane.\n\nDescription above from the Wikipedia article Amy Irving, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1953-09-10",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 27563,
        "imdb_id": "nm0001388",
        "known_for_department": "Acting",
        "name": "Amy Irving",
        "place_of_birth": "Palo Alto, California, USA",
        "popularity": 1.2317,
        "profile_path": "/skJ1jxHZCbBL3fl3hf8LTjiLwhk.jpg"
    }
}