{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5pLaYZGbweHYULiNiRehPxYuUnn.jpg",
                "genre_ids": [
                    35,
                    80
                ],
                "id": 2640,
                "original_language": "en",
                "original_title": "Heathers",
                "overview": "A girl who halfheartedly tries to be part of the \"in crowd\" of her school meets a rebel who teaches her a more devious way to play social politics: by killing the popular kids.",
                "popularity": 4.9217,
                "poster_path": "/dGbVfM4WlM7uvIbyRehfPZUIgp2.jpg",
                "release_date": "1988-10-01",
                "title": "Heathers",
                "video": false,
                "vote_average": 7.276,
                "vote_count": 1793,
                "character": "Heather Chandler",
                "credit_id": "52fe4361c3a36847f804ffdb",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/bAdIO0Jt886Ad1eY9bDXXeCpXsV.jpg",
                "genre_ids": [
                    10749,
                    35,
                    18
                ],
                "id": 2028,
                "original_language": "en",
                "original_title": "Say Anything...",
                "overview": "Lloyd, an eternal optimist, seeks to capture the heart of Diane, an unattainable high school beauty and straight-A student. He surprises just about everyone-including himself-when she returns the sentiment. But Diane's over-possessive, divorced Dad disapproves and it's going to take more than just the power of love to conquer all.",
                "popularity": 10.5431,
                "poster_path": "/nkucKciFGSRalw6dJtsglWqOXMC.jpg",
                "release_date": "1989-04-14",
                "title": "Say Anything...",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 1044,
                "character": "Sheila",
                "credit_id": "5e34a38c4ca676001a4fbab9",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Known for her supporting roles, Kim Walker was an up and coming young actress in Hollywood before retiring from the business in the late 1990s. As a teen she landed a few guest roles in series such as \"Matlock\" (1986) and \"Highway to Heaven\" (1984) before moving on to supporting roles in feature films such as Say Anything... (1989) and several made-for-television films. However, Kim Walker will forever be remembered for her role as Heather Chandler in the now cult-classic Heathers (1988) which starred a young Winona Ryder in her first starring role. The role, which had Kim playing possibly the nastiest, most difficult teenager in the history of film won her acclaim and a legion of fans due to her legendary lines and her on-screen persona in this black comedy about high school life. With such lines as \"You're such a pillowcase!\", and \"Did you eat a brain tumor for breakfast?\", Walker was a scene stealer during the first half of the film. While later roles did not match the stardom attained in \"Heathers,\" Walker's acting career continued in the form of supporting roles.  IMDb Mini Biography By: Luis32789@aol.com",
        "birthday": "1968-06-19",
        "deathday": "2001-03-06",
        "gender": 1,
        "homepage": null,
        "id": 27565,
        "imdb_id": "nm0907947",
        "known_for_department": "Acting",
        "name": "Kim Walker",
        "place_of_birth": "New York, USA",
        "popularity": 1.041,
        "profile_path": "/4r1y8fgOu23nhwEMsJeqmIrvxyh.jpg"
    }
}