{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5P6hWD4zxAMntRuRnB4MmPLijNw.jpg",
                "genre_ids": [
                    18
                ],
                "id": 22881,
                "original_language": "en",
                "original_title": "The Blind Side",
                "overview": "The story of Michael Oher, a homeless and traumatized boy who became an All American football player and first round NFL draft pick with the help of a caring woman and her family.",
                "popularity": 14.2372,
                "poster_path": "/bMgq7VBriuBFknXEe9E9pVBYGZq.jpg",
                "release_date": "2009-11-20",
                "title": "The Blind Side",
                "video": false,
                "vote_average": 7.674,
                "vote_count": 6589,
                "character": "Self",
                "credit_id": "5f505699439be1003369d639",
                "order": 62
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Sen. Tuberville"
        ],
        "biography": "Thomas Hawley Tuberville (born September 18, 1954) is an American politician, and retired college football coach who is the senior United States senator from Alabama, a seat he has held since 2021. Before entering politics, Tuberville was the head football coach at Auburn University from 1999 to 2008. He was also the head football coach at the University of Mississippi from 1995 to 1998, Texas Tech University from 2010 to 2012, and the University of Cincinnati from 2013 to 2016.\n\nTuberville won five national Coach of the Year Awards (AP, AFCA, Sporting News, Walter Camp, and Bear Bryant) following Auburn's 13–0 season in 2004, in which Auburn won the Southeastern Conference title and the Sugar Bowl, but was left out of the BCS National Championship Game. He earned his 100th career win in 2007. Tuberville is the only coach in Auburn football history to beat in-state rival Alabama six consecutive times. In 2015, he was the president of the American Football Coaches Association. He worked for ESPN as a color analyst for its college football coverage during 2017.\n\nIn his first political campaign, Tuberville won the Republican nomination for the 2020 Senate election in Alabama and defeated Democratic incumbent Doug Jones by over 20 points. Establishing himself as an ally of President Donald Trump, he was among a group of Republican senators who attempted to overturn Democratic president-elect Joe Biden's victory over Trump in the 2020 presidential election. Tuberville became Alabama's senior senator in 2023 when Senator Richard Shelby retired.\n\nIn 2023, Tuberville held up all military promotions requiring Senate approval in protest of Defense Department policies on abortion, delaying the filling of hundreds of senior positions and leaving the Marine Corps without a leader for the first time in a century. By August 2023, the block had also left the Army[9] and the Navy without a confirmed top officer.",
        "birthday": "1954-09-18",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.tuberville.senate.gov/contact/",
        "id": 2764374,
        "imdb_id": "nm3676083",
        "known_for_department": "Acting",
        "name": "Tommy Tuberville",
        "place_of_birth": "Camden, Arkansas, USA",
        "popularity": 0.0168,
        "profile_path": "/ucyMdsAEOC88gCMEuIcGP8MlKgX.jpg"
    }
}