{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tmU7GeKVybMWFButWEGl2M4GeiP.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 238,
                "original_language": "en",
                "original_title": "The Godfather",
                "overview": "Spanning the years 1945 to 1955, a chronicle of the fictional Italian-American Corleone crime family. When organized crime family patriarch, Vito Corleone barely survives an attempt on his life, his youngest son, Michael steps in to take care of the would-be killers, launching a campaign of bloody revenge.",
                "popularity": 29.4604,
                "poster_path": "/3bhkrj58Vtu7enYsRolD1fZdja1.jpg",
                "release_date": "1972-03-14",
                "title": "The Godfather",
                "video": false,
                "vote_average": 8.7,
                "vote_count": 21834,
                "character": "Fabrizio - Sicilian Sequence",
                "credit_id": "6489ae14d2b20900ca220cca",
                "order": 30
            },
            {
                "adult": false,
                "backdrop_path": "/kjxnYiITXakTCeu2Ob8JIidGrAe.jpg",
                "genre_ids": [
                    35
                ],
                "id": 37775,
                "original_language": "it",
                "original_title": "Bianco, rosso e Verdone",
                "overview": "Three Italians travel to their hometown to vote for elections: Pasquale is a Southern immigrant living in Munich who's genuinely happy to come back to Italy, even if just for a few days, but the country he dreams of is far from reality; Furio travels to Rome with his family, but his niggling attitude threatens to push his wife Magda over the edge; young Mimmo is also going to Rome, but the trip is repeatedly interrupted by worries about his grandma's health.",
                "popularity": 1.2523,
                "poster_path": "/tS5ca077KEMbJHBVNLa1nCnycXJ.jpg",
                "release_date": "1981-02-20",
                "title": "Bianco, rosso e Verdone",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 725,
                "character": "Raoul",
                "credit_id": "57ed41319251416e020002e8",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/2dCkaxVGvXnPfQC07cweMAT2n3F.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749
                ],
                "id": 37056,
                "original_language": "en",
                "original_title": "Letters to Juliet",
                "overview": "An American girl on vacation in Italy finds an unanswered \"letter to Juliet\" -- one of thousands of missives left at the fictional lover's Verona courtyard, which are typically answered by the \"secretaries of Juliet\" -- and she goes on a quest to find the lovers referenced in the letter.",
                "popularity": 2.701,
                "poster_path": "/y9DdvY1IRNS2hWLq161hmP2gXn.jpg",
                "release_date": "2010-05-13",
                "title": "Letters to Juliet",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 2927,
                "character": "Chess Playing Lorenzo",
                "credit_id": "5f486a5da2e6020034f6d6ce",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Angelo Infanti (16 February 1939 – 12 October 2010) was an Italian film actor. He appeared in more than 90 films between 1961 and 2010. He was born on 16 February 1939 in Zagarolo, Italy. He died on 12 October 2010 in Tivoli, Italy due to cardiac arrest.\n\nInfanti is best known to non-Italian audiences as Fabrizio in The Godfather. Fabrizio was a bodyguard to Michael Corleone who was hiding in Sicily. Fabrizio betrays Michael by setting up explosives in his car, but kills his new bride instead. In the novel, Fabrizio is later shot dead in revenge for the killing. A scene was filmed of him being killed by the Corleones using a car bomb but was cut from the motion picture before its theatrical release. It appears in the 1977 The Godfather: A Novel for Television, which combined the first two films – The Godfather and The Godfather Part II, adding back scenes that had been previously cut and telling the story chronologically beginning with Vito Andolini's childhood in Sicily.\n\nSource: Article \"Angelo Infanti\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1939-02-16",
        "deathday": "2010-10-12",
        "gender": 2,
        "homepage": null,
        "id": 27647,
        "imdb_id": "nm0408636",
        "known_for_department": "Acting",
        "name": "Angelo Infanti",
        "place_of_birth": "Zagarolo, Lazio, Italy",
        "popularity": 0.5275,
        "profile_path": "/umdxDMQe8tVJUUc0re0bd28sH3H.jpg"
    }
}