{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/a2Aj5ksEo2HOUH3FbGyZCtaJM4C.jpg",
                "genre_ids": [
                    18,
                    36,
                    80
                ],
                "id": 3131,
                "original_language": "en",
                "original_title": "Gangs of New York",
                "overview": "In early 1860s New York, Irish immigrant Amsterdam Vallon is released from prison and returns to the Five Points, seeking revenge against his father's killer, William Cutting, a powerful anti-immigrant gang leader. He knows that revenge can only be attained by infiltrating Cutting's inner circle. Vallon's journey becomes a fight for personal survival and to find a place for the Irish people.",
                "popularity": 5.2702,
                "poster_path": "/lemqKtcCuAano5aqrzxYiKC8kkn.jpg",
                "release_date": "2002-12-14",
                "title": "Gangs of New York",
                "video": false,
                "vote_average": 7.316,
                "vote_count": 6869,
                "character": "One-Armed Priest",
                "credit_id": "5abfbeefc3a3684435027862",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Peter-Hugo Daly (born 1956 in Islington, London) is an actor and musician. In the late 1970s and early 1980s, he was a member of new wave band the Cross along with fellow actor Phil Daniels. The band released a 1979 single, \"Kill Another Night\", on RCA Records. In 1980, Daly appeared with Daniels as drummer Mick \"Lethal\" in the Hazel O'Connor film Breaking Glass.\n\nExtensive television appearances include Minder, Bergerac, The Bill, Birds of a Feather, Foyle's War, Martin Chuzzlewit, Silent Witness, New Tricks, Midsomer Murders, Between the Lines, Little Dorrit, The History Man, Lark Rise to Candleford, Alan Bleasdale's G.B.H. and as Dave Morris in McLibel!. He appeared in two of the Sharpe television films: Sharpe's Gold (1995) and Sharpe's Challenge (2006).",
        "birthday": "1956-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 27641,
        "imdb_id": "nm0198501",
        "known_for_department": "Acting",
        "name": "Peter-Hugo Daly",
        "place_of_birth": "Islington, London, England, UK",
        "popularity": 0.201,
        "profile_path": "/tUGdH72ziQCZh3Ke4ZdncJuQjGu.jpg"
    }
}