{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9xjUZjuYyehv2qnqMH0oR9nSTft.jpg",
                "genre_ids": [
                    80,
                    28,
                    18,
                    53
                ],
                "id": 9702,
                "original_language": "en",
                "original_title": "Bound by Honor",
                "overview": "Based on the true life experiences of poet Jimmy Santiago Baca, the film focuses on half-brothers Paco and Cruz, and their bi-racial cousin Miklo. It opens in 1972, as the three are members of an East L.A. gang known as the \"Vatos Locos\", and the story focuses on how a violent crime and the influence of narcotics alter their lives. Miklo is incarcerated and sent to San Quentin, where he makes a \"home\" for himself. Cruz becomes an exceptional artist, but a heroin addiction overcomes him with tragic results. Paco becomes a cop and an enemy to his \"carnal\", Miklo.",
                "popularity": 8.813,
                "poster_path": "/gvP6R6juhe2IpCG7QGDgjyUvm0g.jpg",
                "release_date": "1993-02-05",
                "title": "Bound by Honor",
                "video": false,
                "vote_average": 8.132,
                "vote_count": 1450,
                "character": "Red Ryder",
                "credit_id": "52fe451ec3a36847f80bd8db",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/qDVdTL1KqGmGLGsy7UPA3vksku7.jpg",
                "genre_ids": [
                    28,
                    12,
                    53
                ],
                "id": 9802,
                "original_language": "en",
                "original_title": "The Rock",
                "overview": "When vengeful General Francis X. Hummel seizes control of Alcatraz Island and threatens to launch missiles loaded with deadly chemical weapons into San Francisco, only a young FBI chemical weapons expert and notorious Federal prisoner have the skills to penetrate the impregnable island fortress and take him down.",
                "popularity": 7.9286,
                "poster_path": "/j5mxLNWjUlXUUk8weFBtnF4afIR.jpg",
                "release_date": "1996-06-07",
                "title": "The Rock",
                "video": false,
                "vote_average": 7.137,
                "vote_count": 4924,
                "character": "Alcatraz Park Ranger",
                "credit_id": "658ac296dd2589715b6c30fe",
                "order": 55
            },
            {
                "adult": false,
                "backdrop_path": "/m10uqk0HI5JcITAbxNJIIiGA8HP.jpg",
                "genre_ids": [
                    80,
                    18,
                    53
                ],
                "id": 968,
                "original_language": "en",
                "original_title": "Dog Day Afternoon",
                "overview": "Based on the true story of would-be Brooklyn bank robbers John Wojtowicz and Salvatore Naturile. Sonny and Sal attempt a bank heist which quickly turns sour and escalates into a hostage situation and stand-off with the police. As Sonny's motives for the robbery are slowly revealed and things become more complicated, the heist turns into a media circus.",
                "popularity": 4.1457,
                "poster_path": "/mavrhr0ig2aCRR8d48yaxtD5aMQ.jpg",
                "release_date": "1975-09-21",
                "title": "Dog Day Afternoon",
                "video": false,
                "vote_average": 7.847,
                "vote_count": 3141,
                "character": "Cop (uncredited)",
                "credit_id": "55f99fe1c3a3686782002eda",
                "order": 38
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia. Tom Towles (March 20, 1950 – April 2, 2015) was an American actor.\n\nTowles was born and raised in Chicago. He became an actor after a stint in the U.S. Marines, beginning with an uncredited performance in Dog Day Afternoon (1975). He has appeared in film and television extensively since the 1980s. He is probably best known for his turn in Henry: Portrait of a Serial Killer as a character modeled after Ottis Toole, Henry Lee Lucas' reputed accomplice in several murders. He has also appeared in Night of the Living Dead, The Rock, Blood in Blood Out, House of 1000 Corpses, and its sequel, The Devil's Rejects. Recently Tom also portrayed a vicious drug trafficking Aryan gang leader in the big screen adaptation of Miami Vice (he played a similar role as Aryan prison gang leader Red Rider in Blood In Blood Out) and had a cameo in one of the faux trailers Werewolf Women of the SS in Robert Rodriguez's Grindhouse. His television credits include appearances in NYPD Blue, L.A. Law, ER, Star Trek: Deep Space Nine (in the episode \"Dramatis Personae\"), Star Trek Voyager, and Firefly.\n\nTowles died on April 2, 2015, at the age of 65, in a hospital in Pinellas, Florida of complications following a stroke.\n\nDescription above from the Wikipedia article Tom Towles, licensed under CC-BY-SA, full list of contributors on Wikipedia.  ",
        "birthday": "1950-03-20",
        "deathday": "2015-04-02",
        "gender": 2,
        "homepage": null,
        "id": 27736,
        "imdb_id": "nm0869981",
        "known_for_department": "Acting",
        "name": "Tom Towles",
        "place_of_birth": "Chicago, Illinois, U.S.",
        "popularity": 0.4191,
        "profile_path": "/ekBEknY5CAjX8zXkSjGVkS3WcAN.jpg"
    }
}