{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8WIufsaJgm7VWgAc5ALWdJ8v2kB.jpg",
                "genre_ids": [
                    14,
                    27,
                    35
                ],
                "id": 766,
                "original_language": "en",
                "original_title": "Army of Darkness",
                "overview": "Ash, a handsome, shotgun-toting, chainsaw-armed department store clerk, is time warped backwards into England's Dark Ages, where he romances a beauty and faces legions of the undead.",
                "popularity": 4.8105,
                "poster_path": "/xsgTuAtR2zSH8Umg3jWZcZjlDpe.jpg",
                "release_date": "1992-10-31",
                "title": "Army of Darkness",
                "video": false,
                "vote_average": 7.255,
                "vote_count": 3335,
                "character": "Deadite Captain",
                "credit_id": "5d32ab8a6a300b5922af89e5",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "William \"Bill\" Moseley (born November 11, 1951) is an American film actor and musician who has starred in a number of cult classic horror films, including House of 1000 Corpses, Repo! The Genetic Opera and The Devil's Rejects. His first big role was in The Texas Chainsaw Massacre 2 as Chop Top. He has also released records with guitarist Buckethead, in the band Cornbugs.\n\nMoseley was born in Stamford, Connecticut, and grew up in Barrington Hills, Illinois. He is the son of Virginia Gillette (Kleitz), a journalist, and S. D. Moseley (Spencer Dumaresq Moseley), who was a member of the Yale Corporation, All-American captain and center of the 1942 Yale football team, and chairman and chief executive of the Railway Express Agency. His grandfather, George Moseley, also played football at Yale and was an All-American. He is a graduate of Yale University. For a period of time, Moseley operated as a journalist, writing for such magazines as Omni, National Lampoon and Psychology Today.",
        "birthday": "1951-11-11",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.choptopsbbq.com/",
        "id": 27737,
        "imdb_id": "nm0608405",
        "known_for_department": "Acting",
        "name": "Bill Moseley",
        "place_of_birth": "Stamford, Connecticut, USA",
        "popularity": 0.4413,
        "profile_path": "/l2ksJH5uUCIaeTuier6wXrURrnv.jpg"
    }
}