{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/oaRdRdqahtSvHK6VkOphVwGtPRN.jpg",
                "genre_ids": [
                    18
                ],
                "id": 221,
                "original_language": "en",
                "original_title": "Rebel Without a Cause",
                "overview": "After moving to a new town, troublemaking teen Jim Stark is supposed to have a clean slate, although being the new kid in town brings its own problems. While searching for some stability, Stark forms a bond with a disturbed classmate, Plato, and falls for local girl Judy. However, Judy is the girlfriend of neighborhood tough, Buzz. When Buzz violently confronts Jim and challenges him to a drag race, the new kid's real troubles begin.",
                "popularity": 4.9524,
                "poster_path": "/yHStsC8rRRfIjqRN38BQsLh6S7k.jpg",
                "release_date": "1955-10-27",
                "title": "Rebel Without a Cause",
                "video": false,
                "vote_average": 7.518,
                "vote_count": 1681,
                "character": "Buzz Gunderson",
                "credit_id": "52fe4228c3a36847f800878b",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Corey Allen earned a Bachelor of Fine Arts from UCLA in Theatre in 1954. While there, he received the department's Best Actor award and starred in the UCLA film, \"A Time Out of War\", which won the Academy Award & Cannes & Venice Film Festival for Best Short Film. Upon graduation, he appeared in approximately twenty plays in the Los Angeles area. Director Nicholas Ray spotted Allen and subsequently chose him for the role of \"Buzz\" in Rebel Without a Cause (1955). This led to featured roles in another dozen films such as Private Property (1960), Party Girl (1958), Darby's Rangers (1958) and The Chapman Report (1962). Allen also appeared in many leading television series including Perry Mason (1957) and Alfred Hitchcock Presents (1955). Meanwhile, he created, directed for and co-produced the Freeway Circuit Theatre which toured the Southwest for six seasons. Allen also directed numerous Equity productions in Los Angeles theatres. This led to a thirty year directorial career in television and film during which he directed three movies including Avalanche; television movies including the Emmy winning The Ann Jillian Story (1988); created a dozen pilots for television series including Star Trek: The Next Generation (1987), Murder, She Wrote (1984), Simon & Simon (1981), Code Name: Foxfire (1985), Stone (1979) and Capitol (1982). He has earned two Directors Guild nominations for Best Direction in a television series, the Award for Cable Excellence for Best Direction of The Paper Chase (1978) and received an Emmy for Best Direction of a Hill Street Blues (1981). Throughout this career, Allen instructed acting, including three years at the Actors Workshop, and for the last nine years, conducted cold reading workshops at the Margie Haber Studio. Allen was presented with an honorary Doctorate of Humane Letters from Columbia College-Hollywood for his work in helping to create their acting and directing curricula.",
        "birthday": "1934-06-29",
        "deathday": "2010-06-27",
        "gender": 2,
        "homepage": null,
        "id": 2775,
        "imdb_id": "nm0001904",
        "known_for_department": "Directing",
        "name": "Corey Allen",
        "place_of_birth": null,
        "popularity": 0.2011,
        "profile_path": "/tdZjPHg5DJsX3BJzWDQXwN4qWKv.jpg"
    }
}