{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/oaRdRdqahtSvHK6VkOphVwGtPRN.jpg",
                "genre_ids": [
                    18
                ],
                "id": 221,
                "original_language": "en",
                "original_title": "Rebel Without a Cause",
                "overview": "After moving to a new town, troublemaking teen Jim Stark is supposed to have a clean slate, although being the new kid in town brings its own problems. While searching for some stability, Stark forms a bond with a disturbed classmate, Plato, and falls for local girl Judy. However, Judy is the girlfriend of neighborhood tough, Buzz. When Buzz violently confronts Jim and challenges him to a drag race, the new kid's real troubles begin.",
                "popularity": 4.9524,
                "poster_path": "/yHStsC8rRRfIjqRN38BQsLh6S7k.jpg",
                "release_date": "1955-10-27",
                "title": "Rebel Without a Cause",
                "video": false,
                "vote_average": 7.518,
                "vote_count": 1681,
                "character": "Judy's Mother",
                "credit_id": "52fe4228c3a36847f8008793",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Rachael Elizabeth Hudson"
        ],
        "biography": "Rochelle Hudson (March 6, 1916 — January 17, 1972) was an American film actress from the 1930s through the 1960s. Hudson was a WAMPAS Baby Star in 1931.\n\nThe Oklahoma City-born actress began her career as a teenager. She had signed a contract with RKO Pictures on November 22, 1930, when she was 17 years old.\n\nShe may be best remembered today for costarring in Wild Boys of the Road (1933), playing Cosette in Les Misérables (1935), playing Mary Blair, the older sister of Shirley Temple's character in Curly Top, and for playing Natalie Wood's mother in Rebel Without a Cause (1955). During her peak years in the 1930s, notable roles for Hudson included: Richard Cromwell's love interest in the Will Rogers showcase Life Begins at 40 (1935), the daughter of carnival barker W. C. Fields in Poppy (1936) and Claudette Colbert's adult daughter in Imitation of Life (1934).\n\nShe played Sally Glynn, the fallen ingenue to whom Mae West imparts the immortal wisdom, \"When a girl goes wrong, men go right after her!\" in the 1933 Paramount film, She Done Him Wrong. In the 1954–1955 television season, Hudson co-starred with Gil Stratton and Eddie Mayehoff in the CBS situation comedy That's My Boy, based on a 1951 Jerry Lewis and Dean Martin film of the same name.",
        "birthday": "1916-03-06",
        "deathday": "1972-01-17",
        "gender": 1,
        "homepage": null,
        "id": 2777,
        "imdb_id": "nm0399955",
        "known_for_department": "Acting",
        "name": "Rochelle Hudson",
        "place_of_birth": "Oklahoma City, Oklahoma, USA",
        "popularity": 0.1843,
        "profile_path": "/2Mi0CBL9pvzLnCBTnfekH0JizcM.jpg"
    }
}