{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/n2eUT4zQA2yYcKOgAFidgOyiFoH.jpg",
                "genre_ids": [
                    18,
                    37
                ],
                "id": 68718,
                "original_language": "en",
                "original_title": "Django Unchained",
                "overview": "With the help of a German bounty hunter, a freed slave sets out to rescue his wife from a brutal Mississippi plantation owner.",
                "popularity": 12.4836,
                "poster_path": "/7oWY8VDWW7thTzWh3OKYRkWUlD5.jpg",
                "release_date": "2012-12-25",
                "title": "Django Unchained",
                "video": false,
                "vote_average": 8.184,
                "vote_count": 27058,
                "character": "Leonide Moguy",
                "credit_id": "52fe479fc3a368484e0d1315",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/3RFmTz5h2UuFWEV4oH00XICBR9y.jpg",
                "genre_ids": [
                    18,
                    53,
                    80
                ],
                "id": 146233,
                "original_language": "en",
                "original_title": "Prisoners",
                "overview": "Keller Dover is facing every parent’s worst nightmare. His six-year-old daughter, Anna, is missing, together with her young friend, Joy, and as minutes turn to hours, panic sets in. The only lead is a dilapidated RV that had earlier been parked on their street.",
                "popularity": 16.2141,
                "poster_path": "/jsS3a3ep2KyBVmmiwaz3LvK49b1.jpg",
                "release_date": "2013-09-19",
                "title": "Prisoners",
                "video": false,
                "vote_average": 8.099,
                "vote_count": 12426,
                "character": "Mr. Jones (uncredited)",
                "credit_id": "65b4ccceb1131f013028a8d9",
                "order": 34
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Dennis Carrelli ",
            "Dennis Christopher"
        ],
        "biography": "Dennis Christopher (born Dennis Carrelli on December 2, 1955) is an American actor. He was born in Philadelphia, Pennsylvania. He is known for playing Dave Stoller in Breaking Away and tragic film buff psychopath Eric Binford in Fade to Black.\n\nHis Golden Globe-nominated breakthrough role was as Dave Stohler in the coming-of-age classic Breaking Away (1979). Other roles include American track star Charlie Paddock in Chariots of Fire, and Fade to Black, science fiction movies like Plughead Rewired: Circuitry Man II. He has appeared in nearly 40 movies and made-for-TV movies since 1975. Television roles include \"Jack of All Trades\" in the Profiler TV series, Eddie Kaspbrak in Stephen King's It, Desmond Floyd in Jake Speed, and in the HBO series Deadwood.\n\nChristopher has guest starred in two Star Trek episodes: the Star Trek: Deep Space Nine episode \"The Search (Part II)\" and the Star Trek: Enterprise episode \"Detained\". He also guest-starred as the demon-sorcerer Cyvus Vail in three episodes of Angel. Christopher had a reunion with Breaking Away \"father\" Paul Dooley, again as his son, in an episode of TV's Law & Order: Criminal Intent. The two had first played father and son in Robert Altman's A Wedding.\n\nIn December 2006 he played Dr. Martin Ruber in the Sci Fi Channel miniseries The Lost Room.",
        "birthday": "1950-12-02",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 27770,
        "imdb_id": "nm0160550",
        "known_for_department": "Acting",
        "name": "Dennis Christopher",
        "place_of_birth": "Philadelphia, Pennsylvania, USA",
        "popularity": 0.7374,
        "profile_path": "/bZMnSpQ6KEBuwUfnngNEpmqhEK.jpg"
    }
}