{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/oaRdRdqahtSvHK6VkOphVwGtPRN.jpg",
                "genre_ids": [
                    18
                ],
                "id": 221,
                "original_language": "en",
                "original_title": "Rebel Without a Cause",
                "overview": "After moving to a new town, troublemaking teen Jim Stark is supposed to have a clean slate, although being the new kid in town brings its own problems. While searching for some stability, Stark forms a bond with a disturbed classmate, Plato, and falls for local girl Judy. However, Judy is the girlfriend of neighborhood tough, Buzz. When Buzz violently confronts Jim and challenges him to a drag race, the new kid's real troubles begin.",
                "popularity": 4.9524,
                "poster_path": "/yHStsC8rRRfIjqRN38BQsLh6S7k.jpg",
                "release_date": "1955-10-27",
                "title": "Rebel Without a Cause",
                "video": false,
                "vote_average": 7.518,
                "vote_count": 1681,
                "character": "Chick",
                "credit_id": "52fe4228c3a36847f80087bb",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "ニック・アダムス",
            "Mykola Adamščuk",
            "نیک آدامز"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nNick Adams (July 10, 1931 – February 7, 1968) was an American film and television actor. He has been noted for his supporting roles in successful Hollywood films during the 1950s and 1960s along with his starring role in the ABC television series The Rebel (1959). Decades after Adams' death from a prescription drug overdose at the age of 36, his widely publicized friendships with James Dean and Elvis Presley would stir speculation about both his private life and the circumstances of his death. In an Allmovie synopsis for Adams' last film, reviewer Dan Pavlides wrote, \"Plagued by personal excesses, he will be remembered just as much for what he could have done in cinema as what he left behind.\"\n\nDescription above from the Wikipedia article Nick Adams (actor), licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1931-07-10",
        "deathday": "1968-02-07",
        "gender": 2,
        "homepage": null,
        "id": 2787,
        "imdb_id": "nm0011244",
        "known_for_department": "Acting",
        "name": "Nick Adams",
        "place_of_birth": "Nanticoke, Pennsylvania, U.S.",
        "popularity": 0.4372,
        "profile_path": "/yrXQ3DlthU5vks3L7Wan2r39AHF.jpg"
    }
}