{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sZhTfYouKM1iV3rVbgIVEQFQogA.jpg",
                "genre_ids": [
                    35,
                    10751,
                    14
                ],
                "id": 2758,
                "original_language": "en",
                "original_title": "Addams Family Values",
                "overview": "Siblings Wednesday and Pugsley Addams will stop at nothing to get rid of Pubert, the new baby boy adored by parents Gomez and Morticia. Things go from bad to worse when the new \"black widow\" nanny, Debbie Jellinsky, launches her plan to add Fester to her collection of dead husbands.",
                "popularity": 8.6906,
                "poster_path": "/sdxT2VjVSx9DRicwnuECUdBHeE7.jpg",
                "release_date": "1993-11-19",
                "title": "Addams Family Values",
                "video": false,
                "vote_average": 6.969,
                "vote_count": 3167,
                "character": "Gomez Addams",
                "credit_id": "52fe436ac3a36847f8052a21",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/7OxGhxUYAdtuike29VMzEFxJx7y.jpg",
                "genre_ids": [
                    35,
                    14
                ],
                "id": 2907,
                "original_language": "en",
                "original_title": "The Addams Family",
                "overview": "When a man claiming to be long-lost Uncle Fester reappears after 25 years lost, the family plans a celebration to wake the dead. But the kids barely have time to warm up the electric chair before Morticia begins to suspect Fester is fraud when he can't recall any of the details of Fester's life.",
                "popularity": 11.7062,
                "poster_path": "/qFf8anju5f2epI0my8RdwwIXFIP.jpg",
                "release_date": "1991-11-22",
                "title": "The Addams Family",
                "video": false,
                "vote_average": 7.066,
                "vote_count": 4816,
                "character": "Gomez Addams",
                "credit_id": "52fe4374c3a36847f80554c7",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Raul Julia"
        ],
        "biography": "Raúl Rafael Juliá y Arcelay (March 9, 1940 – October 24, 1994) was a Puerto Rican actor. His film career peaked in the US in the early 1990s.\n\nBorn in San Juan, he gained interest in acting while still in school. Upon completing his studies, Juliá decided to pursue a career in acting. After performing in the local scene for some time, he was convinced by entertainment personality Orson Bean to move and work in New York City. Juliá, who had been bilingual since his childhood, soon gained interest in Broadway and \"Off Broadway\" plays. He performed in mobile projects, including the Puerto Rican Traveling Theatre.\n\nJuliá was eventually noticed by Joseph Papp, who offered him work in the New York Shakespeare Festival. After gaining notoriety, he received roles in two television series, Love of Life and Sesame Street. For his performance in Two Gentlemen of Verona, he received a nomination for the Tony Award and won a Drama Desk Award. Between 1974 and 1982, Juliá received Tony Award nominations for Where's Charley?, The Threepenny Opera and Nine. During the 1980s, he worked in several films, receiving nominations for the Golden Globe Awards, for his performance in Tempest, and Kiss of the Spider Woman, winning the National Board of Review Award for Best Actor for the latter.\n\nIn 1991 and 1993, Juliá portrayed \"Gomez Addams\" in two film adaptations of The Addams Family. In 1994, he filmed The Burning Season and a film adaptation of the Street Fighter video games. Later that year, Juliá suffered several health afflictions, eventually dying after suffering a stroke. His funeral was held in Puerto Rico, being attended by thousands. For his work in The Burning Season, Juliá won a posthumous Golden Globe and Emmy Award.",
        "birthday": "1940-03-09",
        "deathday": "1994-10-24",
        "gender": 2,
        "homepage": null,
        "id": 27888,
        "imdb_id": "nm0000471",
        "known_for_department": "Acting",
        "name": "Raúl Juliá",
        "place_of_birth": "San Juan, Puerto Rico",
        "popularity": 0.7622,
        "profile_path": "/zRvv5vdqCxdio38gx0WWmof4cO5.jpg"
    }
}