{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/pZVrDhIPF30JTRSkal2Lfk7NwrI.jpg",
                "genre_ids": [
                    18,
                    27,
                    53
                ],
                "id": 31417,
                "original_language": "fr",
                "original_title": "Les Yeux sans visage",
                "overview": "Dr. Génessier is riddled with guilt after an accident that he caused disfigures the face of his daughter, the once beautiful Christiane, who outsiders believe is dead. Dr. Génessier, along with accomplice and laboratory assistant Louise, kidnaps young women and brings them to the Génessier mansion. After rendering his victims unconscious, Dr. Génessier removes their faces and attempts to graft them on to Christiane's.",
                "popularity": 1.6113,
                "poster_path": "/8y7Z9Gvcq52uOlJlUWyn2epGGRd.jpg",
                "release_date": "1960-01-11",
                "title": "Eyes Without a Face",
                "video": false,
                "vote_average": 7.573,
                "vote_count": 764,
                "character": "Christiane Génessier",
                "credit_id": "52fe447c9251416c9101263b",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/dCuwNZp2DLOWr8qV0GDBHINhVZM.jpg",
                "genre_ids": [
                    18,
                    14
                ],
                "id": 103328,
                "original_language": "fr",
                "original_title": "Holy Motors",
                "overview": "We follow 24 hours in the life of a being moving from life to life like a cold and solitary assassin moving from hit to hit. In each of these interwoven lives, the being possesses an entirely distinct identity: sometimes a man, sometimes a woman, sometimes youthful, sometimes old. By turns murderer, beggar, company chairman, monstrous creature, worker, family man.",
                "popularity": 1.7743,
                "poster_path": "/4ZuTrrDQhCS9f6KzIX6HfsjjyMd.jpg",
                "release_date": "2012-07-02",
                "title": "Holy Motors",
                "video": false,
                "vote_average": 6.991,
                "vote_count": 1199,
                "character": "Céline",
                "credit_id": "52fe4a1cc3a36847f81ba1db",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/oxcaIxASeu57f6VSn8awiXz6yZS.jpg",
                "genre_ids": [
                    35,
                    10749,
                    14
                ],
                "id": 570131,
                "original_language": "fr",
                "original_title": "Mon Inconnue",
                "overview": "A man tries to make his wife fall in love with him again, after waking up in an alternate reality where she never knew him.",
                "popularity": 3.352,
                "poster_path": "/11CkMVD0dPjhAZPaf0u9VfS46lw.jpg",
                "release_date": "2019-01-18",
                "title": "Love at Second Sight",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 836,
                "character": "Gabrielle, the grandmother",
                "credit_id": "5c1ea09dc3a368700ee99eca",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Édith Scob",
            "Édith Scobeltzine",
            "エディット・スコブ"
        ],
        "biography": "Édith Scob (21 October 1937 – 26 June 2019) was a French film and theatre actress, best known for her role as the daughter with a disfigured face in Eyes Without a Face (1960).\n\nScob was born Édith Helena Vladimirovna Scobeltzine, the granddaughter of a Russian Army general and White Russian émigré. Her father was an architect and her mother a journalist. Her elder brother, Michel Scob (1935–1995), was a French cycling champion and Olympian. At age 14, she underwent treatment for anorexia. Her love of literature inspired an interest in theatre. Scob was studying French at the Sorbonne and taking drama classes when she was cast in her first role.\n\nShe and her husband, composer Georges Aperghis, have two sons, Alexander (born 1970) and Jerome (born 1972), both writers.\n\nScob died in Paris on June 26th, 2019. No cause of death was given.\n\nScob made her debut in theater in 1958 with the play Don Juan directed by Georges Vitaly but she gained a high profile early in her career when she appeared in Eyes Without a Face (1960). She was twice nominated for the César Award for Best Supporting Actress for Summer Hours (2008) and Holy Motors (2012).\n\nFollowing the civil unrest in France of May 1968, Scob founded an avant-garde theatre in Bagnolet with her husband, composer Georges Aperghis, with the goal of introducing more culture to the most disadvantaged people.\n\nSource: Article \"Édith Scob\" from Wikipedia in English, licensed under CC-BY-SA.",
        "birthday": "1937-10-21",
        "deathday": "2019-06-26",
        "gender": 1,
        "homepage": null,
        "id": 27980,
        "imdb_id": "nm0778568",
        "known_for_department": "Acting",
        "name": "Édith Scob",
        "place_of_birth": "Paris, France",
        "popularity": 0.2903,
        "profile_path": "/xYrBRlexvVoYZQApDESnTrAEq7U.jpg"
    }
}