{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xxBV7ZyywpBBEdQbuen7Rp3RIIp.jpg",
                "genre_ids": [
                    878,
                    35,
                    27
                ],
                "id": 1694,
                "original_language": "en",
                "original_title": "Re-Animator",
                "overview": "Conducting clandestine experiments within the morgue at Miskatonic University, scientist Herbert West reveals to a fellow graduate student his groundbreaking work concerning the re-animation of fresh corpses.",
                "popularity": 3.3593,
                "poster_path": "/1hY6AUl92cL9GdZx031UWFiGETt.jpg",
                "release_date": "1985-10-18",
                "title": "Re-Animator",
                "video": false,
                "vote_average": 7.05,
                "vote_count": 1575,
                "character": "Dan Cain",
                "credit_id": "52fe430dc3a36847f8036c2b",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "بروس ابوت"
        ],
        "biography": "Bruce Paul Abbott (born July 28, 1954) is an American actor. He has appeared in movies such as Re-Animator, Bad Dreams, The Prophecy II, Out of Time, and Bride of Re-Animator, and the TV series Dark Justice.\n\nAbbott's career began as a dancer/actor in the Oregon Shakespeare Festival in Ashland, Oregon, where he spent three seasons in the late 1970s. In 1980, Abbott relocated from Portland to Hollywood (\"in the middle of the actors' strike, and I didn't know Anyone,\" he recalls). Shortly afterwards, he was cast as the villain in the movie Tag: The Assassination Game. He met his future (first) wife, Linda Hamilton on the set. The union produced one child, Dalton Bruce (born October 4, 1989) (who can be seen in Terminator II as \"Infant John Connor\").\n\nBruce and Linda divorced circa 1989. That same year, on the Dallas, Texas, set of the TV movie Trapped, Abbott met actress Kathleen Quinlan. They married April 12, 1994 and have 1 son, Tyler Quinlan (born October 17, 1990).\n\nThroughout his career, Abbott has been a guest star on many TV series Murder She Wrote, Family Law, Diagnosis: Murder, and more. He had a recurring role in the short-lived series The Net, based on the film of the same title starring Sandra Bullock.\n\nAbbott is semi-retired from acting. He is an architect and artist and works in the custom-design industry. He has designed his last two homes.\n\nFrom Wikipedia, the free encyclopedia",
        "birthday": "1954-07-28",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 27994,
        "imdb_id": "nm0007940",
        "known_for_department": "Acting",
        "name": "Bruce Abbott",
        "place_of_birth": "Portland, Oregon, U.S.",
        "popularity": 1.0647,
        "profile_path": "/9a2ve1mVCCEeO9GTR55UlC566wD.jpg"
    }
}