{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xxBV7ZyywpBBEdQbuen7Rp3RIIp.jpg",
                "genre_ids": [
                    878,
                    35,
                    27
                ],
                "id": 1694,
                "original_language": "en",
                "original_title": "Re-Animator",
                "overview": "Conducting clandestine experiments within the morgue at Miskatonic University, scientist Herbert West reveals to a fellow graduate student his groundbreaking work concerning the re-animation of fresh corpses.",
                "popularity": 3.3593,
                "poster_path": "/1hY6AUl92cL9GdZx031UWFiGETt.jpg",
                "release_date": "1985-10-18",
                "title": "Re-Animator",
                "video": false,
                "vote_average": 7.05,
                "vote_count": 1575,
                "character": "Herbert West",
                "credit_id": "52fe430dc3a36847f8036c27",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/2aGtsMLVOiBiAUwQmCqYgau5AJF.jpg",
                "genre_ids": [
                    27,
                    35
                ],
                "id": 10779,
                "original_language": "en",
                "original_title": "The Frighteners",
                "overview": "Once an architect, Frank Bannister now passes himself off as an exorcist of evil spirits. To bolster his facade, he claims his \"special\" gift is the result of a car accident that killed his wife. But what he does not count on is more people dying in the small town where he lives. As he tries to piece together the supernatural mystery of these killings, he falls in love with the wife of one of the victims and deals with a crazy FBI agent.",
                "popularity": 3.0131,
                "poster_path": "/zcJbCMwFLJdn5OLjhYwMVaSB32R.jpg",
                "release_date": "1996-07-18",
                "title": "The Frighteners",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 1618,
                "character": "Milton Dammers",
                "credit_id": "52fe43b59251416c7501b167",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jeff Combs",
            "Jeffrey Alan Combs",
            "Jeffery Combs",
            "傑佛瑞·可姆斯"
        ],
        "biography": "Jeffrey Combs (born September 9, 1954) is an American actor highly regarded for his numerous roles in the Star Trek franchise, especially in Star Trek: Deep Space Nine (DS9). He played multiple characters in DS9, including the Vorta clone Weyoun, which was his most significant and favorite role, and the Ferengi character Brunt. Combs uniquely appeared as both characters in the same episode, \"The Dogs of War,\" becoming one of the few actors to play two different characters in one DS9 episode. Beyond DS9, he also appeared in Star Trek: Enterprise as the Andorian commander Shran, in Star Trek: Voyager, and in Star Trek: Lower Decks with voice roles.  He also made television appearances in series like The 4400 and Babylon 5.  He gained cult status for his role as Herbert West in the horror film Re-Animator (1985) and its two sequels. He has appeared in numerous adaptations of H.P. Lovecraft’s works, including From Beyond (1986) and Necronomicon: Book of the Dead (1993). His other film credits include House on Haunted Hill (1999), The Frighteners (1996), I Still Know What You Did Last Summer (1998), and FeardotCom (2002). In addition to on-screen roles, Combs has lent his voice to characters in animated series such as Justice League Unlimited and Transformers: Prime.",
        "birthday": "1954-09-09",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 27993,
        "imdb_id": "nm0001062",
        "known_for_department": "Acting",
        "name": "Jeffrey Combs",
        "place_of_birth": "Oxnard, California, USA",
        "popularity": 0.7704,
        "profile_path": "/dfWcxKNsyGuN18GjWkbOmMhO4c9.jpg"
    }
}