{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6yrbWzzrPp7pwz6zHdifspJk8t3.jpg",
                "genre_ids": [
                    878,
                    18
                ],
                "id": 1398,
                "original_language": "ru",
                "original_title": "Сталкер",
                "overview": "Near a gray and unnamed city is the Zone, a place guarded by barbed wire and soldiers, and where the normal laws of physics are victim to frequent anomalies. A stalker guides two men into the Zone, specifically to an area in which deep-seated desires are granted.",
                "popularity": 3.8876,
                "poster_path": "/1qhOyf5C4s9ZdvY8d5JDx9DFMeT.jpg",
                "release_date": "1979-05-25",
                "title": "Stalker",
                "video": false,
                "vote_average": 8.1,
                "vote_count": 2350,
                "character": "Stalker",
                "credit_id": "52fe42f3c3a36847f802f15f",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Александр Кайдановский",
            "Aleksandr Kaydanovsky",
            "Aleksandr Kajdanovsky",
            "Кайдановский Александр Леонидович",
            "Alexander Kaidanovsky"
        ],
        "biography": "Aleksandr Kaydanovskiy (23 July 1946 — 2 December 1995) was a Soviet actor and film director. His best known roles are in films such as Stalker, At Home Among Strangers, and The Bodyguard.\n\nPrior to pursuing an acting career, Kaydanovskiy attended technical college where he trained to become a welder. In 1965 he started studying acting at The Rostov Theatre School and the Shchukin theatrical school in Moscow. Before completing the course he took his first part in the film The Mysterious Wall and upon graduation in 1969, he worked as stage actor, making his debut at the Vakhtangov Theatre in 1969. In 1971, he was invited to join the prestigious Moscow Arts Theatre, a rare privilege for a 25-year-old graduate.\n\nHe made his major film debut in At Home Among Strangers, and over the next few years appeared in some two dozen films, including the satirical comedy Diamonds for Dictatorship of the Proletariat and The Life of Beethoven. At his peak in the '70s Kaidanovsky was among the USSR’s most popular actors, and it was at this point that famed Soviet director Andrei Tarkovsky, impressed by the looks and the acting technique of Kaidanovsky in Diamonds, invited him to play the title role in his new film, Stalker. The role earned Kaydanovskiy international acclaim.\n\nIn 1985 he directed A Simple Death, which was screened in the Un Certain Regard section at the 1987 Cannes Film Festival. In 1993 he directed Just Death, which was about the death of Leo Tolstoy.",
        "birthday": "1946-07-23",
        "deathday": "1995-12-03",
        "gender": 2,
        "homepage": null,
        "id": 28078,
        "imdb_id": "nm0435289",
        "known_for_department": "Acting",
        "name": "Aleksandr Kaydanovskiy",
        "place_of_birth": "Rostov-na-Donu, Rostovskaya oblast, RSFSR, USSR",
        "popularity": 0.3305,
        "profile_path": "/yHYfkxQu3GVKxx5ibFmEom8qAS6.jpg"
    }
}