{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/r2IOBOeg5wLfLtyOnT5Pur6Tl4q.jpg",
                "genre_ids": [
                    12,
                    28,
                    878
                ],
                "id": 1892,
                "original_language": "en",
                "original_title": "Return of the Jedi",
                "overview": "Luke Skywalker leads a mission to rescue his friend Han Solo from the clutches of Jabba the Hutt, while the Emperor seeks to destroy the Rebellion once and for all with a second dreaded Death Star.",
                "popularity": 8.3835,
                "poster_path": "/jQYlydvHm3kUix1f8prMucrplhm.jpg",
                "release_date": "1983-05-25",
                "title": "Return of the Jedi",
                "video": false,
                "vote_average": 7.905,
                "vote_count": 16311,
                "character": "Anakin Skywalker",
                "credit_id": "52fe431ec3a36847f803bc37",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Sebastian Lewis Shaw"
        ],
        "biography": "Sebastian Lewis Shaw was an English actor, director, novelist, playwright and poet. During his 65-year career, he appeared in dozens of stage performances and more than 40 film and television productions. Shaw was born and brought up in Holt, Norfolk, and made his acting debut at age eight at a London theatre. He studied acting at Gresham's School and the Royal Academy of Dramatic Art. Although he worked primarily on the London stage, he made his Broadway debut in 1929, when he played one of the two murderers in Rope's End. He appeared in his first film, Caste, in 1930 and quickly began to create a name for himself in films. He described himself as a \"rotten actor\" as a youth and said his success was primarily due to his good looks. He claimed to mature as a performer only after returning from service in the Royal Air Force during World War II. Shaw was particularly known for his performances in productions of Shakespeare plays which were considered daring and ahead of their time. In 1966, he joined the Royal Shakespeare Company, where he remained for a decade and delivered some of his most acclaimed performances. He also wrote several poems and a novel, The Christening, in 1975.",
        "birthday": "1905-05-29",
        "deathday": "1994-12-23",
        "gender": 2,
        "homepage": null,
        "id": 28235,
        "imdb_id": "nm0789970",
        "known_for_department": "Acting",
        "name": "Sebastian Shaw",
        "place_of_birth": "Holt, Norfolk, England, UK",
        "popularity": 0.1624,
        "profile_path": null
    }
}