{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/44e7qs704rSWWGFMhGtPhAvyT8O.jpg",
                "genre_ids": [
                    35,
                    18,
                    9648,
                    53
                ],
                "id": 121875,
                "original_language": "fr",
                "original_title": "Dans la maison",
                "overview": "A sixteen-year-old boy insinuates himself into the house of a fellow student from his literature class and writes about it in essays for his French teacher. Faced with this gifted and unusual pupil, the teacher rediscovers his enthusiasm for his work, but the boy’s intrusion will unleash a series of uncontrollable events.",
                "popularity": 2.7088,
                "poster_path": "/6NCBSCCcyef9aNcABsVGZwuehSC.jpg",
                "release_date": "2012-09-26",
                "title": "In the House",
                "video": false,
                "vote_average": 7.246,
                "vote_count": 877,
                "character": "Germain",
                "credit_id": "52fe4a70c3a368484e15333d",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Robert Luchini",
            "Fabrice Lucchini",
            "Фабрис Лукини",
            "فابریس لوکینی"
        ],
        "biography": "Fabrice Luchini was born in Île-de-France, Paris, into an Italian immigrant family, who were fruit and vegetable vendors. He grew up around the neighbourhood of Goutte d'Or in Paris's 18th arrondissement. When he was 13, his mother apprenticed him to a hairdresser in a trendy parlor on Avenue Matignon, where he would take the name of the hairdresser's son, Fabrice, in place of his real name, Robert. At the same time he developed a great interest for literature (Balzac, Flaubert, Proust). His passion for soul music (James Brown) made him a regular of discothèques. This is where he met Philippe Labro, who gave him his first role in Tout peut arriver in 1969. He then studied acting under Jean-Laurent Cochet. However, it was his collaboration with Éric Rohmer that would make him popular for Le Genou de Claire in 1970, in which he played a small role as an adolescent. He appeared in Rohmer's Perceval le Gallois, and Les Nuits de la pleine lune, and in films directed by Nagisa Oshima, Pierre Zucca, Claude Lelouch, Cedric Klapisch, Édouard Molinaro.\n\nThanks to Jean-Laurent Cochet, he later discovered theater, his true passion, which he described as \"the only place where life is expressed... something that no school will ever teach\". However, it was his role in La Discrète, directed by Christian Vincent in 1990, that made him well-known to the general public. He divides his work between cinema and theater, where since 1980 he has had considerable success with readings from the texts of La Fontaine, Nietzsche, Céline's Voyage au bout de la nuit, Paul Valéry and Roland Barthes.\n\nDescription above from the Wikipedia article Fabrice Luchini, licensed under CC-BY-SA, full list of contributors on Wikipedia​",
        "birthday": "1951-11-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 28255,
        "imdb_id": "nm0524528",
        "known_for_department": "Acting",
        "name": "Fabrice Luchini",
        "place_of_birth": "Paris, France",
        "popularity": 0.3069,
        "profile_path": "/krR5EUfM13UJwsB07ffzPU7FXYR.jpg"
    }
}