{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/y5ebTEBtpLn8PprGTWQhDfq33k8.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 42229,
                "original_language": "it",
                "original_title": "Una giornata particolare",
                "overview": "Two neighbours — a persecuted journalist and a resigned housewife — forge a strong bond on the day of Adolf Hitler's historic 1938 visit to Rome.",
                "popularity": 2.153,
                "poster_path": "/jzRn7N1mFowkQ5IkUkfWoxXJtYU.jpg",
                "release_date": "1977-08-11",
                "title": "A Special Day",
                "video": false,
                "vote_average": 8.056,
                "vote_count": 717,
                "character": "Maria Luisa Taberi",
                "credit_id": "61d62de89b86160093b03cc0",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Alessandra Mussolini (born 30 December 1962) is an Italian former politician, the granddaughter of Benito Mussolini, and a former actress and model who served as a Member of the European Parliament for Forza Italia. She was a member of the Chamber of Deputies from 2008 to 2013 and the Italian Senate from 2013 to 2014, she was elected under The People of Freedom which is now part of Forza Italia. She was elected to the European Parliament in 2014.\n\nShe was the founder and leader of the national conservative political party Social Action; from 2004 until 2008, Mussolini also served as a Member of the European Parliament, and she has been a member of the Chamber of Deputies, the lower house of the Italian Parliament, for The People of Freedom.\n\nMussolini was taken under the wing of her aunt Sophia Loren for a while and started a career as an actress in the Italian film industry during the 1970s. A Special Day (1977), in which she had a minor role as \"Maria Luisa,\" won an American Golden Globe Award for Best Foreign Language Film and was nominated for an Academy Award for Best Foreign Language Film.\n\nDuring 1982, Mussolini released a pop music album of romantic songs under the title Amore on Alfa Records; the album was released only in Japan and has since become something of a collectors item.\n\nMussolini also appeared as a glamour model, including on the cover of two European editions of Playboy, in Italy (August 1983) and Germany (November 1983). \"When you are an actress, you are dealing with the body. Every actress does topless and stuff like this; you have to,\" she has said.\n\nMussolini continued as an actress into the 1980s. Some of the films she featured in were made for Italian television. However, she still acted in standard cinematic films, such as The Assisi Underground in which she played a nun; the movie focused on the Roman Catholic Church rescuing Italian Jews from the Nazis in 1943. She starred in her final film in 1990 and then left the film industry to continue studying after a producer asked her to change her name.\n\nDescription above from the Wikipedia article Alessandra Mussolini, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1962-12-30",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.alessandramussolini.it/",
        "id": 28258,
        "imdb_id": "nm0615905",
        "known_for_department": "Acting",
        "name": "Alessandra Mussolini",
        "place_of_birth": "Rome, Lazio, Italy",
        "popularity": 0.0903,
        "profile_path": "/vXM9UMlAdffrBLENL2utts0a2BV.jpg"
    }
}