{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/p2U4wScUValTXnvikXy7kfQNDsH.jpg",
                "genre_ids": [
                    18,
                    9648,
                    53
                ],
                "id": 891,
                "original_language": "en",
                "original_title": "All the President's Men",
                "overview": "During the 1972 elections, two reporters' investigation sheds light on the controversial Watergate scandal that compels President Nixon to resign from his post.",
                "popularity": 9.3472,
                "poster_path": "/qwdcIdiTAk8iANsJEK2JmrYQx5o.jpg",
                "release_date": "1976-04-09",
                "title": "All the President's Men",
                "video": false,
                "vote_average": 7.656,
                "vote_count": 1926,
                "character": "Self (archive footage) (uncredited)",
                "credit_id": "63a057658ddc3414c4424961",
                "order": 95
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "\tSpiro Theodore Agnew"
        ],
        "biography": "Spiro Theodore Agnew (November 9, 1918 – September 17, 1996) was the 39th vice president of the United States, serving from 1969 until his resignation in 1973. He is the second of two vice presidents to resign the position, the first being John C. Calhoun in 1832.\n\nAgnew was born in Baltimore to a Greek immigrant father and an American mother. He attended Johns Hopkins University and graduated from the University of Baltimore School of Law. He was a campaign aide for U.S. Representative James Devereux in the 1950s, and was appointed to the Baltimore County Board of Zoning Appeals in 1957. In 1962, he was elected Baltimore county executive. In 1966, Agnew was elected governor of Maryland, defeating his Democratic opponent George P. Mahoney and independent candidate Hyman A. Pressman.\n\nAt the 1968 Republican National Convention, Richard Nixon asked Agnew to place his name in nomination, and named him as running mate. Agnew's centrist reputation interested Nixon; the law and order stance he had taken in the wake of civil unrest that year appealed to aides such as Pat Buchanan. Agnew made a number of gaffes during the campaign, but his rhetoric pleased many Republicans, and he may have made the difference in several key states. Nixon and Agnew defeated the Democratic ticket of incumbent vice president Hubert Humphrey and his running mate, Senator Edmund Muskie, and American Independent Party candidates George Wallace and Curtis LeMay. As vice president, Agnew was often called upon to attack the administration's enemies. In the years of his vice presidency, Agnew moved to the right, appealing to conservatives who were suspicious of moderate stances taken by Nixon. In the presidential election of 1972, Nixon and Agnew were re-elected for a second term, defeating Senator George McGovern and his running mate Sargent Shriver in one of the largest landslides in American history.",
        "birthday": "1918-11-09",
        "deathday": "1996-09-17",
        "gender": 2,
        "homepage": null,
        "id": 2829168,
        "imdb_id": "nm0013152",
        "known_for_department": "Acting",
        "name": "Spiro Agnew",
        "place_of_birth": "Baltimore, Maryland, USA",
        "popularity": 0.0698,
        "profile_path": "/lI9DmU8qkVRtuRLvVQJYMoCrCqx.jpg"
    }
}