{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rjXK74vrvmFMN0vuFw3TViZ18Ha.jpg",
                "genre_ids": [
                    16,
                    10749,
                    12,
                    18,
                    14
                ],
                "id": 204436,
                "original_language": "fr",
                "original_title": "Jack et la mécanique du cœur",
                "overview": "In Scotland 1874, Jack is born on the coldest day ever. Because of the extreme cold, his heart stops beating. The responsible midwife in Edinburgh finds a way to save him by replacing his heart with a clock. So he lives and remains under the midwife's protective care. But he must not get angry or excited because that endangers his life by causing his clock to stop working. Worse than that, when he grows up, he has to face the fact he cannot fall in love because that too could stop his delicate heart.",
                "popularity": 2.3296,
                "poster_path": "/ZSrU2mvlzM5Jr30XtKCU1fziIj.jpg",
                "release_date": "2014-02-05",
                "title": "Jack and the Cuckoo-Clock Heart",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 738,
                "character": "Jack l'éventreur (voice)",
                "credit_id": "59f47eed9251414d57011696",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Alain Claude Baschung"
        ],
        "biography": "Alain Bashung (born Alain Claude Baschung; 1 December 1947 – 14 March 2009) was a French singer, songwriter and actor. Credited with reviving the French chanson in \"a time of French musical turmoil\", he is often regarded in his home country as the most important French rock musician after Serge Gainsbourg. He rose to prominence in the early 1980s with hit songs such as \"Gaby oh Gaby\" and \"Vertige de l'amour\", and later had a string of hit records from the 1990s onward, such as \"Osez Joséphine\", \"Ma petite entreprise\" and \"La nuit je mens\". He has had an influence on many later French artists, and is the most awarded artist in the Victoires de la Musique history with 12 victories obtained throughout his career.\n\nBashung's Play blessures (1982), Osez Joséphine (1991), and Fantaisie militaire (1998) have made multiple French lists of the greatest albums. L'Imprudence (2002) and Bleu pétrole (2008), the last two studio albums released during his lifetime, also garnered acclaim. Bashung died at 61 after a two-year fight with lung cancer.\n\nAlain Baschung (he later dropped the \"c\" from his surname) was the son of a Breton mother working in a rubber factory and an Algerian father, whom he never knew. His mother remarried, and at the age of one, Bashung was sent to Wingersheim, near Strasbourg to live with his stepfather's parents. He spent his childhood in the countryside, in a rather conservative environment, alongside a grandmother who did not speak French. He discovered music during his childhood, notably Kurt Weill's Mahagonny, and began to practice with a Rosebud harmonica offered to him when he was five. He also practiced basketball and cycling and sang in the church choir of Wingersheim.\n\nHe came back to Paris in 1959, where he discovered the great chanson artists, and then rock artists such as Gene Vincent, Buddy Holly (whom he admired deeply), and Elvis Presley. While studying (before dropping out after he was awarded a BTS in accountancy from the École nationale de commerce in 1965), he formed a band called Les Dunces playing folk music and rockabilly.\n\nHe later formed a band with musicians met in Royan, and then began to tour in restaurants, hotels and U.S. military bases. He began his career with his first EP, \"Pourquoi rêvez-vous des États-Unis?\" in 1966, which he wrote and composed. At the same time, he joined the RCA label to become a music arranger. He wrote songs for French artists. In June 1967, at the Palais des Sports of Paris, he was the opening act (alongside Noël Deschamps and Ronnie Bird) of artists such as the Pretty Things, the Troggs or Cream.\n\nIn 1968, he released his first single, \"Les Romantiques\", which was largely ignored by the public and unsuccessful. Around that time, he dropped the \"c\" from his name and spent some time at the house of fellow singer Christophe.\n\nFrom 1972 to 1974, he composed some of the music and cowrote three albums and three singles (including \"Marilou\") for French rock singer Dick Rivers. In 1973, he played Robespierre in the musical La Révolution française by Claude-Michel Schönberg. ...\n\nSource: Article \"Alain Bashung\" from Wikipedia in english, licensed under CC-BY-SA 3.0.",
        "birthday": "1947-12-01",
        "deathday": "2009-03-14",
        "gender": 2,
        "homepage": null,
        "id": 283367,
        "imdb_id": "nm0059817",
        "known_for_department": "Acting",
        "name": "Alain Bashung",
        "place_of_birth": "Paris, France",
        "popularity": 0.1285,
        "profile_path": "/a3cqogsBLfKVWzJwpTbHB3134ku.jpg"
    }
}