{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/vJbEUMeI2AxBUZKjP6ZVeVNNTLh.jpg",
                "genre_ids": [
                    28,
                    53,
                    35
                ],
                "id": 749170,
                "original_language": "en",
                "original_title": "Heads of State",
                "overview": "The UK Prime Minister and US President have a public rivalry that risks their countries' alliance. But when they become targets of a powerful enemy, they're forced to rely on each other as they go on a wild, multinational run. Allied with Noel, a brilliant MI6 agent, they must find a way to thwart a conspiracy that threatens the free world.",
                "popularity": 29.7976,
                "poster_path": "/lVgE5oLzf7ABmzyASEVcjYyHI41.jpg",
                "release_date": "2025-06-24",
                "title": "Heads of State",
                "video": false,
                "vote_average": 6.915,
                "vote_count": 737,
                "character": "CIA Briefer",
                "credit_id": "686599f83e5d63c6639c2b91",
                "order": 54
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Mark Hampton is an actor and filmmaker known for his award-winning performances in Town vs. Gown (2015) and Acceptance (2020).\n\nBorn in New Zealand, Mark moved to the UK and made his big-screen debut opposite Academy Award winner F. Murray Abraham in Una vacanza all'inferno (1997) an Italian co-production also starring Marco Leonardi. He then played American heart-throb Brad in the TV series Comin' Atcha! (1999). He went on to appear in a number of classic British television series, including detective drama Jonathan Creek (1997), long-running children's show Grange Hill (1978) and medical drama Casualty (1986). He also had guest roles in Lara Croft: Tomb Raider - The Cradle of Life (2003) and World War Z (2013).\n\nAfter a career break Mark returned as an actor and filmmaker. His first short film A Walk in the Woods (2013) starred veteran British actor Richard Heffer taking a haunting journey to the past.\n\nIn 2015 Mark wrote, directed and starred in short film Town vs. Gown (2015). The film premiered in the US at Academy Award qualifying the Rhode Island International Film Festival and in the UK at the BAFTA qualifying British Urban Film Festival. Mark won several awards and Town vs. Gown (2015) was nominated for Best Short Film at the Empire Awards 2017. He followed this with political drama Acceptance (2020) in 2020. His central performance as a US Congressman earned him several Best Actor awards.\n\nMark's television appearances include pandemic drama This England (2022), vampire comedy Count Abdulla (2023), Liaison (2023) for AppleTV and British soap opera Emmerdale Farm (1972).\n\nBig screen appearances include horror anthology Midnight Peepshow (2022), Kevin Hart action comedy Lift (2024), One More Shot (2024) with Scott Adkins, playing the British Prime Minister in thriller Control (2023) and opposite John Cena in Heads of State (2025).\n\nUnlicensed, Mark's debut feature film as writer/director was completed in 2025.\n\nMark Hampton is represented by Nina Malone at Identity Agency Group.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.markhamptonofficial.com",
        "id": 2838016,
        "imdb_id": "nm1411286",
        "known_for_department": "Acting",
        "name": "Mark Hampton",
        "place_of_birth": " New Zealand",
        "popularity": 0.0748,
        "profile_path": "/1QU9wjU4fxzYmJALQREMJYSVzS8.jpg"
    }
}