{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8BTsTfln4jlQrLXUBquXJ0ASQy9.jpg",
                "genre_ids": [
                    12,
                    28,
                    878
                ],
                "id": 140607,
                "original_language": "en",
                "original_title": "Star Wars: The Force Awakens",
                "overview": "Thirty years after defeating the Galactic Empire, Han Solo and his allies face a new threat from the evil Kylo Ren and his army of Stormtroopers.",
                "popularity": 11.7739,
                "poster_path": "/wqnLdwVXoBjKibFRR5U3y0aDUhs.jpg",
                "release_date": "2015-12-15",
                "title": "Star Wars: The Force Awakens",
                "video": false,
                "vote_average": 7.256,
                "vote_count": 19968,
                "character": "Hangar Officer / Starkiller Technician (voice) (uncredited)",
                "credit_id": "5865bd159251412b7d0248b4",
                "order": 74
            },
            {
                "adult": false,
                "backdrop_path": "/k63j5qexRlpD3wxzETKfuZRVWiT.jpg",
                "genre_ids": [
                    18,
                    35,
                    10749,
                    14
                ],
                "id": 9007,
                "original_language": "en",
                "original_title": "Just Like Heaven",
                "overview": "Shortly after David Abbott moves into his new San Francisco digs, he has an unwelcome visitor on his hands: winsome Elizabeth Masterson, who asserts that the apartment is hers -- and promptly vanishes. When she starts appearing and disappearing at will, David thinks she's a ghost, while Elizabeth is convinced she's alive.",
                "popularity": 4.4954,
                "poster_path": "/2cLbyVNhEEaUJGg7rfbLtX6454I.jpg",
                "release_date": "2005-09-16",
                "title": "Just Like Heaven",
                "video": false,
                "vote_average": 6.954,
                "vote_count": 2472,
                "character": "Intern Karen",
                "credit_id": "59a2ecd7c3a368478f041693",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Κάθριν Τέιμπερ",
            "Cat Taber"
        ],
        "biography": "Georgia native Catherine Taber made her feature film debut starring in the coming of age drama \"The Girls' Room\". Taber's performance in the film garnered critical praise from industry publications. Daily Variety hailed her performance as \"winning, empathetic and intimate.\" Catherine can also be seen alongside Reese Witherspoon in the romantic comedy, Just like Heaven, as well as 2009's Curious George 2, 2008's Star Wars: The Clone Wars, the film that kicked off the series, and in numerous comedic and dramatic television appearances.\n\nCatherine made her voice-acting debut playing Mission Vao in Star Wars: Knights of the Old Republic. She has since appeared in some of the most popular science fiction and fantasy titles on the market including The Secret World, Guild Wars 2, Metal Gear Solid: Peace Walker and X Men. Cat also plays the young Princess Leia in the award winning Star Wars: The Force Unleashed and its sequel, The Force Unleashed II. In 2012, Taber has returned to the Star Wars Universe to play Vette in the Star Wars: The Old Republic. Catherine was nominated for a NAViGaTR Award (National Academy of Video Game Testers and Reviewers) for her portrayal of Penelo in \"Final Fantasy 12\"\n\nHailed as a Geek Goddess amongst the sci fi, fantasy, and gaming communities, Catherine feels right at home in her current role of Padme Amidala in the critically acclaimed Cartoon Network television series Star Wars: The Clone Wars.\n\nWhen this self-proclaimed sci-fi geek isn't living out her childhood dreams on set, she is giving back to her community. Catherine started the organization Games For Soldiers which accepts donations of video games and comic books that she sends to troops deployed in Afghanistan and Iraq.",
        "birthday": "1979-12-30",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 283842,
        "imdb_id": "nm0845941",
        "known_for_department": "Acting",
        "name": "Catherine Taber",
        "place_of_birth": "Atlanta, Georgia, USA",
        "popularity": 0.6003,
        "profile_path": "/tvNDxCQ3k8gjIIN6KV8AFCZORw8.jpg"
    }
}