{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2EOy2YSJbzKvlzKpEEKULVYZGlN.jpg",
                "genre_ids": [
                    10749,
                    35
                ],
                "id": 658760,
                "original_language": "de",
                "original_title": "Isi & Ossi",
                "overview": "Isi and Ossi couldn't be any more different: She's a billionaire's daughter from Heidelberg, he's a struggling boxer from the nearby town of Mannheim. But when Isi meets Ossi, the two quickly realize that they can take advantage of one another: She dates the broke boxer to provoke her parents and get them to fund a long-desired chef training in New York. He tries to rip off the rich daughter to finance his first professional boxing match. Their plans soon develop into emotional chaos that challenges everything the two believe to know about money, career and love.",
                "popularity": 2.5566,
                "poster_path": "/bZ7H0kCwEM6CQ0dyCs2H4RkU130.jpg",
                "release_date": "2020-02-14",
                "title": "Isi & Ossi",
                "video": false,
                "vote_average": 6.919,
                "vote_count": 935,
                "character": "Manfred Voigt",
                "credit_id": "5e172bba1d01910015f214de",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Hans Jochen Wagner"
        ],
        "biography": "Hans-Jochen Wagner comes from a family of teachers and was born as the middle of three brothers in December 1968 in Tübingen. He grew up in Reutlingen, where his mother worked as an anthroposophical art therapist and he attended the Waldorf school. He initially studied teaching in Tübingen (specializing in mathematics and history) and worked on the side as a technician and assistant director at the Reutlingen theater Die Tonne. He then pursued a degree in cultural education in Hildesheim. From 1994 to 1997, he completed his acting training at the Ernst Busch Academy of Dramatic Arts in Berlin. Later, he took a film acting course at the Film Academy Baden-Württemberg in Ludwigsburg. In 1997, he was engaged at the Burgtheater in Vienna..\n\nWagner made his camera debut in 1998 in the short film \"Zita - Stories about Deadly Sins.\" In 2002, he appeared as Martin alongside Harald Schrott and Lisa Martinek in the television film \"Die Rückkehr\" (The Return), directed by Christoph Stark. His first leading film role was in 2003 in the German-Austrian feature film \"Sie haben Knut\" (They Have Knut). From 2013 to 2021, he played Detective Chief Inspector Hendrik Verhoeven in nine episodes of the ZDF crime series \"Kommissarin Heller\" alongside Lisa Wagner and Nina Kronjäger. From 2004 onwards, he took on guest roles in several \"Tatort\" episodes. Since 2017, he has been appearing as Detective Friedemann Berg in the Black Forest \"Tatort\" of SWR alongside Eva Löbau.\n\n__________\n\nThis is an excerpt from Wikipedia. The complete article (/wiki/Hans-Jochen_Wagner) is licenced under „Creative Commons Attribution/Share Alike“. The complete list of contributors is available at the source.",
        "birthday": "1968-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 28421,
        "imdb_id": "nm1082665",
        "known_for_department": "Acting",
        "name": "Hans-Jochen Wagner",
        "place_of_birth": null,
        "popularity": 0.1489,
        "profile_path": "/8Rb0EeRXhqzpY5E6XyC5fcHQyQn.jpg"
    }
}