{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8HKwxHZ23sW8wz4yb28IWnAM1M6.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 458423,
                "original_language": "en",
                "original_title": "Mamma Mia! Here We Go Again",
                "overview": "Five years after meeting her three fathers, Sophie Sheridan prepares to open her mother’s hotel. In 1979, young Donna Sheridan meets the men who each could be Sophie’s biological father.",
                "popularity": 5.2208,
                "poster_path": "/aWicerX4Y7n7tUwRAVHsVcBBpj2.jpg",
                "release_date": "2018-07-18",
                "title": "Mamma Mia! Here We Go Again",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 3473,
                "character": "Ensemble Performer",
                "credit_id": "5fa34273e93e95003e33c3dc",
                "order": 171
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Eve Adam"
        ],
        "biography": "Born in Brighton to Greek Cypriot parents, Eve Polycarpou is a British stage actress, singer and songwriter with a memorable expression of her multitalented versatility, such as from Bertolt Brecht's \"The Threepenny Opera\" at the National Theatre of Great Britain in 1986 (alongside Tim Curry) to Stuart Brayson, Tim Rice and Bill Oakes' \"From Here to Eternity\" (based on James Jones' novel) at the Charing Cross Theatre in 2022 and from \"Hecuba\" at the Donmar Warehouse in 2004 (in a new version of Euripides' tragedy by Frank McGuinness) to her staggering interpretation of the title role in Bertolt Brecht's \"Mother Courage and Her Children\" at The Lowry in Salford in 2013.\n\nAmong others, her notable stage work in prolific plays also includes an acclaimed production of Alexi Kaye Campbell's \"Sunset at the Villa Thalia\" premiered in London at the National Theatre in May 2016, directed by Simon Godwin.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 2843927,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Eve Polycarpou",
        "place_of_birth": "Brighton, East Sussex, England, UK",
        "popularity": 0.0695,
        "profile_path": null
    }
}