{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lFNADy1elNHpUxML41Mi7JRstey.jpg",
                "genre_ids": [
                    16,
                    10751,
                    14
                ],
                "id": 34134,
                "original_language": "en",
                "original_title": "Barbie in A Mermaid Tale",
                "overview": "Barbie stars as Merliah, a surfer who learns a shocking secret: she's a mermaid! She and her dolphin friend set out for an undersea adventure to rescue her mother, the queen of Oceana.",
                "popularity": 5.1784,
                "poster_path": "/jtOlo3AaXVBnqfMeKGFrZUMPFui.jpg",
                "release_date": "2010-01-25",
                "title": "Barbie in A Mermaid Tale",
                "video": false,
                "vote_average": 7.245,
                "vote_count": 789,
                "character": "Kayla (voice)",
                "credit_id": "5cf38fdc92514141f2bcfcc4",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Emma Jane Pierson"
        ],
        "biography": "Emma Jane Pierson (born 30 April 1981) is an English actress. Her appearances in television programmes include the role of Anna Thornton-Wilton in the BBC television drama Hotel Babylon, and SunTrap, Days Like These, Beast, I Saw You, Charles II: The Power and The Passion, The Worst Week of My Life, Bloodlines, Coupling, Time Gentlemen Please, Dead Boss and Killing Eve.\n\nThe daughter of a nurse and a Royal Navy submariner, Pierson was born Emma Jane Pierson on 30 April 1981 in Plymouth, Devon. Her father, Charles, was stationed at Faslane Naval Base on the Clyde where Emma spent the first four years of her life.\n\nWhen she was in her teens, Pierson lived with her parents and three siblings in North Bradley, near Trowbridge, Wiltshire, attending Grittleton House School and then later St Laurence School in nearby Bradford on Avon where she began taking acting lessons.\n\nAfter leaving school in 1997, Pierson performed in amateur productions with the North Bradley players, appearing in a number of plays including Chekhov's Uncle Vanya.\n\nPierson gained the role of Becky Radcliffe in the BBC children's drama series Grange Hill while studying law at the City of Bath College.\n\nAfter leaving Grange Hill, Pierson took on the role of Jackie Burgett in Days Like These, an ITV sitcom set in Luton and adapted from the American comedy series That '70s Show. However, Days Like These proved unsuccessful and the series was cancelled after only ten of its thirteen episodes were aired.\n\nPierson has continued to appear in comedy series, including various episodes of the Channel 4 sketch show Armstrong and Miller, Beast with Alexander Armstrong and The Worst Week of My Life with Ben Miller. In 2002, following the departure from the series of Julia Sawalha, Pierson played new character student barmaid Connie in the second series of sitcom Time Gentlemen Please, written by Al Murray and Richard Herring, and appeared in an episode of the sitcom Coupling.",
        "birthday": "1981-04-30",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.casarotto.co.uk/clients/emma-pierson",
        "id": 28475,
        "imdb_id": "nm0682753",
        "known_for_department": "Acting",
        "name": "Emma Pierson",
        "place_of_birth": "Plymouth, Devon, England, UK",
        "popularity": 0.3181,
        "profile_path": "/4OkxZDtztpv7xVQX19sFMDl6h6D.jpg"
    }
}