{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cLZxnkj75cGBK1tLTMyIudOZYZk.jpg",
                "genre_ids": [
                    99
                ],
                "id": 1777,
                "original_language": "en",
                "original_title": "Fahrenheit 9/11",
                "overview": "Michael Moore's view on how the Bush administration allegedly used the tragic events on 9/11 to push forward its agenda for unjust wars in Afghanistan and Iraq.",
                "popularity": 3.7204,
                "poster_path": "/1WQgOCJj22zF7Bsr0pIBgGBr71q.jpg",
                "release_date": "2004-06-25",
                "title": "Fahrenheit 9/11",
                "video": false,
                "vote_average": 7.084,
                "vote_count": 1460,
                "character": "Self (archive footage)",
                "credit_id": "60dd9c3fa12856007494b560",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Richard Andrew Gephardt",
            "Richard Gephardt"
        ],
        "biography": "Richard Andrew Gephardt (born January 31, 1941) is an American attorney, lobbyist, and politician who represented Missouri's 3rd congressional district in the United States House of Representatives from 1977 to 2005. A member of the Democratic Party, he was House majority leader from 1989 to 1995 and minority leader from 1995 to 2003. He ran unsuccessfully for the Democratic nomination for President of the United States in 1988 and 2004. Gephardt was mentioned as a possible vice presidential nominee in 1988, 1992, 2000, 2004, and 2008.\n\nSince his retirement from politics, Gephardt has become a significant lobbyist. He founded a Washington-based public affairs firm, Gephardt Government Affairs; an Atlanta-based labor consultancy, the Gephardt Group; and a direct primary care group, SolidaritUS Health. He also consults for DLA Piper, FTI Consulting and Goldman Sachs, and is a member of the ReFormers Caucus of Issue One and co-chair of Issue One's Council for Responsible Social Media with former Massachusetts lieutenant governor Kerry Healey.",
        "birthday": "1941-01-31",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2847710,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Dick Gephardt",
        "place_of_birth": "St. Louis, Missouri, USA",
        "popularity": 0.0214,
        "profile_path": "/dHmedZcofXbGL6QM52u8KkAAA1s.jpg"
    }
}