{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9wLetxZRpBtq3kyaNwBhWPAapUe.jpg",
                "genre_ids": [
                    18,
                    36,
                    10752
                ],
                "id": 10110,
                "original_language": "en",
                "original_title": "Empire of the Sun",
                "overview": "Jamie Graham, a privileged English boy, is living in Shanghai when the Japanese invade and force all foreigners into prison camps. Jamie is captured with an American sailor, who looks out for him while they are in the camp together. Even though he is separated from his parents and in a hostile environment, Jamie maintains his dignity and youthful spirit, providing a beacon of hope for the others held captive with him.",
                "popularity": 3.1973,
                "poster_path": "/gEaCzjwHoPgyQFcwHql7o5YLHAU.jpg",
                "release_date": "1987-12-09",
                "title": "Empire of the Sun",
                "video": false,
                "vote_average": 7.508,
                "vote_count": 2022,
                "character": "British Prisoner",
                "credit_id": "631766f846aed4007a626727",
                "order": 34
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Peter Francis Gabain Copley"
        ],
        "biography": "Peter Copley (20 May 1915 – 7 October 2008) was an English television, film and stage actor.\n\nCopley was born in Bushey, Hertfordshire, son of the printmakers, John Copley and Ethel Gabain.\n\nAfter changing his mind about joining the Royal Navy, he studied at the Old Vic School and started out as a stage actor in 1932. He made his first film appearance in 1934, going on to play a wide variety of characters from the villainous to the meek and mild. In 1946, he appeared on stage in \"Cyrano de Bergerac\" at the New Theatre in London. In 1951 he appeared at the Duchess Theatre in London's West End in the comedy play The Happy Family by Michael Clayton Hutton.\n\nTV credits include: Thorndyke, Danger Man, The Saint, The Avengers, The Forsyte Saga, The Troubleshooters, The Champions, Department S, Doomwatch, Z-Cars, Fall of Eagles, Survivors, Bless Me, Father (episode \"A Legend Comes to Stay\"), Father Brown (episode \"The Curse of the Golden Cross\"), Doctor Who (in the serial \"Pyramids of Mars\"), Sutherland's Law, Tales of the Unexpected, Miss Marple (episode \"Nemesis\"), Lovejoy, The Bill, Cadfael, The Diamond Brothers: South by South East and One Foot in the Grave.\n\nCopley continued to act well into his nineties. A resident of Bristol, Copley was awarded an Honorary Degree of Master of Arts by the University of the West of England in 2001.",
        "birthday": "1915-05-20",
        "deathday": "2008-10-07",
        "gender": 2,
        "homepage": null,
        "id": 28482,
        "imdb_id": "nm0178741",
        "known_for_department": "Acting",
        "name": "Peter Copley",
        "place_of_birth": "Bushey, Hertfordshire, England, UK",
        "popularity": 0.1803,
        "profile_path": "/wKHNkyymXPh79zxUrVZ7uJqcdcV.jpg"
    }
}