{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wP0NGOGf2PG4lHXHWEqFW0kBOye.jpg",
                "genre_ids": [
                    10402,
                    18
                ],
                "id": 799766,
                "original_language": "en",
                "original_title": "Better Man",
                "overview": "Follow Robbie Williams' journey from childhood, to being the youngest member of chart-topping boyband Take That, through to his unparalleled achievements as a record-breaking solo artist – all the while confronting the challenges that stratospheric fame and success can bring.",
                "popularity": 5.5975,
                "poster_path": "/fbGCmMp0HlYnAPv28GOENPShezM.jpg",
                "release_date": "2024-12-06",
                "title": "Better Man",
                "video": false,
                "vote_average": 7.737,
                "vote_count": 658,
                "character": "Peter",
                "credit_id": "644a48eaa39d0b0cda246977",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/w281eYXUFwrcPLiifaJRpE2LwlA.jpg",
                "genre_ids": [
                    18,
                    10749,
                    53
                ],
                "id": 116,
                "original_language": "en",
                "original_title": "Match Point",
                "overview": "Chris, a former tennis pro, takes a job as an instructor and befriends his wealthy young student, Tom. After being introduced to his family, Chris is soon engaged to Tom's sister, Chloe. Despite the professional and financial advantages that this relationship affords him, Chris becomes obsessed with Tom's fiancee, American actress Nola.",
                "popularity": 5.5644,
                "poster_path": "/vHjEVTD8ucuwKSFOZJeyAnTZYli.jpg",
                "release_date": "2005-10-26",
                "title": "Match Point",
                "video": false,
                "vote_average": 7.358,
                "vote_count": 4205,
                "character": "Detective Parry",
                "credit_id": "56395f64c3a3681b61021608",
                "order": 25
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "史蒂文·彭伯顿",
            "Steven James Pemberton",
            "استیو پمبرتون"
        ],
        "biography": "Steve Pemberton is a BAFTA winning actor and writer born in Blackburn, UK. He graduated from Bretton Hall in Yorkshire with a BA (Hons) in Theatre Arts in 1989. After leaving college Steve spent time producing and starring in small-scale theatre productions in London and working part-time for Variety as assistant editor of the International Film Guide. In 1996 Steve and his college friends Mark Gatiss, Reece Shearsmith and Jeremy Dyson went to Edinburgh with comedy show The League of Gentlemen, winning the coveted Perrier Comedy prize a year later. The group then went on to record a radio series and four TV series for the BBC as well as staging three live tours and making a film.\n\nIn 2009 Steve and Reece wrote and starred in the multi-award winning black comedy Psychoville which ran for two series and a Halloween special. The pair's acclaimed anthology show Inside No 9 began in 2014 and Steve was awarded with a BAFTA for Best Male Comedy Performance in 2019. The show also won BAFTAs for Scripted Comedy and Comedy Writing. Steve lives in North London with his partner and three children.",
        "birthday": "1967-09-01",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.pbjmanagement.co.uk/artists/steve-pemberton",
        "id": 28485,
        "imdb_id": "nm0671487",
        "known_for_department": "Acting",
        "name": "Steve Pemberton",
        "place_of_birth": "Blackburn, Lancashire, England, UK",
        "popularity": 0.7482,
        "profile_path": "/j4AFPsF6DM9nfccol3VFQgPJ6Ia.jpg"
    }
}