{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jDz6RYN3nKYtlo7J9IMvGoJit7B.jpg",
                "genre_ids": [
                    18,
                    12,
                    28,
                    36
                ],
                "id": 79,
                "original_language": "zh",
                "original_title": "英雄",
                "overview": "During China's Warring States period, a district prefect arrives at the palace of Qin Shi Huang, claiming to have killed the three assassins who had made an attempt on the king's life three years ago.",
                "popularity": 8.083,
                "poster_path": "/vxgZto2Cz7ILHAlmRXt50I2brB2.jpg",
                "release_date": "2002-07-22",
                "title": "Hero",
                "video": false,
                "vote_average": 7.501,
                "vote_count": 2362,
                "character": "Eunuch",
                "credit_id": "63bcde5efc31d3007e327b02",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "金铭"
        ],
        "biography": "Jin Ming, born in Beijing, is probably the most famous Chinese child star of the past two decades. Dubbed \"China's Shirley Temple,\" Jin, with her sweet and cute looks, was favored by millions of Chinese in the 1990s when she shot a series of TV hits adapted from the novels written by well-known Chinese romance author Chiung Yao, including \"Wanjun\" (1990), \"Longing for Husband to Return\" (1990), \"Grass by Riverside\" (1992) and \"Plum Blossom\" (1993).\n\nJin's1989 portrayal of the wholesome girl Wanjun when she was only nine years old, made a long-lasting impression on her fans, pushing her into the box of \"China's child star forever.\" Yet, Jin gradually lost her fame as she grew up. She has become a rather unknown or vague figure in the showbiz world since the age of 18. Jin began to work at the Chinese Coal Mine Art Troupe after graduating from the School of International Studies, Peking University, in 2003. It's reported that she tied the knot with Chinese film promoter An Yugang in September, 2012.",
        "birthday": "1980-11-19",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 2877282,
        "imdb_id": "nm1711670",
        "known_for_department": "Acting",
        "name": "Jin Ming",
        "place_of_birth": "Beijing, China",
        "popularity": 0.3956,
        "profile_path": "/6q3GfQbioyulGdljp0YseIaSRCz.jpg"
    }
}