{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hpzbQDjl2yzf6MwrYOrbDJCmojc.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 227,
                "original_language": "en",
                "original_title": "The Outsiders",
                "overview": "When two poor Greasers, Johnny and Ponyboy, are assaulted by a vicious gang, the Socs, and Johnny kills one of the attackers, tension begins to mount between the two rival gangs, setting off a turbulent chain of events.",
                "popularity": 6.2815,
                "poster_path": "/pl8Tf36TAOb2i561yPbQ9xl4P4D.jpg",
                "release_date": "1983-03-25",
                "title": "The Outsiders",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 1451,
                "character": "Ponyboy Curtis",
                "credit_id": "52fe4229c3a36847f8008bdd",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/mXLVA0YL6tcXi6SJSuAh9ONXFj5.jpg",
                "genre_ids": [
                    878,
                    12,
                    10751,
                    14
                ],
                "id": 601,
                "original_language": "en",
                "original_title": "E.T. the Extra-Terrestrial",
                "overview": "An alien is left behind on Earth and saved by the 10-year-old Elliot who decides to keep him hidden in his home. While a task force hunts for the extra-terrestrial, Elliot, his brother, and his little sister Gertie form an emotional bond with their new friend, and try to help him find his way home.",
                "popularity": 10.0949,
                "poster_path": "/an0nD6uq6byfxXCfk6lQBzdL2J1.jpg",
                "release_date": "1982-06-11",
                "title": "E.T. the Extra-Terrestrial",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 11553,
                "character": "Tyler",
                "credit_id": "52fe425bc3a36847f8017e65",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/sAiTihJ8bjEqg8nYUIlTQUnVXuj.jpg",
                "genre_ids": [
                    37,
                    12
                ],
                "id": 2023,
                "original_language": "en",
                "original_title": "Hidalgo",
                "overview": "Set in 1890, this is the story of a Pony Express courier who travels to Arabia to compete with his horse, Hidalgo, in a dangerous race for a massive contest prize, in an adventure that sends the pair around the world...",
                "popularity": 5.5231,
                "poster_path": "/iGzENlBPYJEFWZnye4t3nqWSSp1.jpg",
                "release_date": "2004-02-04",
                "title": "Hidalgo",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 1271,
                "character": "Preston Webb",
                "credit_id": "52fe432dc3a36847f8040433",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/qLhoEKvkG3SgjyBrgn6wMxaTHr4.jpg",
                "genre_ids": [
                    27,
                    28,
                    53
                ],
                "id": 9542,
                "original_language": "en",
                "original_title": "The Hitcher",
                "overview": "On a stormy night, young Jim, who transports a luxury car from Chicago to California to deliver it to its owner, feeling tired and sleepy, picks up a mysterious hitchhiker, who has appeared out of nowhere, thinking that a good conversation will help him not to fall asleep. He will have enough time to deeply regret such an unmeditated decision.",
                "popularity": 2.2038,
                "poster_path": "/89giuiFssSVCUxkCP386v66cry8.jpg",
                "release_date": "1986-01-17",
                "title": "The Hitcher",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 992,
                "character": "Jim Halsey",
                "credit_id": "52fe4507c3a36847f80b804b",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/y41qhCHR7bC0HTg5bdxaegbRCKg.jpg",
                "genre_ids": [
                    16,
                    878,
                    28,
                    12,
                    14
                ],
                "id": 183011,
                "original_language": "en",
                "original_title": "Justice League: The Flashpoint Paradox",
                "overview": "The Flash finds himself in a war-torn alternate timeline and teams up with alternate versions of his fellow heroes to restore the timeline.",
                "popularity": 3.4313,
                "poster_path": "/hg6RYpSb3vU4i3yQDtE1YhSZNh5.jpg",
                "release_date": "2013-07-30",
                "title": "Justice League: The Flashpoint Paradox",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 1904,
                "character": "Professor Eobard 'Zoom' Thawne / Reverse-Flash (voice)",
                "credit_id": "52fe4c929251416c7511eb5b",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/biu21pZCpfe6dv9rrl23k6m6MXJ.jpg",
                "genre_ids": [
                    28,
                    16,
                    14,
                    12,
                    878
                ],
                "id": 323027,
                "original_language": "en",
                "original_title": "Justice League: Gods and Monsters",
                "overview": "In an alternate universe, very different versions of DC's Trinity fight against the government after they are framed for an embassy bombing.",
                "popularity": 2.1025,
                "poster_path": "/9EoqQuEZKmQIYjexoUbkxMcMCVr.jpg",
                "release_date": "2015-06-18",
                "title": "Justice League: Gods and Monsters",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 594,
                "character": "Dr. Will Magnus (voice)",
                "credit_id": "556e173a925141422a001198",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/azGxfdKvIhJeSusazngZlbQziIa.jpg",
                "genre_ids": [
                    878,
                    28,
                    16,
                    14
                ],
                "id": 487242,
                "original_language": "en",
                "original_title": "Suicide Squad: Hell to Pay",
                "overview": "It’s batter up at Belle Reve and that can only mean that Amanda Waller, the penitentiary’s cold and calculating warden, has a mission that only the damned will take on. It’s time to unleash Task Force X again, stacked with seasoned vets such as Deadshot, Captain Boomerang and Harley Quinn, these crafty criminals are joined by newcomers Copperhead, Killer Frost and the martial art master, Bronze Tiger! With the target objective being a mystical object so powerful that they’re willing to risk their own lives to steal it, you can be sure it will be collision of chaos, gunfire and attitudes. So, take aim for a raging road trip with the Suicide Squad!",
                "popularity": 3.8408,
                "poster_path": "/va1IgsZeWBbKLsZcFwz3CM1MkMu.jpg",
                "release_date": "2018-03-23",
                "title": "Suicide Squad: Hell to Pay",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 687,
                "character": "Eobard Thawne / Professor Zoom (voice)",
                "credit_id": "60fbdc313d3557002d517e13",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Christopher Thomas Howell",
            "Tom Howell",
            "Си Томас Хауэлл",
            "C·湯瑪斯·哈威爾",
            "سی توماس هاول"
        ],
        "biography": "Christopher Thomas Howell, usually credited as C. Thomas Howell, is an American actor and film director. He starred in the films The Outsiders as Ponyboy Curtis and in The Hitcher as Jim Halsey. He has appeared in Soul Man, Red Dawn, Secret Admirer, Gettysburg, H. G. Wells' War of the Worlds, The Day the Earth Stopped and Gods and Generals.  Howell was born in the Van Nuys neighborhood of Los Angeles to Christopher N. and Candice Howell. He has three siblings.\n\nHis father worked as a stunt coordinator and rodeo performer. He played the role of the Red Knight in Terry Gilliam’s The Fisher King. As a young boy, Howell wanted to be a stuntman and was a child stunt performer. He was also a rodeo star.\n\nWhen Howell was young, his parents divorced. Howell graduated from Saugus High School in 1984.\n\nIn 1982, Howell made his film debut as Tyler in Steven Spielberg's E.T. the Extra-Terrestrial.\n\nAt the age of 15 in 1981, Howell was cast in Francis Ford Coppola's The Outsiders (1983). Howell played the lead role of Ponyboy Curtis, \"the soulful tagalong greaser through whose eyes we see the events of the 1960s-set film unfold.\" Based on S.E. Hinton's bestselling 1967 novel of the same name,the coming-of-age film went on to become a cult classic. Howell's portrayal of Ponyboy was his breakthrough role, and it earned him a Young Artist Award.\n\nIn 1984, Howell and his Outsiders co-star Patrick Swayze reunited for Grandview, U.S.A. and Red Dawn. Howell also had a pivotal role in Tank (1984). In 1985, he starred in Secret Admirer. After filming The Outsiders, Howell co-starred in his own television series Two Marriages, which ended after four episodes, but letters of support got it back on air. He later expressed disappointment in the series.\n\nHowell was one of two final actors in the running for the lead role of Marty McFly in Back to the Future (1985); the other was Eric Stoltz. Ultimately, Michael J. Fox was cast as Marty after Stoltz was deemed wrong for the part. In 1986, Howell was a hitchhiker's target in the film The Hitcher. He also starred in the sequel, which was released in 2003. In 1986, Howell starred in Soul Man, a film in which Howell appears in Blackface. Rounding out the 1980s , Howell played the young Arturo Toscanini in Franco Zeffirelli's 1988 film Young Toscanini.",
        "birthday": "1966-12-07",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.cthowell.net",
        "id": 2878,
        "imdb_id": "nm0001367",
        "known_for_department": "Acting",
        "name": "C. Thomas Howell",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 1.6035,
        "profile_path": "/739YbFWpAYyo9neHvBGThgmT4YH.jpg"
    }
}