{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/vOpm4wQk5qIl8UepoKrpaloqaPC.jpg",
                "genre_ids": [
                    18,
                    10749,
                    10752
                ],
                "id": 2841,
                "original_language": "fr",
                "original_title": "Un long dimanche de fiançailles",
                "overview": "Young Frenchwoman Mathilde searches for the truth about her missing fiancé, lost during World War I, and learns many unexpected things along the way. The love of her life is gone. But she refuses to believe he's gone forever — and she needs to know for sure.",
                "popularity": 3.7861,
                "poster_path": "/t73m7lX0eFYDjlB1Gcb7r3S5Yt.jpg",
                "release_date": "2004-10-27",
                "title": "A Very Long Engagement",
                "video": false,
                "vote_average": 7.326,
                "vote_count": 1257,
                "character": "Bastoche",
                "credit_id": "52fe4370c3a36847f80542f5",
                "order": 12
            },
            {
                "adult": false,
                "backdrop_path": "/nLLYm9qPtE6WwFSzDOHMUUfytcx.jpg",
                "genre_ids": [
                    35,
                    10402,
                    18
                ],
                "id": 304410,
                "original_language": "fr",
                "original_title": "La Famille Bélier",
                "overview": "The whole Bélier family is deaf, except for sixteen year old Paula who is the important translator in her parents' day to day life especially when it comes to matters concerning the family farm. When her music teacher discovers she has a fantastic singing voice and she gets an opportunity to enter a big Radio France contest the whole family's future is set up for big changes.",
                "popularity": 3.0655,
                "poster_path": "/kAQeZUZ1pMTSjSF3d6eBZClFGgN.jpg",
                "release_date": "2014-12-17",
                "title": "The Bélier Family",
                "video": false,
                "vote_average": 6.933,
                "vote_count": 2405,
                "character": "Doctor Pugeot",
                "credit_id": "563ba5f692514150af00290c",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Jérôme Kircher (born 21 November 1964) is a French actor known for A Very Long Engagement (2004), Louise Wimmer (2011) and Café de Flore (2011).\n\nBorn in Paris, Kircher is a stage actor and was a student of the National Conservatory of Dramatic Art from 1985 to 1988; he was a student of Michel Bouquet and Gerard Desarthe Bernard Dort. He began his career in 1986 in the short film The Train of dawn Laurent Jaoui. Since then he has starred in several series, like Clara Sheller, Jacques where he played, and played the greatest texts, directed by Patrice Chéreau, Jean-Pierre Vincent, André Engel, Denis Podalydès, among others, and was nominated for three Molière Awards. He appeared in the short film by Éric Laporte in 1995 False Start, staged Berthe Trepat, gold medal in 2001 and I know that there are also reciprocal love (but I do not pretend to luxury) in 2005. The same year, he reappears in a short film, The Book of Belleville dead Jean-Jacques Joudiau.\n\nHe is married to fellow actress Irène Jacob.\n\nSource: Article \"Jérôme Kircher\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1964-11-21",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 28857,
        "imdb_id": "nm0456268",
        "known_for_department": "Acting",
        "name": "Jérôme Kircher",
        "place_of_birth": "Paris, France",
        "popularity": 0.1854,
        "profile_path": "/tSq33zcalu13tdMlIvKwtt0OnEW.jpg"
    }
}