{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/v85FlkbMYKa5du1glm0YfYNsL2n.jpg",
                "genre_ids": [
                    18,
                    10402,
                    10749
                ],
                "id": 776503,
                "original_language": "en",
                "original_title": "CODA",
                "overview": "As a CODA (Child of Deaf Adults), Ruby is the only hearing person in her deaf family. When the family's fishing business is threatened, Ruby finds herself torn between pursuing her love of music and her fear of abandoning her parents.",
                "popularity": 7.0338,
                "poster_path": "/BzVjmm8l23rPsijLiNLUzuQtyd.jpg",
                "release_date": "2021-08-13",
                "title": "CODA",
                "video": false,
                "vote_average": 7.908,
                "vote_count": 2391,
                "character": "Schoolteacher (uncredited)",
                "credit_id": "689122a163cd14078b186632",
                "order": 49
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Charles Coan began acting in television and film mainly from being involved in living history as a re en-actor. For the last 30 years he has been involved with various Revolutionary War groups. Charles was part of a History Channel series called \"Saving History\" in 2007, and portrayed a rowdy gang member in a Boston Massacre scene. He was also a part of a film documentary about a female heroine named Deborah Samson,who enlisted into the Revolutionary army in 1782 . Coan acted and supplied most of the props and costumes for the production that aired on local cable channels in Massachusetts. Being a British redcoat re-en-actor, he was chosen to play a British soldier in a scene for Hulu's \"Castle Rock\" in 2018. Then he decided to pursue more acting opportunities through local casting companies. Coan was selected to portray a fundraiser guest in a NBC-TV pilot \"Suspicion\" in 2018,not yet released. Although his acting career has really just begun ,he would like to be doing this kind of work for a long time.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.backstage.com/u/charlescoanles-coan/",
        "id": 2886542,
        "imdb_id": "nm9609086",
        "known_for_department": "Acting",
        "name": "Charles Coan",
        "place_of_birth": "Boston, Massachusetts, United States",
        "popularity": 0.0143,
        "profile_path": "/pzWpMBph9mvrvgMnl2zXY9TGr8G.jpg"
    }
}