{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/12fvZHskx57kQfNEUXJ3v0flWYQ.jpg",
                "genre_ids": [
                    12,
                    28
                ],
                "id": 89,
                "original_language": "en",
                "original_title": "Indiana Jones and the Last Crusade",
                "overview": "In 1938, an art collector appeals to eminent archaeologist Dr. Indiana Jones to embark on a search for the Holy Grail. Indy learns that a medieval historian has vanished while searching for it, and the missing man is his own father, Dr. Henry Jones Sr.. He sets out to rescue his father by following clues in the old man's notebook, which his father had mailed to him before he went missing. Indy arrives in Venice, where he enlists the help of a beautiful academic, Dr. Elsa Schneider, along with Marcus Brody and Sallah. Together they must stop the Nazis from recovering the power of eternal life and taking over the world!",
                "popularity": 7.0651,
                "poster_path": "/sizg1AU8f8JDZX4QIgE4pjUMBvx.jpg",
                "release_date": "1989-05-24",
                "title": "Indiana Jones and the Last Crusade",
                "video": false,
                "vote_average": 7.847,
                "vote_count": 10606,
                "character": "G-Man",
                "credit_id": "54996a4bc3a36826f8000e69",
                "order": 41
            },
            {
                "adult": false,
                "backdrop_path": "/uiUpvnv8zgA2pm1J7tT8DPLxh84.jpg",
                "genre_ids": [
                    18,
                    10749,
                    10752
                ],
                "id": 15764,
                "original_language": "en",
                "original_title": "Sophie's Choice",
                "overview": "Stingo, a young writer, moves to Brooklyn in 1947 to begin work on his first novel. As he becomes friendly with Sophie and her lover Nathan, he learns that she is a Holocaust survivor. Flashbacks reveal her harrowing story, from pre-war prosperity to Auschwitz. In the present, Sophie and Nathan's relationship increasingly unravels as Stingo grows closer to Sophie and Nathan's fragile mental state becomes ever more apparent.",
                "popularity": 3.3774,
                "poster_path": "/rZDPbPTFwuKgr5b9jixGFNYkGYt.jpg",
                "release_date": "1982-12-08",
                "title": "Sophie's Choice",
                "video": false,
                "vote_average": 7.346,
                "vote_count": 890,
                "character": "Polish Professor",
                "credit_id": "5783a78dc3a3681706000efa",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Eugene Lipinsky"
        ],
        "biography": "Eugene Lipinski is a British actor and screenwriter. He was born in Wansford Camp, Cambridgeshire and raised in Regina, Saskatchewan, Canada. He began acting at the age of twelve in amateur theater. After graduating from the University of Regina, he returned to the UK and attended the Royal Academy of Arts as well as the Drama Studio London. He is well-known TV series such as Animorphs as Visser Three, Fringe as December and Da Vinci's City Hall and Da Vinci's Inquest as Lloyd Manning. As the screenwriter, in 1991, he won Genie Awards for Best Screenplay in the 12th Genie Awards on Perfectly Normal.",
        "birthday": "1956-11-05",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 28871,
        "imdb_id": "nm0513468",
        "known_for_department": "Acting",
        "name": "Eugene Lipinski",
        "place_of_birth": "Wansford Camp, England, UK",
        "popularity": 0.3571,
        "profile_path": "/fIeSERi9a92qvdXWqEMEPyOwBKT.jpg"
    }
}