{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/isnJGDrfR9dIrHMsPTvHtJaGEpc.jpg",
                "genre_ids": [
                    10402,
                    18
                ],
                "id": 504608,
                "original_language": "en",
                "original_title": "Rocketman",
                "overview": "The story of Elton John's life, from his years as a prodigy at the Royal Academy of Music through his influential and enduring musical partnership with Bernie Taupin.",
                "popularity": 5.2044,
                "poster_path": "/f4FF18ia7yTvHf2izNrHqBmgH8U.jpg",
                "release_date": "2019-05-17",
                "title": "Rocketman",
                "video": false,
                "vote_average": 7.318,
                "vote_count": 4817,
                "character": "Ice Cream Girl (Pinner) (uncredited)",
                "credit_id": "64333e054539d00097efd386",
                "order": 168
            },
            {
                "adult": false,
                "backdrop_path": "/7mmXWuBeNJiBO0NIOUWOuFve4Tb.jpg",
                "genre_ids": [
                    10402,
                    18
                ],
                "id": 424694,
                "original_language": "en",
                "original_title": "Bohemian Rhapsody",
                "overview": "Singer Freddie Mercury, guitarist Brian May, drummer Roger Taylor and bass guitarist John Deacon take the music world by storm when they form the rock 'n' roll band Queen in 1970. Hit songs become instant classics. When Mercury's increasingly wild lifestyle starts to spiral out of control, Queen soon faces its greatest challenge yet – finding a way to keep the band together amid the success and excess.",
                "popularity": 7.4737,
                "poster_path": "/lHu1wtNaczFPGFDTrjCSzeLPTKN.jpg",
                "release_date": "2018-10-24",
                "title": "Bohemian Rhapsody",
                "video": false,
                "vote_average": 7.968,
                "vote_count": 17296,
                "character": "Jenny - Ealing Art College Student (uncredited)",
                "credit_id": "678a90be94d95839f3ad6bc1",
                "order": 58
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Charlotte Sharland is a British actress, writer and producer. At aged 11, Charlotte decided she wanted to go into the film and television industry and focused her studies towards that goal. Whilst in secondary school she directed her award winning short film \"My Story\" as part of a local anti-bullying campaign.\n\nCharlotte first performed on screen at age 9 in the music video 'Cops & Robbers' by the Hoosiers, alongside her brother Alfonso. A lot of Charlotte's early training was theatre based, with key roles including Madame Thenardier in Les Miserables (Artemis Studios) and as Maureen Johnson in Rent (Reading Rep). She also appeared in professional pantomimes Snow White and Aladdin at the Wilde Theatre, South Hill Park. Charlotte has also trained with the Actors Studio at Pinewood, The New York Film Academy in Los Angeles and is a member of the National Youth Film Academy (UK).\n\nIn 2019 Charlotte began producing with Moonchild Pictures. Their first project was web series 'Ghost Girl', which Charlotte had written and directed.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 2889467,
        "imdb_id": "nm8570705",
        "known_for_department": "Acting",
        "name": "Charlotte Sharland",
        "place_of_birth": null,
        "popularity": 0.0143,
        "profile_path": "/hfhgrpOsdlrxFDVu3GSi7UCmTRt.jpg"
    }
}