{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qxTw8OKJLRX1Xb5nR5CcIDnLKoq.jpg",
                "genre_ids": [
                    18,
                    53,
                    27
                ],
                "id": 44214,
                "original_language": "en",
                "original_title": "Black Swan",
                "overview": "The story of Nina, a ballerina in a New York City ballet company whose life, like all those in her profession, is completely consumed with dance. She lives with her retired ballerina mother Erica who zealously supports her daughter's professional ambition. When artistic director Thomas Leroy decides to replace prima ballerina Beth MacIntyre for the opening production of their new season, Swan Lake, Nina is his first choice.",
                "popularity": 7.3213,
                "poster_path": "/viWheBd44bouiLCHgNMvahLThqx.jpg",
                "release_date": "2010-12-03",
                "title": "Black Swan",
                "video": false,
                "vote_average": 7.688,
                "vote_count": 15010,
                "character": "Corps De Ballet",
                "credit_id": "5fd5659507291c0043731bb5",
                "order": 43
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Genevieve Labean Page is a former professional ballet dancer with the New York City Ballet, where she danced for nine years on stage and in televised performances in theaters around the world, including at the Acropolis in Athens, Greece and the Mariinsky Theatre in St. Petersburg, Russia. She danced in a variety of roles in ballets by George Balanchine and Jerome Robbins among others, and originated roles in Peter Martins’ Thou Swell, Bach V Concerto, Chichester Psalms, Reliquary, and Harmonielehre, and in Christopher Wheeldon’s Carnival of The Animals and Soirée Musicale. She also had a featured singing role as Rosalia in West Side Story Suite. As a child, Genevieve performed with Joffrey Ballet and New York City Ballet, sang in various commercial jingles and voiceovers, and had a starring role in the Radio City Christmas Spectacular.\n\nAfter leaving the company, Genevieve appeared in the movie Black Swan alongside Natalie Portman, with choreography by Benjamin Millepied, and also recorded and released an album of original songs on iTunes, called “Unscripted”. A few of her songs have been placed on soundtracks for various TV shows and films. She performed as a singer-songwriter in NYC at various venues such as Rockwood Music Hall and The Bitter End, and was a featured singer with the Duke Ellington Orchestra at the famed Blue Note Jazz Club. She is proud to bring a wealth of musical knowledge to her work as a dance teacher.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 2891414,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Geneviève Lebean",
        "place_of_birth": null,
        "popularity": 0.0143,
        "profile_path": "/8g0FixFP9lau1sDFxnHJduAgIoE.jpg"
    }
}