{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qxTw8OKJLRX1Xb5nR5CcIDnLKoq.jpg",
                "genre_ids": [
                    18,
                    53,
                    27
                ],
                "id": 44214,
                "original_language": "en",
                "original_title": "Black Swan",
                "overview": "The story of Nina, a ballerina in a New York City ballet company whose life, like all those in her profession, is completely consumed with dance. She lives with her retired ballerina mother Erica who zealously supports her daughter's professional ambition. When artistic director Thomas Leroy decides to replace prima ballerina Beth MacIntyre for the opening production of their new season, Swan Lake, Nina is his first choice.",
                "popularity": 7.3213,
                "poster_path": "/viWheBd44bouiLCHgNMvahLThqx.jpg",
                "release_date": "2010-12-03",
                "title": "Black Swan",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 15010,
                "character": "Corps De Ballet",
                "credit_id": "5fd565072cefc2003f1e2c9b",
                "order": 40
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Lillian DiPiazza began her dance training at Maryland Youth Ballet, where she studied for 10 years under the direction of Michelle Lees and Tensia Fonseca and performed in ballets such as Swan Lake, Giselle, Sleeping Beauty, and Paquita. In addition, Lillian also attended summer intensives at Miami City Ballet, Pacific Northwest Ballet (on full scholarship), and the School of American Ballet (SAB), where, in 2007, she spent a year training and performing in such works as George Balanchine’s The Nutcracker® and Jerome Robbins’ Fanfare. During her time at SAB, Lillian not only choreographed a pas de quatre to music by Philip Glass for their Choreographic Workshop, but was also afforded the opportunity to travel to the Kennedy Center as part of the Protégés Program, where she performed Concerto Barocco. Lillian joined Pennsylvania Ballet in 2008 as a member of PBII. She was promoted to apprentice for our 2009/2010 season, corps de ballet for 2011/2012, and soloist for 2013/2014. In 2016, she was promoted to the rank of principal dancer. In 2015, Lillian debuted as Odette/Odile in Christopher Wheeldon’s Swan Lake and has appeared in a range of principal roles, including Coppélia (Swanilda), Balanchine’s A Midsummer Night’s Dream (Titania, Hippolyta, Hermia), Jerome Robbins’ In the Night, William Forsythe’s The Vertiginous Thrill of Exactitude, and Matthew Neenan’s Penumbra. In 2014, Lillian was profiled for Dance Magazine’s “On the Rise” section. She also appeared in the critically acclaimed feature film Black Swan and has earned a degree in urban studies from the University of Pennsylvania. In 2007, Lillian was named the National Foundation for the Advancement of the Arts winner in dance.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.operadeparis.fr/en/artists/lillian-di-piazza",
        "id": 2891407,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Lillian di Piazza",
        "place_of_birth": "Philadelphia, Pennsylvania, USA",
        "popularity": 0.0143,
        "profile_path": "/sAi7Fly55gYhia70zxbtSGnbOo6.jpg"
    }
}