{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qxTw8OKJLRX1Xb5nR5CcIDnLKoq.jpg",
                "genre_ids": [
                    18,
                    53,
                    27
                ],
                "id": 44214,
                "original_language": "en",
                "original_title": "Black Swan",
                "overview": "The story of Nina, a ballerina in a New York City ballet company whose life, like all those in her profession, is completely consumed with dance. She lives with her retired ballerina mother Erica who zealously supports her daughter's professional ambition. When artistic director Thomas Leroy decides to replace prima ballerina Beth MacIntyre for the opening production of their new season, Swan Lake, Nina is his first choice.",
                "popularity": 7.3213,
                "poster_path": "/viWheBd44bouiLCHgNMvahLThqx.jpg",
                "release_date": "2010-12-03",
                "title": "Black Swan",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 15010,
                "character": "Ballet Mistress",
                "credit_id": "5fd562e474507d003e5bcf01",
                "order": 31
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Ms. Stavitskaya graduated from the Kirov School in St. Petersburg, Russia in 1960 and was accepted as Soloist in the Kirov and Maly Theatre Companies. During her fifteen-year performing career, she danced many principal and soloist roles from classical ballet repertoire. In 1970, upon completing the pedagogical training course under Vera Kostrovitskaya, she joined the faculty of the Vaganova Choreographic School in St. Petersburg where she taught classical technique, repertoire and character dance.\n\nMs. Stavitskaya immigrated to the United States in 1976 and continues an illustrious teaching career. Among her positions, she has been a faculty member of the School of American Ballet, the American Ballet Theatre School, Studio Maestro and an instructor with Ballet Arts, Carnegie Hall and the Harkness Ballet School. She has been a teacher with the Metropolitan Opera Ballet Company, the American Ballet Theatre Company, American Ballet Theatre II, and guest teacher for the Vienna Ballet Company, the Royal Swedish Ballet, the Cullberg Ballet, Stockholm, Sweden, the Finnish National Opera, Helsinki, HET National Ballet, Amsterdam, the Stuttgart Ballet, Germany, and Le Groupe de Huit in Paris. She has taught master classes for the Southwest Regional Ballet Festival, the Pacific Regional Ballet Festival, the Academie de Danse Classique, Princess Grace, Monte Carlo, the Kuopio Dance Festival, Finland, the Mid-States Regional Ballet Festival, and the Southwestern Regional Ballet Festival.\n\nIn addition to her teaching career, Ms. Stavitskaya has staged works from the classical repertoire worldwide, including the Coteburg Ballet Company, Star Dancers Company, Japan, the Tampa Ballet Company, and for the Studio Maestro Gala Concerts as well as Les Sylphides for the Nureyev Festival at the London Coliseum. Ms Stavitskaya has received recognition as a gifted choreographer of ballet and character dance. Marina can also be seen in the feature film, Black Swan.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.manhattanyouthballet.org/faculty",
        "id": 2891398,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Marina Stavitskaya",
        "place_of_birth": "St. Petersburg, Russian Empire",
        "popularity": 0.0071,
        "profile_path": "/qNKFNrfiqLaAPMjtjwfKDH4YRcw.jpg"
    }
}