{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qxTw8OKJLRX1Xb5nR5CcIDnLKoq.jpg",
                "genre_ids": [
                    18,
                    53,
                    27
                ],
                "id": 44214,
                "original_language": "en",
                "original_title": "Black Swan",
                "overview": "The story of Nina, a ballerina in a New York City ballet company whose life, like all those in her profession, is completely consumed with dance. She lives with her retired ballerina mother Erica who zealously supports her daughter's professional ambition. When artistic director Thomas Leroy decides to replace prima ballerina Beth MacIntyre for the opening production of their new season, Swan Lake, Nina is his first choice.",
                "popularity": 7.3213,
                "poster_path": "/viWheBd44bouiLCHgNMvahLThqx.jpg",
                "release_date": "2010-12-03",
                "title": "Black Swan",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 15010,
                "character": "Corps De Ballet",
                "credit_id": "5fd5647774507d003f5c2e47",
                "order": 38
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Abigail Mentzer trained in NYC at the School of American Ballet where she danced many children’s roles with the NYCB. She danced as a trainee with Miami City Ballet in 2001 before joining the Pennsylvania Ballet. During her 11 seasons with PABallet she was promoted to Soloist.  Abigail has spent the last 4 years on the North American Tour of Phantom of the Opera as a Corps de Ballet/ Ensemble lady and Meg Giry cover.\n\nOver the years, she has been featured in Pointe, Dance and Philadelphia Magazines. Abigail participated in Manna’s annual benefit, Shut Up & Dance, as a dancer, choreographer and costume designer / supervisor. Abigail designed costumes for Avi Scher’s piece, A Full Life, with Texas Ballet Theater in 2016.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.abigailmentzer.com/about-me",
        "id": 2891404,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Abigail Mentzer",
        "place_of_birth": null,
        "popularity": 0.0071,
        "profile_path": "/7oSO2dwqAbu5eZ2wUTurvp4kO0T.jpg"
    }
}