{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qxTw8OKJLRX1Xb5nR5CcIDnLKoq.jpg",
                "genre_ids": [
                    18,
                    53,
                    27
                ],
                "id": 44214,
                "original_language": "en",
                "original_title": "Black Swan",
                "overview": "The story of Nina, a ballerina in a New York City ballet company whose life, like all those in her profession, is completely consumed with dance. She lives with her retired ballerina mother Erica who zealously supports her daughter's professional ambition. When artistic director Thomas Leroy decides to replace prima ballerina Beth MacIntyre for the opening production of their new season, Swan Lake, Nina is his first choice.",
                "popularity": 7.3213,
                "poster_path": "/viWheBd44bouiLCHgNMvahLThqx.jpg",
                "release_date": "2010-12-03",
                "title": "Black Swan",
                "video": false,
                "vote_average": 7.688,
                "vote_count": 15010,
                "character": "Corps De Ballet",
                "credit_id": "5fd565ff29c6260042ba07ee",
                "order": 47
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Lauren Fadeley Veyette trained at the Orlando Ballet School and the School of Performing Arts in Florida before moving to New York City to study full time at the School of American Ballet. She began her professional career at 16 with the New York City Ballet  at the invitation of Peter Martins, performing works by George Balanchine, Jerome Robbins, Christopher Wheeldon, and Peter Martins.\n\nAfter 2 years with NYCB, she chose to further her academic and dance education by attending Indiana University. In 2007, she graduated cum laude with a Bachelor of Science in Ballet Performance and an Outside Field in Kinesiology. Ms. Fadeley then joined the corps de ballet of Pennsylvania Ballet. She was promoted to Soloist for the 2011 season and Principal Dancer in 2012. Lauren later joined Miami City Ballet as a Soloist in 2016 and was promoted in Principal Soloist in 2017.  During her career, she performed featured roles in a vast array of classical, Robbin’s and Balanchine works, including A Midsummer Night’s Dream, George Balanchine’s The Nutcracker™, Serenade, Jewels, Coppélia, Giselle, Swan Lake, The Four Temperaments, Concerto Barocco, Agon, The Cage, Walpurchisnaught, La Valse, Dances at a Gathering, Slaughter on Tenth Avenue, In G Major, Cinderella, Other Dances, NY Export:Opus Jazz, Ballo della Regina, West Side Story Suite, and La Sylphide. She’s also performed leading works by some of ballet’s most noted contemporary choreographers, including Twyla Tharp, Alexi Ratmansky, Jiří Kylián, Wayne McGregor, Liam Scarlett, William Forsythe, Justin Peck, Mauro Bigonzetti and  Nacho Duato. Lauren originated featured roles in new works by Annabelle Lopez Ochoa, Nicolo Fonte, Matthew Neenan, Brian Brooks, Pam Tanowitz, Melissa Barak and Ratmansky.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.indyballet.org/faculty/lauren-veyette#:~:text=Head%20of%20School,the%20School%20of%20American%20Ballet.",
        "id": 2891423,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Lauren Fadeley",
        "place_of_birth": "Orlando, Florida, USA",
        "popularity": 0.0143,
        "profile_path": "/3Sv2bLOweJ5nghtTowc2dKHz1x.jpg"
    }
}