{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qxTw8OKJLRX1Xb5nR5CcIDnLKoq.jpg",
                "genre_ids": [
                    18,
                    53,
                    27
                ],
                "id": 44214,
                "original_language": "en",
                "original_title": "Black Swan",
                "overview": "The story of Nina, a ballerina in a New York City ballet company whose life, like all those in her profession, is completely consumed with dance. She lives with her retired ballerina mother Erica who zealously supports her daughter's professional ambition. When artistic director Thomas Leroy decides to replace prima ballerina Beth MacIntyre for the opening production of their new season, Swan Lake, Nina is his first choice.",
                "popularity": 7.3213,
                "poster_path": "/viWheBd44bouiLCHgNMvahLThqx.jpg",
                "release_date": "2010-12-03",
                "title": "Black Swan",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 15010,
                "character": "Ballet Mistress",
                "credit_id": "5fd5637760b58d003f83f9ab",
                "order": 34
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Alexandra Damiani is a French born choreographer, artistic director, and movement specialist who has lived in New York since 1995.  Her movement vocabulary combines the sophistication of her early classical training with the edginess and experimentation of contemporary dance.  She has brought her expertise to the cinema, commercials, festivals and  stages of international dance venues.  Damiani worked on numerous commercials and film projects including upcoming Bloch DanceWear campaign ( 2019), That Part (2017) - a women spoken word dance piece  directed by Mia Sorensen  - Esika (2017), Colgate (2016), Warby Parker (2016), Darren Aronofsky's award -winning Black Swan (2010), where she portrayed the role of a ballet mistress alongside Natalie Portman and Mila Kunis, as well as George Nolfi's Adjustment Bureau (2010), where she worked as movement consultant to Benoit Swan Pouffer on his work with Emily Blunt.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.damianidance.com/about",
        "id": 2891401,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Alexandra Damiani",
        "place_of_birth": "Paris, Ile-de-France, France",
        "popularity": 0.0143,
        "profile_path": "/GBVVKpPj3iTEoMLJIRK657VKqz.jpg"
    }
}