{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qxTw8OKJLRX1Xb5nR5CcIDnLKoq.jpg",
                "genre_ids": [
                    18,
                    53,
                    27
                ],
                "id": 44214,
                "original_language": "en",
                "original_title": "Black Swan",
                "overview": "The story of Nina, a ballerina in a New York City ballet company whose life, like all those in her profession, is completely consumed with dance. She lives with her retired ballerina mother Erica who zealously supports her daughter's professional ambition. When artistic director Thomas Leroy decides to replace prima ballerina Beth MacIntyre for the opening production of their new season, Swan Lake, Nina is his first choice.",
                "popularity": 7.3213,
                "poster_path": "/viWheBd44bouiLCHgNMvahLThqx.jpg",
                "release_date": "2010-12-03",
                "title": "Black Swan",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 15010,
                "character": "Ballet Mistress",
                "credit_id": "5fd5635d83ee67003da8f7d1",
                "order": 33
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Christine Redpath is a Ballet Master with New York City Ballet. Ms. Redpath joined NYCB as a corps member and was soon promoted to soloist performing principal roles in much of the Balanchine and Robbins repertoire as well as in ballets by other choreographers such as Ashton and Tudor. Her partners have included Peter Martins, Jacques D’Amboise and Helgi Tomasson and during her three years at the Zurich Ballet under the directorship of Patricia Neary, Rudolf Nureyev.\n\nAs a Ballet Master at NYCB she has worked with noted choreographers such as Lar Lubovitch, Laura Dean, Lynne Taylor-Corbett, Eliot Feld, Angelin Preljocaj, Mauro Bigonzetti, Helgi Tomasson and Susan Stroman. In addition to staging works for the Jerome Robbins and George Balanchine Trusts, she has re-staged works on many other companies such as The Paris Opera Ballet, The Royal Ballet of Flanders, The Australian Ballet, Pacific Northwest Ballet, Ballet British Columbia, The National Ballet of Canada and The San Francisco Ballet. In 2010 she played a ballet mistress in the movie Black Swan.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.staatsoper.de/en/biographies/redpath-christine",
        "id": 2891400,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Christine Redpath",
        "place_of_birth": null,
        "popularity": 0.0071,
        "profile_path": "/q16VuOubbfDvASAgBZlGxDx03Eu.jpg"
    }
}