{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ousBoWTm1CltjAGSYOELYP0jFFC.jpg",
                "genre_ids": [
                    80,
                    53
                ],
                "id": 1480,
                "original_language": "en",
                "original_title": "Touch of Evil",
                "overview": "When a car bomb explodes on the American side of the U.S./Mexico border, Mexican drug enforcement agent Miguel Vargas begins his investigation, along with American police captain Hank Quinlan. When Vargas begins to suspect that Quinlan and his shady partner, Menzies, are planting evidence to frame an innocent man, his investigations into their possible corruption quickly put himself and his new bride, Susie, in jeopardy.",
                "popularity": 2.8972,
                "poster_path": "/1pvRgmfBaoMczIJBOi9gCOZ4FMC.jpg",
                "release_date": "1958-03-30",
                "title": "Touch of Evil",
                "video": false,
                "vote_average": 7.8,
                "vote_count": 1511,
                "character": "Tana",
                "credit_id": "52fe42f8c3a36847f8030ccd",
                "order": 16
            },
            {
                "adult": false,
                "backdrop_path": "/bDsXa3PV3biQ8ZK1tQyK4vlkvCc.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 821,
                "original_language": "en",
                "original_title": "Judgment at Nuremberg",
                "overview": "In 1947, four German judges who served on the bench during the Nazi regime face a military tribunal to answer charges of crimes against humanity. Chief Justice Haywood hears evidence and testimony not only from lead defendant Ernst Janning and his defense attorney Hans Rolfe, but also from the widow of a Nazi general, an idealistic U.S. Army captain and reluctant witness Irene Wallner.",
                "popularity": 5.8267,
                "poster_path": "/b6vYatvui1EXeFYfpDX4rcbueuP.jpg",
                "release_date": "1961-12-18",
                "title": "Judgment at Nuremberg",
                "video": false,
                "vote_average": 8.025,
                "vote_count": 864,
                "character": "Mrs. Bertholt",
                "credit_id": "52fe427bc3a36847f80224ad",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/evUB9YKE5IPPtQOchcEF6hS90BO.jpg",
                "genre_ids": [
                    18,
                    9648,
                    80
                ],
                "id": 37257,
                "original_language": "en",
                "original_title": "Witness for the Prosecution",
                "overview": "An ailing barrister agrees to defend a man in a sensational murder trial where the unconvincing testimony of the defendant's wife becomes a subject of confusion.",
                "popularity": 4.358,
                "poster_path": "/bCj4EfuehAlgBwVd3diyWyhuuau.jpg",
                "release_date": "1957-12-17",
                "title": "Witness for the Prosecution",
                "video": false,
                "vote_average": 8.214,
                "vote_count": 1541,
                "character": "Christine",
                "credit_id": "52fe46379251416c9104d261",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            " Marlena Dietrichová ",
            "მარლენ დიტრიხი",
            "Marie Magdalene Dietrich ",
            "玛琳·黛德丽",
            "Marie Magdalene von Losch"
        ],
        "biography": "Marlene Dietrich (1901–1992) was a German-American actress and singer, widely regarded as one of the most iconic figures of classic Hollywood. She rose to fame in the 1930s with films like The Blue Angel, Shanghai Express, and Destry Rides Again, captivating audiences with her sultry voice, striking beauty, and androgynous style. Known for her ability to reinvent herself, Dietrich transitioned from film star to a celebrated cabaret performer, touring internationally for decades.\n\nBeyond her career, Dietrich was known for her progressive views and unconventional lifestyle. She openly defied gender norms, often wearing men's clothing both on and off-screen, which contributed to her enigmatic persona. Her personal life has long been the subject of speculation, particularly regarding her sexuality. While she was married to Rudolf Sieber, she was rumored to have had relationships with both men and women, including actresses Claudette Colbert and Mercedes de Acosta. Some sources suggest she was part of Hollywood’s so-called “sewing circle,” a network of women engaged in same-sex relationships. However, Dietrich never publicly confirmed these rumors, maintaining an air of mystery that only added to her legendary status.\n\nHer legacy continues to inspire discussions on gender, sexuality, and Hollywood’s golden age.",
        "birthday": "1901-12-27",
        "deathday": "1992-05-06",
        "gender": 1,
        "homepage": "http://www.marlene.com",
        "id": 2896,
        "imdb_id": "nm0000017",
        "known_for_department": "Acting",
        "name": "Marlene Dietrich",
        "place_of_birth": "Berlin, Germany",
        "popularity": 1.1354,
        "profile_path": "/9AxXKUr9CLfy5Lcg3JaNRbWD6Be.jpg"
    }
}