{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zSFuvi6fIPT8CHpH1KMG25T2Iub.jpg",
                "genre_ids": [
                    80,
                    18,
                    878,
                    53
                ],
                "id": 281,
                "original_language": "en",
                "original_title": "Strange Days",
                "overview": "Former policeman Lenny Nero has moved into a more lucrative trade: the illegal sale of virtual reality-like recordings that allow users to experience the emotions and past experiences of others. While they typically contain tawdry incidents, Nero is shocked when he receives one showing a murder.",
                "popularity": 6.4045,
                "poster_path": "/rY5BrDRcYAKE0BYmmT66YG6Uy5Q.jpg",
                "release_date": "1995-10-13",
                "title": "Strange Days",
                "video": false,
                "vote_average": 7.004,
                "vote_count": 1431,
                "character": "New Years Reveler (uncredited)",
                "credit_id": "6410e701fe6c1800f9bcce70",
                "order": 70
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Johnny Driftwood",
            "Indiandrew Jones"
        ],
        "biography": "Andrew Calder is a filmmaker, writer, and creative visionary known for his bold storytelling and genre-defying projects. As the founder of 𝗕𝗟𝗔𝗖𝗞 𝗪𝗢𝗟𝗙 𝗖𝗢𝗨𝗡𝗧𝗥𝗬, Calder has cultivated a distinctive voice that fuses raw authenticity with deep philosophical and social themes. His work spans 𝙛𝙞𝙡𝙢, 𝙩𝙚𝙡𝙚𝙫𝙞𝙨𝙞𝙤𝙣, 𝙢𝙪𝙨𝙞𝙘, 𝙡𝙞𝙩𝙚𝙧𝙖𝙩𝙪𝙧𝙚, and 𝙗𝙧𝙖𝙣𝙙𝙞𝙣𝙜, consistently pushing the boundaries of narrative structure and artistic expression.\n\nCalder is currently developing multiple film and television projects, including 𝙇𝙤𝙬𝙚𝙨𝙩 𝘿𝙚𝙥𝙩𝙝𝙨, a darkly poetic character study inspired by his time in Cambridge, Massachusetts, and 𝙏𝙝𝙚 𝙒𝙖𝙡𝙡 𝙎𝙩𝙧𝙚𝙚𝙩 𝙂𝙚𝙣𝙞𝙪𝙨𝙚𝙨 𝙒𝙝𝙤 𝙇𝙤𝙤𝙠𝙚𝙙 𝙏𝙤𝙩𝙖𝙡𝙡𝙮 𝙎𝙩𝙪𝙥𝙞𝙙, an exploration of the financial and ideological battles surrounding the rise of Tesla and Elon Musk. His extensive portfolio also includes the period drama DEPTHS, the animated children's fantasy 𝙊𝙣𝙘𝙚 𝙐𝙥𝙤𝙣 𝙖 𝙏𝙞𝙢𝙚, and the edgy rock ‘n’ roll battle comedy film 𝙅𝙖𝙘𝙠 𝙒𝙝𝙞𝙩𝙚 𝙫𝙨. 𝙅𝙖𝙘𝙠 𝘽𝙡𝙖𝙘𝙠.\n\nBeyond film, Calder has made a name for himself in branding and storytelling, collaborating with Irish singer songwriter 𝘿𝙖𝙢𝙞𝙚𝙣 𝙍𝙞𝙘𝙚, inspiring 𝘼𝙣𝙝𝙚𝙪𝙨𝙚𝙧-𝘽𝙪𝙨𝙘𝙝’𝙨, 𝘿𝙤𝙘 𝙊𝙩𝙞𝙨 𝙃𝙖𝙧𝙙 𝙇𝙚𝙢𝙤𝙣 creating the artisanal energy gum 𝗕𝗟𝗔𝗖𝗞 𝗪𝗢𝗟𝗙 𝗚𝗨𝗠 and conceptualizing innovative marketing campaigns inspired by viral brands like Liquid Death. His writing spans screenplays, novels, and immersive world-building, all infused with his signature wit, depth, and curiosity.\n\nWith a background in 𝙢𝙪𝙨𝙞𝙘, 𝙗𝙪𝙨𝙞𝙣𝙚𝙨𝙨, and 𝙨𝙩𝙤𝙧𝙮𝙩𝙚𝙡𝙡𝙞𝙣𝙜, Calder continues to craft narratives that challenge, entertain, and inspire, cementing his reputation as a multi-disciplinary creator in the entertainment industry.",
        "birthday": "1964-03-20",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.andrewcalder.com",
        "id": 2906886,
        "imdb_id": "nm0129456",
        "known_for_department": "Acting",
        "name": "Andrew Calder",
        "place_of_birth": "Montreal, Quebec, Canada",
        "popularity": 0.0261,
        "profile_path": "/ja1AETF5zkz0Cm4cBgueyYFAAg6.jpg"
    }
}