{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kLVWvnUdqQ07WjbAYGpmiD2ZFQa.jpg",
                "genre_ids": [
                    10402,
                    35,
                    10751,
                    14,
                    18
                ],
                "id": 10437,
                "original_language": "en",
                "original_title": "The Muppet Christmas Carol",
                "overview": "A retelling of the classic Dickens tale of Ebenezer Scrooge, miser extraordinaire. He is held accountable for his dastardly ways during night-time visitations by the Ghosts of Christmas Past, Present and Future.",
                "popularity": 3.2047,
                "poster_path": "/ssrV29QSVVJuemBHho0Qx7pFYak.jpg",
                "release_date": "1992-12-11",
                "title": "The Muppet Christmas Carol",
                "video": false,
                "vote_average": 7.42,
                "vote_count": 1071,
                "character": "Additional Muppet Performer (voice)",
                "credit_id": "5f3a454cc5840d0032a312bf",
                "order": 35
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "John Eccleston is an English puppeteer, writer and presenter known for his work as lead puppeteer of Rygel on Farscape,[1] Groove on The Hoobs and his many roles on British children's television alongside Don Austen. He was also behind the character Gilbert the Alien (voiced by Phil Cornwell) on Get Fresh. He also performed Worth the Dog in the Woolworths adverts (again opposite Don Austen as Wooly The Sheep), Mervin J Minky on MTV's Fur TV and Rattus Rattus on the CBBC Horrible Histories series.\n\nHis \"in vision\" television career started as one of the original presenters of the UK version of the Mickey Mouse Club, Disney Club, the success of which led to his presenting Run the Risk, The Big Dish, the children's magazine show Brill and Get The Picture, for Nickelodeon. It took seven years for him to realise he did not like being pointed at in the street and he has remained off screen ever since.\n\nEccleston, who hails from Cumbria, worked alongside Don Austen on the Saturday morning children's show What's Up Doc?, operating and providing the voices for the puppet wolves Bro and Bro. Their writing skill on this show garnered a spin-off ITV show called Wolf It!. Eccleston was approached to provide new characters for the BBC series Live & Kicking, once again teaming up with Don Austen and Darryl Worbey to create two puppet leprechauns, Mr Sage and Mr Onion. The characters appeared from 1995 to 2001, outliving three sets of presenters.[4] Eccleston, Austen and Worbey teamed up again to create the hyenas Scratch and Sniff (with Eccleston playing Sniff) on The Ministry of Mayhem, later renamed Holly & Stephen's Saturday Showdown. The characters recorded fifteen episodes of the game show Scratch 'n' Sniff's Den of Doom for Granada Kids. Eccleston also appeared in the award-winning short film The Box, directed by Michael J. Bassett, and also starring Paul Hendy, Richard Orford and Laurence Akers. Between 1996–1997, he participated on the second and third series of Jim Henson's Animal Show, manipulating the puppet Yves St. La Roache, among others.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 291223,
        "imdb_id": "nm0248341",
        "known_for_department": "Acting",
        "name": "John Eccleston",
        "place_of_birth": null,
        "popularity": 0.0311,
        "profile_path": "/6bGvNjSJn7SeetF6RLgdUDBekVS.jpg"
    }
}