{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6a33h1vTe9smgilmXLrDZ6lepI.jpg",
                "genre_ids": [
                    10749,
                    878,
                    18
                ],
                "id": 818750,
                "original_language": "en",
                "original_title": "The In Between",
                "overview": "After surviving a car accident that took the life of her boyfriend, a teenage girl believes he's attempting to reconnect with her from the after world.",
                "popularity": 3.4116,
                "poster_path": "/7RcyjraM1cB1Uxy2W9ZWrab4KCw.jpg",
                "release_date": "2022-02-11",
                "title": "The In Between",
                "video": false,
                "vote_average": 7.346,
                "vote_count": 803,
                "character": "Monitor",
                "credit_id": "622f664a98f1f100459f6650",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Becki Hayes is a Texas-born SAG-AFTRA actress known for both deaf and hearing roles. Born with a hereditary, progressive hearing loss, Becki's hearing rapidly declined, rendering her profoundly deaf by age 12.\n\nBecki made her network TV debut in ABC's \"Gideons Crossing\" opposite Academy Award winner Marlee Matlin, portraying a deaf teen at odds with her parents over cochlear implants. Life imitated art for Becki, as shortly after the show aired, she underwent bilateral cochlear implant surgery.\n\nShe considers her former deafness a gift to her craft. \"When one sense is absent, the other senses are heightened immensely. I had to become such an intense listener by necessity. In conversation, I was hyper focused on facial cues and body language to kind of fill in the gaps when words were unclear and provide context clues in order to react appropriately. My superpower is \"hearing\" beyond the spoken. It's authentic acting gold. I'm very lucky!\"\n\nBecki is currently developing a dramedy (2020) based on her own adventures as a formerly deaf wife and mother adjusting to life changes after cochlear implants.",
        "birthday": null,
        "deathday": null,
        "gender": 0,
        "homepage": null,
        "id": 2912947,
        "imdb_id": "nm1527250",
        "known_for_department": "Acting",
        "name": "Becki Hayes",
        "place_of_birth": null,
        "popularity": 0.0286,
        "profile_path": "/iBLrHORMqfYXk5R7s5wz9sbFVHe.jpg"
    }
}