{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/u06SympEEMb7pLhR9W3tvydHT9L.jpg",
                "genre_ids": [
                    27,
                    14
                ],
                "id": 653,
                "original_language": "de",
                "original_title": "Nosferatu, eine Symphonie des Grauens",
                "overview": "The mysterious Count Orlok summons Thomas Hutter to his remote Transylvanian castle in the mountains. The eerie Orlok seeks to buy a house near Hutter and his wife, Ellen. After Orlok reveals his vampire nature, Hutter struggles to escape the castle, knowing that Ellen is in grave danger. Meanwhile Orlok's servant, Knock, prepares for his master to arrive at his new home.",
                "popularity": 4.6315,
                "poster_path": "/zv7J85D8CC9qYagAEhPM63CIG6j.jpg",
                "release_date": "1922-02-16",
                "title": "Nosferatu",
                "video": false,
                "vote_average": 7.672,
                "vote_count": 2302,
                "character": "Child at Window (uncredited)",
                "credit_id": "5d29383ba294f000102ae035",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Eleonore Nest"
        ],
        "biography": "She was born Eleonore Nest on August 4, 1915, in Berlin to American parents who were Methodist missionaries. During her parents' time as missionaries, she was discovered by a German movie producer on a poster promoting a Sunday school program. She was soon asked to work in movies. With the permission of her parents, she acted in her first movie in 1918. She used the name Loni Nest instead of Eleonore Nest. Between 1918 and 1933, she starred in 41 movies, opposite such actors as Charles Boyer, Greta Garbo, Marlene Dietrich and Fritz Feld.\n\nNest left movies in 1933 to move back to her parents' original home in Boston. She left to focus on the family's involvment in a new Methodist church, where her father would serve as deacon. She also wanted to leave Germany as soon as possible due in part to the rise of Nazism that began when Adolf Hitler took power. Nest enrolled in college, and then became a music teacher. She worked for public schools in Massachussetts for over 40 years.\n\nIn 1938, she married businessman Roy Smythe. Smythe went on to establish his own car dealership that remained in place until his death in 1987. Nest became the mother of three children. She moved to Honolulu, Hawaii, to live with her daughter after the death of her husband. She spent the rest of her life volunteering at a local hospital as well as being active in her local Methodist church.\n\nShe died of old age on February 17, 2014. She was 98",
        "birthday": "1915-08-04",
        "deathday": "1990-10-02",
        "gender": 1,
        "homepage": null,
        "id": 29183,
        "imdb_id": "nm0626520",
        "known_for_department": "Acting",
        "name": "Loni Nest",
        "place_of_birth": "Berlin, Germany",
        "popularity": 0.053,
        "profile_path": "/qZS3qAKfqcVADqSdq9x0kLC1isH.jpg"
    }
}