{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hrED8MSOn4xJP9Cpk7WomUcFKGI.jpg",
                "genre_ids": [
                    27,
                    878
                ],
                "id": 229,
                "original_language": "en",
                "original_title": "Bride of Frankenstein",
                "overview": "Dr. Frankenstein and his monster both turn out to be alive, not killed as previously believed. Dr. Frankenstein wants to get out of the evil experiment business, but when a mad scientist, Dr. Pretorius, kidnaps his wife, Dr. Frankenstein agrees to help him create a new creature.",
                "popularity": 2.9539,
                "poster_path": "/5241zUwe7rC17MNc2QpCBKKdp1N.jpg",
                "release_date": "1935-04-20",
                "title": "Bride of Frankenstein",
                "video": false,
                "vote_average": 7.509,
                "vote_count": 1037,
                "character": "Henry Frankenstein",
                "credit_id": "52fe4229c3a36847f8008d45",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/wFbPbJ9uRDpjY7micBTeolgkOA4.jpg",
                "genre_ids": [
                    18,
                    27,
                    878
                ],
                "id": 3035,
                "original_language": "en",
                "original_title": "Frankenstein",
                "overview": "Tampering with life and death, Henry Frankenstein pieces together salvaged body parts to bring a human monster to life; the mad scientist's dreams are shattered by his creation's violent rage as the monster awakens to a world in which he is unwelcome.",
                "popularity": 5.6174,
                "poster_path": "/mu6wHwH0IwCCaEYtpqujuPJYat1.jpg",
                "release_date": "1931-11-21",
                "title": "Frankenstein",
                "video": false,
                "vote_average": 7.464,
                "vote_count": 1679,
                "character": "Henry Frankenstein",
                "credit_id": "52fe437fc3a36847f8058831",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Colin Glenn Clive-Greig"
        ],
        "biography": "Colin Clive was born to a British colonel and his wife in St. Malo, France on 20 January 1900. His schooling was at the Convent of the Holy Cross, Boscombe, and Stonyhurst College, in preparation for entering Sandhurst, the British royal military academy. Unfortunately, a riding accident shattered the young man's knee and disqualified him for military service. Clive entered the Royal Academy of Dramatic Arts, making his debut in 1919 as 'Claude' in The Eclipse. After almost ten years of touring, he was chosen for the role of 'Stanhope' in the war play Journey's End, replacing Laurence Olivier who had another commitment. Journey's End was Clive's beginning  and his end. Both the actor and the character were alcoholics - Clive to relieve monstrous stage fright, Stanhope to numb the agonies of war. When Journey's End was filmed in 1929, Clive started his film career. He made 18 films, each stylish, quirky, and highly individualistic. Colin Clive died in Los Angeles, California on 25 June 1937, of tuberculosis worsened by chronic alcoholism. He was 37 years old.",
        "birthday": "1900-01-20",
        "deathday": "1937-06-25",
        "gender": 2,
        "homepage": null,
        "id": 2923,
        "imdb_id": "nm0166972",
        "known_for_department": "Acting",
        "name": "Colin Clive",
        "place_of_birth": "Saint-Malo, Brittany, France",
        "popularity": 0.191,
        "profile_path": "/Art7y90nUxO1EaalywuJ7xCex9l.jpg"
    }
}