{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/r95IP56O3j8fz9a09x55lymr9uJ.jpg",
                "genre_ids": [
                    10749,
                    18
                ],
                "id": 2977,
                "original_language": "en",
                "original_title": "Becoming Jane",
                "overview": "Though young Jane Austen's financially strapped parents expect her to marry the nephew of wealthy Lady Gresham, Jane herself knows that such a union will destroy her creativity and sense of self-worth. Instead, she becomes involved with Tom Lefroy, a charming but penniless apprentice lawyer who gives her the knowledge of the heart she needs for her future career as a novelist.",
                "popularity": 2.8351,
                "poster_path": "/yHA6JEn57MBGp2yGFgYyopJvk2O.jpg",
                "release_date": "2007-03-02",
                "title": "Becoming Jane",
                "video": false,
                "vote_average": 7.31,
                "vote_count": 1207,
                "character": "Eliza de Feuillide",
                "credit_id": "52fe4378c3a36847f80569b7",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Lucy Anne Cohu",
            "لوسی کوهو"
        ],
        "biography": "Lucy Ann Cohu, an English stage, film, and television actress, was born on 2 October 1968 in Swindon, Wiltshire, England.  She attended Stamford High School, a boarding school in Lincolnshire, during her childhood.  Cohu trained at the Royal Central School of Speech and Drama, where she also met her future husband, actor Corey Johnson.  Her first acting job after drama school was in a production of Jane Austen's Pride and Prejudice at the Royal Exchange Theatre in Manchester.  She made her television debut in an episode of Casualty and went on to work extensively in British television, including roles in Soldier Soldier and other series.\n\nCohu is known for her portrayals of Princess Margaret in the Channel 4 drama The Queen's Sister (2005), Evelyn Brogan in Cape Wrath, and Alice Carter in Torchwood: Children of Earth.  Her performance as Princess Margaret earned her nominations for both an Emmy and a BAFTA award, with critics praising her interpretation of the character as energetic and vibrant, contrasting with previous depictions.  She has also appeared in films such as Gosford Park and Becoming Jane.  In 2018, she received positive reviews for her performance in the play Speaking in Tongues at the Duke of York's Theatre.  She has also appeared in Arthur Miller's Broken Glass at the Tricycle Theatre and was scheduled to perform in Dawn King’s play ‘The Trials’ at the Donmar Warehouse in London in August 2022.\n\nCohu was married to actor Corey Johnson from 1994 to 2005, and the couple has two children: Alexander, born in 2000, and Lila, born in 2002.  She lives in Kensal Green, Brent, London.  Before achieving success in acting, Cohu performed at children's parties and has stated that had she not become an actress, she would have pursued a career in children's nursing.  In November 2008, she won an International Emmy Award for Best Actress for her role in the true-life drama Forgiven.",
        "birthday": "1968-10-02",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 29235,
        "imdb_id": "nm0169982",
        "known_for_department": "Acting",
        "name": "Lucy Cohu",
        "place_of_birth": "Swindon, Wiltshire, England, UK",
        "popularity": 0.9664,
        "profile_path": "/9tsv4C9IkyirnEefFQuU4I0XTAW.jpg"
    }
}