{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hrED8MSOn4xJP9Cpk7WomUcFKGI.jpg",
                "genre_ids": [
                    27,
                    878
                ],
                "id": 229,
                "original_language": "en",
                "original_title": "Bride of Frankenstein",
                "overview": "Dr. Frankenstein and his monster both turn out to be alive, not killed as previously believed. Dr. Frankenstein wants to get out of the evil experiment business, but when a mad scientist, Dr. Pretorius, kidnaps his wife, Dr. Frankenstein agrees to help him create a new creature.",
                "popularity": 2.9539,
                "poster_path": "/5241zUwe7rC17MNc2QpCBKKdp1N.jpg",
                "release_date": "1935-04-20",
                "title": "Bride of Frankenstein",
                "video": false,
                "vote_average": 7.509,
                "vote_count": 1037,
                "character": "Burgomaster",
                "credit_id": "52fe4229c3a36847f8008d61",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/uGXid3UHMzoL2hyNfWSPDWkqbKC.jpg",
                "genre_ids": [
                    27,
                    878
                ],
                "id": 10787,
                "original_language": "en",
                "original_title": "The Invisible Man",
                "overview": "After experimenting on himself and becoming invisible, scientist Jack Griffin, now aggressive due to the drug's effects, seeks a way to reverse the experiment at any cost.",
                "popularity": 2.2867,
                "poster_path": "/ewfUA5pMEJrmQCdI4TsHmLlIUbf.jpg",
                "release_date": "1933-11-03",
                "title": "The Invisible Man",
                "video": false,
                "vote_average": 7.507,
                "vote_count": 893,
                "character": "Constable Jaffers",
                "credit_id": "52fe43b79251416c7501b5cf",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Edward Erskholme Clive",
            "Edward E. Clive",
            "E. E. Clive"
        ],
        "biography": "Edward Erskholme Clive was a Welsh stage actor and director who had a prolific acting career in Britain and America. He also played numerous supporting roles in Hollywood movies between 1933 and his death. E. E. Clive was born on 28 August 1879 in Blaenavon in Monmouthshire. Clive studied for a medical career, and had completed four years of medical studies at St Bartholomew's Hospital before switching his focus to acting at age 22. Touring the provinces for a decade, Clive became an expert at virtually every sort of regional dialect in the British Isles. He moved to the US in 1912, where after working in the Orpheum vaudeville circuit he set up his own stock company in Boston. By the 1920s, his company was operating in Hollywood; among his repertory players were such up-and-comers as Rosalind Russell. He also worked at the Broadway in several plays. E. E. Clive made his film debut as a village police constable in 1933's The Invisible Man with Claude Rains, then spent the next seven years showing up in wry supporting and bit parts, where he often portrayed comical versions of English stereotypes. He often played butlers, reporters, aristocrats, shopkeepers and cabbies during his short film career. Though his roles were often small, Clive was a well-known and prolific character actor of his time. Among his best-known roles was the incompetent Burgomaster in James Whale's horror classic Bride of Frankenstein (1935). He was a semi-regular as Tenny the Butler in Paramount Pictures' Bulldog Drummond B series, starring John Howard; he also played butlers in other movies like Bachelor Mother with David Niven and Ginger Rogers. In 1939, Clive appeared in The Little Princess as the lawyer Mr. Barrows, and the first two entries of the classic Sherlock Holmes series starring Basil Rathbone. One of Clive's last roles was Sir William Lucas in the 1940 literature adaption Pride and Prejudice (1940) with Laurence Olivier and Greer Garson. E. E. Clive died on 6 June 1940, of a heart ailment, in his Hollywood home. He was survived by his wife Eleanor and their child. Clive was a member of the Euclid lodge of Freemasons in Boston.",
        "birthday": "1879-08-26",
        "deathday": "1940-06-06",
        "gender": 2,
        "homepage": null,
        "id": 2930,
        "imdb_id": "nm0166974",
        "known_for_department": "Acting",
        "name": "E. E. Clive",
        "place_of_birth": "Blaenavon, Monmouthshire, Wales, UK",
        "popularity": 0.1727,
        "profile_path": "/5jN00ac4hKNMRh4xpVVSNI89Blu.jpg"
    }
}