{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bWftGh0aLMzb8wetgziLq3fHpTJ.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 9769,
                "original_language": "en",
                "original_title": "Lolita",
                "overview": "Humbert Humbert is a middle-aged British novelist who is both appalled by and attracted to the vulgarity of American culture. When he comes to stay at the boarding house run by Charlotte Haze, he soon becomes obsessed with Lolita, the woman's teenaged daughter.",
                "popularity": 10.0685,
                "poster_path": "/9INcC14WZjCMKGE360VXmklCLdZ.jpg",
                "release_date": "1997-09-27",
                "title": "Lolita",
                "video": false,
                "vote_average": 7.135,
                "vote_count": 1876,
                "character": "Charlotte Haze",
                "credit_id": "52fe4529c3a36847f80bfd73",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/1hdorswm5HPxb81xq84H9gqveUq.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 371638,
                "original_language": "en",
                "original_title": "The Disaster Artist",
                "overview": "An aspiring actor in Hollywood meets an enigmatic stranger by the name of Tommy Wiseau, the meeting leads the actor down a path nobody could have predicted; creating the worst movie ever made.",
                "popularity": 2.2443,
                "poster_path": "/2HuLGiyH0TPYxnCvYHAxc8K738o.jpg",
                "release_date": "2017-03-12",
                "title": "The Disaster Artist",
                "video": false,
                "vote_average": 7.107,
                "vote_count": 3619,
                "character": "Jean Shelton",
                "credit_id": "573037409251415cc1004cce",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Melanie Richards Griffith",
            "Мелані Гріффіт",
            "ملانی گریفیت",
            "مِلانی گریفیت"
        ],
        "biography": "Melanie Richards Griffith (born August 9, 1957) is an American actress. She began her career in the 1970s, appearing in several independent thriller films before achieving mainstream success in the mid-1980s.\n\nBorn in New York City to actress Tippi Hedren and advertising executive Peter Griffith, she was raised mainly in Los Angeles, where she graduated from the Hollywood Professional School at age 16. In 1975, a then 17-year-old Griffith appeared opposite Gene Hackman in Arthur Penn's film noir Night Moves. She later rose to prominence for her role portraying a pornographic actress in Brian De Palma's thriller Body Double (1984), which earned her a National Society of Film Critics Award for Best Supporting Actress. Griffith's subsequent performance in the comedy Something Wild (1986) garnered critical acclaim before she was cast in 1988's Working Girl, which earned her a nomination for the Academy Award for Best Actress and won her a Golden Globe.\n\nThe 1990s had Griffith in a series of roles that received varying critical reception; she received Golden Globe nominations for her performances in Buffalo Girls (1995), and as Marion Davies in RKO 281 (1999), while also earning a Golden Raspberry Award for Worst Actress for her performances in Shining Through (1992), as well as receiving nominations for Crazy in Alabama (1999) and John Waters' cult film Cecil B. Demented (2000). Other credits include John Schlesinger's Pacific Heights (1990), Milk Money (1994), the neo-noir film Mulholland Falls (1996), as Charlotte Haze in Adrian Lyne's Lolita (1997), and Another Day in Paradise (1998).\n\nShe later starred as Barbara Marx in The Night We Called It a Day (2003), and spent the majority of the 2000s appearing on such television series as Nip/Tuck, Raising Hope, and Hawaii Five-0. After acting on stage in London, in 2003, she made her Broadway debut in a revival of the musical Chicago, receiving celebratory reviews. In the 2010s, Griffith returned to film, starring opposite then-husband Antonio Banderas in the science-fiction film Autómata (2014) and as an acting coach in James Franco's The Disaster Artist (2017).",
        "birthday": "1957-08-09",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 29369,
        "imdb_id": "nm0000429",
        "known_for_department": "Acting",
        "name": "Melanie Griffith",
        "place_of_birth": "Manhattan, New York City, New York, USA",
        "popularity": 2.3687,
        "profile_path": "/mq5VpOSPlNxSHqccXXZiy0LBXgC.jpg"
    }
}