{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kGzFbGhp99zva6oZODW5atUtnqi.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 240,
                "original_language": "en",
                "original_title": "The Godfather Part II",
                "overview": "In the continuing saga of the Corleone crime family, a young Vito Corleone grows up in Sicily and in 1910s New York. In the 1950s, Michael Corleone attempts to expand the family business into Las Vegas, Hollywood and Cuba.",
                "popularity": 16.2247,
                "poster_path": "/hek3koDUyRQk7FIhPXsa6mT2Zc3.jpg",
                "release_date": "1974-12-20",
                "title": "The Godfather Part II",
                "video": false,
                "vote_average": 8.57,
                "vote_count": 13187,
                "character": "Guest (uncredited)",
                "credit_id": "6853fcdce899fc13ff0cf2c7",
                "order": 83
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Laura Aldridge"
        ],
        "biography": "Busty, foxy and shapely brunette looker Laura Lyons was born on October 22, 1954 in Los Angeles, California. She has four younger brothers. Lyons worked as a Bunny at the Playboy Club in Chicago, Illinois and as a Jet Bunny on the \"Playboy\" DC-9 jet airliner. While working as a Bunny at the Playboy Club in Chicago, Laura led the other Bunnies on a brief strike; she requested that the Bunnies should get extra privileges, including the right to date customers and socialize at the clubs after hours. These requests were granted by \"Playboy\" editor/publisher Hugh Hefner. Lyons was the Playmate of the Month in the February, 1976 issue of \"Playboy\". Laura not only made a guest appearance on an episode of the TV series, Love, American Style (1969), but also has an uncredited bit part in The Godfather: Part II (1974) and a more sizable co-starring role as \"Cynthia Madison\" in the cruddy \"Jaws\" rip-off, Tintorera: Killer Shark (1977). Lyons eventually got married and had three children.",
        "birthday": "1954-10-22",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 2939219,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Laura Lyons",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.0709,
        "profile_path": "/rAH7M99HUXXkG2eKqjMy6uy507f.jpg"
    }
}