{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/aRKEjGZEg3YwiuDVgyJpY6TUiE4.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 12548,
                "original_language": "it",
                "original_title": "I vitelloni",
                "overview": "Five young men dream of success as they drift lazily through life in a small Italian village. Fausto, the group's leader, is a womanizer; Riccardo craves fame; Alberto is a hopeless dreamer; Moraldo fantasizes about life in the city; and Leopoldo is an aspiring playwright. As Fausto chases a string of women, to the horror of his pregnant wife, the other four blunder their way from one uneventful experience to the next.",
                "popularity": 1.6794,
                "poster_path": "/boqcM6bhQICnNue4pkgmauj9JN3.jpg",
                "release_date": "1953-09-17",
                "title": "I Vitelloni",
                "video": false,
                "vote_average": 7.652,
                "vote_count": 705,
                "character": "Narrator (voice) (uncredited)",
                "credit_id": "5c24f8360e0a264ddbf37136",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Riccardo Cucciolla (5 September 1924 – 17 September 1999) was an Italian actor and voice actor. He appeared in 60 films between 1953 and 1999. He won the Best Actor Award at the 1971 Cannes Film Festival for the film Sacco & Vanzetti.\n\nBorn in Bari, in southern Italy, Cucciolla gained a degree in law, then made his stage debut in an amateur production in his home city. From 1946, he started working in radio as a voice actor and as the narrator of documentaries; at the same time, he started working in cinema, as a dubber and a voice actor.\n\nCucciolla made his film debut in 1953, in Anton Giulio Majano's Good Folk's Sunday. After some minor roles, he had his first important role in Italiani brava gente (1965), followed by a further significant role in Giuliano Montaldo's Grand Slam (1967).\n\nCucciolla came to national and international recognition with the leading role in Montaldo's Sacco e Vanzetti, for which he was awarded best actor at Cannes and won a Silver Ribbon. In the wake of that sudden popularity, he intensively worked throughout the decade, alternating notable films with others of more modest quality and ambition. Starting from eighties he thinned out his appearances, mainly focusing on dubbing and television roles. As a dubber, he provided voice-overs for Roger Moore, Claudio Villa, Erland Josephson, John Cazale, Jonathan Pryce, Richard Egan, James Caan, Robert Duvall and more.\n\nOn 17 September 1999, Cucciolla died in Rome at the age of 75. He is survived by his wife, the poet Alida Sessa; their son Riccardo; and two children by his first wife, Francesco and Lietta.\n\nSource: Article \"Riccardo Cucciolla\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1924-09-05",
        "deathday": "1999-09-17",
        "gender": 2,
        "homepage": null,
        "id": 29429,
        "imdb_id": "nm0190977",
        "known_for_department": "Acting",
        "name": "Riccardo Cucciolla",
        "place_of_birth": "Bari, Puglia, Italy",
        "popularity": 0.3473,
        "profile_path": "/xIGvGLXRTitBTGfm5WbsRIVBruU.jpg"
    }
}