{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hNCqkXbWd40eftqSdjq8TmV7Mqr.jpg",
                "genre_ids": [
                    18,
                    878,
                    9648
                ],
                "id": 329865,
                "original_language": "en",
                "original_title": "Arrival",
                "overview": "Taking place after alien crafts land around the world, an expert linguist is recruited by the military to determine whether they come in peace or are a threat.",
                "popularity": 17.1934,
                "poster_path": "/x2FJsf1ElAgr63Y3PNPtJrcmpoe.jpg",
                "release_date": "2016-11-10",
                "title": "Arrival",
                "video": false,
                "vote_average": 7.619,
                "vote_count": 18547,
                "character": "Chinese Scientist",
                "credit_id": "577ddc619251415d91004f46",
                "order": 23
            },
            {
                "adult": false,
                "backdrop_path": "/kv9xVrxfLpudBLyYf1QvLCpUQuy.jpg",
                "genre_ids": [
                    36,
                    18
                ],
                "id": 1182047,
                "original_language": "en",
                "original_title": "The Apprentice",
                "overview": "A young Donald Trump, eager to make his name as a hungry scion of a wealthy family in 1970s New York, comes under the spell of Roy Cohn, the cutthroat attorney who would help create the Donald Trump we know today. Cohn sees in Trump the perfect protégé—someone with raw ambition, a hunger for success, and a willingness to do whatever it takes to win.",
                "popularity": 5.0229,
                "poster_path": "/zxA7bL9qOnU49NXIqpnyJlRvkqs.jpg",
                "release_date": "2024-10-09",
                "title": "The Apprentice",
                "video": false,
                "vote_average": 6.909,
                "vote_count": 734,
                "character": "Creditor",
                "credit_id": "667adeadfd72ccfdce5a35fa",
                "order": 47
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Russell Yven",
            "Russell J. Yuen",
            "Russel Yuen",
            "袁罗素"
        ],
        "biography": "Toronto/Montreal-based Russell Yuen is one of Canada's busiest character actors.\n\nLike most actors Yuen spent his early career doing an assortment of jobs to make ends meet while he became established. Unlike most actors it wasn't waiting tables or serving drinks. A dedicated athlete, Yuen spent his time as a white water rescuer and rafting guide in Northern Quebec, ran a Nautilus facility and worked as a fitness trainer. Yuen is also an enthusiastic scuba diver, a mountain and ice-climber, an in-line skater, a mountain biker and a fencer.\n\nA former martial artist in Shaolin, Yuen used his stunt skills to move from bit parts, playing Asian gangsters and fighters, into meatier roles. His breakout opportunity came with The Red Violin and more feature film parts quickly followed for this versatile young actor whose skills range from action, to drama, to broad comedy. Other screen performances include Bulletproof Monk directed by John Woo, Owning Mahoney and Long Life, Happiness and Prosperity. He has appeared in Billy Ray's Shattered Glass, David Weaver's Indie feature Century Hotel; Between the Moon and Montevideo; Phillip Noyce's The Bone Collector, opposite Denzel Washington; David Mamet's The Heist; Ron Underwood's Pluto Nash, opposite Eddie Murphy, and Stephan Elliot's Eye Of The Beholder. Well known to Quebec audiences for his film work Yuen starred in the Quebec feature film Ballade des Dangereux, directed by Louis Saia.\n\nYuen has an extensive list of television credits on both English and French projects and series. He was most recently featured on the popular French series Jack Carter, in the recurring role of impotent mobster \"Wong Phat\". He has a recurring role in Diva and other recent television credits include principal roles in: Relic Hunter; The Associates; A Touch of Hope; and The Adventures of Jules Verne. Television credits also include multiple appearances in Kung Fu:The Legend Continues, and roles in Urban Angel, Counterstrike, John Woo's Once A Thief, and PSI Factor.\n\nFluently bilingual (French/English) Yuen maintains homes in both Toronto and Montreal. A fourth-generation Canadian, born and raised in the Montreal suburbs of St. Laurent and Pierrefond, with deep connections to Vancouver (all of his extended family live there still), Yuen was guided by his parents to become a doctor. However, his studies came to an abrupt halt when a chance Drama elective turned into a full-time pursuit. After studying Theatre at Concordia University, in the honors program, he quickly moved into film and television where he has found continuing success.  IMDb Mini Biography",
        "birthday": "1965-10-30",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 29466,
        "imdb_id": "nm0004067",
        "known_for_department": "Acting",
        "name": "Russell Yuen",
        "place_of_birth": "Montreal, Quebec, Canada",
        "popularity": 0.1691,
        "profile_path": "/yFYpcN2YxJLCFr9p7kaOwunN1Cb.jpg"
    }
}