{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4hAhZ66n5iasGtSYHTFg6oGdJk0.jpg",
                "genre_ids": [
                    27,
                    18,
                    14
                ],
                "id": 660942,
                "original_language": "no",
                "original_title": "De uskyldige",
                "overview": "Four children become friends during the summer holidays, and out of sight of the adults they discover they have hidden powers. While exploring their newfound abilities in the nearby forests and playgrounds, their innocent play takes a dark turn and strange things begin to happen.",
                "popularity": 3.3751,
                "poster_path": "/dqvkxOLmnHgDOqZlT7GgMWEQViR.jpg",
                "release_date": "2021-09-03",
                "title": "The Innocents",
                "video": false,
                "vote_average": 6.91,
                "vote_count": 655,
                "character": "Ben",
                "credit_id": "600a19f798f1f1003cea9f30",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Sam Ashraf (born April 6, 2008) is a Norwegian actor with Afghan heritage, renowned for his talent and compelling performances in both theater and film. He has distinguished himself as an outstanding actor, making significant contributions to the Norwegian film industry.\n\nBackground and Early Career:\n\nSam Ashraf embarked on his journey in acting by participating in theater productions at the young age of 8. This early exposure to the performing arts laid the foundation for his passion for acting. Over seven impressive years, he has developed into a skilled actor, establishing a solid presence in the world of performing arts.\n\nFilms and Notable Works:\n\nAshraf has been part of several films, elevating him not only as a respected figure in the industry but also garnering public attention. One of his most significant roles was in the film \"De Uskyldige\" (2021), directed by the acclaimed filmmaker Eskil Vogt. The film received positive acclaim both nationally and internationally, with Ashraf's performance contributing to his recognition as a talented actor.\n\nAmanda Award Nomination:\n\nIn 2022, Sam Ashraf was acknowledged for his exceptional acting skills with a nomination for the Amanda Award in the Best Male Actor category. This recognition was a testament to his talent and substantial contributions to Norwegian cinema.\n\nPersonal Life:\n\nSam Ashraf takes pride in his Afghan background and has become an inspiration for diversity and representation in Norwegian cinema. His commitment to bringing diverse perspectives to the screen has established him as a noteworthy figure in the industry.\n\nWith an already impressive career, the future looks bright for Sam Ashraf, and his dedication to the art promises exciting contributions to the world of film in the years to come.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2946556,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Sam Ashraf",
        "place_of_birth": null,
        "popularity": 0.2057,
        "profile_path": "/wAIqtAB8f3t2absV8jLqW0COAKz.jpg"
    }
}