{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3i6H4cVfvWh55sN1iXyeb8Q50nY.jpg",
                "genre_ids": [
                    80,
                    28,
                    18
                ],
                "id": 877,
                "original_language": "en",
                "original_title": "Scarface",
                "overview": "In 1920s Chicago, Italian immigrant and notorious thug, Antonio 'Tony' Camonte, aka Scarface, shoots his way to the top of the mobs while trying to protect his sister from the criminal life.",
                "popularity": 3.0024,
                "poster_path": "/y4E5oRiHMTFkEB12IIcpbKbKzDW.jpg",
                "release_date": "1932-04-09",
                "title": "Scarface",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 634,
                "character": "Citizens Committee Member (uncredited)",
                "credit_id": "56ec3f9892514143fe002e2b",
                "order": 27
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia.\n\nBrandon Hurst (November 30, 1866 – July 15, 1947) was an English stage and film actor.\n\nHurst studied philology in his youth and began performing in theater in the 1880s. He worked in Broadway shows from 1900 until his entry into motion pictures. His most notable stage appearance was Two Women in 1910.\n\nHe was nearly fifty by the time of his 1915 film debut in Via Wireless. He appeared in 129 other films before his death in 1947. He became well known in the 1920s for many distinguished roles portraying the antagonist. Some of these films, such as 1920's Dr. Jekyll and Mr. Hyde in which he played the taunting Sir George Carewe, 1923's The Hunchback of Notre Dame in which he played evil Jehan Frollo, 1927's Love in which he portrayed cuckold Alexei Karenin opposite Greta Garbo, and 1928's The Man Who Laughs in which he portrayed jester Balkiphedro, are regarded as some of the best films of the time.\n\nHis roles in talkies during the 1920s and 1930s were often small. One of his more important roles was sinister Merlin the Magician in Fox's A Connecticut Yankee (1931). Hurst worked as an actor until his death. His final film was Two Guys from Texas, released in 1948.",
        "birthday": "1866-11-30",
        "deathday": "1947-07-15",
        "gender": 2,
        "homepage": null,
        "id": 29580,
        "imdb_id": "nm0403582",
        "known_for_department": "Acting",
        "name": "Brandon Hurst",
        "place_of_birth": "London, England, UK",
        "popularity": 0.0905,
        "profile_path": "/fVpEO2PuRU2bNOK9XlEeRY9tiz.jpg"
    }
}