{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6qOyw4yfzbzTp5YsCX26C28Do0S.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 872,
                "original_language": "en",
                "original_title": "Singin' in the Rain",
                "overview": "In 1927 Hollywood, a silent film star falls for a chorus girl just as he and his paranoid screen partner struggle to make the difficult transition to talking pictures.",
                "popularity": 4.2669,
                "poster_path": "/w03EiJVHP8Un77boQeE7hg9DVdU.jpg",
                "release_date": "1952-04-10",
                "title": "Singin' in the Rain",
                "video": false,
                "vote_average": 8.146,
                "vote_count": 3306,
                "character": "Actress in 'The Royal Rascal' (uncredited)",
                "credit_id": "5d641e16ad50f06b0244458d",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Julia Jean Turner",
            "Лана Тёрнер",
            "Julia Jean Mildred Frances Turner"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nLana Turner (February 8, 1921 – June 29, 1995) was an American actress. Discovered and signed to a film contract by MGM at the age of sixteen, Turner first attracted attention in They Won't Forget (1937). She played  featured roles, often as the ingenue, in such films as Love Finds Andy Hardy (1938). During the early 1940s she established herself as a leading actress in such films as Johnny Eager (1941), Ziegfeld Girl (1941) and Somewhere I'll Find You (1942). She is known as one of the first Hollywood scream queens thanks to her role in the 1941 horror film Dr. Jekyll and Mr. Hyde, and her reputation as a glamorous femme fatale was enhanced by her performance in the film noir The Postman Always Rings Twice (1946). Her popularity continued through the 1950s, in such films as The Bad and the Beautiful (1952) and Peyton Place (1957), for which she was nominated for an Academy Award for Best Actress.\n\nIn 1958, her daughter, Cheryl Crane, stabbed Turner's lover Johnny Stompanato to death. A coroner's inquest brought considerable media attention to Turner and concluded that Crane had acted in self defense. Turner's next film, Imitation of Life (1959), proved to be one of the greatest successes of her career, but from the early 1960s her roles were fewer. She gained recognition near the end of her career with a recurring guest role in the television series Falcon Crest during 1982 and 1983. Turner made her final television appearance in 1991, and died from throat cancer in 1995.",
        "birthday": "1921-02-08",
        "deathday": "1995-06-29",
        "gender": 1,
        "homepage": null,
        "id": 29623,
        "imdb_id": "nm0001805",
        "known_for_department": "Acting",
        "name": "Lana Turner",
        "place_of_birth": "Wallace, Idaho, USA",
        "popularity": 0.2566,
        "profile_path": "/5nyFlzZ9Dkih2MWOFSK4B90j4GX.jpg"
    }
}