{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ousBoWTm1CltjAGSYOELYP0jFFC.jpg",
                "genre_ids": [
                    80,
                    53
                ],
                "id": 1480,
                "original_language": "en",
                "original_title": "Touch of Evil",
                "overview": "When a car bomb explodes on the American side of the U.S./Mexico border, Mexican drug enforcement agent Miguel Vargas begins his investigation, along with American police captain Hank Quinlan. When Vargas begins to suspect that Quinlan and his shady partner, Menzies, are planting evidence to frame an innocent man, his investigations into their possible corruption quickly put himself and his new bride, Susie, in jeopardy.",
                "popularity": 2.7642,
                "poster_path": "/1pvRgmfBaoMczIJBOi9gCOZ4FMC.jpg",
                "release_date": "1958-03-30",
                "title": "Touch of Evil",
                "video": false,
                "vote_average": 7.8,
                "vote_count": 1511,
                "character": "Marcia Linnekar's Attorney (uncredited)",
                "credit_id": "55fee31a9251411bd20004ef",
                "order": 34
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Bill Tannan",
            "Billy Tannen",
            "Bill Tannen",
            "William J. Tannen",
            "Bill Tanmen"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nWilliam Tannen (November 17, 1911 – December 2, 1976) was an American actor originally from New York City, who was best known for his role of Deputy Hal Norton in fifty-six episodes from 1956 to 1958 of the ABC/Desilu western television series, The Life and Legend of Wyatt Earp, with Hugh O'Brian as Deputy Marshal Wyatt Earp.\n\nTannen was also cast as Gyp Clements in the 1955 episode \"The Buntline Special\" of The Life and Legend of Wyatt Earp. Beginning on September 11, 1956, in the second season of the series, with the setting moved from Wichita to Dodge City, Kansas, Tannen filled the Hal Norton role. His earliest episodes were \"Fight or Run\", \"The Double Life of Dora Hand\" and \"Clay Allison\", the latter two based on historical figures, the saloon singer and actor Dora Hand and the gunfighter Clay Allison. Some of his appearances were uncredited. His last credited role was \"Doc Holliday Rewrites History\" (May 6, 1958), with Myron Healey as the frontier gunfighter and dentist Doc Holliday. His last uncredited roles aired thereafter in May and June 1958, \"Dig a Grave for Ben Thompson\", based on the historical figure Ben Thompson played by Denver Pyle, \"Frame-up\", and \"My Husband\".\n\nHe was cast as Ike Clanton, not on The Life and Legend of Wyatt Earp, but in the 1964 episode \"After the OK Corral\" of the syndicated western anthology series, Death Valley Days. Jim Davis portrayed Wyatt Earp in this particular episode. Tannen appeared twice, one role uncredited in Davis' earlier syndicated western series, Stories of the Century, including the role of Dutch Charlie in \"Milt Sharp\", the story of the stagecoach robber Milt Sharp.",
        "birthday": "1911-11-17",
        "deathday": "1976-12-02",
        "gender": 2,
        "homepage": null,
        "id": 29626,
        "imdb_id": "nm0849586",
        "known_for_department": "Acting",
        "name": "William Tannen",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.1488,
        "profile_path": "/kFaa9E96ueuQhG5MQxDWL7t6JLt.jpg"
    }
}