{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tRKTlMoTsAhYpuq19V8Wk3RFY4O.jpg",
                "genre_ids": [
                    18
                ],
                "id": 11005,
                "original_language": "en",
                "original_title": "Awakenings",
                "overview": "Dr. Malcolm Sayer, a shy research physician, uses an experimental drug to \"awaken\" the catatonic victims of a rare disease. Leonard is the first patient to receive the controversial treatment. His awakening, filled with awe and enthusiasm, proves a rebirth for Sayer too, as the exuberant patient reveals life's simple but unutterably sweet pleasures to the introverted doctor.",
                "popularity": 6.4556,
                "poster_path": "/9gztZXuHLG6AJ0fgqGd7Q43cWRI.jpg",
                "release_date": "1990-12-04",
                "title": "Awakenings",
                "video": false,
                "vote_average": 7.775,
                "vote_count": 2687,
                "character": "Hospital Director",
                "credit_id": "52fe43e19251416c75021a73",
                "order": 28
            },
            {
                "adult": false,
                "backdrop_path": "/dGbBnTYxdHf1qyUgHsuFpxn1K4E.jpg",
                "genre_ids": [
                    14,
                    18,
                    35,
                    10749,
                    10751
                ],
                "id": 2280,
                "original_language": "en",
                "original_title": "Big",
                "overview": "When a young boy makes a wish at a carnival machine to be big—he wakes up the following morning to find that it has been granted and his body has grown older overnight. But he is still the same 13-year-old boy inside. Now he must learn how to cope with the unfamiliar world of grown-ups including getting a job and having his first romantic encounter with a woman.",
                "popularity": 6.0049,
                "poster_path": "/eWhCDJiwxvx3YXkAFRiHjimnF0j.jpg",
                "release_date": "1988-06-03",
                "title": "Big",
                "video": false,
                "vote_average": 7.183,
                "vote_count": 3784,
                "character": "Personnel Director",
                "credit_id": "602f5d04097c49003cfe5ead",
                "order": 23
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Harvey Alan Miller",
            "Harvey Skolnick",
            "Harvey Skolnik"
        ],
        "biography": "Harvey was born as Harvey Skolnik. He grew up in Plainfield, New Jersey. Harvey started his career in New York City as comedian Sandy Baron's manager. Harvey furthered his career by working with his close longtime friends: Garry Marshall, Penny Marshall, Albert Brooks, James L. Brooks and Jerry Belson,\n\nHarvey helped create Love American Style with Bill Idelson. Harvey also loved meeting celebrities so when he was head writer and director of TV's The Odd Couple, his invigoration of the show by introducing big name talent served dual purposes. Harvey was responsible for integrating the following people into the show: Howard Cosell, Bobby Riggs, Billie Jean King, Paul Williams, Betty White, Allen Ludden and many others.\n\nHarvey first met Burt Reynolds on Cannonball Run. There is a very famous episode of The Dating Game whereby the bachelorette, due to her attraction to his charm and razor sharp humor, chooses Harvey over Burt Reynolds. When the bachelorette meets and sees that she didn't choose Burt, she is devastated. When the host announces her date as Harvey Skolnik from Plainfield, NJ she Is crestfallen. Harvey was a fairly attractive man, but the meet became enormously funny. From that day on when attending industry events or parties, he would always ask if Reynolds was going to be there, so that Reynolds couldn't vengefully express his embarrassment for losing to Harvey.\n\nHarvey bought and lived in Harrison Ford's old house. Before he became a movie star, Harrison was a carpenter and built a lovely country style home in LA.\n\nHarvey made classic cameos in The Odd Couple as the penguin in the bathtub in the nude off Broadway show episode whereby Felix secretly attends his girlfriend's only to embarrass her by covering her up when she appears naked. He also made classic cameo appearances in the Laverne and Shirley whereby he played a shyster producer who steals Laverne's heirloom earrings.\n\nSince he was so close with Penny Marshall, Albert Brooks, Garry Marshall, Jerry Belson and others he always made brief mostly comedic appearances in their TV Shows and Movies. A few of them included: Young Doctors in Love, Beaches, Modern Romance, Awakenings, and Others.\n\nHarvey was always the life of every party and set. He was a unique talent and irrepressible spirit. This world is now a far less interesting place without him. He will be sorely missed.",
        "birthday": "1935-06-15",
        "deathday": "1999-01-09",
        "gender": 2,
        "homepage": null,
        "id": 29706,
        "imdb_id": "nm0588458",
        "known_for_department": "Acting",
        "name": "Harvey Miller",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.1509,
        "profile_path": null
    }
}