{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3e3dVaVrla2GH6CWKbNRjTvk3s8.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 6844,
                "original_language": "en",
                "original_title": "The Ten Commandments",
                "overview": "Escaping death, a Hebrew infant is raised in a royal household to become a prince. Upon discovery of his true heritage, Moses embarks on a personal quest to reclaim his destiny as the leader and liberator of the Hebrew people.",
                "popularity": 10.66,
                "poster_path": "/3Ei59AR64x6dMZfWobPCkZjbqTL.jpg",
                "release_date": "1956-10-05",
                "title": "The Ten Commandments",
                "video": false,
                "vote_average": 7.769,
                "vote_count": 1743,
                "character": "Amalekite Herder (as Touch Connors)",
                "credit_id": "59fef27cc3a3686868036830",
                "order": 52
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Touch Connors",
            "Michael Connors",
            "Jay Connors",
            "Touch Jay Connors",
            "Krekor Ohanian"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nKrekor Ohanian (August 15, 1925 – January 26, 2017), known professionally as Mike Connors, was an American actor best known for playing private detective Joe Mannix in the CBS television series Mannix from 1967 to 1975, a role which earned him a Golden Globe Award in 1970, the first of six straight nominations, as well as four consecutive Emmy nominations from 1970 to 1973.\n\nConnors was an avid basketball player in high school, nicknamed \"Touch\" by his teammates. During World War II, he served as an enlisted man in the United States Army Air Forces.[3] After the war, he attended the University of California at Los Angeles on both a basketball scholarship and the G.I. Bill, where he played under coach John Wooden. Connors went to law school, where he studied to become an attorney, taking after his father.\n\nConnors's film career started in the early 1950s, when he made his acting debut in a supporting role opposite Joan Crawford and Jack Palance in the thriller Sudden Fear (1952).  Connors married Mary Lou Willey on September 10, 1949, when they were both UCLA students. They had two children, a son, Matthew Gunnar Ohanian, and a daughter, Dana Lee Connors.\n\nConnors died in Tarzana, California, at the age of 91 on January 26, 2017, a week after being diagnosed with leukemia.  CLR",
        "birthday": "1925-08-15",
        "deathday": "2017-01-26",
        "gender": 2,
        "homepage": null,
        "id": 29718,
        "imdb_id": "nm0175528",
        "known_for_department": "Acting",
        "name": "Mike Connors",
        "place_of_birth": "Fresno, California, USA",
        "popularity": 0.4635,
        "profile_path": "/iRIEM1j68kRhiqERFeYdNhfUixW.jpg"
    }
}