{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7a4WHNllmX5ZGR0MfYJDPhV69eM.jpg",
                "genre_ids": [
                    16,
                    878
                ],
                "id": 55931,
                "original_language": "en",
                "original_title": "The Animatrix",
                "overview": "Straight from the creators of the groundbreaking Matrix trilogy, this collection of short animated films from the world's leading anime directors fuses computer graphics and Japanese anime to provide the background of the Matrix universe and the conflict between man and machines. The shorts include Final Flight of the Osiris, The Second Renaissance, Kid's Story, Program, World Record, Beyond, A Detective Story and Matriculated.",
                "popularity": 4.3083,
                "poster_path": "/g52SOsTvdjzY8oPIn5znLJMzLHG.jpg",
                "release_date": "2003-05-09",
                "title": "The Animatrix",
                "video": false,
                "vote_average": 7.197,
                "vote_count": 1666,
                "character": "Agent #1 (\"World Record\") / Agent (\"Beyond\") / Agent (\"A Detective Story\")",
                "credit_id": "53651ebc0e0a2647c80017f5",
                "order": 24
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Matt MacKenzie"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nMatt McKenzie is an actor best known for his voicework in games and movies. He is the voice of Auron in the RPG games Final Fantasy X, Final Fantasy X-2, and Kingdom Hearts II. He also provided the English voice of Borgoff in the movie Vampire Hunter D: Bloodlust, Ptolemy in Reign: The Conqueror, and Major Elliot in the animated movie Final Fantasy: The Spirits Within. McKenzie has also guest starred in some well-known movies (Gods and Monsters with Sir Ian McKellen, in which he portrayed Colin Clive) and TV shows such as Star Trek: Voyager, Star Trek: Deep Space Nine, JAG, 7th Heaven, That '70s Show, The O.C. and recently 24 as Agent Hollister. He also had a cameo role in Clint Eastwood's The Rookie as Inspector Wang. He appeared in an episode of House M.D. as Doctor Fedler, where he talks briefly with Robert Chase about The Beatles. He appeared on two episodes of AMC's Mad Men as Crab Colson. Most notably, he voiced Agent Smith and various Agents in The Animatrix.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 29797,
        "imdb_id": "nm0571578",
        "known_for_department": "Acting",
        "name": "Matt McKenzie",
        "place_of_birth": null,
        "popularity": 0.082,
        "profile_path": "/taEnqM4Lc6G2PUlVyuFQcSJJQom.jpg"
    }
}