{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/s2Cu1y9Al9RbwRU5blAH8wMCrBI.jpg",
                "genre_ids": [
                    53,
                    878,
                    9648
                ],
                "id": 45612,
                "original_language": "en",
                "original_title": "Source Code",
                "overview": "When decorated soldier Captain Colter Stevens wakes up in the body of an unknown man, he discovers he's part of a mission to find the bomber of a Chicago commuter train.",
                "popularity": 9.3903,
                "poster_path": "/nTr0lvAzeQmUjgSgDEHTJpnrxTz.jpg",
                "release_date": "2011-03-30",
                "title": "Source Code",
                "video": false,
                "vote_average": 7.302,
                "vote_count": 8691,
                "character": "Nurse",
                "credit_id": "56abe58ac3a3681c5400393d",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Susan Bain is a seasoned stage and screen actor. Her body of experience represents professionalism that balances creative dedication to the process. Her commitment is centered on strong performance that reflects the director's vision.\n\nFrom the light-hearted, caring character in Hallmark’s Swept Up by Christmas to darker qualities opposite Anna Paquin in Bellevue, and Jake Gyllenhaal in Source Code, Susan Bain brings considerable talent and depth to her work. Equally at ease with comedic and dramatic roles, or dramatic parts tinged with humour, Susan always provides a layered performance.\n\nThe spectrum of her television and feature work in Canadian and international productions is both insightful and playful. Nominated for Outstanding Supporting Actress in Mob (Centaur Theatre) is a nod to Susan’s level of personal engagement both with her role of Louise and her deep dedication to the ensemble.\n\nSusan is experienced in studio voice work and gaming. Recently her work as a director and acting teacher garnered a faithful following.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.reisler.ca/reisler-talent-women-Susan-Bain.html",
        "id": 298091,
        "imdb_id": "nm0047734",
        "known_for_department": "Acting",
        "name": "Susan Bain",
        "place_of_birth": null,
        "popularity": 0.404,
        "profile_path": "/dh6NmjITIZ6U3YO6R7NykmSJisN.jpg"
    }
}