{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rsI82F7DadIQcrZyPbuwmkhN5ty.jpg",
                "genre_ids": [
                    35
                ],
                "id": 3034,
                "original_language": "en",
                "original_title": "Young Frankenstein",
                "overview": "A young neurosurgeon inherits the castle of his grandfather, the famous Dr. Victor von Frankenstein. In the castle he finds a funny hunchback, a pretty lab assistant and the elderly housekeeper. Young Frankenstein believes that the work of his grandfather was delusional, but when he discovers the book where the mad doctor described his reanimation experiment, he suddenly changes his mind.",
                "popularity": 3.7696,
                "poster_path": "/c6335WJCZO8NK5wehHk5sA9Cypv.jpg",
                "release_date": "1974-12-15",
                "title": "Young Frankenstein",
                "video": false,
                "vote_average": 7.867,
                "vote_count": 3248,
                "character": "Igor",
                "credit_id": "52fe437fc3a36847f805875f",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Martin Alan Feldman",
            "مارتی فلدمن",
            "مارتین فلدمن"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nMartin Alan Feldman (8 July 1934 – 2 December 1982) was a British actor, comedian and comedy writer, known for his prominent eyes; he suffered from thyroid disease and developed Graves' ophthalmopathy, causing his eyes to protrude and become misaligned. He recognized his appearance as a factor in his career success.\n\nFeldman starred in several British television comedy series, including At Last the 1948 Show and Marty, the latter of which won two BAFTA awards. He also co-created the BBC Radio comedy programme Round the Horne. Feldman starred in Every Home Should Have One, one of the most popular comedies at the British box office in 1970. He was the first Saturn Award winner for Best Supporting Actor for his role as Igor in Mel Brooks' 1974 comedy horror film Young Frankenstein.",
        "birthday": "1934-07-08",
        "deathday": "1982-12-02",
        "gender": 2,
        "homepage": null,
        "id": 29802,
        "imdb_id": "nm0001204",
        "known_for_department": "Acting",
        "name": "Marty Feldman",
        "place_of_birth": "London, England, UK",
        "popularity": 0.9943,
        "profile_path": "/jefjQwWMvgg2lDM3gvF8axrAcLO.jpg"
    }
}