{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zb6fM1CX41D9rF9hdgclu0peUmy.jpg",
                "genre_ids": [
                    18,
                    36,
                    10752
                ],
                "id": 424,
                "original_language": "en",
                "original_title": "Schindler's List",
                "overview": "The true story of how businessman Oskar Schindler saved over a thousand Jewish lives from the Nazis while they worked as slaves in his factory during World War II.",
                "popularity": 14.6569,
                "poster_path": "/sF1U4EUQS8YHUYjNl3pMGNIQyr0.jpg",
                "release_date": "1993-12-15",
                "title": "Schindler's List",
                "video": false,
                "vote_average": 8.566,
                "vote_count": 16703,
                "character": "Brinnlitz Man",
                "credit_id": "602d7c0de86017003eff7f8a",
                "order": 82
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Jerry Flynn trained at the Royal Academy of Dramatic Art between 1978 and 1980. His contemporaries included Sir Kenneth Branagh, Mark Rylance, Richard McCabe, John Sessions, and Paul McGann. After graduating he worked with Deborah Warner in her Kick Theatre production of ‘Woyczek’, and touring productions of ‘Macbeth’ and ‘The Trial’; he later worked in regional Rep. theatre [George in Anthony Clarke’s ‘Of Mice and Men’ at Birmingham Rep., Melchior in Tom Stoppard’s ‘On the Razzle’ at Leeds Playhouse, Kelly in Daniel Mornin’s ‘Short of Mutiny’, and in ‘Pericles’ also at the Theatre Royal Stratford East London. Between 1984 and 1988 he worked at the Royal National Theatre. His first play was for Bill Bryden taking the leading role in Clifford Odet’s ‘Golden Boy’, for which he received both critical acclaim (Frank Rich, Milton Shulman, Sheridan Morley, Michael Billington) and a Most Promising Newcomer nomination. He continued at the RNT, first playing Vardaman in Peter Gill’s initial production of ‘As I Lay Dying’, then for Sir Peter Hall (Eros & the Clown in ‘Anthony & Cleopatra’, Arviragus in ‘Cymbeline’ and The Clown in ‘The Winter’s Tale’), and finally for John Burgess playing Charles in ‘Schism in England’. Since the 1990’s he has taken leading roles in touring productions of ‘The Caretaker’ (Mick), ‘Someone Who’ll Watch Over Me’ (Edward), ‘Stones in his Pockets’ (Charlie Conlon), and ‘Edmund Kean’ (Edmund Kean). He has worked in numerous films (‘Comrades’, ‘Schindler’s List’, ‘Our God’s Brother’, ‘White Raven’, ‘Afraid of the Dark’, ‘Samson and Delilah’, ‘A Polish Death’ and ‘Desert Lunch’), TV and radio projects. In the mid 1990s Jerry Flynn became co-founder and Artistic Director of The Globe Theatre Arts Foundation in Warsaw Poland. With the support of the Prudential Foundation, the EU arts fund and numerous international corporate sponsors, the Globe Theatre Group staged cutting-edge English theatre productions in Poland, brining professional artists in from the UK, Ireland, and the USA. During his time in Poland he also adapted and directed drama for Polish TV (The Signalman, The Rocking Horse Winner, Treasure Island). Jerry Flynn is also a qualified teacher and lecturer in Theatre Arts studies.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2981772,
        "imdb_id": "nm0283490",
        "known_for_department": "Acting",
        "name": "Jeremy Flynn",
        "place_of_birth": null,
        "popularity": 0.0379,
        "profile_path": "/qMgWN4fajlV5Y8EyQ9L441ebN2k.jpg"
    }
}