{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wFbPbJ9uRDpjY7micBTeolgkOA4.jpg",
                "genre_ids": [
                    18,
                    27,
                    878
                ],
                "id": 3035,
                "original_language": "en",
                "original_title": "Frankenstein",
                "overview": "Tampering with life and death, Henry Frankenstein pieces together salvaged body parts to bring a human monster to life; the mad scientist's dreams are shattered by his creation's violent rage as the monster awakens to a world in which he is unwelcome.",
                "popularity": 5.2311,
                "poster_path": "/mu6wHwH0IwCCaEYtpqujuPJYat1.jpg",
                "release_date": "1931-11-21",
                "title": "Frankenstein",
                "video": false,
                "vote_average": 7.464,
                "vote_count": 1679,
                "character": "Victor Moritz",
                "credit_id": "52fe437fc3a36847f8058839",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Джон Боулс"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nJohn Boles (October 28, 1895 – February 27, 1969) was an American singer and actor best known for playing Victor Moritz in the 1931 film Frankenstein.  He started out in Hollywood in silent movies, but became a huge star with the advent of talkies. After the war, Boles moved to New York to study music. He quickly became well known for his talents and was selected to replace the leading man in the 1923 Broadway musical Little Jesse James. He became an established star on Broadway and attracted the attention of Hollywood producers and actors.\n\nBoles' Broadway credits include One Touch of Venus (1943), Kitty's Kisses (1925), Mercenary Mary (1924), and Little Jessie James (1923).\n\nHe was hired by MGM to appear in a silent film in 1924. He starred in two more films for that studio before returning to New York and the stage. In 1927, he returned to Hollywood to star in The Love of Sunya (1927) opposite Gloria Swanson, which was a big success for him. Unfortunately, because the movies were still silent he was unable to show off his singing ability until late in the decade. In 1929, Warner Brothers hired him to star in their lavish musical operetta The Desert Song (1929). This film featured sequences in Technicolor and was a box-office success. Soon after, Radio Pictures (later known as RKO) selected him to play the leading man in their extravagant production (the last portion of the film was photographed in Technicolor) of Rio Rita, opposite Bebe Daniels. Audiences were enthralled by his beautiful voice, and John Boles suddenly found himself in huge demand. RCA Victor even hired him to make phonograph records of songs that he had sung in his films.\n\nAs soon as Rio Rita was completed, Boles went back to Warner Brothers as the leading man in an even more extravagant musical entitled Song of the West (1930) that was filmed entirely in Technicolor. Shortly after this film, Universal Pictures offered John Boles a contract, which he accepted. He starred in a number of pictures for them, most notably the all-Technicolor musical revue entitled The King of Jazz (1930) and a historical operetta entitled Captain of the Guard (1930). In 1931, he starred in One Heavenly Night (1931), which would prove to be his last major musical.\n\nBoles portrayed Victor Moritz in Frankenstein (1931). He starred with Irene Dunne in a 1934 film adaptation of Edith Wharton's 1920 novel The Age of Innocence directed for RKO Radio Pictures by Philip Moeller, and took the role of Edward Morgan in Curly Top (1935), starring Shirley Temple In 1937, Boles starred alongside Barbara Stanwyck in the King Vidor classic Stella Dallas. In 1943, he co-starred with Mary Martin and Kenny Baker in One Touch of Venus.  Description above from the Wikipedia article John Boles, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1895-10-27",
        "deathday": "1969-02-27",
        "gender": 2,
        "homepage": null,
        "id": 29815,
        "imdb_id": "nm0092900",
        "known_for_department": "Acting",
        "name": "John Boles",
        "place_of_birth": "Greenville, Texas, USA",
        "popularity": 0.2043,
        "profile_path": "/eVu8Tzdi3UYrCApUW221CSXoAHt.jpg"
    }
}