{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hVla7xGSvz2z3Q81Nijax3zc5N5.jpg",
                "genre_ids": [
                    35,
                    10749,
                    18
                ],
                "id": 28978,
                "original_language": "en",
                "original_title": "The Circus",
                "overview": "Charlie, a wandering tramp, becomes a circus handyman - soon the star of the show - and falls in love with the circus owner's stepdaughter.",
                "popularity": 2.8279,
                "poster_path": "/hWw9HfQmd4Rn1Et4vgZQsEf5tEZ.jpg",
                "release_date": "1928-01-06",
                "title": "The Circus",
                "video": false,
                "vote_average": 7.934,
                "vote_count": 840,
                "character": "Man Operating Ropes (uncredited)",
                "credit_id": "5f2c39c13009aa003671bda2",
                "order": 18
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/hwMWJ8G5173SGCHzrm0mVjvESaY.jpg",
                "genre_ids": [
                    27,
                    18
                ],
                "id": 13666,
                "original_language": "en",
                "original_title": "The Wolf Man",
                "overview": "After his brother's death, Larry Talbot returns home to his father and the family estate. Events soon take a turn for the worse when Larry is bitten by a werewolf.",
                "popularity": 1.3643,
                "poster_path": "/vG8fu5syTtQLzK1hQXyi3ugOPNF.jpg",
                "release_date": "1941-12-12",
                "title": "The Wolf Man",
                "video": false,
                "vote_average": 7.012,
                "vote_count": 645,
                "credit_id": "57217fc5c3a368117a001dae",
                "department": "Costume & Make-Up",
                "job": "Makeup Artist"
            },
            {
                "adult": false,
                "backdrop_path": "/cemjdP7HrUyJAry85vRT19Hidbi.jpg",
                "genre_ids": [
                    27
                ],
                "id": 138,
                "original_language": "en",
                "original_title": "Dracula",
                "overview": "British estate agent Renfield travels to Transylvania to meet the mysterious Count Dracula, who is interested in leasing a castle in London. After Dracula enslaves Renfield and drives him to insanity, the pair sail to London together and Dracula, a secret vampire, begins preying on London socialites.",
                "popularity": 3.6781,
                "poster_path": "/ueVSPt7vAba0XScHWTDWS5tNxYX.jpg",
                "release_date": "1931-02-12",
                "title": "Dracula",
                "video": false,
                "vote_average": 7.153,
                "vote_count": 1286,
                "credit_id": "6398f7506e44bf00b54c2a8c",
                "department": "Costume & Make-Up",
                "job": "Makeup Artist"
            },
            {
                "adult": false,
                "backdrop_path": "/hrED8MSOn4xJP9Cpk7WomUcFKGI.jpg",
                "genre_ids": [
                    27,
                    878
                ],
                "id": 229,
                "original_language": "en",
                "original_title": "Bride of Frankenstein",
                "overview": "Dr. Frankenstein and his monster both turn out to be alive, not killed as previously believed. Dr. Frankenstein wants to get out of the evil experiment business, but when a mad scientist, Dr. Pretorius, kidnaps his wife, Dr. Frankenstein agrees to help him create a new creature.",
                "popularity": 3.0623,
                "poster_path": "/5241zUwe7rC17MNc2QpCBKKdp1N.jpg",
                "release_date": "1935-04-20",
                "title": "Bride of Frankenstein",
                "video": false,
                "vote_average": 7.509,
                "vote_count": 1037,
                "credit_id": "5bdb869b0e0a263336000d03",
                "department": "Costume & Make-Up",
                "job": "Makeup Artist"
            },
            {
                "adult": false,
                "backdrop_path": "/uGXid3UHMzoL2hyNfWSPDWkqbKC.jpg",
                "genre_ids": [
                    27,
                    878
                ],
                "id": 10787,
                "original_language": "en",
                "original_title": "The Invisible Man",
                "overview": "After experimenting on himself and becoming invisible, scientist Jack Griffin, now aggressive due to the drug's effects, seeks a way to reverse the experiment at any cost.",
                "popularity": 2.7757,
                "poster_path": "/ewfUA5pMEJrmQCdI4TsHmLlIUbf.jpg",
                "release_date": "1933-11-03",
                "title": "The Invisible Man",
                "video": false,
                "vote_average": 7.507,
                "vote_count": 893,
                "credit_id": "6043c609a410c800455b0408",
                "department": "Costume & Make-Up",
                "job": "Makeup Artist"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Janus Piccoulas",
            "Jack P. Pierce",
            "Janus Piccoula",
            "John Pierce",
            "Jack P. Pearce",
            "Jack Pearce"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nJack Pierce (born Janus Piccoula; May 5, 1889 – July 19, 1968) was a Hollywood make-up artist best remembered for creating the iconic makeup worn by Boris Karloff in Frankenstein (1931), along with various other classic monster make-ups for Universal Studios.\n\nIn the 1920s, Pierce embarked on a series of jobs in cinema—cinema manager, stuntman, actor, even assistant director, but within a few years he settled on mastering makeup. The head of Universal, Carl Laemmle, was won over with his creative abilities and hired full-time by the studio.\n\nUniversal's first \"talkie\" horror film, Dracula (1931), eschewed elaborate horror make-up. Pierce designed a special color greasepaint for Bela Lugosi for his vampire character, but Lugosi insisted on applying his own make-up. For all film appearances of the character thereafter, Pierce instituted a different look entirely, recasting Dracula as a man with graying hair and a mustache. The most significant creation during Pierce's time at the studio was Frankenstein (1931), with Lugosi originally cast as the Monster. Pierce came up with a design which was horrific as well as logical in the context of the story. So, where Henry Frankenstein has accessed the brain cavity, there is a scar and a seal, and the now famous \"bolts\" on the neck are actually electrodes: carriers for the electricity used to revive the stitched-up corpse.\n\nAs the head of Universal's make-up department, Pierce is credited with designing and creating the iconic make-ups for films like Frankenstein, The Mummy (1932), The Wolf Man (1941), and their various sequels associated with the characters. Utilizing his \"out-of-the-kit\" techniques, Pierce's make-ups were often very grueling and took a considerable amount of time to apply. Pierce was always reluctant to use latex appliances, favoring his technique of building facial features out of cotton and collodion, or nose putty. Pierce eventually started using latex appliances, most notably a rubber nose for Lon Chaney Jr. in The Wolf Man (1941) (the edges of the appliance are clearly visible through most of the film), and a rubber head piece for Boris Karloff in Bride of Frankenstein (1935) and Son of Frankenstein (1939).\n\nHe did a great many historical, old age and character make-ups in TV anthology series such as Screen Directors Playhouse, You Are There and Telephone Time. One episode of that show, a drama called The Golden Junkman, featured Lon Chaney Jr. as an unlettered but kindly Armenian junk dealer who ages from his 30s to his 70s in the course of the story, which Pierce handled with aplomb.\n\nPierce died in 1968 from uremia.\n\nJack Pierce's enduring work at Universal has become a huge influence to many in the entertainment field, including make-up artists Rick Baker and Tom Savini. In 2003, Pierce was recognized with a lifetime achievement award from the Hollywood Make-up Artist and Hair Stylist Guild. In May 2013, Cinema Makeup School in Los Angeles dedicated a memorial gallery in his honor.",
        "birthday": "1889-05-05",
        "deathday": "1968-07-19",
        "gender": 2,
        "homepage": null,
        "id": 29813,
        "imdb_id": "nm0682370",
        "known_for_department": "Costume & Make-Up",
        "name": "Jack Pierce",
        "place_of_birth": "Valdetsyou, Greece",
        "popularity": 0.0602,
        "profile_path": "/c2aJVAbSInjwOlqvVd3UbLmg4I9.jpg"
    }
}