{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hmAOMwVeJfdWXgK1Ikyl2eYkE99.jpg",
                "genre_ids": [
                    16,
                    10751
                ],
                "id": 62211,
                "original_language": "en",
                "original_title": "Monsters University",
                "overview": "A look at the relationship between Mike and Sulley during their days at Monsters University — when they weren't necessarily the best of friends.",
                "popularity": 11.6192,
                "poster_path": "/y7thwJ7z5Bplv6vwl6RI0yteaDD.jpg",
                "release_date": "2013-06-19",
                "title": "Monsters University",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 10974,
                "character": "Additional Voices (voice)",
                "credit_id": "602f46d33e6f2b003e05ced3",
                "order": 46
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Lindsay Hendrickson"
        ],
        "biography": "Lindsay has a long-standing and significant impact in the world of improvisational theatre and comedy. With her roots tracing back to 2005, she has been influential in a myriad of roles, including as a director, producer, and performer. Her creative prowess is reflected in her creation, production, and direction of the Quick & Funny Musicals, recognized as an Official Selection at the New York Musical Festival.\n\nHer directorial expertise has been showcased through a vast array of over 100 musicals. Notable amongst them are Matt Besser's Freak Dance, 7th Grade: The Awkward Musical (official selection: SF Sketchfest), Sugar Ray the Musical by Rachel Bloom, Jeff Marx's Oh God! We're Gonna Die, and the solo performance in Working Girl: The One Woman Rock Opera. Others, like Texas: The Musical, Just Another Day in Beverly Hills, and many more, attest to her versatility and talent.\n\nHaving served as the Director of the UCB Training Center in Los Angeles, Lindsay has since expanded her horizons. However, her contribution to the development and nurturing of comedic talent during her tenure remains invaluable.\n\nBeyond the UCB sphere, Lindsay co-founded the highly successful Improv Shmimprov in Orange County, which continues to draw full houses every weekend. Her performance credits extend to numerous comedy troupes and productions, including People of Whoville, Live Nude People! with clothes on, Bangs, Rewind, and There's No Crying in Improv at the Del Close marathon.\n\nA multi-talented artist, Lindsay has also lent her unique voice to Pixar's Monster's University and featured as Rich Lady #1 in the film Freak Dance. With a career marked by creativity, versatility, and a commitment to the craft, Lindsay continues to be a compelling force in the comedy and theatre scene.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 2983350,
        "imdb_id": "nm3310527",
        "known_for_department": "Acting",
        "name": "Lindsay Lefler",
        "place_of_birth": null,
        "popularity": 0.0379,
        "profile_path": null
    }
}