{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4XM8DUTQb3lhLemJC51Jx4a2EuA.jpg",
                "genre_ids": [
                    28,
                    80,
                    53,
                    12,
                    9648
                ],
                "id": 385687,
                "original_language": "en",
                "original_title": "Fast X",
                "overview": "Over many missions and against impossible odds, Dom Toretto and his family have outsmarted, out-nerved and outdriven every foe in their path. Now, they confront the most lethal opponent they've ever faced: A terrifying threat emerging from the shadows of the past who's fueled by blood revenge, and who is determined to shatter this family and destroy everything—and everyone—that Dom loves, forever.",
                "popularity": 27.277,
                "poster_path": "/fiVW06jE7z9YnO4trhaMEdclSiC.jpg",
                "release_date": "2023-05-17",
                "title": "Fast X",
                "video": false,
                "vote_average": 7.025,
                "vote_count": 6040,
                "character": "Little Brian",
                "credit_id": "63d945729512e1008f378bda",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Leo A. Perry"
        ],
        "biography": "Leo Abelo Perry made his feature film debut at nine years old in the Disney+ family comedy \"Cheaper by the Dozen,\" opposite Zach Braff and Gabrielle Union. His other credits include ABC's Beauty and the Beast: A 30th Celebration where Leo plays Chip opposite numerous notable performers, including Martin Short, David Alan Grier, H.E.R, and Joshua Henry. Leo also starred in,\" \"Black-ish,\" \"The Big Leap\" and soon to be announced, a major role in a franchise film series set for debut in May 2023.\n\nAt the age of seven, Perry, a burgeoning social activist, started Dance for Justice at the height of the 2020 racial justice protests. His year-long dancing endeavor raised funds for racial justice programs and served as the inspiration to launch and host an activism podcast called \"The Activators!,\" in partnership with A Kids Co.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2984075,
        "imdb_id": "nm12270022",
        "known_for_department": "Acting",
        "name": "Leo Abelo Perry",
        "place_of_birth": null,
        "popularity": 0.1187,
        "profile_path": "/22yhaD35P2AzJ8nA7EMbuIyyHEw.jpg"
    }
}