{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7EazpcvoCfNZZysgljUAkQCBvW.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 614917,
                "original_language": "en",
                "original_title": "King Richard",
                "overview": "The story of how Richard Williams served as a coach to his daughters Venus and Serena, who will soon become two of the most legendary tennis players in history.",
                "popularity": 5.0956,
                "poster_path": "/2dfujXrxePtYJPiPHj1HkAFQvpu.jpg",
                "release_date": "2021-11-18",
                "title": "King Richard",
                "video": false,
                "vote_average": 7.622,
                "vote_count": 2673,
                "character": "Tunde Price",
                "credit_id": "6199f1864975600088f4096b",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Mikayla Bartholomew",
            "Mi"
        ],
        "biography": "Mikayla LaShae Bartholomew is an American stage and screen actress, best known for her film roles in Academy Award winning film \"King Richard\", NAACP Image Award winning film \"Dear Mama\", and the Sundance Film\"Grace\". Upcoming, she is attached to a series in development with Jon Bernthal at HBO. She holds a BFA in theatre performance, with studied minors in pre-nursing, gender, sexuality and women’s studies from Virginia Commonwealth University.\n\nMikayla is 2020 Special Tony Award recipient for her work with the Broadway Advocacy Coalition and Artist Ambassador at the New York Civil Liberties Union. Other credits: The Salvagers (World Premiere), Angry, Raucous and Shamelessly Gorgeous, So You’re Just Sitting with Her While She Bleeds, The Niceties (RTCC Award Winner), Pure (HBO Max), The Great Khan, WET, A Doll’s House: Part 2. Facilitator/Programs Producer: Tina: The Tina Turner Musical, The Lion King, Girl from the North Country, Broadway for Black Lives Matter… Again, What Now: Unplugged, and the Arts in Action Festival.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.mikaylabartholomew.com/",
        "id": 2988968,
        "imdb_id": "nm10693286",
        "known_for_department": "Acting",
        "name": "Mikayla LaShae Bartholomew",
        "place_of_birth": "San Diego, California, USA",
        "popularity": 0.3624,
        "profile_path": "/e0nDppaygdY3bk7dofLsToTnREw.jpg"
    }
}