{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4js6VLf6qHWUbW42BpXiQKPBP7t.jpg",
                "genre_ids": [
                    35,
                    27
                ],
                "id": 814,
                "original_language": "en",
                "original_title": "An American Werewolf in London",
                "overview": "American tourists David and Jack are savaged by an unidentified vicious animal whilst hiking on the Yorkshire Moors. Retiring to the home of a beautiful nurse to recuperate, David soon experiences disturbing changes to his mind and body.",
                "popularity": 3.7138,
                "poster_path": "/hVEqUASJmCQaolkKFEySCHZ8uKG.jpg",
                "release_date": "1981-08-21",
                "title": "An American Werewolf in London",
                "video": false,
                "vote_average": 7.408,
                "vote_count": 2546,
                "character": "Ted",
                "credit_id": "57a054e1c3a3683a930003ad",
                "order": 30
            },
            {
                "adult": false,
                "backdrop_path": "/rLm66DbLwxHeRB34oJ1mhsu0urc.jpg",
                "genre_ids": [
                    27,
                    53,
                    18
                ],
                "id": 11167,
                "original_language": "en",
                "original_title": "Peeping Tom",
                "overview": "Loner Mark Lewis works at a film studio during the day and, at night, takes racy photographs of women. Also he's making a documentary on fear, which involves recording the reactions of victims as he murders them. He befriends Helen, the daughter of the family living in the apartment below his, and he tells her vaguely about the movie he is making.",
                "popularity": 2.1133,
                "poster_path": "/kM4AfLIlbcuRZ621vYjyeBFkuba.jpg",
                "release_date": "1960-05-16",
                "title": "Peeping Tom",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 846,
                "character": "Electrician #1 (uncredited)",
                "credit_id": "5ec743720fb17f001c7a5d87",
                "order": 34
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Francis Ethlebert Singuineau (April 8, 1913 - September 11, 1992), known as Frank Singuineau, was a Trinidadian actor of stage and screen who worked in Britain, where he moved from Trinidad and Tobago in the 1940s.\n\nEmployed by the Shell Company, he took an active interest in Amateur Dramatics. Just after the Second World War he gave up his job with Shell, travelled to London and became an actor, acting with the Unity Theatre and the Bristol Old Vic.[1] His London stage debut was in 1948 in Richard Wright's Native Son (1948), and Singuineau's acting career spanned the subsequent decades until his last roles in Lillian Hellman's Watch on the Rhine at the Royal National Theatre and Mustapha Matura's Playboy of the West Indies at the Tricycle Theatre in 1984.\n\nSinguineau also appeared in such films as The Pumpkin Eater, Séance on a Wet Afternoon, Pressure and An American Werewolf in London and in several television series including Z-Cars, Crane, and Doomwatch.\n\nSinguineau retired in the late 1980s. He died on 11 September 1992 in London, England at the age of 79.",
        "birthday": "1913-04-08",
        "deathday": "1992-09-11",
        "gender": 2,
        "homepage": null,
        "id": 299082,
        "imdb_id": "nm0802352",
        "known_for_department": "Acting",
        "name": "Frank Singuineau",
        "place_of_birth": "Port of Spain, Trinidad, Trinidad and Tobago",
        "popularity": 0.076,
        "profile_path": null
    }
}