{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cGnaZm6EQOJESde3Vv4v53Zk4gN.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 626735,
                "original_language": "en",
                "original_title": "Dog",
                "overview": "An army ranger and his dog embark on a road trip along the Pacific Coast Highway to attend a friend's funeral.",
                "popularity": 3.9482,
                "poster_path": "/zHQy4h36WwuCetKS7C3wcT1hkgA.jpg",
                "release_date": "2022-02-17",
                "title": "Dog",
                "video": false,
                "vote_average": 7.309,
                "vote_count": 1671,
                "character": "Priest",
                "credit_id": "647c6f5593828e00f9d7d5a9",
                "order": 30
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Mike Hernandez is a man who's had several careers throughout his life, and now he's a full-time actor.\n\nIn April of 2013, an acting opportunity literally fell into Mike's lap. A local talent agent who saw him reading Tarot cards at a psychic fair thought he was photogenic, had a good look and great energy, and an interesting presence. She also thought he might have the makings of a good actor, so she invited him to join her agency. Having no prior aspirations of becoming an actor, Mike thought the opportunity was too good to pass up. So, as he had done so many times before in his life, Mike took a chance and got into acting. His career soon took off and he appeared in TV shows such as \"Escaping the Prophet\", \"Evil in Law\" and \"Best in Chow: Taco Wars Seattle\", and in the films \"Blue Sky Coffee\" and \"String Theory\", both of which were shot in Seattle. He has also been in industrial videos for the likes of Boeing, Microsoft, the VA Hospital, Navos and Kaiser Permanente and done commercial work for various clients.\n\nIt occurred to Mike that if he was really going to pursue his acting career seriously, he'd have to move to Hollywood - or at least somewhere in Los Angeles area. He did just that in September of 2015, initially moving to Woodland Hills. Mike started out in somewhat of a good position in that he had built up credentials in Seattle and already had both theatrical and commercial representation with LA's FireStarter Entertainment.\n\nSince landing in Hollywood, he's booked two recurring parts in HBO's \"Veep\" and ABC's \"American Crime\", roles in the independent films \"Almost Home\" and \"The Honor List\", and commercials and print ads for various national companies. His Hollywood career was off and running.\n\nMike was born in 1955 in El Paso, Texas. He spent his late teens and early twenties working at Farah Manufacturing Company and at various Pizza Hut restaurants, and as a professional musician performing in all of the city's top music venues. In 1977, he made a fateful decision to join the Navy to become a Navy Musician. The Navy sent him to Seattle, WA, where he began his stint in the Pacific Northwest as a Navy Musician assigned to Navy Band Seattle. He then spent the next 39 years there as a professional musician; a database developer and consultant; an author and technical writer; a program/community/marketing manager at Microsoft; a technical speaker and trainer known throughout the United States, Europe and South America; a professional Tarot reader; and an actor.\n\nMike now lives with his wife in Glendale, CA, where he pursues his acting career full-time and continues to study acting and improv. He still does Tarot readings and plays his guitar (he's been a guitarist for over 45 years), and is just having a blast being an actor.",
        "birthday": "1955-10-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 2991347,
        "imdb_id": "nm8129796",
        "known_for_department": "Acting",
        "name": "Mike Hernandez",
        "place_of_birth": "El Paso, Texas, USA",
        "popularity": 0.0362,
        "profile_path": null
    }
}