{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/b0PlSFdDwbyK0cf5RxwDpaOJQvQ.jpg",
                "genre_ids": [
                    80,
                    9648,
                    53
                ],
                "id": 414906,
                "original_language": "en",
                "original_title": "The Batman",
                "overview": "In his second year of fighting crime, Batman uncovers corruption in Gotham City that connects to his own family while facing a serial killer known as the Riddler.",
                "popularity": 21.1918,
                "poster_path": "/74xTEgt7R36Fpooo50r9T25onhq.jpg",
                "release_date": "2022-03-01",
                "title": "The Batman",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 11225,
                "character": "Cheri",
                "credit_id": "6161295069eb90008a4c2da1",
                "order": 27
            },
            {
                "adult": false,
                "backdrop_path": "/538U9snNc2fpnOmYXAPUh3zn31H.jpg",
                "genre_ids": [
                    28,
                    12,
                    53
                ],
                "id": 575265,
                "original_language": "en",
                "original_title": "Mission: Impossible - The Final Reckoning",
                "overview": "Ethan Hunt and team continue their search for the terrifying AI known as the Entity — which has infiltrated intelligence networks all over the globe — with the world's governments and a mysterious ghost from Hunt's past on their trail. Joined by new allies and armed with the means to shut the Entity down for good, Hunt is in a race against time to prevent the world as we know it from changing forever.",
                "popularity": 158.7828,
                "poster_path": "/z53D72EAOxGRqdr7KXXWp9dJiDe.jpg",
                "release_date": "2025-05-17",
                "title": "Mission: Impossible - The Final Reckoning",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1737,
                "character": "Mount Weather - Secret Service Agent",
                "credit_id": "682e1f7f7e07d6ffec9e4415",
                "order": 39
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Lorraine Tai, a British-Chinese actress, model, and dancer, is recognized for her roles in major productions such as Mission: Impossible - The Final Reckoning (2025), The Batman (2022), and the long-running TV series Doctors (2000). Originally from Hong Kong, Tai has built a diverse career in film, television, and digital media, showcasing her versatility across genres and formats.\n\nTai's early life and formal training details remain private, but her career trajectory reflects a steady ascent through a variety of roles that highlight her range. She first gained attention with appearances in British television, notably portraying Kim Lewis in Doctors. Her breakthrough came with her role as Cheri in The Batman, which positioned her within a high-profile Hollywood franchise. She continued to expand her portfolio with parts in projects like The Brothers Swap (2024) and the video game Squadron 42 (2026), where she lent her voice and motion capture skills as Agent Li.\n\nHer work extends beyond acting into modeling and dance, contributing to her dynamic presence on screen and stage. Tai's performances often bring a nuanced depth to her characters, earning her recognition within the industry. She has also participated in short films and independent projects such as Smoked Fish (2023) and Photo Booth (2022), demonstrating a commitment to diverse storytelling.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "https://waringmckenna.com/clients/lorraine-tai/",
        "id": 2992036,
        "imdb_id": "nm6734796",
        "known_for_department": "Acting",
        "name": "Lorraine Tai",
        "place_of_birth": "Hong Kong, China",
        "popularity": 0.0923,
        "profile_path": "/mYzBBuqsdzwrJbaQDrhsW0ziChs.jpg"
    }
}