{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wSiBXaJ2PtlxUGH2waIxQZjFPhg.jpg",
                "genre_ids": [
                    28,
                    12,
                    35,
                    80
                ],
                "id": 11576,
                "original_language": "en",
                "original_title": "It's a Mad, Mad, Mad, Mad World",
                "overview": "A group of strangers come across a man dying after a car crash who proceeds to tell them about the $350,000 he buried in California. What follows is the madcap adventures of those strangers as each attempts to claim the prize for himself.",
                "popularity": 8.0596,
                "poster_path": "/j4mWzOisSHFkaqIkq34l2mm8a5K.jpg",
                "release_date": "1963-11-07",
                "title": "It's a Mad, Mad, Mad, Mad World",
                "video": false,
                "vote_average": 6.97,
                "vote_count": 637,
                "character": "Cop (uncredited)",
                "credit_id": "64db7390f495ee029250df85",
                "order": 63
            },
            {
                "adult": false,
                "backdrop_path": "/lYfHa1AtkUMtplrKx7SRLHpwonW.jpg",
                "genre_ids": [
                    12,
                    14,
                    27
                ],
                "id": 244,
                "original_language": "en",
                "original_title": "King Kong",
                "overview": "Adventurous filmmaker Carl Denham sets out to produce a motion picture unlike anything the world has seen before. Alongside his leading lady Ann Darrow and his first mate Jack Driscoll, they arrive on an island and discover a legendary creature said to be neither beast nor man. Denham captures the monster to be displayed on Broadway as King Kong, the eighth wonder of the world.",
                "popularity": 3.0442,
                "poster_path": "/lHlnxKL5GbgRibyRFI7n1Ey850i.jpg",
                "release_date": "1933-03-15",
                "title": "King Kong",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 1544,
                "character": "Member of Ship's Crew (uncredited)",
                "credit_id": "5dc777a87d2bc10017457fbf",
                "order": 23
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Alfred McGonegal",
            "Allen Curtis Jenkins"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nAllen Jenkins (April 9, 1900 – July 20, 1974) was an American character actor on stage, screen and television. He was born Alfred McGonegal on Staten Island, New York.\n\nHe studied at the American Academy of Dramatic Arts. In his first stage appearance, he danced next to James Cagney in a chorus line for an off-Broadway musical called Pitter-Patter. He made five dollars a week. He also appeared one thousand times in Broadway plays between 1924 and 1962, including The Front Page with Lee Tracy (1928). His big break came when he replaced Spencer Tracy for three weeks in the Broadway play The Last Mile.\n\nHe was called to Hollywood by Darryl F. Zanuck and signed first to Paramount Pictures and shortly afterwards to Warner Bros. He originated the character of Frankie Wells in the Broadway production of Blessed Event and reprised the role in the film adaptation, both in 1932. With the advent of talking pictures, he made a career out of playing comic henchmen, stooges, policemen and other \"tough guys\" in numerous films of the 1930s and 1940s, especially for Warner Bros. He was labeled the \"greatest scene-stealer of the 1930s\" by the New York Times. He voiced the character of \"Officer Dibble\" on the Hanna-Barbera television cartoon Top Cat and was a regular on the 1956-1957 television situation comedy Hey, Jeannie! (1956), starring Jeannie Carson. He was also a guest star on The Red Skelton Show, I Love Lucy, Playhouse 90, The Ernie Kovacs Show, Zane Grey Theater, and The Sid Caesar Show. Eleven days before his death he made his final appearance, at the end of Billy Wilder's 1974 film adaptation of The Front Page.\n\nHe went public with his alcoholism and was the first actor to speak in the U.S. House of Representatives and the Senate about it. He helped start the first Alcoholics Anonymous programs in California prisons for women.\n\nJenkins, James Cagney, Pat O'Brien and Frank McHugh were the original members of the so-called \"Irish Mafia\". He was the seventh member of the Screen Actors Guild.\n\nDescription above from the Wikipedia article Allen Jenkins, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1900-04-08",
        "deathday": "1974-07-20",
        "gender": 2,
        "homepage": null,
        "id": 30005,
        "imdb_id": "nm0420765",
        "known_for_department": "Acting",
        "name": "Allen Jenkins",
        "place_of_birth": "Staten Island, New York City, New York, USA",
        "popularity": 0.1867,
        "profile_path": "/5Sx6PnCGo2NIDYqWwP3P2BCejqd.jpg"
    }
}