{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/nVpp3ZcIFtJJ3fJp65eJczehIN8.jpg",
                "genre_ids": [
                    35,
                    10752
                ],
                "id": 3063,
                "original_language": "en",
                "original_title": "Duck Soup",
                "overview": "Rufus T. Firefly is named president/dictator of bankrupt Freedonia and declares war on neighboring Sylvania over the love of wealthy Mrs. Teasdale.",
                "popularity": 2.1558,
                "poster_path": "/31t63plEGKHhYuuCpC9bFWO9SBS.jpg",
                "release_date": "1933-11-12",
                "title": "Duck Soup",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 816,
                "character": "Street Vendor",
                "credit_id": "52fe4381c3a36847f8059459",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "E. Livingston Kennedy",
            "Ed. Kennedy",
            "Edward Kennedy",
            "Ed Kennedy"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nEdgar Livingston Kennedy (April 26, 1890 – November 9, 1948) was an American comedic film character actor, known as \"Slow Burn\". A slow burn is an exasperated facial expression, performed very deliberately; Kennedy embellished this by rubbing his hand over his bald head and across his face, in an attempt to hold his temper. Kennedy is best known for a small role as a lemonade vendor in the Marx Brothers film Duck Soup, as well as the many Hal Roach films he appeared in.\n\nKennedy became so identified with frustration that practically every studio hired him to play hotheads. He often played dumb cops, detectives, and even a prison warden; sometimes he was a grouchy moving man, truck driver, or blue-collar workman. His character usually lost his temper at least once. In Diplomaniacs, Kennedy presides over an international tribunal, where Wheeler & Woolsey want to do something about world peace. \"Well, ya can't do anything about it here\", yells Kennedy, \"this is a peace conference!\" Kennedy, established as the poster boy for frustration, even starred in an instructional film titled The Other Fellow, in which loudmouthed roadhog Edgar always vents his anger on other drivers (each one played by Kennedy as well), little realizing that, to them, he is \"the other fellow.\"\n\nPerhaps his most unusual roles were as a puppeteer in the detective mystery The Falcon Strikes Back and as a philosophical bartender inspired to create exotic cocktails in Harold Lloyd's last film, The Sin of Harold Diddlebock (1947). He also played comical detectives opposite two titans of acting: John Barrymore in Twentieth Century (1934) and Rex Harrison in Unfaithfully Yours (1948); in the latter, he tells conductor Harrison that \"Nobody handles Handel like you handle Handel.\"\n\nKennedy died of throat cancer at the Motion Picture Hospital, San Fernando Valley on 9 November 1948. His body was interred at the Holy Cross Cemetery, Culver City, Los Angeles County, California.",
        "birthday": "1890-04-25",
        "deathday": "1948-11-09",
        "gender": 2,
        "homepage": null,
        "id": 30018,
        "imdb_id": "nm0448012",
        "known_for_department": "Acting",
        "name": "Edgar Kennedy",
        "place_of_birth": "Monterey, California, USA",
        "popularity": 0.197,
        "profile_path": "/oA8h7AdAUZYg5uO0xzFMQOkc9DQ.jpg"
    }
}