{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kB9Y59YDMOFdm5LgSyTVj4b6hh6.jpg",
                "genre_ids": [
                    28,
                    53
                ],
                "id": 4909,
                "original_language": "en",
                "original_title": "The Day of the Jackal",
                "overview": "An international assassin known as ‘The Jackal’ is employed by disgruntled French generals to kill President Charles de Gaulle, with a dedicated gendarme on the assassin’s trail.",
                "popularity": 5.8509,
                "poster_path": "/vThgcb3JOj99yETg8WChuci4LV2.jpg",
                "release_date": "1973-05-16",
                "title": "The Day of the Jackal",
                "video": false,
                "vote_average": 7.541,
                "vote_count": 631,
                "character": "Lloyd",
                "credit_id": "52fe43e1c3a36847f8075f21",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Terence Joseph Alexander",
            "Terrence Alexander",
            "Terry Alexander",
            "Теренс Александер"
        ],
        "biography": "Terence Joseph Alexander (11 March 1923 – 28 May 2009) was an English film and television actor, best known for his role as Charlie Hungerford in the British TV drama Bergerac.\n\nHe was born in London, the son of a doctor, and grew up in Yorkshire. Alexander was educated at Ratcliffe College, Leicestershire, and Norwood College, Harrogate, and started acting in the theatre at the age of 16. During World War II he served in the British Army as a lieutenant with the 27th Lancers, and was seriously wounded by artillery fire in Italy. In 1956 he appeared on stage in Ring For Catty at the Lyric Theatre in London. He is probably best remembered as Charlie Hungerford from the detective series Bergerac, though he was also very prominent in the 1967 BBC adaptation of The Forsyte Saga. One of his early roles was in the children's series Garry Halliday. He also appeared in one episode of Please Sir in 1970 as the headteacher of a rival school.\n\nHe appeared in many other film and television roles including three appearances in different roles in The Avengers; Terry and June (1979–1980); Behind the Screen (1981–1982); the 1985 Doctor Who serial The Mark of the Rani; and The New Statesman (1987). On radio he starred as The Toff in the BBC radio adaptation of the John Creasey novels. He appeared in all but one episode of Bergerac from 1981 to 1991.\n\nHe appeared on the West End in comedies and farces and his credits included Move Over Mrs Markham (1971), Two and Two Make Sex (1973), There Goes The Bride (1974/5) and Fringe Benefits (1976). \n\nAlexander later retired from acting in 1999 and lived in London with his second wife, the actress Jane Downs. He died on 28 May 2009. \n\nDescription above from the Wikipedia article  Terence Alexander,  licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1923-03-11",
        "deathday": "2009-05-28",
        "gender": 2,
        "homepage": null,
        "id": 30035,
        "imdb_id": "nm0018776",
        "known_for_department": "Acting",
        "name": "Terence Alexander",
        "place_of_birth": "Islington, London, England",
        "popularity": 0.1931,
        "profile_path": "/5bY3OFb8VpW7ccNn6Q47z84js5M.jpg"
    }
}