{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dAE4x4BgauvsRkErmLg1L05LNAV.jpg",
                "genre_ids": [
                    9648,
                    27,
                    10749
                ],
                "id": 25508,
                "original_language": "en",
                "original_title": "Cat People",
                "overview": "A Serbian émigré in Manhattan believes that, because of an ancient curse, any physical intimacy with the man she loves will turn her into a feline predator.",
                "popularity": 1.4683,
                "poster_path": "/zSNTDd5Q6No5BmY39Zp5BVgl8XE.jpg",
                "release_date": "1942-12-05",
                "title": "Cat People",
                "video": false,
                "vote_average": 6.921,
                "vote_count": 624,
                "character": "Alice Moore",
                "credit_id": "52fe44ccc3a368484e037833",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jane Roermer"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nJane Randolph, born Jane Roemer (October 30, 1915 – May 4, 2009), was an American film actress. She was born in Youngstown, Ohio and died in Gstaad, Switzerland.\n\nAfter growing up in Kokomo, Indiana, she moved to Hollywood in 1939 in an attempt to start a movie career. She was eventually picked up by Warner Bros. and appeared in bit movie roles in 1941.\n\nIn 1942, RKO picked up the contract of the poised actress and she received a leading lady role in Highways by Night (1942). She became known for her roles in film noir, which included Jealousy (1945) and Railroaded! (1947), and in a few popular but inexpensive horror films, including Cat People (1942) and The Curse of the Cat People (1944).\n\nOne of her last movies was the comic thriller Abbott and Costello Meet Frankenstein (1948). A year later she married Jaime del Amo (grandson of Manuel Dominguez) and retired to Spain and began the life of a socialite. In later years she returned to Los Angeles, but also maintained a home in Switzerland.\n\nDescription above from the Wikipedia article Jane Randolph, licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": "1915-10-30",
        "deathday": "2009-05-04",
        "gender": 1,
        "homepage": null,
        "id": 30114,
        "imdb_id": "nm0709905",
        "known_for_department": "Acting",
        "name": "Jane Randolph",
        "place_of_birth": "Youngstown, Ohio, USA",
        "popularity": 0.1109,
        "profile_path": "/4KcOWHaHZnHrq4Y7s1ScZiG7obn.jpg"
    }
}