{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/y1giivdsGLyo1LCvlsL6mLKyTZ7.jpg",
                "genre_ids": [
                    53,
                    18,
                    9648
                ],
                "id": 1018,
                "original_language": "en",
                "original_title": "Mulholland Drive",
                "overview": "Blonde Betty Elms has only just arrived in Hollywood to become a movie star when she meets an enigmatic brunette with amnesia. Meanwhile, as the two set off to solve the second woman's identity, filmmaker Adam Kesher runs into ominous trouble while casting his latest project.",
                "popularity": 9.3955,
                "poster_path": "/x7A59t6ySylr1L7aubOQEA480vM.jpg",
                "release_date": "2001-06-06",
                "title": "Mulholland Drive",
                "video": false,
                "vote_average": 7.808,
                "vote_count": 6652,
                "character": "Louise",
                "credit_id": "52fe42e5c3a36847f802af23",
                "order": 12
            },
            {
                "adult": false,
                "backdrop_path": "/knYZcpl08qhiEPCytyNXOq7Z1oS.jpg",
                "genre_ids": [
                    80,
                    18,
                    9648,
                    53
                ],
                "id": 10633,
                "original_language": "en",
                "original_title": "In the Heat of the Night",
                "overview": "African-American Philadelphia police detective Virgil Tibbs is arrested on suspicion of murder by Bill Gillespie, the racist police chief of tiny Sparta, Mississippi. After Tibbs proves not only his own innocence but that of another man, he joins forces with Gillespie to track down the real killer. Their investigation takes them through every social level of the town, with Tibbs making enemies as well as unlikely friends as he hunts for the truth.",
                "popularity": 4.1761,
                "poster_path": "/1zjS7aSgvOX98BSWEsshDw3kxe5.jpg",
                "release_date": "1967-08-02",
                "title": "In the Heat of the Night",
                "video": false,
                "vote_average": 7.651,
                "vote_count": 1161,
                "character": "Mrs. Leslie Colbert",
                "credit_id": "52fe43999251416c75016a31",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "李·格兰特",
            "Lyova Haskell Rosenthal",
            "لی گرانت"
        ],
        "biography": "Lee Grant (born Lyova Haskell Rosenthal; October 31, during the mid-1920s) is an American actress and director. She made her film debut in 1951 as a young shoplifter in William Wyler's Detective Story, co-starring Kirk Douglas and Eleanor Parker. This role earned her an Oscar nomination for Best Supporting Actress as well as the Best Actress Award at the 1952 Cannes Film Festival.\n\nIn 1952 she was blacklisted from most acting jobs for the next 12 years. She was able to find only occasional work onstage or as a teacher during this period. It also contributed to her divorce. She was removed from the blacklist in 1962 and rebuilt her acting career. She starred in 71 TV episodes of Peyton Place (1965–1966), followed by lead roles in films such as Valley of the Dolls, In the Heat of the Night (both 1967), and Shampoo (1975), for the last of which she won an Oscar. In 1964, she won the Obie Award for Distinguished Performance by an Actress for her performance in The Maids. During her career she was nominated for the Emmy Award seven times between 1966 and 1993, winning twice.\n\nIn 1986 she directed Down and Out in America which tied for the Academy Award for Best Documentary Feature, and in the same year she also won a Directors Guild of America Award for Nobody's Child.",
        "birthday": "1925-10-31",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 30123,
        "imdb_id": "nm0335519",
        "known_for_department": "Acting",
        "name": "Lee Grant",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 1.3886,
        "profile_path": "/fM3VAVGzKlmuvc0DPmxuAZNH9oi.jpg"
    }
}