{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hmiC0MsI0PDd1TJXC62xyw0tX0s.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 3078,
                "original_language": "en",
                "original_title": "It Happened One Night",
                "overview": "A runaway heiress makes a deal with the rogue reporter trailing her but the mismatched pair end up stuck with each other when their bus leaves them behind.",
                "popularity": 3.4083,
                "poster_path": "/2PNUGWAflH6UUumas0POMmokHlc.jpg",
                "release_date": "1934-02-22",
                "title": "It Happened One Night",
                "video": false,
                "vote_average": 7.823,
                "vote_count": 1323,
                "character": "Alexander Andrews",
                "credit_id": "52fe4383c3a36847f8059c6f",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Walter Connolly (April 8, 1887 – May 28, 1940) was an American actor. While some film historians complain that a number of his performances were annoying or overbaked, he was for the most part applauded for his zesty contributions to a number of comedy classics. Frank Capra's Lady for a Day (1933), Broadway Bill (1934) and It Happened One Night (1934), as well as the Carole Lombard/Fredric March screwball farce Nothing Sacred (1937) as news reporter March's hot-headed editor boss are sure-fire examples.\n\nThe son of the head of the Western Union relay office, he attended St. Xavier College and the University of Dublin in Ireland before making his New York debut in 1910 in an outdoor presentation of \"As You Like It\". For the next year or so he was a member of E.H. Sothern's touring company and played supporting roles in a number of Shakespearean shows on the road. After a few silent pictures left him unimpressed with film-making, he turned to the Broadway stage in the 1920s and scored quite well. Somewhat short and tubby, it was not difficult for the jowly, mustachioed actor to seize laughs and he found his share in such outings as \"The Talking Parrot\" (1923), \"Applesauce\" (1925), \"The Springboard\" (1927), \"The Happy Husband\" (1928), \"Stepping Out\" (1929), \"Your Uncle Dudley\" (1930), \"Anatol\" (1931), \"Six Characters in Search of an Author\" (1931), \"The Good Fairy\" (1932) and \"The Late Christopher Bean\" (1932).\n\nWith his talents as a stage farceur firmly established, it was time to make a second attempt at a film career and Hollywood (specifically, Columbia) wisely opened their doors to him. Interestingly, his debut in a full-length talking picture came at age 45 in the form of a drama, Washington Merry-Go-Round (1932), where he was third-billed as a rather benign senator. For the next seven years Connolly, often playing older than he really was, could be found everywhere giving good fluster to the greatest and glossiest of stars -- Janet Gaynor, Carole Lombard, Clark Gable, Jean Harlow, Myrna Loy, Paul Muni, Spencer Tracy, and Ginger Rogers, among hordes of others.\n\nHis hobbies were collecting old books and theatre programmes. Connolly was married to actress Nedda Harrigan from 1923 to his death. They had one daughter, Ann (1924–2006). Connolly suffered a fatal stroke on May 28, 1940, and was buried in New St. Joseph Cemetery in Cincinnati.",
        "birthday": "1887-04-08",
        "deathday": "1940-05-28",
        "gender": 2,
        "homepage": null,
        "id": 30156,
        "imdb_id": "nm0175369",
        "known_for_department": "Acting",
        "name": "Walter Connolly",
        "place_of_birth": "Cincinnati, Ohio, USA",
        "popularity": 2.2109,
        "profile_path": "/mJB6tVqIlr5zhiSqCx2Vl0Kr6Nw.jpg"
    }
}