{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hmiC0MsI0PDd1TJXC62xyw0tX0s.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 3078,
                "original_language": "en",
                "original_title": "It Happened One Night",
                "overview": "A runaway heiress makes a deal with the rogue reporter trailing her but the mismatched pair end up stuck with each other when their bus leaves them behind.",
                "popularity": 3.8629,
                "poster_path": "/2PNUGWAflH6UUumas0POMmokHlc.jpg",
                "release_date": "1934-02-22",
                "title": "It Happened One Night",
                "video": false,
                "vote_average": 7.823,
                "vote_count": 1323,
                "character": "Ellie Andrews",
                "credit_id": "52fe4383c3a36847f8059c6b",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Emilie Claudette Chauchoin",
            "Клодетт Кольбер"
        ],
        "biography": "Claudette Colbert (September 13, 1903 — July 30, 1996) was an American actress. Born  Emilie Claudette Chauchoin in Saint-Mandé, Val-de-Marne, France, she was brought to the United States as a child three years later and went to high school in New York. While studying at the Art Students League when, in 1923, she took the name Claudette Colbert for her first Broadway role in \"The Wild Westcotts\". Her most noteworthy stage vehicle was the \"The Barker\" in 1927. Her first film was a silent For the Love of Mike (1927), directed by Frank Capra. Made on a shoestring, the movie was a flop, and she vowed that it would be her last film role: \"I only left Broadway when the crash came. The Depression killed the theater, and the pictures were manna from heaven\". She had her first film success the next year, however, in The Lady Lies (1929).\n\nHer early notable films were all box-office hits and included Cleopatra (1934), in which she played the title role enticingly. She had her greatest triumph playing a runaway heiress, with enormous charm, opposite Clark Gable in Capra's comedy It Happened One Night (1934), for which she won the Academy Award as Best Actress. By 1938 her keen ability in business made her the highest paid star in Hollywood. By 1950, though, her star had begun to wane. She returned to the stage in 1956 when she replaced Margaret Sullavan during the spring and summer in the comedy \"Janus\". Appearances in other Broadway productions followed, including \"The Marriage-Go-Round\". Besides the stage, she did TV specials and had a supporting role in a notable TV movie, The Two Mrs. Grenvilles (1987), for which she received a Golden Globe award. In 1989 she was presented with a Life Achievement award from the Kennedy Center for the Performing Arts.\n\nShe married actor Norman Foster in 1928, although they never lived together and were divorced after seven years. She married surgeon Dr. Joel Pressman soon after and remained married until his death in 1968. In latter years she divided her time between an apartment in New York and a 200-year-old plantation house in Speightstown, Barbados, where she entertained such guests as Frank Sinatra and Ronald Reagan. She remained on Barbados Island after her stroke. On July 30, 1996, Claudette died in Speightstown, Barbados. She was 92.",
        "birthday": "1903-09-13",
        "deathday": "1996-07-30",
        "gender": 1,
        "homepage": null,
        "id": 30155,
        "imdb_id": "nm0001055",
        "known_for_department": "Acting",
        "name": "Claudette Colbert",
        "place_of_birth": "Saint-Mandé, Val-de-Marne, France",
        "popularity": 0.3955,
        "profile_path": "/hGXgVxZCMliuHZhVTg2q2UAgrmI.jpg"
    }
}