{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kSlO1pHpwQfPQdgVPr7dJiJNtJ8.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749
                ],
                "id": 3082,
                "original_language": "en",
                "original_title": "Modern Times",
                "overview": "A bumbling tramp desires to build a home with a young woman, yet is thwarted time and time again by his lack of experience and habit of being in the wrong place at the wrong time..",
                "popularity": 4.5373,
                "poster_path": "/7uoiKOEjxBBW0AgDGQWrlfGQ90w.jpg",
                "release_date": "1936-02-05",
                "title": "Modern Times",
                "video": false,
                "vote_average": 8.283,
                "vote_count": 3884,
                "character": "Juvenile Officer",
                "credit_id": "52fe4383c3a36847f8059f19",
                "order": 12
            },
            {
                "adult": false,
                "backdrop_path": "/9AjG0YJLgDUtHl5KgrThHPhNNwZ.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 3083,
                "original_language": "en",
                "original_title": "Mr. Smith Goes to Washington",
                "overview": "After the death of a United States Senator, idealistic Jefferson Smith is appointed as his replacement in Washington. Soon, the naive and earnest new senator has to battle political corruption.",
                "popularity": 2.8661,
                "poster_path": "/nDjg1fbNyq15excNDl3acd2IqAk.jpg",
                "release_date": "1939-10-19",
                "title": "Mr. Smith Goes to Washington",
                "video": false,
                "vote_average": 7.846,
                "vote_count": 1117,
                "character": "Pompous Man (uncredited)",
                "credit_id": "555f2acc9251417e4d002945",
                "order": 149
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Wilfred Van Norman Lucas"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nWilfred Lucas (January 30, 1871 – December 13, 1940) was a Canadian-born American stage actor who found success in film as an actor, director, and screenwriter.\n\nWilfred Lucas made his Broadway debut in 1904, playing in both the The Blue Grass Handicap and The Superstition of Sue. Following his 1906 role in the highly successful play The Chorus Lady, he was recruited to the fledgling Biograph Studios by D. W. Griffith.\n\nAt the time, the film business was still looked down upon by many members of the theatrical community. In her 1925 book titled When the Movies Were Young, Griffith's wife, actress Linda Arvidson, told the story of the early days at Biograph Studios. In it, she referred to Lucas as the \"first real grand actor, democratic enough to work in Biograph movies.\" In 1908 Lucas made his motion picture debut in Griffith's The Greaser's Gauntlet, appearing in more than 50 of these short (usually 17 minutes) films over the next two years.\n\nIn 1910 while still acting, he wrote the script for Griffith's film Sunshine Sue, which was followed by many more scripts by 1924. Lucas also began directing in 1912 with Griffith on An Outcast Among Outcasts, and directed another 44 films over the next 20 years.\n\nIn early 1916 he starred as John Carter in Acquitted, about which Photoplay wrote, \"No single performance in the records of active photography has surpassed his visualization of the humble book-keeper in Acquitted.\" Later in 1916 he appeared in D.W. Griffith's film Intolerance.\n\nPart of the group of Canadian pioneers in early Hollywood, Lucas became friends and sometimes starred with Mary Pickford, Sam De Grasse, and Marie Dressler. Canadian-born director Mack Sennett hired him to both direct and act in a large number of films at his Keystone Studios.\n\nLucas made the successful transition from silent film to sound. While working in Hollywood, in 1926 he returned to the stage, performing in several Broadway plays. He later appeared as a foil for Laurel and Hardy in their feature films Pardon Us and A Chump at Oxford.\n\nDuring his long career, Wilfred Lucas appeared in more than 375 films. Although for a time he was cast in leading roles, he became very successful as secondary and minor characters, making a good living in the film industry for more than three decades.",
        "birthday": "1871-01-29",
        "deathday": "1940-12-13",
        "gender": 2,
        "homepage": null,
        "id": 30201,
        "imdb_id": "nm0524306",
        "known_for_department": "Acting",
        "name": "Wilfred Lucas",
        "place_of_birth": "Norfolk, Ontario, Canada",
        "popularity": 0.1487,
        "profile_path": "/rr70uPoMMtkHFYSPn0JTwI9ikQ9.jpg"
    }
}