{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9AjG0YJLgDUtHl5KgrThHPhNNwZ.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 3083,
                "original_language": "en",
                "original_title": "Mr. Smith Goes to Washington",
                "overview": "After the death of a United States Senator, idealistic Jefferson Smith is appointed as his replacement in Washington. Soon, the naive and earnest new senator has to battle political corruption.",
                "popularity": 2.8661,
                "poster_path": "/nDjg1fbNyq15excNDl3acd2IqAk.jpg",
                "release_date": "1939-10-19",
                "title": "Mr. Smith Goes to Washington",
                "video": false,
                "vote_average": 7.843,
                "vote_count": 1118,
                "character": "President of the Senate",
                "credit_id": "52fe4383c3a36847f8059fd5",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/agUD7Wp6LAwpaB3phx6yiRmFoSY.jpg",
                "genre_ids": [
                    37
                ],
                "id": 3089,
                "original_language": "en",
                "original_title": "Red River",
                "overview": "Following the Civil War, headstrong rancher Thomas Dunson decides to lead a perilous cattle drive from Texas to Missouri. During the exhausting journey, his persistence becomes tyrannical in the eyes of Matthew Garth, his adopted son and protégé.",
                "popularity": 4.5863,
                "poster_path": "/jyNTsAzrIWB441OtvfbgKtx1kFS.jpg",
                "release_date": "1948-09-17",
                "title": "Red River",
                "video": false,
                "vote_average": 7.339,
                "vote_count": 558,
                "character": "Mr. Melville",
                "credit_id": "52fe4384c3a36847f805a4a9",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Henry DeWitt Carey II",
            "H.D. Carey",
            "Harry D. Carey",
            "Harry Carey Sr."
        ],
        "biography": "Henry DeWitt Carey II (January 16, 1878 - September 21, 1947) was an American actor and one of silent film's earliest superstars, usually cast as a Western hero.  One of his best known performances is as the president of the United States Senate in the drama film Mr. Smith Goes to Washington (1939), for which he was nominated for the Academy Award for Best Supporting Actor.\n\nHe was the father of Harry Carey Jr., who was also a prominent actor.  Born in New York City to a Judge of Special Sessions who was also  president of a sewing machine company. Grew up on City Island, New York.  Attended Hamilton Military Academy and turned down an appointment to  West Point to attend New York University, where his law school  classmates included future New York City mayor James J. Walker. After a  boating accident which led to pneumonia, Carey wrote a play while  recuperating and toured the country in it for three years, earning a  great deal of money, all of which evaporated after his next play was a  failure.\n\nIn 1911, his friend Henry B. Walthall introduced him to director D.W. Griffith, for whom Carey was to make many films. Carey married twice, the second time to actress Olive Fuller Golden (aka Olive Carey, who introduced him to future director John Ford. Carey influenced Universal Studios head Carl Laemmle  to use Ford as a director, and a partnership was born that lasted until  a rift in the friendship in 1921. During this time, Carey grew into one of the most popular Western stars of the early motion picture, occasionally writing and directing films as well.  In the '30s he moved slowly into character roles and was nominated for an Oscar for one of  them, the President of the Senate in Mr. Smith Goes to Washington (1939). He worked once more with Ford, in The Prisoner of Shark Island (1936), and appeared once with his son, Harry Carey Jr., in Howard Hawks' Red River (1948). He died after a protracted bout with emphysema and cancer. Ford dedicated his remake of 3 Godfathers (1948) \"To Harry Carey--Bright Star Of The Early Western Sky.\"",
        "birthday": "1878-01-16",
        "deathday": "1947-09-21",
        "gender": 2,
        "homepage": null,
        "id": 30212,
        "imdb_id": "nm0002503",
        "known_for_department": "Acting",
        "name": "Harry Carey",
        "place_of_birth": "The Bronx, New York City, New York, USA",
        "popularity": 0.3579,
        "profile_path": "/AvNDsYjkLgeFHbxGFIFyl6QRgeM.jpg"
    }
}