{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9AjG0YJLgDUtHl5KgrThHPhNNwZ.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 3083,
                "original_language": "en",
                "original_title": "Mr. Smith Goes to Washington",
                "overview": "After the death of a United States Senator, idealistic Jefferson Smith is appointed as his replacement in Washington. Soon, the naive and earnest new senator has to battle political corruption.",
                "popularity": 2.8482,
                "poster_path": "/nDjg1fbNyq15excNDl3acd2IqAk.jpg",
                "release_date": "1939-10-19",
                "title": "Mr. Smith Goes to Washington",
                "video": false,
                "vote_average": 7.843,
                "vote_count": 1118,
                "character": "Senator Barnes",
                "credit_id": "52fe4383c3a36847f8059fe5",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Pierre Frank Watkin",
            "Pierre F. Watkin",
            "Pierre Watkins"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nPierre Frank Watkin (December 29, 1889 – February 3, 1960) was an American character actor in many films, serials, and television series from the 1930s through the 1950s, especially westerns. He is perhaps best remembered for being the father of Eleanor Twitchell, the lady who captures Lou Gehrig's heart in Pride of the Yankees (1942)\n\nWatkin was born in Sioux City, Iowa. In the 1920s, he had his own theatrical troupe, the Pierre Watkin Players. In 1927, the group moved its headquarters from Sioux Falls to Lincoln, Nebraska.\n\nWatkin portrayed Perry White in both of the Superman serials of the late 1940s, which starred Kirk Alyn as the title character and Noel Neill as Lois Lane.\n\nWatkin played a few different characters in the television series Adventures of Superman, in which John Hamilton played Perry White. He was set to reprise his role as the editor of The Daily Planet in a revival of the series in 1959, as Hamilton had died in the interim since the cancellation of the original series. However, series star George Reeves also died in the summer of 1959, and those plans ended. Watkin himself died six months later.\n\nHe also cast in 1955 in the episode \"Joey and the Gypsies\" of the NBC children's western series Fury. Watkin guest starred in the CBS western series Brave Eagle. He was cast twice each on the ABC/Warner Brothers series, Cheyenne (as Harvey Sinclair in \"The Law Man\") and Annie Oakley (as the Reverend Mills in the 1956 episode \"The Reckless Press\"). In 1958, Watkin portrayed Dr. Breen of Samaritan Hospital in the episode \"San Francisco Story\" of Rex Allen's syndicated western series, Frontier Doctor.\n\nDuring the first season of CBS's Perry Mason from 1957 to 1958, Watkin appeared in three episodes as Judge Keetley. He was also cast during the 1950s on The Range Rider, Tales of the Texas Rangers, in three episodes of the western aviation adventure series Sky King, and five times on The Jack Benny Program.\n\nWatkin played the part of Colonel Duncan in the 1958 episode \"Decoy\" of the ABC/Warner Brothers western series Colt .45.",
        "birthday": "1889-12-27",
        "deathday": "1960-02-03",
        "gender": 2,
        "homepage": null,
        "id": 30216,
        "imdb_id": "nm0914246",
        "known_for_department": "Acting",
        "name": "Pierre Watkin",
        "place_of_birth": null,
        "popularity": 0.1511,
        "profile_path": "/w36vNJFvQDiDyuC9zvT8nNZajhA.jpg"
    }
}