{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ihoQaiMFAz4YCTAaSIsQjRknsNH.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 3085,
                "original_language": "en",
                "original_title": "His Girl Friday",
                "overview": "Walter Burns is an irresistibly conniving newspaper publisher desperate to woo back his paper’s star reporter, who also happens to be his estranged wife. She’s threatening to quit and settle down with a new beau, but, as Walter knows, she has a weakness: she can’t resist a juicy scoop.",
                "popularity": 3.6597,
                "poster_path": "/lu86Y9zTPH3neCiUzLzHCEFHf7f.jpg",
                "release_date": "1940-01-18",
                "title": "His Girl Friday",
                "video": false,
                "vote_average": 7.396,
                "vote_count": 879,
                "character": "Mayor",
                "credit_id": "52fe4384c3a36847f805a185",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "C. William Kolb",
            "William Kolb",
            "Clarence William Kolb"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nClarence William Kolb (July 31, 1874 – November 25, 1964) was an American vaudeville performer and actor.\n\nHe was born in Cleveland, Ohio, the only child of second generation Austrian parents who owned a local meat company.\n\nKolb started out as one half of a vaudeville comedy team, Kolb and Dill, with Max Dill. They styled their act on the famous team of Weber and Fields. In addition to their stage work, they appeared in a series of short films and a feature length movie in 1917. Afterwards, Kolb made a return to vaudeville, and he only returned to the movies in the late 1930s.\n\nHe became famous for portraying the same type of character in many films, namely a politician or businessman. He is best remembered for his role as the grumpy father in the multi-Academy Awards nominated hit comedy film Merrily We Live (1938), the corrupt mayor in the comedy His Girl Friday (1940), and as Mr. Honeywell in the television sitcom My Little Margie (1952). Kolb played himself in his last movie appearance, Man of a Thousand Faces (1957), opposite Danny Beck (who played the late Max Dill).\n\nClarence Kolb died at age 90 of a stroke at the Orchard Gables Sanitarium in Hollywood. He is interred in the Forest Lawn Memorial Park Cemetery in Glendale, California.",
        "birthday": "1874-07-30",
        "deathday": "1964-11-25",
        "gender": 2,
        "homepage": null,
        "id": 30237,
        "imdb_id": "nm0463882",
        "known_for_department": "Acting",
        "name": "Clarence Kolb",
        "place_of_birth": "Cleveland, Ohio, USA",
        "popularity": 0.1938,
        "profile_path": "/yXKI1161lk7bi5OPma3MkJhSAm3.jpg"
    }
}