{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ihoQaiMFAz4YCTAaSIsQjRknsNH.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 3085,
                "original_language": "en",
                "original_title": "His Girl Friday",
                "overview": "Walter Burns is an irresistibly conniving newspaper publisher desperate to woo back his paper’s star reporter, who also happens to be his estranged wife. She’s threatening to quit and settle down with a new beau, but, as Walter knows, she has a weakness: she can’t resist a juicy scoop.",
                "popularity": 3.6597,
                "poster_path": "/lu86Y9zTPH3neCiUzLzHCEFHf7f.jpg",
                "release_date": "1940-01-18",
                "title": "His Girl Friday",
                "video": false,
                "vote_average": 7.396,
                "vote_count": 879,
                "character": "Mollie Malloy",
                "credit_id": "52fe4384c3a36847f805a19d",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Helen Mack",
            "海伦·马克"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nHelen Mack (November 12, 1913 – August 13, 1986) was an American actress. Mack started her career as a child actress in silent films, moving on to Broadway plays, and touring the vaudeville circuit. Her greater success as an actress was as a leading lady in the 1930s. Eventually Mack transitioned into performing on radio, and then into writing, directing, and producing some of the best known radio shows during the Golden Age of Radio. Later in life, Mack billed herself as a professional writer, writing for Broadway, stage, and television. Her career spanned the infancy of the motion picture industry, the beginnings of Broadway, the final days of Vaudeville, the transition to \"talking pictures\", the Golden Age of Radio, and the rise of television.\n\nDescription above from the Wikipedia article Helen Mack, licensed under CC-BY-SA, full list of contributors on Wikipedia.   ",
        "birthday": "1913-11-13",
        "deathday": "1986-08-13",
        "gender": 1,
        "homepage": null,
        "id": 30241,
        "imdb_id": "nm0532997",
        "known_for_department": "Acting",
        "name": "Helen Mack",
        "place_of_birth": "Rock Island, Illinois, United States",
        "popularity": 0.1122,
        "profile_path": "/zHefRbs0wALGyzCoIhjf6WKfy8S.jpg"
    }
}