{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ihoQaiMFAz4YCTAaSIsQjRknsNH.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 3085,
                "original_language": "en",
                "original_title": "His Girl Friday",
                "overview": "Walter Burns is an irresistibly conniving newspaper publisher desperate to woo back his paper’s star reporter, who also happens to be his estranged wife. She’s threatening to quit and settle down with a new beau, but, as Walter knows, she has a weakness: she can’t resist a juicy scoop.",
                "popularity": 3.8745,
                "poster_path": "/lu86Y9zTPH3neCiUzLzHCEFHf7f.jpg",
                "release_date": "1940-01-18",
                "title": "His Girl Friday",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 878,
                "character": "Duffy",
                "credit_id": "52fe4384c3a36847f805a199",
                "order": 15
            },
            {
                "adult": false,
                "backdrop_path": "/a3eYLIK5eYSHAJTtOy9PdciVjxx.jpg",
                "genre_ids": [
                    18
                ],
                "id": 28580,
                "original_language": "en",
                "original_title": "The Lost Weekend",
                "overview": "Don Birnam, a long-time alcoholic, has been sober for ten days and appears to be over the worst... but his craving has just become more insidious. Evading a country weekend planned by his brother and girlfriend, he begins a four-day bender that just might be his last - one way or another.",
                "popularity": 2.7569,
                "poster_path": "/8ggIOoCzt8xT2ePl8DdlRtXgcOh.jpg",
                "release_date": "1945-11-29",
                "title": "The Lost Weekend",
                "video": false,
                "vote_average": 7.628,
                "vote_count": 629,
                "character": "Opera Cloak Room Attendant",
                "credit_id": "52fe45a3c3a368484e06664d",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Frank Kaiser Orth"
        ],
        "biography": "Frank Orth was an American actor born in Philadelphia. He is probably best remembered for his portrayal of Inspector Faraday in the 1951-1953 television series “Boston Blackie”. By 1897, Orth was performing in vaudeville with his wife, Ann Codee, in an act called “Codee and Orth.” In 1909, he expanded into song writing, with songs such as “The Phone Bell Rang” and “Meet Me on the Boardwalk, Dearie.” His first contact with motion pictures was in 1928, when he was part of the first foreign-language shorts in sound produced by Warner Bros. He and his wife also appeared together in a series of two-reel comedies in the early 1930s. Orth's first major screen credit was in “Prairie Thunder,” a Dick Foran western, in 1937. From then on, he was often cast as bartenders, pharmacists, and grocery clerks, and always distinctly Irish. He had a recurring role in the Dr. Kildare series of films and also in the Nancy Drew series as the befuddled Officer Tweedy. Among his better roles were the newspaper man Cary Grant telephones early in “His Girl Friday,” one of the quartet singing “Gary Owen” in “They Died with Their Boots On” (thereby giving Errol Flynn as Gen. Custer the idea of associating the tune with the 7th Cavalry), and as the little man carrying the sign reading “The End Is Near” throughout Colonel Effingham's Raid. However, Orth is probably best remembered for his portrayal of Inspector Faraday in the 1951-1953 television series “Boston Blackie.” A short, plump, round-faced man, often smoking a cigar, Orth as Faraday wore his own dark-rimmed spectacles, though rarely in feature films. In 1959, Orth retired from show business after throat surgery. His wife died in 1961 after around fifty years of marriage. Orth died on March 17, 1962. He is buried in Forest Lawn Cemetery in the Hollywood Hills next to his wife.",
        "birthday": "1880-02-20",
        "deathday": "1962-03-17",
        "gender": 2,
        "homepage": null,
        "id": 30240,
        "imdb_id": "nm0650995",
        "known_for_department": "Acting",
        "name": "Frank Orth",
        "place_of_birth": "Philadelphia, Pennsylvania, USA",
        "popularity": 0.1245,
        "profile_path": "/s8yUbtAu6wueQjDRncuSX6x6ZUt.jpg"
    }
}