{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dLL90vskYFn1S89RZp5TUguK9wl.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 4982,
                "original_language": "en",
                "original_title": "American Gangster",
                "overview": "Loosely based on the criminal career of Frank Lucas, a gangster from La Grange, North Carolina, who smuggled heroin into the United States on American service planes returning from the Vietnam War, before being detained by a task force led by Newark Detective Richie Roberts.",
                "popularity": 7.5255,
                "poster_path": "/8sV6nWuKczuXRt0C6EWoXqJAj6G.jpg",
                "release_date": "2007-11-02",
                "title": "American Gangster",
                "video": false,
                "vote_average": 7.591,
                "vote_count": 5725,
                "character": "Referee",
                "credit_id": "605d6fe1d2f5b5003d7ed520",
                "order": 100
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Arthur Mercante Sr."
        ],
        "biography": "Arthur Mercante Sr. (January 26, 1920 – April 10, 2010) was an American boxing referee. His career lasted from the 1960s until 2001. Mercante's son also became a noted referee. In his youth, Arthur Mercante Sr. was a member of the Merchant Marines.\n\nHis first title bout was the second fight between Floyd Patterson and Ingemar Johansson. Johansson had won the world heavyweight title in the first fight. In the second fight, Patterson became the first fighter to regain the heavyweight title.\n\nMercante was also the referee for many notable bouts, including the first Muhammad Ali-Joe Frazier fight on March 8, 1971, the first bout between George Foreman and Joe Frazier, the fight between Jerry Quarry and Earnie Shavers, the first bout between Alexis Arguello and Alfredo Escalera, the Wilfredo Gomez-Lupe Pintor fight, the first bout between Edwin Rosario and Jose Luis Ramirez and Rosario's bout with Hector Camacho Sr.\n\nMercante was born in Brockton, Massachusetts, and moved with his family to Brooklyn at age 7. During his teenage years, he fought in the Golden Gloves as a welterweight and graduated from Boys High School in 1938. He earned Bachelor's and Master of Science degrees from New York University in 1942 and 1947 respectively, the latter after serving in the United States Navy during World War II as a boxing instructor as part of a physical training program headed by heavyweight champion Gene Tunney. After the war, he refereed Golden Gloves and college bouts and became a varsity boxing coach at the United States Merchant Marine Academy until the sport was phased out at the intercollegiate level.\n\nHis refereeing career began professionally in 1956 and ended in 2001 at the age of 81. In 1995 he was inducted into the International Boxing Hall of Fame in Canastota, New York.\n\nHe was the first contestant on the June 26, 1960 edition of the television game show What's My Line? Refereeing was his avocation and the line the panel looked for was his vocation; that of beer salesman. He worked with Rheingold at the time and later moved to Schaefer in a similar capacity.",
        "birthday": "1920-01-26",
        "deathday": "2010-04-10",
        "gender": 2,
        "homepage": null,
        "id": 3025474,
        "imdb_id": "nm0580190",
        "known_for_department": "Acting",
        "name": "Arthur M. Mercante",
        "place_of_birth": null,
        "popularity": 0.0764,
        "profile_path": null
    }
}