{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3e3dVaVrla2GH6CWKbNRjTvk3s8.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 6844,
                "original_language": "en",
                "original_title": "The Ten Commandments",
                "overview": "Escaping death, a Hebrew infant is raised in a royal household to become a prince. Upon discovery of his true heritage, Moses embarks on a personal quest to reclaim his destiny as the leader and liberator of the Hebrew people.",
                "popularity": 10.66,
                "poster_path": "/3Ei59AR64x6dMZfWobPCkZjbqTL.jpg",
                "release_date": "1956-10-05",
                "title": "The Ten Commandments",
                "video": false,
                "vote_average": 7.769,
                "vote_count": 1743,
                "character": "Old Hebrew at Moses' House (uncredited)",
                "credit_id": "5ed64d3dc4f552001ebf05b5",
                "order": 84
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Louis Alberni"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nLuis Alberni (October 4, 1886 – December 23, 1962) was a Spanish-born American character actor in American films.\n\nAlberni was born in Barcelona, Spain. He majored in acting while attending the University of Madrid. In order to pursue his acting career further, he determined to emigrate to the United States and, in April 1912, he sailed to New York City as a steerage passenger aboard the S/S Nieuw Amsterdam. In New York, he acted on both stage and screen. His first motion picture performance was in the 1915 Jewish drama, Children of the Ghetto. On the stage, he appeared in more than a dozen Broadway plays between 1915 and 1928, including 39 East, Dreams for Sale and the original production of What Price Glory? in 1924–1925. In the sound film era, he had notable roles as Jacopo in The Count of Monte Cristo (1934), as Mr. Louie Louie in Easy Living (1937), and as the mayor in A Bell for Adano (1945). He died at the motion picture actors' home in Woodland Hills, California in 1962. His remains are interred at Valhalla Memorial Park Cemetery.",
        "birthday": "1886-10-03",
        "deathday": "1962-12-23",
        "gender": 2,
        "homepage": null,
        "id": 30264,
        "imdb_id": "nm0016422",
        "known_for_department": "Acting",
        "name": "Luis Alberni",
        "place_of_birth": "Barcelona, Barcelona, Catalonia, Spain",
        "popularity": 0.1461,
        "profile_path": "/l9T44h8op9ZT3Xx0RrhAzT6jaMc.jpg"
    }
}