{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5nkKy7eEDsXqsxFLJy3GxZhE90J.jpg",
                "genre_ids": [
                    16,
                    14,
                    18,
                    12
                ],
                "id": 476292,
                "original_language": "ja",
                "original_title": "さよならの朝に約束の花をかざろう",
                "overview": "Maquia is a member of a special race called the Iorph who can live for hundreds of years. However, Maquia has always felt lonely despite being surrounded by her people, as she was orphaned from a young age. She daydreams about the outside world, but dares not travel from her home due to the warnings of the clan's chief.  One day the kingdom of Mezarte invades her homeland. They already have what is left of the giant dragons, the Renato, under their control, and now their king wishes to add the immortality to his bloodline.  They ravage the Iorph homeland and kill most of its inhabitants. Caught in the midst of the attack, Maquia is carried off by one of the Renato. It soon dies, and she is left deserted in a forest, now truly alone save for the cries of a single baby off in the distance. Maquia finds the baby in a destroyed village and decides to raise him as her own, naming him Ariel. Although she knows nothing of the human world, how to raise a child that ages much faster than her.",
                "popularity": 2.59,
                "poster_path": "/hL3NqRE2ccR4Y2sYSJTrmalRjrz.jpg",
                "release_date": "2018-02-24",
                "title": "Maquia: When the Promised Flower Blooms",
                "video": false,
                "vote_average": 8.183,
                "vote_count": 667,
                "character": "Soldier (voice)",
                "credit_id": "646f7c5e17c44300fce18ca0",
                "order": 34
            },
            {
                "adult": false,
                "backdrop_path": "/rcEDPOOOUTLFxLLQJggfLffbofe.jpg",
                "genre_ids": [
                    16,
                    28,
                    14
                ],
                "id": 810693,
                "original_language": "ja",
                "original_title": "劇場版 呪術廻戦 0",
                "overview": "Yuta Okkotsu is a nervous high school student who is suffering from a serious problem—his childhood friend Rika has turned into a curse and won't leave him alone. Since Rika is no ordinary curse, his plight is noticed by Satoru Gojo, a teacher at Jujutsu High, a school where fledgling exorcists learn how to combat curses. Gojo convinces Yuta to enroll, but can he learn enough in time to confront the curse that haunts him?",
                "popularity": 9.5946,
                "poster_path": "/23oJaeBh0FDk2mQ2P240PU9Xxfh.jpg",
                "release_date": "2021-12-24",
                "title": "Jujutsu Kaisen 0",
                "video": false,
                "vote_average": 8.121,
                "vote_count": 1549,
                "character": "Jujutsu Sorcerer (voice)",
                "credit_id": "6329f8cde194b00080148375",
                "order": 34
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "藤井 隼",
            "ふじい はやと",
            "Hayato Fujī",
            "Hayato Fuji",
            "藤井 豪"
        ],
        "biography": "Hayato Fujii (藤井 隼, Fujii Hayato, March 14) is a Japanese voice actor from Kanagawa prefecture who is affiliated with 81 Produce.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.81produce.co.jp/actor_search/index.php/item?&id=109",
        "id": 3027085,
        "imdb_id": "nm8934294",
        "known_for_department": "Acting",
        "name": "Hayato Fujii",
        "place_of_birth": "Kanagawa, Japan",
        "popularity": 0.3366,
        "profile_path": "/vjwBFaIvbWrJQklz99kG7dmndXV.jpg"
    }
}