{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/s94NjfKkcSczZ1FembwmQZwsuwY.jpg",
                "genre_ids": [
                    878,
                    12
                ],
                "id": 617126,
                "original_language": "en",
                "original_title": "The Fantastic 4: First Steps",
                "overview": "Against the vibrant backdrop of a 1960s-inspired, retro-futuristic world, Marvel's First Family is forced to balance their roles as heroes with the strength of their family bond, while defending Earth from a ravenous space god called Galactus and his enigmatic Herald, Silver Surfer.",
                "popularity": 124.3861,
                "poster_path": "/x26MtUlwtWD26d0G0FXcppxCJio.jpg",
                "release_date": "2025-07-23",
                "title": "The Fantastic 4: First Steps",
                "video": false,
                "vote_average": 7.18,
                "vote_count": 1239,
                "character": "WHIH Reporter Albert Taft",
                "credit_id": "68809446ff26beb16372d744",
                "order": 28
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Nathaniel is an award-winning stage performer, director, screen actor, and published playwright.\n\nHis work has been nominated for the George Devine Award for Most Promising Playwright (for Blood Red Apples & Deep Gold Honey), the BBC Writersroom Popcorn Award for Best New Writing (for In Everglade Studio), and an Offie (for Port City Signature), and won a Bursary Prize for writing and performance at Screenshot, hosted by the Royal Court (for The Nomineers, a monologue adaptation of his play Press).\n\nHis first published play, In Everglade Studio, was listed by The British Blacklist among the Best Theatre of 2024, featured seven original songs with lyrics written by Brimmer-Beller, and transferred to London from an acclaimed Edinburgh run. His thriller Port City Signature and comedy Press were published not long afterwards, totaling three published works in 14 months.\n\nBrimmer-Beller has directed and edited multiple short films, including Evening Plans (nominated for Best Short Film in the New Visions category at the Edinburgh International Film Festival) and B-Roll, premiered in London at Side/Step Festival. He also wrote the radio play Turner & Turner, and the acclaimed Edinburgh Fringe plays Mack The Knife, Technicolor, and Fear of Roses.  He has directed more than 30 theatrical productions - including the UK premiere of Pulitzer Prize-winner James Ijames' White - and written more than twenty plays, including seven acclaimed premieres at the Edinburgh Fringe Festival (\"Genius\" - Broadway Baby, \"Fringe theatre does not get much better than this\" - The Violet Curtain).\n\nBrimmer-Beller has collaborated with the Almeida Theatre, The Hope Theatre, VAULT Festival, Pleasance, Assembly, The Old Red Lion, The Jack Studio Theatre, South of the River Pictures, SISTER Global, Criterion Theatre, and more.\n\nOther notable works include theatre-industry satire The Kindness of Strangers, darkly comedic story of Black and Jewish life Blood Red Apples & Deep Gold Honey (developed with the Almeida Theatre and nominated for the George Devine Award in 2022), 1960s-set fashion industry mystery Nines, short piece And I Mean That Sincerely, and acclaimed seaside noir Port City Signature, which was selected to reopen The Hope Theatre's new era in 2024, and earned an OffWestEnd award nomination for its design.  Brimmer-Beller continues to write and perform for stage and screen.\n\nOriginally from Washington, DC, he attended the University of Edinburgh studying International Relations, and completed a Masters in Film Studies from King’s College London in 2020, receiving a Distinction.  Nathaniel is also an editor, audio producer, graphic designer, and horse rider.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "http://brimmerbeller.com",
        "id": 3030050,
        "imdb_id": null,
        "known_for_department": "Writing",
        "name": "Nathaniel Brimmer-Beller",
        "place_of_birth": "Washington, D.C., United States of America",
        "popularity": 0.0143,
        "profile_path": "/5FXkQjvYEFxS4FuHZZENMwVSGRW.jpg"
    }
}