{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sj5R5SGor3YMFBuabMj8gPbyBmh.jpg",
                "genre_ids": [
                    12,
                    18,
                    37
                ],
                "id": 3090,
                "original_language": "en",
                "original_title": "The Treasure of the Sierra Madre",
                "overview": "Two jobless Americans convince a prospector to travel to the mountains of Mexico with them in search of gold. But the hostile wilderness, local bandits, and greed all get in the way of their journey.",
                "popularity": 2.4311,
                "poster_path": "/pWcst7zVbi8Z8W6GFrdNE7HHRxL.jpg",
                "release_date": "1948-01-15",
                "title": "The Treasure of the Sierra Madre",
                "video": false,
                "vote_average": 8.0,
                "vote_count": 1264,
                "character": "James Cody",
                "credit_id": "52fe4385c3a36847f805a537",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Harold Herman Brix",
            "Herman Brix"
        ],
        "biography": "Bruce Bennett (born Harold Herman Brix) was an American actor and Olympic silver medalist shot putter.  His first career was as an athlete.  At the University of Washington, where he majored in economics, he played football (tackle) in the 1926 Rose Bowl and was a track-and-field star. Two years later, he won the Silver medal for the shot put in the 1928 Olympic Games.  Brix moved to Los Angeles in 1929 after being invited to compete for the Los Angeles Athletic Club and befriended actor Douglas Fairbanks Jr., who arranged a screen test for him at Paramount.\n\nIn 1931, MGM, adapting author Edgar Rice Burroughs's popular Tarzan adventures for the screen, selected Brix to play the title character. Brix, however, broke his shoulder filming the 1931 football film Touchdown, so swimming champion Johnny Weissmuller replaced Brix and became a major star. After Ashton Dearholt convinced Burroughs to allow him to form Burroughs-Tarzan Enterprises, Inc., and make a Tarzan serial film, Dearholt cast Brix in the lead. Pressbook copy has it that Burroughs made the choice himself, but, in fact, in his biography, Brix confirmed that Burroughs never even saw him until after the contract was signed, and then only briefly. The film was begun on location in Guatemala, under rugged conditions (jungle diseases and cash shortages were frequent). Brix did his own stunts, including a fall to rocky cliffs below. The Washington Post quoted Gabe Essoe's passage from his book Tarzan of the Movies: \"Brix's portrayal was the only time between the silents and the 1960s that Tarzan was accurately depicted in films. He was mannered, cultured, soft-spoken, a well educated English lord who spoke several languages, and didn't grunt.\"[4]\n\nBrix shown in the opening credits of the serial The New Adventures of Tarzan (1935).  Due to financial mismanagement, Dearholt had to complete filming of much of the serial back in Hollywood, and Brix, although his travel and daily living expenses in Guatemala were covered throughout the shoot, never received his contracted salary, along with the rest of the cast. The finished film, The New Adventures of Tarzan, was released in 1935 by Burroughs-Tarzan, and offered to theatres as a 12-chapter serial or a seven-reel feature. A second feature, Tarzan and the Green Goddess, was culled from the footage in 1938.",
        "birthday": "1906-05-19",
        "deathday": "2007-02-24",
        "gender": 2,
        "homepage": null,
        "id": 30303,
        "imdb_id": "nm0071636",
        "known_for_department": "Acting",
        "name": "Bruce Bennett",
        "place_of_birth": "Tacoma, Washington, USA",
        "popularity": 0.8475,
        "profile_path": "/70GxHSRcIsgSsTVl0hzjxLEA4s7.jpg"
    }
}