{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5VuOmxGfqu7yf05q8Q6SUKOh7oe.jpg",
                "genre_ids": [
                    12,
                    18,
                    36
                ],
                "id": 169881,
                "original_language": "en",
                "original_title": "The Physician",
                "overview": "England, 1021. Rob Cole, a boy born in a miserable mining town, swears to become a physician and vanquish disease and death. His harsh path of many years, a quest for knowledge besieged by countless challenges and sacrifices, leads him to the remote Isfahan, in Persia, where he meets Ibn Sina, the greatest healer of his time.",
                "popularity": 3.2959,
                "poster_path": "/18eJr4Fc4HKymLgKLgGQbD37SPK.jpg",
                "release_date": "2013-12-25",
                "title": "The Physician",
                "video": false,
                "vote_average": 7.349,
                "vote_count": 1119,
                "character": "Rob Cole",
                "credit_id": "52fe4cecc3a36847f8244d19",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/8UOAYjhwSF3aPZhm6wgLuyHRyrR.jpg",
                "genre_ids": [
                    37,
                    18
                ],
                "id": 932086,
                "original_language": "en",
                "original_title": "Horizon: An American Saga - Chapter 1",
                "overview": "In 1859, families discover the lure of the Old West as they settle in territories from Wyoming to Kansas. Meanwhile, a gruff cowboy soon finds himself on the run with a prostitute and a young boy after killing a fellow gunman.",
                "popularity": 6.2318,
                "poster_path": "/hqDkO0W9uk4aiwzn3pTeLO7NPZD.jpg",
                "release_date": "2024-06-26",
                "title": "Horizon: An American Saga - Chapter 1",
                "video": false,
                "vote_average": 6.871,
                "vote_count": 562,
                "character": "Hugh Proctor",
                "credit_id": "6335fefee21023007e803504",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Том Пейн",
            "湯姆·佩恩",
            "تام پین",
            "Thomas Payne"
        ],
        "biography": "Thomas \"Tom\" Payne (born December 21, 1982 in Chelmsford, Essex) is a British actor. He is known for the role of Paul \"Jesus\" Rovia in the television series The Walking Dead. Currently he can be seen in the role of Malcolm Bright in the series Prodigal Son.\n\nPayne grew up in Bath, Somerset, in western England. He trained at London's Central School of Speech and Drama, graduating with a Bachelor of Arts degree in 2005. During his training, he gained his first experience in plays such as Class Enemy, The Balcony, The Rivals, Three Sisters, A Midsummer Night's Dream, Richard III, and The Man Who Had All the Luck.\n\nAfter graduating, he landed his first leading role in London's West End production of Journey's End. He appeared alongside Imogen Stubbs in Maria Aberg's production of Shrieks of Laughter at the Soho Theatre.\n\nAfter his first television roles in series such as Skins - Hautnah or Casualty, in 2007 he obtained the role of Brett Aspinall in two seasons of the series Waterloo Road.\n\nIn 2008, he made his feature film debut alongside Frances McDormand and Amy Adams in Miss Pettigrew's Big Day. From 2011 to 2012, he appeared in the television series Luck as Leon Micheaux. In 2013, Payne took his first leading role in The Medicus, the film adaptation of the novel of the same name by Noah Gordon.\n\nHis brother Will Payne is also active as an actor.",
        "birthday": "1982-12-21",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 30319,
        "imdb_id": "nm2092835",
        "known_for_department": "Acting",
        "name": "Tom Payne",
        "place_of_birth": "Chelmsford, Essex, England, UK",
        "popularity": 0.5531,
        "profile_path": "/dvQk9ewR7EuUEVuYANg3AmYsGo2.jpg"
    }
}