{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mTsbahr4SLqgVZkKRN0O8t5iA9y.jpg",
                "genre_ids": [
                    18,
                    35,
                    10402
                ],
                "id": 71,
                "original_language": "en",
                "original_title": "Billy Elliot",
                "overview": "County Durham, England, 1984. The miners' strike has started and the police have started coming up from Bethnal Green, starting a class war with the lower classes suffering. Caught in the middle of the conflict is 11-year old Billy Elliot, who, after leaving his boxing club for the day, stumbles upon a ballet class and finds out that he's naturally talented. He practices with his teacher Mrs. Wilkinson for an upcoming audition in Newcastle-upon Tyne for the royal Ballet school in London.",
                "popularity": 5.0851,
                "poster_path": "/nOr5diUZxphmAD3li9aiILyI28F.jpg",
                "release_date": "2000-09-28",
                "title": "Billy Elliot",
                "video": false,
                "vote_average": 7.597,
                "vote_count": 3952,
                "character": "Tutor 4",
                "credit_id": "5fb42f8873520500411c0b32",
                "order": 25
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Lee Williams is a Welsh stage, television and film actor and former model. Williams was born in Wales but later moved to Warrington in England.\n\nHe studied Fashion at Central St Martin's College of Art and Design in London but during his second year he dropped out to work for Vivienne Westwood's organisation. He then became a professional model, working with French Connection and Calvin Klein.\n\nHe quit modelling and became an actor and made numerous appearance in BBC Television productions.  Williams was nominated for Best Actor at Canadian 'Gemini Awards' for his lead role in the film \"No Night Is Too Long\" (2002).",
        "birthday": "1974-04-03",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 30317,
        "imdb_id": "nm0931146",
        "known_for_department": "Acting",
        "name": "Lee Williams",
        "place_of_birth": "Bangor, Gwynedd, Wales, UK",
        "popularity": 0.1529,
        "profile_path": "/gIdLPAljZgAhXoOOTeIuPQFn2z0.jpg"
    }
}