{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/v23fWgJUEt8EMmvn19btIacxP8E.jpg",
                "genre_ids": [
                    10749,
                    14,
                    16
                ],
                "id": 3933,
                "original_language": "en",
                "original_title": "Corpse Bride",
                "overview": "In a 19th-century European village, a young man about to be married is whisked away to the underworld and wed to a mysterious corpse bride, while his real bride waits bereft in the land of the living.",
                "popularity": 25.6795,
                "poster_path": "/isb2Qow76GpqYmsSyfdMfsYAjts.jpg",
                "release_date": "2005-09-12",
                "title": "Corpse Bride",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 9691,
                "character": "Nell Van Dort / Hildegarde (voice)",
                "credit_id": "52fe43a7c3a36847f806505f",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/6zfPDvqeZUleXjNaU5iWQwHUtCN.jpg",
                "genre_ids": [
                    35,
                    80
                ],
                "id": 11382,
                "original_language": "en",
                "original_title": "Bullets Over Broadway",
                "overview": "After young playwright, David Shayne obtains funding for his play from gangster Nick Valenti, Nick's girlfriend Olive miraculously lands the role of a psychiatrist—but not only is she a bimbo who could never pass for a psychiatrist—she's a dreadful actress. David puts up with the leading man who is a compulsive eater, the grand dame who wants her part jazzed up, and Olive's interfering hitman/bodyguard—but, eventually he must decide whether art or life is more important.",
                "popularity": 3.4403,
                "poster_path": "/mY9D1oCLeDKNMdUO8EV7MoCZ3up.jpg",
                "release_date": "1994-10-14",
                "title": "Bullets Over Broadway",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 639,
                "character": "Eden Brent",
                "credit_id": "52fe44359251416c7502c90b",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/bcT8CaBIj086WVD7K529h78eujb.jpg",
                "genre_ids": [
                    10751,
                    35,
                    12,
                    16,
                    14
                ],
                "id": 508439,
                "original_language": "en",
                "original_title": "Onward",
                "overview": "In a suburban fantasy world, two teenage elf brothers embark on an extraordinary quest to discover if there is still a little magic left out there.",
                "popularity": 6.4017,
                "poster_path": "/f4aul3FyD3jv3v4bul1IrkWZvzq.jpg",
                "release_date": "2020-02-29",
                "title": "Onward",
                "video": false,
                "vote_average": 7.658,
                "vote_count": 6366,
                "character": "Grecklin (voice)",
                "credit_id": "5e5af34366ae4d00128550a4",
                "order": 9
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/zpBl7qfBB1ir1BVNQtPlPwQ6IFd.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 1165,
                "original_language": "en",
                "original_title": "The Queen",
                "overview": "The Queen is an intimate behind the scenes glimpse at the interaction between HM Elizabeth II and Prime Minister Tony Blair during their struggle, following the death of Diana, to reach a compromise between what was a private tragedy for the Royal family and the public's demand for an overt display of mourning.",
                "popularity": 3.5718,
                "poster_path": "/v08RH5Cx9EFAQMBWQuE5jHAgHYs.jpg",
                "release_date": "2006-09-15",
                "title": "The Queen",
                "video": false,
                "vote_average": 6.953,
                "vote_count": 1364,
                "credit_id": "58212c4a925141392e000bad",
                "department": "Crew",
                "job": "Thanks"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Tracey Ullman is a British-American actress, singer, dancer, screenwriter, director, and producer. Critics have lauded her ability to shift seamlessly in and out of character and accents, with many dubbing her the \"female Peter Sellers\".\n\nUllman began her career in the British soap opera Mackenzie (1980), playing Lisa Mackenzie. After an award-winning performance in the improvised play Four in a Million at the Royal Court Theatre, she branched out into comedy. She starred in the British television sketch comedies A Kick Up the Eighties (1981) and Three of a Kind (1981–1983), the latter winning her a BAFTA in 1984. After a brief singing career (which garnered three top-ten singles), she appeared as Candice Valentine in Girls on Top (1985) with Dawn French and Jennifer Saunders.\n\nUllman emigrated from the United Kingdom to the United States. She would go on to star in her own network television comedy series, The Tracey Ullman Show (1987–1990), which also featured the first appearances of the long-running animated media franchise The Simpsons (1989–present). She later produced programmes for HBO, including Tracey Takes On... (1996–1999) garnering numerous awards. She has appeared in several feature films, including Plenty (1985) which earned her a BAFTA Award for Best Supporting Actress nomination.\n\nIn 2016, she returned to British television with the BBC sketch comedy show Tracey Ullman's Show (2016–2018) , her first project for the broadcaster in over 30 years. This led to the creation of the topical comedy series Tracey Breaks the News (2017–2018).\n\nShe is the recipient of numerous accolades, including twelve American Comedy Awards, seven Primetime Emmy Awards, two British Academy Film Awards, four Satellite Awards, a Golden Globe Award, and a Screen Actors Guild Award.",
        "birthday": "1959-12-30",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 30364,
        "imdb_id": "nm0001808",
        "known_for_department": "Acting",
        "name": "Tracey Ullman",
        "place_of_birth": "Slough, Berkshire, England, UK",
        "popularity": 0.794,
        "profile_path": "/cmug3uUXKBo9fhCcJk3pkgt1nvM.jpg"
    }
}