{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/muSeX7fnNw0pv4zHK7RSwZln6Hk.jpg",
                "genre_ids": [
                    18,
                    10402
                ],
                "id": 10376,
                "original_language": "it",
                "original_title": "La leggenda del pianista sull'oceano",
                "overview": "The story of a virtuoso piano player who lives his entire life aboard an ocean liner. Born and raised on the ship, 1900 learned about the outside world through interactions with passengers, never setting foot on land, even for the love of his life. Years later, the ship may be destroyed, and a former band member fears that 1900 may still be aboard, willing to go down with the ship.",
                "popularity": 2.8883,
                "poster_path": "/iOcbJ5pxokOPDRgieVDbsFMrCc6.jpg",
                "release_date": "1998-10-28",
                "title": "The Legend of 1900",
                "video": false,
                "vote_average": 8.25,
                "vote_count": 2348,
                "character": "Doctor Klauserman",
                "credit_id": "5f9b522271f095003ae3042f",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "John Henley Heathcote-Williams (15 November 1941 – 1 July 2017), known as Heathcote Williams, was an English poet, actor, political activist and dramatist. He wrote a number of book-length polemical poems including Autogeddon, Falling for a Dolphin and Whale Nation, which in 1988 was described by Philip Hoare as \"the most powerful argument for the newly instigated worldwide ban on whaling.\" Williams invented his idiosyncratic \"documentary/investigative poetry\" style which he put to good purpose bringing a diverse range of environmental and political matters to public attention. His last published work, American Porn was a critique of the American political establishment and the election of President Donald Trump; its publication date was the day of Trump's inauguration (20 January 2017). In June 2015 he published a book-length investigative poem about the \"Muslim Gandhi\", Khan Abdul Ghaffar Khan, Badshah Khan.\n\nAs well as being a playwright and screenwriter, Williams appeared in a number of independent and Hollywood films and was among the celebrity guests in the last episode of season 4 of Friends, '\"The One With Ross's Wedding\"'. He played Prospero in Derek Jarman's The Tempest (1979) and appeared in several \"arthouse\" films, including Orlando (1992), as well as the Hollywood film Basic Instinct 2 (2006). Al Pacino played the part of a Williams fan in a spoof arts documentary, Every Time I Cross the Tamar I Get into Trouble. Williams also wrote lyrics, collaborating with Marianne Faithfull among others.\n\nFrom Wikipedia, the free encyclopedia",
        "birthday": "1941-11-15",
        "deathday": "2017-07-01",
        "gender": 2,
        "homepage": null,
        "id": 30431,
        "imdb_id": "nm0930748",
        "known_for_department": "Acting",
        "name": "Heathcote Williams",
        "place_of_birth": "Helsby, Cheshire, England, UK",
        "popularity": 0.1758,
        "profile_path": "/1gCuLzhbBTiFPLZ0pD4RGAvE7NJ.jpg"
    }
}