{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5vuQnRJURp6rZoEEnhW0HC7DBQc.jpg",
                "genre_ids": [
                    10749,
                    35,
                    18
                ],
                "id": 3109,
                "original_language": "en",
                "original_title": "The Quiet Man",
                "overview": "An American man returns to the village of his birth in Ireland, where he finds love and conflict.",
                "popularity": 2.1903,
                "poster_path": "/u3B1hVKHE56yBRoxF3Nk9uxHdYN.jpg",
                "release_date": "1952-07-21",
                "title": "The Quiet Man",
                "video": false,
                "vote_average": 7.321,
                "vote_count": 564,
                "character": "Owen Glynn",
                "credit_id": "52fe4387c3a36847f805b0f7",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Séan Joseph McClory",
            "Seán McClory",
            "Sean McGlory",
            "Shawn McGlory"
        ],
        "biography": "Sean McClory was born in Dublin, Ireland, but spent his early life in Galway. He was the son of Hugh Patrick, an architect and civil engineer, and Mary Margaret Ball, who had been a model.\n\nSean decided to become an actor and joined Dublin's renowned Abbey Theater (also known as the National Theater of Ireland, opened in 1904). He rose through the ranks playing in productions of the works of such authors as William Butler Yeats and George Bernard Shaw, and soon began to play leads mostly in comedies (popular through most of the 1940s and into the 1950s).\n\nWhen comedies began to fade from the theater after World War II, McClory turned an eye toward film. In early 1947 he decided to make the jump to America and break into Hollywood. His first roles were that of a staple in American films: the Irish cop, which he played in two of the Dick Tracy series in 1947. In 1949 he signed a short contract with 20th Century-Fox. By 1950 he was showing up in more notable films - though uncredited, particularly in The Glass Menagerie (1950).\n\nWithin a year McClory's talents were being showcased in various small feature roles. John Ford finally began casting - a painstaking process for the finicky director - for his long conceived The Quiet Man (1952) and chose McClory for a small but showy part, in which he was seen throughout the film feature with Charles B. Fitzsimons, the younger brother of the film's star, Maureen O'Hara, playing an Irish villager. Although some of the cast were familiar members of the \"John Ford Stock Company\", many roles were filled by actual Irish villagers (the film was shot on location) and included a generous helping of Abbey Theater alumni: the Shields brothers (Barry Fitzgerald and Arthur Shields) and Jack MacGowran, in addition to O'Hara McClory. Ford wanted him for roles in several of  his subsequent films, however McClory's busy film and TV schedule only allowed him to accept roles in two other Ford films, The Long Gray Line and Cheyenne Autumn.\n\nMcClory had a cultured, neutral Irish brogue that fit well in small- or  big-screen performances, unlike such Irish actors as Barry Fitzgerald who, though very effective and beloved, had a thick brogue that kept him forever cast as an Irishman. As a result, McClory was much more at home in American TV and had many memorable roles from 1953 onward, appearing in a gamut of episodic TV in addition to his feature film work. However, it was his frequent appearances on the small screen that enabled McClory to stand out in viewers' memories, especially in a range of western and adventure series (in which he played a good sprinkling of Irish characters) well into the 1970s.\n\nThough not as busy in the 1980s as he was in the '70s, one role in which he truly stood out was in an adaptation by John Huston of Irish writer James Joyce's famous 1907 short story \"The Dead\" made in 1987 (The Dead (1987)), his final film appearance. McClory's role as Mr. Grace was not  a character in the original story but was created by Huston and his son Tony Huston to provide McClory with a reading of the medieval Irish poem \"Young  Donal\", which was very effective to the mood of this look at Irish family remembrance.",
        "birthday": "1924-03-08",
        "deathday": "2003-12-10",
        "gender": 2,
        "homepage": null,
        "id": 30501,
        "imdb_id": "nm0565887",
        "known_for_department": "Acting",
        "name": "Sean McClory",
        "place_of_birth": "Dublin, Ireland",
        "popularity": 0.3345,
        "profile_path": "/3DtG026ynOwsH9nhqwqskCrM2Bg.jpg"
    }
}