{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mPzUzA0iK50gBdMuux4Dojb7VQL.jpg",
                "genre_ids": [
                    18,
                    37
                ],
                "id": 3110,
                "original_language": "en",
                "original_title": "Shane",
                "overview": "A weary gunfighter attempts to settle down with a homestead family, but a smouldering settler and rancher conflict forces him to act.",
                "popularity": 5.0136,
                "poster_path": "/svr5ADpjXTCOQv8hmuJnB7I14Qv.jpg",
                "release_date": "1953-04-23",
                "title": "Shane",
                "video": false,
                "vote_average": 7.358,
                "vote_count": 649,
                "character": "Mrs. Howells",
                "credit_id": "52fe4387c3a36847f805b1f5",
                "order": 20
            },
            {
                "adult": false,
                "backdrop_path": "/oM5mMTGBqsmMJO3l5tkQdQ0Xujm.jpg",
                "genre_ids": [
                    16,
                    35,
                    10751,
                    12
                ],
                "id": 10112,
                "original_language": "en",
                "original_title": "The Aristocats",
                "overview": "When Madame Adelaide Bonfamille leaves her fortune to Duchess and her children—Bonfamille’s beloved family of cats—the butler plots to steal the money and kidnaps the legatees, leaving them out on a country road. All seems lost until the wily Thomas O’Malley Cat and his jazz-playing alley cats come to the aristocats’ rescue.",
                "popularity": 6.7171,
                "poster_path": "/1BVOSmQUhphMgnTxnXyfQ9tL1Sc.jpg",
                "release_date": "1970-12-24",
                "title": "The Aristocats",
                "video": false,
                "vote_average": 7.293,
                "vote_count": 5222,
                "character": "Frou-Frou (voice)",
                "credit_id": "52fe432a9251416c75005ec1",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/ftNimlo6fP4WKRMWnF1ghX4fPUy.jpg",
                "genre_ids": [
                    35,
                    10749,
                    18
                ],
                "id": 6620,
                "original_language": "en",
                "original_title": "Sabrina",
                "overview": "Linus and David Larrabee are the two sons of a very wealthy family. Linus is all work – busily running the family corporate empire, he has no time for a wife and family. David is all play – technically he is employed by the family business, but never shows up for work, spends all his time entertaining, and has been married and divorced three times. Meanwhile, Sabrina Fairchild is the young, shy, and awkward daughter of the household chauffeur, who goes away to Paris for two years, and returns to capture David's attention, while falling in love with Linus.",
                "popularity": 3.8978,
                "poster_path": "/86ix9wBxiMAaISt4HpmXQm6Mlym.jpg",
                "release_date": "1954-09-01",
                "title": "Sabrina",
                "video": false,
                "vote_average": 7.505,
                "vote_count": 1294,
                "character": "Jenny",
                "credit_id": "535d4dba0e0a264fdb004e8b",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Nancy Jane Kulp"
        ],
        "biography": "Nancy Jane Kulp (August 28, 1921 – February 3, 1991) was an American character actress best known as Miss Jane Hathaway on the popular CBS television series The Beverly Hillbillies.\n\nKulp in 1955 joined the cast of The Bob Cummings Show (Love That Bob) with Bob Cummings, portraying pith-helmeted neighborhood bird watcher Pamela Livingstone. In 1956, she appeared in the episode \"Johnny Bravo\" of the ABC/Warner Brothers series Cheyenne, with Clint Walker. Kulp played the role of Anastasia in three episodes of the NBC sitcom It's a Great Life in 1955 and 1956. In 1958, she appeared in Orson Welles' little-known pilot episode \"The Fountain of Youth\" in the television series Colgate Theatre. In 1960, she appeared as Emma St. John in the episode \"Kill with Kindness\" of the ABC/WB detective series Bourbon Street Beat, starring Andrew Duggan.\n\nKulp appeared on I Love Lucy in the 1956 episode \"Lucy Meets the Queen\", performing as an English maid, who shows Lucy and Ethel how to curtsy properly before Queen Elizabeth. Kulp also appeared in episodes of The Real McCoys, Perry Mason (\"The Case of the Prodigal Parent\", 1958), The Jack Benny Program (\"Don's 27th Anniversary with Jack\"), 87th Precinct (\"Killer's Choice\"), Pete and Gladys, The Twilight Zone (as Mrs. Gann in \"The Fugitive\"), and The Outlaws (\"The Dark Sunrise of Griff Kincaid\"). She played a housekeeper in a pilot for The William Bendix Show, which aired as the 1960–1961 season finale of CBS's Mister Ed under the title \"Pine Lake Lodge\". On the series My Three Sons in 1962, she portrayed a high school math and science teacher in two episodes under different character names, Miss Harris and Miss Fisher.\n\nShortly after her performances on My Three Sons in 1962, Kulp landed her breakout role as Jane Hathaway, the love-starved, bird-watching, perennial spinster, on the CBS television series The Beverly Hillbillies. In 1967, she received an Emmy Award nomination for her role, and she remained with the show until its cancellation in 1971. In 1978, she appeared on The Love Boat in the episode \"Mike and Ike / The Witness / The Kissing Bandit\" and she played Aunt Gertrude in the episode \"Tony and Julie / Separate Beds / America's Sweetheart\". On April 7, 1989, she played a nun in the Quantum Leap season 1 episode \"The Right Hand of God\". Kulp also appeared on The Brian Keith Show and Sanford and Son.\n\nKulp was once described as television's most homely girl or, as one reviewer put it, possessing the \"face of a shriveled balloon, the figure of a string of spaghetti, and the voice of a bullfrog in mating season.\" Others described her as tall and prim and praised her comedic skills.\n\nFrom Wikipedia, the free encyclopedia.",
        "birthday": "1921-08-28",
        "deathday": "1991-02-03",
        "gender": 1,
        "homepage": null,
        "id": 30519,
        "imdb_id": "nm0474685",
        "known_for_department": "Acting",
        "name": "Nancy Kulp",
        "place_of_birth": "Harrisburg, Pennsylvania, USA",
        "popularity": 0.6677,
        "profile_path": "/tV81XoljXJzbfvgdu6cRIILosyP.jpg"
    }
}