{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mPzUzA0iK50gBdMuux4Dojb7VQL.jpg",
                "genre_ids": [
                    18,
                    37
                ],
                "id": 3110,
                "original_language": "en",
                "original_title": "Shane",
                "overview": "A weary gunfighter attempts to settle down with a homestead family, but a smouldering settler and rancher conflict forces him to act.",
                "popularity": 5.1494,
                "poster_path": "/svr5ADpjXTCOQv8hmuJnB7I14Qv.jpg",
                "release_date": "1953-04-23",
                "title": "Shane",
                "video": false,
                "vote_average": 7.358,
                "vote_count": 649,
                "character": "Joey Starrett",
                "credit_id": "52fe4387c3a36847f805b1b1",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Brandon de Wilde",
            "Brandon deWilde",
            "Брендон Де Уайлд",
            "André Brandon deWilde",
            "براندون دی وایلد"
        ],
        "biography": "Andre Brandon deWilde (April 9, 1942 – July 6, 1972) was an American theatre and film actor. He was born into a theatrical family in Brooklyn. Debuting on Broadway at the age of 7, De Wilde became a national phenomenon by the time he completed his 492 performances for The Member of the Wedding and was considered a child prodigy.\n\nBefore the age of 12 he had become the first child actor awarded the Donaldson Award, filmed his role in The Member of the Wedding, starred in his most memorable film role as Joey Starrett in the film Shane (1953), been nominated for an Academy Award for Best Supporting Actor, starred in his own sitcom television series Jamie on ABC and became a household name making numerous radio and TV appearances before being featured on the cover of Life magazine on March 10, 1952, for his second Broadway outing Mrs. McThing.\n\nInto adulthood, additional plays, movies and TV appearances followed before his death at age 30 in a motor vehicle accident in Colorado, on July 6, 1972.\n\nDescription above from the Wikipedia article Brandon De Wilde, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1942-04-09",
        "deathday": "1972-07-06",
        "gender": 2,
        "homepage": null,
        "id": 30511,
        "imdb_id": "nm0001121",
        "known_for_department": "Acting",
        "name": "Brandon De Wilde",
        "place_of_birth": "Brooklyn, New York City, New York, USA",
        "popularity": 0.5864,
        "profile_path": "/cl8hufW5kHzDeuzHUgbj2QjdenT.jpg"
    }
}