{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mPzUzA0iK50gBdMuux4Dojb7VQL.jpg",
                "genre_ids": [
                    18,
                    37
                ],
                "id": 3110,
                "original_language": "en",
                "original_title": "Shane",
                "overview": "A weary gunfighter attempts to settle down with a homestead family, but a smouldering settler and rancher conflict forces him to act.",
                "popularity": 5.1494,
                "poster_path": "/svr5ADpjXTCOQv8hmuJnB7I14Qv.jpg",
                "release_date": "1953-04-23",
                "title": "Shane",
                "video": false,
                "vote_average": 7.358,
                "vote_count": 649,
                "character": "Ernie Wright",
                "credit_id": "52fe4387c3a36847f805b1e1",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Leonard Clarence Strong"
        ],
        "biography": "Leonard Clarence Strong (born 12 August 1908, Salt Lake City, Utah - d. 23 January 1980, Glendale, California was a prolific American character actor specialising in playing Asian roles.  Beginning with Little Tokyo, U.S.A in 1942, Strong played a gamut of roles as Japanese, Chinese, Koreans, Thais, etc. in films such as Dragon Seed (1944),Up in Arms (1944), Jack London (1943), Salute to the Marines (1943), Behind the Rising Sun (1943), Night Plane from Chungking (1943), Bombardier (1943),Underground Agent (1942), and Manila Calling (1942). He played the Thai interpreter in both Anna and the King of Siam and its musical remake The King and I. Strong also appeared in the movie Shane (1953) as homesteader Ernie Wright.  Strong achieved some pop culture notoriety for his role on television as \"The Claw\" on Get Smart. He appeared in a season-five episode of Alfred Hitchcock Presents (1960) \"The Cure\" written by horror writer Robert Bloch. Set deep in an Amazon jungle, Strong plays Luiz, a loyal native who speaks broken English and saves his employer, an oil explorer, from the attempted murder of his supposedly mentally ill and unfaithful wife. Something gets lost in the translation when his employer wants Strong to take her to a psychiatrist 200 miles down river, and he takes her instead to a native headshrinker. The denouement comes when Strong returns alone to the shock of his employer. He says, \"I do what you tell me. I take her to my people. The best headshrinkers in the world\". Then, pulling his employer's wife's now shrunken head out of a bag, he says, \"Best job in the world.\"  Another notable television role was his haunting and mostly silent portrayal of the title character in the original Twilight Zone episode, \"The Hitch-Hiker\", which is often listed as one of the ten best episodes of the series. With his thumb extended, seeking a ride, and asking \"Going my way?\", Strong is seen in one of the half-dozen, seconds-long scenes used at the start of every one of the 30 DVDs in the CBS DVD five-season collection, \"The Twilight Zone, The Definitive Edition.\"",
        "birthday": "1908-08-12",
        "deathday": "1980-01-23",
        "gender": 2,
        "homepage": null,
        "id": 30514,
        "imdb_id": "nm0835012",
        "known_for_department": "Acting",
        "name": "Leonard Strong",
        "place_of_birth": "Salt Lake City, Utah, USA",
        "popularity": 0.1003,
        "profile_path": "/byWCrKaiOaVpP3BlmNhwafRuaAa.jpg"
    }
}