{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/v3ClsT59peXyGJ4XuDvIQAPwcZy.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 4133,
                "original_language": "en",
                "original_title": "Blow",
                "overview": "A boy named George Jung grows up in a struggling family in the 1950's. His mother nags at her husband as he is trying to make a living for the family. It is finally revealed that George's father cannot make a living and the family goes bankrupt. George does not want the same thing to happen to him, and his friend Tuna, in the 1960's, suggests that he deal marijuana. He is a big hit in California in the 1960's, yet he goes to jail, where he finds out about the wonders of cocaine. As a result, when released, he gets rich by bringing cocaine to America. However, he soon pays the price.",
                "popularity": 6.9266,
                "poster_path": "/yYZFVfk8aeMP4GxBSU9MTvqs9mJ.jpg",
                "release_date": "2001-04-04",
                "title": "Blow",
                "video": false,
                "vote_average": 7.358,
                "vote_count": 4437,
                "character": "Ermine Jung",
                "credit_id": "52fe43aec3a36847f8067533",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/k3AGi4UD8Ql2dKosXh6FrBSKm0s.jpg",
                "genre_ids": [
                    10402,
                    18,
                    10749,
                    80
                ],
                "id": 9762,
                "original_language": "en",
                "original_title": "Step Up",
                "overview": "Tyler Gage receives the opportunity of a lifetime after vandalizing a performing arts school, gaining him the chance to earn a scholarship and dance with an up and coming dancer, Nora.",
                "popularity": 5.6343,
                "poster_path": "/fmw52kXk2kN8AQil7tgOD41gt4Q.jpg",
                "release_date": "2006-08-11",
                "title": "Step Up",
                "video": false,
                "vote_average": 6.872,
                "vote_count": 3783,
                "character": "Director Gordon",
                "credit_id": "52fe4528c3a36847f80bf913",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/8T0qNf0Kccen93L6GgvtGylheo3.jpg",
                "genre_ids": [
                    35,
                    18,
                    36
                ],
                "id": 140823,
                "original_language": "en",
                "original_title": "Saving Mr. Banks",
                "overview": "Author P.L. Travers looks back on her childhood while reluctantly meeting with Walt Disney, who seeks to adapt her Mary Poppins books for the big screen.",
                "popularity": 3.9502,
                "poster_path": "/4RkcUe5PKnYvrCwMjk8giUAoID7.jpg",
                "release_date": "2013-11-29",
                "title": "Saving Mr. Banks",
                "video": false,
                "vote_average": 7.346,
                "vote_count": 3375,
                "character": "Aunt Ellie",
                "credit_id": "52fe4a9c9251416c750e8191",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/o3U4733mGsmieBeqs4Sw2ze6n53.jpg",
                "genre_ids": [
                    14,
                    12,
                    10751
                ],
                "id": 245842,
                "original_language": "en",
                "original_title": "The King's Daughter",
                "overview": "King Louis XIV's quest for immortality leads him to capture and steal a mermaid's life force, a move that is further complicated by his illegitimate daughter's discovery of the creature.",
                "popularity": 3.1414,
                "poster_path": "/sZ3ZxAjy26ZEo3WM4JFdOkoE5sS.jpg",
                "release_date": "2022-01-21",
                "title": "The King's Daughter",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 693,
                "character": "Abbess",
                "credit_id": "5431ddaf0e0a265834002c23",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/vDKRMZGFTKP9nQolzeSB1rB1w6p.jpg",
                "genre_ids": [
                    18,
                    36,
                    10752
                ],
                "id": 324786,
                "original_language": "en",
                "original_title": "Hacksaw Ridge",
                "overview": "WWII American Army Medic Desmond T. Doss, who served during the Battle of Okinawa, refuses to kill people and becomes the first Conscientious Objector in American history to receive the Congressional Medal of Honor.",
                "popularity": 17.0287,
                "poster_path": "/wuz8TjCIWR2EVVMuEfBnQ1vuGS3.jpg",
                "release_date": "2016-10-07",
                "title": "Hacksaw Ridge",
                "video": false,
                "vote_average": 8.193,
                "vote_count": 14313,
                "character": "Bertha Doss",
                "credit_id": "56108d4892514178990005a0",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Rachel Anne Griffiths",
            "ریچل گریفیتس"
        ],
        "biography": "Rachel Anne Griffiths AM (born 18 December 1968) is an Australian film and television actress. She came to prominence with the 1994 film Muriel's Wedding and her Academy Award nominated performance in Hilary and Jackie (1998). She is best known for her portrayals of Brenda Chenowith in the HBO series Six Feet Under and Sarah Walker Laurent on the ABC primetime drama Brothers & Sisters. Her work in film and television has earned her a Golden Globe Award, two Screen Actors Guild Awards and three Australian Film Institute Awards.\n\nGriffith attended Melbourne University, studying philosophy, before attending the drama department at Victoria School of the Art.  After college, she began working with the touring youth company Woolly Jumpers Theater Company, as well as the Melbourne Theater Company, where she appeared in numerous dramas.  \n\nGriffiths made a name for herself in 1991 when she wrote and performed in the short film \"Barbie Gets Hip,” which was screened at the Melbourne International Film Festival. She landed a few TV spots before she was cast as Rhonda, Toni Collette's sidekick in P.J. Hogan's \"Muriel's Wedding\" (1994), winning her an Australian Film Institute Award for Best Supporting Actress. These successes jump-started her career, landing her numerous dramatic and comedic roles in overseas productions, before making her American cinema debut with her second P.J. Hogan collaboration, \"My Best Friend's Wedding” (1997).\n\nIn the fall of 2001, Griffiths accepted her first major television series role and came aboard Alan Ball’s HBO series \"Six Feet Under.\"  Griffith stayed with the show during its five years of critical acclaim, while at the same time, continued to appear an lend her voice to screen and direct-to-video features before returning to telvision to star in \"Brothers and Sisters\" to much similar acclaim. ",
        "birthday": "1968-12-18",
        "deathday": null,
        "gender": 1,
        "homepage": "https://shanahan.com.au/client/rachel-griffiths/",
        "id": 3052,
        "imdb_id": "nm0341737",
        "known_for_department": "Acting",
        "name": "Rachel Griffiths",
        "place_of_birth": "Melbourne, Victoria, Australia",
        "popularity": 1.6514,
        "profile_path": "/n7rKwLjZmbkBKWBwhj9SYzsRaF6.jpg"
    }
}