{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/syKiIOqEoOi1Hb0Oh0n9cImcBab.jpg",
                "genre_ids": [
                    27,
                    53
                ],
                "id": 756999,
                "original_language": "en",
                "original_title": "The Black Phone",
                "overview": "Finney Blake, a shy but clever 13-year-old boy, is abducted by a sadistic killer and trapped in a soundproof basement where screaming is of little use. When a disconnected phone on the wall begins to ring, Finney discovers that he can hear the voices of the killer’s previous victims. And they are dead set on making sure that what happened to them doesn’t happen to Finney.",
                "popularity": 13.5895,
                "poster_path": "/p9ZUzCyy9wRTDuuQexkQ78R2BgF.jpg",
                "release_date": "2022-06-17",
                "title": "The Black Phone",
                "video": false,
                "vote_average": 7.563,
                "vote_count": 5255,
                "character": "Billy",
                "credit_id": "60788727ab68490058bb1100",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Jacob Moran is known for his role of Billy in the Blumhouse Universal Pictures blockbuster “The Black Phone.” Jacob starred as Tristan, in Thommy Kane’s “New Shoes” that premiered at the American Pavilion at Cannes Film Festival which earned Jacob \"Best Actor\" and \"Rising Star\" awards. Most recently, Jacob portrayed David in the Warner Bros./Essex horror film \"The Curse of the Necklace\" which was released in September 2024.\n\nThis past year Jacob wrapped two highly anticipated projects “Regarding Us”, Nicole Kidman’s new film “Holland Michigan” and \"Brooklyn, Minnesota\".\n\nJacob has had Guest Star roles in a variety of television shows including ABC’s “Wonder Years,” NBC’s “New Amsterdam” and Netflix’s Emmy-award winning “Christmas on the Square” with Dolly Parton. Jacob is credited with over 300 performances of the First National Broadway show \"The School of Rock.\" Jacob resides in Atlanta, Georgia, and is a proud member of the Screen Actors Guild (SAG-AFTRA) and Actors' Equity Association (AEA).",
        "birthday": "2007-06-02",
        "deathday": null,
        "gender": 2,
        "homepage": "http://jacobmoran.com",
        "id": 3053616,
        "imdb_id": "nm10664816",
        "known_for_department": "Acting",
        "name": "Jacob Moran",
        "place_of_birth": "Atlanta, Georgia, USA",
        "popularity": 0.3488,
        "profile_path": "/aAW9HPs8niroGTyupF8zlhBZr7S.jpg"
    }
}