{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ngh5pnvXPceZYdeKZqO4OYS9VHF.jpg",
                "genre_ids": [
                    80,
                    18,
                    53
                ],
                "id": 3112,
                "original_language": "en",
                "original_title": "The Night of the Hunter",
                "overview": "In Depression-era West Virginia, a serial-killing preacher hunts two young children who know the whereabouts of a stash of money.",
                "popularity": 4.7194,
                "poster_path": "/rBka0nFWiHxabHRLr0KfIA8Yiaq.jpg",
                "release_date": "1955-07-27",
                "title": "The Night of the Hunter",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 1702,
                "character": "Walt Spoon",
                "credit_id": "52fe4387c3a36847f805b317",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/nCl5KzxUs4rVVlAdixDf4r5AbbZ.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 887,
                "original_language": "en",
                "original_title": "The Best Years of Our Lives",
                "overview": "It's the hope that sustains the spirit of every GI: the dream of the day when he will finally return home. For three WWII veterans, the day has arrived. But for each man, the dream is about to become a nightmare.",
                "popularity": 5.3127,
                "poster_path": "/gd5EoAU4MM57sW3vlWxJ0NMM8cV.jpg",
                "release_date": "1946-12-25",
                "title": "The Best Years of Our Lives",
                "video": false,
                "vote_average": 7.79,
                "vote_count": 694,
                "character": "Mr. Cameron",
                "credit_id": "5c1e679492514167efbf442d",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Donald Beddoe",
            "Donald Theophilus Beddoe",
            "Donald T. Beddoe"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nDonald T. Beddoe (July 1, 1903 – January 19, 1991) was an American character actor.  Born in Pittsburgh, Pennsylvania, Beddoe was the son of Dan Beddoe, a Welsh classical singer, and his wife Mary. He graduated from the University of Cincinnati with bachelor's and master's degrees and taught English for three years.\n\nAfter a decade of stage work and bit parts in films, Beddoe began more prominent film roles in the late 1930s. He was usually cast as fast-talking reporters and the like. His commercial acting career was put on hold when he served in World War II in the United States Army Air Corps, in which he performed in the Air Force play, Winged Victory.\n\nBeddoe subsequently returned to films playing small character roles. He occasionally appeared in comedy shorts playing comic foils, such as in the Three Stooges shorts Three Sappy People and You Nazty Spy!\n\nBeddoe appeared in more than 250 films.\n\nBeddoe portrayed Mr. Tolliver in the ABC comedy The Second Hundred Years, and he was in the cast of Life with Father on CBS. He also was seen in dozens of television programs. In the 1950s and 1960s, he made four appearances on Have Gun – Will Travel, three times on Lawman, three on Maverick, three on Laramie, three on Lassie, and three on Perry Mason including in the 1958 episode 'The Case of the Buried Clock'. He was also cast on the western aviation series, Sky King, with Kirby Grant, on the ABC/Warner Brothers series, The Alaskans, with Roger Moore, on the ABC adventure series, Straightaway, with Brian Kelly and John Ashley, and on the NBC western series, The Tall Man, with Barry Sullivan and Clu Gulager. He appeared too on the CBS sitcom, Pete and Gladys, with Harry Morgan and Cara Williams, and on the ABC drama series, Going My Way, with Gene Kelly. He guest starred as well on David Janssen's first series, the crime drama, Richard Diamond, Private Detective. He also made appearances on episodes of The Lone Ranger in the '50s.\n\nBeddoe played the outlaw Black Bart in the 1954 episode \"Black Bart The PO8\" of the western anthology series Death Valley Days, hosted by Stanley Andrews. In the story line, Black Bart is cast as a debonair poetry-writing former school teacher who turns to stagecoach robbery after his first holdup, a prank, pays handsomely. Wells Fargo detectives track him down through a laundry mark. He was also pursued with a romantic interest by his landlady, Winona Webb (Helen Brown). Black Bart spent six years in the penitentiary, never to be heard from again.\n\nDuring the 1970–1971 season of ABC's Nanny and the Professor, Beddoe made four appearances, three as Mr. Thatcher. In 1984, he made his final television appearance as Kris in NBC's Highway to Heaven starring Michael Landon and Victor French.",
        "birthday": "1903-07-01",
        "deathday": "1991-01-19",
        "gender": 2,
        "homepage": null,
        "id": 30539,
        "imdb_id": "nm0065975",
        "known_for_department": "Acting",
        "name": "Don Beddoe",
        "place_of_birth": "Pittsburgh, Pennsylvania, USA",
        "popularity": 0.2835,
        "profile_path": "/9NI9ofN3DlPCuhLhCdTiWYg8C0L.jpg"
    }
}