{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/h0jlcOISKcrVG4IE4p5IyZGrMhn.jpg",
                "genre_ids": [
                    35,
                    80
                ],
                "id": 212,
                "original_language": "en",
                "original_title": "Arsenic and Old Lace",
                "overview": "Mortimer Brewster, a newspaper drama critic, playwright, and author known for his diatribes against marriage, suddenly falls in love and gets married;  but when he makes a quick trip home to tell his two maiden aunts, he finds out his aunts' hobby - killing lonely old men and burying them in the cellar!",
                "popularity": 1.5227,
                "poster_path": "/xG1GEEQGgExKl0WT5sRo1Arst5D.jpg",
                "release_date": "1944-09-01",
                "title": "Arsenic and Old Lace",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 985,
                "character": "Lt. Rooney",
                "credit_id": "52fe4227c3a36847f8008137",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/ngh5pnvXPceZYdeKZqO4OYS9VHF.jpg",
                "genre_ids": [
                    80,
                    18,
                    53
                ],
                "id": 3112,
                "original_language": "en",
                "original_title": "The Night of the Hunter",
                "overview": "In Depression-era West Virginia, a serial-killing preacher hunts two young children who know the whereabouts of a stash of money.",
                "popularity": 4.7194,
                "poster_path": "/rBka0nFWiHxabHRLr0KfIA8Yiaq.jpg",
                "release_date": "1955-07-27",
                "title": "The Night of the Hunter",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 1702,
                "character": "Uncle Birdie Steptoe",
                "credit_id": "52fe4387c3a36847f805b30b",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "James Austin Gleason",
            "Jimmy Gleason"
        ],
        "biography": "James Gleason was born in New York City to William Gleason and Mina Crolius, who were both in the theatre. He was married to Lucile Gleason (born Lucile Webster), and had a son, Russell Gleason.  As a young man James fought in the Spanish-American War. After the war  he joined the stock company at the Liberty Theater in Oakland,  California, which his parents were running. James and his wife then  moved to Portland, Oregon, where they played in stock at the Baker  Theater. For several years afterward they toured in road shows until  James enlisted in the army during World War I. When he returned he  appeared on the stage in \"The Five Million.\" He then turned to writing,  including \"Is Zat So\", which he produced for the NY stage. He also wrote  and acted in \"The Fall Guy\" and \"The Shannons on Broadway.\" Next he  wrote The Broadway Melody (1929) for MGM. He collaborated, in 1930, on The Swellhead (1930), Dumbbells in Ermine (1930), What a Widow! (1930), Rain or Shine (1930) and His First Command  (1929). He and his wife were then contracted to Pathe, Lucille to act,  and James (or Jimmie as he was known) as a writer. Probably his most  famous acting role was as Max Corkle, the manager of Joe Pendleton who  was wrongly plucked from this life into the next, in the hit fantasy Here Comes Mr. Jordan (1941).",
        "birthday": "1882-05-23",
        "deathday": "1959-04-12",
        "gender": 2,
        "homepage": null,
        "id": 30537,
        "imdb_id": "nm0322299",
        "known_for_department": "Acting",
        "name": "James Gleason",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.6983,
        "profile_path": "/nIWAiRVuVbEfD8iSWymhOSJlWUm.jpg"
    }
}