{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fik1HN9kxpD4CtEOXA4WUruwsg1.jpg",
                "genre_ids": [
                    37
                ],
                "id": 3114,
                "original_language": "en",
                "original_title": "The Searchers",
                "overview": "As a Civil War veteran spends years searching for a young niece captured by Indians, his motivation becomes increasingly questionable.",
                "popularity": 2.951,
                "poster_path": "/jLBmgW0epNzJ1N9uzaVCjbyT94v.jpg",
                "release_date": "1956-05-16",
                "title": "The Searchers",
                "video": false,
                "vote_average": 7.703,
                "vote_count": 1494,
                "character": "Lucy Edwards",
                "credit_id": "52fe4388c3a36847f805b42f",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Philippa Scott (November 10, 1935 — May 22, 2025) was an American actress who has appeared in film and television since the 1950s.\n\nScott was born in Los Angeles, California. She is the daughter of actress Laura Straub and screenwriter Allan Scott; an uncle was the blacklisted screenwriter Adrian Scott. Scott married Lee Rich, a founding partner of Lorimar Productions, in 1964. They had two children together before they divorced in 1983, though they maintained a friendship until he died in 2012.\n\nIn the 1970s, along with steady work acting in television productions, Scott was a student at California State Polytechnic University, Pomona, where she pursued a degree in landscape architecture.\n\nBy the 1990s, Scott had become active in human rights work, such as supporting the Commission of Experts formed under United Nations Security Council Resolution 780 in its research of the \"widespread violations of international humanitarian law\" committed during the Bosnian genocide.",
        "birthday": "1935-11-10",
        "deathday": "2025-05-22",
        "gender": 1,
        "homepage": null,
        "id": 30559,
        "imdb_id": "nm0779673",
        "known_for_department": "Acting",
        "name": "Pippa Scott",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.3445,
        "profile_path": "/8aY7FTHBHjxiS9m0caOTuQrJxkq.jpg"
    }
}