{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/pRSTtNlcADoQkfeBGtFQNE1FDpb.jpg",
                "genre_ids": [
                    28,
                    53,
                    878
                ],
                "id": 5548,
                "original_language": "en",
                "original_title": "RoboCop",
                "overview": "In a violent, near-apocalyptic Detroit, evil corporation Omni Consumer Products wins a contract from the city government to privatize the police force. To test their crime-eradicating cyborgs, the company leads street cop Alex Murphy into an armed confrontation with crime lord Boddicker so they can use his body to support their untested RoboCop prototype. But when RoboCop learns of the company's nefarious plans, he turns on his masters.",
                "popularity": 5.3642,
                "poster_path": "/esmAU0fCO28FbS6bUBKLAzJrohZ.jpg",
                "release_date": "1987-07-17",
                "title": "RoboCop",
                "video": false,
                "vote_average": 7.347,
                "vote_count": 5425,
                "character": "Sgt. Warren Reed",
                "credit_id": "52fe440dc3a36847f807f6d9",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/j44XhCxpLTi8WnrX52H83Z86ovG.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 695,
                "original_language": "en",
                "original_title": "Short Cuts",
                "overview": "Many loosely connected characters cross paths in this film, based on the stories of Raymond Carver. Waitress Doreen Piggot accidentally runs into a boy with her car. Soon after walking away, the child lapses into a coma. While at the hospital, the boy's grandfather tells his son, Howard, about his past affairs. Meanwhile, a baker starts harassing the family when they fail to pick up the boy's birthday cake.",
                "popularity": 7.5661,
                "poster_path": "/mbNTvbtWfV4soyErimDTdX67OAr.jpg",
                "release_date": "1993-10-01",
                "title": "Short Cuts",
                "video": false,
                "vote_average": 7.216,
                "vote_count": 637,
                "character": "Knute Willis",
                "credit_id": "608b65b438520200573743b9",
                "order": 33
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Robert Do'Qui"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nRobert DoQui (April 20, 1934 – February 9, 2008) was an American actor who starred in film and on television. He is best known for his role as King George in the 1973 film, Coffy, starring Pam Grier, as Sgt. Warren Reed in the 1987 science fiction film RoboCop, the 1990 sequel RoboCop 2, and the 1993 sequel RoboCop 3. Robert starred on television and is also known for his voice as Pablo Roberts on Harlem Globetrotters cartoon from 1970-1973. He was born in Stillwater, Oklahoma.\n\nHe starred in the miniseries Centennial in 1978, and The Court-Martial of Jackie Robinson TV movie in 1990. Robert made guest appearances on many TV shows, including I Dream of Jeannie, \"The Jeffersons,\" Daniel Boone, Gunsmoke, Adam-12, The Parkers, and Star Trek: Deep Space Nine in the season 4 episode \"Sons of Mogh\" as a Klingon named Noggra. He died February 9, 2008 at the age of 73. He was buried at Inglewood Park Cemetery in Los Angeles, California.\n\nDescription above from the Wikipedia article Robert DoQui, licensed under CC-BY-SA, full list of contributors on Wikipedia​",
        "birthday": "1934-04-20",
        "deathday": "2008-02-09",
        "gender": 2,
        "homepage": null,
        "id": 30615,
        "imdb_id": "nm0233306",
        "known_for_department": "Acting",
        "name": "Robert DoQui",
        "place_of_birth": "Stillwater, Oklahoma, USA",
        "popularity": 0.3902,
        "profile_path": "/uLQsWehFSYRn2LNfzT9fUjSRpkF.jpg"
    }
}