{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7Mnj6if9FUC7yTZaeAgoDNQnnwn.jpg",
                "genre_ids": [
                    18,
                    10752
                ],
                "id": 19067,
                "original_language": "en",
                "original_title": "The Duellists",
                "overview": "In 1800, as Napoleon Bonaparte rises to power in France, a rivalry erupts between Armand and Gabriel, two lieutenants in the French Army, over a perceived insult. For over a decade, they engage in a series of duels amidst larger conflicts, including the failed French invasion of Russia in 1812, and shifts in the political and social systems of Europe.",
                "popularity": 3.4843,
                "poster_path": "/s9sPhcfD4LtrIGwix11bKtl9VLR.jpg",
                "release_date": "1977-08-31",
                "title": "The Duellists",
                "video": false,
                "vote_average": 7.256,
                "vote_count": 584,
                "character": "Armand d'Hubert",
                "credit_id": "52fe47b79251416c750a323d",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Keith Ian Carradine",
            "کیت کارادین"
        ],
        "biography": "Keith Ian Carradine (born August 8, 1949) is an American actor and singer-songwriter. In film he is known for his roles as Tom Frank in Robert Altman's Nashville, E. J. Bellocq in Louis Malle's Pretty Baby, and Mickey in Alan Rudolph's Choose Me. On television he is known for his roles as Wild Bill Hickok on the HBO series Deadwood, FBI agent Frank Lundy on the Showtime series Dexter, Lou Solverson in the first season of FX's Fargo, Penny's father Wyatt on the CBS sitcom The Big Bang Theory, and U.S. President Conrad Dalton on the CBS political drama Madam Secretary.  He is a member of the Carradine family of actors, including father John Carradine, brothers Robert and David Carradine, and daughter Martha Plimpton.",
        "birthday": "1949-08-08",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 30613,
        "imdb_id": "nm0001018",
        "known_for_department": "Acting",
        "name": "Keith Carradine",
        "place_of_birth": "San Mateo, California, USA",
        "popularity": 2.6321,
        "profile_path": "/5gayZWGqjTAVJXr1bXovk3oqOxW.jpg"
    }
}