{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yfQXs8yXplCVXTLi9mxgvRf4ymE.jpg",
                "genre_ids": [
                    18,
                    878,
                    12,
                    28
                ],
                "id": 695721,
                "original_language": "en",
                "original_title": "The Hunger Games: The Ballad of Songbirds & Snakes",
                "overview": "64 years before he becomes the tyrannical president of Panem, Coriolanus Snow sees a chance for a change in fortunes when he mentors Lucy Gray Baird, the female tribute from District 12.",
                "popularity": 8.2175,
                "poster_path": "/lrkOYL5GBTFW9cgs9RlojxAcZZF.jpg",
                "release_date": "2023-11-15",
                "title": "The Hunger Games: The Ballad of Songbirds & Snakes",
                "video": false,
                "vote_average": 6.995,
                "vote_count": 3214,
                "character": "Tanner",
                "credit_id": "62c5d8c458361b00555a729e",
                "order": 46
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "The German actor Kjell Brutscheidt was born on 23rd April 1996, in Dusseldorf, North Rhine-Westphalia, and is known for his performances in “Spreewaldkrimi”, “The Hunger Games: The Ballad of Songbirds and Snakes”, and “Ich bin Sophie Scholl”.\n\nThe thespian perfected his craft at the August Everding Theater Academy in Munich, and appeared in a number of stage productions in Berlin and Munich, performing at prestigious venues such as the Opernhaus Zurich and Schauspielhaus Düsseldorf.\n\nIn the 2019/20 season, Kjell was part of the Theater Bielefeld’s first interdisciplinary studio. The following year, the actor debuted in front of cameras with two projects: “Spreewaldkrimi” and the popular Instagram series “I am Sophie Scholl”.\n\n2022 saw Kjell explore a variety of genres, from crime shows (“Police Call 110”, “Zeit der Abrechnung”) to historical movies (“Der junge Hauptling Winnetou”). The German also guest-starred in episodes of “In aller Freundschaft”, “Sarah Kohr”, and “Morden im Norden”.\n\nIn 2022, he landed his biggest role to date with his casting as Tanner in “The Hunger Games: A Ballad of Songbirds and Snakes”, which is the fifth movie in the “Hunger Games” franchise, but serves as the prequel. The dystopian action movie, which was filmed with an extravagant $100 million budget, has a November 2023 theatrical release date in the US, and is on track to earn $50 million in its opening weekend.\n\nAlthough Kjell has less than two thousand Instagram followers at the time of writing, this is likely to change when “A Ballad of Songbirds and Snakes” premieres in cinemas. The actor is known to engage with his fans by replying to their comments, and enjoys sharing glimpses of his day-to-day life, be it a night out with friends or an important industry event.\n\nKjell’s distinctive physical appearance has been a topic of discussion recently, as the “Ballad of Songbirds and Snakes” cast attended the world premiere of the movie in early November 2023. The actor appears to have some sort of eye condition, as he is unable to open his left eye; however, he’s never discussed the subject in interviews or via social media, but may well share the story behind his eye in the future.\n\nFor now, Kjell’s net worth is approximately $250,000. His height is listed as 5ft 8in (172cm).",
        "birthday": "1996-04-23",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 3062060,
        "imdb_id": "nm12166442",
        "known_for_department": "Acting",
        "name": "Kjell Brutscheidt",
        "place_of_birth": "Düsseldorf, Germany",
        "popularity": 0.4288,
        "profile_path": "/hQb25SOwFECyLjXhZ8Kz02xaRBw.jpg"
    }
}