{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mGBmiWmi7JqeTWnrPicRbkXcsuO.jpg",
                "genre_ids": [
                    99
                ],
                "id": 410718,
                "original_language": "en",
                "original_title": "Before the Flood",
                "overview": "A look at how climate change affects our environment and what society can do to prevent the demise of endangered species, ecosystems, and native communities across the planet.",
                "popularity": 1.0583,
                "poster_path": "/u0EfH2zsp6rLOvEKVvWGgzGRQn3.jpg",
                "release_date": "2016-10-21",
                "title": "Before the Flood",
                "video": false,
                "vote_average": 7.687,
                "vote_count": 798,
                "character": "Self (archive footage)",
                "credit_id": "64d2e135bf31f201ca89aea5",
                "order": 39
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Mary Loretta Landrieu (born November 23, 1955) is an American entrepreneur and politician who served as a United States senator from Louisiana from 1997 to 2015. A member of the Democratic Party, Landrieu served as the Louisiana State Treasurer from 1988 to 1996, and in the Louisiana House of Representatives from 1980 to 1988.\n\nBorn in Arlington, Virginia, Landrieu was raised in New Orleans, Louisiana. She is the daughter of Moon Landrieu, former New Orleans mayor and secretary of the United States Department of Housing and Urban Development, and the sister of Mitch Landrieu, a former mayor of New Orleans and Lieutenant Governor of Louisiana. She received her baccalaureate degree from Louisiana State University in Baton Rouge. She won a close race for the U.S. Senate in 1996; she was re-elected by increasing margins in competitive races in 2002 and 2008, but was defeated in 2014 by U.S. Representative Bill Cassidy.\n\nLandrieu came to national attention in the wake of Hurricane Katrina in 2005 after she publicly criticized the federal response to the natural disaster. Her opposition to the public option played a major role in the crafting of the 2010 Patient Protection and Affordable Care Act, as she did not agree to support it until additional concessions were granted to support Louisiana's Medicaid system. In 2011, she became a cardinal (chair) of the Senate's Homeland Security Appropriations Subcommittee. She chaired the Senate Committee on Small Business and Entrepreneurship from 2009 to 2014, and chaired the Senate Committee on Energy and Natural Resources from 2014 to 2015.",
        "birthday": "1955-11-23",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 3063360,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Mary Landrieu",
        "place_of_birth": "Arlington, Virginia, USA",
        "popularity": 0.2152,
        "profile_path": "/18pgcnRYTPidEwYqgdCFSP2oYnp.jpg"
    }
}