{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/pgtHrfRnVpOWbiGYFVoHM3E9rN.jpg",
                "genre_ids": [
                    35
                ],
                "id": 11686,
                "original_language": "en",
                "original_title": "Love and Death",
                "overview": "In czarist Russia, a neurotic soldier and his distant cousin formulate a plot to assassinate Napoleon.",
                "popularity": 2.6098,
                "poster_path": "/oJXFd1UHZoOQ1UtoLxbyBLGJDox.jpg",
                "release_date": "1975-06-10",
                "title": "Love and Death",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 927,
                "character": "Soldier 2",
                "credit_id": "538cdc07c3a368713f0032aa",
                "order": 25
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia.\n\nSandor Elès (sometimes credited as Sandor Eles, without the grave accent; born Hungarian: Éles Sándor; 15 June 1936 - 1 September 2002) was a Hungarian-born actor.\n\nBorn at Budapest, Elès was orphaned during World War II , and emigrated to the United Kingdom during the Hungarian Revolution of 1956 against the former USSR. He began his acting career on stage, and went on to appear in a host of television roles. These included the ITC series Danger Man, The Baron, The Saint, and Jason King. He also made appearances in The Avengers and The Professionals. Often cast in generic 'foreigner' roles (diplomats, waiters, desk clerks), he most often played Frenchmen.\n\nOne of his most memorable film roles was as the mysterious Paul in the Brian Clemens thriller And Soon the Darkness. He also had major roles in the Hammer Horror movies Countess Dracula (1971) and The Evil of Frankenstein (1964) as well as appearing for four years in the 1980s as the scheming restaurant manager, Paul Ross, in the UK soap opera Crossroads.\n\nIn 1996 Sandor Elès returned to his cultural roots, appearing as the narrator in the Bartók opera, Bluebeard's Castle. The concert performances, given by the Berlin Philharmonic Orchestra under Bernard Haitink, were recorded for CD.\n\nDescription above from the Wikipedia article Sandor Elès, licensed under CC-BY-SA, full list of contributors on Wikipedia.​",
        "birthday": "1936-06-15",
        "deathday": "2002-09-04",
        "gender": 2,
        "homepage": null,
        "id": 30672,
        "imdb_id": "nm0255973",
        "known_for_department": "Acting",
        "name": "Sandor Elès",
        "place_of_birth": "Budapest, Hungary",
        "popularity": 0.0825,
        "profile_path": "/e91FV6tVxhK6hajgg6MWCgOKKtE.jpg"
    }
}