{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/nKwGUiqPdNf47XFjlbR5IFwAaOL.jpg",
                "genre_ids": [
                    12,
                    36,
                    10752
                ],
                "id": 947,
                "original_language": "en",
                "original_title": "Lawrence of Arabia",
                "overview": "The story of British officer T.E. Lawrence's mission to aid the Arab tribes in their revolt against the Ottoman Empire during the First World War. Lawrence becomes a flamboyant, messianic figure in the cause of Arab unity but his psychological instability threatens to undermine his achievements.",
                "popularity": 6.3976,
                "poster_path": "/AiAm0EtDvyGqNpVoieRw4u65vD1.jpg",
                "release_date": "1962-12-11",
                "title": "Lawrence of Arabia",
                "video": false,
                "vote_average": 7.994,
                "vote_count": 3214,
                "character": "Sheik in Arab Council (uncredited)",
                "credit_id": "57150be992514147660008c2",
                "order": 32
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Джеймс Хэйтер",
            "Henry James Hayter"
        ],
        "biography": "James Hayter (23 April 1907 – 27 March 1983) was a British actor.\n\nHe was born in Lonavala, India, brought up in Scotland and died in Spain. His best remembered film  roles include Friar Tuck in the 1952 film The Story of Robin Hood and His Merrie Men and Samuel  Pickwick in The Pickwick Papers of the same year. His rotund appearance and fruity voice made him  a natural choice for such roles.\n\nA pupil of Dollar Academy, he became a graduate of the Royal Academy of Dramatic Art, his film  career began in 1936 in Sensation, but was interrupted by World War II during which he served in  the Royal Armoured Corps. His later career included roles in TV series such as The Forsyte Saga  (1967), The Onedin Line and Are You Being Served?. His 1946 television series Pinwright's  Progress, shown on the BBC, is recognised as the first real example of the half-hour situation  comedy format in the history of British television. He was also the original narrator of the UK  television advertisements for Mr. Kipling cakes. In fact, these ads led to his departure from Are  You Being Served?; the cake company paid him a significant bonus to withdraw from the series, as  they felt his reputation lent an air of dignity to their snack advertisements.\n\nIn the film Oliver!, he played Mr Jessop the book shop owner. He appeared in scenes when Dodger  steals a gentleman's wallet outside the book shop and also when Oliver is in court charged with  the robbery.\n\nHayter used to have a tree house in his back garden where he would retire of an evening to learn  and practise his lines from his current script.\n\nDescription above from the Wikipedia article James Hayter, licensed under CC-BY-SA, full list of  contributors on Wikipedia.",
        "birthday": "1907-04-23",
        "deathday": "1983-03-27",
        "gender": 2,
        "homepage": null,
        "id": 30769,
        "imdb_id": "nm0371687",
        "known_for_department": "Acting",
        "name": "James Hayter",
        "place_of_birth": "Lonavala, India",
        "popularity": 0.275,
        "profile_path": "/oyWVJYiOinNqg2L6it8aYstWYan.jpg"
    }
}