{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jXPrGgk6PypAsv8IPq8NqlQi6ts.jpg",
                "genre_ids": [
                    35,
                    80,
                    10749
                ],
                "id": 3001,
                "original_language": "en",
                "original_title": "How to Steal a Million",
                "overview": "A woman must steal a statue from a Paris museum to help conceal her father's art forgeries.",
                "popularity": 5.0699,
                "poster_path": "/xaf3pwmITJvfz9Ab8DiGM8OOtBC.jpg",
                "release_date": "1966-07-13",
                "title": "How to Steal a Million",
                "video": false,
                "vote_average": 7.489,
                "vote_count": 623,
                "character": "Grammont",
                "credit_id": "52fe437bc3a36847f80575b5",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Fernand Mertens",
            "Fernand Gravet",
            "Фернан Граве"
        ],
        "biography": "Fernand Gravey (25 December 1905 in Ixelles (Belgium) – 2 November 1970 in Paris, France), also known as Fernand Gravet in the United States, was the son of actors Georges Mertens and Fernande Depernay, who appeared in silent films produced by pioneer Belge Cinéma Film (a subsidiary of Pathé).\n\nGravey started performing at age five under his father's direction.\n\nBefore World War I, he received an education in Britain and could speak both French and English fluently, something which became useful in his movie roles. During the war, Gravey served in the British Merchant Marine Corp.\n\nIn 1936, he married the French actress Jane Renouardt, who was 15 years his senior. They remained together until his death on 2 November 1970 of a heart-attack. Jane died on 3 February 1972. They had no children.\n\nGravey performed in four films in 1913 and 1914 (as Fernand Mertens), but his first film of importance was L'Amour Chante, released in 1930. In 1933, he made Bitter Sweet, his first English language movie, which became more famous in its 1940 incarnation with Jeanette MacDonald and Nelson Eddy.\n\nIn 1937, after several more French and British movies, Gravey went to Hollywood, where the spelling of his last name was altered to Gravet, and he became the focus of a rather extensive Hollywood publicity campaign (instructing moviegoers to pronounce his name properly: \"Rhymes with Gravy\"). Unfortunately for Gravey, he was offered only standard parts, the type of Gallic-lover roles that Louis Jourdan played in the 1950s and 1960s.\n\nThe first two films he made in Hollywood were for Warner Brothers: The King and the Chorus Girl (1937), with Joan Blondell and Jane Wyman, and Fools for Scandal (1938), with Carole Lombard and Ralph Bellamy. Gravey then signed with Metro-Goldwyn-Mayer and was cast as Johann Strauss in the expensive biopic The Great Waltz, with Luise Rainer and Miliza Korjus.\n\nMGM next planned to star Gravey in a film version of Rafael Sabatini's adventure novel Scaramouche, but instead he returned to France just before the Nazi occupation began. Although he had agreed to appear in German-approved French films, Gravey was an underminer of the invaders as a member of the French Secret Army and the Foreign Legion.\n\nAt the end of the war, Gravey was considered a war hero, and continued to be featured in French productions such as La Ronde (with Danielle Darrieux), and Royal Affairs in Versailles (1954). Among his last English language performances were How to Steal a Million (1966), Guns for San Sebastian (1968) and The Madwoman of Chaillot (1969), in which he played the police inspector.\n\nSource: Article \"Fernand Gravey\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1905-12-25",
        "deathday": "1970-11-02",
        "gender": 2,
        "homepage": null,
        "id": 30774,
        "imdb_id": "nm0336380",
        "known_for_department": "Acting",
        "name": "Fernand Gravey",
        "place_of_birth": "Ixelles, Brabant, Belgium",
        "popularity": 0.0757,
        "profile_path": "/syRup0owikYUuRnUVc0WKwHnn9b.jpg"
    }
}