{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rQEhJmR9SJ2yJUKjD8RDTagVBHy.jpg",
                "genre_ids": [
                    18,
                    10749,
                    35
                ],
                "id": 37247,
                "original_language": "en",
                "original_title": "The Graduate",
                "overview": "A disillusioned college graduate finds himself torn between his older lover and her daughter.",
                "popularity": 8.841,
                "poster_path": "/z1Z1tZMR66RxcNeHbwoEhYeqOlP.jpg",
                "release_date": "1967-12-21",
                "title": "The Graduate",
                "video": false,
                "vote_average": 7.634,
                "vote_count": 3504,
                "character": "College Student (uncredited)",
                "credit_id": "630263e5839d93007b630f47",
                "order": 22
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Donald Glut",
            "Don Glut",
            "Dinosaur Don Glut"
        ],
        "biography": "Donald F. Glut has been active in both the entertainment and publishing industries since 1966, and has had a long and varied career. He has been a professional musician, actor, film director, executive producer, photographer, magazine editor, proofreader and copywriter, but is mostly known for his long career as a freelance writer. He has written and directed feature-length motion pictures, documentaries and music videos, authored approximately 80 fiction and non-fiction published books, TV scripts (live action and animation shows, network and syndicated), comic-book scripts, short stories, magazine articles, even music and theatre. He has been involved with numerous popular franchises such as Star Wars, The Monkees, Tarzan, Spider-Man, Transformers, G.I. Joe, Vampirella, Masters of the Universe, The Flintstones, Jonny Quest and many others, and created original comic-book characters for Gold Key, Marvel and DC. He is arguably best known for his novelization of the second \"Star Wars\" movie, The Empire Strikes Back.",
        "birthday": "1944-02-19",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.donaldfglut.com/",
        "id": 30810,
        "imdb_id": "nm0323304",
        "known_for_department": "Directing",
        "name": "Donald F. Glut",
        "place_of_birth": "Pecos, Texas, USA",
        "popularity": 0.0812,
        "profile_path": "/vB9aarmCk3ShjfjeyR1BxpIbpvR.jpg"
    }
}