{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9Qs9oyn4iE8QtQjGZ0Hp2WyYNXT.jpg",
                "genre_ids": [
                    18,
                    10752
                ],
                "id": 28,
                "original_language": "en",
                "original_title": "Apocalypse Now",
                "overview": "At the height of the Vietnam war, Captain Benjamin Willard is sent on a dangerous mission that, officially, \"does not exist, nor will it ever exist.\" His goal is to locate - and eliminate - a mysterious Green Beret Colonel named Walter Kurtz, who has been leading his personal army on illegal guerrilla missions into enemy territory.",
                "popularity": 8.7178,
                "poster_path": "/gQB8Y5RCMkv2zwzFHbUJX3kAhvA.jpg",
                "release_date": "1979-05-19",
                "title": "Apocalypse Now",
                "video": false,
                "vote_average": 8.271,
                "vote_count": 8641,
                "character": "Colonel Walter Kurtz",
                "credit_id": "52fe4210c3a36847f800135f",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/pxkQAIhC7LXN5s5B23lnvCMgva5.jpg",
                "genre_ids": [
                    80,
                    18,
                    10749
                ],
                "id": 654,
                "original_language": "en",
                "original_title": "On the Waterfront",
                "overview": "A prizefighter-turned-longshoreman with a conscience goes up against labor leaders to expose corruption, extortion, and murder among the union ranks.",
                "popularity": 5.1767,
                "poster_path": "/fKjLZy9W8VxMOp5OoyWojmLVCQw.jpg",
                "release_date": "1954-06-22",
                "title": "On the Waterfront",
                "video": false,
                "vote_average": 7.882,
                "vote_count": 1669,
                "character": "Terry Malloy",
                "credit_id": "52fe4265c3a36847f801b1df",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/or90vNrOVnYwi07fYYpQ3pbnjxP.jpg",
                "genre_ids": [
                    18,
                    53
                ],
                "id": 702,
                "original_language": "en",
                "original_title": "A Streetcar Named Desire",
                "overview": "A disturbed, aging Southern belle moves in with her sister for solace — but being face-to-face with her brutish brother-in-law accelerates her downward spiral.",
                "popularity": 3.2027,
                "poster_path": "/aicdlO5vt7z2ARm279eGzJeYCLQ.jpg",
                "release_date": "1951-09-19",
                "title": "A Streetcar Named Desire",
                "video": false,
                "vote_average": 7.617,
                "vote_count": 1411,
                "character": "Stanley Kowalski",
                "credit_id": "52fe426dc3a36847f801db0b",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/hExTiLbfB93HwEwkeQxb3q4nHtQ.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 1643,
                "original_language": "it",
                "original_title": "Ultimo tango a Parigi",
                "overview": "A recently widowed American begins an anonymous sexual relationship with a young Parisian woman.",
                "popularity": 4.1786,
                "poster_path": "/dNgdUdNOWfHsZI3lDu6Epig7H2P.jpg",
                "release_date": "1972-12-15",
                "title": "Last Tango in Paris",
                "video": false,
                "vote_average": 6.933,
                "vote_count": 1283,
                "character": "Paul",
                "credit_id": "52fe4307c3a36847f803526f",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/5PfHGXosySGs0l1JfeREspy3v6G.jpg",
                "genre_ids": [
                    878,
                    28,
                    12
                ],
                "id": 1924,
                "original_language": "en",
                "original_title": "Superman",
                "overview": "Mild-mannered Clark Kent works as a reporter at the Daily Planet alongside his crush, Lois Lane. Clark must summon his superhero alter-ego when the nefarious Lex Luthor launches a plan to take over the world.",
                "popularity": 10.0533,
                "poster_path": "/d7px1FQxW4tngdACVRsCSaZq0Xl.jpg",
                "release_date": "1978-12-14",
                "title": "Superman",
                "video": false,
                "vote_average": 7.155,
                "vote_count": 4063,
                "character": "Jor-El",
                "credit_id": "52fe4322c3a36847f803ce03",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/tmU7GeKVybMWFButWEGl2M4GeiP.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 238,
                "original_language": "en",
                "original_title": "The Godfather",
                "overview": "Spanning the years 1945 to 1955, a chronicle of the fictional Italian-American Corleone crime family. When organized crime family patriarch, Vito Corleone barely survives an attempt on his life, his youngest son, Michael steps in to take care of the would-be killers, launching a campaign of bloody revenge.",
                "popularity": 29.4604,
                "poster_path": "/3bhkrj58Vtu7enYsRolD1fZdja1.jpg",
                "release_date": "1972-03-14",
                "title": "The Godfather",
                "video": false,
                "vote_average": 8.686,
                "vote_count": 21833,
                "character": "Don Vito Corleone",
                "credit_id": "6489aa85e2726001072483a9",
                "order": 0
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/1GZVHgJUcVyytQRJ533GpMavAcL.jpg",
                "genre_ids": [
                    18
                ],
                "id": 7984,
                "original_language": "en",
                "original_title": "In the Name of the Father",
                "overview": "A small-time Belfast thief, Gerry Conlon, is wrongly convicted of an IRA bombing in London, along with his father and friends, and spends 15 years in prison fighting to prove his innocence.",
                "popularity": 2.6913,
                "poster_path": "/3NcIkKxaO2SmRVsG1v50XhtmL0f.jpg",
                "release_date": "1993-12-12",
                "title": "In the Name of the Father",
                "video": false,
                "vote_average": 7.896,
                "vote_count": 1845,
                "credit_id": "5762dc22c3a36818c9000047",
                "department": "Crew",
                "job": "Thanks"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Marlon Brando Jr.",
            "Bud",
            "マーロン・ブランド",
            "말론 브란도",
            "มาร์ลอน แบรนโด",
            "مارلون براندو",
            "马龙·白兰度",
            "მარლონ ბრანდო",
            "Marlon Brando Junior",
            "Mar"
        ],
        "biography": "Marlon Brando Jr. was an American actor. Considered one of the most influential actors of the 20th century, he received numerous accolades throughout his career which spanned six decades, including two Academy Awards, two Golden Globe Awards, and three British Academy Film Awards. Brando was also an activist for many causes, notably the civil rights movement and various Native American movements. Having studied with Stella Adler in the 1940s, he is credited with being one of the first actors to bring the Stanislavski system of acting and method acting, derived from the Stanislavski system, to mainstream audiences.\n\nHe initially gained acclaim and his first Academy Award nomination for Best Actor in a Leading Role for reprising the role of Stanley Kowalski in the 1951 film adaptation of Tennessee Williams' play A Streetcar Named Desire, a role that he originated successfully on Broadway. He received further praise, and a first Academy Award and Golden Globe Award, for his performance as Terry Malloy in On the Waterfront, and his portrayal of the rebellious motorcycle gang leader Johnny Strabler in The Wild One proved to be a lasting image in popular culture. Brando received Academy Award nominations for playing Emiliano Zapata in Viva Zapata! (1952); Mark Antony in Joseph L. Mankiewicz's 1953 film adaptation of Shakespeare's Julius Caesar; and Air Force Major Lloyd Gruver in Sayonara (1957), an adaptation of James A. Michener's 1954 novel.\n\nThe 1960s saw Brando's career take a commercial and critical downturn. He directed and starred in the cult western One-Eyed Jacks, a critical and commercial flop, after which he delivered a series of notable box-office failures, beginning with Mutiny on the Bounty (1962). After ten years of underachieving, he agreed to do a screen test as Vito Corleone in Francis Ford Coppola's The Godfather (1972). He got the part and subsequently won his second Academy Award and Golden Globe Award in a performance critics consider among his greatest. He declined the Academy Award due to alleged mistreatment and misportrayal of Native Americans by Hollywood. The Godfather was one of the most commercially successful films of all time, and alongside his Oscar-nominated performance in Last Tango in Paris (1972), Brando reestablished himself in the ranks of top box-office stars.\n\nAfter a hiatus in the early 1970s, Brando was generally content with being a highly paid character actor in supporting roles, such as Jor-El in Superman (1978), as Colonel Kurtz in Apocalypse Now (1979), and Adam Steiffel in The Formula (1980), before taking a nine-year break from film. According to the Guinness Book of World Records, Brando was paid a record $3.7 million ($16 million in inflation-adjusted dollars) and 11.75% of the gross profits for 13 days' work on Superman.\n\nBrando was ranked by the American Film Institute as the fourth-greatest movie star among male movie stars whose screen debuts occurred in or before 1950. He was one of only six actors named in 1999 by Time magazine in its list of the 100 Most Important People of the Century. In this list, Time also designated Brando as the \"Actor of the Century\".",
        "birthday": "1924-04-03",
        "deathday": "2004-07-01",
        "gender": 2,
        "homepage": "http://www.marlonbrando.com",
        "id": 3084,
        "imdb_id": "nm0000008",
        "known_for_department": "Acting",
        "name": "Marlon Brando",
        "place_of_birth": "Omaha, Nebraska, USA",
        "popularity": 1.0871,
        "profile_path": "/vklkhX4QlRKnEG8ylhWzoBdcuev.jpg"
    }
}