{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2aC3284N1p86o6S4Uyj9AaryYeR.jpg",
                "genre_ids": [
                    37,
                    28,
                    12
                ],
                "id": 966,
                "original_language": "en",
                "original_title": "The Magnificent Seven",
                "overview": "An oppressed Mexican peasant village hires seven gunfighters to help defend their homes.",
                "popularity": 8.9842,
                "poster_path": "/e5ToxOyJwuZD4VOfI0qEn5uIjeJ.jpg",
                "release_date": "1960-10-12",
                "title": "The Magnificent Seven",
                "video": false,
                "vote_average": 7.509,
                "vote_count": 1875,
                "character": "Gunman at Boot Hill",
                "credit_id": "55e1d7d49251416c030029f2",
                "order": 25
            },
            {
                "adult": false,
                "backdrop_path": "/rhwGCD3AosYcPK7rTFHmL4NdrP1.jpg",
                "genre_ids": [
                    37
                ],
                "id": 6644,
                "original_language": "en",
                "original_title": "El Dorado",
                "overview": "Cole Thornton, a gunfighter for hire, joins forces with an old friend, Sheriff J.P. Harrah. Together with a fighter and a gambler, they help a rancher and his family fight a rival rancher that is trying to steal their water.",
                "popularity": 5.6015,
                "poster_path": "/poJxkMtTA3E95lJ6RnBgNxF0Vmx.jpg",
                "release_date": "1966-12-17",
                "title": "El Dorado",
                "video": false,
                "vote_average": 7.352,
                "vote_count": 555,
                "character": "Jim Purvis",
                "credit_id": "5ea4103adb72c00026bc5184",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "James Davis",
            "Marlin Davis"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nJim Davis (born Marlin Davis, August 26, 1909 – April 26, 1981) was an American actor, best known for his role as Jock Ewing in the CBS prime-time soap opera, Dallas, a role which continued until he was too ill from a terminal illness to perform.\n\nHe was known as Jim Davis by the time of his first major screen role, which was opposite Bette Davis in the 1948 melodrama Winter Meeting,[3] a lavish failure for which he was lambasted in the press as being too inexperienced to play the part properly. His subsequent film career consisted of mostly B movies, many of them westerns, although he made an impression as a U.S. senator in the Warren Beatty conspiracy thriller The Parallax View.\n\nDavis performed in numerous television series episodes in the 1950s-1970s. After years of relatively low-profile roles, Davis was cast as family patriarch Jock Ewing on Dallas, which debuted in 1978.\n\nDuring season four, he was diagnosed with multiple myeloma but continued to film the show as long as he could. In many scenes as the season progressed he was shown seated, and his voice became softer and more obviously affected by his illness. He wore a hairpiece to cover the hair he'd lost from chemotherapy. A season four storyline regarding the Takapa development and Jock's separation from Miss Ellie was ended abruptly at the end of season four. The writers depicted the couple suddenly leaving to go on an extended second honeymoon when it became obvious that Davis could no longer continue to work. Their departure in a limousine in the episode \"New Beginnings\" was Davis' only scene in that episode, and his condition was so poor that close watching reveals (based on his unsynchronized lip movement) that he overdubbed his one last line of dialogue. It was his final appearance on the show. He died of complications from his illness while season four was being aired.",
        "birthday": "1909-08-26",
        "deathday": "1981-04-26",
        "gender": 2,
        "homepage": null,
        "id": 30846,
        "imdb_id": "nm0204824",
        "known_for_department": "Acting",
        "name": "Jim Davis",
        "place_of_birth": "Edgerton, Platte County, Missouri, USA",
        "popularity": 0.6748,
        "profile_path": "/hyRy1u64pMK7nWTvHPtrBhTJ3iA.jpg"
    }
}