{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/aheSIG4h3JNxWeDvdb1NxKzgjaM.jpg",
                "genre_ids": [
                    36,
                    10752,
                    18,
                    12
                ],
                "id": 967,
                "original_language": "en",
                "original_title": "Spartacus",
                "overview": "The rebellious Thracian Spartacus, born and raised a slave, is sold to Gladiator trainer Batiatus. After weeks of being trained to kill for the arena, Spartacus turns on his owners and leads the other slaves in rebellion. As the rebels move from town to town, their numbers swell as escaped slaves join their ranks. Under the leadership of Spartacus, they make their way to southern Italy, where they will cross the sea and return to their homes.",
                "popularity": 6.2092,
                "poster_path": "/r0Fgg1GyZgzokaiw2HFQv3oPaL2.jpg",
                "release_date": "1960-10-13",
                "title": "Spartacus",
                "video": false,
                "vote_average": 7.54,
                "vote_count": 2262,
                "character": "Gladiator (uncredited)",
                "credit_id": "5601eb0792514122c7000446",
                "order": 25
            },
            {
                "adult": false,
                "backdrop_path": "/38uM6QuI06znUCELfOSiVQy05CX.jpg",
                "genre_ids": [
                    37
                ],
                "id": 301,
                "original_language": "en",
                "original_title": "Rio Bravo",
                "overview": "A small-town sheriff in the American West enlists the help of a disabled man, a drunk, and a young gunfighter in his efforts to hold in jail the brother of the local bad guy.",
                "popularity": 5.5199,
                "poster_path": "/4gI4KKmoi0d3yfsF71YU3S0I5t8.jpg",
                "release_date": "1959-03-18",
                "title": "Rio Bravo",
                "video": false,
                "vote_average": 7.813,
                "vote_count": 1204,
                "character": "Bar Cowboy Watching Fistfight (uncredited)",
                "credit_id": "570534f192514175f900038a",
                "order": 40
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Charles Allen Pendleton",
            "Charles Pendleton"
        ],
        "biography": "Gordon Mitchell was born \"Charles Pendleton\" in Colorado and served his country in both World War II and the Korean War (during which he was briefly a POW). Afterward he worked as a teacher in inner city schools in California and got heavily involved in personal fitness and bodybuilding. He became friends with Joe Gold (of Gold's Gym), joining Mae West's comedy act as one of her \"strongmen\" who would carry her on and off the stage. During this time he also found himself in demand as an extra in several Hollywood films including \"Lil Abner\", \"The Enemy Below\", and \"The Ten Commandments\" (in which he and Joe Gold bring Moses to Ramsey's court in chains).  When the Peplum craze began in Italy and his fellow Muscle Beach star Steve Reeves became a huge star. Gordon (along with Reg Park, Mark Forrest, Brad Harris, Mickey Hargitay, and Richard Harrison) similarly jumped on the bandwagon and headed to Italy to find stardom and financially greener pastures.\n\nThanks to his unconventional appearance (small, sharp eyes and craggy face) and enthusiasm for his work, Mitchell found himself one of the most in-demand performers in Italy's Sword & Sandal craze of the early 60's, working with several top directors including Marino Girolami, Alberto De Martino, and Michele Lupo. Unlike most of his peers who left Italy once the genre ran its course, Mitchell stayed on to play villains in numerous Spaghetti Westerns, Giallos, War Films, and Science Fiction movies. He also had a small but key role in the Elizabeth Taylor / Marlon Brandon vehicle \"Reflections in a Golden Eye\" (1967) during this time though perhaps his most prestigious role would be the rogue who helps the two protagonists kidnap the noble in Fellini's \"Satyricon\" (1969). Mitchell used his extra cash to buy and build his own movie studio (Cave Studios) which he single-handedly constructed outside of Rome. It went largely unused except by ultra-low budget director Demofilo Fidani who would often cast Mitchell as well.\n\nIn the late 1980's when the Italian genre film industry had basically self-destructed, unable to compete with American films even for video rentals, Mitchell packed his bags and moved back to California. Once home, he re-teamed with old friend Joe Gold to manage World Gym, at which Mitchell acted as COO and lived at the top floor of its headquarters in Marina Del Rey. Continuing for years to act in low budget films purely for the fun of it, Mitchell passed away in his sleep at age 80 in 2003. Having just won the California recall election the day prior, Arnold Schwarzenegger took time out of his busy schedule to pay his respects at Mitchell's Memorial Service at the World Gym Headquarters along with many other bodybuilders who credit Mitchell with getting them into their careers.",
        "birthday": "1923-07-29",
        "deathday": "2003-09-20",
        "gender": 2,
        "homepage": null,
        "id": 30898,
        "imdb_id": "nm0593369",
        "known_for_department": "Acting",
        "name": "Gordon Mitchell",
        "place_of_birth": "Denver, Colorado, USA",
        "popularity": 0.1288,
        "profile_path": "/egzMP5LPg6WiO45nSGlOyfhaTsb.jpg"
    }
}