{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/evUB9YKE5IPPtQOchcEF6hS90BO.jpg",
                "genre_ids": [
                    18,
                    9648,
                    80
                ],
                "id": 37257,
                "original_language": "en",
                "original_title": "Witness for the Prosecution",
                "overview": "An ailing barrister agrees to defend a man in a sensational murder trial where the unconvincing testimony of the defendant's wife becomes a subject of confusion.",
                "popularity": 4.358,
                "poster_path": "/bCj4EfuehAlgBwVd3diyWyhuuau.jpg",
                "release_date": "1957-12-17",
                "title": "Witness for the Prosecution",
                "video": false,
                "vote_average": 8.214,
                "vote_count": 1541,
                "character": "Spotlight Operator in German Cafe (uncredited)",
                "credit_id": "55f0648ac3a3684c7f00045d",
                "order": 58
            },
            {
                "adult": false,
                "backdrop_path": "/bDsXa3PV3biQ8ZK1tQyK4vlkvCc.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 821,
                "original_language": "en",
                "original_title": "Judgment at Nuremberg",
                "overview": "In 1947, four German judges who served on the bench during the Nazi regime face a military tribunal to answer charges of crimes against humanity. Chief Justice Haywood hears evidence and testimony not only from lead defendant Ernst Janning and his defense attorney Hans Rolfe, but also from the widow of a Nazi general, an idealistic U.S. Army captain and reluctant witness Irene Wallner.",
                "popularity": 5.8267,
                "poster_path": "/b6vYatvui1EXeFYfpDX4rcbueuP.jpg",
                "release_date": "1961-12-18",
                "title": "Judgment at Nuremberg",
                "video": false,
                "vote_average": 8.025,
                "vote_count": 864,
                "character": "Waiter (uncredited)",
                "credit_id": "55fd9978c3a368133b00112a",
                "order": 39
            },
            {
                "adult": false,
                "backdrop_path": "/rsI82F7DadIQcrZyPbuwmkhN5ty.jpg",
                "genre_ids": [
                    35
                ],
                "id": 3034,
                "original_language": "en",
                "original_title": "Young Frankenstein",
                "overview": "A young neurosurgeon inherits the castle of his grandfather, the famous Dr. Victor von Frankenstein. In the castle he finds a funny hunchback, a pretty lab assistant and the elderly housekeeper. Young Frankenstein believes that the work of his grandfather was delusional, but when he discovers the book where the mad doctor described his reanimation experiment, he suddenly changes his mind.",
                "popularity": 3.9553,
                "poster_path": "/c6335WJCZO8NK5wehHk5sA9Cypv.jpg",
                "release_date": "1974-12-15",
                "title": "Young Frankenstein",
                "video": false,
                "vote_average": 7.867,
                "vote_count": 3247,
                "character": "Emcee at Frankenstein's Show",
                "credit_id": "568ea68d9251416b470030bd",
                "order": 23
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Norbert Shiller"
        ],
        "biography": "Norbert Schiller,  Born in Vienna, Austria on November 24, 1899, Norbert Schiller embarked on a successful acting career that spanned across continents and mediums.  Schiller's early life is shrouded in some mystery. We know he was born in Vienna and entered the world of acting at a young age, captivating audiences with his natural stage presence and expressive voice. He honed his skills in the vibrant Viennese theater scene, eventually graduating to prominent roles in both Austria and Germany.\n\nThe allure of Hollywood beckoned in the 1920s, leading Schiller to relocate to Los Angeles and pursue opportunities in American film. He quickly found success, appearing in numerous films throughout the silent and early sound eras. His versatility allowed him to portray a wide range of characters, from charming heroes to cunning villains, captivating audiences with his nuanced performances.\n\nSchiller's career continued to flourish throughout the mid-20th century. He divided his time between film and television, appearing in popular shows like \"The Twilight Zone\" and \"Alfred Hitchcock Presents.\" He also continued to work in theater, both on Broadway and in regional productions.",
        "birthday": "1899-11-24",
        "deathday": "1988-01-08",
        "gender": 2,
        "homepage": null,
        "id": 30979,
        "imdb_id": "nm0771667",
        "known_for_department": "Acting",
        "name": "Norbert Schiller",
        "place_of_birth": "Wien, Austria",
        "popularity": 0.1403,
        "profile_path": "/6eOSrwtsJQvuimU2ceHDDQ5gwPo.jpg"
    }
}