{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uw4SnKFZ453Gxmj5XR5Susj8TNo.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 602,
                "original_language": "en",
                "original_title": "Independence Day",
                "overview": "Strange phenomena surface around the globe. The skies ignite. Terror races through the world's major cities. As these extraordinary events unfold, it becomes increasingly clear that a force of incredible magnitude has arrived. Its mission: total annihilation over the Fourth of July weekend. The last hope to stop the destruction is an unlikely group of people united by fate and unimaginable circumstances.",
                "popularity": 7.9562,
                "poster_path": "/p0BPQGSPoSa8Ml0DAf2mB2kCU0R.jpg",
                "release_date": "1996-06-25",
                "title": "Independence Day",
                "video": false,
                "vote_average": 6.896,
                "vote_count": 9968,
                "character": "Mario",
                "credit_id": "52fe425bc3a36847f801802b",
                "order": 51
            },
            {
                "adult": false,
                "backdrop_path": "/v46Uq29FXcl4huvu1Nh7tJ5qAjZ.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 10673,
                "original_language": "en",
                "original_title": "Wall Street",
                "overview": "A young and impatient stockbroker is willing to do anything to get to the top, including trading on illegal inside information taken through a ruthless and greedy corporate raider, whom takes the youth under his wing.",
                "popularity": 5.3071,
                "poster_path": "/2tQYq9ntzn2dEwDIGLBSipYPenv.jpg",
                "release_date": "1987-12-10",
                "title": "Wall Street",
                "video": false,
                "vote_average": 7.163,
                "vote_count": 2147,
                "character": "Dominick",
                "credit_id": "52fe43a09251416c75017c1b",
                "order": 18
            },
            {
                "adult": false,
                "backdrop_path": "/2Cpg8hUn60PK9CW9d5SWf605Ah8.jpg",
                "genre_ids": [
                    16,
                    35,
                    28,
                    878
                ],
                "id": 614930,
                "original_language": "en",
                "original_title": "Teenage Mutant Ninja Turtles: Mutant Mayhem",
                "overview": "After years of being sheltered from the human world, the Turtle brothers set out to win the hearts of New Yorkers and be accepted as normal teenagers through heroic acts. Their new friend April O'Neil helps them take on a mysterious crime syndicate, but they soon get in over their heads when an army of mutants is unleashed upon them.",
                "popularity": 9.3588,
                "poster_path": "/kbnhvFPyXKCKLNhg1pkz6rXQ4Le.jpg",
                "release_date": "2023-07-31",
                "title": "Teenage Mutant Ninja Turtles: Mutant Mayhem",
                "video": false,
                "vote_average": 7.209,
                "vote_count": 1467,
                "character": "Cab Driver (voice)",
                "credit_id": "64c84ddb1fa1c800eeae39d1",
                "order": 21
            },
            {
                "adult": false,
                "backdrop_path": "/kGlEhkmFaGUvhBvLvhhq9i9OOXX.jpg",
                "genre_ids": [
                    10402,
                    18,
                    36
                ],
                "id": 10537,
                "original_language": "en",
                "original_title": "The Doors",
                "overview": "The story of the famous and influential 1960s rock band and its lead singer and composer, Jim Morrison.",
                "popularity": 3.5564,
                "poster_path": "/x1LM3dzGuG6xOz0aT2e71o11vhu.jpg",
                "release_date": "1991-03-01",
                "title": "The Doors",
                "video": false,
                "vote_average": 7.119,
                "vote_count": 1507,
                "character": "Jerry",
                "credit_id": "5778932b9251411c5300192d",
                "order": 16
            },
            {
                "adult": false,
                "backdrop_path": "/lPLTLCBn39Wiy1RPQLB9xOKyF2v.jpg",
                "genre_ids": [
                    28,
                    18,
                    53
                ],
                "id": 9798,
                "original_language": "en",
                "original_title": "Enemy of the State",
                "overview": "The life of labor lawyer and dedicated family man Robert 'Bobby' Dean is turned upside down after a chance meeting with a college buddy while holiday shopping. Unbeknownst to Dean, he's just been burdened with a videotape of a congressman's assassination. Hot on the trail of this tape is a ruthless group of National Security Agents commanded by a belligerently ambitious NSA official named Reynolds. Using satellite surveillance, bugs, and other sophisticated snooping devices, the NSA infiltrates every facet of Dean's existence, tracing each physical and digital footprint he leaves while also framing him for murder. With the help of the mysterious Brill, he attempts to throw the NSA off his trail and prove his innocence.",
                "popularity": 6.5991,
                "poster_path": "/x9pXrMKLsBGGOFyyZ0Gwt9YpVub.jpg",
                "release_date": "1998-11-20",
                "title": "Enemy of the State",
                "video": false,
                "vote_average": 7.055,
                "vote_count": 4037,
                "character": "Older Worker #1",
                "credit_id": "587b77c5c3a368426e001f11",
                "order": 28
            },
            {
                "adult": false,
                "backdrop_path": "/kJQS6jxxtNTaWI8jw7ynck97rgl.jpg",
                "genre_ids": [
                    28,
                    53
                ],
                "id": 1637,
                "original_language": "en",
                "original_title": "Speed",
                "overview": "Jack Traven, an LAPD cop on SWAT detail, and veteran SWAT officer Harry Temple thwart an extortionist-bomber's scheme for a $3 million ransom. As they corner the bomber, he flees and detonates a bomb vest, seemingly killing himself. Weeks later, Jack witnesses a mass transit city bus explode and nearby a pay phone rings. On the phone is that same bomber looking for vengeance and the money he's owed. He gives a personal challenge to Jack: a bomb is rigged on another city bus - if it slows down below 50 mph, it will explode - bad enough any day, but a nightmare in LA traffic. And that's just the beginning...",
                "popularity": 7.5766,
                "poster_path": "/o1Zs7VaS9y2GYH9CLeWxaVLWd3x.jpg",
                "release_date": "1994-06-09",
                "title": "Speed",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 6489,
                "character": "Bob",
                "credit_id": "5998979b925141415900b73c",
                "order": 28
            },
            {
                "adult": false,
                "backdrop_path": "/oubk1SEFtg3Q8eOncFvGQVa6OoP.jpg",
                "genre_ids": [
                    18,
                    9648,
                    27
                ],
                "id": 2291,
                "original_language": "en",
                "original_title": "Jacob's Ladder",
                "overview": "After returning home from the Vietnam War, veteran Jacob Singer struggles to maintain his sanity. Plagued by hallucinations and flashbacks, Singer rapidly falls apart as the world and people around him morph and twist into disturbing images. His girlfriend, Jezzie, and ex-wife, Sarah, try to help, but to little avail. Even Singer's chiropractor friend, Louis, fails to reach him as he descends into madness.",
                "popularity": 3.9903,
                "poster_path": "/ufLcHIi1aXjjH8MediAMvnwDsVI.jpg",
                "release_date": "1990-11-02",
                "title": "Jacob's Ladder",
                "video": false,
                "vote_average": 7.352,
                "vote_count": 1754,
                "character": "Army Officer",
                "credit_id": "5f249414e22d280037615bf0",
                "order": 30
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "John C. Capodice"
        ],
        "biography": "John Capodice (December 25, 1941- December 30, 2024) was an American character actor.\n\nCapodice was born in Chicago, Illinois. He began his film and television career in the late 1970s. His first role was in the ABC-TV soap opera Ryan's Hope, where he appeared in six episodes as Lloyd Lord. He had guest roles on numerous other TV series, including Spenser: For Hire, Kate & Allie, Seinfeld, Murder She Wrote, Murphy Brown, Knots Landing, Hunter, and Law & Order. He appeared on the series Moonlighting in 1989 and performed as a guest star in an episode of NBC-TV's Will & Grace (episode 1.21), in the role of the repairman who suffers a heart attack.\n\nHis most recent TV appearances were on The West Wing, Six Feet Under and CSI: Crime Scene Investigation.\n\nIn a memorable 1980s television ad for Polly-O String Cheese, Capodice portrayed Fred, a dumbfounded pizzeria owner, who is asked by three teens to make a pizza with extra cheese, but to hold the tomato sauce, and the crust. Essentially a pizza, with \"nuttin.\" He also appeared as a trucker who gives medical advice in a popular ad for Dimetapp Cold Medicine.\n\nCapodice has also worked in the theatre, appearing mainly in Off-Broadway productions. He appeared as a prison guard in the play Getting Out at the Marymount Manhattan Theatre in October/November 1978 and at the Lucille Lortel Theatre from May 1979 to December 1980. The play won two Outer Critics Circle Awards in 1979. Capodice appeared in the Broadway production of Requiem For a Heavyweight, opposite John Lithgow, George Segal, and John C. McGinley.\n\nCapodice appeared as Doyle in the 1982 film Q and in the 1989 film Family Business as Tommy. Other film appearances are in the 1991 Oliver Stone film The Doors and the 1989 comedy See No Evil, Hear No Evil, where he appears as a police detective. He had roles in Ace Ventura: Pet Detective, Naked Gun 33+1⁄3: The Final Insult (1994), Speed (1994), Independence Day (1996), and Enemy of the State (1998). He provides the voice of Sidney Pen in the 2010 video game Mafia II.",
        "birthday": "1941-12-25",
        "deathday": "2024-12-30",
        "gender": 2,
        "homepage": null,
        "id": 31007,
        "imdb_id": "nm0135306",
        "known_for_department": "Acting",
        "name": "John Capodice",
        "place_of_birth": "Chicago, Illinois, USA",
        "popularity": 0.1567,
        "profile_path": "/lN5VuGKFqfOFH5F8zso34I77sy2.jpg"
    }
}