{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5JaR6UEoCJJLtLpqFOVMY4O4R7P.jpg",
                "genre_ids": [
                    80,
                    18,
                    28
                ],
                "id": 949,
                "original_language": "en",
                "original_title": "Heat",
                "overview": "Obsessive master thief Neil McCauley leads a top-notch crew on various daring heists throughout Los Angeles while determined detective Vincent Hanna pursues him without rest. Each man recognizes and respects the ability and the dedication of the other even though they are aware their cat-and-mouse game may end in violence.",
                "popularity": 10.0455,
                "poster_path": "/umSVjVdbVwtx5ryCA2QXL44Durm.jpg",
                "release_date": "1995-12-15",
                "title": "Heat",
                "video": false,
                "vote_average": 7.922,
                "vote_count": 7791,
                "character": "Richard Torena",
                "credit_id": "52fe4292c3a36847f8029237",
                "order": 24
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Tone-Lōc",
            "Tone Lõc",
            "Anthony Terrell Smith",
            "Anthony Smith"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nAnthony Terrell Smith (born March 3, 1966, Los Angeles, California), better known by his stage name Tone Lōc, is an American rapper and actor. He is best known for his deep, gravelly voice and his million-selling hit singles, \"Wild Thing\" and \"Funky Cold Medina\". Tone Lōc is also a voice actor, having voiced characters in several cartoon series. He also voiced Fud Wrapper, the host of the animatronic show, Food Rocks, which played at Epcot from 1994 to 2004. In this latter role, he sang the song \"Always Read the Wrapper\", a parody of his own song \"Funky Cold Medina\". His song \"Ace Is In The House\" features in the films \"Ace Ventura: Pet Detective\" (1994) and \"Ace Ventura Jr: Pet Detective\" (2009).\n\nHe provided vocals for FeFe Dobson for a track called \"Rock It 'Til You Drop It\" on her first album, 2003's Fefe Dobson.\n\nDescription above from the Wikipedia article Tone Lōc, licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": "1966-03-03",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 31004,
        "imdb_id": "nm0005159",
        "known_for_department": "Acting",
        "name": "Tone Loc",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.2768,
        "profile_path": "/puDbq7YPq6Jg0nrSeK6t9MFIhFP.jpg"
    }
}