{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/nLLYm9qPtE6WwFSzDOHMUUfytcx.jpg",
                "genre_ids": [
                    35,
                    10402,
                    18
                ],
                "id": 304410,
                "original_language": "fr",
                "original_title": "La Famille Bélier",
                "overview": "The whole Bélier family is deaf, except for sixteen year old Paula who is the important translator in her parents' day to day life especially when it comes to matters concerning the family farm. When her music teacher discovers she has a fantastic singing voice and she gets an opportunity to enter a big Radio France contest the whole family's future is set up for big changes.",
                "popularity": 3.0656,
                "poster_path": "/kAQeZUZ1pMTSjSF3d6eBZClFGgN.jpg",
                "release_date": "2014-12-17",
                "title": "The Bélier Family",
                "video": false,
                "vote_average": 6.933,
                "vote_count": 2405,
                "character": "Gabriel Chevignon (voice)",
                "credit_id": "60ba5c12cede69007e9d8d3b",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Sébastien",
            "Seva"
        ],
        "biography": "Sébastien Agius or just Sébastien or Seva (born 2 March 1983 in Nice, France) is a French singer and songwriter, and winner of the inaugural season of the French X Factor series in 2009.\n\nIn 2003, he tried unsuccessfully for the first-ever series of the French singing competition Nouvelle Star. He was touring many years in Gospel pour 100 voix.\n\nSince then, he has had many concerts and taken part in musicals. In 2007, he created the musical Hé l'artiste! with participation of 25 artists. Sébastien Agius wrote the lyrics and the music and designed the choreography.\n\nHe also played a role in: La Petite Fille aux Allumettes (of Christian Schittenhelm) in the role of Prince; Le petit chose (of Christian Schittenhelm); Piaf, je t'aime in the role of Petit Louis (small Louis); La Petite Sirène (of Christian Schittenhelm) in the role of Prince; Fashion or L'Enfer d'Eurydice in the role of Orphée; Petits Secrets Entre Voisins, 2014, episode \"Une mère absente\", playing Marco, the guitar player brother; Plus belle la vie, 2016 (season 13).\n\nSébastien Agius tried for the new series X Factor in Rennes and was one of the finalists chosen. On 28 December 2009, he won the first ever French edition of The X Factor broadcast on W9 Network in France beating the 17-year-old Marie in the finals.\n\nDuring the series, he interpreted the following songs: \"L'envie d'aimer\" – Les Dix Commandements – 11 November 2009; \"L'assasymphonie\" – Mozart, l'opéra rock – 18 November 2009; \"Somewhere Only We Know\" – Keane – 25 November 2009; \"Si seulement je pouvais lui manquer\" – Calogero – 30 November 2009; \"Dirty Diana\" – Michael Jackson – 30 November 2009; \"Lettre à France\" – Michel Polnareff – 7 December 2009; \"Kiss\" – Prince – 7 December 2009; \"Requiem pour un fou\" – Johnny Hallyday – 14 December 2009; \"Long Train Runnin'\" – The Doobie Brothers – 14 December 2009; \"Vivre ou survivre\" – Daniel Balavoine – 21 December 2009; \"It's a Man's Man's World\" – James Brown – 21 December 2009; \"Sorry Seems to Be the Hardest Word\" – Elton John – 21 December 2009; \"Angels\" -Robbie Williams – 28 December 2009; \"Je te promets\" – Johnny Hallyday – 28 December 2009; \"Unchain My Heart\" – Joe Cocker – 28 December 2009.\n\nAfter winning, Sébastien Agius signed a record deal with Jive Epic/Sony. In April 2010, Agius also engaged in a tour of French and Belgian venues alongside Season 1 finalists Cyrielle, Gauthier Dymon and Guillaume.\n\nHis first official single release is \"Ma Chance\". released in March 2010. It is a jazzy tune greatly influenced by the Michael Bublé single \"Haven't Met You Yet\". His first album also entitled Ma chance was released in August 2010. \"Ma Chance\" did not meet the success the X factor winner hoped for, and the album sales were disappointing.\n\nHe is the composer of \"Page Blanche, Page Grise, Page Bleue\". Agius shifted gear and started appearing in musical comedies including the 2011 production Dracula, l'amour plus fort que la mort (Globe de Cristal Award 2012) by Kamel Ouali where Agius played the double roles of the sorcerer and the angel.\n\nIn 2012, Sébastien Agius became the newest cast member of 1789: Les Amants de la Bastille (Globe de Cristal Award 2013) where he plays the role of Maximilien de Robespierre. The show opened on 10 October 2012. ...\n\nSource: Article \"Sébastien Agius\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1983-03-02",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 3114090,
        "imdb_id": "nm5066488",
        "known_for_department": "Acting",
        "name": "Sébastien Agius",
        "place_of_birth": "Nice, Alpes-Maritimes, France",
        "popularity": 0.0143,
        "profile_path": "/7XQ4UZYUCUH7oyTheGXrZlVndiY.jpg"
    }
}