{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lMWOcXVA62xnk1jSaz8iwrxVJR7.jpg",
                "genre_ids": [
                    18
                ],
                "id": 795514,
                "original_language": "en",
                "original_title": "The Fallout",
                "overview": "In the wake of a school tragedy, Vada, Mia and Quinton form a unique and dynamic bond as they navigate the never linear, often confusing journey to heal in a world that feels forever changed.",
                "popularity": 6.0784,
                "poster_path": "/4ByHl9XRKR2iXbvF0ZilMRD1RcL.jpg",
                "release_date": "2021-03-17",
                "title": "The Fallout",
                "video": false,
                "vote_average": 7.547,
                "vote_count": 1233,
                "character": "Patricia Cavell",
                "credit_id": "6415da115690b500bb012fe5",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "جولی باون"
        ],
        "biography": "Julie Bowen Luetkemeyer (born March 3, 1970) is an American actress. She is best known for her role as Claire Dunphy on the sitcom Modern Family, Carol Vessey on Ed, and Denise Bauer on Boston Legal.\n\nShe began her acting career in the soap opera Loving in 1992. In 1994, she played the lead role opposite Paul Rudd, in the television film Runaway Daughters. Throughout the 90s and early 2000s, she had roles in numerous films including Happy Gilmore (1996), An American Werewolf in Paris (1997), Joe Somebody (2001) and Kids in America (2005). She gained recognition on the television series Ed, where she played high school English teacher Carol Vessey, the love interest of of the series' protagonist, Ed Stevens.\n\nShe has had guest roles in many television series including Party of Five, Jake in Progress, ER and Strange Luck. In the cult series Lost, she played Jack Shepard's ex-wife, Sarah Shepard. In 2008, she had a recurring role as Lisa, the love interest of the almost legal Silas Botwin on Weeds. Since 2009, she co-starred in the hit ABC sitcom Modern Family. For her portrayal of the competitive and lovable soccer mom, Claire Dunphy, she received four Primetime Emmy Award nominations for Outstanding Supporting Actress in a Comedy Series, winning the award in 2011 and 2012.",
        "birthday": "1970-03-03",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 31171,
        "imdb_id": "nm0100866",
        "known_for_department": "Acting",
        "name": "Julie Bowen",
        "place_of_birth": "Baltimore, Maryland, USA",
        "popularity": 2.0482,
        "profile_path": "/5ewqnbPAY0EzZObGHIKU4VsCanD.jpg"
    }
}