{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/syUzOlwPqM8pGRhUxPOnmrcGcHb.jpg",
                "genre_ids": [
                    37,
                    35
                ],
                "id": 11072,
                "original_language": "en",
                "original_title": "Blazing Saddles",
                "overview": "A town—where everyone seems to be named Johnson—stands in the way of the railroad. In order to grab their land, robber baron Hedley Lamarr sends his henchmen to make life in the town unbearable. After the sheriff is killed, the town demands a new sheriff from the Governor, so Hedley convinces him to send the town the first black sheriff in the west.",
                "popularity": 3.848,
                "poster_path": "/vNw1gOEDdYTDeNMuuq8OmiEHrfH.jpg",
                "release_date": "1974-02-07",
                "title": "Blazing Saddles",
                "video": false,
                "vote_average": 7.244,
                "vote_count": 1970,
                "character": "Gum Chewer",
                "credit_id": "6331745de32943007e26bc28",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nDon Megowan (May 24, 1922 – June 26, 1981) was an American actor. He played the Gill-man on land in The Creature Walks Among Us, the final part of the Creature from the Black Lagoon trilogy.\n\nDon Megowan was born in Inglewood, California to Robert and Leila (née Dale) Megowan. His mother Leila worked as a negative cutter for Pathé. At 6'7\" Megowan was very active in sports, playing baseball, football, and throwing discus. He went to the University of Southern California on a football scholarship before serving in the United States Army during World War II.\n\nMegowan starred in the science fiction films The Werewolf in the role of Sheriff Jack Haines, in The Creation of the Humanoids (1962) as a captain in the anti-robot Order of Flesh and Blood, who must stop the Humanoids, and in The Creature Walks Among Us as the Gill-man.\n\nMegowan also appeared in westerns: Davy Crockett, King of the Wild Frontier (1955), The Great Locomotive Chase (1956), Tarzan and the Valley of Gold (1966), The Devil's Brigade (1968), and Mel Brooks Blazing Saddles (1974).\n\nIn 1962, he starred with Cameron Mitchell in the television series, The Beachcomber. He guest starred in various programs, including the westerns: Gunsmoke, Wagon Train (twice), The Californians, The Tall Man, Maverick, Cimarron City, Have Gun–Will Travel, Tales of Wells Fargo, The Rifleman, Lawman, Cheyenne, Colt .45, Bonanza, The Americans, Rawhide, and Daniel Boone. He was also cast in episodes of such series as Angel, U.S. Marshal, Get Smart, and Fantasy Island.\n\nMegowan, a smoker from age 12 to 48, died of throat cancer at age 59. His weight had dwindled from nearly 300 pounds to barely 150.  CLR\n\nDescription above from the Wikipedia article Don Megowan,licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1922-05-24",
        "deathday": "1981-06-26",
        "gender": 2,
        "homepage": null,
        "id": 31208,
        "imdb_id": "nm0576353",
        "known_for_department": "Acting",
        "name": "Don Megowan",
        "place_of_birth": "Inglewood, California, USA",
        "popularity": 0.4558,
        "profile_path": "/3tVA3iTXNGvIuJnZMwkGzZsEyE.jpg"
    }
}