{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kb2FuXGruaPA6ErjOpcifpCyPyY.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 11287,
                "original_language": "en",
                "original_title": "A League of Their Own",
                "overview": "As America's stock of athletic young men is depleted during World War II, a professional all-female baseball league springs up in the Midwest, funded by publicity-hungry candy maker Walter Harvey. Competitive sisters Dottie Hinson and Kit Keller spar with each other, scout Ernie Capadino and grumpy has-been coach Jimmy Dugan on their way to fame.",
                "popularity": 4.2964,
                "poster_path": "/7xpFXAOjgzFPE3vyVerFGfrXhFK.jpg",
                "release_date": "1992-07-01",
                "title": "A League of Their Own",
                "video": false,
                "vote_average": 7.22,
                "vote_count": 1463,
                "character": "Mae Mordabito (CF)",
                "credit_id": "52fe441e9251416c750297eb",
                "order": 3
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/yDHYTfA3R0jFYba16jBB1ef8oIt.jpg",
                "genre_ids": [
                    28,
                    35,
                    878
                ],
                "id": 533535,
                "original_language": "en",
                "original_title": "Deadpool & Wolverine",
                "overview": "A listless Wade Wilson toils away in civilian life with his days as the morally flexible mercenary, Deadpool, behind him. But when his homeworld faces an existential threat, Wade must reluctantly suit-up again with an even more reluctant Wolverine.",
                "popularity": 33.6195,
                "poster_path": "/8cdWjvZQUExUUTzyp4t6EDMubfO.jpg",
                "release_date": "2024-07-24",
                "title": "Deadpool & Wolverine",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 7745,
                "credit_id": "68356c552f025fa43a7301b6",
                "department": "Sound",
                "job": "Songs"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Madonna Louise Ciccone",
            "Madonna Louise Veronica Ciccone",
            "Queen of Pop",
            "مدونا"
        ],
        "biography": "Madonna (born Madonna Louise Ciccone; August 16, 1958) is an American recording artist, actress and entrepreneur. Born in Bay City, Michigan, she moved to New York City in 1977 to pursue a career in modern dance. After performing in the music groups Breakfast Club and Emmy, she released her debut album in 1983. She followed it with a series of albums in which she found immense popularity by pushing the boundaries of lyrical content in mainstream popular music and imagery in her music videos, which became a fixture on MTV. Throughout her career, many of her songs have hit number one on the record charts, including \"Like a Virgin\", \"Papa Don't Preach\", \"Like a Prayer\", \"Vogue\", \"Frozen\", \"Music\", \"Hung Up\", and \"4 Minutes\". Critics have praised Madonna for her diverse musical productions while at the same time serving as a lightning rod for religious controversy.\n\nHer career was further enhanced by film appearances that began in 1979, despite mixed commentary. She won critical acclaim and a Golden Globe Award for Best Actress in Motion Picture Musical or Comedy for her role in Evita (1996), but has received harsh feedback for other film roles. Madonna's other ventures include being a fashion designer, children's book author, film director and producer. She has been acclaimed as a businesswoman, and in 2007, she signed an unprecedented US $120 million contract with Live Nation.\n\nMadonna has sold more than 300 million records worldwide and is recognized as the world's top-selling female recording artist of all time by the Guinness World Records. According to the Recording Industry Association of America (RIAA), she is the best-selling female rock artist of the 20th century and the second top-selling female artist in the United States, behind Barbra Streisand, with 64 million certified albums. In 2008, Billboard magazine ranked Madonna at number two, behind only The Beatles, on the Billboard Hot 100 All-Time Top Artists, making her the most successful solo artist in the history of the Billboard chart. She was also inducted into the Rock and Roll Hall of Fame in the same year. Considered to be one of the \"25 Most Powerful Women of the Past Century\" by Time for being an influential figure in contemporary music, Madonna is known for continuously reinventing both her music and image, and for retaining a standard of autonomy within the recording industry.\n\nOn May 4, 2024, with a free concert which was live streamed at the Copacabana Beach in Rio de Janeiro, Brazil, in front of  1.6 million people, Madonna broke the record for the most attended stand-alone concert by any artist, and the all-time highest attended concert by a female artist.",
        "birthday": "1958-08-16",
        "deathday": null,
        "gender": 1,
        "homepage": "https://madonna.com/",
        "id": 3125,
        "imdb_id": "nm0000187",
        "known_for_department": "Acting",
        "name": "Madonna",
        "place_of_birth": "Bay City, Michigan, USA",
        "popularity": 0.6109,
        "profile_path": "/d11f76gpql9RNSnyYgZ6yQr5DW7.jpg"
    }
}