{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/diGPtRd1p8Oanp5Vu51rV2bu4K5.jpg",
                "genre_ids": [
                    18,
                    53
                ],
                "id": 11329,
                "original_language": "en",
                "original_title": "Runaway Jury",
                "overview": "After a workplace shooting in New Orleans, a trial against the gun manufacturer pits lawyer Wendell Rohr against shady jury consultant Rankin Fitch, who uses illegal means to stack the jury with people sympathetic to the defense. But when juror Nicholas Easter and his girlfriend Marlee reveal their ability to sway the jury into delivering any verdict they want, a high-stakes cat-and-mouse game begins.",
                "popularity": 4.2708,
                "poster_path": "/g58RA1zzE39KnkRpKRfgA5RxoXP.jpg",
                "release_date": "2003-01-16",
                "title": "Runaway Jury",
                "video": false,
                "vote_average": 6.925,
                "vote_count": 1427,
                "character": "Vanessa Lembeck",
                "credit_id": "53660dcd0e0a2647c8002f77",
                "order": 14
            },
            {
                "adult": false,
                "backdrop_path": "/q0X5l5GfbqxKuof0XHEIuh94RKb.jpg",
                "genre_ids": [
                    18,
                    14
                ],
                "id": 397837,
                "original_language": "en",
                "original_title": "Before I Fall",
                "overview": "Samantha Kingston has everything. Then, everything changes. After one fateful night, she wakes up with no future at all. Trapped into reliving the same day over and over, she begins to question just how perfect her life really was.",
                "popularity": 2.5356,
                "poster_path": "/eowzonDJMCuNXoJGVkP9Z7oCmiM.jpg",
                "release_date": "2017-03-02",
                "title": "Before I Fall",
                "video": false,
                "vote_average": 6.968,
                "vote_count": 3474,
                "character": "Mrs. Kingston",
                "credit_id": "573a91fac3a36806b8001d72",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/997ToEZvF2Obp9zNZbY5ELVnmrW.jpg",
                "genre_ids": [
                    10749,
                    18
                ],
                "id": 537915,
                "original_language": "en",
                "original_title": "After",
                "overview": "Tessa Young is a dedicated student, dutiful daughter and loyal girlfriend to her high school sweetheart. Entering her first semester of college, Tessa's guarded world opens up when she meets Hardin Scott, a mysterious and brooding rebel who makes her question all she thought she knew about herself -- and what she wants out of life.",
                "popularity": 17.2139,
                "poster_path": "/u3B2YKUjWABcxXZ6Nm9h10hLUbh.jpg",
                "release_date": "2019-04-11",
                "title": "After",
                "video": false,
                "vote_average": 7.116,
                "vote_count": 8400,
                "character": "Karen Gibson",
                "credit_id": "5b5cef0e0e0a262e9f01d7d5",
                "order": 12
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/suaEOtk1N1sgg2MTM7oZd2cfVp3.jpg",
                "genre_ids": [
                    53,
                    80,
                    35,
                    18
                ],
                "id": 680,
                "original_language": "en",
                "original_title": "Pulp Fiction",
                "overview": "A burger-loving hit man, his philosophical partner, a drug-addled gangster's moll and a washed-up boxer converge in this sprawling, comedic crime caper. Their adventures unfurl in three stories that ingeniously trip back and forth in time.",
                "popularity": 17.3226,
                "poster_path": "/vQWk5YBFWF4bZaofAbv0tShwBvQ.jpg",
                "release_date": "1994-09-10",
                "title": "Pulp Fiction",
                "video": false,
                "vote_average": 8.487,
                "vote_count": 29098,
                "credit_id": "56d4e785c3a3681e3601569f",
                "department": "Crew",
                "job": "Thanks"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Дженніфер Білз",
            "جنیفر بیلز",
            "珍妮佛·貝爾"
        ],
        "biography": "Jennifer Beals (born December 19, 1963) is an American actress and a former teen model. She is known for her roles as Alexandra \"Alex\" Owens in the 1983 film Flashdance, and as Bette Porter on the Showtime drama series The L Word. She earned an NAACP Image Award and a Golden Globe Award nomination for the former. She has appeared in more than 50 films.\n\nBeals was born on the South Side of Chicago, the daughter of Jeanne (née Anderson), an elementary school teacher, and Alfred Beals, who owned grocery stores. She is multiracial; her father was African American, and her mother is Irish American. She has two brothers, Bobby and Gregory.Her father died when Beals was nine years old, and her mother married Edward Cohen in 1981. Beals has said her biracial heritage had some effect on her, as she \"always lived sort of on the outside\", with an idea \"of being the other in society\". She got her first job at age 13 at an ice cream store, using her height at the time (she is now nearly 5 ft 9 in (1.75 m)), to convince her boss she was 16.\n\nBeals was inspired to become an actress by two events: doing a high school production of Fiddler on the Roof and seeing Balm in Gilead with Joan Allen while volunteer-ushering at the Steppenwolf Theatre.\n\nBeals graduated from the progressive Francis W. Parker School. She also was chosen to attend the elite Goodman Theatre Young People's Drama Workshop. Beals attended Yale University, receiving a B.A. in American literature in 1987; she deferred a term so she could film Flashdance. While at Yale, Beals was a resident of Morse College.\n\nDescription above from the Wikipedia article Jennifer Beals, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1963-12-19",
        "deathday": null,
        "gender": 1,
        "homepage": "http://thejenniferbeals.com",
        "id": 3130,
        "imdb_id": "nm0000884",
        "known_for_department": "Acting",
        "name": "Jennifer Beals",
        "place_of_birth": "Chicago, Illinois, USA",
        "popularity": 1.5069,
        "profile_path": "/tu1CjyjoUoV7rGPyvwvH9b0MlbW.jpg"
    }
}