{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bYJyQqqJV30RJX6VPE3Rz1lPZhH.jpg",
                "genre_ids": [
                    28,
                    18,
                    53
                ],
                "id": 2100,
                "original_language": "en",
                "original_title": "The Last Castle",
                "overview": "A court-martialed general rallies together 1200 inmates to rise against the system that put him away.",
                "popularity": 7.584,
                "poster_path": "/pYnUfauPVK6g8IRO2REYl4TUZ2p.jpg",
                "release_date": "2001-10-19",
                "title": "The Last Castle",
                "video": false,
                "vote_average": 7.164,
                "vote_count": 1325,
                "character": "Dellwo",
                "credit_id": "52fe4335c3a36847f80429fd",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/suaEOtk1N1sgg2MTM7oZd2cfVp3.jpg",
                "genre_ids": [
                    53,
                    80,
                    35,
                    18
                ],
                "id": 680,
                "original_language": "en",
                "original_title": "Pulp Fiction",
                "overview": "A burger-loving hit man, his philosophical partner, a drug-addled gangster's moll and a washed-up boxer converge in this sprawling, comedic crime caper. Their adventures unfurl in three stories that ingeniously trip back and forth in time.",
                "popularity": 18.5743,
                "poster_path": "/vQWk5YBFWF4bZaofAbv0tShwBvQ.jpg",
                "release_date": "1994-09-10",
                "title": "Pulp Fiction",
                "video": false,
                "vote_average": 8.5,
                "vote_count": 29078,
                "character": "Paul",
                "credit_id": "52fe426ac3a36847f801cb23",
                "order": 22
            },
            {
                "adult": false,
                "backdrop_path": "/9oE1dqocQou2tdmt0Rne7uv4jSi.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 12143,
                "original_language": "en",
                "original_title": "Bad Lieutenant",
                "overview": "While investigating a young nun's rape, a corrupt New York City police detective, with a serious drug and gambling addiction, tries to change his ways and find forgiveness.",
                "popularity": 4.4757,
                "poster_path": "/mVJ2mXykqq3t2v1nuouf1P10g0d.jpg",
                "release_date": "1992-11-20",
                "title": "Bad Lieutenant",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 906,
                "character": "Cop #1",
                "credit_id": "52fe44bd9251416c7503f581",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/5SgrtPH6kBmmHao0PofxpvOYfWC.jpg",
                "genre_ids": [
                    18,
                    80,
                    53
                ],
                "id": 470,
                "original_language": "en",
                "original_title": "21 Grams",
                "overview": "Paul Rivers, an ailing mathematician lovelessly married to an English émigré; Christina Peck, an upper-middle-class suburban housewife and mother of two girls; and Jack Jordan, a born-again ex-con, are brought together by a terrible accident that changes their lives.",
                "popularity": 4.4634,
                "poster_path": "/wZ0l6or5juuVWqDkLEgaghs4f9l.jpg",
                "release_date": "2003-09-06",
                "title": "21 Grams",
                "video": false,
                "vote_average": 7.33,
                "vote_count": 3234,
                "character": "Brown",
                "credit_id": "573a4bdec3a36806af000df1",
                "order": 24
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Paul Calderone "
        ],
        "biography": "He was born in Puerto Rico 1959. Calderon moved to New York with his family at the age of six, where he grew up on the streets of the Lower East Side and Spanish Harlem. Following some time in college, he enlisted in the United States Army and served overseas as an infantryman.  Returning to the States, Calderon set his sights on an acting career. Starting out on the New York stage, he won an Obie Award for his performance in Blade to the Heat at the Public Theatre. His most notable Broadway role was opposite Robert De Niro in Cuba and His Teddy Bear. Calderon also appeared off-Broadway in such plays as Requiem For A Heavyweight and Divine Horsemen, and played Achilles in the New York Shakespeare Festival’s production of Troilus and Cressida in Central Park. He is a founding member of the Touchstone Theatre, the American Folk Theatre and the Labyrinth Theatre Company.\n\nCalderon was originally slated to portray the role of Jules Winnfield in Pulp Fiction; Samuel L. Jackson was subsequently given the role.\n\nCorrection Samuel Jackson told Tarantino he had messed up by not casting him in Reservoir Dogs. Tarantino agreed and told him he was writing a script and had a character that he had written specifically with Jackson in mind. Calderon had a better initial reading than Jackson and Tarantino gave serious consideration to casting him as Jules Winnfield.\n\nCalderon portrays Paul the bartender in dialogue scene between Butch Coolidge and Marsellus Wallace.\n\nCalderon also co-wrote Abel Ferrara's 1992 crime drama Bad Lieutenant, starring Harvey Keitel.\n\nCalderon acted in The Last Castle and the critically acclaimed independent feature Girlfight. His more than three dozen film credits also include Out of Sight, Cop Land, Four Rooms, Pulp Fiction, Bad Lieutenant, The Firm, The Addiction, Q &amp; A, Sea of Love, Clockers and King of New York. In addition, he has made numerous guest appearances on television series, including recurring roles on Dream Street, Law &amp; Order and Miami Vice.\n\nIn 2010, Calderon is set to star as The Businessman in Sanzhar Sultanov's crime drama - The Story.",
        "birthday": "1952-01-25",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 3137,
        "imdb_id": "nm0129538",
        "known_for_department": "Acting",
        "name": "Paul Calderon",
        "place_of_birth": "Puerto Rico",
        "popularity": 0.6476,
        "profile_path": "/xIORhcIDmFMlaS3ZS3em1QiTkt5.jpg"
    }
}