{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/egKntJKzEL6HgalIyQ0Q5cMmDOA.jpg",
                "genre_ids": [
                    53,
                    80,
                    9648
                ],
                "id": 65754,
                "original_language": "en",
                "original_title": "The Girl with the Dragon Tattoo",
                "overview": "Disgraced journalist Mikael Blomkvist investigates the disappearance of a weary patriarch's niece from 40 years ago. He is aided by the pierced, tattooed, punk computer hacker named Lisbeth Salander. As they work together in the investigation, Blomkvist and Salander uncover immense corruption beyond anything they have ever imagined.",
                "popularity": 5.7149,
                "poster_path": "/8bokS83zGdhaXgN9tjidUKmAftW.jpg",
                "release_date": "2011-12-14",
                "title": "The Girl with the Dragon Tattoo",
                "video": false,
                "vote_average": 7.377,
                "vote_count": 7286,
                "character": "Nils Bjurman",
                "credit_id": "53beb3180e0a26157f0045da",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/xqOcH6cKhGEbzgypAHU6UlUUDrh.jpg",
                "genre_ids": [
                    12,
                    35,
                    18
                ],
                "id": 59468,
                "original_language": "en",
                "original_title": "The Way",
                "overview": "When his son dies while hiking the famed Camino de Santiago pilgrimage route in the Pyrenees, Tom flies to France to claim the remains. Looking for insights into his estranged child’s life, he decides to complete the 500-mile mountain trek to Spain. Tom soon joins up with other travelers and realizes they’re all searching for something.",
                "popularity": 3.6372,
                "poster_path": "/uaRfG7n92IiuYcKLl7LJo2gr6qO.jpg",
                "release_date": "2010-09-10",
                "title": "The Way",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 611,
                "character": "Joost",
                "credit_id": "53cbe97ec3a3687761001699",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/lfMtVr5hkFeGy4dMaEf3XUQr76d.jpg",
                "genre_ids": [
                    12,
                    80,
                    18
                ],
                "id": 433498,
                "original_language": "en",
                "original_title": "Papillon",
                "overview": "Henri “Papillon” Charrière, a safecracker from the Parisian underworld, is wrongfully convicted and sentenced to life imprisonment in the penal colony of French Guiana, where he forges a strong friendship with Louis Dega, a counterfeiter who needs his protection.",
                "popularity": 5.0293,
                "poster_path": "/ahF5c6vyP8HWMqIwlhecbRALkjq.jpg",
                "release_date": "2017-09-07",
                "title": "Papillon",
                "video": false,
                "vote_average": 7.324,
                "vote_count": 2031,
                "character": "Warden Barrot",
                "credit_id": "59b2228fc3a3682c2208f30d",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia.\n\nYorick van Wageningen (born 16 April 1964 in Baarn) is a Dutch actor.\n\nAfter acting in several Dutch plays, movies, and television series, van Wageningen was asked to come to Hollywood to appear in Steven Spielberg's Minority Report. Due to problems with his visa, he was unable to work on that movie in the United States. However, he has been acting in American movies ever since. His breakthrough hit was with his role in The Chronicles of Riddick, which earned him much praise by lead actor Vin Diesel. He has starred opposite Amanda Burton, Vin Diesel, Angelina Jolie, Judi Dench, Colin Farrell, Christian Bale, Christopher Plummer and Clive Owen.\n\nAfter he went to the United States he did not appear in any Dutch film until his return in 2008, starring in Oorlogswinter (Winter in Wartime), based on a famous Dutch children's book about World War II.\n\nDescription above from the Wikipedia article Yorick van Wageningen, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1964-04-16",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 31387,
        "imdb_id": "nm0905691",
        "known_for_department": "Acting",
        "name": "Yorick van Wageningen",
        "place_of_birth": "Baarn, Utrecht, Netherlands",
        "popularity": 0.3033,
        "profile_path": "/eh1UkiBszBbsfrkRYakOcnNcZ2.jpg"
    }
}