{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/v3ClsT59peXyGJ4XuDvIQAPwcZy.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 4133,
                "original_language": "en",
                "original_title": "Blow",
                "overview": "A boy named George Jung grows up in a struggling family in the 1950's. His mother nags at her husband as he is trying to make a living for the family. It is finally revealed that George's father cannot make a living and the family goes bankrupt. George does not want the same thing to happen to him, and his friend Tuna, in the 1960's, suggests that he deal marijuana. He is a big hit in California in the 1960's, yet he goes to jail, where he finds out about the wonders of cocaine. As a result, when released, he gets rich by bringing cocaine to America. However, he soon pays the price.",
                "popularity": 7.5894,
                "poster_path": "/yYZFVfk8aeMP4GxBSU9MTvqs9mJ.jpg",
                "release_date": "2001-04-04",
                "title": "Blow",
                "video": false,
                "vote_average": 7.358,
                "vote_count": 4439,
                "character": "Diego Delgado",
                "credit_id": "52fe43aec3a36847f806753b",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jordi Molla",
            "جوردی مویا"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nJordi Mollà Perales (born 1 July 1968) is a Spanish actor, filmmaker, writer and artist from Catalonia.\n\nMollà's artwork is represented in the Carmen De la Guerra Gallery in Madrid, Picasso Mio Gallery in Madrid and Barcelona and Cold Creation Gallery in Barcelona. In the summer of 2002, he exhibited in ARCO at the Carmen de la Guerra Gallery, along with a number of other artists.\n\nAs an actor, Mollà is most recognized in the United States for his role as Diego Delgado in Blow (Ted Demme, 2001), his debut Hollywood film. Mollà also has directed three films and written two books.\n\nBad Boys II co-star Gabrielle Union labeled Mollà as \"The Tom Cruise of Spain,\" when praising his charismatic performance as Johnny Tapia.\n\nDescription above from the Wikipedia article Jordi Mollà, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1968-07-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 31384,
        "imdb_id": "nm0003244",
        "known_for_department": "Acting",
        "name": "Jordi Mollà",
        "place_of_birth": " Barcelona, Catalonia, Spain",
        "popularity": 1.1017,
        "profile_path": "/2XEuPT0T9SRwcpsOXD9vMpm4Vad.jpg"
    }
}