{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jPdRlbRBHGl2POLLk6Oylbav7ac.jpg",
                "genre_ids": [
                    18,
                    36,
                    12
                ],
                "id": 9549,
                "original_language": "en",
                "original_title": "The Right Stuff",
                "overview": "As the Space Race ensues, seven pilots set off on a path to become the first American astronauts to enter space. However, the road to making history brings forth momentous challenges.",
                "popularity": 26.38,
                "poster_path": "/btqTjNRxecYgQ1FGfVlLqSSNjz.jpg",
                "release_date": "1983-10-20",
                "title": "The Right Stuff",
                "video": false,
                "vote_average": 7.432,
                "vote_count": 911,
                "character": "Pancho Barnes",
                "credit_id": "52fe4508c3a36847f80b8533",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/zP6pqpSRRiOCjjC5oWKZKkHqoSB.jpg",
                "genre_ids": [
                    18
                ],
                "id": 595,
                "original_language": "en",
                "original_title": "To Kill a Mockingbird",
                "overview": "Scout Finch, 6, and her older brother Jem live in sleepy Maycomb, Alabama, spending much of their time with their friend Dill and spying on their reclusive and mysterious neighbor, Boo Radley. When Atticus, their widowed father and a respected lawyer, defends a black man named Tom Robinson against fabricated rape charges, the trial and tangent events expose the children to evils of racism and stereotyping.",
                "popularity": 4.5981,
                "poster_path": "/gZycFUMLx2110dzK3nBNai7gfpM.jpg",
                "release_date": "1962-12-20",
                "title": "To Kill a Mockingbird",
                "video": false,
                "vote_average": 7.991,
                "vote_count": 2724,
                "character": "Scout as an Adult - Narrator (voice) (uncredited)",
                "credit_id": "55126e45c3a3681db200f6db",
                "order": 57
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Kim Stanley (February 11, 1925 – August 20, 2001) was an American actress, primarily in televsion and theatre, but with occasional film performances.\n\nShe began her acting career in theatre, and subsequently attended the Actors Studio in New York City, New York. She received the 1952 Theatre World Award for her role in The Chase (1952), and starred in the Broadway productions of Picnic (1953) and Bus Stop (1955). Stanley was nominated for the Tony Award for Best Performance by a Featured Actress in a Play for her roles in A Touch of the Poet (1959) and A Far Country (1962).\n\nDuring the 1950s, Stanley was a prolific performer in television, and later progressed to film, with a well-received performance in The Goddess (1959). She was the narrator of To Kill a Mockingbird (1962) and starred in Séance on a Wet Afternoon (1964), for which she won the New York Film Critics Circle Award for Best Actress and was nominated for the Academy Award for Best Actress. She was less active during the remainder of her career; two of her later film successes were as the mother of Frances Farmer in Frances (1982), for which she received a second Academy Award nomination as Best Supporting Actress, and as Pancho Barnes in The Right Stuff (1983). She received an Primetime Emmy Award for Outstanding Supporting Actress – Miniseries or a Movie for her performance as Big Mama in a television adaptation of Cat on a Hot Tin Roof (1985).\n\nShe did not act during her later years, preferring the role of teacher, in Los Angeles, California, and later Santa Fe, New Mexico, where she died in 2001, of uterine cancer.\n\nDescription above from the Wikipedia article Kim Stanley, licensed under CC-BY-SA,full list of contributors on Wikipedia.",
        "birthday": "1925-02-11",
        "deathday": "2001-08-20",
        "gender": 1,
        "homepage": null,
        "id": 31440,
        "imdb_id": "nm0822535",
        "known_for_department": "Acting",
        "name": "Kim Stanley",
        "place_of_birth": "Tularosa, New Mexico, USA",
        "popularity": 1.6144,
        "profile_path": "/1wiANedJx3tEvPYrVCTe3SW5Oag.jpg"
    }
}