{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2ytds3KqhMWRvMtrQp95JBYTKLD.jpg",
                "genre_ids": [
                    35,
                    27
                ],
                "id": 11797,
                "original_language": "en",
                "original_title": "Fright Night",
                "overview": "Charley Brewster, a high school student, accidentally discovers the true and creepy nature of Jerry Dandrige, his dashing and enigmatic new neighbor; but no one seems willing to believe him.",
                "popularity": 4.2897,
                "poster_path": "/euIh75MwNDrYkTEVSkw7VXWGXoE.jpg",
                "release_date": "1985-08-02",
                "title": "Fright Night",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 1451,
                "character": "Charley Brewster",
                "credit_id": "52fe44879251416c75037fbd",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            " Bill Ragsdale",
            "Robert William Ragsdale "
        ],
        "biography": "William Ragsdale (born Robert William Ragsdale) is an American actor. He graduated from Hendrix College in Conway, Arkansas studying religion and humanities. His parents gave him a graduation present in the form of tuition for the Drama Studio London’s American school at Berkeley, California.\n\nHe's known for playing teenaged vampire slayer Charley Brewster in the horror vampire film Fright Night. He also garnered attention onstage in Neil Simon's plays, Biloxi Blues and Brighton Beach Memoirs, two of the three parts of Simon's trilogy, which ends with Broadway Bound.\n\nHe starred in the romance comedy movie Mannequin Two: On the Move (1991). He featured for three years as Herman Brooks in the series Herman's Head, had a brief recurring role in the television series Judging Amy, and played television producer Rob Fields on the series Grosse Pointe, which lasted one season.\n\nHe starred in the short-lived sitcom Brother's Keeper, and appeared on Ellen as the boyfriend of Ellen Morgan (played by Ellen DeGeneres) before her character revealed her homosexuality.\n\nHe's had numerous guest roles on television throughout the years, including multi-episode stints on Less than Perfect, Necessary Roughness, Mistresses, Search Party, and Younger, as well as small feature movie roles.\n\nHe played the role of Gary Hawkins in 12 episodes of the drama series Justified, during the series' first three seasons. In 2014, he played Chris Smith in the remake of the movie Left Behind.",
        "birthday": "1961-01-19",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 31467,
        "imdb_id": "nm0706619",
        "known_for_department": "Acting",
        "name": "William Ragsdale",
        "place_of_birth": "El Dorado, Arkansas, USA",
        "popularity": 0.3569,
        "profile_path": "/5r57ufMsAqEUSiymqYQASpSAXU8.jpg"
    }
}