{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jZ2o6ltHNEDCWwe4CQotow8l5YP.jpg",
                "genre_ids": [
                    16,
                    10751,
                    35
                ],
                "id": 15165,
                "original_language": "en",
                "original_title": "Barbie as The Princess & the Pauper",
                "overview": "In her first animated musical featuring seven original songs, Barbie comes to life in this modern re-telling of a classic tale of mistaken identity and the power of friendship. Based on the story by Mark Twain.",
                "popularity": 4.9944,
                "poster_path": "/xHYsUwUe4MaNc6mbNBGTkqZSnPk.jpg",
                "release_date": "2004-09-28",
                "title": "Barbie as The Princess & the Pauper",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 1512,
                "character": "Minister (voice)",
                "credit_id": "64227c8d08cf8700a015c06a",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "I started my career in audio in 1971 as a staff engineer at Eastern Sound in Toronto.\n\nEastern Sound was the first 24-track studio in Canada, which specialized in corporate and domestic music recording with artists like Anne Murray and Gordon Lightfoot. It was at this time that I developed a specific interest in surround sound recording and mixing for the then newly developed IMAX projection and sound systems.\n\nIn 1974 I moved to Vancouver, Canada, and was hired at Little Mountain Sound Studios eventually making chief engineer and remained for 17 years. My forte during this time was recording 'middle of the road' big bands and orchestral music. We were early pioneers in locking ¾ inch videotape with multi track audio machines. In 1987 I ventured into recording, editing and manipulation of audio on the first ever made hard disk based, digital audio workstations.\n\nI opened my own \"Dick & Roger's Sound Studios\" in 1990 and have been a leader in the digital post-production studio market place. With focus serving the corporate, television and motion picture industries. The studios have delivered hundreds of hours of broadcast and direct-to-DVD products.\n\nI have recorded practically all types of music; everything from country & western to big band, bag pipe bands to choral groups, rock & roll to large orchestras. I have produced thousands of corporate and promotional projects, for exhibitions, theatre, television and stage shows and dozens of motion picture scores. I have been very lucky, was given a Grammy award for my work with Michael Buble and am a member of the Cinema Audio Society.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 3147253,
        "imdb_id": "nm0598237",
        "known_for_department": "Acting",
        "name": "Roger Monk",
        "place_of_birth": null,
        "popularity": 0.0071,
        "profile_path": null
    }
}