{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/354kfjVb96mtFALMhBE6jzHGiA2.jpg",
                "genre_ids": [
                    10752,
                    18
                ],
                "id": 975,
                "original_language": "en",
                "original_title": "Paths of Glory",
                "overview": "A commanding officer defends three scapegoats on trial for a failed offensive that occurred within the French Army in 1916.",
                "popularity": 3.4471,
                "poster_path": "/hGg1UCQSHlXfv2HI9bDHT2OQBam.jpg",
                "release_date": "1957-10-25",
                "title": "Paths of Glory",
                "video": false,
                "vote_average": 8.3,
                "vote_count": 3091,
                "character": "Sgt. Boulanger",
                "credit_id": "52fe4295c3a36847f8029f45",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/gkXL5ka6ciU4A4KYSvLIAXtvh7k.jpg",
                "genre_ids": [
                    53,
                    18,
                    27
                ],
                "id": 10242,
                "original_language": "en",
                "original_title": "What Ever Happened to Baby Jane?",
                "overview": "A former child star torments her paraplegic sister in their decaying Hollywood mansion.",
                "popularity": 3.7595,
                "poster_path": "/msGYzyWwtjAaA3DScdgmvJ5MReG.jpg",
                "release_date": "1962-10-31",
                "title": "What Ever Happened to Baby Jane?",
                "video": false,
                "vote_average": 7.904,
                "vote_count": 1103,
                "character": "Ben Golden",
                "credit_id": "52fe43489251416c7500a669",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "​From Wikipedia, the free encyclopedia.  \n\nBert Freed (November 3, 1919 — August 2, 1994) was a prolific American character actor, voice over actor, and the first actor to portray \"Detective Columbo\" on television.\n\nBorn and raised in The Bronx, New York, Freed began acting while attending Penn State University, and made his Broadway debut in 1942. Following World War II Army service in the European Theatre, he appeared in the Broadway musical The Day Before Spring in 1945 and dozens of television shows between 1947 and 1985. His film debut occurred, oddly enough, in a musical Carnegie Hall (1947). A prominent role was as the villainous Ryker in the television series Shane, in which Freed added a unique touch of realism by beginning the show clean-shaven and growing a beard from one week to the next, never shaving again through the season.\n\nFreed played Columbo in a live 1960 episode of the \"Chevy Mystery Theatre\" seven years before Peter Falk played the role. Thomas Mitchell also played the part on stage prior to Falk's version, which is probably where many of the eccentric Columbo traits originated; only a few were visible in Freed's straightforward interpretation, although the character as played by Freed is recognizably Columbo.\n\nHe appeared (sometimes more than once) in television shows such as The Rifleman, Bonanza, Gunsmoke, The Big Valley,The Virginian, Mannix, Barnaby Jones, Charlie's Angels, Then Came Bronson, Run For Your Life, Get Smart, The Lucy Show, Hogan's Heroes, Voyage to the Bottom of the Sea, Dr. Kildare, Ben Casey, Perry Mason, Combat!, Petticoat Junction, The Outer Limits, Alfred Hitchcock Presents, Route 66, Ironside, The Green Hornet, The Munsters, and many, many more. He directed one episode of T.H.E. Cat.\n\nFreed appeared as a racist club owner in No Way Out (1950), a gangster in Ma and Pa Kettle Go to Town (1950), a Marine private in Halls of Montezuma (1951 film), an Army sergeant in Take the High Ground! (1953), the Police Chief in Invaders From Mars (1953), Sgt. Boulanger in Paths of Glory (1957), the hangman in Hang 'Em High (1968), Max's father in Wild in the Streets (1968), as Chief of Detectives in Madigan (1968), a homosexual prison guard in There Was a Crooked Man... (1970) and Bernard's father in Billy Jack (1971) in which he got \"whumped\" on the side of the face by Billy Jack's right foot \"just for the hell of it.\"\n\nHe retired from acting in 1986, and died of a heart attack in Canada in 1994 while on a fishing trip with his son.\n\nDescription above from the Wikipedia article Bert Freed,  licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1919-11-03",
        "deathday": "1994-08-02",
        "gender": 2,
        "homepage": null,
        "id": 31503,
        "imdb_id": "nm0293099",
        "known_for_department": "Acting",
        "name": "Bert Freed",
        "place_of_birth": "The Bronx, New York USA",
        "popularity": 0.4134,
        "profile_path": "/2TLuIMSx3NaCgfhoQBsicbdEIBE.jpg"
    }
}