{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/vKgsqmYHdNjtyhQIUjXW88IPeI.jpg",
                "genre_ids": [
                    18,
                    10770
                ],
                "id": 3293,
                "original_language": "en",
                "original_title": "Pirates of Silicon Valley",
                "overview": "The story about the men who made the world of technology what it is today, their struggles during college, the founding of their companies, and the ingenious actions they took to build up the global corporate empires of Apple Computer Inc. and Microsoft Corporation.",
                "popularity": 2.1459,
                "poster_path": "/ojebuTEgKU332KstOcE1B7nGBzi.jpg",
                "release_date": "1999-06-20",
                "title": "Pirates of Silicon Valley",
                "video": false,
                "vote_average": 7.075,
                "vote_count": 566,
                "character": "Ridley Scott",
                "credit_id": "52fe4390c3a36847f805dbe1",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/kPlCjRGUv5okUM8Zsa3xE0sSJHI.jpg",
                "genre_ids": [
                    18
                ],
                "id": 17443,
                "original_language": "en",
                "original_title": "...And Justice for All",
                "overview": "An ethical Baltimore defense lawyer disgusted with rampant legal corruption is forced to defend a judge he despises in a rape trial under the threat of being disbarred.",
                "popularity": 1.4873,
                "poster_path": "/AiAXiqN883MYQMzxeEzAtV9jkU0.jpg",
                "release_date": "1979-10-19",
                "title": "...And Justice for All",
                "video": false,
                "vote_average": 7.062,
                "vote_count": 548,
                "character": "Driver",
                "credit_id": "672ff7263c104d88bdc5a918",
                "order": 32
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "John Hertzle",
            "Garman Hertzler"
        ],
        "biography": "John Garman Hertzler Jr. (born March 18, 1950, in Savannah, Georgia) is an American actor, author, screenwriter, and activist best known for his role as the Klingon General (later Chancellor) Martok on Star Trek: Deep Space Nine, a role he played from 1995 until the series ended in 1999.\n\nHertzler began his acting career in the 1970s, primarily in stage acting and some films, eventually guest-starring in TV shows before landing a major role in the 1990s series Zorro as Alcalde Ignacio De Soto. Beyond Deep Space Nine, he appeared in several other Star Trek shows, wrote two Star Trek novels, and frequently appeared at science fiction conventions.\n\nHe grew up mostly around Washington, D.C., attended Bucknell University (earning a degree in political science), pursued a master's in set design at the University of Maryland, and even attended law school briefly. His early career included theater in Washington, New York, San Francisco, and Southern California, with roles spanning Shakespeare and other dramatic works, as well as some film appearances.\n\nHertzler lives in the Finger Lakes region of New York, where he has lectured at Cornell University’s theater department and has been active in local politics and writing screenplays.\n\nHis filmography includes notable appearances outside of Star Trek, such as Quantum Leap, Zorro, Highlander, and others.",
        "birthday": "1949-03-18",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 31527,
        "imdb_id": "nm0381117",
        "known_for_department": "Acting",
        "name": "J.G. Hertzler",
        "place_of_birth": null,
        "popularity": 0.267,
        "profile_path": "/tFXm0QBvm3KfIBEvkzVa5c8pgPD.jpg"
    }
}