{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rpsHpJj7FgnNBXhaO2KFthPwqH6.jpg",
                "genre_ids": [
                    10749,
                    18,
                    35
                ],
                "id": 200727,
                "original_language": "en",
                "original_title": "Love, Rosie",
                "overview": "Since the moment they met at age 5, Rosie and Alex have been best friends, facing the highs and lows of growing up side by side. A fleeting shared moment, one missed opportunity, and the decisions that follow send their lives in completely different directions. As each navigates the complexities of life, love, and everything in between, they always find their way back to each other - but is it just friendship, or something more?",
                "popularity": 5.8942,
                "poster_path": "/8Mf9GgyNv5jjLAAPGsom9skH2Du.jpg",
                "release_date": "2014-10-16",
                "title": "Love, Rosie",
                "video": false,
                "vote_average": 7.819,
                "vote_count": 6361,
                "character": "Rosie's Friend",
                "credit_id": "60ee43c0706e56005d5a4e66",
                "order": 26
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Bobby Aherne is a writer, composer & producer based in Brisbane, Australia. He holds a degree in Music Technology & English from N.U.I. Maynooth and creates music as \"No Monster Club\" - a prolific, critically acclaimed art-pop act that has toured all over the world. As a core member of Ireland's treasured 'Popical Island' collective, he has contributed to a number of other musical acts including Grand Pocket Orchestra, Ginnels, Women's Christmas, Dublin Duck Dispensary & Paddy Hanna. Aside from music, he is the author of the book 'D'You Remember Yer Man? A Portrait of Dublin's Famous Characters', published by New Island Books. In 2018, he co-wrote, composed and sound-designed the musical 'Trial of the Centurys', which enjoyed a sold-out run in Project Arts Centre as part of Dublin Fringe Festival. As well as having served as the resident sound designer at Dublin's National Leprechaun Museum, he has contributed music to brand campaigns for the likes of Skullcandy and Virgin Media, in addition to movies such as 'NOW' (Riley Blakeway, 2010), 'Famous Nathan' (Lloyd Handwerker, 2014), 'Pussywillow Dirtbags' (Pedro Delbrey, 2015), 'The Middle Finger' (Séamus Hanly, 2016) and 'Damo & Ivor: The Movie' (Rob & Ronan Burke, 2018). He has also created theme tunes, jingles and incidental music - most recently for popular podcast 'The Alison Spittle Show' (Headstuff), and radio sitcom 'The Captain' (Ocean FM).",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 3157089,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Bobby Aherne",
        "place_of_birth": null,
        "popularity": 0.0143,
        "profile_path": null
    }
}