{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5zTwAcnI3zCJ0mucPPnoBtkSWEV.jpg",
                "genre_ids": [
                    35,
                    10749,
                    80
                ],
                "id": 239,
                "original_language": "en",
                "original_title": "Some Like It Hot",
                "overview": "Two musicians witness a mob hit and struggle to find a way out of the city. Their only opportunity comes in the form of joining an all-girl band as they prepare to leave on a tour. The two disguise themselves as women and struggle to keep their identities secret as they deal with the problems this brings.",
                "popularity": 6.0458,
                "poster_path": "/hVIKyTK13AvOGv7ICmJjK44DTzp.jpg",
                "release_date": "1959-03-19",
                "title": "Some Like It Hot",
                "video": false,
                "vote_average": 8.096,
                "vote_count": 3670,
                "character": "Little Bonaparte",
                "credit_id": "52fe422bc3a36847f800944f",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/e0tZ5Kjg5mukFGcxEddCZymAxH4.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 22527,
                "original_language": "en",
                "original_title": "The Wrong Man",
                "overview": "In 1953, an innocent man named Christopher Emmanuel \"Manny\" Balestrero is arrested after being mistaken for an armed robber.",
                "popularity": 2.3417,
                "poster_path": "/pO5XR2R56RAbVjdks9gGGn0fbOa.jpg",
                "release_date": "1956-12-22",
                "title": "The Wrong Man",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 583,
                "character": "Gene Conforti",
                "credit_id": "52fe4444c3a368484e0196bf",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/rBqdcQeM1h05YjF9rFtPWnNaDO2.jpg",
                "genre_ids": [
                    18
                ],
                "id": 11051,
                "original_language": "en",
                "original_title": "The Last Temptation of Christ",
                "overview": "Jesus, a humble Judean carpenter beginning to see that he is the son of God, is drawn into revolutionary action against the Roman occupiers by Judas -- despite his protestations that love, not violence, is the path to salvation. The burden of being the savior of mankind torments Jesus throughout his life, leading him to doubt.",
                "popularity": 3.0063,
                "poster_path": "/7L4qwrC1mipZXJfU5oRgQWChLv1.jpg",
                "release_date": "1988-05-28",
                "title": "The Last Temptation of Christ",
                "video": false,
                "vote_average": 7.228,
                "vote_count": 1125,
                "character": "Rabbi",
                "credit_id": "6432bd879a6435065eade282",
                "order": 23
            },
            {
                "adult": false,
                "backdrop_path": "/pxkQAIhC7LXN5s5B23lnvCMgva5.jpg",
                "genre_ids": [
                    80,
                    18,
                    10749
                ],
                "id": 654,
                "original_language": "en",
                "original_title": "On the Waterfront",
                "overview": "A prizefighter-turned-longshoreman with a conscience goes up against labor leaders to expose corruption, extortion, and murder among the union ranks.",
                "popularity": 5.1767,
                "poster_path": "/fKjLZy9W8VxMOp5OoyWojmLVCQw.jpg",
                "release_date": "1954-06-22",
                "title": "On the Waterfront",
                "video": false,
                "vote_average": 7.882,
                "vote_count": 1669,
                "character": "Cab Driver (uncredited)",
                "credit_id": "53124bbc9251411008002a50",
                "order": 25
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Nehemiah Persoff (born August 2, 1919) was a former American film and television character actor. He was born in Jerusalem, Palestine Mandate.\n\nBorn in what is now part of Israel, Persoff emigrated with his family to the United States in 1929. He began to take an interest in acting in the 1940s, and after serving in the Army during World War II, he began to pursue his acting career in the New York Theater. In 1947, he was accepted into the Actor's Studio and eventually began appearing in films.\n\nHis film credits include: On the Waterfront, Some Like It Hot, Al Capone, The Greatest Story Ever Told, Voyage of the Damned, The Comancheros, Yentl (portraying Barbra Streisand's character's father), Twins and the American Tail (animated-film series) (voiced, \"Papa Mousekewitz\").\n\nPersoff appeared in such television series as, Five Fingers (\"The Moment of Truth\"), The Big Valley (\"Legend of a General\", Parts I & II, episode), The Twilight Zone (\"Judgment Night\" episode), Alfred Hitchcock Presents (\"Heart of Gold\" episode), The Untouchables, Naked City, The Legend of Jesse James, Gunsmoke, The Wild Wild West, Hawaii Five-O, Ellery Queen (\"The Adventure of the Pharaoh's Curse\" episode), Mission: Impossible (3 episodes), Adam-12 (\"Vendetta\" episode), Charlie's Angels, Hunter, Columbo, Star Trek: The Next Generation, Magnum, P.I., Law & Order and Chicago Hope.\n\nIn the mid-1980s, Persoff began to pursue painting, specializing in watercolour. This was at a time when health problems forced him to decrease his acting workload.\n\nDescription above from the Wikipedia article Nehemiah Persoff, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1919-08-02",
        "deathday": "2022-04-05",
        "gender": 2,
        "homepage": null,
        "id": 3160,
        "imdb_id": "nm0675490",
        "known_for_department": "Acting",
        "name": "Nehemiah Persoff",
        "place_of_birth": "Jerusalem, Palestine Mandate",
        "popularity": 0.6031,
        "profile_path": "/vJoqhr7HVxP9HLTqt2rxo5OsSvq.jpg"
    }
}