{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7Nwnmyzrtd0FkcRyPqmdzTPppQa.jpg",
                "genre_ids": [
                    80,
                    18,
                    35
                ],
                "id": 106646,
                "original_language": "en",
                "original_title": "The Wolf of Wall Street",
                "overview": "A New York stockbroker refuses to cooperate in a large securities fraud case involving corruption on Wall Street, corporate banking world and mob infiltration. Based on Jordan Belfort's autobiography.",
                "popularity": 27.2678,
                "poster_path": "/kW9LmvYHAaS9iA0tHmZVq8hQYoq.jpg",
                "release_date": "2013-12-25",
                "title": "The Wolf of Wall Street",
                "video": false,
                "vote_average": 8.028,
                "vote_count": 24976,
                "character": "Job Applicant #2",
                "credit_id": "6539913367825900adffafe5",
                "order": 107
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Justin Anthony Long is an award winning writer, songwriter, and performer. Whether doing triple duty or working with collaborators, inclusion, diversity, and Queer joy are paramount to his work. His musical multi-cam sitcom pilot was a Finalist at the 2023 Raindance Film Festival in London and his debut pop song, “Gone Forgotten Year,” was an Official Selection of the 2022 Tribeca Film Festival. Justin’s short musicals, Cookie Soirée, Mission to the Moon, and Big Ass Secret are available to license from Music Theatre International & Theatre Now. His musical theatre and comedy screenwriting work was selected by Stephen Schwartz for the prestigious ASCAP/DreamWorks Musical Theatre Workshop at the Wallis Annenberg Center, is a two time Best Musical Audience Choice Award Winner at the NYC Sound Bites Festival, Finalist for the 2023 Rhinebeck Writers Retreat, was featured in the NY Times, USA Today, and IndieWire and won LiveReadLA. Justin enjoys writing solo and with collaborators. Some collaborators include Jonny Lee Jr., Ge Enrique, Joanna Burns, Joël René Scoville, Ari Frenkel, and Noah Prizant.  ​\n\nOnstage, Justin has performed at CTG’s Kirk Douglas Theatre, La Mirada Theatre, 3-D Theatricals, For the Record, The Maltz Jupiter, Transcendence, and the Upright Citizens Brigade. On screen, Justin has appeared in Martin Scorsese’s The Wolf of Wall Street, the indie film Pluto, and the musical web comedy, City of Dreams. He is a member of ASCAP, The Dramatists Guild, and Actors’ Equity Association",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.justinanthonylong.com",
        "id": 3162642,
        "imdb_id": "nm5370181",
        "known_for_department": "Acting",
        "name": "Justin Anthony Long",
        "place_of_birth": "Paramus, New Jersey, United States",
        "popularity": 0.0143,
        "profile_path": "/m72uELld7zTjTPrk7tNSm0kDHBo.jpg"
    }
}