{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qwZRvb0DJ5IwDoRuKDRCBuHWzkw.jpg",
                "genre_ids": [
                    878,
                    53,
                    18
                ],
                "id": 828,
                "original_language": "en",
                "original_title": "The Day the Earth Stood Still",
                "overview": "An alien and a robot land on Earth after World War II and tell mankind to be peaceful or face destruction.",
                "popularity": 2.4402,
                "poster_path": "/eslDNzf0LF1m9GsgUXlmyfTcC6Y.jpg",
                "release_date": "1951-09-28",
                "title": "The Day the Earth Stood Still",
                "video": false,
                "vote_average": 7.448,
                "vote_count": 1169,
                "character": "Bobby Benson",
                "credit_id": "52fe427dc3a36847f8022c1f",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/OfH6y4NfYpzHcA67nwT5TjhSzJ.jpg",
                "genre_ids": [
                    18,
                    10749,
                    9648
                ],
                "id": 17057,
                "original_language": "en",
                "original_title": "In a Lonely Place",
                "overview": "A violent screenwriter and a female neighbor fall in love after she clears him of murder, but she begins to have second thoughts.",
                "popularity": 2.1395,
                "poster_path": "/vbdgtwzLOpE6MppZlyYChMagvQq.jpg",
                "release_date": "1950-05-17",
                "title": "In a Lonely Place",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 619,
                "character": "Young Boy Seeking Autograph (uncredited)",
                "credit_id": "630e618c54508d007adda1bf",
                "order": 27
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "William Thomas Gray",
            "Billie Gray",
            "Bill Gray",
            "William Gray"
        ],
        "biography": "Billy Gray (born January 13, 1938) is an American actor best known for his role as Bud Anderson on the classic television sitcom *Father Knows Best* (1954–1960). His career spans both film and television, and he became a prominent figure in 1950s and 1960s American entertainment.\n\nBilly Gray was born in Los Angeles, California. He began his acting career at a young age, appearing in commercials and small roles on television. His early experiences in the entertainment industry led to more significant roles in both film and television.\n\nGray’s big break came when he was cast as Bud Anderson, the teenage son of Jim and Margaret Anderson, on *Father Knows Best*. The show, which ran for six seasons, was a family-oriented sitcom that became one of the most beloved TV shows of its time. As Bud, Gray portrayed the typical all-American teen of the 1950s, and his performance made him a household name. His portrayal of the character earned him recognition and a lasting place in the hearts of TV viewers.\n\nIn addition to his work on *Father Knows Best*, Billy Gray appeared in a variety of other television series and films. His film career included roles in movies such as *The Day the Earth Stood Still* (1951), *Kiss Me Deadly* (1955), and *The Lone Ranger* (1956). He also appeared in several TV dramas and variety shows, showcasing his versatility as an actor.\n\nFollowing the end of *Father Knows Best* in 1960, Gray’s acting career slowed down. While he appeared in occasional roles on TV shows and films, he transitioned into a variety of other professions, including running a successful business.\n\nBilly Gray's personal life was relatively low-key. He had a passion for motorcycles and racing, which he pursued after his acting career began to wind down. Gray also became involved in the antique business, eventually opening his own store specializing in rare and collectible items.\n\nAs of now, Billy Gray is still alive and living a quiet life, away from the public eye. He occasionally makes appearances at fan conventions and has expressed gratitude for his time on *Father Knows Best* and his place in TV history.",
        "birthday": "1938-01-13",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.billygray.com/",
        "id": 3162,
        "imdb_id": "nm0336474",
        "known_for_department": "Acting",
        "name": "Billy Gray",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.8332,
        "profile_path": "/vLSDyF8p3arQOvqfPOpbveSeXny.jpg"
    }
}