{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kGzFbGhp99zva6oZODW5atUtnqi.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 240,
                "original_language": "en",
                "original_title": "The Godfather Part II",
                "overview": "In the continuing saga of the Corleone crime family, a young Vito Corleone grows up in Sicily and in 1910s New York. In the 1950s, Michael Corleone attempts to expand the family business into Las Vegas, Hollywood and Cuba.",
                "popularity": 16.2247,
                "poster_path": "/hek3koDUyRQk7FIhPXsa6mT2Zc3.jpg",
                "release_date": "1974-12-20",
                "title": "The Godfather Part II",
                "video": false,
                "vote_average": 8.57,
                "vote_count": 13188,
                "character": "Hyman Roth",
                "credit_id": "52fe422bc3a36847f800951d",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/kPlCjRGUv5okUM8Zsa3xE0sSJHI.jpg",
                "genre_ids": [
                    18
                ],
                "id": 17443,
                "original_language": "en",
                "original_title": "...And Justice for All",
                "overview": "An ethical Baltimore defense lawyer disgusted with rampant legal corruption is forced to defend a judge he despises in a rape trial under the threat of being disbarred.",
                "popularity": 1.5828,
                "poster_path": "/AiAXiqN883MYQMzxeEzAtV9jkU0.jpg",
                "release_date": "1979-10-19",
                "title": "...And Justice for All",
                "video": false,
                "vote_average": 7.07,
                "vote_count": 546,
                "character": "Grandpa Sam",
                "credit_id": "52fe47269251416c7508f50d",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "​From Wikipedia, the free encyclopedia.  \n\nLee Strasberg (November 17, 1901 – February 17, 1982) was an American actor, director and acting teacher.  He cofounded, with directors Harold Clurman and Cheryl Crawford, the Group Theatre in 1931, which was hailed as \"America's first true theatrical collective\".  In 1951, he became director of the non-profit Actors Studio, in New York City, considered \"the nation's most prestigious acting school\".  In 1969, Strasberg founded the Lee Strasberg Theatre and Film Institute in New York City and in Hollywood to teach the work he pioneered. He is considered the \"father of method acting in America,\" according to author Mel Gussow, and from the 1920s until his death in 1982 \"he revolutionized the art of acting by having a profound influence on performance in American theater and movies\".  From his base in New York, he trained several generations of theatre and film's most illustrious talents, including Anne Bancroft, Dustin Hoffman, Montgomery Clift, Marlon Brando, James Dean, Marilyn Monroe, Julie Harris, Paul Newman, Al Pacino, Robert De Niro and director Elia Kazan.  Former student Elia Kazan directed James Dean in East of Eden (1955), for which Kazan and Dean were nominated for Academy Awards. As a student, Dean wrote that Actors Studio was \"the greatest school of the theater [and] the best thing that can happen to an actor\".  Playwright Tennessee Williams, writer of A Streetcar Named Desire, said of Strasberg's actors, \"They act from the inside out. They communicate emotions they really feel. They give you a sense of life.\" Directors like Sidney Lumet, a former student, have intentionally used actors skilled in Strasberg's \"Method\".  Kazan, in his autobiography, wrote, \"He carried with him the aura of a prophet, a magician, a witch doctor, a psychoanalyst, and a feared father of a Jewish home.... [H]e was the force that held the thirty-odd members of the theatre together, and made them 'permanent.'\"  :61 Today, Ellen Burstyn, Al Pacino, and Harvey Keitel lead this nonprofit studio dedicated to the development of actors, playwrights, and directors.\n\nDescription above from the Wikipedia article Lee Strasberg, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1901-09-17",
        "deathday": "1982-02-17",
        "gender": 2,
        "homepage": null,
        "id": 3171,
        "imdb_id": "nm0833448",
        "known_for_department": "Acting",
        "name": "Lee Strasberg",
        "place_of_birth": "Budzanów, Austria-Hungary",
        "popularity": 0.3238,
        "profile_path": "/niSM7ejzddgaTcxjgJMYEFCr9Y2.jpg"
    }
}