{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6zIOO1NrTehQkDaNfvga4luSRQc.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 1548,
                "original_language": "en",
                "original_title": "Ghost World",
                "overview": "Two quirky, cynical teenaged girls try to figure out what to do with their lives after high school graduation. After they play a prank on an eccentric, middle aged record collector, one of them befriends him, which causes a rift in the girls’ friendship.",
                "popularity": 2.2936,
                "poster_path": "/uwKqnUPE4dSM0kKuMW0vXpURh2T.jpg",
                "release_date": "2001-07-20",
                "title": "Ghost World",
                "video": false,
                "vote_average": 7.08,
                "vote_count": 1490,
                "character": "Dana",
                "credit_id": "52fe42fcc3a36847f8031e31",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/syapU4X3vYBCdARyAOtz3g90hMt.jpg",
                "genre_ids": [
                    53,
                    18,
                    80
                ],
                "id": 1900,
                "original_language": "en",
                "original_title": "Traffic",
                "overview": "An exploration of the United States of America's war on drugs from multiple perspectives. For the new head of the Office of National Drug Control Policy, the war becomes personal when he discovers his well-educated daughter is abusing cocaine within their comfortable suburban home. In Mexico, a flawed, but noble policeman agrees to testify against a powerful general in league with a cartel, and in San Diego, a drug kingpin's sheltered trophy wife must learn her husband's ruthless business after he is arrested, endangering her luxurious lifestyle.",
                "popularity": 4.9867,
                "poster_path": "/v6YrfR1e2OUAYbXrJ7hv3EiGNcg.jpg",
                "release_date": "2000-12-27",
                "title": "Traffic",
                "video": false,
                "vote_average": 7.081,
                "vote_count": 2261,
                "character": "Helena's Friend",
                "credit_id": "52fe431fc3a36847f803c187",
                "order": 58
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nStacey Travis (born August 29, 1966) is an American actress whose films include Earth Girls Are Easy (1988), Hardware (1990), The Super (1991), Traffic (2000), and Ghost World (2001).\n\nTravis starred on the comedy television series Just Say Julie from 1989–1992 where she played a variety of characters. She also starred on the short-lived 1998 television series The Love Boat: The Next Wave as \"Cruise Director Suzanne Zimmerman\".\n\nTravis has made guest appearances on US TV shows, including Diagnosis Murder, ER, Desperate Housewives, Picket Fences, Angel as \"Senator Helen Brucker\" in season 5, and Highlander: The Series as \"Renee Delaney\" in the season 2 episodes \"Unholy Alliance\" Part 1 and Part 2, returning in season 4 in the episode \"Double Jeopardy\". She also played Spencer's mom in Good Luck Charlie.\n\nShe attended the London Academy of Music and Dramatic Arts and graduated from USC with a degree in film.\n\nHer brother is actor and comedian Greg Travis.",
        "birthday": "1964-08-29",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 31714,
        "imdb_id": "nm0006826",
        "known_for_department": "Acting",
        "name": "Stacey Travis",
        "place_of_birth": "Dallas, Texas, USA",
        "popularity": 0.7182,
        "profile_path": "/hVuilLYZlGkZFoAXQaNaCywaGih.jpg"
    }
}