{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/42gqGeyXh4caHP19Tqf8DMRgc7r.jpg",
                "genre_ids": [
                    35,
                    10749,
                    18
                ],
                "id": 556678,
                "original_language": "en",
                "original_title": "Emma.",
                "overview": "In 1800s England, a well-meaning but selfish young woman meddles in the love lives of her friends.",
                "popularity": 3.7479,
                "poster_path": "/uHpHzbHLSsVmAuuGuQSpyVDZmDc.jpg",
                "release_date": "2020-02-13",
                "title": "Emma.",
                "video": false,
                "vote_average": 7.019,
                "vote_count": 1848,
                "character": "John Knightley",
                "credit_id": "5e48502c1e9225001dc0a7f2",
                "order": 36
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Oliver Graham Chris is an English actor. He has appeared in television series, TV films, and on the stage. His work has included theatrical productions in London's West End and New York City's Broadway.\n\nChris was born in Royal Tunbridge Wells, Kent, on 7 November 1978. He passed his eleven-plus exam and attended Tunbridge Wells Grammar School for Boys before moving to the Michael Hall Steiner School in his fourth year. He later graduated from the Royal Central School of Speech and Drama. In 2005, he completed an evening class at Birkbeck College and was subsequently accepted for a degree course in history, politics and philosophy.\n\nChris has appeared in several comedy series, including The Office, Green Wing, According to Bex, Nathan Barley, The IT Crowd, Rescue Me and Bluestone 42.\n\nIn 2004, Chris re-wrote the lyrics to the Beatles' \"Let It Be\" to a song about the England football player Wayne Rooney and recorded it in collaboration with the actor Stephen Campbell Moore and a number of other actors and journalists. The song was reprised and re-recorded, with rewritten lyrics, for the 2006 Fifa World Cup and became a hit on YouTube, with 200,000 views.\n\nChris has also narrated most of the Alex Rider series of audiobooks by Anthony Horowitz, although Dan Stevens replaced him as reader for Snakehead, Crocodile Tears and Scorpia Rising.\n\nIn early 2006, Chris played the role of Captain Leonard in Sharpe's Challenge, starring Sean Bean, while 2007 saw him in the TV comedy Bonkers, written by Sally Wainwright as well as Petruchio in The Taming of the Shrew at the Wilton's Music Hall. In 2006, he also appeared as Christian in Cyrano de Bergerac at the Royal Exchange Theatre, Manchester. He later appeared in Peter Hall's production of The Portrait of a Lady. He made his West End debut in late 2008 in Lisa Kron's comedy, Well. In 2010, he appeared alongside Judi Dench in Hall's production of A Midsummer Night's Dream at the Rose Theatre, Kingston.\n\nChris was cast in Ben Miller's feature-length debut comedy film Huge, which premiered in June 2010. In 2011, saw him appear in two episodes of Silent Witness, whilst also playing one of the leading roles in the National Theatre production of One Man, Two Guvnors alongside James Corden. He appeared in three series of the BBC Three comedy Bluestone 42, about a British bomb disposal detachment in Afghanistan. He also played Dr Richard Truscott in the ITV medical drama series Breathless, set in the 1960s, which ran for one series from October 2013.\n\nFrom 2014 to 2016, Chris played Prince William in the play King Charles III, appearing in the West End and on Broadway. In May 2017, he appeared in the same role in the BBC Two film adaptation.",
        "birthday": "1978-11-02",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.knighthallagency.com/client/oliver-chris/",
        "id": 31739,
        "imdb_id": "nm0159631",
        "known_for_department": "Acting",
        "name": "Oliver Chris",
        "place_of_birth": "Tunbridge Wells, Kent, England, UK",
        "popularity": 0.4068,
        "profile_path": "/xTnUMtP5MREaHD86XfJ5mYibawq.jpg"
    }
}