{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6M2IeELPSKZZ4iAPz2w0i7wdm6X.jpg",
                "genre_ids": [
                    80,
                    53
                ],
                "id": 3432,
                "original_language": "en",
                "original_title": "Mr. Brooks",
                "overview": "A psychological thriller about a man who is sometimes controlled by his murder-and-mayhem-loving alter ego.",
                "popularity": 2.5607,
                "poster_path": "/yYleq0qmb67Ig2ViY3hFmUOrH77.jpg",
                "release_date": "2007-05-31",
                "title": "Mr. Brooks",
                "video": false,
                "vote_average": 6.935,
                "vote_count": 1774,
                "character": "Jane Brooks",
                "credit_id": "52fe4393c3a36847f805ef5d",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Danielle Nicole Panabaker ",
            "Ντανιέλ Νικόλ Παναμπέικερ",
            "다니엘 파나베이커",
            "แดเนียลล์ ปานาบาเกอร์",
            "Даніель Панабейкер",
            "دنیل پنبیکر"
        ],
        "biography": "Danielle Nicole Panabaker (born September 19, 1987) is an American actress. She began acting as a teenager and came to prominence for her roles in the Disney films Stuck in the Suburbs (2004), Sky High (2005) and Read It and Weep (2006), and in the HBO miniseries Empire Falls (2005). She won three Young Artist Awards: for guest-starring in an episode of the legal drama television series The Guardian (2004), for her lead role in the TV film Searching for David's Heart (2005) and for her ensemble performance in the family comedy film Yours, Mine & Ours (2005).\n\nPanabaker came to wider attention as a cast member in the CBS legal drama series Shark (2006–2008) and is also noted as a scream queen, having starred in the psychological thriller Mr. Brooks (2007) and the horror films Friday the 13th (2009), The Crazies (2010), John Carpenter's The Ward (2010) and Piranha 3DD (2012).\n\nAfter starring in recurring roles on Necessary Roughness (2011–2013), Bones (2012–2013) and Justified (2014), Panabaker guest-starred as Caitlin Snow on The CW television series Arrow in April 2014. The character was then spun off into the main cast of The Flash which premiered that October. Starting with the series' second season, Panabaker began playing the character's alter ego Killer Frost in different capacities, in conjunction with her role as Snow, leading to subsequent guest appearances on Arrow, Supergirl and Legends of Tomorrow. For her role on The Flash as Frost, Panabaker has been nominated for five Teen Choice Awards and won the 2021 Saturn Award for Best Supporting Actress on Television.",
        "birthday": "1987-09-19",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 31838,
        "imdb_id": "nm1263939",
        "known_for_department": "Acting",
        "name": "Danielle Panabaker",
        "place_of_birth": "Augusta, Georgia, USA",
        "popularity": 1.8911,
        "profile_path": "/faX0EDc44GL5ZcsEcxTOBcfWpCP.jpg"
    }
}