{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zRKQW58MBEY078AxkHxEJzUskCl.jpg",
                "genre_ids": [
                    878,
                    12
                ],
                "id": 438631,
                "original_language": "en",
                "original_title": "Dune",
                "overview": "Paul Atreides, a brilliant and gifted young man born into a great destiny beyond his understanding, must travel to the most dangerous planet in the universe to ensure the future of his family and his people. As malevolent forces explode into conflict over the planet's exclusive supply of the most precious resource in existence-a commodity capable of unlocking humanity's greatest potential-only those who can conquer their fear will survive.",
                "popularity": 17.784,
                "poster_path": "/d5NXSklXo0qyIYkgV94XAgMIckC.jpg",
                "release_date": "2021-09-15",
                "title": "Dune",
                "video": false,
                "vote_average": 7.781,
                "vote_count": 13924,
                "character": "Herald of the Change",
                "credit_id": "61098872dcf875004856d399",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Benjamin Clementine"
        ],
        "biography": "Benjamin Sainte-Clémentine (born 7 December 1988) is a British composer, musician and actor.\n\nBorn and raised in London, Clementine later moved to Paris, where he experienced homelessness for a time. After moving back to London, he released his debut album At Least for Now, which won the 2015 Mercury Prize. In February 2019 he was named a Knight of the Order of Arts and Letters by the French government, in recognition of his contribution to the arts.\n\nA number of critics have described him as becoming one of the great singer-songwriters of his generation, and the future sound of London, whilst struggling to place his music in any one genre. Clementine's compositions are musically incisive and attuned to the issues of life but also poetic, mixing revolt with love and melancholy, sophisticated lyricism with slang and shouts, and rhyming verse with prose monologues. He often performs topless and barefoot onstage, dressed entirely in black or dark grey, with a long, wool trench coat.\n\nThe youngest of five children, Benjamin Clementine grew up in Edmonton, London, with his strict Roman Catholic grandmother. After she died, he moved in with his parents.\n\nThe family acquired a piano when Clementine was 11, and Benjamin played it when he could, but his father, who had hoped his son would study law, forbade him to spend time with musical instruments. Clementine could not read sheet music, but in a few months, he started imitating the work of classic composers Erik Satie and Claude Debussy, learned from listening to Classic FM on the radio after \"becoming bored\" with pop music, and continued to play discreetly for the next five years until his parents' divorce.\n\nClementine left school at 16, following which he had a dispute with his family and ended up in Camden Town, London, homeless and in psychological and financial difficulties. He relocated to Paris at age 19, where he spent a number of years busking and playing in bars and hotels in Place de Clichy while sleeping on the streets. He eventually moved to a hostel in Montmartre, where he paid €20 to live in a ten-man bunk-bed room. For the next three years he wrote and composed songs, and playing a half-broken guitar and a cheap keyboard he had acquired. During this period he developed into a cult figure in the Parisian music scene.\n\nAfter four years of living as a vagabond, he was discovered by an agent, who later introduced him to Matthieu Gazier, who would go on to become Clementine's manager for a period of time. In 2012, whilst playing a gig at the Festival de Cannes, he met Lionel Bensemoun, a business mogul in France, and together set up the record label 'Behind' so that Clementine could record and publish his music. He eventually came to the attention of the French press, who described him as \"la révélation anglaise des Francos\" (\"the English revelation of the \"Francofolies\" festival\"). He was then invited to the Rencontres Trans Musicales of Rennes in France in December 2012 where he performed for the first time on a large stage, and played four nights consecutively. Clementine eventually signed a joint music license contract between Capitol, Virgin EMI and Barclay. ...\n\nSource: Article \"Benjamin Clementine\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1988-12-07",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 3185383,
        "imdb_id": "nm7064768",
        "known_for_department": "Acting",
        "name": "Benjamin Clémentine",
        "place_of_birth": "London, England, UK",
        "popularity": 0.0729,
        "profile_path": "/johpHbzqrue6XDG63vapfugGbnn.jpg"
    }
}