{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/k3TOt50cHvTLXWYPnXP0szhiXB8.jpg",
                "genre_ids": [
                    80,
                    53,
                    18
                ],
                "id": 241,
                "original_language": "en",
                "original_title": "Natural Born Killers",
                "overview": "Two victims of traumatized childhoods become lovers and serial murderers irresponsibly glorified by the mass media.",
                "popularity": 5.0091,
                "poster_path": "/fEKZwT91gxvkAoyPgpNXo8W5fu0.jpg",
                "release_date": "1994-08-26",
                "title": "Natural Born Killers",
                "video": false,
                "vote_average": 7.053,
                "vote_count": 3591,
                "character": "Mallory's Dad",
                "credit_id": "52fe422bc3a36847f8009691",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jacob Cohen",
            "رادنی دنجرفیلد"
        ],
        "biography": "Jack Roy (born Jacob Rodney Cohen), better known by the pseudonym Rodney Dangerfield, was an American stand-up comedian, actor, screenwriter, and producer. He was known for his self-deprecating one-liner humor, his catchphrase \"I don't get no respect!\" and his monologues on that theme.\n\nHe began his career working as a stand-up comic at the Fantasy Lounge in New York City. His act grew in popularity as he became a mainstay on late-night talk shows throughout the 1960s and 1970s, eventually developing into a headlining act on the Las Vegas casino circuit. His catchphrase \"I don't get no respect!\" came from an attempt to improve one of his stand-up jokes. \"I played hide and seek; they wouldn't even look for me.\" He thought the joke would be stronger if it used the format: \"I was so ...\" beginning (\"I was so poor,\" \"He was so ugly,\" \"She was so stupid,\" etc.).[clarification needed] He tried \"I get no respect,\" and got a much better response from the audience; it became a permanent feature of his act and comedic persona.\n\nHe appeared in a few bit parts in films, such as The Projectionist, throughout the 1970s, but his breakout film role came in 1980 as a boorish nouveau riche golfer in the ensemble comedy Caddyshack, which was followed by two additional successful films in which he starred: 1983's Easy Money and 1986's Back to School. Additional film work kept him busy through the rest of his life, mostly in comedies, but with a rare dramatic role in 1994's Natural Born Killers as an abusive father.",
        "birthday": "1921-11-22",
        "deathday": "2004-10-05",
        "gender": 2,
        "homepage": null,
        "id": 3198,
        "imdb_id": "nm0001098",
        "known_for_department": "Acting",
        "name": "Rodney Dangerfield",
        "place_of_birth": "Deer Park, New York, USA",
        "popularity": 0.5795,
        "profile_path": "/7ovx3TFiIlMbNfIxaYUtTOBydEr.jpg"
    }
}