{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7Gzsn4yiwMSXvYcbWXsoDhq8QO2.jpg",
                "genre_ids": [
                    10749,
                    18
                ],
                "id": 632322,
                "original_language": "en",
                "original_title": "All My Life",
                "overview": "It was a chance meeting started by one of Sol’s friends trying to chat up Jennifer. However, in the end, it was those two who hit it off. Sol enjoyed Jen’s smile, her effort, and how silly she could be. Jen enjoyed Sol’s cooking, his athleticism, and that he would join her in fun moments. As you can imagine, love bloomed, and things got serious. Jen’s investment in Sol led to her pushing him to follow his dreams and even move in to save money. Sol’s investment in Jen well, it led to him proposing. But what started as a liver tumor grew into full-on cancer, so with a diagnosis of 6 months to live, Sol and Jennifer try to make the best of it.",
                "popularity": 3.3821,
                "poster_path": "/xoKZ4ZkVApcTaTYlGoZ3J8xcIzG.jpg",
                "release_date": "2020-10-23",
                "title": "All My Life",
                "video": false,
                "vote_average": 7.8,
                "vote_count": 500,
                "character": "Artist (Uncredited)",
                "credit_id": "611a5eb34a0b19002e832b54",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Kadda Sheekoff is a Haitian socialite, Humanitarian and Entrepreneur. Real name Gregory Pierre describes Kadda Sheekoff as The AK-47, officially known as the Avtomat Kalashnikova, is a gas-operated, 7.62×39mm assault rifle, developed in the Soviet Union by Mikhail Kalashnikov. Kadda Sheekoff has become a leader and role model for many and he hopes to give back to his community by giving them something to relate to and be inspired by through his Good heart.",
        "birthday": "1993-01-13",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 3199625,
        "imdb_id": "nm11318964",
        "known_for_department": "Acting",
        "name": "Kadda Sheekoff",
        "place_of_birth": "Haiti",
        "popularity": 0.0071,
        "profile_path": null
    }
}