{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6van4BavoNXaZhCPdzLHNQ4Uc8H.jpg",
                "genre_ids": [
                    53,
                    28
                ],
                "id": 1087891,
                "original_language": "en",
                "original_title": "The Amateur",
                "overview": "After his life is turned upside down when his wife is killed in a London terrorist attack, a brilliant but introverted CIA decoder takes matters into his own hands when his supervisors refuse to take action.",
                "popularity": 25.6368,
                "poster_path": "/SNEoUInCa5fAgwuEBMIMBGvkkh.jpg",
                "release_date": "2025-04-09",
                "title": "The Amateur",
                "video": false,
                "vote_average": 6.984,
                "vote_count": 1196,
                "character": "CIA Team #3",
                "credit_id": "67f865b6ea80d85175998253",
                "order": 39
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Eli James is an American actor, standup, singer, and dialect specialist living in London. He might be best known to fans around the world for his voiceover work - including playing the scrappy teenage battler Yuma Tsukumo in the animated series Yu-Gi-Oh Zexal. He also voiced many other beloved characters on Yu-Gi-Oh, Pokemon, P. King Duckling, Beast Boy: Lone Wolf, and he has lent his vocal skills to fiction and nonfiction podcasts, and video games. You can hear his voice acting on the BBC's World of Secrets, on Radiotopia's The Body Genius series, and on his own podcast, Strong Reception.\n\nYou can see him playing a CIA operative in 2025's The Amateur, starring Rami Malek and directed by James Hawes, and his US TV credits include Gossip Girl, Unforgettable, Alpha House, Lights Out, and many commercials. Eli also regularly performs standup around the UK, including at London's Angel Comedy Club, Comedy Rumblings, and the Sam Rhodes Comedy Explosion.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.eli-james.com/dialect-coach",
        "id": 3200398,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Eli James",
        "place_of_birth": "Philadelphia, Pennsylvania",
        "popularity": 1.7957,
        "profile_path": "/d78DVPM9BELFRJToA7eMpYrICty.jpg"
    }
}