{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tyWnJeMatQGLsiLfLsxBV0pp9nk.jpg",
                "genre_ids": [
                    18
                ],
                "id": 6619,
                "original_language": "it",
                "original_title": "Morte a Venezia",
                "overview": "Composer Gustav von Aschenbach travels to Venice for health reasons. There, he becomes obsessed with the stunning beauty of an adolescent Polish boy named Tadzio who is staying with his family at the same Grand Hôtel des Bains on the Lido as Aschenbach.",
                "popularity": 1.5969,
                "poster_path": "/s81SuFBSqY8T5Lrn5R8ucX8LKxi.jpg",
                "release_date": "1971-03-05",
                "title": "Death in Venice",
                "video": false,
                "vote_average": 7.279,
                "vote_count": 509,
                "character": "Tadzio's Governess",
                "credit_id": "52fe445ec3a36847f8091f57",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Нора Риччи"
        ],
        "biography": "Eleonora Ricci (19 July 1924 – 16 April 1976) was an Italian actress.\n\nBorn in Viareggio, Tuscany, Ricci was the daughter of actors Renzo Ricci and Margherita Bagni. Ermete Zacconi was her mother's stepfather. At 17 years old, she moved to Rome to enroll in the Academy of Dramatic Arts, where she met Vittorio Gassman, who became her husband in 1944 and from whom she separated shortly after the birth of her only child, actress Paola Gassman (born June 1945), divorcing Vittorio in 1952 so he could marry Shelley Winters.\n\nRicci made her professional debut in 1943, in the theatrical company led by Laura Adani. During her career she was active on stage, radio, television and in films, notably working with Luchino Visconti, Pietro Germi, Liliana Cavani. She died after a long illness, aged 51.\n\nDescription above from the Wikipedia article Nora Ricci, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1924-07-19",
        "deathday": "1976-04-16",
        "gender": 1,
        "homepage": null,
        "id": 32066,
        "imdb_id": "nm0723235",
        "known_for_department": "Acting",
        "name": "Nora Ricci",
        "place_of_birth": "Viareggio, Lucca, Tuscany, Italy",
        "popularity": 0.1163,
        "profile_path": "/7MwqbRMPDPfa4Ej9BJBel5ReI4W.jpg"
    }
}