{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fHDvGGPFry65ou79WLi6JsjCZrM.jpg",
                "genre_ids": [
                    35
                ],
                "id": 632856,
                "original_language": "en",
                "original_title": "Spirited",
                "overview": "Each Christmas Eve, the Ghost of Christmas Present selects one dark soul to be reformed by a visit from three spirits. But this season, he picked the wrong Scrooge. Clint Briggs turns the tables on his ghostly host until Present finds himself reexamining his own past, present and future.",
                "popularity": 3.1287,
                "poster_path": "/h3zAzTMs5EP3cKusOxFNGSFE1WI.jpg",
                "release_date": "2022-11-10",
                "title": "Spirited",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 676,
                "character": "Josh Hubbins",
                "credit_id": "618ab70b35d1bc0043310997",
                "order": 26
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Maximilian Lee Piazza is a New York-based actor and martial artist specializing in Iaijutsu, a Japanese sword martial art known as Ryushin Shouchi Ryu.\n\nMaximilian's journey began with his role as the young Tim Kono in Hulu's Emmy-nominated series, Only Murders in the Building. In 2022, he made his film debut as Josh Hubbins in Spirited, working closely with the talents of Ryan Reynolds, Will Ferrell and Octavia Spencer. In 2023, Maximilian took on the iconic role of young Zoro in Netflix's live-action adaptation of Eiichiro Oda's One Piece, the best-selling manga of all time with over 510 million copies sold worldwide.\n\nAs an animal lover and budding activist, Maximilian devotes time to raising awareness for several charities including Charity Water, 4Oceans and donates proceeds from each of his projects to Cornell Skop, a sanctuary for wildlife animals. He is highly involved in raising awareness about racism and discrimination against Asian Americans, a cause that holds personal significance to him.",
        "birthday": "2008-12-23",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 3218113,
        "imdb_id": "nm12823943",
        "known_for_department": "Acting",
        "name": "Maximilian Lee Piazza",
        "place_of_birth": null,
        "popularity": 0.0767,
        "profile_path": "/m0eVy4H0aX9XxzrSFxzXsU2qfuL.jpg"
    }
}