{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/prH7Lmo7V9GuMbhCaDCSa6kvZvs.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 4347,
                "original_language": "en",
                "original_title": "Atonement",
                "overview": "As a 13-year-old, fledgling writer Briony Tallis irrevocably changes the course of several lives when she accuses her older sister's lover of a crime he did not commit.",
                "popularity": 6.4137,
                "poster_path": "/hMRIyBjPzxaSXWM06se3OcNjIQa.jpg",
                "release_date": "2007-02-27",
                "title": "Atonement",
                "video": false,
                "vote_average": 7.642,
                "vote_count": 4465,
                "character": "Fiona Maguire",
                "credit_id": "56a97141c3a36872d30029e3",
                "order": 21
            },
            {
                "adult": false,
                "backdrop_path": "/7mmXWuBeNJiBO0NIOUWOuFve4Tb.jpg",
                "genre_ids": [
                    10402,
                    18
                ],
                "id": 424694,
                "original_language": "en",
                "original_title": "Bohemian Rhapsody",
                "overview": "Singer Freddie Mercury, guitarist Brian May, drummer Roger Taylor and bass guitarist John Deacon take the music world by storm when they form the rock 'n' roll band Queen in 1970. Hit songs become instant classics. When Mercury's increasingly wild lifestyle starts to spiral out of control, Queen soon faces its greatest challenge yet – finding a way to keep the band together amid the success and excess.",
                "popularity": 7.4737,
                "poster_path": "/lHu1wtNaczFPGFDTrjCSzeLPTKN.jpg",
                "release_date": "2018-10-24",
                "title": "Bohemian Rhapsody",
                "video": false,
                "vote_average": 7.968,
                "vote_count": 17296,
                "character": "Shelley Stern",
                "credit_id": "5aea592f0e0a2603fe0000f8",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Michelle Duncan (born 14 April 1978) is a Scottish actress. She was nominated for a BAFTA Scotland Award for her performance in Sea of Souls.\n\nBorn in Perth, Duncan trained in acting at Queen Margaret University, Edinburgh before studying English and Classics at St Andrew's University. She moved to London in February 2005.\n\nHer roles on TV include Sugar Rush, Doctor Who, \"Low Winter Sun\", \"Lost in Austen\", and a TV film, Whatever Love Means, as Princess Diana. She has also appeared in such films as Atonement, The Broken and Driving Lessons, and she co-starred in the award-winning 2006 British short film Sucking Is A Fine Quality In Women And Vacuum Cleaners. On stage she has appeared in plays such as Time and the Conways (on UK tour) and A Midsummer Night's Dream and The Burning at the Edinburgh Festival Fringe.\n\nIn 2007 she was cast as Portia in The Merchant of Venice at Shakespeare's Globe, but was unable to continue after the previews and was replaced by Kirsty Besterman.\n\nShe now works at Forest School, Snaresbrook, as a Drama and English Teacher. She is also a form tutor of Franklin house.\n\nDescription above from the Wikipedia article Michelle Duncan, licensed under CC-BY-SA,full list of contributors on Wikipedia.",
        "birthday": "1978-04-14",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 32248,
        "imdb_id": "nm0242050",
        "known_for_department": "Acting",
        "name": "Michelle Duncan",
        "place_of_birth": "Perth, Perthshire, Scotland, UK",
        "popularity": 0.4632,
        "profile_path": "/tjPBVMSO3r0B4DnQlB7KapR1D96.jpg"
    }
}