{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6j0P1Clb9dQ4NIWznrReVzjZtOe.jpg",
                "genre_ids": [
                    35
                ],
                "id": 38396,
                "original_language": "it",
                "original_title": "Così è la vita",
                "overview": "Con man Aldo breaks out of jail and seizes a car at gunpoint, taking its passengers—bumbling police officer Giacomo and nitpicking civilian Giovanni—hostages. An unlikely friendship blossoms.",
                "popularity": 2.4133,
                "poster_path": "/zcZxzcl79S3gaWWDGGHcFkjT9m2.jpg",
                "release_date": "1998-12-18",
                "title": "That's Life",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 1348,
                "character": "Policeman (uncredited)",
                "credit_id": "5c018dec9251411329078a5e",
                "order": 29
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Arturo Brachetti (born 13 October 1957) is an Italian quick-change artist considered the best quick change performer in the world. In the Guinness Book of Records he is described as the quickest and most prolific quick change artist in the world.\n\nBrachetti was born in Turin. His career covers a wide artistic range and has made him an international name. The change from one costume to another is performed in a matter of seconds, often by throwing a sheet up and completely changing costume by the time it falls. In the current show, Brachetti performs 80 characters in one evening. His skills also include shadowgraphy and sand painting.\n\nAs a child, he frequented a seminary, where he met a young priest, Silvio Mantelli, with the hobby of magic. Spending most of his time in the magical warehouse of the priest, Brachetti learnt all kind of magic tricks. At the age of 15, using costumes borrowed from the seminary's theatre, he invented and performed his first quick-change act, an art introduced to the world by Leopoldo Fregoli (1867-1936).\n\nHis professional career began in 1978 in France at the parisian cabaret Paradis Latin, under the direction of Jean Marie Rivière. This led to a starring role in André Heller's German production of \"Flic Flac\"(1981). From Germany he went to England, appearing at London's Piccadilly Theatre starring in the production of \"Y\" which ran for just over a year (1983–84). He was nominated for the prestigious Society of West End Theatre Award. That same year he performed at \"The Covent Garden Christmas Gala\" in the presence of the British Royal Family.\n\nOn his return to Italy, he participated as the guest star in 10 episodes of the television show Al paradise for the Italian national television RAI (1985). It was after this that he was introduced to the Italian theatre scene. This led to a string of successful theatre productions (M. Butterfly, L'Histoire du Soldat, Varietà, In Principio Arturo, Amami Arturo, Il Mistero dei Bastardi Assassini, I Massibilli, etc.), and television appearances, making him one of the most critically acclaimed young actors of the Italian stage. He also memorably performed as the interval act at the 1991 Eurovision Song Contest in Rome.\n\nHe returned to London to perform in Tony Harrison's production of \"Square Rounds\" at the National Theatre. In 1989 and 1990 he was also a regular performer on The Best of Magic for Thames Television. Then off to Disneyland Paris where, with Mickey Mouse, he co-hosted the show A Night of Magic, which was transmitted internationally.\n\nFrom 1995, with the Italian production company Compagnia Della Rancia and the director Saverio Marconi, Brachetti continued to concentrate on creating and developing musicals for the Italian audience. His original musical \"Fregoli\" won the Biglietto D'Oro (Golden Ticket Award) for the best selling show in a season (280,000 tickets). His popularity continued with the production of \"Brachetti in Technicolor\" and \"Midsummer Night's Dream\".\n\nIn the opera field, he played the storyteller in Stravinsky's \"Histoire du soldat\", \"Peter and the wolf\"(2011) and \"Allegro un po' troppo\" (2013). ...\n\nSource: Article \"Arturo Brachetti\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1957-10-13",
        "deathday": null,
        "gender": 2,
        "homepage": "https://brachetti.com",
        "id": 32245,
        "imdb_id": "nm0102734",
        "known_for_department": "Directing",
        "name": "Arturo Brachetti",
        "place_of_birth": "Torino, Piemonte, Italy",
        "popularity": 0.0857,
        "profile_path": "/fRZGnEH4xcg9qJRUy92jSaPlVeF.jpg"
    }
}