{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tcx15vswrQJCGET5lGxESQ4J5LG.jpg",
                "genre_ids": [
                    10752,
                    36,
                    12
                ],
                "id": 57212,
                "original_language": "en",
                "original_title": "War Horse",
                "overview": "On the brink of the First World War, Albert's beloved horse Joey is sold to the Cavalry by his father. Against the backdrop of the Great War, Joey begins an odyssey full of danger, joy, and sorrow, and he transforms everyone he meets along the way. Meanwhile, Albert, unable to forget his equine friend, searches the battlefields of France to find Joey and bring him home.",
                "popularity": 4.5936,
                "poster_path": "/3aRHhvvngFPJFy5uAjo7GVr3PhL.jpg",
                "release_date": "2011-12-25",
                "title": "War Horse",
                "video": false,
                "vote_average": 7.296,
                "vote_count": 3519,
                "character": "Infantry Recruitment Officer",
                "credit_id": "638c7b31c3aa3f00c89ca93a",
                "order": 41
            },
            {
                "adult": false,
                "backdrop_path": "/prH7Lmo7V9GuMbhCaDCSa6kvZvs.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 4347,
                "original_language": "en",
                "original_title": "Atonement",
                "overview": "As a 13-year-old, fledgling writer Briony Tallis irrevocably changes the course of several lives when she accuses her older sister's lover of a crime he did not commit.",
                "popularity": 6.2853,
                "poster_path": "/hMRIyBjPzxaSXWM06se3OcNjIQa.jpg",
                "release_date": "2007-02-27",
                "title": "Atonement",
                "video": false,
                "vote_average": 7.642,
                "vote_count": 4466,
                "character": "Soldier in Bray Bar",
                "credit_id": "56a96f869251410e2d0022e6",
                "order": 28
            },
            {
                "adult": false,
                "backdrop_path": "/11V6JMreBokxvTZTsxmSQsibaRb.jpg",
                "genre_ids": [
                    28,
                    80,
                    53
                ],
                "id": 13809,
                "original_language": "en",
                "original_title": "RocknRolla",
                "overview": "When a Russian mobster sets up a real estate scam that generates millions of pounds, various members of London's criminal underworld pursue their share of the fortune. Various shady characters, including Mr One-Two, Stella the accountant, and Johnny Quid, a druggie rock-star, try to claim their slice.",
                "popularity": 2.527,
                "poster_path": "/i7eyngqjdvKB7NvrWtCjjTNNq8N.jpg",
                "release_date": "2008-09-04",
                "title": "RocknRolla",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 3094,
                "character": "Gary",
                "credit_id": "600abdc0dd83fa00408ece1f",
                "order": 31
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Johnny Harris first burst onto our screens in 2006 in the highly acclaimed British film London to Brighton. The film was voted into Time Out Magazine’s ‘100 Greatest British Films of All Time’ and celebrated British director Shane Meadows said of Harris’ performance in the film: “It’s an incredibly bold and massively powerful performance, the best I’ve seen on celluloid for a long time.”\n\nHe went on to star in Shane Meadows cult television series This Is England ’86 receiving BAFTA and Royal Television Society Award nominations for his performance. The final episode of This is England ‘86 was recently named: ‘The Greatest TV Episode of All Time’ by The Independent Newspaper.\n\nIn 2017, Johnny made his debut as a screenwriter with the highly acclaimed feature film, Jawbone. Harris also starred in and co-produced the movie. He received a BAFTA Film Award nomination for Outstanding Debut, two BIFA Film Award nominations for his performance in the leading role, and a Writers Guild Award nomination for his screenplay. Song-writing icon Paul Weller composed and recorded the soundtrack for Jawbone (his first) and in October 2018, Johnny made his debut behind the camera, directing music videos for Paul’s hit singles, 'Gravity', and 'I Woke Up'.\n\nHe has starred in film and TV hits including Without Sin, Great Expectations, Jawbone, A Christmas Carol, The Salisbury Poisonings, This is England 86-90, Snow White and the Huntsman, Fortitude, Troy Fall of a City, Medici, Monsters: Dark Continent, From Darkness, Welcome to the Punch, and Jack Thorne’s BAFTA Award-winning TV show The Fades.\n\nJohnny’s most recent work includes playing the iconic role of Magwitch in the BBC/FOX/Disney TV adaptation of Great Expectations, alongside Olivia Colman. The show was exec-produced by Tom Hardy and Sir Ridley Scott. He also co-starred alongside, Vicky McClure in ITV’s hit new drama series, Without Sin. Most recently he starred in  ‘A Gentleman in Moscow’, alongside Ewan McGregor... an 8 part series based on Amor Towles internationally Best-Selling novel for Showtime and Paramount UK.\n\nHe is current filming 'Bladerunner 2099' alongside Michelle Yeoh and Hunter Schafer. The show is Exec-Produced by Sir Ridley Scott for Amazon.",
        "birthday": "1974-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 32300,
        "imdb_id": "nm0364890",
        "known_for_department": "Acting",
        "name": "Johnny Harris",
        "place_of_birth": "Lambeth, London, England, UK",
        "popularity": 0.1537,
        "profile_path": "/bcoVPfOSXwFbq9yfPac7BO0Y0AF.jpg"
    }
}