{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dIeD6Sgnpkwu3pkuEQ3rsVsvNCE.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 11327,
                "original_language": "en",
                "original_title": "Midnight Express",
                "overview": "Billy Hayes is caught attempting to smuggle drugs out of Turkey. The Turkish courts decide to make an example of him, sentencing him to more than 30 years in prison. Hayes has two opportunities for release: the appeals made by his lawyer, his family, and the American government, or the \"Midnight Express\".",
                "popularity": 3.2546,
                "poster_path": "/mW54BtqVRxrPnoO9gQQjTLJlnuU.jpg",
                "release_date": "1978-08-31",
                "title": "Midnight Express",
                "video": false,
                "vote_average": 7.47,
                "vote_count": 1788,
                "character": "Chief Judge",
                "credit_id": "5d70561177c01f00145a0b33",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Giggi Ballista",
            "Luigi Ballista"
        ],
        "biography": "Gigi Ballista (1 December 1918 – 2 August 1980) was an Italian film and television actor. He appeared in 60 films between 1961 and 1980.\n\nBorn in Florence, Ballista graduated in Law, then he started working as a PR consultant in the field of advertising and industrial documentaries. He debuted as an actor at a mature age in the early 1960s with some minor roles, but his breakout came in 1966 with a role of weight in Pietro Germi's The Birds, the Bees and the Italians.\n\nFollowing the critical and commercial success of the film, Ballista decided to pursue a professional career as an actor, and he became, mainly thanks to his characteristic hoarse and dysphonic voice, one of the most recognizable character actors in Italian cinema and television.\n\nDescription above from the Wikipedia article Gigi Ballista, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1918-12-01",
        "deathday": "1980-08-02",
        "gender": 2,
        "homepage": null,
        "id": 32315,
        "imdb_id": "nm0050876",
        "known_for_department": "Acting",
        "name": "Gigi Ballista",
        "place_of_birth": "Florence, Tuscany, Italy",
        "popularity": 0.1229,
        "profile_path": "/3WRolZCfz1KUJWiXScHcZakLbjl.jpg"
    }
}