{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/weZ0PuPkvEFc8uuqt5TL8EXz0cs.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 760336,
                "original_language": "en",
                "original_title": "Munich – The Edge of War",
                "overview": "At the tense 1938 Munich Conference, former friends who now work for opposing governments become reluctant spies racing to expose a Nazi secret.",
                "popularity": 3.2155,
                "poster_path": "/1SOiUTDnwW9gU4GzSIsOCQUlHJF.jpg",
                "release_date": "2021-12-31",
                "title": "Munich – The Edge of War",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 613,
                "character": "Sir Alexander Cadogan",
                "credit_id": "61eaf07e9c97bd0069349315",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/v8zOcynvSd6IW3FzZrvst2HJ53s.jpg",
                "genre_ids": [
                    80,
                    53
                ],
                "id": 276907,
                "original_language": "en",
                "original_title": "Legend",
                "overview": "Suave, charming and volatile, Reggie Kray and his unstable twin brother Ronnie start to leave their mark on the London underworld in the 1960s. Using violence to get what they want, the siblings orchestrate robberies and murders while running nightclubs and protection rackets. With police Detective Leonard \"Nipper\" Read hot on their heels, the brothers continue their rapid rise to power and achieve tabloid notoriety.",
                "popularity": 8.0515,
                "poster_path": "/4shf5Alq4KWCKqrAAQe0JGJHYp5.jpg",
                "release_date": "2015-09-09",
                "title": "Legend",
                "video": false,
                "vote_average": 7.054,
                "vote_count": 4060,
                "character": "Dr Humphries",
                "credit_id": "55fafc65c3a36826e3000176",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/jD0mmfqPRpvJUaPdpLl1vMj38CA.jpg",
                "genre_ids": [
                    36,
                    18,
                    10752
                ],
                "id": 284689,
                "original_language": "en",
                "original_title": "Testament of Youth",
                "overview": "Testament of Youth is a powerful story of love, war and remembrance, based on the First World War memoir by Vera Brittain, which has become the classic testimony of that war from a woman’s point of view. A searing journey from youthful hopes and dreams to the edge of despair and back again, it’s a film about young love, the futility of war and how to make sense of the darkest times.",
                "popularity": 5.3153,
                "poster_path": "/a6kFsaDCulCLfYHmKLDKTYaddM4.jpg",
                "release_date": "2015-01-16",
                "title": "Testament of Youth",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 771,
                "character": "Headmaster",
                "credit_id": "56716f8492514159a0002bb5",
                "order": 14
            },
            {
                "adult": false,
                "backdrop_path": "/obyCUbpZvMTizOqYWHqkTFgfvnf.jpg",
                "genre_ids": [
                    10752,
                    10749,
                    36,
                    28
                ],
                "id": 676,
                "original_language": "en",
                "original_title": "Pearl Harbor",
                "overview": "The lifelong friendship between Rafe McCawley and Danny Walker is put to the ultimate test when the two ace fighter pilots become entangled in a love triangle with beautiful Naval nurse Evelyn Johnson. But the rivalry between the friends-turned-foes is immediately put on hold when they find themselves at the center of Japan's devastating attack on Pearl Harbor on Dec. 7, 1941.",
                "popularity": 8.2771,
                "poster_path": "/y8A0Cvp8WQmZ3bjbnsL53lY0dsC.jpg",
                "release_date": "2001-05-21",
                "title": "Pearl Harbor",
                "video": false,
                "vote_average": 6.941,
                "vote_count": 6744,
                "character": "RAF Squadron Leader",
                "credit_id": "582724a6c3a3683608018a92",
                "order": 96
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Nick Farrell",
            "Nicholas Frost",
            "نیکلاس فارل"
        ],
        "biography": "From Wikipedia, the free encyclopedia. Nicholas Farrell (born Nicholas Frost, in 1955) is an English stage, film and television actor. His early screen career included the role of Aubrey Montague in the 1981 film Chariots of Fire. In 1983, he starred as Edmund Bertram in a television adaptation of the Jane Austen novel, Mansfield Park. In 1984, he appeared in Greystoke: The Legend of Tarzan, Lord of the Apes and The Jewel in the Crown.\n\nSince then, his film and television work has included several screen adaptations of Shakespeare's works, including Kenneth Branagh's 1996 Hamlet , in which he played Horatio, a role he had played previously with Branagh for the Royal Shakespeare Company. He has also appeared in film adaptations of Twelfth Night (1996), Othello (1995) and In the Bleak Midwinter (1995). He provided the voice of Hamlet for the animated television adaptation Shakespeare: The Animated Tales (1992).\n\nOther television appearances have included two Agatha Christie's Poirot movies, Sharpe's Regiment, To Play the King, Torchwood and Collision. He has also appeared in episodes of Lovejoy, Foyle's War, Absolute Power, Spooks, Midsomer Murders, Drop the Dead Donkey and Casualty.\n\nFarrell's theatre work includes performances of The Cherry Orchard, Camille, and The Crucible as well as Royal Shakespeare Company productions of The Merchant of Venice, Julius Caesar, and Hamlet.\n\nHe is married to Scottish actress Stella Gonet.\n\nDescription above from the Wikipedia article Nicholas Farrell, licensed under CC-BY-SA,full list of contributors on Wikipedia.",
        "birthday": "1955-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.rbcasting.com/rb/en/web/nicholasfarrell",
        "id": 32357,
        "imdb_id": "nm0268297",
        "known_for_department": "Acting",
        "name": "Nicholas Farrell",
        "place_of_birth": "Essex, England, UK",
        "popularity": 0.9123,
        "profile_path": "/gheuwhycSxpBRhGv7Qbfub2uuB2.jpg"
    }
}