{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xoFolYFMGVzIOjYhEhyBiYbBpqK.jpg",
                "genre_ids": [
                    18
                ],
                "id": 10647,
                "original_language": "en",
                "original_title": "Pay It Forward",
                "overview": "Like some other kids, 12-year-old Trevor McKinney believed in the goodness of human nature. Like many other kids, he was determined to change the world for the better. Unlike most other kids, he succeeded.",
                "popularity": 6.1473,
                "poster_path": "/62OIokwaxFwBFWM147ijLJsaVJD.jpg",
                "release_date": "2000-10-20",
                "title": "Pay It Forward",
                "video": false,
                "vote_average": 7.36,
                "vote_count": 1894,
                "character": "Ricky McKinney",
                "credit_id": "5521d18bc3a36828d100224f",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Bon Jovi"
        ],
        "biography": "John Francis Bongiovi Jr. (born March 2, 1962), known professionally as Jon Bon Jovi, is an American singer, songwriter, guitarist, and actor. He is best known as the founder and frontman of the rock band Bon Jovi, which was formed in 1983. He has released 15 studio albums with his band as well as two solo albums.\n\nIn the 1990s, Bon Jovi started an acting career, starring in the films Moonlight and Valentino and U-571 and appearing on television in Sex and the City, Ally McBeal and The West Wing.\n\nAs a songwriter, Bon Jovi was inducted into the Songwriters Hall of Fame in 2009. In 2012, he ranked number 50 on the list of Billboard magazine's \"Power 100\", a ranking of \"The Most Powerful and Influential People in the Music Business\". In 1996, People magazine named him one of the \"50 Most Beautiful People in the World\". In 2000, People awarded him the title \"Sexiest Rock Star\".\n\nBon Jovi was a founder and former majority owner of the Arena Football League team, the Philadelphia Soul. He is the founder of The Jon Bon Jovi Soul Foundation, founded in 2006.",
        "birthday": "1962-03-02",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 32362,
        "imdb_id": "nm0000954",
        "known_for_department": "Acting",
        "name": "Jon Bon Jovi",
        "place_of_birth": "Perth Amboy, New Jersey, USA",
        "popularity": 0.7828,
        "profile_path": "/bqZdwRljds92cSvqQcoueBzLyat.jpg"
    }
}