{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/g7prwSflNODkHZI6792MYoU4qoh.jpg",
                "genre_ids": [
                    53,
                    12,
                    18
                ],
                "id": 38985,
                "original_language": "en",
                "original_title": "Sorcerer",
                "overview": "Four men from different parts of the globe, all hiding from their pasts in the same remote South American town, agree to risk their lives transporting several cases of dynamite (which is so old that it is dripping unstable nitroglycerin) across dangerous jungle terrain.",
                "popularity": 2.7711,
                "poster_path": "/2b7oexm173SF1FSEq0DdgxZZNRH.jpg",
                "release_date": "1977-06-24",
                "title": "Sorcerer",
                "video": false,
                "vote_average": 7.441,
                "vote_count": 599,
                "character": "Victor Manzon / \"Serrano\"",
                "credit_id": "52fe46f09251416c91064baf",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Bruno Jean Marie Cremer",
            "ブリュノ・クレメール",
            "Бруно Кремер"
        ],
        "biography": "Bruno Jean Marie Cremer (6 October 1929 – 7 August 2010) was a French actor best known for portraying Jules Maigret on French television, from 1991 to 2005.\n\nBruno Cremer was born in Saint-Mandé, Val-de-Marne, in the eastern suburbs of Paris, France. His mother, Jeanne Rullaert, a musician, was of Belgian Flemish origin and his father, Georges, was a businessman from Lille who, though born French, had taken out Belgian nationality after the French armed forces refused to accept him for service in the First World War. Bruno himself opted for French nationality when he reached the age of 18. His childhood was largely spent in Paris.\n\nBruno attended the Cours Hattemer, a private school. Having completed his secondary studies, he followed an interest in acting which had interested him since the age of 12 and trained in acting from 1952 at France's highly selective Conservatoire national supérieur d'art dramatique (English: French National Academy of Dramatic Arts).\n\nHis career began with ten years spent acting in live theatre, playing roles drawn from works of Shakespeare, Oscar Wilde and Jean Anouilh. Aged already 30, he created the role of Thomas Becket in the 1959 world premiere of Anouilh's Becket, and held Anouilh in veneration all his life. Later Cremer played Max in a French production of Bent by Martin Sherman in 1981. He regarded his basic profession as that of a stage actor, though he gravitated firmly to films.\n\nIt was in 1957 that Cremer had his first credited part in a film, Quand la femme s'en mêle (When a woman meddles), which starred Alain Delon. However, it was in 1965 that Cremer's career really began to prosper, with the film La 317e section, (The 317th Platoon), directed by Pierre Schoendoerffer and set in Indochina during the French colonial wars. From then onwards, Cremer became a popular actor and appeared in over 110 productions for cinema and television.\n\nWhile Cremer tried to avoid labels and typecasting, he tended to be offered tough-guy roles, often military men. Examples from various points in his career include Section spéciale (1975), La légion saute sur Kolwezi (1980) and Là-haut, un roi au-dessus des nuages (2004).\n\nSpecial Section (French original title: Section spéciale), released in 1975, is about a kangaroo court set up in collaborationist Vichy France to ensure judicial convictions of innocent people so as to mollify the Nazis. A French language film directed by the Greek-French film director Costa-Gavras, it features Cremer as Lucien Sampaix, a Communist-leaning journalist.\n\nThe 1980 film La légion saute sur Kolwezi (English Operation Leopard), directed by Raoul Coutard, is a documentary-style portrayal of a real-life operation headed by the French Foreign Legion in the Democratic Republic of the Congo in 1978 to rescue foreign hostages. Cremer plays a military commander. Pierre Schoendoerffer’s 2004 film Là-haut, un roi au-dessus des nuages (Above the Clouds), based on his own novel, Là-haut. Cremer played the Colonel. ...\n\nSource: Article \"Bruno Cremer\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1929-10-06",
        "deathday": "2010-08-07",
        "gender": 2,
        "homepage": null,
        "id": 32364,
        "imdb_id": "nm0187337",
        "known_for_department": "Acting",
        "name": "Bruno Cremer",
        "place_of_birth": "Saint-Mandé, Val-de-Marne, France",
        "popularity": 0.2831,
        "profile_path": "/nJKNyrnUKN3WtbX4ERaShXVkBsd.jpg"
    }
}