{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lYfHa1AtkUMtplrKx7SRLHpwonW.jpg",
                "genre_ids": [
                    12,
                    14,
                    27
                ],
                "id": 244,
                "original_language": "en",
                "original_title": "King Kong",
                "overview": "Adventurous filmmaker Carl Denham sets out to produce a motion picture unlike anything the world has seen before. Alongside his leading lady Ann Darrow and his first mate Jack Driscoll, they arrive on an island and discover a legendary creature said to be neither beast nor man. Denham captures the monster to be displayed on Broadway as King Kong, the eighth wonder of the world.",
                "popularity": 3.0442,
                "poster_path": "/lHlnxKL5GbgRibyRFI7n1Ey850i.jpg",
                "release_date": "1933-03-15",
                "title": "King Kong",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 1544,
                "character": "Ann Darrow",
                "credit_id": "52fe422cc3a36847f8009a2f",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/frM7pCS0vWnT1Utb81YyErmohmg.jpg",
                "genre_ids": [
                    35,
                    80,
                    9648,
                    53
                ],
                "id": 6037,
                "original_language": "en",
                "original_title": "Murder by Death",
                "overview": "Lionel Twain invites the world's five greatest detectives to a 'dinner and murder'. Included are a blind butler, a deaf-mute maid, screams, spinning rooms, secret passages, false identities and more plot turns and twists than are decently allowed.",
                "popularity": 4.3043,
                "poster_path": "/7YGYam05qzHy0ZSzfjBSDkVvvU7.jpg",
                "release_date": "1976-06-23",
                "title": "Murder by Death",
                "video": false,
                "vote_average": 7.176,
                "vote_count": 844,
                "character": "Door Bell (archive sound) (uncredited)",
                "credit_id": "52fe443ac3a36847f80898af",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Фэй Рэй",
            "Фэй Рей",
            "菲伊·雷",
            "Vina Fay Wray"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nFay Wray (born Vina Fay Wray; September 15, 1907 – August 8, 2004) was a Canadian-American actress. Through an acting career that spanned 57 years, Wray attained international stardom as an actress in horror film roles, leading to many considering her as the first \"scream queen\".\n\nAfter appearing in minor film roles, Wray gained media attention being selected as one of the \"WAMPAS Baby Stars\". This led to Wray being signed to Paramount Pictures as a teenager, where she made more than a dozen films. After leaving Paramount, she signed deals with various film companies, being cast in her first horror film roles. For RKO Radio Pictures, Inc., she starred in the film with which she is most identified, King Kong (1933). After the success of King Kong, Wray appeared in more minor film roles and on television, leading to her final role in 1980.\n\nDescription above from the Wikipedia article Fay Wray, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1907-09-15",
        "deathday": "2004-08-08",
        "gender": 1,
        "homepage": null,
        "id": 3242,
        "imdb_id": "nm0942039",
        "known_for_department": "Acting",
        "name": "Fay Wray",
        "place_of_birth": "Cardston, Alberta, Canada",
        "popularity": 0.4295,
        "profile_path": "/zE36ekZdFQ53Bvk5JauwIeOeKlR.jpg"
    }
}