{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/28vvMlh490bxipmhkbYTQissiof.jpg",
                "genre_ids": [
                    35,
                    10752,
                    10749
                ],
                "id": 198,
                "original_language": "en",
                "original_title": "To Be or Not to Be",
                "overview": "During the Nazi occupation of Poland, an acting troupe becomes embroiled in a Polish soldier's efforts to track down a German spy.",
                "popularity": 2.842,
                "poster_path": "/dDQRpEoyjHT4fzw9cNklIvZuXYg.jpg",
                "release_date": "1942-03-06",
                "title": "To Be or Not to Be",
                "video": false,
                "vote_average": 7.8,
                "vote_count": 779,
                "character": "Polish Official (uncredited)",
                "credit_id": "61946368fe6c1800655541e3",
                "order": 39
            },
            {
                "adult": false,
                "backdrop_path": "/lYfHa1AtkUMtplrKx7SRLHpwonW.jpg",
                "genre_ids": [
                    12,
                    14,
                    27
                ],
                "id": 244,
                "original_language": "en",
                "original_title": "King Kong",
                "overview": "Adventurous filmmaker Carl Denham sets out to produce a motion picture unlike anything the world has seen before. Alongside his leading lady Ann Darrow and his first mate Jack Driscoll, they arrive on an island and discover a legendary creature said to be neither beast nor man. Denham captures the monster to be displayed on Broadway as King Kong, the eighth wonder of the world.",
                "popularity": 3.0805,
                "poster_path": "/lHlnxKL5GbgRibyRFI7n1Ey850i.jpg",
                "release_date": "1933-03-15",
                "title": "King Kong",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 1544,
                "character": "Captain Englehorn",
                "credit_id": "555e87009251417e51001362",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "George H. Lloyd",
            "Frank Reichert",
            "Franz Reicher"
        ],
        "biography": "Frank Reicher (December 2, 1875 – January 19, 1965) was a German-born American stage and film actor, director and producer. He is best known for playing Captain Englehorn in the 1933 film King Kong.\n\nReicher made his Broadway debut the year he came to America playing Lord Tarquin in Harrison Fiske's production of Becky Sharp, a comedy by Langdon Mitchell based on William Makepeace Thackeray’s Vanity Fair. His early career was spent in legitimate theater on and off Broadway. He was head of the Brooklyn Stock Company when Jacob P. Adler performed The Merchant of Venice in Yiddish while the rest of the cast remained in English. Reicher was for a number of years affiliated with the Little Theatre on West Forty-Fourth Street as an actor and manager and would remain active on Broadway as actor, director or producer well into the 1920s. On stage, Reicher starred in such plays as the first Broadway production of Georg Kaiser's From Morning to Midnight (as the cashier), and the original production of Percy MacKaye's The Scarecrow (in the title role).\n\nFrank Reicher is probably more familiar to modern audiences as a supporting character actor in films. He began his cinema career with an uncredited role in the 1915 film The Case for Becky and would go on to work in over two hundred motion pictures. He is probably best remembered for playing the character of Captain Englehorn in King Kong and The Son of Kong, and for his work in such films as The Secret Life of Walter Mitty (1947) and Kiss Tomorrow Goodbye (1950). His last Hollywood role was in the very first theatrical Superman movie, Superman and the Mole Men, in 1951.\n\nFrank Reicher died at a hospital in Inglewood, California, aged 89. He was survived by his sister and a brother. His interment was at Inglewood Park Cemetery.",
        "birthday": "1875-12-02",
        "deathday": "1965-01-19",
        "gender": 2,
        "homepage": null,
        "id": 3245,
        "imdb_id": "nm0717046",
        "known_for_department": "Acting",
        "name": "Frank Reicher",
        "place_of_birth": "Munich, German Empire [now Germany]",
        "popularity": 0.276,
        "profile_path": "/5q5kXKMDiBg7MrdcSdU5CZSQTgS.jpg"
    }
}