{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kVsFGeyGwK7gCY72sFjczY4dmDs.jpg",
                "genre_ids": [
                    18
                ],
                "id": 809140,
                "original_language": "en",
                "original_title": "Father Stu",
                "overview": "The true-life story of boxer-turned-priest. When an injury ends his amateur boxing career, Stuart Long moves to Los Angeles to find money and fame. While scraping by as a supermarket clerk, he meets Carmen, a Sunday school teacher who seems immune to his bad-boy charm. Determined to win her over, the longtime agnostic starts going to church to impress her. However, a motorcycle accident leaves him wondering if he can use his second chance to help others, leading to the surprising realization that he's meant to be a Catholic priest.",
                "popularity": 2.4068,
                "poster_path": "/pLAeWgqXbTeJ2gQtNvRmdIncYsk.jpg",
                "release_date": "2022-04-13",
                "title": "Father Stu",
                "video": false,
                "vote_average": 7.158,
                "vote_count": 665,
                "character": "Boxing Judge",
                "credit_id": "62223179c2ff3d006f9a132b",
                "order": 43
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Donald Howland",
            "Skip Howland"
        ],
        "biography": "As a seasoned character actor, Skip has played multiple roles appearing in Feature Films, National Commercials, Network TV series and A-List Artist Music Videos as well as Web Series. He has also worked as a featured character in various industrial and training videos. Skip's characters include featured supporting role as an Italian Tailor in the upcoming comedy feature Stealing Pulp Fiction; Co-starring Jason Alexander and Cazzie David. As a Boxing Judge in Father Stu (Feature Film) with Mark Walberg and Mel Gibson, TV Executive on Lilly Singh's late night network talk show (Sketch comedy Universal/NBC), A Biker in Ed Sheeran's Music Video (Overpass Graffiti, A Motel Guest in Justin Bieber's Holy, and lead in a Warner sponsored Ed Sheeran video titled That's On Me. A featured Barber alongside Charles Barkley, Samuel L Jackson, Jennifer Garner, directed by Spike Lee in Capital One's National Commercial (Chuck Cuts) for the 2022 NCAA March Madness campaign. Prior roles include Professor/Teacher/Therapist to Gunslinger and Cowboy to CEO/Detective/Commander. He was a homeless man on the street and in the same production transformed into a successful businessman (Dahr Mann Production). Skip has the ability to cry on cue for character depth. Among Skip's outside interest, he rides a big 'bad' Harley Davidson and is an experienced skydiver with over 2300 jumps. He is a US Army Veteran, an ocean sailor and has taught ocean sailing. He rides his bicycle for exercise and loves to travel. He is a certified SCUBA diver and former private pilot. Skip's white 'Sam Elliott/Wilfred Brimley/Monopoly Man' mustache accentuates his roles and adds a unique element of comedy to those appropriate roles. His a trained artist in improv and also does close-up magic!",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 3252036,
        "imdb_id": "nm10965185",
        "known_for_department": "Acting",
        "name": "Skip Howland",
        "place_of_birth": null,
        "popularity": 0.0898,
        "profile_path": "/mXgzTq5QFTcWDi5eJe2vFQnaZ47.jpg"
    }
}