{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/izgDdMvuRvTtA2azhKwPvfITZU1.jpg",
                "genre_ids": [
                    12,
                    18,
                    28,
                    36
                ],
                "id": 11416,
                "original_language": "en",
                "original_title": "The Mission",
                "overview": "When a Spanish Jesuit goes into the South American wilderness to build a mission in the hope of converting the Indians of the region, a slave hunter is converted and joins his mission. When Spain sells the colony to Portugal, they are forced to defend all they have built against the Portuguese aggressors.",
                "popularity": 3.4778,
                "poster_path": "/6K9cG6LOOtySZF4D4xBu1MApC1N.jpg",
                "release_date": "1986-09-06",
                "title": "The Mission",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 1464,
                "character": "Hontar",
                "credit_id": "52fe443c9251416c7502d7cf",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/zp5bc23EPflpLhkCObsFFOL3psw.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 74534,
                "original_language": "en",
                "original_title": "The Best Exotic Marigold Hotel",
                "overview": "British retirees travel to India to take up residence in what they believe is a newly restored hotel. Less luxurious than its advertisements, the Marigold Hotel nevertheless slowly begins to charm in unexpected ways as the residents find new purpose in their old age.",
                "popularity": 2.3385,
                "poster_path": "/gNWiOKTWDvPTpr7QfPWk18gLftz.jpg",
                "release_date": "2012-02-23",
                "title": "The Best Exotic Marigold Hotel",
                "video": false,
                "vote_average": 6.956,
                "vote_count": 1395,
                "character": "Norman Cousins",
                "credit_id": "52fe48d0c3a368484e10c417",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/bWftGh0aLMzb8wetgziLq3fHpTJ.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 9769,
                "original_language": "en",
                "original_title": "Lolita",
                "overview": "Humbert Humbert is a middle-aged British novelist who is both appalled by and attracted to the vulgarity of American culture. When he comes to stay at the boarding house run by Charlotte Haze, he soon becomes obsessed with Lolita, the woman's teenaged daughter.",
                "popularity": 10.4875,
                "poster_path": "/9INcC14WZjCMKGE360VXmklCLdZ.jpg",
                "release_date": "1997-09-27",
                "title": "Lolita",
                "video": false,
                "vote_average": 7.135,
                "vote_count": 1876,
                "character": "Young Humbert's Father",
                "credit_id": "56e435f39251415b5f002526",
                "order": 14
            },
            {
                "adult": false,
                "backdrop_path": "/6prkTmEEsB3f9hhKBzUePLe27b2.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 399404,
                "original_language": "en",
                "original_title": "Darkest Hour",
                "overview": "In May 1940, the fate of World War II hangs on Winston Churchill, who must decide whether to negotiate with Adolf Hitler or fight on knowing that it could mean the end of the British Empire.",
                "popularity": 5.6299,
                "poster_path": "/xa6G3aKlysQeVg9wOb0dRcIGlWu.jpg",
                "release_date": "2017-11-22",
                "title": "Darkest Hour",
                "video": false,
                "vote_average": 7.351,
                "vote_count": 5297,
                "character": "Neville Chamberlain",
                "credit_id": "59d715e992514124c900721b",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/kB9Y59YDMOFdm5LgSyTVj4b6hh6.jpg",
                "genre_ids": [
                    28,
                    53
                ],
                "id": 4909,
                "original_language": "en",
                "original_title": "The Day of the Jackal",
                "overview": "An international assassin known as ‘The Jackal’ is employed by disgruntled French generals to kill President Charles de Gaulle, with a dedicated gendarme on the assassin’s trail.",
                "popularity": 5.8509,
                "poster_path": "/vThgcb3JOj99yETg8WChuci4LV2.jpg",
                "release_date": "1973-05-16",
                "title": "The Day of the Jackal",
                "video": false,
                "vote_average": 7.541,
                "vote_count": 631,
                "character": "The Forger",
                "credit_id": "5a2772c292514103290fe73f",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Рональд Альфред Пикап",
            "Ronald Alfred Pickup"
        ],
        "biography": "Pickup was born in Chester, England, the son of Daisy (née Williams) and Eric Pickup, who was a lecturer.[1] Pickup was educated at The King's School, Chester, trained at the Royal Academy of Dramatic Art (RADA) in London, and became an Associate Member of RADA.\n\nHis television work began with an episode during the second series of Doctor Who in 1964, for which he was paid £30. Pickup worked with Laurence Olivier at the Royal National Theatre, most notably in Three Sisters and Long Day's Journey Into Night. In 1973, he starred in the BBC drama series The Dragon's Opponent, playing a World War II bomb disposal expert and also appeared in The Day of the Jackal. He played Lt. Harford in Zulu Dawn in 1979, portrayed Igor Stravinsky in Nijinsky in 1980, Prince John in Ivanhoe in 1982, and in 1983 he appeared opposite Penelope Keith in Moving, in 1988 in the BBC miniseries The Lion, the Witch and the Wardrobe (1988 TV Serial) as the voice of Aslan, and in 1990 he starred in the short lived sit-com, Not with a Bang. More modern roles have included parts in Hornblower, Hustle, Foyle's War, Midsomer Murders, Waking the Dead, The Bill, Silent Witness, Sherlock Holmes, and Inspector Morse. He is also a regular character in the BBC sitcom The Worst Week of My Life. His most recent appearance was in Holby City as Lord Charles Byrne.\n\nPickup gave a highly acclaimed performance as a decayed Russian aristocrat in the BBC series Fortunes of War, based on a work by Olivia Manning. He also provided the voice for Aslan in the BBC's adaptation of the Chronicles of Narnia and starred opposite Judi Dench in the 1989 Channel 4 serial Behaving Badly.\n\nHe is also an accomplished stage actor. He was nominated for a 1998 Laurence Olivier Theatre Award for Best Performance in a Supporting Role of 1997 for his performance in Amy's View.\n\nPickup had the starring role as composer Giuseppe Verdi in the acclaimed The Life of Verdi, written and directed by Renato Castellani. In 2005, he had a supporting role in the family-based film, The Adventures of Greyfriars Bobby.\n\nBetween March and August 2009, he starred as Lucky in Sean Mathias' production of Waiting for Godot by Samuel Beckett opposite Sir Ian McKellen (Estragon), Patrick Stewart (Vladimir) and also Simon Callow (Pozzo). The tour opened in Malvern before travelling to Milton Keynes, Brighton, Bath, Norwich, Edinburgh and Newcastle; its run at the Theatre Royal, Haymarket was extended due to demand.\n\nIn February 2010 he also appeared as 'Pegleg' in the BBC's period drama Lark Rise to Candleford.\n\nDescription above from the Wikipedia article Ronald Pickup, licensed under CC-BY-SA,full list of contributors on Wikipedia.",
        "birthday": "1940-06-07",
        "deathday": "2021-02-25",
        "gender": 2,
        "homepage": null,
        "id": 32556,
        "imdb_id": "nm0681975",
        "known_for_department": "Acting",
        "name": "Ronald Pickup",
        "place_of_birth": "Chester, England, UK",
        "popularity": 0.4116,
        "profile_path": "/9wJtlqBNPPa87UJDfLNnSNQRhEn.jpg"
    }
}