{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bwgjIlMoSyU1Iw0IhNIFUeSbNDy.jpg",
                "genre_ids": [
                    18
                ],
                "id": 68722,
                "original_language": "en",
                "original_title": "The Master",
                "overview": "Freddie, a volatile, heavy-drinking veteran who suffers from post-traumatic stress disorder, finds some semblance of a family when he stumbles onto the ship of Lancaster Dodd, the charismatic leader of a new \"religion\" he forms after World War II.",
                "popularity": 5.8235,
                "poster_path": "/jjVGdNt4fYb3T2hjISGZ2qnCuaV.jpg",
                "release_date": "2012-09-14",
                "title": "The Master",
                "video": false,
                "vote_average": 7.113,
                "vote_count": 3105,
                "character": "Dancer",
                "credit_id": "6158db3bf1759c00614e23ac",
                "order": 68
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Brittany Kilcoyne McGregor is a San Diego born actress and singer. She spent her early years attending a performing arts magnet school Vista Academy and starred in local community theatre. She moved north to San Francisco in 2004 on a full presidential scholarship to San Francisco State University. In 2009, after much self exploration and a year in the south of France(2007-2008), she graduated Summa Cum Laude and Phi Beta Kappa with Bachelors Degrees in both Humanities and Theatre Arts Performance from SFSU. After finishing school she embarked on a indie theatre and commercial career in San Francisco. Brittany was in the original cast of \"Trainspotting\" author Irvine Welsh's world premier play \"Babylon Heights\" at the Exit Theater in 2006. In 2009 she performed Edith Piaf's classic music in collaboration with comedian James Judd. She can be seen in many of Stride Gum's Wacky World Records on Facebook. Represented by Look Talent, she was cast as \"Young Girl\" in Paul Thomas Anderson's upcoming film \"The Master\" to be released in October 2012. She moved to Los Angeles in early 2012 and began studying with Alice Carter at the Carter Thor Acting Studio. Her partner is renowned guitarist Michael Abraham who also resides in Los Angeles. Together, they perform the music of Edith Piaf and Barbara and many other beloved French singers in local cabarets, clubs and private events. Brittany has also performed with musician Cameron Adair (CA All Day) and composer Adrien Prevost in San Francisco and Los Angeles.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 3256760,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Brittany Kilcoyne McGregor",
        "place_of_birth": "San Diego, California, USA",
        "popularity": 0.0214,
        "profile_path": "/eXaFTHK6JJjjF6RdvqBjqrFzoaE.jpg"
    }
}