{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/a53EGF0NzHRGKuRItsrtXBM8FCD.jpg",
                "genre_ids": [
                    35,
                    878,
                    14,
                    27
                ],
                "id": 36685,
                "original_language": "en",
                "original_title": "The Rocky Horror Picture Show",
                "overview": "After getting a flat tire in the middle of nowhere, newly engaged couple Brad and Janet encounter the eerie mansion of the flamboyant, seductive Dr. Frank-N-Furter and a variety of eccentric characters. Through elaborate dance and rock music, the mad scientist unveils his latest creation: a perfect, muscular man.",
                "popularity": 4.7666,
                "poster_path": "/3pyE6ZqDbuJi7zrNzzQzcKTWdmN.jpg",
                "release_date": "1975-08-14",
                "title": "The Rocky Horror Picture Show",
                "video": false,
                "vote_average": 7.445,
                "vote_count": 2954,
                "character": "The Transylvanians",
                "credit_id": "5bd9ea28c3a3683ce6011ae1",
                "order": 24
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Judith Annabel Leventon (born 20 April 1942 in Hertfordshire, England) is an English actress who has acted in various roles on stage and television.\n\nWhile reading English at the University of Oxford she made several appearances at the Oxford Playhouse and toured France as Desdemona in the Oxford University Dramatic Society's production of Othello. She then joined the Fourbeats pop group, played at the Edinburgh Festival and continued in various other OUDS productions.\n\nOn obtaining her BA she gained a grant to LAMDA and made her professional stage debut in Leicester. In December 1967 she left for America where she joined Tom O' Horgan's La MaMa troupe in New York and worked with them for seven months before returning to Britain. She was in the original London cast of Hair in 1968 at the Shaftesbury Theatre, also directed by O'Horgan. She went on to direct and appear in the show in Paris. She also appeared in the original London production of The Rocky Horror Show.\n\nHer first TV appearance was in The White Rabbit in 1967, and she went on to appear in a number of long-running series over the next four decades.\n\nHer film credits include roles in Come Back Peter (1969), Le Mur de l'Atlantique (1970), Every Home Should Have One (1970), The Rocky Horror Picture Show (1975), Shock Treatment (1981), Real Life (1984), Defence of the Realm (1986), M. Butterfly (1993), Wimbledon (2004) and A Royal Night Out (2015).\n\nIn 2013, Leventon appeared in the role of Constance, the Madwoman of the Flea Market, in the British premiere of Jerry Herman's Dear World at the Charing Cross Theatre, London. In 2023, Leventon appeared in the role of Edith Tellmann in the British premiere of Bjørg Vik's The Journey to Venice at the Finborough Theatre, London. For this role, she was nominated for an Offie for Lead Performance in a Play.\n\nShe is the author of The Real Rock Follies: The Great Girl Band Rip-Off of 1976, released in 2017.\n\nSource: Article \"Annabel Leventon\" from Wikipedia in English, licensed under CC-BY-SA.",
        "birthday": "1942-04-20",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 32595,
        "imdb_id": "nm0505302",
        "known_for_department": "Acting",
        "name": "Annabel Leventon",
        "place_of_birth": "Hertfordshire, England, UK",
        "popularity": 0.1503,
        "profile_path": "/lEcVqp5TwpBD4R1j6L9cQS5wUg8.jpg"
    }
}