{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lYfHa1AtkUMtplrKx7SRLHpwonW.jpg",
                "genre_ids": [
                    12,
                    14,
                    27
                ],
                "id": 244,
                "original_language": "en",
                "original_title": "King Kong",
                "overview": "Adventurous filmmaker Carl Denham sets out to produce a motion picture unlike anything the world has seen before. Alongside his leading lady Ann Darrow and his first mate Jack Driscoll, they arrive on an island and discover a legendary creature said to be neither beast nor man. Denham captures the monster to be displayed on Broadway as King Kong, the eighth wonder of the world.",
                "popularity": 3.0805,
                "poster_path": "/lHlnxKL5GbgRibyRFI7n1Ey850i.jpg",
                "release_date": "1933-03-15",
                "title": "King Kong",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 1544,
                "character": "Mate Briggs",
                "credit_id": "52fe422cc3a36847f8009a97",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/eMgflonfRY89Zj4LZykJKPpG4wg.jpg",
                "genre_ids": [
                    18
                ],
                "id": 596,
                "original_language": "en",
                "original_title": "The Grapes of Wrath",
                "overview": "Tom Joad returns to his home after a jail sentence to find his family kicked out of their farm due to foreclosure. He catches up with them on his Uncle’s farm, and joins them the next day as they head for California and a new life... Hopefully.",
                "popularity": 5.0306,
                "poster_path": "/eUcxMVBIA0Jg8l1RGUqycrc3eIQ.jpg",
                "release_date": "1940-03-15",
                "title": "The Grapes of Wrath",
                "video": false,
                "vote_average": 7.815,
                "vote_count": 1043,
                "character": "Guard (uncredited)",
                "credit_id": "55e5015cc3a368140800093d",
                "order": 68
            },
            {
                "adult": false,
                "backdrop_path": "/d5HjGve67GkNC9lWpzZVKSotLlT.jpg",
                "genre_ids": [
                    18,
                    9648
                ],
                "id": 1939,
                "original_language": "en",
                "original_title": "Laura",
                "overview": "A police detective falls in love with the woman whose murder he's investigating.",
                "popularity": 2.1817,
                "poster_path": "/j0zEiFFrdbZnMXqD3piOtZBJeNB.jpg",
                "release_date": "1944-11-26",
                "title": "Laura",
                "video": false,
                "vote_average": 7.634,
                "vote_count": 853,
                "character": "Det. McEveety (uncredited)",
                "credit_id": "56db138f9251417628000265",
                "order": 15
            },
            {
                "adult": false,
                "backdrop_path": "/1rSF7UoY6aU8i7yJOLovZv8AYwX.jpg",
                "genre_ids": [
                    53
                ],
                "id": 31997,
                "original_language": "en",
                "original_title": "Saboteur",
                "overview": "Aircraft factory worker Barry Kane flees across the United States after he is wrongly accused of starting the fire that killed his best friend.",
                "popularity": 3.4948,
                "poster_path": "/iDKOOTymUZg0WAWPcbdP6nPZEFF.jpg",
                "release_date": "1942-04-24",
                "title": "Saboteur",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 518,
                "character": "Motorcycle Cop (voice) (uncredited)",
                "credit_id": "664fa6c30ce32a27aa82bb9e",
                "order": 52
            },
            {
                "adult": false,
                "backdrop_path": "/wSiBXaJ2PtlxUGH2waIxQZjFPhg.jpg",
                "genre_ids": [
                    28,
                    12,
                    35,
                    80
                ],
                "id": 11576,
                "original_language": "en",
                "original_title": "It's a Mad, Mad, Mad, Mad World",
                "overview": "A group of strangers come across a man dying after a car crash who proceeds to tell them about the $350,000 he buried in California. What follows is the madcap adventures of those strangers as each attempts to claim the prize for himself.",
                "popularity": 7.5039,
                "poster_path": "/j4mWzOisSHFkaqIkq34l2mm8a5K.jpg",
                "release_date": "1963-11-07",
                "title": "It's a Mad, Mad, Mad, Mad World",
                "video": false,
                "vote_average": 6.97,
                "vote_count": 637,
                "character": "Patrolman (uncredited)",
                "credit_id": "682f9d034cca457df14131c3",
                "order": 71
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "James William Flavin Jr.",
            "James Flaven",
            "Jim Flavin"
        ],
        "biography": "American character actor whose career lasted nearly half a century. James Wilson Flavin Jr. was the son of a hotel waiter of Canadian-English extraction and a mother, Katherine, whose father was an Irish immigrant. (Thus Flavin, well-known in Hollywood as an \"Irish\" type, was only one-quarter Irish.) Flavin was born and raised in Portland, Maine (a fact that may have enrichened his later working relationship with director John Ford, also a Portland native). He attended the United States Military Academy at West Point, but (contrary to some sources) did not graduate. Instead he dropped out and returned to Portland where he drove a taxi. Then as now, summer stock companies flocked to Maine each year, and in 1929 he was asked to fill in for an actor. He did well with the part and the company manager offered him $150 per week to go with the troupe back to New York. Flavin accepted and by the spring of 1930 was living in a rooming house at 108 W. 87th Street in Manhattan. Flavin didn't manage to crack Broadway at this time (his Broadway debut would not occur for another thirty-nine years, in the 1971 revival of \"The Front Page,\" in which Flavin played Murphy and briefly took over the lead role of Walter Burns from star Robert Ryan). He worked his way across the country in stock productions and tours, arriving in Los Angeles around 1932. He quickly made the transition to movies, landing the lead in his very first film, a Universal serial, The Airmail Mystery (1932). He also landed his leading lady, marrying the serial's female star Lucile Browne that same year. However, the serial marked virtually the last time that Flavin would play the lead in a film. Thereafter, he was restricted almost exclusively to supporting characters, many of them without so much as a name. He specialized in uniformed cops and hard-bitten detectives, but played chauffeurs, cabbies, and even a 16th-century palace guard with aplomb. Flavin appeared in nearly four hundred films between 1932 and 1971, and in almost a hundred television episodes before his final appearance, as President Dwight D. Eisenhower in Francis Gary Powers: The True Story of the U-2 Spy Incident (1976). Flavin died of a heart ailment at Cedars-Sinai Medical Center in Los Angeles on April 23, 1976. His widow Lucile died seventeen days later. They were survived by their son, William James Flavin, subsequently a professor at the United States Army War College. James and Lucile Brown Flavin were buried at Holy Cross Cemetery in Culver City, California.",
        "birthday": "1906-05-14",
        "deathday": "1976-04-23",
        "gender": 2,
        "homepage": null,
        "id": 3262,
        "imdb_id": "nm0281329",
        "known_for_department": "Acting",
        "name": "James Flavin",
        "place_of_birth": "Portland, Maine, USA",
        "popularity": 0.3141,
        "profile_path": "/zF6D2GWaLx2TyRm4qDTqwCk6JWg.jpg"
    }
}