{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zNnjHLDtV8Ti3aworltaeaLMov4.jpg",
                "genre_ids": [
                    80,
                    18,
                    53
                ],
                "id": 242,
                "original_language": "en",
                "original_title": "The Godfather Part III",
                "overview": "In the midst of trying to legitimize his business dealings in 1979 New York and Italy, aging mafia don, Michael Corleone seeks forgiveness for his sins while taking a young protege under his wing.",
                "popularity": 10.1688,
                "poster_path": "/lm3pQ2QoQ16pextRsmnUbG2onES.jpg",
                "release_date": "1990-12-25",
                "title": "The Godfather Part III",
                "video": false,
                "vote_average": 7.416,
                "vote_count": 6513,
                "character": "Cardinal Lamberto",
                "credit_id": "52fe422bc3a36847f800978d",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/jkYdRAhshaRwiRAB4KdDz1Ocj4e.jpg",
                "genre_ids": [
                    28,
                    80,
                    35,
                    53
                ],
                "id": 10536,
                "original_language": "en",
                "original_title": "The Italian Job",
                "overview": "Charlie's got a 'job' to do. Having just left prison he finds one of his friends has attempted a high-risk job in Torino, Italy, right under the nose of the mafia. Charlie's friend doesn't get very far, so Charlie takes over the 'job'. Using three Mini Coopers, a couple of Jaguars, and a bus, he hopes to bring Torino to a standstill, steal a fortune in gold and escape in the chaos.",
                "popularity": 2.1616,
                "poster_path": "/8NOw3HPHkcBndJW2K6ofbcSb7WD.jpg",
                "release_date": "1969-06-02",
                "title": "The Italian Job",
                "video": false,
                "vote_average": 6.993,
                "vote_count": 804,
                "character": "Altabani",
                "credit_id": "52fe43829251416c7501339f",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/3TcUsPiVU0fSLX0Mk7lc3DDuzkY.jpg",
                "genre_ids": [
                    18,
                    10752
                ],
                "id": 24167,
                "original_language": "it",
                "original_title": "La ciociara",
                "overview": "A young widow flees from Rome during WWII and takes her lonely twelve-year-old-daughter to her rural hometown but the horrors of war soon catch up with them.",
                "popularity": 2.4711,
                "poster_path": "/biWDAUQD58enMEcyO2BqIVSycF4.jpg",
                "release_date": "1960-12-22",
                "title": "Two Women",
                "video": false,
                "vote_average": 7.832,
                "vote_count": 551,
                "character": "Giovanni",
                "credit_id": "52fe4487c3a368484e028141",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Раф Валлоне"
        ],
        "biography": "Raffaele \"Raf\" Vallone (17 February 1916 – 31 October 2002) was an Italian actor and an international film star.\n\nBorn in Tropea, Calabria, the son of a lawyer, Vallone attended Liceo classico Cavour in Turin, and studied Law and Philosophy at the University of Turin and entered his father's law firm. He played professional Football at a young age, playing in Serie A for Torino. He won an Italian Cup with his team in season 1935-1936. Subsequently, he became the editorial head of the culture section of L'Unità, then the official newspaper of the Italian Communist Party, and also a film and drama critic for the Turin newspaper La Stampa. During World War II, Vallone served with the Communist resistance.\n\nHis first film appearance was as a sailor in We the Living (1942), but Vallone was not interested in an acting career. Nevertheless, he was cast as a soldier competing with Vittorio Gassman for the love of Silvana Mangano in Riso amaro (Bitter Rice) (1949). The film became a neo-realist classic and Vallone was launched on an international career. In 2001 he published his autobiography, L'alfabeto della memoria, with Gremese (Rome).\n\nVallone was married to the actress Elena Varzi from 1952 until his death. They had three children, two of whom are actors, Eleonora Vallone and Saverio Vallone.\n\nHe died in Rome on 31 October 2002.\n\nDescription above from the Wikipedia article Raf Vallone, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1916-02-17",
        "deathday": "2002-10-31",
        "gender": 2,
        "homepage": null,
        "id": 3268,
        "imdb_id": "nm0885203",
        "known_for_department": "Acting",
        "name": "Raf Vallone",
        "place_of_birth": "Tropea, Calabria, Italy",
        "popularity": 0.4521,
        "profile_path": "/hdTagZJtaQ3tELU600rpUP5m6gL.jpg"
    }
}