{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jNG7pl0DkN1nzxnbZj4MCGf2VEG.jpg",
                "genre_ids": [
                    18,
                    10402
                ],
                "id": 65,
                "original_language": "en",
                "original_title": "8 Mile",
                "overview": "For Jimmy Smith, Jr., life is a daily fight just to keep hope alive. Feeding his dreams in Detroit's vibrant music scene, Jimmy wages an extraordinary personal struggle to find his own voice - and earn a place in a world where rhymes rule, legends are born and every moment… is another chance.",
                "popularity": 7.3905,
                "poster_path": "/7BmQj8qE1FLuLTf7Xjf9sdIHzoa.jpg",
                "release_date": "2002-11-08",
                "title": "8 Mile",
                "video": false,
                "vote_average": 7.144,
                "vote_count": 7537,
                "character": "Future",
                "credit_id": "52fe4212c3a36847f8001c57",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/rspbS1E9wJtslrb8amfJgtMBUVh.jpg",
                "genre_ids": [
                    27,
                    28
                ],
                "id": 924,
                "original_language": "en",
                "original_title": "Dawn of the Dead",
                "overview": "A group of survivors take refuge in a shopping mall after the world is taken over by aggressive, flesh-eating zombies.",
                "popularity": 6.2681,
                "poster_path": "/ttquyxStEEctzghtA2f4PUGprDr.jpg",
                "release_date": "2004-03-19",
                "title": "Dawn of the Dead",
                "video": false,
                "vote_average": 7.056,
                "vote_count": 4233,
                "character": "Andre",
                "credit_id": "52fe428ec3a36847f8027caf",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/bgkFOoXEQMRjKkCvgoj7smdGbuh.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 157350,
                "original_language": "en",
                "original_title": "Divergent",
                "overview": "In a world divided into factions based on personality types, Tris learns that she's been classified as Divergent and won't fit in. When she discovers a plot to destroy Divergents, Tris and the mysterious Four must find out what makes Divergents dangerous before it's too late.",
                "popularity": 9.2108,
                "poster_path": "/aNh4Q3iuPKDMPi2SL7GgOpiLukX.jpg",
                "release_date": "2014-03-14",
                "title": "Divergent",
                "video": false,
                "vote_average": 6.91,
                "vote_count": 13105,
                "character": "Max",
                "credit_id": "52fe4bc09251416c910e49fd",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Mekhi Thira Phifer",
            "مکی فایفر"
        ],
        "biography": "Mekhi Thira Phifer (born December 29, 1974) is an American actor. He is perhaps best known for his multi-year role as Dr. Greg Pratt on NBC's long-running medical drama ER and his co-starring role opposite Eminem in the feature film 8 Mile. He was a regular on the Fox crime show Lie to Me portraying the role of Ben Reynolds, before season 3. He was born in in Harlem, New York City, the son of Rhoda Phifer, a high school teacher; he grew up in a single-parent household with his mother. His acting career began in 1995, when Phifer attended an open casting call for director Spike Lee’s Clockers, beating over a thousand others to get the lead role as a narcotics dealer embroiled in a murder cover-up. He followed that role with another in the comedy spoof feature High School High (which also starred his former wife Malinda Williams) and continued by co-starring in the fright flick I Still Know What You Did Last Summer, starring Jennifer Love Hewitt and Freddie Prinze, Jr. Among Phifer’s other big-screen credits are Soul Food, The Biography of Spud Webb, Hell’s Kitchen, NYC, Tears of a Clown, O (as the titular character Odin a.k.a. O), and the thriller Uninvited Guest (as Silk). He appeared in Impostor as well as Paid in Full, 8 Mile, opposite Eminem and Dawn of the Dead. Phifer has a son, Omikaye, with his ex-wife, actress Malinda Williams. His second son, Mekhi Thira Phifer Jr., was born to his girlfriend Oni Souratha in Los Angeles on October 30, 2007.",
        "birthday": "1974-12-29",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 327,
        "imdb_id": "nm0001616",
        "known_for_department": "Acting",
        "name": "Mekhi Phifer",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 1.4033,
        "profile_path": "/jCvF0bpi9emIWBnu20MCMU0bwrf.jpg"
    }
}