{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tnwMCH4yLBY4qpe6Nr4n66u4U3f.jpg",
                "genre_ids": [
                    28,
                    80,
                    53
                ],
                "id": 400535,
                "original_language": "en",
                "original_title": "Sicario: Day of the Soldado",
                "overview": "Agent Matt Graver teams up with operative Alejandro Gillick to prevent Mexican drug cartels from smuggling terrorists across the United States border.",
                "popularity": 11.2139,
                "poster_path": "/qcLYofEhNh51Sk1jUWjmKHLzkqw.jpg",
                "release_date": "2018-06-27",
                "title": "Sicario: Day of the Soldado",
                "video": false,
                "vote_average": 6.939,
                "vote_count": 3815,
                "character": "Headmaster Deats",
                "credit_id": "59b1b001c3a3682c6208fee7",
                "order": 35
            },
            {
                "adult": false,
                "backdrop_path": "/2Jr2OBzoLLOYqQWnyN4eicZv0sL.jpg",
                "genre_ids": [
                    12,
                    10751
                ],
                "id": 606856,
                "original_language": "en",
                "original_title": "Togo",
                "overview": "The untold true story set in the winter of 1925 that takes you across the treacherous terrain of the Alaskan tundra for an exhilarating and uplifting adventure that will test the strength, courage and determination of one man, Leonhard Seppala, and his lead sled dog, Togo.",
                "popularity": 6.535,
                "poster_path": "/wX0QD36a80hxulcizz7tyahYOF8.jpg",
                "release_date": "2019-12-20",
                "title": "Togo",
                "video": false,
                "vote_average": 8.142,
                "vote_count": 2130,
                "character": "George Maynard",
                "credit_id": "5d349f882f8d097db9d20bbd",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Chris Heyerdahl",
            "克里斯多佛・海爾達"
        ],
        "biography": "Christopher Heyerdahl (born September 18, 1963) is a Canadian actor who portrayed Alastair in Supernatural, the Wraith Todd in Stargate Atlantis, Sam in Van Helsing, \"Swede\" in Hell on Wheels, and Marcus in The Twilight Saga.\n\nHeyerdahl was born in British Columbia, and is of Norwegian and Scottish descent. His father emigrated from Norway to Canada in the 1950s. Thor Heyerdahl was his father's cousin. Heyerdahl also speaks Norwegian and studied at the University of Oslo.\n\nHeyerdahl is primarily known for his recurring role as the enigmatic and sinister \"Swede\" in AMC's Hell on Wheels. This post-American Civil War drama debuted as the second highest rated original series in AMC history. He is also known for his role as Leonid in the Are You Afraid of the Dark? episode \"The Thirteenth Floor\" and as Nosferatu in the episode \"Midnight Madness\". He played the characters Halling and Wraith commander Todd in Stargate Atlantis, and Pallan in the Stargate SG-1 episode \"Revisions\".He played H. P. Lovecraft in the film Out of Mind: The Stories of H. P. Lovecraft (1998) and a punk, new at drug dealing, in Cadavres (2009).\n\nHe played the part of the demon Alastair in three episodes of Supernatural. He also played the part of Zor-El in the television series Smallville, as well as playing John Druitt and Bigfoot in the series Sanctuary. He played the part of Dieter Braun on True Blood during the show's 5th season.\n\nHis most notable film role was in the feature film New Moon, an adaptation of Stephenie Meyer's second book in her Twilight Saga. In this film, he played a vampire, Marcus, who is part of a powerful Italian family called the Volturi. He reprised that role in both parts of Breaking Dawn, the two-part adaptation of the fourth book in the Twilight Saga.\n\nHe has also performed on stage and was a member of the Young Company at the Stratford Festival in 1989 and 1990.",
        "birthday": "1963-09-18",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.christopherheyerdahl.com/",
        "id": 32887,
        "imdb_id": "nm0382216",
        "known_for_department": "Acting",
        "name": "Christopher Heyerdahl",
        "place_of_birth": "British Columbia, Canada",
        "popularity": 1.087,
        "profile_path": "/pTPZa3TFIkxRbqM5adXYE51a99s.jpg"
    }
}