{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dwxdn3ppDAn7QtaLlhGDEErWfg9.jpg",
                "genre_ids": [
                    18
                ],
                "id": 5708,
                "original_language": "en",
                "original_title": "Control",
                "overview": "The story of Joy Division’s lead singer Ian Curtis, from his schoolboy days in 1973 to his suicide on the eve of the band's first American tour in 1980.",
                "popularity": 2.976,
                "poster_path": "/jOJiaOhwrDdwqTRZvZOhbndqHGp.jpg",
                "release_date": "2007-09-12",
                "title": "Control",
                "video": false,
                "vote_average": 7.533,
                "vote_count": 881,
                "character": "Ian Curtis",
                "credit_id": "52fe441ac3a36847f808253f",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/4hfcpHmMEgmFTdnVx4XCtM6dgCG.jpg",
                "genre_ids": [
                    14,
                    12,
                    28,
                    10751,
                    10749
                ],
                "id": 102651,
                "original_language": "en",
                "original_title": "Maleficent",
                "overview": "A beautiful, pure-hearted young woman, Maleficent has an idyllic life growing up in a peaceable forest kingdom, until one day when an invading army threatens the harmony of the land. She rises to be the land's fiercest protector, but she ultimately suffers a ruthless betrayal – an act that begins to turn her heart into stone. Bent on revenge, Maleficent faces an epic battle with the invading King's successor and, as a result, places a curse upon his newborn infant Aurora. As the child grows, Maleficent realizes that Aurora holds the key to peace in the kingdom – and to Maleficent's true happiness as well.",
                "popularity": 12.703,
                "poster_path": "/bDG3yei6AJlEAK3A5wN7RwFXQ7V.jpg",
                "release_date": "2014-05-28",
                "title": "Maleficent",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 13412,
                "character": "Diaval",
                "credit_id": "52fe4a0cc3a36847f81b5cdb",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/j82SfPOqas5rvHbAHAPq7OgaSir.jpg",
                "genre_ids": [
                    18,
                    10749,
                    10752
                ],
                "id": 271674,
                "original_language": "en",
                "original_title": "Suite Française",
                "overview": "France, 1940. In the first days of occupation, beautiful Lucile Angellier is trapped in a stifled existence with her controlling mother-in-law as they both await news of her husband: a prisoner of war. Parisian refugees start to pour into their small town, soon followed by a regiment of German soldiers who take up residence in the villagers' own homes. Lucile initially tries to ignore Bruno von Falk, the handsome and refined German officer staying with them. But soon, a powerful love draws them together and leads them into the tragedy of war.",
                "popularity": 4.1596,
                "poster_path": "/mPgijY9f79FfD7K8MmzsynXpq0R.jpg",
                "release_date": "2015-03-12",
                "title": "Suite Française",
                "video": false,
                "vote_average": 7.259,
                "vote_count": 1122,
                "character": "Benoit Labarie",
                "credit_id": "53801fc6c3a36805980045b6",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/q9mF0HhnKT5deOIRAQSFjhLC8c1.jpg",
                "genre_ids": [
                    10751,
                    14,
                    12,
                    28
                ],
                "id": 420809,
                "original_language": "en",
                "original_title": "Maleficent: Mistress of Evil",
                "overview": "Maleficent and her goddaughter Aurora begin to question the complex family ties that bind them as they are pulled in different directions by impending nuptials, unexpected allies, and dark new forces at play.",
                "popularity": 6.7741,
                "poster_path": "/vloNTScJ3w7jwNwtNGoG8DbTThv.jpg",
                "release_date": "2019-10-16",
                "title": "Maleficent: Mistress of Evil",
                "video": false,
                "vote_average": 7.304,
                "vote_count": 6298,
                "character": "Diaval",
                "credit_id": "5c8450e0c3a3684e9ddb55f9",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "سم رایلی"
        ],
        "biography": "He is best known for playing the lead role of Ian Curtis in the movie Control, a biopic about the lead singer of the 1970s post-punk band Joy Division. His performance in the role won him the British Independent Film Award for \"Most Promising Newcomer\".[1]. He also won a Kermode for Best Actor 2007 for the film.  Prior to his portrayal of Ian Curtis, Riley played The Fall frontman Mark E. Smith in the Michael Winterbottom film 24 Hour Party People, which details the Factory Records era. His scenes, however, were omitted from the final cut.  In September 2007, Riley was cast in Gerald McMorrow's British science fiction film Franklyn. He will play a lead role in 13, an English-language remake of the French thriller 13 Tzameti. He is currently playing the role of Pinkie Brown in a remake of Brighton Rock alongside Helen Mirren.",
        "birthday": "1980-01-08",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 32987,
        "imdb_id": "nm0727165",
        "known_for_department": "Acting",
        "name": "Sam Riley",
        "place_of_birth": "Leeds, West Yorkshire, England, UK ",
        "popularity": 0.6394,
        "profile_path": "/cpym1mwaXMGvOCXy967hdp0oSgD.jpg"
    }
}