{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8UZfEjAlFq1iUiAkHMkJViq4ZO0.jpg",
                "genre_ids": [
                    53,
                    9648,
                    27
                ],
                "id": 11033,
                "original_language": "en",
                "original_title": "Dressed to Kill",
                "overview": "After witnessing a mysterious woman brutally slay a homemaker, prostitute Liz Blake finds herself trapped in a dangerous situation. While the police thinks she is the murderer, the real killer is intent on silencing her only witness.",
                "popularity": 3.5418,
                "poster_path": "/oy1m5dd44foNrxV8U9l6Walx82V.jpg",
                "release_date": "1980-07-25",
                "title": "Dressed to Kill",
                "video": false,
                "vote_average": 6.959,
                "vote_count": 1037,
                "character": "Peter Miller",
                "credit_id": "52fe43e79251416c75022987",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/4ZQIEbCwrD1cTvslORZcrNtQqYO.jpg",
                "genre_ids": [
                    27
                ],
                "id": 8769,
                "original_language": "en",
                "original_title": "Christine",
                "overview": "Nerdy high schooler Arnie Cunningham falls for Christine, a rusty 1958 Plymouth Fury, and becomes obsessed with restoring the classic automobile to her former glory. As the car changes, so does Arnie, whose newfound confidence turns to arrogance behind the wheel of his exotic beauty. Arnie's girlfriend Leigh and best friend Dennis reach out to him, only to be met by a Fury like no other.",
                "popularity": 4.6379,
                "poster_path": "/mMtUJke2TtIoT6JB9hkvERmsSu8.jpg",
                "release_date": "1983-12-09",
                "title": "Christine",
                "video": false,
                "vote_average": 6.871,
                "vote_count": 2094,
                "character": "Arnie Cunningham",
                "credit_id": "52fe44b8c3a36847f80a647b",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/u218sykbUQIh6EWtTdJzguU5LcG.jpg",
                "genre_ids": [
                    18
                ],
                "id": 16858,
                "original_language": "en",
                "original_title": "All That Jazz",
                "overview": "Joe Gideon is at the top of the heap, one of the most successful directors and choreographers in musical theater. But he can feel his world slowly collapsing around him - his obsession with work has almost destroyed his personal life, and only his bottles of pills keep him going.",
                "popularity": 2.5928,
                "poster_path": "/culCEdj4srLljefgn4XKd6k3C5t.jpg",
                "release_date": "1979-12-16",
                "title": "All That Jazz",
                "video": false,
                "vote_average": 7.505,
                "vote_count": 544,
                "character": "Young Joe",
                "credit_id": "52fe46f09251416c750888ff",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Keith Gordon (born February 3, 1961) is an American actor and film director. He was born in New York City, the son of Mark, an actor and stage director, and Barbara Gordon. He grew up in an atheist Jewish family. Gordon was inspired to become an actor at the age of twelve, after seeing James Earl Jones in a Broadway production of Of Mice and Men.\n\nAs an actor, Gordon's first feature film role was that of class clown Doug in Jaws 2 (the 1978 sequel to the blockbuster hit Jaws). In 1979 Gordon appeared in Bob Fosse's semi-autobiographical All That Jazz as the teenage version of the film's protagonist Joe Gideon (played by Gordon's Jaws 2 co-star Roy Scheider). Gordon then appeared in two films by Brian De Palma: as a film student in Home Movies (1979) and in the 1980 erotic thriller Dressed to Kill as the son of Angie Dickinson's character. Gordon played Arnie Cunningham, the main character (who buys the titular car Christine), in the 1983 horror film Christine, directed by John Carpenter from the novel by Stephen King. In the 1985 cult film The Legend of Billie Jean Gordon played Lloyd Muldaur, the son of a District Attorney who aspires to be Attorney General. He was in the 1986 Mark Romanek film Static, and he wrote the screenplay. In the 1986 comedy movie Back to School, Gordon played Jason Melon, the son of Rodney Dangerfield's character.[4] In most of these films, he played a nerd. He was named number 1 in Cinematicals' Top 7 Most Convincing Nerds. His most recent onscreen film appearance was in 2001, in the movie Delivering Milo.\n\nGordon left acting for directing, making his debut in 1988 with the movie The Chocolate War, about a student who rebels against the rigid hierarchies in his Catholic school. His other films include the 1992 anti-war film A Midnight Clear, about a group of American soldiers in the Ardennes just before and during the Battle of the Bulge, as well as Mother Night (adapted from the novel by Kurt Vonnegut), Waking the Dead, and the film The Singing Detective. He also directed some of the mini-series Wild Palms and appeared in the 2006 Iraq War documentary Whose War?. His directing credits for television include Homicide: Life on the Street, Gideon's Crossing, Dexter, The Bridge, House and the second and third seasons of Fargo.\n\nDescription above from the Wikipedia article Keith Gordon licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1961-02-03",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 33054,
        "imdb_id": "nm0330360",
        "known_for_department": "Directing",
        "name": "Keith Gordon",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.3804,
        "profile_path": "/qh2MpLx2B5CYZVKJz2VLXEuRMBC.jpg"
    }
}