{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/v5xXTpfMT5NpjQeDMNYNLflaiuA.jpg",
                "genre_ids": [
                    16,
                    10751
                ],
                "id": 13002,
                "original_language": "en",
                "original_title": "Barbie in the 12 Dancing Princesses",
                "overview": "King Randolph sends for his cousin, Duchess Rowena, to help turn his daughters, Princess Genevieve and her eleven sisters, into royal material. But the Duchess strips the sisters of their fun, including their favorite pastime: dancing. When all hope may be lost, the sisters discover a secret passageway to a magical land where they can dance the night away.",
                "popularity": 4.2046,
                "poster_path": "/yBB7PwXRFJ29U8m8SnTcWVizFvM.jpg",
                "release_date": "2006-09-19",
                "title": "Barbie in the 12 Dancing Princesses",
                "video": false,
                "vote_average": 7.606,
                "vote_count": 1217,
                "character": "Edeline (voice)",
                "credit_id": "52fe452e9251416c7504e451",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/c2wkRgqYlWdT3yejyO8kdwgepSd.jpg",
                "genre_ids": [
                    16,
                    10751,
                    12,
                    14
                ],
                "id": 13285,
                "original_language": "en",
                "original_title": "Barbie Fairytopia: Mermaidia",
                "overview": "In this animated follow-up to Fairytopia, Elina enlists the help of a mermaid, Nori, to save her friend Nalu, a merman prince who has been captured by the wicked Laverna.",
                "popularity": 3.9289,
                "poster_path": "/uBCvRThFwjvwNQeS3Vy7xMPc0Rh.jpg",
                "release_date": "2006-03-14",
                "title": "Barbie Fairytopia: Mermaidia",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 719,
                "character": "Nori (voice)",
                "credit_id": "52fe45569251416c750530af",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/s8ftvFvafWWEhApISamHx32bx6h.jpg",
                "genre_ids": [
                    12,
                    28,
                    878
                ],
                "id": 36658,
                "original_language": "en",
                "original_title": "X2",
                "overview": "Professor Charles Xavier and his team of genetically gifted superheroes face a rising tide of anti-mutant sentiment led by Col. William Stryker. Storm, Wolverine and Jean Grey must join their usual nemeses—Magneto and Mystique—to unhinge Stryker's scheme to exterminate all mutants.",
                "popularity": 0.4027,
                "poster_path": "/bWMw0FMsY8DICgrQnrTSWbzEgtr.jpg",
                "release_date": "2003-04-27",
                "title": "X2",
                "video": false,
                "vote_average": 7.032,
                "vote_count": 10511,
                "character": "White House Tour Guide",
                "credit_id": "52fe45fe9251416c910458a9",
                "order": 23
            },
            {
                "adult": false,
                "backdrop_path": "/wWWXd27yF8sK9bLgAD4zxiGcYJW.jpg",
                "genre_ids": [
                    10751,
                    16
                ],
                "id": 44874,
                "original_language": "en",
                "original_title": "Barbie: A Fashion Fairytale",
                "overview": "Join Barbie in a colourful, modern-day fairytale filled with fashion, friends and fun! Barbie and her dog Sequin jet off to visit her Aunt's amazing fashion house in Paris, and much to her surprise it's about to be shut down forever. After she discovers three enchanting Flairies with sparkle-magic powers, Barbie comes up with a brilliant idea to save the business. She even inspires Alice, a shy fashion designer, and together they create a dazzling runway fashion show. Barbie shows that magic happens when you believe in yourself.",
                "popularity": 2.4678,
                "poster_path": "/bFnf8f8DXdCANQ7Y62djgubhh4P.jpg",
                "release_date": "2010-09-14",
                "title": "Barbie: A Fashion Fairytale",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 772,
                "character": "Shyne (voice)",
                "credit_id": "5cfbbac40e0a261b12cacf57",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Chiara Zanni (born July 19, 1978) is a Canadian actress and comedian. She is known for her roles as Amy Ryan on The N series About a Girl and Maggie Buckman on the CBC series Edgemont. She is also known for her voice-work as Hahli in Bionicle: Mask of Light, the titular character in Hamtaro, Jubilee in X-Men: Evolution, Eva \"Molly\" Wei in Ōban Star-Racers, Piper in Storm Hawks, Stellaluna in the film adaptation of Stellaluna, and Kani Maki in Sushi Pack. Zanni was born in Vancouver, British Columbia, to an Italian father and an English mother. She started her career at the age of eight when she was cast as the \"Pokey Little Puppy\" in the animated series Little Golden Bookland. She has appeared in the feature films X-Men, 40 Days and 40 Nights, Come l'America, In the Land of Women and Good Luck Chuck. Her television credits include Supernatural, Stargate Atlantis, Edgemont, Trophy Wife, Bye Bye Birdie, 1st to Die and Post Mortem. She has also provided voice-work to projects such as Zeke's Pad, Hamtaro, Trollz, My Little Pony, Polly Pockets, Barbie: Fairytopia, X-Men: Evolution, Sabrina: The Animated Series, Bionicle: Mask of Light, Inuyasha, Storm Hawks, and Ōban Star-Racers. In 2013, she made her Los Angeles voice acting debut with Henry Hugglemonster. She voiced Daring Do in My Little Pony: Friendship is Magic, and she has appeared in MLP conventions in Vancouver and Richmond. Zanni is married and is a Christian.",
        "birthday": "1978-07-19",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 33053,
        "imdb_id": "nm0953065",
        "known_for_department": "Acting",
        "name": "Chiara Zanni",
        "place_of_birth": "Vancouver, British Columbia, Canada",
        "popularity": 0.4142,
        "profile_path": "/dq1rqHIpRV9F5guFupyxglIix4a.jpg"
    }
}