{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6q6iWqADBkXmOG7IJ3FgQxPzRNE.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 883,
                "original_language": "en",
                "original_title": "Coffee and Cigarettes",
                "overview": "An anthology of eleven vignettes featuring star-studded casts of extremely unique individuals who all share the common activities of conversing while drinking coffee and smoking cigarettes.",
                "popularity": 1.4246,
                "poster_path": "/pfG02QCsutx3PIxFS8UY4iM9AsS.jpg",
                "release_date": "2004-03-12",
                "title": "Coffee and Cigarettes",
                "video": false,
                "vote_average": 6.91,
                "vote_count": 983,
                "character": "Meg (segment \"Jack Shows Meg His Tesla Coil\")",
                "credit_id": "6887b1b3aaded2ad6652b616",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Megan Martha \"Meg\" White",
            "Megan Martha White",
            "Megan White",
            "Penny Farthing",
            "The White Stripes"
        ],
        "biography": "Megan Martha White is an American drummer known for her work with Jack White in the Detroit rock duo the White Stripes. The band are considered central figures of the garage rock revival movement of the 2000s, selling over 5 million albums and winning six Grammy Awards. Meg's drumming has been described as primal and minimalist, and has been praised by musicians such as Dave Grohl, Tré Cool and Tom Morello. Born on December 10, 1974, in Grosse Pointe Farms, Michigan, White met Jack Gillis while working at a restaurant in Royal Oak. They married in 1996, with Jack taking her last name, and formed the White Stripes together, whose name and aesthetics were influenced by her love of peppermints. The duo went on to gain notoriety in Michigan's underground garage rock scene. After releasing their debut album in 1999, the couple divorced but continued with the band, achieving mainstream success in 2001 with their breakthrough single Fell in Love with a Girl off of their third album, White Blood Cells, which garnered three MTV Music Awards. Their fourth album, Elephant, won the Grammy Award for Best Alternative Music Album, with Seven Nation Army winning for Best Rock Song. In 2003, she and Jack appeared in Jim Jarmusch's film Coffee and Cigarettes, and the following year, Meg appeared in the music video for the Detroit Cobras' Cha Cha Twist. In September 2007, Meg was diagnosed with acute anxiety disorder, which curtailed the rest of the tour for what would be their final album, Icky Thump. On February 2, 2011, the White Stripes disbanded amicably. Meg resides in Detroit and has retired from public life.",
        "birthday": "1974-12-10",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 3309213,
        "imdb_id": "nm1353108",
        "known_for_department": "Acting",
        "name": "Meg White",
        "place_of_birth": "Grosse Pointe Farms, Michigan, USA",
        "popularity": 0.0707,
        "profile_path": "/uIxz09EBhOkq9Moe22T966asvVE.jpg"
    }
}