{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ubICMSUij3ntP9BjnQsV3rTVnAF.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 783,
                "original_language": "en",
                "original_title": "Gandhi",
                "overview": "In the early years of the 20th century, Mohandas K. Gandhi, a British-trained lawyer, forsakes all worldly possessions to take up the cause of Indian independence. Faced with armed resistance from the British government, Gandhi adopts a policy of 'passive resistance', endeavouring to win freedom for his people without resorting to bloodshed.",
                "popularity": 4.3456,
                "poster_path": "/rOXftt7SluxskrFrvU7qFJa5zeN.jpg",
                "release_date": "1982-12-01",
                "title": "Gandhi",
                "video": false,
                "vote_average": 7.557,
                "vote_count": 2390,
                "character": "Brigadier",
                "credit_id": "55f7684b9251410f3e0012cb",
                "order": 95
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "James Cossins (4 December 1933 – 12 February 1997) was an English actor. Born in Beckenham, Kent, he became widely recognised as the abrupt, bewildered Mr Walt in the Fawlty Towers episode \"The Hotel Inspectors\" and as Mr Watson, the frustrated Public Relations training course instructor, in an episode of Some Mothers Do 'Ave 'Em.\n\nCossins was born in Beckenham and educated at the City of London School. After serving in the Royal Air Force, he trained at Royal Academy of Dramatic Art, where he won the silver medal in 1952.\n\nCossins first appeared in repertory theatre and at the Nottingham Playhouse. He played a wide range of characters throughout his colourful and extensive career on television and stage, often portraying blustering, pompous, crusty and cantankerous characters. Cossins appeared in Charley's Aunt at the Apollo Theatre in 1971 with Tom Courtenay, David Horovitch, Garth Forwood, Joanna McCallum, and Celia Bannerman. He appeared in more than forty films, including The Anniversary (recreating his West End stage role), and The Lost Continent (both 1968), Gandhi (1982), and The Man with the Golden Gun (1974).\n\nOn the small screen, Cossins appeared as a guest in a variety of shows, including The Likely Lads and Whatever Happened to the Likely Lads?, Minder, Bergerac, The Sweeney, Bless This House, Shadows, All Creatures Great and Small, Citizen Smith, Just William, The Good Life, L for Lester, Neville Dennis in Callan \"Rules of the Game\" (1972), Z-Cars, and as the regular character Bruce Westrop (in 1979) in Emmerdale Farm. He also played Major Bagstock in Dombey and Son (1983), and appeared in the first series of All in Good Faith in 1985. He played a magistrate in episodes of four different British sitcoms, Whatever Happened to the Likely Lads?, The Good Life, Citizen Smith and Minder.\n\nCossins's later appearances were limited by ill health and he lived in semi-retirement in Surrey. Cossins died from heart disease at the age of 63, in 1997",
        "birthday": "1933-12-04",
        "deathday": "1997-02-12",
        "gender": 2,
        "homepage": null,
        "id": 33109,
        "imdb_id": "nm0167839",
        "known_for_department": "Acting",
        "name": "James Cossins",
        "place_of_birth": "Beckenham, Kent, England, UK",
        "popularity": 0.164,
        "profile_path": "/i0xmXmli13odEyslR85JhlkQ7wI.jpg"
    }
}