{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sOJqNAx4RFrCRn8HS99LEc8aenI.jpg",
                "genre_ids": [
                    18,
                    10749,
                    36
                ],
                "id": 331482,
                "original_language": "en",
                "original_title": "Little Women",
                "overview": "Four sisters come of age in America in the aftermath of the Civil War.",
                "popularity": 7.0376,
                "poster_path": "/yn5ihODtZ7ofn8pDYfxCmxh8AXI.jpg",
                "release_date": "2019-12-25",
                "title": "Little Women",
                "video": false,
                "vote_average": 7.863,
                "vote_count": 6540,
                "character": "Young Meg (uncredited)",
                "credit_id": "6194596bd768fe008e4c32c7",
                "order": 74
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Amber Leanne Rothberg"
        ],
        "biography": "Amber took an interest in professional acting at age 11. Her first time on set was in \"Little Women\" where she portrayed Young Meg in a flashback scene. Since then she has worked in independent films, commercials and voice-over projects.. Amber has been cast as the lead in her first feature, \"It's Alright Now\"; a coming-of-age film based on true events. She has recently booked a few other exciting projects filming later this year. She is ready to show the world her intense emotional range in television and film as opportunities continue.\n\nAmber has been training with some top NY and LA acting coaches such as Emmy award winning, casting director, Amber Horn, actor, Kevin Chamberlin, Katie Pohlman and Disney director, Wendy Faraone. She is an honors student in high school where her focus is on psychology and the arts, as well as learning American Sign Language as an independent study.\n\nIn addition to acting, Amber enjoys writing, singing, playing ukulele, ice skating, roller skating, swimming, modeling and cooking. Pizza is her favorite! She is an advocate for environmental and animal welfare causes.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 3312731,
        "imdb_id": "nm10107404",
        "known_for_department": "Acting",
        "name": "Amber Rothberg",
        "place_of_birth": null,
        "popularity": 0.0168,
        "profile_path": "/yWyXeobYYjeowyZrPBZBh1eizwT.jpg"
    }
}