{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9ZznETDyfPWVugRiv0jfGrkRftw.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 937278,
                "original_language": "en",
                "original_title": "A Man Called Otto",
                "overview": "When a lively young family moves in next door, grumpy widower Otto Anderson meets his match in a quick-witted, pregnant woman named Marisol, leading to an unlikely friendship that turns his world upside down.",
                "popularity": 8.7533,
                "poster_path": "/130H1gap9lFfiTF9iDrqNIkFvC9.jpg",
                "release_date": "2022-12-28",
                "title": "A Man Called Otto",
                "video": false,
                "vote_average": 7.76,
                "vote_count": 3238,
                "character": "Neighbor at Shower (uncredited)",
                "credit_id": "6792b113d515b24f30fbf7be",
                "order": 53
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Steph"
        ],
        "biography": "Stephanie Swift started her film career 7 years ago with D'Ambro Productions \"The Painted\" as an abusive and terrifying mother, Mrs. Pomeroy. Since 2016, Stephanie has been in 35 short films and 14 feature films; highlights are Dr. Brady in the Cineworx film, \"Massacre Academy\", Sadie in \"Lingerithm\" for the 2021 Cleveland 48 HFP (which won 6 awards including Best Film) and in her award-winning 2021 Best Scream Queen 48 HFP Horror and Sci-Fi performance as Sandra in, \"Hasenpfeffer\" by Shadowframe Productions. She portrayed special agent Flynn in the 2021 found footage film, \"Red Woods\" by On Beat Productions and will be seen in the feature, \"Treaters\" as the Matriarch and in the Star Wars fan film \"The Fallen Apprentice\" as Master Elanor Arranda in 2023. She is proud to have performed as Janie in \"Macabre Mountain\", which features Xander Goldman, Felissa Rose, and Dave Sheridan.\n\nStephanie is a versatile actress that has been performing since the age of 10. Her first production was \"Oliver\" with Musical Theatre Guild in the role of the loud-mouthed, British brat, Charlotte. After multiple credits on the stages around Butler, PA, Stephanie attended Chatham College in Pittsburgh where she starred in main stage productions from \"Jesus Christ Superstar\" to \"A Christmas Carol\". Other than theatre, Stephanie studied dance (tap, ballet, jazz and gymnastics) at Lee's School of Dance as well as private voice lessons under Dr. Peggy Ross-Mehl. Local theatrical performance venues range from The New Olde Bank Theatre, McKeesport Little Theatre, Apple Hill Playhouse, Butler Little Theatre, Poor Yorick's Players, American Performing Arts Company, and the Point Park Cinema Arts venue. Numerous productions later; her dream of playing Mary Hatch in \"It's a Wonderful Life; The Radio Play\" was realized at the Theatre Factory.\n\nThe transition to film and voice over work in 2016 was a welcome change, and she has over 40 film voice overs and industrials to her credit. Stephanie is married to fellow actor and soulmate, Rick Dutrow. She is represented by Heyman Talent Group in Columbus and The Talent Group in Pittsburgh. She is managed by Spencer Folmar and American Talent Management.\n\n- IMDb Mini Biography By: Stephanie Swift",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 3313822,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Stephanie Swift",
        "place_of_birth": null,
        "popularity": 0.1027,
        "profile_path": "/rMvUJ0WdjRbWWLTb7r0ZlTWE3lR.jpg"
    }
}