{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uxjPyKutAtw7lHZ3mHg0MzQvAK9.jpg",
                "genre_ids": [
                    9648,
                    18,
                    53
                ],
                "id": 10403,
                "original_language": "en",
                "original_title": "The Player",
                "overview": "A Hollywood studio executive is being sent death threats by a writer whose script he rejected - but which one?",
                "popularity": 3.3836,
                "poster_path": "/tZ3kDut2dhFVGkWNEn9xoCHCNAx.jpg",
                "release_date": "1992-05-08",
                "title": "The Player",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 879,
                "character": "Harry Belafonte",
                "credit_id": "52fe43689251416c7500f267",
                "order": 34
            },
            {
                "adult": false,
                "backdrop_path": "/gMVdhfQ7q9DFHhDkehrququjGPd.jpg",
                "genre_ids": [
                    80,
                    35,
                    18,
                    36
                ],
                "id": 487558,
                "original_language": "en",
                "original_title": "BlacKkKlansman",
                "overview": "Colorado Springs, late 1970s. Ron Stallworth, an African American police officer, and Flip Zimmerman, his Jewish colleague, run an undercover operation to infiltrate the Ku Klux Klan.",
                "popularity": 4.6314,
                "poster_path": "/8jxqAvSDoneSKRczaK8v9X5gqBp.jpg",
                "release_date": "2018-08-09",
                "title": "BlacKkKlansman",
                "video": false,
                "vote_average": 7.492,
                "vote_count": 7793,
                "character": "Jerome Turner",
                "credit_id": "5b552847c3a3685c8200b713",
                "order": 27
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Harold George Bellanfanti Jr."
        ],
        "biography": "Harry Belafonte (born Harold George Bellanfanti Jr.; March 1, 1927 – April 25, 2023) was an American singer, actor and activist, who popularized calypso music with international audiences in the 1950s. Belafonte is one of the few performers to have received an Emmy, Grammy, Oscar, and Tony (EGOT), although he won the Oscar in a non-competitive category. He earned his career breakthrough with the album Calypso (1956), which was the first million-selling LP by a single artist.\n\nBelafonte was best known for his recordings of \"Day-O (The Banana Boat Song)\", \"Jump in the Line (Shake, Senora)\", \"Jamaica Farewell\", and \"Mary's Boy Child\". He recorded and performed in many genres, including blues, folk, gospel, show tunes, and American standards. He also starred in films such as Carmen Jones (1954), Island in the Sun (1957), Odds Against Tomorrow (1959), Buck and the Preacher (1972), and Uptown Saturday Night (1974). He made his final screen appearance in Spike Lee's BlacKkKlansman (2018).\n\nBelafonte considered the actor, singer, and activist Paul Robeson a mentor, and he was a close confidant of Martin Luther King Jr. during the Civil Rights Movement of the 1950s and 1960s. He was a vocal critic of the policies of the George W. Bush and Donald Trump administrations. Belafonte acted as the American Civil Liberties Union celebrity ambassador for juvenile justice issues.\n\nBelafonte won three Grammy Awards (including a Grammy Lifetime Achievement Award), an Emmy Award, and a Tony Award. In 1989, he received the Kennedy Center Honors. He was awarded the National Medal of Arts in 1994. In 2014, he received the Jean Hersholt Humanitarian Award at the Academy's 6th Annual Governors Awards and in 2022 was inducted into the Rock and Roll Hall of Fame in the Early Influence category.\n\nDescription above from the Wikipedia article Harry Belafonte, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1927-03-01",
        "deathday": "2023-04-25",
        "gender": 2,
        "homepage": null,
        "id": 33162,
        "imdb_id": "nm0000896",
        "known_for_department": "Acting",
        "name": "Harry Belafonte",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.2766,
        "profile_path": "/8x9zZS36gSOKiTnUwoBqYKvnYg6.jpg"
    }
}