{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/p47ihFj4A7EpBjmPHdTj4ipyq1S.jpg",
                "genre_ids": [
                    18
                ],
                "id": 599,
                "original_language": "en",
                "original_title": "Sunset Boulevard",
                "overview": "A hack screenwriter writes a screenplay for a former silent film star who has faded into Hollywood obscurity.",
                "popularity": 5.7842,
                "poster_path": "/sC4Dpmn87oz9AuxZ15Lmip0Ftgr.jpg",
                "release_date": "1950-08-10",
                "title": "Sunset Boulevard",
                "video": false,
                "vote_average": 8.293,
                "vote_count": 2743,
                "character": "H.B. Warner",
                "credit_id": "52fe425ac3a36847f8017c55",
                "order": 14
            },
            {
                "adult": false,
                "backdrop_path": "/3q35nBLCIdEbxYfsr7D5ocYQXKz.jpg",
                "genre_ids": [
                    18,
                    10751,
                    14
                ],
                "id": 1585,
                "original_language": "en",
                "original_title": "It's a Wonderful Life",
                "overview": "A holiday favourite for generations...  George Bailey has spent his entire life giving to the people of Bedford Falls.  All that prevents rich skinflint Mr. Potter from taking over the entire town is George's modest building and loan company.  But on Christmas Eve the business's $8,000 is lost and George's troubles begin.",
                "popularity": 6.3809,
                "poster_path": "/bSqt9rhDZx1Q7UZ86dBPKdNomp2.jpg",
                "release_date": "1946-12-20",
                "title": "It's a Wonderful Life",
                "video": false,
                "vote_average": 8.272,
                "vote_count": 4589,
                "character": "Mr. Gower",
                "credit_id": "52fe4301c3a36847f8033579",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/9AjG0YJLgDUtHl5KgrThHPhNNwZ.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 3083,
                "original_language": "en",
                "original_title": "Mr. Smith Goes to Washington",
                "overview": "After the death of a United States Senator, idealistic Jefferson Smith is appointed as his replacement in Washington. Soon, the naive and earnest new senator has to battle political corruption.",
                "popularity": 2.8661,
                "poster_path": "/nDjg1fbNyq15excNDl3acd2IqAk.jpg",
                "release_date": "1939-10-19",
                "title": "Mr. Smith Goes to Washington",
                "video": false,
                "vote_average": 7.846,
                "vote_count": 1117,
                "character": "Senate Majority Leader",
                "credit_id": "52fe4384c3a36847f805a04f",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/3e3dVaVrla2GH6CWKbNRjTvk3s8.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 6844,
                "original_language": "en",
                "original_title": "The Ten Commandments",
                "overview": "Escaping death, a Hebrew infant is raised in a royal household to become a prince. Upon discovery of his true heritage, Moses embarks on a personal quest to reclaim his destiny as the leader and liberator of the Hebrew people.",
                "popularity": 10.0884,
                "poster_path": "/3Ei59AR64x6dMZfWobPCkZjbqTL.jpg",
                "release_date": "1956-10-05",
                "title": "The Ten Commandments",
                "video": false,
                "vote_average": 7.769,
                "vote_count": 1743,
                "character": "Amminadab",
                "credit_id": "58aca44d9251416f400003ec",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Harry Byron Lickfold",
            "Henry B. Warner",
            "H. B. Warner",
            "Henry Byron Warner"
        ],
        "biography": "Henry Byron Warner (often credited as H.B. Warner; 25 October 1875 – 21 December 1958) was an English actor. He was the definitive cinematic Jesus Christ in Cecil B. DeMille's The King of Kings  (1927). He was born into a prominent theatrical family on October 26,  1875 in London. His father was Charles Warner, and his grandfather was  James Warner, both prominent English actors. He replaced J.B. Warner as Jesus in The King of Kings  (1927) when J.B. died of tuberculosis at age 29. (J.B. was not Henry's  brother. J.B. had taken the professional last name \"Warner\" because  Henry's family took him in.)\n\nHenry Warner's family wanted him to  become a doctor, and he graduated from London University but eventually  gave up his medical studies. The theater was in his blood, and he  studied acting in Paris and Italy before joining his father's stock  company, making his debut in the English production of \"Drink.\" It was  from his father that he honed his craft.\n\nWarner made it to  America in the early 1900s, after touring the British Empire. Billed as  Harry Warner, he made his Broadway debut in the American colonial drama  \"Audrey\" at Hoyt's Theatre on November 24, 1902, starring James O'Neill, the father of playwright Eugene O'Neill.  He was billed as H.B. Warner in his next appearance on Broadway, in the  1906 comedy \"Nurse Marjorie.\" He appeared in 13 more Broadway  productions in his career, from the twin-bill of \"Susan in Search of a  Husband\" & \"A Tenement Tragedy\" (also 1906) to \"Silence\" in 1925.\n\nHe moved into motion pictures, making his debut in the Mutual short Harp of Tara (1914). Also in 1914, he appeared in a film written by Cecil B. DeMille for Famous Players Lasky, The Ghost Breaker  (1914), in which he had played on Broadway the year before. Warner  became a leading man and a star in silent pictures, reaching the zenith  of his career playing Jesus in DeMille's The King of Kings  (1927). His excellent performance was actually enhanced by the silent  screen, allowing the audience to imagine how Jesus would sound. Warner  could be extremely moving in silent pictures, notably in the melodrama Sorrell and Son (1927) as a war veteran father who sacrifices all for his son.\n\nWhen talkies arrived, he became a busy supporting player. A favorite of Frank Capra , appeared in Mr. Deeds Goes to Town (1936). Cast again by Capra, he was nominated for Best Supporting Actor in Lost Horizon (1937). He also appeared in You Can't Take It with You (1938), and Mr. Smith Goes to Washington (1939). Other major talkies included The Devil and Daniel Webster (1941) and Topper Returns (1941). Other than Jesus, the role he is best remembered role for today is in It's a Wonderful Life  (1946), in which he played Mr. Gower, the druggist who is saved from  committing a lethal medication error by the young George Bailey (the James Stewart character as a child). H.B. Warner appeared in Sunset Blvd. (1950) as himself. His last credited role was as Amminadab in DeMille's The Ten Commandments (1956), a remake of the earlier silent The Ten Commandments (1923). He last role was an uncredited bit part in Darby's Rangers (1958).",
        "birthday": "1875-10-25",
        "deathday": "1958-12-21",
        "gender": 2,
        "homepage": null,
        "id": 33278,
        "imdb_id": "nm0912478",
        "known_for_department": "Acting",
        "name": "H.B. Warner",
        "place_of_birth": "London, England, UK",
        "popularity": 0.1399,
        "profile_path": "/be4wXVyhbvdbViK0gOZSrdbfie8.jpg"
    }
}