{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ft8WRF2xqEwwGWa59naDUybKTAx.jpg",
                "genre_ids": [
                    18,
                    10752,
                    10749
                ],
                "id": 770,
                "original_language": "en",
                "original_title": "Gone with the Wind",
                "overview": "The spoiled daughter of a Georgia plantation owner conducts a tumultuous romance with a cynical profiteer during the American Civil War and Reconstruction Era.",
                "popularity": 7.332,
                "poster_path": "/lNz2Ow0wGCAvzckW7EOjE03KcYv.jpg",
                "release_date": "1939-12-15",
                "title": "Gone with the Wind",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 4191,
                "character": "Emmy Slattery",
                "credit_id": "52fe4274c3a36847f801fea1",
                "order": 26
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Isabel Jewel",
            "Isobel Jewell"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nIsabel Jewell (July 19, 1907 – April 5, 1972) was an American actress most active in the 1930s and early 1940s. Some of her most famous films were Ceiling Zero, Marked Woman, A Tale of Two Cities, and Gone With the Wind.  After years in theater stock companies, including an 87-week stint in Lincoln, Nebraska, she hit the big time after getting a part on Broadway in Up Pops the Devil (1930). She received glowing critical reviews for Blessed Event (1932) as well.\n\nJewell's film debut came in Blessed Event (1932). She had been brought to Hollywood by Warner Brothers for the film version of Up Pops the Devil. Jewell gained other supporting roles, appearing in a variety of films in the early 1930s. She played stereotypical gangsters' women in such films as Manhattan Melodrama (1934) and Marked Woman (1937). She was well received playing against type, as the seamstress sentenced to death on the guillotine along with Sydney Carton (Ronald Colman in A Tale of Two Cities (1935). Her most significant role was as the prostitute Gloria Stone in Lost Horizon (1937). Jewell's films included Gone with the Wind (1939) (in the role of \"that white trash, Emmy Slattery\"), Northwest Passage (1940), High Sierra (1941), and the low-budget The Leopard Man (1943).\n\nBy the end of the 1940s, her roles had reduced in significance to the degree that her performances were often uncredited, e.g. The Snake Pit. She performed in radio dramas in the 1950s, including This is Your FBI.\n\nIn 1972, Jewell appeared opposite Edie Sedgwick in the film Ciao! Manhattan. Her final film was the B movie Sweet Kill (1973), the directorial debut of Curtis Hanson, a future Academy Award winner.  Description above from the Wikipedia article Isabel Jewell, licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": "1907-07-19",
        "deathday": "1972-04-05",
        "gender": 1,
        "homepage": null,
        "id": 33277,
        "imdb_id": "nm0422436",
        "known_for_department": "Acting",
        "name": "Isabel Jewell",
        "place_of_birth": "Shoshone, Wyoming, USA",
        "popularity": 0.8133,
        "profile_path": "/1TrbChjGlZmNmnafA7exQabSN0s.jpg"
    }
}