{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/pRBCb6Hs6Xo4diXwpnBTcwMizE.jpg",
                "genre_ids": [
                    80,
                    53
                ],
                "id": 1485,
                "original_language": "en",
                "original_title": "Get Carter",
                "overview": "Jack Carter is a small-time hood working in London. When word reaches him of his brother's death, he travels to Newcastle to attend the funeral. Refusing to accept the police report of suicide, Carter seeks out his brother’s friends and acquaintances to learn who murdered his sibling and why.",
                "popularity": 2.8722,
                "poster_path": "/3AytAYzJuPmS4Wo8X3jcsaN4oM3.jpg",
                "release_date": "1971-02-03",
                "title": "Get Carter",
                "video": false,
                "vote_average": 6.999,
                "vote_count": 525,
                "character": "Kinnear",
                "credit_id": "52fe42f9c3a36847f8030e8b",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nJohn James Osborne (12 December 1929 – 24 December 1994) was an English playwright, screenwriter, actor and critic of the Establishment. The success of his 1956 play Look Back in Anger transformed English theatre.\n\nIn a productive life of more than 40 years, Osborne explored many themes and genres, writing for stage, film and TV. His personal life was extravagant and iconoclastic. He was notorious for the ornate violence of his language, not only on behalf of the political causes he supported but also against his own family, including his wives and children.\n\nOsborne was one of the first writers to address Britain's purpose in the post-imperial age. He was the first to question the point of the monarchy on a prominent public stage. During his peak (1956–1966), he helped make contempt an acceptable and now even cliched onstage emotion, argued for the cleansing wisdom of bad behaviour and bad taste, and combined unsparing truthfulness with devastating wit.\n\n \n\nDescription above from the Wikipedia article John Osborne, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1929-12-12",
        "deathday": "1994-12-24",
        "gender": 2,
        "homepage": null,
        "id": 33323,
        "imdb_id": "nm0651570",
        "known_for_department": "Writing",
        "name": "John Osborne",
        "place_of_birth": "Fulham, London, England",
        "popularity": 0.1464,
        "profile_path": "/9oc0faLHrjvZlCnHu62KTNe1f9X.jpg"
    }
}