{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dY0suaAdGpOqh7JkLeIN6lT7k9d.jpg",
                "genre_ids": [
                    80,
                    53
                ],
                "id": 247,
                "original_language": "en",
                "original_title": "The Killing",
                "overview": "Career criminal Johnny Clay recruits a sharpshooter, a crooked police officer, a bartender and a betting teller named George, among others, for one last job before he goes straight and gets married. But when George tells his restless wife about the scheme to steal millions from the racetrack where he works, she hatches a plot of her own.",
                "popularity": 4.2445,
                "poster_path": "/A6VzUPcADZGYdGHlVdWvpMNDF5d.jpg",
                "release_date": "1956-06-06",
                "title": "The Killing",
                "video": false,
                "vote_average": 7.653,
                "vote_count": 1617,
                "character": "Sherry Peatty",
                "credit_id": "52fe422cc3a36847f8009caf",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Emily Marie Bertelsen"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nMarie Windsor (born Emily Marie Bertelsen; December 11, 1919 – December 10, 2000) was an actress known as \"The Queen of the Bs\" because she appeared in so many B-movies and film noirs.\n\nAfter working for several years as a telephone operator, a stage and radio actress, and a bit and extra player in films, Windsor began playing feature parts on the big screen in 1947.\n\nHer first film contract, with Warner Bros. in 1942, resulted from her writing jokes and submitting them to Jack Benny. Windsor said she submitted the gags under the name M.E. Windsor \"because I was afraid he might be prejudiced against a woman gag writer.\" When Benny finally met Windsor, \"he was stunned by her good looks\" and had a producer sign her to a contract. After a tenure with Metro-Goldwyn-Mayer in which the studio \"signed her, put her in two small roles and then promptly forgot her\", she signed a seven-year contract with The Enterprise Studios in 1948.\n\nThe actress' first memorable role was in 1948 with John Garfield in Force of Evil playing seductress Edna Tucker. She had roles in numerous 1950s film noirs, notably The Sniper, The Narrow Margin, City That Never Sleeps, and Stanley Kubrick's heist movie, The Killing, in which she played Elisha Cook Jr.'s scheming wife. She also made a foray into science fiction with the 1953 release of Cat-Women of the Moon. Windsor co-starred with Randolph Scott in The Bounty Hunter (1954).\n\nLater, Windsor moved to television. She appeared in 1954 as Belle Starr in the premiere episode of Stories of the Century. In 1962, she played Ann Jesse, a woman dying in childbirth, in the episode \"The Wanted Man\" of Lawman. She appeared on programs such as Maverick, Bat Masterson, Perry Mason, Bourbon Street Beat, The Incredible Hulk, Rawhide, General Hospital, Salem's Lot (TV miniseries), and Murder, She Wrote.\n\nWindsor worked consistently through the 1960s and 1970s, and remained on screen once or so annually up to the 1990s, playing her final role at 72 in 1991.\n\nWindsor has a star at 1549 N. Vine Street in the Motion Pictures section of the Hollywood Walk of Fame. It was dedicated January 19, 1983. She was among the 500 stars nominated for selection as one of the 50 greatest American screen legends, as part of the American Film Institute's 100 years.\n\nIn 1987, Windsor received the Los Angeles Drama Critics Circle Award for best actress for her work in The Bar Off Melrose. She also received the Ralph Morgan Award from the Screen Actors Guild for her service on the organization's board of directors.",
        "birthday": "1919-12-11",
        "deathday": "2000-12-10",
        "gender": 1,
        "homepage": null,
        "id": 3340,
        "imdb_id": "nm0934798",
        "known_for_department": "Acting",
        "name": "Marie Windsor",
        "place_of_birth": "Marysvale, Utah, USA",
        "popularity": 0.5923,
        "profile_path": "/rBSWxRt3cbpg3IpCLCAiHy05DRL.jpg"
    }
}