{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dY0suaAdGpOqh7JkLeIN6lT7k9d.jpg",
                "genre_ids": [
                    80,
                    53
                ],
                "id": 247,
                "original_language": "en",
                "original_title": "The Killing",
                "overview": "Career criminal Johnny Clay recruits a sharpshooter, a crooked police officer, a bartender and a betting teller named George, among others, for one last job before he goes straight and gets married. But when George tells his restless wife about the scheme to steal millions from the racetrack where he works, she hatches a plot of her own.",
                "popularity": 4.2445,
                "poster_path": "/A6VzUPcADZGYdGHlVdWvpMNDF5d.jpg",
                "release_date": "1956-06-06",
                "title": "The Killing",
                "video": false,
                "vote_average": 7.653,
                "vote_count": 1617,
                "character": "Leo the Loanshark",
                "credit_id": "52fe422dc3a36847f8009cc7",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/6L1Co3uRWuoaqDxpWvGDvgXms7T.jpg",
                "genre_ids": [
                    18
                ],
                "id": 976,
                "original_language": "en",
                "original_title": "Sweet Smell of Success",
                "overview": "New York City newspaper writer J.J. Hunsecker holds considerable sway over public opinion with his Broadway column, but one thing that he can't control is his younger sister, Susan, who is in a relationship with aspiring jazz guitarist Steve Dallas. Hunsecker strongly disapproves of the romance and recruits publicist Sidney Falco to find a way to split the couple, no matter how ruthless the method.",
                "popularity": 4.6649,
                "poster_path": "/akzvV8JasNrgEl5iAP9K6zPHGJe.jpg",
                "release_date": "1957-07-04",
                "title": "Sweet Smell of Success",
                "video": false,
                "vote_average": 7.61,
                "vote_count": 539,
                "character": "Manny Davis (uncredited)",
                "credit_id": "63467b7ed34eb3007e7bbdd6",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nJay Adler (September 26, 1896 – September 23, 1978) was an American actor in theater, television, and film.\n\nBorn in New York City, he was the eldest son of actors Jacob and Sara Adler, and the brother of five actor siblings, including stage actor Luther and drama coach Stella. The Adlers were a Jewish-American acting dynasty in New York City's Yiddish Theater District and they played a significant role in theater from the late 19th century to the 1950s. Stella Adler became the most influential member of their family.  During a long acting career of minor character roles, Jay Adler appeared in more than 40 films and 37 television series between 1938 and 1976. He appeared in The Big Combo (1955), Stanley Kubrick's The Killing (1956) and Jerry Lewis' The Family Jewels (1965). In 1961, Adler appeared both in the episode \"The Lady and the Lawyer\" of the television series The Asphalt Jungle and in The Lawbreakers, a theatrical film version of the episode.  Jay Adler died at age 81 in Woodland Hills, California and was buried in the Mount Carmel Cemetery, Glendale, New York.",
        "birthday": "1896-09-25",
        "deathday": "1978-09-23",
        "gender": 2,
        "homepage": null,
        "id": 3343,
        "imdb_id": "nm0012175",
        "known_for_department": "Acting",
        "name": "Jay Adler",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.1957,
        "profile_path": "/yhiBDf05Qc5VsKmKXDD8bISB61Y.jpg"
    }
}