{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/96WHK0TiIslmM8rGVIejMtMtaPG.jpg",
                "genre_ids": [
                    12,
                    28,
                    53,
                    878
                ],
                "id": 604,
                "original_language": "en",
                "original_title": "The Matrix Reloaded",
                "overview": "The Resistance builds in numbers as humans are freed from the Matrix and brought to the city of Zion. Neo discovers his superpowers, including the ability to see the code inside the Matrix. With machine sentinels digging to Zion in 72 hours, Neo, Morpheus and Trinity must find the Keymaker to ultimately reach the Source.",
                "popularity": 9.6725,
                "poster_path": "/9TGHDvWrqKBzwDxDodHYXEmOE6J.jpg",
                "release_date": "2003-05-15",
                "title": "The Matrix Reloaded",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 11450,
                "character": "Maggie",
                "credit_id": "52fe425cc3a36847f80183f9",
                "order": 36
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Esther \"Essie\" Davis",
            "Essie Davies"
        ],
        "biography": "Essie Davis is an Australian actress. Born and raised in Hobart, Tasmania, she is the daughter of locally famed artist George Davis. She emerged from the Old Nick Company at the University of Tasmania in the late 1980s and has gone on to appear in Hollywood movies. She is a graduate of the National Institute of Dramatic Art (NIDA) in Sydney.\n\nHer career started after her role in the all Australian movie Dad and Dave: On Our Selection (1995), also starring other prestigious actors such as Geoffrey Rush, Leo McKern, and Joan Sutherland. Her most famous movie roles are in The Matrix Reloaded and The Matrix Revolutions, Richard Flanagan's 1998 Tasmanian film The Sound of One Hand Clapping, and Girl with a Pearl Earring.\n\nIn 2003 she won the Laurence Olivier Award for Best Supporting Actress for her UK performance in the Tennessee Williams play A Streetcar Named Desire. In 2004 she starred in a Broadway production of Tom Stoppard's Jumpers, for which she earned a Tony nomination. In 2005 she appeared as Mrs. Nellie Lovett in the BBC production of Sweeney Todd with Ray Winstone. In the 2008 film Hey, Hey, It's Esther Blueburger she plays Esther's controlling mother.",
        "birthday": "1970-01-07",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 33449,
        "imdb_id": "nm0204583",
        "known_for_department": "Acting",
        "name": "Essie Davis",
        "place_of_birth": "Hobart, Tasmania, Australia",
        "popularity": 2.3288,
        "profile_path": "/mwJrRr9bdlUZFZBNDTgWxAKAdqR.jpg"
    }
}