{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/p9V3vD1Ye2zRNfTsE8oY58Fe81S.jpg",
                "genre_ids": [
                    28,
                    18,
                    10752
                ],
                "id": 1251,
                "original_language": "en",
                "original_title": "Letters from Iwo Jima",
                "overview": "The story of the battle of Iwo Jima between the United States and Imperial Japan during World War II, as told from the perspective of the Japanese who fought it.",
                "popularity": 3.4712,
                "poster_path": "/kZokxQtzMPURvijWYFuvh1fAvnv.jpg",
                "release_date": "2006-12-09",
                "title": "Letters from Iwo Jima",
                "video": false,
                "vote_average": 7.477,
                "vote_count": 2149,
                "character": "Private Saigo",
                "credit_id": "52fe42eac3a36847f802c88b",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ninomiya Kazunari",
            "니노미야 카즈나리",
            "二宫和也",
            "Arashi"
        ],
        "biography": "Kazunari Ninomiya (born June 17, 1983), often called Nino, is a Japanese idol, singer, songwriter, actor, seiyū and radio host. He is a member of Japanese boy band Arashi and is best known to movie audiences for his portrayal as Private Saigo in the 2006 Clint Eastwood war film Letters from Iwo Jima.\n\nNinomiya began his career in the entertainment industry when he joined the Japanese talent agency Johnny & Associates in 1996 at the age of 13. Prior to his debut as a singer with Arashi in 1999, Ninomiya started an acting career when he was cast as Chris for the stage play Stand by Me, which was based on the film of the same name. Since then, he has went on to appear in numerous drama, movie and stage productions, making him known as the actor of Arashi. Described as an actor who can act with his mouth and eyes, Ninomiya has won a number of awards and nominations for his roles.",
        "birthday": "1983-06-17",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 33515,
        "imdb_id": "nm0632497",
        "known_for_department": "Acting",
        "name": "Kazunari Ninomiya",
        "place_of_birth": "Tokyo, Japan",
        "popularity": 0.6283,
        "profile_path": "/4mxogZeEPZiVrnJ4L8ICvOJONfs.jpg"
    }
}