{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/p9V3vD1Ye2zRNfTsE8oY58Fe81S.jpg",
                "genre_ids": [
                    28,
                    18,
                    10752
                ],
                "id": 1251,
                "original_language": "en",
                "original_title": "Letters from Iwo Jima",
                "overview": "The story of the battle of Iwo Jima between the United States and Imperial Japan during World War II, as told from the perspective of the Japanese who fought it.",
                "popularity": 3.4712,
                "poster_path": "/kZokxQtzMPURvijWYFuvh1fAvnv.jpg",
                "release_date": "2006-12-09",
                "title": "Letters from Iwo Jima",
                "video": false,
                "vote_average": 7.477,
                "vote_count": 2149,
                "character": "Sam",
                "credit_id": "52fe42eac3a36847f802c89f",
                "order": 12
            },
            {
                "adult": false,
                "backdrop_path": "/5AhkjcqqRxBdpYZ0TeOuTCuOUYq.jpg",
                "genre_ids": [
                    80,
                    53,
                    18
                ],
                "id": 429200,
                "original_language": "en",
                "original_title": "Good Time",
                "overview": "After a botched bank robbery lands his younger brother in prison, Connie Nikas embarks on a twisted odyssey through New York City's underworld to get his brother Nick out of jail.",
                "popularity": 2.6082,
                "poster_path": "/yE1c9hj5Hf8a9KplAdRdhADqUro.jpg",
                "release_date": "2017-08-11",
                "title": "Good Time",
                "video": false,
                "vote_average": 7.215,
                "vote_count": 2947,
                "character": "Arcade Guy (uncredited)",
                "credit_id": "5952c0aa9251412ac402841d",
                "order": 81
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Luke Eberl"
        ],
        "biography": "Luke Eberl is an American actor, director, and pianist. His directorial feature film debut, Choose Connor screened at Rome Film Festival, Seattle, Newport Beach, Woodstock, CineVegas and Philadelphia, where it won the Jury Prize for Best American Independent. It was released theatrically and on video by Strand Releasing to outstanding reviews by the likes of The New York Times, Los Angeles Times and Washington Post. Luke was named one of the “10 Young Americans to Watch\" by Eric Kohn in MovieMaker Magazine.  He directed the short film We Won't Forget which screened at over 25 festivals including Palm Springs ShortFest, Hamptons IFF, Woodstock, Tirana, Dresden, Rooftop Films, IndieLisboa and Rio de Janeiro and went on to win the Grand Jury Prize and the award for Best Editing at Castrovillari, and the Honorable Mention at FEST New Directors New Films. The film was nominated for a Portuguese Academy Award (Sophia) for Best Short Film and was selected as Vimeo Staﬀ Pick and Short of the Week. As an actor he has worked with directors such as Tim Burton, Alfonso Arau, Vincent Paterson, Peter Hoar, and Clint Eastwood on his Oscar-winning Letters From Iwo Jima.",
        "birthday": "1986-03-29",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 33521,
        "imdb_id": "nm0248063",
        "known_for_department": "Acting",
        "name": "Luke Eberl",
        "place_of_birth": "Boulder, Colorado, USA",
        "popularity": 0.1022,
        "profile_path": "/22zOLLRW7DCMc8iJY8NLZemeCBe.jpg"
    }
}