{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1tqzKtAWMRURxPTvs1hzcSOoKxe.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 234200,
                "original_language": "en",
                "original_title": "Pride",
                "overview": "In 1984, a group of LGBT activists decide to raise money to support the National Union of Mineworkers during their lengthy strike. There is only one problem: the Union seems embarrassed to receive their support.",
                "popularity": 3.2875,
                "poster_path": "/mrITqHNw0XzT7egAPByDuiE3QZf.jpg",
                "release_date": "2014-09-12",
                "title": "Pride",
                "video": false,
                "vote_average": 7.704,
                "vote_count": 1357,
                "character": "Woman 1",
                "credit_id": "5ddc0f004284ea0017f8903d",
                "order": 50
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Julie Gibbs was born in Hertfordshire in August 1961. She has one brother, Graham, who joined the army when she was 13. Her mother Jenny was a corsetier/sales assistant and her father was in public relations before being ordained as an Anglican vicar. Julie attended Woodmansterne Primary school in Streatham, where she was keen on all aspects of dance and drama and ice skating. She moved to Aylesbury to attend the Grammar School where she developed her love of acting until she was 16. She moved to Sychdyn in Clwyd, North Wales and joined the Sixth form at Mold Alun Comprehensive School and The Clwyd Youth Theatre performing in plays in the community and at Theatr Clwyd where she worked as an usherette and in theatre admin before studying Acting at Welsh College of Music and Drama in Cardiff in 1981-1984. Julie began working in stand-up comedy to apply for her Equity Card through 1985/86 and then joined the Sherman Theatre Company in Cardiff for 3 productions: A murder mystery musical - Something Afoot and two Christmas productions written by Mike James - The Amazing Mr Toad and The Emperors New Clothes. She toured Britain with Hull Truck Theatre Company with an award winning production of Salt The Earth by John Godber which went on to represent Britain at the International Theatre Festival in New York in 1989, having won a coveted Fringe First award at the Edinburgh Fringe Festival in 1988. After working on two further Christmas productions at Northcott Theatre, Exeter and at Leeds Playhouse, Julie worked in Denmark through 1990 with The English Speaking Theatre Company of Copenhagen. She returned to Wales to begin a successful run in various comedy radio productions including as a regular guest panellist for Weekending on BBC radio 4 and various Light Ent comedy plays. She enjoyed voicing animated films and worked extensively in post-production dubbing for foreign language films. In 1995 Julie returned to studying and gained a PG qualification in Lecturing in FE/HE and went on to teach Performing Arts at Coleg Glan Hafren and at Royal Welsh College of Music and Drama for BA Actors and Young Actors Studio - returning to the place where she studied. Julie married Martin Barclay , a university lecturer, and had sons Lewis and Tommy in 1999 and 2003 returning to her first love acting in 2005. Julie toured south Wales with Theatr Na'Nog introducing secondary school children to Shakespeare. She also worked with local theatre companies Theatr Iolo and Theatr Y Byd and developed new writing as an actor and director with On The Edge company produced by Michael Kelligan. In 2007 Julie began to work in TV/film alongside her theatre and teaching work. She made several appearances for Black Rat Productions - including performances in Romeo and Juliet, Boeing Boeing ,Loot and Spanish Lies for Grassroots Productions written and directed by Frank Vickery. Julie developed skills adapting literature for the stage - Fresh Apples, a wonderful collection of short stories by Rachel Trezise was adapted by Julie in 2010 and she directed A Kind of Alaska by Harold Pinter for Be:Spoken Theatre. In 2014 Julie was cast in an award winning production 'Maudie's Rooms written and directed by Louise Osborn. In the same year when Julie was 52 she was diagnosed with breast cancer and following 6 months of successful treatment happily returned to work.",
        "birthday": "1961-08-01",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.juliebarclay.com/biography/",
        "id": 3353571,
        "imdb_id": "nm3149086",
        "known_for_department": "Acting",
        "name": "Julie Barclay",
        "place_of_birth": "Hereford, Herefordshire, England, UK",
        "popularity": 0.6162,
        "profile_path": "/t8GQ9Ut7oYPf5k9wH0UU0wKQroX.jpg"
    }
}