{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/teLJilYBEdBiCNwPuiJaJT0p7i8.jpg",
                "genre_ids": [
                    37,
                    18,
                    9648
                ],
                "id": 11901,
                "original_language": "en",
                "original_title": "High Plains Drifter",
                "overview": "A gunfighting stranger comes to the small settlement of Lago. After gunning down three gunmen who tried to kill him, the townsfolk decide to hire the Stranger to hold off three outlaws who are on their way.",
                "popularity": 5.4722,
                "poster_path": "/AjkJCFkqanK1OZqiHxc6Kl2wPQO.jpg",
                "release_date": "1973-04-19",
                "title": "High Plains Drifter",
                "video": false,
                "vote_average": 7.339,
                "vote_count": 1245,
                "character": "Sheriff Sam Shaw",
                "credit_id": "52fe449e9251416c7503b0d3",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/38uM6QuI06znUCELfOSiVQy05CX.jpg",
                "genre_ids": [
                    37
                ],
                "id": 301,
                "original_language": "en",
                "original_title": "Rio Bravo",
                "overview": "A small-town sheriff in the American West enlists the help of a disabled man, a drunk, and a young gunfighter in his efforts to hold in jail the brother of the local bad guy.",
                "popularity": 5.5199,
                "poster_path": "/4gI4KKmoi0d3yfsF71YU3S0I5t8.jpg",
                "release_date": "1959-03-18",
                "title": "Rio Bravo",
                "video": false,
                "vote_average": 7.813,
                "vote_count": 1204,
                "character": "Charlie (uncredited)",
                "credit_id": "570456bb9251415bb60011be",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Walter Lee Barnes was an American football guard and actor who played in National Football League (NFL) for four seasons. He played in the (NFL) for the Philadelphia Eagles and in college at Louisiana State University. Barnes was an actor in both American and European films. He appeared in several films with John Wayne, Lex Barker, and Clint Eastwood.\n\nBarnes entered acting after appearing several times on The Eagles Nest, a local Philadelphia television show. WCAU television placed him on several local shows. His contacts with Walt Silver, a producer for Warner Bros. Television, led him into several appearances on television and films. Some of his more notable appearances included Bronco, Gunsmoke, Cheyenne, Bonanza, Have Gun – Will Travel and Death Valley Days. John Wayne got him a small role as Charlie the Bartender in Rio Bravo.\n\nTiring of small roles and seeing opportunities overseas, Barnes was one of the many American actors who moved to Italy in the early 1960s. Kirk Douglas recommended him for a role in his The Vikings television spinoff Tales of the Vikings that was filmed for Douglas's production company in Germany. From 1960 to 1969, he was first active in pirate movies, then Karl May film adaptations and Spaghetti Westerns.\n\nBarnes returned to the United States in 1969 and appeared in more films and television series, which included The High Chaparral. His friendship with Clint Eastwood on Rawhide later led him to several roles in Eastwood's films. He retired from acting in 1987 and became increasingly ill due to his diabetes. He was the father of German former actress Lara Wendel, who was born Daniela Barnes.",
        "birthday": "1918-01-26",
        "deathday": "1998-01-06",
        "gender": 2,
        "homepage": null,
        "id": 33544,
        "imdb_id": "nm0055812",
        "known_for_department": "Acting",
        "name": "Walter Barnes",
        "place_of_birth": "Rennert, North Carolina, USA",
        "popularity": 0.3592,
        "profile_path": "/g4WSTSR008Q2pyaKUlT2DUMWFuh.jpg"
    }
}