{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/i8fiqKaQklF02VmQYhSxmwa8KOH.jpg",
                "genre_ids": [
                    9648,
                    10749,
                    53
                ],
                "id": 223,
                "original_language": "en",
                "original_title": "Rebecca",
                "overview": "Story of a young woman who marries a fascinating widower only to find out that she must live in the shadow of his former wife, Rebecca, who died mysteriously several years earlier. The young wife must come to grips with the terrible secret of her handsome, cold husband, Max De Winter. She must also deal with the jealous, obsessed Mrs. Danvers, the housekeeper, who will not accept her as the mistress of the house.",
                "popularity": 2.5313,
                "poster_path": "/1qz3qUOHnVy7dL7M7G8jSErxE4b.jpg",
                "release_date": "1940-03-23",
                "title": "Rebecca",
                "video": false,
                "vote_average": 7.899,
                "vote_count": 1869,
                "character": "Mrs. de Winter",
                "credit_id": "52fe4228c3a36847f80088b7",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/oa6yoeeZtjxdgzAcZtbCSW3GEE9.jpg",
                "genre_ids": [
                    9648,
                    10749,
                    53
                ],
                "id": 11462,
                "original_language": "en",
                "original_title": "Suspicion",
                "overview": "A sheltered young heiress elopes with a handsome playboy. Gradually, she discovers his dishonest nature.",
                "popularity": 2.0342,
                "poster_path": "/clWNlzlbyaEoIK63lcFjqBmXoQz.jpg",
                "release_date": "1941-11-14",
                "title": "Suspicion",
                "video": false,
                "vote_average": 7.134,
                "vote_count": 853,
                "character": "Lina McLaidlaw Aysgarth",
                "credit_id": "52fe44459251416c7502ec37",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Joan de Beauvoir de Havilland",
            "Joan Burfield"
        ],
        "biography": "Joan de Beauvoir de Havilland, known professionally as Joan Fontaine, was an English-American actress who is best known for her starring roles in Hollywood films during the \"Golden Age\". She was born in Tokyo, Japan, in what was known as the International Settlement. Her father was a British patent attorney with a lucrative practice in Japan, but due to Joan and older sister Olivia de Havilland's recurring ailments the family moved to California in the hopes of improving their health. Mrs. de Havilland and the two girls settled in Saratoga while their father went back to his practice in Japan. Joan's parents did not get along well and divorced soon afterward. Mrs. de Havilland had a desire to be an actress but her dreams were curtailed when she married, but now she hoped to pass on her dream to Olivia and Joan.\n\nWhile Olivia pursued a stage career, Joan went back to Tokyo, where she attended the American School. In 1934 she came back to California, where her sister was already making a name for herself on the stage. Joan likewise joined a theater group in San Jose and then Los Angeles to try her luck there. After moving to L.A., Joan adopted the name of Joan Burfield because she didn't want to infringe upon Olivia, who was using the family surname. She tested at MGM and gained a small role in No More Ladies (1935), but she was scarcely noticed and Joan was idle for a year and a half. During this time she roomed with Olivia, who was having much more success in films.\n\nIn 1937, this time calling herself Joan Fontaine, she landed a better role as Trudy Olson in You Can't Beat Love (1937) and then an uncredited part in Quality Street (1937). Although the next two years saw her in better roles, she still yearned for something better. In 1940 she garnered her first Academy Award nomination for Rebecca (1940). Although she thought she should have won, (she lost out to Ginger Rogers in Kitty Foyle (1940)), she was now an established member of the Hollywood set. She would again be Oscar-nominated for her role as Lina McLaidlaw Aysgarth in Suspicion (1941), and this time she won.\n\nJoan was making one film a year but choosing her roles well. In 1942 she starred in the well-received This Above All (1942). The following year she appeared in The Constant Nymph (1943). Once again she was nominated for the Oscar, she lost out to Jennifer Jones in The Song of Bernadette (1943). By now it was safe to say she was more famous than her older sister and more fine films followed. In 1948, she accepted second billing to Bing Crosby in The Emperor Waltz (1948).\n\nJoan took the year of 1949 off before coming back in 1950 with September Affair (1950) and Born to Be Bad (1950). In 1951 she starred in Paramount's Darling, How Could You! (1951), which turned out badly for both her and the studio and more weak productions followed. Absent from the big screen for a while, she took parts in television and dinner theaters. She also starred in many well-produced Broadway plays such as Forty Carats and The Lion in Winter. Her last appearance on the big screen was The Witches (1966) and her final appearance before the cameras was Good King Wenceslas (1994). She is, without a doubt, a lasting movie icon.",
        "birthday": "1917-10-22",
        "deathday": "2013-12-15",
        "gender": 1,
        "homepage": null,
        "id": 3360,
        "imdb_id": "nm0000021",
        "known_for_department": "Acting",
        "name": "Joan Fontaine",
        "place_of_birth": "Tokyo, Japan",
        "popularity": 0.3546,
        "profile_path": "/y5Hl4TyipNN7463zZpPq5KFB3aM.jpg"
    }
}