{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/i8fiqKaQklF02VmQYhSxmwa8KOH.jpg",
                "genre_ids": [
                    9648,
                    10749,
                    53
                ],
                "id": 223,
                "original_language": "en",
                "original_title": "Rebecca",
                "overview": "Story of a young woman who marries a fascinating widower only to find out that she must live in the shadow of his former wife, Rebecca, who died mysteriously several years earlier. The young wife must come to grips with the terrible secret of her handsome, cold husband, Max De Winter. She must also deal with the jealous, obsessed Mrs. Danvers, the housekeeper, who will not accept her as the mistress of the house.",
                "popularity": 2.5313,
                "poster_path": "/1qz3qUOHnVy7dL7M7G8jSErxE4b.jpg",
                "release_date": "1940-03-23",
                "title": "Rebecca",
                "video": false,
                "vote_average": 7.899,
                "vote_count": 1869,
                "character": "Mrs. Danvers",
                "credit_id": "52fe4228c3a36847f80088bf",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/3Yz8IcUBPZ8zDff0ktHZk24Rot0.jpg",
                "genre_ids": [
                    18
                ],
                "id": 261,
                "original_language": "en",
                "original_title": "Cat on a Hot Tin Roof",
                "overview": "An alcoholic ex-football player drinks his days away, having failed to come to terms with his sexuality and his real feelings for his football buddy who died after an ambiguous accident. His wife is crucified by her desperation to make him desire her: but he resists the affections of his wife. His reunion with his father—who is dying of cancer—jogs a host of memories and revelations for both father and son.",
                "popularity": 1.9871,
                "poster_path": "/5djZZECgqDGuSI1INmrdAcGRBb0.jpg",
                "release_date": "1958-08-29",
                "title": "Cat on a Hot Tin Roof",
                "video": false,
                "vote_average": 7.656,
                "vote_count": 786,
                "character": "Big Momma",
                "credit_id": "52fe422fc3a36847f800a6d1",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/d5HjGve67GkNC9lWpzZVKSotLlT.jpg",
                "genre_ids": [
                    18,
                    9648
                ],
                "id": 1939,
                "original_language": "en",
                "original_title": "Laura",
                "overview": "A police detective falls in love with the woman whose murder he's investigating.",
                "popularity": 2.1817,
                "poster_path": "/j0zEiFFrdbZnMXqD3piOtZBJeNB.jpg",
                "release_date": "1944-11-26",
                "title": "Laura",
                "video": false,
                "vote_average": 7.634,
                "vote_count": 853,
                "character": "Ann Treadwell",
                "credit_id": "52fe4324c3a36847f803d72f",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/3e3dVaVrla2GH6CWKbNRjTvk3s8.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 6844,
                "original_language": "en",
                "original_title": "The Ten Commandments",
                "overview": "Escaping death, a Hebrew infant is raised in a royal household to become a prince. Upon discovery of his true heritage, Moses embarks on a personal quest to reclaim his destiny as the leader and liberator of the Hebrew people.",
                "popularity": 10.0884,
                "poster_path": "/3Ei59AR64x6dMZfWobPCkZjbqTL.jpg",
                "release_date": "1956-10-05",
                "title": "The Ten Commandments",
                "video": false,
                "vote_average": 7.769,
                "vote_count": 1743,
                "character": "Memnet",
                "credit_id": "52fe4466c3a36847f8093af9",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Frances Margaret Anderson",
            "Dame Judith Anderson",
            "Frances Margaret Anderson Anderson",
            "Джудит Андерсон"
        ],
        "biography": "Dame Frances Margaret Anderson, AC, DBE (February 10, 1897 – January 3, 1992), known professionally as Judith Anderson, was an Australian actress who had a successful career in stage, film and television. Considered one of the greatest classical stage actors of the 20th century, she has two Emmy Awards and a Tony Award to her name, as well as a nomination for a Grammy Award and an Academy Award each.\n\nShe began her acting career in Australia but her ambition brought her to New York in 1918. She established herself as one of the greatest theatrical actresses and was a major star on Broadway throughout the 1930s, 1940s and 1950s. Her notable stage works included the role of Lady Macbeth, which she played first in the 1920s, and gave an Emmy Award-winning television performance in Macbeth (1960). Anderson's long association with Euripides's \"Medea\" began with her acclaimed Tony Award-winning 1948 stage performance in the title role. She appeared in the television version of Medea (1983) in the supporting character of the Nurse.\n\nAnderson made her Hollywood film debut under director Rowland Brown in a supporting role in Blood Money (1933). Her striking, not conventionally attractive features were complemented with her powerful presence, mastery of timing and an effortless style. Anderson made a film career as a supporting character actress in several significant films including Alfred Hitchcock's Rebecca (1940), for which she was Oscar nominated for Best Supporting Actress. She worked with director Otto Preminger in Laura (1944), then with René Clair in And Then There Were None (1945). Her remarkable performance in a supporting role in Cat on a Hot Tin Roof (1958) fit in a stellar acting ensemble under director Richard Brooks.\n\nAnderson was awarded Dame Commander of the Order of the British Empire in the 1960 Queen's New Year's Honours List for her services to the performing arts. Living in Santa Barbara in her later years, she also had a successful stint on the soap opera Santa Barbara (1984) and was nominated for a Daytime Emmy Award in 1984. In the same year, at age 87, she appeared in Star Trek III: The Search for Spock (1984) as the High Priestess, and was nominated for a Saturn Award for that role. She was awarded Companion of the Order of Australia in the 1991 Queen's Birthday Honours List for her services to the performing arts. Anderson died at age 94 of pneumonia on January 3, 1992 in Santa Barbara, California.",
        "birthday": "1897-02-10",
        "deathday": "1992-01-03",
        "gender": 1,
        "homepage": null,
        "id": 3362,
        "imdb_id": "nm0000752",
        "known_for_department": "Acting",
        "name": "Judith Anderson",
        "place_of_birth": "Adelaide, South Australia, Australia",
        "popularity": 0.5084,
        "profile_path": "/33Ree0GhYJoxQuh1vAjyGsoKiS4.jpg"
    }
}