{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/i8fiqKaQklF02VmQYhSxmwa8KOH.jpg",
                "genre_ids": [
                    9648,
                    10749,
                    53
                ],
                "id": 223,
                "original_language": "en",
                "original_title": "Rebecca",
                "overview": "Story of a young woman who marries a fascinating widower only to find out that she must live in the shadow of his former wife, Rebecca, who died mysteriously several years earlier. The young wife must come to grips with the terrible secret of her handsome, cold husband, Max De Winter. She must also deal with the jealous, obsessed Mrs. Danvers, the housekeeper, who will not accept her as the mistress of the house.",
                "popularity": 2.5313,
                "poster_path": "/1qz3qUOHnVy7dL7M7G8jSErxE4b.jpg",
                "release_date": "1940-03-23",
                "title": "Rebecca",
                "video": false,
                "vote_average": 7.899,
                "vote_count": 1869,
                "character": "Edythe Van Hopper",
                "credit_id": "52fe4228c3a36847f80088cf",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Florence Rabe"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nFlorence Bates (born Florence Rabe, April 15, 1888 – January 31, 1954) was an American film and stage character actress who often played grande dame characters in supporting roles.\n\nHer path to becoming an actress had many turns. She had a degree in Mathematics, taught school until married, then became the first Texas female lawyer. Then she became a bilingual radio commentator. After her husband lost her fortune, she and her husband opened a bakery in Los Angeles.\n\nIn the mid-1930s, Bates auditioned for and won the role of Miss Bates in a Pasadena Playhouse adaptation of Jane Austen's Emma. When she decided to continue working with the theatre group, she changed her professional name to that of the first character she played on stage. In 1939, she was introduced to Alfred Hitchcock, who cast her in her first major screen role, the vain dowager Mrs. Van Hopper, in Rebecca (1940).\n\nBates appeared in more than sixty films over the course of the next thirteen years. Among her cinema credits are Kitty Foyle, Love Crazy, The Moon and Sixpence, Mr. Lucky, Heaven Can Wait, Lullaby of Broadway, Mister Big, Since You Went Away, Kismet, Saratoga Trunk, The Secret Life of Walter Mitty, Winter Meeting, I Remember Mama, Portrait of Jennie, A Letter to Three Wives, On the Town, and Les Misérables. In television, Bates had a regular role on The Hank McCune Show and made guest appearances on I Love Lucy, My Little Margie, I Married Joan  and Our Miss Brooks.",
        "birthday": "1888-04-13",
        "deathday": "1954-01-31",
        "gender": 1,
        "homepage": null,
        "id": 3367,
        "imdb_id": "nm0060904",
        "known_for_department": "Acting",
        "name": "Florence Bates",
        "place_of_birth": "San Antonio, Texas, USA",
        "popularity": 0.2548,
        "profile_path": "/uAqYoWW4xICzyMXbpvpMivvmXCH.jpg"
    }
}