{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/aH5QhlVu7uMnLO9P432IcP8FyCI.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 1850,
                "original_language": "en",
                "original_title": "Man on the Moon",
                "overview": "The story of the life and career of eccentric avant-garde comedian, Andy Kaufman.",
                "popularity": 3.9574,
                "poster_path": "/msOZS07xRIFnapwp3fprGbKEAfT.jpg",
                "release_date": "1999-12-22",
                "title": "Man on the Moon",
                "video": false,
                "vote_average": 7.247,
                "vote_count": 1869,
                "character": "College Promoter",
                "credit_id": "639034b1105611008c036bcc",
                "order": 40
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Conrad Roberts is an Antiguan-American actor who has appeared in several television series and films over the past forty years. His most recent film was A Wrinkle In Time.\n\nHe first began his career in March 1968 when he was cast as \"Edward Stark\" on the series The Doctors. Roberts would appear in over one hundred episodes of the series.[1] After leaving the series in 1969, Roberts spent the next fifteen years appearing in various film productions. He also has a brief spoken word performance on the final track of Miles Davis's 1971 live/studio album Live-Evil. During the 1980s, he became best known for his appearance in the film The Mosquito Coast as well as a smaller role in the cult horror film The Serpent and the Rainbow.[2]\n\nIn 1989, Roberts was granted a recurring role in Miami Vice as \"Police Commissioner Williford\". He only appeared in two episodes before returning to film roles. During the 1990s, he appeared in The Mask of Zorro and also appeared as a guest star on The X-Files. In 2002, Roberts gained a higher notoriety as a film star when he appeared in The Scorpion King in a major supporting role.\n\nIn the 2000s and beyond, Roberts returned to television with guest roles on NCIS, The Unit, CSI, and most recently The River.[3]",
        "birthday": "1943-07-11",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 33688,
        "imdb_id": "nm0730959",
        "known_for_department": "Acting",
        "name": "Conrad Roberts",
        "place_of_birth": "Antigua, Antigua and Barbuda",
        "popularity": 0.1791,
        "profile_path": "/iKm5u3gADmcDAHMTQf96uWpDnZL.jpg"
    }
}