{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jZbMhbhwaMrWosBh9dxLleWnMG8.jpg",
                "genre_ids": [
                    16,
                    35,
                    10751
                ],
                "id": 1267,
                "original_language": "en",
                "original_title": "Meet the Robinsons",
                "overview": "Lewis, a brilliant young inventor, is keen on creating a time machine to find his mother, who abandoned him in an orphanage. Things take a turn when he meets Wilbur Robinson and his family.",
                "popularity": 6.6588,
                "poster_path": "/naya0zF4kT401Sx15AtwB9vpcJr.jpg",
                "release_date": "2007-03-23",
                "title": "Meet the Robinsons",
                "video": false,
                "vote_average": 6.925,
                "vote_count": 3001,
                "character": "Stanley (voice)",
                "credit_id": "52fe42ecc3a36847f802d039",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Paul Matthew Hawke Butcher, Jr."
        ],
        "biography": "Paul Matthew Hawke Butcher, Jr. (born February 14, 1994) is an American actor and singer. His father is former NFL linebacker, Paul Butcher, Sr. Butcher is best known for playing the role of Dustin Brooks, brother of Zoey Brooks, in the four seasons of the TV show Zoey 101 He has provided guest and other minor roles for a number of movies and TV shows, one of the most notable roles being a guest star in the Season 5 Premiere of Criminal Minds. He also played the role of young Walter in the 2007 film The Number 23. Around the age of 6, Butcher starred in the 2000 music video for the Rascal Flatts single \"Prayin' for Daylight\" In 2008, Paul made two cover versions of the songs \"Gimme That\" by Chris Brown and \"This Love\" by Maroon 5 Butcher released a single, \"Don't Go,\" in July 2010. He is currently attending the University of California, Los Angeles.",
        "birthday": "1994-02-14",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 33706,
        "imdb_id": "nm0124703",
        "known_for_department": "Acting",
        "name": "Paul Butcher",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.5047,
        "profile_path": "/sKgE0eOp4zddirLBEXUu1NVyt7i.jpg"
    }
}