{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kJQS6jxxtNTaWI8jw7ynck97rgl.jpg",
                "genre_ids": [
                    28,
                    53
                ],
                "id": 1637,
                "original_language": "en",
                "original_title": "Speed",
                "overview": "Jack Traven, an LAPD cop on SWAT detail, and veteran SWAT officer Harry Temple thwart an extortionist-bomber's scheme for a $3 million ransom. As they corner the bomber, he flees and detonates a bomb vest, seemingly killing himself. Weeks later, Jack witnesses a mass transit city bus explode and nearby a pay phone rings. On the phone is that same bomber looking for vengeance and the money he's owed. He gives a personal challenge to Jack: a bomb is rigged on another city bus - if it slows down below 50 mph, it will explode - bad enough any day, but a nightmare in LA traffic. And that's just the beginning...",
                "popularity": 8.2683,
                "poster_path": "/o1Zs7VaS9y2GYH9CLeWxaVLWd3x.jpg",
                "release_date": "1994-06-09",
                "title": "Speed",
                "video": false,
                "vote_average": 7.144,
                "vote_count": 6487,
                "character": "Ortiz",
                "credit_id": "52fe4307c3a36847f8034fa9",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/9xjUZjuYyehv2qnqMH0oR9nSTft.jpg",
                "genre_ids": [
                    80,
                    28,
                    18,
                    53
                ],
                "id": 9702,
                "original_language": "en",
                "original_title": "Bound by Honor",
                "overview": "Based on the true life experiences of poet Jimmy Santiago Baca, the film focuses on half-brothers Paco and Cruz, and their bi-racial cousin Miklo. It opens in 1972, as the three are members of an East L.A. gang known as the \"Vatos Locos\", and the story focuses on how a violent crime and the influence of narcotics alter their lives. Miklo is incarcerated and sent to San Quentin, where he makes a \"home\" for himself. Cruz becomes an exceptional artist, but a heroin addiction overcomes him with tragic results. Paco becomes a cop and an enemy to his \"carnal\", Miklo.",
                "popularity": 8.813,
                "poster_path": "/gvP6R6juhe2IpCG7QGDgjyUvm0g.jpg",
                "release_date": "1993-02-05",
                "title": "Bound by Honor",
                "video": false,
                "vote_average": 8.132,
                "vote_count": 1450,
                "character": "Popeye",
                "credit_id": "52fe451ec3a36847f80bd8df",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/3NyCi98Y2lqLawrV41kNCcyo6Ab.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 177,
                "original_language": "en",
                "original_title": "The Fisher King",
                "overview": "Two troubled men face their terrible destinies and events of their past as they join together on a mission to find the Holy Grail and thus to save themselves.",
                "popularity": 4.6598,
                "poster_path": "/hwIYw22HmAUMobV4zsX69MgfVUz.jpg",
                "release_date": "1991-09-20",
                "title": "The Fisher King",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1389,
                "character": "Doctor",
                "credit_id": "658f8e964f9a99266e76e40f",
                "order": 36
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Born in Panama City, Panama, Carlos traveled to the United States on an acting scholarship to Stephens College in Columbia, Missouri. After subsequent study at the University of Illinois and Wayne State University in Detroit, he began his professional career in New York, making his Broadway debut in the Circle-in-the-Square's production of \"The National Health.\" Extensive stage work followed, including appearances at many of the country's regional theaters such as the Hartford Stage Company, Atlanta's Alliance Theater and Los Angeles' Mark Taper Forum. Pursuing a parallel career in arts administration, Carlos has been Executive Director of the Hispanic Organization of Latin Actors in New York, a panelist for the New York State Council on the Arts and a co-director of the JACK Arts Ensemble based in Los Angeles.",
        "birthday": "1948-04-05",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 33712,
        "imdb_id": "nm0140033",
        "known_for_department": "Acting",
        "name": "Carlos Carrasco",
        "place_of_birth": " Panama City, Panama",
        "popularity": 0.3443,
        "profile_path": "/a9SwtLdCPYu8TRdnieWsUrUsilG.jpg"
    }
}