{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ruF3Lmd4A8MHbnEBE6lxPMbsHGL.jpg",
                "genre_ids": [
                    9648,
                    18
                ],
                "id": 15,
                "original_language": "en",
                "original_title": "Citizen Kane",
                "overview": "Newspaper magnate Charles Foster Kane is taken from his mother as a boy and made the ward of a rich industrialist. As a result, every well-meaning, tyrannical or self-destructive move he makes for the rest of his life appears in some way to be a reaction to that deeply wounding event.",
                "popularity": 6.1449,
                "poster_path": "/sav0jxhqiH0bPr2vZFU0Kjt2nZL.jpg",
                "release_date": "1941-04-17",
                "title": "Citizen Kane",
                "video": false,
                "vote_average": 8.0,
                "vote_count": 5751,
                "character": "John",
                "credit_id": "52fe420ec3a36847f8000919",
                "order": 12
            },
            {
                "adult": false,
                "backdrop_path": "/loE8zQAj5GROl4BAYNcUTWFJKAx.jpg",
                "genre_ids": [
                    9648,
                    80,
                    53
                ],
                "id": 3766,
                "original_language": "en",
                "original_title": "The Lady from Shanghai",
                "overview": "A romantic drifter gets caught between a corrupt tycoon and his voluptuous wife.",
                "popularity": 4.165,
                "poster_path": "/whqdqWavNMSoeXTx1X3DauO1LG6.jpg",
                "release_date": "1947-12-24",
                "title": "The Lady from Shanghai",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 692,
                "character": "Goldfish",
                "credit_id": "52fe43a4c3a36847f806410b",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/oaRdRdqahtSvHK6VkOphVwGtPRN.jpg",
                "genre_ids": [
                    18
                ],
                "id": 221,
                "original_language": "en",
                "original_title": "Rebel Without a Cause",
                "overview": "After moving to a new town, troublemaking teen Jim Stark is supposed to have a clean slate, although being the new kid in town brings its own problems. While searching for some stability, Stark forms a bond with a disturbed classmate, Plato, and falls for local girl Judy. However, Judy is the girlfriend of neighborhood tough, Buzz. When Buzz violently confronts Jim and challenges him to a drag race, the new kid's real troubles begin.",
                "popularity": 5.1783,
                "poster_path": "/yHStsC8rRRfIjqRN38BQsLh6S7k.jpg",
                "release_date": "1955-10-27",
                "title": "Rebel Without a Cause",
                "video": false,
                "vote_average": 7.518,
                "vote_count": 1681,
                "character": "Attendant (uncredited)",
                "credit_id": "55ee1f87c3a36871bf000d80",
                "order": 36
            },
            {
                "adult": false,
                "backdrop_path": "/ousBoWTm1CltjAGSYOELYP0jFFC.jpg",
                "genre_ids": [
                    80,
                    53
                ],
                "id": 1480,
                "original_language": "en",
                "original_title": "Touch of Evil",
                "overview": "When a car bomb explodes on the American side of the U.S./Mexico border, Mexican drug enforcement agent Miguel Vargas begins his investigation, along with American police captain Hank Quinlan. When Vargas begins to suspect that Quinlan and his shady partner, Menzies, are planting evidence to frame an innocent man, his investigations into their possible corruption quickly put himself and his new bride, Susie, in jeopardy.",
                "popularity": 2.8972,
                "poster_path": "/1pvRgmfBaoMczIJBOi9gCOZ4FMC.jpg",
                "release_date": "1958-03-30",
                "title": "Touch of Evil",
                "video": false,
                "vote_average": 7.8,
                "vote_count": 1511,
                "character": "Eddie Farnham (uncredited)",
                "credit_id": "55fee2eec3a3681a40000529",
                "order": 33
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "August Schilling",
            "August \"Gus\" Schilling"
        ],
        "biography": "August \"Gus\" Schilling (June 20, 1908 - June 16, 1957) was an American actor.\n\nAugust \"Gus\" Schilling (June 20, 1908 – June 16, 1957) was an American film actor who started in burlesque comedy and usually played nervous comic roles, often unbilled. A friend of Orson Welles, he appeared in five of the director's films — Citizen Kane (first screen performance), The Magnificent Ambersons, The Lady from Shanghai, Macbeth and Touch of Evil (final performance, released posthumously).\n\nBorn in New York City, Schilling had a rubber face and flustered gestures which made him a natural comedian and he began his career understudying comedy stars Bert Lahr and Joe Penner on Broadway. He soon became a favorite among burlesque comedians, who welcomed him into the burlesque profession. Schilling was in a relationship with burlesque star Betty Rowland and the couple toured in the Minsky burlesque troupe.\n\nOrson Welles saw Schilling in New York and followed him to Florida. There Welles hired Schilling to appear in a stage production featuring several Shakespearean scenes. \"I learned my part by taking the script to Welles and having him translate the lines to everyday English,\" Schilling recalled in 1939. Welles promised Schilling a part in Welles's first motion picture, and kept his promise: Schilling is featured in Citizen Kane (1941). This established Schilling in Hollywood movies as a \"nervous\" comedian (he plays a jittery symphony conductor in Olsen and Johnson's Hellzapoppin', for example). He also co-starred with character comedian Richard Lane in a series of 11 comedy shorts for Columbia Pictures; the series ran from 1945 to 1950.",
        "birthday": "1908-06-20",
        "deathday": "1957-06-16",
        "gender": 2,
        "homepage": null,
        "id": 33743,
        "imdb_id": "nm0771696",
        "known_for_department": "Acting",
        "name": "Gus Schilling",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.0807,
        "profile_path": "/stBquPtrUjmdYt79Fb3FUDoXY7r.jpg"
    }
}