{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7g5v2zXedkwiFqDlWqcoRUUQYD6.jpg",
                "genre_ids": [
                    18,
                    28,
                    35
                ],
                "id": 11712,
                "original_language": "ja",
                "original_title": "椿三十郎",
                "overview": "Toshiro Mifune swaggers and snarls to brilliant comic effect in Kurosawa's tightly paced, beautifully composed \"Sanjuro.\" In this companion piece and sequel to \"Yojimbo,\" jaded samurai Sanjuro helps an idealistic group of young warriors weed out their clan's evil influences, and in the process turns their image of a proper samurai on its ear.",
                "popularity": 3.2847,
                "poster_path": "/zW47oIH3bc3ggmmmzTvKqM4Fqjk.jpg",
                "release_date": "1962-01-01",
                "title": "Sanjuro",
                "video": false,
                "vote_average": 8.0,
                "vote_count": 661,
                "character": "Iori Izaka",
                "credit_id": "52fe447e9251416c75036cef",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Юдзо Каяма"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nYūzō Kayama (加山 雄三 Kayama Yūzō) is a Japanese popular musician and film star, born on 11 April 1937. His father, Ken Uehara, was a film star during the 1930s. Yuzo Kayama became a big star in the 1960s in the Wakadaishō (Young Guy) film series.\n\nHe showed his ability for drama when Akira Kurosawa cast him for his 1965 film, Red Beard, starring Toshirō Mifune. Kayama reported that he found the two years spent making this film the most difficult, but proudest work of his life.\n\nAs a guitarist, he took inspiration from the American instrumental group The Ventures, and performed a form of psychedelic surf music in the 1960s with his Mosrite guitar. One of his best-known instrumentals is \"Black Sand Beach\". \"Kimi to Itsumademo\" (\"Love Forever\"), another of his compositions, sold over two million copies, and was awarded a gold disc in 1965. At that point it was the biggest selling disc in the Japanese recording industry's history.\n\nDescription above from the Wikipedia article Yūzō Kayama, licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": "1937-04-11",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 33764,
        "imdb_id": "nm0443232",
        "known_for_department": "Acting",
        "name": "Yūzō Kayama",
        "place_of_birth": "Yokohama, Kanagawa Prefecture, Japan",
        "popularity": 1.141,
        "profile_path": "/wkBZ1dcVxZv6GzZUFaBMtN11uEI.jpg"
    }
}