{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rohRr9XqTRF8YwLMGAnTprg3GnL.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 3777,
                "original_language": "ja",
                "original_title": "蜘蛛巣城",
                "overview": "Returning to their lord's castle, samurai warriors Washizu and Miki are waylaid by a spirit who predicts their futures. When the first part of the spirit's prophecy comes true, Washizu's scheming wife, Asaji, presses him to speed up the rest of the spirit's prophecy by murdering his lord and usurping his place. Director Akira Kurosawa's resetting of William Shakespeare's \"Macbeth\" in feudal Japan is one of his most acclaimed films.",
                "popularity": 3.6123,
                "poster_path": "/5NdGZpoInkf4wBInNpry6JAjQ3D.jpg",
                "release_date": "1957-01-15",
                "title": "Throne of Blood",
                "video": false,
                "vote_average": 7.917,
                "vote_count": 923,
                "character": "Lady Asaji Washizu",
                "credit_id": "52fe43a4c3a36847f8064231",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/5BBwSVytssbFuSPZE4DtJVhROjN.jpg",
                "genre_ids": [
                    18,
                    53
                ],
                "id": 11878,
                "original_language": "ja",
                "original_title": "用心棒",
                "overview": "A nameless ronin, or samurai with no master, enters a small village in feudal Japan where two rival businessmen are struggling for control of the local gambling trade. Taking the name Sanjuro Kuwabatake, the ronin convinces both silk merchant Tazaemon and sake merchant Tokuemon to hire him as a personal bodyguard, then artfully sets in motion a full-scale gang war between the two ambitious and unscrupulous men.",
                "popularity": 4.3638,
                "poster_path": "/tN7kYPjRhDolpui9sc9Eq9n5b2O.jpg",
                "release_date": "1961-04-25",
                "title": "Yojimbo",
                "video": false,
                "vote_average": 8.092,
                "vote_count": 1572,
                "character": "Orin",
                "credit_id": "52fe44999251416c7503a5f3",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Исудзу Ямада",
            "ایسوزو یامادا"
        ],
        "biography": "Isuzu Yamada (山田 五十鈴, Yamada Isuzu, 5 February 1917 – 9 July 2012) was a Japanese stage and screen actress whose career spanned seven decades.\n\nYamada was born in Osaka as Mitsu Yamada, the daughter of Kusudu Yamada, a shinpa actor specialising in onnagata roles, and Ritsu, a geisha. Yamada debuted as a film actress in 1930 at age twelve, appearing in the Nikkatsu film Tsurugi wo koete. She soon became one of Nikkatsu's top actresses, but it was her portrayals of strong-willed modern girls in Kenji Mizoguchi's Osaka Elegy and Sisters of the Gion in 1936 at the new Daiichi Eiga studio that earned her popularity and critical acclaim. Moving to Shinkō Kinema and then to Toho, she became a star with Mikio Naruse's Tsuruhachi and Tsurujiro (1938).\n\nDuring the second half of the 1950s, Yamada's main attention shifted towards the stage, but she still appeared in a number of distinguished films like Naruse's Flowing (1956), Yasujirō Ozu's Tokyo Twilight (1957) and Akira Kurosawa's The Lower Depths (1957) and Throne of Blood (1957). Other directors she worked with during this decade include Keisuke Kinoshita, Kaneto Shindō and Shirō Toyoda. In addition to her theatre engagements, she appeared on television, including the long-running Hissatsu series. Her last TV appearance was in 2002.\n\nYamada died from multiple organ failure in Tokyo on 9 July 2012 at the age of 95. She was married four times, to actor Ichirō Tsukita, to producer Kazuo Takimura, to actor Yoshi Katō, and to actor Tsutomu Shimomoto. Her daughter with Tsukita, Michiko, became known as the actress Michiko Saga (1935–1992).\n\nDescription above from the Wikipedia article Isuzu Yamada, licensed under CC-BY-SA, full list of contributors on Wikipedia​",
        "birthday": "1917-02-05",
        "deathday": "2012-07-09",
        "gender": 1,
        "homepage": null,
        "id": 33761,
        "imdb_id": "nm0945222",
        "known_for_department": "Acting",
        "name": "Isuzu Yamada",
        "place_of_birth": "Osaka, Osaka Prefecture, Japan",
        "popularity": 0.3991,
        "profile_path": "/3b029DnOGOGBCj9rzg8RQFfYPHw.jpg"
    }
}