{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zAL3LOswagN9onjN8DPcNFTqKuD.jpg",
                "genre_ids": [
                    18
                ],
                "id": 705,
                "original_language": "en",
                "original_title": "All About Eve",
                "overview": "From the moment she glimpses her idol at the stage door, Eve Harrington is determined to take the reins of power away from the great actress Margo Channing. Eve maneuvers her way into Margo's Broadway role, becomes a sensation and even causes turmoil in the lives of Margo's director boyfriend, her playwright and his wife. Only the cynical drama critic sees through Eve, admiring her audacity and perfect pattern of deceit.",
                "popularity": 2.0482,
                "poster_path": "/blBzZaatPWVuWpXEnPscMA4Xp6m.jpg",
                "release_date": "1950-11-09",
                "title": "All About Eve",
                "video": false,
                "vote_average": 8.076,
                "vote_count": 1604,
                "character": "Margo Channing",
                "credit_id": "52fe426dc3a36847f801dd3f",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/gkXL5ka6ciU4A4KYSvLIAXtvh7k.jpg",
                "genre_ids": [
                    53,
                    18,
                    27
                ],
                "id": 10242,
                "original_language": "en",
                "original_title": "What Ever Happened to Baby Jane?",
                "overview": "A former child star torments her paraplegic sister in their decaying Hollywood mansion.",
                "popularity": 3.7595,
                "poster_path": "/msGYzyWwtjAaA3DScdgmvJ5MReG.jpg",
                "release_date": "1962-10-31",
                "title": "What Ever Happened to Baby Jane?",
                "video": false,
                "vote_average": 7.904,
                "vote_count": 1103,
                "character": "Baby Jane Hudson",
                "credit_id": "52fe43479251416c7500a623",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/esdhJI8DcJuRJooQ7pAtK2ekNqE.jpg",
                "genre_ids": [
                    9648
                ],
                "id": 4192,
                "original_language": "en",
                "original_title": "Death on the Nile",
                "overview": "As Hercule Poirot enjoys a luxurious cruise down the Nile, a newlywed heiress is found murdered on board and every elegant passenger becomes a prime suspect.",
                "popularity": 4.0426,
                "poster_path": "/7qEymSp6wCT19AJxb7T3u6aKpi1.jpg",
                "release_date": "1978-09-29",
                "title": "Death on the Nile",
                "video": false,
                "vote_average": 7.137,
                "vote_count": 851,
                "character": "Marie Van Schuyler",
                "credit_id": "52fe43b1c3a36847f80682bf",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "The First Lady of Film",
            "Ruth Elizabeth Davis",
            "The Fourth Warner Brother",
            "베티 데이비스",
            "Μπέτι Ντέιβις",
            "Бетт Дейвіс"
        ],
        "biography": "Ruth Elizabeth \"Bette\" Davis (April 5, 1908 – October 6, 1989) was an American actress of film, television and theater. Noted for her willingness to play unsympathetic characters, she was highly regarded for her performances in a range of film genres; from contemporary crime melodramas to historical and period films and occasional comedies, though her greatest successes were her roles in romantic dramas.\n\nAfter appearing in Broadway plays, Davis moved to Hollywood in 1930, but her early films for Universal Studios were unsuccessful. She joined Warner Bros. in 1932 and established her career with several critically acclaimed performances. In 1937, she attempted to free herself from her contract and although she lost a well-publicized legal case, it marked the beginning of the most successful period of her career. Until the late 1940s, she was one of American cinema's most celebrated leading ladies, known for her forceful and intense style. Davis gained a reputation as a perfectionist who could be highly combative, and confrontations with studio executives, film directors and costars were often reported. Her forthright manner, clipped vocal style and ubiquitous cigarette contributed to a public persona which has often been imitated and satirized.\n\nDavis was the co-founder of the Hollywood Canteen, and was the first female president of the Academy of Motion Picture Arts and Sciences. She won the Academy Award for Best Actress twice, was the first person to accrue 10 Academy Award nominations for acting, and was the first woman to receive a Lifetime Achievement Award from the American Film Institute. Her career went through several periods of eclipse, and she admitted that her success had often been at the expense of her personal relationships. Married four times, she was once widowed and thrice divorced, and raised her children as a single parent. Her final years were marred by a long period of ill health, but she continued acting until shortly before her death from breast cancer, with more than 100 films, television and theater roles to her credit. In 1999, Davis was placed second, after Katharine Hepburn, on the American Film Institute's list of the greatest female stars of all time.",
        "birthday": "1908-04-05",
        "deathday": "1989-10-06",
        "gender": 1,
        "homepage": "https://www.bettedavis.com/",
        "id": 3380,
        "imdb_id": "nm0000012",
        "known_for_department": "Acting",
        "name": "Bette Davis",
        "place_of_birth": "Lowell, Massachusetts, USA",
        "popularity": 0.863,
        "profile_path": "/uBRNCljWHEG9cW9em2ZyoGWQQN5.jpg"
    }
}