{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9ZznETDyfPWVugRiv0jfGrkRftw.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 937278,
                "original_language": "en",
                "original_title": "A Man Called Otto",
                "overview": "When a lively young family moves in next door, grumpy widower Otto Anderson meets his match in a quick-witted, pregnant woman named Marisol, leading to an unlikely friendship that turns his world upside down.",
                "popularity": 8.7533,
                "poster_path": "/130H1gap9lFfiTF9iDrqNIkFvC9.jpg",
                "release_date": "2022-12-28",
                "title": "A Man Called Otto",
                "video": false,
                "vote_average": 7.76,
                "vote_count": 3238,
                "character": "Stimco Steel Boss",
                "credit_id": "63c8b5b7142ef100bd18e05b",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Peter Sipla was born in the Chicago suburb of Warrenville, to Emil Thomas (Tom) Sipla, and Maritza Natalia (Wong) Sipla.\n\nOn his grandfather's side, the Sipla clan is from the Bohemian/Czech neighborhoods in central Wisconsin. On his grandmother's side, the Stafford family are of British and Dutch descent, and have been in Warrenville since 1858, when Dorus Stafford was the local leather tanner. Peter's great-uncle William T. (Bill) Stafford became the newly incorporated city's first Mayor, in 1967.\n\nCivic duty and service was a part of Peter's upbringing, coming from a family of firemen, nurses, policemen, roofers, carpenters, and social organization members who were very active in local events and the growth of the city.\n\nPeter's mother is of Chinese-Panamanian ancestry, growing up in Colon, Panama with four siblings, two parents, and their grandfather (who lived to 103 years old). Growing up in a household filled with Latin music fostered a love of music and percussion.\n\nPeter first stepped onto the stage in a community recital at the age of six, in a tap number with his mother and older sister. A greater appreciation for the theater was inevitable, due to the endless stream of movie musicals his sister watched in their home.\n\nAt the age of fourteen, he began to perform in community theater with his sister and father. Peter juggled rehearsals for shows, percussion ensembles, choirs, and drumline throughout his high school career, and went on to study Theater Performance and Music Performance at North Central College in Naperville, where he performed in 14 mainstage productions, and discovered his love of dialect and voice work.\n\nHis first foray into television was on a two week contract filming an episode of Chicago Fire for NBC in 2016, as Hundley, one of the ne'er-do-well replacement firefighters.\n\nAfter that, he went on to small roles in Fox's neXt (2020), and was part of the first day of shooting for HBOMax's hit show Station Eleven (2021).\n\nOn the silver screen, Peter had the pleasure of working with the incomparable Tom Hanks in A Man Called Otto (2022), and was ecstatic to watch his wide-release theatrical debut surrounded by family.\n\nOn stage, Peter has had the pleasure of working with Chicago Shakespeare Theater, Paramount Theatre, The Marriott Theatre, Drury Lane Theatre, the Lyric Opera of Chicago, Writers' Theatre, City Theatre, Merrimack Repertory Theatre, TimeLine Theatre, Victory Gardens Theater, Porchlight Music Theater, Next Theater, Red Tape Theatre, First Folio Theater, Brightside Theatre, Steel Beam Theatre, and Disney Cruise Line, to name few.\n\nPeter's voiceover work has been heard in hundreds of commercials and industrials.",
        "birthday": "1984-04-01",
        "deathday": null,
        "gender": 2,
        "homepage": "https://resumes.breakdownexpress.com/648415-3621860-34567",
        "id": 3386791,
        "imdb_id": "nm4904976",
        "known_for_department": "Acting",
        "name": "Peter Sipla",
        "place_of_birth": "Warrenville, Illinois, USA",
        "popularity": 0.0286,
        "profile_path": "/6XmuxSrg9IsZEXHYqAGu8Gox9v5.jpg"
    }
}