{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/u218sykbUQIh6EWtTdJzguU5LcG.jpg",
                "genre_ids": [
                    18
                ],
                "id": 16858,
                "original_language": "en",
                "original_title": "All That Jazz",
                "overview": "Joe Gideon is at the top of the heap, one of the most successful directors and choreographers in musical theater. But he can feel his world slowly collapsing around him - his obsession with work has almost destroyed his personal life, and only his bottles of pills keep him going.",
                "popularity": 2.5928,
                "poster_path": "/culCEdj4srLljefgn4XKd6k3C5t.jpg",
                "release_date": "1979-12-16",
                "title": "All That Jazz",
                "video": false,
                "vote_average": 7.505,
                "vote_count": 544,
                "character": "Dancer Backstage",
                "credit_id": "61f1cb296af9dd0068e94662",
                "order": 63
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Kerry Casserly is an Actress and Dancer. Kerry performed professionally on Broadway in New York for 23 years under the industry's most renowned directors and choreographers, including Michael Bennett, Tommy Tune, Bob Fosse, Martin Charnin and Peter Gennaro. She performed in Pippin, A Chorus Line, Annie, My One and Only, Annie Warbucks and Sophisticated Ladies. Kerry has served on the faculty at New York University, American Musical and Dramatic Academy NYC, University of Minnesota, the University of Michigan Ann Arbor, and is currently an adjunct professor at St. Catherines teaching theater dance. Her TV and film credits include appearances in All That Jazz, Baryshnikov on Broadway, David Letterman, Guiding Light. Kerry has directed and choreographed A Chorus Line for Music Theater Wichita Casa Manana (Fort Worth Texas). Kerry choreographed A Chorus Line at Seattle’s 5th Avenue Theatre in 2014. Most recently Kerry co-directed and choreographed Ordway's production of A Chorus Line in 2016. She is a proud member of SSDC and the Actor’s Equity Association.",
        "birthday": "1953-10-26",
        "deathday": null,
        "gender": 1,
        "homepage": "https://lundstrum.org/casserly-sisters/kerry-casserly-carter",
        "id": 3399758,
        "imdb_id": "nm0144115",
        "known_for_department": "Acting",
        "name": "Kerry Casserly",
        "place_of_birth": "Minneapolis, Minnesota, USA",
        "popularity": 0.0,
        "profile_path": null
    }
}