{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/x5948QrtMqvnf2OBP9ESpdmONQa.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 3870,
                "original_language": "it",
                "original_title": "Novecento",
                "overview": "The epic tale of a class struggle in twentieth century Italy, as seen through the eyes of two childhood friends on opposing sides.",
                "popularity": 2.8341,
                "poster_path": "/deWzfCC59tmtEQvKSmflDe14FvR.jpg",
                "release_date": "1976-08-28",
                "title": "1900",
                "video": false,
                "vote_average": 7.8,
                "vote_count": 657,
                "character": "Neve",
                "credit_id": "52fe43a5c3a36847f80648db",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/j7rl2LphIbC88FppTfwJ5Gxj9kX.jpg",
                "genre_ids": [
                    27
                ],
                "id": 11906,
                "original_language": "it",
                "original_title": "Suspiria",
                "overview": "An American newcomer to a prestigious German ballet academy comes to realize that the school is a front for something sinister amid a series of grisly murders.",
                "popularity": 5.3383,
                "poster_path": "/5ya8jTbNZTrCFUx9OwpNBjCivXY.jpg",
                "release_date": "1977-02-01",
                "title": "Suspiria",
                "video": false,
                "vote_average": 7.488,
                "vote_count": 3042,
                "character": "Sara",
                "credit_id": "5e8cfbecb84f940016af16cd",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "After graduating in Architecture, Stefania began a career in acting and worked with Pietro Germi, Bernardo Bertolucci, Peter Greenaway and Dario Argento. She moved to New York in the late 1970s, where she acted in Andy Warhol's 'Bad'. While in New York she decided to move behind the camera, and became a director.\n\nWith Francesca Marciano, she wrote and directed the film \"Lontano da dove\", presented at the Venice Film Festival (1983). In 1997 she wrote and directed another feature film \"Un Paradiso di Bugie\". Her career as director also includes the making of six feature films for the Italian television network MEDIASET.\n\nA passionate traveler, Stefania has made a great number of documentaries and reportages for RAI and MEDIASET. She focuses her attention on contemporary topics concerning women and young people. She has made many hard-hitting series including: \"Islam: stories of women\"; \"Latin America: stories of women\"; \"To be 20 years old in...\" (broadcast in ten European Countries 2004-2005); \"So close so far :portraits in the suburbs\". \"Schiaffo alla mafia\"(A blow to the Mafia)\n\nBetween 2000-2002 , Stefania was the Artistic Director of Siena's Film Festival \"Terra di Siena\". In 2010 she was Managing Director of DGTV IESTV.\n\nCurrently, Stefania writes and directs programs, reportages and documentaries for RAI, and for satellite channels: RAI Sat Cinema World, Gambero Rosso Channel, and Sky. She also works as a journalist, contributing to several popular women's magazines.",
        "birthday": "1948-09-04",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 34043,
        "imdb_id": "nm0143743",
        "known_for_department": "Acting",
        "name": "Stefania Casini",
        "place_of_birth": "Villa di Chiavenna, Italy",
        "popularity": 0.166,
        "profile_path": "/aSg1jmYTV4nUhm6noY6ocP6hGUT.jpg"
    }
}