{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rdISVXhHt8F6VZrdLadqUqQGmFc.jpg",
                "genre_ids": [
                    18,
                    9648,
                    878,
                    53,
                    14
                ],
                "id": 9667,
                "original_language": "en",
                "original_title": "The Jacket",
                "overview": "A military veteran goes on a journey into the future, where he can foresee his death and is left with questions that could save his life and those he loves.",
                "popularity": 3.7383,
                "poster_path": "/mdUKskPTFYxPgbEUfoQryM79wz8.jpg",
                "release_date": "2005-03-04",
                "title": "The Jacket",
                "video": false,
                "vote_average": 6.869,
                "vote_count": 1580,
                "character": "Nurse Sally",
                "credit_id": "62799ed4eea34d004f382904",
                "order": 23
            },
            {
                "adult": false,
                "backdrop_path": "/6dyqfaPdeM5Z22ylw9ZTyjROBo7.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 45269,
                "original_language": "en",
                "original_title": "The King's Speech",
                "overview": "The King's Speech tells the story of the man who became King George VI, the father of Queen Elizabeth II. After his brother abdicates, George ('Bertie') reluctantly assumes the throne. Plagued by a dreaded stutter and considered unfit to be king, Bertie engages the help of an unorthodox speech therapist named Lionel Logue. Through a set of unexpected techniques, and as a result of an unlikely friendship, Bertie is able to find his voice and boldly lead the country into war.",
                "popularity": 5.0843,
                "poster_path": "/pVNKXVQFukBaCz6ML7GH3kiPlQP.jpg",
                "release_date": "2010-11-26",
                "title": "The King's Speech",
                "video": false,
                "vote_average": 7.735,
                "vote_count": 8986,
                "character": "Nurse",
                "credit_id": "6279a2d223be46009a16f07c",
                "order": 24
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Tessa Gallagher",
            "Theresa Gallagher"
        ],
        "biography": "Teresa Gallagher is an American-born British actress, voice actress, and singer who is known for her roles in several animated television shows, such as Nicole Watterson, Margaret Robinson, Penny Fitzgerald, and various characters in The Amazing World of Gumball; Annie, Clarabel, Emily, Rosie, Mavis, Gina, Frieda, and numerous characters in Thomas & Friends; Egbert and Gilda in Poppy Cat; EOS and various guest characters in Thunderbirds Are Go; Elias and Helinor in Elias: Rescue Team Adventures; and the Tiddlytubbies in the 2015 reboot of Teletubbies.\n\nFor Disney, she voiced Mater's computer in Disney/Pixar's Cars 2 and its video game; the titular character in the U.K. version of Henry Hugglemonster; Dashi in the Disney Junior British series The Octonauts; and Jessica Wright, Mallory, and Lolo Calorie in the Disney XD British/French series Dude, That's My Ghost!.",
        "birthday": "1971-04-23",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 340927,
        "imdb_id": "nm0302502",
        "known_for_department": "Acting",
        "name": "Teresa Gallagher",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.1792,
        "profile_path": "/2oHiEkrPfgbfKllBFDAhZK4v1Of.jpg"
    }
}