{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zpVMWiNJgcwHB0zIMGjXQMnSKPZ.jpg",
                "genre_ids": [
                    18
                ],
                "id": 10024,
                "original_language": "en",
                "original_title": "My Sister's Keeper",
                "overview": "Sara and Brian live an idyllic life with their young son and daughter. But their family is rocked by sudden, heartbreaking news that forces them to make a difficult and unorthodox choice in order to save their baby girl's life. The parents' desperate decision raises both ethical and moral questions and rips away at the foundation of their relationship. Their actions ultimately set off a court case that threatens to tear the family apart, while revealing surprising truths that challenge everyone's perceptions of love and loyalty and give new meaning to the definition of healing.",
                "popularity": 3.7719,
                "poster_path": "/atRGqnG7pe0hZP97RWDLrT2hRGZ.jpg",
                "release_date": "2009-06-26",
                "title": "My Sister's Keeper",
                "video": false,
                "vote_average": 7.375,
                "vote_count": 2173,
                "character": "Taylor Ambrose",
                "credit_id": "5ea0dbd3b7b69d002643fb29",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "توماس دکر"
        ],
        "biography": "Thomas Alexander Dekker (born December 28, 1987) is an American film and television actor and a musician. He is also a singer and has written and produced two albums. He is best known for his roles as John Connor in Terminator: The Sarah Connor Chronicles, Nick Szalinski on Honey, I Shrunk the Kids: The TV Show, and Zach on Heroes. He also did the voice of Littlefoot in The Land Before Time V-IX (singing voice in The Land Before Time V) and as Fievel Mousekewitz in An American Tail: The Treasure of Manhattan Island and An American Tail: The Mystery of the Night Monster. He is also known for playing Jesse Braun in the 2010 remake of A Nightmare on Elm Street, and recently, Smith in Gregg Araki's film Kaboom.\n\nDescription above from the Wikipedia article Thomas Dekker (actor), licensed under CC-BY-SA, full list of contributors on Wikipedia​",
        "birthday": "1987-12-28",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 34199,
        "imdb_id": "nm0215281",
        "known_for_department": "Acting",
        "name": "Thomas Dekker",
        "place_of_birth": "Las Vegas, Nevada, USA",
        "popularity": 0.5411,
        "profile_path": "/vO72HH4PfesrCwEioBJn2gR6ebC.jpg"
    }
}