{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ft8WRF2xqEwwGWa59naDUybKTAx.jpg",
                "genre_ids": [
                    18,
                    10752,
                    10749
                ],
                "id": 770,
                "original_language": "en",
                "original_title": "Gone with the Wind",
                "overview": "The spoiled daughter of a Georgia plantation owner conducts a tumultuous romance with a cynical profiteer during the American Civil War and Reconstruction Era.",
                "popularity": 7.332,
                "poster_path": "/lNz2Ow0wGCAvzckW7EOjE03KcYv.jpg",
                "release_date": "1939-12-15",
                "title": "Gone with the Wind",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 4191,
                "character": "A Carpetbagger Businessman",
                "credit_id": "52fe4274c3a36847f801fe81",
                "order": 38
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Olin Howlin",
            "Olin Ross Howland"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nOlin Ross Howland (February 10, 1886 – September 20, 1959) was an American film and theatre actor.\n\nHowland was born in Denver, Colorado, to Joby A. Howland, one of the youngest enlisted participants in the Civil War, and Mary C. Bunting. His older sister was the famous stage actress Jobyna Howland.\n\nFrom 1909 to 1927, Howland appeared on Broadway in musicals, occasionally performing in silent films. The musicals include Leave It to Jane (1917), Two Little Girls in Blue (1921) and Wildflower (1923). He was in the film Janice Meredith (1924) with Marion Davies. With the advent of sound films, his theatre background proved an asset, and he concentrated mostly on films thereafter, appearing in nearly two hundred movies between 1918 and 1958.\n\nHowland often played eccentric and rural roles in Hollywood. His parts were often small and uncredited, and he never got a leading role. He was a personal favorite of David O. Selznick, who cast him in his movies Nothing Sacred (1937) as a strange luggage man, The Adventures of Tom Sawyer (1938, as the teacher Mr. Dobbins) and Gone with the Wind (1939) as a carpetbagger businessman. He also played in numerous westerns from Republic Pictures, including the John Wayne films In Old California (1942) and Angel and the Badman (1947). As a young man, Howland learned to fly at the Wright Flying School and soloed on a Wright Model B. This lent special sentiment in his scenes with James Stewart in the film The Spirit of St. Louis (1957), as Stewart was also a pilot in real life. The Spirit of St. Louis and Them (1954),where he played a drunken old man, and The Blob (1958) were his last films.\n\nHe also played in telelevision shows during the 1950s. In 1958 and 1959, he was cast as Charley Perkins in five episodes of ABC's sitcom The Real McCoys, starring Walter Brennan.\n\nHowland never married and had no children. He worked until his death in Hollywood, California, at the age of 73.",
        "birthday": "1886-02-09",
        "deathday": "1959-09-20",
        "gender": 2,
        "homepage": null,
        "id": 34209,
        "imdb_id": "nm0398250",
        "known_for_department": "Acting",
        "name": "Olin Howland",
        "place_of_birth": "Denver, Colorado, USA",
        "popularity": 0.3779,
        "profile_path": "/bufCe2EXNF3ZVm3GPTY9LyIWn7y.jpg"
    }
}