{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9AjG0YJLgDUtHl5KgrThHPhNNwZ.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 3083,
                "original_language": "en",
                "original_title": "Mr. Smith Goes to Washington",
                "overview": "After the death of a United States Senator, idealistic Jefferson Smith is appointed as his replacement in Washington. Soon, the naive and earnest new senator has to battle political corruption.",
                "popularity": 2.8661,
                "poster_path": "/nDjg1fbNyq15excNDl3acd2IqAk.jpg",
                "release_date": "1939-10-19",
                "title": "Mr. Smith Goes to Washington",
                "video": false,
                "vote_average": 7.843,
                "vote_count": 1118,
                "character": "Radio Announcer #2 (uncredited)",
                "credit_id": "555f2b719251417e5f0025d4",
                "order": 153
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Robert Middlemas",
            "Bob Middlemass",
            "Robert M. Middlemass"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nRobert Middlemass (3 September 1883, New Britain, Connecticut – 10 September 1949, Los Angeles, California) was an American playwright and stage actor, and later character actor with over 100 film appearances. usually playing detectives or policemen.\n\nMiddlemass graduated from Harvard University in 1909 and initially went into the insurance business, but soon went on the stage, joining the Castle Square Theatre stock company in Boston. He debuted on Broadway in September 1914 in The Bludgeon at the Maxine Elliott Theatre.\n\nHis best known play was a one-act melodrama written with Holworthy Hall (real name H. E. Porter, a college roommate) titled The Valiant, which was also made into a film of the same name in 1929, and as The Man Who Wouldn't Talk in 1940. The play became a favorite for amateur and local theater groups, and is still performed today.\n\nMiddlemass moved to Los Angeles around 1935, and began appearing in films. He died there in 1949.",
        "birthday": "1883-09-03",
        "deathday": "1949-09-10",
        "gender": 2,
        "homepage": null,
        "id": 34208,
        "imdb_id": "nm0585461",
        "known_for_department": "Acting",
        "name": "Robert Middlemass",
        "place_of_birth": "New Britain, Connecticut, USA",
        "popularity": 2.637,
        "profile_path": "/5hc2CgW5mGwsktdqTHcapbBo9G3.jpg"
    }
}