{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1jZ3wNpON50whGEH7YOcTQrU45B.jpg",
                "genre_ids": [
                    18,
                    10752,
                    36
                ],
                "id": 715931,
                "original_language": "en",
                "original_title": "Emancipation",
                "overview": "Inspired by the gripping true story of a man who would do anything for his family—and for freedom. When Peter, an enslaved man, risks his life to escape and return to his family, he embarks on a perilous journey of love and endurance.",
                "popularity": 5.3394,
                "poster_path": "/s9sUK1vAaOcxJfKzNTszrNkPhkH.jpg",
                "release_date": "2022-12-02",
                "title": "Emancipation",
                "video": false,
                "vote_average": 7.8,
                "vote_count": 1179,
                "character": "Young Thomas Girl",
                "credit_id": "63a0e6d18ddc34150ee169b8",
                "order": 27
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Merah Benoit was born in South Louisiana July 2, 2012, into a family of entertainers. Her great grandfather spent time as a traveling circus performer, and her uncle is a Grammy nominated blues artists, as well as her dad, an accomplished singer-songwriter. It was only a matter of time before she would take to the craft herself. At age 5, Merah began her professional career by gaining notoriety within the New Orleans theatre community by landing signature roles in such classics as \"Peter Pan\" and \"The Sound of Music\". Her love of performing continued to the big screen and television where she has had the opportunity to work with Award-Winning actors such as Melissa Leo, Renee Zellweger, and Will Smith. Merah enjoys balancing her busy schedule with taking care of her pet bunny and rescue dog as well as practicing with her classic rock band \"The Snores\".",
        "birthday": "2012-06-30",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 3420019,
        "imdb_id": "nm12045962",
        "known_for_department": "Acting",
        "name": "Merah Benoit",
        "place_of_birth": "Louisiana, USA",
        "popularity": 0.0465,
        "profile_path": "/aVEEjpWuE6dUj1PCPAdX9nyQAqG.jpg"
    }
}