{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kcBlY5FasH8ti150aYExULw53ui.jpg",
                "genre_ids": [
                    18,
                    10402,
                    36
                ],
                "id": 16052,
                "original_language": "en",
                "original_title": "Selena",
                "overview": "In this biographical drama, Selena Quintanilla is born into a musical Mexican-American family in Texas. Her father, Abraham, realizes that his young daughter is talented and begins performing with her at small venues. She finds success and falls for her guitarist, Chris Perez, who draws the ire of her father. Seeking mainstream stardom, Selena begins recording an English-language album which, tragically, she would never complete.",
                "popularity": 3.5355,
                "poster_path": "/j8xX3yBAFOayfSaImgLZPnAcdWz.jpg",
                "release_date": "1997-03-21",
                "title": "Selena",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 1262,
                "character": "Self (archive footage)",
                "credit_id": "6205f14f38e510006a53fcbb",
                "order": 63
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Abraham Isaac Quintanilla III",
            "A. B. Quintanilla III"
        ],
        "biography": "Abraham Isaac Quintanilla III (born December 13, 1963), known professionally as A. B. Quintanilla III or A. B. Quintanilla, is an American record producer, songwriter and musician, and the older brother of singer Selena, known as \"The Queen of Tejano music.\"  Along with Selena, his other sister Suzette, and his father Abraham, he became a member of Los Dinos in 1980. As a member of Los Dinos, A. B. played bass guitar, produced, and wrote songs for Selena that became successful singles such as \"Como la Flor,\" \"Amor Prohibido,\" and \"No Me Queda Más.\" After Selena's death, he would create the bands Kumbia Kings and Kumbia All Starz.",
        "birthday": "1963-12-13",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 3421517,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "A.B. Quintanilla",
        "place_of_birth": "Toppenish, Washington, United States",
        "popularity": 0.0311,
        "profile_path": null
    }
}