{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9AjG0YJLgDUtHl5KgrThHPhNNwZ.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 3083,
                "original_language": "en",
                "original_title": "Mr. Smith Goes to Washington",
                "overview": "After the death of a United States Senator, idealistic Jefferson Smith is appointed as his replacement in Washington. Soon, the naive and earnest new senator has to battle political corruption.",
                "popularity": 2.8661,
                "poster_path": "/nDjg1fbNyq15excNDl3acd2IqAk.jpg",
                "release_date": "1939-10-19",
                "title": "Mr. Smith Goes to Washington",
                "video": false,
                "vote_average": 7.843,
                "vote_count": 1118,
                "character": "Mr. Edwards (uncredited)",
                "credit_id": "555f2371c3a36868e5002a84",
                "order": 63
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Harlan Paul Briggs"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nHarlan Briggs (August 17, 1879 – January 26, 1952) was an American actor and vaudeville performer who was active from the 1930s until his death in 1952. During the course of his career he appeared on Broadway, in over 100 films, as well as appearing on television once towards the end of his career.\n\nBriggs was born in Blissfield, Michigan. Although he was a graduate of the University of Michigan Law School, he chose to go into acting rather than pursue a career in law.\n\nHis acting career began in vaudeville at around the beginning of the 20th century. He would make his Broadway debut in 1926, in the drama Up the Line. He worked steadily on Broadway through 1935. On August 6, 1929 he began a successful run in the featured role of G. A. Appleby in It's a Wise Child at the Belasco Theatre. In 1934 he had another featured role in the successful play Dodsworth, as Tubby Pearson. The show opened at the Shubert Theatre on February 24, 1934 and ran for 147 performances, starring Walter Huston as Samuel Dodsworth. After a six-week hiatus, the show reopened at the Shubert on August 20 and ran for an additional 168 performances. When Samuel Goldwyn bought the rights to the play, Briggs was one of two of the original Broadway cast to reprise their roles in the film, the other being Huston in the title role.\n\nBriggs would focus on his film career for the remainder of the 1930s, before returning to Broadway in the 1940s, combining both stage and screen performances during that decade. The most successful of his Broadway appearances in the 1940s was as Constable Small in Ramshackle Inn, which featured ZaSu Pitts in her Broadway debut. The Story of Mary Surratt, in which Briggs appeared in 1947, was Briggs' 400th play.\n\nBeginning with Dodsworth, Briggs worked consistently in films over the next 16 years, until his death in 1952, appearing in over 100 films. His most famous role was as Dr. Stall in the 1940 comedy classic The Bank Dick, starring W.C. Fields. Other notable films in which he appeared include After the Thin Man (1936), Stella Dallas (1937), Having Wonderful Time (1938), The Adventures of Huckleberry Finn (1939), Mr. Smith Goes to Washington (1939), My Little Chickadee (1940), Abe Lincoln in Illinois (1940), State Fair (1945), Night and Day (1946), Little Women (1949), Goodbye, My Fancy (1951), and Carrie (1952). The last film on which Briggs worked was The Sea Hornet, which was in production in April and May 1951, and released later that year.\n\nOn January 26, 1952, Briggs died in Motion Picture & Television Country House and Hospital from complications resulting from a heart attack. His death occurred almost half a year prior to the release of Carrie.\n\nBriggs married actress Viola Scott on July 3, 1914. They had four sons.",
        "birthday": "1879-08-16",
        "deathday": "1952-01-26",
        "gender": 2,
        "homepage": null,
        "id": 34238,
        "imdb_id": "nm0109034",
        "known_for_department": "Acting",
        "name": "Harlan Briggs",
        "place_of_birth": "Blissfield, Michigan, USA",
        "popularity": 0.0493,
        "profile_path": "/zFDGemO1x2h9KHqq4Xeg3uqwKPZ.jpg"
    }
}