{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yjlg8Gq3TAWlFSUxh7Icey8uM4P.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 10653,
                "original_language": "en",
                "original_title": "The Seven Year Itch",
                "overview": "With his family away for their annual summer holiday, a publishing executive decides to live a bachelor's life. The beautiful but ditzy blonde from the apartment above catches his eye and they soon start spending time together—maybe a little too much time!",
                "popularity": 1.7389,
                "poster_path": "/4oLqx0QbjWFzWtkxRmDLGH47CUJ.jpg",
                "release_date": "1955-06-03",
                "title": "The Seven Year Itch",
                "video": false,
                "vote_average": 7.063,
                "vote_count": 934,
                "character": "M. Brady",
                "credit_id": "52fe439c9251416c7501730d",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Donald Hugh MacBride",
            "Donald Mac Bride",
            "Don MacBride",
            "Donald McBride",
            "Don McBride"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nDonald Hugh MacBride (June 23, 1893 – June 21, 1957) was an American character actor on stage, in films, and on television who launched his career as a teenage singer (making several recordings in 1907) in vaudeville and went on to be an actor on Broadway, where he appeared in Room Service.\n\nHe appeared in nearly 140 films between 1914 and 1955. His year of birth is given variously as 1889 or 1893 in the standard reference books, but the latter seems to be the correct one as his New York Times obituary records his age as 63.\n\nMacBride was best known for his portrayal of detectives in crime films. One such role was as Sgt. Roberts in the 1941 comedy Topper Returns, starring Roland Young. He also did several slapstick roles in films with comedians such as the Marx Brothers.\n\nHe had the role of Milton J. Clyde on the television version of My Friend Irma.\n\nHe was born in Brooklyn, New York, and died in Los Angeles, California. Survivors included his wife and a stepson.",
        "birthday": "1889-06-22",
        "deathday": "1957-06-21",
        "gender": 2,
        "homepage": null,
        "id": 34234,
        "imdb_id": "nm0531385",
        "known_for_department": "Acting",
        "name": "Donald MacBride",
        "place_of_birth": "Brooklyn, New York, USA",
        "popularity": 0.6129,
        "profile_path": "/AkOwJ81bJkoorsGZMjhMpQZbCrO.jpg"
    }
}