{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wqgZSvgoctaadgwUdPYVsksivxn.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749
                ],
                "id": 20334,
                "original_language": "en",
                "original_title": "The Shop Around the Corner",
                "overview": "Two employees at a gift shop can barely stand one another, without realising that they are falling in love through the post as each other's anonymous pen pal.",
                "popularity": 3.5227,
                "poster_path": "/dZ1aEzGYRiqJwPfjS6VL7wUkHmF.jpg",
                "release_date": "1940-01-12",
                "title": "The Shop Around the Corner",
                "video": false,
                "vote_average": 8.1,
                "vote_count": 766,
                "character": "Ilona",
                "credit_id": "52fe43e2c3a368484e003b19",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nInez Courtney (March 12, 1908 – April 5, 1975) was an American actress on the Broadway stage and in films.\n\nBorn in New York City, New York, she came from a large Irish-American family. Her father died when she was fifteen so she decided to go onto the stage. A year later she was doing a specialty dance which earned her the nicknames of St Vitis, Mosquito and Lightning.\n\nCourtney's first role as a singer and dancer came in the musical The Wild Rose in 1926. She became well-known among New York theatrical audiences for her work in Good News (1927), a musical comedy about college life. Her other credits include Spring Is Here in 1929 and America's Sweetheart in 1931. In the early 1930s, Miss Courtney left Broadway and went to Hollywood.\n\nCourtney acted in 58 films between 1930 and 1940. She secured her first movie work by asking Harry Cohn of Columbia Pictures for his assistance. The red-headed comedian made her screen debut as Cousin Betty in Loose Ankles (1930). The film co-starred Douglas Fairbanks, Jr. and Loretta Young. Her many movie credits include The Raven (1935), Suzy (1936), The Shop Around the Corner (1940), and Turnabout (1940), her last film.\n\nCourtney was married to an Italian nobleman, whereby she acquired the title Marchesa, but did not use it. She died at the Jersey Shore Medical Center in Neptune, New Jersey in 1975 of undisclosed causes at the age of 67.",
        "birthday": "1908-03-12",
        "deathday": "1975-04-05",
        "gender": 1,
        "homepage": null,
        "id": 34244,
        "imdb_id": "nm0183918",
        "known_for_department": "Acting",
        "name": "Inez Courtney",
        "place_of_birth": "Amsterdam, New York, USA",
        "popularity": 0.1222,
        "profile_path": "/auiSYSVITeG1z7Web1DpiSD2rAc.jpg"
    }
}