{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fzJgCQh2NBnUYlms8EGyr4bPNz3.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 900,
                "original_language": "en",
                "original_title": "Bringing Up Baby",
                "overview": "David Huxley is waiting to get a bone he needs for his museum collection. Through a series of strange circumstances, he meets Susan Vance, and the duo have a series of misadventures which include a leopard called Baby.",
                "popularity": 3.6146,
                "poster_path": "/vTNNOtemaYmtx3k2NpsLMRJKEwZ.jpg",
                "release_date": "1938-02-18",
                "title": "Bringing Up Baby",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 1022,
                "character": "Zoo Official (uncredited)",
                "credit_id": "52fe428ac3a36847f8026b91",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Edward F. Gargan",
            "Edward P. Gargan",
            "Ed Gargan"
        ],
        "biography": "Edward Gargan was born of Irish parents in Brooklyn, New York in 1902. He was the elder brother of actor William Gargan whose July 17 birthday he shared.\n\nEdward Gargan started as a musical comedy actor on Broadway. He sang in \"Good News\", \"Rose-Marie\", and other hit musicals of the 1920s, and also in opera. One of his early shows was \"Polly of Hollywood\" in 1927. He portrayed Patrolman Mulligan, one of the principals of \"Strictly Dishonorable\", in 1930.\n\nHe went to Hollywood in 1932 and the next year was in the cast of the film \"David Harum\". For the next 19 years he appeared in a variety of movies. Gargan was one of the most prolific bit players in the history of the movies, specializing in dumb policemen and dense sidekicks. He appeared in nearly 300 feature films over a three-decade span between 1921 and 1952, and television work from 1951 to 1953.\n\nGargan died in New York City in 1964.",
        "birthday": "1902-07-17",
        "deathday": "1964-02-19",
        "gender": 2,
        "homepage": null,
        "id": 34294,
        "imdb_id": "nm0307324",
        "known_for_department": "Acting",
        "name": "Edward Gargan",
        "place_of_birth": "Brooklyn, New York City, New York, USA",
        "popularity": 0.0835,
        "profile_path": "/gxufkPI5QRcZsMCWGaToCpcbNp0.jpg"
    }
}