{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wSiBXaJ2PtlxUGH2waIxQZjFPhg.jpg",
                "genre_ids": [
                    28,
                    12,
                    35,
                    80
                ],
                "id": 11576,
                "original_language": "en",
                "original_title": "It's a Mad, Mad, Mad, Mad World",
                "overview": "A group of strangers come across a man dying after a car crash who proceeds to tell them about the $350,000 he buried in California. What follows is the madcap adventures of those strangers as each attempts to claim the prize for himself.",
                "popularity": 7.5039,
                "poster_path": "/j4mWzOisSHFkaqIkq34l2mm8a5K.jpg",
                "release_date": "1963-11-07",
                "title": "It's a Mad, Mad, Mad, Mad World",
                "video": false,
                "vote_average": 6.97,
                "vote_count": 637,
                "character": "Traffic Cop (uncredited)",
                "credit_id": "64db73a559e8a900ac07587c",
                "order": 64
            },
            {
                "adult": false,
                "backdrop_path": "/5zTwAcnI3zCJ0mucPPnoBtkSWEV.jpg",
                "genre_ids": [
                    35,
                    10749,
                    80
                ],
                "id": 239,
                "original_language": "en",
                "original_title": "Some Like It Hot",
                "overview": "Two musicians witness a mob hit and struggle to find a way out of the city. Their only opportunity comes in the form of joining an all-girl band as they prepare to leave on a tour. The two disguise themselves as women and struggle to keep their identities secret as they deal with the problems this brings.",
                "popularity": 6.0458,
                "poster_path": "/hVIKyTK13AvOGv7ICmJjK44DTzp.jpg",
                "release_date": "1959-03-19",
                "title": "Some Like It Hot",
                "video": false,
                "vote_average": 8.096,
                "vote_count": 3670,
                "character": "Bouncer (uncredited)",
                "credit_id": "566b1780c3a3683f56004a35",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Thomas A. Kennedy",
            "Thomas Kennedy",
            "Thomas Aloyisus Kennedy"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nTom Kennedy (July 15, 1885 – October 6, 1965) was an American actor known for his roles in Hollywood comedies from the silent days, with such producers as Mack Sennett and Hal Roach, mainly supporting lead comedians such as the Marx Brothers, W. C. Fields, Mabel Normand, Shemp Howard, Laurel and Hardy, and the Three Stooges. Kennedy also played dramatic roles as a supporting actor. For over 50 years, from 1915 to 1965, he appeared in over 320 films and television series, often uncredited.\n\nHis first film was a short black and white comedy, His Luckless Love. Kennedy was in all nine Torchy Blane films as Gahagan, the poetry-spouting cop whose running line was, \"What a day! What a day!\"\n\nHe is often erroneously listed in film sources as the brother of slow-burning comedian Edgar Kennedy. Though the two men were not related, they were apparently good friends, with Tom appearing in many of Edgar's domestic two-reel comedy shorts.\n\nTom Kennedy was also paired with Stooge Shemp Howard for several shorts for Columbia Pictures such as Society Mugs, as well as appearing with the Three Stooges in the films Loose Loot and Spooks!. He was also paired with El Brendel for four shorts, such as Phoney Cronies in 1942.\n\nHis television appearances included episodes of Perry Mason, Maverick, My Favorite Martian, and Gunsmoke.\n\nTom Kennedy continued making films right up until his death, his last film being the western The Bounty Killer.",
        "birthday": "1885-07-14",
        "deathday": "1965-10-06",
        "gender": 2,
        "homepage": null,
        "id": 34324,
        "imdb_id": "nm0448366",
        "known_for_department": "Acting",
        "name": "Tom Kennedy",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.1193,
        "profile_path": "/alBZz3yjAGTx6FJXwfHIgInX30W.jpg"
    }
}