{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8LHSDyRizQ4kQz5rEHPKyXPvMG3.jpg",
                "genre_ids": [
                    16,
                    10752,
                    878
                ],
                "id": 736069,
                "original_language": "en",
                "original_title": "Justice Society: World War II",
                "overview": "When the Flash finds himself dropped into the middle of World War II, he joins forces with Wonder Woman and her top-secret team known as the Justice Society of America.",
                "popularity": 2.4041,
                "poster_path": "/tOUJvmdjppmPYZOoykWmerSspMT.jpg",
                "release_date": "2021-04-27",
                "title": "Justice Society: World War II",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 583,
                "character": "Wonder Woman / Diana Prince (voice)",
                "credit_id": "5ff7d02f097c49004199fe58",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Cтaнa Катић",
            "Стана Катіч",
            "Стана Катік",
            "استانا کاتیک"
        ],
        "biography": "Stana Katić is a Canadian actress and producer. She is best known for her roles as Kate Beckett on the ABC television series Castle (2009–2016) and FBI Special Agent Emily Byrne in the Amazon Prime Video series Absentia (2017–2020).\n\nKatic was born in Hamilton, Ontario, Canada, to Serb parents Petar and Rada Katic, who emigrated from Croatia. She has four brothers and one sister. Katic began her acting career in theater, appearing in productions at the Trinity College School in Port Hope, Ontario. She later attended the University of Toronto and the DePaul University Goodman School of Drama.\n\nAfter graduating from DePaul University, Katic began her television career with guest appearances on several series, including 24, The Closer, and CSI: NY. She also had a recurring role on the HBO series Damages. In 2009, she was cast as Kate Beckett on the ABC series Castle. The series was a critical and commercial success, running for eight seasons. Katic's performance as Beckett earned her several awards, including a People's Choice Award for Favorite Dramatic TV Actress and a Shorty Award for Best Actress.\n\nIn 2017, Katic starred in the Amazon Prime Video series Absentia. The series follows FBI Special Agent Emily Byrne, who returns to work after disappearing for six years. Katic's performance as Byrne earned her a Primetime Emmy Award nomination for Outstanding Lead Actress in a Drama Series.\n\nKatic is also a producer. She co-founded the production company Katic Productions in 2013. The company has produced several short films and television pilots.",
        "birthday": "1978-04-26",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.stanakatic.com/",
        "id": 34408,
        "imdb_id": "nm1065664",
        "known_for_department": "Acting",
        "name": "Stana Katic",
        "place_of_birth": "Hamilton, Ontario, Canada",
        "popularity": 1.9171,
        "profile_path": "/4Kw0xJTzRc4VPfOVlaMr7OTfvN2.jpg"
    }
}