{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ss0Os3uWJfQAENILHZUdX8Tt1OC.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 545611,
                "original_language": "en",
                "original_title": "Everything Everywhere All at Once",
                "overview": "An aging Chinese immigrant is swept up in an insane adventure, where she alone can save what's important to her by connecting with the lives she could have led in other universes.",
                "popularity": 10.1081,
                "poster_path": "/u68AjlvlutfEIcpmbYpKcdi09ut.jpg",
                "release_date": "2022-03-24",
                "title": "Everything Everywhere All at Once",
                "video": false,
                "vote_average": 7.742,
                "vote_count": 7288,
                "character": "Security Guard",
                "credit_id": "621a6d893c4344004280dcde",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Narayana Cabral was born and raised in Southern California, where he developed a great love for film.\n\nAt a very young age, Narayana discovered his talent for the martial arts and gymnastics. He harnessed, fine-tuned and perfected these skills to put to use in the stunt fighting world. Not only skilled in parkour, freerunning, martial arts, gymnastics, and skateboarding, he also specializes in the art of flipping; well-known for his body manipulation and air awareness while flipping off or onto almost any object.\n\nNarayana is also a professional action film director, editor, and cameraman, frequently sought out to film/edit projects because of his perfect eye for angles and speed in the editing room.\n\nOne thing that sets Narayana apart from most other stuntmen is his ability to teach; breaking moves down into individual pieces and explaining to students how to achieve the best results for the desired move. It is in his nature to help people become their best, no matter what they are trying to do.\n\nHe has trained and worked with some of the best stuntmen and actors, including Scott Adkins, Michael Lehr, and Aaron Toney, and is a member of the I Am Water Stunt Team.\n\n- Mini Biography By: Katelyn Brooke",
        "birthday": null,
        "deathday": null,
        "gender": 0,
        "homepage": null,
        "id": 3444951,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Narayana Cabral",
        "place_of_birth": null,
        "popularity": 0.0214,
        "profile_path": "/d1Tiujip947QTYnDZb0SvXmZXFl.jpg"
    }
}