{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wb34q3VgzHgL8frVMywrN3wXmqx.jpg",
                "genre_ids": [
                    27,
                    35
                ],
                "id": 747,
                "original_language": "en",
                "original_title": "Shaun of the Dead",
                "overview": "Shaun lives a supremely uneventful life, which revolves around his girlfriend, his mother, and, above all, his local pub. This gentle routine is threatened when the dead return to life and make strenuous attempts to snack on ordinary Londoners.",
                "popularity": 6.5673,
                "poster_path": "/dgXPhzNJH8HFTBjXPB177yNx6RI.jpg",
                "release_date": "2004-04-09",
                "title": "Shaun of the Dead",
                "video": false,
                "vote_average": 7.537,
                "vote_count": 8874,
                "character": "Mark",
                "credit_id": "52fe4270c3a36847f801e8df",
                "order": 12
            },
            {
                "adult": false,
                "backdrop_path": "/bAtFhmRHp0f6aHqj1UGTZoPcmQo.jpg",
                "genre_ids": [
                    18,
                    35,
                    53
                ],
                "id": 930564,
                "original_language": "en",
                "original_title": "Saltburn",
                "overview": "Struggling to find his place at Oxford University, student Oliver Quick finds himself drawn into the world of the charming and aristocratic Felix Catton, who invites him to Saltburn, his eccentric family's sprawling estate, for a summer never to be forgotten.",
                "popularity": 9.8858,
                "poster_path": "/zGTfMwG112BC66mpaveVxoWPOaB.jpg",
                "release_date": "2023-11-16",
                "title": "Saltburn",
                "video": false,
                "vote_average": 6.973,
                "vote_count": 2634,
                "character": "Professor Ware",
                "credit_id": "6342264c5b4fed007fe6b5ca",
                "order": 16
            },
            {
                "adult": false,
                "backdrop_path": "/XNVdWNgiAHu8y4BsJv5ndUHXxN.jpg",
                "genre_ids": [
                    10751,
                    35,
                    12,
                    16
                ],
                "id": 929204,
                "original_language": "en",
                "original_title": "Wallace & Gromit: Vengeance Most Fowl",
                "overview": "Gromit’s concern that Wallace is becoming too dependent on his inventions proves justified, when Wallace invents a “smart” gnome that seems to develop a mind of its own. When it emerges that a vengeful figure from the past might be masterminding things, it falls to Gromit to battle sinister forces and save his master… or Wallace may never be able to invent again!",
                "popularity": 5.4665,
                "poster_path": "/jUWFSBxTOiCinPdTOh3IDUXVemZ.jpg",
                "release_date": "2024-12-18",
                "title": "Wallace & Gromit: Vengeance Most Fowl",
                "video": false,
                "vote_average": 7.515,
                "vote_count": 548,
                "character": "Norbot (voice)",
                "credit_id": "66622573ee67502c9f9dff67",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "里斯·希尔史密斯"
        ],
        "biography": "Reeson Wayne Shearsmith (born 27 August 1969) is a British actor, comedian, writer and magician. He was a member of The League of Gentlemen, with Steve Pemberton, Mark Gatiss and Jeremy Dyson. Jointly with Pemberton, he created, wrote and starred in the sitcom Psychoville and the dark comedy anthology series Inside No. 9. He had notable roles in Spaced and The World's End.\n\nShearsmith was born in Kingston upon Hull, East Riding of Yorkshire. He attended Andrew Marvell High School and then Bretton Hall College of Education, where he met Mark Gatiss and Steve Pemberton, fellow actors and comedians\n\nThe League of Gentlemen began as a stage act in 1995, transferred to Radio 4 as On the Town with The League of Gentlemen in 1997, and arrived on television on BBC Two in 1999. The last saw Shearsmith and his colleagues awarded a British Academy Television Award, a Royal Television Society Award and the prestigious Golden Rose of Montreux. Following The League of Gentlemen, Shearsmith appeared in comedy programmes including Max and Paddy's Road to Nowhere as well as playing villain Tony in the Vic Reeves and Bob Mortimer comedy Catterick. He appeared in two episodes of the award-winning pop-culture comedy Spaced as Robot Wars-obsessed TA soldier Dexter, and played neurotic Doctor Flynn in hospital sitcom TLC alongside Alexander Armstrong.\n\nIn 2014, Shearsmith and Pemberton returned to BBC2 with a new dark comedy series called Inside No. 9. Each episode of the anthology series takes place in a different 'No. 9' location. Shearsmith and Pemberton play various characters in the series and have also directed two of the episodes.[16] Also in 2014, he starred as Malcolm Webster in ITV drama series, based on a true story, The Widower.",
        "birthday": "1969-08-27",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.pbjmanagement.co.uk/artists/reece-shearsmith",
        "id": 34551,
        "imdb_id": "nm0790501",
        "known_for_department": "Acting",
        "name": "Reece Shearsmith",
        "place_of_birth": "Kingston upon Hull, East Riding of Yorkshire, England, UK",
        "popularity": 0.8051,
        "profile_path": "/4RJLh3e4Ha4K2ET8ruPcoaL2gqt.jpg"
    }
}