{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3yZva3ONs7C1kKJ6IVvrZQJCUIj.jpg",
                "genre_ids": [
                    14,
                    35,
                    10402,
                    10749
                ],
                "id": 5590,
                "original_language": "fr",
                "original_title": "Peau d'âne",
                "overview": "A fairy godmother helps a princess disguise herself so she won't have to marry her father.",
                "popularity": 1.7125,
                "poster_path": "/kSODEFNpTBCOJNHhsbwrwvH0Uvd.jpg",
                "release_date": "1970-12-20",
                "title": "Donkey Skin",
                "video": false,
                "vote_average": 7.223,
                "vote_count": 532,
                "character": "The Prime Minister",
                "credit_id": "52fe440fc3a36847f8080039",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/vzYoj0zZdVoC659HuOQRpTEjQMp.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 4024,
                "original_language": "fr",
                "original_title": "L'Année dernière à Marienbad",
                "overview": "In a strange and isolated chateau, a man becomes acquainted with a woman and insists that they have met before.",
                "popularity": 2.2882,
                "poster_path": "/tizZ7JnXRFMvoNegu2CtM2ab9E7.jpg",
                "release_date": "1961-05-25",
                "title": "Last Year at Marienbad",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 509,
                "character": "M – The Other Man with the Lean Face, The Husband",
                "credit_id": "5d74d412c6006d00114861f3",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            " Sacha Pitoeff"
        ],
        "biography": "Sacha Pitoëff (born Alexandre Pitoëff; 11 March 1920 – 21 July 1990) was a Swiss-born French actor and stage director.\n\nPitoëff was born in Geneva, Switzerland, on 11 March 1920, the son of Russian-born parents Ludmilla (née Smanova) and Georges Pitoëff. Both of his parents were born in the city of Tbilisi (in modern-day Georgia), then a part of the Russian Empire. The Pitoëffs were prominent actors in France, Georges was a founding member of the Cartel des Quatre (Group of Four), a group including Louis Jouvet, Charles Dullin, and Gaston Baty, dedicated to rejuvenating the French theatre.\n\nSacha graduated from Lycée Pasteur in Neuilly-sur-Seine, outside Paris. He studied acting and stage direction under Jouvet at the Théâtre de l'Athénée.\n\nDuring World War II, the younger Pitoëff followed his mother back to Switzerland, where he played his earliest roles. After the war he returned to Paris, becoming general manager at the Théâtre des Bouffes du Nord. He made his directorial debut with a 1950 staging of Uncle Vanya, which proved both a critical and commercial success.\n\nHe became a fixture of Parisian theatre in the 1960s, becoming the director of his own troupe. His repertoire included works by Jean Genet, Eugène Ionesco, Hugo Claus, Robert Musil, Anna Langfus and Anton Chekhov. With Romy Schneider, he staged The Seagull, Uncle Vanya and Three Sisters at Théâtre de l'Œuvre.\n\nIn 1967, he achieved his greatest success with a well-regarded production of Luigi Pirandello's Henry IV, which he directed and starred in, with Claude Jade.\n\nPitoëff played his first film role in 1952, in the omnibus film The Seven Deadly Sins. Appearing in over 50 films, he is probably best known for his performance in Alain Resnais's enigmatic Last Year at Marienbad (1960), as the unnamed man who may or may not be Delphine Seyrig's husband.\n\nHe was featured in roles of various sizes in such films as Henri-Georges Clouzot's Les Espions (1957), Peter Ustinov's Lady L (1965), René Clément's Is Paris Burning? (1966), and Jacques Demy's Donkey Skin (1970). He also appeared in several Hollywood productions, including Anatole Litvak's Anastasia (1956) and The Night of the Generals (1967), Mark Robson's The Prize (1963) and Dick Clement's To Catch a Spy (1971).\n\nToward the end of his acting career, he began appearing in horror films. His final role was as the bookseller Kazanian in Dario Argento's Inferno (1980).\n\nFor the last ten years of his life, Pitoëff was a professor at the National School of Theatre Arts and Techniques (ENSATT) in Lyon, where his students included Gérard Depardieu, Jean-Roger Milo and Niels Arestrup.\n\nPitoëff was married to French actress Luce Garcia-Ville, until her death by suicide in 1975. He had two siblings, actress Svetlana Pitoëff and writer Aniouta Pitoeff.\n\nHis height and distinctively-gaunt, lanky appearance may have been a consequence of Marfan syndrome.\n\nHaving suffered from depression in the final years of his life, he died in Paris at Pitié-Salpêtrière Hospital on 21 July 1990, at the age of 70.\n\nSource: Article \"Sacha Pitoëff\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1920-03-11",
        "deathday": "1990-07-21",
        "gender": 2,
        "homepage": null,
        "id": 34594,
        "imdb_id": "nm0685782",
        "known_for_department": "Acting",
        "name": "Sacha Pitoëff",
        "place_of_birth": "Genève, Switzerland",
        "popularity": 0.1292,
        "profile_path": "/frRFjzSz54j2DAf6PYh22pbkgbF.jpg"
    }
}