{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/euxYhuuJjChU755u2YHj0ZPjww3.jpg",
                "genre_ids": [
                    35,
                    80,
                    18
                ],
                "id": 1574,
                "original_language": "en",
                "original_title": "Chicago",
                "overview": "Murderesses Velma Kelly and Roxie Hart find themselves on death row together and fight for the fame that will keep them from the gallows in 1920s Chicago.",
                "popularity": 3.9445,
                "poster_path": "/3ED8cWCXY9zkx77Sd0N5qMbsdDP.jpg",
                "release_date": "2002-12-10",
                "title": "Chicago",
                "video": false,
                "vote_average": 7.12,
                "vote_count": 2750,
                "character": "Male Ensemble",
                "credit_id": "6229fe6c9a358d00718db548",
                "order": 106
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Curtis King Jr. is an American singer-songwriter, arranger and producer, who has recorded and performed with artists including David Bowie, Barry White, Michael Jackson, Duran Duran and many more.\n\nCurtis was born in Philadelphia, Pennsylvania, and was raised in Tallahassee, Florida. He later on relocated to NYC at its peak, in 1977 with songwriting partner and hometown friend Darryl Tookes, instantly beginning the next chapter in his burgeoning career. The two started turning the heads of legends like Luther Vandross and Todd Rundgren. They were playing a nightly residency at Manhattan club Home and gaining big-time studio experience with early mentor “Moogy\" Mark Clingman, when the pair were discovered and hired by Roberta Flack. That education allowed Curtis to work with names such as Billy Ocean, Cinderella and thousands of artists encompassing genres in between.  Currently a member of Bruce Springsteen's E-Street Band, Curtis stands out on stages among ensembles and singers. While traveling for notable performances like Live-Aid in 1985 and Hyde Park in 2012, Curtis got the call for what seemed like every session date and tour in between. He is a tenured all-star guest for the bands of David Letterman and Saturday Night Live and the voice of thousands of jingles nationwide.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.curtiskingmusic.com/",
        "id": 3460065,
        "imdb_id": "nm0454387",
        "known_for_department": "Acting",
        "name": "Curtis King Jr.",
        "place_of_birth": "Philadelphia, Pennsylvania, USA",
        "popularity": 0.0538,
        "profile_path": "/tWxOQrljbNp3TqJ1lqV0sEMtL0c.jpg"
    }
}