{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cy7ymUaMEWRoig7LWXpfzaaw2vv.jpg",
                "genre_ids": [
                    18
                ],
                "id": 147,
                "original_language": "fr",
                "original_title": "Les Quatre Cents Coups",
                "overview": "For young Parisian boy Antoine Doinel, life is one difficult situation after another. Surrounded by inconsiderate adults, including his neglectful parents, Antoine spends his days with his best friend, Rene, trying to plan for a better life. When one of their schemes goes awry, Antoine ends up in trouble with the law, leading to even more conflicts with unsympathetic authority figures.",
                "popularity": 3.1065,
                "poster_path": "/12PuU23kkDLvTd0nb8hMlE3oShB.jpg",
                "release_date": "1959-06-03",
                "title": "The 400 Blows",
                "video": false,
                "vote_average": 8.024,
                "vote_count": 2226,
                "character": "Man in Funfair (uncredited)",
                "credit_id": "5457f0d3c3a368399300015b",
                "order": 28
            },
            {
                "adult": false,
                "backdrop_path": "/oi7D7gBwTpaDqSx9jaXmkT7Yaai.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 269,
                "original_language": "fr",
                "original_title": "À bout de souffle",
                "overview": "A small-time thief steals a car and impulsively murders a motorcycle policeman. Wanted by the authorities, he attempts to persuade a girl to run away to Italy with him.",
                "popularity": 2.9267,
                "poster_path": "/9Wx0Wdn2EOqeCZU4SP6tlS3LOml.jpg",
                "release_date": "1960-03-16",
                "title": "Breathless",
                "video": false,
                "vote_average": 7.517,
                "vote_count": 1904,
                "character": "A Journalist (uncredited)",
                "credit_id": "560189c8c3a3685610002329",
                "order": 17
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/cy7ymUaMEWRoig7LWXpfzaaw2vv.jpg",
                "genre_ids": [
                    18
                ],
                "id": 147,
                "original_language": "fr",
                "original_title": "Les Quatre Cents Coups",
                "overview": "For young Parisian boy Antoine Doinel, life is one difficult situation after another. Surrounded by inconsiderate adults, including his neglectful parents, Antoine spends his days with his best friend, Rene, trying to plan for a better life. When one of their schemes goes awry, Antoine ends up in trouble with the law, leading to even more conflicts with unsympathetic authority figures.",
                "popularity": 3.1065,
                "poster_path": "/12PuU23kkDLvTd0nb8hMlE3oShB.jpg",
                "release_date": "1959-06-03",
                "title": "The 400 Blows",
                "video": false,
                "vote_average": 8.024,
                "vote_count": 2226,
                "credit_id": "5e3e42250c2710001a7be96a",
                "department": "Directing",
                "job": "Assistant Director"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "de Broca de Ferrussac",
            "Филипп де Брока"
        ],
        "biography": "Philippe de Broca (15 March 1933 – 26 November 2004) was a French movie director.\n\nHe directed 30 full-length feature films, including the highly successful That Man from Rio (L'Homme de Rio), The Man from Acapulco (Le Magnifique) and On Guard (Le Bossu). His works include historical, romantic epics such as Chouans! and King of Hearts (Le Roi de cœur), as well as comedies with a charismatic, breezy hero ready to embark upon any adventure which comes his way, so long as it means escaping everyday modern life: Practice Makes Perfect (Le Cavaleur), The Devil by the Tail (Le Diable par la queue), The African (L'Africain). He had links with the actor Jean-Paul Belmondo, with whom he made six films, as well as with Jean-Pierre Cassel, Philippe Noiret and Jean Rochefort.\n\nPhilippe de Broca was born on 15 March 1933 in Paris, France. He was the son of a cinema set designer and the grandson of a well-known painter, Philippe de Broca. He studied at the Paris Photography and Cinematography School (école Vaugirard), graduating in 1953. He carried out his military service with the service cinématographique des armées (army film service) in Germany and then in Algeria, directing or acting as head cameraman on short films. Greatly affected by the war he witnessed, he vowed to show life in its best light in his future films “because laughter is the best defence against upsets in life”. After his discharge from the military, he set off on a journey taking in the length of Africa in Berliet trucks before returning to Paris.\n\nHe began working as an intern with Henri Decoin, before finding assistant positions with Claude Chabrol: Bitter Reunion (Le Beau Serge), The Cousins (Les Cousins), Web of Passion (À Double Tour), François Truffaut: The 400 Blows (Les 400 Coups) and Pierre Schoendoerffer: Ramuntcho. In 1959, Claude Chabrol produced de Broca's first film for him, The Love Game (Les jeux de l’amour) with Jean-Pierre Cassel. De Broca went on to work with Cassel again in The Joker (Le Farceur, 1960), Five Day Lover (L’Amant de cinq jours, 1961), and Male Companion (Un Monsieur de Compagnie, 1964).\n\nDe Broca's first commercial success came with Swords of Blood (Cartouche), filmed in 1962. This film also saw two more names become associated with de Broca: the actor Jean-Paul Belmondo and the producer Alexandre Mnouchkine. International acclaim came with That Man from Rio (L'Homme de Rio) in 1964, Up to His Ears (Les tribulations d'un Chinois en Chine) in 1965, The Man from Acapulco (Le Magnifique) in 1973 and Incorrigible (L'Incorrigible) in 1975.\n\nIn 1966, he co-wrote, directed and produced King of Hearts (Le Roi de Cœur). This parody of the Great War, which some cinema-lovers consider his masterpiece, was a commercial and personal failure, to de Broca's dismay. Yet it eventually achieved genuine cult-film status during the mid 1970s when it was presented in repertory movie theaters as well as non-theatrical college and university film series across the United States, eventually running for five years at the now defunct film house, the Central Square Cinemas in Cambridge, Massachusetts. ...\n\nSource: Article \"Philippe de Broca\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1933-03-15",
        "deathday": "2004-11-26",
        "gender": 2,
        "homepage": null,
        "id": 34613,
        "imdb_id": "nm0003606",
        "known_for_department": "Directing",
        "name": "Philippe de Broca",
        "place_of_birth": "Paris, France",
        "popularity": 0.2573,
        "profile_path": "/78DpaNfRB0kSDVzWeeOxYiYHBjt.jpg"
    }
}