{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7AvbU0ei7Fz21jqBL4tlgSufnMp.jpg",
                "genre_ids": [
                    53,
                    80,
                    18
                ],
                "id": 2721,
                "original_language": "fr",
                "original_title": "Z",
                "overview": "Amid a tense political climate, the opposition leader is killed in an apparent accident. When a prosecutor smells a cover-up, witnesses get targeted. A thinly veiled dramatization of the assassination of Greek politician Grigoris Lambrakis and its aftermath, “Z” captures the outrage at the US-backed junta that ruled Greece at the time of its release.",
                "popularity": 3.3259,
                "poster_path": "/dFAJyFNgvOv24f2RQyI9KDxjGr3.jpg",
                "release_date": "1969-02-26",
                "title": "Z",
                "video": false,
                "vote_average": 7.795,
                "vote_count": 580,
                "character": "Deputy Public Prosecutor",
                "credit_id": "62c89f0ddf294500505b86c0",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Mohamed Hattab",
            "حبيب رضا"
        ],
        "biography": "Habib Reda (in Arabic: حبيب رضا), whose real name is Mohamed Hattab, born on March 28, 1919 in Miliana, is an Algerian actor and musician.\n\nHabib Reda had several strings to his bow, actor, director, on the radio, in sports and supreme privilege, by participating in the Algerian War. Sentenced to death twice during the heroic Battle of Algiers, fought against Massu's paratroopers, Habib Reda paid dearly for his commitment by being incarcerated at the Sarouy school, transformed into an interrogation center, where he was tortured for a long time. He began a career as a professional actor in 1939 in Mahieddine Bachtarzi's troupe, where he was one of the main actors, with his brother Madjid Reda who died fighting in the Aurès in 1960. Habib Reda, an affable and cultured man who played Molière and Shakespeare brilliantly, rubbed shoulders with the greats of the time such as Keltoum, Sissani, Mohamed Touri, among others.\n\n\"I started at Djamiaât Chabiba, an association of ulama who taught the Arabic language. We gave performances during religious holidays and the month of Ramadan. The theater thus became my vocation, to such an extent that at 18, with a friend who also wanted to be an actor, I almost stowed away to Egypt, fascinated as we were then by its cinema, its singers and its musicals. It was around this time that Mahieddine Bachtarzi was looking to expand his troupe with young people who could read and write Arabic because he had the obligation to stage plays in literary Arabic. \"So, professionally, I started in 1939 with the father of Algerian theater,\" he confided in an interview.\n\nA professional theater actor under the leadership of Mahieddine Bachtarzi who became his father-in-law, Habib Reda is said to be a privileged witness to the birth of Algerian theater. In cinema, he played in the first talking film shot in the Maghreb, \"Kenzi - Mon Trésor\", in Z by Costa-Gavras... According to Arlette Roth, author of Le Théâtre Algérien (Ed. Maspero, Paris, 1967), Habib Reda belongs to the 2nd generation of Algerian actors.\n\nAt the end of his artistic career, he became an industrialist and lived between Algiers, Paris and the United States. Habib Reda died on May 29, 2013 at the age of 94. He is buried in the El-Kettar cemetery in Algiers.",
        "birthday": "1919-03-28",
        "deathday": "2013-05-29",
        "gender": 2,
        "homepage": "https://www.tna.dz/%D8%AD%D8%A8%D9%8A%D8%A8-%D8%B1%D8%B6%D8%A7/",
        "id": 3463091,
        "imdb_id": "nm0714620",
        "known_for_department": "Acting",
        "name": "Habib Reda",
        "place_of_birth": "Miliana, Algeria",
        "popularity": 0.0214,
        "profile_path": "/tlr6YASXkAOSRTRVL5CoZeMj5MG.jpg"
    }
}