{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/aH5QhlVu7uMnLO9P432IcP8FyCI.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 1850,
                "original_language": "en",
                "original_title": "Man on the Moon",
                "overview": "The story of the life and career of eccentric avant-garde comedian, Andy Kaufman.",
                "popularity": 3.9574,
                "poster_path": "/msOZS07xRIFnapwp3fprGbKEAfT.jpg",
                "release_date": "1999-12-22",
                "title": "Man on the Moon",
                "video": false,
                "vote_average": 7.247,
                "vote_count": 1869,
                "character": "Jerry's Deli Patron (uncredited)",
                "credit_id": "63904722bc8abc13b928b9f1",
                "order": 190
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Shannon Frank was born and raised in the San Francisco Bay Area. She is the niece of Emmy Award-winning actor Gary Frank and producer Carroll Newman, and cousin of actress Jessica Frank. Shannon was a finalist in the 1989 and 1991 Miss San Jose Pageants and won the title of Miss Congeniality. She has modeled for numerous campaigns such as Blockbuster Video, City of San Jose, Burbank Suzuki, RGB Studios and many others. Her two sons, Jamie and Jacob, have modeled for national campaigns such as Mervyn's, Macy's, New York Times Square, City of San Jose, and Happy Hollow Park and Zoo.\n\nShannon and her sons were the cover models in the \"2008 Best of the Best\" Promotional Ad for the upscale \"iMotion Studios\" in Los Gatos, California. In addition, Kaiser Permanente has featured Shannon and her sons in their April 2008 Inside Connection, in an article depicting life with autism. Since 2007, Shannon Frank has contributed creative talent for many of Kaiser Permanente's internal instructional videos at the Santa Clara, California hospital and medical center.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 3464066,
        "imdb_id": "nm2641264",
        "known_for_department": "Acting",
        "name": "Shannon Frank",
        "place_of_birth": null,
        "popularity": 0.0261,
        "profile_path": null
    }
}