{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ctzKCslTsMRsOJNvAm1Mw8ytiHY.jpg",
                "genre_ids": [
                    28,
                    12,
                    35,
                    18,
                    37
                ],
                "id": 9359,
                "original_language": "en",
                "original_title": "Maverick",
                "overview": "Bret Maverick is a gambler who would rather con someone than fight them, and needs an additional $3k in order to enter a winner-takes-all poker game beginning in a few days. He joins forces with a woman with a marvelous Southern accent, and the two try and enter the game.",
                "popularity": 4.3911,
                "poster_path": "/mTVbGGi5PIexmxVzeyFd2RYKwfM.jpg",
                "release_date": "1994-05-20",
                "title": "Maverick",
                "video": false,
                "vote_average": 6.889,
                "vote_count": 1662,
                "character": "Spectator (uncredited)",
                "credit_id": "639fed64be6d8800bca84347",
                "order": 66
            },
            {
                "adult": false,
                "backdrop_path": "/le14c0VjhbBv475RAEQ13Wt2loo.jpg",
                "genre_ids": [
                    18,
                    80,
                    28
                ],
                "id": 10648,
                "original_language": "en",
                "original_title": "Magnum Force",
                "overview": "\"Dirty\" Harry Callahan is a San Francisco Police Inspector on the trail of a group of rogue cops who have taken justice into their own hands. When shady characters are murdered one after another in grisly fashion, only Dirty Harry can stop them.",
                "popularity": 3.783,
                "poster_path": "/1uX1uzn09seCftG3rTGLPyFXxV6.jpg",
                "release_date": "1973-12-13",
                "title": "Magnum Force",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 1119,
                "character": "Cost Plus Cop",
                "credit_id": "66f8c6170f6fa2cfce5f5858",
                "order": 30
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Marshall Lowell Hutchason",
            " Marshall Hutchason",
            "Will Hutchens"
        ],
        "biography": "Will Hutchins (born Marshall Lowell Hutchason), is an American actor most noted for playing the lead role of the young lawyer from the Oklahoma Territory, Tom Brewster, in sixty-nine episodes of the Warner Bros. Western television series Sugarfoot, which aired on ABC from 1957 to 1961.  Hutchins was discovered by a talent scout for Warner Bros., who changed his name from Marshall Lowell Hutchason to Will Hutchins. The young actor's easygoing manner was compared to Will Rogers, the Oklahoma humorist. His contract led him to guest appearances in Warner Bros. Television programs, such as Conflict. Hutchins was also cast as a guest star on Cheyenne, Bronco, Maverick and 77 Sunset Strip.\n\nHe had small roles in the Warners movies Bombers B-52, Lafayette Escadrille, and No Time for Sergeants where he screen tested for the lead of Will Stockdale with James Garner playing the psychiatrist.\n\nHutchins leapt to national fame in the lead of Sugarfoot. During the series' run he guest-starred on other Warner Bros shows such as The Roaring 20's, Bronco, and Surfside 6. Warners tried him in the lead of a feature, Young and Eager  aka Claudelle Inglish with Diane McBain. He tried another pilot for a series, Howie, that was not picked up and war in the Warners war film with Jeff Chandler, Merrill's Marauders, a picture filmed in the Philippine Islands and Chandler's last acting role. Hutchins guest-starred on Gunsmoke and The Alfred Hitchcock Hour.\n\nWhile appearing in a play in Chicago in late 1963, he was flown to Los Angeles to shoot a television pilot for MGM, Take Me to Your Leader, in which Hutchins played a Martian salesman who came to Earth. Though the pilot was not picked up, it led MGM to sign him for Spinout, in which he co-starred as Lt. Tracy Richards (\"Dick Tracy\" backwards) alongside Elvis Presley. In 1965, Hutchins co-starred with Jack Nicholson and Warren Oates in Monte Hellman's The Shooting.\n\nIn 1968–1969, Hutchins starred as Dagwood Bumstead in a CBS television version of the comic strip Blondie. He travelled to South Africa to appear in Shangani Patrol. Back in the United States, Hutchins guest-starred on Love, American Style, Emergency!, Chase, Movin' On, The Streets of San Francisco, and The Quest. He was in The Horror at 37,000 Feet, Slumber Party '57, and The Happy Hooker Goes to Washington.\n\nHe also began appearing in circuses as Patches the Clown.",
        "birthday": "1930-05-05",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 34660,
        "imdb_id": "nm0404298",
        "known_for_department": "Acting",
        "name": "Will Hutchins",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 1.2051,
        "profile_path": "/py2zVDwdgkgx8Zm4luigZ7NkkDj.jpg"
    }
}