{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xyXmtuvsoM5J3yNad0nvcetpBdY.jpg",
                "genre_ids": [
                    12,
                    14,
                    28
                ],
                "id": 49051,
                "original_language": "en",
                "original_title": "The Hobbit: An Unexpected Journey",
                "overview": "Bilbo Baggins, a hobbit enjoying his quiet life, is swept into an epic quest by Gandalf the Grey and thirteen dwarves who seek to reclaim their mountain home from Smaug, the dragon.",
                "popularity": 15.9821,
                "poster_path": "/yHA9Fc37VmpUA5UncTxxo3rTGVA.jpg",
                "release_date": "2012-12-12",
                "title": "The Hobbit: An Unexpected Journey",
                "video": false,
                "vote_average": 7.362,
                "vote_count": 18994,
                "character": "Bofur",
                "credit_id": "52fe4783c3a36847f8139fc1",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/hwPnxzIgQFfXl5zP0Yh8bViCMzf.jpg",
                "genre_ids": [
                    14,
                    12,
                    28
                ],
                "id": 57158,
                "original_language": "en",
                "original_title": "The Hobbit: The Desolation of Smaug",
                "overview": "The Dwarves, Bilbo and Gandalf have successfully escaped the Misty Mountains, and Bilbo has gained the One Ring. They all continue their journey to get their gold back from the Dragon, Smaug.",
                "popularity": 12.9588,
                "poster_path": "/xQYiXsheRCDBA39DOrmaw1aSpbk.jpg",
                "release_date": "2013-12-11",
                "title": "The Hobbit: The Desolation of Smaug",
                "video": false,
                "vote_average": 7.573,
                "vote_count": 13643,
                "character": "Bofur",
                "credit_id": "52fe4926c3a36847f818b7f1",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/xqOcH6cKhGEbzgypAHU6UlUUDrh.jpg",
                "genre_ids": [
                    12,
                    35,
                    18
                ],
                "id": 59468,
                "original_language": "en",
                "original_title": "The Way",
                "overview": "When his son dies while hiking the famed Camino de Santiago pilgrimage route in the Pyrenees, Tom flies to France to claim the remains. Looking for insights into his estranged child’s life, he decides to complete the 500-mile mountain trek to Spain. Tom soon joins up with other travelers and realizes they’re all searching for something.",
                "popularity": 3.7004,
                "poster_path": "/uaRfG7n92IiuYcKLl7LJo2gr6qO.jpg",
                "release_date": "2010-09-10",
                "title": "The Way",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 611,
                "character": "Jack",
                "credit_id": "52fe4992c3a36847f81a1203",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/zn13a7U9eMTJq8sHthe3bCgsVm4.jpg",
                "genre_ids": [
                    28,
                    12,
                    14
                ],
                "id": 122917,
                "original_language": "en",
                "original_title": "The Hobbit: The Battle of the Five Armies",
                "overview": "Following Smaug's attack on Laketown, Bilbo and the dwarves try to defend Erebor's mountain of treasure from others who claim it: the men of the ruined Laketown and the elves of Mirkwood. Meanwhile an army of Orcs led by Azog the Defiler is marching on Erebor, fueled by the rise of the dark lord Sauron. Dwarves, elves and men must unite, and the hope for Middle-Earth falls into Bilbo's hands.",
                "popularity": 20.1277,
                "poster_path": "/xT98tLqatZPQApyRmlPL12LtiWp.jpg",
                "release_date": "2014-12-10",
                "title": "The Hobbit: The Battle of the Five Armies",
                "video": false,
                "vote_average": 7.327,
                "vote_count": 14798,
                "character": "Bofur",
                "credit_id": "52fe4a87c3a368484e158bcf",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/w281eYXUFwrcPLiifaJRpE2LwlA.jpg",
                "genre_ids": [
                    18,
                    10749,
                    53
                ],
                "id": 116,
                "original_language": "en",
                "original_title": "Match Point",
                "overview": "Chris, a former tennis pro, takes a job as an instructor and befriends his wealthy young student, Tom. After being introduced to his family, Chris is soon engaged to Tom's sister, Chloe. Despite the professional and financial advantages that this relationship affords him, Chris becomes obsessed with Tom's fiancee, American actress Nola.",
                "popularity": 5.5644,
                "poster_path": "/vHjEVTD8ucuwKSFOZJeyAnTZYli.jpg",
                "release_date": "2005-10-26",
                "title": "Match Point",
                "video": false,
                "vote_average": 7.358,
                "vote_count": 4205,
                "character": "Detective Banner",
                "credit_id": "5306371a925141348528300b",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "James Nesbitt (born 15 January 1965) is a Northern Irish actor. Born in Ballymena, County Antrim, Northern Ireland, Nesbitt grew up in the nearby village of Broughshane, before moving to Coleraine, County Londonderry. He wanted to become a teacher, like his father, so began a degree in French at the University of Ulster. He dropped out after a year when he decided to become an actor, and transferred to the Central School of Speech and Drama in London. After graduating in 1987, he spent seven years performing in plays that varied from the musical Up on the Roof (1987, 1989) to the political drama Paddywack (1994). He made his feature film debut playing talent agent Fintan O'Donnell in Hear My Song (1991).\n\nNesbitt got his breakthrough television role playing Adam Williams in the romantic comedy-drama Cold Feet (1998–2003), which won him a British Comedy Award, a Television and Radio Industries Club Award, and a National Television Award. His first significant film role came when he appeared as pig farmer \"Pig\" Finn in Waking Ned (1998). With the rest of the starring cast, Nesbitt was nominated for a Screen Actors Guild Award. In Lucky Break (2001), he made his debut as a film lead playing prisoner Jimmy Hands. The next year, he played Ivan Cooper in the television film Bloody Sunday, about the 1972 shootings in Derry. A departure from his previous \"cheeky chappie\" roles, the film was a turning point in his career. He won a British Independent Film Award and was nominated for the British Academy Television Award for Best Actor.\n\nNesbitt has also starred in Murphy's Law (2001–2007) as undercover detective Tommy Murphy—a role that was created for him by writer Colin Bateman. The role twice gained Nesbitt Best Actor nominations at the Irish Film & Television Awards (IFTA). In 2007, he starred in the dual role of Tom Jackman and Mr Hyde in Steven Moffat's Jekyll, which earned him a Golden Globe Award nomination in 2008. Nesbitt has since appeared in several more dramatic roles; he starred alongside Liam Neeson in Five Minutes of Heaven (2009), and was one of three lead actors in the television miniseries Occupation (2009) and The Deep (2010). He also starred in the movies Outcast (2010) and Emilio Estevez's The Way (2011), and has been cast in Peter Jackson's The Hobbit (2012/13).\n\nNesbitt is married to former actress Sonia Forbes-Adam, with whom he has two daughters. He is a patron of numerous charities and in 2010 accepted the ceremonial position of Chancellor of the University of Ulster.",
        "birthday": "1965-01-15",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 34715,
        "imdb_id": "nm0626362",
        "known_for_department": "Acting",
        "name": "James Nesbitt",
        "place_of_birth": "Ballymena, County Antrim, Northern Ireland",
        "popularity": 1.0812,
        "profile_path": "/lQiGZcwUXbCqpF055Ia5jxdZ2Ma.jpg"
    }
}