{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bhEJZ6XH1B9ld97OWppdAnvWzl5.jpg",
                "genre_ids": [
                    10752,
                    36,
                    18
                ],
                "id": 11165,
                "original_language": "en",
                "original_title": "Tora! Tora! Tora!",
                "overview": "In the summer of 1941, the United States and Japan seem on the brink of war after constant embargos and failed diplomacy come to no end. \"Tora! Tora! Tora!\", named after the code words used by the lead Japanese pilot to indicate they had surprised the Americans, covers the days leading up to the attack on Pearl Harbor, which plunged America into the Second World War.",
                "popularity": 3.337,
                "poster_path": "/c311sN931DixuZRer0JGYCwpx9N.jpg",
                "release_date": "1970-01-26",
                "title": "Tora! Tora! Tora!",
                "video": false,
                "vote_average": 7.149,
                "vote_count": 566,
                "character": "Cmdr. William H. Buracker (uncredited)",
                "credit_id": "61e8f6f8df2945008ef9c9fd",
                "order": 80
            },
            {
                "adult": false,
                "backdrop_path": "/fONtQBk12LGjQo4q6bXDROVQmTy.jpg",
                "genre_ids": [
                    53,
                    12
                ],
                "id": 213,
                "original_language": "en",
                "original_title": "North by Northwest",
                "overview": "Advertising man Roger Thornhill is mistaken for a spy, triggering a deadly cross-country chase.",
                "popularity": 3.6101,
                "poster_path": "/kNOFPQrel9YFCVzI0DF8FnCEpCw.jpg",
                "release_date": "1959-08-06",
                "title": "North by Northwest",
                "video": false,
                "vote_average": 7.982,
                "vote_count": 4292,
                "character": "Larry Wade (uncredited)",
                "credit_id": "55e348e892514137d70011cd",
                "order": 70
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Robert Shaen Dawe",
            "Robert Shane",
            "Bob Shayne"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nRobert Shayne (October 4, 1900 – November 29, 1992), born Robert Shaen Dawe, was an American actor whose career lasted for over 60 years. He was best known for portraying Inspector Bill Henderson in the American television series Adventures of Superman.\n\nShayne became an actor after having worked as a reporter at the Illustrated Daily Tab in Miami, Florida. His initial acting experience came with repertory companies in Alabama, including the Birmingham Players.\n\nShayne's first Broadway appearance came by 1931 in The Rap. His other Broadway shows include Yellow Jack (1934), The Cat and the Canary (1935), Whiteoaks (1938), with Ethel Barrymore, and Without Love (1942), with Katharine Hepburn.\n\nShayne began his film career in 1934, appearing in two features. In 1942, he became a contract actor with Warner Bros.. He played many character roles in movies and television, including a film series of Warner Bros. featurettes called the \"Santa Fe Trail\" series such as Wagon Wheels West, and as a mad scientist in the 1953 horror film The Neanderthal Man.\n\nHe appears briefly in Alfred Hitchcock's North by Northwest, seated at a booth in a hotel bar, where his character meets Cary Grant's character, just as the latter is about to be kidnapped. He also had a small but pivotal role in the 1953 sci-fi classic Invaders From Mars as a scientist. He also enjoyed a brief rebirth in his career when he was cast as the blind newspaper vendor in The Flash television show. He was by this time actually blind and learned his lines by having his wife read them to him and then rehearse until he memorized them.\n\nShayne portrayed Police Inspector William \"Bill\" Henderson on the 1950s TV series Adventures of Superman. He appeared sporadically in the early episodes of the series, in part because he came under HUAC scrutiny and was briefly blacklisted on unproven and unspecific charges of association with Communism. As the program evolved, especially in the color episodes, he was brought into more and more of them, to the point where he was a regular on the series.",
        "birthday": "1900-10-04",
        "deathday": "1992-11-29",
        "gender": 2,
        "homepage": null,
        "id": 34726,
        "imdb_id": "nm0790171",
        "known_for_department": "Acting",
        "name": "Robert Shayne",
        "place_of_birth": "Yonkers, New York, USA",
        "popularity": 0.1417,
        "profile_path": "/k7wIXDxBHZTRcc1bcr1qcQjWz7Z.jpg"
    }
}