{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3e3dVaVrla2GH6CWKbNRjTvk3s8.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 6844,
                "original_language": "en",
                "original_title": "The Ten Commandments",
                "overview": "Escaping death, a Hebrew infant is raised in a royal household to become a prince. Upon discovery of his true heritage, Moses embarks on a personal quest to reclaim his destiny as the leader and liberator of the Hebrew people.",
                "popularity": 10.66,
                "poster_path": "/3Ei59AR64x6dMZfWobPCkZjbqTL.jpg",
                "release_date": "1956-10-05",
                "title": "The Ten Commandments",
                "video": false,
                "vote_average": 7.769,
                "vote_count": 1743,
                "character": "Jannes",
                "credit_id": "52fe4466c3a36847f8093b05",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Douglass Rupert Dumbrille",
            "Douglas Dumbrille",
            "Douglas Dunbrile"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nDouglass Rupert Dumbrille (October 13, 1889 – April 2, 1974) was a Canadian actor and one of the Canadian pioneers in early Hollywood.\n\nIn 1913, the East Coast film industry was flourishing and that year he appeared in the film What Eighty Million Women Want, but it would be another 11 years before he appeared on screen again.\n\nIn 1924, he made his Broadway debut and worked off and on in the theatre for several years while supplementing his income by selling such products as car accessories, tea, insurance, real estate, and books.\n\nDuring the Great Depression, Dumbrille moved to the West Coast of the U.S., where he specialized in playing secondary character roles alongside the great stars of the day. His physical appearance and suave voice equipped him for roles as slick politician, corrupt businessman, crooked sheriff, or unscrupulous lawyer.\n\nHe was highly regarded by the studios and was sought out by Cecil B. DeMille, Frank Capra, Hal Roach and other prominent Hollywood filmmakers. A friend of fellow Canadian-born director Allan Dwan, Dumbrille played Athos in Dwan’s 1939 adaptation of The Three Musketeers.\n\nDumbrille had roles in more than 200 motion pictures and, with the advent of television, made numerous appearances in the 1950s and 1960s. He had the ability to project a balance of menace and pomposity in roles as the \"heavy\" in comedy films, such as those of the Marx Brothers or Abbott and Costello.",
        "birthday": "1889-10-12",
        "deathday": "1974-04-02",
        "gender": 2,
        "homepage": null,
        "id": 34748,
        "imdb_id": "nm0241523",
        "known_for_department": "Acting",
        "name": "Douglass Dumbrille",
        "place_of_birth": "Hamilton, Ontario, Canada",
        "popularity": 0.1248,
        "profile_path": "/quJC1FBvSzwNuFCQhlzXINXa7ZS.jpg"
    }
}