{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/v3ClsT59peXyGJ4XuDvIQAPwcZy.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 4133,
                "original_language": "en",
                "original_title": "Blow",
                "overview": "A boy named George Jung grows up in a struggling family in the 1950's. His mother nags at her husband as he is trying to make a living for the family. It is finally revealed that George's father cannot make a living and the family goes bankrupt. George does not want the same thing to happen to him, and his friend Tuna, in the 1960's, suggests that he deal marijuana. He is a big hit in California in the 1960's, yet he goes to jail, where he finds out about the wonders of cocaine. As a result, when released, he gets rich by bringing cocaine to America. However, he soon pays the price.",
                "popularity": 7.5894,
                "poster_path": "/yYZFVfk8aeMP4GxBSU9MTvqs9mJ.jpg",
                "release_date": "2001-04-04",
                "title": "Blow",
                "video": false,
                "vote_average": 7.358,
                "vote_count": 4439,
                "character": "Cesar Toban",
                "credit_id": "56b23c66c3a36845c90003b1",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Dan Ferro was an actor, known for Blow (2001), Creepshow (1982) and Sgt. Bilko (1996).\n\nFerro's acting career began with roles in the series Falcon Crest (CBS, 1981-1990) and Murder, She Wrote (CBS, 1984-1996). He also took on a few movie roles at the time, appearing in Death Wish 4: The Crackdown (1987).\n\nIn the eighties and the nineties, he shifted his entertainment career towards more comedic roles, appearing on Almost Grown (CBS, 1988-89). He also worked in film during these years, including a part on the comedic adaptation Sgt. Bilko (1996) with Steve Martin.\n\nThen, he tackled guest roles on The Pretender (1996-2000) and Brother's Keeper (ABC, 1998-99). He also featured in the TV movie On the Line (ABC, 1997-98). Ferro also acted in the Johnny Depp crime drama film Blow (2001).",
        "birthday": "1960-10-10",
        "deathday": "2022-08-19",
        "gender": 2,
        "homepage": null,
        "id": 34841,
        "imdb_id": "nm0274971",
        "known_for_department": "Acting",
        "name": "Dan Ferro",
        "place_of_birth": "New Britain, Connecticut, USA",
        "popularity": 0.1113,
        "profile_path": null
    }
}