{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/v3ClsT59peXyGJ4XuDvIQAPwcZy.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 4133,
                "original_language": "en",
                "original_title": "Blow",
                "overview": "A boy named George Jung grows up in a struggling family in the 1950's. His mother nags at her husband as he is trying to make a living for the family. It is finally revealed that George's father cannot make a living and the family goes bankrupt. George does not want the same thing to happen to him, and his friend Tuna, in the 1960's, suggests that he deal marijuana. He is a big hit in California in the 1960's, yet he goes to jail, where he finds out about the wonders of cocaine. As a result, when released, he gets rich by bringing cocaine to America. However, he soon pays the price.",
                "popularity": 7.5894,
                "poster_path": "/yYZFVfk8aeMP4GxBSU9MTvqs9mJ.jpg",
                "release_date": "2001-04-04",
                "title": "Blow",
                "video": false,
                "vote_average": 7.358,
                "vote_count": 4439,
                "character": "Rada",
                "credit_id": "52fe43aec3a36847f8067557",
                "order": 20
            },
            {
                "adult": false,
                "backdrop_path": "/tw9FDRM2x6A85JnU88dHKWsf5o7.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 11652,
                "original_language": "en",
                "original_title": "Invincible",
                "overview": "Inspired by the true story of Vince Papale, a man with nothing to lose who ignored the staggering odds and made his dream come true. When the coach of Papale's beloved hometown football team hosted an unprecedented open tryout, the public consensus was that it was a waste of time – no one good enough to play professional football was going to be found this way.",
                "popularity": 3.7413,
                "poster_path": "/oEaUMn5POAiMLnU6hKOBKoZbDpo.jpg",
                "release_date": "2006-08-25",
                "title": "Invincible",
                "video": false,
                "vote_average": 7.021,
                "vote_count": 971,
                "character": "Sharon Papale",
                "credit_id": "59b1e2bfc3a3682c2208a9e8",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "لولا گلودینی"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nLola Glaudini (born November 24, 1971, New York City, New York) is an American actress. She attended Bard College.\n\nShe was a regular on the CBS series Criminal Minds as Elle Greenaway, but left the show early in the second season because she reportedly became unhappy living in Los Angeles and wanted to return to the East Coast.\n\nShe had a recurring role on the HBO series The Sopranos as Federal Agent Deborah Ciccerone-Waldrup. Before those roles she appeared on NYPD Blue as Dolores Mayo, a heroin-addicted office assistant. She has guest starred in The Good Guys, The King of Queens, Andy Richter Controls the Universe, Boomtown, Special Unit 2, Law and Order: Criminal Intent, Las Vegas, Two And A Half Men, Monk, and ER. Lola also appeared briefly in the Neil LaBute film, Your Friends &amp; Neighbors.\n\nIn the 2006 film Invincible, she had a brief role as the first wife of Vince Papale, played by Mark Wahlberg, where she is seen berating Papale's career failures and informs him of divorce.\n\nShe most recently played the role of Kat Damatto on the NBC mini-series Persons Unknown.",
        "birthday": "1971-11-24",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 34845,
        "imdb_id": "nm0322164",
        "known_for_department": "Acting",
        "name": "Lola Glaudini",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 1.1549,
        "profile_path": "/hBZNPbzNgyYfcUUBHUlEKAodzSU.jpg"
    }
}