{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/v23fWgJUEt8EMmvn19btIacxP8E.jpg",
                "genre_ids": [
                    10749,
                    14,
                    16
                ],
                "id": 3933,
                "original_language": "en",
                "original_title": "Corpse Bride",
                "overview": "In a 19th-century European village, a young man about to be married is whisked away to the underworld and wed to a mysterious corpse bride, while his real bride waits bereft in the land of the living.",
                "popularity": 25.6795,
                "poster_path": "/isb2Qow76GpqYmsSyfdMfsYAjts.jpg",
                "release_date": "2005-09-12",
                "title": "Corpse Bride",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 9691,
                "character": "Maggot / Town Crier (voice)",
                "credit_id": "52fe43a7c3a36847f80650f5",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/sPantp0oQ9idos7Jdwko2r6ZOIa.jpg",
                "genre_ids": [
                    18
                ],
                "id": 205587,
                "original_language": "en",
                "original_title": "The Judge",
                "overview": "A successful lawyer returns to his hometown for his mother's funeral only to discover that his estranged father, the town's judge, is suspected of murder.",
                "popularity": 8.1271,
                "poster_path": "/3K93GWotLXe4FqpErri0xkpLaD5.jpg",
                "release_date": "2014-10-08",
                "title": "The Judge",
                "video": false,
                "vote_average": 7.329,
                "vote_count": 4258,
                "character": "Mourner",
                "credit_id": "61d8b98587a27a009fd80563",
                "order": 51
            },
            {
                "adult": false,
                "backdrop_path": "/yCnJT53HMXAK87xzPAdjdYhZ3JE.jpg",
                "genre_ids": [
                    18,
                    9648,
                    878
                ],
                "id": 1124,
                "original_language": "en",
                "original_title": "The Prestige",
                "overview": "A mysterious story of two magicians whose intense rivalry leads them on a life-long battle for supremacy -- full of obsession, deceit and jealousy with dangerous and deadly consequences.",
                "popularity": 11.832,
                "poster_path": "/2ZOzyhoW08neG27DVySMCcq2emd.jpg",
                "release_date": "2006-10-17",
                "title": "The Prestige",
                "video": false,
                "vote_average": 8.204,
                "vote_count": 16794,
                "character": "Workman 1",
                "credit_id": "56d9c8d19251416ff2007436",
                "order": 41
            },
            {
                "adult": false,
                "backdrop_path": "/6mqgl2szMLRYj4lhlXOjju5Tpeo.jpg",
                "genre_ids": [
                    12,
                    16,
                    9648
                ],
                "id": 17578,
                "original_language": "en",
                "original_title": "The Adventures of Tintin",
                "overview": "Intrepid young reporter, Tintin, and his loyal dog, Snowy, are thrust into a world of high adventure when they discover a ship carrying an explosive secret. As Tintin is drawn into a centuries-old mystery, Ivan Ivanovitch Sakharine suspects him of stealing a priceless treasure. Tintin and Snowy, with the help of salty, cantankerous Captain Haddock and bumbling detectives, Thompson and Thomson, travel half the world, one step ahead of their enemies, as Tintin endeavors to find the Unicorn, a sunken ship that may hold a vast fortune, but also an ancient curse.",
                "popularity": 5.351,
                "poster_path": "/fQZ3sLR1Fi63NMsNRbjm9q5qODJ.jpg",
                "release_date": "2011-10-24",
                "title": "The Adventures of Tintin",
                "video": false,
                "vote_average": 6.912,
                "vote_count": 5581,
                "character": "Nestor / Mr. Crabtree (voice)",
                "credit_id": "5b0327e8c3a3686c7a01cd22",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Enn Reitel (born 21 June 1950) is a Scottish actor who specialises in voice work in video games, movies and TV shows.\n\nReitel's family arrived in Scotland as refugees from Estonia and Germany. He trained as an actor at the Central School of Speech and Drama. In 1982 Reitel starred in The Further Adventures of Lucky Jim, a sitcom on BBC Two written by Dick Clement and Ian La Frenais. Reitel played Jim Dixon, based on the character created by Kingsley Amis.\n\nHe appeared on stage in Me and My Girl at the Adelphi Theatre in 1986. On television he worked as an impressionist on the satirical puppet show Spitting Image and starred in the ITV sitcom Mog as a burglar who spent his days in a psychiatric hospital, pretending to be insane.\n\nHe played the lead role in the UK TV comedy series The Optimist which ran from 1983 for two series. The programme was almost entirely silent. In each episode 'The Optimist' wandered through life doing his best to look on the bright side. He was usually thwarted in his endeavours by the people he encountered. He also appeared in the first series of the UK comedy show Whose Line Is It Anyway?.\n\nIn 2001 he appeared in a short film called Coconuts with Michael Palin, in which they did a demonstration on how coconuts can be used in place of horses. This film can be seen on the second disk of the collector's edition of Monty Python and the Holy Grail.",
        "birthday": "1950-06-21",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 34904,
        "imdb_id": "nm0718572",
        "known_for_department": "Acting",
        "name": "Enn Reitel",
        "place_of_birth": "Forfar, England, UK",
        "popularity": 0.1837,
        "profile_path": "/eTLCNbqkj5ZlIGgXenVPMZ3qRYQ.jpg"
    }
}