{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6zvLHD4rbHUNuRQLoIC2rkV8ayi.jpg",
                "genre_ids": [
                    16,
                    10751,
                    12,
                    10402
                ],
                "id": 126319,
                "original_language": "fr",
                "original_title": "Ernest et Célestine",
                "overview": "Celestine is a little mouse trying to avoid a dental career while Ernest is a big bear craving an artistic outlet. When Celestine meets Ernest, they overcome their natural enmity by forging a life of crime together.",
                "popularity": 2.1859,
                "poster_path": "/iJPbRASktYW0I009Ktc2zUE6Fvg.jpg",
                "release_date": "2012-12-12",
                "title": "Ernest & Celestine",
                "video": false,
                "vote_average": 7.762,
                "vote_count": 644,
                "character": "Head Nurse Mouse (voice)",
                "credit_id": "5aa44615c3a3687c0c01423c",
                "order": 35
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Перретт Прадье",
            "Perrette Marie Mathilde Chevau"
        ],
        "biography": "Perrette Pradier (born Perrette Marie Mathilde Chevau; 17 April 1938 – 16 January 2013) was a French actress and dubbing director. She is best known for her work as a voice actress which earned her the nickname of \"Queen\" or \"High Priestess\" of dubbing.\n\nPradier was born in Hanoi, French Indochina. Two years after making her film début, in 1961, she was awarded the Prix Suzanne Bianchetti as most promising new actress in France for her performance as \"Amenita\" in the Sacha Guitry film, \"Stop Thief.\" That year she gained further recognition for her role as \"Constance Bonacieux\" in two films based on the Three Musketeers. Throughout the 1960s, she appeared in a number of films in her native France, then was contracted for Hollywood productions that included the Fred Zinnemann film Behold a Pale Horse (1964) starring luminaries Gregory Peck, Anthony Quinn, and Omar Sharif. She returned to English-language filming in the Universal Studios thriller, House of Cards (1968) with Orson Welles and George Peppard.\n\nIn her long career, Perrette Pradier has also worked in live theatre, appearing in plays such as La Bonne Addresse as well as the longest running French play ever produced, Boeing Boeing. In 1994, she was the voice of \"Sarafina\" in the French version of the Walt Disney Studios animated feature film, The Lion King.\n\nPradier died of a heart attack on 16 January 2013, aged 74, in Rueil-Malmaison, France, a month after being operated for an aneurysm.\n\nSource: Article \"Perrette Pradier\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1938-04-17",
        "deathday": "2013-01-16",
        "gender": 1,
        "homepage": null,
        "id": 35043,
        "imdb_id": "nm0694989",
        "known_for_department": "Acting",
        "name": "Perrette Pradier",
        "place_of_birth": "Hanoi, Vietnam",
        "popularity": 0.1354,
        "profile_path": "/yUXGyURHWxdPkZDvkbTJmQS757T.jpg"
    }
}