{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sGDXh6QU6CRqHVXfoYOBwqEnBVO.jpg",
                "genre_ids": [
                    28,
                    36,
                    10752
                ],
                "id": 10590,
                "original_language": "en",
                "original_title": "We Were Soldiers",
                "overview": "The story of the first major battle of the American phase of the Vietnam War and the soldiers on both sides that fought it.",
                "popularity": 3.0746,
                "poster_path": "/d5uupBAORxnFNbkNQ2G0Bi2cpY8.jpg",
                "release_date": "2002-03-01",
                "title": "We Were Soldiers",
                "video": false,
                "vote_average": 7.142,
                "vote_count": 2147,
                "character": "Lt. Col. Nguyen Huu An",
                "credit_id": "52fe438e9251416c75014ff7",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Bùi Đơn Dương",
            "Don Duong",
            "Duong Don"
        ],
        "biography": "Don Duong (August 27, 1957 – December 8, 2011) was a Vietnamese actor.  Initially employed at a local pharmaceutical firm, he then studied acting under the guidance of veteran actor Nguyễn Chánh Tín and started taking on supporting roles in small budget films, gradually establishing himself through frequent collaborations with arthouse directors. In 1990s, he was among the most critically acclaimed actors of contemporary Vietnamese cinema, having received a Best Actor award at 1992 Vietnam Film Festival and starred in many cult-classics beloved by the public. Additionally, he also began to receive offers from Hollywood directors around this time thanks to a role in the award-winning \"Three Seasons\"(1999) by Tony Bui.\n\nIn 2002, Don Duong came under fire for his role as Viet Minh general Nguyễn Hữu An in Mel Gibson's \"We are Soldiers\": the film was critically panned by the local public and authorities alike, who denounced it as \"historical denialism\" and Don Duong's portrayal as \"tarnishing the image of the Vietnamese Army\". Unable to deal with the increasing hostilities, the actor had to emigrate to America, and lived there until his death in 2011.",
        "birthday": "1957-08-27",
        "deathday": "2011-12-08",
        "gender": 2,
        "homepage": null,
        "id": 35053,
        "imdb_id": "nm0243121",
        "known_for_department": "Acting",
        "name": "Đơn Dương",
        "place_of_birth": "Dalat, Vietnam",
        "popularity": 1.7768,
        "profile_path": "/8J7ekjASe85or26TyFRyUS5Bwad.jpg"
    }
}