{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lBcXozUeABairkTavz3X3ZAtOL0.jpg",
                "genre_ids": [
                    10749,
                    80,
                    18
                ],
                "id": 959604,
                "original_language": "fr",
                "original_title": "L'Amour ouf",
                "overview": "Local rebellious teenager Clotaire falls for his schoolmate Jackie, but gang violence leads him to a darker destructive path. After years apart, the star-crossed lovers discover that every path they've taken leads them back together.",
                "popularity": 5.5263,
                "poster_path": "/yu9dRyKcUHTfKcqsomUtpord4t3.jpg",
                "release_date": "2024-10-16",
                "title": "Beating Hearts",
                "video": false,
                "vote_average": 7.221,
                "vote_count": 883,
                "character": "Jackie (15 ans)",
                "credit_id": "646abe942bcf6700fe610e35",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Mallory Wanecque (born 26 July 2006) is a French actress. She is known for her starring role in her debut feature film, The Worst Ones (2022), for which she won the Rising Star Award for Best International Young Actor at the 2022 Rome Film Festival, and was nominated for the 2023 César Awards for Most Promising Actress.\n\nWanecque was born on 26 July 2006 in Valenciennes, Hauts-de-France. She attended the Jules Ferry School in Anzin. One day as she was leaving the school holding her little sister in her arms, she came across three women who were distributing flyers for a casting and caught the eye of the casting director of the film The Worst Ones, who left her number with Wanecque. She passed the audition and then quit high school to devote herself to a film career.\n\nIn 2022, Wanecque made her film debut with a starring role in the drama The Worst Ones, directed by Lise Akoka and Romane Gueret, for which she won the Rising Star Award for Best International Young Actor at the 2022 Rome Film Festival, and was nominated for the César Award for Most Promising Actress in 2023. She next starred as a teenage boxer in Ali Marhyar's comedy Like a Prince (2023).\n\nIn 2024, Wanecque will star in Teddy Lussi-Modeste's drama The Good Teacher, and in Gilles Lellouche's romantic comedy musical Beating Hearts.\n\nSource: Article \"Mallory Wanecque\" from Wikipedia in English, licensed under CC-BY-SA.",
        "birthday": "2006-07-26",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 3508929,
        "imdb_id": "nm13580111",
        "known_for_department": "Acting",
        "name": "Mallory Wanecque",
        "place_of_birth": "Valenciennes, Hauts-de-France, France",
        "popularity": 0.6746,
        "profile_path": "/mBgZ6YElr912iCMXs7w5UDR5m90.jpg"
    }
}