{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/aH5QhlVu7uMnLO9P432IcP8FyCI.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 1850,
                "original_language": "en",
                "original_title": "Man on the Moon",
                "overview": "The story of the life and career of eccentric avant-garde comedian, Andy Kaufman.",
                "popularity": 3.9574,
                "poster_path": "/msOZS07xRIFnapwp3fprGbKEAfT.jpg",
                "release_date": "1999-12-22",
                "title": "Man on the Moon",
                "video": false,
                "vote_average": 7.247,
                "vote_count": 1869,
                "character": "Reporter (uncredited)",
                "credit_id": "6390439510561100b5a7b939",
                "order": 168
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Job Alonso has been editing, directing, and producing film, TV, and music videos professionally for over 20 years. He is well versed in all sorts of film and video formats and post-production platforms such as Adobe Premiere, After Effects, Final Cut Pro, Avid, and others. He is also experienced in operating a drone, color grading, sound editing, and effects work such as green screen removal, motion tracking, and title overlays. He has years of experience in various production capacities including writer, journalist, camera operator, production assistant, assistant director, cinematographer, sound editor/score composer, actor, director, editor, and producer.\n\nHis early training came from industry professionals he worked with as an assistant during the late '80s to the early '90s. In the mid-'90s he left the US to do volunteer film/video work in South America with his father, Alejandro Alonso, assisting him in his non-profit music/ministry in video-recording live events, concerts, and produced music videos and promos. In the year 2000, he began working on big-budget Hollywood productions as well as smaller independent films in multiple capacities. He has since matured into a well-seasoned actor, writer, director, editor, videographer, and producer of all sorts of music videos, short films, and multi-media content.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 3510777,
        "imdb_id": "nm0022197",
        "known_for_department": "Acting",
        "name": "Job Alonso",
        "place_of_birth": null,
        "popularity": 0.0617,
        "profile_path": null
    }
}