{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/pxL08w7Eq0vKrQ3mJzYp0VHGaKG.jpg",
                "genre_ids": [
                    28,
                    53,
                    878
                ],
                "id": 49530,
                "original_language": "en",
                "original_title": "In Time",
                "overview": "In the not-too-distant future, the aging gene has been switched off. To avoid overpopulation, time has become the currency and the way people pay for luxuries and necessities. The rich can live forever, while the rest struggle to negotiate for their immortality. A poor young man who suddenly comes into a fortune of time finds himself on the run from a corrupt police force known as the \"time keepers\".",
                "popularity": 9.8493,
                "poster_path": "/3Mwj2sIONQckOZP3YwsUXF7U5I4.jpg",
                "release_date": "2011-10-27",
                "title": "In Time",
                "video": false,
                "vote_average": 6.971,
                "vote_count": 11771,
                "character": "Carrera",
                "credit_id": "5c3497850e0a2654b5d87b66",
                "order": 45
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Rachel Roberts (born April 8, 1978) is a Canadian model and actress who has appeared on numerous magazine covers and in ad campaigns, most notably for Biotherm Skin Care Products, and she became well known in the United States as the title character in the film Simone.\n\nShes began her career at age sixteen in her hometown of Vancouver, British Columbia, Canada. The stunning model-turned-actress did layouts for Elle UK and Canada magazine, and was on the cover of the July 10, 2000 Elle France magazine; Glamour (US) for the February 2002 issue (Love Is In The Hair, Photography by Patric Shaw); Marie Claire; Sports Illustrated Swimsuit 2000; Nylon; The New York Times; as well as for the British, German, Spanish, French and Italian issues of Vogue magazine. Rachel has done print work for Bottega Venetta; Victoria's Secret; Mac & Jac; and Banana Republic. She was also featured in the 1998 Pirelli Calender and was a Biotherm poster girl for skin care products.\n\nShe has been married to director Andrew Niccol since 2002 and they have 2 children.",
        "birthday": "1978-04-08",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 35198,
        "imdb_id": "nm1212051",
        "known_for_department": "Acting",
        "name": "Rachel Roberts",
        "place_of_birth": "Vancouver, British Columbia, Canada",
        "popularity": 0.2743,
        "profile_path": "/hESAMcshJW552D4DF41GTQ6xhUZ.jpg"
    }
}