{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/a9quMrUTdE1uCfQ6fLYS0RjJrGe.jpg",
                "genre_ids": [
                    12
                ],
                "id": 204668,
                "original_language": "fr",
                "original_title": "Belle et Sébastien",
                "overview": "Belle and Sebastian is set high in the snowy Alps during the Second World War. The resourceful Sebastian is a lonely boy who tames and befriends a giant, wild mountain dog, Belle – even though the villagers believe her to be ‘the beast’ that has been killing their sheep.",
                "popularity": 4.1165,
                "poster_path": "/km3ogCGHmlL7M4msTU6pWcJFpRu.jpg",
                "release_date": "2013-12-18",
                "title": "Belle and Sebastian",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 665,
                "character": "André",
                "credit_id": "5e99b60c0582240015b050f2",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Mehdi",
            "Mehdi El Mezouari El Glaoui"
        ],
        "biography": "Mehdi El Mezouari El Glaoui (born 26 May 1956), also known as Mehdi El Glaoui, is a French former actor, director and screenwriter. He is the son of actress Cécile Aubry and Si Brahim El Glaoui, caïd (local administrator) of Telouet and grandson of Thami El Glaoui, pasha of Marrakech.\n\nHe made his acting début at the age of 5 in the TV series Poly, produced by his mother, and went on to reprise his rôle in numerous sequels covering nine seasons until he reached 14. Another series, Belle et Sébastien, was dubbed into English and became school holiday viewing in the UK. Later he continued his career as an actor and also dabbled in directing.\n\nHe appeared again on screen in 2005 and 2006 for the first time in nearly a decade, on the France 3 programmes 12-14 and Pour le plaisir respectively, revealing that he now lives in near Dax, Landes, collects classic cars and runs a musical café.\n\nSource: Article \"Mehdi El Glaoui\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1956-05-26",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 35217,
        "imdb_id": "nm0252653",
        "known_for_department": "Acting",
        "name": "Mehdi El Glaoui",
        "place_of_birth": "Choisy-le-Roi, Val-de-Marne, France",
        "popularity": 0.1343,
        "profile_path": "/bHG4xvf7WpHn4MIuSZvSsb6oBHx.jpg"
    }
}