{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6w5vhyn1ostgMva0wR63WQezi7P.jpg",
                "genre_ids": [
                    80,
                    53,
                    27
                ],
                "id": 573,
                "original_language": "en",
                "original_title": "Frenzy",
                "overview": "London is terrorized by a vicious sex killer known as The Necktie Murderer. Following the brutal slaying of his ex-wife, down-on-his-luck Richard Blaney is suspected by the police of being the killer. He goes on the run, determined to prove his innocence.",
                "popularity": 3.9007,
                "poster_path": "/zDUR4PY5kyp2hpvbTvWSGiXVmgg.jpg",
                "release_date": "1972-05-25",
                "title": "Frenzy",
                "video": false,
                "vote_average": 7.104,
                "vote_count": 943,
                "character": "Mrs. Oxford",
                "credit_id": "52fe4254c3a36847f8015c19",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ada Brand Thomson"
        ],
        "biography": "​From Wikipedia, the free encyclopedia.  \n\nVivien Merchant (born Ada Thompson 22 July 1929 – 3 October 1982) was a British actress. She performed in many stage productions and several films, including Alfie (1966) and Frenzy (1972). Her performance in Alfie earned her Academy Award and Golden Globe nominations for Best Supporting Actress, and the National Board of Review Award for Best Supporting Actress.\n\nShe was the first wife of the playwright Harold Pinter, whom she met when working as a repertory actress and married in 1956. Their son, Daniel, was born in 1958. Having performed the role of Rose in a production of his first play, The Room (1957) at the Hampstead Theatre in 1960, she also appeared in many of Pinter's subsequent works, including as Ruth in The Homecoming (1964) on stage (1965) and screen (The Homecoming, 1973). The last of his plays in which she performed was Old Times (1971) as Anna.\n\nTheir marriage began disintegrating in the mid-1960s. From 1962 to 1969, Harold Pinter had a clandestine affair with Joan Bakewell, which informs Pinter's play Betrayal and his film adaptation, also called Betrayal.\n\nIn 1975 Pinter began a serious affair with the historian Lady Antonia Fraser, the wife of Sir Hugh Fraser, which he confessed to his wife that March. At first, Merchant took it very well, saying positive things about Fraser, according to her friend artist Guy Vaesen (as cited by Billington); but, Vaesen recalled, after \"a female friend of Vivien's trotted round to her house and poisoned her mind against Antonia ... Life in Hanover Terrace [where the Pinters then lived] gradually became impossible\". Pinter left, and Vivien Merchant filed for divorce and gave interviews to the tabloid press, expressing her distress.The Frasers' divorce became final in 1977 and the Pinters' in 1980. In 1980 Pinter married Antonia Fraser.\n\nVivien Merchant never overcame her grief and bitterness at losing Pinter, dying at the age of 53 on 3 October 1982, from acute alcoholism\n\nDescription above from the Wikipedia article Vivien Merchant ,  licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1929-07-22",
        "deathday": "1982-10-03",
        "gender": 1,
        "homepage": null,
        "id": 35314,
        "imdb_id": "nm0580357",
        "known_for_department": "Acting",
        "name": "Vivien Merchant",
        "place_of_birth": " Manchester, Lancashire, England, UK",
        "popularity": 0.0898,
        "profile_path": "/gscPfiS1v5V96sIyvHMuKDcVmLn.jpg"
    }
}