{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fxXwBvym6DkqkO4AWn8OjwMfMc1.jpg",
                "genre_ids": [
                    35
                ],
                "id": 9421,
                "original_language": "fr",
                "original_title": "Le Dîner de cons",
                "overview": "For Pierre Brochant and his friends, Wednesday is “Idiots' Day”. The idea is simple: each person has to bring along an idiot. The one who brings the most spectacular idiot wins the prize. Tonight, Brochant is ecstatic. He has found a gem. The ultimate idiot, “A world champion idiot!”. What Brochant doesn’t know is that Pignon is a real jinx, a past master in the art of bringing on catastrophes...",
                "popularity": 3.7021,
                "poster_path": "/cv6neov6SMLjHytjiU0rgeugoPI.jpg",
                "release_date": "1998-04-15",
                "title": "The Dinner Game",
                "video": false,
                "vote_average": 7.766,
                "vote_count": 1987,
                "character": "François Pignon",
                "credit_id": "52fe44f5c3a36847f80b431d",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jacky Boufroura"
        ],
        "biography": "Jacques Villeret (6 February 1951 – 28 January 2005) was a French actor, best known internationally for his role as François Pignon in the comedy Le Dîner de Cons. During his career, he earned many awards including the prestigious medal and title of Chevalier de la Légion d'Honneur.\n\nVilleret was born Jacky Boufroura in Loches, Indre-et-Loire, France, to an Algerian father and a French mother. He studied at the Conservatoire de Paris (CNSAD) in the same class as Louis Seigner, the grandfather of Emmanuelle Seigner and Mathilde Seigner. While he was most famous for his role as François Pignon in Le Dîner de Cons; both on the stage and in the film, his other celebrated roles included the extra terrestrial in La soupe aux choux, the autistic Mo in L'été en pente douce, and marshal Ludwig von Apfelstrudel in Papy fait de la résistance.\n\nAt the time of making the film Un aller simple directed by Laurent Heynemann – a film about integration and racism and the clash of generations – he said that watching the young actors in the film, Barbara Schulz and Lorant Deutsch, reminded him of the insouciance he had had as a young man with his friends at the Conservatoire.\n\nWhen his career was at its height, with the success of Le Dîner de Cons, everything collapsed in a tragedy mirroring the plot of the film. Villeret separated from his wife and suffered an enormous financial downfall due to tax issues, plunging him into depression. Villeret turned to alcohol for comfort, and became an alcoholic. He isolated himself and hid away for long periods. He later said: Alcohol is a friend, but a friend who means you harm.\n\nVilleret's love of his profession helped to bring his career back from the brink. In an interview in 2001 he spoke of his admiration for performers like Johnny Hallyday and Jacques Brel for their level of commitment, and quoted the author Louis-Ferdinand Céline: When I write, I put my balls on the table.\n\nIn 1979 Villeret married Irina Tarassov, an actress and writer. They separated in 1998. Tassarov wrote about their life together in her book Un jour, tout ira bien. (One day, everything will go well).\n\nIn 2002 Villeret met Seny, a Senegalese-French widow descended through her grandfather, Mor Diarra N'Dao, from a long line of Sérès nobles of the ancient Kingdom of Saloum, and they fell instantly and deeply in love. They were partners for three years, and she was about to move to Paris to be with him when he died in Évreux in January 2005 of a liver haemorrhage. Seny wrote a memoir of their life together, Jacques Villeret, mon bébé blanc, which was published in Paris by Le Cherche Midi in 2005.\n\nSource: Article \"Jacques Villeret\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1951-02-06",
        "deathday": "2005-01-28",
        "gender": 2,
        "homepage": null,
        "id": 35323,
        "imdb_id": "nm0898317",
        "known_for_department": "Acting",
        "name": "Jacques Villeret",
        "place_of_birth": "Tours, Indre-et-Loire, France",
        "popularity": 0.2512,
        "profile_path": "/w4sONhPYO3c361BPxDToT4pJFpY.jpg"
    }
}