{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zyWbOvKCdA9V9P5xuUG2eiPYsUo.jpg",
                "genre_ids": [
                    12,
                    14,
                    10751
                ],
                "id": 10601,
                "original_language": "en",
                "original_title": "Peter Pan",
                "overview": "In stifling Edwardian London, Wendy Darling mesmerizes her brothers every night with bedtime tales of swordplay, swashbuckling and the fearsome Captain Hook. But the children become the heroes of an even greater story, when Peter Pan flies into their nursery one night and leads them over moonlit rooftops through a galaxy of stars and to the lush jungles of Neverland.",
                "popularity": 4.8015,
                "poster_path": "/6QdU3TZZrIvXFzoHOwafZAynFjB.jpg",
                "release_date": "2003-12-18",
                "title": "Peter Pan",
                "video": false,
                "vote_average": 7.15,
                "vote_count": 2699,
                "character": "Nibs",
                "credit_id": "5a4fc51f0e0a262d960022f1",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "​From Wikipedia, the free encyclopedia.  \n\nHarry Eden (born 1 March 1990) is an English actor who won a British Independent Film Award in 2003 for Most Promising Newcomer for his role in Pure.\n\nEden was born in Old Harlow, Essex. He attended the Sylvia Young Theatre School. He played Nibs in the 2003 movie Peter Pan, and the Artful Dodger in Roman Polanski's Oliver Twist. He was inspired by Lionel Bart's Oliver! and the role of the Artful Dodger. He said that he prefers acting in a challenging role and that he would not like to be Harry Potter, even though he loves the films.\n\nAs well as acting, Eden is also a keen golfer with a handicap of just 1. In a BBC Radio 5 interview he expressed an interest in playing golf professionally. He partnered Oliver Fisher at the 2008 Dunhill Links Championship, the European Tour's annual celebrity pro-am.\n\nDescription above from the Wikipedia article Harry Eden, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1990-03-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 3544,
        "imdb_id": "nm1002662",
        "known_for_department": "Acting",
        "name": "Harry Eden",
        "place_of_birth": " Essex, England, UK",
        "popularity": 0.2835,
        "profile_path": "/2NDhF2nVLQrv8zyvDksLkuU0bBu.jpg"
    }
}