{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3CcO4QdasRCitq2dczOpx7CXgLM.jpg",
                "genre_ids": [
                    10751,
                    12,
                    18
                ],
                "id": 12837,
                "original_language": "en",
                "original_title": "The Secret Life of Bees",
                "overview": "Set in South Carolina in 1964, this is the tale of Lily Owens a 14 year-old girl who is haunted by the memory of her late mother. To escape her lonely life and troubled relationship with her father, Lily flees with Rosaleen, her caregiver and only friend, to a South Carolina town that holds the secret to her mother's past.",
                "popularity": 4.0251,
                "poster_path": "/m1LGEeoYfc6crbfG8WmTKg9SVqL.jpg",
                "release_date": "2008-09-17",
                "title": "The Secret Life of Bees",
                "video": false,
                "vote_average": 7.478,
                "vote_count": 549,
                "character": "Deborah Owens",
                "credit_id": "52fe45299251416c7504dc93",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Hilarie Burton Morgan",
            "Hilarie Ros Burton",
            "هیلاری بورتون"
        ],
        "biography": "Hilarie Ros Burton (born July 1, 1982) is an American actress, businesswoman, author and producer.  A former host of MTV's Total Request Live, she is best known for her portrayal of Peyton Sawyer on One Tree Hill. Hilarie was born and raised in Sterling Park, Virginia. She is the oldest of four children and describes her family as tight-knit.  Burton won a recurring arc in the USA Network crime drama series White Collar in 2010 as Sara Ellis, an insurance investigator. She also appeared as the DEA agent love interest of main character Martin Riggs on Lethal Weapon from the first season in 2016 through the third episode of the second season in 2017. Burton guest-starred in the tenth season of The Walking Dead as Negan's wife Lucille, appearing alongside her real-life husband Jeffrey Dean Morgan who plays Negan.",
        "birthday": "1982-07-01",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 35472,
        "imdb_id": "nm1122026",
        "known_for_department": "Acting",
        "name": "Hilarie Burton",
        "place_of_birth": "Sterling, Virginia, USA",
        "popularity": 1.3927,
        "profile_path": "/9tTERtp2F8uoeRGLDLpbhLuIYE9.jpg"
    }
}