{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sPGgJ0w1oCVPBOW41dN0hpMouhI.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 10312,
                "original_language": "en",
                "original_title": "Patch Adams",
                "overview": "The true story of Dr. Hunter \"Patch\" Adams, who in the 1970s found that humor is the best medicine, and was willing to do just anything to make his patients laugh—even if it meant risking his own career.",
                "popularity": 4.9241,
                "poster_path": "/xN1aKur5ddWQSXTqvzDPJD2TCxe.jpg",
                "release_date": "1998-12-25",
                "title": "Patch Adams",
                "video": false,
                "vote_average": 7.317,
                "vote_count": 3312,
                "character": "Dr. Prack",
                "credit_id": "52fe43579251416c7500ca4d",
                "order": 16
            },
            {
                "adult": false,
                "backdrop_path": "/neeNHeXjMF5fXoCJRsOmkNGC7q.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 872585,
                "original_language": "en",
                "original_title": "Oppenheimer",
                "overview": "The story of J. Robert Oppenheimer's role in the development of the atomic bomb during World War II.",
                "popularity": 18.113,
                "poster_path": "/8Gxv8gSFCU0XGDykEGv7zR1n2ua.jpg",
                "release_date": "2023-07-19",
                "title": "Oppenheimer",
                "video": false,
                "vote_average": 8.05,
                "vote_count": 10701,
                "character": "Senator McGee",
                "credit_id": "64bb356285c0a200c8973d97",
                "order": 25
            },
            {
                "adult": false,
                "backdrop_path": "/cDDyZ2qtBzNAepdTbgxKfFcxREl.jpg",
                "genre_ids": [
                    80,
                    18,
                    53
                ],
                "id": 4147,
                "original_language": "en",
                "original_title": "Road to Perdition",
                "overview": "Mike Sullivan works as a hit man for crime boss John Rooney. Sullivan views Rooney as a father figure, however after his son is witness to a killing, Mike Sullivan finds himself on the run in attempt to save the life of his son and at the same time looking for revenge on those who wronged him.",
                "popularity": 6.5311,
                "poster_path": "/loSpBeirRfTPJ3cMIqpQArstGhh.jpg",
                "release_date": "2002-07-12",
                "title": "Road to Perdition",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 3796,
                "character": "Mr. McDougal",
                "credit_id": "59b123b3c3a3682d87030217",
                "order": 29
            },
            {
                "adult": false,
                "backdrop_path": "/9PGxCEZCnxgPALlpu7avGMYhVRR.jpg",
                "genre_ids": [
                    18,
                    36,
                    9648
                ],
                "id": 11831,
                "original_language": "en",
                "original_title": "Amistad",
                "overview": "In 1839, the slave ship Amistad set sail from Cuba to America. During the long trip, Cinque leads the slaves in an unprecedented uprising. They are then held prisoner in Connecticut, and their release becomes the subject of heated debate. Freed slave Theodore Joadson wants Cinque and the others exonerated and recruits property lawyer Roger Baldwin to help his case. Eventually, John Quincy Adams also becomes an ally.",
                "popularity": 0.9528,
                "poster_path": "/6QqNyIHKow0jngiQgTNBOBrLILM.jpg",
                "release_date": "1997-12-10",
                "title": "Amistad",
                "video": false,
                "vote_average": 7.019,
                "vote_count": 1340,
                "character": "Tecora Captain",
                "credit_id": "5cc578fa0e0a26168dec8231",
                "order": 66
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Harry Groener is a German-born American actor and dancer born on September 10, 1951, in Augsburg, Bavaria, Germany, to a musical family with an opera singer mother and concert pianist father. He emigrated to the United States with his family when he was two years old and later apprenticed with the San Francisco Ballet before studying drama at the University of Washington. Groener began his career in theater, making his Broadway debut in the 1979 production of \"Oklahoma!\" and going on to appear in shows including \"Cats,\" \"Crazy for You,\" and \"Copenhagen,\" earning several Tony nominations for musicals like \"Oklahoma!\" and \"Cats.\" He transitioned successfully to television and film, becoming perhaps best known for playing Mayor Wilkins in Buffy the Vampire Slayer (seasons 3, 4 and 7), while also appearing in Dear John as Ralph Drang, How I Met Your Mother as Clint, and Mad About You as Lance Brockwell. His extensive television work includes multiple Star Trek series appearances, playing Tam Elbrun in The Next Generation's \"Tin Man\" episode, the Nechani Magistrate in Voyager's \"Sacred Ground\" episode, and Minister Nathan Samuels in Enterprise's \"Demons\" and \"Terra Prime\" episodes, and his film credits include A Cure for Wellness (2016), Patch Adams (1998) and Road to Perdition (2002). He has been married to Dawn Didawick since September 19, 1978, and his versatility as both a stage and screen actor, combined with his memorable villainous turn as the charming yet sinister Mayor Wilkins, has made him a respected figure in both theater and television.",
        "birthday": "1951-09-10",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 35518,
        "imdb_id": "nm0342881",
        "known_for_department": "Acting",
        "name": "Harry Groener",
        "place_of_birth": "Augsburg, Bavaria, Germany",
        "popularity": 0.4915,
        "profile_path": "/3MAsDC1JtNqef1O4MwqakGjJkkI.jpg"
    }
}