{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qK7Ssnrfvrt65F66A1thvehfQg2.jpg",
                "genre_ids": [
                    16,
                    10751,
                    35,
                    12,
                    9648
                ],
                "id": 420821,
                "original_language": "en",
                "original_title": "Chip 'n Dale: Rescue Rangers",
                "overview": "Decades since their successful television series was canceled, Chip has succumbed to a life of suburban domesticity as an insurance salesman. Dale, meanwhile, has had CGI surgery and works the nostalgia convention circuit, desperate to relive his glory days. When a former cast mate mysteriously disappears, Chip and Dale must repair their broken friendship and take on their Rescue Rangers detective personas once again to save their friend’s life.",
                "popularity": 3.4456,
                "poster_path": "/7UGmn8TyWPPzkjhLUW58cOUHjPS.jpg",
                "release_date": "2022-05-20",
                "title": "Chip 'n Dale: Rescue Rangers",
                "video": false,
                "vote_average": 6.998,
                "vote_count": 1300,
                "character": "Kid Chip (voice)",
                "credit_id": "6283dc980859b40066ee9f8b",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Mason Blomberg is most known for his recurring role as Prince in Shameless and as the lead, Dax, in Furry Fortune. He is also lead role in a new children's television series that is yet to be announced. Mason began acting at the age of 6 and quickly realized it was his passion. His dedication and focus is beyond his years while his hilarious sense of humor and comedic timing makes him so much fun to work with. Mason is the eldest of four and is a great big brother to two little brothers and a baby sister. He is passionate about conservation and saving animals and, to this end, became a vegetarian at the age of 7.\n\n- IMDb Mini Biography By: C. Blomberg",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 3553646,
        "imdb_id": "nm10341359",
        "known_for_department": "Acting",
        "name": "Mason Blomberg",
        "place_of_birth": null,
        "popularity": 0.4524,
        "profile_path": "/w7z7RRj5cBCWfOSWzyUfVJeRD8l.jpg"
    }
}