{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1yWn9A2LN0uRGudIg0bV2Np6T69.jpg",
                "genre_ids": [
                    10752,
                    28,
                    18
                ],
                "id": 9289,
                "original_language": "en",
                "original_title": "The Longest Day",
                "overview": "The retelling of June 6, 1944, from the perspectives of the Germans, US, British, Canadians, and the Free French. Marshall Erwin Rommel, touring the defenses being established as part of the Reich's Atlantic Wall, notes to his officers that when the Allied invasion comes they must be stopped on the beach. \"For the Allies as well as the Germans, it will be the longest day\"",
                "popularity": 3.5233,
                "poster_path": "/5zmvEofdIlgXrQl9A7e5IOzlnFU.jpg",
                "release_date": "1962-09-25",
                "title": "The Longest Day",
                "video": false,
                "vote_average": 7.594,
                "vote_count": 977,
                "character": "Janine Boitard, a resistance",
                "credit_id": "52fe44e2c3a36847f80afcc7",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Irina Demich",
            "Yrina Demik"
        ],
        "biography": "Irina Demick (16 October 1936, Pommeuse, Seine-et-Marne - 8 October 2004), sometimes credited as Irina Demich was a French actress with a brief career in American films.\n\nBorn Irina Dziemiach, apparently of Slavic (Russian, Ukrainian, or Polish) and polish Jewish ancestry, in Pommeuse, Seine-et-Marne, she went to Paris and became a model. She made an appearance in a French film Julie la rousse (1959) and met producer Darryl F. Zanuck. Zanuck, whose lover she became, cast her in his epic production, The Longest Day as a French resistance fighter. Her career continued with roles in OSS se déchaine (1963), The Visit (1964), alongside Ingrid Bergman and Anthony Quinn, Un monsieur de compagnie (1964) with Catherine Deneuve and Jean-Pierre Cassel and Up from the Beach (1965) opposite Cliff Robertson and Red Buttons. In 1965, she played seven roles in Those Magnificent Men in Their Flying Machines, each one of a different nationality.\n\nAfter making a few more films, Prudence and the Pill (1968), Le Clan des Siciliens (The Sicilian Clan), with Jean Gabin and Alain Delon mostly in France and Italy, Demick's career faded and came to a standstill in 1972.\n\nShe died in Indianapolis, Indiana.\n\nDescription above from the Wikipedia article Irina Demick, licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": "1936-10-16",
        "deathday": "2004-10-08",
        "gender": 1,
        "homepage": null,
        "id": 35586,
        "imdb_id": "nm0218464",
        "known_for_department": "Acting",
        "name": "Irina Demick",
        "place_of_birth": "Pommeuse, Seine-et-Marne, France",
        "popularity": 0.1703,
        "profile_path": "/uh5izl9Qb2ifwHYaM2RkU7xjlP4.jpg"
    }
}