{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bYimqNnizPUCnL5HOdoCW02IGmH.jpg",
                "genre_ids": [
                    18,
                    35,
                    10749
                ],
                "id": 74643,
                "original_language": "fr",
                "original_title": "The Artist",
                "overview": "Hollywood, 1927: As silent movie star George Valentin wonders if the arrival of talking pictures will cause him to fade into oblivion, he sparks with Peppy Miller, a young dancer set for a big break.",
                "popularity": 3.1239,
                "poster_path": "/z68py0ZqPgeacGPG54AGVRbNBS7.jpg",
                "release_date": "2011-10-12",
                "title": "The Artist",
                "video": false,
                "vote_average": 7.451,
                "vote_count": 3367,
                "character": "Scientist #1",
                "credit_id": "67e1f2e94c52746665dc6db5",
                "order": 79
            },
            {
                "adult": false,
                "backdrop_path": "/12xU204ABgr31iCTM57JT6wGFMg.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 55787,
                "original_language": "en",
                "original_title": "Water for Elephants",
                "overview": "In this captivating Depression-era melodrama, impetuous veterinary student Jacob Jankowski joins a celebrated circus as an animal caretaker but faces a wrenching dilemma when he's transfixed by angelic married performer Marlena.",
                "popularity": 3.0366,
                "poster_path": "/8T7Hvb9trKvCAmbSI8cEIU0Sl2T.jpg",
                "release_date": "2011-04-15",
                "title": "Water for Elephants",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 2562,
                "character": "Circus Roustabout",
                "credit_id": "67e1f31016a3c5c224f0491d",
                "order": 56
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Robert Kestler was born March 1, 1971 in Venice, CA. His father, Robert N. Kestler, was an L.A.P.D. Detective and his mother Christine was a stay at home mother. He attended Walgrove Elementary, St. Mark's Catholic School and Mark Twain Junior High in Venice before moving to Ventura County. He graduated from Newbury Park High School in 1989. Robert's family has history in Hollywood as his Great Grandfather (Philip Morris I) was an actor as well as Eddie Chandler his Great Uncle. He also has deep family roots in the Los Angeles Police Department. As his grandfather John F. Morris \"Capt. Jack\" as he was called served for 33 years with the L.A.P.D. Robert was married to Monir Kestler in 1995 and has three daughters Tiffany, Dallas, and Tyler. He lives in Thousand Oaks in Ventura County.\n\nRobert has always been drawn to acting. Always the class clown and ready to entertain. Though he has worked many careers, acting is always the one he kept coming back to. His debut roles have varied from Secret Service to Circus Roust a Bout. He loves the Science Fiction and Drama Genres but would love to explore Comedy. He has yet to play a villain but aspires to in the future. He studies with Michaeljohn Gonzales to hone his acting skills. However he has also studied with David Kagen.",
        "birthday": "1971-03-01",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.talentpages.com/RobertKestler/",
        "id": 3567498,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Robert Kestler",
        "place_of_birth": "Venice, California",
        "popularity": 0.0143,
        "profile_path": null
    }
}