{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sPMBiyjTco4JdKojlfGIz5Wd0jC.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 10757,
                "original_language": "hi",
                "original_title": "कभी ख़ुशी कभी ग़म",
                "overview": "Years after his father disowns his adopted brother for marrying a woman of lower social standing, a young man goes on a mission to reunite his family.",
                "popularity": 4.6308,
                "poster_path": "/12BvYKueY0eruZuTYIextEZaCC.jpg",
                "release_date": "2001-12-14",
                "title": "Kabhi Khushi Kabhie Gham",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 572,
                "character": "Naina Kapoor",
                "credit_id": "52fe43b09251416c7501a3c5",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "रानी मुखर्जी",
            "Rani Mukherjee",
            "\tRani Mukherji",
            "رانی موکرجی"
        ],
        "biography": "Rani Mukerji (born on March 21, 1978) is an Indian film actress who works in Hindi movies.\n\nMaking her acting debut with Raja Ki Aayegi Baraat (1997), Mukerji had her first commercial success with Karan Johar's romance Kuch Kuch Hota Hai (1998), her biggest commercial success so far, and won a Filmfare Best Supporting Actress Award for her performance in the film. She later starred in several films, most of which fared below expectations, but in 2002 she re-invented her image with the critically acclaimed drama Saathiya, for which she received numerous awards and nominations.\n\nIn 2004, her performances in the hit Hum Tum and the critically acclaimed Yuva earned her the Best Actress and the Best Supporting Actress awards at the 50th Filmfare Awards, making her the first actress to win two major awards in the same year. She later received unanimous praise for her portrayal of a blind, deaf and mute woman in Black (2005), for which she garnered numerous major awards. Mukerji has since established herself as a leading actress of Hindi cinema.\n\nDescription above from the Wikipedia article Rani Mukerji, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1978-03-21",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 35776,
        "imdb_id": "nm0611552",
        "known_for_department": "Acting",
        "name": "Rani Mukerji",
        "place_of_birth": "Kolkata, West Bengal, India",
        "popularity": 0.421,
        "profile_path": "/6bm1lhrEgGFpOLBjvcOi3aoQmtg.jpg"
    }
}