{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1GU0jS5ZG5MhfdDrpj8s9XxbgJJ.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 505642,
                "original_language": "en",
                "original_title": "Black Panther: Wakanda Forever",
                "overview": "Queen Ramonda, Shuri, M’Baku, Okoye and the Dora Milaje fight to protect their nation from intervening world powers in the wake of King T’Challa’s death.  As the Wakandans strive to embrace their next chapter, the heroes must band together with the help of War Dog Nakia and Everett Ross and forge a new path for the kingdom of Wakanda.",
                "popularity": 14.185,
                "poster_path": "/sv1xJUazXeYqALzczSZ3O6nkH75.jpg",
                "release_date": "2022-11-09",
                "title": "Black Panther: Wakanda Forever",
                "video": false,
                "vote_average": 7.036,
                "vote_count": 7020,
                "character": "Shaman",
                "credit_id": "629cf5e6992fe600a603d964",
                "order": 62
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Josué Maychi is a Mexican film, theater and television actor, known for his work in Malinche (2018) as Cuauhtémoc, Hernán (2019) as Potonchán and Black Panther: Wakanda Forever (2022) as Attuma.\n\nMaychi was born in Hopelchén, Campeche, Mexico, where he lived until he was 18 years old, and then emigrated to San Francisco de Campeche where he studied theater. He comes from a family of Mayan origin , which is why he is a native speaker of the Mayan language.  He moved to Mexico City and graduated in 2011 with a degree in Administration, but almost at the same time she began a career in Theater, which has allowed her to participate in projects that have precisely contributed to making visible the situation that people from original towns.  In 2015 the actor worked in the play 'El Molino de Maiz', which focuses on the visibility of Mayan women and later, in 2017 he participated in the play 'Andares' by Makuyeika Creativo Teatral and directed by Héctor Flores Komatsu, in where he met with actors from Chiapas, Morelos and Oaxaca and shared from their stories, the experience of their childhoods, life in their communities and how they face society. This work allowed them to tour theaters in China, New York, Chicago, Germany, Chile, France and Holland.  He has participated in television projects such as Malinche (2018), Hernán (2019) and will make her film debut with the film Presencias (2021), directed by Luis Mandoki , and acting alongside Alberto Ammann and Yalitza Aparicio.  As a playwright, he wrote Jats'uts sáastal Bello Amanecer (2014), collaborates in Andares (2017), Deer Walkers (2017), and Ch'e'en: peeking into the well; works in the Mayan language. He has also served as an advisor for theater projects in the Mayan language.",
        "birthday": "1988-02-07",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 3577420,
        "imdb_id": "nm10289245",
        "known_for_department": "Acting",
        "name": "Josué Maychi",
        "place_of_birth": "Hopelchén, Campeche, Mexico",
        "popularity": 0.0825,
        "profile_path": "/ud3Oirvolasnf1eCtSBdtJlvL4l.jpg"
    }
}