{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hGr0FrLI74vqpBWTBOPloDBwOAK.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 705861,
                "original_language": "en",
                "original_title": "Hustle",
                "overview": "After discovering a once-in-a-lifetime player with a rocky past abroad, a down on his luck basketball scout takes it upon himself to bring the phenom to the States without his team's approval. Against the odds, they have one final shot to prove they have what it takes to make it in the NBA.",
                "popularity": 4.9115,
                "poster_path": "/xWic7kPq13oRxYjbGLApXCnc7pz.jpg",
                "release_date": "2022-06-03",
                "title": "Hustle",
                "video": false,
                "vote_average": 7.728,
                "vote_count": 2677,
                "character": "Shaquille O'Neal",
                "credit_id": "62d2ab12dd731b0054eb8e6a",
                "order": 58
            },
            {
                "adult": false,
                "backdrop_path": "/5N2mfRrvJUnCVpsMIebfosEyo1i.jpg",
                "genre_ids": [
                    16,
                    10751,
                    12,
                    35,
                    14
                ],
                "id": 137106,
                "original_language": "en",
                "original_title": "The Lego Movie",
                "overview": "An ordinary Lego mini-figure, mistakenly thought to be the extraordinary MasterBuilder, is recruited to join a quest to stop an evil Lego tyrant from conquering the universe.",
                "popularity": 8.1637,
                "poster_path": "/lbctonEnewCYZ4FYoTZhs8cidAl.jpg",
                "release_date": "2014-02-06",
                "title": "The Lego Movie",
                "video": false,
                "vote_average": 7.42,
                "vote_count": 8134,
                "character": "Shaq (voice)",
                "credit_id": "542f579fc3a368685a00094d",
                "order": 16
            },
            {
                "adult": false,
                "backdrop_path": "/g5haoqEqt5VwVwQKEkoXY9zqSxb.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 232672,
                "original_language": "en",
                "original_title": "Blended",
                "overview": "Recently divorced mom Lauren and widowed dad Jim let their friends push them into a blind date, which goes disastrously wrong. Unsurprisingly, neither wants to see the other ever again. However, fate intervenes when both Jim and Lauren, unbeknownst to each other, purchase one-half of the same vacation package at a South African resort for families, during spring break. They and their children are forced to share the same romantic suite and participate in a slew of family activities together.",
                "popularity": 8.8149,
                "poster_path": "/o2YrH9jS7CAfWjETHFeL0tth79E.jpg",
                "release_date": "2014-05-21",
                "title": "Blended",
                "video": false,
                "vote_average": 6.892,
                "vote_count": 3667,
                "character": "Doug",
                "credit_id": "54e3e0b3c3a36823d4001732",
                "order": 14
            },
            {
                "adult": false,
                "backdrop_path": "/yGtoR1fi3e2xU7N91cb2DKJjtyL.jpg",
                "genre_ids": [
                    99
                ],
                "id": 39452,
                "original_language": "en",
                "original_title": "Exit Through the Gift Shop",
                "overview": "Banksy is a graffiti artist with a global reputation whose work can be seen on walls from post-hurricane New Orleans to the separation barrier on the Palestinian West Bank. Fiercely guarding his anonymity to avoid prosecution, Banksy has so far resisted all attempts to be captured on film. Exit Through the Gift Shop tells the incredible true story of how an eccentric French shop keeper turned documentary maker attempted to locate and befriend Banksy, only to have the artist turn the camera back on its owner.",
                "popularity": 0.8431,
                "poster_path": "/ruM5ehUQlHC1Kx3SF18d6klfrAx.jpg",
                "release_date": "2010-03-05",
                "title": "Exit Through the Gift Shop",
                "video": false,
                "vote_average": 7.543,
                "vote_count": 910,
                "character": "Self (uncredited)",
                "credit_id": "6791e463e8b67ff833fa7073",
                "order": 35
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Shaq",
            "Shaquille Rashaun O'Neal",
            "Shaquille 'Shaq' O'Neal ",
            "DJ Diesel",
            "شکیل اونیل"
        ],
        "biography": "Shaquille Rashaun O'Neal (born March 6, 1972), nicknamed \"Shaq”, is an American former professional basketball player who is a sports analyst on the television program Inside the NBA on TNT. Standing 7 ft 1 in (2.16 m) tall and weighing 325 pounds (147 kg), he is one of the heaviest players ever to play in the NBA. Throughout his 18-year career, O'Neal has used his size and strength to overpower opponents for points and rebounds. After the retirement of Lindsey Hunter on March 5, 2010, O'Neal became the oldest active player in the NBA.\n\nFollowing a standout career at Louisiana State University, O'Neal was drafted by the Orlando Magic with the first overall pick in the 1992 NBA Draft. He quickly became one of the top centers in the league, winning Rookie of the Year in 1992–93 and later leading his team to the 1995 NBA Finals. After four years with the Magic, O'Neal signed as a free agent with the Los Angeles Lakers. He won three consecutive championships, playing alongside Kobe Bryant, in 2000, 2001, and 2002. O'Neal's relationship with Bryant eventually declined into a feud, leading to O'Neal's trade to the Miami Heat in 2004. A fourth NBA championship followed in 2006. Midway through the 2007-2008 season he was traded to the Phoenix Suns. After a season-and-a-half with the Suns, O'Neal was traded to the Cleveland Cavaliers, where he played alongside LeBron James in the 2009–10 season. O'Neal played for the Boston Celtics in the 2010–11 season.\n\nO'Neal's individual accolades include the 1999–00 MVP award, the 1992–93 NBA Rookie of the Year award, 15 All-Star game selections, three All-Star Game MVP awards, three Finals MVP awards, two scoring titles, 14 All-NBA team selections, and three NBA All-Defensive Team selections. He is one of only three players to win NBA MVP, All-Star game MVP and Finals MVP awards in the same year (2000); the other players are Willis Reed in 1970 and Michael Jordan in 1996 and 1998. He ranks 5th all-time in points scored, 5th in field goals, 12th in rebounds, and 7th in blocks.\n\nIn addition to his basketball career, O'Neal has released four rap albums, with his first, Shaq Diesel, going platinum. He has appeared in numerous films and has starred in his own reality shows, Shaq's Big Challenge and Shaq Vs.\n\nDescription above from the Wikipedia article Shaquille O'Neal, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1972-03-06",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 35806,
        "imdb_id": "nm0641944",
        "known_for_department": "Acting",
        "name": "Shaquille O'Neal",
        "place_of_birth": "Newark, New Jersey, USA",
        "popularity": 0.5767,
        "profile_path": "/dPpPU1y7JEOQHVGv6vNLcCDJhLP.jpg"
    }
}