{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jUaZAbdpNl33VHprUl4qEohXn8q.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 228194,
                "original_language": "en",
                "original_title": "The Hundred-Foot Journey",
                "overview": "A story centered around an Indian family who moves to France and opens a restaurant across the street from a Michelin-starred French restaurant.",
                "popularity": 2.6166,
                "poster_path": "/1vFhSr7INoulu18smHqicft05i8.jpg",
                "release_date": "2014-08-06",
                "title": "The Hundred-Foot Journey",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1478,
                "character": "Mama",
                "credit_id": "538e1cdd0e0a2632b7000112",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Julie",
            "Miss. Juhi Chawla",
            "ਜੂਹੀ ਚਾਵਲਾ",
            "जूही चावला",
            "Джухи Чавла"
        ],
        "biography": "Juhi Chawla (born 13 November 1967) is an Indian actress, film producer and television presenter.\n\nAfter being crowned as the winner of the Miss India beauty contest in 1984, Chawla pursued an acting career. She went on to become one of the top leading actresses of Bollywood and starred in films ranging from the romances Qayamat Se Qayamat Tak and Darr to Hum Hain Rahi Pyar Ke, which earned her the Filmfare Best Actress Award, to Yes Boss and Ishq. Chawla has been mostly recognised for her comic timing in films as well as her vivacious screen persona.\n\nDuring the 2000s, after having starred in over 70 mainstream Hindi films, Chawla started acting in art and independent films. She appeared in films in her native tongue of Punjabi, and has been mostly working in parallel cinema. She gained critical recognition for her performances in films like Jhankaar Beats, 3 Deewarein, My Brother Nikhil and Bas Ek Pal. Since 2000, Chawla branched out into film production and television presenting as well.\n\nDescription above from the Wikipedia article Juhi Chawla, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1967-11-13",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 35810,
        "imdb_id": "nm0004487",
        "known_for_department": "Acting",
        "name": "Juhi Chawla Mehta",
        "place_of_birth": "Ludhiana, Punjab, India",
        "popularity": 0.2238,
        "profile_path": "/gyZLscSW3dYYe3N5K2YcYtRnbq5.jpg"
    }
}