{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kB9Y59YDMOFdm5LgSyTVj4b6hh6.jpg",
                "genre_ids": [
                    28,
                    53
                ],
                "id": 4909,
                "original_language": "en",
                "original_title": "The Day of the Jackal",
                "overview": "An international assassin known as ‘The Jackal’ is employed by disgruntled French generals to kill President Charles de Gaulle, with a dedicated gendarme on the assassin’s trail.",
                "popularity": 5.8509,
                "poster_path": "/vThgcb3JOj99yETg8WChuci4LV2.jpg",
                "release_date": "1973-05-16",
                "title": "The Day of the Jackal",
                "video": false,
                "vote_average": 7.541,
                "vote_count": 631,
                "character": "Gendarme",
                "credit_id": "52fe43e1c3a36847f8075f3d",
                "order": 30
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Philippe Léotard ( born Ange Philippe Paul André Léotard-Tomasi August 28, 1940 - died August 25, 2001) was a French actor, poet, and singer.\n\nHe was born in Nice , one of seven children - four girls, then three boys, of which he was the oldest - and was the brother of politician François Léotard. His childhood was normal except for an illness (rheumatic fever) which struck him and forced him to spend days in bed during which time he read a great many books. He was particularly fond of the poets - Baudelaire, Rimbaud, Lautréamont, Blaise Cendrars. He met Ariane Mnouchkine at the Sorbonne and in 1964 they formed the théâtre du soleil.\n\nHe played Philippe, the tormented son of a women with terminal illness, in the 1974 drama film La Gueule ouverte, by the controversial director Maurice Pialat. He won a César Award for Best Actor for his role in the 1982 movie La Balance.\n\nOne of his few English-language roles was a cameo in the 1973 thriller The Day of the Jackal and he co-starred as \"Jacques\" in the 1975 John Frankenheimer movie French Connection II which starred Gene Hackman and Fernando Rey, (sequel to The French Connection).\n\nLéotard died in 2001 of respiratory failure in Paris at the age of 60. He was interred at the Père Lachaise Cemetery in Paris.\n\nDescription above from the Wikipedia article Philippe Léotard, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1940-08-28",
        "deathday": "2001-08-25",
        "gender": 2,
        "homepage": null,
        "id": 3581,
        "imdb_id": "nm0529645",
        "known_for_department": "Acting",
        "name": "Philippe Léotard",
        "place_of_birth": "Nice, Alpes-Maritimes, France",
        "popularity": 0.2439,
        "profile_path": "/rjvSxdR594HfvlaRKURZDlPE36p.jpg"
    }
}