{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6MbFN88F27WvGC9WhAXq5KUIgTj.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 1675,
                "original_language": "fr",
                "original_title": "La Nuit américaine",
                "overview": "A committed film director struggles to complete his movie while coping with a myriad of crises, personal and professional, among the cast and crew.",
                "popularity": 2.9412,
                "poster_path": "/e5xDrSx6zDEUlMe2dWKGhv88PDZ.jpg",
                "release_date": "1973-05-24",
                "title": "Day for Night",
                "video": false,
                "vote_average": 7.773,
                "vote_count": 622,
                "character": "Liliane, the Trainee Script Girl",
                "credit_id": "52fe430bc3a36847f80362ad",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/rjXK74vrvmFMN0vuFw3TViZ18Ha.jpg",
                "genre_ids": [
                    16,
                    10749,
                    12,
                    18,
                    14
                ],
                "id": 204436,
                "original_language": "fr",
                "original_title": "Jack et la mécanique du cœur",
                "overview": "In Scotland 1874, Jack is born on the coldest day ever. Because of the extreme cold, his heart stops beating. The responsible midwife in Edinburgh finds a way to save him by replacing his heart with a clock. So he lives and remains under the midwife's protective care. But he must not get angry or excited because that endangers his life by causing his clock to stop working. Worse than that, when he grows up, he has to face the fact he cannot fall in love because that too could stop his delicate heart.",
                "popularity": 2.3335,
                "poster_path": "/ZSrU2mvlzM5Jr30XtKCU1fziIj.jpg",
                "release_date": "2014-02-05",
                "title": "Jack and the Cuckoo-Clock Heart",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 738,
                "character": "Brigitte Helm (voice)",
                "credit_id": "59f47ed99251414d4d0113bb",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/g3yflwqajsVEYdUr7B84fMHBkAw.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 329805,
                "original_language": "fr",
                "original_title": "Mon roi",
                "overview": "Tony is admitted to a rehabilitation center after a serious ski accident. Dependent on the medical staff and pain relievers, she takes time to look back on a turbulent relationship that she experienced with Georgio.",
                "popularity": 2.4944,
                "poster_path": "/kOhRkC7J3jpAgHGC0Uh3SoCqU4c.jpg",
                "release_date": "2015-10-21",
                "title": "My King",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 792,
                "character": "Mysterious lady at the wedding",
                "credit_id": "685bf039eb3688fe5b91b4c1",
                "order": 22
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Danièle Graule",
            "Dany Craule"
        ],
        "biography": "Danièle Graule (1 October 1944 – 18 July 2022), known as Dani (sometimes as Dany), was a French actress and singer.\n\nDani was born in Castres. In 1966 she was contracted to Pathé-Marconi and released her first single \"Garçon manqué\". In 1968 \"Papa vient d'épouser la bonne\" sold a million copies and was a major hit. Dani was meant to have been France's Eurovision Song Contest 1974 entry with the song \"La Vie à 25 ans\", but President Georges Pompidou died in the week of the competition, so she never entered Eurovision properly. Her only English language record release to date was \"That Old Familiar Feeling\", which had the same music as \"La Vie à 25 ans\" but with English lyrics by British singer-songwriter Lynsey de Paul.\n\nOn the cinema screen, she played the script-girl Liliane in François Truffaut's Day for Night and in the last Antoine Doinel-adventure Love on the Run a short-time-affair of Antoine, Christine's friend Liliane. Truffaut who made her famous with one role in two movies: she is Liliane in Day for Night. The fickle girlfriend of actor Alphonse (Jean-Pierre Léaud) recruited as a script trainee who is pinching for the English stuntman. In 1978, this Liliane became the friend of Christine Doinel alias Claude Jade in the final film of the Doinel cyclus. Truffaut used Liliane's flashbacks for Love on the Run. Here Liliane becomes the best friend of Christine (Claude Jade). And later, she has an affair with her husband Antoine, again Jean-Pierre Léaud. Thanks to the installation of new and old scenes, Claude Jade also mounted in the flashbacks of Day for Night, it seems Dani was already part of the Doinel Cycle.\n\nShe died in Tours on 18 July 2022, aged 77.\n\nSource: Article \"Dani (singer)\" from Wikipedia in English, licensed under CC-BY-SA.",
        "birthday": "1944-10-01",
        "deathday": "2022-07-18",
        "gender": 1,
        "homepage": null,
        "id": 3591,
        "imdb_id": "nm0186569",
        "known_for_department": "Acting",
        "name": "Dani",
        "place_of_birth": "Castres, Tarn, France",
        "popularity": 0.1726,
        "profile_path": "/bCYJJsuiqBZ9PqG9TfaLF932x02.jpg"
    }
}