{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/djPXXv9pPyTLGl9kMPCTyiBmIA5.jpg",
                "genre_ids": [
                    37,
                    28
                ],
                "id": 11969,
                "original_language": "en",
                "original_title": "Tombstone",
                "overview": "Legendary marshal Wyatt Earp, now a weary gunfighter, joins his brothers Morgan and Virgil to pursue their collective fortune in the thriving mining town of Tombstone. But Earp is forced to don a badge again and get help from his notorious pal Doc Holliday when a gang of renegade brigands and rustlers begins terrorizing the town.",
                "popularity": 5.9186,
                "poster_path": "/wGFCvylul8iEQhJOKfwZGGvXMzA.jpg",
                "release_date": "1993-12-25",
                "title": "Tombstone",
                "video": false,
                "vote_average": 7.589,
                "vote_count": 2284,
                "character": "Kate",
                "credit_id": "56888f89c3a3684bcc026e47",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Joanna Pacuła",
            "Ioana Pacula",
            "J. Pacula",
            "Dzhoanna Pakula",
            "یوانا پاچولا"
        ],
        "biography": "Joanna Pacula (born January 2, 1957) is a Polish actress. Pacula joined Warsaw Dramatic Theatre where she acted until 1981. She started her career playing in productions of Shakespeare's Romeo and Juliet, Othello and As You Like It. She also found work in a handful of films, including Krzysztof Zanussi's Barwy ochronne/Camouflage (1977). In 1981, Pacula was caught in Paris when communist authorities in Poland declared martial law. In 1982 she eventually emigrated to the U.S. where she has specialized in playing European temptresses since her feature debut opposite William Hurt in Gorky Park (1983). She played the part of the exotic beauty in numerous American TV series and movies, including the Holocaust drama Escape From Sobibor (CBS, 1987), The Kiss (1988), E.A.R.T.H. Force (CBS, 1990), and the TV series, The Colony (ABC, 1996). She was featured in Marked for Death (1990) as an expert on Jamaican voodoo and gangs; in the Italian erotic thriller Husbands And Lovers (1992) as a free spirited adultress (which featured a rather controversial bare-bottom spanking scene, a first in a mainstream film); Tombstone (1993) as Doc Holliday's lover, Kate (also known as Big Nose Kate and Mary Catherine Haroney, born November 7, 1850); in The Haunted Sea (1997); and in the movie Virus (1999), playing a Russian scientist. She currently resides in Southern California.\n\nDescription above from the Wikipedia article Joanna Pacula, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1957-12-30",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 36059,
        "imdb_id": "nm0001586",
        "known_for_department": "Acting",
        "name": "Joanna Pacula",
        "place_of_birth": "Tomaszów Lubelski, Lubelskie, Poland",
        "popularity": 0.7181,
        "profile_path": "/oGzAZY8L1KjsFtFoLpsqUwvBA4k.jpg"
    }
}