{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hVvW015x8cD2X0KthGovw27EpF2.jpg",
                "genre_ids": [
                    10402,
                    10749,
                    35
                ],
                "id": 2769,
                "original_language": "en",
                "original_title": "An American in Paris",
                "overview": "Jerry Mulligan is an exuberant American expatriate in Paris trying to make a reputation as a painter. His friend Adam is a struggling concert pianist who's a long time associate of a famous French singer, Henri Baurel. A lonely society woman, Milo Roberts, takes Jerry under her wing and supports him, but is interested in more than his art.",
                "popularity": 3.9087,
                "poster_path": "/lyDXkvG53ldz6Cf7dbjJl7TaoP5.jpg",
                "release_date": "1951-09-26",
                "title": "An American in Paris",
                "video": false,
                "vote_average": 7.026,
                "vote_count": 606,
                "character": "Dancer (uncredited)",
                "credit_id": "63a72dcd2faf4d008477356f",
                "order": 43
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Born in New York City, she was the only child of Clyde E. Elliott, a motion picture director known for Frank Buck's \"Bring 'Em Back Alive\" and \"Devil Tiger\"; and Marie Flavia Elliott, an actress born in Poland. As a child, Marietta traveled throughout Asia as her father filmed adventures for Paramount, eventually settling down in Los Angeles and attending Hollywood High school. While there, Marietta excelled as a fencer studying with the great Ralph Faukner at the old Falcon studios. She gave up the blade to study ballet. She began her dancing career as one of the renowned Earl Carroll Girls, known for their exceptional beauty, then segued into several productions done by the Los Angeles Light Opera. She danced on many musical variety Television shows and in feature films such as \"Showboat\", \"Singing in the Rain\", \"An American in Paris\" and \"Gunsmoke\". While under contract at Fox, she met the novelist and screenwriter Alfred Hayes, whom she later married. When she retired from dance, she went on to have a long career as a real estate agent and broker throughout Los Angeles.",
        "birthday": "1925-09-19",
        "deathday": "2016-12-02",
        "gender": 1,
        "homepage": null,
        "id": 3608727,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Marietta Elliott",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.0214,
        "profile_path": null
    }
}