{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zqLR4jm0lPFGnyN55QBSf4pzz5n.jpg",
                "genre_ids": [
                    9648,
                    53
                ],
                "id": 260,
                "original_language": "en",
                "original_title": "The 39 Steps",
                "overview": "Richard Hanney has a rude awakening when a glamorous female spy falls into his bed - with a knife in her back. Having a bit of trouble explaining it all to Scotland Yard, he heads for the hills of Scotland to try to clear his name by locating the spy ring known as The 39 Steps.",
                "popularity": 1.9046,
                "poster_path": "/oC81jK6aAug4MA0xzYVngHmjsZS.jpg",
                "release_date": "1935-06-06",
                "title": "The 39 Steps",
                "video": false,
                "vote_average": 7.339,
                "vote_count": 997,
                "character": "Annabella Smith",
                "credit_id": "52fe422fc3a36847f800a61f",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia.  Lucie Mannheim (30 April 1899 – 28 July 1976) was a German singer and actress.\n\nMannheim was born in Berlin–Köpenick where she studied drama and quickly became a popular figure appearing on stage in plays and musicals. Among other roles, she played Nora in Ibsen's A Doll's House, Marie in Büchner's Woyzeck, and Juliet in Shakespeare's Romeo and Juliet. She also began a film career in 1923, appearing in several silent and sound films including Atlantik (1929) – the first of many versions of the story of the ill-fated RMS Titanic. The composer Walter Goetze wrote his operetta Die göttliche Jette (1931) especially for Mannheim.  However, as a Jew she was obliged to stop acting in 1933, when her contract at the State Theatre was cancelled. She promptly left Germany, first to Czechoslovakia, then to Britain. She appeared in several films there, notably as the doomed spy Annabella Smith in Alfred Hitchcock's 1935 version of The 39 Steps.\n\nDuring World War II she appeared in several films, as well as broadcasting propaganda to Germany – including performing an anti-Hitler version of Lili Marleen  in 1943. In 1941, she married the actor Marius Goring.\n\nShe returned to Germany in 1948 and resumed her career as an actress on stage and in film. In 1955 she joined the cast of the British television series The Adventures of the Scarlet Pimpernel as Countess La Valliere. She made her final English-language film appearance in the 1965 film Bunny Lake Is Missing. Her last appearance was in a 1970 TV movie. She died in Braunlage.\n\nDescription above from the Wikipedia article Lucie Mannheim, 1st Baron Tweedsmuir, licensed under CC-BY-SA,full list of contributors on Wikipedia.",
        "birthday": "1899-04-30",
        "deathday": "1976-07-18",
        "gender": 1,
        "homepage": null,
        "id": 3611,
        "imdb_id": "nm0543169",
        "known_for_department": "Acting",
        "name": "Lucie Mannheim",
        "place_of_birth": "Berlin, Germany",
        "popularity": 0.0876,
        "profile_path": "/iGg7YJjYFZ8cIAaayceXy1uS5Vj.jpg"
    }
}