{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ffAL7ZiUnCay51SeHFTrTEUpUkO.jpg",
                "genre_ids": [
                    18
                ],
                "id": 10400,
                "original_language": "en",
                "original_title": "The Hurricane",
                "overview": "The story of Rubin \"Hurricane\" Carter, a boxer wrongly imprisoned for murder, and the people who aided in his fight to prove his innocence.",
                "popularity": 3.8457,
                "poster_path": "/eOzbt7KsqTC8gcjJMxcQnr89cxJ.jpg",
                "release_date": "1999-09-17",
                "title": "The Hurricane",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 1460,
                "character": "Warden",
                "credit_id": "547ee628c3a368396c000fc1",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Albert Samuel Waxman",
            "Albert Waxman",
            "Albert S. Waxman",
            "Stan Ferris"
        ],
        "biography": "Al Waxman was a prolific actor and director, leaving a mark on over 1000 productions in radio, television, film, and theatre. His role in \"King of Kensington\" stood out as a highlight among his successful Canadian TV series. Additionally, he starred in acclaimed series like \"Cagney & Lacey,\" \"Missing Treasures,\" and \"Twice in a Lifetime.\" His theatrical ventures spanned from off-Broadway in New York to the West End in London, earning praise at the Stratford Festival for his performance as Willy Loman in \"Death of a Salesman\" and his direction of \"The Diary of Anne Frank.\"\n\nWaxman's accolades included ACTRA and Gemini awards for acting, and recognition from organizations like the American Women in Film for his directorial prowess. His commitment to various charitable causes, including the Canadian Cancer Society and the Heart & Stroke Foundation, showcased his dedication to social impact. His contributions were honoured with distinctions such as the Order of Ontario in 1996 and the Order of Canada in 1997.",
        "birthday": "1935-03-02",
        "deathday": "2001-01-18",
        "gender": 2,
        "homepage": null,
        "id": 36172,
        "imdb_id": "nm0915382",
        "known_for_department": "Acting",
        "name": "Al Waxman",
        "place_of_birth": "Toronto, Ontario, Canada",
        "popularity": 0.3159,
        "profile_path": "/7nvvodM6mqMHPVzGQBIIG34pjsp.jpg"
    }
}