{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3Yz8IcUBPZ8zDff0ktHZk24Rot0.jpg",
                "genre_ids": [
                    18
                ],
                "id": 261,
                "original_language": "en",
                "original_title": "Cat on a Hot Tin Roof",
                "overview": "An alcoholic ex-football player drinks his days away, having failed to come to terms with his sexuality and his real feelings for his football buddy who died after an ambiguous accident. His wife is crucified by her desperation to make him desire her: but he resists the affections of his wife. His reunion with his father—who is dying of cancer—jogs a host of memories and revelations for both father and son.",
                "popularity": 1.9871,
                "poster_path": "/5djZZECgqDGuSI1INmrdAcGRBb0.jpg",
                "release_date": "1958-08-29",
                "title": "Cat on a Hot Tin Roof",
                "video": false,
                "vote_average": 7.656,
                "vote_count": 786,
                "character": "Deacon Davis",
                "credit_id": "52fe422fc3a36847f800a6d9",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/uif5fUshJrXyyDzfpzp1DLw3N0S.jpg",
                "genre_ids": [
                    27,
                    53,
                    9648
                ],
                "id": 539,
                "original_language": "en",
                "original_title": "Psycho",
                "overview": "When larcenous real estate clerk Marion Crane goes on the lam with a wad of cash and hopes of starting a new life, she ends up at the notorious Bates Motel, where manager Norman Bates cares for his housebound mother.",
                "popularity": 8.4504,
                "poster_path": "/yz4QVqPx3h1hD1DfqqQkCq3rmxW.jpg",
                "release_date": "1960-06-22",
                "title": "Psycho",
                "video": false,
                "vote_average": 8.422,
                "vote_count": 10504,
                "character": "George Lowery",
                "credit_id": "52fe424fc3a36847f8014279",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Vaughn Everett Taylor"
        ],
        "biography": "Vaughn Taylor  (February 22, 1910 – April 26, 1983) was an American film and television actor. He was born in Boston, Massachusetts. His film credits include Jailhouse Rock, Cat on a Hot Tin Roof, Psycho and In Cold Blood. In his many television appearances, Taylor appeared in several episodes of the Twilight Zone, including the role of the salesman in the episode\" I Sing the Body Electric\". He also appeared in \"Time Enough at Last\", \"Still Valley\", an episode of \"The Outer Limits\" called \"The Guests\" as the character Mr. Latimer, \"The Incredible World of Horace Ford\" and \"The Self-Improvement of Salvadore Ross\". In 1958, he appeared as a doctor shot to death in the back by the brother, played by Nick Adams of an outlaw, portrayed by Michael Landon, whom he had treated in the Steve McQueen CBS western Wanted: Dead or Alive. Taylor appeared three times in the 1960–1961 season in the syndicated series COronado 9 starring Rod Cameron. He guest starred in 1961 as a veterinarian in the ABC sitcom The Hathaways, starring Peggy Cass, Jack Weston, and the Marquis Chimps. Taylor also appeared in 1961 in James Franciscus's short-lived CBS drama series, The Investigators. He was also a frequent guest on the Perry Mason series, appearing a total of eight times (including the first episode). He died in 1983, aged 73, two months before the release of Psycho II, which was the sequel to the original Psycho.\n\nDescription above from the Wikipedia article Vaughn Taylor (actor), licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": "1911-02-22",
        "deathday": "1983-04-26",
        "gender": 2,
        "homepage": null,
        "id": 3641,
        "imdb_id": "nm0853299",
        "known_for_department": "Acting",
        "name": "Vaughn Taylor",
        "place_of_birth": "Boston, Massachusetts, USA",
        "popularity": 0.3943,
        "profile_path": "/qX7jGnLyveGDBRy9nRgzBJFMqTH.jpg"
    }
}