{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7D1v3y0RPoyJBZAx4eGdjcqJUuD.jpg",
                "genre_ids": [
                    12,
                    35,
                    18
                ],
                "id": 17379,
                "original_language": "en",
                "original_title": "Last Holiday",
                "overview": "The discovery that she has a terminal illness prompts introverted department store saleswoman Georgia Byrd to reflect on what she realizes has been an overly cautious life. With weeks to live, she withdraws her life savings, sells all her possessions and jets off to Europe where she lives it up at a posh hotel. Upbeat and passionate, Georgia charms everybody she meets, including renowned Chef Didier. The only one missing from her new life is her longtime crush Sean Matthews.",
                "popularity": 4.2064,
                "poster_path": "/hRNZszPHjIpYGlrMN3o4f6f6cVd.jpg",
                "release_date": "2006-01-13",
                "title": "Last Holiday",
                "video": false,
                "vote_average": 7.219,
                "vote_count": 807,
                "character": "Sean Matthews",
                "credit_id": "52fe47219251416c7508ec31",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "L.L. Cool J",
            "James Todd Smith",
            "Ladies Love Cool James"
        ],
        "biography": "James Todd Smith, better known as LL Cool J (acronym for Ladies Love Cool James), is an American rapper, songwriter, record producer, and actor. He is one of the earliest rappers to achieve commercial success, alongside fellow new school hip hop acts Beastie Boys and Run-DMC.\n\nSigned to Def Jam Recordings in 1984, his  breakthrough came with his single \"I Need a Beat\" and his landmark debut album, Radio (1985). He achieved further commercial and critical success with the albums Bigger and Deffer (1987), Walking with a Panther (1989), Mama Said Knock You Out (1990), Mr. Smith (1995), and Phenomenon (1997). His twelfth album, Exit 13 (2008), was his last in his long-tenured deal with Def Jam.\n\nA two-time Grammy Award winner, LL Cool J is known for hip hop songs such as \"Going Back to Cali\", \"I'm Bad\", \"The Boomin' System\", \"Rock the Bells\", and \"Mama Said Knock You Out\", as well as R&B hits such as \"Doin' It\", \"I Need Love\", \"Around the Way Girl\" and \"Hey Lover\". In 2010, VH1 placed him on their \"100 Greatest Artists Of All Time\" list. In 2017, LL Cool J became the first rapper to receive the Kennedy Center Honors. In 2021, he was inducted into the Rock and Roll Hall of Fame with an award for Musical Excellence.\n\nWhile he first appeared as a rapper in the movie Krush Groove (performing \"I Can't Live Without My Radio\"), his first acting part was a small role in a high school football movie called Wildcats. He continued to work in movies from then until 1995 when he landed his own television sitcom, In the House (1995-2000).\n\nHe has appeared in numerous films, including Last Holiday, Edison, Mindhunters, S.W.A.T., Deliver Us from Eva, Rollerball, Charlie's Angels, In Too Deep, Any Given Sunday, Deep Blue Sea, Halloween H20, B.A.P.S., Toys, and The Hard Way.\n\nIn 2005, he returned to television in a guest starring role on the FOX medical drama House. He also guest starred on 30 Rock in 2007, and on Sesame Street 's 39th season where he introduced the word of the day, \"Unanimous” and performed \"The Addition Expedition\" in episode 4172 (Sept. 30, 2008).\n\nAs of 2011, he stars as Special Agent Sam Hanna on CBS's police procedural NCIS: L.A., a spin-off of NCIS. He was also the host of MTV's Lip Sync Battle.",
        "birthday": "1968-01-14",
        "deathday": null,
        "gender": 2,
        "homepage": "http://llcoolj.com/",
        "id": 36424,
        "imdb_id": "nm0005112",
        "known_for_department": "Acting",
        "name": "LL Cool J",
        "place_of_birth": "Bay Shore, Long Island, New York, USA",
        "popularity": 0.6578,
        "profile_path": "/dpOHjasRJz7rk9CVutd6L9WnWTc.jpg"
    }
}