{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7bjaAcbrJDVvdF2Uew6rGp9Tp05.jpg",
                "genre_ids": [
                    18,
                    35,
                    10752
                ],
                "id": 597922,
                "original_language": "en",
                "original_title": "The Greatest Beer Run Ever",
                "overview": "Chickie wants to support his friends fighting in Vietnam, so he does something wild—personally bring them American beer. What starts as a well-meaning journey quickly changes Chickie’s life and perspective. Based on a true story.",
                "popularity": 6.538,
                "poster_path": "/ggf37TpcKaxwguhvtNn6MQpyqBn.jpg",
                "release_date": "2022-09-23",
                "title": "The Greatest Beer Run Ever",
                "video": false,
                "vote_average": 7.531,
                "vote_count": 824,
                "character": "Erickson",
                "credit_id": "63f3058615376c008bc0c2e5",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Omari K. Chancellor is a Brooklyn-based actor, producer, and educator. Born and raised on St. Croix in the U.S. Virgin Islands, Omari moved to the mainland to play collegiate soccer and earn an MFA from NYU Tisch's Graduate Acting Program. He has performed in both theater and film productions—most recently seen as Davion in AMANI at Rattlestick Theater. He was also featured in Peter Farrelly’s film, The Greatest Beer Run Ever (Apple+), Elsbeth (CBS), Why Women Kill (Paramount+), and soft (The Williamstown Theater Festival). Omari’s ability to craft narratives that are fun, humorous, and a little irreverent brings a captivating sense of play to his performance and storytelling. In addition to his performance work, Omari has founded a creative agency and taught fiction courses at Gotham Writers Workshop in Manhattan.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.omarikchancellor.com/",
        "id": 3647346,
        "imdb_id": "nm12557538",
        "known_for_department": "Acting",
        "name": "Omari K. Chancellor",
        "place_of_birth": "St. Croix, Virgin Islands",
        "popularity": 0.0387,
        "profile_path": null
    }
}