{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tHR34A5n0my4maACNdLpWGd6QYq.jpg",
                "genre_ids": [
                    18,
                    53
                ],
                "id": 698948,
                "original_language": "en",
                "original_title": "Thirteen Lives",
                "overview": "Based on the true nail-biting mission that captivated the world. Twelve boys and the coach of a Thai soccer team explore the Tham Luang cave when an unexpected rainstorm traps them in a chamber inside the mountain. Entombed behind a maze of flooded cave tunnels, they face impossible odds. A team of world-class divers navigate through miles of dangerous cave networks to discover that finding the boys is only the beginning.",
                "popularity": 8.5127,
                "poster_path": "/yi5KcJqFxy0D6yP8nCfcF8gJGg5.jpg",
                "release_date": "2022-07-18",
                "title": "Thirteen Lives",
                "video": false,
                "vote_average": 7.87,
                "vote_count": 1368,
                "character": "Udom",
                "credit_id": "62f2de0d0b5fd6007f761ef8",
                "order": 43
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Gerwin Widjaja is a German-born Indonesian actor, scuba diver and underwater photographer.\n\nWidjaja was born in Berlin Germany, where his parents studied and lived for many years. He learned classical piano at a very young age from his mother, who is now a retired piano teacher. At four, his family returned to Jakarta, Indonesia, where he grew up.\n\nAt 18, Widjaja moved to Australia to complete his tertiary study. While undergoing his Bachelor of Information Systems degree, and unbeknownst to his parents, Gerwin graduated from the Music Theatre course at the National Theatre. His broad passion for dance soon saw him embark upon jazz, tap, and funk training.\n\nWidjaja is also an Advanced Open Water scuba diver, and his passion includes underwater photography.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 3657721,
        "imdb_id": "nm5693262",
        "known_for_department": "Acting",
        "name": "Gerwin Widjaja",
        "place_of_birth": "Berlin, Germany",
        "popularity": 0.0214,
        "profile_path": "/m7AkTEKBC2qFDcn4gbonvQzLkqJ.jpg"
    }
}