{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ew5FcYiRhTYNJAkxoVPMNlCOdVn.jpg",
                "genre_ids": [
                    18,
                    80,
                    28
                ],
                "id": 272,
                "original_language": "en",
                "original_title": "Batman Begins",
                "overview": "Driven by tragedy, billionaire Bruce Wayne dedicates his life to uncovering and defeating the corruption that plagues his home, Gotham City.  Unable to work within the system, he instead creates a new identity, a symbol of fear for the criminal underworld - The Batman.",
                "popularity": 16.5995,
                "poster_path": "/sPX89Td70IDDjVr85jdSBb4rWGr.jpg",
                "release_date": "2005-06-10",
                "title": "Batman Begins",
                "video": false,
                "vote_average": 7.717,
                "vote_count": 21791,
                "character": "Police Officer (uncredited)",
                "credit_id": "6897ba8124162fd59b92eb21",
                "order": 109
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jennifer Ashley Goodman"
        ],
        "biography": "Goodman is most known for her recent role opp Bob Odenkirk in Better Call Saul, and her most recent feature film that received domestic and International distribution within one year of filming, The Unseen, which stars RJ Mitte (Breaking Bad) which Jennifer also has a supporting role in and Produced. Previous, she starred in a Tv series she created/wrote/produced, \"Conrad,\" opp Harry Lennix. Conrad is a story about a female detective on the autism spectrum uncovering a covert operation. Jennifer, who mirrors her character Kate Conrad on Conrad, is also on the Autism Spectrum and brings authenticity to the role. Harry Lennix, (The Blacklist), Eric Roberts, (Star 80, The Best of The Best), Hisham Tawfiq (The Blacklist) and Mia Talerico (Disney's Good Luck Charlie) also star in the show. Jennifer also created, and produced a Psychological Thriller, (The Nest - 2018) that won her a notable Top Women Producers award in 2018. She is known for the company she Co-Created Lakefront Pictures, LLC and Lakefront Creative Group with Conrad's co-creator Ryan Atkins in which they write and produce narrative content. \"Blackhatter\" a Psychological Thriller (2022) and \"Pictures Only\" two projects she produced, won several festival awards. Her most recent feature film, The Unseen, starring RJ Mitte (Breaking Bad) and Christian Stolte (Chicago Fire), that she wrote, produced and also acted in, is on Apple TV, Amazon + more",
        "birthday": "1982-02-15",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 3665666,
        "imdb_id": "nm7992482",
        "known_for_department": "Acting",
        "name": "Jennifer A. Goodman",
        "place_of_birth": "Chicago, Illinois, U.S.",
        "popularity": 0.1002,
        "profile_path": "/pNszOhvgPDBlu4T08umvSjtdg9B.jpg"
    }
}