{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/x4OYcZVHggyZHOrvkCo2HH9kLkF.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 4348,
                "original_language": "en",
                "original_title": "Pride & Prejudice",
                "overview": "A story of love and life among the landed English gentry during the Georgian era. Mr. Bennet is a gentleman living in Hertfordshire with his overbearing wife and five daughters, but if he dies their house will be inherited by a distant cousin whom they have never met, so the family's future happiness and security is dependent on the daughters making good marriages.",
                "popularity": 9.6,
                "poster_path": "/jnsoq5q98DQaE8yw6WZH0F9dW5G.jpg",
                "release_date": "2005-09-16",
                "title": "Pride & Prejudice",
                "video": false,
                "vote_average": 8.06,
                "vote_count": 8407,
                "character": "Mrs. Hill",
                "credit_id": "5f4c5614eec4f30037d5a02e",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Janet was born in Birmingham on October 10 1931 and trained as an actress at Birmingham Repertory School, subsequently performing in repertory groups around the British Isles. In 1968 she made her Royal Shakespeare Company debut, remaining with them until 1976, then returning for a 7 year stint in 1995. During this period she cites her favourite director as Ronald Eyre, who helmed a production of 'London Assurance' with Judi Dench and Donald Sinden. Janet also acted with the National Theatre in 'The Life of Galileo' with Michael Gambon and 'Hedda Gabler' starring Juliet Stevenson. In later years she worked in Northampton at the Royal and Derngate. Though she made comparatively few movies her last appearance was as a 'scary old lady' in the 2012 'Snow White and the Huntsman'. A keen bridge player Janet died on 14 July 2015. She was unmarried.",
        "birthday": "1931-10-10",
        "deathday": "2015-07-14",
        "gender": 1,
        "homepage": null,
        "id": 36667,
        "imdb_id": "nm1851283",
        "known_for_department": "Acting",
        "name": "Janet Whiteside",
        "place_of_birth": "Birmingham, West Midlands, England, UK",
        "popularity": 0.0441,
        "profile_path": null
    }
}