{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8zLS8p1tRyWFLRFfmgQq0j5WE6z.jpg",
                "genre_ids": [
                    12,
                    28,
                    14
                ],
                "id": 564,
                "original_language": "en",
                "original_title": "The Mummy",
                "overview": "Dashing legionnaire Rick O'Connell stumbles upon the hidden ruins of Hamunaptra while in the midst of a battle to claim the area in 1920s Egypt. It has been over three thousand years since former High Priest Imhotep suffered a fate worse than death as a punishment for a forbidden love—along with a curse that guarantees eternal doom upon the world if he is ever awoken.",
                "popularity": 13.0535,
                "poster_path": "/yhIsVvcUm7QxzLfT6HW2wLf5ajY.jpg",
                "release_date": "1999-04-16",
                "title": "The Mummy",
                "video": false,
                "vote_average": 6.949,
                "vote_count": 9490,
                "character": "Isaac Henderson",
                "credit_id": "52fe4253c3a36847f80156d7",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/Ag6qhzsJd3k1NKuNrG9RmhZDMh7.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 640,
                "original_language": "en",
                "original_title": "Catch Me If You Can",
                "overview": "A true story about Frank Abagnale Jr. who, before his 19th birthday, successfully conned millions of dollars worth of checks as a Pan Am pilot, doctor, and legal prosecutor. An FBI agent makes it his mission to put him behind bars. But Frank not only eludes capture, he revels in the pursuit.",
                "popularity": 10.8642,
                "poster_path": "/ctjEj2xM32OvBXCq8zAdK3ZrsAj.jpg",
                "release_date": "2002-12-16",
                "title": "Catch Me If You Can",
                "video": false,
                "vote_average": 7.979,
                "vote_count": 16345,
                "character": "Pilot",
                "credit_id": "596bf3acc3a3684c2c006bb7",
                "order": 75
            },
            {
                "adult": false,
                "backdrop_path": "/syapU4X3vYBCdARyAOtz3g90hMt.jpg",
                "genre_ids": [
                    53,
                    18,
                    80
                ],
                "id": 1900,
                "original_language": "en",
                "original_title": "Traffic",
                "overview": "An exploration of the United States of America's war on drugs from multiple perspectives. For the new head of the Office of National Drug Control Policy, the war becomes personal when he discovers his well-educated daughter is abusing cocaine within their comfortable suburban home. In Mexico, a flawed, but noble policeman agrees to testify against a powerful general in league with a cartel, and in San Diego, a drug kingpin's sheltered trophy wife must learn her husband's ruthless business after he is arrested, endangering her luxurious lifestyle.",
                "popularity": 5.9685,
                "poster_path": "/v6YrfR1e2OUAYbXrJ7hv3EiGNcg.jpg",
                "release_date": "2000-12-27",
                "title": "Traffic",
                "video": false,
                "vote_average": 7.081,
                "vote_count": 2261,
                "character": "Lobbyist",
                "credit_id": "5f846edc39549a003561fdb6",
                "order": 65
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Stephen Dunham was born Stephen Dunham Bowers in Boston, Massachusetts on September 14, 1964 to Frederick Bowers and Sandra Dunham. He grew up in Manchester, New Hampshire. He was married to actress Alexondra Lee.\n\nDunham was perhaps best known for his role as Isaac Henderson in the hit 1999 film The Mummy. He had originally auditioned for the role of Rick O'Connell and was unsuccessful, however, director Stephen Sommers liked Dunham's acting enough to cast him as Henderson instead. Following this, he played Hunter Franklin on the short-lived sitcom Oh, Grow Up and Agent Edward Pillows in 17 episodes of DAG from 2000 to 2001.\n\nHe played the recurring role Peter in season 2 of What I Like About You and was also known for his role as Charlie Thorpe in Hot Properties. He acted in dozens of other television shows and major films. He appeared as Dr. Paul Chamberlain Monster-in-Law (2005), The Bill Engvall Show (2007), Chad on True Jackson, VP and had an appearance in Get Smart (2008).\n\nIn 2011, he appeared on Hot in Cleveland, playing an Amish bartender, and in 2012, before his death, he played his final role as Doug Nelson in Paranormal Activity 4 alongside his real life wife Alexondra Lee.\n\nHe suffered a heart attack and died on September 14, 2012, his 48th birthday, in Burbank, California.",
        "birthday": "1964-09-14",
        "deathday": "2012-09-14",
        "gender": 2,
        "homepage": null,
        "id": 36803,
        "imdb_id": "nm0242295",
        "known_for_department": "Acting",
        "name": "Stephen Dunham",
        "place_of_birth": "Boston, Massachusetts, USA",
        "popularity": 0.2839,
        "profile_path": "/6kBBjxl4QzHxHXXjvMi6BVbfLsf.jpg"
    }
}