{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kN8SMfKfca655F97pqRnWPmFAiZ.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 550231,
                "original_language": "en",
                "original_title": "The Secret: Dare to Dream",
                "overview": "A widow with three children hires a handyman to fix her house during a major storm. When not doing home repairs, he shares his philosophy of believing in the power of the universe to deliver what we want.",
                "popularity": 2.612,
                "poster_path": "/5mCqEeBA0MW7H6akFrFQXJu68rU.jpg",
                "release_date": "2020-04-16",
                "title": "The Secret: Dare to Dream",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 634,
                "character": "Pizza Guy",
                "credit_id": "64bdbdbce9da69014fec25fb",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Jeremy Warner is a passionate actor, producer and Chicago native. Ever since he visited Walt Disney Studios as a child and witnessed the filming of the Mickey Mouse Club, he has been captivated by the film and television industry. Jeremy's list of experiences and talents in the movie and television industry is impressive. He has acted in various films such as The Secret: Dare to Dream alongside Katie Holmes and Josh Lucas, Haunt Season and The Christmas Letter  featuring Chevy Chase.  He has also worked with renowned directors such as Andy Tennant ( Sweet Home Alabama & Hitch) and Kari Skogland (The Falcon and the Winter Soldier & The Handmaid's Tale).\n\nJeremy's personal philosophy regarding film and television work is simple: great stories need to be told, and he hopes to continue bringing those stories to the world.​",
        "birthday": null,
        "deathday": null,
        "gender": 0,
        "homepage": "http://www.jeremy-warner.com",
        "id": 3685970,
        "imdb_id": "nm10281120",
        "known_for_department": "Acting",
        "name": "Jeremy Warner",
        "place_of_birth": null,
        "popularity": 0.0404,
        "profile_path": "/2TG5w1tPJwl0Gd6S7wyYnxbBqmn.jpg"
    }
}