{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mgDv2dDihyetAcENxyf2tpXY245.jpg",
                "genre_ids": [
                    10402,
                    18
                ],
                "id": 1407,
                "original_language": "fr",
                "original_title": "La Môme",
                "overview": "From the mean streets of the Belleville district of Paris to the dazzling limelight of New York's most famous concert halls, Edith Piaf's life was a constant battle to sing and survive, to live and love. Raised in her grandmother's brothel, Piaf was discovered in 1935 by nightclub owner Louis Leplee, who persuaded her to sing despite her extreme nervousness. Piaf became one of France's immortal icons, her voice one of the indelible signatures of the 20th century.",
                "popularity": 2.9969,
                "poster_path": "/3b9DAONAsFRhJKu25R33PE3VwDh.jpg",
                "release_date": "2007-02-14",
                "title": "La Vie en Rose",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 1667,
                "character": "Lucien Roupp",
                "credit_id": "52fe42f4c3a36847f802f59d",
                "order": 28
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Dominique Paturel (3 April 1931 – 28 February 2022) was a French voice, stage and film actor.\n\nPaturel was born on 3 April 1931 in Le Havre and was educated at the Institution Saint-Joseph. He moved to Paris in 1951, and he graduated from the École de la rue Blanche.\n\nPaturel started his career at the Théâtre National Populaire in the 1950s. He subsequently acted at the Théâtre de l'Odéon. Meanwhile, he acted in films in the 1960s-1980s.\n\nPaturel dubbed J. R. Ewing in Dallas. He also dubbed Terence Hill, Omar Sharif and Anthony Hopkins.\n\nPaturel died in Saint-Brieuc on 28 February 2022, at the age of 90.\n\nSource: Article \"Dominique Paturel\" from Wikipedia in english, licensed under CC-BY-SA 3.0.",
        "birthday": "1931-04-03",
        "deathday": "2022-02-28",
        "gender": 2,
        "homepage": null,
        "id": 36948,
        "imdb_id": "nm0666664",
        "known_for_department": "Acting",
        "name": "Dominique Paturel",
        "place_of_birth": "Le Havre, Seine-Maritime, France",
        "popularity": 0.0815,
        "profile_path": "/yUISlEP7g7iOITXZ0PObpQCfHcv.jpg"
    }
}