{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7EazpcvoCfNZZysgljUAkQCBvW.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 614917,
                "original_language": "en",
                "original_title": "King Richard",
                "overview": "The story of how Richard Williams served as a coach to his daughters Venus and Serena, who will soon become two of the most legendary tennis players in history.",
                "popularity": 5.0956,
                "poster_path": "/2dfujXrxePtYJPiPHj1HkAFQvpu.jpg",
                "release_date": "2021-11-18",
                "title": "King Richard",
                "video": false,
                "vote_average": 7.622,
                "vote_count": 2673,
                "character": "OG",
                "credit_id": "669818bbed65ed1dfb71fd97",
                "order": 89
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Cerro De la Wade"
        ],
        "biography": "Gjee Wade II is an American Actor/ Stuntman, Member of the United States Navy and former K9/SWAT Team Member. As an Actor he has been apart of films released in Sweden, Mexico, U.S. and in the U.K.\n\nOff a dirt road, and formed out of the \"Muck\". Wade II brings a level of aggression & intensity to each of his characters. Known for his muscular frame, and extensive tattoos . Wade II has made a name for himself in the Industry. Primarily cast as the Villain, due to his cold eyes, muscular physique, and imposing presence. His characteristics are on full display- As Killer Joe Sanders in Fatal Attraction and as Drug Baron Charles \"Heavy\" Stokes in Evidence of Innocence. Wade II showed the world a different side when he appeared on \"Bert the Conqueror\" with Talented stand up Comedian/ Host Bert Kreischer. Who referred to Gjee Wade II as 'The Manliest Man in the World' after riding Rip-Ride-Rockit with him at Universal Studios in Orlando.\n\nWade II has been on National TV several times for Commercials -(Pelaton, EA Sports, Amazon, FL Lottery, Hershey's,) and Television- ( AMC, NBC, FOX, Netflix,Paramount+, BET, Travel Channel) and many more. After deciding to pursue acting with nothing but talent, determination and his quote \"If you got IT, it don't matter.\" Wade II appeared in several independent films and showed his acting skills in a variety of roles. He booked his first major role as Drug Lord Neil Rene on the show FBI: Criminal Pursuit \"Taken by Force.\" The show aired on May 13,2013 on Investigation Discovery (ID).",
        "birthday": "1985-05-23",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.imdb.com/name/nm5540978",
        "id": 3694948,
        "imdb_id": "nm5540978",
        "known_for_department": "Acting",
        "name": "Gjee Wade II",
        "place_of_birth": "Gainesville, Florida, USA",
        "popularity": 0.3364,
        "profile_path": "/taFF6rTDUrcuh9RE3tvSHpxbUw2.jpg"
    }
}