{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cn1AjfcI8B2CxekvYYZWkLf5muE.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 1259,
                "original_language": "en",
                "original_title": "Notes on a Scandal",
                "overview": "A veteran high school teacher befriends a younger art teacher, who is having an affair with one of her 15-year-old students. However, her intentions with this new \"friend\" also go well beyond platonic friendship.",
                "popularity": 4.3311,
                "poster_path": "/ieX6ZO2Kf2qjoIBXbQW5awivbhY.jpg",
                "release_date": "2006-12-25",
                "title": "Notes on a Scandal",
                "video": false,
                "vote_average": 7.098,
                "vote_count": 934,
                "character": "Steven Connolly",
                "credit_id": "52fe42ebc3a36847f802cc71",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Andrew Gerard Simpson"
        ],
        "biography": "Andrew Simpson attended the Foyle School of Speech and Drama, and was taught by Sandra Biddle in his home city of Derry in Northern Ireland.  Andrew's mum and dad are Marion and Paddy and he has two older sisters, Charlotte and Sarah and a younger brother, Patrick, all of whom have also attended Miss Biddle's excellent training school for drama. Andrew performed in feis (festivals) and was spotted when introduced by agent and talent-spotter Patrick Duncan to Aisling Walsh, director of Song for a Raggy Boy (2003). Played Gerard Peters in this brilliant but brutal Irish reform school story, and younger brother Sean was played by Shankill Road,  Belfast, boy Michael Sloan; Aidan Quinn and Iain Glen starred. He has played in the Millenium Forum, Derry, in Packy's Wake,  and attended Centre Stage Drama holidays in Parkanaur, Northern Ireland, 2 years in a row. Andrew also helped develop Cadanza at Moonstone (2004) and he has appeared in adverts for the PSNI and Invest NI. Cast  opposite Cate Blanchett, Judi Dench and Bill Nighy in the Richard Eyre-directed Notes on a Scandal (2006), adapted by Patrick Marber (Closer (2004/I)) from Zoe Heller's book. Plays Steven Connolly, an Irish immigrant boy who attends the school where Cate and Judi's characters teach.",
        "birthday": "1989-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 37049,
        "imdb_id": "nm1587166",
        "known_for_department": "Acting",
        "name": "Andrew Simpson",
        "place_of_birth": "Londonderry, Northern Ireland, UK ",
        "popularity": 0.2446,
        "profile_path": "/iROb6Oq5D1r0OMbP8TfgAbjCTTP.jpg"
    }
}