{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cn1AjfcI8B2CxekvYYZWkLf5muE.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 1259,
                "original_language": "en",
                "original_title": "Notes on a Scandal",
                "overview": "A veteran high school teacher befriends a younger art teacher, who is having an affair with one of her 15-year-old students. However, her intentions with this new \"friend\" also go well beyond platonic friendship.",
                "popularity": 4.3311,
                "poster_path": "/ieX6ZO2Kf2qjoIBXbQW5awivbhY.jpg",
                "release_date": "2006-12-25",
                "title": "Notes on a Scandal",
                "video": false,
                "vote_average": 7.098,
                "vote_count": 934,
                "character": "Linda",
                "credit_id": "52fe42ebc3a36847f802cc81",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nEmma Kennedy (born Elizabeth Emma Williams 28 May 1967, Corby, Northamptonshire) is an English television presenter, actress and writer.\n\nShe was educated at Hitchin Girls' School and St Edmund Hall, University of Oxford. At Oxford in 1987, she worked with (among others) Richard Herring and Stewart Lee in comedy troupes the Seven Raymonds and The Oxford Revue. She used to present The Real Holiday Show on Channel 4. She has since made appearances in TV comedies Goodness Gracious Me, This Morning With Richard Not Judy (again with Lee and Herring), Jonathan Creek alongside Alan Davies and Caroline Quentin, People Like Us (with Chris Langham) and hit BBC comedy The Smoking Room, along with appearing in several of The Mark Steel Lectures, as well as in several plays and radio shows. She was also a movie reviewer on Five's Terry and Gaby Show. In addition to this, she has made several appearances on Big Brother's Little Brother.\n\nKennedy has written for radio, television and the theatre. She provided voices for The Comic Side of 7 Days and was a regular on the BBC Radio 2 comedy That Was Then, This Is Now with Richard Herring. She appeared in the movie Notes on a Scandal and also appears in the Five series Suburban Shootout and Suburban Shootout 2: Clackers at Dawn. She now appears as a regular on the popular podcast As It Occurs To Me.\n\nHer first book How To Bring Up Your Parents was published in August 2007. It is loosely based on her blog. Her second book, The Tent, The Bucket and Me is based on her childhood camping experiences and was published in April 2009. Her first children's book, Wilma Tenderfoot and the Case of the Frozen Hearts was released in July 2009. Her second children's book, Wilma Tenderfoot and the Case of the Putrid Poison was released in July 2010. The third book in the series Wilma Tenderfoot and the Case of the Fatal Phantom is due for release in November 2010 and the follow-up to The Tent, The Bucket and Me - provisionally entitled I Left My Tent In San Francisco - was released in May 2011. Emma announced on Twitter in July 2009 that she has been signed up to write a further three books.\n\nDescription above from the Wikipedia article Emma Kennedy, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1967-05-28",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.emmakennedy.co.uk/",
        "id": 37050,
        "imdb_id": "nm0448021",
        "known_for_department": "Acting",
        "name": "Emma Kennedy",
        "place_of_birth": "Corby, Northamptonshire, England, UK",
        "popularity": 0.6011,
        "profile_path": "/6JixkSF7i2zOobnC1zne0WIEK1k.jpg"
    }
}