{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/93iDrZmjDF01Tn3PxOYL8Zz9hBM.jpg",
                "genre_ids": [
                    80,
                    53
                ],
                "id": 11657,
                "original_language": "fr",
                "original_title": "Le Cercle rouge",
                "overview": "When French criminal Corey gets released from prison, he resolves to never return. He is quickly pulled back into the underworld, however, after a chance encounter with escaped murderer Vogel. Along with former policeman and current alcoholic Jansen, they plot an intricate jewel heist. All the while, quirky Police Commissioner Mattei, who was the one to lose custody of Vogel, is determined to find him.",
                "popularity": 1.5694,
                "poster_path": "/w56La43IJnGpLepgqfGCAZsbQPp.jpg",
                "release_date": "1970-10-19",
                "title": "Le Cercle Rouge",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 679,
                "character": "Commissioner François Mattei",
                "credit_id": "52fe44729251416c750350e7",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/bodTQ7K68AopK2uQumsrSVT9g4A.jpg",
                "genre_ids": [
                    35,
                    10752
                ],
                "id": 8290,
                "original_language": "fr",
                "original_title": "La Grande Vadrouille",
                "overview": "During World War II, two French civilians and a downed British Bomber Crew set out from Paris to cross the demarcation line between Nazi-occupied Northern France and the South. From there they will be able to escape to England. First, they must avoid German troops – and the consequences of their own blunders.",
                "popularity": 2.3452,
                "poster_path": "/91l4Sf3WJwrb0tSVPsOqnBXG8E6.jpg",
                "release_date": "1966-12-08",
                "title": "Don't Look Now... We're Being Shot At!",
                "video": false,
                "vote_average": 7.934,
                "vote_count": 1402,
                "character": "Augustin Bouvet, house painter",
                "credit_id": "52fe449dc3a36847f80a0293",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/aDi4GqSYi4pcTvS7A9AuXLuhUVQ.jpg",
                "genre_ids": [
                    35,
                    80
                ],
                "id": 25866,
                "original_language": "fr",
                "original_title": "Le Corniaud",
                "overview": "In this Franco-Italian gangster parody, a shopkeeper on his way to an Italian holiday suffers a crash that totals his car. The culprit can only compensate his ruined trip by driving an American friend's car from Naples to Bordeaux, but as it happens to be filled with such contraband as stolen money, jewelry and drugs, the involuntary and unwitting companions in crime soon attract all but recreational attention from the \"milieu\".",
                "popularity": 2.5445,
                "poster_path": "/kGFE3U01sMApp5Q7h0akEvdTwPK.jpg",
                "release_date": "1965-03-24",
                "title": "The Sucker",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 674,
                "character": "Antoine Maréchal",
                "credit_id": "52fe44e0c3a368484e03c099",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/1yWn9A2LN0uRGudIg0bV2Np6T69.jpg",
                "genre_ids": [
                    10752,
                    28,
                    18
                ],
                "id": 9289,
                "original_language": "en",
                "original_title": "The Longest Day",
                "overview": "The retelling of June 6, 1944, from the perspectives of the Germans, US, British, Canadians, and the Free French. Marshall Erwin Rommel, touring the defenses being established as part of the Reich's Atlantic Wall, notes to his officers that when the Allied invasion comes they must be stopped on the beach. \"For the Allies as well as the Germans, it will be the longest day\"",
                "popularity": 3.7565,
                "poster_path": "/5zmvEofdIlgXrQl9A7e5IOzlnFU.jpg",
                "release_date": "1962-09-25",
                "title": "The Longest Day",
                "video": false,
                "vote_average": 7.594,
                "vote_count": 977,
                "character": "Mayor of Colleville",
                "credit_id": "52fe44e2c3a36847f80afc9f",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "André Zacharie Raimbourg",
            "André Bourvil",
            "André Robert Raimbourg",
            "Бурвиль"
        ],
        "biography": "André Robert Raimbourg (27 July 1917 – 23 September 1970), better known as André Bourvil, and mononymously as Bourvil, was a French actor and singer best known for his roles in comedy films, most notably in his collaboration with Louis de Funès in the films Le Corniaud (1965) and La Grande Vadrouille (1966). For his performance in Le Corniaud, he won a Special Diploma at the 4th Moscow International Film Festival.\n\nBourvil's father was killed in the First World War before he was born. As a result, he spent his entire childhood in the village of Bourville, from which he took his stage name. He married Jeanne Lefrique on 23 January 1943. After a battle with Kahler's syndrome, which attacks the bone marrow, he died at the age of 53. He is buried in Montainville, Yvelines.\n\nIn his comic performances Bourvil principally played roles of gentle and well-meaning characters who were often a bit obtuse or naïve, such as his roles opposite the hyperactive, dishonest and bossy ones played by Louis de Funès. Bourvil's characters not only managed to make viewers laugh, but also to save themselves, often unwittingly, from the Machiavellian designs of his adversaries.\n\nBourvil was, however, also capable of more dramatic roles such as the handyman in L'Arbre de Noël (1969). In this role he observes the relationship between a man he works for and the young son who has fallen ill. The audience can identify with the character played by Bourvil, just as they can in his comic roles, so often as a simple man. One can also note his role of Monsieur Thénardier in the film adaptation of Les Misérables (1958), and his penultimate role as the policeman Mattei in Jean-Pierre Melville's Le Cercle rouge (1970).\n\nIn March 1948, Bourvil took part in the complete recording of Offenbach's The Tales of Hoffmann with artists of the Paris Opéra-Comique conducted by André Cluytens, playing the four 'servant' roles.\n\nDescription above from the Wikipedia article Bourvil, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1917-07-27",
        "deathday": "1970-09-23",
        "gender": 2,
        "homepage": null,
        "id": 37131,
        "imdb_id": "nm0100186",
        "known_for_department": "Acting",
        "name": "Bourvil",
        "place_of_birth": "Prétot-Vicquemare, Seine-Inférieure [now Seine-Maritime], France",
        "popularity": 0.4988,
        "profile_path": "/h9eYqmgnBhRoccnTFKo0Y05dI8b.jpg"
    }
}