{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/r8J1GUYKfNFQhpg3dMhXwtmr6PL.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 4441,
                "original_language": "en",
                "original_title": "Candy",
                "overview": "A poet falls in love with an art student, who gravitates to his bohemian lifestyle — and his love of heroin. Hooked as much on one another as they are on the drug, their relationship alternates between states of oblivion, self-destruction, and despair.",
                "popularity": 1.6999,
                "poster_path": "/9DvrEg2p3Hrdr1uGe0t7kRraWjl.jpg",
                "release_date": "2006-05-25",
                "title": "Candy",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 617,
                "character": "Phillip Dudley (uncredited)",
                "credit_id": "52fe43c1c3a36847f806d4d1",
                "order": 31
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Paul Blackwell was a well-known Australian stage actor and occasional film actor. He attended the National Institute of Dramatic Arts from 1980 to 1982 and has appeared in many productions from some of Australia's best-known theatre companies, including Company B, Sydney Theatre Company, State Theatre Company of South Australia, Patch Theatre and Opera Australia. He has appeared in several films, though often in small parts. His only major film role was the 1996 film The Quiet Room directed by Rolf De Heer; it was critically acclaimed and was screened as part of the main competition of the 1996 Cannes Film Festival. His recent film appearances include Candy, directed by Neil Armfield and starring Heath Ledger, Geoffrey Rush and Abbie Cornish; December Boys, starring Daniel Radcliffe; Hey Hey its Esther Blueburger and the silent film Dr. Plonk, another collaboration with Rolf De Heer. ",
        "birthday": "1954-07-11",
        "deathday": "2019-02-24",
        "gender": 2,
        "homepage": null,
        "id": 37293,
        "imdb_id": "nm5245729",
        "known_for_department": "Acting",
        "name": "Paul Blackwell",
        "place_of_birth": "Adelaide, South Australia",
        "popularity": 1.4624,
        "profile_path": "/j8vqzi6rCUQdJkmny4SeBKIeGg8.jpg"
    }
}