{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uxjPyKutAtw7lHZ3mHg0MzQvAK9.jpg",
                "genre_ids": [
                    9648,
                    18,
                    53
                ],
                "id": 10403,
                "original_language": "en",
                "original_title": "The Player",
                "overview": "A Hollywood studio executive is being sent death threats by a writer whose script he rejected - but which one?",
                "popularity": 3.7047,
                "poster_path": "/tZ3kDut2dhFVGkWNEn9xoCHCNAx.jpg",
                "release_date": "1992-05-08",
                "title": "The Player",
                "video": false,
                "vote_average": 7.21,
                "vote_count": 881,
                "character": "Annie Ross",
                "credit_id": "52fe43689251416c7500f32b",
                "order": 83
            },
            {
                "adult": false,
                "backdrop_path": "/j44XhCxpLTi8WnrX52H83Z86ovG.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 695,
                "original_language": "en",
                "original_title": "Short Cuts",
                "overview": "Many loosely connected characters cross paths in this film, based on the stories of Raymond Carver. Waitress Doreen Piggot accidentally runs into a boy with her car. Soon after walking away, the child lapses into a coma. While at the hospital, the boy's grandfather tells his son, Howard, about his past affairs. Meanwhile, a baker starts harassing the family when they fail to pick up the boy's birthday cake.",
                "popularity": 7.2163,
                "poster_path": "/mbNTvbtWfV4soyErimDTdX67OAr.jpg",
                "release_date": "1993-10-01",
                "title": "Short Cuts",
                "video": false,
                "vote_average": 7.216,
                "vote_count": 637,
                "character": "Tess Trainer",
                "credit_id": "5a80005dc3a36818cd018619",
                "order": 32
            },
            {
                "adult": false,
                "backdrop_path": "/hfAChqTPPEOkvP6YDdFMaZFLZUg.jpg",
                "genre_ids": [
                    27
                ],
                "id": 16307,
                "original_language": "en",
                "original_title": "The Wicker Man",
                "overview": "Police sergeant Neil Howie is called to an island village in search of a missing girl whom the locals claim never existed. Stranger still, however, are the rituals that take place there.",
                "popularity": 3.2685,
                "poster_path": "/wwtrXRL8SiOWxhwLEvw7iBgYh0g.jpg",
                "release_date": "1973-12-06",
                "title": "The Wicker Man",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1517,
                "character": "Willow MacGreagor (voice) (uncredited)",
                "credit_id": "5f188e52db952d00349537d5",
                "order": 44
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Annabella Logan",
            "Annabelle Logan"
        ],
        "biography": "Annabelle McCauley Allan Short (25 July 1930 – 21 July 2020), known professionally as Annie Ross, was a British-American singer and actress, best known as a member of the jazz vocal trio Lambert, Hendricks & Ross.\n\nRoss was born in Surrey, England, the daughter of Scottish vaudevillians John \"Jack\" Short and Mary Dalziel Short (née Allan). Her brother was Scottish entertainer and theatre producer and director Jimmy Logan. She first appeared on stage at age three. At the age of four, she travelled to New York by ship with her family; she later recalled that they \"got the cheapest ticket, which was right in the bowels of the ship\".\n\nShortly after arriving in the city, she won a token contract with MGM through a children's radio contest run by Paul Whiteman. She subsequently moved with her aunt, Scottish-American singer and actress Ella Logan, to Los Angeles, and her mother, father and brother returned to Scotland. She did not see her parents again until fourteen years later. At the age of seven, she sang \"The Bonnie Banks o' Loch Lomond\" in Our Gang Follies of 1938, and played Judy Garland's character's sister in Presenting Lily Mars (1943).\n\nHer adulthood film roles included Liza in the film Straight On till Morning (1972), Claire in Alfie Darling (1976), Diana Sharman in Funny Money (1983), Vera Webster in Superman III (1983), Mrs. Hazeltine in Throw Momma from the Train (1987), Rose Brooks in Witchery (1988), Loretta Cresswood in Pump Up the Volume (1990), Tess Trainer in Robert Altman's Short Cuts (1993), and Lydia in Blue Sky (1994). She also appeared as Granny Ruth in the horror films Basket Case 2 (1990) and Basket Case 3: The Progeny (1991). She also had a bit part in Robert Altman's The Player in 1992. Ross also starred in Scottish Television's comedy-drama Charles Endell Esquire (1979).\n\nShe provided the speaking voice for Britt Ekland in The Wicker Man (1973), and Ingrid Thulin's singing voice in Salon Kitty (1976). On stage, she appeared in Cranks (1955; London and New York City), The Threepenny Opera (1972), The Seven Deadly Sins (1973) at the Royal Opera House, Kennedy's Children (1975) at Arts Theatre, London, Side by Side by Sondheim, and in the Joe Papp production of The Pirates of Penzance (1982).\n\nRoss died in New York City on 21 July 2020 from emphysema and heart disease, four days before her 90th birthday.\n\nDescription above from the Wikipedia article Annie Ross, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1930-07-26",
        "deathday": "2020-07-21",
        "gender": 1,
        "homepage": "http://home.earthlink.net/%7Etardo/annie.html",
        "id": 37368,
        "imdb_id": "nm0517506",
        "known_for_department": "Acting",
        "name": "Annie Ross",
        "place_of_birth": "Mitcham, Surrey, England, UK",
        "popularity": 0.1258,
        "profile_path": "/y2rMACd935o8jieNxoOqxpDxhb1.jpg"
    }
}