{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hCJFWTPghXCwwSpvPpAoIB8318Q.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 453,
                "original_language": "en",
                "original_title": "A Beautiful Mind",
                "overview": "From the heights of notoriety to the depths of depravity, John Forbes Nash Jr. experiences it all. As a brilliant but socially awkward mathematician, he made a groundbreaking discovery early in his career and stands on the brink of international acclaim. But as the handsome and arrogant Nash accepts secret work in cryptography, he becomes entangled in a mysterious conspiracy. His life takes a nightmarish turn and he soon finds himself on a painful and harrowing journey of self-discovery.",
                "popularity": 9.9383,
                "poster_path": "/rEIg5yJdNOt9fmX4P8gU9LeNoTQ.jpg",
                "release_date": "2001-12-14",
                "title": "A Beautiful Mind",
                "video": false,
                "vote_average": 7.856,
                "vote_count": 10625,
                "character": "Technician",
                "credit_id": "67e5279da6dd9b0808003f27",
                "order": 53
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "A South African born New Yorker with over three decades of versatile, award winning performances in popular, world-wide theatrically released studio & independent films, prime-time & cable television & New York theater. After small speaking roles opposite Russell Crowe in Ron Howard's A Beautiful Mind (2001) & David Chase's The Sopranos (1999) as Gaetano; his breakthrough lead role came in 2005 on Law & Order: Special Victims Unit (1999) directed by Oscar winner Juan José Campanella. Starring opposite Mariska Hargitay, Chris Meloni, & Bradley Cooper as the chilling yet engaging fundamentalist Milan Zergin. Also, a coveted recurring role on Ugly Betty (2006), becoming South Africa's first male SAG Award Nominee (Ensemble Comedy Performance). Followed by significant supporting roles in the studio films My Super Ex-Girlfriend (2006) opposite Eddie Izzard, Luke Wilson, & Uma Thurman directed by Ivan Reitman for Twentieth Century Fox . An ensemble lead in Sony's Starship Troopers 3: Marauder (2008) produced by David Lancaster, a supporting role in Pure Flix's What If... (2010), & supporting lead in the Lionsgate family film Army Dog (2016) .",
        "birthday": "1970-04-24",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 37403,
        "imdb_id": "nm0767445",
        "known_for_department": "Acting",
        "name": "Stelio Savante",
        "place_of_birth": "Cape Town, South Africa",
        "popularity": 0.2063,
        "profile_path": "/8c7Zzo91E4Jy8yWIgtwGvgdN4Si.jpg"
    }
}