{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fDZ2DCKW2D7J0ABNr9EICdD2H1s.jpg",
                "genre_ids": [
                    12,
                    16,
                    10751,
                    10749
                ],
                "id": 10530,
                "original_language": "en",
                "original_title": "Pocahontas",
                "overview": "Pocahontas, daughter of a Native American tribe chief, falls in love with an English soldier as colonists invade 17th century Virginia.",
                "popularity": 6.8771,
                "poster_path": "/kZ1ft0QZ4e3zDUPMBftEkwI9ftd.jpg",
                "release_date": "1995-06-16",
                "title": "Pocahontas",
                "video": false,
                "vote_average": 6.912,
                "vote_count": 5875,
                "character": "Kekata (voice)",
                "credit_id": "52fe43819251416c750130c9",
                "order": 14
            },
            {
                "adult": false,
                "backdrop_path": "/fOfcbdBQBCO4Y2hy6DfLbb30klU.jpg",
                "genre_ids": [
                    18,
                    37,
                    10749,
                    10752,
                    28
                ],
                "id": 4476,
                "original_language": "en",
                "original_title": "Legends of the Fall",
                "overview": "In early 20th-century Montana, Col. William Ludlow lives on a ranch in the wilderness with his sons, Alfred, Tristan, and Samuel. Eventually, the unconventional but close-knit family are bound by loyalty, tested by war, and torn apart by love, as told over the course of several decades in this epic saga.",
                "popularity": 6.9321,
                "poster_path": "/t1KPGlW0UGd0m515LPQmk2F4nu1.jpg",
                "release_date": "1994-12-23",
                "title": "Legends of the Fall",
                "video": false,
                "vote_average": 7.393,
                "vote_count": 2716,
                "character": "One Stab",
                "credit_id": "52fe43c4c3a36847f806e225",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia.  Gordon Tootoosis, CM (October 25, 1941 – July 5, 2011) was a First Nations actor of Cree and Stoney descent. Tootoosis was a descendant of Yellow Mud Blanket, brother of the famous Cree leader Pîhtokahanapiwiyin. He was acclaimed for his commitment to preserving his culture and to telling his people's stories. He once said, \"Leadership is about submission to duty, not elevation to power.\" He served as a founding member of the board of directors of the Saskatchewan Native Theatre Company. Tootoosis offered encouragement, support and training to aspiring Aboriginal actors. He served as a leading Cree activist both as a social worker and as a band chief. In Open Season and Boog and Elliot's Midnight Bun Run, Tootoosis was the voice of Sheriff Gordy.\n\nHe was awarded membership in the Order of Canada on October 29, 2004. The investiture ceremony took place on September 9, 2005. His citation recognizes him as an inspirational role model for Aboriginal youth. It notes that as a veteran actor, he portrayed memorable characters in movie and television productions in Canada and the United States.  Gordon Tootoosis first acting role was in the film Alien Thunder (1974), with Chief Dan George and Donald Sutherland.  He portrayed Albert Golo in 52 episodes of North of 60 in the 1990s. He is best known to British audiences for playing the Native American Joe Saugus, who negotiates the purchase of the Middlesbrough Transporter Bridge in Auf Wiedersehen, Pet series 3 (2002). Gordon appeared in the CBC Television mini-series By Way of the Stars with Eric Schweig as Black Thunder and Tantoo Cardinal as Franoise.  He appeared in the award-winning movie Legends of the Fall (1994), and starred with Russell Means in Disney's Pocahontas (1995) and Song of Hiawatha (1997). In 1999, he and Tantoo Cardinal became founding members of the board of directors of the Saskatchewan Native Theatre Company. In 2011, he appeared in Gordon Winter at the Persephone Theatre in Saskatoon and Prairie Scene in Ottawa, his first stage role in 15 years.\n\nTootoosis won a Gemini Award for his work on the animated show Wapos Bay: The Series and was nominated twice for his work on North of 60.",
        "birthday": "1941-10-25",
        "deathday": "2011-07-05",
        "gender": 2,
        "homepage": null,
        "id": 37430,
        "imdb_id": "nm0867588",
        "known_for_department": "Acting",
        "name": "Gordon Tootoosis",
        "place_of_birth": "Poundmaker Reserve, Saskatchewan, Canada",
        "popularity": 0.2869,
        "profile_path": "/ls9gOUs7nSZyutuL5MULC1PZftN.jpg"
    }
}