{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fOfcbdBQBCO4Y2hy6DfLbb30klU.jpg",
                "genre_ids": [
                    18,
                    37,
                    10749,
                    10752,
                    28
                ],
                "id": 4476,
                "original_language": "en",
                "original_title": "Legends of the Fall",
                "overview": "In early 20th-century Montana, Col. William Ludlow lives on a ranch in the wilderness with his sons, Alfred, Tristan, and Samuel. Eventually, the unconventional but close-knit family are bound by loyalty, tested by war, and torn apart by love, as told over the course of several decades in this epic saga.",
                "popularity": 6.4016,
                "poster_path": "/t1KPGlW0UGd0m515LPQmk2F4nu1.jpg",
                "release_date": "1994-12-23",
                "title": "Legends of the Fall",
                "video": false,
                "vote_average": 7.393,
                "vote_count": 2716,
                "character": "James O'Banion",
                "credit_id": "52fe43c4c3a36847f806e229",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            " John Novack "
        ],
        "biography": "John Novak (born September 9, 1955 in Caracas, Venezuela) is an actor and anime voice actor who frequently does voice work for the Ocean Group based in Vancouver, Canada. He has also starred in the Wishmaster sequels Wishmaster 3: Beyond The Gates Of Hell, and Wishmaster; The Prophecy Fulfilled replacing Andrew Divoff as The Djinn. He appeared twice in the TV series Sliders as a shyster lawyer, Ross J. Kelly. He most recently starred as the Sheriff in Bloodrayne 2: Deliverance. Novak is probably best known, in Canada at least, from Kokanee beer commercials, as he plays the Park Ranger who is constantly trying to prevent the Kokanee Sasquatch from stealing the beer.\n\nDescription above from the Wikipedia article John Novak, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1955-09-09",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 37431,
        "imdb_id": "nm0636868",
        "known_for_department": "Acting",
        "name": "John Novak",
        "place_of_birth": "Caracas, Venezuela",
        "popularity": 0.5985,
        "profile_path": "/xh8EyWCDggvZkyAlNGsTvH6KarE.jpg"
    }
}