{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/538U9snNc2fpnOmYXAPUh3zn31H.jpg",
                "genre_ids": [
                    28,
                    12,
                    53
                ],
                "id": 575265,
                "original_language": "en",
                "original_title": "Mission: Impossible - The Final Reckoning",
                "overview": "Ethan Hunt and team continue their search for the terrifying AI known as the Entity — which has infiltrated intelligence networks all over the globe — with the world's governments and a mysterious ghost from Hunt's past on their trail. Joined by new allies and armed with the means to shut the Entity down for good, Hunt is in a race against time to prevent the world as we know it from changing forever.",
                "popularity": 174.6469,
                "poster_path": "/z53D72EAOxGRqdr7KXXWp9dJiDe.jpg",
                "release_date": "2025-05-17",
                "title": "Mission: Impossible - The Final Reckoning",
                "video": false,
                "vote_average": 7.286,
                "vote_count": 1767,
                "character": "Gabriel's Henchman",
                "credit_id": "682e21f47f67ac825a2f16c8",
                "order": 76
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "René Vrábel, a force to be reckoned with, blurs the lines between actor a stun man, bringing a fresh and dynamic perspective to physically demanding roles. His journey began in the realm of medicine, but the magnetic pull of the stage proved too strong to resist, prompting him to abandon his studies and pursue his true passion.\n\nThe spotlight found René through his electrifying portrayal of a Muay Thai fighter and bodyguard in the groundbreaking TV series \"Specialiste.\" His undeniable talent didn't stop there; he skyrocketed to fame as the enigmatic mercenary Duval in the adrenaline-fueled thriller \"The Peripheral,\" starring alongside the indomitable Chloë Grace Moretz.\n\nRené's prowess as a performer is a testament to his extraordinary physical skills and athleticism. With a diverse background encompassing Muay Thai, break dancing, and a multitude of sports, he consistently pushes the boundaries of what is conceivable on the silver screen. Adept in the art of firearms, he fearlessly tackles an array of challenging and action-packed roles, leaving audiences captivated.\n\nBut René is not content with limiting his talents to acting and fitness alone; he embarks on a parallel journey as a skilled writer, nurturing his creative and artistic spirit through dedicated studies at the prestigious LAMDA in London. There, he refines his skills, broadens his horizons, and explores new depths of storytelling under the guidance of luminous mentors and abundant resources.\n\nUnyielding in his pursuit of excellence, René Vrábel embodies the essence of dedication and unbridled passion. Each project he undertakes is infused with boundless energy, intensity, and an unwavering commitment to authenticity. Whether he's embodying a martial artist, a valiant soldier, or any other physically demanding character, René ignites the screen with an electrifying presence that leaves audiences breathless.\n\nWith his unique background, extraordinary skill set, and an insatiable love for his craft, René Vrábel is poised to continue his ascent to greatness. Prepare to witness the rise of a true artistic force, as this magnetic talent surges forward, leaving an indelible mark on the cinematic landscape for years to come.",
        "birthday": "1992-04-22",
        "deathday": null,
        "gender": 2,
        "homepage": "https://actorsmap.cz/actor/rene-vrabel",
        "id": 3750511,
        "imdb_id": "nm14113362",
        "known_for_department": "Acting",
        "name": "Rene Vrabel",
        "place_of_birth": "Prague, Czechoslovakia [now Czech Republic]",
        "popularity": 0.0535,
        "profile_path": "/AlPtP5PoPJSNibx2qTSpoW76u11.jpg"
    }
}