{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lITyO4KDUIg7AujFKC3uCZMMskz.jpg",
                "genre_ids": [
                    28,
                    18,
                    53
                ],
                "id": 9509,
                "original_language": "en",
                "original_title": "Man on Fire",
                "overview": "Jaded ex-CIA operative John Creasy reluctantly accepts a job as the bodyguard for a 10-year-old girl in Mexico City. They clash at first, but eventually bond, and when she's kidnapped he's consumed by fury and will stop at nothing to save her life.",
                "popularity": 7.4771,
                "poster_path": "/grCGLCcTHv9TChibzOwzUpykcjB.jpg",
                "release_date": "2004-04-23",
                "title": "Man on Fire",
                "video": false,
                "vote_average": 7.457,
                "vote_count": 5358,
                "character": "Miguel Manzano",
                "credit_id": "52fe4501c3a36847f80b6f37",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/82rQV94v0zcAbtc3WuWlhyvqLy5.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 9560,
                "original_language": "en",
                "original_title": "A Walk in the Clouds",
                "overview": "World War II vet Paul Sutton falls for a pregnant and unwed woman who persuades him -- during their first encounter -- to pose as her husband so she can face her family.",
                "popularity": 4.3048,
                "poster_path": "/xencQzZnUWDRAOUydjf9PWet8Ae.jpg",
                "release_date": "1995-05-27",
                "title": "A Walk in the Clouds",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 1077,
                "character": "Alberto Aragón",
                "credit_id": "52fe450ac3a36847f80b8b6b",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/c2gcLDxniE0lNmT2a7CcQVuW6En.jpg",
                "genre_ids": [
                    12,
                    28,
                    53
                ],
                "id": 36557,
                "original_language": "en",
                "original_title": "Casino Royale",
                "overview": "Le Chiffre, a banker to the world's terrorists, is scheduled to participate in a high-stakes poker game in Montenegro, where he intends to use his winnings to establish his financial grip on the terrorist market. M sends Bond—on his maiden mission as a 00 Agent—to attend this game and prevent Le Chiffre from winning. With the help of Vesper Lynd and Felix Leiter, Bond enters the most important poker game in his already dangerous career.",
                "popularity": 16.5461,
                "poster_path": "/lMrxYKKhd4lqRzwUHAy5gcx9PSO.jpg",
                "release_date": "2006-11-14",
                "title": "Casino Royale",
                "video": false,
                "vote_average": 7.564,
                "vote_count": 11146,
                "character": "Mathis",
                "credit_id": "52fe45f29251416c91043e7b",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "John Charlie Johns",
            "جانکارلو جانینی"
        ],
        "biography": "Giancarlo Giannini (born 1 August 1942) is an Italian actor and dubber.\n\nGiannini was born La Spezia, Liguria, Italy. He studied at the Accademia Nazionale d'Arte Drammatica in Rome, and made his film debut in a small part in Fango sulla metropoli in 1965. He appeared in supporting roles in Anzio and The Secret of Santa Vittoria, and starred in the original version of Swept Away. In 1971, he appeared in E le stelle stanno a guardare, a television adaptation of A. J. Cronin's novel, The Stars Look Down.\n\nIn 1976, he starred in Seven Beauties, for which he was nominated for the Academy Award for Best Actor, which is unusual in that his performance was given entirely in Italian. He dubbed Jack Nicholson's voice in the Italian release of both The Shining and Batman; he is the official Italian dubber of Al Pacino. His fluency in English has brought him a number of featured roles in Hollywood productions, most notably as Inspector Pazzi in Hannibal. He has also appeared in A Walk in the Clouds and Man on Fire.\n\nGiannini's best-known starring roles have been in films directed by Lina Wertmuller. In addition to Swept Away and Seven Beauties, he also appeared in The Seduction of Mimi, Love and Anarchy, A Night Full of Rain, and Francesca e Nunziata.\n\nHe played the role of the protective father, Alberto Aragón, in A Walk in the Clouds in 1995. He played the Padishah Emperor Shaddam IV in the 2000 Dune miniseries. In 2002, he starred in the horror film Darkness.\n\nPerhaps his best-known recent role is as French agent René Mathis in the 21st and 22nd James Bond films, Casino Royale and the sequel, Quantum of Solace.\n\nGiannini has a son, Adriano Giannini, who is also an actor and dubber.\n\nDescription above from the Wikipedia article Giancarlo Giannini, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1942-08-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 3753,
        "imdb_id": "nm0316284",
        "known_for_department": "Acting",
        "name": "Giancarlo Giannini",
        "place_of_birth": "La Spezia, Liguria, Italy",
        "popularity": 0.7287,
        "profile_path": "/xsnoThKUjFlhmvXKS4ZqAx1x3zb.jpg"
    }
}