{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/y9N5tFCxCi2AIedOhU3OrVMfL2d.jpg",
                "genre_ids": [
                    18
                ],
                "id": 108,
                "original_language": "fr",
                "original_title": "Trois couleurs : Bleu",
                "overview": "The wife of a famous composer survives a car accident that kills her husband and daughter. Now alone, she shakes off her old identity and explores her newfound freedom but finds that she is unbreakably bound to other humans, including her husband’s mistress, whose existence she never suspected.",
                "popularity": 3.7769,
                "poster_path": "/33wsWxzsNstI8N7dvuwzFmj1qBd.jpg",
                "release_date": "1993-09-08",
                "title": "Three Colors: Blue",
                "video": false,
                "vote_average": 7.653,
                "vote_count": 1777,
                "character": "Barrister at the Court of Justice (uncredited)",
                "credit_id": "5b86e52a92514149f901171a",
                "order": 28
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/46GikxYW84dRh71sWVY0eRQiHLX.jpg",
                "genre_ids": [
                    27,
                    18
                ],
                "id": 393519,
                "original_language": "fr",
                "original_title": "Grave",
                "overview": "In Justine’s family everyone is a vet and a vegetarian. At 16, she’s a gifted teen ready to take on her first year in vet school, where her older sister also studies. There, she gets no time to settle: hazing starts right away. Justine is forced to eat raw meat for the first time in her life. Unexpected consequences emerge as her true self begins to form.",
                "popularity": 5.1096,
                "poster_path": "/kc8jT1MAiKM0iwdjAwC5lQrTNry.jpg",
                "release_date": "2016-11-11",
                "title": "Raw",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 3304,
                "credit_id": "5e780784a055ef00182ecbc3",
                "department": "Production",
                "job": "Producer"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "쥘리 가예"
        ],
        "biography": "Julie Gayet (born 3 June 1972) is a French actress and film producer. She is also known for being the wife of the former President of France, François Hollande.\n\nGayet was born in Suresnes, Hauts-de-Seine, where her father Brice Gayet is a professor and head of gastric surgery at the Institut Mutualiste Montsouris. He was former head of the clinic to the Lariboisière Hospital and lecturer at the Faculty Xavier Bichat at Paris Diderot University. Her mother is an antique dealer. Her paternal grandfather, Alain Gayet, was also a surgeon and became a Compagnon de la Libération after World War II. She received a social liberal intellectual upbringing.\n\nGayet studied art history and psychology at university, circus skills at the circus school of the Fratellini family, and operatic singing under Tosca Marmor. At the age of 17, she studied at the Actors Studio in London with Jack Waltzer, and then continued at the Tania Balachova School in Paris.\n\nGayet made her acting debut in a 1992 episode of the French TV series Premiers baisers, and had her first film role as an extra in Three Colors: Blue (1993), but her first role of public note was in the 1996 comedy Delphine 1, Yvan 0 by Dominique Farrugia.\n\nHer musical performances include playing in video-clips for Benjamin Biolay and singing a duet with Marc Lavoine.\n\nIn 2007, she founded her own production company, Rouge International, with Nadia Turincev and produced films such as The Ride by Stephanie Gillard, Fix me by Palestinian Raed Andonia and Bonsai by Cristian Jimenez of Chile.\n\nIn 2013, Gayet co-directed with Mathieu Busson the documentary Cinéast(e)s featuring 20 French female film directors.\n\nGayet appeared on the cover of the 17 January 2014 issue of the French Elle magazine. The issue hit newsstands on 15 January 2014, two days ahead of its usual release day. The headline read \"Julie Gayet, Actress and Committed Woman, a French Passion\".\n\nIn 2003, Gayet married author and screenwriter Santiago Amigorena, but they divorced in 2006. The couple have two children.\n\nGayet is a centre-left activist, having appeared in a video supporting François Hollande during the 2012 French presidential election. She is a member of the Support Committee of the PS candidate for the 2014 Paris mayoral election, Anne Hidalgo. She also supported same-sex marriage in France.\n\nIn 2013 rumours started circulating that Gayet was in a secret relationship with President Hollande. On 10 January 2014, a story in the tabloid Closer featured seven pages of alleged revelations and photos about the affair, provoking wider media coverage. Hollande said he \"regretted this violation of his private life\" and was \"thinking about\" pursuing a legal response, but did not deny the substance of the story. The 10 January issue was so popular that Closer \"reprinted the issue, with a further 150,000 copies scheduled to hit newsstands\" on 15 January 2014. On 16 January 2014, the AFP news agency reported that Gayet would sue Closer for €50,000 in damages and €4,000 in legal costs. ...\n\nSource: Article \"Julie Gayet\" from Wikipedia in English, licensed under CC-BY-SA.",
        "birthday": "1972-06-03",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 37628,
        "imdb_id": "nm0310865",
        "known_for_department": "Acting",
        "name": "Julie Gayet",
        "place_of_birth": "Suresnes, Hauts-de-Seine, France",
        "popularity": 1.7516,
        "profile_path": "/wt2ZtI2RFcOWcaUoXp8O5jv1bmx.jpg"
    }
}