{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ayDMYGUNVvXS76wQgFwTiUIDNb5.jpg",
                "genre_ids": [
                    10752,
                    28,
                    36,
                    18,
                    53
                ],
                "id": 300671,
                "original_language": "en",
                "original_title": "13 Hours: The Secret Soldiers of Benghazi",
                "overview": "An American Ambassador is killed during an attack at a U.S. compound in Libya as a security team struggles to make sense out of the chaos.",
                "popularity": 8.3433,
                "poster_path": "/AskDcQ6Sa6jImyt2KDQbgRuPebH.jpg",
                "release_date": "2016-01-14",
                "title": "13 Hours: The Secret Soldiers of Benghazi",
                "video": false,
                "vote_average": 7.271,
                "vote_count": 3751,
                "character": "Sona Jillani",
                "credit_id": "55c133acc3a36823f700342d",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "آلکسیا بارلیر"
        ],
        "biography": "Alexia Barlier is a French actress born in Paris, France. She was brought up in both French and English language. She stars in the Michael Bay film 13 Hours: The Secret Soldiers of Benghazi (2016).\n\nAlexia is fully bilingual and has dual nationality. Growing up in Paris with a New Zealand ballet dancer mother and a French art dealer father exposed her not only to many cultures, but also to many languages, with French and English spoken at home in equal measure. She discovered her talent in acting at the age of 14 when she played Viola in Shakespeare's Twelfth Night on stage. She started taking acting classes soon after, and got her first part at 18 on the feature film 24 Hours in a Woman's Life by French director Laurent Bouhnik. That confirmed her love of acting and that she would definitely do it as a career.\n\nAlexia was revealed in 2007 as an Adami talent at the Cannes Film Festival for her part in the short films of Comédiennes by the Larrieu brothers and the same year for playing Magda, Daniel Auteuil's mistress in Conversations with My Gardener by famous French director Jean Becker.",
        "birthday": "1982-12-21",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.alexia.barlier.com",
        "id": 37645,
        "imdb_id": "nm1715145",
        "known_for_department": "Acting",
        "name": "Alexia Barlier",
        "place_of_birth": "Paris, France",
        "popularity": 0.34,
        "profile_path": "/2osfqBBEX5nN2WcRPPwu8XUggUc.jpg"
    }
}