{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/i7n9u1SppzXcSO2EVgwEehzABzm.jpg",
                "genre_ids": [
                    37
                ],
                "id": 17529,
                "original_language": "en",
                "original_title": "True Grit",
                "overview": "The murder of her father sends a teenage tomboy on a mission of 'justice', which involves avenging her father's death. She recruits a tough old marshal, 'Rooster' Cogburn because he has 'true grit', and a reputation of getting the job done.",
                "popularity": 3.5697,
                "poster_path": "/9TjGjAD2deCtIG4ebi8LhIyFK6j.jpg",
                "release_date": "1969-06-11",
                "title": "True Grit",
                "video": false,
                "vote_average": 7.331,
                "vote_count": 818,
                "character": "Judge Parker's Bailiff (uncredited)",
                "credit_id": "63370e94d363e50091358be5",
                "order": 30
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jimmy Mack"
        ],
        "biography": "James McEachin was born on May 20, 1930 in Rennert, North Carolina. At the age of 18 he joined the US Armed Forces and served in the Korean War earning many medals of valor to include the Purple Heart and Silver Star. After leaving the military he spent time as a policeman and then fireman before moving to California and becoming a record producer. After a short stint in the music industry McEachin went into acting and spent many years in film and television. Not yet content he took time away from acting to become an award-winning author and maker of audio books. In 2005 McEachin was appointed as a US Army Reserve Ambassador and spends his free time speaking to soldiers, veterans and America. In late 2006 he produced the film-short Old Glory, a film short for the soldier, veteran and patriot in us all. In 2008 McEachin opened his one-man play, Above the Call; Beyond the Duty at the John F. Kennedy Center, Washington, DC and his since played Casa Manana, Ft. Worth, TX, Brentwood Theater, Los Angeles, CA, and Merle Reskin Theatre, Chicago, IL.\n\nMcEachin is married with three grown children and resides in So Cal.",
        "birthday": "1930-05-20",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 37714,
        "imdb_id": "nm0533013",
        "known_for_department": "Acting",
        "name": "James McEachin",
        "place_of_birth": "Rennert, North Carolina, USA",
        "popularity": 0.2768,
        "profile_path": "/qm4kBs2GPUvZYrsGsaWt2DD6Kij.jpg"
    }
}