{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5fxTB08O7CW1hAcN2MWOKodp1h1.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 615777,
                "original_language": "en",
                "original_title": "Babylon",
                "overview": "A tale of outsized ambition and outrageous excess, tracing the rise and fall of multiple characters in an era of unbridled decadence and depravity during Hollywood's transition from silent films to sound films in the late 1920s.",
                "popularity": 8.8545,
                "poster_path": "/wjOHjWCUE0YzDiEzKv8AfqHj3ir.jpg",
                "release_date": "2022-12-22",
                "title": "Babylon",
                "video": false,
                "vote_average": 7.38,
                "vote_count": 3486,
                "character": "Carmelita",
                "credit_id": "6377d44a11c06600c800b215",
                "order": 68
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Yissendy Trinidad is an accomplished actress, producer, and advocate for diversity and inclusion in the entertainment industry. She is known for her work in several high-profile projects, including feature film Babylon directed by Oscar-winning director Damien Chazelle, where she acted alongside Brad Pitt and Margot Robbie, as well as the TV series Mayans, English Teacher, and You're Not Alone, where she starred alongside Michael Jai White.\n\nYissendy has received critical acclaim for her work, earning recognition and awards at film festivals around the world for her pilot Doumi Girls. Her success in the industry has also led her to establish her own production company, the Trinidad Entertainment Group, which aims to create compelling and diverse content for audiences worldwide.\n\nBeyond her work in the entertainment industry, Yissendy is a passionate advocate for inclusion and diversity. She has been vocal about the need for greater representation of underrepresented groups in film and television, and has worked to create opportunities for actors and filmmakers from diverse backgrounds.\n\nYissendy's talent and dedication have made her a rising star in the entertainment industry, and her commitment to diversity and inclusion make her a powerful force for positive change.",
        "birthday": "1992-11-02",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 3772626,
        "imdb_id": "nm4622415",
        "known_for_department": "Acting",
        "name": "Yissendy Trinidad",
        "place_of_birth": "Santiago, Dominican Republic",
        "popularity": 0.4412,
        "profile_path": "/9J2b0EcphE9zdZdutDI21XMzdBO.jpg"
    }
}