{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/pqVNPjSwu1NsSjREl14HTbm3dXQ.jpg",
                "genre_ids": [
                    27,
                    53
                ],
                "id": 9299,
                "original_language": "es",
                "original_title": "Tesis",
                "overview": "While doing a thesis about violence, Ángela finds a snuff video where a girl is tortured to death. Soon she discovers that the girl was a former student at her college...",
                "popularity": 2.4977,
                "poster_path": "/w1ynKTlqOfbIMwcDsTSvCku9bQg.jpg",
                "release_date": "1996-04-11",
                "title": "Thesis",
                "video": false,
                "vote_average": 7.484,
                "vote_count": 882,
                "character": "Figueroa",
                "credit_id": "52fe44e4c3a36847f80b02db",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Miguel Picazo de Dios"
        ],
        "biography": "Miguel Picazo de Dios (27 March 1927 – 23 April 2016)[1] was a Spanish film director, screenwriter and actor. He is best known for his first feature film La tía Tula (Aunt Tula) (1964).\n\nBorn in Cazorla (Jaén), Picazo was raise in Guadalajara and studied law. Interested in filmmaking, he entered Spain's national film school, Intituto de investigaciones y Experiencias Cinematográficas, graduating as director in 1960 with a practice film entitled Habitación de alquiler (Rented Room). He then became a teacher in the newly restructured Escuela Oficial de Cine (EOC) and eventually he was able to direct his first film, La tía Tula (Aunt Tula) (1964). An updated adaptation of the well known novel by Miguel de Unamuno, portraying the oppressive and puritanical environment of provincial life in Spain. The film, helped by a strong performance in the lead by Aurora Bautista as the sexually repressed title character, was a critical and commercial success and brought Picazo to the forefront of the new Spanish cinema.\n\nDespite the success of his debut film, it took Picazo three years to make his second film, Oscuros sueños de agosto (Dark dreams of August) (1967), a film marred by cuts by the censors and the death of the film's producer, Cesáreo González which hampered commercial distribution. This failure put Picazo away from filming for the next nine years.",
        "birthday": "1927-03-27",
        "deathday": "2016-04-23",
        "gender": 2,
        "homepage": null,
        "id": 37842,
        "imdb_id": "nm0681467",
        "known_for_department": "Acting",
        "name": "Miguel Picazo",
        "place_of_birth": "Cazorla, Jaén, Spain",
        "popularity": 0.0412,
        "profile_path": "/3cnMncz91UyL8wvLenVQpIeRgMM.jpg"
    }
}