{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kzXUQnrUnHUGHuwWbgf9KpoU3qr.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 544401,
                "original_language": "en",
                "original_title": "Cherry",
                "overview": "Cherry drifts from college dropout to army medic in Iraq - anchored only by his true love, Emily. But after returning from the war with PTSD, his life spirals into drugs and crime as he struggles to find his place in the world.",
                "popularity": 2.9009,
                "poster_path": "/pwDvkDyaHEU9V7cApQhbcSJMG1w.jpg",
                "release_date": "2021-02-26",
                "title": "Cherry",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1323,
                "character": "Dog Park Husband (uncredited)",
                "credit_id": "63717a3d798e0600914f418b",
                "order": 94
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Chris Richards was born and raised in North Canton, Ohio. He is known for his appearances on Bull (CBS) and The Russo Brothers' film, Cherry. He is primarily of German, Italian, and Welsh descent.\n\nRichards studied acting at Kent State University. Upon graduation, he immediately began working as a local professional actor in the Cleveland area until he moved to New York City to continue the pursuit of his acting career. Since then, he has continued to earn a variety of roles in notable Theatre, TV, and Film projects. He also studied improv at the Upright Citizens Brigade Theatre in New York under Anthony Atamanuik (creator of \"The President Show\" on Comedy Central).\n\nChris Richards has been cast in numerous productions at several significant Off-Broadway and regional theatres, including the Tony-Award-Winning Cleveland Play House and Pearl Theatre Company in New York City. He has also been fortunate to act opposite of many highly celebrated actors, including Emmy-Award-Winner Maile Flanagan and Marvel superstar Tom Holland. Richards' work has been acclaimed in The New York Times, and critics have also published reviews comparing him and his work to Tom Hanks.\n\nHe lives with his wife and two children in New York City.",
        "birthday": "1986-11-15",
        "deathday": null,
        "gender": 2,
        "homepage": "https://chrisrichardsonline.com/",
        "id": 3784670,
        "imdb_id": "nm8971392",
        "known_for_department": "Acting",
        "name": "Chris Richards",
        "place_of_birth": "North Canton, Ohio, USA",
        "popularity": 0.6168,
        "profile_path": "/b6yxFLd501xMYbCY0hZO8d2txK1.jpg"
    }
}