{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qBpRJrbaofPzb9pwgi5LiuNDLmM.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 266,
                "original_language": "fr",
                "original_title": "Le Mépris",
                "overview": "A philistine in the art film business, Jeremy Prokosch is a producer unhappy with the work of his director. Prokosch has hired Fritz Lang to direct an adaptation of \"The Odyssey,\" but when it seems that the legendary filmmaker is making a picture destined to bomb at the box office, he brings in a screenwriter to energize the script. The professional intersects with the personal when a rift develops between the writer and his wife.",
                "popularity": 5.6546,
                "poster_path": "/1WhhlenrLjO2XR6foiPWy8v3kI.jpg",
                "release_date": "1963-10-29",
                "title": "Contempt",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 879,
                "character": "Paul Javal",
                "credit_id": "52fe422fc3a36847f800a8c9",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/4Zc7ja5d4eGTT0rpx1pOCVLiRgW.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 649,
                "original_language": "fr",
                "original_title": "Belle de jour",
                "overview": "Beautiful young housewife Séverine Serizy cannot reconcile her masochistic fantasies with her everyday life alongside dutiful husband Pierre. When her lovestruck friend Henri mentions a secretive high-class brothel run by Madame Anais, Séverine begins to work there during the day under the name Belle de Jour. But when one of her clients grows possessive, she must try to go back to her normal life.",
                "popularity": 3.1272,
                "poster_path": "/iUAFECovwPA0cVV9bo4uNGLJSGL.jpg",
                "release_date": "1967-05-24",
                "title": "Belle de Jour",
                "video": false,
                "vote_average": 7.32,
                "vote_count": 962,
                "character": "Henri Husson",
                "credit_id": "52fe4264c3a36847f801ae0d",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/jM6KRCEIIY1pGUIGemnp1rNY6ko.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 10102,
                "original_language": "fr",
                "original_title": "La Grande Bouffe",
                "overview": "Four friends gather at a villa with the intention of eating themselves to death.",
                "popularity": 2.9985,
                "poster_path": "/g4wOgslrQKprlQl927h0lQQ3P99.jpg",
                "release_date": "1973-05-16",
                "title": "La Grande Bouffe",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 525,
                "character": "Michel",
                "credit_id": "52fe43269251416c7500573d",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/z6NI6n5MvQZMZJbXKLiyFl1yDeA.jpg",
                "genre_ids": [
                    35
                ],
                "id": 4593,
                "original_language": "fr",
                "original_title": "Le Charme discret de la bourgeoisie",
                "overview": "In Luis Buñuel’s deliciously satiric masterpiece, an upper-class sextet sits down to dinner but never eats, their attempts continually thwarted by a vaudevillian mixture of events both actual and imagined.",
                "popularity": 1.8948,
                "poster_path": "/zN4ILX2x64PvT2jIOAHXxCOi5WA.jpg",
                "release_date": "1972-09-15",
                "title": "The Discreet Charm of the Bourgeoisie",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 856,
                "character": "Interior Minister",
                "credit_id": "52fe43cec3a36847f8071283",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/dCuwNZp2DLOWr8qV0GDBHINhVZM.jpg",
                "genre_ids": [
                    18,
                    14
                ],
                "id": 103328,
                "original_language": "fr",
                "original_title": "Holy Motors",
                "overview": "We follow 24 hours in the life of a being moving from life to life like a cold and solitary assassin moving from hit to hit. In each of these interwoven lives, the being possesses an entirely distinct identity: sometimes a man, sometimes a woman, sometimes youthful, sometimes old. By turns murderer, beggar, company chairman, monstrous creature, worker, family man.",
                "popularity": 1.7743,
                "poster_path": "/4ZuTrrDQhCS9f6KzIX6HfsjjyMd.jpg",
                "release_date": "2012-07-02",
                "title": "Holy Motors",
                "video": false,
                "vote_average": 6.991,
                "vote_count": 1199,
                "character": "Man with the Wine Stain",
                "credit_id": "52fe4a1cc3a36847f81ba1d7",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/9x3yIrAJOkYSs0SBKcGCQlwPSNm.jpg",
                "genre_ids": [
                    10749,
                    35,
                    18
                ],
                "id": 2433,
                "original_language": "fr",
                "original_title": "Les Demoiselles de Rochefort",
                "overview": "Delphine and Solange are two sisters living in Rochefort. Delphine is a dancing teacher and Solange composes and teaches the piano. Maxence is a poet and a painter. He is doing his military service. Simon owns a music shop, he left Paris one month ago to come back where he fell in love 10 years ago. They are looking for love, looking for each other, without being aware that their ideal partner is very close...",
                "popularity": 1.7891,
                "poster_path": "/jtxhyGaYhurH6KsjvP1jV3dDypz.jpg",
                "release_date": "1967-03-08",
                "title": "The Young Girls of Rochefort",
                "video": false,
                "vote_average": 7.682,
                "vote_count": 631,
                "character": "Simon Dame",
                "credit_id": "5ee439145b4fed0021647445",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Мишель Пикколи",
            "ميشيل بيكولي"
        ],
        "biography": "Michel Jacques Daniel Piccoli was the son of Henri Piccoli, violinist and Marcelle Expert-Bezançon (1892-1990), pianist and daughter of the French industrialist and politician Charles Expert-Bezançon. In 1954, Michel Piccoli married actress Éléonore Hirt with whom he had a daughter, Anne-Cordélia Piccoli. In 1966, he married the singer Juliette Gréco, then in 1978 the screenwriter Ludivine Clerc, with whom he adopted two children of Polish origin, Inord and Missia.\n\nPlaced in an establishment for problem children, the commitments of the young Piccoli, are made in opposition to his maternal grandfather, senator of the Third Republic, financier of the Radical Party, and important industrial painter, accused by the trade union left and by Georges Clemenceau, of having intoxicated his workmen through lead white which causes lead poisoning.\n\nMichel Piccoli then trained as an actor first with Andrée Bauer-Théraud and then during Simon. After an appearance as an extra in \"Sortilèges\" by Christian-Jaque in 1945, Michel Piccoli made his film debut in \"Le Point Du Jour\" by Louis Daquin. In the theater he distinguished himself with the Renaud-Barrault and Grenier-Hussot companies as well as at the Théâtre de Babylone. Noticed in the film \"French Cancan\" in 1954, he continued on stage and worked with directors Jacques Audiberti, Jean Vilar, Jean-Marie Serreau, Peter Brook, Luc Bondy, Patrice Chéreau and André Engel, and became also know in popular TV movies. Having become an atheist after a family bereavement, he met Luis Buñuel in 1956, and ironically took on the role of a priest in \"La Mort En Ce Jardin\". In 1959, he shot \"Le Rendez-Vous De Noël\", a short film by André Michel based on the short story by Malek Ouary \"Le Noël Du Petit Cireur\", in Algiers. The 1960s sounded his consecration, noticed in \"Le Doulos\" by Jean-Pierre Melville, he was revealed internationally with \"Le Mépris\" by Jean-Luc Godard alongside Brigitte Bardot. From then on, he toured with the greatest French and international filmmakers such as Alfred Hitchcock, Luis Buñuel, Youssef Chahine, Manoel de Oliveira...\n\nHe began the 1980s with the interpretation prize at the Cannes festival in 1980, with \"Le Saut Dans Le Vide\" by Marco Bellocchio, and that of the Berlin festival in 1982, with \"Une Étrange Affaire\" by Pierre Granier-Deferre. . He worked with Jacques Doillon, Leos Carax, before trying his hand at directing. In 2001 he received the IX Europe Prize for Theatre. He was part of the jury of the 60th Cannes Film Festival in 2007, chaired by Stephen Frears. In 2011, he played in \"Habemus Papam\" by Nanni Moretti. The last film in which Michel Piccoli appears is the film \"Le Goût Des Myrtilles\", by Thomas de Thiers in 2013.\n\nPolitically committed to the left, member of the Peace Movement (communist), Michel Piccoli distinguished himself by his positions against the National Front, and mobilized for Amnesty International.\n\nMichel Piccoli died on May 12, 2020 following a stroke in his mansion in Saint-Philbert-sur-Risle in Eure. His funeral takes place in Évreux on May 19, 2020, where he is cremated, his ashes are scattered within the family property.",
        "birthday": "1925-12-27",
        "deathday": "2020-05-12",
        "gender": 2,
        "homepage": "https://www.radiofrance.fr/personnes/michel-piccoli",
        "id": 3784,
        "imdb_id": "nm0681566",
        "known_for_department": "Acting",
        "name": "Michel Piccoli",
        "place_of_birth": "Paris, Ile-de-France, France",
        "popularity": 0.6638,
        "profile_path": "/6yZaIIeMfYgQtcdNo4dubL2N5YT.jpg"
    }
}