{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/vOpm4wQk5qIl8UepoKrpaloqaPC.jpg",
                "genre_ids": [
                    18,
                    10749,
                    10752
                ],
                "id": 2841,
                "original_language": "fr",
                "original_title": "Un long dimanche de fiançailles",
                "overview": "Young Frenchwoman Mathilde searches for the truth about her missing fiancé, lost during World War I, and learns many unexpected things along the way. The love of her life is gone. But she refuses to believe he's gone forever — and she needs to know for sure.",
                "popularity": 3.7861,
                "poster_path": "/t73m7lX0eFYDjlB1Gcb7r3S5Yt.jpg",
                "release_date": "2004-10-27",
                "title": "A Very Long Engagement",
                "video": false,
                "vote_average": 7.326,
                "vote_count": 1257,
                "character": "Véronique Passavant",
                "credit_id": "57e2ad769251417eda000a4f",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Julie Marion Depardieu (born 18 June 1973) is a French actress who has appeared in a number of successful films.\n\nBorn 18 June 1973 in Paris, she is the daughter of Gérard Depardieu and Élisabeth Depardieu and the sister of the late Guillaume Depardieu – all of whom have worked as film actors. She has two paternal half-siblings: half-sister Roxane and half-brother Jean.\n\nShe has two sons, Billy (born 16 June 2011) and Alfred (born 8 August 2012), with her partner musician Philippe Katerine.\n\nIn 2004, she won two César Awards (Best Supporting Actress and Best Young Actress) for La petite Lili and won another (Best Supporting Actress) for Un secret in 2008. Depardieu was also nominated for a César Award for Best Supporting Actress in 2005 for her performance in Podium.\n\nIn 2008, she also directed her first operette les contes d'Hoffmann (Tales of Hoffman) at the Vaux le Vicomte castle, the castle which inspired king Louis XIV to build Versailles.\n\nSource: Article \"Julie Depardieu\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1973-06-18",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 37920,
        "imdb_id": "nm0220017",
        "known_for_department": "Acting",
        "name": "Julie Depardieu",
        "place_of_birth": "Boulogne-Billancourt, Hauts-de-Seine, France",
        "popularity": 0.6086,
        "profile_path": "/n54M41KGkwGqozzNycatbqeXIjC.jpg"
    }
}