{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2pnfUSFqUPn9F4mzl1MLKrlnNbU.jpg",
                "genre_ids": [
                    35,
                    80
                ],
                "id": 25253,
                "original_language": "fr",
                "original_title": "Les Tontons flingueurs",
                "overview": "An aging gangster, Fernand Naudin is hoping for a quiet retirement when he suddenly inherits a fortune from an old friend, a former gangster supremo known as the Mexican. If he is ambivalent about his new found wealth, Fernand is positively nonplussed to discover that he has also inherited his benefactor’s daughter, Patricia. Unfortunately, not only does Fernand have to put up with the thoroughly modern Patricia and her nauseating boyfriend, but he also had to contend with the Mexican’s trigger-happy former employees, who are determined to make a claim.",
                "popularity": 1.7675,
                "poster_path": "/1uYCIsMpX7FtWu2xO1YMIAQYvLR.jpg",
                "release_date": "1963-11-27",
                "title": "Crooks in Clover",
                "video": false,
                "vote_average": 7.747,
                "vote_count": 526,
                "character": "Freddy",
                "credit_id": "52fe44c0c3a368484e034aeb",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "    Henry Cogan"
        ],
        "biography": "Henri Cogan (born 13 September 1914 in Paris; † 23 September 2003 in Boulogne-Billancourt) was a French actor and stuntman.\n\nBefore Henri Cogan became a fight choreographer for European action films he proved his expertise in hand-to-hand combat publicly by fighting as a professional wrestler. As a wrestler he once fought Lino Ventura and later he introduced him to Georges Lautner. Henri Cogan appeared in French, German and English films.\n\nSource: Article \"Henri Cogan\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1914-09-13",
        "deathday": "2003-09-23",
        "gender": 2,
        "homepage": null,
        "id": 37966,
        "imdb_id": "nm0169007",
        "known_for_department": "Acting",
        "name": "Henri Cogan",
        "place_of_birth": "Paris, France",
        "popularity": 1.7196,
        "profile_path": "/fny4E1T6GSRAMuusYaqW04nfgqt.jpg"
    }
}