{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/oLsts7ct0NVkdYpx5rZg10MG6zh.jpg",
                "genre_ids": [
                    18
                ],
                "id": 489,
                "original_language": "en",
                "original_title": "Good Will Hunting",
                "overview": "Headstrong yet aimless, Will Hunting has a genius-level IQ but chooses to work as a janitor at MIT. When he secretly solves highly difficult graduate-level math problems, his talents are discovered by Professor Gerald Lambeau, who decides to help the misguided youth reach his potential. When Will is arrested for attacking a police officer, Professor Lambeau makes a deal to get leniency for him if he gets court-ordered therapy. Eventually, therapist Dr. Sean Maguire helps Will confront the demons that are holding him back.",
                "popularity": 13.8953,
                "poster_path": "/z2FnLKpFi1HPO7BEJxdkv6hpJSU.jpg",
                "release_date": "1997-12-05",
                "title": "Good Will Hunting",
                "video": false,
                "vote_average": 8.157,
                "vote_count": 13095,
                "character": "Executive #2",
                "credit_id": "55d8ae1c92514143e40027ca",
                "order": 36
            },
            {
                "adult": false,
                "backdrop_path": "/bAup7FGUlmNVOuhZFlLgmDPo0Eg.jpg",
                "genre_ids": [
                    18,
                    10751
                ],
                "id": 345938,
                "original_language": "en",
                "original_title": "The Shack",
                "overview": "A grieving man receives a mysterious, personal invitation to meet with God at a place called 'The Shack'.",
                "popularity": 9.3129,
                "poster_path": "/doAzav9kfdtsoSdw1MDFvjKq3J4.jpg",
                "release_date": "2017-03-03",
                "title": "The Shack",
                "video": false,
                "vote_average": 7.494,
                "vote_count": 2196,
                "character": "Church Deacon",
                "credit_id": "591ed63f9251414a7b032148",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Christopher Britton"
        ],
        "biography": "​From Wikipedia, the free encyclopedia\n\nChristopher Britton, sometimes credited as \"Chris Britton,\" is a Canadian-born film actor, television actor, Stage Actor, and voice actor who is probably best known for his work in X-Men: The Animated Series, in which he was the voice of Mister Sinister. More recently, he has voiced the character of Soichiro Yagami in the English dub of the anime series Death Note and its live action counterpart. He also was the narrator on the Dino Crisis II videogame created by Capcom in 2000. He has a regular role as Richard Norton in Da Vinci's Inquest/City Hall, and has acted in several different movies from The Day After Tomorrow to Godsend. He has worked on many different plays and theater productions, including two seasons with the Stratford and Shaw Festivals, and has acted throughout Ontario, Vancouver, and the United States.\n\nDescription above from the Wikipedia article Christopher Britton (actor), licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1961-09-28",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.chrisbritton.ca/",
        "id": 37981,
        "imdb_id": "nm0110167",
        "known_for_department": "Acting",
        "name": "Chris Britton",
        "place_of_birth": "Toronto, Ontario, Canada",
        "popularity": 0.4172,
        "profile_path": "/aglAvk5ctIPWVWsGHX5T41Cna2V.jpg"
    }
}