{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4i3Amppd6eW5Qkhjv4gdHk3CCoE.jpg",
                "genre_ids": [
                    36,
                    10402,
                    18
                ],
                "id": 279,
                "original_language": "en",
                "original_title": "Amadeus",
                "overview": "Disciplined Italian composer Antonio Salieri becomes consumed by jealousy and resentment towards the hedonistic and remarkably talented young Salzburger composer Wolfgang Amadeus Mozart.",
                "popularity": 5.9174,
                "poster_path": "/1n5VUlCqgmVax1adxGZm8oCFaKc.jpg",
                "release_date": "1984-09-19",
                "title": "Amadeus",
                "video": false,
                "vote_average": 8.026,
                "vote_count": 4488,
                "character": "Lorl",
                "credit_id": "52fe4231c3a36847f800b215",
                "order": 21
            },
            {
                "adult": false,
                "backdrop_path": "/f5XOH9b9oV7yzIqhKDEXtDx0uz9.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 16553,
                "original_language": "en",
                "original_title": "Little Manhattan",
                "overview": "Ten-year-old Gabe was just a normal kid growing up in Manhattan until Rosemary Telesco walked into his life, actually into his karate class. But before Gabe can tell Rosemary how he feels, she tells him she will not be going to public school any more. Gabe has a lot more to learn about life, love, and girls.",
                "popularity": 2.1373,
                "poster_path": "/z0RNI1NMtsvLsuTo1rWZfNHVs1z.jpg",
                "release_date": "2005-09-26",
                "title": "Little Manhattan",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 730,
                "character": "Leslie",
                "credit_id": "52fe46da9251416c75085b7b",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/sZhTfYouKM1iV3rVbgIVEQFQogA.jpg",
                "genre_ids": [
                    35,
                    10751,
                    14
                ],
                "id": 2758,
                "original_language": "en",
                "original_title": "Addams Family Values",
                "overview": "Siblings Wednesday and Pugsley Addams will stop at nothing to get rid of Pubert, the new baby boy adored by parents Gomez and Morticia. Things go from bad to worse when the new \"black widow\" nanny, Debbie Jellinsky, launches her plan to add Fester to her collection of dead husbands.",
                "popularity": 10.4451,
                "poster_path": "/sdxT2VjVSx9DRicwnuECUdBHeE7.jpg",
                "release_date": "1993-11-19",
                "title": "Addams Family Values",
                "video": false,
                "vote_average": 6.97,
                "vote_count": 3163,
                "character": "Heather",
                "credit_id": "54dfb4b9925141454f00197f",
                "order": 32
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Синтия Никсон",
            "Cynthia Ellen Nixon",
            "欣希雅·尼克森"
        ],
        "biography": "Cynthia Ellen Nixon (born April 9, 1966) is an American actress, activist, and theater director. For her portrayal of Miranda Hobbes in the HBO series Sex and the City (1998–2004), she won the 2004 Primetime Emmy Award for Outstanding Supporting Actress in a Comedy Series. She reprised the role in the films Sex and the City (2008) and Sex and the City 2 (2010), as well as the television show And Just Like That... (2021–present). Her other film credits include Amadeus (1984), James White (2015), and playing Emily Dickinson in A Quiet Passion (2016).\n\nNixon made her Broadway debut in the 1980 revival of The Philadelphia Story. Her other Broadway credits include The Real Thing (1983), Hurlyburly (1983), Indiscretions (1995), The Women (2001), and Wit (2012). She won the 2006 Tony Award for Best Actress in a Play for Rabbit Hole, the 2008 Primetime Emmy Award for Outstanding Guest Actress in a Drama Series for Law & Order: Special Victims Unit, the 2009 Grammy Award for Best Spoken Word Album for An Inconvenient Truth, and the 2017 Tony Award for Best Featured Actress in a Play for The Little Foxes. Her other television roles include playing political figures Eleanor Roosevelt , Kade Prenall in NBC Hannibal Warm Springs (2005), Michele Davis in Too Big to Fail (2011), and playing Nancy Reagan in the 2016 television film Killing Reagan. In 2020, she appeared in the Netflix drama Ratched.\n\nOn March 19, 2018, Nixon announced her campaign for Governor of New York as a challenger to Democratic incumbent Andrew Cuomo. Her platform focused on income inequality, renewable energy, establishing universal health care, stopping mass incarceration in the United States, and protecting undocumented children from deportation. She lost in the Democratic primary to Cuomo on September 13, 2018, with 34% of the vote to his 66%. Nixon was nominated as the gubernatorial candidate for the Working Families Party; the party threw its support to Cuomo after Nixon lost in the Democratic primary.\n\nDescription above from the Wikipedia article Cynthia Nixon, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1966-04-09",
        "deathday": null,
        "gender": 1,
        "homepage": "http://cynthiafornewyork.com",
        "id": 38024,
        "imdb_id": "nm0633223",
        "known_for_department": "Acting",
        "name": "Cynthia Nixon",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 1.3303,
        "profile_path": "/a366FCtQYmT80vQnPMFZ4hsTwuU.jpg"
    }
}