{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cSbBSHHiy849SUhyTW6FX4Dbj43.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 19542,
                "original_language": "en",
                "original_title": "The Red Shoes",
                "overview": "In this classic drama, Vicky Page is an aspiring ballerina torn between her dedication to dance and her desire to love. While her imperious instructor, Boris Lermontov, urges to her to forget anything but ballet, Vicky begins to fall for the charming young composer Julian Craster. Eventually Vicky, under great emotional stress, must choose to pursue either her art or her romance, a decision that carries serious consequences.",
                "popularity": 1.2873,
                "poster_path": "/b7x6Wq9Mss2hOgf0fnVX7gBagJw.jpg",
                "release_date": "1948-09-06",
                "title": "The Red Shoes",
                "video": false,
                "vote_average": 7.971,
                "vote_count": 700,
                "character": "Julian Craster",
                "credit_id": "52fe47de9251416c750a819b",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Marius Re Goring",
            "Мариус Горинг"
        ],
        "biography": "Marius Re Goring CBE FRSL (May 23, 1912 – September 30, 1998) was an English stage and screen actor. He is the son of Dr Charles Buckman Goring, a renowned physician and criminologist, and Kate Winifred (née MacDonald), a former suffragette and talented pianist. Marius Goring was educated at The Perse School, Cambridge, England and at universities in Frankfurt, Munich, Vienna and Paris (The Sorbonne) where he perfected his French and German - he became fluent in both languages. He studied for the stage under Harcourt Williams at the Old Vic dramatic school, London. His first stage appearance was a fairy at the ADC Theatre, Cambridge in 1925 at the age of twelve in \"Crossings: A Fairy Play\" the only play written by Walter De La Mare. His first London appearance was at the Rudolph Steiner Hall in December 1927 as Harlequin in one of Jean Sterling McKinlay’s Children’s Matinees. He performed regularly at the Old Vic and Sadler's Wells in the 1930s and later toured France and Germany. He played Macbeth, Romeo, Trip in School for Scandal and the Chorus in Henry V with Laurence Olivier amongst others. His first West End appearance was at the Shaftesbury Theatre in May 1934 in The Voysey Inheritance.\n\nHe joined the army in July 1940 but was seconded the following year to the BBC where he became supervisor of productions for its German Service. He made regular propaganda broadcasts to Germany. Most of his radio propaganda work was done under the alias Charles Richardson (using his father’s first name and his grandmother’s maiden name) as the name Goring wasn't too popular during the war (Hermann Göring was the commander-in-chief of the Luftwaffe).\n\nIn 1941 he was married for the second time to the renowned German Jewish actress Lucie Mannheim who had to flee Germany in 1934 after the Nazis came to power. They worked together on stage and in films and television many times over the following years.\n\nHe was a founder member of British Equity in 1929, being on its council for decades from 1949 and was elected its vice president three times. He had a contentious relationship with the union from the 1970s, taking them to court on a number of issues, the last of which he lost in the High Court and was nearly bankrupted by the court costs.\n\nMarius was made a Fellow of the Royal Society of Literature in 1979 and appointed Commander of the Order of the British Empire (CBE) in 1991. He died from stomach cancer in 1998 aged 86 at his home in Rushlake Green, East Sussex, survived by his third wife, Prudence FitzGerald, a television producer/director who had directed him in 18 episodes of The Expert and his only child, a daughter from his first marriage, Phyllida.",
        "birthday": "1912-05-23",
        "deathday": "1998-09-30",
        "gender": 2,
        "homepage": "https://www.mariusgoring.com",
        "id": 38037,
        "imdb_id": "nm0330961",
        "known_for_department": "Acting",
        "name": "Marius Goring",
        "place_of_birth": "Newport, Isle of Wight, England, UK",
        "popularity": 0.2703,
        "profile_path": "/tBlkEduzwxRGP7Jq5NIGOy2O4E4.jpg"
    }
}