{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5rwcd24GGltKiqdPT4G2dmchLr9.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 579583,
                "original_language": "en",
                "original_title": "The King of Staten Island",
                "overview": "Scott has been a case of arrested development ever since his firefighter father died when he was seven. He's now reached his mid-20s having achieved little, chasing a dream of becoming a tattoo artist that seems far out of reach. As his ambitious younger sister heads off to college, Scott is still living with his exhausted ER nurse mother and spends his days smoking weed, hanging with the guys — Oscar, Igor and Richie — and secretly hooking up with his childhood friend Kelsey. But when his mother starts dating a loudmouth firefighter named Ray, it sets off a chain of events that will force Scott to grapple with his grief and take his first tentative steps toward moving forward in life.",
                "popularity": 6.276,
                "poster_path": "/zQFjMmE3K9AX5QrBL1SXIxYQ9jz.jpg",
                "release_date": "2020-07-22",
                "title": "The King of Staten Island",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 1067,
                "character": "Bar Patron",
                "credit_id": "65e6cc351db65d016493278f",
                "order": 59
            },
            {
                "adult": false,
                "backdrop_path": "/zBkHCpLmHjW2uVURs5uZkaVmgKR.jpg",
                "genre_ids": [
                    10751,
                    12,
                    35,
                    14
                ],
                "id": 585245,
                "original_language": "en",
                "original_title": "Clifford the Big Red Dog",
                "overview": "As Emily struggles to fit in at home and at school, she discovers a small red puppy who is destined to become her best friend. When Clifford magically undergoes one heck of a growth spurt, becomes a gigantic dog and attracts the attention of a genetics company, Emily and her Uncle Casey have to fight the forces of greed as they go on the run across New York City. Along the way, Clifford affects the lives of everyone around him and teaches Emily and her uncle the true meaning of acceptance and unconditional love.",
                "popularity": 6.0885,
                "poster_path": "/30ULVKdjBcQTsj2aOSThXXZNSxF.jpg",
                "release_date": "2021-11-10",
                "title": "Clifford the Big Red Dog",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 1774,
                "character": "Teen Park Goer",
                "credit_id": "65e6ce04097c490186666060",
                "order": 24
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Adam Keane is a multi-talented filmmaker with a diverse background in acting, directing, cinematography, and post-production. Beginning his creative journey as an actor, Adam appeared in school musicals and then in professional productions, later transitioning to creating his own content.\n\nIn addition to his acting credits, Adam has directed several short films, showcasing his ability to bring compelling stories to life. As a director of photography, he has crafted striking visuals for three short films, blending his technical skills with an artistic eye. Adam is also an experienced video editor, having edited his own projects as well as interviews and festival content for the Tribeca Festival.\n\nFurther expanding his expertise, Adam has served as a first assistant camera, pulling focus and managing slating responsibilities to support the seamless operation of film sets. With a passion for storytelling and a dedication to excellence, Adam continues to make his mark both in front of and behind the camera.",
        "birthday": "2002-10-15",
        "deathday": null,
        "gender": 2,
        "homepage": "https://adamkeane19.wixsite.com/adam-keane",
        "id": 3803958,
        "imdb_id": "nm7401551",
        "known_for_department": "Acting",
        "name": "Adam Keane",
        "place_of_birth": "Port Washington, New York, U.S.",
        "popularity": 0.5502,
        "profile_path": "/sEbieZE1Jqdp260Gy7ioWH53S41.jpg"
    }
}