{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/l2iY1AgqQ8dEa3FtWkN5TQ5aVbU.jpg",
                "genre_ids": [
                    53,
                    9648
                ],
                "id": 1092,
                "original_language": "en",
                "original_title": "The Third Man",
                "overview": "In postwar Vienna, Austria, Holly Martins, a writer of pulp Westerns, arrives penniless as a guest of his childhood chum Harry Lime, only to learn he has died. Martins develops a conspiracy theory after learning of a \"third man\" present at the time of Harry's death, running into interference from British officer Major Calloway, and falling head-over-heels for Harry's grief-stricken lover, Anna.",
                "popularity": 3.5645,
                "poster_path": "/rO2Fq0AZZx9obs52KJdx4mRE8p5.jpg",
                "release_date": "1949-08-31",
                "title": "The Third Man",
                "video": false,
                "vote_average": 7.915,
                "vote_count": 1989,
                "character": "Actor at Josefstadt Theater (uncredited)",
                "credit_id": "556ab35b92514173e0002cfd",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Karl Stepanek",
            "Karel Štěpánek",
            "Karel Stepanek"
        ],
        "biography": "Though born in Czechoslovakia, actor Karel Stepanek was generally regarded as a German actor due to his extensive film work in Germany (as Karl Stepanek) in the years before World War II. Stepanek fled to England in 1940, where, like many European refugee actors, he specialized in portraying Teutonic villains. He tried to stay away from out-and-out Nazi roles, but his predilection for wearing black uniforms and barking out guttural commands left little doubt as to the political preferences of Stepanek's screen characters. One of his most typical characterizations could be found in the 1946 POW drama, The Captive Heart; Stepanek also registered well as a friendlier foreigner in The Fallen Idol (1949). Commuting between London and Hollywood, Karel Stepanek continued to fight World War II, usually on the wrong side, into such '60s films as Sink the Bismarck! (1960), I Aim at the Stars (1960) and Operation Crossbow (1965).",
        "birthday": "1899-10-27",
        "deathday": "1980-12-25",
        "gender": 2,
        "homepage": null,
        "id": 38050,
        "imdb_id": "nm0826749",
        "known_for_department": "Acting",
        "name": "Karl Stepanek",
        "place_of_birth": "Brünn, Moravia, Austria-Hungary [now Brno, Czech Republic]",
        "popularity": 0.1356,
        "profile_path": "/7ylkAd2FaALya2t0QCM6M4J9s6M.jpg"
    }
}