{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rqnOgJWvlURkcOWfGqiACvkTAqG.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 14811,
                "original_language": "en",
                "original_title": "Fiddler on the Roof",
                "overview": "In a pre-revolutionary Russia, a poor Jewish milkman struggles with the challenges of a changing world as his daughters fall in love and antisemitism grows.",
                "popularity": 3.8019,
                "poster_path": "/v65PHx7Q6Jx0anyNeUOX07SJic9.jpg",
                "release_date": "1971-11-03",
                "title": "Fiddler on the Roof",
                "video": false,
                "vote_average": 7.73,
                "vote_count": 605,
                "character": "Isaac (uncredited)",
                "credit_id": "57053f37c3a3680f3d0004f5",
                "order": 60
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Carl Jaffé "
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nCarl Jaffe (21 March 1902 – 12 April 1974) was a German actor. Jaffe trained on the stage in his native Hamburg, Kassel and Wiesbaden before moving to Berlin, where his career took off.\n\nIn 1933 Jaffe changed his stage name to Frank Alwar, but in 1936, with the situation for Jews in Germany rapidly deteriorating, he made the decision to migrate to the United Kingdom. He remained in the UK for the rest of his life and enjoyed a prolific career, appearing in over 50 films and many television productions.\n\nThroughout his British career he was almost invariably cast as German or Central European characters, usually in supporting roles, and often with a war, crime or espionage setting. His more notable films include The Lion Has Wings, The Life and Death of Colonel Blimp, Two Thousand Women, Operation Amsterdam and The Roman Spring of Mrs. Stone. Jaffe's television credits included Danger Man, Dad's Army and Oh, Brother!.",
        "birthday": "1902-03-21",
        "deathday": "1974-03-12",
        "gender": 2,
        "homepage": null,
        "id": 38068,
        "imdb_id": "nm0415434",
        "known_for_department": "Acting",
        "name": "Carl Jaffe",
        "place_of_birth": "Hamburg, Germany",
        "popularity": 0.0947,
        "profile_path": "/nVhuF3FK6Ett5qrNTFnGkeVgA7S.jpg"
    }
}