{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/538U9snNc2fpnOmYXAPUh3zn31H.jpg",
                "genre_ids": [
                    28,
                    12,
                    53
                ],
                "id": 575265,
                "original_language": "en",
                "original_title": "Mission: Impossible - The Final Reckoning",
                "overview": "Ethan Hunt and team continue their search for the terrifying AI known as the Entity — which has infiltrated intelligence networks all over the globe — with the world's governments and a mysterious ghost from Hunt's past on their trail. Joined by new allies and armed with the means to shut the Entity down for good, Hunt is in a race against time to prevent the world as we know it from changing forever.",
                "popularity": 174.6469,
                "poster_path": "/z53D72EAOxGRqdr7KXXWp9dJiDe.jpg",
                "release_date": "2025-05-17",
                "title": "Mission: Impossible - The Final Reckoning",
                "video": false,
                "vote_average": 7.286,
                "vote_count": 1767,
                "character": "SSGN Ohio - Crew",
                "credit_id": "682b411dd5b21f6368648f14",
                "order": 66
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Aisha May Hunte"
        ],
        "biography": "Aisha-May Hunte is a non-binary, queer, mixed-race performer based between London and Swansea.\n\nheir recent screen credits include roles in BBC’s Death Valley, S4C’s Anfamol and ITOPIA, BBC’s Casualty, and SKY/National Theatre Wales’ GALWAD. On stage, they have played leading roles in Olion (Seren), Gypsy (Gypsy Rose Lee), Pippin (Theo), and Swyn (Welsh Narrator) at Frân Wen, Theatr Genedlaethol and Mountview. Fluent in both English and Welsh, Aisha-May is highly skilled in musical theatre, physical theatre, voice acting, and presenting. They have developed a strong command of diverse accents — from Caribbean to American Southern — and thrive in projects requiring dynamic characters, multilingual storytelling, or powerful musical performances.",
        "birthday": null,
        "deathday": null,
        "gender": 3,
        "homepage": "https://kateborde.co.uk/actors/",
        "id": 3818228,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Aisha-May Hunte",
        "place_of_birth": "Swansea, Wales, UK",
        "popularity": 0.155,
        "profile_path": "/hV15XVwJdj9XYy4KiNVjlfg0KwV.jpg"
    }
}