{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uxjPyKutAtw7lHZ3mHg0MzQvAK9.jpg",
                "genre_ids": [
                    9648,
                    18,
                    53
                ],
                "id": 10403,
                "original_language": "en",
                "original_title": "The Player",
                "overview": "A Hollywood studio executive is being sent death threats by a writer whose script he rejected - but which one?",
                "popularity": 3.7047,
                "poster_path": "/tZ3kDut2dhFVGkWNEn9xoCHCNAx.jpg",
                "release_date": "1992-05-08",
                "title": "The Player",
                "video": false,
                "vote_average": 7.21,
                "vote_count": 881,
                "character": "Cher",
                "credit_id": "52fe43689251416c7500f283",
                "order": 41
            },
            {
                "adult": false,
                "backdrop_path": "/56H7AtJ5GK4UxFoHuw9QDwI7wzD.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 42297,
                "original_language": "en",
                "original_title": "Burlesque",
                "overview": "Ali leaves behind a troubled life and follows her dreams to Los Angeles, where she lands a job as a cocktail waitress at the Burlesque Lounge, a once-majestic theater that houses an inspired musical revue. Vowing to perform there, she makes the leap from bar to stage, helping restore the club's former glory.",
                "popularity": 5.0965,
                "poster_path": "/3U9zBIibERQZqYKM3N1a4MYgBsN.jpg",
                "release_date": "2010-11-23",
                "title": "Burlesque",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 2306,
                "character": "Tess",
                "credit_id": "52fe45fac3a36847f80e5717",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/8HKwxHZ23sW8wz4yb28IWnAM1M6.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 458423,
                "original_language": "en",
                "original_title": "Mamma Mia! Here We Go Again",
                "overview": "Five years after meeting her three fathers, Sophie Sheridan prepares to open her mother’s hotel. In 1979, young Donna Sheridan meets the men who each could be Sophie’s biological father.",
                "popularity": 5.6706,
                "poster_path": "/aWicerX4Y7n7tUwRAVHsVcBBpj2.jpg",
                "release_date": "2018-07-18",
                "title": "Mamma Mia! Here We Go Again",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 3473,
                "character": "Ruby Sheridan",
                "credit_id": "59ed83909251411900025446",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Cher Bono",
            "Cherilyn Sarkisian",
            "셰어",
            "Шер",
            "Bonnie Jo Mason",
            "Cheryl LaPiere",
            "Goddess of Pop",
            "Cheryl Sarkisian",
            "Chér"
        ],
        "biography": "Cher (born Cheryl Sarkisian; May 20, 1946) is an American singer, actress and television personality. Dubbed the \"Goddess of Pop\", she is known for her androgynous contralto voice, multifaceted career, bold visual presentation and continuous reinvention of her image and sound. Her adaptability has fueled multiple comebacks, cementing her status as a cultural icon over a career spanning seven decades. Cher gained fame in 1965 as part of the folk rock husband-wife duo Sonny & Cher, while also achieving solo success with top-ten singles including \"All I Really Want to Do\" and \"Bang Bang (My Baby Shot Me Down)\". In the 1970s, she divorced from Sonny Bono and topped the US Billboard Hot 100 with \"Gypsys, Tramps & Thieves\", \"Half-Breed\" and \"Dark Lady\", becoming the female solo artist with the most number-one singles in US history at the time.\n\nFollowing a hiatus to focus on acting, Cher returned to music with the rock-inflected albums Cher (1987), Heart of Stone (1989) and Love Hurts (1991), earning international number-one singles with \"If I Could Turn Back Time\" and \"The Shoop Shoop Song (It's in His Kiss)\". She reached a commercial peak with the dance-pop album Believe (1998), which introduced the \"Cher effect\", an extreme, stylistic use of Auto-Tune to distort vocals. The title track became 1999's number-one song in the US and the UK's best-selling single by a female artist. 21st-century releases include Closer to the Truth (2013) and Dancing Queen (2018), both debuting at number three on the Billboard 200 and becoming her highest-charting solo albums in the US.\n\nCher rose to television stardom in the 1970s with her CBS shows The Sonny & Cher Comedy Hour, attracting over 30 million weekly viewers, and the namesake Cher. She made her Broadway debut in 1982 with Come Back to the 5 & Dime, Jimmy Dean, Jimmy Dean and starred in its film adaptation. She earned critical acclaim for roles in Silkwood (1983), Mask (1985) and Moonstruck (1987), winning the Academy Award for Best Actress for the latter. Cher went on to star in Mermaids (1990), If These Walls Could Talk (1996), where she made her directorial debut, Tea with Mussolini (1999), Burlesque (2010) and Mamma Mia! Here We Go Again (2018). Her life and career inspired the 2018 jukebox musical The Cher Show.\n\nWith 100 million records sold, Cher is among the world's best-selling music artists. Her accolades include an Academy Award, an Emmy, a Grammy, three Golden Globes, the Billboard Icon Award, a Cannes Film Festival Award, honors from the Kennedy Center and the Council of Fashion Designers of America, and induction into the Rock and Roll Hall of Fame. Cher is the only solo artist with a number-one single on a Billboard chart in seven consecutive decades, from the 1960s to the 2020s. Her 2002–2005 Living Proof: The Farewell Tour was the highest-grossing concert tour by a female artist at the time, earning US$250 million (about $390 million in 2023). Cher is also known for her fashion, political views, social media presence, philanthropy and activism, including LGBTQ rights and HIV/AIDS prevention.",
        "birthday": "1946-05-20",
        "deathday": null,
        "gender": 1,
        "homepage": "https://cher.com",
        "id": 38225,
        "imdb_id": "nm0000333",
        "known_for_department": "Acting",
        "name": "Cher",
        "place_of_birth": "El Centro, California, USA",
        "popularity": 0.4813,
        "profile_path": "/yDglV70XMu2cBWZigp5Jxd4etfv.jpg"
    }
}