{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/oi7D7gBwTpaDqSx9jaXmkT7Yaai.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 269,
                "original_language": "fr",
                "original_title": "À bout de souffle",
                "overview": "A small-time thief steals a car and impulsively murders a motorcycle policeman. Wanted by the authorities, he attempts to persuade a girl to run away to Italy with him.",
                "popularity": 2.8408,
                "poster_path": "/9Wx0Wdn2EOqeCZU4SP6tlS3LOml.jpg",
                "release_date": "1960-03-16",
                "title": "Breathless",
                "video": false,
                "vote_average": 7.517,
                "vote_count": 1904,
                "character": "Patricia Franchini",
                "credit_id": "52fe4230c3a36847f800aaa1",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jean Dorothy Seberg",
            "ژان سبرگ"
        ],
        "biography": "Jean Dorothy Seberg (November 13, 1938 – August 30, 1979) was an American actress who lived half her life in France.\n\nShe appeared in 34 films in Hollywood and in Europe, including Saint Joan, Bonjour Tristesse, Breathless, Lilith, The Mouse That Roared, Moment to Moment, A Fine Madness, Paint Your Wagon, Airport, Macho Callahan, and Gang War in Naples.\n\nShe was also one of the best-known targets of the FBI COINTELPRO project. Her targeting was a well-documented retaliation for her support of the Black Panther Party in the 1960s.\n\nSeberg died at the age of 40 in Paris, with police ruling her death a probable suicide. Romain Gary, Seberg's second husband, called a press conference shortly after her death where he publicly blamed the FBI's campaign against Seberg for her deteriorating mental health. Gary claimed that Seberg \"became psychotic\" after the media reported a false story that the FBI planted about her becoming pregnant with a Black Panther's child in 1970. Romain Gary stated that Seberg had repeatedly attempted suicide on the anniversary of the child's death, August 25.",
        "birthday": "1938-11-13",
        "deathday": "1979-08-30",
        "gender": 1,
        "homepage": null,
        "id": 3830,
        "imdb_id": "nm0781029",
        "known_for_department": "Acting",
        "name": "Jean Seberg",
        "place_of_birth": "Marshalltown, Iowa, USA",
        "popularity": 0.6867,
        "profile_path": "/mNW6MJ5YAiFWAnH9pCmi0PjKXc.jpg"
    }
}