{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/r9oTasGQofvkQY5vlUXglneF64Z.jpg",
                "genre_ids": [
                    28,
                    35,
                    10751
                ],
                "id": 1029575,
                "original_language": "en",
                "original_title": "The Family Plan",
                "overview": "Dan Morgan is many things: a devoted husband, a loving father, a celebrated car salesman. He's also a former assassin. And when his past catches up to his present, he's forced to take his unsuspecting family on a road trip unlike any other.",
                "popularity": 24.0511,
                "poster_path": "/jLLtx3nTRSLGPAKl4RoIv1FbEBr.jpg",
                "release_date": "2023-12-14",
                "title": "The Family Plan",
                "video": false,
                "vote_average": 7.256,
                "vote_count": 1605,
                "character": "Valkyrae",
                "credit_id": "64c8cfc21fa1c8010f4dc451",
                "order": 52
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Rachell 'Valkyrae' Hofstetter",
            "Rachell Hofstetter",
            "Rachell",
            "Rachell Marie Hofstetter"
        ],
        "biography": "Rachell Hofstetter (born January 8, 1992), better known as Valkyrae, is an American live streamer and YouTuber. She is a co-owner of the gaming organization 100 Thieves and has been YouTube's most-watched female streamer since 2020.\n\nHofstetter began streaming on Twitch in 2015. She had her breakthrough by playing the competitive online game Fortnite in 2018 and joined 100 Thieves as their first female content creator. In 2020, she switched streaming platforms by signing an exclusive contract with YouTube. Later that year, she saw significant follower growth and reached her peak viewership when playing the online social deduction game Among Us, which led to her winning the Game Award for \"Content Creator of the Year\" and the Streamy Award for best live streamer. She was also named \"Gaming Creator of the Year\" by Adweek in 2021 and was included on Forbes' 30 Under 30 list in 2022.",
        "birthday": "1992-01-09",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 3832701,
        "imdb_id": "nm10758613",
        "known_for_department": "Acting",
        "name": "Valkyrae",
        "place_of_birth": "Moses Lake, Washington, USA",
        "popularity": 0.2243,
        "profile_path": "/3OEWThtxJunU2bHmeHewXFeC0hb.jpg"
    }
}