{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3ejcvnHxMFfCbnFi736cXi1ChH1.jpg",
                "genre_ids": [
                    18
                ],
                "id": 4481,
                "original_language": "fr",
                "original_title": "Manon des sources",
                "overview": "In this, the sequel to Jean de Florette, Manon has grown into a beautiful young shepherdess living in the idyllic Provencal countryside. She plots vengeance on the men who greedily conspired to acquire her father's land years earlier.",
                "popularity": 2.1524,
                "poster_path": "/1qpu6Zc1PSDL3UbDNIZJ6YuhJDW.jpg",
                "release_date": "1986-11-19",
                "title": "Manon of the Spring",
                "video": false,
                "vote_average": 7.582,
                "vote_count": 537,
                "character": "Aimée Cadoret",
                "credit_id": "52fe43c5c3a36847f806e587",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/qNBxyt60hnzBRSHo1uRkRU34fYE.jpg",
                "genre_ids": [
                    18
                ],
                "id": 4480,
                "original_language": "fr",
                "original_title": "Jean de Florette",
                "overview": "In a rural French village, an old man and his only remaining relative cast their covetous eyes on an adjoining vacant property. They need its spring water for growing their flowers, and are dismayed to hear that the man who has inherited it is moving in. They block up the spring and watch as their new neighbour tries to keep his crops watered from wells far afield through the hot summer. Though they see his desperate efforts are breaking his health and his wife and daughter's hearts, they think only of getting the water.",
                "popularity": 1.4467,
                "poster_path": "/r9UAevVU0lhRKNGlxXXUeKiRwtM.jpg",
                "release_date": "1986-08-27",
                "title": "Jean de Florette",
                "video": false,
                "vote_average": 7.689,
                "vote_count": 586,
                "character": "Aimée Cadoret, wife of Jean",
                "credit_id": "52fe43c5c3a36847f806e4a5",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Élisabeth Guignot",
            "Élisabeth Guy"
        ],
        "biography": "Élisabeth Depardieu (née Élisabeth Dominique Lucie Guignot; born 5 August 1941) is a French actress, writer, co-producer, ex-wife of actor Gérard Depardieu and mother of actors Guillaume Depardieu and Julie Depardieu.\n\nÉlisabeth Dominique Lucie Guignot was born to a well-off Parisian family and married Gérard Depardieu on 19 February 1970. They had two children together, actors Guillaume Depardieu and Julie Depardieu. The couple divorced in 1996.\n\nÉlisabeth appeared, as Elisabeth Guy, on TV and in movies. Later she appeared with Gérard Depardieu: Le tartuffe (1984), and later, while husband and wife they played husband and wife in Jean de Florette (1986). She participated at the 19th Brest European Short Film Festival in 2004 as a member of the jury.\n\nShe became Knight of the Legion of Honour in 2008.\n\nSource: Article \"Élisabeth Depardieu\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1941-08-05",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 38351,
        "imdb_id": "nm0220015",
        "known_for_department": "Acting",
        "name": "Elisabeth Depardieu",
        "place_of_birth": "Paris, France",
        "popularity": 0.8119,
        "profile_path": "/eFwpmx5OKAU9Olqrl1OsIiP37IG.jpg"
    }
}