{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yEbJs6ZLURFgAFvS8EeNrYovYHa.jpg",
                "genre_ids": [
                    18,
                    53
                ],
                "id": 15244,
                "original_language": "fr",
                "original_title": "Un condamné à mort s'est échappé",
                "overview": "A captured French Resistance fighter during World War II engineers a daunting escape from prison.",
                "popularity": 1.5509,
                "poster_path": "/gkoZ8fFib24zhB2DKpjQ09SK9FU.jpg",
                "release_date": "1956-11-11",
                "title": "A Man Escaped",
                "video": false,
                "vote_average": 7.944,
                "vote_count": 576,
                "character": "Guard on a Bike",
                "credit_id": "52fe46469251416c7507304d",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Roger Planchon (born 12 September 1931 in Saint-Chamond, Loire, died on 12 May 2009 in Paris), was a French playwright, director, and filmmaker.\n\nRoger Planchon spent his childhood in the Ardèche, notably in Dornas. He found its inspiration from his rural origins and this issue was a recurring theme in his writings.\n\nHe started on stage in 1949 after winning an amateur theater. In 1952, he founded the Théâtre de la Comédie, located in the rue des Marronniers, in Lyon. He was the director of the Théâtre de la Cité of Villeurbanne since 1957 (which became the Théâtre National Populaire in 1972).\n\nRoger Planchon transposed many works by Brecht, Molière, Shakespeare, and many works of contemporary authors, including Arthur Adamov and Michel Vinaver, but also opened the Théâtre National Populaire to Patrice Chéreau, then Georges Lavaudant.\n\nAs films, he directed George Dandin ou le Mari confondu by Molière, Louis, enfant roi, which was entered at Cannes, and another one by Lautrec.\n\nIn 2002, Christian Schiaretti succeeded him as director of the TNP; he created his own company with which he continued to write and direct until his death.\n\nHe died on 12 May 2009 after a heart attack, he is buried in the Père Lachaise Cemetery (22nd division).\n\nSource: Article \"Roger Planchon\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1931-09-12",
        "deathday": "2009-05-12",
        "gender": 2,
        "homepage": null,
        "id": 38504,
        "imdb_id": "nm0686506",
        "known_for_department": "Acting",
        "name": "Roger Planchon",
        "place_of_birth": "Saint-Chamond, Loire, France",
        "popularity": 0.1271,
        "profile_path": "/2y1MSLzHxeMfCp0NDKAvHtoWUyk.jpg"
    }
}