{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lNUP9ymEHolzjLIHyoAkpHRQZxq.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 110160,
                "original_language": "fr",
                "original_title": "Laurence Anyways",
                "overview": "The story of an impossible love between a woman named Fred and a transgender woman named Laurence who reveals her inner desire to become her true self.",
                "popularity": 2.3226,
                "poster_path": "/d8BpJ9qOQE7VFFqaV1XDdGfMsP7.jpg",
                "release_date": "2012-05-18",
                "title": "Laurence Anyways",
                "video": false,
                "vote_average": 7.65,
                "vote_count": 876,
                "character": "Michel Lafortune",
                "credit_id": "52fe4accc3a36847f81e22c9",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/vVk0HV9HAqvvSfWiNGjpsOekLBS.jpg",
                "genre_ids": [
                    18
                ],
                "id": 2567,
                "original_language": "en",
                "original_title": "The Aviator",
                "overview": "A biopic depicting the life of filmmaker and aviation pioneer Howard Hughes from 1927 to 1947, during which time he became a successful film producer and an aviation magnate, while simultaneously growing more unstable due to severe obsessive-compulsive disorder.",
                "popularity": 7.1998,
                "poster_path": "/lx4kWcZc3o9PaNxlQpEJZM17XUI.jpg",
                "release_date": "2004-12-17",
                "title": "The Aviator",
                "video": false,
                "vote_average": 7.22,
                "vote_count": 5556,
                "character": "Waiter",
                "credit_id": "57cc5f25925141598900028b",
                "order": 33
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ів Жак"
        ],
        "biography": "Yves Jacques OC (born 10 May 1956) is a Canadian film, television and stage actor.\n\nJacques was born in Quebec City in 1956. He studied theatre at the Cégep de Saint-Hyacinthe, and began acting on stage in both Quebec City and Montreal. He became more widely known to film and television audiences beginning in 1981 as a sketch performer in Télévision de Radio-Canada's annual Bye Bye New Year's Eve variety special, and soon began appearing more widely in film and television roles. To international audiences, he is best known as Claude, the gay academic in Denys Arcand's The Decline of the American Empire and The Barbarian Invasions. On stage, he is noted for originating the role of Lydie-Anne in the premiere of Michel Marc Bouchard's play Lilies.\n\nHe has been in several movies by French filmmaker Claude Miller, including Of Woman and Magic and Little Lili. His fame has continued to grow with films and theatrical productions in both France and Quebec. Since 2001, he has toured the world in two shows by Robert Lepage, Far Side of the Moon (La Face cachée de la lune) and Le Projet Andersen, where he played all the roles. Since 2018, he has appeared regularly in Mathieu Quesnel’s theatrical creations. More recently, he played in Aline by Valérie Lemercier, in Maria by Alec Pronovost, and in Chloé Robichaud’s Les jours heureux. In 2022, Yves Jacques played in Martin Villeneuve's The 12 Tasks of Imelda (Les 12 travaux d'Imelda), co-starring playwright Robert Lepage and actress-signer Ginette Reno.\n\nHe was named Chevalier de l’Ordre des Arts et des Lettres by the Ministère de la Culture et de la Communication de France in February 2001, and was appointed an Officer of the Order of Canada in 2009, for his performances in theatre, television and film, in Canada and abroad.\n\nHe is openly gay.\n\nSource: Article \"Yves Jacques\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1956-05-10",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.agencegoodwin.com/artistes/yves-jacques",
        "id": 38529,
        "imdb_id": "nm0415191",
        "known_for_department": "Acting",
        "name": "Yves Jacques",
        "place_of_birth": "Québec City, Québec, Canada",
        "popularity": 0.083,
        "profile_path": "/69P0T544kWgzuxvOqHYmLpLZdqI.jpg"
    }
}