{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cgrQefMZspzBD2HXmZ8LYoCuN5m.jpg",
                "genre_ids": [
                    18,
                    10402
                ],
                "id": 16620,
                "original_language": "en",
                "original_title": "La Bamba",
                "overview": "Los Angeles teenager Ritchie Valens becomes an overnight rock 'n' roll success in 1958, thanks to a love ballad called \"Donna\" that he wrote for his girlfriend. But as his star rises, Valens has conflicts with his jealous brother, Bob, and becomes haunted by a recurring nightmare of a plane crash just as he begins his first national tour alongside Buddy Holly.",
                "popularity": 3.6443,
                "poster_path": "/6Znulqtc7cdqlUC69HGf26Ef5fi.jpg",
                "release_date": "1987-07-24",
                "title": "La Bamba",
                "video": false,
                "vote_average": 7.272,
                "vote_count": 744,
                "character": "Ritchie Valens",
                "credit_id": "52fe46e09251416c7508689b",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Лу Даймонд Филлипс",
            "Lou Diamond Upchurch",
            "Lou Diamond",
            "Louis Gem Phips",
            "Louis Diamond Phillips",
            "Louis Diamond Upchurch",
            "لو دایموند فیلیپس"
        ],
        "biography": "Lou Diamond Phillips is an American film, television, and stage actor as well as director and writer. His breakthrough role came when he starred as Ritchie Valens in the film La Bamba. His other best known film roles are as Jose Chavez y Chavez in Young Guns I and II, Angel Guzman in Stand and Deliver for which he earned a supporting actor Golden Globe Award nomination, Hank Storm in Renegades, Jesse Rainfeather Goldman in Sioux City in which he was also director, Staff Sergeant John Monfriez in Courage Under Fire, Roy Knox in Brokedown Palace, and Wanda in Hollywood Homicide. He has also starred in many TV movies.\n\nHis best known TV roles are as Lt. Gil Arroyo on Prodigal Son, Henry Standing Bear on Longmire, Col. David Telford on Stargate Universe, Agent Ian Edgerton on Numb3rs, and John Kanin on Wolf Lake. He voices for animated series as Chief Bill Bayani on Firebuds, Victor Delgado on Elena of Valor, and Surak on The Lion Guard.\n\nHe's had recurring roles on TV shows including Trese, Blindspot, Blue Bloods, Goliath, NCIS: New Orleans, Brooklyn Nine-Nine, The Ranch, Southland, George Lopez, and 24. He has starred as himself on Cougar Town and You're the Worst. He's also guest starred on a number of shows including Bull, The Cleaning Lady, Search Party, Criminal Minds, Graves, Training Day, Ironside, Chuck, Psych, Law & Order: SVU, The Handler, The Twilight Zone (2002), Spin City, The Outer Limits, Tales from the Crypt, Miami Vice, and Dallas (1985).\n\nHe earned a Tony Award nomination for his role in The King and I. Outside of acting, he has become notable for finishing 186th in the 2009 World Series of Poker World Championships \"No Limit Texas hold 'em\" main event.",
        "birthday": "1962-02-17",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 38560,
        "imdb_id": "nm0001617",
        "known_for_department": "Acting",
        "name": "Lou Diamond Phillips",
        "place_of_birth": "Subic Bay Naval Base, Olongapo City, Zambales, Philippines",
        "popularity": 1.4072,
        "profile_path": "/yqGZwaGe8XgoxfO7zmx7weGBaXZ.jpg"
    }
}