{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jVzoKlWUpsKV3y5oLafLQhEvgX6.jpg",
                "genre_ids": [
                    14,
                    18,
                    9648
                ],
                "id": 5961,
                "original_language": "sv",
                "original_title": "Fanny och Alexander",
                "overview": "As children in the loving Ekdahl family, Fanny and Alexander enjoy a happy life with their parents, who run a theater company. After their father dies unexpectedly, however, the siblings end up in a joyless home when their mother, Emilie, marries a stern bishop. The bleak situation gradually grows worse as the bishop becomes more controlling, but dedicated relatives make a valiant attempt to aid Emilie, Fanny and Alexander.",
                "popularity": 2.0306,
                "poster_path": "/q8jlA3Wc1Z987hNKRFA44g5OugC.jpg",
                "release_date": "1982-12-17",
                "title": "Fanny and Alexander",
                "video": false,
                "vote_average": 7.8,
                "vote_count": 817,
                "character": "Oscar Ekdahl",
                "credit_id": "52fe4432c3a36847f8087e9f",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/48y1eAboPFgt7rKcynRAPPvtJ1E.jpg",
                "genre_ids": [
                    18
                ],
                "id": 24657,
                "original_language": "sv",
                "original_title": "Offret",
                "overview": "Alexander, a journalist, philosopher and retired actor, celebrates a birthday with friends and family when it is announced that nuclear war has begun.",
                "popularity": 2.3877,
                "poster_path": "/8JMh27z075ZHbFE85XYkdXF2QkK.jpg",
                "release_date": "1986-05-09",
                "title": "The Sacrifice",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 572,
                "character": "Otto",
                "credit_id": "52fe44a2c3a368484e02e377",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/pcBIabUibUmpOBggWckkjohXtiP.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 11656,
                "original_language": "sv",
                "original_title": "Jungfrukällan",
                "overview": "Devout Christians Töre and Märeta send their only daughter, the virginal Karin, and their foster daughter, the unrepentant Ingeri, to deliver candles to a distant church. On their way through the woods, the girls encounter a group of savage goat herders who brutally rape and murder Karin as Ingeri remains hidden. When the killers unwittingly seek refuge in the farmhouse of Töre and Märeta, Töre plots a fitting revenge.",
                "popularity": 2.3802,
                "poster_path": "/z70YM3Y4pNYZATMhFMKonngaeMC.jpg",
                "release_date": "1960-02-08",
                "title": "The Virgin Spring",
                "video": false,
                "vote_average": 7.849,
                "vote_count": 634,
                "character": "Beggar",
                "credit_id": "52fe44729251416c7503507b",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Аллан Эдвалль"
        ],
        "biography": "Johan Allan Edwall (25 August 1924 – 7 February 1997) was a Swedish actor, director, author, composer and singer, best-known outside Sweden for the small roles he played in some of Ingmar Bergman's films, such as Fanny and Alexander (1982). He found his largest audience in the Scandinavian countries for playing lovable characters in several of the film and TV adaptations of the children's stories by Astrid Lindgren. He attended Stockholm's Royal Dramatic Training Academy from 1949 to 1952. During his long career he appeared in over 400 works. At the 10th Guldbagge Awards in 1974, he won the award for Best Actor for his role as Emil's short-tempered father Anton Svensson in Emil and the Piglet.\n\nHis 1984 film Åke and His World was entered into the 14th Moscow International Film Festival.\n\nIn his self-written songs, he frequently attacked the injustices of society. The music is similar to folk music often using violin and accordion. He won a Swedish Grammy posthumously in 2006.\n\nEdwall also owned a theatre, Teater Brunnsgatan Fyra in Stockholm, which he bought in 1986 and operated until his death in 1997 of prostate cancer (it is now managed by Kristina Lugn’s daughter Martina Montelius). [citation needed]He was the father of photographer Mattias Edwall and stage director, actor and musician Måns Edwall (1960–2016). Acting colleague Erland Josephson wrote about him in Expressen after his death: \"He was odd. But, damn it, he managed to be odd in a universal way!\"",
        "birthday": "1924-08-25",
        "deathday": "1997-02-07",
        "gender": 2,
        "homepage": null,
        "id": 3857,
        "imdb_id": "nm0249735",
        "known_for_department": "Acting",
        "name": "Allan Edwall",
        "place_of_birth": "Rödön, Jämtlands län, Sweden",
        "popularity": 0.7391,
        "profile_path": "/tleoCES9SH3D6Z8Vp8PcGzu5Rzt.jpg"
    }
}