{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mW6XzxelLY8T2oW2NjciG9LpZT5.jpg",
                "genre_ids": [
                    12,
                    53,
                    878
                ],
                "id": 2756,
                "original_language": "en",
                "original_title": "The Abyss",
                "overview": "A civilian oil rig crew is recruited to conduct a search and rescue effort when a nuclear submarine mysteriously sinks. One diver soon finds himself on a spectacular odyssey 25,000 feet below the ocean's surface where he confronts a mysterious force that has the power to change the world or destroy it.",
                "popularity": 8.9732,
                "poster_path": "/2dCit3XAtv9KWCJvRKdPkJ0FAkH.jpg",
                "release_date": "1989-08-09",
                "title": "The Abyss",
                "video": false,
                "vote_average": 7.347,
                "vote_count": 3203,
                "character": "Gerard Kirkhill",
                "credit_id": "52fe436ac3a36847f8052941",
                "order": 18
            },
            {
                "adult": false,
                "backdrop_path": "/mOsg2l9zq315ouw55rbNATSwgU1.jpg",
                "genre_ids": [
                    18
                ],
                "id": 10950,
                "original_language": "en",
                "original_title": "I Am Sam",
                "overview": "Sam, a neurodivergent man, has a daughter with a homeless woman who abandons them when they leave the hospital, leaving Sam to raise Lucy on his own. But as Lucy grows up, Sam's limitations as a parent start to become a problem and the authorities take her away. Sam convinces high-priced lawyer Rita to take his case pro bono and in turn teaches her the value of love and family.",
                "popularity": 5.113,
                "poster_path": "/3MUXRSyx9gnA2lLSSTGLN8cQQ42.jpg",
                "release_date": "2001-12-28",
                "title": "I Am Sam",
                "video": false,
                "vote_average": 7.561,
                "vote_count": 2366,
                "character": "Judge Philip McNeily",
                "credit_id": "59491664c3a368265f033e18",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Ken Jenkins (born August 28, 1940) is an American actor, best known for his role as Dr. Bob Kelso, the curmudgeonly Chief of Medicine on the American comedy Scrubs.\n\nIn 1969, he co-founded the Actors Theatre of Louisville and served as the Associate Artistic Director for three years. This institution has produced playwrights such as Beth Henley and Marsha Norman. Jenkins previously appeared on the series Adult Math, as well as episodes of Homefront, The X-Files (episode \"Medusa\", season 8), Babylon 5 and \"Evolution\", the Season three premiere episode of Star Trek: The Next Generation \"Sliders\" (2 episodes, 1999–2000) Dust (2000) TV episode .... Professor Jack Bigelow - Revelations (1999) TV episode .... Robert Clark.\n\nHe has appeared in the movies Executive Decision, The Abyss, Air America, Last Man Standing, Fled, Gone in 60 Seconds, I Am Sam, The Sum of All Fears, Matewan, Courage Under Fire and the 1998 remake of Psycho. He appeared as the father of Fran Goldsmith in Stephen King's TV miniseries, The Stand. Jenkins also had a role in Clockstoppers.\n\nJenkins can sing and play the acoustic guitar, and is seen doing so on the Scrubs episodes \"My Tuscaloosa Heart\" and \"My Musical\".\n\nJenkins also has a recurring role on Cougar Town since October 27, 2010 as Jules' (played by Courteney Cox) father.\n\nDescription above from the Wikipedia article Ken Jenkins, licensed under CC-BY-SA, full list of contributors on Wikipedia. ​",
        "birthday": "1940-08-28",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 38570,
        "imdb_id": "nm0420898",
        "known_for_department": "Acting",
        "name": "Ken Jenkins",
        "place_of_birth": "Dayton, Ohio, USA",
        "popularity": 0.4212,
        "profile_path": "/basRrWk50y03ydjm0DW8A6AxH1o.jpg"
    }
}