{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/scNssnn5PN99fBODNzxF5qN4Iw8.jpg",
                "genre_ids": [
                    16,
                    28,
                    878,
                    53
                ],
                "id": 16234,
                "original_language": "en",
                "original_title": "Batman Beyond: Return of the Joker",
                "overview": "The Joker is back with a vengeance, and Neo-Gotham's Dark Knight, Terry McGinnis, needs answers as he stands alone to face the old Gotham's most infamous Clown Prince of Crime.",
                "popularity": 4.3331,
                "poster_path": "/rsqoX8tA6vD8kvJSQwLN8Df55nk.jpg",
                "release_date": "2000-12-12",
                "title": "Batman Beyond: Return of the Joker",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1148,
                "character": "Chelsea Cunningham (voice)",
                "credit_id": "57dee39c9251413da30080e5",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Rachael Gillies",
            "Rachel Leigh Cook",
            "레이첼 리 쿡",
            "レイチェル・リー・クック",
            "ریچل لی کوک"
        ],
        "biography": "Rachael Leigh Cook (born October 4, 1979) is an American actress, model, voice artist, and producer. She  is best known for her starring film roles as Laney Boggs in She's All That (1999), Doreen Carter in Get Carter (2000), Josie McCoy in Josie and the Pussycats (2001), as well as TV roles as Kate Moretti on Perception, and Clara Wheeler on Into the West.\n\nShe had recurring roles as Penny Posin on Las Vegas, Abigail Lytar on Psych, and the voice of Lt. Jodi Yanarelli on Titan Maximum. She is also the voice behind various characters in Robot Chicken and Tifa Lockhart in the English version of Final Fantasy VII: Advent Children.\n\nShe has produced and starred in multiple TV movies.\n\nShe first appeared in a public service announcement for foster care at seven years of age, and began working as a child print model at the age of 10, most notably in nationwide advertisements for Target and appearing on the boxes of Milk-Bone dog biscuits.  She married actor Daniel Gillies in August 2004, after less than a year of dating. They have one daughter, Charlotte Easton Gillies, born in September 2013.",
        "birthday": "1979-10-04",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 38581,
        "imdb_id": "nm0000337",
        "known_for_department": "Acting",
        "name": "Rachael Leigh Cook",
        "place_of_birth": "Minneapolis, Minnesota, USA",
        "popularity": 1.1679,
        "profile_path": "/xmKFPYw8OcN7g7B3zU1ZJOVKfqC.jpg"
    }
}