{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2tcTm5oRlRN5fKFvY4Gbrwp8h38.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 363088,
                "original_language": "en",
                "original_title": "Ant-Man and the Wasp",
                "overview": "Just when his time under house arrest is about to end, Scott Lang once again puts his freedom at risk to help Hope van Dyne and Dr. Hank Pym dive into the quantum realm and try to accomplish, against time and any chance of success, a very dangerous rescue mission.",
                "popularity": 11.0667,
                "poster_path": "/cFQEO687n1K6umXbInzocxcnAQz.jpg",
                "release_date": "2018-07-04",
                "title": "Ant-Man and the Wasp",
                "video": false,
                "vote_average": 6.913,
                "vote_count": 13746,
                "character": "Pier 39 Pedestrian (uncredited)",
                "credit_id": "688c13f117ec4cd512de5d4f",
                "order": 75
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Corey Semple"
        ],
        "biography": "Corey Alex Seaver (he/they) commenced acting in 2017 as a recurring high school extra on the second season of the Netflix series 13 Reasons Why (Anonymous Content). About halfway through production, their first film appearance arrived as background in the Marvel Cinematic Universe entry Ant-Man and the Wasp.\n\nFollowing this, opportunities began piling up and, following completion of aforementioned series' third season, Seaver obtained speaking roles in student and independent films, as well as taking scene study courses at the Beverly Hills Playhouse. Among their repertoire includes The OA, Always Be My Maybe and A Taiwanese Tale of Two Cities (Netflix), Wheels of Fortune and A Christmas Mystery (ESX), Earth Mama (Park Pictures), Fremont (Blue Morning), I'm a Virgo (Media Res), Freaky Tales (eOne), The Lost Son Returns as the Duke (ReelShort), The Tutors (Galatea TV), and Artificial (Amazon/Heyday).\n\nWhether it be an encyclopediac knowledge of the cinematic art or a devotion to the cult TV series Mystery Science Theater 3000 and its spiritual successor RiffTrax, Seaver is well versed in pop culture, has an enthusiasm for musical theatre, and watches a wide variety of film genres (they're very active on Letterboxd, under the username 'zapp_rowsdower'). They've penned short stories since junior high, and have only in the past few years advanced to screenplays. As of 2025, they aspire to finance, direct, and star in a short comedy-drama, Alright, as well as a number of smaller projects.",
        "birthday": "1999-04-22",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 3868761,
        "imdb_id": "nm13255837",
        "known_for_department": "Acting",
        "name": "Corey Seaver",
        "place_of_birth": "San Francisco, California, USA",
        "popularity": 0.0538,
        "profile_path": null
    }
}