{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bxQT6xCjejpGtgKl0QH8WUtrs33.jpg",
                "genre_ids": [
                    18,
                    53
                ],
                "id": 7735,
                "original_language": "de",
                "original_title": "Die Welle",
                "overview": "A school teacher discusses types of government with his class. His students find it too boring to repeatedly go over national socialism and believe that dictatorship cannot be established in modern Germany. He starts an experiment to show how easily the masses can become manipulated.",
                "popularity": 3.9839,
                "poster_path": "/vtJ4u0fpTZhibxAJHzXtcdCxhsL.jpg",
                "release_date": "2008-03-13",
                "title": "The Wave",
                "video": false,
                "vote_average": 7.487,
                "vote_count": 3456,
                "character": "Marco",
                "credit_id": "52fe4484c3a36847f809aae3",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/aCNfKTJstRM5LjbLRy2s3cOnNkE.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 167581,
                "original_language": "de",
                "original_title": "Freier Fall",
                "overview": "A promising career with the police, a baby on the way... Marc's life seems to be right on track. Then he meets fellow policeman Kay and during their regular jogs Marc experiences a never-before-felt sense of ease and effortlessness – and what it means to fall in love with another man.",
                "popularity": 3.1227,
                "poster_path": "/77n2MlfdzgIlktWvvVS9Zvdx00q.jpg",
                "release_date": "2013-05-27",
                "title": "Free Fall",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 816,
                "character": "Kay Engel",
                "credit_id": "52fe4cb5c3a36847f823b611",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Макс Римельт",
            "馬可斯·尼麥特"
        ],
        "biography": "Max Riemelt (born in East Berlin, East Germany on 7 January 1984) is a German actor. Internationally, he is best known for playing Wolfgang Bogdanow in the television series Sense8. He is also well-known for acting in movies such as Before the Fall (2004), The Wave (2008) and Free Fall (2013). At the 2004 Karlovy Vary International Film Festival, he won the best actor award for ‘Napola’ and in the 2006 Bavarian Film Awards, he won the best young actor award for ‘Der Rote Kakadu’.\n\nRiemelt's career began in Germany at the age of 13, in the TV productions Eine Familie zum Küssen and Praxis Bülowbogen. The following year Riemelt played his first leading role in the ZDF Christmas series Zwei allein (director: Matthias Steurer): the Waisenkind \"Max Loser\". In the video for the title song \"Two of a Kind\" by the Hamburg duo \"R & B\", Riemelt has a cameo appearance. He has starred in all of Dennis Gansel's feature films, starting with Mädchen, Mädchen. In 2013, he starred in the movie Free Fall with Hanno Koffler, in which he plays Kay Engel, a police officer in training. The movie depicts a gay love story and has been compared to Brokeback Mountain.\n\nFrom 2015 to 2018, he starred in The Wachowskis' Netflix series Sense8, playing Wolfgang Bogdanow, a German safe cracker. The first season received positive reviews from critics. In 2020, he joined the cast of The Matrix 4.",
        "birthday": "1984-01-07",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.maxriemelt.com/",
        "id": 38773,
        "imdb_id": "nm0726262",
        "known_for_department": "Acting",
        "name": "Max Riemelt",
        "place_of_birth": "Berlin, Germany",
        "popularity": 0.7157,
        "profile_path": "/qFwwLIafzvRfytWnphxYMg2RLvU.jpg"
    }
}