{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wSiBXaJ2PtlxUGH2waIxQZjFPhg.jpg",
                "genre_ids": [
                    28,
                    12,
                    35,
                    80
                ],
                "id": 11576,
                "original_language": "en",
                "original_title": "It's a Mad, Mad, Mad, Mad World",
                "overview": "A group of strangers come across a man dying after a car crash who proceeds to tell them about the $350,000 he buried in California. What follows is the madcap adventures of those strangers as each attempts to claim the prize for himself.",
                "popularity": 7.3665,
                "poster_path": "/j4mWzOisSHFkaqIkq34l2mm8a5K.jpg",
                "release_date": "1963-11-07",
                "title": "It's a Mad, Mad, Mad, Mad World",
                "video": false,
                "vote_average": 6.97,
                "vote_count": 637,
                "character": "Driver run off highway",
                "credit_id": "52fe445f9251416c75032741",
                "order": 42
            },
            {
                "adult": false,
                "backdrop_path": "/eEKpOowAkVAF3sKJKqY2h4h12GV.jpg",
                "genre_ids": [
                    16,
                    10751
                ],
                "id": 11360,
                "original_language": "en",
                "original_title": "Dumbo",
                "overview": "Dumbo is a baby elephant born with over-sized ears and a supreme lack of confidence. But thanks to his even more diminutive buddy Timothy the Mouse,  the pint-sized pachyderm learns to surmount all obstacles.",
                "popularity": 6.1124,
                "poster_path": "/4x9FmvdJ464Fg7A9XcbYSmxfVw3.jpg",
                "release_date": "1941-10-31",
                "title": "Dumbo",
                "video": false,
                "vote_average": 6.991,
                "vote_count": 5131,
                "character": "Specks Crow (voice) (uncredited)",
                "credit_id": "673751f9a102d269c03f242a",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Nicodemus",
            "Nicodemus Stewart",
            "Nick O'Demus",
            "Horace Winfred \"Nick\" Stewart",
            "Horace Winfred Stewart"
        ],
        "biography": "Horace Winfred \"Nick\" Stewart (March 15, 1910 – December 18, 2000) also billed as Nick O'Demus was an American television and film actor. Stewart was known for his role as Lightnin' (Willie Jefferson) on TV's The Amos 'n' Andy Show.\n\nNick Stewart was born on March 15, 1910, in Harlem, New York City, to Joseph (March 15, 1888 – July 1976) and Eva Stewart, who were recent immigrants from Barbados, British West Indies. He began his show business career as a dancer at the Cotton Club and Hoofers Club. Stewart also was a veteran of Broadway shows, having created a comedic character he called \"Nicodemus\" and playing that role in Swingin' the Dream and Louisiana Purchase, as well as in the film Go West, Young Man. Stewart also performed comedy as a cast member of the Rudy Vallée radio show in 1941. Other acting credits include the 1936 movie Go West Young Man, the voice of Br'er Bear in the 1946 Disney movie Song of the South, and Willy-Willy on the television series Ramar of the Jungle. Also in 1954, Stewart had an important role in The Reign of Amelika Joe presented by Fireside Theatre. He also won a comedy role in White Christmas (1954).\n\nHe was originally offered the role of Calhoun the lawyer, which he turned down. (After his refusal, it went to Johnny Lee, who had the role on radio since 1949.) Soon Gosden and Correll were back on the telephone, this time offering Stewart the role of Lightnin' on the television show. Stewart accepted the role with one idea in mind: to make enough money to be able to open his theater where African Americans would not be typecast as maids and porters. In the 1960s, he would have small roles in Mister Ed and the classic comedy film, It's a Mad, Mad, Mad, Mad World (1963) as the Migrant Truck Driver who is forced off of the road. In 1987, Doris McMillon devoted an entire week of her nightly talk show, On the Line, to a discussion of the documentary Amos 'n' Andy: Anatomy of a Controversy, and the issues surrounding the shows. Stewart was one of the participants, discussing the show and his role in it. He also had a role in the movie Carmen Jones.\n\nStewart's final acting role would be returning to Disney to reprise the voice role of Br'er Bear for the theme park attraction Splash Mountain, which is based on the animated segments of Song of the South. He was the only actor to return and voice his character from the aforementioned movie. In an interview with author Jim Korkis, he was asked about whether or not his role of Br'er Bear was degrading. He replied, \"Disney treated us like Kings.\" He went on to say that the money he earned from Song of the South was donated to a theatre for African-American actors to play roles other than maids and butlers, and was doing the same with the money from reprising his role for the Disneyland attraction.",
        "birthday": "1910-03-15",
        "deathday": "2000-12-18",
        "gender": 2,
        "homepage": null,
        "id": 388960,
        "imdb_id": "nm0829695",
        "known_for_department": "Acting",
        "name": "Nick Stewart",
        "place_of_birth": "New York City, New York, U.S.",
        "popularity": 0.5025,
        "profile_path": "/dA7Vhz9JowxyqOTJVipvzff1Fph.jpg"
    }
}