{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4zJ9w3lZcZI3mBXcNiq6s8bqpDO.jpg",
                "genre_ids": [
                    18,
                    10749,
                    80
                ],
                "id": 2786,
                "original_language": "fr",
                "original_title": "Pierrot le fou",
                "overview": "Pierrot escapes his boring society and travels from Paris to the Mediterranean Sea with Marianne, a girl chased by hit-men from Algeria. They lead an unorthodox life, always on the run.",
                "popularity": 1.9171,
                "poster_path": "/i124H6iQB4CawrgFW9aZaZs7OBO.jpg",
                "release_date": "1965-11-05",
                "title": "Pierrot le Fou",
                "video": false,
                "vote_average": 7.368,
                "vote_count": 896,
                "character": "L'Exilé Politique (uncredited)",
                "credit_id": "52fe436dc3a36847f80535cd",
                "order": 17
            },
            {
                "adult": false,
                "backdrop_path": "/iOUhnp01rP9Xr5QG66LMAKSDkYv.jpg",
                "genre_ids": [
                    18,
                    878,
                    9648
                ],
                "id": 8072,
                "original_language": "fr",
                "original_title": "Alphaville, une étrange aventure de Lemmy Caution",
                "overview": "Lemmy Caution is on a mission to eliminate Professor Von Braun, the creator of a malevolent computer that rules the city of Alphaville. Befriended by the scientist’s daughter Natasha, Lemmy must unravel the mysteries of the strictly logical Alpha 60 and teach Natasha the meaning of the word “love.”",
                "popularity": 1.8669,
                "poster_path": "/fFJP3D5fJDFxN7ChqSye1DZ0fTL.jpg",
                "release_date": "1965-05-05",
                "title": "Alphaville",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 578,
                "character": "Chief Engineer (uncredited)",
                "credit_id": "55fb7268c3a36826e5000ed9",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/68NGFE8zD2gaQVH6MqJeKzojFJM.jpg",
                "genre_ids": [
                    18
                ],
                "id": 1626,
                "original_language": "fr",
                "original_title": "Vivre sa vie: film en douze tableaux",
                "overview": "Twelve episodic tales in the life of a Parisian woman and her slow descent into prostitution.",
                "popularity": 1.954,
                "poster_path": "/A0BjScjASfMFgyGI5sU0CwfKh3l.jpg",
                "release_date": "1962-09-20",
                "title": "Vivre Sa Vie",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 671,
                "character": "Injured Man (uncredited)",
                "credit_id": "57924be69251410cbb0010f5",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Laslo Szabo"
        ],
        "biography": "László Szabó (born 24 March 1936) is a Hungarian actor, film director and screenwriter. Since 1952, he has appeared in more than 120 films. These include seven films that have been screened at the Cannes Film Festival.\n\nHe was born to Béla Szabó and Margit Gulyás.\n\nBetween 1954-1956 he was a student at the Budapest University of Technology , during which he performed in an amateur theater group. He applied to the Theater and Film Academy as an actor, but was not accepted. He left the country in the fall of 1956 and went to Paris .\n\nLike the French new wavers, he also visited Henri Langlois ' \"liberty university of film history\" at the Cinématheque, watched the film series, met and talked to the directors who presented their films, and while writing in the \"cahiers\", interviewed Buster Keaton together with Jacques Rivette . He and a friend dropped by on the set of Chabrol (Cousins), from whom he immediately received a one-sentence role. And in his next film, Locked with the Key , a longer one. After that, Godard gave him the role of the interrogator in The Little Soldier , which was followed by other roles in more recent Godard films.\n\nHe is the favorite character actor of all the directors of the new wave, everyone has a role for him, they entrust him with strange, boho characters, who always have some disturbing and annoying ulterior motives.\n\nHe also took a liking to directing, and made two new-wave French films. Truffaut wrote an appreciative review of the amusing film noir The White Gloves of the Devil . Zig-Zig was played by the new wave's favorite anti-star actress, Bernadette Lafont , and a cool star, Catherine Deneuve . This is also where the self-confidence and sardonic pungency of the new wavers can be felt. Like all actor-directors, he brought out the best in his actresses, skillfully mixing dark humor and tenderness.\n\nIn the meantime, from the end of the 1960s he appeared in Hungarian films, and after many character roles, he got the lead role from Zsolt Kézdi-Kovács : Miklós Dibusz, the big snooty, sumák organizer, The nice neighbor .\n\nHis first and so far the only Hungarian-French direction was based on Nándor Gion's novel: Sortűz for a Black Buffalo , and his first and so far only Hungarian direction: The Man Who Slept During the Day",
        "birthday": "1936-03-24",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 38899,
        "imdb_id": "nm0844435",
        "known_for_department": "Acting",
        "name": "László Szabó",
        "place_of_birth": "Budapest, Hungary",
        "popularity": 0.5755,
        "profile_path": "/5kGcihh33EjWxZWQCCMywvKrbpC.jpg"
    }
}