{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2Ae0iV2HR3Raoras8G40MjBtJnn.jpg",
                "genre_ids": [
                    18,
                    14,
                    10749
                ],
                "id": 648,
                "original_language": "fr",
                "original_title": "La Belle et la Bête",
                "overview": "The story of a gentle-hearted beast in love with a simple and beautiful girl. She is drawn to the repellent but strangely fascinating Beast, who tests her fidelity by giving her a key, telling her that if she doesn't return it to him by a specific time, he will die of grief. She is unable to return the key on time, but it is revealed that the Beast is the genuinely handsome one. A simple tale of tragic love that turns into a surreal vision of death, desire, and beauty.",
                "popularity": 1.7201,
                "poster_path": "/iYSe3yrkma0e1B0wWPXgr8w5sDN.jpg",
                "release_date": "1946-10-29",
                "title": "Beauty and the Beast",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 635,
                "character": "Footman (uncredited)",
                "credit_id": "65bfbf735cd16e017c9dd04b",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/1yWn9A2LN0uRGudIg0bV2Np6T69.jpg",
                "genre_ids": [
                    10752,
                    28,
                    18
                ],
                "id": 9289,
                "original_language": "en",
                "original_title": "The Longest Day",
                "overview": "The retelling of June 6, 1944, from the perspectives of the Germans, US, British, Canadians, and the Free French. Marshall Erwin Rommel, touring the defenses being established as part of the Reich's Atlantic Wall, notes to his officers that when the Allied invasion comes they must be stopped on the beach. \"For the Allies as well as the Germans, it will be the longest day\"",
                "popularity": 3.7565,
                "poster_path": "/5zmvEofdIlgXrQl9A7e5IOzlnFU.jpg",
                "release_date": "1962-09-25",
                "title": "The Longest Day",
                "video": false,
                "vote_average": 7.594,
                "vote_count": 977,
                "character": "Cmdr. Philippe Kieffer - Commando Leader",
                "credit_id": "57538d2392514126d00013ff",
                "order": 36
            },
            {
                "adult": false,
                "backdrop_path": "/9Qs9oyn4iE8QtQjGZ0Hp2WyYNXT.jpg",
                "genre_ids": [
                    18,
                    10752
                ],
                "id": 28,
                "original_language": "en",
                "original_title": "Apocalypse Now",
                "overview": "At the height of the Vietnam war, Captain Benjamin Willard is sent on a dangerous mission that, officially, \"does not exist, nor will it ever exist.\" His goal is to locate - and eliminate - a mysterious Green Beret Colonel named Walter Kurtz, who has been leading his personal army on illegal guerrilla missions into enemy territory.",
                "popularity": 8.7178,
                "poster_path": "/gQB8Y5RCMkv2zwzFHbUJX3kAhvA.jpg",
                "release_date": "1979-05-19",
                "title": "Apocalypse Now",
                "video": false,
                "vote_average": 8.271,
                "vote_count": 8641,
                "character": "Hubert de Marais",
                "credit_id": "6866be13b23c335cc3789d2f",
                "order": 40
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Christian Marquant"
        ],
        "biography": "Christian Marquand (15 March 1927 – 22 November 2000) was a French actor, screenwriter and film director. Born in Marseille, he was born to a Spanish father and an Arab mother, and his sister was film director Nadine Trintignant. He was often cast as a heartthrob in French films of the 1950s.\n\nMarquand's first film appearance was in 1946, as a footman in Jean Cocteau's Beauty and the Beast (La Belle et la Bête). After a few more small parts, he was prominently featured in Christian-Jaque's Lucrèce Borgia (1953) as one of Lucrezia's lovers, and as an Austrian soldier in Luchino Visconti's Senso (1954).\n\nIn 1956, he was directed by Roger Vadim in And God Created Woman (Et Dieu... créa la femme) opposite Brigitte Bardot. That film's success led to starring roles in the movies No Sun in Venice (1957), Temptation (1959), and The Big Show (1960) and leads opposite actresses Maria Schell, Jean Seberg, and Annie Girardot.\n\nIn 1962, Marquand appeared as French Naval Commando leader Philippe Kieffer in Darryl F. Zanuck's World War II movie The Longest Day, which led to further roles in international productions such as Behold a Pale Horse (1964), Lord Jim (1965) and The Flight of the Phoenix (1965).\n\nHe appeared in feature films and television throughout the 1970s, and played a French plantation owner in Francis Ford Coppola's re-edited Vietnam war epic Apocalypse Now Redux (1979/2001). His last performance was in a 1987 French TV mini-series. He directed two films, Les Grands Chemins (1963) and the all-star sex farce Candy (1968).\n\nMarquand was married to French actress Tina Aumont from 1963 to 1966, marrying her when she was 17 and he was 36. In the 1970s, he lived with French actress Dominique Sanda, 21 years his junior, with whom he had a son, Yann. He was a close friend of Marlon Brando, who named his son Christian after him, as did French director Roger Vadim.\n\nMarquand died near Paris of Alzheimer's disease, aged 73.\n\nSource: Article \"Christian Marquand\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1927-03-15",
        "deathday": "2000-11-22",
        "gender": 2,
        "homepage": null,
        "id": 38914,
        "imdb_id": "nm0549650",
        "known_for_department": "Acting",
        "name": "Christian Marquand",
        "place_of_birth": "Marseille, Bouches-du-Rhône, France",
        "popularity": 0.2542,
        "profile_path": "/sDmro3JOBKUHBkC08UVhjNpBugR.jpg"
    }
}