{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jXPrGgk6PypAsv8IPq8NqlQi6ts.jpg",
                "genre_ids": [
                    35,
                    80,
                    10749
                ],
                "id": 3001,
                "original_language": "en",
                "original_title": "How to Steal a Million",
                "overview": "A woman must steal a statue from a Paris museum to help conceal her father's art forgeries.",
                "popularity": 5.0699,
                "poster_path": "/xaf3pwmITJvfz9Ab8DiGM8OOtBC.jpg",
                "release_date": "1966-07-13",
                "title": "How to Steal a Million",
                "video": false,
                "vote_average": 7.489,
                "vote_count": 623,
                "character": "Guard",
                "credit_id": "5871599dc3a3684f0e00e622",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "François Alexandre Galépidès"
        ],
        "biography": "François-Alexandre Galepides, known by the stage name Moustache, was a French actor and jazz drummer of Greek descent. He was born 14 February 1929 in Paris and died 25 March 1987 in Arpajon in a car accident.\n\nIn 1948 he joined Lorient, the orchestra of Claude Luter, as a drummer, playing in clubs of Saint-Germain-des-Prés. He also regularly accompanied Sidney Bechet in France.\n\nFrom 1950, he led his own bands (Les sept complices and Les gros minets). With the group Moustache et ses Moustachus, from 1956, he recorded, as a drummer and singer, several rock'n'roll novelty songs (e.g. \"Le Croque-Skull-Creux\", on a text by Boris Vian).\n\nIn 1978, he formed the group Les petits Français (including Marcel Zanini, Michel Attenoux and François Guin), which recorded, among other things, jazz pieces by Georges Brassens.\n\nIn parallel, Moustache had a career as a restaurateur (the restaurant Moustache, Avenue Duquesne Paris), head of clubs (in the 1960s, The Bilboquet and in 1976, The Jazz Club at the Hotel Méridien Etoile), comic and actor.\n\nHe was a member of the Star Racing Team in motor racing, with other celebrities of the 1980s such actors Jean-Louis Trintignant and Guy Marchand.\n\nSource: Article \"Moustache (actor)\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1929-02-14",
        "deathday": "1987-03-25",
        "gender": 2,
        "homepage": null,
        "id": 38912,
        "imdb_id": "nm0610116",
        "known_for_department": "Acting",
        "name": "Moustache",
        "place_of_birth": "Paris, France",
        "popularity": 0.7754,
        "profile_path": "/jtkGvrzsglnkOngEOYsK3BmEuyF.jpg"
    }
}