{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xgU3KkqiME9pGe5gGCNpUYkoSWg.jpg",
                "genre_ids": [
                    27,
                    53,
                    12
                ],
                "id": 578,
                "original_language": "en",
                "original_title": "Jaws",
                "overview": "When the seaside community of Amity finds itself under attack by a dangerous great white shark, the town's chief of police, a young marine biologist, and a grizzled hunter embark on a desperate quest to destroy the beast before it strikes again.",
                "popularity": 14.1815,
                "poster_path": "/lxM6kqilAdpdhqUl2biYp5frUxE.jpg",
                "release_date": "1975-06-20",
                "title": "Jaws",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 11008,
                "character": "Scout Master (uncredited)",
                "credit_id": "56ba1debc3a3681e6d002c28",
                "order": 28
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Rex Trailer was born in Fort Worth, and raised just outside there. He spent summers at his grandfathers quarter horse ranch in Thurbur, Texas. While there, he owned his first horse. The hands on the ranch were rodeo riders, and taught him how to do trick roping, handle a bull whip, and play guitar. Trailer was also a square dance caller, and sang with a group called \"The Rambling Rustlers\". Eventually, he joined a rodeo, and while on tour, met movie star Gabby Hayes. He was hired to work at Hayes' summer ranch for kids in the Catskill Mountains of New York. Meeting Hayes changed Trailers life, and Hayes encouraged him into doing children's television as an on-air personality. In 1947, Trailer was working for the Dumont Television Network in New York City, first working as a scenery painter, but quickly rose to production coordinator, and then assistant director. He eventually became host of his own show, Oky Dokey Ranch. It featured Rex as a cowboy, and Oky Dokey was a cowboy puppet. Rex then went to Philadelphia when he heard they needed a host for a western style children's show. \"Ridin' the Trail With Rex Trailer\", which ran from 1950 to 1956. When the television station was sold to NBC, Rex still had two years remaining on his contract. He was offered to work for Westinghouse in either Cleveland or Boston. Rex chose Boston, and \"Boomtown\" was born. Rex got the name from the Clark Gable movie, and composed a theme song on the day he was hired. This proved to be his greatest success. The show ran from 1956 to 1974. Rex had a number of sidekicks during the run of the show. His first was \"Pablo\" played by Richard Kilbride. After Kilbride passed away in 1967, his next sidekick was \"Cactus Pete\", played by Terrance Currier, and finally \"Sergeant Billy\" played by Bill O'Brien. During this time, Rex made many appearances throughout the Boston area. He also teamed with a local travel agency in chaperoning children on trips to California theme parks called \"Rex Trailer Goes West\". He was also known as an advocate for children with disabilities.\n\nAfter \"Boomtown\" ended, Rex hosted a syndicated science series called \"Earth Lab\" until 1979. Besides being a cowboy, Rex was a licensed pilot was well as a skydiver, scuba diver and a water skier. He was also an accomplished singer, making two recordings in 1950. \"Cowboys Don't Cry\" and \"Hoofbeats\". Hoofbeats was used on Boomtown to bridge the scene between the bunkhouse and the Boomtown set.\n\nTrailer was married to Karoline \"Cindy\" Trailer from 1956 until her death in 2010. In 2012, Rex continued to appear in events in towns all over Massachusetts.He passed away at the age of 84 in Florida on January 9, 2013.",
        "birthday": "1928-09-16",
        "deathday": "2013-01-09",
        "gender": 2,
        "homepage": null,
        "id": 39039,
        "imdb_id": "nm0870668",
        "known_for_department": "Acting",
        "name": "Rex Trailer",
        "place_of_birth": "Thurber, Texas, USA",
        "popularity": 0.0434,
        "profile_path": "/y9g43D1EdsHpU2nKDtX2bFYchPr.jpg"
    }
}