{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/747dgDfL5d8esobk7h4odaOFhUq.jpg",
                "genre_ids": [
                    80,
                    18,
                    53
                ],
                "id": 275,
                "original_language": "en",
                "original_title": "Fargo",
                "overview": "Jerry, a small-town Minnesota car salesman is bursting at the seams with debt... but he's got a plan. He's going to hire two thugs to kidnap his wife in a scheme to collect a hefty ransom from his wealthy father-in-law. It's going to be a snap and nobody's going to get hurt... until people start dying. Enter Police Chief Marge, a coffee-drinking, parka-wearing - and extremely pregnant - investigator who'll stop at nothing to get her man. And if you think her small-time investigative skills will give the crooks a run for their ransom... you betcha!",
                "popularity": 8.099,
                "poster_path": "/rt7cpEr1uP6RTZykBFhBTcRaKvG.jpg",
                "release_date": "1996-03-08",
                "title": "Fargo",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 8569,
                "character": "Jean Lundegaard",
                "credit_id": "52fe4230c3a36847f800af27",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/8sf7q8OlZLl7OVhTdYjz1vsFr5v.jpg",
                "genre_ids": [
                    14,
                    35,
                    18
                ],
                "id": 2657,
                "original_language": "en",
                "original_title": "Pleasantville",
                "overview": "Geeky teenager David and his popular twin sister, Jennifer, get sucked into the black-and-white world of a 1950s TV sitcom called \"Pleasantville,\" and find a world where everything is peachy keen all the time. But when Jennifer's modern attitude disrupts Pleasantville's peaceful but boring routine, she literally brings color into its life.",
                "popularity": 3.819,
                "poster_path": "/m1hhYP6OScjKU5Z9iZaWirSn4I6.jpg",
                "release_date": "1998-09-17",
                "title": "Pleasantville",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1765,
                "character": "Mary",
                "credit_id": "65b198e9a80236016dae105b",
                "order": 40
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nKristin Rudrüd (Born May 23, 1955) is an American film, theater, and television actress.\n\nRudrüd was born in Fargo, North Dakota, and grew up in Moorhead, Minnesota. She went to high school in Fargo, and after graduation attended Minnesota State University Moorhead. She studied acting in London, returned briefly to Fargo, and then went to New York City where she found success in theater; landing a part in Amadeus, and performed a public theater reading of Othello, which starred Al Pacino.\n\nAfter she returned to Fargo, she started her career as a film actor. In 1996, Rudrüd starred as William H. Macy's wife in Joel and Ethan Coen's dark comedy film Fargo. She also had a small role in the 1999 comedy Pleasantville, also starring Macy, a short film Wheels Locked, which received a \"Best of the Fest\" at the Rochester International Film Festival, Drop Dead Gorgeous, and the short film A Psychic Mom.\n\nShe has also appeared in television roles on Chicago Hope, and All My Children.",
        "birthday": "1955-05-23",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 3906,
        "imdb_id": "nm0749021",
        "known_for_department": "Acting",
        "name": "Kristin Rudrüd",
        "place_of_birth": "Fargo, North Dakota, USA",
        "popularity": 0.1862,
        "profile_path": "/ws3H0HRN6tQ01T0qpoUPlvfTfP0.jpg"
    }
}