{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fHDvGGPFry65ou79WLi6JsjCZrM.jpg",
                "genre_ids": [
                    35
                ],
                "id": 632856,
                "original_language": "en",
                "original_title": "Spirited",
                "overview": "Each Christmas Eve, the Ghost of Christmas Present selects one dark soul to be reformed by a visit from three spirits. But this season, he picked the wrong Scrooge. Clint Briggs turns the tables on his ghostly host until Present finds himself reexamining his own past, present and future.",
                "popularity": 3.1287,
                "poster_path": "/h3zAzTMs5EP3cKusOxFNGSFE1WI.jpg",
                "release_date": "2022-11-10",
                "title": "Spirited",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 676,
                "character": "HR Ghost (Margo)",
                "credit_id": "63dff677ffd44d00ab4d422b",
                "order": 89
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "lilyyily",
            "Carissa"
        ],
        "biography": "LILY SULLIVAN is an American comedian, actor, writer and improviser and breakout in the new feature SPIRITED with Ryan Reynolds and Will Ferrell; she “absolutely crushes every scene she’s in” (Decider).  She can also be seen on THE RIGHTEOUS GEMSTONES, KILLING IT, I THINK YOU SHOULD LEAVE, and GLOW. Lily is currently developing an original animated half-hour together with Tim Baltz, Counter Balance, and Sony, and is the creator and host of the breakout Earwolf podcast GOING DEEP.  Lily also hosts the CBB Presents podcast \"This Book Changed My Life.\" Previously, Lily created, wrote and starred in three seasons of the digital series Project Sammy's Way, a spinoff of Project Runway for Lifetime.  She’s also a regular on the cult-classic comedy podcasts Comedy Bang Bang and Hey Randy.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.lilysullivan.com",
        "id": 3907424,
        "imdb_id": "nm6324730",
        "known_for_department": "Acting",
        "name": "Lily Sullivan",
        "place_of_birth": null,
        "popularity": 0.1106,
        "profile_path": "/yXoTCXLr39hX13PhbmNIOeifStE.jpg"
    }
}