{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mSwyH7ix20lqdKmPx7682gALwGu.jpg",
                "genre_ids": [
                    35
                ],
                "id": 4727,
                "original_language": "fr",
                "original_title": "Le Gendarme de Saint-Tropez",
                "overview": "The ambitious police officer Cruchot is transferred to St. Tropez. He's struggling with crimes such as persistent nude swimming, but even more with his teenage daughter, who's trying to impress her rich friends by telling them her father was a millionaire and owned a yacht in the harbor.",
                "popularity": 1.6769,
                "poster_path": "/6510K6Y8eYLf9FJ7O4xaOnwhn2u.jpg",
                "release_date": "1964-09-08",
                "title": "Le Gendarme de Saint-Tropez",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 893,
                "character": "Émilie Lareine-Leroy",
                "credit_id": "52fe43d6c3a36847f80732cf",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Maria Pacome",
            "Simone Maria Pacôme"
        ],
        "biography": "Maria Pacôme (18 July 1923 – 1 December 2018) was a French actress and playwright.\n\nBorn on 18 July 1923 in Paris, Maria Pacôme was the daughter of Maurice Pacôme and Germaine Hivonait. Her father was deported to Buchenwald concentration camp and her brother was shot for being a Communist. When her father came back, Pacôme often found herself defending her mother against her father's violence.\n\nMaria began her higher education at Le Cours Simon in 1941, when she was 18. She was classmates with Michèle Morgan, Danièle Delorme, and her future spouse, Maurice Ronet. Pacôme married Ronet in 1950. She would set aside her career until their divorce in 1956.\n\nShe began her stage acting career in 1956 with La Reine et les Insurgés, written by Ugo Betti and directed by Michel Vitold. In 1958, she acted in Oscar, written by Claude Magnier. She acted alongside Pierre Mondy and Jean-Paul Belmondo in the play. Pacôme also appeared in N'écoutez pas, mesdames! by Sacha Guitry in 1962, Les Grosses Têtes by Jean Poiret and Michel Serrault in 1969, and Joyeuses Pâques by Poiret in 1981.\n\nPacôme's first appearance on the big screen came in 1959 with Voulez-vous danser avec moi? (Come Dance with Me), directed by Michel Boisrond. She later took on numerous supporting roles, most notably in The Troops of St. Tropez, Up to His Ears, and Le Distrait. Afterwards, she achieved leading roles in La situation est grave… mais pas désespérée by Jacques Besnard, Les Sous-doués by Claude Zidi, and The Crisis (La Crise) by Coline Serreau.\n\nPacôme wrote seven plays: Apprends-moi Céline, Le Jardin d'Éponine, On m'appelle Émilie, Les Seins de Lola, Et moi et moi, Les Désarrois de Gilda Rumeur, and L'Éloge de ma paresse.\n\nShe wrote her memoirs, titled Maria sans Pacôme, in 2007.\n\nPacôme appeared in several TV movies, most notably starring in Docteur Sylvestre.\n\nIn 2006, she played the role of Hortense Bertin in the drama Les Secrets du volcan, directed by Michaëla Watteaux.\n\nIn 2011, she was the voice actor for the character \"Granny\" in the movie Titeuf.\n\nMaria Pacôme died on 1 December 2018 in Ballainvilliers, France following a tumor near the amygdala.\n\nHer burial at the Père Lachaise Cemetery on 10 December 2018 was attended by celebrities such as Daniel Auteuil and Bernard Le Coq.\n\nSource: Article \"Maria Pacôme\" from Wikipedia in english, licensed under CC-BY-SA 3.0.",
        "birthday": "1923-07-18",
        "deathday": "2018-12-01",
        "gender": 1,
        "homepage": null,
        "id": 39148,
        "imdb_id": "nm0655582",
        "known_for_department": "Acting",
        "name": "Maria Pacôme",
        "place_of_birth": "Paris, France",
        "popularity": 0.231,
        "profile_path": "/nTpnyVPBD7CD6cWztfji9hFidhw.jpg"
    }
}