{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mSwyH7ix20lqdKmPx7682gALwGu.jpg",
                "genre_ids": [
                    35
                ],
                "id": 4727,
                "original_language": "fr",
                "original_title": "Le Gendarme de Saint-Tropez",
                "overview": "The ambitious police officer Cruchot is transferred to St. Tropez. He's struggling with crimes such as persistent nude swimming, but even more with his teenage daughter, who's trying to impress her rich friends by telling them her father was a millionaire and owned a yacht in the harbor.",
                "popularity": 1.6268,
                "poster_path": "/6510K6Y8eYLf9FJ7O4xaOnwhn2u.jpg",
                "release_date": "1964-09-08",
                "title": "Le Gendarme de Saint-Tropez",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 893,
                "character": "Jules Berlicot",
                "credit_id": "52fe43d6c3a36847f80732a7",
                "order": 22
            },
            {
                "adult": false,
                "backdrop_path": "/bodTQ7K68AopK2uQumsrSVT9g4A.jpg",
                "genre_ids": [
                    35,
                    10752
                ],
                "id": 8290,
                "original_language": "fr",
                "original_title": "La Grande Vadrouille",
                "overview": "During World War II, two French civilians and a downed British Bomber Crew set out from Paris to cross the demarcation line between Nazi-occupied Northern France and the South. From there they will be able to escape to England. First, they must avoid German troops – and the consequences of their own blunders.",
                "popularity": 2.3452,
                "poster_path": "/91l4Sf3WJwrb0tSVPsOqnBXG8E6.jpg",
                "release_date": "1966-12-08",
                "title": "Don't Look Now... We're Being Shot At!",
                "video": false,
                "vote_average": 7.934,
                "vote_count": 1402,
                "character": "Cross-eyed German machine gunner",
                "credit_id": "52fe449dc3a36847f80a02cf",
                "order": 15
            },
            {
                "adult": false,
                "backdrop_path": "/aDi4GqSYi4pcTvS7A9AuXLuhUVQ.jpg",
                "genre_ids": [
                    35,
                    80
                ],
                "id": 25866,
                "original_language": "fr",
                "original_title": "Le Corniaud",
                "overview": "In this Franco-Italian gangster parody, a shopkeeper on his way to an Italian holiday suffers a crash that totals his car. The culprit can only compensate his ruined trip by driving an American friend's car from Naples to Bordeaux, but as it happens to be filled with such contraband as stolen money, jewelry and drugs, the involuntary and unwitting companions in crime soon attract all but recreational attention from the \"milieu\".",
                "popularity": 2.5445,
                "poster_path": "/kGFE3U01sMApp5Q7h0akEvdTwPK.jpg",
                "release_date": "1965-03-24",
                "title": "The Sucker",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 674,
                "character": "Customs officer",
                "credit_id": "52fe44e0c3a368484e03c0e3",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Modo",
            "Michel Goi",
            "Michel Henri Luis Goi"
        ],
        "biography": "Michel Modo, born Michel Henri Louis Goi at Carpentras (Vaucluse) (born March 30, 1937 - died September 25, 2008), was a French actor and humorist. Modo died of cancer on September 25, 2008 in Vaires-sur-Marne (Seine-et-Marne).\n\nHe is best known in France for having formed in the late 1950s a comedy duo, Grosso et Modo, with actor Guy Grosso. The duo appeared in many movies with Louis de Funès, among which the series of Gendarmes de Saint Tropez, where he will played the role of Constable Berlicot alongside Michel Galabru, Jean Lefebvre and Christian Marin. They were also Laflûte and Quince in The Dream of a Summer Night by Jean-Christophe Averty.\n\nBetween 1993 and 1997 he is one of the recurring actors in the television series Highlander as Maurice Lolande, humorous character characterizing the average French person.\n\nIn December 2005, he stars in the television series Plus belle la vie alongside Colette Renard. He plays a bum philosopher disguised as Santa Claus.\n\nHe also dubbed several recurring characters in the French version of the animated series The Simpsons. At his sudden death in 2008 at the age of 71, when dubbing the last episodes of season 19, he was replaced on the spot by Gérard Rinaldi, who died in his turn from cancer on March 2, 2012.",
        "birthday": "1937-03-30",
        "deathday": "2008-09-24",
        "gender": 2,
        "homepage": null,
        "id": 39142,
        "imdb_id": "nm0595317",
        "known_for_department": "Acting",
        "name": "Michel Modo",
        "place_of_birth": "Carpentras, Vaucluse, France",
        "popularity": 0.3396,
        "profile_path": "/5z2yijGqQfyL8aqTUrbv6G98Pzx.jpg"
    }
}