{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2clBxxclZJ4OK1xzhmCCXHEfy3r.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 759,
                "original_language": "en",
                "original_title": "Gentlemen Prefer Blondes",
                "overview": "Lorelei Lee is a beautiful showgirl engaged to be married to the wealthy Gus Esmond, much to the disapproval of Gus' rich father, Esmond Sr., who thinks that Lorelei is just after his money. When Lorelei goes on a cruise accompanied only by her best friend, Dorothy Shaw, Esmond Sr. hires Ernie Malone, a private detective, to follow her and report any questionable behavior that would disqualify her from the marriage.",
                "popularity": 2.362,
                "poster_path": "/fDozhst5HVJJcd3BM8ZOsKniO7Q.jpg",
                "release_date": "1953-07-14",
                "title": "Gentlemen Prefer Blondes",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1011,
                "character": "Olympic Team Member (uncredited)",
                "credit_id": "6574e3ae564ec700acd3f4ac",
                "order": 122
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Стив Ривс",
            "Стив Ривз"
        ],
        "biography": "Steve Reeves is regarded by many as the greatest bodybuilder of all time for his legendary symmetrical physique, visionary bodybuilding techniques, dedication and love for the sport through which he won five bodybuilding titles between 1946 and 1950. His peak measurements were: 6'1\" at 216 lbs. with 18½\" arms, 52\" chest, and a 29\" waist, partly depicting his creation: \"The Classic Physique.\"\n\nSteve Reeves was born in Montana in 1926, yet by age 10 moved to Oakland, California where he first became captivated with the art of bodybuilding at age 16, placing pioneer John Grimek as his top role model. After two years of bodybuilding Steve's body weight reached 203 lbs by high school graduation, but was he then inducted into the Army. He was assigned to Company A of the 25th Division and was sent to the front lines in the Philippines where he endured to continue his bodybuilding training, becoming known as \"The Shape\" among his fellow GIs. After WWII had ended he was part of the occupational forces sent to Japan and was stationed there from September 1945 to September 1946. After his service ended, he entered and won several bodybuilding championships becoming: \"Mr. Pacific Coast\" (1946), \"Mr. Western America\" (1947), \"Mr. America\" (1947), \"Mr. World\" (1948) and \"Mr. Universe\" (1950) announcing his retirement from bodybuilding competition that very night after he won.\n\nFrom that point onward Reeves set his sights on the silver screen as well as the small screen. He made several appearances on variety shows of the early-to-mid 1950s and non-starring roles during 1954 in two films: Athena (1954) starring Debbie Reynolds and Ed Wood's Jail Bait (1954). In 1957, he had been called to Italy to play the lead role Hercules in \"Le Fatiche di Ercole\" which was filmed during the summer and autumn of 1957 with a USA premiere in 1959. The tremendous worldwide success of \"Hercules,\" (the USA title), led to a sequel and many other Italian epic films many based on heroes played by Reeves. These roles included Romulus, Phillipides, Captain Henry Morgan, Glaucus, and Sandokan. With 20 film/TV acting credits to his name by 1968, Steve Reeves retired from film and returned to California to live on his ranch, remaining committed to his lifelong belief in natural, drug-free bodybuilding through his writings and personal appearances. Steve Reeves has served as a great inspiration to many bodybuilders such as Sylvester Stallone and Lou Ferrigno, and millions of others the world over for all that he was: a genuine hero, a true man, an authentic gentleman, the first (and to many fans the only true) Hercules, and nothing less than the greatest bodybuilder of all time.",
        "birthday": "1926-01-21",
        "deathday": "2000-05-01",
        "gender": 2,
        "homepage": "https://www.stevereeves.com",
        "id": 39162,
        "imdb_id": "nm0716302",
        "known_for_department": "Acting",
        "name": "Steve Reeves",
        "place_of_birth": "Glasgow, Montana, USA",
        "popularity": 0.3838,
        "profile_path": "/7LFQOLLWnJtWWmeiM8Pc4sMB8c8.jpg"
    }
}