{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/32V4uHVRU2fbDsQl1dsYsZm3uba.jpg",
                "genre_ids": [
                    80,
                    35
                ],
                "id": 107,
                "original_language": "en",
                "original_title": "Snatch",
                "overview": "Unscrupulous boxing promoters, violent bookies, a Russian gangster, incompetent amateur robbers, and supposedly Jewish jewellers fight to track down a priceless stolen diamond.",
                "popularity": 8.264,
                "poster_path": "/kJZoAHq1SLDdWjeNGtlHAnGpmFV.jpg",
                "release_date": "2000-09-01",
                "title": "Snatch",
                "video": false,
                "vote_average": 7.817,
                "vote_count": 9473,
                "character": "Waterboy (uncredited)",
                "credit_id": "67ccb8c47c70c42a034f9e8c",
                "order": 66
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Dean first got the bug for acting at around five years old when his dad who was a 'Unit driver' on production sets used to take him to work with him, and knew right there and then that was exactly what he wanted to do. His parents put his name down for The Anna Scher theater and five years later he received a place.  Within the first year he was offered a role in the TV show \"The Bill\" and from then on, for the next twelve years he played many roles including parts in movies such as \"Snatch\" and \"Ali-G Indahouse\" Most of his roles came again in \"The Bill\". He almost received a core role in a new Mad Max production, which has since been halted for various reasons.\n\nDean stopped acting in 2006 in order to obtain a Bachelor of Arts Degree with Honours. In order to do this he took an access to performance course at college and between 2007 and 2009, he took a B.A in Film & T.V Studies at Brunel University, Uxbridge.",
        "birthday": "1982-01-31",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.stage32.com/profile/16949/about",
        "id": 3933291,
        "imdb_id": "nm0060733",
        "known_for_department": "Acting",
        "name": "Dean Batchelor",
        "place_of_birth": "Glasgow, Scotland, UK",
        "popularity": 0.0286,
        "profile_path": null
    }
}