{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cCoacHVHq0kn6JELs0jJF10lLiU.jpg",
                "genre_ids": [
                    35
                ],
                "id": 14645,
                "original_language": "fr",
                "original_title": "Le père Noël est une ordure",
                "overview": "Two neurotics, working for a suicide hotline on the night of Christmas Eve, get caught up in a catastrophe when a pregnant woman, her abusive boyfriend, and a transvestite visit their office.",
                "popularity": 2.1047,
                "poster_path": "/i5KrHnqlFr5taNRPREXQKV104Fy.jpg",
                "release_date": "1982-08-25",
                "title": "Santa Claus Is a Stinker",
                "video": false,
                "vote_average": 7.325,
                "vote_count": 1019,
                "character": "Thérèse de Monsou dite « Mme S.O.S »",
                "credit_id": "52fe460b9251416c7506b3b3",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Anne Bourguignon",
            "Anemone"
        ],
        "biography": "Anne Bourguignon (9 August 1950 - 30 April 2019) known as Anemone, is a French actress and screenwriter. She won the César for best actress in 1988 for the role of Marcelle in Le Grand Chemin. She is the mother of two children; Jacob and Lilly.\n\nShe spent her childhood at Château Mauras, a family property in Bommes, in Gironde. After primary and secondary studies at the Sainte-Marie-des-Invalides school (today Paul Claudel-d'Hulst), at the Victor-Duruy high school, at the Gaudéchaux course, at the Jaillard course, at the Sévigné college, within the congregation of the canonesses of Saint-Augustin of the Congrégation Notre-Dame (at the Notre-Dame-des-Oiseaux convent in Megève, at the Saint-Pierre Fourier institute in Brunoy) and at the Institut Notre-Dame in Épernay, it pursued higher education at Paris-III University and then at Paris-X1 University. Anemone began her career at the café-théâtre with the Splendid troupe. She takes her pseudonym from the first film in which she shot, Anemone by Philippe Garrel. It was Coluche who offered her her first big role in the cinema in You will not have Alsace and Lorraine in 1977. In 1979, she created on stage the play written by the Splendid troupe, Le Père Noël est une junk . Her role as Thérèse earned her great success with the public, a success confirmed and amplified by the adaptation of the play to the cinema, directed by Jean-Marie Poiré.\n\nIn the 1980s, she was a very popular actress who starred in many comedies: \"Ma Femme S'Appelle Reviens\", \"Les Babas-Cool\", \"Pour Cent Briques, T'As Plus Rien\"..., \"Le Quart d'Heure Américain\", and \"Le Mariage Du Siècle\", for which she wrote most of the screenplay. Michel Deville (Peril in the home, Aux petits bonheurs), then Jean-Loup Hubert offered her more serious roles from 1985. Successful counter-jobs, since she won the César for best actress for \"Le Grand Chemin\" in 1988. More discreet in the 1990s, Anemone worked with Tonie Marshall (\"Pas Très Catholique\", \"Enfants De Bastard\"), Romain Goupil (\"Mom\") or Christine Pascal, in \"Le Petit Prince A Dit\". In 1996, she played in the adaptation of Binet's comic strip, \"Les Bidochon\". In 2010, she returned to the cinema with the film \"Les Amours Secrètes\" by Franck Phelizon. She then turned to the theater, playing in \"L'Avare\" for Roger Planchon, \"Mademoiselle Werner\" at the Théâtre des Variétés or \"Les Noeuds Au Mouchoir\" at the Palais des Glaces which she announced would be her last play at the end of 2017.\n\nIn December 2017, she announced that she would definitely end her career at the end of the year, and also took a very critical and disillusioned look in this same interview at what has become of the world in general, and that of show- bizz in particular. Militant like her brother for a return to a more ethical and ecological society, Anemone chooses to live in the countryside in the small village of Sainte-Soline (Deux-Sèvres), near Lezay.\n\nAnemone died on April 30, 2019 at the age of 68 in Poitiers (Vienne) from lung cancer. She admitted to being an “inveterate smoker”. Her funeral took place on May 9 in Poitiers, where she was cremated.",
        "birthday": "1950-08-09",
        "deathday": "2019-04-30",
        "gender": 1,
        "homepage": null,
        "id": 39350,
        "imdb_id": "nm0031785",
        "known_for_department": "Acting",
        "name": "Anémone",
        "place_of_birth": "Paris, France",
        "popularity": 0.2817,
        "profile_path": "/68TWVz410O9ITjbPPTsXWrGxK4T.jpg"
    }
}