{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/iVk4mVKwNE66JbBcoDwcYFvuUXM.jpg",
                "genre_ids": [
                    18,
                    53
                ],
                "id": 68734,
                "original_language": "en",
                "original_title": "Argo",
                "overview": "As the Iranian revolution reaches a boiling point, a CIA 'exfiltration' specialist concocts a risky plan to free six Americans who have found shelter at the home of the Canadian ambassador.",
                "popularity": 4.5663,
                "poster_path": "/m5gPWFZFIp4UJFABgWyLkbXv8GX.jpg",
                "release_date": "2012-10-11",
                "title": "Argo",
                "video": false,
                "vote_average": 7.281,
                "vote_count": 8597,
                "character": "Iranian Consulate Official",
                "credit_id": "5fdd3acbaf2da8003feb5d61",
                "order": 73
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Rafi Pitts (born 1967) is an Iranian film director.\n\nPitts was born in Mashad, Iran. Rafi spent his childhood in Tehran, where he lived in a basement flat underneath a post-production studio. He came to England (his father is English) in 1981 during the Iran Iraq war. He graduated in 1991 from the Polytechnic of Central London with a BA (Hons) degree in Film and Photography. His first short film, In Exile (1991) was presented the same year at the London International Film Festival. In the 90's Pitts moved to Paris and worked on films by Leos Carax, Jacques Doillon and Jean-Luc Godard.\n\nEducated in France and England, Rafi Pitts belongs to the new wave of Iranian cinema, which received numerous prestigious prizes in the international festival circuit.\n\nIn 1996 he had the opportunity to film in Iran and he was the first film director (in exile) to do so since the Revolution in 1979. His first feature Season Five (1997) was the first Franco-Iranian coproduction since the Revolution.\n\nIn 2006, he was nominated for Golden Bear award of Berlin Film Festival for his film, It's Winter. His 2010 film The Hunter was nominated for the Golden Bear at the 60th Berlin International Film Festival. His 2016 Film Soy Nero won the best film award at the 12th Bucharest International Film festival, in April 2016.",
        "birthday": "1967-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 39379,
        "imdb_id": "nm0686020",
        "known_for_department": "Writing",
        "name": "Rafi Pitts",
        "place_of_birth": "Mashhad, Iran",
        "popularity": 0.1003,
        "profile_path": "/bYpJRupTo0sSqkaXbkAr7nqSmKg.jpg"
    }
}