{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5rbPwIdEZTyLTkpAgvGdacgCr7T.jpg",
                "genre_ids": [
                    18,
                    53,
                    27
                ],
                "id": 11481,
                "original_language": "en",
                "original_title": "Repulsion",
                "overview": "Beautiful young manicurist Carole suffers from androphobia (the pathological fear of interaction with men). When her sister and roommate, Helen, leaves their London flat to go on an Italian holiday with her married boyfriend, Carole withdraws into her apartment. She begins to experience frightful hallucinations, her fear gradually mutating into madness.",
                "popularity": 2.0055,
                "poster_path": "/dtyCKEPLqv9wxyVazL4b843vtUb.jpg",
                "release_date": "1965-06-01",
                "title": "Repulsion",
                "video": false,
                "vote_average": 7.405,
                "vote_count": 1043,
                "character": "Mme Balch",
                "credit_id": "52fe44499251416c7502f56b",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Renee Houston",
            "Katherina Rita Murphy Gribbin"
        ],
        "biography": "Renée Houston (24 July 1902 - 9 February 1980) was a Scottish comedy actress and revue artist who appeared in television and film roles.\n\nBorn in Johnstone, Renfrewshire, as Katherina Houston Gribbin she toured music halls and revues with her sister Billie Houston as the \"Houston Sisters\".\n\nIn 1926, the sisters made a short musical film, the script of which Renée had written. It was produced by Lee De Forest, whose process, Phonofilm, enabled a soundtrack to be played alongside the film (a year before The Jazz Singer).\n\nHouston married three times, the second was to the actor Pat Aherne, the brother of Brian Aherne. Her third husband was the actor Donald Stewart.\n\nIn her later years, she specialised in \"battleaxe\" roles, notably as shop steward Vic Spanner's (Kenneth Cope) formidable mother in Carry On at Your Convenience (1971). She published her autobiography in 1974 which was entitled Don't Fence Me In.\n\nHouston was also in the early episodes of radio's The Clitheroe Kid and a regular guest on radio panel show The Petticoat Line chaired by Anona Winn.\n\nShe died in London at the age of 77 on 9 February 1980.\n\nFrom Wikipedia, the free encyclopedia",
        "birthday": "1902-07-24",
        "deathday": "1980-02-09",
        "gender": 1,
        "homepage": null,
        "id": 39393,
        "imdb_id": "nm0396881",
        "known_for_department": "Acting",
        "name": "Renée Houston",
        "place_of_birth": "Johnstone, Renfrewshire, Scotland, UK",
        "popularity": 0.1496,
        "profile_path": "/r3lel2qtJFFFuTQjNp5kub1d9n4.jpg"
    }
}