{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3aGsZdB5ud6LmU9lppwTLh2fqH1.jpg",
                "genre_ids": [
                    878,
                    28,
                    12,
                    53
                ],
                "id": 16320,
                "original_language": "en",
                "original_title": "Serenity",
                "overview": "When the renegade crew of Serenity agrees to hide a fugitive on their ship, they find themselves in an action-packed battle between the relentless military might of a totalitarian regime who will destroy anything – or anyone – to get the girl back and the bloodthirsty creatures who roam the uncharted areas of space. But... the greatest danger of all may be on their ship.",
                "popularity": 7.1808,
                "poster_path": "/4sqUOaPFoP2W81mq1UYqZqf5WzA.jpg",
                "release_date": "2005-09-25",
                "title": "Serenity",
                "video": false,
                "vote_average": 7.363,
                "vote_count": 3675,
                "character": "Teacher",
                "credit_id": "52fe46c59251416c75083021",
                "order": 16
            },
            {
                "adult": false,
                "backdrop_path": "/biu21pZCpfe6dv9rrl23k6m6MXJ.jpg",
                "genre_ids": [
                    28,
                    16,
                    14,
                    12,
                    878
                ],
                "id": 323027,
                "original_language": "en",
                "original_title": "Justice League: Gods and Monsters",
                "overview": "In an alternate universe, very different versions of DC's Trinity fight against the government after they are framed for an embassy bombing.",
                "popularity": 2.4818,
                "poster_path": "/9EoqQuEZKmQIYjexoUbkxMcMCVr.jpg",
                "release_date": "2015-06-18",
                "title": "Justice League: Gods and Monsters",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 594,
                "character": "Wonder Woman / Bekka (voice)",
                "credit_id": "556e1748925141422a00119c",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "타마라 테일러",
            "塔瑪拉·泰勒",
            "تامارا تیلور"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nTamara Taylor (born September 27, 1970, height 5' 6½\" (1,69 m)) is a Canadian television actress.\n\nBorn in Toronto to a black Canadian father and a Scottish Canadian mother, her most famous role is that of Dr. Camille Saroyan, head of the Forensic Division, on the forensic crime drama Bones. She also appeared in the CBS medical drama 3 lbs as Della and the UPN series Sex, Love & Secrets in the role of Nina, both of which were short-lived.\n\nTaylor has made guest appearances on NCIS, Numb3rs, Lost, CSI: Miami, Without a Trace, Party of Five and Dawson's Creek. She portrayed Debrah Simmons in the 2005 romantic-comedy Diary of a Mad Black Woman. Taylor also had a brief role in Serenity, the movie conclusion of the TV series Firefly by Joss Whedon. Through her part in Serenity, Taylor was able to audition for a show with actor David Boreanaz, who had previously worked with Whedon in Buffy the Vampire Slayer and Angel. She also appeared in the TV series Lost, as the former girlfriend of Michael and mother of Walt.\n\nShe first appeared in Bones in the first episode of the second season, \"The Titan On The Tracks,\" portraying the character Dr. Camille Saroyan. In the first six episodes of the season, she was credited as \"Guest Starring\" because creator and writer Hart Hanson had planned to kill her in episode six when Howard Epps, a recurring serial killer, poisoned her in order to create more tension and drama between the two main characters. However, the response to Cam was so strong that the writers offered her a position as a recurring regular in the show. Thus, in episode 7, \"The Girl With The Curl,\" she was credited as a main character of the series and appeared in the title sequence.",
        "birthday": "1970-09-27",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 39464,
        "imdb_id": "nm0853231",
        "known_for_department": "Acting",
        "name": "Tamara Taylor",
        "place_of_birth": "Toronto, Ontario, Canada",
        "popularity": 1.0727,
        "profile_path": "/4hvMoHSki7mZUPxcJXysLEw5Z5I.jpg"
    }
}