{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cemjdP7HrUyJAry85vRT19Hidbi.jpg",
                "genre_ids": [
                    27
                ],
                "id": 138,
                "original_language": "en",
                "original_title": "Dracula",
                "overview": "British estate agent Renfield travels to Transylvania to meet the mysterious Count Dracula, who is interested in leasing a castle in London. After Dracula enslaves Renfield and drives him to insanity, the pair sail to London together and Dracula, a secret vampire, begins preying on London socialites.",
                "popularity": 2.612,
                "poster_path": "/ueVSPt7vAba0XScHWTDWS5tNxYX.jpg",
                "release_date": "1931-02-12",
                "title": "Dracula",
                "video": false,
                "vote_average": 7.153,
                "vote_count": 1286,
                "character": "Lucy",
                "credit_id": "52fe421dc3a36847f8005021",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            " Lorelei Lee",
            "Frances Pemberton Dade"
        ],
        "biography": "From Wikipedia\n\nFrances Dade, also known early in her career as Lorelei Lee (February 14, 1910 – January 21, 1968), was an American film actress of the late 1920s and 1930s.\n\nBorn and raised in Philadelphia, Pennsylvania, Dade moved to Hollywood, California in the late 1920s to pursue an acting career. She first caught the attention of Samuel Goldwyn as a member of the touring company of Gentlemen Prefer Blondes. He gave her a contract though she later went freelance. Her first film role was in 1928, when she had an uncredited role alongside stars Dorothy Boyd and Mabel Poulton in The Constant Nymph. In 1930 she appeared in four films, including Grumpy.\n\nIn 1931 Dade was cast in the biggest role of her career, Lucy Weston in Dracula, which starred Bela Lugosi and Helen Chandler. The scene with Bela Lugosi hovering over her prostrate body remains an indelible part of pop culture. That role would catapult her to brief notoriety, and would result in her being selected one of thirteen WAMPAS Baby Stars, including Marian Marsh, Karen Morley, and Marion Shilling, that same year.\n\nDespite her performance in Dracula, Dade's film role offers dwindled. She starred in six films in 1931, three of which were horror films.\n\nIn 1932, she was featured in only one film, Big Town, and she appeared on Broadway in the play Collision. Shortly thereafter, she retired from acting and married wealthy socialite Brock Van Avery. She eventually moved back home to Philadelphia, and went into nursing. She died there in 1968 at the age of 57.",
        "birthday": "1907-02-14",
        "deathday": "1968-01-21",
        "gender": 1,
        "homepage": null,
        "id": 3947,
        "imdb_id": "nm0196596",
        "known_for_department": "Acting",
        "name": "Frances Dade",
        "place_of_birth": " Philadelphia, Pennsylvania, USA",
        "popularity": 0.0311,
        "profile_path": "/1dReZVvkoWqgcTubC2F8fZZIW9g.jpg"
    }
}