{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/eP4RZSHliWu6lPT5WQyHr5ZZKuC.jpg",
                "genre_ids": [
                    27,
                    878
                ],
                "id": 945961,
                "original_language": "en",
                "original_title": "Alien: Romulus",
                "overview": "While scavenging the deep ends of a derelict space station, a group of young space colonizers come face to face with the most terrifying life form in the universe.",
                "popularity": 25.0306,
                "poster_path": "/b33nnKl1GSFbao4l3fZDDqsMx0F.jpg",
                "release_date": "2024-08-13",
                "title": "Alien: Romulus",
                "video": false,
                "vote_average": 7.178,
                "vote_count": 3968,
                "character": "Navarro",
                "credit_id": "64027877c7176d00db5a9d1e",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "آیلین وو"
        ],
        "biography": "Aileen Wu, is a Chinese-American actor, director, writer, producer currently based in Brooklyn, NY and Vancouver, BC.  Throughout her teenage immigration experience, Aileen used creative storytelling as a tool to unpack the mysteries of cultural relativism. And lately, each project has been an opportunity to challenge the confines of communication and empathy.  Aileen made her off-broadway acting debut in 2019 as Cordelia in Smith Street Stage’s new adaptation, LEAR: THAT OLD MAN I USED TO KNOW. In the following year, she made her directing debut through NYU’s Chinese Students & Scholars Association with her new play, THE POEM OF FORGETFULNESS, using a devised and experimental theatre approach.  Recent producing credits include theatre documentary, HAMLET: REHEARSED (for Smith Street Stage), narrative short-film, FISH TANK (for the 2021 Run N’ Gun 48 Hr Filmmaking Competition) and award winning ultra-short-film CLOSING DOORS (for the 16th Annual Mighty Asian Moviemaking Marathon at the Vancouver Asian Film Festival).",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 3948018,
        "imdb_id": "nm12495816",
        "known_for_department": "Acting",
        "name": "Aileen Wu",
        "place_of_birth": null,
        "popularity": 0.631,
        "profile_path": "/gjW0BFkxowjzOVFyVMfgpCTkyl0.jpg"
    }
}