{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sWPxNdAgKfTIeZ3H17EheDAsci6.jpg",
                "genre_ids": [
                    35
                ],
                "id": 498249,
                "original_language": "fr",
                "original_title": "Mauvaises herbes",
                "overview": "Wael, a former street child, makes a living from small scams with his adoptive mother and partner-in-crime Monique. When this unconventional duo swindles the wrong guy, Victor, an old acquaintance of Monique now in charge of a support organization for troubled teens, they have no choice but to become his interim secretary and educator in order to redeem themselves.",
                "popularity": 3.8339,
                "poster_path": "/sJJWdXTi7ybxLd3mSILD7XxwYzh.jpg",
                "release_date": "2018-11-21",
                "title": "Bad Seeds",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 612,
                "character": "Djallil",
                "credit_id": "673e22b78e357a2ded959d9b",
                "order": 25
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Médine Zaouiche"
        ],
        "biography": "Médine Zaouiche (born 24 February 1983 in Le Havre), better known by his stage name Médine (French for Medina), is a French rapper. He has been a part of the hip hop band La Boussole since 1996. Médine is a practicing Muslim, and many of his lyrics deal with the hardships of migrants, oppressed individuals, and Muslims in the Western world. One article he wrote for Time magazine after the 2005 riots was entitled \"How Much More French Can I Be\".\n\nHis father, born in Algeria, arrived in France when he was four years old. He worked as an employee in a packaging company and is a semi-professional boxer then trainer. His mother was born in France. A stay-at-home mother, she then became a childminder. Médine grew up in Le Havre, in Caucriauville.\n\nIn May 2022, Médine released his album Médine France on 13 May and announced a tour of France. The tour will begin at festivals on 4 June and will notably pass through the Casino of Paris on 19 October 2022.\n\nSource: Article \"Médine (rapper)\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1983-02-24",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 3950211,
        "imdb_id": "nm6279368",
        "known_for_department": "Acting",
        "name": "Médine",
        "place_of_birth": "Le Havre, Seine-Maritime, France",
        "popularity": 0.0071,
        "profile_path": "/v28ZCcjR2HLafd4d1leDRObZhSS.jpg"
    }
}