{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sGEqHTylawwS6hwKultk1mKUjdB.jpg",
                "genre_ids": [
                    10749,
                    35
                ],
                "id": 114,
                "original_language": "en",
                "original_title": "Pretty Woman",
                "overview": "While on a business trip in Los Angeles, Edward Lewis, a millionaire entrepreneur who makes a living buying and breaking up companies, picks up a prostitute, Vivian, while asking for directions; after, Edward hires Vivian to stay with him for the weekend to accompany him to a few social events, and the two get closer only to discover there are significant hurdles to overcome as they try to bridge the gap between their very different worlds.",
                "popularity": 8.828,
                "poster_path": "/hVHUfT801LQATGd26VPzhorIYza.jpg",
                "release_date": "1990-03-23",
                "title": "Pretty Woman",
                "video": false,
                "vote_average": 7.46,
                "vote_count": 8618,
                "character": "Snobby Saleswoman",
                "credit_id": "5e40827541465c0016cbfd35",
                "order": 44
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Dey Young is an American actress and sculptor.\n\nYoung was born in Bloomfield Hills, Michigan, the daughter of Pauline, a sociologist, and Donald E. Young. Her sister is Leigh Taylor-Young and her brother is Lance Young, a writer and producer in the film industry.\n\nAmong Young's acting credits is the part of Kate Rambeau in Rock 'n' Roll High School, a character she re-visited in the 1994 film Shake, Rattle, and Rock! She has also appeared in films such as Strange Behavior, The Running Man, The Serpent and the Rainbow, Spontaneous Combustion, Pretty Woman, No Place to Hide, Conflict of Interest, National Lampoon's Barely Legal, and Flicka.\n\nShe has also performed in several guest roles in the Star Trek franchise, as Hannah Bates on the Star Trek: The Next Generation episode \"The Masterpiece Society\", Arissa on the Star Trek: Deep Space Nine episode \"A Simple Investigation\" (two seasons before her sister guested in an episode), and Keyla on the Star Trek: Enterprise episode \"Two Days and Two Nights\". Her science fiction credits also extend to playing a waitress in the 1987 Mel Brooks comedy Spaceballs. In 1995 she appeared in the TV series Extreme based on a Rocky Mountain Search and Rescue team. She appeared in a two-part episode of Diagnosis Murder \"Fatal Impact\" in 1997. On May 23, 2008, Young appeared on The Young and the Restless as Elizabeth Hartford, the ex-wife of the character David Chow.\n\nYoung is also a professional sculptor, working in stone, clay, and bronze.",
        "birthday": "1955-07-28",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.deyyoungart.com",
        "id": 39568,
        "imdb_id": "nm0949477",
        "known_for_department": "Acting",
        "name": "Dey Young",
        "place_of_birth": "Bloomfield Hills, Michigan, USA",
        "popularity": 0.5447,
        "profile_path": "/wHgYRlGBk5tiwM6r7ZSkdkc8H7f.jpg"
    }
}