{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2pnfUSFqUPn9F4mzl1MLKrlnNbU.jpg",
                "genre_ids": [
                    35,
                    80
                ],
                "id": 25253,
                "original_language": "fr",
                "original_title": "Les Tontons flingueurs",
                "overview": "An aging gangster, Fernand Naudin is hoping for a quiet retirement when he suddenly inherits a fortune from an old friend, a former gangster supremo known as the Mexican. If he is ambivalent about his new found wealth, Fernand is positively nonplussed to discover that he has also inherited his benefactor’s daughter, Patricia. Unfortunately, not only does Fernand have to put up with the thoroughly modern Patricia and her nauseating boyfriend, but he also had to contend with the Mexican’s trigger-happy former employees, who are determined to make a claim.",
                "popularity": 1.7675,
                "poster_path": "/1uYCIsMpX7FtWu2xO1YMIAQYvLR.jpg",
                "release_date": "1963-11-27",
                "title": "Crooks in Clover",
                "video": false,
                "vote_average": 7.747,
                "vote_count": 526,
                "character": "Maître Folace",
                "credit_id": "52fe44bfc3a368484e034aa3",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/4Zc7ja5d4eGTT0rpx1pOCVLiRgW.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 649,
                "original_language": "fr",
                "original_title": "Belle de jour",
                "overview": "Beautiful young housewife Séverine Serizy cannot reconcile her masochistic fantasies with her everyday life alongside dutiful husband Pierre. When her lovestruck friend Henri mentions a secretive high-class brothel run by Madame Anais, Séverine begins to work there during the day under the name Belle de Jour. But when one of her clients grows possessive, she must try to go back to her normal life.",
                "popularity": 3.1272,
                "poster_path": "/iUAFECovwPA0cVV9bo4uNGLJSGL.jpg",
                "release_date": "1967-05-24",
                "title": "Belle de Jour",
                "video": false,
                "vote_average": 7.32,
                "vote_count": 962,
                "character": "Mr. Adolphe",
                "credit_id": "57964f18c3a368734b000074",
                "order": 17
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/jM6KRCEIIY1pGUIGemnp1rNY6ko.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 10102,
                "original_language": "fr",
                "original_title": "La Grande Bouffe",
                "overview": "Four friends gather at a villa with the intention of eating themselves to death.",
                "popularity": 2.9985,
                "poster_path": "/g4wOgslrQKprlQl927h0lQQ3P99.jpg",
                "release_date": "1973-05-16",
                "title": "La Grande Bouffe",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 525,
                "credit_id": "52fe43269251416c75005713",
                "department": "Writing",
                "job": "Screenplay"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Francis-Jean Blanche"
        ],
        "biography": "François Jean Blanche, known as \"Francis Blanche\" (20 July 1921 – 6 July 1974) was a French actor, singer, humorist and author. He was a very popular figure on stage, radio and in films, during the 1950s and 1960s. His two daughters, Barbara & Dominique, are artists with their studios in Eze.\n\nBlanche was born in an artistic family, mainly of stage actors—including his father Louis Blanche and his uncle, Emmanuel Blanche, who was a painter—. He completed his secondary schooling at fourteen, the youngest in France to do so at the time.\n\nIn the 1940s and 1950s, Blanche was part of Robert Dhéry's theatrical company Les Branquignols, with whom he played in the film Ah! Les belles bacchantes, starring Robert Dhéry, Colette Brosset (Dhéry's then-wife), and Louis de Funès; directed by Jean Loubignac in 1954.\n\nBlanche teamed up with Pierre Dac to form a comic duo best remembered for Le Sâr Rabindranath Duval, a sketch about a phony and nonsensical Indian clairvoyant and guru (1957). They also created a popular and equally nonsensical radiophonic series, loosely based on a highly improbable espionage and conspiration plot, Malheur aux barbus, which was broadcast on Paris Inter in 213 episodes from 1951 to 1952. The same plot and characters were revived on Europe 1 in a series called Signé Furax, enjoying no less than 1,034 daily episodes between 1956 and 1960. Both broadcasts were phenomenal audience successes in the pre-television era. Blanche was also renowned for broadcasting phone pranks, in which he entertained listeners by making the most improbable situations sound plausible.\n\nHe wrote poems, and the lyrics of 673 songs. On stage, he acted in Tartuffe and Néron and, in 1955, Chevalier du Ciel, an operetta by Luis Mariano at the Gaîté-Lyrique theatre.\n\nBlanche also enjoyed a successful cinematographic career, both as an actor and scriptwriter. He appeared as a hard-headed German colonel (\"Obersturmführer Schulz\") opposite Brigitte Bardot in Babette s'en va-t-en guerre (1959). He was one of the favourite actors of French filmmaker Georges Lautner, and played Maître Folace (a shady solicitor counselling a colourful gangster mob) in Les Tontons flingueurs (1963). Blanche also appeared in Boris Vassilief's Les Barbouzes (1964).\n\nHe delighted in parodying classical music, adapting famous works such as Schubert's \"Die Forelle\" (The Trout) into a crazy and slightly risqué piece about a 16-year-old romantic girl obsessed with Schubert's song to the point of giving birth to a live trout while performing it on her piano. Similarly, he turned Beethoven's 5th Symphony into a lengthy and quite repetitive musical glorification of the clothes peg and its fictitious inventor, Jérémie-Victor Opdebec.\n\nBlanche died at the age of 52, from a heart attack with a background of untreated Type 1 diabetes. He is buried in Èze cemetery.\n\nSource: Article \"Francis Blanche\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1921-07-20",
        "deathday": "1974-07-06",
        "gender": 2,
        "homepage": null,
        "id": 39645,
        "imdb_id": "nm0087126",
        "known_for_department": "Acting",
        "name": "Francis Blanche",
        "place_of_birth": "Paris, France",
        "popularity": 0.1406,
        "profile_path": "/tqHH6RNErwSPk8avbIzQKkQPc7e.jpg"
    }
}