{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wRMUb4hrgD868hNiRjCkbPXqRv0.jpg",
                "genre_ids": [
                    80,
                    18,
                    53
                ],
                "id": 10363,
                "original_language": "fr",
                "original_title": "Plein soleil",
                "overview": "Tom Ripley is a talented mimic, moocher, forger and all-around criminal improviser; but there's more to Tom Ripley than even he can guess.",
                "popularity": 2.3457,
                "poster_path": "/xGVRU34izQwG8YQNfVOSfKPhD3S.jpg",
                "release_date": "1960-03-10",
                "title": "Purple Noon",
                "video": false,
                "vote_average": 7.58,
                "vote_count": 564,
                "character": "Marge Duval",
                "credit_id": "52fe43619251416c7500e051",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Maïténa Marie Brigitte Douménach",
            "Мари Лафоре"
        ],
        "biography": "Marie Laforêt (born 5 October 1939 - November 2, 2019) is a French singer and actress. In 1978, she moved to Geneva, Switzerland and acquired Swiss citizenship.\n\nHer career began accidentally in 1959 when she replaced her sister at the last minute in a French radio talent contest Naissance d'une étoile (birth of a star) and won. Director Louis Malle then cast the young starlet in the film he was shooting at the time, Liberté, a project he finally abandoned, making Laforêt's first appearance on screen opposite actor Alain Delon in René Clément's 1960 drama Plein Soleil.\n\nAfter this film she became very popular and interpreted many roles in the 1960s. She married director Jean-Gabriel Albicocco, who cast her in some of his own works, including La Fille aux Yeux d'Or (The Girl with the Golden Eyes), based on the Balzac story, which would become her nickname.\n\nDescription above from the Wikipedia article Marie Laforêt, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1939-10-05",
        "deathday": "2019-11-02",
        "gender": 1,
        "homepage": null,
        "id": 39644,
        "imdb_id": "nm0481030",
        "known_for_department": "Acting",
        "name": "Marie Laforêt",
        "place_of_birth": "Soulac-sur-Mer, Gironde, France",
        "popularity": 0.4661,
        "profile_path": "/boBqCTd49MbOpj1r4lOTgmkdDIL.jpg"
    }
}