{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/pmwTANjISHvxOmO3iz5kRGAArso.jpg",
                "genre_ids": [
                    18,
                    36,
                    10752
                ],
                "id": 504949,
                "original_language": "en",
                "original_title": "The King",
                "overview": "England, 15th century. Hal, a capricious prince who lives among the populace far from court, is forced by circumstances to reluctantly accept the throne and become Henry V.",
                "popularity": 4.0647,
                "poster_path": "/8u0QBGUbZcBW59VEAdmeFl9g98N.jpg",
                "release_date": "2019-10-11",
                "title": "The King",
                "video": false,
                "vote_average": 7.158,
                "vote_count": 3382,
                "character": "Scrope",
                "credit_id": "5b2934bec3a36847cc006a1a",
                "order": 16
            },
            {
                "adult": false,
                "backdrop_path": "/a8230eNW59hSOkj5XrRpzMMh0WT.jpg",
                "genre_ids": [
                    18,
                    53,
                    80
                ],
                "id": 4836,
                "original_language": "en",
                "original_title": "Layer Cake",
                "overview": "When a seemingly straight-forward drug deal goes awry, XXXX has to break his die-hard rules and turn up the heat, not only to outwit the old regime and come out on top, but to save his own skin...",
                "popularity": 3.1447,
                "poster_path": "/rDOxXteqxALBaSa3V3zTjGJuyWB.jpg",
                "release_date": "2004-09-30",
                "title": "Layer Cake",
                "video": false,
                "vote_average": 6.912,
                "vote_count": 2221,
                "character": "Freddie Hurst",
                "credit_id": "5e345e0d98f1f100140210d3",
                "order": 31
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ivan Kay"
        ],
        "biography": "Ivan Kaye is internationally best known for his role as King Aelle in Vikings (2013-17). More recently, he has appeared as the goon leader Yankee in Gunpowder Milkshake (2021).\n\nKaye has been interested in acting from early childhood. A remarkably versatile actor, he already had a successful stage career in London's West End in dramatic and musical theatre before starting his work in television and film in his early thirties.\n\nSince the beginning of the 1990s, he has been featured in over 50 roles in TV and film. Due to his enormous versatility, Ivan Kaye has been featured in a wide array of roles encompassing lead and main parts as well as antagonists, outright villains, and comical characters.\n\nRecent major productions and roles include: drug baron Polo Yakur in Assassination Games (2011), the Duke of Milan Ludovico Sforza in The Borgias (2011-2013), Joshua Collins (father of the main character played by Johnny Depp) in Dark Shadows (2012), Ivar the Boneless in Hammer of the Gods (2013), King Aelle of Northumbria in Vikings (2013-2017), pub landlord Mick Sturrock in The Coroner (2015-2016) and goon leader Yankee in Gunpowder Milkshake (2021). All of these productions have reached an international audience and have been dubbed in several languages.\n\nKaye has also appeared in Layer Cake (2004) and is well-known in the UK as herdsman Bryan in BBC’s comedy series The Green Green Grass.\n\nFrom October 2017 to January 2018 he returned to theatre after almost twenty years, starring as Tom Kettle in the critically acclaimed multi-award-winning stage play The Ferryman at the Gielgud Theatre London.\n\nKaye has also worked as a voice artist in several video games such as Star Wars The Old Republic, Stuntman, C-12 and more.\n\nAs a founder and director of Comedy Ink Productions together with actor/writer Douglas McFerran, he has produced and acted as a lead in short comedic offerings such as the mini-series Brilliant! (2007), the short film Sherlock Holmes Confidential (2013) and his recent dark comedy short Acter (2020).\n\nKaye has a reputation of being especially kind and appreciative towards his fans on social media and in person. He is a supporter of the Hounslow Urban Farm (where 'Green Green Grass' was partially filmed) and, with several other actors, the Justice for Andrew campaign, seeking justice for the murder of a young Liverpudlian. He has two grown-up daughters and lives in London.",
        "birthday": "1961-07-01",
        "deathday": null,
        "gender": 2,
        "homepage": "http://ivankaye.com",
        "id": 39683,
        "imdb_id": "nm0443321",
        "known_for_department": "Acting",
        "name": "Ivan Kaye",
        "place_of_birth": "Northampton, Northamptonshire, England, UK",
        "popularity": 1.1329,
        "profile_path": "/kBvEOcGs7aOEhjObN5xVgjnc5Y4.jpg"
    }
}