{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lMWOcXVA62xnk1jSaz8iwrxVJR7.jpg",
                "genre_ids": [
                    18
                ],
                "id": 795514,
                "original_language": "en",
                "original_title": "The Fallout",
                "overview": "In the wake of a school tragedy, Vada, Mia and Quinton form a unique and dynamic bond as they navigate the never linear, often confusing journey to heal in a world that feels forever changed.",
                "popularity": 6.0784,
                "poster_path": "/4ByHl9XRKR2iXbvF0ZilMRD1RcL.jpg",
                "release_date": "2021-03-17",
                "title": "The Fallout",
                "video": false,
                "vote_average": 7.547,
                "vote_count": 1233,
                "character": "Amelia Cavell",
                "credit_id": "6415da026a2227007d72a5f4",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Лумі Поллак"
        ],
        "biography": "Lumi Pollack is an actress with Japanese, Colombian, and Jewish lineage. In 2020, she first appeared as Amelia in the feature film \"The Fallout\" at 11 years old, a role that was widely recognized by the broader public. Since then, she has been cast in other film, television, and theater productions.\n\nIn 2023, Lumi starred in the independent film \"One Big Happy Family,\" due for release in 2024. She also appeared in \"Autumn and the Black Jaguar,\" directed by Gilles De Maistre and produced by Studio Canal, which involved months of filming with jaguars in Mexico. The film was released in Europe in February 2024 and will be released in North America later in the year.\n\nLumi also created the voice of Westyn, a kind witch, in the animated series \"Dee & Friends in Oz,\" which premiered on Netflix in February 2024. Additionally, she guest-starred on Disney's \"Sydney to the Max\" in 2021. Lumi is also an accomplished singer and dancer, as well as a multi-instrumentalist who plays piano and guitar. Off duty, she enjoys hiking, biking, swimming, and spending time with her dogs.",
        "birthday": "2009-01-18",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 3968040,
        "imdb_id": "nm10500980",
        "known_for_department": "Acting",
        "name": "Lumi Pollack",
        "place_of_birth": "Manhassett, New York, USA",
        "popularity": 1.7087,
        "profile_path": "/HrHRFHU8DFgsVqHklMc3VGeW77.jpg"
    }
}