{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8JaU1ez5TSrRSmncB0Xh2YQavXP.jpg",
                "genre_ids": [
                    18,
                    53,
                    12
                ],
                "id": 204,
                "original_language": "fr",
                "original_title": "Le Salaire de la peur",
                "overview": "In a run-down South American town, four men are paid to drive trucks loaded with nitroglycerin into the jungle through to the oil field. Friendships are tested and rivalries develop as they embark upon the perilous journey.",
                "popularity": 3.0486,
                "poster_path": "/dZyZSosIlWcpQkV0f7pXcrV2TQV.jpg",
                "release_date": "1953-04-22",
                "title": "The Wages of Fear",
                "video": false,
                "vote_average": 8.019,
                "vote_count": 1010,
                "character": "Pepito Hernandez",
                "credit_id": "52fe4226c3a36847f8007e63",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            " Dario Moreno",
            "David Arugete"
        ],
        "biography": "David Arugete (3 April 1921 – 1 December 1968), commonly known under his stage name Darío Moreno, was a Turkish-Jewish polyglot singer, an accomplished composer, lyricist, and guitarist. He attained fame and made a remarkable career centred in France which also included films, during the 1950s and the 1960s. He became famous with his 1961 song Brigitte Bardot.\n\nDarío Moreno was born to a large Jewish family. He was orphaned in early childhood when his father, who worked in a train station in Aydın, was shot dead under tragic circumstances. He was placed in the Sephardic orphanage of Izmir (Nido De Guerfanos) by his mother and remained there until he was four.\n\nAfter a primary education in the Jewish educational establishments of Izmir, he had many odd jobs during his early youth. He put great effort into continuing his education while simultaneously working to make a living. He started working as an errand boy in the law firm of the city's prominent lawyers, and he was eventually trained to become a clerk in the office. In the evenings, he would study French in Izmir's Central Library. With a guitar that had fallen into his hands by chance, he also learned to play the guitar, mainly on his own with occasional tutoring from acquaintances.\n\nHe started singing at Bar Mitzva celebrations as a second job. In his early twenties, he had already become a well-known singer in Izmir, and particularly among the Jewish community. During his military service in the Turkish Army, he was employed as a singer in officers' quarters in various garrisons and became more focused on music. His first truly professional musical performance started in his hometown right after his discharge, and was arranged through connections established while in the army. When he started making money with his music, he moved to the better-off Jewish quarter of Karataş to a house in a street leading to the historical building of Asansör, one of the city's landmarks (and which literally means the \"Elevator\", people taking an actual elevator to go to the higher part of the quarter, this part being separated by the coastal strait with a steep slope). Nowadays this street is named Dario Moreno Sokağı (Dario Moreno Street) in his legacy.\n\nA hyperactive personality, Darío Moreno died of a heart attack resulted from a discussion occurred between him and an airport gate staff in the Atatürk Airport. He was slightly late for one of his flights, on his way to Paris for a concert. He was also planning to attend the first \"Turkish Night\" planned to take place in Paris.The airport gate staff discretionary did not allow him to board the plane and this led to a serious debate which resulted with Moreno's heart attack. He was only 47. According to his will he wanted to be buried in İzmir, Turkey but he was buried in Holon, Israel, by his mother Madam Roza. ...\n\nSource: Article \"Darío Moreno\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1921-04-03",
        "deathday": "1968-12-01",
        "gender": 2,
        "homepage": null,
        "id": 397,
        "imdb_id": "nm0603916",
        "known_for_department": "Acting",
        "name": "Darío Moreno",
        "place_of_birth": "Smyrna, Ottoman Empire [now Izmir, Turkey]",
        "popularity": 0.2383,
        "profile_path": "/rjBT9TBRwqBV6y1ykF0E7BcGpQQ.jpg"
    }
}