{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/u9ZLyLvqHY5VDjn0Rs4LKAklsAV.jpg",
                "genre_ids": [
                    878,
                    18
                ],
                "id": 840,
                "original_language": "en",
                "original_title": "Close Encounters of the Third Kind",
                "overview": "After an encounter with UFOs, an electricity linesman feels undeniably drawn to an isolated area in the wilderness where something spectacular is about to happen.",
                "popularity": 5.308,
                "poster_path": "/yaPx3cK9zGFX3SbcKwxWM1QIbUh.jpg",
                "release_date": "1977-12-14",
                "title": "Close Encounters of the Third Kind",
                "video": false,
                "vote_average": 7.347,
                "vote_count": 4399,
                "character": "Air Traffic",
                "credit_id": "52fe427fc3a36847f80234f1",
                "order": 32
            },
            {
                "adult": false,
                "backdrop_path": "/rPDcuFniW2yZrSRbLjeNdQy7P45.jpg",
                "genre_ids": [
                    37,
                    28
                ],
                "id": 11509,
                "original_language": "en",
                "original_title": "Silverado",
                "overview": "Four unwitting heroes cross paths on their journey to the sleepy town of Silverado. Little do they know the town where their family and friends reside has been taken over by a corrupt sheriff and a murderous posse. It's up to the sharp-shooting foursome to save the day, but first they have to break each other out of jail, and learn who their real friends are.",
                "popularity": 3.9298,
                "poster_path": "/k6zurzegRKsNGMICXZ57VJDUzXO.jpg",
                "release_date": "1985-07-10",
                "title": "Silverado",
                "video": false,
                "vote_average": 6.977,
                "vote_count": 754,
                "character": "Carter",
                "credit_id": "52fe444e9251416c750301a9",
                "order": 19
            },
            {
                "adult": false,
                "backdrop_path": "/fhzwleXGmiqBuQdWxmEwpkydhm4.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 25188,
                "original_language": "en",
                "original_title": "The Last Picture Show",
                "overview": "High school seniors and best friends, Sonny and Duane, live in a dying Texas town. The handsome Duane is dating a local beauty, while Sonny is having an affair with the coach's wife. As graduation nears and both boys contemplate their futures, Duane eyes the army and Sonny takes over a local business. Each struggles to figure out if he can escape this dead-end town and build a better life somewhere else.",
                "popularity": 2.4369,
                "poster_path": "/7NYePZc0lZrRomtmQsjOJMePTEb.jpg",
                "release_date": "1971-10-03",
                "title": "The Last Picture Show",
                "video": false,
                "vote_average": 7.624,
                "vote_count": 726,
                "character": "Coach Popper",
                "credit_id": "52fe44bcc3a368484e034013",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Character actor Bill Thurman was born on November 4, 1920 in Texas. A large, rugged, stocky man with a hard, lined, puffy face, a deep, twangy, amicable voice, a strong, bulky build and a charmingly low-key and down-to-earth unaffected natural screen presence, Thurman often portrayed police officers and assorted scruffy redneck types in a huge number of entertainingly cheap'n'cheesy Southern-fried fright flicks and delightfully down'n'dirty drive-in fare made throughout the 60s and 70s. Bill frequently acted in features for legendary Grade Z low-budget independent filmmaker Larry Buchanan; said movies include \"The Eye Creatures,\" \"High Yellow,\" \"Zontar the Thing from Venus,\" \"Mars Needs Women,\" \"Curse of the Swamp Creature,\" \"In the Year 2889,\" the especially atrocious \"It's Alive!,\" and \"A Bullet for Pretty Boy.\" Moreover, Thurman had bit parts in two Steven Spielberg films: he's a hillbilly hunter in \"The Sugerland Express\" and an air traffic controller in \"Close Encounters of the Third Kind.\" Bill's other memorable roles include the abusive Coach Popper in Peter Bogdanovich's magnificent \"The Last Picture Show,\" a doomed hitchhiker in \"Keep My Grave Open,\" a corrupt sheriff in the Claudia Jennings exploitation classic \"'Gatorbait,\" a mean small town deputy in \"Ride in A Pink Car,\" a more amiable sheriff in the fantastic Bigfoot winner \"Creature from Black Lake,\" Cheryl \"Rainbeaux\" Smith's father in \"Slumber Party '57,\" a priest in \"The Evictors,\" and the boozy, dissolute Reverend Bill McWiley in the enjoyably crummy \"Mountaintop Motel Massacre.\" Bill Thurman died in Dallas, Texas on April 13, 1995. - IMDb Mini Biography By: woodyanders",
        "birthday": "1920-11-04",
        "deathday": "1995-04-13",
        "gender": 2,
        "homepage": null,
        "id": 39774,
        "imdb_id": "nm0862174",
        "known_for_department": "Acting",
        "name": "Bill Thurman",
        "place_of_birth": "Texas, USA",
        "popularity": 0.1958,
        "profile_path": "/eEvy6Zl9NGEFURP5Y7NZj0WaajW.jpg"
    }
}