{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/vINgGecnz95iDL6fjQMARDsocgG.jpg",
                "genre_ids": [
                    28,
                    53,
                    878
                ],
                "id": 280,
                "original_language": "en",
                "original_title": "Terminator 2: Judgment Day",
                "overview": "Ten years after the events of the original, a reprogrammed T-800 is sent back in time to protect young John Connor from the shape-shifting T-1000. Together with his mother Sarah, he fights to stop Skynet from triggering a nuclear apocalypse.",
                "popularity": 13.7182,
                "poster_path": "/weVXMD5QBGeQil4HEATZqAkXeEc.jpg",
                "release_date": "1991-07-03",
                "title": "Terminator 2: Judgment Day",
                "video": false,
                "vote_average": 8.133,
                "vote_count": 13562,
                "character": "Tarissa Dyson",
                "credit_id": "52fe4231c3a36847f800b2a7",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/oubk1SEFtg3Q8eOncFvGQVa6OoP.jpg",
                "genre_ids": [
                    18,
                    9648,
                    27
                ],
                "id": 2291,
                "original_language": "en",
                "original_title": "Jacob's Ladder",
                "overview": "After returning home from the Vietnam War, veteran Jacob Singer struggles to maintain his sanity. Plagued by hallucinations and flashbacks, Singer rapidly falls apart as the world and people around him morph and twist into disturbing images. His girlfriend, Jezzie, and ex-wife, Sarah, try to help, but to little avail. Even Singer's chiropractor friend, Louis, fails to reach him as he descends into madness.",
                "popularity": 3.4814,
                "poster_path": "/ufLcHIi1aXjjH8MediAMvnwDsVI.jpg",
                "release_date": "1990-11-02",
                "title": "Jacob's Ladder",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 1752,
                "character": "Elsa",
                "credit_id": "52fe434ac3a36847f8049215",
                "order": 12
            },
            {
                "adult": false,
                "backdrop_path": "/wDln5edQPFYMeKvakkYCLUXOPRP.jpg",
                "genre_ids": [
                    18
                ],
                "id": 13920,
                "original_language": "en",
                "original_title": "Radio",
                "overview": "In the racially divided town of Anderson, South Carolina in 1976, football coach Harold Jones spots a mentally disabled African-American young man nicknamed Radio near his practice field and is inspired to befriend him. Soon, Radio is Jones' loyal assistant, and he becomes a student at T.L. Hanna High School. But things start to sour when Coach Jones begins taking guff from parents and fans who feel that his devotion to Radio is getting in the way of the team's quest for a championship.",
                "popularity": 5.4084,
                "poster_path": "/uQ6ci4iFHhB6TWB2f4wftR7AEly.jpg",
                "release_date": "2003-10-24",
                "title": "Radio",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 786,
                "character": "Maggie",
                "credit_id": "52fe45b49251416c7505faa1",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Epatha Merkerson ",
            "اس اپاتا مرکرسون"
        ],
        "biography": "S. Epatha Merkerson (born Sharon Epatha Merkerson) is an American film, stage, and television actress. She has won a Golden Globe, Emmy Awards, a Screen Actors Guild Award, Obie Award, 4 NAACP Image Awards, and 2 Tony Award nominations.\n\nShe is best known for her role as NYPD Lieutenant Anita Van Buren (1993–2010) on the long-running NBC police procedural drama series Law & Order, as well as the Law & Order TV movie Exiled. She appeared in 390 episodes of the series, more than any other cast member.\n\nShe has a starring role as Sharon Goodwin on NBC's Chicago Med. She also had a recurring role as Reba (the mail carrier) on Pee-wee's Playhouse, and Ms. St. Marth on the TV series Here and Now.\n\nShe has appeared in feature films including She's Gotta Have It, Loose Cannons, Jacob's Ladder, Terminator 2: Judgment Day, Random Hearts, Radio, Black Snake Moan, Lincoln (2012), and Peeples. She has also appeared in TV movies including A Place for Annie, A Mother's Prayer, Breaking Through, Lackawanna Blues, and The Gabby Douglas Story.",
        "birthday": "1952-11-28",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 3978,
        "imdb_id": "nm0580924",
        "known_for_department": "Acting",
        "name": "S. Epatha Merkerson",
        "place_of_birth": "Saginaw, Michigan, USA",
        "popularity": 0.7318,
        "profile_path": "/pXCmHxrWzlv1kPZSxJXFM45QgOP.jpg"
    }
}