{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/pgtHrfRnVpOWbiGYFVoHM3E9rN.jpg",
                "genre_ids": [
                    35
                ],
                "id": 11686,
                "original_language": "en",
                "original_title": "Love and Death",
                "overview": "In czarist Russia, a neurotic soldier and his distant cousin formulate a plot to assassinate Napoleon.",
                "popularity": 2.2891,
                "poster_path": "/oJXFd1UHZoOQ1UtoLxbyBLGJDox.jpg",
                "release_date": "1975-06-10",
                "title": "Love and Death",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 927,
                "character": "Woman (uncredited)",
                "credit_id": "63938963ba480200bb012942",
                "order": 58
            },
            {
                "adult": false,
                "backdrop_path": "/7AvbU0ei7Fz21jqBL4tlgSufnMp.jpg",
                "genre_ids": [
                    53,
                    80,
                    18
                ],
                "id": 2721,
                "original_language": "fr",
                "original_title": "Z",
                "overview": "Amid a tense political climate, the opposition leader is killed in an apparent accident. When a prosecutor smells a cover-up, witnesses get targeted. A thinly veiled dramatization of the assassination of Greek politician Grigoris Lambrakis and its aftermath, “Z” captures the outrage at the US-backed junta that ruled Greece at the time of its release.",
                "popularity": 3.3259,
                "poster_path": "/dFAJyFNgvOv24f2RQyI9KDxjGr3.jpg",
                "release_date": "1969-02-26",
                "title": "Z",
                "video": false,
                "vote_average": 7.795,
                "vote_count": 580,
                "character": "Nick's Mother",
                "credit_id": "56565a239251410188005a4b",
                "order": 25
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Andrée Micheline Ghislaine Tainsy (26 April 1911 – 19 December 2004) was a Belgian actress. She worked with several notable actors like Philippe Noiret, Jean Louis Trintignant, Charlotte Rampling and famous directors like Claude Chabrol, Costas Gavras and François Ozon. Tainsy began her career with theater plays and her first film debut was in 1945, followed by over 80 different cinema and TV works as co-star. She worked until the day of her death.\n\nShe was born in Etterbeek, Belgium.\n\nAndrée Tainsy attended Brussels' Conservatory, where she trained to become a theater performer in the early 1930s. She moved to Paris and made her debut with the Georges Pitoëff theatrical company in Les Voyageurs Sans Bagage (1937). Her film debut was ready in 1939 however, as World War II started, she fled to South America, where she reconnected with other artists who had also left. Her first experience in front of was in Chile a movie camera and in 1945 her movie career began starring in Jacques Remy's Le Moulin des Andes (Released in Chile as La Fruta Mordida).\n\nUpon her return to France, after the end of the war, she resumed her theatrical activity with Les Amants de Noël and Joyeux Chagrins, both in 1948. Tainsy's career as an actress and comedian went on until the very end of her life. She worked until the day of her death. She appeared in a small role in Arnaud Desplechin's Rois et Reine on 22 December 2004, just three days after she died. Her cinema endeavors comprised works with several directors like Bertrand Tavernier, Woody Allen, Claude Chabrol, François Ozon and Arnaud Desplechin.\n\nOn 19 December 2004, after attending a presentation of a play by Pierre Desproges, she suffered a heart attack at her Parisian apartment. She was buried at Père-Lachaise Cemetery in Paris.\n\nSource: Article \"Andrée Tainsy\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1911-04-26",
        "deathday": "2004-12-19",
        "gender": 1,
        "homepage": null,
        "id": 39882,
        "imdb_id": "nm0846841",
        "known_for_department": "Acting",
        "name": "Andrée Tainsy",
        "place_of_birth": "Etterbeek, Belgium",
        "popularity": 0.0454,
        "profile_path": "/9IaNABXwlc2tBM9RlhtgTpnaRn3.jpg"
    }
}