{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dS8AcMrQfC1PQA7njdFECCPkMvd.jpg",
                "genre_ids": [
                    16,
                    878
                ],
                "id": 16306,
                "original_language": "fr",
                "original_title": "La Planète sauvage",
                "overview": "On the planet Ygam, the Draags, extremely technologically and spiritually advanced blue humanoids, consider the tiny Oms, human beings descendants of Terra's inhabitants, as ignorant animals. Those who live in slavery are treated as simple pets and used to entertain Draag children; those who live hidden in the hostile wilderness of the planet are periodically hunted and ruthlessly slaughtered as if they were vermin.",
                "popularity": 1.685,
                "poster_path": "/prq0j1S0K07UjwLZLF6oMGflRUI.jpg",
                "release_date": "1973-12-01",
                "title": "Fantastic Planet",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 1021,
                "character": "Master Sinh (voice)",
                "credit_id": "52fe46c39251416c75082a95",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jean Pierre Camille Henri Topart"
        ],
        "biography": "ean Topart (13 April 1922 – 29 December 2012) was a French actor. He was considered one of the best known voices on French television for decades. In addition to providing the voices and narration for television series and animated films, Topart often dubbed American and other foreign films into French.\n\nTopart was born in Paris, on 13 April 1922. His sister, actress Lise Topart, died in a plane crash in Nice, France, on 3 March 1952.\n\nIn 1973, Topart starred in the French science fiction animated film, Fantastic Planet, which was directed by René Laloux. Best known for his voice work, Topart co-starred in the 1981 Franco-Japanese animated television series, Ulysses 31, and The Mysterious Cities of Gold in 1982. He narrated the 2000 French animated series, Argai: The Prophecy.\n\nTopart was cast in the French version of numerous foreign language films, including DuckTales the Movie: Treasure of the Lost Lamp for Disney in 1990. He was cast as narrator for the French-language release of the 2002 Walt Disney Animation Studios film, Treasure Planet, known as La Planète au trésor, un nouvel univers in French. Topart also dubbed the French-language voices for many foreign live-action films, including The Elephant Man in 1980, Birdy in 1984, and Amadeus in 1984.\n\nOutside of animation, Topart was a member of the Théâtre national populaire (TNP), a French theater troupe, from 1950 to 1960 before entering film and television. His live-action film credits included Angélique, Marquise des Anges by Bernard Borderie in 1964 and Claude Chabrol's Chicken with Vinegar in 1985. His last on-screen film was the 2000 comedy, Les Acteurs, directed by Bertrand Blier.\n\nTopart died in Le Port-Marly, Yvelines department, France, on 29 December 2012, at the age of 90. He was survived by his two daughters and five grandchildren. French Minister of Culture Aurélie Filippetti released a statement following Topart's death calling him, \"one of the inimitable voices of French cinema.\"\n\nSource: Article \"Jean Topart\" from Wikipedia in English, licensed under CC-BY-SA.",
        "birthday": "1922-04-13",
        "deathday": "2012-12-29",
        "gender": 2,
        "homepage": null,
        "id": 39880,
        "imdb_id": "nm0867622",
        "known_for_department": "Acting",
        "name": "Jean Topart",
        "place_of_birth": "Paris, France",
        "popularity": 0.1832,
        "profile_path": "/fdhZKkU8RBvH08Qq1P7WnkLZYWi.jpg"
    }
}