{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6van4BavoNXaZhCPdzLHNQ4Uc8H.jpg",
                "genre_ids": [
                    53,
                    28
                ],
                "id": 1087891,
                "original_language": "en",
                "original_title": "The Amateur",
                "overview": "After his life is turned upside down when his wife is killed in a London terrorist attack, a brilliant but introverted CIA decoder takes matters into his own hands when his supervisors refuse to take action.",
                "popularity": 23.6517,
                "poster_path": "/SNEoUInCa5fAgwuEBMIMBGvkkh.jpg",
                "release_date": "2025-04-09",
                "title": "The Amateur",
                "video": false,
                "vote_average": 6.984,
                "vote_count": 1196,
                "character": "Respiratory Clinic Secretary",
                "credit_id": "67e5fb68e8a1910e6510d535",
                "order": 31
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Lily Sinko is a British-French actress and theatre maker. She originates from Marseille, where she was raised in a bicultural household with familial ties to both France and the United Kingdom, and she maintains residences in London and Paris. While her parents' names and occupations are not publicly disclosed, Sinko grew up in a multilingual and multicultural environment that fostered fluency in both English and French, providing her with a natural facility for performing across different theatrical and cinematic traditions. Her formal artistic training began at the Conservatoire de Marseille between 2013 and 2015, where she laid the groundwork for her performance technique. She then continued her studies at East 15 Acting School from 2016 to 2019, undertaking a rigorous three-year acting degree with a curriculum emphasizing stagecraft, voice, physical movement, and ensemble work. During her time at East 15, she broadened her scope by exploring musical theatre, clowning, physical performance, and voiceover, developing a range of expressive tools that would become central to her interdisciplinary approach. After completing her training, Sinko began appearing in independent short films, including \"The Dog,\" \"The Garden,\" \"The Start-Up,\" and \"Twitch,\" taking on supporting roles that allowed her to collaborate with emerging directors and explore on-screen performance through character work grounded in vocal precision and emotional nuance. Her screen breakthrough came with a guest role as a camp receptionist in the British-French espionage thriller \"Liaison\" (2023), a bilingual production that reflected her international background and marked her entrance into higher-profile streaming television. Parallel to her screen work, Sinko has remained deeply active in live performance, contributing to productions staged at platforms such as the Edinburgh Fringe Festival and London's Vault Festival. These appearances, often in ensemble or music-driven experimental works, highlight her continued engagement with contemporary theatre-making and collaborative storytelling. Embracing an actor-maker identity, Sinko's work is characterized by a commitment to dramaturgical development, multilingual expression, and cross-genre performance. As she continues to develop her career across stage and screen, her foundation in diverse training environments and bilingual performance contexts signals a trajectory grounded in versatility, experimentation, and sustained artistic inquiry.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.filmmakers.eu/en/actors/lily-sinko",
        "id": 3989211,
        "imdb_id": "nm12388583",
        "known_for_department": "Acting",
        "name": "Lily Sinko",
        "place_of_birth": "Marseilles, France",
        "popularity": 0.0071,
        "profile_path": "/4KpBNYKFJIlOdzOvdl59bHzsrln.jpg"
    }
}