{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kB9Y59YDMOFdm5LgSyTVj4b6hh6.jpg",
                "genre_ids": [
                    28,
                    53
                ],
                "id": 4909,
                "original_language": "en",
                "original_title": "The Day of the Jackal",
                "overview": "An international assassin known as ‘The Jackal’ is employed by disgruntled French generals to kill President Charles de Gaulle, with a dedicated gendarme on the assassin’s trail.",
                "popularity": 6.0815,
                "poster_path": "/vThgcb3JOj99yETg8WChuci4LV2.jpg",
                "release_date": "1973-05-16",
                "title": "The Day of the Jackal",
                "video": false,
                "vote_average": 7.541,
                "vote_count": 631,
                "character": "Victor Wolenski",
                "credit_id": "52fe43e1c3a36847f8075f55",
                "order": 16
            },
            {
                "adult": false,
                "backdrop_path": "/4II0fdNtTMR0elrMgQSn9wfYuuk.jpg",
                "genre_ids": [
                    35,
                    37
                ],
                "id": 9474,
                "original_language": "it",
                "original_title": "Il mio nome è Nessuno",
                "overview": "Jack Beauregard, an aging gunman of the Old West, only wants to retire in peace and move to Europe, but a young gunfighter known as \"Nobody\" who idolizes Beauregard wants him to go out in a blaze of glory. So, he arranges for Jack to face the 150-man gang known as The Wild Bunch and earn his place in history.",
                "popularity": 2.0889,
                "poster_path": "/tJQEVI1p00Jh9TUgNEI623iu7ST.jpg",
                "release_date": "1973-12-13",
                "title": "My Name Is Nobody",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 996,
                "character": "Sullivan",
                "credit_id": "52fe44fcc3a36847f80b5da9",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/kIBBeb94FbNfLSljeFUxUoszflb.jpg",
                "genre_ids": [
                    18,
                    10752,
                    36
                ],
                "id": 17295,
                "original_language": "it",
                "original_title": "La battaglia di Algeri",
                "overview": "Paratrooper commander Colonel Mathieu, a former French Resistance fighter during World War II, is sent to Algeria to reinforce efforts to squelch the uprisings of the Algerian War. There he faces Ali la Pointe, a former petty criminal who, as the leader of the Algerian Front de Liberation Nationale, directs terror strategies against the colonial French government occupation. As each side resorts to ever-increasing brutality, no violent act is too unthinkable.",
                "popularity": 2.1462,
                "poster_path": "/2p3AFtOHFvP6OeVMqlnL1zLKOqL.jpg",
                "release_date": "1966-09-08",
                "title": "The Battle of Algiers",
                "video": false,
                "vote_average": 7.872,
                "vote_count": 826,
                "character": "Colonel Philippe Mathieu",
                "credit_id": "52fe47169251416c7508d54b",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/qodtpClU5xHfaTjQBPnt37OGRBd.jpg",
                "genre_ids": [
                    35
                ],
                "id": 761,
                "original_language": "fr",
                "original_title": "L'Aile ou la Cuisse",
                "overview": "Charles Duchemin, a well-known gourmet and publisher of a famous restaurant guide, is waging a war against fast food entrepreneur Tri- catel to save the French art of cooking. After having agreed to appear on a talk show to show his skills in naming food and wine by taste, he is confronted with two disasters: his son wants to become a clown rather than a restaurant tester and he, the famous Charles Duchemin, has lost his taste!",
                "popularity": 2.5068,
                "poster_path": "/ywkIu5l3iAgPZvLFEVBDYxLouH8.jpg",
                "release_date": "1976-10-27",
                "title": "The Wing or the Thigh?",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 925,
                "character": "Duchemin's Doctor at Clinic",
                "credit_id": "536f7be70e0a2647db012395",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Jean Martin (6 March 1922 - 2 February 2009) was a French actor. Coming from a Berry family, he spent part of his childhood in Biarritz, where his father worked for a furrier. During the Second World War, he hid to escape the Forced Labor Service. Staying in Paris, he appeared in two films by Maurice Tourneur: \"The Devil's Hand\" (1942) then \"Cécile Est Mort\" (1943). At the twilight of the forties, he started doing theater.\n\nIn 1953, Jean Martin gained notoriety by playing the new play by Irish playwright Samuel Beckett, \"Waiting for Godot\", under the direction of Roger Blin, becoming the first to take on the role of Lucky. The same Roger Blin produced “End of the Game” (1957), by the same Beckett, a few years later, and entrusted the same Jean Martin with the role of Clov. In 1960, Jean Martin staged his first play, “Letter Dead”, by Robert Pinget. In 1962, he again staged a play, “The Representatives”, by Aglaé and Mona Mitropoulos, adapted by Michel Arnaud. Alongside this theatrical career which would prove to be rich, Jean Martin returned to cinema: “Notre-Dame de Paris” (1956), by Jean Delannoy, “Paris belongs to us” (1958), by Jacques Rivette, “Ballade for a thug \" (1962), by Jean-Claude Bonnardot, \"La foire aux dunces\" (1963), by Louis Daquin and \"À toi de fait mignon\" (1963), by Bernard Borderie.\n\nIn 1960, he was a signatory of the Manifesto of the 121 entitled “Declaration on the right to insubordination in the Algerian war”. In 1965, a role marked his career, that of Colonel Mathieu, in a film retracing the struggle in 1957 for control of the Casbah district of Algiers between FLN militants and French soldiers: \"The Battle of Algiers\" . Three years after the end of the Algerian War, the subject is still sensitive on each side of the Mediterranean; the film was banned in France upon its release, then censored until 2004. Jean Martin, very convincing in this role of division commander (historically, the commander is General Massu, but the character is inspired by Colonel Bigeard), is the only professional actor in the film. His large stature, his strong personality and his imperious face predispose him to notable roles generally showing authority: chief doctor, police commissioner, high-ranking military officer, ecclesiastical dignitary...; one of the most impressive will undoubtedly be that of a doctor vehemently expelling from his hospital a judge Fayard, Patrick Dewaere, a bit of a cavalier in \"Le Juge Fayard Dit Le Shérif\" (1976). Claude Zidi mocks these roles in his comedies: principal in “La moutarde monte au nose” (1974), bank director in “La Course À L'Échalote” (1975), chief doctor in “L'aile ou la thigh” (1976), principal inspector in “Bête mais disciplined” (1979) and examiner in “Inspecteur la Bavure” (1980). Alongside Jean-Paul Belmondo, he is… cardinal in “L’Hériter” (1972) and… divisional commissioner in “Peur Sur La ville” (1975)! But also alongside Terence Hill in “My Name is Nobody” (1973) in the role of Sullivan, or “One Genius, Two Associates, One Bell (1975).\n\nAfter devoting a large part of his career to the theater, appearing in around fifty films, Jean Martin died on February 2, 2009, in Paris.",
        "birthday": "1922-03-06",
        "deathday": "2009-02-02",
        "gender": 2,
        "homepage": "https://www.spla.pro/fr/fiche.personnes.spla.56361.html",
        "id": 39953,
        "imdb_id": "nm0552483",
        "known_for_department": "Acting",
        "name": "Jean Martin",
        "place_of_birth": "Paris, France",
        "popularity": 0.3829,
        "profile_path": "/f7J7ItHt6AHz8z2PQuWpdH0lCHz.jpg"
    }
}