{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kB9Y59YDMOFdm5LgSyTVj4b6hh6.jpg",
                "genre_ids": [
                    28,
                    53
                ],
                "id": 4909,
                "original_language": "en",
                "original_title": "The Day of the Jackal",
                "overview": "An international assassin known as ‘The Jackal’ is employed by disgruntled French generals to kill President Charles de Gaulle, with a dedicated gendarme on the assassin’s trail.",
                "popularity": 5.8509,
                "poster_path": "/vThgcb3JOj99yETg8WChuci4LV2.jpg",
                "release_date": "1973-05-16",
                "title": "The Day of the Jackal",
                "video": false,
                "vote_average": 7.541,
                "vote_count": 631,
                "character": "Colonel Rodin",
                "credit_id": "52fe43e1c3a36847f8075f69",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "A highly respected Shakespearean for five decades until his death of colon cancer in 1995, classical actor Eric Porter's claim to international fame would, ironically, be outside of that realm, with one superb portrayal in one superb miniseries, The Forsyte Saga(1967), in which he won the BAFTA award. The son of Richard John Porter and Phoebe Elizabeth Spall, Porter first attended Wimbledon Technical College before stepping onto the stage as a walk-on in a production of William Shakespeare's \"Twelfth Night\" in February 1945 at the Arts Theatre in Cambridge. He continued in repertory until joining the National Service with the RAF during the war years. Early post-war credits would include touring with Sir Donald Wolfit and Sir Barry Jackson in their prestigious companies. Favorite roles in his repertoire would eventually include \"Macbeth\", \"King Lear\" and \"Uncle Vanya\". He won London's Evening Standard Award for \"Rosmersholm\" in 1959. Joining the Royal Shakespeare Company in 1960, he became a prime, esteemed resident for decades. Porter made his film debut in mid-career with The Fall of the Roman Empire (1964) at age 36, but it was the BBC that made him an international favorite as the ever-proper but intensely emotional and unhinged \"Soames Forsyte\". Taboos were broken on that series with a violent rape scene that had people talking for months. Along with the newly acquired fame came leads in lesser films such as The Lost Continent(1968) and Hands of the Ripper (1971), adding class to both those atmospheric horrors. On the plus side, Porter engaged himself frequently in quality TV miniseries fare includingAnna Karenina (1977), The Jewel in the Crown (1984) and Oliver Twist (1985) (as Fagin), while transferring many classics to TV as well, with \"Cyrano de Bergerac\", \"Man and Superman\" and \"Macbeth\" being but a few.",
        "birthday": "1928-04-08",
        "deathday": "1995-05-15",
        "gender": 2,
        "homepage": null,
        "id": 39955,
        "imdb_id": "nm0692110",
        "known_for_department": "Acting",
        "name": "Eric Porter",
        "place_of_birth": "Shepard's Bush, London, UK",
        "popularity": 0.2152,
        "profile_path": "/fspL0jPlDYqgscfrIPD8ytb3XXb.jpg"
    }
}