{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kB9Y59YDMOFdm5LgSyTVj4b6hh6.jpg",
                "genre_ids": [
                    28,
                    53
                ],
                "id": 4909,
                "original_language": "en",
                "original_title": "The Day of the Jackal",
                "overview": "An international assassin known as ‘The Jackal’ is employed by disgruntled French generals to kill President Charles de Gaulle, with a dedicated gendarme on the assassin’s trail.",
                "popularity": 5.8509,
                "poster_path": "/vThgcb3JOj99yETg8WChuci4LV2.jpg",
                "release_date": "1973-05-16",
                "title": "The Day of the Jackal",
                "video": false,
                "vote_average": 7.541,
                "vote_count": 631,
                "character": "Mallinson",
                "credit_id": "52fe43e1c3a36847f8075f59",
                "order": 21
            },
            {
                "adult": false,
                "backdrop_path": "/hljMglukfpnfaNmUgMuORmL4OVW.jpg",
                "genre_ids": [
                    10751,
                    16,
                    12
                ],
                "id": 21032,
                "original_language": "en",
                "original_title": "Balto",
                "overview": "An outcast half-wolf risks his life to prevent a deadly epidemic from ravaging Nome, Alaska.",
                "popularity": 2.2192,
                "poster_path": "/dCVcdb5oxDizqFLz0F7TE60NoC9.jpg",
                "release_date": "1995-12-22",
                "title": "Balto",
                "video": false,
                "vote_average": 7.304,
                "vote_count": 2105,
                "character": "Doc (voice)",
                "credit_id": "669a583031a9b899a04aa104",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Sir Donald Sinden"
        ],
        "biography": "​Sir Donald Alfred Sinden CBE (born 9 October 1923) is an English actor of theatre, film and television. Sinden was born in Plymouth, Devon, England, on 9 October 1923. The son of Alfred Edward Sinden and his wife Mabel Agnes (née Fuller), he grew up in the Sussex village of Ditchling, where their home ('The Limes') doubled as the local chemist shop. He was married to actress Diana Mahony from 1948 until her death in 2004. He lives near Tenterden, Kent.\n\nThe couple had two sons: actor Donald Sinden, who died of lung cancer in 1996, and Marc Sinden who is a West End theatre producer.\n\nEarly career\n\nHe trained as an actor at the Webber Douglas Academy of Dramatic Art and made his first stage appearance at the Brighton Little Theatre (of which he later became President) in January 1941, playing Dudley in George and Margaret. He broke into professional acting after appearing with the Mobile Entertainments Southern Area company in modern comedies for the armed forces during the Second World War.\n\nRank Organisation\n\nIn 1953 he was contracted for seven years to the Rank Organisation at Pinewood Studios and subsequently starred in many outstanding British films of the 1950s including The Cruel Sea, Mogambo, Doctor in the House, Above Us The Waves, Doctor at Large, The Siege of Sidney Street, Twice Round the Daffodils and with a very young Adam Faith in Mix Me a Person.\n\nDescription above from the Wikipedia article Donald Sinden, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1923-10-09",
        "deathday": "2014-09-11",
        "gender": 2,
        "homepage": null,
        "id": 39954,
        "imdb_id": "nm0801786",
        "known_for_department": "Acting",
        "name": "Donald Sinden",
        "place_of_birth": "Plymouth, Devon, England, UK",
        "popularity": 0.1907,
        "profile_path": "/x7xq2O7mqVwSnnQNo3E1YDndIx7.jpg"
    }
}