{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2clBxxclZJ4OK1xzhmCCXHEfy3r.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 759,
                "original_language": "en",
                "original_title": "Gentlemen Prefer Blondes",
                "overview": "Lorelei Lee is a beautiful showgirl engaged to be married to the wealthy Gus Esmond, much to the disapproval of Gus' rich father, Esmond Sr., who thinks that Lorelei is just after his money. When Lorelei goes on a cruise accompanied only by her best friend, Dorothy Shaw, Esmond Sr. hires Ernie Malone, a private detective, to follow her and report any questionable behavior that would disqualify her from the marriage.",
                "popularity": 2.362,
                "poster_path": "/fDozhst5HVJJcd3BM8ZOsKniO7Q.jpg",
                "release_date": "1953-07-14",
                "title": "Gentlemen Prefer Blondes",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1011,
                "character": "Winston, Olympic Team Member (uncredited)",
                "credit_id": "6574e0a1a84a47013821918e",
                "order": 98
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jack Moore"
        ],
        "biography": "Jack Alvin \"Alvy\" Moore (December 5, 1921 – May 4, 1997) was an American light comic actor best known for his role as scatterbrained county agricultural agent Hank Kimball on the CBS television series Green Acres. His character would often make a statement, only to immediately negate the statement himself and then negate the corrected statement until his stream of statements was interrupted by a frustrated Oliver Wendell Douglas portrayed by Eddie Albert. One such statement was, \"Good morning, Mr. Douglas! Well, it's not a good morning ... but it's not a bad morning either!\"\n\nHe became an actor and furthered his training at the Pasadena Playhouse, succeeding David Wayne in the role of Ensign Pulver opposite Henry Fonda's Mister Roberts on Broadway, and later toured with the play for 14 months. He made his screen debut playing the quartermaster in Okinawa (1952).[4]\n\nMoore appeared in guest and supporting roles in a number of movies and television shows, including \"My Little Margie\" in 1952, as Dillard Crumbly, an efficiency expert fresh out of Efficiency College, The Mickey Mouse Club, where he hosted \"What I Want to Be\" segments as the Roving Reporter. He had a small role as a member of Marlon Brando's motorcycle gang in the 1953 film The Wild One, and a similar bit part the same year as one of the Linda Rosa townspeople in The War of the Worlds. Moore co-starred with Dick Powell and Debbie Reynolds in the 1954 film Susan Slept Here, in which he displayed his natural gift for physical comedy. In 1955 he co-starred with Brian Keith and Kim Novak in 5 Against the House. In the early 1960s he was cast in the recurring role of Howie in 11 episodes of the CBS sitcom Pete and Gladys, with Harry Morgan and Cara Williams.[4]\n\nIn 1962 Moore was cast as the Swiss-American botanist David Douglas, for whom the Douglas fir tree is named, in an episode of the western anthology series Death Valley Days. Keenan Wynn co-starred as Douglas' friend Josh Tavers, and Iron Eyes Cody played an Indian chief who threatens to kill the two men.[6]\n\nMoore made a brief appearance as a cab driver in the 1964 Perry Mason episode \"The Case of the Wednesday Woman.\" He also appeared in two episodes of another CBS sitcom, The Dick Van Dyke Show, \"The Impractical Joke\" and \"The Case Of The Pillow.\" He was also a guest star on The Andy Griffith Show and later on Little House on the Prairie (TV series). He was an actor, producer, and uncredited scriptwriter for A Boy and His Dog. He attended DisCon II, the 1974 World Science Fiction Convention, to help promote the film. One of his last television appearances was a brief guest shot on the sitcom Frasier.\n\nIn the 1980s Moore appeared in many cult horror films, including Scream (1981), Mortuary (1983), They're Playing With Fire (1984), Intruder (1989), and The Horror Show (1989).",
        "birthday": "1921-12-05",
        "deathday": "1997-05-04",
        "gender": 2,
        "homepage": null,
        "id": 40001,
        "imdb_id": "nm0600886",
        "known_for_department": "Acting",
        "name": "Alvy Moore",
        "place_of_birth": "Vincennes, Indiana, USA",
        "popularity": 0.1959,
        "profile_path": "/3974gHUAsew2gV5hPZeBWj5cK9a.jpg"
    }
}