{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4i3Amppd6eW5Qkhjv4gdHk3CCoE.jpg",
                "genre_ids": [
                    36,
                    10402,
                    18
                ],
                "id": 279,
                "original_language": "en",
                "original_title": "Amadeus",
                "overview": "Disciplined Italian composer Antonio Salieri becomes consumed by jealousy and resentment towards the hedonistic and remarkably talented young Salzburger composer Wolfgang Amadeus Mozart.",
                "popularity": 5.9174,
                "poster_path": "/1n5VUlCqgmVax1adxGZm8oCFaKc.jpg",
                "release_date": "1984-09-19",
                "title": "Amadeus",
                "video": false,
                "vote_average": 8.026,
                "vote_count": 4488,
                "character": "Constanze Mozart",
                "credit_id": "52fe4231c3a36847f800b1d3",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/sAiTihJ8bjEqg8nYUIlTQUnVXuj.jpg",
                "genre_ids": [
                    37,
                    12
                ],
                "id": 2023,
                "original_language": "en",
                "original_title": "Hidalgo",
                "overview": "Set in 1890, this is the story of a Pony Express courier who travels to Arabia to compete with his horse, Hidalgo, in a dangerous race for a massive contest prize, in an adventure that sends the pair around the world...",
                "popularity": 4.8952,
                "poster_path": "/iGzENlBPYJEFWZnye4t3nqWSSp1.jpg",
                "release_date": "2004-02-04",
                "title": "Hidalgo",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 1271,
                "character": "Annie Oakley",
                "credit_id": "5ac24880c3a3682d3301d268",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Elizabeth Berridge (born May 2, 1962) is an American film and theatre actress. She is best-known for playing Constanze Mozart in the Academy Award winning 1984 film Amadeus.\n\nBerridge was born in New Rochelle, New York, the daughter of George Berridge, a lawyer, and Mary L. Berridge (née Robinson), a social worker. The Berridge family settled in Larchmont, New York, where she attended Chatsworth Elementary School, there she began to perform and sing. Due to her acting commitments, she earned her diploma through an independent-study program at Mamaroneck High School.\n\nBerridge was called in to audition for the part of Constanze Mozart after filming had already commenced in Prague on Amadeus. The actress who had begun the role, Meg Tilly, injured her leg in a neighborhood soccer game and had to quit the project. Two actresses were flown to Prague, and after a week's auditions Berridge was given the part (supposedly because the other actress was \"too pretty\" to play the part of an innkeeper's daughter). Berridge (and the other cast members) remained in Prague for six months to complete the onsite filming.\n\nDescription above from the Wikipedia article Elizabeth Berridge, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1962-05-02",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 4000,
        "imdb_id": "nm0000931",
        "known_for_department": "Acting",
        "name": "Elizabeth Berridge",
        "place_of_birth": "New Rochelle, New York, USA",
        "popularity": 0.577,
        "profile_path": "/qMAOM7cMnNs6emGQXoVzRYozgc0.jpg"
    }
}