{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4i3Amppd6eW5Qkhjv4gdHk3CCoE.jpg",
                "genre_ids": [
                    36,
                    10402,
                    18
                ],
                "id": 279,
                "original_language": "en",
                "original_title": "Amadeus",
                "overview": "Disciplined Italian composer Antonio Salieri becomes consumed by jealousy and resentment towards the hedonistic and remarkably talented young Salzburger composer Wolfgang Amadeus Mozart.",
                "popularity": 5.9174,
                "poster_path": "/1n5VUlCqgmVax1adxGZm8oCFaKc.jpg",
                "release_date": "1984-09-19",
                "title": "Amadeus",
                "video": false,
                "vote_average": 8.026,
                "vote_count": 4488,
                "character": "Emanuel Schikaneder",
                "credit_id": "52fe4231c3a36847f800b1d7",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/7BawlYbO8j434ovY0xTHpaNNE0Y.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 11257,
                "original_language": "en",
                "original_title": "A Room with a View",
                "overview": "When Lucy Honeychurch and chaperon Charlotte Bartlett find themselves in Florence with rooms without views, fellow guests Mr Emerson and son George step in to remedy the situation. Meeting the Emersons could change Lucy's life forever but, once back in England, how will her experiences in Tuscany affect her marriage plans?",
                "popularity": 3.0288,
                "poster_path": "/5xRAqywVo6tNUNQbAESGVP930la.jpg",
                "release_date": "1986-03-07",
                "title": "A Room with a View",
                "video": false,
                "vote_average": 6.941,
                "vote_count": 800,
                "character": "The Reverend Mr. Beebe",
                "credit_id": "52fe441b9251416c7502906d",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/rN1OKiEp8gNQ9RB6GeZeqOqVsjk.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 26371,
                "original_language": "en",
                "original_title": "Maurice",
                "overview": "After his lover rejects him, Maurice attempts to come to terms with his sexuality within the restrictiveness of Edwardian society.",
                "popularity": 2.1282,
                "poster_path": "/4MI2y8XViPrDiKs1p0QC4bTeZzf.jpg",
                "release_date": "1987-09-18",
                "title": "Maurice",
                "video": false,
                "vote_average": 7.625,
                "vote_count": 573,
                "character": "Mr. Ducie",
                "credit_id": "52fe44fdc3a368484e0427bd",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/p3P0eTh8AnqauhRZg0wgoBFvcjF.jpg",
                "genre_ids": [
                    53,
                    18,
                    10749
                ],
                "id": 9833,
                "original_language": "en",
                "original_title": "The Phantom of the Opera",
                "overview": "A young soprano becomes the obsession of a disfigured and murderous musical genius who lives beneath the Paris Opera House.",
                "popularity": 4.0128,
                "poster_path": "/pFf1Xxzgxo6ffxAJeSkAb5b0P4S.jpg",
                "release_date": "2004-12-08",
                "title": "The Phantom of the Opera",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1692,
                "character": "Andre",
                "credit_id": "52fe4537c3a36847f80c27d3",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/9as73Rj0Y7nMZBZTwoyjyUpfjyS.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 423899,
                "original_language": "en",
                "original_title": "Victoria & Abdul",
                "overview": "Queen Victoria strikes up an unlikely friendship with a young Indian clerk named Abdul Karim.",
                "popularity": 2.6178,
                "poster_path": "/uIzQ8zZ0rqjqqJUIpeeovtTryAa.jpg",
                "release_date": "2017-09-13",
                "title": "Victoria & Abdul",
                "video": false,
                "vote_average": 6.901,
                "vote_count": 1172,
                "character": "Mr. Puccini",
                "credit_id": "5819412292514133ab0023db",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/egyi9TQjLhNEQuEsK1dXovdHOHL.jpg",
                "genre_ids": [
                    10749,
                    35
                ],
                "id": 509,
                "original_language": "en",
                "original_title": "Notting Hill",
                "overview": "London bookstore owner William Thacker's quiet life turns upside down when a chance encounter with famous actress Anna Scott sparks an unlikely romance challenged by their vastly different worlds.",
                "popularity": 9.0224,
                "poster_path": "/hHRIf2XHeQMbyRb3HUx19SF5Ujw.jpg",
                "release_date": "1999-05-21",
                "title": "Notting Hill",
                "video": false,
                "vote_average": 7.265,
                "vote_count": 6422,
                "character": "Simon Callow (uncredited)",
                "credit_id": "5899588592514113c6000039",
                "order": 38
            },
            {
                "adult": false,
                "backdrop_path": "/novvibtQv0B4psRxuqvd8g2qS5M.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 8293,
                "original_language": "en",
                "original_title": "Howards End",
                "overview": "A saga of class relations and changing times in an Edwardian England on the brink of modernity, the film centers on liberal Margaret Schlegel, who, along with her sister Helen, becomes involved with two couples: wealthy, conservative industrialist Henry Wilcox and his wife Ruth, and the downwardly mobile working-class Leonard Bast and his mistress Jackie.",
                "popularity": 2.372,
                "poster_path": "/1009nhfj28VhhQnVadtjkOacduX.jpg",
                "release_date": "1992-03-13",
                "title": "Howards End",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 565,
                "character": "Music and Meaning Lecturer (uncredited)",
                "credit_id": "588587f8c3a3684d660022a5",
                "order": 49
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Simon Phillip Hugh Callow",
            "사이먼 캘로우",
            "سایمن کالو"
        ],
        "biography": "Simon Phillip Hugh Callow (CBE)(born 15 June 1949) is an English actor. Known as a character actor on stage and screen, he has received numerous accolades including an Olivier Award and Screen Actors Guild Award as well as nominations for two BAFTA Awards. He was made a Commander of the Order of the British Empire (CBE) for his services to acting by Queen Elizabeth II in 1999.\n\nCallow rose to prominence originating the title role of Wolfgang Amadeus Mozart in the 1979 Peter Shaffer play Amadeus, for which he received a Laurence Olivier Award for Best Actor in a Supporting Role nomination. Callow joined the Miloš Forman 1984 film adaptation, this time portraying Emanuel Schikaneder. In 1992, Callow won the Laurence Olivier Award for Best Director of a Musical for Carmen Jones. As an actor, he won acclaim for his comedic roles in A Room with a View (1985) and Four Weddings and a Funeral (1994) earning a BAFTA Award for Best Actor in a Supporting Role nomination for each. Other notable roles include in Maurice (1987), Howards End (1992), Shakespeare in Love (1998), and The Phantom of the Opera (2004).\n\nHis television roles include Tom Chance in the Channel 4 series Chance in a Million (1984) and The Duke of Sandringham in the series Outlander from 2014 to 2016. He portrayed Napoleon in The Man of Destiny (1981), and Charles Dickens in numerous television projects. He has also appeared on numerous shows such as Midsomer Murders, Rome, Angels in America, Doctor Who, Galavant, Hawkeye, and The Witcher.\n\nCallow was born on 15 June 1949 in Streatham, South London, the son of Yvonne Mary (née Guise), a secretary and Neil Francis Callow, a businessman. His father was of French descent and his mother was of Danish and German ancestry. His father left when Simon was 18 months old, and he was brought up by his mother and grandmothers. He and his mother travelled to Northern Rhodesia (now called Zambia) when he was nine to try and reconcile with his father. This did not happen and Callow was sent for three years to boarding school in South Africa. He and his mother returned to Britain when he was twelve. He was raised as a Catholic. Callow was a student at the London Oratory School in West Brompton, and then went on to study briefly at Queen's University Belfast in Northern Ireland, where he was active in the gay liberation movement.[5] He gave up his degree course after a year to take a three-year acting course at the Drama Centre London.\n\nHe made his first film appearance in 1984 as Schikaneder in Amadeus. The following year, he appeared as the Reverend Mr Beebe in A Room with a View. His first television role was in the Carry On Laughing episode \"Orgy and Bess\" in 1975, but it was cut from the final print. He starred in several series of the Channel 4 situation comedy Chance in a Million, as Tom Chance, an eccentric individual to whom coincidences happened regularly. Roles like this and his part in Four Weddings and a Funeral brought him to a wider audience. Callow portrayed Pliny the Elder in CBBC's 2007 children's drama series, Roman Mysteries in the episode \"The Secrets of Vesuvius\". He played Armand Duquesne in Marvel's Hawkeye on Disney+",
        "birthday": "1949-06-13",
        "deathday": null,
        "gender": 2,
        "homepage": "http://simoncallow.com/",
        "id": 4001,
        "imdb_id": "nm0001003",
        "known_for_department": "Acting",
        "name": "Simon Callow",
        "place_of_birth": "Streatham, London, England, UK",
        "popularity": 0.7067,
        "profile_path": "/no6qlnMrWeUzSt1FjD2Vf9x992e.jpg"
    }
}