{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gkXL5ka6ciU4A4KYSvLIAXtvh7k.jpg",
                "genre_ids": [
                    53,
                    18,
                    27
                ],
                "id": 10242,
                "original_language": "en",
                "original_title": "What Ever Happened to Baby Jane?",
                "overview": "A former child star torments her paraplegic sister in their decaying Hollywood mansion.",
                "popularity": 3.7595,
                "poster_path": "/msGYzyWwtjAaA3DScdgmvJ5MReG.jpg",
                "release_date": "1962-10-31",
                "title": "What Ever Happened to Baby Jane?",
                "video": false,
                "vote_average": 7.904,
                "vote_count": 1103,
                "character": "Ray Hudson",
                "credit_id": "52fe43489251416c7500a675",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/9AjG0YJLgDUtHl5KgrThHPhNNwZ.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 3083,
                "original_language": "en",
                "original_title": "Mr. Smith Goes to Washington",
                "overview": "After the death of a United States Senator, idealistic Jefferson Smith is appointed as his replacement in Washington. Soon, the naive and earnest new senator has to battle political corruption.",
                "popularity": 2.8661,
                "poster_path": "/nDjg1fbNyq15excNDl3acd2IqAk.jpg",
                "release_date": "1939-10-19",
                "title": "Mr. Smith Goes to Washington",
                "video": false,
                "vote_average": 7.846,
                "vote_count": 1117,
                "character": "Senate Guard (uncredited)",
                "credit_id": "555f30729251417e4d002a1a",
                "order": 185
            },
            {
                "adult": false,
                "backdrop_path": "/dYv4io2HcRMxFGgnErTbvpqSGXe.jpg",
                "genre_ids": [
                    53,
                    9648,
                    10749
                ],
                "id": 4174,
                "original_language": "en",
                "original_title": "Spellbound",
                "overview": "When Dr. Anthony Edwardes arrives at a Vermont mental hospital to replace the outgoing hospital director, Dr. Constance Peterson, a psychoanalyst, discovers Edwardes is actually an impostor. The man confesses that the real Dr. Edwardes is dead and fears he may have killed him, but cannot recall anything. Dr. Peterson, however is convinced his impostor is innocent of the man's murder, and joins him on a quest to unravel his amnesia through psychoanalysis.",
                "popularity": 4.0951,
                "poster_path": "/dPAox7jGScLBvxKLeRptJIBF7v.jpg",
                "release_date": "1945-11-08",
                "title": "Spellbound",
                "video": false,
                "vote_average": 7.419,
                "vote_count": 924,
                "character": "Bellboy (uncredited)",
                "credit_id": "5dd918daef8b3200128dd75c",
                "order": 31
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Dave 'Tugwell' Willock",
            "David Willock"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nDave Willock (August 13, 1909 – November 12, 1990) was an American character actor. Willock appeared in 181 films and television series from 1939 to 1989.  Born in 1909, Willock began his professional career in vaudeville in 1931, teaming with his boyhood friend Jack Carson in a comedy song and dance routine. For a time in the mid-1930s he was a reporter and editor for a Milwaukee newspaper. He first appeared on screen in Good Girls Go to Paris (1939), in an uncredited bit part.\n\nHe teamed with Carson again when Carson invited him to write for his radio show; Willock wrote and played the part of Carson's nephew Tugwell on The Jack Carson Show from 1943–1949. Willock and Cliff Arquette had their own radio and television shows in the early 1950s. Both versions were called Dave and Charley; the radio version was heard circa 1950, but the television version of it was on the air for only three months in early 1952.\n\nIn the 1961–1962 season, he played Harvey Clayton, father of the 1920s teenager Margie Clayton, portrayed by Cynthia Pepper in ABC's Margie. He appeared on an episode of Dragnet as an ex-vaudevillean who is cheated out of $9,000 that he found on a sidewalk. In 1966, he had an uncredited role as the bartender in the Elvis Presley vehicle Frankie and Johnny. Willock is probably most familiar to modern audiences from his performance as Baby Jane Hudson's father in the opening scenes of the cult classic What Ever Happened to Baby Jane? (1962). He played seven different characters on CBS's Green Acres with Eddie Albert and Eva Gabor, mostly portraying clerks or elevator operators.\n\nWillock also did voice acting for animated roles, such as the offscreen narrator on Wacky Races (1968) and as father Augustus \"Gus\" Holiday on The Roman Holidays (1972). He appeared in a television commercial for \"The Great American Soups\", directed by American satirist Stan Freberg, alongside tap-dancing star Ann Miller.\n\nHe died of complications due to stroke on November 12, 1990 at the age of 81. He is buried in Valhalla Memorial Park Cemetery. For his contribution to the television industry, Dave Willock has a star on the Hollywood Walk of Fame at 6358 Hollywood Boulevard.",
        "birthday": "1909-08-13",
        "deathday": "1990-11-12",
        "gender": 2,
        "homepage": null,
        "id": 40212,
        "imdb_id": "nm0932565",
        "known_for_department": "Acting",
        "name": "Dave Willock",
        "place_of_birth": "Chicago, Illinois, USA",
        "popularity": 0.2578,
        "profile_path": "/q8C2obtce5CET1VZNLKmH5GbUdf.jpg"
    }
}