{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3fgcEjBNrhstYgPlG1c8WT7UpIN.jpg",
                "genre_ids": [
                    16,
                    878,
                    53
                ],
                "id": 4977,
                "original_language": "ja",
                "original_title": "パプリカ",
                "overview": "When a machine that allows therapists to enter their patient's dreams is stolen, all hell breaks loose. Only a young female therapist can stop it and recover it before damage is done: Paprika.",
                "popularity": 5.9936,
                "poster_path": "/bLUUr474Go1DfeN1HLjE3rnZXBq.jpg",
                "release_date": "2006-10-01",
                "title": "Paprika",
                "video": false,
                "vote_average": 7.818,
                "vote_count": 2652,
                "character": "Kosaku Tokita (voice)",
                "credit_id": "52fe43eac3a36847f8078107",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/eA0qc5ihjSKG05tdJO4QPgYPAwY.jpg",
                "genre_ids": [
                    16,
                    10751,
                    12,
                    14,
                    28
                ],
                "id": 10228,
                "original_language": "ja",
                "original_title": "劇場版ポケットモンスター ミュウツーの逆襲",
                "overview": "Determined to prove its superiority, a bio-engineered Pokémon called Mewtwo lures Ash, Pikachu and others into a Pokemon match like none before.",
                "popularity": 5.4358,
                "poster_path": "/xPW3AeK3iQi1Zd9dCbdNLijE48o.jpg",
                "release_date": "1998-07-18",
                "title": "Pokémon: The First Movie",
                "video": false,
                "vote_average": 6.935,
                "vote_count": 1515,
                "character": "Sorao (voice)",
                "credit_id": "5452bf44c3a368091a0002bd",
                "order": 14
            },
            {
                "adult": false,
                "backdrop_path": "/wMzToVniA09xWS0DXSRQiufVvpZ.jpg",
                "genre_ids": [
                    28,
                    16,
                    12,
                    35
                ],
                "id": 374205,
                "original_language": "ja",
                "original_title": "ワンピース　フィルム GOLD",
                "overview": "The glittering Gran Tesoro, a city of entertainment beyond the laws of the government, is a sanctuary for the world’s most infamous pirates, Marines, and filthy rich millionaires. Drawn by dreams of hitting the jackpot, Captain Luffy and his crew sail straight for the gold. But behind the gilded curtains lies a powerful king whose deep pockets and deeper ambitions spell disaster for the Straw Hats and the New World alike.",
                "popularity": 3.0728,
                "poster_path": "/9PgiOFTLZXP7emlwcIt0yRasJ9h.jpg",
                "release_date": "2016-07-23",
                "title": "One Piece Film: GOLD",
                "video": false,
                "vote_average": 7.225,
                "vote_count": 507,
                "character": "Sabo (voice)",
                "credit_id": "5a1ba0fe0e0a264cc404aa05",
                "order": 27
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Tohru Furuya",
            "Toru Furuya",
            "Noboru Sogetsu",
            "Tooru Furuya",
            "古谷彻",
            "Tôru Furuya",
            "تورو فورویا"
        ],
        "biography": "Toru Furuya (古谷 徹 Furuya Tōru) is a veteran narrator and seiyū (voice actor) born on July 31, 1953 in Yokohama, Kanagawa Prefecture, Japan. As a child, he was a member of Gekidan Himawari, a children's acting troupe. He is currently employed by the talent management firm Aoni Production.\n\nFuruya is most known for the roles of Amuro Ray (both in the original Mobile Suit Gundam and its following Gundam sequels), Hyouma Hoshi (Kyojin no Hoshi), Pegasus Seiya (Saint Seiya), Yamcha (Dragon Ball Z), Kyosuke Kasuga (Kimagure Orange Road), and Mamoru Chiba/Tuxedo Mask (Sailor Moon). He is also the first and only seiyu who has provided a Japanese voice for Mario.\n\nHe also used a pseudonym Noboru Sōgetsu (蒼月 昇 Sōgetsu Noboru) in the cast of Mobile Suit Gundam 00 for Ribbons Almark's role (but used his real name in the narration role). Both the narration role and Ribbons mark Furuya's first role in a non-Universal Century Gundam series. Shuichi Ikeda who played Char had his earlier with Gilbert Durandal in Gundam SEED Destiny.\n\nHe was a best friend of the late Hirotaka Suzuoki and is noted to be friends with Ikeda. He was at one time married to fellow seiyuu Mami Koyama but amicably divorced in 1983. He later married seiyuu Satomi Majima, who was the other main character of Stop!! Hibari-kun!.\n\nDescription above from the Wikipedia article Tōru Furuya, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1953-07-31",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.torushome.com/",
        "id": 40327,
        "imdb_id": "nm0299228",
        "known_for_department": "Acting",
        "name": "Toru Furuya",
        "place_of_birth": "Yokohama, Kanagawa, Japan",
        "popularity": 0.8304,
        "profile_path": "/2et31Lo8I0gRbyYFaOu3TBRby7U.jpg"
    }
}