{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2ze42e0l0bPYEcJXInUukvNfZKk.jpg",
                "genre_ids": [
                    16,
                    10751,
                    14
                ],
                "id": 10144,
                "original_language": "en",
                "original_title": "The Little Mermaid",
                "overview": "This colorful adventure tells the story of an impetuous mermaid princess named Ariel who falls in love with the very human Prince Eric and puts everything on the line for the chance to be with him. Memorable songs and characters -- including the villainous sea witch Ursula.",
                "popularity": 11.0742,
                "poster_path": "/plcZXvI310FkbwIptvd6rqk63LP.jpg",
                "release_date": "1989-11-17",
                "title": "The Little Mermaid",
                "video": false,
                "vote_average": 7.349,
                "vote_count": 8151,
                "character": "Seahorse (voice)",
                "credit_id": "52fe43359251416c75007863",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/sXfQGa7juaTpZ5IF17Xa6hI53nx.jpg",
                "genre_ids": [
                    10751,
                    16,
                    12
                ],
                "id": 12144,
                "original_language": "en",
                "original_title": "The Land Before Time",
                "overview": "An orphaned brontosaurus named Littlefoot sets off in search of the legendary Great Valley. A land of lush vegetation where the dinosaurs can thrive and live in peace. Along the way he meets four other young dinosaurs, each one a different species, and they encounter several obstacles as they learn to work together in order to survive.",
                "popularity": 3.1002,
                "poster_path": "/7phV1ETZnQrLsEeuk4hNeceEl25.jpg",
                "release_date": "1988-11-18",
                "title": "The Land Before Time",
                "video": false,
                "vote_average": 7.148,
                "vote_count": 2622,
                "character": "Petrie (voice)",
                "credit_id": "52fe44be9251416c7503f61b",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/8x16xGu1p2vqfkSNRhGJNlBz8Fz.jpg",
                "genre_ids": [
                    10751,
                    16
                ],
                "id": 14813,
                "original_language": "en",
                "original_title": "Mickey's Christmas Carol",
                "overview": "Ebenezer Scrooge is far too greedy to understand that Christmas is a time for kindness and generosity. But with the guidance of some new found friends, Scrooge learns to embrace the spirit of the season. A retelling of the classic Dickens tale with Disney's classic characters.",
                "popularity": 6.5544,
                "poster_path": "/6QH10DqZ0feBW2phvrtoLqT1s0k.jpg",
                "release_date": "1983-10-19",
                "title": "Mickey's Christmas Carol",
                "video": false,
                "vote_average": 7.642,
                "vote_count": 949,
                "character": "Collector for the Poor #2 / Ghost of Christmas Present (Willie the Giant) / Ghost of Christmas Future (Pete) / Santa Claus (Big Bad Wolf) / Weasel #2 (voice)",
                "credit_id": "567c248dc3a3684bcc003af0",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Wil Ryan",
            "William Z. Ryan",
            "William Frank Ryan"
        ],
        "biography": "William Frank Ryan (May 21, 1949 – November 19, 2021) was an American voice actor and producer–writer–composer, well-known for singing about the American West. In the late seventies he teamed up with Phil Baron as Willio and Phillio.  They had regular gigs on television, radio and comedy clubs and universities throughout the US. Ryan and Baron later paired up again voicing characters of best friends Teddy Ruxpin (Baron) and Grubby the Octopede (Ryan) in the Teddy Ruxpin book and tape series as well as the 1987 television show The Adventures of Teddy Ruxpin.\n\nThe Willio and Phillio act brought Ryan back into music and after moving to California, he began to write and record songs for Disney. He provided the voice of Rabbit, Tigger, and Eeyore in the Disney Channel's long-running series Welcome to Pooh Corner and in many other Pooh cartoons. He also provided the voice of Barnaby the Dog on the popular series Dumbo's Circus.\n\nSince 1987, Ryan has been a fixture of the radio drama Adventures in Odyssey, playing Eugene Meltsner, Harlow Doyle, David Harley, Patrick O'Ryan and hundreds of one-shot characters.\n\nHe also voiced Rabbit in Winnie the Pooh and a Day for Eeyore after the death of Junius Matthews.\n\nRyan also voiced the character Digit in the 1986 animated film An American Tail.\n\nRyan had also provided the original voice of Petrie in the 1988 animated film The Land Before Time.\n\nHe appears in the film The Wizard of Speed and Time as several different motion picture union representatives.\n\nHe is the current voice of Elmo Aardvark. He can be heard as the character, called Elmo Aardvark: Outer Space Detective and in several Elmo Aardvark CDs.\n\nRyan is the current voice of Willie the Giant. He started voicing the character from Mickey's Christmas Carol.\n\nRyan's youthful involvement in pop music has continued alongside his animation career. Will Ryan compositions have been recorded by artists such as Patti LaBelle, Diane Schuur, Victoria Jackson, The Pointer Sisters and Joanie Sommers (whom he also produced).\n\nWith Andrew J. Lederer and Michael Rosenberg (Jackie Diamond), Ryan performed in the '20s-style music and comedy trio, The Merry Metronomes. He and Lederer also appeared from time to time as a duo, usually under the name The Natty Nabobs.\n\nHis latest musical incarnation is as leader of Los Angeles-based Will Ryan and the Cactus County Cowboys, a cross between the Marx Brothers and The Sons of the Pioneers. His variety show, Will Ryan's Cactus County Round-Up, has been a staple in Southern California since 2008. It regularly plays at several venues, including the Steve Allen Theatre in Hollywood.\n\nRyan continues to do voice work. In 2009 he was working on the third season of Mickey Mouse Clubhouse, the 21st season of Adventures in Odyssey, and the new radio series of Will Ryan's Cactus County Round-Up.\n\nDescription above from the Wikipedia article Will Ryan, licensed under CC-BY-SA, full list of contributors on Wikipedia .",
        "birthday": "1949-05-21",
        "deathday": "2021-11-19",
        "gender": 2,
        "homepage": null,
        "id": 40352,
        "imdb_id": "nm0752900",
        "known_for_department": "Acting",
        "name": "Will Ryan",
        "place_of_birth": "Cleveland, Ohio, USA",
        "popularity": 0.2069,
        "profile_path": "/qRkyGcSju2VmEb7RTBM3Wpa0rvI.jpg"
    }
}