{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kpTTUyVxWMTebmBkaxB2YAX8yyU.jpg",
                "genre_ids": [
                    10752,
                    10749,
                    18
                ],
                "id": 11426,
                "original_language": "en",
                "original_title": "From Here to Eternity",
                "overview": "In 1941 Hawaii, a private is cruelly punished for not boxing on his unit's team, while his captain's wife and second in command are falling in love.",
                "popularity": 1.7186,
                "poster_path": "/25Rm1YJSyhXAEu8abonZvW83aPL.jpg",
                "release_date": "1953-08-28",
                "title": "From Here to Eternity",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 670,
                "character": "Pvt. Friday Clark - Bugler (uncredited)",
                "credit_id": "6579459220ecaf011db65f47",
                "order": 29
            },
            {
                "adult": false,
                "backdrop_path": "/kpTTUyVxWMTebmBkaxB2YAX8yyU.jpg",
                "genre_ids": [
                    10752,
                    10749,
                    18
                ],
                "id": 11426,
                "original_language": "en",
                "original_title": "From Here to Eternity",
                "overview": "In 1941 Hawaii, a private is cruelly punished for not boxing on his unit's team, while his captain's wife and second in command are falling in love.",
                "popularity": 1.7186,
                "poster_path": "/25Rm1YJSyhXAEu8abonZvW83aPL.jpg",
                "release_date": "1953-08-28",
                "title": "From Here to Eternity",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 670,
                "character": "Pvt. Friday Clark (uncredited)",
                "credit_id": "5a892645c3a36862e105f7e7",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Donald Gene Dubbins"
        ],
        "biography": "Don Dubbins (June 28, 1928 - August 17, 1991), originally Donald Dubbins, was an American actor of film and television who in his early career usually played younger military roles, particularly in such classic pictures as From Here to Eternity (1953) and The Caine Mutiny (1954). Screen giant James Cagney took a liking to Dubbins and procured roles for him in two 1956 films, These Wilder Years and Tribute to a Bad Man. In the former, Dubbins played Cagney's long-lost adopted son; in the latter, he was in a romantic triangle with cattle boss Cagney for the affections of a senorita. In 1957, Dubbins played a callow young United States Marines private in Jack Webb's The D.I. In 1958, Dubbins was cast in From the Earth to the Moon, a science fiction picture based on Jules Verne's novel of the same title.\n\nAs Dubbins matured, he appeared in such films as The Prize in 1963, The Illustrated Man (based on a Ray Bradbury novel) in 1969, and Death Wish II in 1982.\n\nDubbins appeared in many television roles, including four episodes each of CBS's Gunsmoke, Perry Mason and Rawhide in Season 1/14 Incident of the Dog Days. In 1960, Dubbins appeared in the episode \"Elegy\" of CBS's The Twilight Zone. That same year he guest starred with Mel Torme in NBC's crime drama Dan Raven starring Skip Homeier. In 1961, he played a deputy who inadvertently killed his outlaw-brother in an episode of Stagecoach West, a Four Star Television series on ABC. He later appeared on the CBS anthology The Lloyd Bridges Show, and with Walter Brennan in ABC's The Guns of Will Sonnett. He appeared in the 1965 pilot episode of I Dream of Jeannie, and returned for one of the series' final episodes (as a different character) in 1970. In 1966, Dubbins appeared with Robert F. Simon as guest stars in the episode \"Long Journey to Leavenworth\" in the NBC series The Road West, starring Barry Sullivan, Andrew Prine, and Glenn Corbett.\n\nDubbins appeared twice on NBC's Little House on the Prairie with Michael Landon and five times on CBS's Barnaby Jones crime drama with Buddy Ebsen. Dubbins appeared in several episodes of Jack Webb's Dragnet 1967 series on NBC. Dubbins played the part of Billy Carter in \"The Incident of the Dog Days\" on Rawhide.\n\nDubbins' last TV roles were in episodes of CBS's Knots Landing (1979), ABC's Dynasty (1981), and NBC's Highway to Heaven (1984).\n\nThe Brooklyn-born Dubbins retired to Greenville, South Carolina, where his last acting was at the Warehouse Theater as Willy Loman in Death of a Salesman. He succumbed to cancer at the age of sixty-three.\n\nDescription above from the Wikipedia article Don Dubbins, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1928-06-28",
        "deathday": "1991-08-17",
        "gender": 2,
        "homepage": null,
        "id": 40380,
        "imdb_id": "nm0239210",
        "known_for_department": "Acting",
        "name": "Don Dubbins",
        "place_of_birth": "Brooklyn, New York City, New York, USA",
        "popularity": 0.2528,
        "profile_path": "/olMTfddbbadkWx6Y6Dlam4VXWiZ.jpg"
    }
}