{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/llVPUs3j9RywSMstGRepSeS8vSL.jpg",
                "genre_ids": [
                    35
                ],
                "id": 6471,
                "original_language": "en",
                "original_title": "The Jerk",
                "overview": "After discovering he's not really black like the rest of his family, likable dimwit Navin Johnson sets off on a hilarious misadventure that takes him from rags to riches and back again. The slaphappy jerk strikes it rich, but life in the fast lane isn't all it's cracked up to be and, in the end, all that really matters to Johnson is his true love.",
                "popularity": 1.9246,
                "poster_path": "/mIjOWtUofyt9Jawge7FbvITjU3D.jpg",
                "release_date": "1979-12-14",
                "title": "The Jerk",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 849,
                "character": "Marie Kimble Johnson",
                "credit_id": "52fe4453c3a36847f808f7b1",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/h6VshReCGaGQoaGZwT2wqiqrcZW.jpg",
                "genre_ids": [
                    16,
                    10751,
                    14,
                    12
                ],
                "id": 9444,
                "original_language": "en",
                "original_title": "Anastasia",
                "overview": "Ten years after she was separated from her family, an eighteen-year-old orphan with vague memories of the past sets out to Paris in hopes of reuniting with her grandmother. She is accompanied by two con men, who intend to pass her off as the Grand Duchess Anastasia to the Dowager Empress for a reward.",
                "popularity": 5.1878,
                "poster_path": "/bppGWGA8zq1sRvTdDJnUzVW9GcH.jpg",
                "release_date": "1997-11-20",
                "title": "Anastasia",
                "video": false,
                "vote_average": 7.605,
                "vote_count": 5439,
                "character": "Sophie (voice)",
                "credit_id": "52fe44f8c3a36847f80b4e2d",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/rKe3MR2u4ZZ0y9uKivzKJRrqBCe.jpg",
                "genre_ids": [
                    18,
                    10402
                ],
                "id": 537116,
                "original_language": "en",
                "original_title": "tick, tick... BOOM!",
                "overview": "On the brink of turning 30, a promising theater composer navigates love, friendship and the pressure to create something great before time runs out.",
                "popularity": 3.6259,
                "poster_path": "/DPmfcuR8fh8ROYXgdjrAjSGA0o.jpg",
                "release_date": "2021-11-11",
                "title": "tick, tick... BOOM!",
                "video": false,
                "vote_average": 7.617,
                "vote_count": 2182,
                "character": "\"Sunday\" Legend #11",
                "credit_id": "619834b8798e06002ab789ec",
                "order": 51
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Bernadette Lazzara",
            "Μπερναντέτ Πίτερς"
        ],
        "biography": "Bernadette Peters (born February 28, 1948) is an American actress, singer, and children's book author. Over a career spanning five decades, she has starred in musical theatre, television and film, performed in solo concerts and released recordings. She is a critically acclaimed Broadway performer, having received seven nominations for Tony Awards, winning two (plus an honorary award), and nine nominations for Drama Desk Awards, winning three. Four of the Broadway cast albums on which she has starred have won Grammy Awards.\n\nRegarded by many as the foremost interpreter of the works of Stephen Sondheim, Peters is particularly noted for her roles on the Broadway stage, including in the musicals Mack and Mabel (1974), Sunday in the Park with George (1984), Song and Dance (1985), Into the Woods (1987), The Goodbye Girl (1993), Annie Get Your Gun (1999), Gypsy (2003), A Little Night Music (2010), Follies (2011), and Hello, Dolly! (2018).\n\nPeters first performed on the stage as a child and then a teenaged actress in the 1960s, and in film and television in the 1970s. She was praised for this early work and for appearances on The Muppet Show, The Carol Burnett Show and in other television work, and for her roles in films including Silent Movie, The Jerk, Pennies from Heaven and Annie. In the 1980s, she returned to the theatre, where she became one of the best-known Broadway stars over the next three decades. She also has recorded six solo albums and several singles, as well as many cast albums, and performs regularly in her own solo concert act. Peters continues to act on stage, in films and on television in such series as Smash and Mozart in the Jungle. She has been nominated for three Emmy Awards and three Golden Globe Awards, winning once.\n\nDescription above from the Wikipedia article Bernadette Peters, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1948-02-28",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.bernadettepeters.com",
        "id": 40389,
        "imdb_id": "nm0001613",
        "known_for_department": "Acting",
        "name": "Bernadette Peters",
        "place_of_birth": "Queens, New York City, New York, USA",
        "popularity": 0.7964,
        "profile_path": "/x2hZ6AsIAfb5t512Q72SYtdNdZf.jpg"
    }
}