{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/me67dwJnUBt3O9NqZaBdEQ6i4vM.jpg",
                "genre_ids": [
                    14,
                    16,
                    10749,
                    10751
                ],
                "id": 10882,
                "original_language": "en",
                "original_title": "Sleeping Beauty",
                "overview": "Cursed to die by the evil fairy Maleficent when she was a baby, Princess Aurora is sent into hiding under protection from three good fairies. As she grows up far away, Maleficent becomes increasingly determined to seal the princess's fate.",
                "popularity": 4.979,
                "poster_path": "/dK4OZwFFxnfK7MvqfVqw94mavL7.jpg",
                "release_date": "1959-02-17",
                "title": "Sleeping Beauty",
                "video": false,
                "vote_average": 6.943,
                "vote_count": 5316,
                "character": "Maleficent’s Goon (voice) (uncredited)",
                "credit_id": "645e332af90b1900e4c79c5d",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Bob Amsberry was born in Boring, Oregon. He worked as a radio disc jockey for KEX in Portland for eight years before getting his chance in television almost by accident. Bob was brought to Hollywood by Walt Disney to write songs for The Mickey Mouse Club (1955). He did so well that when the time came to add another entertainer with Jimmie Dodd and Roy Williams on the Mouseketeers segment of \"The Mickey Mouse Club\", the job was offered to Bob.\n\nIn addition to his acting chores on the show, Bob also handled some special sound effects and donned whiteface and costume to star as Bob-O, the Disneyland clown at Disneyland (interesting bit of trivia: while a student at Franklin High School in Portland, he did musical shows with Johnnie Ray, a classmate who later became a famous singer. The interesting part is that Bob did the singing while Johnnie played the piano). Bob met his wife Beverly at station KEX and they had two children, Kevin and Kelly. Beverly was a blues singer and once won a contest on Ted Mack & the Original Amateur Hour (1948).",
        "birthday": "1928-06-02",
        "deathday": "1957-11-21",
        "gender": 2,
        "homepage": null,
        "id": 4058087,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Bob Amsberry",
        "place_of_birth": "Boring, Oregon, USA",
        "popularity": 0.0297,
        "profile_path": null
    }
}