{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ydF3hT1fjrM71AbNAYBZKnq6rtL.jpg",
                "genre_ids": [
                    10752,
                    18
                ],
                "id": 10015,
                "original_language": "en",
                "original_title": "Heartbreak Ridge",
                "overview": "A hard-nosed, hard-living Marine gunnery sergeant clashes with his superiors and his ex-wife as he takes command of a spoiled recon platoon with a bad attitude.",
                "popularity": 5.1896,
                "poster_path": "/aMr99UigkMCTSPnLTpkzJeLmpyc.jpg",
                "release_date": "1986-12-05",
                "title": "Heartbreak Ridge",
                "video": false,
                "vote_average": 6.887,
                "vote_count": 1057,
                "character": "Little Mary Jackson",
                "credit_id": "52fe43089251416c75000c89",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Eileen Heckart was an American actress of stage, screen, and television.  Born Anna Eileen Herbert, her career spanned nearly 60 years. She first became known for her role as schoolteacher Rosemary Sydney in the original 1953 cast of William Inge's play Picnic on Broadway. She won an Academy Award for Best Supporting Actress for her performance as the overprotective mother of a blind adult son in Butterflies Are Free, a role she originated on Broadway before playing it in the film.\n\nShe often played mothers, including Rocky Graziano's mother in Somebody Up There Likes Me; the mother of a murdered child in The Bad Seed; the elderly mother of an estranged son in the PBS production of the one-act play Save Me a Place at Forest Law; the overbearing mother of the detective portrayed by George Segal in No Way to Treat a Lady; the mother of reporter Jack Stein on the 1990s television sitcom Love & War; the mother of two separate characters on the daytime soap opera One Life to Live in the 1980s and 1990s; and the meddling mother of a jilted wife (played by Diane Keaton) in The First Wives Club, her last film role.  She also had a recurring role on the 1970s sitcom, The Mary Tyler Moore Show, as Mary's Aunt Flo Meredith, a famous woman reporter, which she repeated on the subsequent spin-off series, Lou Grant.\n\nIn addition to her Academy Award, she also won two Emmy Awards for Save Me a Place at Forest Lawn and Love & War, and a Golden Globe Award for The Bad Seed.  She also received a special Tony Award for lifetime achievement in 2000, and has a star on the Hollywood Walk of Fame.  She made her final acting appearance in 2000 at age 80 in an off-Broadway production, The Waverly Gallery, in which she played the leading role of an elderly grandmother with Alzheimer's disease.\n\nDescription above from the Wikipedia article Eileen Heckart, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1919-03-29",
        "deathday": "2001-12-31",
        "gender": 1,
        "homepage": null,
        "id": 40618,
        "imdb_id": "nm0373012",
        "known_for_department": "Acting",
        "name": "Eileen Heckart",
        "place_of_birth": "Columbus, Ohio, U.S.",
        "popularity": 0.2576,
        "profile_path": "/7bXAy2ItipHc72pAwVDj4mercoF.jpg"
    }
}