{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/urDWNffjwmNi5IQaezw9GwqkUXa.jpg",
                "genre_ids": [
                    12,
                    14
                ],
                "id": 767,
                "original_language": "en",
                "original_title": "Harry Potter and the Half-Blood Prince",
                "overview": "As Lord Voldemort tightens his grip on both the Muggle and wizarding worlds, Hogwarts is no longer a safe haven. Harry suspects perils may even lie within the castle, but Dumbledore is more intent upon preparing him for the final battle fast approaching. Together they work to find the key to unlock Voldemorts defenses and to this end, Dumbledore recruits his old friend and colleague Horace Slughorn, whom he believes holds crucial information. Even as the decisive showdown looms, romance blossoms for Harry, Ron, Hermione and their classmates. Love is in the air, but danger lies ahead and Hogwarts may never be the same again.",
                "popularity": 18.4717,
                "poster_path": "/z7uo9zmQdQwU5ZJHFpv2Upl30i1.jpg",
                "release_date": "2009-07-15",
                "title": "Harry Potter and the Half-Blood Prince",
                "video": false,
                "vote_average": 7.683,
                "vote_count": 20120,
                "character": "Mrs Cole",
                "credit_id": "61a36b5f3e2ec80045894b57",
                "order": 44
            },
            {
                "adult": false,
                "backdrop_path": "/sFEYsEfzTx7hhjetlNrme8B5OUo.jpg",
                "genre_ids": [
                    28,
                    53,
                    878
                ],
                "id": 752,
                "original_language": "en",
                "original_title": "V for Vendetta",
                "overview": "In a world in which Great Britain has become a fascist state, a masked vigilante known only as “V” conducts guerrilla warfare against the oppressive British government. When V rescues a young woman from the secret police, he finds in her an ally with whom he can continue his fight to free the people of Britain.",
                "popularity": 8.3222,
                "poster_path": "/1avD1JeaRiJX5M4ahPdZPypGoGN.jpg",
                "release_date": "2006-02-23",
                "title": "V for Vendetta",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 15001,
                "character": "Wardrobe Mistress",
                "credit_id": "56b4de17c3a3680700005083",
                "order": 27
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Amelda Brown is a British actress of stage, film, and television. She trained at the Royal Academy of Dramatic Art, graduating in 1980, and became known for her work in fringe theatre.\n\nShe played leading roles in the premieres of Caryl Churchill's Fen (1983) and A Mouthful of Birds (1986) as well as appearing in leading roles in revivals of Churchill's Light Shining in Buckinghamshire at the Royal National Theatre (1996) and Heart's Desire at the Orange Tree Theatre (2016). Her other stage roles have included Lady Macbeth for the Royal National Theatre's 1989 US tour of Macbeth; Maudlin in A Chaste Maid in Cheapside at Shakespeare's Globe in 1997; and Gibb in the 2014 world premiere of Tim Crouch's Adler and Gibb at the Royal Court theatre.\n\nAmongst her television roles are Brenda Parkin in Backup, Mrs. Roach in Soldier Soldier, Pauline Cook in A Touch of Frost, and Sue Barnes in Peak Practice, and she has also appeared in The Adventures of Sherlock Holmes, Inspector Morse, The Bill, Lovejoy, Holby City, The Story of Tracy Beaker, and Doctors.\n\nIn 2009, she appeared in the film Harry Potter and the Half-Blood Prince as Mrs. Cole. Her other film work includes Fanny in Little Dorrit (1987), and the small roles of Hope in Hope and Glory (1987) and the Visitor in Sister My Sister (1994). (wikipedia)",
        "birthday": "1954-01-01",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 40646,
        "imdb_id": "nm0113007",
        "known_for_department": "Acting",
        "name": "Amelda Brown",
        "place_of_birth": "Bermondsey, London, England, UK",
        "popularity": 0.073,
        "profile_path": "/sjywxuVI3oU7harX6nX6L3wmoVO.jpg"
    }
}