{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sFEYsEfzTx7hhjetlNrme8B5OUo.jpg",
                "genre_ids": [
                    28,
                    53,
                    878
                ],
                "id": 752,
                "original_language": "en",
                "original_title": "V for Vendetta",
                "overview": "In a world in which Great Britain has become a fascist state, a masked vigilante known only as “V” conducts guerrilla warfare against the oppressive British government. When V rescues a young woman from the secret police, he finds in her an ally with whom he can continue his fight to free the people of Britain.",
                "popularity": 8.3222,
                "poster_path": "/1avD1JeaRiJX5M4ahPdZPypGoGN.jpg",
                "release_date": "2006-02-23",
                "title": "V for Vendetta",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 15001,
                "character": "Evey's Father",
                "credit_id": "56b5442a9251414a3a000afe",
                "order": 46
            },
            {
                "adult": false,
                "backdrop_path": "/nVMalJRUsOeGP5xPx9ULmirZ4cJ.jpg",
                "genre_ids": [
                    12,
                    28,
                    80,
                    9648
                ],
                "id": 58574,
                "original_language": "en",
                "original_title": "Sherlock Holmes: A Game of Shadows",
                "overview": "There is a new criminal mastermind at large (Professor Moriarty) and not only is he Holmes’ intellectual equal, but his capacity for evil and lack of conscience may give him an advantage over the  detective.",
                "popularity": 6.3216,
                "poster_path": "/y1MYZkwhZK6L0Jy4YMuPktzDOfn.jpg",
                "release_date": "2011-11-22",
                "title": "Sherlock Holmes: A Game of Shadows",
                "video": false,
                "vote_average": 7.142,
                "vote_count": 10607,
                "character": "Ballroom Photographer",
                "credit_id": "58874ca1c3a368440500170b",
                "order": 42
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Carsten is an actor and producer who graduated from The Oxford School of Drama in 2000, upon which he made his professional acting debut in a West End production of Noel Coward's \"Semi Monde\".\n\nHe was raised bilingually by his British mother and German father, and during his youth they moved quite often. As a result, Carsten grew up experiencing a diverse range of countries such as Nigeria, Australia, Saudi Arabia, Scotland, India and Egypt to name a few. Quite often TV and cinema weren't readily available, and so school plays became a treasured experience. Notwithstanding his first role, where as a 6yr old he played a flying monkey in \"The Wizard of Oz\" complete with itchy woolen onesie in the Arabian heat, he relished each opportunity to act thereafter.\n\nThe decision to pursue acting professionally originated as a fateful coincidence years later. Whilst at the University of St. Andrews, looking for a lecture, he stumbled into the casting for a student production for \"One Flew Over the Cuckoo's Nest\". He was encouraged to try out, got the part and his old passion was rekindled. Two plays and a few months later he applied to drama school, and thus began his professional career.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.crawfordtalents.com/carstenhayes",
        "id": 40664,
        "imdb_id": "nm1544254",
        "known_for_department": "Acting",
        "name": "Carsten Hayes",
        "place_of_birth": null,
        "popularity": 0.0362,
        "profile_path": "/kG4meEFGEBxzaBmEu4NmocGN78d.jpg"
    }
}