{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sFEYsEfzTx7hhjetlNrme8B5OUo.jpg",
                "genre_ids": [
                    28,
                    53,
                    878
                ],
                "id": 752,
                "original_language": "en",
                "original_title": "V for Vendetta",
                "overview": "In a world in which Great Britain has become a fascist state, a masked vigilante known only as “V” conducts guerrilla warfare against the oppressive British government. When V rescues a young woman from the secret police, he finds in her an ally with whom he can continue his fight to free the people of Britain.",
                "popularity": 8.3222,
                "poster_path": "/1avD1JeaRiJX5M4ahPdZPypGoGN.jpg",
                "release_date": "2006-02-23",
                "title": "V for Vendetta",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 15001,
                "character": "Ruth",
                "credit_id": "56b5459892514114e50064df",
                "order": 57
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "메리 스탁클리"
        ],
        "biography": "Mary Stockley is a British stage, television and film actress.\n\nA former member of the National Youth Music Theatre, Stockley studied drama at university. She made her first television appearance in 2001 in the TV film Being Dom Joly, in 2002, going on to play Kate Matherson in thirty episodes of Family Affairs on Five. Stockley played Josie Turner in The Body in the Library- Agatha Christie's Marple (2004), Gina Way in Jericho (2005), Edie Covington in The Inspector Lynley Mysteries (2006), Mrs. Clay in Persuasion (2007), Tess in Britz (2007), Miss Jay in Ballet Shoes (2007), and Eve Carpenter in Mrs. McGinty's Dead- Agatha Christie's Poirot (2008).\n\nHer film appearances include Ruth Ellis in Pierrepoint (2005), Ruth in V for Vendetta (2006), Kate in Artifacts (2007), Michelle in 7 Lives (2011), Mrs. Fisher in The Woman in Black (2012), Ana in I Spit on Your Grave 2 (2013), and Assistant in Diana (2013).She also voices characters in Star Wars: The Old Republic.\n\nStockley's theatre credits include Oliver!; Merrily We Roll Along (2000) at the Donmar Warehouse; Hope Harcourt in the musical Anything Goes (2002) and Katherine in Love's Labour's Lost (2003), both the latter at the Royal National Theatre. In 2008, she played Marigold in The Common Pursuit at the Menier Chocolate Factory. She played Judy in the National Theatre's production of The Curious Incident of the Dog in the Night-Time.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "https://roxanevacca.co.uk/clients/stockley/",
        "id": 40672,
        "imdb_id": "nm1128766",
        "known_for_department": "Acting",
        "name": "Mary Stockley",
        "place_of_birth": null,
        "popularity": 0.2732,
        "profile_path": "/dpdFhBJcw41P5XSoGqp9ElPJHKO.jpg"
    }
}