{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6S4gjpkd359UuMLfrnUV1M695DF.jpg",
                "genre_ids": [
                    37,
                    18
                ],
                "id": 288,
                "original_language": "en",
                "original_title": "High Noon",
                "overview": "Will Kane, the sheriff of a small town in New Mexico, learns a notorious outlaw he put in jail has been freed, and will be arriving on the noon train. Knowing the outlaw and his gang are coming to kill him, Kane is determined to stand his ground, so he attempts to gather a posse from among the local townspeople.",
                "popularity": 4.4293,
                "poster_path": "/qETSMQ4IXBSAS409Z9OL0ppXWTW.jpg",
                "release_date": "1952-06-09",
                "title": "High Noon",
                "video": false,
                "vote_average": 7.666,
                "vote_count": 1502,
                "character": "Helen Ramírez",
                "credit_id": "52fe4232c3a36847f800b773",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "María Cristina Estela Marcela Jurado García",
            "Katty Jurado",
            "کتی هورادو"
        ],
        "biography": "Katy Jurado (16 January 1924 – 5 July 2002), born María Cristina Estela Marcela Jurado García, was a Mexican stage and screen actress.\n\nJurado had already established herself as an actress in Mexico in the 1940s when she came to Hollywood becoming a regular in Western films of the 1950s and 1960s. She worked with many Hollywood legends, including Gary Cooper in High Noon, Spencer Tracy in Broken Lance, and Marlon Brando in One-Eyed Jacks, and such respected directors as Fred Zinneman (High Noon), Sam Peckinpah (The Wild Bunch and Pat Garrett and Billy the Kid) and John Huston (Under the Volcano).\n\nJurado made seventy one films during her career. She became the first Latina/Hispanic actress nominated for an Academy Award when she was nominated as Best Supporting Actress for her work in 1954's \"Broken Lance\" and was the first to win a Golden Globe. Like many Latin actors, she was typecast to play ethnic roles in American films. By contrast, she had a greater variety of roles in Mexican films; sometimes she also sang and danced.",
        "birthday": "1924-01-16",
        "deathday": "2002-07-05",
        "gender": 1,
        "homepage": null,
        "id": 4069,
        "imdb_id": "nm0432827",
        "known_for_department": "Acting",
        "name": "Katy Jurado",
        "place_of_birth": " Guadalajara, Jalisco, Mexico",
        "popularity": 0.9796,
        "profile_path": "/zm9x2v0CvL3qCSLPgkE7TcuDkg2.jpg"
    }
}