{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2L8U8rUyWeFTb6n1egTNeJsEsvj.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749
                ],
                "id": 284,
                "original_language": "en",
                "original_title": "The Apartment",
                "overview": "Bud Baxter is a minor clerk in a huge New York insurance company, until he discovers a quick way to climb the corporate ladder. He lends out his apartment to the executives as a place to take their mistresses. Although he often has to deal with the aftermath of their visits, one night he's left with a major problem to solve.",
                "popularity": 4.4619,
                "poster_path": "/2nt8Z54Bce74ycithkzlSNkgXJB.jpg",
                "release_date": "1960-06-21",
                "title": "The Apartment",
                "video": false,
                "vote_average": 8.2,
                "vote_count": 2472,
                "character": "Jeff D. Sheldrake",
                "credit_id": "52fe4232c3a36847f800b41f",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/byQdu1nzQLI9t1VeoP1xuQfru3L.jpg",
                "genre_ids": [
                    80,
                    53
                ],
                "id": 996,
                "original_language": "en",
                "original_title": "Double Indemnity",
                "overview": "A seductive housewife draws an insurance salesman into a plot of adultery and crime to collect on her husband's life insurance.",
                "popularity": 3.5639,
                "poster_path": "/rVNYZZgfhwqVMMWlBmxOfWqnwCj.jpg",
                "release_date": "1944-07-06",
                "title": "Double Indemnity",
                "video": false,
                "vote_average": 8.106,
                "vote_count": 1902,
                "character": "Walter Neff",
                "credit_id": "52fe4298c3a36847f802adc5",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Fred Mac Murray",
            "Frederick Martin MacMurray",
            "Fredrick Martin \"Fred\" MacMurray"
        ],
        "biography": "Fred MacMurray (August 30, 1908 – November 5, 1991) was an American actor and musician. He was educated at Carroll College, Wisconsin, and played with a Chicago orchestra for more than a year. Then he joined an orchestra in Hollywood where he played, did some recording and played extra roles. He then joined a comedy stage band, California Collegians, and went to New York. There he joined \"Three's A Crowd\" revue on Broadway and on the road. After this show closed, he returned to California and worked in vaudeville. He played the vaudeville circuits and night clubs until cast for major role in \"Roberta\". Signed by Paramount in 1935.\n\nMacMurray was raised in Beaver Dam, Wisconsin from the age of 5, eventually graduating from Beaver Dam High School (currently the site of Beaver Dam Middle School), where he was a 3-sport star in football, baseball, and basketball. Fred retained a special place in his heart for his small-town Wisconsin upbringing, referring at any opportunity in magazine articles or interviews to the lifelong friends and cherished memories of Beaver Dam, even including mementos of his childhood in several of his films. In \"Pardon my Past\" (1945), Fred and fellow GI William Demarest are moving to Beaver Dam, WI to start a mink farm.",
        "birthday": "1908-08-30",
        "deathday": "1991-11-05",
        "gender": 2,
        "homepage": null,
        "id": 4091,
        "imdb_id": "nm0534045",
        "known_for_department": "Acting",
        "name": "Fred MacMurray",
        "place_of_birth": "Kankakee, Illinois, USA",
        "popularity": 0.411,
        "profile_path": "/lxxixlFMNH0JuA9K0K3mJmigYcc.jpg"
    }
}