{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lPsKI7VR1FJY3w8iEOBZEhWAESc.jpg",
                "genre_ids": [
                    99,
                    10751
                ],
                "id": 1667,
                "original_language": "fr",
                "original_title": "La Marche de l'empereur",
                "overview": "Every year, thousands of Antarctica's emperor penguins make an astonishing journey to breed their young. They walk, marching day and night in single file 70 miles into the darkest, driest and coldest continent on Earth.  This amazing, true-life tale is touched with humour and alive with thrills. Breathtaking photography captures the transcendent beauty and staggering drama of devoted parent penguins who, in the fierce polar winter, take turns guarding their egg and trekking to the ocean in search of food. Predators hunt them, storms lash them. But the safety of their adorable chicks makes it all worthwhile. So follow the leader... to adventure!!",
                "popularity": 1.4593,
                "poster_path": "/o9xJ1xG1WKlHkl8ACqq0LShOuMu.jpg",
                "release_date": "2005-01-26",
                "title": "March of the Penguins",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 1163,
                "character": "Mother Penguin (voice)",
                "credit_id": "52fe430ac3a36847f8035fe5",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Роман Боринже"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nRomane Bohringer (born 14 August 1973 in Pont-Sainte-Maxence, Oise, France) is a French actress, film director, screenwriter and costume designer. She is the daughter of Richard Bohringer and sister of Lou Bohringer. Her parents named her after Roman Polanski.\n\nShe won the César Award for Most Promising Actress for her role in Savage Nights.\n\nDescription above from the Wikipedia article Romane Bohringer, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1973-08-14",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 40938,
        "imdb_id": "nm0001960",
        "known_for_department": "Acting",
        "name": "Romane Bohringer",
        "place_of_birth": "Pont-Sainte-Maxence, Oise, France",
        "popularity": 0.4242,
        "profile_path": "/keVDM0uUbKmo0yOVNrjMuKiH1B2.jpg"
    }
}