{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/oz4U9eA6ilYf1tyiVuGmkftdLac.jpg",
                "genre_ids": [
                    10749,
                    18
                ],
                "id": 1010581,
                "original_language": "es",
                "original_title": "Culpa mía",
                "overview": "Noah must leave her city, boyfriend, and friends to move into William Leister's mansion, the flashy and wealthy husband of her mother Rafaela. As a proud and independent 17 year old, Noah resists living in a mansion surrounded by luxury. However, it is there where she meets Nick, her new stepbrother, and the clash of their strong personalities becomes evident from the very beginning.",
                "popularity": 52.6456,
                "poster_path": "/w46Vw536HwNnEzOa7J24YH9DPRS.jpg",
                "release_date": "2023-06-08",
                "title": "My Fault",
                "video": false,
                "vote_average": 7.782,
                "vote_count": 3797,
                "character": "Mikel",
                "credit_id": "6484754ee375c000acc53ff9",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Antonio Hernández Fimia (Madrid, Spain, 09/30/1997) is an actor and poet with a degree in Acting from the Real Escuela Superior de Arte Dramático. Currently, he is a member of the Compañía Nacional de Teatro Clásico (CNTC). He has participated in various theater productions, including notable works such as “La discreta enamorada” by Lope de Vega, directed by Lluis Homar, “El monstruo de los jardines” by Calderón de la Barca, directed by Iñaki Rikarte, “Todas hieren y una mata” by Álvaro Tato and “Mestiza” by Julieta Soria, among others. He has also appeared in television series such as “+ de 100 mentiras” and “Cuéntame”, and films such as “Casa de fieras”, “Código 10.36” and “Culpa mía”. Trained in fencing, karate, and acrobatics, he works as a specialist and choreographer in action scenes for both theater and audiovisual productions. He has contributed to the anthology “Puro teatro: homenaje a un oficio” (Daniel Migueláñez ed.), which brings together various professionals in the theatrical field. His first poetry book, “Del Purgatorio”, was published by Valparaíso Ediciones. He has written, directed, and starred in his first theatrical monologue, “Poética del Naufragio”. He is the founder and director of Ayer, a weekly poetry recital in Madrid, which eventually gave its name to his audiovisual production company: Ayer Producciones. He combines cultural promotion on social media with his work as an actor and visual artist (theater posters, video art, illustrations, etc.). In 2021, he debuted as an audiovisual producer with “Ayer: especial fin de año”, an arts event he directed and hosted, inviting numerous representatives of contemporary theater and poetry. In December 2022, he directed and produced a second edition of the event. In 2023, he produced the miniseries Rapport. “Upon the Sky” is his first film as a director.",
        "birthday": "1997-09-30",
        "deathday": null,
        "gender": 2,
        "homepage": "https://distributionwithglasses.com/antonio-hernandez-fimia/#:~:text=Antonio%20Hern%C3%A1ndez%20Fimia%20(Madrid%2C%20Espa%C3%B1a,de%20Teatro%20Cl%C3%A1sico%20(CNTC).",
        "id": 4105611,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Antonio Hernández Fimia",
        "place_of_birth": "Madrid, Madrid, Spain",
        "popularity": 0.0615,
        "profile_path": "/u2jjeMbQthFMVPH6ozbPWiGsAph.jpg"
    }
}