{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/87wqeMeUeMRLjsE1IWNKJcPlpuC.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 289,
                "original_language": "en",
                "original_title": "Casablanca",
                "overview": "In Casablanca, Morocco in December 1941, a cynical American expatriate meets a former lover, with unforeseen complications.",
                "popularity": 5.0551,
                "poster_path": "/oyGRZVIthHJjc98ekKpeWpDh8Ws.jpg",
                "release_date": "1943-01-15",
                "title": "Casablanca",
                "video": false,
                "vote_average": 8.155,
                "vote_count": 5717,
                "character": "Ilsa Lund",
                "credit_id": "52fe4233c3a36847f800b843",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/40Rl5nZRxXQ4kHV4Lhghj5iQZZN.jpg",
                "genre_ids": [
                    53,
                    10749,
                    9648
                ],
                "id": 303,
                "original_language": "en",
                "original_title": "Notorious",
                "overview": "In order to help bring Nazis to justice, U.S. government agent T.R. Devlin recruits Alicia Huberman, the American daughter of a convicted German war criminal, as a spy. As they begin to fall for one another, Alicia is instructed to win the affections of Alexander Sebastian, a Nazi hiding out in Brazil. When Sebastian becomes serious about his relationship with Alicia, the stakes get higher, and Devlin must watch her slip further undercover.",
                "popularity": 4.3144,
                "poster_path": "/4RERYb1NIQrJHYY5e8nUlYM7t2z.jpg",
                "release_date": "1946-08-21",
                "title": "Notorious",
                "video": false,
                "vote_average": 7.742,
                "vote_count": 1664,
                "character": "Alicia Huberman",
                "credit_id": "52fe4235c3a36847f800c215",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/dYv4io2HcRMxFGgnErTbvpqSGXe.jpg",
                "genre_ids": [
                    53,
                    9648,
                    10749
                ],
                "id": 4174,
                "original_language": "en",
                "original_title": "Spellbound",
                "overview": "When Dr. Anthony Edwardes arrives at a Vermont mental hospital to replace the outgoing hospital director, Dr. Constance Peterson, a psychoanalyst, discovers Edwardes is actually an impostor. The man confesses that the real Dr. Edwardes is dead and fears he may have killed him, but cannot recall anything. Dr. Peterson, however is convinced his impostor is innocent of the man's murder, and joins him on a quest to unravel his amnesia through psychoanalysis.",
                "popularity": 4.0951,
                "poster_path": "/dPAox7jGScLBvxKLeRptJIBF7v.jpg",
                "release_date": "1945-11-08",
                "title": "Spellbound",
                "video": false,
                "vote_average": 7.419,
                "vote_count": 924,
                "character": "Dr. Constance Petersen",
                "credit_id": "52fe43b0c3a36847f8067e77",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/tAXK5R0ytrN2l2qgGfyxums5J0w.jpg",
                "genre_ids": [
                    18,
                    53,
                    9648
                ],
                "id": 4176,
                "original_language": "en",
                "original_title": "Murder on the Orient Express",
                "overview": "In 1935, when his train is stopped by deep snow, detective Hercule Poirot is called on to solve a murder that occurred in his car the night before.",
                "popularity": 4.0508,
                "poster_path": "/oJjKcuoH7SuiqZaEpHt2Nd5ZxNY.jpg",
                "release_date": "1974-11-22",
                "title": "Murder on the Orient Express",
                "video": false,
                "vote_average": 7.148,
                "vote_count": 1495,
                "character": "Greta Ohlson",
                "credit_id": "52fe43b0c3a36847f8067f6b",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/3DOOgeZfoYUKXAyYrpRObv2PNDd.jpg",
                "genre_ids": [
                    18
                ],
                "id": 12761,
                "original_language": "sv",
                "original_title": "Höstsonaten",
                "overview": "After a seven-year absence, Charlotte Andergast travels to Sweden to reunite with her daughter Eva. The pair have a troubled relationship: Charlotte sacrificed the responsibilities of motherhood for a career as a classical pianist. Over an emotional night, the pair reopen the wounds of the past. Charlotte gets another shock when she finds out that her mentally impaired daughter, Helena, is out of the asylum and living with Eva.",
                "popularity": 3.4035,
                "poster_path": "/6beNbtCXv3GkzHkxkGYf38ib7v8.jpg",
                "release_date": "1978-10-08",
                "title": "Autumn Sonata",
                "video": false,
                "vote_average": 7.973,
                "vote_count": 648,
                "character": "Charlotte",
                "credit_id": "52fe451d9251416c7504c375",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/k8sH3RyFg1G4fHN0k9QNoHk8i4E.jpg",
                "genre_ids": [
                    53,
                    18,
                    9648,
                    80
                ],
                "id": 13528,
                "original_language": "en",
                "original_title": "Gaslight",
                "overview": "A newlywed fears she's going mad when strange things start happening at the family mansion.",
                "popularity": 3.4134,
                "poster_path": "/gXKszCl5Q1KrgWRWpPcqn94CP58.jpg",
                "release_date": "1944-05-04",
                "title": "Gaslight",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 515,
                "character": "Paula Alquist",
                "credit_id": "52fe45769251416c7505764f",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "잉그리드 버그먼",
            "잉그리드 베리만",
            "잉그리드 베르히만",
            "잉그리드 베리히만",
            "Інгрід Бергман"
        ],
        "biography": "Ingrid Bergman was a Swedish actress who starred in a variety of European and American films, television movies, and plays. With a career spanning five decades, she is often regarded as one of the most influential screen figures in cinematic history.\n\nAccording to the St. James Encyclopedia of Popular Culture, upon her arrival in the U.S. Bergman quickly became \"the ideal of American womanhood\" and a contender for Hollywood's greatest leading actress. David O. Selznick once called her \"the most completely conscientious actress\" he had ever worked with. In 1999, the American Film Institute recognised Bergman as the fourth greatest female screen legend of Classic Hollywood Cinema.\n\nShe won numerous accolades, including three Academy Awards, two Primetime Emmy Awards, a Tony Award, four Golden Globe Awards, BAFTA Award and a Volpi Cup. She is one of only four actresses to have received at least three acting Academy Awards (only Katharine Hepburn has four).\n\nBorn in Stockholm to a Swedish father and a German mother, Bergman began her acting career in Swedish and German films. Her introduction to the U.S. audience came in the English-language remake of Intermezzo (1939). Known for her naturally luminous beauty, she starred in Casablanca (1942) as Ilsa Lund, her most famous role, opposite Humphrey Bogart. Bergman's notable performances in the 1940s include the dramas For Whom the Bell Tolls (1943), Gaslight (1944), The Bells of St. Mary's (1945), and Joan of Arc (1948), all of which earned her nominations for the Academy Award for Best Actress; she won for Gaslight. She made three films with Alfred Hitchcock: Spellbound (1945), with Gregory Peck, Notorious (1946), opposite Cary Grant and Under Capricorn (1949), alongside Joseph Cotten.\n\nIn 1950, she starred in Roberto Rossellini's Stromboli, released after the revelation she was having an affair with Rossellini; that and her pregnancy prior to their marriage created a scandal in the U.S. that prompted her to remain in Europe for several years. During this time she starred in Rossellini's Europa '51 and Journey to Italy (1954), now critically acclaimed, the former of which won her the Volpi Cup for Best Actress. She had a successful return to working for a Hollywood studio in Anastasia (1956), winning her second Academy Award for Best Actress. Soon after, she co-starred with Grant in the romance Indiscreet (1958). In 1969, she starred in the acclaimed and highly successful film Cactus Flower. In later years, Bergman won her third Academy Award, this one for Best Supporting Actress, for her role in Murder on the Orient Express (1974). In 1978, she starred in Ingmar Bergman's (no relation) Swedish Autumn Sonata receiving her sixth Best Actress nomination. Bergman spoke five languages – Swedish, English, German, Italian and French – and acted in each.\n\nIn her final role, she portrayed the late Israeli Prime Minister Golda Meir in the television miniseries A Woman Called Golda (1982) for which she posthumously won her second Emmy Award for Best Actress. In 1974, Bergman discovered she was suffering from breast cancer but continued to work until shortly before her death on her sixty-seventh birthday.",
        "birthday": "1915-08-29",
        "deathday": "1982-08-29",
        "gender": 1,
        "homepage": "https://www.ingridbergman.com",
        "id": 4111,
        "imdb_id": "nm0000006",
        "known_for_department": "Acting",
        "name": "Ingrid Bergman",
        "place_of_birth": "Stockholm, Sweden",
        "popularity": 0.5262,
        "profile_path": "/9LdhzK5CVkLZjRdQ08V9C0Oiu9I.jpg"
    }
}