{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/87wqeMeUeMRLjsE1IWNKJcPlpuC.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 289,
                "original_language": "en",
                "original_title": "Casablanca",
                "overview": "In Casablanca, Morocco in December 1941, a cynical American expatriate meets a former lover, with unforeseen complications.",
                "popularity": 5.0551,
                "poster_path": "/oyGRZVIthHJjc98ekKpeWpDh8Ws.jpg",
                "release_date": "1943-01-15",
                "title": "Casablanca",
                "video": false,
                "vote_average": 8.155,
                "vote_count": 5717,
                "character": "Sascha",
                "credit_id": "52fe4233c3a36847f800b86b",
                "order": 12
            },
            {
                "adult": false,
                "backdrop_path": "/nVpp3ZcIFtJJ3fJp65eJczehIN8.jpg",
                "genre_ids": [
                    35,
                    10752
                ],
                "id": 3063,
                "original_language": "en",
                "original_title": "Duck Soup",
                "overview": "Rufus T. Firefly is named president/dictator of bankrupt Freedonia and declares war on neighboring Sylvania over the love of wealthy Mrs. Teasdale.",
                "popularity": 2.4872,
                "poster_path": "/31t63plEGKHhYuuCpC9bFWO9SBS.jpg",
                "release_date": "1933-11-12",
                "title": "Duck Soup",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 816,
                "character": "Sylvanian Agitator",
                "credit_id": "52fe4381c3a36847f8059451",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Leonid Kinsky"
        ],
        "biography": "Leonid Kinskey (April 18, 1903 – September 8, 1998) was a Russian-born movie and television actor who enjoyed a long career. Kinskey is best known for his role as Sascha in the film Casablanca (1942).\n\nKinskey was born in St. Petersburg, Russia. He fled the Russian Revolution and acted on stage in Europe and South America before arriving in New York City in 1921. He joined the road production of Al Jolson's musical Wonder Bar, before making his first film appearance, in the 1932 Trouble in Paradise. His looks and accent helped him land supporting roles in numerous movies, including Duck Soup and Nothing Sacred, and on television, well into the 1960s. It is said that he got perhaps his best-known role, Sascha in Casablanca, because he was a drinking buddy of star Humphrey Bogart. Kinskey was in the pilot episode for Hogan's Heroes, but turned down a regular role in the series because he thought the subject matter was being taken too lightly.\n\nKinskey was married three times. His second wife was actress Iphigenie Castiglioni, to whom he remained married until her death in 1963. He was married to Tina York from 1983 to his death. He died of complications of a stroke in Fountain Hills, Arizona, at the age of 95.\n\nDescription above from the Wikipedia article Leonid Kinskey, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1903-04-18",
        "deathday": "1998-09-08",
        "gender": 2,
        "homepage": null,
        "id": 4120,
        "imdb_id": "nm0455893",
        "known_for_department": "Acting",
        "name": "Leonid Kinskey",
        "place_of_birth": "Saint Petersburg, Russia",
        "popularity": 0.3737,
        "profile_path": "/e5WkDoFos1oolme2fbKNa6wgGqe.jpg"
    }
}