{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/87wqeMeUeMRLjsE1IWNKJcPlpuC.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 289,
                "original_language": "en",
                "original_title": "Casablanca",
                "overview": "In Casablanca, Morocco in December 1941, a cynical American expatriate meets a former lover, with unforeseen complications.",
                "popularity": 5.0551,
                "poster_path": "/oyGRZVIthHJjc98ekKpeWpDh8Ws.jpg",
                "release_date": "1943-01-15",
                "title": "Casablanca",
                "video": false,
                "vote_average": 8.155,
                "vote_count": 5717,
                "character": "Jan Brandel (uncredited)",
                "credit_id": "52fe4233c3a36847f800b877",
                "order": 35
            },
            {
                "adult": false,
                "backdrop_path": "/28vvMlh490bxipmhkbYTQissiof.jpg",
                "genre_ids": [
                    35,
                    10752,
                    10749
                ],
                "id": 198,
                "original_language": "en",
                "original_title": "To Be or Not to Be",
                "overview": "During the Nazi occupation of Poland, an acting troupe becomes embroiled in a Polish soldier's efforts to track down a German spy.",
                "popularity": 2.842,
                "poster_path": "/dDQRpEoyjHT4fzw9cNklIvZuXYg.jpg",
                "release_date": "1942-03-06",
                "title": "To Be or Not to Be",
                "video": false,
                "vote_average": 7.828,
                "vote_count": 779,
                "character": "Co-Pilot (uncredited)",
                "credit_id": "619461e3bb10570043cf4be4",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Helmut Guttmann"
        ],
        "biography": "Helmut Dantine was an Austrian-American actor who often played Nazis in thriller films of the 1940s. His best-known performances are perhaps the German pilot in Mrs. Miniver, and the desperate refugee in Casablanca, who tries gambling to obtain travel visa money for himself and his wife. As his acting career waned, he turned to producing.\n\nDantine enrolled at the University of California, Los Angeles. His relatives thought he would go into business, but he became interested in theater. He began his U.S. acting career at the Pasadena Playhouse, while running two gas stations in order to pay his expenses. Dantine was spotted by a talent scout from Warner Bros, who signed him to a contract.\n\nDantine had uncredited parts in International Squadron and To Be or Not to Be, before his first credited role in MGM's Mrs. Miniver, playing a downed German pilot captured by the title character (played by Greer Garson). It was a huge hit, and Dantine received much positive attention from being in the film. In August 1942, Warners signed him to a new acting contract. The studio kept him busy with roles in the World War II films, The Pied Piper, Desperate Journey fighting Errol Flynn, and The Navy Comes Through. He had a sympathetic role in Casablanca, as a young refugee trying and failing to earn money via gambling. Warners begin to give Dantine more sizeable roles in their \"A\" films, Watch on the Rhine, Edge of Darkness, playing a Nazi officer, again fighting Errol Flynn, and Mission to Moscow, playing a sympathetic Russian.\n\nDantine's good looks caused him to receive a lot of fan mail and, in the words of one profile, \"the studio began to realize it had something else besides a Hollywood Hitlerite on its hands\".  Warners announced they had bought Night Action by Norman Krasna as a vehicle for Dantine, but the film appears not to have been made. Instead, he had a large role playing the villain in Northern Pursuit (1943), as a Nazi running loose in northern Canada fighting Errol Flynn again.\n\nWarner Bros. later cast him in a sympathetic role in Passage to Marseille, and he was one of several stars in Hollywood Canteen. In 1944, exhibitors voting for \"Stars of Tomorrow\", picked Dantine at number 10. Warners gave him a sympathetic lead in Hotel Berlin, as the leader of the German underground. He was once again a Nazi on-the-run in Escape in the Desert, a remake of The Petrified Forest. His last role for Warners was in the film noir, Shadow of a Woman. He then left the studio.\n\nAs his acting career wound down, he became a vice-president of Hollywood mogul Joseph Schenck's company, Schenck Enterprises, in 1959; Schenck was his wife's uncle. He later went to work as producer with Robert L. Lippert Productions and then as president of Hand Enterprises Inc.\n\nAmong Dantine's later screen appearances, there were three films for which he was the executive producer: Bring Me the Head of Alfredo Garcia and The Killer Elite, both directed by Sam Peckinpah, and The Wilby Conspiracy. He was also in The Fifth Musketeer and Tarzan the Apeman.\n\nOn 2 May 1982, Helmut Dantine died in Beverly Hills from a heart attack at age 63. According to one obituary, \"He specialized in portrayals of Nazis, sometimes as the handsome but icy SS sadist battling Allied heroes, sometimes as a sympathetic German soldier forced, against his better judgment, to fight\".",
        "birthday": "1918-10-07",
        "deathday": "1982-05-02",
        "gender": 2,
        "homepage": null,
        "id": 4122,
        "imdb_id": "nm0200626",
        "known_for_department": "Acting",
        "name": "Helmut Dantine",
        "place_of_birth": "Vienna, Austria-Hungary [now Austria]",
        "popularity": 0.1545,
        "profile_path": "/AcKhHPzV6lCTamh1S2tFr8fgo6V.jpg"
    }
}