{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jQAGYwpp00D9PN7qKIPb4HqNzoq.jpg",
                "genre_ids": [
                    12,
                    14,
                    35,
                    10751,
                    10402,
                    16
                ],
                "id": 12335,
                "original_language": "en",
                "original_title": "Bedknobs and Broomsticks",
                "overview": "Three children evacuated from London during World War II are forced to stay with an eccentric spinster. The children's initial fears disappear when they find out she is in fact a trainee witch.",
                "popularity": 3.6655,
                "poster_path": "/1BBzsThIZ06UmjZ3rChYGZhJtFQ.jpg",
                "release_date": "1971-10-07",
                "title": "Bedknobs and Broomsticks",
                "video": false,
                "vote_average": 7.029,
                "vote_count": 993,
                "character": "Col. Heller",
                "credit_id": "52fe44dc9251416c750436a7",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Joachim Alexander Ottokar Meibes",
            "John Erickson"
        ],
        "biography": "John Ericson (sometimes Erickson; born Joachim Alexander Ottokar Meibes; September 25, 1926 - May 3, 2020) was a German-American actor and film and television star. He trained at the American Academy of Dramatic Arts in New York, played the lead role in Stalag 17 by Donald Bevan and Edmund Trzcinski on Broadway (1951). He went on to make a number of films for MGM in quick succession in the 1950s. His first appearance was in Teresa (1951), directed by Fred Zinnemann, which also launched the film careers of Pier Angeli and Rod Steiger. He then went on to appear in a series of films which included Rhapsody, The Student Prince, Green Fire (all in 1954), and Bad Day at Black Rock (1955).\n\nHis career continued, mostly on television, for the next thirty years. He appeared in the lead role in \"The Peter Bartley Story\" of CBS's fantasy drama, The Millionaire. Child actor Johnny Washbrook appeared in the same episode in a flashback segment of Ericson as a boy. He appeared with Dorothy Malone in the January 1, 1956, episode entitled \"Mutiny\" of CBS's Appointment with Adventure. He guest-starred in 1958 in the NBC western series The Restless Gun, starring John Payne. He also guest-starred in the 1961 ABC crime drama, Target: The Corruptors! In 1965-1966, he co-starred with Anne Francis in the detective series Honey West. He occasionally appeared in such films as Pretty Boy Floyd (1960), 7 Faces of Dr. Lao (1964), and Bedknobs and Broomsticks (1971).\n\nHe was married twice and had two children from his first marriage to Milly Coury.\n\nDescription above from the Wikipedia article John Ericson, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1926-09-23",
        "deathday": "2020-05-03",
        "gender": 2,
        "homepage": null,
        "id": 41231,
        "imdb_id": "nm0259152",
        "known_for_department": "Acting",
        "name": "John Ericson",
        "place_of_birth": "Düsseldorf, Germany",
        "popularity": 0.4393,
        "profile_path": "/383uBWGjEchVGvYaQfLg6DdUZoL.jpg"
    }
}