{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2aGtsMLVOiBiAUwQmCqYgau5AJF.jpg",
                "genre_ids": [
                    27,
                    35
                ],
                "id": 10779,
                "original_language": "en",
                "original_title": "The Frighteners",
                "overview": "Once an architect, Frank Bannister now passes himself off as an exorcist of evil spirits. To bolster his facade, he claims his \"special\" gift is the result of a car accident that killed his wife. But what he does not count on is more people dying in the small town where he lives. As he tries to piece together the supernatural mystery of these killings, he falls in love with the wife of one of the victims and deals with a crazy FBI agent.",
                "popularity": 3.0751,
                "poster_path": "/zcJbCMwFLJdn5OLjhYwMVaSB32R.jpg",
                "release_date": "1996-07-18",
                "title": "The Frighteners",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 1618,
                "character": "The Judge",
                "credit_id": "52fe43b59251416c7501b17b",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/bkahbHkwBSbIDtTm667Tu1ba2bu.jpg",
                "genre_ids": [
                    80,
                    18,
                    10749
                ],
                "id": 1725,
                "original_language": "en",
                "original_title": "West Side Story",
                "overview": "In the slums of the upper West Side of Manhattan, tensions are high as a gang of Polish-Americans compete against a gang of recently immigrated Puerto Ricans, but this doesn't stop two romantics from each gang falling in love.",
                "popularity": 3.0087,
                "poster_path": "/nzCMu6D5q60i2bVrIQ0DxlRSgCZ.jpg",
                "release_date": "1961-12-13",
                "title": "West Side Story",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 1951,
                "character": "Glad Hand (uncredited)",
                "credit_id": "61fd0e43fe6c1800c20c4a3e",
                "order": 36
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "John Allen Astin",
            "جان آستین"
        ],
        "biography": "Dark haired, usually mustachioed US actor with a cheeky grin who achieved pop culture status through his portrayal of the kooky patriarch \"Gomez Addams\" in the hit TV series The Addams Family (1964).  John Astin standing at a height of 5' 11\" (1.8 m) was born March 30, 1930 (Aries), in Baltimore, MD as John Allen Astin to Allen V. Astin and Margaret Astin with a brother Alexander Astin. He is an American actor, voice actor and director. He attended Washington, Jefferson College and Johns Hopkins University where he studied mathematics. However he discovered a passion for the theater and began performing in minor plays and doing voice-over work for commercials. Married Suzanne Hahn on March 26, 1956, had 3 sons: David Aston (born 1953), Allen J. Astin (born March 23, 1961) and Thomas E. Astin (born March 19, 1965), then divorced June 14, 1972. He first got noticed in a small role in West Side Story (1961), then appeared in several other films, That Touch of Mink (1962), Move Over Darling (1963), before being cast as \"Gomez Addams\". While \"The Addams Family (1964–1966)\" was initially a huge hit, its popularity petered out after two years, and Astin moved on to other work including the offbeat Bunny O'Hare (1971), playing a grizzled but not particularly bright gunfighter in the western spoof Evil Roy Slade (1972), an appearance in the Disney comedy Freaky Friday (1976), reprising the role in the television film Halloween with the New Addams Family (1977) and dual roles in National Lampoon's European Vacation (1985), Teen Wolf Too (1987) and The Frighteners (1996). Married Patty Duke on August 5, 1972, had 2 sons: Mackenzie Astin (born May 12, 1973) and adopted Sean Astin (born February 25, 1971), when he was 3 years old, then divorced November 3, 1985. Roughly four years later, he married Valerie Ann Sandobal on March 19, 1989 and is still presently married. He has since lent his comedic talents to numerous appearances as \"Dr. Gangreen\" in several corny \"Killer Tomato\" movies, and has contributed his voice to recreate \"Gomez Addams\" in the animated series The Addams Family (1992), and then played \"Grandpa Addams\" in the short-lived TV series The New Addams Family (1998). In addition, Astin has contributed voices to several animated shows, and is still active (1957-present) regularly appearing in films.  Currently resides in Baltimore, Maryland with current wife. Astin was nominated for the Academy Award for Best Live Action Short Film for his directorial debut, the comedic short Prelude (1968).",
        "birthday": "1930-03-30",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 41230,
        "imdb_id": "nm0040014",
        "known_for_department": "Acting",
        "name": "John Astin",
        "place_of_birth": "Baltimore, Maryland, USA",
        "popularity": 1.9948,
        "profile_path": "/xczlYoJJblfyoOudcn7riLqsbXW.jpg"
    }
}