{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7NRGAtu8E4343NSKwhkgmVRDINw.jpg",
                "genre_ids": [
                    27,
                    53
                ],
                "id": 507089,
                "original_language": "en",
                "original_title": "Five Nights at Freddy's",
                "overview": "Recently fired and desperate for work, a troubled young man named Mike agrees to take a position as a night security guard at an abandoned theme restaurant: Freddy Fazbear's Pizzeria. But he soon discovers that nothing at Freddy's is what it seems.",
                "popularity": 13.1364,
                "poster_path": "/7BpNtNfxuocYEVREzVMO75hso1l.jpg",
                "release_date": "2023-10-25",
                "title": "Five Nights at Freddy's",
                "video": false,
                "vote_average": 7.395,
                "vote_count": 4557,
                "character": "Foxy's Scream (archive voice) (uncredited)",
                "credit_id": "672543160df4e66d4d925e68",
                "order": 31
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Judith Amanda Geeson",
            "جودی گیسون"
        ],
        "biography": "Judith Amanda \"Judy\" Geeson (born 10 September 1948) is an English film, stage, and television actress. Her first major film appearance was as wayward teenager Pamela Dare in To Sir, with Love in 1967 alongside Sidney Poitier and popular singer Lulu. In the same year, she appeared in Berserk!. She became well-known as a result of a regular role in the BBC early-evening soap opera, The Newcomers. She also had a major role in the popular 1970s costume drama Poldark as Caroline Penvenen Enys.\n\nHer other notable films include Here We Go Round the Mulberry Bush (1967), Prudence and the Pill, 10 Rillington Place, Doomwatch and Brannigan. In the TV series Danger UXB, she played the female lead, Susan Mount, opposite Anthony Andrews and had the lead role of Fulvia in Sci-Fi series Star Maidens.\n\nIn 1984, Geeson left London for Los Angeles where she decided to stay. Among other roles she appeared regularly on hit US sitcom Mad About You as the neighbour from Hell, Maggie Conway. She also had a recurring role as Sandrine on Star Trek Voyager episodes \"Twisted\" and \"The Cloud\".\n\nHaving always had an interest in antiques, for ten years she ran her own antique store, Blanche & Co, on West 3rd Street in Beverly Hills, in addition accepting occasional acting roles. The store closed in December, 2009.\n\nDescription above from the Wikipedia article  Judy Geeson, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1948-09-10",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 41234,
        "imdb_id": "nm0002096",
        "known_for_department": "Acting",
        "name": "Judy Geeson",
        "place_of_birth": "Arundel, Sussex, England, UK",
        "popularity": 0.6424,
        "profile_path": "/6HXwztsdjeK4QbgKd1sHlheDfx3.jpg"
    }
}