{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/i3pONuqGZSR3UYOOdBeU2CiQnxj.jpg",
                "genre_ids": [
                    10751,
                    18,
                    10402
                ],
                "id": 5123,
                "original_language": "en",
                "original_title": "August Rush",
                "overview": "Lyla and Louis, a singer and a musician, fall in love, but are soon compelled to separate. Lyla is forced to give up her newborn but unknown to her, he grows up to become a musical genius.",
                "popularity": 5.187,
                "poster_path": "/oA6ZeICPINiS6YtD5WZeBaGVmuT.jpg",
                "release_date": "2007-11-21",
                "title": "August Rush",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 2764,
                "character": "Arthur",
                "credit_id": "52fe43f5c3a36847f807a5fb",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/5C01GuAmEJp951X7fm66SPBlsxU.jpg",
                "genre_ids": [
                    80,
                    18,
                    53,
                    36
                ],
                "id": 407448,
                "original_language": "en",
                "original_title": "Detroit",
                "overview": "A police raid in Detroit in 1967 results in one of the largest citizens' uprisings in the history of the United States.",
                "popularity": 5.298,
                "poster_path": "/r0ldqSFASpqSM5xTrpcZGO6Ef2G.jpg",
                "release_date": "2017-07-28",
                "title": "Detroit",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1688,
                "character": "Darryl",
                "credit_id": "5830c369c3a3685ba1018ad6",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Leon Thomas III",
            "Leon Thomas"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nLeon Thomas III (born August 1, 1993) is an American actor, singer, songwriter, musician and dancer who plays the role of Andre on the Nickelodeon series Victorious.\n\nThomas was born in Brooklyn, New York but moved to Los Angeles, California and currently resides there.\n\nAt age 10 he made his Broadway debut in 2003 as Young Simba in the Broadway production of The Lion King. In 2004, he appeared as Jackie Thibodeaux in the original Broadway cast of Tony Kushner's Caroline or Change. He also toured with the company during its five-month run in Los Angeles and San Francisco. Thomas also performanced in the Broadway productions The Lion King, Caroline, or Change, and The Color Purple.\n\nIn 2007 he appeared alongside Robin Williams and Terrence Howard in the film August Rush as Arthur performing the song \"La Bamba\" and was the singing voice for Tyrone in The Backyardigans.[when?] Thomas has also guest starred on Jack's Big Music Show and Just Jordan. He also appeared as Harper in iCarly Saves TV and was featured on The Naked Brothers Band Christmas Special. He is a main character on Victorious, playing André, which premiered on Nickelodeon on March 27, 2010. He is an active Seventh-Day Adventist Christian.\n\nDescription above from the Wikipedia article Leon Thomas III, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1993-08-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 41295,
        "imdb_id": "nm2193861",
        "known_for_department": "Acting",
        "name": "Leon Thomas III",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.3704,
        "profile_path": "/qbrpac4dyEBJWjeApMyqsgy3iTM.jpg"
    }
}