{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/538U9snNc2fpnOmYXAPUh3zn31H.jpg",
                "genre_ids": [
                    28,
                    12,
                    53
                ],
                "id": 575265,
                "original_language": "en",
                "original_title": "Mission: Impossible - The Final Reckoning",
                "overview": "Ethan Hunt and team continue their search for the terrifying AI known as the Entity — which has infiltrated intelligence networks all over the globe — with the world's governments and a mysterious ghost from Hunt's past on their trail. Joined by new allies and armed with the means to shut the Entity down for good, Hunt is in a race against time to prevent the world as we know it from changing forever.",
                "popularity": 174.6469,
                "poster_path": "/z53D72EAOxGRqdr7KXXWp9dJiDe.jpg",
                "release_date": "2025-05-17",
                "title": "Mission: Impossible - The Final Reckoning",
                "video": false,
                "vote_average": 7.287,
                "vote_count": 1766,
                "character": "USS George H.W. Bush - Neely's Aide",
                "credit_id": "682e209c00d1cec6c1db36e8",
                "order": 50
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Madeline Day"
        ],
        "biography": "Madeleine Day is a British actress recognized for her roles in notable productions such as The Witcher (2019), CS Lewis: The Most Reluctant Convert (2021), and Mission: Impossible - The Final Reckoning (2025). She has established herself within the entertainment industry through a blend of television, film, and stage performances, gaining attention for her versatility and presence on screen.\n\nDay's acting career includes early theatrical work, notably at the Oregon Shakespeare Festival where she portrayed Sarah Summers in The Heart of Robin Hood, demonstrating her classical training and stage experience. Her transition into screen acting saw her participate in high-profile projects, including the fantasy series The Witcher, which contributed significantly to her rising profile.\n\nIn addition to acting, Day is also involved in digital content creation and entertainment, expanding her reach beyond traditional media. Her professional representation by Simon How Associates and engagement with fans and followers through social media platforms reflect her active presence in the contemporary entertainment landscape.",
        "birthday": "1996-10-24",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 4137133,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Madeleine Day",
        "place_of_birth": "Richmond, Surrey, England",
        "popularity": 0.1149,
        "profile_path": "/dPiewtGu65uPCGhEgmI7MoYlyVX.jpg"
    }
}