{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8zLS8p1tRyWFLRFfmgQq0j5WE6z.jpg",
                "genre_ids": [
                    12,
                    28,
                    14
                ],
                "id": 564,
                "original_language": "en",
                "original_title": "The Mummy",
                "overview": "Dashing legionnaire Rick O'Connell stumbles upon the hidden ruins of Hamunaptra while in the midst of a battle to claim the area in 1920s Egypt. It has been over three thousand years since former High Priest Imhotep suffered a fate worse than death as a punishment for a forbidden love—along with a curse that guarantees eternal doom upon the world if he is ever awoken.",
                "popularity": 13.6616,
                "poster_path": "/yhIsVvcUm7QxzLfT6HW2wLf5ajY.jpg",
                "release_date": "1999-04-16",
                "title": "The Mummy",
                "video": false,
                "vote_average": 6.949,
                "vote_count": 9490,
                "character": "Gad Hassan",
                "credit_id": "52fe4253c3a36847f80156e3",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/sQbpfYoGiEBUnr8tBjHP51heNNT.jpg",
                "genre_ids": [
                    10751,
                    16,
                    35,
                    12
                ],
                "id": 263109,
                "original_language": "en",
                "original_title": "Shaun the Sheep Movie",
                "overview": "When Shaun decides to take the day off and have some fun, he gets a little more action than he bargained for. A mix up with the Farmer, a caravan and a very steep hill lead them all to the Big City and it's up to Shaun and the flock to return everyone safely to the green grass of home.",
                "popularity": 3.5174,
                "poster_path": "/1GMvKNy2Ht5QwI0oV0ycYnxzWdC.jpg",
                "release_date": "2015-02-05",
                "title": "Shaun the Sheep Movie",
                "video": false,
                "vote_average": 6.972,
                "vote_count": 1445,
                "character": "Trumper (voice)",
                "credit_id": "54d7a7b3c3a3685431002fce",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/jhk6D8pim3yaByu1801kMoxXFaX.jpg",
                "genre_ids": [
                    28,
                    18,
                    12
                ],
                "id": 98,
                "original_language": "en",
                "original_title": "Gladiator",
                "overview": "After the death of Emperor Marcus Aurelius, his devious son takes power and demotes Maximus, one of Rome's most capable generals who Marcus preferred. Eventually, Maximus is forced to become a gladiator and battle to the death against other men for the amusement of paying audiences.",
                "popularity": 13.7275,
                "poster_path": "/ty8TGRuvJLPUmAR1H1nRIsgwvim.jpg",
                "release_date": "2000-05-04",
                "title": "Gladiator",
                "video": false,
                "vote_average": 8.22,
                "vote_count": 20050,
                "character": "Slave Trader",
                "credit_id": "55338c68925141101400343c",
                "order": 15
            },
            {
                "adult": false,
                "backdrop_path": "/8HKwxHZ23sW8wz4yb28IWnAM1M6.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 458423,
                "original_language": "en",
                "original_title": "Mamma Mia! Here We Go Again",
                "overview": "Five years after meeting her three fathers, Sophie Sheridan prepares to open her mother’s hotel. In 1979, young Donna Sheridan meets the men who each could be Sophie’s biological father.",
                "popularity": 6.4288,
                "poster_path": "/aWicerX4Y7n7tUwRAVHsVcBBpj2.jpg",
                "release_date": "2018-07-18",
                "title": "Mamma Mia! Here We Go Again",
                "video": false,
                "vote_average": 7.089,
                "vote_count": 3470,
                "character": "Greek Official",
                "credit_id": "5b537a1c0e0a262312015c4e",
                "order": 19
            },
            {
                "adult": false,
                "backdrop_path": "/zONM403tEJuSi0kZhA3TxkUoS22.jpg",
                "genre_ids": [
                    28,
                    80,
                    53
                ],
                "id": 1535,
                "original_language": "en",
                "original_title": "Spy Game",
                "overview": "On the day of his retirement, a veteran CIA agent learns that his former protégé has been arrested in China, is sentenced to die the next morning in Beijing, and that the CIA is considering letting that happen to avoid an international scandal.",
                "popularity": 8.609,
                "poster_path": "/6y8M1rxjKofQCRKKe6xeV91K2Fc.jpg",
                "release_date": "2001-11-18",
                "title": "Spy Game",
                "video": false,
                "vote_average": 6.909,
                "vote_count": 2205,
                "character": "Doumet",
                "credit_id": "5be20a7a9251415c7e004b48",
                "order": 53
            },
            {
                "adult": false,
                "backdrop_path": "/egyi9TQjLhNEQuEsK1dXovdHOHL.jpg",
                "genre_ids": [
                    10749,
                    35
                ],
                "id": 509,
                "original_language": "en",
                "original_title": "Notting Hill",
                "overview": "London bookstore owner William Thacker's quiet life turns upside down when a chance encounter with famous actress Anna Scott sparks an unlikely romance challenged by their vastly different worlds.",
                "popularity": 9.0224,
                "poster_path": "/hHRIf2XHeQMbyRb3HUx19SF5Ujw.jpg",
                "release_date": "1999-05-21",
                "title": "Notting Hill",
                "video": false,
                "vote_average": 7.265,
                "vote_count": 6422,
                "character": "Coffee Shop Cashier (uncredited)",
                "credit_id": "5be20bd00e0a2614ae005176",
                "order": 39
            },
            {
                "adult": false,
                "backdrop_path": "/1jHxkVXMI5s3vRiyiZooUy1shB5.jpg",
                "genre_ids": [
                    12,
                    14,
                    28
                ],
                "id": 285,
                "original_language": "en",
                "original_title": "Pirates of the Caribbean: At World's End",
                "overview": "Will Turner and Elizabeth Swann join forces with the revived Captain Barbossa to free Jack Sparrow from Davy Jones' locker. The group must navigate dangerous waters, confront many foes and, ultimately, choose sides in a battle wherein piracy itself hangs in the balance.",
                "popularity": 16.0691,
                "poster_path": "/jGWpG4YhpQwVmjyHEGkxEkeRf0S.jpg",
                "release_date": "2007-05-19",
                "title": "Pirates of the Caribbean: At World's End",
                "video": false,
                "vote_average": 7.262,
                "vote_count": 14912,
                "character": "Askay / Pusasn",
                "credit_id": "5be2127a9251415c77005455",
                "order": 50
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Omid Djalili is a British stand-up comedian, actor, television producer and writer.\n\nDjalili was born on 30 September 1965 in St Mary Abbots Hospital in Kensington, London, to Iranian Baháʼí parents Ahmad and Parvaneh Djalili. His parents emigrated from Tehran to London in 1958. He has a brother and sister. His mother was a dressmaker who at one point assisted Iranian singer Googoosh. His father was a liaison officer at the Iranian embassy in which he would provide medical assistance. He was also a photographer whose pictures ended up in the newspaper Kayhan. He attended Holland Park School where he failed A-level exams a record six times and faked his results to gain entry to Ulster University in Coleraine, Northern Ireland, studying English and theatre studies having been turned down by 16 drama schools.  Djalili cited Jack Lemmon, Dustin Hoffman, Meryl Streep, Robert De Niro, Christopher Walken and Julia Roberts as influences.\n\nThe first significant success of his stand-up comedy career was at the Edinburgh Festival Fringe in 1995 with \"Short, Fat Kebab Shop Owner's Son\", followed by \"The Arab and the Jew\" with Jewish comedian Ivor Dembina in 1996.\n\nDjalili has appeared in a number of films, most notably Gladiator, The Mummy, Mean Machine, The World Is Not Enough, Alien Autopsy, Spy Game, Sky Captain and the World of Tomorrow, Grow Your Own, Notting Hill, Mr Nice, Pirates of the Caribbean: At World's End, Sex and the City 2 and provides his voice in Over the Hedge. He has observed that he usually appears as a generic Middle Eastern background character in many of these films, often commenting that he appears in the James Bond film as the \"Second Azerbaijani oil pipe attendant\". He appeared as Nasim in 22 episodes of the U.S. sitcom Whoopi, starring Whoopi Goldberg, and picked up an international film award for Best Supporting Actor in Casanova, starring alongside Heath Ledger and Jeremy Irons.\n\nDjalili has won awards for his comedy. These include the EMMA Award, Time Out Award, and LWT Comedy Award for Best Stand-up Comedian, Spirit of the Fringe Award as well as the One World Media Award for his Channel 4 documentary, Bloody Foreigners. He has also been nominated for awards, such as the Perrier Award for Best Comedian, the Gemini Award for Best Comedy Performance of 2003, the South Bank Award for Best Comedy of 2003, the Royal Television Society Award for Best Stand-up, and the European TV Award for his Bloody Foreigners.",
        "birthday": "1965-09-30",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.omidnoagenda.com/",
        "id": 41379,
        "imdb_id": "nm0229084",
        "known_for_department": "Acting",
        "name": "Omid Djalili",
        "place_of_birth": "Chelsea, London, England, UK",
        "popularity": 0.6402,
        "profile_path": "/lCgVvAw8EkIKbc93ZtINdwxH1CV.jpg"
    }
}