{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mZfkW31Y9a8DvISpO9nj5Tc7neo.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 4584,
                "original_language": "en",
                "original_title": "Sense and Sensibility",
                "overview": "The Dashwood sisters, sensible Elinor and passionate Marianne, whose chances at marriage seem doomed by their family's sudden loss of fortune.  When Henry Dashwood dies unexpectedly, his estate must pass on by law to his son from his first marriage, John and wife Fanny. But these circumstances leave Mr. Dashwood's current wife, and daughters Elinor, Marianne and Margaret, without a home and with barely enough money to live on. As Elinor and Marianne struggle to find romantic fulfillment in a society obsessed with financial and social status, they must learn to mix sense with sensibility in their dealings with both money and men.",
                "popularity": 5.1187,
                "poster_path": "/cBK2yL3HqhFvIVd7lLtazWlRZPR.jpg",
                "release_date": "1995-12-13",
                "title": "Sense and Sensibility",
                "video": false,
                "vote_average": 7.419,
                "vote_count": 1755,
                "character": "Mr. Palmer",
                "credit_id": "52fe43cec3a36847f8071057",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "James Hugh Calum Laurie",
            "ヒュー・ローリー",
            "휴 로리",
            "Хʼю Лорі",
            "هیو لوری"
        ],
        "biography": "James Hugh Calum Laurie CBE (born June 11, 1959), known professionally as Hugh Laurie, is an English actor, director, singer, musician, comedian, and author. He is known for portraying the title character on the Fox medical drama series House (2004–2012), for which he received two Golden Globe Awards and nominations for numerous other awards. He was listed in the 2011 Guinness World Records as the most watched leading man on television and was one of the highest-paid actors in a television drama, earning £250,000 ($409,000) per episode of House.\n\nHis other television credits include arms dealer Richard Onslow Roper in the miniseries The Night Manager (2016), for which he won his third Golden Globe Award, and Senator Tom James in the HBO sitcom Veep (2012–2019), for which he received his 10th Emmy Award nomination.\n\nForced to abandon rowing during a bout of glandular fever, he joined the Cambridge Footlights, a university dramatic club that has produced many well-known actors and comedians. There he met Emma Thompson, with whom he had a romantic relationship, which later ended yet they remain good friends. She introduced him to his future comedy partner, Stephen Fry. Laurie, Fry and Thompson later parodied themselves as the University Challenge representatives of \"Footlights College, Oxbridge\" in \"Bambi\", an episode of The Young Ones, with the series' co-writer Ben Elton completing their team.",
        "birthday": "1959-06-11",
        "deathday": null,
        "gender": 2,
        "homepage": "https://hughlaurieblues.com",
        "id": 41419,
        "imdb_id": "nm0491402",
        "known_for_department": "Acting",
        "name": "Hugh Laurie",
        "place_of_birth": "Oxford, England, UK",
        "popularity": 1.7531,
        "profile_path": "/lpu443aKW5aKzVnV4xjiqvD1DnK.jpg"
    }
}