{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ag66gJCiZ06q1GSJuQlhGLi3Udx.jpg",
                "genre_ids": [
                    27,
                    53
                ],
                "id": 1138194,
                "original_language": "en",
                "original_title": "Heretic",
                "overview": "Two young missionaries are forced to prove their faith when they knock on the wrong door and are greeted by a diabolical Mr. Reed, becoming ensnared in his deadly game of cat-and-mouse.",
                "popularity": 12.0017,
                "poster_path": "/fr96XzlzsONrQrGfdLMiwtQjott.jpg",
                "release_date": "2024-10-31",
                "title": "Heretic",
                "video": false,
                "vote_average": 6.98,
                "vote_count": 2152,
                "character": "Missionary #1 (uncredited)",
                "credit_id": "665cd1cdfd9313d0d3a0ab61",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "River Cassius Codack"
        ],
        "biography": "Actor River Codack was born in Ontario and made the move to the West Coast at age 10. He became fascinated with acting at 14 and started his acting career with a lead role in the award-winning short film Crumbs, as part of the renowned Crazy 8's film festival. Since then he has guest-starred in the Netflix series Grendel and in a lead role in the independent short film My Name is Arnold, for which he was nominated for best actor in a leading role at the Vancouver Short Film Festival (2023). He performed in the second season of CBC Gem’s Son of a Critch as a recurring guest-star, and had a recurring principal role in the mini-series Under The Bridge. River also played the role of teen Nathan in Heartland, Hayden in the independent feature film What Comes Next, Zach in Tracker and a missionary in the upcoming A24 feature film Heretic starring Hugh Grant.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.rivercodack.com/",
        "id": 4150510,
        "imdb_id": "nm12509041",
        "known_for_department": "Acting",
        "name": "River Codack",
        "place_of_birth": "Ontario, Canada",
        "popularity": 0.137,
        "profile_path": "/linaIZJqleeWHjonIdDtISzVYrX.jpg"
    }
}