{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jx6jUMCLhRWB05ngVjaGxPpLq5x.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 5143,
                "original_language": "en",
                "original_title": "Hannah and Her Sisters",
                "overview": "Between two Thanksgivings, Hannah's husband falls in love with her sister Lee, while her hypochondriac ex-husband rekindles his relationship with her sister Holly.",
                "popularity": 2.175,
                "poster_path": "/gARgIRb2QFRFVrsziwWE389u1pK.jpg",
                "release_date": "1986-02-07",
                "title": "Hannah and Her Sisters",
                "video": false,
                "vote_average": 7.498,
                "vote_count": 1088,
                "character": "Norma",
                "credit_id": "52fe43f6c3a36847f807aad7",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Maureen Paula O'Sullivan",
            "Морин О’Салливан",
            "Maureen O’Sullivan"
        ],
        "biography": "Maureen Paula O'Sullivan was born in County Roscommon, Ireland, on May 17, 1911. The future mother of Mia Farrow was a schooldays classmate of Vivien Leigh at the Convent of the Sacred Heart at Roehampton in London. Even as a schoolgirl, Maureen desired an acting career; she studied hard and read widely. When the opportunity to be an actress came along, it almost dropped in her lap. The director Frank Borzage was in Dublin filming “Song o’ My Heart” (1930) when Maureen, then 18, met him. Borzage suggested a screen test, which she took. The results were more than favorable, as she won the part of Eileen O’Brien. The part was a substantial one, so much so that Maureen went on to Hollywood to complete the filming. Once in sunny California, Maureen wasted no time landing roles in other films such as “Just Imagine” (1930), “Princess and the Plumber” (1930), and “So This Is London” (1930). Maureen was on a roll that her contemporaries could only have wished for when they were coming up through the ranks. In 1932, Maureen was teamed up with Olympic medal winner Johnny Weissmuller for the first time in “Tarzan the Ape Man” (1932). Five other Tarzan films followed, the last being “Tarzan’s New York Adventure” (1942). The Tarzan epics rank as one of the most memorable series ever made. Most people agree that those movies would not have been successful had it not been for the fine acting talents, not to mention beauty, of Maureen O’Sullivan. But she was more than Jane Parker in the Tarzan films; she had great roles and played beautifully in films such as “The Flame Within” (1935), “David Copperfield” (1935), and “Anna Karenina” (1935). She turned in yet another fine performance in “Pride and Prejudice” (1940). After the 1940s, Maureen made far fewer films, not because she lost popularity but by choice. It isn’t always easy to walk away from a lucrative career, but she did because she wanted to devote more time to her husband, John Farrow, an Australian writer, and their seven children. The couple were married from 1936 until his death in 1963. She did not, however, retire completely; Maureen still found time to make an occasional appearance in films or TV or on the stage. Later movie-goers remember her as Elizabeth Alvorg in the hit film “Peggy Sue Got Married” (1986). Her final silver screen appearance was in “The River Pirates” (1988). Some TV movies followed, but only until 1996. She maintained homes in New Hampshire and Arizona, and it was in Scottsdale that Maureen died on June 23, 1998, of a heart attack. She was 87 years old.",
        "birthday": "1911-05-17",
        "deathday": "1998-06-23",
        "gender": 1,
        "homepage": null,
        "id": 41516,
        "imdb_id": "nm0001577",
        "known_for_department": "Acting",
        "name": "Maureen O'Sullivan",
        "place_of_birth": "Boyle, County Roscommon, Ireland",
        "popularity": 0.4119,
        "profile_path": "/uA1Upl9u0TCVMjX7l7lgG44ap9N.jpg"
    }
}