{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ytclDXEffquvzjwNXbiYEU1b6F2.jpg",
                "genre_ids": [
                    28,
                    18
                ],
                "id": 4643,
                "original_language": "en",
                "original_title": "The Guardian",
                "overview": "A high school swim champion with a troubled past enrolls in the U.S. Coast Guard's 'A' School, where legendary rescue swimmer Ben Randall teaches him some hard lessons about loss, love, and self-sacrifice.",
                "popularity": 4.6544,
                "poster_path": "/zFhFjrckfmdb33VDeRykumMmebU.jpg",
                "release_date": "2006-09-28",
                "title": "The Guardian",
                "video": false,
                "vote_average": 7.136,
                "vote_count": 1579,
                "character": "Emily Thomas",
                "credit_id": "52fe43d1c3a36847f8071db7",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "メリッサ・サージミラー",
            "멀리사 세이지밀러",
            "ملیسا سیجمیلر",
            "\t Сейджмиллер, Мелисса",
            "梅丽莎·赛格米勒",
            "\t 梅丽莎·赛格米勒",
            "\t 梅麗莎·賽格米勒",
            "賽格米勒"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nMelissa Sagemiller (born June 1, 1974, height 5' 6\" (1,68 m)) is an American television and film actress.\n\nSagemiller was born in Washington, D.C. to a political activist mother and a professional American football player father, who played in the NFL for the New York Giants and the Washington Redskins. She attended Georgetown Day School. Her entry into the performing arts was at age 3 when she began studying tap dance, ballet, jazz dance and modern dance. She made her stage debut in To Kill a Mockingbird when she was 9 years old, and soon after she became a regular on her local stage. At 14, however, acting took a backseat to modeling after Sagemiller was scouted by Eileen Ford in a jewelry shop. She eventually left modeling to take an undergraduate degree in Art History at the University of Virginia.\n\nShortly after graduation, she decided to return to acting full-time, and studied at the Stella Adler Conservatory, New York University's Stonestreet Studio and at Michael Howard Studios. Sagemiller appeared in Movieline magazine in August 2001. In November 2001, Sagemiller appeared in Gear magazine. In early career, she starred on number of teen films, like Get Over It and Sorority Boys, and was lead actress in 2002 box office bomb thriller Soul Survivors.\n\nOn television, Sagemiller portrayed the character Michelle Ernhardt in the TNT series Raising the Bar from 2008 to 2009. After that series was cancelled, Sagemiller joined Law & Order: Special Victims Unit in a recurring role as ADA Gillian Hardwicke. She replaced Paula Patton when Patton departed the series after just one episode. Sagemiller was featured in ten episodes of the 12th season of SVU. She was replaced in the 13th season by Stephanie March and Diane Neal. In 2013, she was cast as female lead on Chicago Fire spinoff Chicago PD,but later left from show.",
        "birthday": "1974-06-01",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 41555,
        "imdb_id": "nm0756089",
        "known_for_department": "Acting",
        "name": "Melissa Sagemiller",
        "place_of_birth": "Washington, District of Columbia, USA",
        "popularity": 0.3972,
        "profile_path": "/s8JEuWY5wnrm5D0uZCh9ezYztx6.jpg"
    }
}