{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sXfQGa7juaTpZ5IF17Xa6hI53nx.jpg",
                "genre_ids": [
                    10751,
                    16,
                    12
                ],
                "id": 12144,
                "original_language": "en",
                "original_title": "The Land Before Time",
                "overview": "An orphaned brontosaurus named Littlefoot sets off in search of the legendary Great Valley. A land of lush vegetation where the dinosaurs can thrive and live in peace. Along the way he meets four other young dinosaurs, each one a different species, and they encounter several obstacles as they learn to work together in order to survive.",
                "popularity": 3.4147,
                "poster_path": "/7phV1ETZnQrLsEeuk4hNeceEl25.jpg",
                "release_date": "1988-11-18",
                "title": "The Land Before Time",
                "video": false,
                "vote_average": 7.15,
                "vote_count": 2626,
                "character": "Littlefoot's Mother (voice)",
                "credit_id": "530f1469925141734a0007dd",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Helen Jane Shaver",
            "هلن شیور"
        ],
        "biography": "Helen Shaver is a Canadian stage, film and television actress and director. She attended the Banff School of Fine Arts and studied Acting at the University of Victoria, British Columbia, Canada. She started acting at 18, collaborating with industry giants like Scorsese and Spielberg. Her performances earned awards—Theatreworld Award for \"Jake’s Woman,\" Genies for \"In Praise of Older Women\" (Best Actress) and \"Who Has Seen the Wind\" (Best Supporting Actress). Transitioning to directing, she helmed episodes for various series and directed Emmy-winning films like \"Summer’s End.\" Despite childhood illness, her resilience led her to study acting and excel in her craft.",
        "birthday": "1951-02-24",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 4160,
        "imdb_id": "nm0001726",
        "known_for_department": "Directing",
        "name": "Helen Shaver",
        "place_of_birth": "Saint Thomas, Ontario, Canada",
        "popularity": 1.0376,
        "profile_path": "/4RcaswFfLR8D3bQBHVlxyBR0R0H.jpg"
    }
}