{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/etiP3Mu3ze2j9m3FEAAyOKFYlH0.jpg",
                "genre_ids": [
                    12,
                    28,
                    53,
                    878
                ],
                "id": 563,
                "original_language": "en",
                "original_title": "Starship Troopers",
                "overview": "Set in the future, the story follows a young soldier named Johnny Rico and his exploits in the Mobile Infantry. Rico's military career progresses from recruit to non-commissioned officer and finally to officer against the backdrop of an interstellar war between mankind and an arachnoid species known as \"the Bugs.\"",
                "popularity": 13.557,
                "poster_path": "/cxCmv23O7p3hyHwqoktHYkZcGsY.jpg",
                "release_date": "1997-11-07",
                "title": "Starship Troopers",
                "video": false,
                "vote_average": 7.09,
                "vote_count": 5186,
                "character": "Biology Teacher",
                "credit_id": "52fe4253c3a36847f80155c9",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Patti Leigh",
            "Patty Leigh",
            "Rhue McClanahan",
            "Ру МакКлэнахан"
        ],
        "biography": "A veteran television actress and Broadway star of the 50s, Rue McClanahan was an actress noticed by television executive, Norman Lear. Lear cast her in a number of television shows, including \"All in the Family\" (1971) with 'Carroll OConnor' and \"Maude\" (1972) with Bea Arthur. McClanahan next co-starred with Vicki Lawrence, Ken Berry, Betty White and Carol Burnett in \"Mama's Family\" (1983) for three years, and after it was canceled by NBC, McClanahan was probably best known for her role as the saucy, sharp southern belle, Blanche, in \"The Golden Girls\" (1985). She once again worked with Bea Arthur and Betty White, and with relative newcomer Estelle Getty. All four of the women won Emmy Awards for their roles. After Bea Arthur left the show after eight seasons, McClanahan, White and Getty returned for a brief spin-off in \"The Golden Palace\" (1992). In the mid-nineties, McClanahan was diagnosed with cancer, but was able to fight it successfully. In addition to lending her talents to a number of made for TV films, McClanahan has also appeared on the big screen in recent years co-starring with Jack Lemmon and Walter Matthau in the comedy Out to Sea (1997) and with Casper Van Dien in Starship Troopers (1997). McClanahan also spends her time joining and helping organizations against cancer, AIDS, and cruelty against animals.",
        "birthday": "1934-02-21",
        "deathday": "2010-06-03",
        "gender": 1,
        "homepage": null,
        "id": 41689,
        "imdb_id": "nm0001516",
        "known_for_department": "Acting",
        "name": "Rue McClanahan",
        "place_of_birth": "Healdton, Oklahoma, USA",
        "popularity": 0.6848,
        "profile_path": "/5obbwWKm2QWezmeBuOqA6vfXjlS.jpg"
    }
}