{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/y1giivdsGLyo1LCvlsL6mLKyTZ7.jpg",
                "genre_ids": [
                    53,
                    18,
                    9648
                ],
                "id": 1018,
                "original_language": "en",
                "original_title": "Mulholland Drive",
                "overview": "Blonde Betty Elms has only just arrived in Hollywood to become a movie star when she meets an enigmatic brunette with amnesia. Meanwhile, as the two set off to solve the second woman's identity, filmmaker Adam Kesher runs into ominous trouble while casting his latest project.",
                "popularity": 9.3955,
                "poster_path": "/x7A59t6ySylr1L7aubOQEA480vM.jpg",
                "release_date": "2001-06-06",
                "title": "Mulholland Drive",
                "video": false,
                "vote_average": 7.808,
                "vote_count": 6652,
                "character": "Backup Singer #2",
                "credit_id": "52fe42e5c3a36847f802afa3",
                "order": 56
            },
            {
                "adult": false,
                "backdrop_path": "/etiP3Mu3ze2j9m3FEAAyOKFYlH0.jpg",
                "genre_ids": [
                    12,
                    28,
                    53,
                    878
                ],
                "id": 563,
                "original_language": "en",
                "original_title": "Starship Troopers",
                "overview": "Set in the future, the story follows a young soldier named Johnny Rico and his exploits in the Mobile Infantry. Rico's military career progresses from recruit to non-commissioned officer and finally to officer against the backdrop of an interstellar war between mankind and an arachnoid species known as \"the Bugs.\"",
                "popularity": 7.7597,
                "poster_path": "/cxCmv23O7p3hyHwqoktHYkZcGsY.jpg",
                "release_date": "1997-11-07",
                "title": "Starship Troopers",
                "video": false,
                "vote_average": 7.09,
                "vote_count": 5182,
                "character": "Katrina McIntire",
                "credit_id": "52fe4253c3a36847f80155cd",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/6P6YdvJsAZlUZKipA86rbfjfKzD.jpg",
                "genre_ids": [
                    18,
                    10749,
                    35
                ],
                "id": 113947,
                "original_language": "en",
                "original_title": "The Sessions",
                "overview": "Though a childhood bout with polio left him dependent on an iron lung, Mark O'Brien maintains a career as a journalist and poet. A writing assignment dealing with sex and the disabled piques Mark's curiosity, and he decides to investigate the possibility of experiencing sex himself. When his overtures toward a caregiver scare her away, he books an appointment with sex surrogate Cheryl Cohen-Greene to lose his virginity.",
                "popularity": 2.5272,
                "poster_path": "/57o1DBc5DfJXVc8wArAblSbZ8sD.jpg",
                "release_date": "2012-05-02",
                "title": "The Sessions",
                "video": false,
                "vote_average": 6.894,
                "vote_count": 575,
                "character": "Dr. Laura White",
                "credit_id": "52fe4b42c3a36847f81fa8cb",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Norma Blake Lindsley Schlei "
        ],
        "biography": "Blake Lindsley practically grew up around acting for most of her life. Born on December 19, 1973 in Los Angeles, in 1986, while attending the Westlake School for girls, she acted in school plays. At this time, Blake was also a Varsity member of the Equestrian Team. Shortly following her graduating from high school in 1992, Blake enrolled at Yale University as a theatre major. During her time in college she performed in numerous plays. She focused her studies on dramatic literature at Yale. Upon graduating from Yale, Blake received the Saybrook Master's Prize for the Arts. Her career in acting spans well over 20 years, appearing across both movie and television screens in a variety of films and television series. She is a competitive horseback rider and has won many championships including the prestigious Foxfield medal finals in 2010. She lives in the Hollywood Hills with her husband, producer Stephen Nemeth, their son Lincoln and daughter Louise.",
        "birthday": "1973-12-19",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.blakelindsley.com/",
        "id": 41690,
        "imdb_id": "nm0512420",
        "known_for_department": "Acting",
        "name": "Blake Lindsley",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.2249,
        "profile_path": "/1sZKoLMvK1idRLzO7TYeB3cGaOj.jpg"
    }
}