{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gj2TBYmOIy4E2GjMIpnbAEZNCQx.jpg",
                "genre_ids": [
                    35,
                    9648,
                    10749
                ],
                "id": 4808,
                "original_language": "en",
                "original_title": "Charade",
                "overview": "After Regina Lampert falls for the dashing Peter Joshua on a skiing holiday in the French Alps, she discovers upon her return to Paris that her husband has been murdered. Soon, she and Peter are giving chase to three of her late husband's World War II cronies, Tex, Scobie and Gideon, who are after a quarter of a million dollars the quartet stole while behind enemy lines.",
                "popularity": 3.5562,
                "poster_path": "/qqaPjC5FQidtKY65jbAKZPiOTaS.jpg",
                "release_date": "1963-12-01",
                "title": "Charade",
                "video": false,
                "vote_average": 7.669,
                "vote_count": 1452,
                "character": "Mr. Felix",
                "credit_id": "52fe43dbc3a36847f80745e9",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "The Molière Players",
            "Henri Paul Bonifas",
            "Paul Boniface",
            "Victor Boniface",
            "Bonifas",
            "Bonifas de la Comédie Française"
        ],
        "biography": "Paul Bonifas (3 June 1902 – 9 November 1975) was a French actor, born in Paris.\n\nIn the 1920s, while working for the French customs service, Bonifas took classes in acting at the Conservatoire de Paris in his spare time. He left with the first prize for comedy, which allowed him to join the Odéon Theatre in 1933, then the Comédie-Française in 1938.\n\nHe made his first film appearance in 1935 in a version of Dostoyevsky's Crime and Punishment, directed by Pierre Chenal.\n\nDuring World War II he served as a lieutenant in the artillery, was badly wounded, and evacuated from Dunkirk with his unit. In London he joined the Free French, and worked for Radio Londres broadcasting to occupied France.\n\nIn 1942 he appeared in the film The Foreman Went to France.\n\nIn 1943 he formed \"The Molière Players\", who staged a repertoire of mainly Molière works in London theatres, as well as in regional towns and at French army barracks. He came to the Comedy Theatre, London with Théâtre Molierè in 1943 and 1944, performing in L'Anglais Tel Qu'on Le Parle, Le Malade Imaginaire, Gringoire, Le Misanthrope et L'Auvergnat, Les Femmes Savantes, Le Paquebot Tenacity, La Testament Du Pere Leleu and L'Extra. His Company included Andre Frere, Georges Rex, Suzette Marquis, Elma Soiron and Paul Clarus.\n\nIn 1944 \"The Molière Players\" appeared in the short film Aventure malgache directed by Alfred Hitchcock. This was written by, and based on the experiences of, Jules Francois Clermont, an actor in Bonifas' troupe working under the name of Paul Clarus, who had operated an illegal radio station Madagascar Libre in Madagascar while the island was under Vichy control.\n\nBonifas then appeared in a number of other British films, including Two Fathers with Bernard Miles, directed by Anthony Asquith, and had minor roles in the musicals Heaven Is Round the Corner and Champagne Charlie, the action adventure film The Man from Morocco, the comedy-drama Johnny Frenchman and the horror film Dead of Night.\n\nBonifas returned to France in 1946 and resumed his career in theatre, specializing in comedy, but also taking dramatic roles.\n\nHis later film career included appearances in Trapeze (1956), The Hunchback of Notre Dame (1956), Fanny (1961), Charade (1963), Greed in the Sun (1964), The Train (1964), Is Paris Burning? (1966), Triple Cross (1966), and The Return of the Tall Blond Man with One Black Shoe (1974).\n\nBonifas died on 9 November 1975 at Vernouillet, Yvelines, France.\n\nSource: Article \"Paul Bonifas\" from Wikipedia in English, licensed under CC-BY-SA.  ",
        "birthday": "1902-06-03",
        "deathday": "1975-11-09",
        "gender": 2,
        "homepage": null,
        "id": 41716,
        "imdb_id": "nm0094585",
        "known_for_department": "Acting",
        "name": "Paul Bonifas",
        "place_of_birth": "Paris, France",
        "popularity": 0.1016,
        "profile_path": "/5f64JtplnHJDWpSMEP1EjKjkbDc.jpg"
    }
}