{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4HWAQu28e2yaWrtupFPGFkdNU7V.jpg",
                "genre_ids": [
                    35,
                    80,
                    9648
                ],
                "id": 546554,
                "original_language": "en",
                "original_title": "Knives Out",
                "overview": "When renowned crime novelist Harlan Thrombey is found dead at his estate just after his 85th birthday, the inquisitive and debonair Detective Benoit Blanc is mysteriously enlisted to investigate. From Harlan's dysfunctional family to his devoted staff, Blanc sifts through a web of red herrings and self-serving lies to uncover the truth behind Harlan's untimely death.",
                "popularity": 9.8244,
                "poster_path": "/pThyQovXQrw2m0s9x82twj48Jq4.jpg",
                "release_date": "2019-11-27",
                "title": "Knives Out",
                "video": false,
                "vote_average": 7.843,
                "vote_count": 13116,
                "character": "Greatnana Wanetta",
                "credit_id": "5d757d8d2ea6b90011c02f9f",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Katherine Elizabeth Borman "
        ],
        "biography": "K Callan, born Katherine Elizabeth Borman on January 9, 1942, in Dallas, Texas, is an American actress and author. She began her professional acting career at the Margo Jones Theatre and gained national attention for her role as Peter Boyle’s mousy wife in the film “Joe” in 1970. Callan has had a diverse career spanning film, television, and theater, with notable roles including Martha Kent in the TV series “Lois & Clark: The New Adventures of Superman” and Elizabeth in the Christian drama “The Chosen.” She has also appeared in films such as “American Gigolo” (1980) and “Knives Out” (2019). Callan has authored several books on the entertainment industry and received her acting training at HB Studio in New York City. She was married to author James Ruskin Callan and they have three children.",
        "birthday": "1942-01-09",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 41729,
        "imdb_id": "nm0130282",
        "known_for_department": "Acting",
        "name": "K Callan",
        "place_of_birth": "Dallas, Texas, USA",
        "popularity": 0.2856,
        "profile_path": "/8UnFOCodeeywOtIkFPOuPPuQixB.jpg"
    }
}