{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yq9g4RGM1mEMBoSL5HKVBy9MOPM.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 40807,
                "original_language": "en",
                "original_title": "50/50",
                "overview": "Inspired by a true story, a comedy centered on a 27-year-old guy who learns of his cancer diagnosis and his subsequent struggle to beat the disease.",
                "popularity": 3.5096,
                "poster_path": "/8f9tM9JVB4ETBhxlQcXIjLckArl.jpg",
                "release_date": "2011-09-30",
                "title": "50/50",
                "video": false,
                "vote_average": 7.174,
                "vote_count": 3897,
                "character": "Richard Lerner",
                "credit_id": "52fe45a4c3a36847f80d2655",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/wTvDGO0xGMmnScqjuiDeWU7PkcB.jpg",
                "genre_ids": [
                    10749,
                    14,
                    18
                ],
                "id": 293863,
                "original_language": "en",
                "original_title": "The Age of Adaline",
                "overview": "After 29-year-old Adaline recovers from a nearly lethal accident, she inexplicably stops growing older. As the years stretch on and on, Adaline keeps her secret to herself  until she meets a man who changes her life.",
                "popularity": 5.2512,
                "poster_path": "/MbILysGhjAbnZi1Okae9wYqLMx.jpg",
                "release_date": "2015-04-16",
                "title": "The Age of Adaline",
                "video": false,
                "vote_average": 7.479,
                "vote_count": 6890,
                "character": "Good Samaritan",
                "credit_id": "553c917d9251416874004d30",
                "order": 31
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Steve Makaj"
        ],
        "biography": "Serge Houde (born February 16, 1953) is a Canadian film and television character actor. He is best known for his role in Jon Cassar's Emmy-nominated miniseries The Kennedys playing the notorious Chicago mafia boss Sam Giancana opposite Tom Wilkinson and Barry Pepper. GQ's Tom Carson said Houde's performance was \"a terrific Sam Giancana (Serge Houde, and where has this formidable actor been all of Martin Scorsese's life?). It will probably set off Camelot guardians' alarm bells to hear that Giancana, the Chicago Mob boss, appears at all—and tête-à-tête with papa Joe, who's committing hubris's fatal error by negotiating with him.\" Houde began acting at age 35, and he has over 160 film and TV productions to his credit.\n\nBesides his role as Sam Giancana in The Kennedys, Houde also appeared in the Seth Rogen-starring feature, 50/50, which premiered at the Toronto International Film Festival in 2011. In it, he played Joseph Gordon-Levitt's character's father and Anjelica Huston's character's husband; his character suffered from Alzheimer's. He also starred as The Doctor in episode 9 of Mortal Kombat: Legacy, Kevin Tancharoen's web series anthology inspired by the popular video game of the same name. In 2014, Houde received a Leo Award nomination for Best Guest Performance by a Male in a Dramatic Series for his role as drug kingpin David Thorpe on CTV's undercover cop series Played. The following year, he attracted attention for his moving portrayal of a homeless man suffering from Tourette's in the hit Canadian police drama 19-2.",
        "birthday": "1953-02-16",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.sergehoude.com/",
        "id": 41746,
        "imdb_id": "nm0396369",
        "known_for_department": "Acting",
        "name": "Serge Houde",
        "place_of_birth": "Québec, Canada",
        "popularity": 0.2193,
        "profile_path": "/40T7A9D9ts3tBP7aKjyJImY5tMZ.jpg"
    }
}