{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jZ9lWWCnV5gBRe29PpzEXNgf8i8.jpg",
                "genre_ids": [
                    18
                ],
                "id": 11093,
                "original_language": "en",
                "original_title": "House of Sand and Fog",
                "overview": "Behrani, an Iranian immigrant buys a California bungalow, thinking he can fix it up, sell it again, and make enough money to send his son to college. However, the house is the legal property of former drug addict Kathy. After losing the house in an unfair legal dispute with the county, she is left with nowhere to go. Wanting her house back, she hires a lawyer and befriends a police officer. Neither Kathy nor Behrani have broken the law, so they find themselves involved in a difficult moral dilemma.",
                "popularity": 2.3344,
                "poster_path": "/hLxSOukLfC4j5pNbdE7lqaw8KgL.jpg",
                "release_date": "2003-12-19",
                "title": "House of Sand and Fog",
                "video": false,
                "vote_average": 7.149,
                "vote_count": 791,
                "character": "Tran",
                "credit_id": "659e353ffc5f060200a50ab8",
                "order": 18
            },
            {
                "adult": false,
                "backdrop_path": "/1pOp56fSV4XySjaGrhb6NPD2n4r.jpg",
                "genre_ids": [
                    18,
                    36,
                    28
                ],
                "id": 10423,
                "original_language": "en",
                "original_title": "Dragon: The Bruce Lee Story",
                "overview": "This film is a glimpse into the life, love and the unconquerable spirit of the legendary Bruce Lee. From a childhood of rigorous martial arts training, Lee realizes his dream of opening his own kung-fu school in America. Before long, he is discovered by a Hollywood producer and begins a meteoric rise to fame and an all too short reign as one the most charismatic action heroes in cinema history.",
                "popularity": 2.7371,
                "poster_path": "/lxhsdC8wuGgQf0gKCt8wyHHxGcQ.jpg",
                "release_date": "1993-05-07",
                "title": "Dragon: The Bruce Lee Story",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 768,
                "character": "Principal Elder",
                "credit_id": "5968bac7c3a36879cb01ce3e",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Assing \"Aki\" Aleong",
            "Leonard Gonzales"
        ],
        "biography": "Aki Aleong's career has spanned more than 60 years as an actor, singer, writer, producer and activist. He has served on the National Board of the Screen Actors Guild, appointed National Chair of SAG'S EEOC and was a member of the President's Diversity/Affirmative Action Task Force. Aki has also been Executive Director of AIM (Asians in Media), Vice President of The Media Coalition of Los Angeles and President of MANAA (Media Action Network for Asian-Americans). Among Aki's numerous awards is an Honorary Doctorate from New Dimensions University in 2013.\n\nAki's legendary career started on Broadway in \"Teahouse of the August Moon\" and \"The Interview.\" He went on to star in more than 50 movies and 150 television shows and has worked with Academy Award-winners Frank Sinatra Jr., Marlon Brando, Faye Dunaway, Joanne Woodward, Steve McQueen, Ben Kingsley, John Mills, Ernest Borgnine, Jennifer Connelly and Martin Landau. Aki has worked with Directors William Wyler {3 time Oscar winner}, John Sturges and Martin Ritt. Other notable stars with whom Aki has worked include Roger Moore, Bill Cosby, Peter Lawford, Tony Randall, Gina Lollobrigida, Chuck Norris, Olivia Hussey, Pierce Brosnan and others, many of whom have been the recipients of Golden Globes, DGA, WGA, SAG, Cannes and similar prestigious awards. Aki's career also includes working with prominent Writers/Directors, including John Milius, Lionel Chetwynd, Philip Yordan, Mark Rydell and Nobel Peace Prize Winner Pearl S. Buck.\n\nAki also has experience as a record executive producer/artist. He was Chairman of FORE (The Fraternity of Recording Executives), an organization dedicated to bringing Executives of Color into the Music Industry. His other affiliations include President of Pan World Records and Golden Dragon Publishing companies. He was the National Director of Black Promotion for Polydor/Polygram Records and also worked with Liberty/UA Records and Capitol Records. He also produced records for Columbia Records, Capitol, Liberty/UA, Artista and other prominent labels. Aki, in fact, is the first Asian American to have a Top100 record, which he wrote and co-produced, on the National Charts in the US.\n\nAki's other accomplishments include NAAAP ( National Association of Asian American Professionals) membership, an Advisory Board Member of the US China Aids Foundation and a Judge for the Asian American Teens 2007-2008.\n\nAki is President of MANAA (Media Action Network for Asian Americans), Senior Advisor for Ace Studios Hong Kong and President of Mustard Seed Media Group, for which he wrote, directed and starred in \"Chinaman's Chance: America's Yellow Slaves.\" Aki's extensive background in the entertainment industry also includes the production of a wide variety of movies, videos and documentaries.",
        "birthday": "1934-12-19",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 41757,
        "imdb_id": "nm0018080",
        "known_for_department": "Acting",
        "name": "Aki Aleong",
        "place_of_birth": "Port of Spain, Trinidad, Trinidad and Tobago",
        "popularity": 0.1602,
        "profile_path": "/Aq3IiDVCgdiOc6nSpzCcmBJoZR4.jpg"
    }
}