{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3q35nBLCIdEbxYfsr7D5ocYQXKz.jpg",
                "genre_ids": [
                    18,
                    10751,
                    14
                ],
                "id": 1585,
                "original_language": "en",
                "original_title": "It's a Wonderful Life",
                "overview": "A holiday favourite for generations...  George Bailey has spent his entire life giving to the people of Bedford Falls.  All that prevents rich skinflint Mr. Potter from taking over the entire town is George's modest building and loan company.  But on Christmas Eve the business's $8,000 is lost and George's troubles begin.",
                "popularity": 6.3809,
                "poster_path": "/bSqt9rhDZx1Q7UZ86dBPKdNomp2.jpg",
                "release_date": "1946-12-20",
                "title": "It's a Wonderful Life",
                "video": false,
                "vote_average": 8.272,
                "vote_count": 4589,
                "character": "Nick",
                "credit_id": "52fe4301c3a36847f80335d9",
                "order": 26
            },
            {
                "adult": false,
                "backdrop_path": "/uYRnUnBE4kk5ocvyBckRfMAsZpJ.jpg",
                "genre_ids": [
                    12,
                    10749,
                    10752
                ],
                "id": 22584,
                "original_language": "en",
                "original_title": "To Have and Have Not",
                "overview": "A Martinique charter boat skipper gets mixed up with the underground French resistance operatives during WWII.",
                "popularity": 1.4842,
                "poster_path": "/m9RYIio23yClaO3fy5tcpYac1Gf.jpg",
                "release_date": "1945-01-20",
                "title": "To Have and Have Not",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 537,
                "character": "Lt. Coyo",
                "credit_id": "52fe4446c3a368484e019e9d",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "S.L. Bershad",
            "S. L. Bershad",
            "Sheldon Leonard Bershad"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nSheldon Leonard Bershad (February 22, 1907 – January 11, 1997) was an American film and television actor, producer, director, and writer.  Sheldon Leonard Bershad was born in Manhattan, New York City, the son of middle class Jewish parents Anna Levit and Frank Bershad. He graduated from Syracuse University in 1929.\n\nAs an actor, Leonard specialized in playing supporting characters, especially gangsters or \"heavies\", in films such as It's a Wonderful Life (1946; as bartender Nick), To Have and Have Not (1944), Guys and Dolls (1955), and Open Secret (1948). His trademark was his especially thick New York accent, usually delivered from the side of his mouth. In Decoy (1946), Leonard uses his \"heavy\" persona to create the hard-boiled police detective Joe Portugal.\n\nOn radio from 1945 to 1955, Leonard played an eccentric racetrack tout on The Jack Benny Program and later in the TV series of the same name. His role was to salute Benny out of the blue in railroad stations, on street corners, or in department stores (\"Hey Bud. C'mere a minute.\"), ask Benny what he was about to do, and then proceed to try to argue him out of his course of action by resorting to inane and irrelevant racing logic. As \"The Tout,\" he never gave out information on horse racing, unless Jack demanded it. One excuse the tout gave was, \"Who knows about horses?\"\n\nLeonard was part of the cast of voice actors on the Damon Runyon Theatre radio show (1948-1949). He was part of the ensemble cast of the Martin and Lewis radio show. He also appeared frequently on The Adventures of the Saint, often playing gangsters and heavies, but also sometimes in more positive roles. Leonard was also a regular on the radio comedy series The Adventures of Maisie in the 1940s. During the 1950s, Leonard provided the voice of lazy fat cat Dodsworth in two Warner Bros. Merrie Melodies cartoons directed by Robert McKimson.  In the adventure movie The Iroquois Trail (1950), Leonard played against type in the significant role of Chief Ogane, a Native American warrior, who pursues and fights the frontiersman Nat \"Hawkeye\" Cutler (George Montgomery) in a climactic duel to the death with knives.\n\nLater in the 1950s and 1960s, he established a reputation as a producer of successful television series, including The Danny Thomas Show (aka Make Room For Daddy) (1953–64), The Andy Griffith Show (1960–68), Gomer Pyle U.S.M.C. (1964–69), The Dick Van Dyke Show (1961–66), and I Spy (1965–68). He also directed several TV series episodes, including four of the first eight episodes of the TV series Lassie (Season 1, 1954). Leonard also provided the voice of Linus the Lionhearted in a series of Post Crispy Critters cereal TV commercials in 1963-64, which led to a Linus cartoon series that aired on Saturday (and later, Sunday) mornings on CBS (1964–66) and ABC (1967–69). He also was briefly the star of his own television show Big Eddie (1975), where he played the owner of a large sports arena. The show lasted for only ten episodes.",
        "birthday": "1907-02-22",
        "deathday": "1997-01-10",
        "gender": 2,
        "homepage": null,
        "id": 41750,
        "imdb_id": "nm0502766",
        "known_for_department": "Acting",
        "name": "Sheldon Leonard",
        "place_of_birth": "Manhattan, New York City, New York, USA",
        "popularity": 0.2629,
        "profile_path": "/eNJbTTD9NOQNdXS5TBAkm5Iq9v0.jpg"
    }
}