{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/pMBKzEotLUzk3NuQiyVjZEDlH70.jpg",
                "genre_ids": [
                    18,
                    10402,
                    10749
                ],
                "id": 69,
                "original_language": "en",
                "original_title": "Walk the Line",
                "overview": "A chronicle of country music legend Johnny Cash's life, from his early days on an Arkansas cotton farm to his rise to fame with Sun Records in Memphis, where he recorded alongside Elvis Presley, Jerry Lee Lewis and Carl Perkins.",
                "popularity": 2.7034,
                "poster_path": "/p8lPTjvjOjTfvC1E9pmMwcF9vkn.jpg",
                "release_date": "2005-09-13",
                "title": "Walk the Line",
                "video": false,
                "vote_average": 7.498,
                "vote_count": 2989,
                "character": "Ray Cash",
                "credit_id": "52fe4213c3a36847f8001f67",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/vINgGecnz95iDL6fjQMARDsocgG.jpg",
                "genre_ids": [
                    28,
                    53,
                    878
                ],
                "id": 280,
                "original_language": "en",
                "original_title": "Terminator 2: Judgment Day",
                "overview": "Ten years after the events of the original, a reprogrammed T-800 is sent back in time to protect young John Connor from the shape-shifting T-1000. Together with his mother Sarah, he fights to stop Skynet from triggering a nuclear apocalypse.",
                "popularity": 13.7182,
                "poster_path": "/weVXMD5QBGeQil4HEATZqAkXeEc.jpg",
                "release_date": "1991-07-03",
                "title": "Terminator 2: Judgment Day",
                "video": false,
                "vote_average": 8.133,
                "vote_count": 13562,
                "character": "T-1000",
                "credit_id": "52fe4231c3a36847f800b29b",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/jfxTTQqb9FRUPDLMn5BUWVvVsKf.jpg",
                "genre_ids": [
                    12,
                    18,
                    10751
                ],
                "id": 1265,
                "original_language": "en",
                "original_title": "Bridge to Terabithia",
                "overview": "Jesse Aarons trained all summer to become the fastest runner in school. So he's very upset when newcomer Leslie Burke outruns him and everyone else. Despite this and other differences including that she's rich, he's poor, she's a city girl, and he's a country boy the two become fast friends. Together they create Terabithia, a land of monsters, trolls, ogres, and giants where they rule as king and queen.",
                "popularity": 8.8539,
                "poster_path": "/3xFxGodKPMFLheS8rujFSmLfcq4.jpg",
                "release_date": "2007-02-15",
                "title": "Bridge to Terabithia",
                "video": false,
                "vote_average": 7.307,
                "vote_count": 5002,
                "character": "Jack Aarons",
                "credit_id": "52fe42ebc3a36847f802ceb9",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/cDtefl7KGnKrDziEUXetMnztvqr.jpg",
                "genre_ids": [
                    28,
                    53
                ],
                "id": 1573,
                "original_language": "en",
                "original_title": "Die Hard 2",
                "overview": "One year after his heroics in Los Angeles, John McClane is an off-duty cop who is the wrong guy in the wrong place at the wrong time. On a snowy Christmas Eve, as he waits for his wife's plane to land at Washington Dulles International Airport, terrorists take over the air traffic control system in a plot to free a South American army general and drug smuggler being flown into the US to face drug charges. It's now up to McClane to take on the terrorists, while coping with an inept airport police chief, an uncooperative anti-terrorist squad, and the life of his wife and everyone else trapped in planes circling overhead.",
                "popularity": 10.1465,
                "poster_path": "/lDFO7D4MdbhjOwaPwe18QG69Rt0.jpg",
                "release_date": "1990-07-03",
                "title": "Die Hard 2",
                "video": false,
                "vote_average": 6.959,
                "vote_count": 6088,
                "character": "O'Reilly",
                "credit_id": "52fe42ffc3a36847f8032a81",
                "order": 15
            },
            {
                "adult": false,
                "backdrop_path": "/ebcXKfXz3ly9TXh5Anef8LYhfEn.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 87825,
                "original_language": "en",
                "original_title": "Trouble with the Curve",
                "overview": "Slowed by age and failing eyesight, crack baseball scout Gus Lobel takes his grown daughter along as he checks out the final prospect of his career. Along the way, the two renew their bond, and she catches the eye of a young player-turned-scout.",
                "popularity": 5.3546,
                "poster_path": "/zLZQVmxOj5kICbS5Pq7rB1cbPvP.jpg",
                "release_date": "2012-09-21",
                "title": "Trouble with the Curve",
                "video": false,
                "vote_average": 6.995,
                "vote_count": 1643,
                "character": "Vince",
                "credit_id": "52fe49da9251416c910baf03",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/g27PNNr3GNo72hf86KIHjzx66H4.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 226857,
                "original_language": "en",
                "original_title": "Endless Love",
                "overview": "A privileged girl and a charismatic boy's instant desire sparks a love affair made only more reckless by parents trying to keep them apart.",
                "popularity": 4.082,
                "poster_path": "/z7FZP6uivgVc4t0mnmia0B8YygW.jpg",
                "release_date": "2014-02-12",
                "title": "Endless Love",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 1714,
                "character": "Harry Elliot",
                "credit_id": "52fe4e8a9251416c75159de1",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ρόμπερτ Πάτρικ",
            "رابرت پاتریک",
            "Robert Hammond Patrick Jr."
        ],
        "biography": "Robert Hammond Patrick was born in Marietta, Georgia, raised there and Boston, Mass., Dayton, Ohio, Detroit, Michigan, and Cleveland, Ohio. The eldest of five children. He attended the Bowling Green State University in Ohio, but dropped out after he took a drama course and became interested in acting. After leaving college, he took a job as a house painter and continued as such until a boating accident in Lake Erie in 1984. He swam for three hours in order to save the others still stranded on the accident site, while he nearly drowned in his attempt. After the accident, he moved from Ohio to Los Angeles, California. He worked in a bar to supplement his income and even lived in his own car.\n\nPatrick starred in various direct-to-video television movies, and had a short appearance in Die Hard 2 (1990). His breakthrough role came as the liquid-metal, shape-shifting T-1000 in James Cameron's blockbuster Terminator 2: Judgment Day (1991). After that, he landed roles in various feature films such as Last Action Hero (1993), Fire in the Sky (1993) and Striptease (1996). His performance in Fire in the Sky caught the attention of Chris Carter, creator of the television series The X-Files (1993). After David Duchovny distanced himself from the series during its seventh season, Patrick was cast as FBI Special Agent John Doggett.\n\nOn the small screen, Robert was a series regular on Season Six of HBO's True Blood (2008) and also appeared in the final season. He had a memorable role in the final season of Sons of Anarchy (2008), did a cameo role on the sitcom Community (2009), and had a supporting role in Season One on Robert Rodriguez's From Dusk Till Dawn: The Series (2014) for the El Rey Network. In Spring 2017, it was announced that Robert would have a featured role in Gale Anne Hurd's highly anticipated Amazon series Lore (2017), based on the popular horror podcast. Recent film credits include Universal Pictures' Identity Thief (2013) with Melissa McCarthy and Jason Bateman, Warner Brothers' Gangster Squad (2013) in which he played Josh Brolin's squad member going up against Sean Penn as Mickey Cohan, Trouble with the Curve (2012) opposite Clint Eastwood, Lovelace (2013) opposite Sharon Stone and Amanda Seyfried, Universal's remake of Endless Love (2014) with Alex Pettyfer and Gabriella Wilde, Focus Features' Kill the Messenger (2014) opposite Jeremy Renner, and The Road Within (2014) with Kyra Sedgwick and Zoë Kravitz.\n\nIn addition to his acting success, Patrick is a lifelong supporter of the military and the USO. The grandson of an Army veteran who served during World Wars I and II and the Korean War, Patrick grew up with a profound respect for troops. Devoted to giving back, he regularly goes on USO hospital visits and has participated in four USO tours in seven countries since 2008, visiting more than 8,100 service members and military families. He is a passionate Harley-Davidson enthusiast and is co-owner of Harley-Davidson of Santa Clarita. He currently resides in Los Angeles, California with his wife, Barbara and their two children.",
        "birthday": "1958-11-05",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 418,
        "imdb_id": "nm0001598",
        "known_for_department": "Acting",
        "name": "Robert Patrick",
        "place_of_birth": "Marietta, Georgia, USA",
        "popularity": 2.3075,
        "profile_path": "/qRv2Es9rZoloullTbzss3I5j1Mp.jpg"
    }
}