{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/538U9snNc2fpnOmYXAPUh3zn31H.jpg",
                "genre_ids": [
                    28,
                    12,
                    53
                ],
                "id": 575265,
                "original_language": "en",
                "original_title": "Mission: Impossible - The Final Reckoning",
                "overview": "Ethan Hunt and team continue their search for the terrifying AI known as the Entity — which has infiltrated intelligence networks all over the globe — with the world's governments and a mysterious ghost from Hunt's past on their trail. Joined by new allies and armed with the means to shut the Entity down for good, Hunt is in a race against time to prevent the world as we know it from changing forever.",
                "popularity": 174.6469,
                "poster_path": "/z53D72EAOxGRqdr7KXXWp9dJiDe.jpg",
                "release_date": "2025-05-17",
                "title": "Mission: Impossible - The Final Reckoning",
                "video": false,
                "vote_average": 7.287,
                "vote_count": 1766,
                "character": "SSGN Ohio - Crew",
                "credit_id": "682b410bb600b5be458c081e",
                "order": 64
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Andrew Boateng is the writer of 2024 Film Tribal Mark directed by Skepta and Hector Dockrill. He was honored with the Warner Media Scholarship for an MA in TV Fiction Writing at Glasgow Caledonian University, and also holds an MA in Creative Writing from London Metropolitan University.\n\nHis writing has been recognized at the Edinburgh TV Festival's New Voice Awards, where he won the Best Test Card Pilot, and he was also shortlisted for the 2020 Red Planet Prize. Andrew's works, while rich in depth and cultural nuance, underscore his dedication to authentic storytelling.\n\nAs an actor, he made a noteworthy appearance in Abraham Adeyemi's 'Chasing the Night' (Film4), sharing the screen with talents Sope Dirisu and Deborah Ayorinde. He also starred in Comedy Central's \"Dating Horror Stories\" Episode 2 (Blast From The Past) alongside Kyrah Gray and Kiell Smith-Bynoe.",
        "birthday": "1988-09-01",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.curtisbrown.co.uk/client/andrew-boateng",
        "id": 4181285,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Andrew Prince Boateng",
        "place_of_birth": "Enfield, London, England",
        "popularity": 0.0214,
        "profile_path": "/o40NuGvGsM47utIDxxdzpXyxpnx.jpg"
    }
}