{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mQsMFca19fZsLKMc6x5FjwncTYh.jpg",
                "genre_ids": [
                    28,
                    12,
                    53
                ],
                "id": 1672,
                "original_language": "fr",
                "original_title": "Le Professionnel",
                "overview": "French secret service agent Josselin Beaumont is dispatched to take down African warlord N'Jala. But when his assignment is canceled, he's shocked to learn that his government is surrendering him to local authorities. He is given a mock trial and sentenced to 20 years of hard labor. But Beaumont escapes from prison and vows not only to avenge himself against his betrayers but also to finish his original assignment.",
                "popularity": 2.8682,
                "poster_path": "/dhAZ8T0tTlTNw3D7Cn8wc87sk1w.jpg",
                "release_date": "1981-10-21",
                "title": "The Professional",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 556,
                "character": "L'infirmier au procès",
                "credit_id": "5410aa1dc3a3681acd000494",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Serge Nubret (6 October 1938 – 19 April 2011) was a French professional bodybuilder, actor and self published author. He won numerous bodybuilding competitions, including 1976 NABBA Mr. Universe (1976). Serge Nubret was nicknamed \"The Black Panther\".\n\nSerge Nubret was born on 6 October 1938 in Anse-Bertrand, Guadeloupe. Nubret has credited Steve Reeves as his childhood inspiration.\n\nIn 1960 Nubret joined the International Federation of Bodybuilders, and was declared World's Most Muscular Man in Montreal. Nubret kept improving, winning titles including NABBA Mr. Universe in 1976 (London), WBBG Pro. Mr. World and Mr. Olympus in 1977 (New York) and another World champion title in 1981 (Geneva). In 1983, 23 years after his first world-class achievement he became the WABBA World Champion in Rome, winning his fifth major title. At 65 years old, Nubret offered a last show to his public during the 2003 World championships in France.\n\nIn addition to being recognized by experts, peers and fans as a reference in the bodybuilding field, Nubret has also dedicated himself to the development and promotion of bodybuilding. He became the head of the France and European IFBB bodybuilding federations from 1970 to 1975. In 1975 he founded the World Amateur Body Building Association (WABBA) to host amateur bodybuilding competitions. Serge Nubret would appear in several minor film projects during his career. Nubret was also featured in the 1977 documentary, Pumping Iron about Arnold Schwarzenegger.\n\nNubret was known for an unusual training regimen and an even more unusual diet, which often consisted of four pounds of horse meat per day.\n\nIn 2006, the 68-year-old Nubret penned an autobiography Je suis...Moi &Dieu (I am…Me and God) in collaboration with Louis-Xavier Babin-Lachaud. The book which only exists in French tells his life story and his Christian beliefs.\n\nNubret was father to three daughters (Pascale, Karine and Grace) and a son (Stanley) from two marriages and one relationship. His second marriage was with Jacqueline Nubret, a female bodybuilder with various competition titles.\n\nIn March 2009, Nubret fell into a coma, eventually dying on April 19, 2011 of natural causes.\n\nSource: Article \"Serge Nubret\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1938-10-06",
        "deathday": "2011-04-19",
        "gender": 2,
        "homepage": null,
        "id": 41949,
        "imdb_id": "nm0637704",
        "known_for_department": "Acting",
        "name": "Serge Nubret",
        "place_of_birth": "Anse-Bertrand, Guadeloupe, France",
        "popularity": 0.0898,
        "profile_path": null
    }
}