{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9VJh0YPms8QM8GYDvt5wtmRsCU5.jpg",
                "genre_ids": [
                    10402,
                    35,
                    10749
                ],
                "id": 13320,
                "original_language": "en",
                "original_title": "Funny Face",
                "overview": "A shy Greenwich Village book clerk is discovered by a fashion photographer and whisked off to Paris where she becomes a reluctant model.",
                "popularity": 1.8633,
                "poster_path": "/tzTjalpIz6NyFrWPPlOBFoBjb7z.jpg",
                "release_date": "1957-02-13",
                "title": "Funny Face",
                "video": false,
                "vote_average": 6.975,
                "vote_count": 708,
                "character": "Paul Duval",
                "credit_id": "52fe455b9251416c75053ab9",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia.\n\nRobert Flemyng OBE, MC (3 January 1912 – 22 May 1995) was a British film and stage actor.\n\nFlemyng was born in Liverpool, the son of a doctor, and was educated at Haileybury. He began his career as a medical student before abandoning medicine to become an actor. Flemyng made his stage debut in the early 1930s, and worked steadily in both London and Broadway. His first film appearance was in 1937, but he didn't appear steadily in films until after he served in World War II. During the war he was commissioned into the Royal Army Medical Corps and served with great distinction, reaching the rank of full colonel at the age of 33. He was awarded the Military Cross in 1941, mentioned in despatches, and was appointed OBE in 1944.\n\nHe played the idealistic schoolmaster in the 1948 Roy Boulting film, The Guinea Pig, starring Richard Attenborough, and the key role of Detective Sergeant Roberts in the 1950 film The Blue Lamp.\n\nOne memorable role was as a necrophiliac in the film The Horrible Dr. Hichcock in 1962. He ably played a sardonic British Secret Intelligence Service chief (his boss being George Sanders) in the 1966 film The Quiller Memorandum. The character actor worked in films and television until his death in 1995. Some of his later films include Kafka (1991) and Shadowlands (1993).\n\nDescription above from the Wikipedia article Robert Flemyng, licensed under CC-BY-SA, full list of contributors on Wikipedia.​",
        "birthday": "1912-01-03",
        "deathday": "1995-05-22",
        "gender": 2,
        "homepage": null,
        "id": 41958,
        "imdb_id": "nm0281866",
        "known_for_department": "Acting",
        "name": "Robert Flemyng",
        "place_of_birth": "Liverpool, England, UK",
        "popularity": 0.1655,
        "profile_path": "/iD3fCCy38wgxpUlNwMR25L30h3l.jpg"
    }
}