{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/l7XRMURNroPYajcqLlWxyzUlucW.jpg",
                "genre_ids": [
                    28,
                    18,
                    36
                ],
                "id": 1579,
                "original_language": "en",
                "original_title": "Apocalypto",
                "overview": "Set in the Mayan civilization, when a man's idyllic presence is brutally disrupted by a violent invading force, he is taken on a perilous journey to a world ruled by fear and oppression where a harrowing end awaits him. Through a twist of fate and spurred by the power of his love for his woman and his family he will make a desperate break to return home and to ultimately save his way of life.",
                "popularity": 10.7893,
                "poster_path": "/cRY25Q32kDNPFDkFkxAs6bgCq3L.jpg",
                "release_date": "2006-12-07",
                "title": "Apocalypto",
                "video": false,
                "vote_average": 7.594,
                "vote_count": 5883,
                "character": "Drunkards Four",
                "credit_id": "52fe4300c3a36847f8033065",
                "order": 22
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "BERNARDO RUIZ is a two-time Emmy® Award-nominated documentary director/producer and member of the Academy of Motion Pictures Arts and Sciences. He has directed and produced four feature documentaries through his production company, Quiet Pictures. He has also directed and produced a host of nonfiction programming (including docu-series) for outlets as varied as Disney+, ESPN, HBO, VICE and PBS.  His credits as director include THE INFINITE RACE (ESPN’s 30 for 30, 2020), HARVEST SEASON (Independent Lens, 2018), KINGDOM OF SHADOWS (PARTICIPANT MEDIA, POV, 2016),  and  REPORTERO, (POV, 2013).\n\nOn the television side, Ruiz wrote, directed and produced ROBERTO CLEMENTE (American Experience, 2008) which was awarded the NCLR (now UnidosUS), “Alma” Award for “Outstanding Made for Television Documentary.\" He also created, directed and executive produced the two part bilingual PBS series, THE GRADUATES/LOS GRADUADOS  (Independent Lens, 2013). Edutopia called it “a winner that should be seen by as many students, teachers and parents as possible.”  Most recently, he wrote, directed and produced the 2020 election special, LATINO VOTE: DISPATCHES FROM THE BATTLEGROUND.\n\nRuiz frequently serves as a mentor to emerging makers and has recently worked with Firelight Media, DCTV and the the Future of Science Fellowship to support new documentary makers. In the fall of 2015, Ruiz was a filmmaker-in-residence at the Investigative Reporting Program (IRP) at the U.C. Berkeley Graduate School of Journalism. Previously he served on the board of the National Association of Latino Independent Producers (NALIP).  He currently serves on the advisory board of the Full Frame Documentary Film Festival.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://bernardoruiz.com/",
        "id": 42016,
        "imdb_id": "nm2460297",
        "known_for_department": "Directing",
        "name": "Bernardo Ruiz",
        "place_of_birth": null,
        "popularity": 0.0214,
        "profile_path": "/3YFpImZsDYM9Ow3BXFCnpUWGUK1.jpg"
    }
}