{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fzZmcKQv7ZTGIiPvocPhNs3wUyK.jpg",
                "genre_ids": [
                    18,
                    10749,
                    14
                ],
                "id": 122906,
                "original_language": "en",
                "original_title": "About Time",
                "overview": "The night after another unsatisfactory New Year's party, Tim's father tells his son that the men in his family have always had the ability to travel through time. They can't change history, but they can change what happens and has happened in their own lives. Thus begins the start of a lesson in learning to appreciate life itself as it is, as it comes, and most importantly, the people living alongside us.",
                "popularity": 7.7462,
                "poster_path": "/iR1bVfURbN7r1C46WHFbwCkVve.jpg",
                "release_date": "2013-09-04",
                "title": "About Time",
                "video": false,
                "vote_average": 7.913,
                "vote_count": 8873,
                "character": "Pret a Manger Server",
                "credit_id": "64d76b2ff495ee028f6412d5",
                "order": 39
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Rebecca Chew is an Actress known for About Time. Rebecca wasn't even thinking about an acting career when she was plucked from obscurity by Richard Curtis. She was working at a restaurant in Cornwall, where Curtis was filming his new comedy About Time, when she served the director and his family pizza. A month later she was shocked to be offered a small but important role — as a restaurant worker. Chew, 18, who had just finished studying for a singing diploma, was offered the part because she was “so sweet”, Curtis said at the launch of the time-travel comedy in St Austell, Cornwall. “This was just typical of the reception we received — people were so nice that we wanted to take them with us.”",
        "birthday": "1995-01-01",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 4210447,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Rebecca Chew",
        "place_of_birth": "Bodmin, Cornwall, England, UK",
        "popularity": 0.0404,
        "profile_path": "/f8luZbq0kLjMifd05Wt3pCKprKA.jpg"
    }
}