{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rhrBU761a5B4w7hhpA9og3fNBCH.jpg",
                "genre_ids": [
                    18
                ],
                "id": 8440,
                "original_language": "pt",
                "original_title": "Carandiru",
                "overview": "When a doctor decides to carry out an AIDS prevention program inside Latin America’s largest prison: the Casa de Detenção de São Paulo - Carandiru, he meets the future victims of one of the darkest days in Brazilian History when the State of São Paulo’s Military Police, with the excuse for law enforcement, shot to death 111 people. Based on real facts and on the book written by Dráuzio Varella.",
                "popularity": 2.4464,
                "poster_path": "/kKAgIMwQWQ6u4s0c56XKSDX3vAs.jpg",
                "release_date": "2003-03-21",
                "title": "Carandiru",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 570,
                "character": "Chico",
                "credit_id": "52fe44a9c3a36847f80a2ded",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/1ntQDvwCw74W5ehIicODzQh2dTB.jpg",
                "genre_ids": [
                    18
                ],
                "id": 245913,
                "original_language": "en",
                "original_title": "Pelé: Birth of a Legend",
                "overview": "The life story of Brazilian football legend, Pele.",
                "popularity": 4.9485,
                "poster_path": "/b1XoAl8TJi7zbKO3GUzRUBrpSxq.jpg",
                "release_date": "2016-05-06",
                "title": "Pelé: Birth of a Legend",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1115,
                "character": "Waldemar de Brito",
                "credit_id": "576aecce9251410c96000183",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Milton Gonçalves OMC (Monte Santo de Minas, December 9, 1933 – Rio de Janeiro, May 30, 2022) was a Brazilian actor, director, singer, voice actor and producer. He's one of the most famous black actors in Brazil, having collaborated twice with acclaimed director Hector Babenco.\n\nGonçalves started his career in São Paulo, in an amateur group. As he moved to a professional group, he met Augusto Boal, who was looking for an actor to play an old black man. Joining Boal's Teatro de Arena, Milton Gonçalves found an open environment for political, philosophical and artistic discussion, where he was not discriminated for his race.\n\nGonçalves wrote four plays, one of which was staged by the Teatro Experimental do Negro and directed by Dalmo Ferreira. \"There I learnt everything I know about Theater. It was fundamental for my comprehension of the world.\"\n\nA Black Movement activist, Milton Gonçalves tried a political career, in the 1990s, as a candidate to Rio de Janeiro state governorship.\n\nFather of actor Maurício Gonçalves, he is married to Oda Gonçalves since 1966.",
        "birthday": "1933-12-09",
        "deathday": "2022-05-30",
        "gender": 2,
        "homepage": null,
        "id": 42125,
        "imdb_id": "nm0328604",
        "known_for_department": "Acting",
        "name": "Milton Gonçalves",
        "place_of_birth": "Monte Santo de Minas, Brazil",
        "popularity": 0.0826,
        "profile_path": "/4ikyHa36jV22phvbhgS8YfTjLAt.jpg"
    }
}