{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/x29PYzoNYPGzdj3M8FDwSwEgNpf.jpg",
                "genre_ids": [
                    35,
                    80,
                    9648,
                    53
                ],
                "id": 5236,
                "original_language": "en",
                "original_title": "Kiss Kiss Bang Bang",
                "overview": "A petty thief posing as an actor is brought to Los Angeles for an unlikely audition and finds himself in the middle of a murder investigation along with his high school dream girl and a detective who's been training him for his upcoming role...",
                "popularity": 2.3875,
                "poster_path": "/aWfjIkpENFX6Uw82pET7EQ6jnrd.jpg",
                "release_date": "2005-09-14",
                "title": "Kiss Kiss Bang Bang",
                "video": false,
                "vote_average": 7.163,
                "vote_count": 2833,
                "character": "Pistol Woman",
                "credit_id": "52fe43fec3a36847f807c3e9",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Martha Hackett, born February 21, 1961, in Boston, Massachusetts, is an American actress best known for her recurring role as Seska on the television series \"Star Trek: Voyager,\" where she appeared in thirteen episodes. She is an alumna of Harvard University/Radcliffe College and holds an MFA in Acting from the University of Southern California. Early in her Star Trek career, she auditioned for the role of Jadzia Dax in \"Star Trek: Deep Space Nine\" but ultimately was cast as Seska, a complex Bajoran Maquis crew member who was later revealed to be a Cardassian spy. Her character's storyline included her pregnancy, which was integrated into the show due to Hackett's own pregnancy at the time.\n\nBeyond Star Trek, Hackett has had a varied career with roles across film, television, and stage. Her filmography includes movies like \"Alexander and the Terrible, Horrible, No Good, Very Bad Day\" (2014), \"Kiss Kiss Bang Bang\" (2005), and \"The Bye Bye Man\" (2017). On television, she has appeared in shows such as \"Days of Our Lives,\" \"NCIS,\" and \"Masters of Sex.\" Hackett has also lent her voice to video games within the Star Trek franchise.\n\nShe was married to independent filmmaker Tim Disney, with whom she has two children. Martha Hackett remains active in the entertainment industry, noted for her versatility in both genre and dramatic roles across multiple media",
        "birthday": "1961-02-21",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 42165,
        "imdb_id": "nm0352485",
        "known_for_department": "Acting",
        "name": "Martha Hackett",
        "place_of_birth": "Boston, Massachusetts, USA",
        "popularity": 0.8965,
        "profile_path": "/iLnjJ6HcQcV0eyTUidiKFjV5US1.jpg"
    }
}