{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/vL5LR6WdxWPjLPFRLe133jXWsh5.jpg",
                "genre_ids": [
                    28,
                    12,
                    14,
                    878
                ],
                "id": 19995,
                "original_language": "en",
                "original_title": "Avatar",
                "overview": "In the 22nd century, a paraplegic Marine is dispatched to the moon Pandora on a unique mission, but becomes torn between following orders and protecting an alien civilization.",
                "popularity": 23.1187,
                "poster_path": "/gKY6q7SjCkAU6FqvqWybDYgUKIF.jpg",
                "release_date": "2009-12-15",
                "title": "Avatar",
                "video": false,
                "vote_average": 7.594,
                "vote_count": 32617,
                "character": "Venture Star Crew Chief",
                "credit_id": "52fe48009251416c750aca63",
                "order": 14
            },
            {
                "adult": false,
                "backdrop_path": "/k3PqsPLkKLDyjZupZ6gqZHPxMv3.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 54138,
                "original_language": "en",
                "original_title": "Star Trek Into Darkness",
                "overview": "When the crew of the Enterprise is called back home, they find an unstoppable force of terror from within their own organization has detonated the fleet and everything it stands for, leaving our world in a state of crisis.  With a personal score to settle, Captain Kirk leads a manhunt to a war-zone world to capture a one man weapon of mass destruction. As our heroes are propelled into an epic chess game of life and death, love will be challenged, friendships will be torn apart, and sacrifices must be made for the only family Kirk has left: his crew.",
                "popularity": 6.0336,
                "poster_path": "/7XrRkhMa9lQ71RszzSyVrJVvhyS.jpg",
                "release_date": "2013-05-05",
                "title": "Star Trek Into Darkness",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 9340,
                "character": "U.S.S. Vengeance Officer",
                "credit_id": "546921fd22136e68cf0017bb",
                "order": 34
            },
            {
                "adult": false,
                "backdrop_path": "/cq9N64ucEtfIc3eMxNr1VzY9LH9.jpg",
                "genre_ids": [
                    18
                ],
                "id": 37799,
                "original_language": "en",
                "original_title": "The Social Network",
                "overview": "In 2003, Harvard undergrad and computer programmer Mark Zuckerberg begins work on a new concept that eventually turns into the global social network known as Facebook. Six years later, Mark is one of the youngest billionaires ever, but his unprecedented success leads to both personal and legal complications when he ends up on the receiving end of two lawsuits, one involving his former friend.",
                "popularity": 8.6898,
                "poster_path": "/n0ybibhJtQ5icDqTp8eRytcIHJx.jpg",
                "release_date": "2010-10-01",
                "title": "The Social Network",
                "video": false,
                "vote_average": 7.37,
                "vote_count": 12634,
                "character": "Maurice",
                "credit_id": "5643ecc1c3a36870ec003a1d",
                "order": 89
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Scott was born in Los Angeles and spent a lot of his childhood with his parents on picket lines campaigning for local civil rights. His father was the executive director of the University of Southern California,Community Services Center, and his mother worked for Operation Breadbasket and other organizations dedicated to improving economic conditions of black communities. After studying electrical engineering for two years at USC, he sat in on a friends acting class, was immediately bitten by the bug and auditioned for USC's Bachelor of Fine Arts acting conservatory the next semester. He started over as a freshman and completed the program in 1986. In 1987, Scott earned his SAG card on the feature film \"Punchline\". After several equity waiver plays and TV guest stars, Scott landed his first TV series regular role as Whoopi Goldberg's son on the short lived \"Bagdad Cafe\". The show ended in 1990 and after a few more years in Hollywood, Scott decided to pack up and move to New York to pursue his first love, the theatre. In NYC he worked in off and off-off Broadway shows and was invited into the elite Drama Department Theatre Company for which he performed Tennesee Williams' three character play, \"Kingdom of Earth\" with Cynthia Nixon and Peter Sarsgaard, directed by John Cameron Mitchell. Scott's proudest theater moment came when he was cast by Lloyd Richards to play Walter Lee in Lorraine Hansberry's, \"A Raisin in the Sun\". Lloyd fell sick but the production went on to rave reviews at Fords Theater in Washington DC, directed by Seret Scott in 1995. Scott stayed in New york for a few more years working in TV, film and theatre before returning to Los Angeles in 1998. In 1999, he was cast in a guest starring role on the pilot for the CBS drama, \"First Monday\". Producer/creator/ director, Don Bellasario admired his work enough to create the role of 'Cmdr. Sturgis Turner' for Scott on his long running, hit series \"JAG\". Scott played the role from 2000 to 2004, when the show was canceled. He continues to live and work in Hollywood, recent notable credits include \"The Social Network\" and James Cameron's \"Avatar\". Upcoming credits Include J.J. Abrams next \"Star Trek\" feature and \"The Host\", directed by Andrew Niccol. Both due for release in 2013. Scott is the very proud father of two sons, Morgan and Daniel.  - IMDb Mini Biography",
        "birthday": "1963-09-27",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 42317,
        "imdb_id": "nm0493013",
        "known_for_department": "Acting",
        "name": "Scott Lawrence",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.4088,
        "profile_path": "/8lwnmlHN6QPK75NwfufsIFZZhmB.jpg"
    }
}