{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/i4Fp0AJsqAzbeVQyCoG0adRRfdh.jpg",
                "genre_ids": [
                    28,
                    53
                ],
                "id": 11474,
                "original_language": "en",
                "original_title": "The Warriors",
                "overview": "Prominent gang leader Cyrus calls a meeting of New York's gangs to set aside their turf wars and take over the city. At the meeting, a rival leader kills Cyrus, but a Coney Island gang called the Warriors is wrongly blamed for Cyrus' death. Before you know it, the cops and every gangbanger in town is hot on the Warriors' trail.",
                "popularity": 3.4154,
                "poster_path": "/fCDXAJcPvpsMd5CL1kBKkkNGW3X.jpg",
                "release_date": "1979-02-01",
                "title": "The Warriors",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 2251,
                "character": "Baseball Fury",
                "credit_id": "64e9f55b1feac1011b2dc9c1",
                "order": 49
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "T.J. McNamara"
        ],
        "biography": "Thomas \"Tom\" J. McNamara is a former American Journalist based in Arizona. He was born and raised in New York City. He graduated from Fordham University with a degree in Communications and Broadcast Journalism.  He soon began finding work as an actor in commercials and radio. He was cast as one of the baseball furies in Walter Hill's Cult Classic, The Warriors (1979). In 1979 Tom got his first fulltime station job hosting PM Magazine at WNEP-TV in Scranton, PA. A year later he moved to Raleigh to join the WRAL team. After leaving Channel 5, Tom held on-air reporting and anchoring jobs in Oklahoma City and Phoenix before making his last move to Tucson in 1997. He was hired at KVOA-TV as that station’s 5, 6 and 10 pm anchor which he stayed until 2014. He has since become a realtor. He married Susan McMullen and they have 3 children.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 4235301,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Tom McNamara",
        "place_of_birth": "New York City, New York",
        "popularity": 0.0071,
        "profile_path": null
    }
}