{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/Z3ocAumcK9Iooc9BMlu7wE7XX9.jpg",
                "genre_ids": [
                    35,
                    10402,
                    10749,
                    18
                ],
                "id": 198277,
                "original_language": "en",
                "original_title": "Begin Again",
                "overview": "Gretta, a budding songwriter, finds herself alone after her boyfriend Dave ditches her. Her life gains purpose when Dan, a record label executive, notices her talent.",
                "popularity": 3.6112,
                "poster_path": "/qx4HXHXt528hS4rwePZbZo20xqZ.jpg",
                "release_date": "2014-07-03",
                "title": "Begin Again",
                "video": false,
                "vote_average": 7.234,
                "vote_count": 3868,
                "character": "Saul",
                "credit_id": "52fe4d769251416c91116e99",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/8YiAnbmo8ARHNVt25Cp5fVt4rNd.jpg",
                "genre_ids": [
                    99,
                    10402
                ],
                "id": 331781,
                "original_language": "en",
                "original_title": "Amy",
                "overview": "A documentary on the life of Amy Winehouse, the immensely talented yet doomed songstress. We see her from her teen years, where she already showed her singing abilities, to her finding success and then her downward spiral into alcoholism and drugs.",
                "popularity": 0.9667,
                "poster_path": "/qL0RepWSNUuZoeDXfyhqowVYhrn.jpg",
                "release_date": "2015-07-02",
                "title": "Amy",
                "video": false,
                "vote_average": 7.586,
                "vote_count": 1281,
                "character": "Self",
                "credit_id": "574d28ad92514101540009e7",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Black Star",
            "Flaco Bey",
            "Dante Bezé",
            "Bizet Dante",
            "Smith Dante",
            "Dante Smith",
            "Mos Def",
            "Crooklyn Dodgers",
            "Dante Smith-Beze"
        ],
        "biography": "Yasiin Bey (/jæˈsiːn ˈbeɪ/; born Dante Terrell Smith, December 11, 1973), formerly known as Mos Def, is an American retired rapper, singer-songwriter, and actor.\n\nRegarded as one of hip hop's most introspective and insightful artists, Mos Def, has shaped a career that transcends music genres and artistic medium. With the release of \"Universal Magnetic\" (1996), he became an underground favorite in the hip-hop world, leading to his legendary collaboration with Talib Kweli. The two formed Black Star whose debut album, Mos Def and Talib Kweli Are Black Star, would become one of the most critically acclaimed hip-hop albums. He followed with his 1999 solo debut, Black On Both Sides, which was certified gold and credited by critics as bringing hip hop back to its soapbox roots.\n\nHe was a former child actor in television films, sitcoms, and theater, and continued acting as an adult after launching his rap career. He appeared in Spike Lee's Bamboozled, MTV's Carmen: A Hip Hopera, 2002's critically acclaimed Monster's Ball, Showtime, and the 2002 romantic comedy Brown Sugar, for which he received an NAACP Image Award nomination. He hosted Def Poetry Jam from 2002 to 2007.\n\nHe completed his Broadway debut in 2002 in the Tony-nominated, Pulitzer Prize-winning, Topdog/Underdog. He then re-teamed with Topdog playwright, Suzan Lori Parks and director George Wolfe for the off-Broadway play Fucking A, for which he earned an Obie Award.\n\nIn 2003, he starred in The Italian Job alongside Ed Norton, Mark Wahlberg and Charlize Theron. In 2004, he starred opposite Alan Rickman in the critically acclaimed HBO movie Something the Lord Made, for which he received a 2004 Emmy Nomination for Outstanding Lead Actor In A Miniseries Or A Movie. He was also nominated for both a Golden Globe Award (Best Performance by an Actor in a Mini-Series or Motion Picture) and Golden Satellite Award (Best Actor in a Miniseries or a Motion Picture Made for Television) for the same role.\n\nHe continued his music career by releasing his highly anticipated and critically acclaimed sophomore solo release, The New Danger (2004). The first single, \"Sex, Love and Money\" earned him a 2005 Grammy nomination for Best Alternative/Urban Performance, and the album has been certified gold by the RIAA.\n\nThe following year, he appeared alongside Bruce Willis in the crime thriller 16 Blocks (2006), in Dave Chappelle’s Block Party, and had a cameo appearance in Talladega Nights: The Ballad of Ricky Bobby. Also in 2006, he released his third solo album, True Magic.\n\nThe next year, he appeared in the 2007 PBS historical documentary, Prince Among Slaves, and in 2008 he played the role of Chuck Berry in Cadillac Records. In 2009, he released the album The Ecstatic, which proved to be his second highest-charting album to date. He then appeared in the urban comedy Next Day Air, and (as himself) in the 2010 mockumentary film I’m Still Here, starring Joaquin Phoenix.\n\nMos Def announced in September of 2011 that he changed his name to Yasiin Bey, and would go by it henceforth. In the first month of 2016, Bey declared his retirement from both the film and music industries.\n\nIn 2014, About.com listed him 14th on its \"50 Greatest Rappers of All Time\".",
        "birthday": "1973-12-11",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 4239,
        "imdb_id": "nm0080049",
        "known_for_department": "Acting",
        "name": "Yasiin Bey",
        "place_of_birth": "Brooklyn, New York, USA",
        "popularity": 0.871,
        "profile_path": "/cu6pZ0ThtrT9Mo3l2cKk3UjYhmE.jpg"
    }
}