{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mGBmiWmi7JqeTWnrPicRbkXcsuO.jpg",
                "genre_ids": [
                    99
                ],
                "id": 410718,
                "original_language": "en",
                "original_title": "Before the Flood",
                "overview": "A look at how climate change affects our environment and what society can do to prevent the demise of endangered species, ecosystems, and native communities across the planet.",
                "popularity": 1.0583,
                "poster_path": "/u0EfH2zsp6rLOvEKVvWGgzGRQn3.jpg",
                "release_date": "2016-10-21",
                "title": "Before the Flood",
                "video": false,
                "vote_average": 7.687,
                "vote_count": 798,
                "character": "Self (archive footage)",
                "credit_id": "64f1862edbbb42011b711432",
                "order": 40
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Sen. Shelby"
        ],
        "biography": "Richard Craig Shelby (born May 6, 1934) is an American lawyer and politician who served as a United States senator from Alabama from 1987 to 2023. First elected to the U.S. Senate in 1986 as a Democrat who later switched to the Republican Party in 1994, he chaired the Senate Appropriations Committee from 2018 to 2021. He previously chaired the Senate Intelligence Committee, the Senate Banking Committee, and the Senate Rules Committee. He was the longest-serving U.S. senator from Alabama, surpassing John Sparkman's record in March 2019.\n\nBorn in Birmingham, Alabama, Shelby received his law degree from the Birmingham School of Law in 1961. He went on to serve as city prosecutor from 1963 to 1971. During this period he worked as a U.S. magistrate for the Northern District of Alabama (1966–1970) and Special Assistant Attorney General of Alabama (1969–1971). He won a seat in the Alabama Senate in 1970. In 1978, he was elected from the 7th district to the United States House of Representatives, where he was among a group of conservative Democrats known as the boll weevils.\n\nIn 1986, Shelby won a tight race as a Democrat for the U.S. Senate. In 1994, the day after the Republican Revolution in which the GOP gained the majority in Congress midway through President Bill Clinton's first term, Shelby switched parties and became a Republican. He was reelected by a large margin in 1998, facing no significant electoral opposition thereafter. He was the dean of Alabama's congressional delegation.\n\nIn February 2021, Shelby announced that he would not seek reelection in 2022. Katie Britt, his former chief of staff, won the election to succeed him.\n\nDue to his party switch, Shelby is the last Democrat to have held or won election to Alabama's Class 3 Senate seat.",
        "birthday": "1934-05-06",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.shelbyforsenate.com",
        "id": 4246688,
        "imdb_id": "nm2004012",
        "known_for_department": "Acting",
        "name": "Richard Shelby",
        "place_of_birth": "Birmingham, Alabama, USA",
        "popularity": 0.0338,
        "profile_path": "/A1A5kkpwjcwW4ehrU8JV67EwjQJ.jpg"
    }
}