{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/y1giivdsGLyo1LCvlsL6mLKyTZ7.jpg",
                "genre_ids": [
                    53,
                    18,
                    9648
                ],
                "id": 1018,
                "original_language": "en",
                "original_title": "Mulholland Drive",
                "overview": "Blonde Betty Elms has only just arrived in Hollywood to become a movie star when she meets an enigmatic brunette with amnesia. Meanwhile, as the two set off to solve the second woman's identity, filmmaker Adam Kesher runs into ominous trouble while casting his latest project.",
                "popularity": 9.3955,
                "poster_path": "/x7A59t6ySylr1L7aubOQEA480vM.jpg",
                "release_date": "2001-06-06",
                "title": "Mulholland Drive",
                "video": false,
                "vote_average": 7.808,
                "vote_count": 6652,
                "character": "Starlet (uncredited)",
                "credit_id": "67b7bf0e5503292756223e9e",
                "order": 71
            },
            {
                "adult": false,
                "backdrop_path": "/vxhnRV7jGncAZmf0FFHMs6rFHWn.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749,
                    10402
                ],
                "id": 9591,
                "original_language": "en",
                "original_title": "That Thing You Do!",
                "overview": "A Pennsylvania band scores a hit in 1964 and rides the star-making machinery as long as it can, with lots of help from its manager.",
                "popularity": 3.0815,
                "poster_path": "/9RmZu33qHdyZFGLfhEOmkTjdNEu.jpg",
                "release_date": "1996-10-04",
                "title": "That Thing You Do!",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 874,
                "character": "Go-Go Dancer (uncredited)",
                "credit_id": "67b7bf5cbc84d56cbeba33cd",
                "order": 56
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "埃莉娜·麦迪逊"
        ],
        "biography": "Elina Madison is from Cheyenne, Wyoming and lives in Los Angeles. She has a successful career in film and television and has worked with incredible directors such as David Lynch on \"Mulholland Drive\" and Tom Hanks on \"That Thing You Do\". Recent work includes feature films \"Huff\", \"Chop\" and the ensemble character study \"Small Town Saturday Night\" starring Chris Pine and John Hawkes. She also co-starred in the Award winning feature film \"Barracuda\". She has starred in numerous horror genre films such as the classic \"Miners Massacre\", \"Creepshow 3\", \"Petrified\" and the remake of \"The Strange Case of Dr Jekyll and Mr Hyde\" as well as producing and starring in \"Corporate Cut Throat Massacre\".\n\nElina has also starred in her share of comedies such as award winning \"Kissing Cousins\" and \"Stand Up\", as well as taking a dramatic turn in independent films as the lead heroine Minty in \"Minty: The Assassin\". In television, she has guest-starred on Emmy nominated \"Brothers &amp; Sisters\" and NBC’s \"Las Vegas\" as well as working on shows such as \"Mystery ER\", reoccurring on \"Untold Stories of the ER\", National Geographic, Nickelodeon and The Discovery Channel as well as numerous other films and television programs and several local and national commercials.",
        "birthday": "1976-09-27",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 42535,
        "imdb_id": "nm0534965",
        "known_for_department": "Acting",
        "name": "Elina Madison",
        "place_of_birth": "Sioux City, Iowa, USA",
        "popularity": 0.1537,
        "profile_path": "/hWbeGEFwMMCzLU1VMp39qAskxrD.jpg"
    }
}