{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9IYyCLf5NNAQFK9pNtqzEU9HWzM.jpg",
                "genre_ids": [
                    35,
                    878
                ],
                "id": 68,
                "original_language": "en",
                "original_title": "Brazil",
                "overview": "Low-level bureaucrat Sam Lowry escapes the monotony of his day-to-day life through a recurring daydream of himself as a virtuous hero saving a beautiful damsel. Investigating a case that led to the wrongful arrest and eventual death of an innocent man instead of wanted terrorist Harry Tuttle, he meets the woman from his daydream, and in trying to help her gets caught in a web of mistaken identities, mindless bureaucracy and lies.",
                "popularity": 3.9345,
                "poster_path": "/aewan59WcFThBimkTVVoNf2o5Vb.jpg",
                "release_date": "1985-02-20",
                "title": "Brazil",
                "video": false,
                "vote_average": 7.67,
                "vote_count": 3484,
                "character": "Interview Official",
                "credit_id": "5e2d685266f2d20011d62d3c",
                "order": 34
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nJohn Grillo (born 29 November 1942, Watford, Hertfordshire) is a British actor and playwright who has appeared in many film and television productions.\n\nHe was educated at Trinity Hall, Cambridge, and while there was actively involved in student theatre. He performed with Footlights in their annual revue. After Cambridge, he was awarded an Arts Council Playwrighting Bursary and his plays were performed at Nottingham, Glasgow, Oxford and Dublin as well as at the ADC Theatre in Cambridge.  He played Mr. Samgrass in the ITV series Brideshead Revisited, and Phillip Marriott QC in Crown Court. He had minor parts in other shows, including Blackadder II (\"Bells\"), Bergerac, Taggart and Rumpole of the Bailey.\n\nIn 1997 he appeared as Mr Carkdale, the English teacher who spoke only in Anglo-Saxon, in two series of Steven Moffat's school-sitcom Chalk. In 2008, he contributed to the audio commentary for the DVD release.\n\nHe is represented by Michelle Braidman Associates.  Description above from the Wikipedia article John Grillo,licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1942-11-29",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 42568,
        "imdb_id": "nm0342038",
        "known_for_department": "Acting",
        "name": "John Grillo",
        "place_of_birth": "Watford, Hertfordshire, England, UK",
        "popularity": 0.1376,
        "profile_path": "/fqCxjtHYSZMHc4p6Ybg3vsp0rIS.jpg"
    }
}