{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2w4xG178RpB4MDAIfTkqAuSJzec.jpg",
                "genre_ids": [
                    12,
                    28,
                    878
                ],
                "id": 11,
                "original_language": "en",
                "original_title": "Star Wars",
                "overview": "Princess Leia is captured and held hostage by the evil Imperial forces in their effort to take over the galactic Empire. Venturesome Luke Skywalker and dashing captain Han Solo team together with the loveable robot duo R2-D2 and C-3PO to rescue the beautiful princess and restore peace and justice in the Empire.",
                "popularity": 15.836,
                "poster_path": "/6FfCtAuVAW8XJjZ7eWeLibRLWTw.jpg",
                "release_date": "1977-05-25",
                "title": "Star Wars",
                "video": false,
                "vote_average": 8.206,
                "vote_count": 21485,
                "character": "General Taggi",
                "credit_id": "52fe420dc3a36847f80004c3",
                "order": 23
            },
            {
                "adult": false,
                "backdrop_path": "/mBh3NXCkSCasZGovzAuc9UlFCru.jpg",
                "genre_ids": [
                    14,
                    12,
                    35
                ],
                "id": 14506,
                "original_language": "en",
                "original_title": "The Adventures of Baron Munchausen",
                "overview": "An account of Baron Munchausen's supposed travels and fantastical experiences with his band of misfits.",
                "popularity": 4.2594,
                "poster_path": "/oiOwGRqwrKpg1EMUlPgRjVC49bn.jpg",
                "release_date": "1988-12-07",
                "title": "The Adventures of Baron Munchausen",
                "video": false,
                "vote_average": 6.967,
                "vote_count": 947,
                "character": "Commander",
                "credit_id": "58c2282bc3a36842de003cb5",
                "order": 14
            },
            {
                "adult": false,
                "backdrop_path": "/9IYyCLf5NNAQFK9pNtqzEU9HWzM.jpg",
                "genre_ids": [
                    35,
                    878
                ],
                "id": 68,
                "original_language": "en",
                "original_title": "Brazil",
                "overview": "Low-level bureaucrat Sam Lowry escapes the monotony of his day-to-day life through a recurring daydream of himself as a virtuous hero saving a beautiful damsel. Investigating a case that led to the wrongful arrest and eventual death of an innocent man instead of wanted terrorist Harry Tuttle, he meets the woman from his daydream, and in trying to help her gets caught in a web of mistaken identities, mindless bureaucracy and lies.",
                "popularity": 4.301,
                "poster_path": "/aewan59WcFThBimkTVVoNf2o5Vb.jpg",
                "release_date": "1985-02-20",
                "title": "Brazil",
                "video": false,
                "vote_average": 7.67,
                "vote_count": 3484,
                "character": "First 'Black Maria' Guard",
                "credit_id": "5e2d68041685da0013e83f8e",
                "order": 31
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Born Donald Francis Henderson in Leystonstone, 1931, Don Henderson was an English actor of stage, television and screen. He was best known for playing both \"tough guy\" roles and authority figures, and is remembered for his portrayal of detective George Bulman between 1976 and 1987 in a trilogy of popular Granada Television police drama series; The XYY Man, Strangers, and Bulman. Following the end of Bulman, Henderson starred as the priest Frank Kane in the BBC drama series The Paradise Club, penned by Bulman creator Murray Smith.  Henderson starred in several cult and sci fi serials and films, most notably in the first Star Wars movie in which he played General Tagge, and Doctor Who and Red Dwarf. Prior to acting, Henderson was a dental technician in the army and a detective sergeant in the Essex constabulary, but he resigned when he found he had sympathy for the criminals he was obliged to arrest. He was married twice, firstly to  Hilary who died in 1977, and then to the actress Shirley Stelfox, whom he met filming The XYY Man. The pair set up home in Stratford-Upon-Avon and appeared together professionally many times until his death from throat cancer in 1997.",
        "birthday": "1932-11-10",
        "deathday": "1997-06-22",
        "gender": 2,
        "homepage": null,
        "id": 42570,
        "imdb_id": "nm0376405",
        "known_for_department": "Acting",
        "name": "Don Henderson",
        "place_of_birth": "Leytonstone, London, England, UK",
        "popularity": 0.1497,
        "profile_path": "/93Zcpxng8e4aACOgsjU5i727oQc.jpg"
    }
}