{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sctvs9cUwJD15qlTlrsh2BXsK75.jpg",
                "genre_ids": [
                    28,
                    80,
                    18
                ],
                "id": 111,
                "original_language": "en",
                "original_title": "Scarface",
                "overview": "After getting a green card in exchange for assassinating a Cuban government official, Tony Montana stakes a claim on the drug trade in Miami. Viciously murdering anyone who stands in his way, Tony eventually becomes the biggest drug lord in the state, controlling nearly all the cocaine that comes through Miami. But increased pressure from the police, wars with Colombian drug cartels and his own drug-fueled paranoia serve to fuel the flames of his eventual downfall.",
                "popularity": 14.4392,
                "poster_path": "/iQ5ztdjvteGeboxtmRdXEChJOHh.jpg",
                "release_date": "1983-12-09",
                "title": "Scarface",
                "video": false,
                "vote_average": 8.16,
                "vote_count": 12451,
                "character": "Distraction at Lookout Car (uncredited)",
                "credit_id": "64fefa376a222700fd1f8635",
                "order": 102
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Tammy Lynn Leppert (born February 5, 1965 - disappeared July 6, 1983) was an American actress, model and beauty queen who went missing under mysterious circumstances at the age of 18.\n\nAfter the shooting of the film Spring Break was finished, Leppert went unaccompanied to a weekend party. She came home from the party \"a different person\" according to her close friend Wing Flannagan's testimony. When she was playing in her next film, Scarface, she suddenly returned home after the fourth day of filming. Her mother assumed that Leppert had been afraid of being murdered by someone, and that she had become overtaken by this delusion. Her mother felt obliged to have her examined by a doctor,  Leppert was released and there seemed to be no signs of drug or alcohol use according to doctor statements.\n\nLeppert was last seen in Cocoa Beach, Florida on July 6, 1983.  Some agencies have stated that she left without shoes or money.  A friend of Leppert's told authorities that he had an argument with her while driving her from her home in Rockledge, Florida, that he had later \"left her in a parking lot.\" Although he is the last person believed to have seen her, he was not considered a suspect. However, her mother has claimed that Leppert was \"afraid\" of him.\n\nAfter Tammy Leppert's disappearance, Cocoa Beach Detective Harold Lewis received two telephone calls from a woman claiming that Leppert was still alive. In the first call, the woman said that Leppert was well and would make contact when the time was right. During the second call, she said that Leppert was doing what she always wanted: going to school to become a nurse.",
        "birthday": "1965-02-05",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 4265412,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Tammy Lynn Leppert",
        "place_of_birth": "Rockledge - Florida - USA",
        "popularity": 0.0549,
        "profile_path": "/wZGqrDouKxwBME9wVVDeMLYsQSd.jpg"
    }
}