{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/weZ0PuPkvEFc8uuqt5TL8EXz0cs.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 760336,
                "original_language": "en",
                "original_title": "Munich – The Edge of War",
                "overview": "At the tense 1938 Munich Conference, former friends who now work for opposing governments become reluctant spies racing to expose a Nazi secret.",
                "popularity": 3.9304,
                "poster_path": "/1SOiUTDnwW9gU4GzSIsOCQUlHJF.jpg",
                "release_date": "2021-12-31",
                "title": "Munich – The Edge of War",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 613,
                "character": "Sir Neville Henderson",
                "credit_id": "63c1848bdf857c00bc21bb1f",
                "order": 27
            },
            {
                "adult": false,
                "backdrop_path": "/weZ0PuPkvEFc8uuqt5TL8EXz0cs.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 760336,
                "original_language": "en",
                "original_title": "Munich – The Edge of War",
                "overview": "At the tense 1938 Munich Conference, former friends who now work for opposing governments become reluctant spies racing to expose a Nazi secret.",
                "popularity": 3.9304,
                "poster_path": "/1SOiUTDnwW9gU4GzSIsOCQUlHJF.jpg",
                "release_date": "2021-12-31",
                "title": "Munich – The Edge of War",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 613,
                "character": "Sir Nevile Henderson",
                "credit_id": "5fa14da9cb6db500382efc31",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia.\n\nRobert Guy Bathurst (born 22 February 1957) is an English actor. Bathurst was born in the Gold Coast in 1957, where his father was working as a management consultant. His family moved to Dublin, Ireland, in 1959 and Bathurst was enrolled at an Anglican boarding school. In 1966, the family moved to England, and Bathurst transferred to another boarding school, where he took up amateur dramatics. At the age of 18, he read law at the University of Cambridge and joined the Cambridge Footlights group. After graduating, he took up acting full time.\n\nHe made his professional stage debut in 1983, playing Tim Allgood in Michael Frayn's Noises Off, which ran for a year at the Savoy Theatre. To broaden his knowledge of working on stage, he joined the National Theatre. He supplemented his stage roles in the 1980s with television roles, appearing in comedies such as the aborted pilot episode of Blackadder, The Lenny Henry Show, and the first episode of Red Dwarf. In 1991, he won his first major television role playing Mark Taylor in Steven Moffat's semi-autobiographical BBC sitcom Joking Apart. Although only thirteen episodes were made between 1991 and 1995, the role remains Bathurst's favourite of his whole career. After Joking Apart concluded, he was cast as pompous management consultant David Marsden in the ITV comedy drama Cold Feet, which ran for five series from 1998 to 2003.\n\nSince 2003, Bathurst has played a fictional prime minister in the BBC sitcom My Dad's the Prime Minister, Mark Thatcher in the fact-based drama Coup!, and a man whose daughter goes missing in the ITV thriller The Stepfather. He also made a return to theatre roles, playing Vershinin in The Three Sisters (2003), Adrien in the two-hander Members Only (2006), government whip Alistair in Whipping it Up (2006–2007), and Alex in Alex (2007, 2008). In 2010 he starred in the The Pillars of the Earth and had a recurring role in Downton Abbey. Bathurst appeared in in his first Noël Coward play, Present Laughter, in 2010 and followed it with a role in Blithe Spirit in 2010 and 2011. He is married and has four children.\n\nDescription above from the Wikipedia article Robert Bathurst, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1957-02-22",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 42663,
        "imdb_id": "nm0061106",
        "known_for_department": "Acting",
        "name": "Robert Bathurst",
        "place_of_birth": "Accra, Gold Coast, Ghana",
        "popularity": 0.277,
        "profile_path": "/7Y5uOaVJEyJsDksXYMwjsanzXj8.jpg"
    }
}