{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/DztBnZaqmla2sGUW9s8AyOmskT.jpg",
                "genre_ids": [
                    18
                ],
                "id": 14,
                "original_language": "en",
                "original_title": "American Beauty",
                "overview": "Lester Burnham, a depressed suburban father in a mid-life crisis, decides to turn his hectic life around after developing an infatuation with his daughter's attractive friend.",
                "popularity": 9.2546,
                "poster_path": "/wby9315QzVKdW9BonAefg8jGTTb.jpg",
                "release_date": "1999-09-15",
                "title": "American Beauty",
                "video": false,
                "vote_average": 8.005,
                "vote_count": 12548,
                "character": "Christy Kane",
                "credit_id": "55c2407c9251413dee00018e",
                "order": 30
            },
            {
                "adult": false,
                "backdrop_path": "/6Z1fVDm7b05I1650DJRqAq8dIaI.jpg",
                "genre_ids": [
                    80,
                    9648,
                    53,
                    18
                ],
                "id": 2118,
                "original_language": "en",
                "original_title": "L.A. Confidential",
                "overview": "Three detectives in the corrupt and brutal L.A. police force of the 1950s use differing methods to uncover a conspiracy behind the shotgun slayings of the patrons at an all-night diner.",
                "popularity": 7.8961,
                "poster_path": "/2PH1pqXMcYBDjodkjiMwMiPi2bH.jpg",
                "release_date": "1997-09-19",
                "title": "L.A. Confidential",
                "video": false,
                "vote_average": 7.802,
                "vote_count": 5224,
                "character": "Susan Lefferts",
                "credit_id": "560ea7a1c3a368681000cd92",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "When Anheuser-Busch chose Amber Smith as the spokesperson for its new Michelob Ultra Amber lite beer, it was on a mission. Through posters, life-size standees and Point-of-purchase promotional materials, Amber's image was plastered across the nation. However, it was the 20-city \"Meet Amber\" tour that delivered on the campaign title! A gifted high school student with a 155 IQ, Amber was discovered at an international modeling convention. The 15-year-old won and soon flew to Paris, where she worked hard and often and established a reputation for being passionate and expressive both on film and in print. Her \"exotic\" good looks drew the attention of top photographers such as the famous \n\nHelmut Newton, but it was her chameleon-like quality that got her on the covers of such prestigious magazines as \"Vogue\", \"Elle\", \"Esquire\", \"Maxim\" and \"Playboy\". Amber walked the runway for Chanel and represented Loreal Cosmetics and Wonderbra in their national advertising campaigns. She then achieved the ultimate accolade for a fashion model: appearing in the coveted role of \"Sports Illustrated\" magazine's swimwear model. She has produced four award-winning calendars, two nationally released posters and a modeling documentary DVD, \"Amber Smith Raw\" (available in stores). Amber has already completed two movie scripts and has started on a how-to book that will contain her own stories, detailed experiences and opinions on the modeling and entertainment world. After ripping through the modeling world, she added acting to her resume. She has worked with such acclaimed directors as \n\nCurtis Hanson, Abel Ferrara, Paul Mazursky andBarbra Streisand and landed parts in two Academy Award-winning movies, L.A. Confidential (1997) and American Beauty (1999), as well as a host of others. Her television credits include Dame un respiro (1997) and Friends (1994) (as \"Amber Smith, Supermodel\"). In 2005 E! Entertainment chose Amber for a reality show pilot, titled \"The Amber Smith Project,\" which follows Amber's efforts to open up a modeling agency in Miami Beach. She also filmed yet another pilot, \"The Anchorwoman,\" in which she will take over the life of a broadcast journalist. \"The Anchorwoman\" is in development. She launched the 2006 Michelob Ultra Amber Lite beer \"Meet Amber\" campaign, which was created entirely around her. All promotional materials feature her image, name and signature. The \"Meet Amber\" national tour was launched the summer of 2006 through the end of the year.",
        "birthday": "1971-03-02",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 42715,
        "imdb_id": "nm0807291",
        "known_for_department": "Acting",
        "name": "Amber Smith",
        "place_of_birth": "Tampa, Florida, USA",
        "popularity": 0.7667,
        "profile_path": "/6zUCOaxoRvIZLzDWbWWLOgeZMrf.jpg"
    }
}