{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bHePzkyRcMhnab2qZbhj1bCElnf.jpg",
                "genre_ids": [
                    35,
                    18,
                    14
                ],
                "id": 300,
                "original_language": "fr",
                "original_title": "La Science des rêves",
                "overview": "A man entranced by his dreams and imagination is lovestruck with a French woman and feels he can show her his world.",
                "popularity": 5.5298,
                "poster_path": "/8bummqwU6MV65ZJvNtKx8Y3NIEk.jpg",
                "release_date": "2006-06-25",
                "title": "The Science of Sleep",
                "video": false,
                "vote_average": 6.994,
                "vote_count": 798,
                "character": "Policier qui joue au piano",
                "credit_id": "52fe4234c3a36847f800c061",
                "order": 12
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/bHePzkyRcMhnab2qZbhj1bCElnf.jpg",
                "genre_ids": [
                    35,
                    18,
                    14
                ],
                "id": 300,
                "original_language": "fr",
                "original_title": "La Science des rêves",
                "overview": "A man entranced by his dreams and imagination is lovestruck with a French woman and feels he can show her his world.",
                "popularity": 5.5298,
                "poster_path": "/8bummqwU6MV65ZJvNtKx8Y3NIEk.jpg",
                "release_date": "2006-06-25",
                "title": "The Science of Sleep",
                "video": false,
                "vote_average": 6.994,
                "vote_count": 798,
                "credit_id": "52fe4234c3a36847f800c013",
                "department": "Sound",
                "job": "Original Music Composer"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "JMB"
        ],
        "biography": "Jean-Michel Bernard (born 23 November 1961) is a French pianist, composer, educator, orchestrator, and music producer. He is well known for regularly writing, performing, and scoring for films, such as The Science of Sleep, Hugo, Paris-Manhattan, Ca$h, and Be Kind Rewind.\n\nBernard began playing the piano at the age of two. When he was 14, he was awarded first place at the Bordeaux Conservatory and later graduated from the École Normale de Musique de Paris. At 19, he recorded with the Royal Philharmonic Orchestra in London, whilst pursuing a career as a jazz musician and performing with prominent jazz artists including Wild Bill Davis, Jimmy Woode (Duke Ellington's bassist) and Eddie \"Lockjaw\" Davis.\n\nFrom 1987 to 1991 he worked as musical director and conductor of the successful radio show L’Oreille en Coin on National Public Radio France Inter. Between 2000 and 2003, he performed with the Ray Charles Quartet on the European and Australian tours as organist and conductor, \"this guy is a genius\" Ray used to say concerning Bernard. He also scored many documentaries and commercials during the 1990s. His career as a composer began with animated films, followed by collaborations with masters such as Lalo Schifrin and Ennio Morricone. He frequently works with director Michel Gondry and has composed songs for films including Human Nature and he scored The Science of Sleep, which screened at the Sundance Film Festival and Berlin Film Festival. He was nominated for the World Soundtrack Awards in 2007 as Discovery of the Year and won the France Musique/UCMF award at the Cannes Film Festival the same year for this movie.\n\nIn 2003, Bernard wrote the music for TF1's À prendre ou à laisser, the French version of Deal or No Deal.\n\nIn 2008 he scored the music for Gondry's Be Kind Rewind, Cash by Eric Besnard, and A Pain in the Ass by Francis Veber. The same day Be Kind Rewind was shown at the Sundance Festival, Bernard performed alongside rapper/singer Mos Def and Gondry, an avid drummer.\n\nThe following year, the Cannes Film Festival invited him to represent France in the film music concert program. He also received an award for his achievement outside of his native country from the European Union of Film Music Composers (UCMF) and was appointed as sound designer for both HBO's channel and website.\n\nHe has collaborated with French actress and director Fanny Ardant on two of her films, Chimères Absentes and Cadences Obstinées starring Gérard Depardieu and worked on Academy Award-winning Hugo by Martin Scorsese. He scored the music of Love Punch by Joel Hopkins starring Pierce Brosnan and Emma Thompson, Love at First Child by Anne Giafferi and Money by Georgian director Gela Babluani. Bernard has conducted master classes at the Cannes Film Festival as well as in Montreal, Angers, La Rochelle, Kraków, Cologne and in Aubagne, where he performed a live version of Jazz For Dogs, an album co-created with Kimiko Ono and featuring a number of prestigious guests including Fanny Ardant, Francis Lai and Laurent Korcia. ...\n\nSource: Article \"Jean-Michel Bernard\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1961-11-23",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.jmbernard.net/",
        "id": 4278,
        "imdb_id": "nm0076259",
        "known_for_department": "Sound",
        "name": "Jean-Michel Bernard",
        "place_of_birth": "France",
        "popularity": 0.051,
        "profile_path": "/3pm6vvDImZZuMtGYjS95AV0727s.jpg"
    }
}