{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/77GGKq6Ixq6ZiqBM6XcPZgQmiN2.jpg",
                "genre_ids": [
                    28,
                    12,
                    18
                ],
                "id": 579974,
                "original_language": "te",
                "original_title": "రౌద్రం రణం రుధిరం",
                "overview": "A fictional history of two legendary revolutionaries' journey away from home before they began fighting for their country in the 1920s.",
                "popularity": 6.9769,
                "poster_path": "/nEufeZlyAOLqO2brrs0yeF1lgXO.jpg",
                "release_date": "2022-03-24",
                "title": "RRR",
                "video": false,
                "vote_average": 7.742,
                "vote_count": 1448,
                "character": "Alluri Venkatarama Raju",
                "credit_id": "5c8f45940e0a261304586785",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            " \tVishal Veeru Devgan",
            "Ajay Devgan",
            "अजय देवगन",
            "阿贾耶·德乌干",
            "اجی دیوگن"
        ],
        "biography": "Ajay Devgan is an Indian film actor, director and producer. He is widely considered as one of the most popular actors of Hindi cinema who has appeared in over a hundred Hindi films.  He has won numerous awards, including two National Film Awards and four Filmfare Awards. In 2016, he was honoured by the Government of India with the Padma Shri, the fourth highest civilian honour of the country.\n\nDevgan began his professional career with Phool Aur Kaante in 1991 and received a Filmfare Award for Best Male Debut for his performance.  In 1998, he appeared in a critically acclaimed performance in Mahesh Bhatt's drama Zakhm and he received his first National Film Award for Best Actor for his role in the movie. In 1999, his most-talked-about film was Hum Dil De Chuke Sanam in which he played Vanraj, a man who tries to unite his wife with her lover. He has starred in more than hundred Hindi films. Having done so, he established himself as one of the leading actors of Hindi cinema.\n\nIn addition, Devgn owns a production company Ajay Devgn FFilms which was established in 2000. In 2008 he debuted as a film director with U Me Aur Hum. He is married to film actress, Kajol since 1999 and the couple have two children. In August 2009, Devgn changed his surname from Devgan to Devgn on the request of his family.",
        "birthday": "1969-04-02",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 42803,
        "imdb_id": "nm0222426",
        "known_for_department": "Acting",
        "name": "Ajay Devgn",
        "place_of_birth": "New Delhi, India",
        "popularity": 0.904,
        "profile_path": "/vnHQQFzTjJ0sv14DGMIoKa3qTxN.jpg"
    }
}