{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1yWn9A2LN0uRGudIg0bV2Np6T69.jpg",
                "genre_ids": [
                    10752,
                    28,
                    18
                ],
                "id": 9289,
                "original_language": "en",
                "original_title": "The Longest Day",
                "overview": "The retelling of June 6, 1944, from the perspectives of the Germans, US, British, Canadians, and the Free French. Marshall Erwin Rommel, touring the defenses being established as part of the Reich's Atlantic Wall, notes to his officers that when the Allied invasion comes they must be stopped on the beach. \"For the Allies as well as the Germans, it will be the longest day\"",
                "popularity": 3.5233,
                "poster_path": "/5zmvEofdIlgXrQl9A7e5IOzlnFU.jpg",
                "release_date": "1962-09-25",
                "title": "The Longest Day",
                "video": false,
                "vote_average": 7.594,
                "vote_count": 977,
                "character": "RAdm. Alan G. Kirk (uncredited)",
                "credit_id": "5e50f50535811d001954ae97",
                "order": 89
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "​From Wikipedia, the free encyclopedia.\n\nJohn Meillon  (1 May 1934 – 11 August 1989) was an legendary Australian actor, most widely known outside Australia for his role as Walter Reilly in the films Crocodile Dundee and Crocodile Dundee II. He also voiced Victoria Bitter beer commercials until his death.\n\nMeillon was born in Mosman, Sydney. He began his acting career at the age of eleven in the ABC's radio serial \"Stumpy\", and made his first stage appearance the following year. He joined the Shakespeare Touring Company when he was sixteen. Like many actors of his generation from 1959 to 1965 he worked in England.\n\nHe had a recurring role in the TV series My Name's McGooley, What's Yours?. He featured in two episodes of \"Skippy\" in 1968 and 1969 appearing as \"Nimble Norris\". In 1976 he won the AFI Award for Best Actor for his role of 'Casey' in the film The Fourth Wish (1976).\n\nWith his rich baritone, Meillon was used extensively in voice over work- the most famous being his work as the \"you can get it any old how\" Victoria Bitter narrator.\n\nHe married Australian actress June Salter in 1958. They were divorced in 1971. They had one son, John Meillon, Jr. He then married actress Bunny Gibson (\"Rita the Eta Eater\") on 5 April 1972: they also had a son.\n\nDescription above from the Wikipedia article John Meillon, licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": "1934-05-01",
        "deathday": "1989-08-11",
        "gender": 2,
        "homepage": null,
        "id": 42841,
        "imdb_id": "nm0576851",
        "known_for_department": "Acting",
        "name": "John Meillon",
        "place_of_birth": "Mosman, Sydney, New South Wales, Australia",
        "popularity": 0.4667,
        "profile_path": "/k9x2VwKqiTxTKP1WIgOM1AtZf2G.jpg"
    }
}