{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/iMKviWNREc35F1uPVq0GkRc3OKN.jpg",
                "genre_ids": [
                    16,
                    878
                ],
                "id": 9606,
                "original_language": "ja",
                "original_title": "メトロポリス",
                "overview": "In the midst of societal conflict in the futuristic city of Metropolis, Kenichi and his uncle Shunsaku Ban set out to uncover the mystery behind the first human-like robot, Tima.",
                "popularity": 3.8075,
                "poster_path": "/41WtqvaObaYE3RuqgBfQFPV3aV1.jpg",
                "release_date": "2001-05-26",
                "title": "Metropolis",
                "video": false,
                "vote_average": 7.126,
                "vote_count": 505,
                "character": "Kenichi (voice)",
                "credit_id": "65107ee3344a8e096d9e7c69",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Kei Kobayashi (born May 9, 1979) is a Japanese male jazz vocalist. He is from Tokyo.\n\nBorn as the second son of a family whose grandfather is Kazunori Murakami (jazz steel guitar player), father Hiroshi Kobayashi (jazz pianist and arranger), and mother Kyoko Murakami (jazz vocalist), he grew up in an environment where he was familiar with jazz from an early age.\n\nHe was inspired by a musical he saw at an amusement park when he was three years old, and then became obsessed with a stage play based on Duke Ellington's music, and at the age of five he declared that he would one day be on the musical stage. It is said that\n\nAfter gaining numerous stage experiences in classical ballet from the age of 5, he became a hot topic in the dance world other than jazz, starring in a musical at the age of 12. By the time he was 15 years old, he was active as a jazz vocalist and jazz drummer at live houses in Tokyo, and was attracting attention among jazz players.\n\nAt the age of 16, he performed at a charity concert for the Great Hanshin-Awaji Earthquake with Herbie Hancock and other top artists from around the world. At the age of 17, his first mini-album \"Let's Take the K Train ~17-Year-Old Jazz\" (Unicom) was released.\n\nAfter that, at the age of 18, she released her full album \"18/P.S. I LOVE YOU\" (Next Records). He recorded a full-length album, \"My Romance,\" at the age of 19 (later released by EMI Music Japan in 2004). Released his major debut album \"So Nice\" (Toshiba EMI) at the age of 20. After the release of this album, he became known nationwide as \"Genius Jazz Vocalist Katsura Kobayashi,\" and sparked a jazz vocal boom among the media.\n\nSince then, by the age of 25, he has released 11 full albums, 1 maxi single, and a live DVD at Blue Note in New York and Orchard Hall in Tokyo.\n\nIn 2010, he transferred to Pony Canyon. He started his own label \"twinKle note\" at Pony Canyon and released many more.\n\nIn 2016, they released the album \"The Standard,\" which is a collection of frequently requested masterpieces, and in 2017, they released \"The Standard II,\" making this their 20th album in total.\n\nIn 2018, she held the \"25th Anniversary Tour of Her Musical Life\" with the Katsura Kobayashi Quintet.\n\nCurrently, he is performing nationwide, mainly as a unit consisting of band members of the same generation as himself.\n\nAs an evangelist of jazz standards, he continues to be supported by a wide range of listeners and musicians for his interpretations of songs that take advantage of the beauty of the original songs, and for his vocal style of improvising on an equal footing with musicians through scatting.",
        "birthday": "1979-09-05",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 4288875,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Kei Kobayashi",
        "place_of_birth": "Tōkyō, Japan",
        "popularity": 0.0214,
        "profile_path": "/uSdMFbacYcITcEkLsLvm3bhafVb.jpg"
    }
}