{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bHePzkyRcMhnab2qZbhj1bCElnf.jpg",
                "genre_ids": [
                    35,
                    18,
                    14
                ],
                "id": 300,
                "original_language": "fr",
                "original_title": "La Science des rêves",
                "overview": "A man entranced by his dreams and imagination is lovestruck with a French woman and feels he can show her his world.",
                "popularity": 5.5298,
                "poster_path": "/8bummqwU6MV65ZJvNtKx8Y3NIEk.jpg",
                "release_date": "2006-06-25",
                "title": "The Science of Sleep",
                "video": false,
                "vote_average": 6.994,
                "vote_count": 798,
                "character": "Mr. Pouchet",
                "credit_id": "52fe4234c3a36847f800c04d",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Pierre Auguste Van Hecke"
        ],
        "biography": "Pierre Vaneck (born Pierre Auguste Van Hecke; 15 April 1931 – 31 January 2010) was a French actor. During his career, he won a Molière Award in 1988 and received a César Award nomination in 2009.\n\nSon of a Belgian army officer, Pierre Vaneck spent his youth in Antwerp, Belgium, until the age of 17, when he started medical studies in Paris, France. Before long, he branched into studying acting, first at the Rene Simon school, and then at the Theatre Academy, under Henri Rollan. He earned his living meanwhile by working for a saddle-maker by day, and in the evenings, he recited François Villon's poems in cabarets. His début on the stage came in 1952 in The Three Musketeers in the role of Louis XIII. His first important role in the cinema was in the Julien Duvivier film, Marianne of my Youth in 1955.\n\nPierre Vaneck was primarily a theatre and television actor. The general public knew him particularly for his television role as the father of the main character in Fabien Cosma, as well as in many other serials (Spring Tides, The Garonne...). Vaneck died on Sunday 31 January 2010, during open-heart surgery. He was married to Sophie Becker, daughter and sister of Jacques Becker and Jean Becker. His grandchildren, Aurélie and Thibaud Vaneck, are both actors, and feature in the television series Plus Belle la Vie which is broadcast on France 3 channel.\n\nSource: Article \"Pierre Vaneck\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1931-04-15",
        "deathday": "2010-01-31",
        "gender": 2,
        "homepage": null,
        "id": 4289,
        "imdb_id": "nm0889005",
        "known_for_department": "Acting",
        "name": "Pierre Vaneck",
        "place_of_birth": "Lang Son, Indochine",
        "popularity": 0.1338,
        "profile_path": "/sX7AO0tJAnscSD7wEzq98uLM539.jpg"
    }
}