{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6MKr3KgOLmzOP6MSuZERO41Lpkt.jpg",
                "genre_ids": [
                    35,
                    80,
                    12
                ],
                "id": 337404,
                "original_language": "en",
                "original_title": "Cruella",
                "overview": "In 1970s London amidst the punk rock revolution, a young grifter named Estella is determined to make a name for herself with her designs. She befriends a pair of young thieves who appreciate her appetite for mischief, and together they are able to build a life for themselves on the London streets. One day, Estella’s flair for fashion catches the eye of the Baroness von Hellman, a fashion legend who is devastatingly chic and terrifyingly haute. But their relationship sets in motion a course of events and revelations that will cause Estella to embrace her wicked side and become the raucous, fashionable and revenge-bent Cruella.",
                "popularity": 11.2552,
                "poster_path": "/hjS9mH8KvRiGHgjk6VUZH7OT0Ng.jpg",
                "release_date": "2021-05-26",
                "title": "Cruella",
                "video": false,
                "vote_average": 7.987,
                "vote_count": 9719,
                "character": "Fashion Reporter",
                "credit_id": "651291aa26dac1010c770254",
                "order": 46
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Helena Dowling is a British Actress of Jamaican/ English decent. She grew up in the Midlands and moved to London to train as an Actor, Dancer and Singer. She will be appearing in Disney's Cruella in 2021. Known for BBC's Doctors and Channel 4's Totally Frank where she played lead Flo. As well as her screen work, she has also starred in plays and Musicals in the UK and Germany and many stadium shows globally.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 4291710,
        "imdb_id": "nm2045213",
        "known_for_department": "Acting",
        "name": "Helena Dowling",
        "place_of_birth": "Tamworth, Staffordshire, England, UK",
        "popularity": 0.0286,
        "profile_path": null
    }
}