{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/oyK2a8tMn6cmzilaUmKWYqNXzay.jpg",
                "genre_ids": [
                    35,
                    10751,
                    14
                ],
                "id": 787699,
                "original_language": "en",
                "original_title": "Wonka",
                "overview": "Willy Wonka – chock-full of ideas and determined to change the world one delectable bite at a time – is proof that the best things in life begin with a dream, and if you’re lucky enough to meet Willy Wonka, anything is possible.",
                "popularity": 10.1092,
                "poster_path": "/qhb1qOilapbapxWQn9jtRCMwXJF.jpg",
                "release_date": "2023-12-06",
                "title": "Wonka",
                "video": false,
                "vote_average": 7.059,
                "vote_count": 4040,
                "character": "Jenkins",
                "credit_id": "6575f04ba84a472de6eb84ac",
                "order": 23
            },
            {
                "adult": false,
                "backdrop_path": "/sDiGcjWhSu42dCw0jQmBInAkDZ9.jpg",
                "genre_ids": [
                    28,
                    53,
                    80
                ],
                "id": 379149,
                "original_language": "en",
                "original_title": "The Foreigner",
                "overview": "Quan is a humble London businessman whose long-buried past erupts in a revenge-fueled vendetta when the only person left for him to love – his teenage daughter – dies in an Irish Republican Army car bombing. His relentless search to find the terrorists leads to a cat-and-mouse conflict with a British government official whose own past may hold the clues to the identities of the elusive killers.",
                "popularity": 8.0393,
                "poster_path": "/rwM4hzrmc5HiWfQD9ls9DL4QgGl.jpg",
                "release_date": "2017-09-28",
                "title": "The Foreigner",
                "video": false,
                "vote_average": 6.97,
                "vote_count": 2771,
                "character": "Ian Wood",
                "credit_id": "59d885a992514125140225fc",
                "order": 15
            },
            {
                "adult": false,
                "backdrop_path": "/kfofK4GzJsJZhCShqZY438c8Y4Y.jpg",
                "genre_ids": [
                    35,
                    12,
                    10751
                ],
                "id": 116149,
                "original_language": "en",
                "original_title": "Paddington",
                "overview": "A young Peruvian bear travels to London in search of a home. Finding himself lost and alone at Paddington Station, he meets the kindly Brown family, who offer him a temporary haven.",
                "popularity": 7.2892,
                "poster_path": "/wpchRGhRhvhtU083PfX2yixXtiw.jpg",
                "release_date": "2014-11-24",
                "title": "Paddington",
                "video": false,
                "vote_average": 7.114,
                "vote_count": 3990,
                "character": "Third Geographer",
                "credit_id": "59d88344925141251f0225db",
                "order": 29
            },
            {
                "adult": false,
                "backdrop_path": "/6oyC0KcZPx9aqA1WkXtkfA1txXU.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 394741,
                "original_language": "en",
                "original_title": "Stan & Ollie",
                "overview": "With their golden era long behind them, comedy duo Stan Laurel and Oliver Hardy embark on a variety hall tour of Britain and Ireland. Despite the pressures of a hectic schedule, and with the support of their wives Lucille and Ida – a formidable double act in their own right – the pair's love of performing, as well as for each other, endures as they secure their place in the hearts of their adoring public",
                "popularity": 3.1926,
                "poster_path": "/8qDBDXA8Od8gc4IQMnoXUKyj8Pf.jpg",
                "release_date": "2018-12-28",
                "title": "Stan & Ollie",
                "video": false,
                "vote_average": 6.951,
                "vote_count": 1089,
                "character": "Bernard Delfont",
                "credit_id": "5a68f91f0e0a260d640067e4",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Rufus Jones (born 1975) is an English actor known for his appearances on television which include David Wilkes in W1A, Dr. Foggerty in Hunderby, Tom in Camping, and Peter in Home (which he also wrote).  Jones began his career as one fifth of the comedy group Dutch Elm Conservatoire.\n\nOn television, he is known for playing Doctor Foggerty in Julia Davis's award-winning dark comedy Hunderby, producer David Wilkes in W1A, and Miles Mollison in the BBC television mini series The Casual Vacancy. He also played Terry Jones in the BBC Four BAFTA-nominated Holy Flying Circus, Cosmo in comedy-drama Stag, and Tom in Julia Davis's Camping. In 2006, Jones appeared as the journalist in series 2 episode 3 of the BBC comedy Extras.\n\nOther credits include Mongrels (in which he voiced Nelson the fox), William & Sinclair for Sky Atlantic's Common Ground season, Episodes, It's Kevin, The Wrong Mans, Fresh Meat (series 2), Toast of London, House of Fools, Extras, Lead Balloon, Peep Show, Crooked House, The Increasingly Poor Decisions of Todd Margaret, Love Soup, Katy Brand's Big Ass Show, Green Green Grass, My Family, Losing It, Secret Smile, White Teeth, and Edge of Heaven. In 2011, Jones starred in the one-off BBC Christmas show Lapland.\n\nHis 2013 role as Nick Edwards, the slimy opposing candidate to Bob Servant, brought him recognition in the cult BBC Four Neil Forsyth comedy Bob Servant.\n\nJones has written for Angelos Epithemiou, Mitchell & Webb, the MTV series Fur TV, Jon Culshaw and many others. He was script consultant on E4's Cardinal Burns.\n\nIn 2012, he began portraying entrepreneur James Reed in adverts for reed.co.uk.\n\nAs a voiceover artist, Jones has worked on numerous commercials, as well as games such as Fable III, Killzone and Xenoblade Chronicles. In 2016, he joined the voice cast of Thomas & Friends, as the voice of Flying Scotsman. Most recently, he has voiced Vermis in Robozuna for ITV/Netflix, various characters in Sadie Sparks for Disney, Constantin in 101 Dalmatian Street for Disney, and is the narrator for the Little Princess.\n\nIn 2016, he played Coulson in the BAFTA nominated psychological thriller The Ghoul (directed by Gareth Tunley), and starred as Richard in the West End production of Dead Funny at the Vaudeville Theatre in London.\n\nMore recent film work includes Paddington and Woody in The Foreigner with Jackie Chan and Pierce Brosnan. He also played Bernard Delfont in Stan & Ollie with Steve Coogan and John C. Reilly, released in January 2019.\n\nIn 2018, Jones starred with Anna Paquin in Flack for Pop/W channel, released in February 2019. He also filmed Home, a 6 part series for Channel 4, that he also wrote, which began airing in March 2019. A second series was broadcast in February and March 2020.[13]",
        "birthday": "1975-05-17",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.independenttalent.com/writers/rufus-jones/",
        "id": 429541,
        "imdb_id": "nm1257480",
        "known_for_department": "Acting",
        "name": "Rufus Jones",
        "place_of_birth": " London, England, UK",
        "popularity": 0.1797,
        "profile_path": "/sGgwNVXCvDOC4x9CtJqQAFida8N.jpg"
    }
}