{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/67HggiWaP9ZLv5sPYmyRV37yAJM.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749
                ],
                "id": 13,
                "original_language": "en",
                "original_title": "Forrest Gump",
                "overview": "A man with a low IQ has accomplished great things in his life and been present during significant historic events—in each case, far exceeding what anyone imagined he could do. But despite all he has achieved, his one true love eludes him.",
                "popularity": 15.8646,
                "poster_path": "/arw2vcBveWOVZr6pxd9XTd1TdQa.jpg",
                "release_date": "1994-06-23",
                "title": "Forrest Gump",
                "video": false,
                "vote_average": 8.5,
                "vote_count": 28632,
                "character": "Football Fan (uncredited)",
                "credit_id": "55d0ccbac3a3684453006766",
                "order": 122
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Sara St. James",
            "Jacqueline Nyahay",
            "Jackie Lovell",
            "Andie Mcpherson",
            "Sara"
        ],
        "biography": "Jacqueline Lovell (born 9 December 1974) is an American actress born and raised in Southern California. Most of her roles have been in B-films and erotic movies.  From a very young age, she had the immense innate talent and enthusiasm for performance. She expressed this through school musicals and church plays from grade school through high school. In much of her free time, she was writing skits and performing them for her family. She attended many schools during her formative years, which instilled drive and independence in her. At eighteen, she went to Santa Monica College to pursue accounting and later landed a full time job as an accountant.\n\nHowever, she quickly realized her hunger was not being fulfilled. So she set sail and journeyed into the world of modeling. She quickly became the number one nude model in 1995 and was in over 150 magazines by '96. She completed more than 80 videos for Playboy, Penthouse and numerous independents.  After being in the industry for one year, Jacqueline's desire to grow as a person led her to acting classes. As she studied her craft, her vocation became clear. She was cast in lead roles for Full Moon Entertainment, Zalman King Productions, Mystique Films, and many more.",
        "birthday": "1974-12-09",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 42961,
        "imdb_id": "nm0522550",
        "known_for_department": "Acting",
        "name": "Jacqueline Lovell",
        "place_of_birth": "Southern California, California, USA",
        "popularity": 0.6538,
        "profile_path": "/l07AerIqrXqVBUqY50v5urhhkvT.jpg"
    }
}