{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/38uM6QuI06znUCELfOSiVQy05CX.jpg",
                "genre_ids": [
                    37
                ],
                "id": 301,
                "original_language": "en",
                "original_title": "Rio Bravo",
                "overview": "A small-town sheriff in the American West enlists the help of a disabled man, a drunk, and a young gunfighter in his efforts to hold in jail the brother of the local bad guy.",
                "popularity": 5.5199,
                "poster_path": "/4gI4KKmoi0d3yfsF71YU3S0I5t8.jpg",
                "release_date": "1959-03-18",
                "title": "Rio Bravo",
                "video": false,
                "vote_average": 7.813,
                "vote_count": 1204,
                "character": "Colorado Ryan",
                "credit_id": "52fe4234c3a36847f800c0c5",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Eric Hilliard Nelson",
            "Rick Nelson",
            "ریکی نلسون"
        ],
        "biography": "Eric Hilliard Nelson (May 8, 1940 – December 31, 1985), better known as Ricky Nelson or Rick Nelson, was an American singer-songwriter, instrumentalist, and actor. He placed fifty-three songs on the Billboard Hot 100 between 1957 and 1973, including nineteen top-ten hits, and was inducted into the Rock and Roll Hall of Fame on January 21, 1987.\n\nNelson began his entertainment career in 1949 playing himself in the radio sitcom series, The Adventures of Ozzie and Harriet, and, in 1952, appeared in his first feature film, Here Come the Nelsons. In 1957, he recorded his first single, debuted as a singer on the television version of the sitcom, and recorded a number one album, Ricky. In 1958, Nelson recorded his first number one single, \"Poor Little Fool\", and, in 1959, received a Golden Globe Most Promising Male Newcomer nomination after starring in the western film, Rio Bravo. A few films followed, and, when the television series was cancelled in 1966, Nelson made occasional appearances as a guest star on various television programs.\n\nNelson and Sharon Kristin Harmon were married on April 20, 1963, and divorced in December 1982. They had four children: Tracy Kristine, twin sons Gunnar Eric and Matthew Gray, and Sam Hilliard. On February 14, 1981, a son was born to Nelson and Georgeann Crewe. A blood test in 1985 confirmed Nelson was the child's father. Nelson was engaged to Helen Blair at the time of his death in an airplane crash on December 31, 1985.",
        "birthday": "1940-05-08",
        "deathday": "1985-12-31",
        "gender": 2,
        "homepage": null,
        "id": 4300,
        "imdb_id": "nm0625699",
        "known_for_department": "Acting",
        "name": "Ricky Nelson",
        "place_of_birth": "Teaneck, New Jersey, U.S.",
        "popularity": 0.3549,
        "profile_path": "/fvWAXwzWngbafC2DrCHjDPM0tfO.jpg"
    }
}