{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/D3eDUNEzJPBDG3TCJcR7RyRgTA.jpg",
                "genre_ids": [
                    18,
                    28
                ],
                "id": 96721,
                "original_language": "en",
                "original_title": "Rush",
                "overview": "In the 1970s, a rivalry propels race car drivers Niki Lauda and James Hunt to fame and glory — until a horrible accident threatens to end it all.",
                "popularity": 10.1157,
                "poster_path": "/cyfncP1YKDNcGb0agE7RQr6UOYr.jpg",
                "release_date": "2013-09-02",
                "title": "Rush",
                "video": false,
                "vote_average": 7.727,
                "vote_count": 7475,
                "character": "John Hogan",
                "credit_id": "53054af592514134940a13f8",
                "order": 15
            },
            {
                "adult": false,
                "backdrop_path": "/ra9surFrWYvIL0pWcm3MrxmPhTg.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 90369,
                "original_language": "en",
                "original_title": "Now Is Good",
                "overview": "A girl dying of leukemia compiles a list of things she'd like to do before passing away. Topping the list is her desire to lose her virginity.",
                "popularity": 2.1683,
                "poster_path": "/oOBHF6qWtMkzwpnrLDTKJPAb3zH.jpg",
                "release_date": "2012-09-19",
                "title": "Now Is Good",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1089,
                "character": "Richard",
                "credit_id": "5847b1c092514119ad005b8c",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Patrick Bashir Baladi",
            "پاتریک بالادی"
        ],
        "biography": "Patrick Bashir Baladi is an English actor. He is best known for playing Neil Godwin in the BBC sitcom The Office, Michael Jackson in the Sky 1 drama Stella, and Stephen Holmes in the ITV thriller Marcella.\n\nPatrick Bashir Baladi was born in Sutton Coldfield, West Midlands. His father was a Syrian gynaecologist and obstetrician, and his mother a midwife.\n\nBaladi was brought up in Libya and educated at Stonyhurst College.\n\nAfter school he went on to train as an actor at the Central School of Speech and Drama.\n\nBaladi is known for his portrayal of David Brent's nemesis, Neil Godwin, in the BBC's hit comedy-mockumentary series, The Office. He appeared in the second and final series of the award-winning show, as well as the subsequent The Office Christmas Special.\n\nIn addition to The Office, Baladi has appeared in various films and television shows, including Bodies, Kidnap and Ransom, as Philip Shaffer, ITV (2011), Alpha Male, Bridget Jones: The Edge of Reason, Beyond The Pole, POW, Lady Audley's Secret, Grafters, Silent Witness, The International, Party Animals, Mistresses, Rev., Sensitive Skin, Privates, Stella, Line of Duty, A Touch of Frost and Midsomer Murders.\n\nBaladi portrayed Dodi Al-Fayed in the 2007 television docudrama Diana: Last Days of a Princess. In 2008 he had a small role in the romantic comedy Last Chance Harvey, appearing alongside Emma Thompson. He is also a stage actor who has appeared in numerous productions by the Royal Shakespeare Company, such as Hamlet and Much Ado About Nothing. He starred in the comedy No Heroics as Excelsor.",
        "birthday": "1971-12-25",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.unitedagents.co.uk/patrick-baladi",
        "id": 43019,
        "imdb_id": "nm0049346",
        "known_for_department": "Acting",
        "name": "Patrick Baladi",
        "place_of_birth": "Sutton Coldfield, West Midlands, England, UK",
        "popularity": 0.9768,
        "profile_path": "/aquPqJZgWRw8JAbaYqURLfxr5RN.jpg"
    }
}