{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/38uM6QuI06znUCELfOSiVQy05CX.jpg",
                "genre_ids": [
                    37
                ],
                "id": 301,
                "original_language": "en",
                "original_title": "Rio Bravo",
                "overview": "A small-town sheriff in the American West enlists the help of a disabled man, a drunk, and a young gunfighter in his efforts to hold in jail the brother of the local bad guy.",
                "popularity": 5.654,
                "poster_path": "/4gI4KKmoi0d3yfsF71YU3S0I5t8.jpg",
                "release_date": "1959-03-18",
                "title": "Rio Bravo",
                "video": false,
                "vote_average": 7.813,
                "vote_count": 1204,
                "character": "Nathan Burdette",
                "credit_id": "52fe4234c3a36847f800c0d5",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/9AjG0YJLgDUtHl5KgrThHPhNNwZ.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 3083,
                "original_language": "en",
                "original_title": "Mr. Smith Goes to Washington",
                "overview": "After the death of a United States Senator, idealistic Jefferson Smith is appointed as his replacement in Washington. Soon, the naive and earnest new senator has to battle political corruption.",
                "popularity": 2.8661,
                "poster_path": "/nDjg1fbNyq15excNDl3acd2IqAk.jpg",
                "release_date": "1939-10-19",
                "title": "Mr. Smith Goes to Washington",
                "video": false,
                "vote_average": 7.843,
                "vote_count": 1118,
                "character": "Hopper Boy",
                "credit_id": "52fe4384c3a36847f805a00f",
                "order": 20
            },
            {
                "adult": false,
                "backdrop_path": "/lSH1j2uChyuxKmslXRf1AGyi43p.jpg",
                "genre_ids": [
                    37,
                    18
                ],
                "id": 8879,
                "original_language": "en",
                "original_title": "Pale Rider",
                "overview": "A mysterious preacher protects a humble prospector village from a greedy mining company trying to encroach on their land.",
                "popularity": 5.1862,
                "poster_path": "/kpAN5WnDEVWYzMDPkXHTbrDQuak.jpg",
                "release_date": "1985-06-28",
                "title": "Pale Rider",
                "video": false,
                "vote_average": 7.167,
                "vote_count": 1131,
                "character": "Stockburn",
                "credit_id": "53a2e3360e0a26227c00155b",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/kXsjmuBgRzsujspv4BiHsIgzOnD.jpg",
                "genre_ids": [
                    37
                ],
                "id": 10747,
                "original_language": "en",
                "original_title": "The Outlaw Josey Wales",
                "overview": "After avenging his family's brutal murder, Wales is pursued by a pack of soldiers. He prefers to travel alone, but ragtag outcasts are drawn to him - and Wales can't bring himself to leave them unprotected.",
                "popularity": 4.0518,
                "poster_path": "/92BZIFPbyCPNhExyFScxA3xF1dy.jpg",
                "release_date": "1976-06-30",
                "title": "The Outlaw Josey Wales",
                "video": false,
                "vote_average": 7.44,
                "vote_count": 1209,
                "character": "Bloody Bill Anderson",
                "credit_id": "54d79a4ac3a3683b890061ef",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "John Lawrence Russell",
            "جان راسل"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nJohn Lawrence Russell was an American actor, and World War II veteran, most noted for playing Marshal Dan Troop in the successful ABC western television series Lawman from 1958 to 1962, and his lead role as international adventurer Tim Kelly in the syndicated TV series Soldiers of Fortune from 1955 to 1957.\n\nRussell signed a contract with 20th Century Fox in 1945 and made his first film appearance as a guard in A Royal Scandal. He played several supporting parts while at Fox, acting the role of a junior law partner in the Clifton Webb comedy Sitting Pretty, as well as a navy pilot in Slattery's Hurricane. Later, however, he signed with Republic Pictures where he was cast in a starring role.\n\nIn 1955, Russell landed the lead role in a television drama series called Soldiers of Fortune. In 1958, Russell was cast in his best-known role: the stolid, taciturn Marshal Dan Troop, the lead character in Lawman, an ABC/Warners hit western series that ran for four years. Co-starring alongside Peter Brown, who played Deputy Johnny McKay, and Peggie Castle as Birdcage Saloon owner Lily Merrill, Russell portrayed a US frontier peace officer mentoring his younger compatriot. At the same time that Lawman premiered, Russell played an outlaw, along with Edd Byrnes and Rodolfo Hoyos Jr., in the 1958 season premiere episode of Sugarfoot, another ABC/WB hit western, with Will Hutchins in the title role.\n\nRussell also appeared in other motion pictures for Warner Bros., notably as a Sioux chieftain in Yellowstone Kelly, as well as a rich corrupt cattle-rancher, Nathan Burdette, in the highly successful Howard Hawks western Rio Bravo, starring John Wayne.\n\nThroughout the remainder of his movie career, he played secondary roles in more than 20 films, including several A.C. Lyles westerns and three films directed by his friend Clint Eastwood, most notably as Marshal Stockburn, the chief villain in Eastwood's 1985 film, Pale Rider.\n\nRussell also appeared in the second season of the Filmation children's science-fiction series Jason of Star Command. He played Commander Stone, a blue-skinned alien from Alpha Centauri. He replaced James Doohan, who had played the commander in the previous season, but left to start working on Star Trek: The Motion Picture\n\nDescription above from the Wikipedia article John Russell (actor), licensed under CC-BY-SA, full list of contributors on Wikipedia.​",
        "birthday": "1921-01-03",
        "deathday": "1991-01-19",
        "gender": 2,
        "homepage": null,
        "id": 4304,
        "imdb_id": "nm0751245",
        "known_for_department": "Acting",
        "name": "John Russell",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.5701,
        "profile_path": "/dtpDGQCHdouu55aoRrMniBBOFlY.jpg"
    }
}