{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rsI82F7DadIQcrZyPbuwmkhN5ty.jpg",
                "genre_ids": [
                    35
                ],
                "id": 3034,
                "original_language": "en",
                "original_title": "Young Frankenstein",
                "overview": "A young neurosurgeon inherits the castle of his grandfather, the famous Dr. Victor von Frankenstein. In the castle he finds a funny hunchback, a pretty lab assistant and the elderly housekeeper. Young Frankenstein believes that the work of his grandfather was delusional, but when he discovers the book where the mad doctor described his reanimation experiment, he suddenly changes his mind.",
                "popularity": 3.7696,
                "poster_path": "/c6335WJCZO8NK5wehHk5sA9Cypv.jpg",
                "release_date": "1974-12-15",
                "title": "Young Frankenstein",
                "video": false,
                "vote_average": 7.867,
                "vote_count": 3248,
                "character": "Villager Screaming at the Monster From the Bars (uncredited)",
                "credit_id": "55fe71cb925141529f002b71",
                "order": 32
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            " Clement Franckenstein ",
            "Clement St. George ",
            "Clem St. George ",
            "Clement von Franchenstein ",
            "Clement von Frankenstein",
            " Clement George Freiherr von und zu Franckenstein "
        ],
        "biography": "Clement George Freiherr von und zu Franckenstein (May 28, 1944 – May 9, 2019) was the son of Georg Freiherr von und zu Franckenstein, born in 1878, later Sir George Franckenstein, the former Austrian Ambassador to the Court of St. James. George Franckenstein had been the Austrian Minister in London for eighteen years when the Nazis took over Austria (1938) and recalled him. Instead he stayed in London, was naturalized a British subject, and knighted on 26 July 1938. There he met and married Editha King on 31 July 1939, by whom he had Clement George. His parents were killed together in a plane crash on 15 October 1953, after which he was raised by British friends. He was educated at Eton College and served for three years as a lieutenant in the Royal Scots Greys in the Middle East and Germany. He holds both British and Austrian citizenship. he studied opera for about three years, was baritone going up to tenor, was good but not really good enough to be a professional, so he decided to become an actor. Until the time he came to US, he sang in nightclubs and had a lot of performing experience before getting into acting at age 27. His first job was in the mini-series \"QB VII\" (1974) starring Ben Gazzara and Lee Remick. IMDb Mini Biography By: 'Rudolf Ulrich', Gruenwald n. Munich, Germany",
        "birthday": "1944-05-28",
        "deathday": "2019-05-09",
        "gender": 2,
        "homepage": null,
        "id": 43115,
        "imdb_id": "nm0820527",
        "known_for_department": "Acting",
        "name": "Clement von Franckenstein",
        "place_of_birth": "Sunninghill, Buckingham, England, UK",
        "popularity": 0.1839,
        "profile_path": "/3MC0muNTGzt1zVN5EW49M55PFG5.jpg"
    }
}