{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/vyOFlV1afDHb9MMwJVyON4qXbvC.jpg",
                "genre_ids": [
                    10751,
                    12,
                    16,
                    28
                ],
                "id": 9732,
                "original_language": "en",
                "original_title": "The Lion King II: Simba's Pride",
                "overview": "The circle of life continues for Simba, now fully grown and in his rightful place as the king of Pride Rock. Simba and Nala have given birth to a daughter, Kiara who's as rebellious as her father was. But Kiara drives her parents to distraction when she catches the eye of Kovu, the son of the evil lioness, Zira. Will Kovu steal Kiara's heart?",
                "popularity": 9.5353,
                "poster_path": "/sWR1x6UCMCGN9xEf8RGhPS934X0.jpg",
                "release_date": "1998-10-24",
                "title": "The Lion King II: Simba's Pride",
                "video": false,
                "vote_average": 6.946,
                "vote_count": 4545,
                "character": "Nuka (voice)",
                "credit_id": "52fe4524c3a36847f80bead9",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/5ORjzDMq26GI82COSnJngXm5Kww.jpg",
                "genre_ids": [
                    99,
                    18,
                    35
                ],
                "id": 469019,
                "original_language": "en",
                "original_title": "Jim & Andy: The Great Beyond",
                "overview": "Offbeat documentarian Chris Smith provides a behind-the-scenes look at how Jim Carrey adopted the persona of idiosyncratic comedian Andy Kaufman on the set of Man on the Moon.",
                "popularity": 1.3844,
                "poster_path": "/kKzopOFXz9YfsCTqg3XpF0GoypX.jpg",
                "release_date": "2017-09-05",
                "title": "Jim & Andy: The Great Beyond",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 702,
                "character": "Self",
                "credit_id": "5a0fa6b0c3a368628f01ed56",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "اندی دیک"
        ],
        "biography": "Andrew Roane Dick (born Andrew Thomlinson; December 21, 1965) is an American actor and comedian. Dick was born in Charleston, South Carolina, and joined The Second City and studied improvisational theater. Dick has had a long career as a stand-up comedian; he has appeared throughout the U.S., has released several comedy albums, and has acted in television and film. Dick's first regular television role was on The Ben Stiller Show on Fox. In the mid-1990s, he regularly appeared on NBC's NewsRadio and as a supporting character on Less than Perfect. He also had two short-lived television series on MTV; these were the sketch comedy series The Andy Dick Show (2001) and the reality series The Assistant (2004). He also is noted for his behavior on a number of Comedy Central Roasts, stand-up comedy performances, and late night talk show appearances.\n\nDick is also known for his eccentric behavior, problems with drug addiction, and allegations of sexual misconduct and arrests. Dick has said he has tried to deal with his drug and alcohol-use disorders for years and by 2016, he said he had undergone drug rehabilitation programs 20 times. In 2022, after a conviction for a 2018 offense, Dick was ordered to register as a sex offender.\n\nDescription above from the Wikipedia article Andy Dick, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1965-12-21",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 43120,
        "imdb_id": "nm0004873",
        "known_for_department": "Acting",
        "name": "Andy Dick",
        "place_of_birth": "Charleston, South Carolina, USA",
        "popularity": 0.8077,
        "profile_path": "/n4WT4oYoYrzSGAanlWPsneCzBPk.jpg"
    }
}