{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/76VwduxQMkVXOUktps85dE0lLeP.jpg",
                "genre_ids": [
                    12,
                    18,
                    36
                ],
                "id": 19666,
                "original_language": "hi",
                "original_title": "लगान",
                "overview": "In 1890s India, an arrogant British commander challenges the harshly taxed residents of Champaner to a high-stakes cricket match.",
                "popularity": 4.9112,
                "poster_path": "/yNX9lFRAFeNLNRIXdqZK9gYrYKa.jpg",
                "release_date": "2001-06-15",
                "title": "Lagaan: Once Upon a Time in India",
                "video": false,
                "vote_average": 7.253,
                "vote_count": 602,
                "character": "Captain Andrew Russell",
                "credit_id": "52fe47e99251416c750a99b5",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/8EKxPfuEMg1qP0E1r1ZAk56J7MP.jpg",
                "genre_ids": [
                    28,
                    16,
                    878,
                    14
                ],
                "id": 76589,
                "original_language": "en",
                "original_title": "Justice League: Doom",
                "overview": "An adaptation of Mark Waid's \"Tower of Babel\" story from the JLA comic. Vandal Savage steals confidential files Batman has compiled on the members of the Justice League, and learns all their weaknesses.",
                "popularity": 2.5578,
                "poster_path": "/seCbcjdZYUl8SRKjeWfyi2ngzFj.jpg",
                "release_date": "2012-02-28",
                "title": "Justice League: Doom",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 901,
                "character": "Metallo (voice)",
                "credit_id": "52fe4942c3a368484e1227bb",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/bFntIQxWBwtzYAFc68xF1GKAfiv.jpg",
                "genre_ids": [
                    16,
                    10751,
                    14
                ],
                "id": 17979,
                "original_language": "en",
                "original_title": "A Christmas Carol",
                "overview": "Miser Ebenezer Scrooge is awakened on Christmas Eve by spirits who reveal to him his own miserable existence, what opportunities he wasted in his youth, his current cruelties, and the dire fate that awaits him if he does not change his ways. Scrooge is faced with his own story of growing bitterness and meanness, and must decide what his own future will hold: death or redemption.",
                "popularity": 5.3621,
                "poster_path": "/goHDZUnqZJ7FN4h48Qh6MzJNExl.jpg",
                "release_date": "2009-11-04",
                "title": "A Christmas Carol",
                "video": false,
                "vote_average": 6.892,
                "vote_count": 4727,
                "character": "Guest #3 / Business Man #2 (voice)",
                "credit_id": "5a24dda492514103240d2b0d",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Πολ Μπλάκθορν",
            "پل بلکثورن"
        ],
        "biography": "Accomplished British actor Paul Blackthorne returned to primetime TV fall 2012 as determined Detective Quentin Lance on the CW’s hit series ‘Arrow’.  This role follows that of manipulative reality show producer Clark Quietly in ABC’s paranormal thriller ‘The River’. Recently he has also appeared opposite Ted Danson in ‘CSI’ and Callie Thorne in ‘Necessary Roughness’.\n\nBlackthorne was born in Shropshire, England, 1969. Blackthorne had his first acting experience at the age of 12 with the National Youth Music Theatre at the Edinburgh festival in 1981. Later he went on to study the Spiritual Psychology of Acting in London from 1996-98 before earning his first roles in British TV and film.\n\nIn 2000 he found himself in India portraying the villainous Captain Russell in the Oscar-nominated film ‘Lagaan’. The Oscar campaign brought him to Los Angeles where he went on to appear in many American TV shows including ‘24’, ‘ER’, ‘The Dresden Files’, ‘Lipstick Jungle’, ‘Deadwood’ and ‘Burn Notice’. On the feature side, he has appeared in ‘Four corners of suburbia, ‘Special’ and “A Christmas Carol.”\n\nAlongside acting Blackthorne spent much of the 90’s traveling the world and exhibiting his photography in London. His first exhibition entitled ‘Fish Heads and other things’ raised money for Greenpeace. Another, ‘Bollywood Backpack’ raised money for the Gujarat Indian earthquake victims.\n\nThe last exhibition he held, ‘Delhi to Manhattan’, took place at Tibet House, New York in April 2009. This exhibition (view here) chronicles a journey through India trekking in the Himalayan-Tibetan communities and meeting with the Dalai Lama in Dharmsala as part of ‘The Missing Peace’ project. Proceeds from this exhibition went to the Tibetan children’s villages in India.\n\nRecently Paul completed a documentary he produced with acclaimed Australian photographer Mister Basquali entitled ‘This American Journey’. Blackthorne’s directorial debut tells the story of the two men traveling across America interviewing everyday Americans about how they feel about the state of the country and their hopes for its future. Along the way, stereotypes are shattered and wisdom found in the most unexpected places.\n\nIn the meantime ‘Arrow’ was nominated for best new drama at the People’s choice awards 2013, ‘This American Journey’ is being submitted to film festivals and in partnership with musician James Carrington, Blackthorne is releasing an innovative app called ‘Forte’ teaching children how to read music.",
        "birthday": "1969-03-05",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.paulblackthorne.com/",
        "id": 43231,
        "imdb_id": "nm0085860",
        "known_for_department": "Acting",
        "name": "Paul Blackthorne",
        "place_of_birth": "Wellington, Shropshire, England",
        "popularity": 0.5196,
        "profile_path": "/3OC1M0rKJO8B3JpwAeavk5EAscl.jpg"
    }
}