{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/40Rl5nZRxXQ4kHV4Lhghj5iQZZN.jpg",
                "genre_ids": [
                    53,
                    10749,
                    9648
                ],
                "id": 303,
                "original_language": "en",
                "original_title": "Notorious",
                "overview": "In order to help bring Nazis to justice, U.S. government agent T.R. Devlin recruits Alicia Huberman, the American daughter of a convicted German war criminal, as a spy. As they begin to fall for one another, Alicia is instructed to win the affections of Alexander Sebastian, a Nazi hiding out in Brazil. When Sebastian becomes serious about his relationship with Alicia, the stakes get higher, and Devlin must watch her slip further undercover.",
                "popularity": 3.9227,
                "poster_path": "/4RERYb1NIQrJHYY5e8nUlYM7t2z.jpg",
                "release_date": "1946-08-21",
                "title": "Notorious",
                "video": false,
                "vote_average": 7.742,
                "vote_count": 1664,
                "character": "Captain Paul Prescott",
                "credit_id": "52fe4235c3a36847f800c22b",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/nVpp3ZcIFtJJ3fJp65eJczehIN8.jpg",
                "genre_ids": [
                    35,
                    10752
                ],
                "id": 3063,
                "original_language": "en",
                "original_title": "Duck Soup",
                "overview": "Rufus T. Firefly is named president/dictator of bankrupt Freedonia and declares war on neighboring Sylvania over the love of wealthy Mrs. Teasdale.",
                "popularity": 2.3339,
                "poster_path": "/31t63plEGKHhYuuCpC9bFWO9SBS.jpg",
                "release_date": "1933-11-12",
                "title": "Duck Soup",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 816,
                "character": "Ambassador Trentino",
                "credit_id": "52fe4381c3a36847f8059449",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/pDGkMdMHkl1qRAYmQjdLKVx3euQ.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 16958,
                "original_language": "en",
                "original_title": "The Asphalt Jungle",
                "overview": "Recently paroled from prison, legendary burglar \"Doc\" Riedenschneider, with funding from Alonzo Emmerich, a crooked lawyer, gathers a small group of veteran criminals together in the Midwest for a big jewel heist.",
                "popularity": 5.5699,
                "poster_path": "/8xsUnT0P2fJWQv9jGDhs3i9Zx2l.jpg",
                "release_date": "1950-05-12",
                "title": "The Asphalt Jungle",
                "video": false,
                "vote_average": 7.493,
                "vote_count": 504,
                "character": "Alonzo D. Emmerich",
                "credit_id": "52fe46f99251416c75089cdf",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Carl Henry Vogt",
            "Louis Calhearn"
        ],
        "biography": "Carl Henry Vogt (February 19, 1895 – May 12, 1956), known professionally as Louis Calhern, was an American stage and screen actor. For portraying Oliver Wendell Holmes in the film The Magnificent Yankee (1950), he was nominated for an Academy Award for Best Actor.  Calhern began working in silent films for director Lois Weber in the early 1920s; the most notable being The Blot in 1921. A 1921 newspaper article commented, \"The new arrival in stardom is Louis Calhern, who, until Miss Weber engaged him to enact the leading male role in What's Worth While?, had been playing leads in the Morosco Stock company of Los Angeles.\"\n\nIn 1923 Calhern left the movies, but would return to the screen eight years later after the advent of sound pictures. He was primarily cast as a character actor in films while he continued to play leading roles on the stage. He reached his peak in the 1950s as a Metro-Goldwyn-Mayer contract player. Among his many memorable screen roles were Ambassador Trentino in the Marx Brothers classic Duck Soup (1933) and three that he appeared in at MGM in 1950: a singing role as Buffalo Bill in the film version of the musical Annie Get Your Gun, the double-crossing lawyer and sugar-daddy to Marilyn Monroe in John Huston's film noir The Asphalt Jungle, and his Oscar-nominated performance as Oliver Wendell Holmes in The Magnificent Yankee (re-creating his role from the Broadway stage). He was also praised for his portrayal of the title role in the John Houseman production of Julius Caesar (adapted from the Shakespeare play) in 1953, directed by Joseph L. Mankiewicz. Calhern also played the role of the devious George Caswell, the manipulative board member of Tredway Corporation in the 1954 production of Executive Suite.\n\nCalhern's other film roles included the grandfather in The Red Pony (1949), adapted from the novel by John Steinbeck and starring Robert Mitchum, and the spy boss of Cary Grant in the Alfred Hitchcock suspense classic Notorious (1946). A performance as Uncle Willie in High Society (1956), a musical remake of The Philadelphia Story, turned out to be his final film.\n\nDescription above from the Wikipedia article Louis Calhern, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1895-02-18",
        "deathday": "1956-05-12",
        "gender": 2,
        "homepage": null,
        "id": 4343,
        "imdb_id": "nm0129894",
        "known_for_department": "Acting",
        "name": "Louis Calhern",
        "place_of_birth": "Brooklyn [now in New York City], New York, USA",
        "popularity": 0.2129,
        "profile_path": "/80l4tBYFQ08GLFk9wjilThyM8H.jpg"
    }
}