{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bbec0wDUaV8nQnQHC6Fb0fSYwNM.jpg",
                "genre_ids": [
                    53,
                    18
                ],
                "id": 982,
                "original_language": "en",
                "original_title": "The Manchurian Candidate",
                "overview": "Near the end of the Korean War, a platoon of U.S. soldiers is captured by communists and brainwashed. Following the war, the platoon is returned home, and Sergeant Raymond Shaw is lauded as a hero by the rest of his platoon. However, the platoon commander, Captain Bennett Marco, finds himself plagued by strange nightmares and soon races to uncover a terrible plot.",
                "popularity": 6.1899,
                "poster_path": "/2xQ856kd9hw6bB3OnusGyTvvkwB.jpg",
                "release_date": "1962-10-24",
                "title": "The Manchurian Candidate",
                "video": false,
                "vote_average": 7.527,
                "vote_count": 753,
                "character": "Capt./Maj. Bennett Marco",
                "credit_id": "52fe4296c3a36847f802a3c3",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/kpTTUyVxWMTebmBkaxB2YAX8yyU.jpg",
                "genre_ids": [
                    10752,
                    10749,
                    18
                ],
                "id": 11426,
                "original_language": "en",
                "original_title": "From Here to Eternity",
                "overview": "In 1941 Hawaii, a private is cruelly punished for not boxing on his unit's team, while his captain's wife and second in command are falling in love.",
                "popularity": 3.2305,
                "poster_path": "/25Rm1YJSyhXAEu8abonZvW83aPL.jpg",
                "release_date": "1953-08-28",
                "title": "From Here to Eternity",
                "video": false,
                "vote_average": 7.283,
                "vote_count": 669,
                "character": "Pvt. Angelo Maggio",
                "credit_id": "52fe443d9251416c7502dbdd",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/udIE8Cdon9wnYmVIOFYrBPfA2Mq.jpg",
                "genre_ids": [
                    14,
                    16,
                    35,
                    80
                ],
                "id": 856,
                "original_language": "en",
                "original_title": "Who Framed Roger Rabbit",
                "overview": "'Toon star Roger is worried that his wife Jessica is playing pattycake with someone else, so the studio hires detective Eddie Valiant to snoop on her. But the stakes are quickly raised when Marvin Acme is found dead and Roger is the prime suspect.",
                "popularity": 5.972,
                "poster_path": "/lYfRc57Kx9VgLZ48iulu0HKnM15.jpg",
                "release_date": "1988-06-22",
                "title": "Who Framed Roger Rabbit",
                "video": false,
                "vote_average": 7.531,
                "vote_count": 5937,
                "character": "Singing Sword (voice) (archive sound)",
                "credit_id": "64257f6ba3e4ba0077923bec",
                "order": 43
            },
            {
                "adult": false,
                "backdrop_path": "/m7ynwXIvSnhxQPR6pOICrC0L2sO.jpg",
                "genre_ids": [
                    878,
                    18
                ],
                "id": 335984,
                "original_language": "en",
                "original_title": "Blade Runner 2049",
                "overview": "Thirty years after the events of the first film, a new blade runner, LAPD Officer K, unearths a long-buried secret that has the potential to plunge what's left of society into chaos. K's discovery leads him on a quest to find Rick Deckard, a former LAPD blade runner who has been missing for 30 years.",
                "popularity": 20.9551,
                "poster_path": "/gajva2L0rPYkEWjzgFlBXCAVBE5.jpg",
                "release_date": "2017-10-04",
                "title": "Blade Runner 2049",
                "video": false,
                "vote_average": 7.586,
                "vote_count": 14390,
                "character": "(archive footage) (uncredited)",
                "credit_id": "657a3fb3ec8a430137005feb",
                "order": 39
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Francis Albert Sinatra"
        ],
        "biography": "Francis Albert \"Frank\" Sinatra was an American singer and actor. Beginning his musical career in the swing era with Harry James and Tommy Dorsey, Sinatra became a successful solo artist in the early to mid-1940s, being the idol of the \"bobby soxers\".\n\nHis professional career had stalled by the 1950s, but it was reborn in 1954 after he won the Academy Award for Best Supporting Actor (for his performance in From Here to Eternity). He signed with Capitol Records and released several critically lauded albums (such as In the Wee Small Hours, Songs for Swingin' Lovers, Come Fly with Me, Only the Lonely and Nice 'n' Easy). Sinatra left Capitol to found his own record label, Reprise Records (finding success with albums such as Ring-A-Ding-Ding, Sinatra at the Sands and Francis Albert Sinatra & Antonio Carlos Jobim), toured internationally, was a founding member of the Rat Pack and fraternized with celebrities and statesmen, including John F. Kennedy.\n\nSinatra turned 50 in 1965, recorded the retrospective September of My Years, starred in the Emmy-winning television special Frank Sinatra: A Man and His Music, and scored hits with \"Strangers in the Night\" and \"My Way\". With sales of his music dwindling and after appearing in several poorly received films, Sinatra retired for the first time in 1971. Two years later, however, he came out of retirement and in 1973 recorded several albums, scoring a Top 40 hit with \"(Theme From) New York, New York\" in 1980. Using his Las Vegas shows as a home base, he toured both within the United States and internationally, until a short time before his death in 1998.\n\nSinatra also forged a successful career as a film actor, winning the Academy Award for Best Supporting Actor for his performance in From Here to Eternity, a nomination for Best Actor for The Man with the Golden Arm, and critical acclaim for his performance in The Manchurian Candidate. He also starred in such musicals as High Society, Pal Joey, Guys and Dolls and On the Town. Sinatra was honored at the Kennedy Center Honors in 1983 and was awarded the Presidential Medal of Freedom by Ronald Reagan in 1985 and the Congressional Gold Medal in 1997. Sinatra was also the recipient of eleven Grammy Awards, including the Grammy Trustees Award, Grammy Legend Award and the Grammy Lifetime Achievement Award.",
        "birthday": "1915-12-12",
        "deathday": "1998-05-14",
        "gender": 2,
        "homepage": null,
        "id": 4347,
        "imdb_id": "nm0000069",
        "known_for_department": "Acting",
        "name": "Frank Sinatra",
        "place_of_birth": "Hoboken, New Jersey, USA",
        "popularity": 0.4887,
        "profile_path": "/dafKPsivu50RdChBSrgGmMRenYt.jpg"
    }
}