{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3aGsZdB5ud6LmU9lppwTLh2fqH1.jpg",
                "genre_ids": [
                    878,
                    28,
                    12,
                    53
                ],
                "id": 16320,
                "original_language": "en",
                "original_title": "Serenity",
                "overview": "When the renegade crew of Serenity agrees to hide a fugitive on their ship, they find themselves in an action-packed battle between the relentless military might of a totalitarian regime who will destroy anything – or anyone – to get the girl back and the bloodthirsty creatures who roam the uncharted areas of space. But... the greatest danger of all may be on their ship.",
                "popularity": 7.1808,
                "poster_path": "/4sqUOaPFoP2W81mq1UYqZqf5WzA.jpg",
                "release_date": "2005-09-25",
                "title": "Serenity",
                "video": false,
                "vote_average": 7.363,
                "vote_count": 3675,
                "character": "Chinese Snake Dancer (uncredited)",
                "credit_id": "52fe46c59251416c75083085",
                "order": 41
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Linda Hsien Wang is an American actress. She traces her ancestry to Shanghai and Shandong, she was raised in Queens, New York. Also known as Linda Wang, Linda H. Wang and Wáng Xiànlíng (王憲苓).\n\nLinda Wang's Hollywood film career includes a heartbreaking role in Neal Hollander's controversial film Birds of Passage as \"Fu Ling\" opposite Stacy Keach. The film was banned in certain locations in China due to the One-Child Policy story line, and was instead filmed on location in the Philippines and South China sea. She also starred with actor Ernie Rivera in the Indie film Red Betta, directed by Allena Rennee. Additional notable appearances were in The Violent Kind, Scarred City, Dead Air, Dark City and What Ever Happened to Mason Reese? which was directed by Brett Ratner.\n\nHer off-screen film credit was in the 2008 comedy Tropic Thunder. Wang had previously worked as a Chinese script translator for the producer and writer David Milch on several episodes of his HBO hit television show Deadwood. She had openly expressed her regrets for not standing up for her rights for screen credit for her work on Deadwood to Milch.\n\nLinda Wang played an evil villain named Contessa Dell\"Oro, a non-Asian role, as the leader of an army of commandos who plot to destroy all human life on earth with the devastating X-bomb Nuclear Missile in a dark comedy called Blonde Squad.\n\nLinda Wang was in the film Low Down, which won Best Cinematography Award in the US Dramatic category at the Sundance Film Festival in 2014.  Low Down was also at the November 2015 Lineup of the Taipei Golden Horse Film Festival. The prestigious award is considered the Chinese Oscar.\n\nLinda Wang recently was just in a feature film My Favorite Five with Steven Williams, Rochelle Aytes and Brian White directed by Paul Hannah currently on Netflix, CENTRICTV and BET. Recently, Linda Wang was in a film \"Girls on Film\" in collaboration with as Kodak. Shot on Kodak 35mm and 16mm motion picture film and the new KODAK Super 8 Camera, stars Suki Waterhouse, Poppy Jamie, Linda Wang and Anya Varda which was filmed in Los Angeles, CA. Suki Waterhouse, Poppy Jamie, Linda Wang, Anya Varda all used their first name in the film.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 43470,
        "imdb_id": "nm0910972",
        "known_for_department": "Acting",
        "name": "Linda Wang",
        "place_of_birth": "Queens, New York, USA",
        "popularity": 0.055,
        "profile_path": "/yi3gxtyixrbfvprfEHcA0L79Hhw.jpg"
    }
}