{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mhgfOLtAiJk1nm3kKlkiUKl7e9M.jpg",
                "genre_ids": [
                    53,
                    80,
                    9648
                ],
                "id": 2252,
                "original_language": "en",
                "original_title": "Eastern Promises",
                "overview": "A Russian teenager living in London dies during childbirth but leaves clues in her diary that could tie her child to a rape involving a violent Russian mob family.",
                "popularity": 4.0437,
                "poster_path": "/dpiJWb4NrWgcOg2rusuLhDM0hTm.jpg",
                "release_date": "2007-09-14",
                "title": "Eastern Promises",
                "video": false,
                "vote_average": 7.356,
                "vote_count": 3514,
                "character": "Ekrem",
                "credit_id": "52fe4346c3a36847f80479bb",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/sGKUhw88FMH5gfz0E6BK2YOZ5se.jpg",
                "genre_ids": [
                    36,
                    18
                ],
                "id": 82695,
                "original_language": "en",
                "original_title": "Les Misérables",
                "overview": "An adaptation of the successful stage musical based on Victor Hugo's classic novel set in 19th-century France. Jean Valjean, a man imprisoned for stealing bread, must flee a relentless policeman named Javert. The pursuit consumes both men's lives, and soon Valjean finds himself in the midst of the student revolutions in France.",
                "popularity": 6.8937,
                "poster_path": "/6CuzBs2Lb8At7qQr64mLXg2RYRb.jpg",
                "release_date": "2012-12-18",
                "title": "Les Misérables",
                "video": false,
                "vote_average": 7.315,
                "vote_count": 5417,
                "character": "Convict 2",
                "credit_id": "52fe486c9251416c9108c0bd",
                "order": 38
            },
            {
                "adult": false,
                "backdrop_path": "/28XFhXIlmeg19bSOpWKWaWFBEkQ.jpg",
                "genre_ids": [
                    18,
                    36,
                    10749
                ],
                "id": 18320,
                "original_language": "en",
                "original_title": "The Young Victoria",
                "overview": "As the only legitimate heir of England's King William, teenage Victoria gets caught up in the political machinations of her own family. Victoria's mother wants her to sign a regency order, while her Belgian uncle schemes to arrange a marriage between the future monarch and Prince Albert, the man who will become the love of her life.",
                "popularity": 2.5159,
                "poster_path": "/iGyuReyij3bPCtzJdSjTR8PR0pa.jpg",
                "release_date": "2009-03-04",
                "title": "The Young Victoria",
                "video": false,
                "vote_average": 7.166,
                "vote_count": 1039,
                "character": "Edward Oxford",
                "credit_id": "5692a67a92514115ce002b9a",
                "order": 22
            },
            {
                "adult": false,
                "backdrop_path": "/ra9surFrWYvIL0pWcm3MrxmPhTg.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 90369,
                "original_language": "en",
                "original_title": "Now Is Good",
                "overview": "A girl dying of leukemia compiles a list of things she'd like to do before passing away. Topping the list is her desire to lose her virginity.",
                "popularity": 1.849,
                "poster_path": "/oOBHF6qWtMkzwpnrLDTKJPAb3zH.jpg",
                "release_date": "2012-09-19",
                "title": "Now Is Good",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1089,
                "character": "Jake",
                "credit_id": "5847b15092514119b9005b40",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Джозеф Алтин"
        ],
        "biography": "Josef Altin (born in London) is a British TV series and movie actor. Altin had small roles in various TV shows and movies including The Bill, Peep Show and Babyfather. He starred in DC Moore's hit play The Empire at the Royal Court Theatre in London.\n\nAltin was born in London, to a Turkish family. His first appearance in a television series was his role as Garry in the drama series Psychos. His first appearance on a major British television series came in 2004 when he played a machine strimmer in Blackpool. Over the years, Altin has appeared on The Bill several times in different roles; from 2006 to 2007 he played Jay Henderson, and in 2009 he played Peter Balmaine. After his appearance on The Bill he became a somewhat sought after actor and received many more roles over the coming years, performing in both television series and films multiple times a year.\n\nIn 2007, Altin appeared in two films, the first of which being Boy A, where he played Bully, and what is perhaps the biggest budget film he has starred in, Eastern Promises, where he played Ekrem.\n\nHe has also appeared in other big television series including Peep Show, Doctors, Robin Hood, Casualty, Little Miss Jocelyn, New Tricks, Being Human, Misfits and Law & Order: UK. Top boy\n\nAltin also played the role of Pypar, commonly called Pyp, in the HBO fantasy TV series Game of Thrones.\n\n2015 saw Altin starring in two films Narcopolis and Child 44. In 2016, Altin starred in the short film, 'I Dream of Zombies'.\n\nOn television, in 2017 Altin appeared in the E4 sitcom Chewing Gum as Ryan, and portrayed Prince Rasselas, a young molly boy who plies his trade on the streets of Covent Garden, in the Hulu Original Harlots. In 2018, Altin played Willem Van Burgen, a disturbed paedophile suffering from syphilis, who comes from a wealthy family, suspected of being the serial killer of boys in the TNT period drama, The Alienist.",
        "birthday": "1983-02-12",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.gordonandfrench.co.uk/talent2/josef-altin",
        "id": 43554,
        "imdb_id": "nm1086981",
        "known_for_department": "Acting",
        "name": "Josef Altin",
        "place_of_birth": "London, England, UK",
        "popularity": 0.2656,
        "profile_path": "/ri3WcFanvd94dD5G0UxzgmCBIKW.jpg"
    }
}