{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jw4SNkaSgbrO7VJPsZUZqbBg1Ph.jpg",
                "genre_ids": [
                    12,
                    18
                ],
                "id": 618588,
                "original_language": "en",
                "original_title": "Arthur the King",
                "overview": "Over the course of ten days and 435 miles, an unbreakable bond is forged between pro adventure racer Michael Light and a scrappy street dog companion dubbed Arthur. As the team is pushed to their outer limits of endurance in the race, Arthur redefines what victory, loyalty and friendship truly mean.",
                "popularity": 6.9676,
                "poster_path": "/zkKB3kOun5DKAkm61pHvLbrjxfa.jpg",
                "release_date": "2024-02-22",
                "title": "Arthur the King",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 837,
                "character": "Ruby",
                "credit_id": "6556098fb5400214d06e407c",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/kYgQzzjNis5jJalYtIHgrom0gOx.jpg",
                "genre_ids": [
                    16,
                    10751,
                    28,
                    35,
                    12,
                    14
                ],
                "id": 1011985,
                "original_language": "en",
                "original_title": "Kung Fu Panda 4",
                "overview": "Po is gearing up to become the spiritual leader of his Valley of Peace, but also needs someone to take his place as Dragon Warrior. As such, he will train a new kung fu practitioner for the spot and will encounter a villain called the Chameleon who conjures villains from the past.",
                "popularity": 30.0932,
                "poster_path": "/kDp1vUBnMpe8ak4rjgl3cLELqjU.jpg",
                "release_date": "2024-03-02",
                "title": "Kung Fu Panda 4",
                "video": false,
                "vote_average": 7.042,
                "vote_count": 3214,
                "character": "Den Bunny #1 / Restaurant Bunny #1 (voice)",
                "credit_id": "65ec8d2bb7d3520162e5895d",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Cece Valentina, a talented young actress, was born in Los Angeles in 2014. With her October birthday, Cece proudly identifies as a Libra, embodying the balance and charm that shines through her performances. She shares her home with her loving parents, her older sister Summer Sophia, and their two adorable dogs, Bentley and HoneyBear.\n\nCece's unique upbringing has gifted her with the joy of calling two places home. Frequent trips to England to visit family have fostered a deep connection to her British heritage. During one memorable trip, she had the incredible opportunity to witness her first West-End theater show, \"SIX! The Musical.\" Cece's passion for the show is so infectious that she knows every song by heart and can often be found belting out the tunes in the car. Her dedication and love for the theater even led her to wait outside in the cold after the performance, eagerly collecting autographs from the cast members at the Stage Door.\n\nAt the young age of five, Cece discovered her love for acting, and it has been a whirlwind adventure ever since. Her natural talent and undeniable charisma quickly caught the attention of industry professionals, leading her to sign with Symington Talent Management. In a remarkable turn of events, Cece's very first professional audition landed her a supporting role opposite renowned actor Mark Wahlberg in the film \"Arthur The King.\" This incredible opportunity took her to the Dominican Republic, where she and her family worked and visited some beautiful sights. While filming, Cece cherished the moments spent bonding with the dog that portrayed Arthur, creating lifelong memories.\n\nCece's talent extends beyond live-action performances, as she has also made her mark in the world of voiceover. Her journey began with her first voice job for a Tide Commercial, which served as a stepping stone into the realm of TV and film. She quickly found success and lent her voice to exciting projects. Fans can eagerly anticipate 2024, as Cece's voice will grace the highly anticipated \"Kung Fu Panda 4,\" where she brings the lovable character named \"Den Bunny\" to life. Additionally, she is anxiously awaiting the release of two other projects: an upcoming series on Netflix and an animated series on Nickelodeon.\n\nWhen she's not busy acting or working on voiceover projects, Cece's passion for singing takes center stage. Her dedication to honing her vocal skills has earned her roles in amateur productions such as \"Camp Rock,\" \"High School Musical,\" and \"Press Start.\" Recently, she achieved a significant milestone by securing the lead role of Annie another amateur production of the beloved musical \"Annie.\"\n\nCece's versatility extends to dance as well, where she excels in hip-hop and contemporary styles. Alongside her artistic pursuits, she finds joy in gymnastics, spending quality time with friends during fun sleepovers, and creating lasting memories with her family.\n\nAs Cece Valentina continues to shine in the world of acting and voiceover, her journey serves as an inspiration to young aspiring performers everywhere. With her undeniable talent and magnetic personality, Cece is poised to become a true star in the entertainment world.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 4379987,
        "imdb_id": "nm14928870",
        "known_for_department": "Acting",
        "name": "Cece Valentina",
        "place_of_birth": "Los Angeles, California, U.S",
        "popularity": 0.0143,
        "profile_path": "/bAdkjOIxQ3NYUcJvkiIEHp6TKVR.jpg"
    }
}