{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gLQoJ9P79g501oEEtrN8zMlCPpx.jpg",
                "genre_ids": [
                    36,
                    18,
                    53,
                    10752
                ],
                "id": 205596,
                "original_language": "en",
                "original_title": "The Imitation Game",
                "overview": "Based on the real life story of legendary cryptanalyst Alan Turing, the film portrays the nail-biting race against time by Turing and his brilliant team of code-breakers at Britain's top-secret Government Code and Cypher School at Bletchley Park, during the darkest days of World War II.",
                "popularity": 12.0881,
                "poster_path": "/zSqJ1qFq8NXFfi7JeIYMlzyR0dx.jpg",
                "release_date": "2014-11-14",
                "title": "The Imitation Game",
                "video": false,
                "vote_average": 7.992,
                "vote_count": 17536,
                "character": "Commander Denniston",
                "credit_id": "5363bfe2c3a3681586002734",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/cKrWGcWHKcergHyDKxKGbgcUsMm.jpg",
                "genre_ids": [
                    18
                ],
                "id": 304357,
                "original_language": "en",
                "original_title": "Woman in Gold",
                "overview": "Maria Altmann, an octogenarian Jewish refugee, takes on the Austrian government to recover a world famous painting of her aunt plundered by the Nazis during World War II, she believes rightfully belongs to her family. She did so not just to regain what was rightfully hers, but also to obtain some measure of justice for the death, destruction, and massive art theft perpetrated by the Nazis.",
                "popularity": 2.7153,
                "poster_path": "/6eoj6bozvgwNuDV3vOrqlvrCrX.jpg",
                "release_date": "2015-03-20",
                "title": "Woman in Gold",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1413,
                "character": "Sherman",
                "credit_id": "546c324b92514130560009b9",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/3WK7p9EdZmmvB1IbB2Vw9Rf4lXH.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 296096,
                "original_language": "en",
                "original_title": "Me Before You",
                "overview": "A small town girl is caught between dead-end jobs. A high-profile, successful man becomes wheelchair bound following an accident. The man decides his life is not worth living until the girl is hired for six months to be his new caretaker. Worlds apart and trapped together by circumstance, the two get off to a rocky start. But the girl becomes determined to prove to the man that life is worth living and as they embark on a series of adventures together, each finds their world changing in ways neither of them could begin to imagine.",
                "popularity": 14.9446,
                "poster_path": "/Ia3dzj5LnCj1ZBdlVeJrbKJQxG.jpg",
                "release_date": "2016-06-01",
                "title": "Me Before You",
                "video": false,
                "vote_average": 7.928,
                "vote_count": 12828,
                "character": "Stephen Traynor",
                "credit_id": "5548034692514155fd00022a",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "찰스 댄스",
            "Чарльз Дэнс",
            "查尔斯·丹斯",
            "Walter Charles Dance",
            "چارلز دنس"
        ],
        "biography": "Walter Charles Dance OBE (born 10 October 1946) is an English actor, screenwriter, and director. He typically plays strict, authoritarian characters or villains. He is best known for his roles as Tywin Lannister in Game of Thrones, Kitchener in The King's Man, Martin Benson in Amazon Prime's The Widow, Lord Mountbatten in Netflix's The Crown (for which he was nominated for a Primetime Emmy Award for Outstanding Guest Actor in a Drama Series), Thomas in Underworld: Awakening and Underworld: Blood Wars, Harold Fillmore in Ghostbusters (2016), Mr. Bennet in Pride and Prejudice and Zombies, Frankenstein in Victor Frankenstein, Master Vampire in Dracula Untold, Conrad Knox in the Cinemax series Strike Back, Raymond Stockbridge in Gosford Park, one-eyed hitman Benedict in Last Action Hero, Clemens in Alien³, Sardo Numpsa in The Golden Child, and Guy Perron in The Jewel in the Crown.\n\nHe started his career on stage with the Royal Shakespeare Company (RSC) before appearing in film and television. For his services to drama, he was appointed an Officer of the Order of the British Empire (OBE) by Queen Elizabeth II in 2006.\n\nHe made his directorial film debut with the drama film Ladies in Lavender (2004), which he also wrote and executive produced.",
        "birthday": "1946-10-10",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 4391,
        "imdb_id": "nm0001097",
        "known_for_department": "Acting",
        "name": "Charles Dance",
        "place_of_birth": "Redditch, Worcestershire, England, UK",
        "popularity": 3.0565,
        "profile_path": "/3xHwq5lchAI6mfW0aGQOEijexv6.jpg"
    }
}