{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/eWYrrdCKd4bjOKB9DB0HtRUhI1o.jpg",
                "genre_ids": [
                    18
                ],
                "id": 5528,
                "original_language": "fr",
                "original_title": "Les Choristes",
                "overview": "In 1940s France, a new teacher at a school for disruptive boys gives hope and inspiration.",
                "popularity": 6.0653,
                "poster_path": "/hUl7gSvkGygyk9wt3zy5NqpC5bb.jpg",
                "release_date": "2004-03-17",
                "title": "The Chorus",
                "video": false,
                "vote_average": 7.731,
                "vote_count": 2507,
                "character": "Pierre Morhange",
                "credit_id": "52fe440cc3a36847f807f4fb",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Jean-Baptiste Maunier (born December 22, 1990) is a French actor and singer. He is best known for his role in the 2004 French film Les Choristes.\n\nJean-Baptiste Maunier was born to Thierry Maunier, a cameraman, and Muriel Maunier. He has a younger brother, Benjamin. His father sang in a well-known church choir (Les Petits Chanteurs de Saint Marc). Jean-Baptiste attended a Roman Catholic school in Lyon, France. He studied at the Lee Strasberg Institute in New York between 2008 and 2009 to perfect his acting and English, returning to France to sing in Les Enfoirés charity concerts.\n\nMaunier gained fame for his starring role in the 2004 French film Les Choristes, in which he plays Pierre Morhange, a delinquent with an exceptional singing voice at the correctional school Fond de L'Étang. Christophe Barratier, the director of Les Choristes, chose Maunier because \"he had the right look\" and a marvellous voice. He was also exceptionally appealing for the role.\n\nFollowing the release of the film, Maunier and the choir took part in numerous concerts all over the world, including Japan and Canada. In February 2005, he left the choir in order to devote more time to his studies and to his acting career. In April and August 2005, he took part in a four-episode television series for France 2, Le Cri, playing a young steelworker. The series was released in 2006.\n\nMaunier appears in Le Grand Meaulnes (2006) as Francois Seurel. In Piccolo, Saxo et compagnie (2006), an animated film, he lent his voice to the character \"Saxo\". In the summer of 2006, Maunier acted in Hellphone, a full-length film directed by James Huth. In this film, Maunier plays the role of Sid. The film was released in March 2007. In L'Auberge rouge, directed by Gérard Krawczyk (an adaptation of the 1951 version) Maunier stars as Octave. It opened in theaters in France on 5 December 2007. Jean-Baptiste spent a year studying at New York's Lee Strasberg Institute in 2008 to unleash his acting potentials. Staying in the USA allowed him to perfect his English. He returned to France in 2010, and performed in the Enfoirés charity concert of 2010.\n\nUpon entering collège (middle school), Maunier was asked to make a choice between various activities. He chose singing and became a member of Les Petits Chanteurs de Saint-Marc (full name is \"La Chorale des Petits Enfants De Saint-Marc\"). In the choir, he was tutored by Nicolas Porte. In Les Choristes, the film that made him widely famous for his singing skills, both Maunier's solo and the chorus of \"Les Petits Chanteurs de Saint-Marc\" are featured on the original soundtrack.\n\nIn 2005, to keep a souvenir of his voice before it broke, Maunier decided to sing with Clemence Saint-Preux and had released the single, Concerto pour deux voix, which was in turn an adaptation of Concerto pour une Voix.\n\nSince 2005 he has participated in Les Enfoirés, an ensemble of notable singers and performers in France that periodically performs charity concerts. He contributed a song named \"Le Monde Qui Est Le Mien\" for the album \"We Love Disney 2\" and also released a single, \"Je Reviens\".\n\nSource: Article \"Jean-Baptiste Maunier\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1990-12-22",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 43996,
        "imdb_id": "nm1533863",
        "known_for_department": "Acting",
        "name": "Jean-Baptiste Maunier",
        "place_of_birth": "Brignoles, Var, France",
        "popularity": 0.4692,
        "profile_path": "/7MFns6ANxxkG55n75z4omK5voat.jpg"
    }
}