{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8UZfEjAlFq1iUiAkHMkJViq4ZO0.jpg",
                "genre_ids": [
                    53,
                    9648,
                    27
                ],
                "id": 11033,
                "original_language": "en",
                "original_title": "Dressed to Kill",
                "overview": "After witnessing a mysterious woman brutally slay a homemaker, prostitute Liz Blake finds herself trapped in a dangerous situation. While the police thinks she is the murderer, the real killer is intent on silencing her only witness.",
                "popularity": 3.5418,
                "poster_path": "/oy1m5dd44foNrxV8U9l6Walx82V.jpg",
                "release_date": "1980-07-25",
                "title": "Dressed to Kill",
                "video": false,
                "vote_average": 6.958,
                "vote_count": 1038,
                "character": "Liz Blake",
                "credit_id": "52fe43e79251416c75022983",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/pRSTtNlcADoQkfeBGtFQNE1FDpb.jpg",
                "genre_ids": [
                    28,
                    53,
                    878
                ],
                "id": 5548,
                "original_language": "en",
                "original_title": "RoboCop",
                "overview": "In a violent, near-apocalyptic Detroit, evil corporation Omni Consumer Products wins a contract from the city government to privatize the police force. To test their crime-eradicating cyborgs, the company leads street cop Alex Murphy into an armed confrontation with crime lord Boddicker so they can use his body to support their untested RoboCop prototype. But when RoboCop learns of the company's nefarious plans, he turns on his masters.",
                "popularity": 5.3642,
                "poster_path": "/esmAU0fCO28FbS6bUBKLAzJrohZ.jpg",
                "release_date": "1987-07-17",
                "title": "RoboCop",
                "video": false,
                "vote_average": 7.347,
                "vote_count": 5424,
                "character": "Officer Anne Lewis",
                "credit_id": "52fe440dc3a36847f807f6b9",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/zwJFfKQdfiptK2GY6N8GkZFrAxJ.jpg",
                "genre_ids": [
                    27,
                    53
                ],
                "id": 7340,
                "original_language": "en",
                "original_title": "Carrie",
                "overview": "Withdrawn and sensitive teen Carrie White faces taunting from classmates at school and abuse from her fanatically pious mother. When strange occurrences start happening around Carrie, she begins to suspect that she has supernatural powers.",
                "popularity": 6.0164,
                "poster_path": "/uc3OvgmbnYaS5Y0BOjSmC1EmSz1.jpg",
                "release_date": "1976-11-03",
                "title": "Carrie",
                "video": false,
                "vote_average": 7.321,
                "vote_count": 4058,
                "character": "Chris Hargenson",
                "credit_id": "52fe447ac3a36847f80985d1",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/nk87CtgZ7wd86W37oJHGYAJbmLz.jpg",
                "genre_ids": [
                    53,
                    9648,
                    80
                ],
                "id": 11644,
                "original_language": "en",
                "original_title": "Blow Out",
                "overview": "While recording sound effects for a slasher flick, Jack Terry stumbles upon a real-life horror: a car careening off a bridge and into a river. Jack jumps into the water and fishes out Sally from the car, but the other passenger is already dead — a governor intending to run for president. As Jack does some investigating of his tapes, and starts a perilous romance with Sally, he enters a tangled web of conspiracy that might leave him dead.",
                "popularity": 2.5538,
                "poster_path": "/weMW1wLzeagP3tw6BfmYf1iL7dz.jpg",
                "release_date": "1981-07-24",
                "title": "Blow Out",
                "video": false,
                "vote_average": 7.374,
                "vote_count": 1561,
                "character": "Sally Badina",
                "credit_id": "52fe446f9251416c75034975",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Nancy Anne Allen",
            "The Scream Queen",
            "نانسی آلن"
        ],
        "biography": "Nancy Anne Allen (born June 24, 1950) is an American actress. She came to prominence for her performances in several films directed by Brian De Palma in the 1970s and early 1980s. Her accolades include a Golden Globe Award nomination and three Saturn Award nominations.\n\nThe daughter of a New York City police lieutenant, Allen was raised in the Bronx, and attended the High School of Performing Arts, aspiring to have a career as a dancer. In her early twenties, she shifted her focus to acting and relocated to Los Angeles to pursue a career there. Her first major role was as Chris Hargensen in Brian De Palma's film adaptation of Carrie (1976). Allen was subsequently cast as the lead in the Robert Zemeckis-directed comedy I Wanna Hold Your Hand (1978), followed by a supporting part in Steven Spielberg's 1941 (1979).\n\nAllen married De Palma in 1979, and her subsequent portrayal of a prostitute who witnesses a murder in his feature Dressed to Kill (1980) earned her a Golden Globe nomination for New Star of the Year. She then appeared in De Palma's neo-noir film Blow Out (1981), playing a woman implicated in an assassination. Allen and DePalma divorced in 1984.\n\nShe appeared in the science fiction films Strange Invaders (1983) and The Philadelphia Experiment (1984), and Abel Ferrara's television film The Gladiator (1986). Allen garnered mainstream fame playing Anne Lewis in Paul Verhoeven's RoboCop (1987), a role she reprised for the two sequels that followed. Other credits include Poltergeist III (1988), Limit Up (1990), and Les patriotes (1994).\n\nAllen stepped back from acting in 2008, and became involved in cancer support after her friend, Wendie Jo Sperber, died of breast cancer. In 2010, she was named executive director of the weSPARK Cancer Support Center in Los Angeles, which was founded by Sperber.",
        "birthday": "1950-06-24",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 44038,
        "imdb_id": "nm0000262",
        "known_for_department": "Acting",
        "name": "Nancy Allen",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.7101,
        "profile_path": "/ok87WkvJJJTDsTzqgmoC5BHv6Wh.jpg"
    }
}