{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mDW6z7I6de6JbUgPOkAEZwKbg7G.jpg",
                "genre_ids": [
                    16,
                    10751,
                    10402,
                    14,
                    35
                ],
                "id": 901362,
                "original_language": "en",
                "original_title": "Trolls Band Together",
                "overview": "When Branch's brother, Floyd, is kidnapped for his musical talents by a pair of nefarious pop-star villains, Branch and Poppy embark on a harrowing and emotional journey to reunite the other brothers and rescue Floyd from a fate even worse than pop-culture obscurity.",
                "popularity": 9.0687,
                "poster_path": "/bkpPTZUdq31UGDovmszsg2CchiI.jpg",
                "release_date": "2023-10-12",
                "title": "Trolls Band Together",
                "video": false,
                "vote_average": 7.282,
                "vote_count": 932,
                "character": "Velvet (voice)",
                "credit_id": "642301b86a344800ef31297a",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/nxxCPRGTzxUH8SFMrIsvMmdxHti.jpg",
                "genre_ids": [
                    35,
                    14,
                    10751
                ],
                "id": 639720,
                "original_language": "en",
                "original_title": "IF",
                "overview": "After discovering she can see everyone's imaginary friends, a girl embarks on a magical adventure to reconnect forgotten imaginary friends with their kids.",
                "popularity": 10.0697,
                "poster_path": "/xbKFv4KF3sVYuWKllLlwWDmuZP7.jpg",
                "release_date": "2024-05-08",
                "title": "IF",
                "video": false,
                "vote_average": 7.037,
                "vote_count": 1426,
                "character": "Gummy Bear (voice)",
                "credit_id": "6616adc1cb6db50162a9e239",
                "order": 34
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "ایمی شومر",
            "اِیمی شومر"
        ],
        "biography": "Amy Schumer was born in Manhattan and grew up on Long Island, New York. She attended South Side High School and was voted both \"Class Clown\" and \"Teacher's Worst Nightmare\" upon graduation in 1999. Schumer graduated from Towson University in 2003 with a degree in theater. She moved to New York City after college, where she studied at the William Esper Studio for two years and worked as a bartender and a waitress. Through her father, she is the niece of Chuck Schumer, U.S. Senator from New York.\n\nAmy Schumer portrayed a young woman diagnosed with breast cancer in the off-Broadway black comedy Keeping Abreast. She started doing stand-up comedy on June 1, 2004, when she first performed at Gotham Comedy Club. She recorded a special for Comedy Central before appearing on Last Comic Standing; she said in August 2012 that she thought of the special as her \"big break\".\n\nAfter not passing an audition for an earlier season, she advanced to the finals of the fifth season of the NBC reality television talent show Last Comic Standing and placed fourth. Schumer said in April 2011, \"Last Comic was totally fun. I had a great time because there was no pressure on me; I had been doing stand-up around two years. I wasn't supposed to do well. So every time I advanced it was a happy surprise. I kept it honest on the show and it served me well.\" (Wikipedia)",
        "birthday": "1981-06-01",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.amyschumer.com/",
        "id": 440414,
        "imdb_id": "nm2154960",
        "known_for_department": "Acting",
        "name": "Amy Schumer",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.6714,
        "profile_path": "/saXAIob0JOf8B4Z9v2pgzEHV8wb.jpg"
    }
}