{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sXfQGa7juaTpZ5IF17Xa6hI53nx.jpg",
                "genre_ids": [
                    10751,
                    16,
                    12
                ],
                "id": 12144,
                "original_language": "en",
                "original_title": "The Land Before Time",
                "overview": "An orphaned brontosaurus named Littlefoot sets off in search of the legendary Great Valley. A land of lush vegetation where the dinosaurs can thrive and live in peace. Along the way he meets four other young dinosaurs, each one a different species, and they encounter several obstacles as they learn to work together in order to survive.",
                "popularity": 3.4147,
                "poster_path": "/7phV1ETZnQrLsEeuk4hNeceEl25.jpg",
                "release_date": "1988-11-18",
                "title": "The Land Before Time",
                "video": false,
                "vote_average": 7.15,
                "vote_count": 2626,
                "character": "Littlefoot (voice)",
                "credit_id": "52fe44be9251416c7503f60f",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "گابریل دیمون"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nHe was exposed to the performing arts as early as 3 years old, when his parents and family moved to Los Angeles, California. After doing more than 100 commercials, his first role was in the 1984 TV series Call to Glory. He voiced Littlefoot the Apatosaurus in the first The Land Before Time movie, and Little Nemo in Little Nemo: Adventures in Slumberland. He also appeared as Hob in RoboCop 2. By age 16, he had worked in roles alongside several big-name actors including Mel Gibson, Michelle Pfeiffer, Mickey Rooney, and Christian Bale. He has also made guest appearances in popular shows such as ER, Star Trek: The Next Generation and Baywatch. In addition to acting, Damon is also working as a producer. His favorite television shows are 30 Rock and The Simpsons.\n\nHe gained a large fanbase after his role as Spot Conlon in Newsies.\n\nDescription above from the Wikipedia article Gabriel Damon, licensed under CC-BY-SA, full list of contributors on Wikipedia .​",
        "birthday": "1976-04-23",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 44055,
        "imdb_id": "nm0198925",
        "known_for_department": "Acting",
        "name": "Gabriel Damon",
        "place_of_birth": "Reno, Nevada, USA",
        "popularity": 0.4793,
        "profile_path": "/3egsFiVNyHSVlMsgbwgDEinACTT.jpg"
    }
}