{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7NzsBCM8cj53yLEPWYhN0YfGZG.jpg",
                "genre_ids": [
                    18
                ],
                "id": 1630,
                "original_language": "en",
                "original_title": "The People vs. Larry Flynt",
                "overview": "Larry Flynt is the hedonistically obnoxious, but indomitable, publisher of Hustler magazine. The film recounts his struggle to make an honest living publishing his girlie magazine and how it changes into a battle to protect the freedom of speech for all people.",
                "popularity": 2.6703,
                "poster_path": "/sAgHn7ys6TiVXBDTZ0UBEjinIUk.jpg",
                "release_date": "1996-12-25",
                "title": "The People vs. Larry Flynt",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 1168,
                "character": "Reverend Jerry Falwell",
                "credit_id": "5b8011c80e0a26609a010397",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia.Richard Paul (June 6, 1940 – December 25, 1998) was an American actor who was born in Los Angeles, California. He was able to imitate most American and many foreign dialects. He had a tenor voice and trained with Lee Sweetland.  Richard had a B.A. in public affairs from Claremont Men's College and an M.A. in psychology from California State University, Los Angeles. He was near completion of his Ph.D. in clinical psychology from the University of Arizona in Tucson, Arizona, but gave up his career as a therapist to become a full-time performer.  Richard Paul was nicknamed \"Pige Paul\" by Slim Pickens while filming an episode of The Love Boat (1977) after local pigeons anointed a new suit jacket.  In 1980 he guest starred in the ABC comedy 'One In A Million\" which only aired for one season  Richard was also a frequent panelist on Match Game in the 1980s. From 1977 to 1979 he portrayed Mayor Teddy Burnside in Carter Country, and later played the recurring character of Cabot Cove Mayor, Sam Booth, in Murder, She Wrote.  He was cast as Dr. Bob Halyers in the \"Clean Up Radio Everywhere\" episode ofWKRP in Cincinnati (1978) because of his resemblance to Rev. Jerry Falwell. Paul played Falwell himself twice: once in Fall From Grace, a Jim and Tammy Faye Bakker TV movie made in 1990, and then in The People vs. Larry Flynt in 1996.  Paul was in the cult classic film Eating Raoul (1982), written and directed byPaul Bartel. Also in 1982, he co-starred on the short-lived sitcom Herbie, the Love Bug. He also appeared in Bartel's short film, The Secret Cinema, a paranoid-delusional, fantasy masterpiece of self-referential cinema, which was part of theAmazing Stories series on television. Paul also appeared in Not for Publication, written and directed by Bartel.  He volunteered with Actors and Others for Animals. He was on the Mental Health Advisory Board of Los Angeles County. He volunteered at childhood immunization clinics for the Los Angeles County Department of Health Services. He read books into tapes by special request at the Braille Institute in Los Angeles.  He married Patty Oestereich in 1968 in Pasadena, California. They were married for 30 years until his death on Christmas day in 1998 at home in Studio City, California, due to cancer at age 58.",
        "birthday": "1940-06-06",
        "deathday": "1998-12-25",
        "gender": 2,
        "homepage": null,
        "id": 44161,
        "imdb_id": "nm0000089",
        "known_for_department": "Acting",
        "name": "Richard Paul",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.1608,
        "profile_path": "/nNJ9kzM5IkBgNW01QsyPpITLTgZ.jpg"
    }
}