{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cztYhbawTjK9m8lFBd97Yl5Zd8r.jpg",
                "genre_ids": [
                    18,
                    10752
                ],
                "id": 307,
                "original_language": "it",
                "original_title": "Roma città aperta",
                "overview": "In WWII-era Rome, underground resistance leader Manfredi attempts to evade the Gestapo by enlisting the help of Pina, the fiancée of a fellow member of the resistance, and Don Pietro, the priest due to oversee her marriage. But it’s not long before the Nazis and the local police find him.",
                "popularity": 4.5613,
                "poster_path": "/ijGV4v8JxgbNzgEhqKdzHdaZn8a.jpg",
                "release_date": "1945-10-08",
                "title": "Rome, Open City",
                "video": false,
                "vote_average": 8.02,
                "vote_count": 925,
                "character": "Pina",
                "credit_id": "52fe4235c3a36847f800c3f5",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "안나 마냐니"
        ],
        "biography": "Anna Magnani (pronounced: mahn-YANEE; 7 March 1908 – 26 September 1973) was an Italian stage and film actress. She won the Academy Award for Best Actress, along with four other international awards, for her portrayal of a Sicilian widow in The Rose Tattoo.\n\nBorn in Rome to an Egyptian father and an Italian mother, she worked her way through Rome's Academy of Dramatic Art by singing at night clubs. During her career, her only child was stricken by polio when he was 18 months old and remained crippled.\n\nShe was referred to as \"La Lupa,\" the \"perennial toast of Rome\" and a \"living she-wolf symbol\" of the cinema. Time magazine described her personality as \"fiery\", and drama critic Harold Clurman said her acting was \"volcanic\". In the realm of Italian cinema, she was \"passionate, fearless, and exciting,\" an actress that film historian Barry Monush calls \"the volcanic earth mother of all Italian cinema.\" Director Roberto Rossellini called her \"the greatest acting genius since Eleonora Duse. Playwright Tennessee Williams became an admirer of her acting and wrote The Rose Tattoo specifically for her to star in, a role for which she received her first Oscar in 1955.\n\nAfter meeting director Goffredo Alessandrini she received her first screen role in La cieca di Sorrento (The Blind Woman of Sorrento) (1934) and later achieved international fame in Rossellini's Rome, Open City (1945), considered the first significant movie to launch the Italian neorealism movement in cinema. As an actress she became recognized for her dynamic and forceful portrayals of \"earthy lower-class women\" in such films as The Miracle (1948), Bellissima (1951), The Rose Tattoo (1955), The Fugitive Kind (1960), with Marlon Brando and directed by Sidney Lumet, and Mamma Roma (1962). As early as 1950, Life magazine had already stated that Magnani was \"one of the most impressive actresses since Garbo\".\n\nDescription above from the Wikipedia article Anna Magnani, licensed under CC-BY-SA, full list of contributors on Wikipedia​",
        "birthday": "1908-03-07",
        "deathday": "1973-09-26",
        "gender": 1,
        "homepage": "https://www.archivioannamagnani.it/",
        "id": 4421,
        "imdb_id": "nm0536167",
        "known_for_department": "Acting",
        "name": "Anna Magnani",
        "place_of_birth": "Rome, Italy",
        "popularity": 0.2553,
        "profile_path": "/ygpE4VtT0TtrF2mfceJBT8u2Nhh.jpg"
    }
}