{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dy516GsG7lvszB47FiotNjLARDY.jpg",
                "genre_ids": [
                    10749,
                    35
                ],
                "id": 10934,
                "original_language": "en",
                "original_title": "Under the Tuscan Sun",
                "overview": "After a rough divorce, Frances, a 35-year-old professor and writer from San Francisco takes a tour of Tuscany at the urgings of her friends. On a whim she buys Bramasole, a run down villa in the Tuscan countryside and begins to piece her life together starting with the villa and finds that life sometimes has unexpected ways of giving her everything she wanted.",
                "popularity": 5.7825,
                "poster_path": "/3vQUQwdtfPt1Sl2GZrIECWWA0dk.jpg",
                "release_date": "2003-09-20",
                "title": "Under the Tuscan Sun",
                "video": false,
                "vote_average": 6.887,
                "vote_count": 912,
                "character": "Ed",
                "credit_id": "5c095a390e0a2638b801ea9f",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "David Sutcliffe (born June 8, 1969) is a Canadian actor. He is best known for playing Christopher Hayden, Rory Gilmore's father and Lorelai Gilmore's on-and-off boyfriend, on the CW show Gilmore Girls.\n\nA 1990 graduate of Victoria College at the University of Toronto where he studied English literature, he played varsity basketball before succumbing to a career-ending knee injury. While in college, he waited tables at local greasy spoon Michael's on Bay. Before heading to Hollywood, he starred in the independent feature film Two or Three Words, directed by Toronto-local Evan Georgiades.\n\nHe subsequently appeared in the straight to DVD film Cake with Heather Graham, Taye Diggs, Sandra Oh and Sarah Chalke, and the film Testosterone opposite Antonio Sabato Jr. and Sônia Braga. In 2003, he appeared at the very end of Under the Tuscan Sun with Diane Lane and Sandra Oh. He played the character Ed, a writer who falls in love with Frances in the last scenes of the movie. He played financier Ted Ammon in the made-for-TV movie Murder in the Hamptons.\n\nHe has appeared in numerous TV shows such as I'm with Her (where he had the lead male role, along with Teri Polo), Friends, Will and Grace, Accidentally on Purpose, CSI: Crime Scene Investigation, and Cold Feet.\n\nHe also had a recurring role on Private Practice where was signed for 13 episodes during the 2007-2008 and 2008-2009 seasons. He played a police officer smitten with the lead character Dr. Addison Montgomery. He also starred in the 2009 film Before You Say I Do.  He played on the World Poker Tour in the Hollywood Home games, for the Hollygrove House charity. He is divorced from actress Julie McCullough.\n\nDescription above from the Wikipedia article David Sutcliffe,licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1969-06-08",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 44221,
        "imdb_id": "nm0005475",
        "known_for_department": "Acting",
        "name": "David Sutcliffe",
        "place_of_birth": "Saskatoon, Saskatchewan, Canada",
        "popularity": 0.3919,
        "profile_path": "/9vLKFCEYu0tSAqchaEkJaNpTfPm.jpg"
    }
}