{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mDfJG3LC3Dqb67AZ52x3Z0jU0uB.jpg",
                "genre_ids": [
                    12,
                    28,
                    878
                ],
                "id": 299536,
                "original_language": "en",
                "original_title": "Avengers: Infinity War",
                "overview": "As the Avengers and their allies have continued to protect the world from threats too large for any one hero to handle, a new danger has emerged from the cosmic shadows: Thanos. A despot of intergalactic infamy, his goal is to collect all six Infinity Stones, artifacts of unimaginable power, and use them to inflict his twisted will on all of reality. Everything the Avengers have fought for has led up to this moment - the fate of Earth and existence itself has never been more uncertain.",
                "popularity": 29.705,
                "poster_path": "/7WsyChQLEftFiDOVTGkv3hFpyyt.jpg",
                "release_date": "2018-04-25",
                "title": "Avengers: Infinity War",
                "video": false,
                "vote_average": 8.235,
                "vote_count": 30938,
                "character": "Street Pedestrian #3 (uncredited)",
                "credit_id": "65849060d55697522a527ae8",
                "order": 66
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jenniffer Taylor",
            "Jenny Taylor"
        ],
        "biography": "Lady Cardinal is a Central Florida based director, screenwriter, author, photographer, and artist. She was born to Linda and Jeff Taylor where she grew up in the heartlands of Florida. Being sandwiched between Tampa and Orlando she would often spend time with her family going to Walt Disney World and the other surrounding theme parks. At a young age she became fascinated by storytelling where she wrote many short stories. Her continuous admiration for stories grew deeper and deeper as she grew older, seeking out more and more ways to tell stories. Later on her love for film would transcend into her life as she began making homemade movies and recording countless hours of footage from her travels.\n\nShe made an effort to pursue her deep passion and love for film by attending IADT in Tampa for photography and filmmaking. Due to an unsuccessful education from the campus closing shortly after, she became discouraged and tried a career in the theme park industry. After several years she decided that as much as she loved it, her passion was in film and art. Later she would move to Atlanta to try and pursue a career in film there. After a short time she retreated back home to Florida to take care of her mental health and has spent the past several years doing so, claiming that if it would not have been for this great feat the attitude and passion she has now would not exist.\n\nFilm is everything to Lady Cardinal. Her passion and love for it is deep and vibrantly open. She believes it to be the best form of art in the world, collaborating efforts of many different people in various different ways.",
        "birthday": "1987-11-17",
        "deathday": null,
        "gender": 1,
        "homepage": "http://LadyCardinal.com/",
        "id": 4442307,
        "imdb_id": "nm9745802",
        "known_for_department": "Directing",
        "name": "Lady Cardinal",
        "place_of_birth": "Winter Haven, Florida, USA",
        "popularity": 0.0214,
        "profile_path": "/qjJEYEGeNFtnilS4iweOy4ckt1a.jpg"
    }
}