{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zxY1yP9FjJpV7T3hxqBBI5WNydx.jpg",
                "genre_ids": [
                    36,
                    18,
                    10752
                ],
                "id": 403300,
                "original_language": "en",
                "original_title": "A Hidden Life",
                "overview": "Austrian farmer Franz Jägerstätter faces the threat of execution for refusing to fight for the Nazis during World War II.",
                "popularity": 2.04,
                "poster_path": "/rdG4jfH0rxkB2FgkYmjj9V4Q31M.jpg",
                "release_date": "2019-08-27",
                "title": "A Hidden Life",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 735,
                "character": "Fr Ferdinand Fürthauer",
                "credit_id": "586ae892c3a3686e06004537",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Тобиас Моретти",
            "Tobias Bloéb",
            "توبیاس مورتی"
        ],
        "biography": "Tobias Moretti (born Tobias Bloéb; 11 July 1959) is an Austrian actor.\n\nBorn in Gries am Brenner, Tyrol, Moretti is the eldest of four brothers, including Thomas, Christoph and fellow actor Gregor Bloéb. Since 1997 he has been married to Julia Moretti (née Wilhem), an oboist. They have three children, Antonia (born August 1998), Lenz Valentino (born February 2000) and Rosa Cäcilia (born February 2011). His professional surname comes from his mother, who is of Italian descent.\n\nMoretti studied composition at the Vienna University of Music and Applied Arts, then went to Munich to train for the stage at the renowned Otto-Falckenberg-Schule. After graduation he was a permanent member of the Bayerisches Staatsschauspiel ensemble (Frank Baumbauer) and played at the Munich Kammerspiele (Dieter Dorn) from 1985 to 1995 where he earned critical praise in a sweeping variety of productions, appearing in Bertolt Brecht's Man is Man, Achternbusch's Der Frosch (The Frog) and playing the lead in Shakespeare's Troilus and Cressida.\n\nMoretti appeared in the TV series Inspector Rex from 1994 to 1998 as Richard Moser, the main policeman in the murder unit.\n\nSource: Article \"Tobias Moretti\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1959-07-11",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.moretti.at/",
        "id": 44567,
        "imdb_id": "nm0604349",
        "known_for_department": "Acting",
        "name": "Tobias Moretti",
        "place_of_birth": "Innsbruck, Austria",
        "popularity": 0.6105,
        "profile_path": "/ai2BDCDyuhLUJgwW4acWjLKL3xm.jpg"
    }
}