{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1tXlUvfhLVjM5rZcN2783IhCkbu.jpg",
                "genre_ids": [
                    28,
                    18
                ],
                "id": 307081,
                "original_language": "en",
                "original_title": "Southpaw",
                "overview": "Billy \"The Great\" Hope, the reigning junior middleweight boxing champion, has an impressive career, a loving wife and daughter, and a lavish lifestyle. However, when tragedy strikes, Billy hits rock bottom, losing his family, his house and his manager. He soon finds an unlikely savior in Tick Willis, a former fighter who trains the city's toughest amateur boxers. With his future on the line, Hope fights to reclaim the trust of those he loves the most.",
                "popularity": 8.8799,
                "poster_path": "/kSQ49Fi3NVTqGGXILmxV2T2pdkG.jpg",
                "release_date": "2015-03-24",
                "title": "Southpaw",
                "video": false,
                "vote_average": 7.365,
                "vote_count": 5618,
                "character": "Gloria",
                "credit_id": "55e3c94e92514137e9002655",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Lisa Young"
        ],
        "biography": "Lana comes from the beautiful island of Bermuda where her love for acting began. As a little girl sitting in the movie theater watching ORCA, she thought, I want to be up on that screen. But making a living as an actor in a small Island like Bermuda is not an option. So, she got caught up in the corporate world and found herself navigating the challenges of being a 20 something woman working on a trading desk at an investment company full of men. She sought out sanity and solace in the local theatre world and her love for acting bloomed. At 28 the universe intervened and decided it was time to change course and she found herself in Boston. There she was cast in her first film, a one woman show and an adaptation of Checkov's \"The Lady With The Pet Dog\" at the Leland Center all while still working in the corporate world. But these life changing acting opportunities set her on the path of acting as a career. After a life changing event, she decided that she had the gift of a fresh, new start and decided that this was the time to pursue acting for real. At 33 she moved to London where she received her Masters in Acting at the Arts Educational School of London. Some of her performances while there include Phyllis in Bernard Shaw's \"The Philanderer\", Lady 'you know who' in that Scottish Play by Shakespeare, Lona Hessel in an adaptation of Iben's \"Pillars of The Community\" and \"The Graduate\" at The New Vic Theatre with Charity Wakefield. She then moved to Los Angeles where she fell into the arms of the Classical Theatre Lab and spread her wings. It was a difficult time in her fledgling career. It was early 2000s and casting wasn't very representative of what the world actually looked like and as a mixed race actress in her 30s, auditions were very few and far between. In her 5 years there, she managed to book her first TV gig on Zoey 101, her first National commercial (Cricket Wireless with Jessica Sanchez) and an exciting supporting role in the independent film \"Beginners\" with Christopher Plummer and Ewan McGregor. But it wasn't enough to keep her fire alive and it was time to take a break and regroup.\n\nShe moved to Charlottesville VA and opened an acting school for kids and adults called the Hollywood Theatre Lab (teaching life skills through acting). It was an exciting time. Charlottesville welcomed her with open arms and the school grew rapidly with so much support. She was able to keep the machine well oiled by working on indie films shot there.",
        "birthday": "1970-09-02",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 44578,
        "imdb_id": "nm1506923",
        "known_for_department": "Acting",
        "name": "Lana Young",
        "place_of_birth": "Bermuda",
        "popularity": 0.1308,
        "profile_path": "/t3zpBzzBIXPTtLpFGPEIQaOEpxX.jpg"
    }
}