{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qLhoEKvkG3SgjyBrgn6wMxaTHr4.jpg",
                "genre_ids": [
                    27,
                    28,
                    53
                ],
                "id": 9542,
                "original_language": "en",
                "original_title": "The Hitcher",
                "overview": "On a stormy night, young Jim, who transports a luxury car from Chicago to California to deliver it to its owner, feeling tired and sleepy, picks up a mysterious hitchhiker, who has appeared out of nowhere, thinking that a good conversation will help him not to fall asleep. He will have enough time to deeply regret such an unmeditated decision.",
                "popularity": 2.0227,
                "poster_path": "/89giuiFssSVCUxkCP386v66cry8.jpg",
                "release_date": "1986-01-17",
                "title": "The Hitcher",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 992,
                "character": "Trooper Hancock",
                "credit_id": "52fe4507c3a36847f80b808b",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/ctzKCslTsMRsOJNvAm1Mw8ytiHY.jpg",
                "genre_ids": [
                    28,
                    12,
                    35,
                    18,
                    37
                ],
                "id": 9359,
                "original_language": "en",
                "original_title": "Maverick",
                "overview": "Bret Maverick is a gambler who would rather con someone than fight them, and needs an additional $3k in order to enter a winner-takes-all poker game beginning in a few days. He joins forces with a woman with a marvelous Southern accent, and the two try and enter the game.",
                "popularity": 4.7713,
                "poster_path": "/mTVbGGi5PIexmxVzeyFd2RYKwfM.jpg",
                "release_date": "1994-05-20",
                "title": "Maverick",
                "video": false,
                "vote_average": 6.889,
                "vote_count": 1662,
                "character": "Riverboat Poker Player",
                "credit_id": "52fe44edc3a36847f80b24c7",
                "order": 46
            },
            {
                "adult": false,
                "backdrop_path": "/diGPtRd1p8Oanp5Vu51rV2bu4K5.jpg",
                "genre_ids": [
                    18,
                    53
                ],
                "id": 11329,
                "original_language": "en",
                "original_title": "Runaway Jury",
                "overview": "After a workplace shooting in New Orleans, a trial against the gun manufacturer pits lawyer Wendell Rohr against shady jury consultant Rankin Fitch, who uses illegal means to stack the jury with people sympathetic to the defense. But when juror Nicholas Easter and his girlfriend Marlee reveal their ability to sway the jury into delivering any verdict they want, a high-stakes cat-and-mouse game begins.",
                "popularity": 5.1042,
                "poster_path": "/g58RA1zzE39KnkRpKRfgA5RxoXP.jpg",
                "release_date": "2003-01-16",
                "title": "Runaway Jury",
                "video": false,
                "vote_average": 6.925,
                "vote_count": 1426,
                "character": "Sebald",
                "credit_id": "5b645c940e0a267eeb05785f",
                "order": 53
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Henry Del Gado ",
            "Hank Delgado",
            "Henry Delgado",
            "Manolito",
            "Henry & Lucy ",
            "هنری دارو"
        ],
        "biography": "Henry Darrow (September 15, 1933 - March 14, 2021) was a Nuyorican character actor of stage and film. He is best known for his role as Manolito \"Mano\" Montoya on the 1960s television series The High Chaparral and as the corrupt and vengeful Trooper Hancock in The Hitcher.\n\nDarrow's starring role in the play The Wonderful Ice Cream Suit brought him to the attention of television producer David Dortort, who cast him as Manolito Montoya on the western series The High Chaparral, which aired for four seasons on NBC from 1967 to 1971. The series made Darrow and the series' lead, Cameron Mitchell, household names. In 1972, he co-founded the Screen Actors Guild Ethnic Minority Committee with actors Ricardo Montalbán, Edith Diaz, and Carmen Zapata.\n\nDarrow went on to star in multiple shows about Zorro: he provided the voice of Zorro in the 1981 animated series The New Adventures of Zorro, starred as Zorro Sr. in the 1983 limited series Zorro and Son, and replaced Efrem Zimbalist Jr. as Zorro's father from 1990–1994 in the Family Channel's series The New Zorro. Another notable recurring television role was as police detective Manny Quinlan in the first season of Harry O (1974-75). Over the course of a career spanning more than five decades, Darrow was also seen in numerous guest starring television roles and occasional supporting film roles.",
        "birthday": "1933-09-15",
        "deathday": "2021-03-14",
        "gender": 2,
        "homepage": null,
        "id": 44686,
        "imdb_id": "nm0201688",
        "known_for_department": "Acting",
        "name": "Henry Darrow",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.3922,
        "profile_path": "/nN31ROoQKhXEt4CAlALE9qld285.jpg"
    }
}