{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4kIRrW1AlHP5Idne8CPHeQt8nR5.jpg",
                "genre_ids": [
                    16,
                    10751,
                    35,
                    14
                ],
                "id": 550205,
                "original_language": "en",
                "original_title": "Wish Dragon",
                "overview": "Determined teen Din is longing to reconnect with his childhood best friend when he meets a wish-granting dragon who shows him the magic of possibilities.",
                "popularity": 6.0287,
                "poster_path": "/lnPf6hzANL6pVQTxUlsNYSuhT5l.jpg",
                "release_date": "2021-01-15",
                "title": "Wish Dragon",
                "video": false,
                "vote_average": 7.88,
                "vote_count": 1407,
                "character": "Din (voice)",
                "credit_id": "60e9e66f12b10e0046bc43e3",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "黄谷悦"
        ],
        "biography": "Jimmy Wong is a Chinese American actor, host, chef, and singer songwriter. Most recently, he was announced as a cast member of Disney's Mulan (2020) playing the character Ling, one of Mulan's friends in the army. Previously, he starred in the hit webseries Video Game High School (2012-2014), created the cooking show Feast of Fiction online to over 1 million subscribers, cohosts the popular Magic the Gathering podcast The Command Zone and Game Knights, and is the face of DisneyXD's gaming show Polaris Primetime. Online, his content has been viewed over 300 million times across his numerous projects. He is the younger brother of popular director and creator Freddie Wong of RocketJump. His content can be found all across the internet, representing the entertainment, geek, gaming, and cooking worlds.\n\nJimmy first became known after a racist incident at UCLA, when a sorority student posted a vlog rant against Asians studying too loudly in the library, openly mocking their accent and language. Jimmy responded with the \"Ching Chong, It Means I Love You\" song, which garnered national attention and over 5 million views. Later that year, Jimmy created the cooking show Feast of Fiction, dedicated to bringing foods seen in movies, video games, cartoons, and TV shows to real life. In 2012, Jimmy starred as one of the three titular characters in the massively popular webseries Video Game High School for three seasons. In 2018, Jimmy was announced as a main cast member of Mulan (2020), playing the role of Ling, one of Mulan's friends in the army.\n\nJimmy has hosted for a wide range of projects, creating the top show Game Knights for Magic: the Gathering alongside cohost Josh Lee Kwai, and has represented brands across various projects such as Disney XD, Nintendo, Riot Games, Wizards of the Coast, Food Network, Starbucks, PepsiCo, Showtime, Google, Lionsgate, Walmart, IGN, Bon Appetit, State Farm, Conagra, and more.",
        "birthday": "1987-03-28",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 447244,
        "imdb_id": "nm4136296",
        "known_for_department": "Acting",
        "name": "Jimmy Wong",
        "place_of_birth": " Seattle, Washington, USA",
        "popularity": 0.2421,
        "profile_path": "/4857lISQnBHQewi4sL7aBkJ5sFa.jpg"
    }
}