{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ecZ6MQ3Y63dtn35km6odO0e39aQ.jpg",
                "genre_ids": [
                    27,
                    35
                ],
                "id": 763,
                "original_language": "en",
                "original_title": "Braindead",
                "overview": "When a Sumatran rat-monkey bites Lionel Cosgrove's mother, she's transformed into a zombie and begins killing (and transforming) the entire town while Lionel races to keep things under control.",
                "popularity": 4.0522,
                "poster_path": "/pa39D8TQs6aNw3hiUs4jLjHVUB0.jpg",
                "release_date": "1992-08-13",
                "title": "Braindead",
                "video": false,
                "vote_average": 7.392,
                "vote_count": 1744,
                "character": "Forry",
                "credit_id": "63ddbf77cd2046009d4e7adc",
                "order": 46
            },
            {
                "adult": false,
                "backdrop_path": "/aVefEnQsfNPUrgsuMszTDt165P0.jpg",
                "genre_ids": [
                    27,
                    10402,
                    9648
                ],
                "id": 92060,
                "original_language": "en",
                "original_title": "Michael Jackson's Thriller",
                "overview": "A night at the movies turns into a nightmare when Michael and his date are attacked by a horde of bloody-thirsty zombies. On top of the success of the Thriller album and Michael Jackson's electrifying performance at Motown 25, the short film/music video for \"Thriller\" established Jackson as an international superstar and global phenomenon. Thriller is credited for transforming music videos into a serious art form, breaking down racial barriers in popular entertainment, popularizing the making-of documentary format and creating a home video market. The success transformed Jackson into a dominant force in global pop culture. In 2009, it became the first music video inducted into the United States National Film Registry by the Library of Congress as \"culturally, historically or aesthetically significant\". \"Thriller\" was also Jackson's seventh and final U.S. Hot 100 Top 10 hit from the Thriller album. It was the first album in history to have seven U.S. Top 10s.",
                "popularity": 2.6936,
                "poster_path": "/dYHGoPMkZMVuBA4EydmDQMo1EEv.jpg",
                "release_date": "1983-11-14",
                "title": "Michael Jackson's Thriller",
                "video": false,
                "vote_average": 8.2,
                "vote_count": 718,
                "character": "Man in Movie Theater (uncredited)",
                "credit_id": "59d01635c3a3687929007637",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Forrest James Ackerman",
            "Forest J. Ackerman",
            "Forrest Ackerman",
            "Forry J. Ackerman",
            "Forry Ackerman"
        ],
        "biography": "Forrest J Ackerman (born Forrest James Ackerman; November 24, 1916 – December 4, 2008) was an American magazine editor, science fiction writer and literary agent, a founder of science fiction fandom, a leading expert on science fiction and fantasy films, and acknowledged as the world's most avid collector of genre books and movie memorabilia. He was based in Los Angeles, California.\n\nThis article uses material from the Wikipedia article \"Forrest J Ackerman\", which is released under the Creative Commons Attribution-Share-Alike License 3.0.",
        "birthday": "1916-11-24",
        "deathday": "2008-12-08",
        "gender": 2,
        "homepage": null,
        "id": 44762,
        "imdb_id": "nm0009969",
        "known_for_department": "Acting",
        "name": "Forrest J. Ackerman",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 3.2371,
        "profile_path": "/b0Sj5Yt71ruCJN4CKUHOppWvHVG.jpg"
    }
}