{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/vL5LR6WdxWPjLPFRLe133jXWsh5.jpg",
                "genre_ids": [
                    28,
                    12,
                    14,
                    878
                ],
                "id": 19995,
                "original_language": "en",
                "original_title": "Avatar",
                "overview": "In the 22nd century, a paraplegic Marine is dispatched to the moon Pandora on a unique mission, but becomes torn between following orders and protecting an alien civilization.",
                "popularity": 23.1187,
                "poster_path": "/gKY6q7SjCkAU6FqvqWybDYgUKIF.jpg",
                "release_date": "2009-12-15",
                "title": "Avatar",
                "video": false,
                "vote_average": 7.594,
                "vote_count": 32616,
                "character": "Dancer",
                "credit_id": "65a2530e858678012b5b83bc",
                "order": 56
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Haniyyah Tahirah is a professional dancer, choreographer, and instructor with over 15 years of experience. Trained in ballet, modern, jazz, West African and Brazilian dance, Haniyyah worked as a Principal dancer & Soloist for over 13 years with the internationally acclaimed Lula Washington Dance Theatre. Making her debut in the 2006 Playboy Jazz festival performing with legendary jazz musician Mccoy Tyner. She has toured throughout the U.S. and internationally performing throughout Russia, China, Brazil and Tel Aviv, Israel performing choreography by the late Donald McKayle, Rennie Harris, and Lula Washington. While working with the dance company Haniyyah was also a part of the making of the 2009 blockbuster film Avatar directed by James Cameron in which she was a Mo-Cap actor and dancer. She's also worked with Viver Brasil Dance Company as a guest artist that lead her to perform as a Samba dancer for Disney's California Adventure Viva Navidad Holiday Spectacular for three consecutive seasons. Haniyyah has also performed choreography by Tony Award winner George Faison for the NYC SummerStage Series. As a dancer & choreographer she's been featured in several music videos for artists such as Wiz Khalifa, Dej Loaf ft. Leon Bridges, Dawin (Latin Artist) and Frans (Swedish Artist). She's also choreographed & performed original work entitled 'Wideke 11' created and premiered exclusively at the Broad Museum in Downtown Los Angeles. In addition to conducting a community West African drum & Afro-modern dance class at The Broad Museum's Family Weekend Workshop in 2022. Most recently Haniyyah was the creative director, choreographer, and featured performer in the short film 'Children of the Soil' inspired & based around El Anatusi's work 'Strips of the Earth's Skin' commissioned by the Broad Museum. Haniyyah continues to teach dance & movement coaching to youth and adults through her non-profit organization Cre8ive Dance Company inc.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 4478640,
        "imdb_id": "nm4029762",
        "known_for_department": "Acting",
        "name": "Haniyyah Tahirah",
        "place_of_birth": null,
        "popularity": 0.0071,
        "profile_path": null
    }
}