{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9F6zZuETJWUtkcSEnOc0JLqBHAK.jpg",
                "genre_ids": [
                    53,
                    18
                ],
                "id": 10083,
                "original_language": "en",
                "original_title": "No Way Out",
                "overview": "Navy Lt. Tom Farrell meets a young woman, Susan Atwell , and they share a passionate fling. Farrell then finds out that his superior, Defense Secretary David Brice, is also romantically involved with Atwell. When the young woman turns up dead, Farrell is put in charge of the murder investigation. He begins to uncover shocking clues about the case, but when details of his encounter with Susan surface, he becomes a suspect as well.",
                "popularity": 5.8542,
                "poster_path": "/93CzsBvRhg035yvQosRtSsTL19v.jpg",
                "release_date": "1987-08-14",
                "title": "No Way Out",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 751,
                "character": "Senator William 'Billy' Duvall",
                "credit_id": "52fe43209251416c7500482d",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/9pUh1fC8TqVtYPeKpdfNyVK0qnn.jpg",
                "genre_ids": [
                    18
                ],
                "id": 12102,
                "original_language": "en",
                "original_title": "Kramer vs. Kramer",
                "overview": "Ted Kramer is a career man for whom his work comes before his family. His wife Joanna cannot take this anymore, so she decides to leave him. Ted is now faced with the tasks of housekeeping and taking care of himself and their young son Billy.",
                "popularity": 4.2546,
                "poster_path": "/gmkGQQpvOq52icAer3vriT5S25O.jpg",
                "release_date": "1979-12-07",
                "title": "Kramer vs. Kramer",
                "video": false,
                "vote_average": 7.572,
                "vote_count": 2319,
                "character": "John Shaunessy",
                "credit_id": "52fe44b59251416c7503e329",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Howard Green Duff"
        ],
        "biography": "Howard Green Duff (November 24, 1913 – July 8, 1990) was an American actor of film, television, stage, and radio.\n\nDuff was born in Charleston, Washington, now a part of Bremerton. He graduated from Roosevelt High School in Seattle in 1932 where he began acting in school plays only after he was cut from the basketball team. His first film role was as an inmate in Brute Force. His other movies include The Naked City (1948), All My Sons (1948), Calamity Jane and Sam Bass (1949), Panic in the City (1968), In Search of America (1971), A Wedding (1978) and No Way Out (1987).\n\nHe appeared in a number of films with his first wife, actress/director Ida Lupino. One of Duff's later performances was as Dustin Hoffman's attorney in the Academy Award-winning Kramer vs. Kramer (1979).\n\nOn radio, Duff played Dashiell Hammett's private eye Sam Spade from 1946–1950, starring in The Adventures of Sam Spade on three different networks - ABC, CBS and NBC. In 1951 Steve Dunne took over the role of Sam Spade. Duff also appeared in an episode of Climax! entitled Escape From Fear in 1955.\n\nOn television, Duff appeared with his then wife Ida Lupino in the CBS comedy Mr. Adams and Eve from January 1957 through September 1958, in which they played husband and wife film stars named Howard Adams and Eve Drake. He played the young Samuel Langhorne Clemens, in his early life in the West as a satirical and crusading journalist, in the TV series Bonanza (\"Enter Mark Twain,\" season 1, episode 5, 1959). In 1960 he played the male main character in The Twilight Zone episode \"A World of Difference\" as Arthur Curtis/Jerry Raigan. From October 1960 through April 1961, Duff played Willie Dante, owner of the San Francisco nightclub, Dante's Inferno, in the NBC adventure/drama series Dante. In 1964, Duff guest starred as Harold Baker on the episode \"Prodigy\" of NBC's medical drama about psychiatry The Eleventh Hour, starring Jack Ging and Ralph Bellamy. In 1990, he guest starred on an episode of The Golden Girls (episode: The Mangiacavallo Curse Makes a Lousy Wedding Present).\n\nFrom September 1966 through January 1969, Duff portrayed Detective Sergeant Sam Stone in the ABC police drama Felony Squad with costar Dennis Cole. In the 1980s, he appeared on dramas such as NBC's Flamingo Road and Knots Landing, and Dallas, both on CBS.",
        "birthday": "1913-11-24",
        "deathday": "1990-07-08",
        "gender": 2,
        "homepage": null,
        "id": 44846,
        "imdb_id": "nm0003318",
        "known_for_department": "Acting",
        "name": "Howard Duff",
        "place_of_birth": null,
        "popularity": 0.4928,
        "profile_path": "/7LFu95tQM8IRLbSIcsgvfOBwnf2.jpg"
    }
}