{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/aBwn1DUpAUgluPNlR2RCjaw7wWn.jpg",
                "genre_ids": [
                    28,
                    35
                ],
                "id": 12207,
                "original_language": "cn",
                "original_title": "醉拳二",
                "overview": "Returning home with his father after a shopping expedition, Wong Fei-Hong is unwittingly caught up in the battle between foreigners who wish to export ancient Chinese artifacts and loyalists who don't want the pieces to leave the country. Fei-Hong must fight against the foreigners using his Drunken Boxing style, and overcome his father's antagonism as well.",
                "popularity": 7.3078,
                "poster_path": "/xqUBrSBtPYLvCtfqHF5sapU6Div.jpg",
                "release_date": "1994-02-03",
                "title": "The Legend of Drunken Master",
                "video": false,
                "vote_average": 7.425,
                "vote_count": 1019,
                "character": "Ling",
                "credit_id": "52fe44ca9251416c75040f9b",
                "order": 2
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/7H5QU8VCzuJEpl9pC9JyeaSNDsH.jpg",
                "genre_ids": [
                    80,
                    18,
                    10749
                ],
                "id": 18311,
                "original_language": "cn",
                "original_title": "阿飛正傳",
                "overview": "Yuddy, a Hong Kong playboy known for breaking girls' hearts, tries to find solace and the truth after discovering the woman who raised him isn't his mother.",
                "popularity": 3.8184,
                "poster_path": "/g0nbZt1eFlL8FqG8r524iXnpoQV.jpg",
                "release_date": "1990-12-15",
                "title": "Days of Being Wild",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 536,
                "credit_id": "657150e0b0460500e3945113",
                "department": "Sound",
                "job": "Songs"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Mei Yanfang",
            "何加男",
            "Madonna of Asia",
            "Anita Mui",
            "梅艷芳",
            "Anita Mui Yim-Fong",
            " Mui Yim-Fong",
            "Mei Yan Fang "
        ],
        "biography": "Anita Mui Yim-Fong (Chinese: 梅艷芳, 10 October 1963 – 30 December 2003) was a popular Hong Kong singer and actress. During her prime years she made major contributions to the cantopop music scene, while receiving numerous awards and honours. She remained an idol throughout most of her career, and was generally regarded as a cantopop diva. Mui once held a sell-out concert at Hammersmith, London, England, where she was dubbed the \"Madonna of Asia\". That title has stayed with her throughout her career, and has been used as a comparison for both Eastern and Western media.\n\nIn the 1980s the gangtai style of music was revolutionised by her wild dancing and femininity on stage. She was famous for having outrageous costumes and also high powered performances. Her fanbase reached far beyond Hong Kong, and into many parts of Asia including Taiwan, Mainland China, Singapore, Malaysia as well as the overseas market. In the Hong Kong entertainment industry where stars often come and go, Mui was able to remain a major star in the spotlight for 20 years. Her career only came to a stop in 2003 when she was suddenly diagnosed with cervical cancer, dying at the early age of 40. Even so, her music and film legacy continues to live on. Her success reached well beyond that of the entertainment circle with humanitarian work, donations and charities that played a major role in helping society even well into the present day.\n\nDescription above from the Wikipedia article Anita Mui, licensed under CC-BY-SA, full list of contributors on Wikipedia​",
        "birthday": "1963-10-10",
        "deathday": "2003-12-30",
        "gender": 1,
        "homepage": null,
        "id": 44917,
        "imdb_id": "nm0611315",
        "known_for_department": "Acting",
        "name": "Anita Mui",
        "place_of_birth": "Hong Kong, British Crown Colony [now China]",
        "popularity": 0.8641,
        "profile_path": "/6vJDAOY24y0iWFik5NOzNKCysLn.jpg"
    }
}