{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/y3zUOMWRoI2vC4ck2GBJyFWhzyA.jpg",
                "genre_ids": [
                    35,
                    10751,
                    10749
                ],
                "id": 9820,
                "original_language": "en",
                "original_title": "The Parent Trap",
                "overview": "Hallie Parker and Annie James are identical twins who were separated at a young age due to their parents' divorce. Unbeknownst to their parents, the girls are sent to the same summer camp, where they meet, discover the truth about their relationship, and come up with a plan to switch places in an effort to reunite their mother and father.",
                "popularity": 12.468,
                "poster_path": "/p4dGmi8u9W0HHyVXcgWPoiFfKTF.jpg",
                "release_date": "1998-07-28",
                "title": "The Parent Trap",
                "video": false,
                "vote_average": 7.219,
                "vote_count": 4351,
                "character": "Chessy",
                "credit_id": "52fe4534c3a36847f80c1edd",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "리사 앤 월터",
            "لیزا آن والتر"
        ],
        "biography": "Lisa Ann Walter is an American actress, comedian, and television producer, best known for her roles as Chessy the housekeeper in the romantic comedy film The Parent Trap (1998) and Melissa Schemmenti on the Peabody Award-winning ABC mockumentary sitcom Abbott Elementary (2021–present), for which she received a Screen Actors Guild Award for Outstanding Ensemble in a Comedy Series.\n\nShe was formerly the creator and executive producer of Oxygen network reality weight-loss competition series, Dance Your Ass Off. Her other reality television work includes her stint as a judge on ABC's reality television series The Next Best Thing: Who Is the Greatest Celebrity Impersonator?, and as winning celebrity editions of the game shows The Weakest Link and Jeopardy! She also created and starred in the 1996–1997 sitcom, Life's Work, and appeared in such films as Bruce Almighty, Shall We Dance, and War of the Worlds.",
        "birthday": "1963-08-03",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 4494,
        "imdb_id": "nm0910076",
        "known_for_department": "Acting",
        "name": "Lisa Ann Walter",
        "place_of_birth": "Silver Spring, Maryland, USA",
        "popularity": 2.7122,
        "profile_path": "/56vu6e7zmXLVwDG7eVa9phEe4gA.jpg"
    }
}