{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1yWn9A2LN0uRGudIg0bV2Np6T69.jpg",
                "genre_ids": [
                    10752,
                    28,
                    18
                ],
                "id": 9289,
                "original_language": "en",
                "original_title": "The Longest Day",
                "overview": "The retelling of June 6, 1944, from the perspectives of the Germans, US, British, Canadians, and the Free French. Marshall Erwin Rommel, touring the defenses being established as part of the Reich's Atlantic Wall, notes to his officers that when the Allied invasion comes they must be stopped on the beach. \"For the Allies as well as the Germans, it will be the longest day\"",
                "popularity": 3.5233,
                "poster_path": "/5zmvEofdIlgXrQl9A7e5IOzlnFU.jpg",
                "release_date": "1962-09-25",
                "title": "The Longest Day",
                "video": false,
                "vote_average": 7.594,
                "vote_count": 977,
                "character": "Capt. Harding",
                "credit_id": "52fe44e2c3a36847f80afcd7",
                "order": 23
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "William Forrest Andrews",
            "William Andrews",
            "Stephen Forrest",
            "Steven Forrest",
            "스티브 포레스트",
            "Стив Форрест"
        ],
        "biography": "A ruggedly handsome action man of the 1960's and 70's, Steve Forrest  began his screen career as a small part contract player with MGM. A  brother of star Dana Andrews,  he was born William Forrest Andrews, the youngest of thirteen children.  His father was a Baptist minister in Huntsville, Texas. In 1942, Steve  enlisted in the U.S. Army, rose to the rank of sergeant and saw action  at the Battle of the Bulge. Following his demobilisation, he visited his  brother in Hollywood and came to the conclusion that acting wasn't a  bad way to make a living (having already done some work as a movie  extra). He went on to study in college at UCLA, eventually graduating in  1950 with a B.A. Honours Degree in theatre arts. He then served a brief  apprenticeship as a carpenter, prop boy and set builder at San Diego's  La Jolla Playhouse, where he was discovered by resident actor Gregory Peck  and given a small part as a bellboy in the cast of the summer stock  production of \"Goddbye Again\". A subsequent screen test led to a  contract with MGM and resulting employment as second leads, brothers of  the titular star, toughs and outlaws. His first proper recognition was  being awarded 'New Star of the Year' by Golden Globe for his role in So Big (1953), a drama based on a Pulitzer prize-winning novel by Edna Ferber.\n\nFrom  the mid-1950's, the rangy, 6-foot-3 actor became much in-demand on TV,  beginning with classic early anthology and western series, interspersed  with occasional appearances on the big screen (notably, in The Longest Day (1962) and as Joan Crawford's lover/attorney Greg Savitt in Mommie Dearest (1981)). In addition to numerous guest roles, he was regularly featured in series like Gunsmoke (1955), Dallas (1978) (as Wes Parmalee, who believes himself to be lost Ewing patriarch Jock) and Murder, She Wrote  (1984). Already from the mid-60's, he decided to pick his assignments  more carefully. In order to shed his image as the perpetual bad guy, he  had relocated his family to England to star as  antique-dealer-cum-undercover intelligence agent John Mannering in BBC's  The Baron  (1966). He followed this by another starring role as the stoic, tough  Lieutenant Dan 'Hondo' Harrelson in the short-lived ABC police drama  series S.W.A.T. (1975), possibly his best-remembered role. Steve later lampooned his screen personae in the satirical Amazon Women on the Moon (1987).\n\nIn  private life, Steve Forrest was known as a skilled golfer, lover of  football and (according to 1970's newspaper articles) as a dedicated  amateur beekeeper.",
        "birthday": "1924-09-29",
        "deathday": "2013-05-18",
        "gender": 2,
        "homepage": null,
        "id": 44998,
        "imdb_id": "nm0002079",
        "known_for_department": "Acting",
        "name": "Steve Forrest",
        "place_of_birth": "Huntsville, Texas, USA",
        "popularity": 0.3727,
        "profile_path": "/gIAQMiYS5n9ULS7D363kJvStqlR.jpg"
    }
}