{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uxjPyKutAtw7lHZ3mHg0MzQvAK9.jpg",
                "genre_ids": [
                    9648,
                    18,
                    53
                ],
                "id": 10403,
                "original_language": "en",
                "original_title": "The Player",
                "overview": "A Hollywood studio executive is being sent death threats by a writer whose script he rejected - but which one?",
                "popularity": 3.3881,
                "poster_path": "/tZ3kDut2dhFVGkWNEn9xoCHCNAx.jpg",
                "release_date": "1992-05-08",
                "title": "The Player",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 878,
                "character": "Steve Allen",
                "credit_id": "52fe43689251416c7500f25b",
                "order": 31
            },
            {
                "adult": false,
                "backdrop_path": "/iZGiMD0p1M2AOmzKknFo5bkuz94.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 524,
                "original_language": "en",
                "original_title": "Casino",
                "overview": "In early-1970s Las Vegas, Sam \"Ace\" Rothstein gets tapped by his bosses to head the Tangiers Casino. At first, he's a great success in the job, but over the years, problems with his loose-cannon enforcer Nicky Santoro, his ex-hustler wife Ginger, her con-artist ex Lester Diamond and a handful of corrupt politicians put Sam in ever-increasing danger.",
                "popularity": 9.7377,
                "poster_path": "/gziIkUSnYuj9ChCi8qOu2ZunpSC.jpg",
                "release_date": "1995-11-22",
                "title": "Casino",
                "video": false,
                "vote_average": 7.995,
                "vote_count": 6180,
                "character": "Himself",
                "credit_id": "64e0192de19de900adfca1ee",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Stephen Valentine Patrick William Allen",
            "Steven Allen",
            "Steve Allen Jr."
        ],
        "biography": "Stephen Valentine Patrick William Allen was an American television personality, radio personality, musician, composer, actor, comedian, writer, and advocate of scientific skepticism. In 1954, he achieved national fame as the co-creator and first host of The Tonight Show, which was the first late night television talk show.\n\nThough he got his start in radio, Allen is best known for his extensive network television career. He gained national attention as a guest host on Arthur Godfrey's Talent Scouts. After he hosted The Tonight Show, he went on to host numerous game and variety shows, including his own The Steve Allen Show, I've Got a Secret, and The New Steve Allen Show. He was a regular panel member on CBS's What's My Line?, and from 1977 until 1981 wrote, produced, and hosted the award-winning public broadcasting show Meeting of Minds, a series of historical dramas presented in a talk format.\n\nAllen was a pianist and a prolific composer. By his own estimate, he wrote more than 8,500 songs, some of which were recorded by numerous leading singers. Working as a lyricist, Allen won the 1964 Grammy Award for Best Original Jazz Composition. He also wrote more than 50 books, including novels, children's books, and books of opinions, including his final book, Vulgarians at the Gate: Trash TV and Raunch Radio.\n\nIn 1996 Allen was presented with the Martin Gardner Lifetime Achievement Award from the Committee for Skeptical Inquiry (CSICOP). He has two stars on the Hollywood Walk of Fame and a Hollywood theater named in his honor.",
        "birthday": "1921-12-26",
        "deathday": "2000-10-30",
        "gender": 2,
        "homepage": null,
        "id": 45001,
        "imdb_id": "nm0006752",
        "known_for_department": "Acting",
        "name": "Steve Allen",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.4058,
        "profile_path": "/smfesYmaX6pfZefpYU6L69ePwiG.jpg"
    }
}