{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/eEN7tsCCHppGhONHngvHKSdxi7r.jpg",
                "genre_ids": [
                    10749,
                    18
                ],
                "id": 11036,
                "original_language": "en",
                "original_title": "The Notebook",
                "overview": "An epic love story centered around an older man who reads aloud to a woman with Alzheimer's. From a faded notebook, the old man's words bring to life the story about a couple who is separated by World War II, and is then passionately reunited, seven years later, after they have taken different paths.",
                "popularity": 17.9819,
                "poster_path": "/rNzQyW4f8B8cQeg7Dgj3n6eT5k9.jpg",
                "release_date": "2004-05-25",
                "title": "The Notebook",
                "video": false,
                "vote_average": 7.891,
                "vote_count": 12069,
                "character": "Wife of Buyer #3",
                "credit_id": "65bbe92111c066017bd0c8a4",
                "order": 24
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Sasha Azevedo was born in San Diego, California and grew up in Charleston, South Carolina. She discovered her love for performance early in life as a baton twirler and gymnast, and is equally passionate about competitive sports and the great outdoors.\n\nShe began modeling at age 11, was graduated from Trident Technical College with a degree in Business, and traveled the world as a magician's assistant aboard Princess and Norwegian Cruises. In her free time - when not being sawed in half or levitated - she honed her skills as a nature photographer.\n\nAs a model, she has appeared in numerous hairstyle magazines, hairstyling DVDs, and professional salon books. As an actress, she has appeared in the Lifetime Television series Army Wives (2007), various independent films and the feature film The Notebook (2004). Her professional experience includes work in the promotion and trade show industry with events such as NASCAR, the Family Circle Cup, and Live 8: A Worldwide Concert Event Presented by Nokia (2005). A versatile talent, Sasha also recorded with The Misplaced Comedy Group of Florida and mambo danced in the musical Damn Yankees!\n\nToday, Sasha is a seasoned performer and model who approaches each new project with passion and enthusiasm. She currently resides in Charleston, South Carolina and divides her time between modeling, acting and photography.",
        "birthday": "1978-05-20",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 4512766,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Sasha Azevedo",
        "place_of_birth": "San Diego, California, USA",
        "popularity": 0.0675,
        "profile_path": null
    }
}