{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/41Mlaj6wfjlF4wQaVH0tjfDXvMi.jpg",
                "genre_ids": [
                    18,
                    9648
                ],
                "id": 11020,
                "original_language": "en",
                "original_title": "Picnic at Hanging Rock",
                "overview": "In the early 1900s, Miranda attends a girls boarding school in Australia. One Valentine's Day, the school's typically strict headmistress treats the girls to a picnic field trip to an unusual but scenic volcanic formation called Hanging Rock. Despite rules against it, Miranda and several other girls venture off. It's not until the end of the day that the faculty realizes the girls and one of the teachers have disappeared mysteriously.",
                "popularity": 4.0646,
                "poster_path": "/7BAXwmFN4pZDNb9N6kzmAAwdssi.jpg",
                "release_date": "1975-09-02",
                "title": "Picnic at Hanging Rock",
                "video": false,
                "vote_average": 7.223,
                "vote_count": 835,
                "character": "Albert Crundall",
                "credit_id": "52fe43e59251416c75022353",
                "order": 18
            },
            {
                "adult": false,
                "backdrop_path": "/n2eUT4zQA2yYcKOgAFidgOyiFoH.jpg",
                "genre_ids": [
                    18,
                    37
                ],
                "id": 68718,
                "original_language": "en",
                "original_title": "Django Unchained",
                "overview": "With the help of a German bounty hunter, a freed slave sets out to rescue his wife from a brutal Mississippi plantation owner.",
                "popularity": 12.4836,
                "poster_path": "/7oWY8VDWW7thTzWh3OKYRkWUlD5.jpg",
                "release_date": "2012-12-25",
                "title": "Django Unchained",
                "video": false,
                "vote_average": 8.184,
                "vote_count": 27058,
                "character": "The Le Quint Dickey Mining Co. Employee",
                "credit_id": "538c1f280e0a266712003842",
                "order": 38
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "John Jarrett"
        ],
        "biography": "Jarratt was born and grew up in Wongawilli, a small rural town near Wollongong, New South Wales and later in the Snowy Mountains area. Jarratt’s father was a coal miner and later a concreter, who worked on the Snowy Mountains hydroelectric scheme. His 5x great-grandfather, George Jarratt, born 1833, came from Croxton in Cambridgeshire, England; his son, John, married a Mary Kelly from Ireland. While in high school, Jarratt directed and acted in a school play which was a great success and led to his school principal recommending him for an acting career.  Jarratt graduated from the National Institute of Dramatic Art (NIDA) in 1973. His screen debut was in The Great Macarthy. He also appeared in Peter Weir’s Picnic at Hanging Rock in 1975 and Summer City in 1977 with Mel Gibson. Jarratt had the lead role in the mini series The Last Outlaw playing Ned Kelly in 1979. He played a major supporting role as a young Australian soldier in Vietnam war movie The Odd Angry Shot, 1980. In the late 1980s, Jarratt recognised he had a problem with binge drinking and related violence and joined Alcoholics Anonymous, an organisation in which he continues to be active.  In the 1990s, he was a presenter on the lifestyle show Better Homes and Gardens with then-wife Noni Hazlehurst. He had guest roles in Inspector Morse, Police Rescue, Blue Murder, Water Rats and Blue Heelers in the 1990s and 2000s. He joined the cast of McLeod’s Daughters in 2001, and left the show in 2006. In 2010, Jarratt appeared in a commercial for Husqvarna.\n\nIn May 2013, Jarratt filmed a guest star role in the third instalment of the ABC telemovie series, Jack Irish: Dead Point.  In 2005, he had a major role in the Australian film Wolf Creek, playing the villain Mick Taylor.[5] In 2007, he appeared in two films, Rogue and The Final Winter. Jarratt also had a small role in the 2008 film, Australia, as a soldier.\n\nIn 2008, Jarratt launched his own film production company, Winnah Films. Winnah’s first feature film, Savages Crossing (originally carrying the working title Flood) went into principal photography outside Ipswich, Queensland in February. In 2009, he appears as the father of a teenage girl via phone in Telstra’s “Next G” commercials.  In 2010, Jarratt starred in the ensemble exploitation extravaganza, Bad Behaviour, written and directed by Joseph Sims. In the same year, Jarratt also had a role in the supernatural horror movie Needle.\n\nHe made a cameo in Quentin Tarantino’s Django Unchained in 2012, appearing as an employee of the Le Quint Dickie Mining Company alongside Tarantino himself, both appearing with Australian accents.\n\nIn February 2013, Jarratt reprised his role as Mick Taylor, filming the Wolf Creek sequel, Wolf Creek 2, with Matt Hearn producing and Greg McLean directing. The film was released on 20 February 2014.  In January 2014, a new thriller called StalkHer began filming on the Gold Coast, Queensland. The film is co-directed by Jarratt, who also stars in the production. The producer of the film is ‘OZPIX’, a production company partly owned by Jarratt. Filming was completed in February 2014, and will screen later in the year.",
        "birthday": "1951-08-05",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 45210,
        "imdb_id": "nm0418877",
        "known_for_department": "Acting",
        "name": "John Jarratt",
        "place_of_birth": "Wongawilli, New South Wales, Australia",
        "popularity": 0.2593,
        "profile_path": "/h5dgpQbqJdX9xaqde6IDWuubGkr.jpg"
    }
}