{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5PfHGXosySGs0l1JfeREspy3v6G.jpg",
                "genre_ids": [
                    878,
                    28,
                    12
                ],
                "id": 1924,
                "original_language": "en",
                "original_title": "Superman",
                "overview": "Mild-mannered Clark Kent works as a reporter at the Daily Planet alongside his crush, Lois Lane. Clark must summon his superhero alter-ego when the nefarious Lex Luthor launches a plan to take over the world.",
                "popularity": 9.8184,
                "poster_path": "/d7px1FQxW4tngdACVRsCSaZq0Xl.jpg",
                "release_date": "1978-12-14",
                "title": "Superman",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 4067,
                "character": "Sam Lane (uncredited)",
                "credit_id": "5af13e5d9251411e7e002f96",
                "order": 81
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Kirk Alyn (1910–1999) was an American actor, best known for being the first actor to play Superman in live-action in Superman serial and Atom Man vs. Superman as well as Blackhawk in the Blackhawk serial, and Sam Lane in Superman: The Movie.\n\nAlyn started as a chorus boy for Broadway plays, appearing in notable musicals such as Girl Crazy, Of Thee I Sing, and Hellzapoppin' during the 1930s.\n\nHe also worked as a singer and dancer in vaudeville before relocating to Hollywood during the early 1940s to act for feature movies, but he was successful only in gaining bit parts for low-budget movies before obtaining the role of Superman in 1948. During World War II he served in the United States Navy.\n\nAlyn also featured in movie serials, including Federal Agents Vs. Underworld Inc., Radar Patrol Vs. Spy King and Blackhawk. Alyn played Superman for the first live-action Superman movie serial, released in 1948. The serial consisted of 15 episodes which recounted Superman’s arrival on Earth, getting a job as a reporter at the Daily Planet newspaper, and meeting Lois Lane and Jimmy Olsen.\n\nAfter playing Superman, he again suffered casting problems. Apart from featuring in some similar comic book-type serials, he had few roles in television series and movies, some even uncredited, until he retired.",
        "birthday": "1910-10-08",
        "deathday": "1999-03-14",
        "gender": 2,
        "homepage": null,
        "id": 45229,
        "imdb_id": "nm0001906",
        "known_for_department": "Acting",
        "name": "Kirk Alyn",
        "place_of_birth": "Oxford, New Jersey, USA",
        "popularity": 0.121,
        "profile_path": "/l7d3Zk9B1F3EsGgF9us587zb8kB.jpg"
    }
}