{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ppNc9wcpdHFvfxGuLeiXUpmB3oA.jpg",
                "genre_ids": [
                    10751,
                    16,
                    14,
                    12,
                    18,
                    9648,
                    878
                ],
                "id": 11704,
                "original_language": "en",
                "original_title": "The Secret of NIMH",
                "overview": "A widowed field mouse must move her family -- including an ailing son -- to escape a farmer's plow. Aided by a crow and a pack of superintelligent, escaped lab rats, the brave mother struggles to transplant her home to firmer ground.",
                "popularity": 5.3554,
                "poster_path": "/bqH0pbnt92C8WJ3lwLhllQZndeY.jpg",
                "release_date": "1982-06-17",
                "title": "The Secret of NIMH",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 879,
                "character": "Sullivan (voice)",
                "credit_id": "6264e4f3713ed4005047c021",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Aldo Ray was born in the borough of Pen Argyl, in Northampton County, Pennsylvania on 25 September 1926. He attended the University of California at Berkeley, served as a US Navy frogman during WWII and saw action on Iwo Jima.\n\nWhile constable of Crockett, California, he drove his brother Guido to an audition for the film Idols in the Dust (1951). Director David Miller hired him for a small role as a cynical football player. Ray's husky frame, thick neck and raspy voice made him perfect for playing tough sexy roles. He was the star of George Cukor's The Marrying Kind (1952) and starred opposite Rita Hayworth in Miss Sadie Thompson (1953). Ray was the none-too-bright boxer in Cukor's Pat and Mike (1952) and an escaped convict in 'Michael Curtiz\"s We're No Angels (1955). His career started downhill in the 1970s, with him appearing in a string of low-budget films as a character actor. His last film was Shock 'Em Dead (1991).\n\nRay was married three times, with one daughter Claire born in 1951 to his first wife Shirley Green whom he married on on 20 June 1947. Ray was then briefly married to actress Jeff Donnell and then had two sons and a daughter with his third wife, Johanna Ray, one of whom is the actor Eric DaRe. Aldo Ray died of throat cancer on 27 March 1991.",
        "birthday": "1926-09-25",
        "deathday": "1991-03-27",
        "gender": 2,
        "homepage": null,
        "id": 45232,
        "imdb_id": "nm0712731",
        "known_for_department": "Acting",
        "name": "Aldo Ray",
        "place_of_birth": "Pen Argyl, Pennsylvania, USA",
        "popularity": 0.3199,
        "profile_path": "/x00IKE88CleZRaUg6lPtyx2xyYW.jpg"
    }
}