{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mgDv2dDihyetAcENxyf2tpXY245.jpg",
                "genre_ids": [
                    10402,
                    18
                ],
                "id": 1407,
                "original_language": "fr",
                "original_title": "La Môme",
                "overview": "From the mean streets of the Belleville district of Paris to the dazzling limelight of New York's most famous concert halls, Edith Piaf's life was a constant battle to sing and survive, to live and love. Raised in her grandmother's brothel, Piaf was discovered in 1935 by nightclub owner Louis Leplee, who persuaded her to sing despite her extreme nervousness. Piaf became one of France's immortal icons, her voice one of the indelible signatures of the 20th century.",
                "popularity": 3.1454,
                "poster_path": "/3b9DAONAsFRhJKu25R33PE3VwDh.jpg",
                "release_date": "2007-02-14",
                "title": "La Vie en Rose",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 1667,
                "character": "Simone 'Mômone' Berteaut",
                "credit_id": "52fe42f3c3a36847f802f4f9",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/ieux01445tYkzGdAukUFiYZiDNn.jpg",
                "genre_ids": [
                    18,
                    36,
                    10752
                ],
                "id": 41411,
                "original_language": "fr",
                "original_title": "La Rafle",
                "overview": "A faithful retelling of the 1942 \"Vel' d'Hiv Roundup\" and the events surrounding it.",
                "popularity": 3.512,
                "poster_path": "/9osPoGTddZZfMUzFDs82n57y2wQ.jpg",
                "release_date": "2010-03-10",
                "title": "The Round Up",
                "video": false,
                "vote_average": 7.546,
                "vote_count": 1025,
                "character": "Bella Zygler",
                "credit_id": "52fe45c7c3a36847f80d9fed",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/k4renoGJzagylgBYWbpjQLYGAfB.jpg",
                "genre_ids": [
                    27,
                    9648,
                    18
                ],
                "id": 361292,
                "original_language": "en",
                "original_title": "Suspiria",
                "overview": "A darkness swirls at the center of a world-renowned dance company, one that will engulf the artistic director, an ambitious young dancer, and a grieving psychotherapist. Some will succumb to the nightmare. Others will finally wake up.",
                "popularity": 7.5385,
                "poster_path": "/bRpKFPb8CWKRQxVo9NzOuPPlO3Q.jpg",
                "release_date": "2018-10-26",
                "title": "Suspiria",
                "video": false,
                "vote_average": 6.904,
                "vote_count": 2645,
                "character": "Miss Griffith",
                "credit_id": "57f4353bc3a36805ac001241",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Sylvie Voyer",
            "Sylvie Voyet"
        ],
        "biography": "Sylvie Testud was born on January 17, 1971 in Lyon. Her parents separated when she was two years old. She spent her youth in the Lyon district of Croix-Rousse, raised by her mother, an accountant. In high school, she learned Chinese. Very early fascinated by the cinema, the young girl identifies in particular with the complexed teenager character embodied by Charlotte Gainsbourg in L'Effrontée. Having moved to Paris to study history, she soon embarked on acting by joining the free class at Cours Florent and then the Conservatory, where her teachers were Jacques Lassalle and Catherine Hiegel. She made her first screen appearance in 1994 in Couples et amants.\n\nShe decided to become an actress during her youth, after having admired actresses in films. She then took acting lessons in Lyon with the actor and director Christian Taponard. In 1989, she moved to Paris to study history, as well as drama lessons in free classes at Cours Florent, then at the National Conservatory of Dramatic Art for three years, with Jacques Lassalle and Catherine Hiegel for teachers.\n\nIn the early 1990s, she obtained her first small roles in the cinema, then in feature films such as The Story of the Boy Who Wanted to Be Kissed by Philippe Harel (1994), Le Plus Bel Age..., by Didier Haudepin (1995) or even Love, etc. by Marion Vernoux (1996).\n\nIn 1997, Sylvie Testud experienced her first great success at the cinema in Germany with the film Beyond Silence by Caroline Link, for which she learned German, the clarinet and sign language. She is rewarded as best actress by the German Film Prize (the equivalent of the César for best actress). In 1998, she played her first major role in French cinema and enjoyed great success in France with the role of Béa in Karnaval, the first feature film by Thomas Vincent, for which she was nominated for the César for best female hope and received the Michael Simon Prize. She then began an important acting career with a preference for auteur cinema.\n\nIn 2000, her performance in La Captive by Chantal Akerman (adaptation of the novel La Prisonnière by Marcel Proust) earned her a nomination as best actress at the European Film Prize. In 2001, she obtained, for her second nomination, the César for best female hope for the remarkable interpretation of Christine Papin, one of the Papin sisters, in Les Blessures assassines by Jean-Pierre Denis, based on a news item from 1933.",
        "birthday": "1971-01-17",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 4529,
        "imdb_id": "nm0856500",
        "known_for_department": "Acting",
        "name": "Sylvie Testud",
        "place_of_birth": "Lyon, Rhône, France",
        "popularity": 0.4064,
        "profile_path": "/yafOAmaZkJ8BOEWLoQcWJVx2EYT.jpg"
    }
}