{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gXPtXbvI0nfLihu1dXgehAxsvm1.jpg",
                "genre_ids": [
                    18,
                    53,
                    80,
                    12
                ],
                "id": 1541,
                "original_language": "en",
                "original_title": "Thelma & Louise",
                "overview": "Taking a break from their dreary lives, close friends Thelma and Louise embark on a short weekend trip that ends in unforeseen incriminating circumstances. As fugitives, both women rediscover the strength of their bond and their newfound resilience.",
                "popularity": 5.6945,
                "poster_path": "/vbRAGLzbC75QfiKD1lKjmnQGuph.jpg",
                "release_date": "1991-05-24",
                "title": "Thelma & Louise",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 3655,
                "character": "Major",
                "credit_id": "54a3a0c992514117dd003baf",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/8yE0aOQoZSSl2CuuPvjxdHuQl4P.jpg",
                "genre_ids": [
                    878,
                    53
                ],
                "id": 10514,
                "original_language": "en",
                "original_title": "The Andromeda Strain",
                "overview": "When virtually all of the residents of Piedmont, New Mexico, are found dead after the return to Earth of a space satellite, the head of the US Air Force's Project Scoop declares an emergency. A group of eminent scientists led by Dr. Jeremy Stone scramble to a secure laboratory and try to first isolate the life form while determining why two people from Piedmont - an old alcoholic and a six-month-old baby - survived. The scientists methodically study the alien life form unaware that it has already mutated and presents a far greater danger in the lab, which is equipped with a nuclear self-destruct device designed to prevent the escape of dangerous biological agents.",
                "popularity": 4.281,
                "poster_path": "/4FBSFz8wLpxd4o6hnvKOJJ8WSIz.jpg",
                "release_date": "1971-03-12",
                "title": "The Andromeda Strain",
                "video": false,
                "vote_average": 7.054,
                "vote_count": 736,
                "character": "Toby (technician)",
                "credit_id": "57a328eac3a36829a4001b8d",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Kenneth Charles Swofford "
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nKen Swofford (July 25, 1933 - November 1, 2018) was an American film and television actor noted for his red  hair and ruddy complexion. He was often cast as \"everyman\", villains, or  policemen.\n\nBetween 1962 and 1995, Swofford's film credits included The Court-Martial of Jackie Robinson, Thelma and Louise, Black Roses and The Andromeda Strain,  while his TV career during the same period was prolific. Appearing  repeatedly as a guest and/or in recurring roles, he is best remembered  as Quentin Morlock in Fame, Lt. Griffin in Switch, Cutler in The Oregon Trail, Al Barber in Rich Man, Poor Man Book II, Lt. Catalano in Murder, She Wrote and columnist Frank Flanagan in Ellery Queen.",
        "birthday": "1933-07-25",
        "deathday": "2018-11-01",
        "gender": 2,
        "homepage": null,
        "id": 45308,
        "imdb_id": "nm0842855",
        "known_for_department": "Acting",
        "name": "Ken Swofford",
        "place_of_birth": "DuQuoin - Illinois - USA",
        "popularity": 0.3409,
        "profile_path": "/gi5OedNwbCV3yX7GA9sU7eFJp28.jpg"
    }
}