{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xinJKZQiqkdJhoYc2SXuEnhehXz.jpg",
                "genre_ids": [
                    12,
                    28,
                    35,
                    53,
                    80
                ],
                "id": 941,
                "original_language": "en",
                "original_title": "Lethal Weapon",
                "overview": "A veteran cop and an unstable detective become partners who must put their differences aside in order to bring down a heroin-smuggling ring run by ex-Special Forces.",
                "popularity": 7.0058,
                "poster_path": "/6gt44oqb4nE8vflPElffeGwsHVl.jpg",
                "release_date": "1987-03-06",
                "title": "Lethal Weapon",
                "video": false,
                "vote_average": 7.285,
                "vote_count": 4778,
                "character": "Fire Rescue Attendant (uncredited)",
                "credit_id": "5f6a33f8c1ffbd0033d2c308",
                "order": 59
            },
            {
                "adult": false,
                "backdrop_path": "/g9ROrZey0JYp7kf8DoAyZtKnObj.jpg",
                "genre_ids": [
                    27
                ],
                "id": 377,
                "original_language": "en",
                "original_title": "A Nightmare on Elm Street",
                "overview": "Teenagers in a small town are dropping like flies, apparently in the grip of mass hysteria causing their suicides. A cop's daughter, Nancy Thompson, traces the cause to child molester Fred Krueger, who was burned alive by angry parents many years before. Krueger has now come back in the dreams of his killers' children, claiming their lives as his revenge. Nancy and her boyfriend, Glen, must devise a plan to lure the monster out of the realm of nightmares and into the real world...",
                "popularity": 9.8159,
                "poster_path": "/wGTpGGRMZmyFCcrY2YoxVTIBlli.jpg",
                "release_date": "1984-11-09",
                "title": "A Nightmare on Elm Street",
                "video": false,
                "vote_average": 7.34,
                "vote_count": 5424,
                "character": "Boy in Nancy's English Class (uncredited)",
                "credit_id": "67e15d6f7d0565af0207f138",
                "order": 25
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/fLqhMfRyMySsqORn0xq7iFWRdcM.jpg",
                "genre_ids": [
                    27
                ],
                "id": 11879,
                "original_language": "en",
                "original_title": "Near Dark",
                "overview": "A farm boy reluctantly becomes a member of the undead when a girl he meets turns out to be part of a band of vampires who roam the highways in stolen cars.",
                "popularity": 5.1213,
                "poster_path": "/hVhFNn3IQxxARvnpLIKMx8ZfTtG.jpg",
                "release_date": "1987-10-02",
                "title": "Near Dark",
                "video": false,
                "vote_average": 6.859,
                "vote_count": 804,
                "credit_id": "639bae95d2b209007deaf556",
                "department": "Crew",
                "job": "Carpenter"
            },
            {
                "adult": false,
                "backdrop_path": "/7HWx6ADPMGmzoZh1LLpzJZLKsbx.jpg",
                "genre_ids": [
                    35,
                    18,
                    10752
                ],
                "id": 801,
                "original_language": "en",
                "original_title": "Good Morning, Vietnam",
                "overview": "A disk jockey goes to Vietnam to work for the Armed Forces Radio Service. While he becomes popular among the troops, his superiors disapprove of his humor.",
                "popularity": 3.7488,
                "poster_path": "/sreISlFUn5TyR41QNjlfAdX5SEW.jpg",
                "release_date": "1987-12-23",
                "title": "Good Morning, Vietnam",
                "video": false,
                "vote_average": 7.308,
                "vote_count": 2861,
                "credit_id": "67e163d41c3663cb814d882a",
                "department": "Crew",
                "job": "Carpenter"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Chris Tashima is an award-winning American actor and director. He has starred in numerous independent feature films, most notably as the romantic lead opposite Joan Chen, Allison Sie, Kelly Hu and Autumn Reeser, in Eric Byler's Americanese which won a Special Jury Prize for Outstanding Ensemble Cast at SXSW. He was awarded Best Actor in a Supporting Role, at the inaugural Love International Film Festival, for his portrayal of  Papa Nakaji in Tim Savage's World War II family drama Under the Blood Red Sun produced by Dana Satler Hankins. He portrayed real-life educator/activist Shigeo Yoshida in the 442nd RCT origin story Go For Broke from producer/screenwriter Stacey Hayashi. Most recently, he played the hard-nosed Uncle Bob in the generational family comedy No No Girl from writer/director Paul Daisuke Goodman--for which he received two nominations at the Austin Revolution Film Festival, and he plays Hiro in Brian M. Tang's action/fantasy short Kodama, receiving its world premiere at SXSW 2023.\n\nTashima received an Academy Award® for directing the dramatic short film Visas and Virtue, a re-telling of the heroic actions of Holocaust rescuer Chiune Sugihara. In addition he co-wrote the screenplay adapting a one-act play by Tim Toyama, and starred as the Humanitarian diplomat Sugihara. He also directed, co-wrote and starred in the WWII Japanese American internment short film Day of Independence which was nominated for a NATAS Northern California Area Emmy®.  These two directorial works came from Tashima's own Cedar Grove Productions, an indie entertainment house aiming to \"Boldly defy mainstream Hollywood by giving Asian Americans the close-up onscreen.\"",
        "birthday": "1960-03-24",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 45329,
        "imdb_id": "nm0850875",
        "known_for_department": "Acting",
        "name": "Chris Tashima",
        "place_of_birth": "Cambridge, Massachusetts, USA",
        "popularity": 0.1903,
        "profile_path": "/dQ27oWtFm5IFiHS6M0g4gG24itt.jpg"
    }
}