{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fBvSfLetWlAMevQVHa0nBDV1Fon.jpg",
                "genre_ids": [
                    28,
                    53
                ],
                "id": 1572,
                "original_language": "en",
                "original_title": "Die Hard: With a Vengeance",
                "overview": "New York detective John McClane is back and kicking bad-guy butt in the third installment of this action-packed series, which finds him teaming with civilian Zeus Carver to prevent the loss of innocent lives. McClane thought he'd seen it all, until a genius named Simon engages McClane, his new \"partner\" -- and his beloved city -- in a deadly game that demands their concentration.",
                "popularity": 6.5824,
                "poster_path": "/buqmCdFQEWwEpL3agGgg2GVjN2d.jpg",
                "release_date": "1995-05-19",
                "title": "Die Hard: With a Vengeance",
                "video": false,
                "vote_average": 7.273,
                "vote_count": 6369,
                "character": "Katya",
                "credit_id": "52fe42ffc3a36847f80329a7",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Leslie Ann Phillips",
            "Leslie Phillips"
        ],
        "biography": "Leslie Ann Phillips (born June 28, 1962), better known by her stage name Sam Phillips, is an American singer and songwriter. She is also an actress, best known for her film acting debut as the mute terrorist Katya in the Bruce Willis blockbuster Die Hard with a Vengeance.\n\nPhillips made a cameo appearance in the 1997 Wim Wenders film The End of Violence, singing part of the song \"Animals on Wheels\" from Omnipop.\n\nPhillips also began writing music for and scoring the TV series Gilmore Girls, and appeared in the final episode of season six, performing \"Taking Pictures\" from her Fan Dance album. She also composed scores for the television shows Bunheads, The Marvelous Mrs. Maisel, and Gilmore Girls: A Year in the Life.\n\nShe began her musical career in the early 1980s in the contemporary Christian music industry, where she sang background vocals for Christian artists Mark Heard and Randy Stonehill. Phillips was signed as a solo artist with Myrrh Records under her given name and recorded four Christian pop albums: Beyond Saturday Night, Dancing with Danger, Black and White in a Grey World and, The Turning. The Turning teamed her with producer T Bone Burnett, whom she would later marry.\n\nSeveral of Phillips' songs became Top 10 singles on Christian radio and Myrrh records promoted her as \"the Christian Cyndi Lauper\". Phillips was never comfortable with this image, and it was a bone of contention between her and her label. She began using the name \"Sam\" professionally in 1988 when she left Myrrh Records and signed with Virgin Records in order to distance herself from her prior persona.\n\nWith The Indescribable Wow, Philips moved into mainstream music. Cruel Inventions was released in 1991, and included a guest performance by Elvis Costello. 1994's Martinis and Bikinis was nominated for a Grammy Award, her second nomination.\n\nIn 1996, she released Omnipop (It's Only a Flesh Wound Lambchop), which featured a song co-written by R.E.M. After releasing a contractually obligated \"best of\" album in 1999, Virgin Records dropped Phillips from its roster. In 2001, she signed with Nonesuch Records, evolving her musical style to a stripped-down, acoustically based sound on her album called Fan Dance\n\nIn 2004, she released A Boot and a Shoe, another collection of acoustically based songs, similar in style to Fan Dance. Her album Don't Do Anything was self-produced and released in 2008.\n\nIn October 2009, she launched The Long Play, a music subscription service offering digital releases without a record label. The first subscription only EP, Hypnotists in Paris, was recorded with the Section Quartet and a Christmas collection Cold Dark Night, Magic for Everyone, Old Tin Pan, and Days of the One Night Stands followed, with the full-length album Cameras in the Sky released in early 2010. In Spring 2011, she issued Solid State, a public CD release.\n\nPush Any Button was released on August 13, 2013. In 2013, her first live concert album, Sam Phillips: Live @ Largo at The Coronet, was made available digitally through her website. In 2016, Phillips released a downloadable EP Human Contact is Never Easy, which included four new tracks off her next album World on Sticks. In September 2018, Phillips released World on Sticks.",
        "birthday": "1962-01-28",
        "deathday": null,
        "gender": 1,
        "homepage": "https://samphillips.com/",
        "id": 45337,
        "imdb_id": "nm0680767",
        "known_for_department": "Acting",
        "name": "Sam Phillips",
        "place_of_birth": "Glendale, California, USA",
        "popularity": 0.1265,
        "profile_path": "/2oqcONjUnpUHhA5e191Q39TNt2Z.jpg"
    }
}