{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kIBBeb94FbNfLSljeFUxUoszflb.jpg",
                "genre_ids": [
                    18,
                    10752,
                    36
                ],
                "id": 17295,
                "original_language": "it",
                "original_title": "La battaglia di Algeri",
                "overview": "Paratrooper commander Colonel Mathieu, a former French Resistance fighter during World War II, is sent to Algeria to reinforce efforts to squelch the uprisings of the Algerian War. There he faces Ali la Pointe, a former petty criminal who, as the leader of the Algerian Front de Liberation Nationale, directs terror strategies against the colonial French government occupation. As each side resorts to ever-increasing brutality, no violent act is too unthinkable.",
                "popularity": 2.1462,
                "poster_path": "/2p3AFtOHFvP6OeVMqlnL1zLKOqL.jpg",
                "release_date": "1966-09-08",
                "title": "The Battle of Algiers",
                "video": false,
                "vote_average": 7.872,
                "vote_count": 826,
                "character": "Le Marié de la Casbah",
                "credit_id": "65d20bdaa06645014a19673d",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Abderrahmane Brahimi is an Algerian actor. He plays in the film \"The Battle of Algiers\" in 1966 the role of the young groom, whose office is celebrated by his brother by his brother Abderrahmane Brahimi, who plays the role of an FLN administrator. The film takes place in 1957, in Algeria, the people, supported by the FLN, revolt against the French occupier. On both sides, extreme methods are used: torture by the French army and terrorism by the Algerians revolting against the power in place. The war will spare no one. In the Casbah district of Algiers, a former delinquent, Ali La Pointe, refuses to stop the fight, even when the situation seems desperate. For his part, Colonel Mathieu tries as best he can to carry out his mission, even if it means using drastic means... The film was nominated 3 times for the Oscars and was awarded the Golden Lion at the Mostra de Venice 1966.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 4543725,
        "imdb_id": "nm15840079",
        "known_for_department": "Acting",
        "name": "Abderrahmane Brahimi",
        "place_of_birth": "Algiers, Algeria",
        "popularity": 0.0256,
        "profile_path": "/8NSuIWB8GYMtjmBS8kwzgLvRPwX.jpg"
    }
}