{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kIBBeb94FbNfLSljeFUxUoszflb.jpg",
                "genre_ids": [
                    18,
                    10752,
                    36
                ],
                "id": 17295,
                "original_language": "it",
                "original_title": "La battaglia di Algeri",
                "overview": "Paratrooper commander Colonel Mathieu, a former French Resistance fighter during World War II, is sent to Algeria to reinforce efforts to squelch the uprisings of the Algerian War. There he faces Ali la Pointe, a former petty criminal who, as the leader of the Algerian Front de Liberation Nationale, directs terror strategies against the colonial French government occupation. As each side resorts to ever-increasing brutality, no violent act is too unthinkable.",
                "popularity": 2.1462,
                "poster_path": "/2p3AFtOHFvP6OeVMqlnL1zLKOqL.jpg",
                "release_date": "1966-09-08",
                "title": "The Battle of Algiers",
                "video": false,
                "vote_average": 7.872,
                "vote_count": 826,
                "character": "La Mariée de la Casbah",
                "credit_id": "65d5cb8dffd44d01302ab4e6",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Fatiha Djoudi is an Algerian actress. She played the role of Casbah's friend in Gillo Pontecorvo's film \"The Battle of Algiers\". The action of the film \"The Battle of Algiers\" takes place in 1957, in Algeria, the people, supported by the FLN, revolt against the French occupier. On both sides, extreme methods are used: torture by the French army and the poor man's war, terrorism by Algerians in revolt against the power in place. The war will spare no one. In the Casbah district of Algiers, a former delinquent, Ali La Pointe, refuses to stop the fighting, even when the situation seems desperate. For his part, Colonel Mathieu tries as best he can to carry out his mission, even if it means using drastic means... The film won the Golden Lion at the Venice Film Festival in 1966. She tells her story with the film in “The History of the Film The Battle of Algiers” by Salim Aggar released in 2018, and his regrets at not having been able to continue with cinema.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.spla.pro/fr/fiche.personnes.spla.56395.html",
        "id": 4545261,
        "imdb_id": "nm15844502",
        "known_for_department": "Acting",
        "name": "Fatiha Djoudi",
        "place_of_birth": "Algiers, Algeria",
        "popularity": 0.0071,
        "profile_path": null
    }
}