{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/vzavBt9c6v4zBaGiwQDO21aNQG9.jpg",
                "genre_ids": [
                    28,
                    12,
                    10752
                ],
                "id": 11046,
                "original_language": "en",
                "original_title": "Where Eagles Dare",
                "overview": "World War II is raging, and an American general has been captured and is being held hostage in the Schloss Adler, a Bavarian castle that's nearly impossible to breach. It's up to a group of skilled Allied soldiers to liberate the general before it's too late.",
                "popularity": 6.8612,
                "poster_path": "/dnyiVS4Ad4w4rfS4Bm1YalEdonx.jpg",
                "release_date": "1968-12-04",
                "title": "Where Eagles Dare",
                "video": false,
                "vote_average": 7.514,
                "vote_count": 928,
                "character": "German Officer (uncredited)",
                "credit_id": "5f3f77b2904f6d0034a771da",
                "order": 27
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Ian McCulloch (born 18 November 1939) is a Scottish actor of stage, film, and television.\n\nMcCulloch is perhaps best known for his role as Greg Preston in the post-apocalyptic 1975–77 TV series Survivors and for his work in European genre cinema.\n\nMcCulloch debuted in the second episode, \"Genesis\", of Survivors and went on to appear regularly throughout the series. He also starred in the Italian horror films Zombie Flesh Eaters also known as Zombi II (1979) by Lucio Fulci, Zombi Holocaust (1980) by Marino Girolami, and Contamination (1980) by Luigi Cozzi.\n\nZombie Flesh Eaters was originally banned in the United Kingdom as part of the 1980s campaign against \"video nasties\". McCulloch stated that he did not see the film in its entirety, or on a big screen, until years later.\n\nOver the years, McCulloch has had supporting roles in studio films like Where Eagles Dare (1968) with Richard Burton and Clint Eastwood, and Cromwell (1970) with Alec Guinness and Richard Harris. In addition, he has appeared in successful independent films, most notably The Ghoul (1975) with Peter Cushing and John Hurt.\n\nHe has also guest starred in many TV series, including: Manhunt (1969); Colditz (1974), as the mysterious Larry Page in \"Odd Man In\"; Secret Army (1977); Return of the Saint (1978); Hammer House of Horror (1980); The Professionals (1980), episode \"Mixed Doubles\", in which he played the physical fitness and close quarters combat instructor of Bodie and Doyle; and the Doctor Who serial Warriors of the Deep (1984).",
        "birthday": "1939-11-18",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 45473,
        "imdb_id": "nm0567135",
        "known_for_department": "Acting",
        "name": "Ian McCulloch",
        "place_of_birth": " Liverpool, England",
        "popularity": 0.1417,
        "profile_path": "/zabe8PY53j0nCW5rBQaXJFpe7OE.jpg"
    }
}