{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5rARlA8beRAVXPYzSaF2NoS8Ry5.jpg",
                "genre_ids": [
                    16,
                    35,
                    10751,
                    14
                ],
                "id": 76492,
                "original_language": "en",
                "original_title": "Hotel Transylvania",
                "overview": "Welcome to Hotel Transylvania, Dracula's lavish five-stake resort, where monsters and their families can live it up and no humans are allowed. One special weekend, Dracula has invited all his best friends to celebrate his beloved daughter Mavis's 118th birthday. For Dracula catering to all of these legendary monsters is no problem but the party really starts when one ordinary guy stumbles into the hotel and changes everything!",
                "popularity": 11.4196,
                "poster_path": "/eJGvzGrsfe2sqTUPv5IwLWXjVuR.jpg",
                "release_date": "2012-09-20",
                "title": "Hotel Transylvania",
                "video": false,
                "vote_average": 6.963,
                "vote_count": 8886,
                "character": "Murray the Mummy (voice)",
                "credit_id": "52fe493ec3a368484e1216d1",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/Z3ocAumcK9Iooc9BMlu7wE7XX9.jpg",
                "genre_ids": [
                    35,
                    10402,
                    10749,
                    18
                ],
                "id": 198277,
                "original_language": "en",
                "original_title": "Begin Again",
                "overview": "Gretta, a budding songwriter, finds herself alone after her boyfriend Dave ditches her. Her life gains purpose when Dan, a record label executive, notices her talent.",
                "popularity": 3.6349,
                "poster_path": "/qx4HXHXt528hS4rwePZbZo20xqZ.jpg",
                "release_date": "2014-07-03",
                "title": "Begin Again",
                "video": false,
                "vote_average": 7.233,
                "vote_count": 3870,
                "character": "Troublegum",
                "credit_id": "54d4fbebc3a3685d5700991f",
                "order": 24
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "CeeLo Green",
            "Cee-Lo",
            "Thomas Burton",
            "DeCarlos Calloway",
            "Thomas Callaway",
            "Thomas DeCarlo Callaway",
            "Gnarls Barkley",
            "Thomas DeCarlo Callaway-Burton"
        ],
        "biography": "Thomas DeCarlo Callaway, better known by his stage name CeeLo Green (or Cee Lo Green), is an American singer-songwriter, rapper, composer, record producer, actor, and businessman. Green is known for his work in soul music, including the hit singles \"Crazy\" and \"Fuck You\". Born in Atlanta, Georgia, Green came to initial prominence as a member of the Southern hip hop group Goodie Mob. He subsequently began a solo career, releasing two albums on Arista Records: Cee-Lo Green and His Perfect Imperfections (2002) and Cee-Lo Green... Is the Soul Machine (2004).\n\nGreen's next project was Gnarls Barkley, a collaboration with DJ Danger Mouse. In 2006, the duo scored a worldwide hit with \"Crazy\", which reached the top five in twenty countries, including the U.S. and U.K. With Gnarls Barkley, Green released two albums: 2006's platinum-selling St. Elsewhere and 2008's The Odd Couple. In 2010, Green continued his solo career with the album The Lady Killer, which spawned his biggest solo hit, \"Fuck You\". The song peaked at number two on the Billboard Hot 100, and reached the top 10 in thirteen countries. Green has released three further solo albums, Cee Lo's Magic Moment (2012), Heart Blanche (2015), and CeeLo Green Is Thomas Callaway, as well as a reunion album with Goodie Mob, Age Against the Machine (2014).\n\nFrom 2011 to 2014, Green was a judge and coach on the American reality television singing competition The Voice, appearing on four of its seasons.[a] He voiced Murray the Mummy in the 2012 animated feature film Hotel Transylvania, and also appeared in a few television programs and films including his own show, CeeLo Green's The Good Life, on TBS. Green has appeared in commercials, including 7 Up, Duracell, M&M’s, and sake brand TYKU. His work has earned numerous awards and accolades, including five Grammy Awards, a BET Award, a Billboard Award, and a Brit Award.",
        "birthday": "1975-05-30",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.ceelogreen.com",
        "id": 458843,
        "imdb_id": "nm0123741",
        "known_for_department": "Acting",
        "name": "Cee Lo Green",
        "place_of_birth": "Atlanta, Georgia, USA",
        "popularity": 0.3435,
        "profile_path": "/5ixrYpXoaHliLNDjak00kbhnmkl.jpg"
    }
}