{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fozq5WDVQQZ8C1K3rrvgB6IM5O9.jpg",
                "genre_ids": [
                    18
                ],
                "id": 489418,
                "original_language": "fr",
                "original_title": "Pupille",
                "overview": "Théo is given up for adoption by his biological mother on the very day he is born. After this anonymous birth, the mother has two months to change her mind… Or not. The child welfare services and adoption service spring into action… The former have to take care of the baby and support it during this limbo-like time, this period of uncertainty, while the latter must find a woman to become his adoptive mother. She is called Alice, and she has spent the last ten years fighting to have a child.",
                "popularity": 3.2158,
                "poster_path": "/andgp8cnHZPAwx3zPUDaZ0pn6Go.jpg",
                "release_date": "2018-12-05",
                "title": "In Safe Hands",
                "video": false,
                "vote_average": 7.429,
                "vote_count": 520,
                "character": "Ahmed",
                "credit_id": "5a1c4d10c3a3680b8805866e",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Юсеф Хаджі"
        ],
        "biography": "Youssef Hajdi, born June 8, 1979 in Tarascon, is a French actor.\n\nBorn in Tarascon in Bouches-du-Rhône to Moroccan parents, he grew up in Beaucaire. He went to Paris at age 20, where he worked in cafe-theatre and at the théâtre de l’Avancée. Then from 2002 to 2005, he studied acting with Jack Waltzer, a lifetime member of the Actors Studio.\n\nHis first film role was in 13 m² by Barthélémy Grossmann, which earned him a 2008 nomination for the Césars award in 2008. He acted in Les Aventures extraordinaires d'Adèle Blanc-Sec by Luc Besson and in Micmacs à tire-larigot by Jean-Pierre Jeunet. In 2012, he joined Omar Sy and Laurent Lafitte in De l'autre côté du périph, a film by David Charhon. As well, he appeared with Éric Judor in the film Mohamed Dubois by Ernesto Ona in 2013.\n\nIn 2014, he acted in La Dernière Échappée, a film by Fabien Onteniente, in which Hajdi played Eddy Clavel, a doctor who treated Laurent Fignon (Samuel Le Bihan). In 2015, he did voice acting for the animated film Pourquoi j'ai pas mangé mon pèreby Jamel Debbouze.\n\nSource: Article \"Youssef Hajdi\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1979-06-08",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 458904,
        "imdb_id": "nm1763487",
        "known_for_department": "Acting",
        "name": "Youssef Hajdi",
        "place_of_birth": "Tarascon, Bouches-du-Rhône, France",
        "popularity": 0.3361,
        "profile_path": "/fSuiu7vQbGcLUA2ZW4eSwiZ3Fs2.jpg"
    }
}