{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/213Gdu9zjGsVeWQl6p5gJrBq8n8.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 74879,
                "original_language": "tr",
                "original_title": "Bir Zamanlar Anadolu'da",
                "overview": "A group of men lead a search for a victim of a murder to whom a suspect named Kenan and his mentally challenged brother confessed. However, the search is proving more difficult than expected as Kenan is fuzzy as to the body's location. As the group continues looking, its members can't help but chat among themselves about everyday life, which ultimately leads to conversations about their deepest existential concerns and secrets.",
                "popularity": 1.5857,
                "poster_path": "/o08n2xyXGTkzKy122TTNat57SHb.jpg",
                "release_date": "2011-09-23",
                "title": "Once Upon a Time in Anatolia",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 503,
                "character": "Savcı Nusret",
                "credit_id": "52fe48e3c3a368484e1102dd",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Taner Birsel, born in 1959 in Akhisar in the province of Manisa, Turkey, first studied Journalism and Public Relations between 1976-1980. Then he went on to study Performing Arts at the Conservatory of Mimar Sinan Fine Arts University, Istanbul, from 1981 to 1985. He has been an actor at the Istanbul State Theatre and starred in more than 30 plays since 1985.\n\nSome of the plays he starred in: King Lear, Cyrano de Bergerac, Hamlet, Ay Isiginda Samata, The Death of Danton. Apart from plays, he is well-known for his career in the motion pictures as well. Some of his awards are as follows: Award for the Best Male Actor at the 24th SIYAD (Turkish Film Critics Association) Awards; Award for the Best Male Actor at the 21st SIYAD Awards for his role in \"The Confession\", (2002), which was screened at the \"Un Certain Regard\" section of the 2002 Cannes Film Festival; Award for the Best Male Actor for his role in \"A Run for Money\" (1999) at the 21st Istanbul Film Festival.",
        "birthday": "1959-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 46065,
        "imdb_id": "nm0083777",
        "known_for_department": "Acting",
        "name": "Taner Birsel",
        "place_of_birth": "Akhisar, Manisa, Turkey",
        "popularity": 1.2122,
        "profile_path": "/zq4uEMEezi9Nwev5KdVyO5juQ9e.jpg"
    }
}