{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/iuRVt8tFiXDPGgzavhuSa3QHRxD.jpg",
                "genre_ids": [
                    35
                ],
                "id": 18785,
                "original_language": "en",
                "original_title": "The Hangover",
                "overview": "When three friends finally come to after a raucous night of bachelor-party revelry, they find a baby in the closet and a tiger in the bathroom. But they can't seem to locate their best friend, Doug – who's supposed to be tying the knot. Launching a frantic search for Doug, the trio perseveres through a nasty hangover to try to make it to the church on time.",
                "popularity": 20.2069,
                "poster_path": "/A0uS9rHR56FeBtpjVki16M5xxSW.jpg",
                "release_date": "2009-06-02",
                "title": "The Hangover",
                "video": false,
                "vote_average": 7.327,
                "vote_count": 17494,
                "character": "Melissa",
                "credit_id": "52fe479a9251416c7509f607",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/ziC23LkMYj8gToQQYQGWSGJCLNF.jpg",
                "genre_ids": [
                    10751,
                    16,
                    35,
                    12
                ],
                "id": 82690,
                "original_language": "en",
                "original_title": "Wreck-It Ralph",
                "overview": "Wreck-It Ralph is the 9-foot-tall, 643-pound villain of an arcade video game named Fix-It Felix Jr., in which the game's titular hero fixes buildings that Ralph destroys. Wanting to prove he can be a good guy and not just a villain, Ralph escapes his game and lands in Hero's Duty, a first-person shooter where he helps the game's hero battle against alien invaders. He later enters Sugar Rush, a kart racing game set on tracks made of candies, cookies and other sweets. There, Ralph meets Vanellope von Schweetz who has learned that her game is faced with a dire threat that could affect the entire arcade, and one that Ralph may have inadvertently started.",
                "popularity": 15.0327,
                "poster_path": "/zWoIgZ7mgmPkaZjG0102BSKFIqQ.jpg",
                "release_date": "2012-11-01",
                "title": "Wreck-It Ralph",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 12695,
                "character": "Deanna (voice)",
                "credit_id": "52fe486b9251416c9108bd09",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Rachael Elaine Harris",
            "레이첼 해리스",
            "ریچل هریس"
        ],
        "biography": "Rachael Harris (born January 12, 1968) is an American actress and comedian. The accolades she has received include nominations for an Independent Spirit Award and a Saturn Award.\n\nIn film, Harris has had lead roles as Susan Heffley in the Diary of a Wimpy Kid film series (2010–2012) and Linda White in Natural Selection (2011). She has also had notable supporting roles in For Your Consideration (2006), The Hangover (2009), Bad Words (2013), Night at the Museum: Secret of the Tomb (2014), Old Dads (2023), and Mother of the Bride (2024).\n\nIn television, Harris has had main cast roles as Cooper on the ABC sitcom Notes from the Underbelly (2007–2008), Joanne Dunlevy on the Fox sitcom Surviving Jack (2014), Dr. Linda Martin on the Fox and Netflix fantasy series Lucifer (2016–2021), and Nora on season 1 of the Disney+ and Hulu horror series Goosebumps (2023). She had a recurring role as Sheila Sazs on the USA Network series Suits (2012–2019).\n\nDescription above from the Wikipedia article Rachael Harris, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1968-01-12",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 46074,
        "imdb_id": "nm0006713",
        "known_for_department": "Acting",
        "name": "Rachael Harris",
        "place_of_birth": "Worthington, Ohio, USA",
        "popularity": 1.7969,
        "profile_path": "/opgx6hYjg8OhrNjOBHJfzcfEVZa.jpg"
    }
}