{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/eGljNfNCrPhFYG2RXXmmE0OKu5.jpg",
                "genre_ids": [
                    18,
                    53,
                    80
                ],
                "id": 473033,
                "original_language": "en",
                "original_title": "Uncut Gems",
                "overview": "A charismatic New York City jeweler always on the lookout for the next big score makes a series of high-stakes bets that could lead to the windfall of a lifetime. Howard must perform a precarious high-wire act, balancing business, family, and encroaching adversaries on all sides in his relentless pursuit of the ultimate win.",
                "popularity": 5.189,
                "poster_path": "/sg0xxJeb3u1C4kAxhSuTwTNpEDt.jpg",
                "release_date": "2019-08-30",
                "title": "Uncut Gems",
                "video": false,
                "vote_average": 7.16,
                "vote_count": 5028,
                "character": "Norwegian Boy (uncredited)",
                "credit_id": "660ccf6eda9ef20164569190",
                "order": 82
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ryan Armstrong",
            "Ryan Anderson Armstrong"
        ],
        "biography": "Ry Armstrong grew up singing with the Seattle Symphony and performed on the Grammy-nominated album \"The Shoe Bird.\" They have been seen in Off-Broadway productions of How the Westons Won, Pete the Cat, and Orphans & Outsiders. After finishing the National Tour of Teacher from the Black Lagoon, Armstrong released their charity album (Crossroads) that benefits Broadway Cares / Equity Fights Aids; available for purchase or stream with Broadway Records. The experience prompted Armstrong to start their own record label, Indie Chameleon, and produce new, original indie music. Along with being a singer-songwriter, they have appeared in both A24's Uncut Gems, HBO's The Plot Against America, and most recently HBO's The Gilded Age.",
        "birthday": "1995-02-07",
        "deathday": null,
        "gender": 3,
        "homepage": "https://www.ryarmstrong.co/",
        "id": 4631098,
        "imdb_id": "nm9115105",
        "known_for_department": "Acting",
        "name": "Ry Armstrong",
        "place_of_birth": "Seattle, Washington, USA",
        "popularity": 0.0352,
        "profile_path": "/k61eC3U6vBf36rU3gmz3tRjKrRK.jpg"
    }
}