{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lLh39Th5plbrQgbQ4zyIULsd0Pp.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 823464,
                "original_language": "en",
                "original_title": "Godzilla x Kong: The New Empire",
                "overview": "Following their explosive showdown, Godzilla and Kong must reunite against a colossal undiscovered threat hidden within our world, challenging their very existence – and our own.",
                "popularity": 17.745,
                "poster_path": "/z1p34vh7dEOnLDmyCrlUVLuoDzd.jpg",
                "release_date": "2024-03-27",
                "title": "Godzilla x Kong: The New Empire",
                "video": false,
                "vote_average": 7.085,
                "vote_count": 4330,
                "character": "Iwi Scholar",
                "credit_id": "66108c65b09bde017ebc2f3d",
                "order": 19
            },
            {
                "adult": false,
                "backdrop_path": "/tHR34A5n0my4maACNdLpWGd6QYq.jpg",
                "genre_ids": [
                    18,
                    53
                ],
                "id": 698948,
                "original_language": "en",
                "original_title": "Thirteen Lives",
                "overview": "Based on the true nail-biting mission that captivated the world. Twelve boys and the coach of a Thai soccer team explore the Tham Luang cave when an unexpected rainstorm traps them in a chamber inside the mountain. Entombed behind a maze of flooded cave tunnels, they face impossible odds. A team of world-class divers navigate through miles of dangerous cave networks to discover that finding the boys is only the beginning.",
                "popularity": 8.5127,
                "poster_path": "/yi5KcJqFxy0D6yP8nCfcF8gJGg5.jpg",
                "release_date": "2022-07-18",
                "title": "Thirteen Lives",
                "video": false,
                "vote_average": 7.87,
                "vote_count": 1368,
                "character": "Navy Seal Officer (uncredited)",
                "credit_id": "664722d7185fac62e9226ecb",
                "order": 53
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Nick Lawler is known for Godzilla x Kong: The New Empire (2024).\n\nBorn in Thailand and raised in Australia. Chinese Grand Parents (Fathers Side) and Thai Grand Parents (Mothers Side). Spoken language English and Thai.\n\nI live a highly active balanced life, and am involved in sports and fitness recreationally and professionally. I love being fit and healthy and believe it allows me to perform at my 'Peak' in what ever goal or task I am undertaking.\n\nI am a Competitive Professional Sports Model Body Builder, 7 x Australian Title in the past 10 years (As at November 2023.)\n\nI am an advanced level surfer, who loves to surf Huge Tropical Cyclone Swells we get. I make time to surf weekly especially when not filming. I am very comfortable in the ocean and beach environments.\n\nI obtained my Snowboarding Instructors qualification whilst residing in Calgary, Alberta Canada. I have competed in snowboarding in Slalom and Giant Slalom. I have travelled to snowboard in Alaska & Lake Tahoe USA; Alberta & British Colombia Canada; Italy; New Zealand and Australia. I started the love of snow sports on Skis. You won't hear many Snowboarders saying that.\n\nFun Fact 1: As soon as the SAG strikes were announced in July 2023 and work paused, I committed myself to months of Body Building Competition Preparation. On 1 October 2023 I returned to the Body Building Stage and won another Australian Title. It's who I am, it's what I do. I commit to the task at hand and love all my hobbies, passions and professions.\n\nFun Fact 2: During my High School/Secondary School, I earned extra money to support my passion for Golf. One of my most memorable jobs was working at a Banana Plantation as a Banana Ripener. Our bananas were supplied to Weis Ice Creams. We used to get big boxes of Weis Bars each time the trucks came to collect our bananas.\n\nFun Fact 3: Also during my High School years, where I was more interested in sports and represented school in many sports. I was then encouraged to do Art. I did reluctantly. A painting I did was submitted in the Sam Lewis Peace Prize Art Competition and I won at National Level. I am still waiting to receive my painting back .",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 4636546,
        "imdb_id": "nm14482355",
        "known_for_department": "Acting",
        "name": "Nick Lawler",
        "place_of_birth": "Thailand",
        "popularity": 0.0143,
        "profile_path": "/fyag83fM0i3n43nyqgCLzlzVQ7l.jpg"
    }
}