{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/v8zOcynvSd6IW3FzZrvst2HJ53s.jpg",
                "genre_ids": [
                    80,
                    53
                ],
                "id": 276907,
                "original_language": "en",
                "original_title": "Legend",
                "overview": "Suave, charming and volatile, Reggie Kray and his unstable twin brother Ronnie start to leave their mark on the London underworld in the 1960s. Using violence to get what they want, the siblings orchestrate robberies and murders while running nightclubs and protection rackets. With police Detective Leonard \"Nipper\" Read hot on their heels, the brothers continue their rapid rise to power and achieve tabloid notoriety.",
                "popularity": 8.2447,
                "poster_path": "/4shf5Alq4KWCKqrAAQe0JGJHYp5.jpg",
                "release_date": "2015-09-09",
                "title": "Legend",
                "video": false,
                "vote_average": 7.054,
                "vote_count": 4060,
                "character": "Isabella Rose",
                "credit_id": "66126deb19690c017ca500f5",
                "order": 41
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Amaëlle"
        ],
        "biography": "Amaëlle Shannon Cunningham, better known by her stage name 'Amaëlle', is a German-born film actress, model, and dancer. From a very young age, Amaëlle immersed herself in the world of performing arts, gaining exposure to various forms of dance, singing, and acting.\n\nKnown for her strong drive for perfectionism and high-achievement, she began her journey in dance as a dedicated ballet student in Germany and Belgium. Seeking to broaden her horizons, she ventured to Ireland and later settled in London, England, where she passionately pursued her artistic aspirations, immersing herself in the vibrant cultures of dance and musical theatre. Her stage debut occurred as a chorus girl in the West End for The Royal Variety Performance 2008. Amaëlle is a graduate of Middlesex University, where she further honed her skills in various TV series such as Downton Abbey (2010), films like Fast & Furious (2009), and musical endeavours.\n\nHowever, her breakthrough role came with Legend (2015), directed by Brian Helgeland, where she garnered acclaim for her compelling performances.",
        "birthday": "1985-09-07",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.amaellecunningham.com",
        "id": 4639209,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Amaëlle Cunningham",
        "place_of_birth": "Mainz, Germany",
        "popularity": 0.051,
        "profile_path": "/jpPgCr6404mClKxB451KKuufVmZ.jpg"
    }
}