{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tY36rkGlREg5m9CaguckR8jZCye.jpg",
                "genre_ids": [
                    10752,
                    18,
                    28
                ],
                "id": 653851,
                "original_language": "en",
                "original_title": "Devotion",
                "overview": "The harrowing true story of two elite US Navy fighter pilots during the Korean War. Their heroic sacrifices would ultimately make them the Navy's most celebrated wingmen.",
                "popularity": 6.128,
                "poster_path": "/26yQPXymbWeCLKwcmyL8dRjAzth.jpg",
                "release_date": "2022-11-23",
                "title": "Devotion",
                "video": false,
                "vote_average": 7.083,
                "vote_count": 772,
                "character": "Police Officer #1 (as Todd Eastman Brown)",
                "credit_id": "6613f9c559008600b47c51d4",
                "order": 51
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Todd Eastman Brown",
            "Todsmack"
        ],
        "biography": "Todd Eastman Brown is an American actor born in Watertown, New York. In 1981 his family relocated to Concord, North Carolina where he quickly became involved in auto racing. Todd's racing career spanned over 10 years capturing numerous wins and championships before he turned his sights to entertainment. In 1998 he began to study acting through private studies with an acting professor from North Carolina School of the Arts and signed with his first agency. During this time, Todd also pursued a career in music as a lead vocalist. From 2002 through 2012 Todd toured and recorded 3 albums while also pursuing his acting career. In early 2012, Todd made the decision to step away from music and solely focus on film and television. Since doing so, Todd has appeared in over 60 productions between film, television, commercials and print accumulating over 75 career credits. In addition, Todd has been successful as a screenwriter and producer of award winning short films.",
        "birthday": "1972-06-17",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 4641470,
        "imdb_id": "nm1467014",
        "known_for_department": "Acting",
        "name": "Todd Brown",
        "place_of_birth": "Watertown, New York, USA",
        "popularity": 0.0261,
        "profile_path": "/xpdMluZmXly7mBzi8B9suxopDb9.jpg"
    }
}