{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mazqYfDUreT2KE6ZsaWT59JARHZ.jpg",
                "genre_ids": [
                    16,
                    18
                ],
                "id": 83389,
                "original_language": "ja",
                "original_title": "コクリコ坂から",
                "overview": "Yokohama, 1963. Japan is picking itself up from the devastation of World War II and preparing to host the 1964 Olympics—and the mood is one of both optimism and conflict as the young generation struggles to throw off the shackles of a troubled past. Against this backdrop of hope and change, a friendship begins to blossom between high school students Umi and Shun—but a buried secret from their past emerges to cast a shadow on the future and pull them apart.",
                "popularity": 4.6666,
                "poster_path": "/rRLYX4RZIyloHSJwvZKAhphAjiB.jpg",
                "release_date": "2011-07-16",
                "title": "From Up on Poppy Hill",
                "video": false,
                "vote_average": 7.535,
                "vote_count": 1849,
                "character": "Tokumaru Rijicho (voice)",
                "credit_id": "52fe489c9251416c91092797",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/2bHoj05gR7I5gp4oeoDCY6bU42d.jpg",
                "genre_ids": [
                    12,
                    28,
                    14,
                    10752,
                    36
                ],
                "id": 127533,
                "original_language": "ja",
                "original_title": "るろうに剣心",
                "overview": "In 1868, after the Bakumatsu war ends, the ex-assassin Kenshin Himura traverses Japan with an inverted sword, to defend the needy without killing.",
                "popularity": 4.6661,
                "poster_path": "/vo3Zs07PZfKNsTrU0pcPZONJcN5.jpg",
                "release_date": "2012-08-25",
                "title": "Rurouni Kenshin Part I: Origins",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 849,
                "character": "Kanryu Takeda",
                "credit_id": "52fe4afdc3a368484e1718cd",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/cHc7wnX6AIo71gUhwTo6IsAFirO.jpg",
                "genre_ids": [
                    16,
                    14,
                    28,
                    12
                ],
                "id": 176983,
                "original_language": "ja",
                "original_title": "ワンピース フィルム ゼット",
                "overview": "Zephyr, now known as Z, rides the seas with only one goal: Destroy all pirates and their dreams at becoming King of Pirates. When Luffy and his crew encounter him at sea, not only are they utterly defeated by the man with an arm made of Seastone, Nami, Robin, and Chopper are turned 10 years younger due to Z's minion Ain. Luffy is so determined to win against him that he does not even notice Z's master plan that could sacrifice thousands of lives.",
                "popularity": 4.5452,
                "poster_path": "/dd0HwfxstffjRgbBcQvtw3uqS6O.jpg",
                "release_date": "2012-12-15",
                "title": "One Piece Film: Z",
                "video": false,
                "vote_average": 7.487,
                "vote_count": 535,
                "character": "Binz (voice)",
                "credit_id": "58d5e3309251411fdc03740e",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "かがわ てるゆき",
            "香川 照之",
            " Ichikawa Chusha IX",
            "市川 中車",
            "九代目 市川中車",
            "ترویوکی کاگاوا"
        ],
        "biography": "Teruyuki Kagawa (香川 照之, Kagawa Teruyuki, born December 7, 1965) is a Japanese actor, kabuki actor and boxing commentator.\n\nBorn in 1965, his parents are the kabuki actor Ichikawa Ennosuke III and the cinema actress Yuko Hama. His grandmother is the film actress Sanae Takasugi.\n\nIn the Kabuki world, it is usual for the son of an actor to follow the father's footsteps since very early ages, but his parents divorced in 1968 and his mother was given the custody of him. After that event, he never saw his father again, and his mother refused to give him any training on the Kabuki art and he grew believing that it was \"something that must not be watched\". However he tried several times to meet his biological father. When he was 20, he went to one of his performances and asked if he could see him, stating that he was Ennosuke's son, but when his father's assistants reported to him the situation he refused, stating that he didn't have any son.\n\nHe graduated in social psychology at the University of Tokyo and decided to start a career in cinema.\n\nHe has twice been nominated for the Best Supporting Actor award at the Japanese Academy Awards, once for Warau Iemon and once for Kita no zeronen. He won the award for best supporting actor at the 33rd Japan Academy Prize for Mt. Tsurugidake.",
        "birthday": "1965-12-07",
        "deathday": null,
        "gender": 2,
        "homepage": "http://lotus-roots.co.jp/kagawa/",
        "id": 46691,
        "imdb_id": "nm0434596",
        "known_for_department": "Acting",
        "name": "Teruyuki Kagawa",
        "place_of_birth": "Tokyo, Japan",
        "popularity": 0.5667,
        "profile_path": "/yiQI1Cj3cLDpcwdjnivEA3HjymQ.jpg"
    }
}