{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4cp40IyTpFfsT2IKpl0YlUkMBIR.jpg",
                "genre_ids": [
                    18,
                    35,
                    10749
                ],
                "id": 1064213,
                "original_language": "en",
                "original_title": "Anora",
                "overview": "A young sex worker from Brooklyn gets her chance at a Cinderella story when she meets and impulsively marries the son of an oligarch. Once the news reaches Russia, her fairytale is threatened as his parents set out to get the marriage annulled.",
                "popularity": 19.5237,
                "poster_path": "/cgXk2tNYhJZLXdBDO5DidAVzQ82.jpg",
                "release_date": "2024-10-14",
                "title": "Anora",
                "video": false,
                "vote_average": 7.051,
                "vote_count": 2628,
                "character": "Lulu",
                "credit_id": "6627b50c2e2b2c01636795b6",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Luna Sofia Miranda is an actress, dancer, and producer who gained prominence for her role as Lulu in the 2024 film Anora, directed by Sean Baker.\n\nBorn to Colombian, Venezuelan, and Italian immigrant parents, Miranda is a native New Yorker. She studied acting at the Lee Strasberg Youth Program before attending the Professional Performing Arts School.\n\nLuna began her career as a stripper to support her college education, paying her way through a Bachelor’s in Creative Writing and Film at the CUNY BA program. She worked at Pumps, a strip club in Brooklyn known for its fair treatment of dancers, using her income to produce 16 live cabaret shows and an arthouse film.  Miranda is involved in upcoming projects, including Youthful Pleasures and FILMGIRL. She is an advocate for sex workers’ rights, and makes it her mission to destigmatize sex work in Hollywood and create opportunities for strippers to tell their stories.  Miranda splits her time between Los Angeles and New York. She loves dogs, the beach, techno, plant-based desserts, and curling up with a good book.",
        "birthday": "1999-01-01",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.lunasofia-miranda.com/",
        "id": 4670423,
        "imdb_id": "nm14599320",
        "known_for_department": "Acting",
        "name": "Luna Sofía Miranda",
        "place_of_birth": "New York City, New York, U.S.",
        "popularity": 0.1665,
        "profile_path": "/eSEfNzd7f3Eg6LxWkiA1hjN51YN.jpg"
    }
}