{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cWMeHXEGeZ8cjEOmznjVGr04Ofu.jpg",
                "genre_ids": [
                    18
                ],
                "id": 284293,
                "original_language": "en",
                "original_title": "Still Alice",
                "overview": "Alice Howland, happily married with three grown children, is a renowned linguistics professor who starts to forget words. When she receives a devastating diagnosis, Alice and her family find their bonds tested.",
                "popularity": 4.9755,
                "poster_path": "/m7lMKCHddIzlk1AkoNYdRos64DG.jpg",
                "release_date": "2014-12-05",
                "title": "Still Alice",
                "video": false,
                "vote_average": 7.476,
                "vote_count": 3166,
                "character": "Young Musician",
                "credit_id": "67f003fa48d6f031b0ad15e2",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Caleb Freundlich",
            "Caleb Freundlich Moore",
            "Cal Freundlich Moore"
        ],
        "biography": "Cal Freundlich is a composer, songwriter, and multi-instrumentalist from New York City. His music is recognized for its unique combination of acoustic, organic, and electronic instruments. Cal’s background as a guitar player, playing in rock, alternative, and jazz bands growing up, combined with his training in composition for film has allowed him to create an individual sound and style.\n\nCal’s diverse capabilities has allowed him to write music for a wide variety of projects, from Documentary and Narrative films, to animations, video games, and even web-comics. His latest work includes the 2023 feature documentary \"Eat Bitter,\" which just had it's world premiere at CPH: DOX, the 2022 documentary film “Found” (dir. Shuhao Tse), winner of the Special Jury Prize and Best Documentary  2022 Yugo BAFTA Student Awards and Gold Medal Winner at the Student Academy Awards, the 2021 documentary film “Eagles Rest in Liangshan” (dir. by Bohao Liu), winner of the Silver Medal in the 2021 Student Academy Awards Best Documentary category, and the 2021 short film, “Intersection” (dir. by Bart Freundlich), which premiered at the 2021 TriBeCa Film Festival. Cal is also the lead composer and Music Director for Laurel Pursuit Studios, who recently announced a major partnership with AETHON BOOKS to create a new slate of webcomics.  Cal is guided by his enthusiasm for storytelling and media and his passion for film scoring comes from the freedom of exploration and expression it provides. He has earned a Master’s in Music from NYU Steinhardt, and in May of 2022 he was awarded the prestigious Elmer Bernstein Award for Outstanding Collabroation and Engagement from the NYU Steinhardt Screen Scoring department. Outside of composing, Cal is also an up-and-coming alternative R&B artist performing and releasing music under the name Caleb Moore. His debut EP was released in July 2024.",
        "birthday": "1997-12-04",
        "deathday": null,
        "gender": 2,
        "homepage": "https://calfreundlichmusic.com/",
        "id": 4678534,
        "imdb_id": "nm2360503",
        "known_for_department": "Sound",
        "name": "Cal Freundlich",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.0071,
        "profile_path": null
    }
}