{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qxZz6UlcMZJlYTy3RKhYwoSpbvh.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 10868,
                "original_language": "en",
                "original_title": "The Accused",
                "overview": "Out drinking one night after a fight with her boyfriend, three men brutally rape Sarah Tobias in a bar while people watch and cheer. District Attorney Kathryn Murphy takes the case; however, she allows the rapists to receive a mild sentence. A distraught Sarah decides to seek punishment for the men who witnessed and encouraged the rape. To get justice, Sarah must take the stand and revisit the night of her attack.",
                "popularity": 4.6695,
                "poster_path": "/5DlWHYb5Q65GaHYHDo6PqGOuoF1.jpg",
                "release_date": "1988-10-14",
                "title": "The Accused",
                "video": false,
                "vote_average": 7.068,
                "vote_count": 643,
                "character": "Courthouse Reporter",
                "credit_id": "57a78dae92514130c0002f22",
                "order": 47
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Garwin Sandford"
        ],
        "biography": "​Garwin Sanford (born March 14, 1955 in Truro, Nova Scotia) is a Canadian actor best known for his portrayal of Narim in Stargate SG-1 and Simon Wallis in Stargate Atlantis.\n\nIn 1994-95, he played Captain Taylor Shields in the historical Adventure series Hawkeye. Sanford has also made guest appearances on such television series as Airwolf (Season 4), MacGyver, Sliders, The Odyssey, The Outer Limits, Earth: Final Conflict, Dark Angel, The 4400, Eureka and Supernatural. He appeared Another Cinderella Story. In 1998 Sanford appeared in Merlin's Apprentice as Lord Weston.\n\nHe's also an artist, specializing in pen and ink portraiture, and a sculptor.",
        "birthday": "1955-03-14",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 46899,
        "imdb_id": "nm0762560",
        "known_for_department": "Acting",
        "name": "Garwin Sanford",
        "place_of_birth": "Truro, Nova Scotia, Canada",
        "popularity": 0.3945,
        "profile_path": "/uVhyU0G7LQUHdfRdr2mSmEbzR7B.jpg"
    }
}