{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gz3rCM34UicmOxRY1T2SgiQZJoS.jpg",
                "genre_ids": [
                    18
                ],
                "id": 249164,
                "original_language": "en",
                "original_title": "If I Stay",
                "overview": "Mia Hall, a talented young cellist, thought the most difficult decision she would ever have to make would be whether to pursue her musical dreams at prestigious Juilliard or follow her heart to be with the love of her life, Adam, a rock singer/guitarist. However, a car wreck changes everything in an instant, and now Mia's life hangs in the balance. Suspended between life and death, Mia faces a choice that will decide her future.",
                "popularity": 3.8833,
                "poster_path": "/7Twh8h3Wh7GC9npTAEUThgkxkWL.jpg",
                "release_date": "2014-08-21",
                "title": "If I Stay",
                "video": false,
                "vote_average": 7.366,
                "vote_count": 4239,
                "character": "Cute Groupie #2",
                "credit_id": "54a285d5c3a3682f1e00e9fb",
                "order": 31
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Genna",
            "Genevieve Sterling Buechner"
        ],
        "biography": "Born on November 10, at 2:30A.M., 1991 in Edmonton during a terrible snow storm, Genevieve Buechner was born to single parent mother Tea Buechner. She began to pester her mother about acting lessons when she was three. Her mother was very reluctant to encourage this interest.\n\nStill Genna persevered and finally her mother allowed her to take a small course in acting from the local theatre - Vancouver Youth Theatre. After completing the course Genna asked if she could please audition for the youth theatre's acting tour. Her mother refused, explaining that as Genna had no experience; the chances were not high that she would make the selection. Later that evening the director for the tour called their home demanding to know why Genevieve Buechner had not come to the audition. A special audition was set up for her the next day, and Genna was selected as the youngest member of the cast. During the tour performances, Genna was scouted by Robert Carrier and signed to Carrier Talent Management in Vancouver Canada.\n\nA week later Genevieve was sent to audition for the lead in a Toronto Independent Film called St. Monica. Both Mother and child were utterly unprepared for the audition, and Genna showed up in dirty clothes, with unbrushed hair. Casting Director Carol Tarlington took pity on the hapless two, explained some of the rules, tidied her up and prepared her for the camera. Genevieve Buechner got the lead role at the age of ten years - the first film audition that she had ever been to and was flown to Toronto within three days. The film went on to be a festival success playing across North America and being selected for the Berlin Film Festival, the Atlantic Film Festival, the Toronto Film Festival and the Vancouver Film Festival. She was nominated for a Canadian Leo Award for Best Lead performance by a female in 2003 for that role.\n\nSince then she has been cast in Feature Films, lead roles in M.O.W. and has had recurring roles in Television series including the Battlestar spin- off \"Caprica\" as Tamara Adams.\n\nShe has been a huge supporter of independent films.\n\n- IMDb Mini Biography By: Tea Buechner",
        "birthday": "1991-11-10",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 46903,
        "imdb_id": "nm1068777",
        "known_for_department": "Acting",
        "name": "Genevieve Buechner",
        "place_of_birth": "Edmonton, Alberta, Canada",
        "popularity": 0.3256,
        "profile_path": "/38ORPkiBaUMwcnHIVMpfgoLdQpc.jpg"
    }
}