{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yzQ0mkz1OUJKtUK1NWp53jiGcaJ.jpg",
                "genre_ids": [
                    35,
                    878,
                    12
                ],
                "id": 926,
                "original_language": "en",
                "original_title": "Galaxy Quest",
                "overview": "For four years, the courageous crew of the NSEA protector - \"Commander Peter Quincy Taggart\", \"Lt. Tawny Madison and \"Dr.Lazarus\" - set off on a thrilling and often dangerous mission in space...and then their series was cancelled! Now, twenty years later, aliens under attack have mistaken the Galaxy Quest television transmissions for \"historical documents\" and beam up the crew of has-been actors to save the universe. With no script, no director and no clue, the actors must turn in the performances of their lives.",
                "popularity": 2.6025,
                "poster_path": "/fZXSwgZknp81vmciTb86rw0MejV.jpg",
                "release_date": "1999-12-25",
                "title": "Galaxy Quest",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 2384,
                "character": "Neru",
                "credit_id": "54e300af9251411953008ed5",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Samuel R. Lloyd IV ",
            "Samuel Lloyd"
        ],
        "biography": "Samuel \"Sam\" Lloyd, Jr. (November 12, 1963 - May 1, 2020) was an American actor and musician, perhaps best known for his portrayal of beaten down lawyer Ted Buckland on the American comedy-drama Scrubs.\n\nLloyd attended Syracuse University. He is the nephew of Back to the Future star Christopher Lloyd, and his father is also an actor. He and Christopher Lloyd both guested on Malcolm in the Middle, Sam as a housing lawyer and Christopher as Hal's father. The two also guested on The West Wing, Sam requesting the White House to release information about UFOs, and Christopher as a constitutional law expert.\n\nAside from acting, Samuel is an accomplished singer with the a cappella group The Blanks, who have made many appearances on Scrubs under the name \"The Worthless Peons\" (also known as \"Ted's Band\"). He also plays the bass in the Beatles tribute group The Butties.\n\nDescription above from the Wikipedia article Sam Lloyd, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1963-11-12",
        "deathday": "2020-05-01",
        "gender": 2,
        "homepage": null,
        "id": 46920,
        "imdb_id": "nm0516127",
        "known_for_department": "Acting",
        "name": "Sam Lloyd",
        "place_of_birth": "Weston, Vermont, USA",
        "popularity": 0.3265,
        "profile_path": "/ti0pt6k5eXGbW8j7ktxSXLfutLA.jpg"
    }
}