{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4LRemkftqYK7OmmP88rJLTvGYHu.jpg",
                "genre_ids": [
                    18,
                    53,
                    80,
                    9648
                ],
                "id": 15472,
                "original_language": "sv",
                "original_title": "Män som hatar kvinnor",
                "overview": "Swedish thriller based on Stieg Larsson's novel about a male journalist and a young female hacker. In the opening of the movie, Mikael Blomkvist, a middle-aged publisher for the magazine Millennium, loses a libel case brought by corrupt Swedish industrialist Hans-Erik Wennerström. Nevertheless, he is hired by Henrik Vanger in order to solve a cold case, the disappearance of Vanger's niece",
                "popularity": 4.6015,
                "poster_path": "/6w0TKhfR0Rzby5SXxgfuI99Jrva.jpg",
                "release_date": "2009-02-27",
                "title": "The Girl with the Dragon Tattoo",
                "video": false,
                "vote_average": 7.53,
                "vote_count": 3069,
                "character": "Dirch Frode",
                "credit_id": "52fe465d9251416c75076003",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Ingvar Hirdwall (December 5, 1934 – April 6, 2023) was born in Stockholm, and was educated at Gothenburg City Theatre stage school 1957-1960. Since the early 1960s until his death he has been active as an actor in many films, TV series and on theatrical stages, mainly Stockholms stadsteater. He is well known in Sweden, was often portraying obstinate or strange characters, like the eccentric neighbor in the many Swedish Martin Beck TV-movies made from 1997 on. He was also often in director Lars Molin's productions. In December 1993, Hirdwall played the leading role in the Swedish TV company SVT's annual children's Christmas “Advent calendar” - Tomtemaskinen (The mechanical santa), one of the Pettson and Findus stories by Sven Nordqvist - with one 15-minute part shown each day up until Christmas Eve. Hirdwall played the character of Pettson.\n\nHirdwall received the Swedish Guldbagge Award for Best Actor at the 17th Guldbagge Awards for Barnens ö (Children's Island) and the Thaliapriset prize in 1993.\n\nHirdwall was married to the actress Marika Lindström. They have two children, director Jacob Hirdwall and actress Agnes Hirdwall.",
        "birthday": "1934-12-05",
        "deathday": "2023-04-06",
        "gender": 2,
        "homepage": null,
        "id": 47070,
        "imdb_id": "nm0386335",
        "known_for_department": "Acting",
        "name": "Ingvar Hirdwall",
        "place_of_birth": " Stockholm,  Sweden",
        "popularity": 0.328,
        "profile_path": "/fcoLF3kEQJ5nDuYaFESiyRGTL8U.jpg"
    }
}