{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/g3yflwqajsVEYdUr7B84fMHBkAw.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 329805,
                "original_language": "fr",
                "original_title": "Mon roi",
                "overview": "Tony is admitted to a rehabilitation center after a serious ski accident. Dependent on the medical staff and pain relievers, she takes time to look back on a turbulent relationship that she experienced with Georgio.",
                "popularity": 2.3585,
                "poster_path": "/kOhRkC7J3jpAgHGC0Uh3SoCqU4c.jpg",
                "release_date": "2015-10-21",
                "title": "My King",
                "video": false,
                "vote_average": 7.142,
                "vote_count": 793,
                "character": "Conference secretary",
                "credit_id": "685bfaab6aa41d2fb2c9d083",
                "order": 33
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Constance Debré, born in 1972, is a French lawyer and novelist.\n\nConstance Debré's parents were journalist François Debré (1942–2020) and former model Maylis Ybarnégaray (1942–1988); the judge and politician Jean-Louis Debré is her uncle. Her grandparents included Michel Debré (1912–1996), former Prime Minister under General de Gaulle, and Jean Ybarnégaray (1883–1956), a minister of the Vichy regime and resistance fighter.\n\nShe was 16 when her mother died. She studied at Lycée Henri-IV, then law at Panthéon-Assas University. She is also a graduate of class 99 (E99) of the ESSEC Business School. She married in 1993 and had a son in 2008.\n\nWorking as a defence lawyer, she accompanied her father in 2011 when he was charged in an inquiry into fictitious jobs at the town hall of Paris. In 2013, she was elected second secretary of the Conference of Lawyers of the Paris Bar.\n\nIn 2015, she left her husband and her job to live with a woman and pursue a full-time career as a writer. In 2018, she won the Prix La Coupole for her autobiographical novel Play Boy, which describes the aftermath of this fateful decision: the custody battle over her son, and its associated pressures to conform to a \"bourgeois\" family model with a same-sex partner. It formed the first book in a trilogy.\n\nHer 2020 novel Love Me Tender was adapted by filmmaker Anna Cazenave Cambet into the 2025 film Love Me Tender.\n\nSource: Article \"Constance Debré\" from Wikipedia in English, licensed under CC-BY-SA.",
        "birthday": "1972-02-10",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 4714207,
        "imdb_id": "nm7609596",
        "known_for_department": "Writing",
        "name": "Constance Debré",
        "place_of_birth": "Paris, France",
        "popularity": 0.0071,
        "profile_path": "/n92cou9A0eXlZLbka8PfmZ7BX2a.jpg"
    }
}