{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lyQSifurKvWmqWzouVe50JFoI35.jpg",
                "genre_ids": [
                    10751,
                    16,
                    35,
                    12
                ],
                "id": 9385,
                "original_language": "fr",
                "original_title": "Les 12 travaux d'Astérix",
                "overview": "Asterix and Obelix depart on an adventure to complete twelve impossible tasks to prove to Caesar that they are as strong as the Gods. You'll roar with laughter as they outwit, outrun, and generally outrage the very people who are trying to prove them \"only human\".",
                "popularity": 3.2232,
                "poster_path": "/7cZQZOYZFJcLjZnxWjO5PcUtmDZ.jpg",
                "release_date": "1976-06-26",
                "title": "The Twelve Tasks of Asterix",
                "video": false,
                "vote_average": 7.334,
                "vote_count": 1295,
                "character": "Astérix (stemme)",
                "credit_id": "67e16668b8e0fea9340826c2",
                "order": 28
            },
            {
                "adult": false,
                "backdrop_path": "/m1TOfgljbT3jOez3b4l1I1tm82W.jpg",
                "genre_ids": [
                    16,
                    10751,
                    14
                ],
                "id": 9078,
                "original_language": "en",
                "original_title": "The Sword in the Stone",
                "overview": "Wart is a young boy who aspires to be a knight's squire. On a hunting trip he falls in on Merlin, a powerful but amnesiac wizard who has plans for him beyond mere squiredom. He starts by trying to give him an education, believing that once one has an education, one can go anywhere. Needless to say, it doesn't quite work out that way.",
                "popularity": 7.2175,
                "poster_path": "/7lyeeuhGAJSNXYEW34S8mJ1bwI8.jpg",
                "release_date": "1963-12-25",
                "title": "The Sword in the Stone",
                "video": false,
                "vote_average": 7.228,
                "vote_count": 3963,
                "character": "Uglen Arkimedes (stemme)",
                "credit_id": "67f25c0ae1d5c23c6ed94f5f",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ove Wendelboe Sprogøe Petersen"
        ],
        "biography": "Ove Wendelboe Sprogøe Petersen (21 December 1919 – 14 September 2004) was a Danish actor. Born in Odense, his parents were Arthur and Inger Sprogøe. He married Eva Rasmussen in 1945, with whom he had three children. One of these is actor Henning Sprogøe. He made his debut in the film Hans Store Aften (His Big Night). His characteristic prominent chin that had been feared an obstacle of his career did not prevent him from being one of the most versatile and used Danish actors. His strength laid in the almost diabolic, michievous and brash but he effortlessly played meek and shy types as well as elegantiers. Among his many roles on stage in classic plays might be mentioned Mephisto in Faust, the title figure of Strindberg’s The Father and some Molière and Bertolt Brecht characters.\n\nAn extremely popular actor in Denmark, he played many diverse roles, including several recurring television parts. He appeared in 157 films, making him one of the hardest-working actors in the history of Danish film. In his early years he often was the part of a duo working together with his friend and colleague Dirch Passer. He is probably best known for playing one of the lead roles in the Olsen Gang movies, along with Morten Grunwald and Poul Bundgaard, playing the gang leader Egon Olsen, known for his short temper, striped suit, and cigar. By this role he earned an international fame though mostly in Eastern Europe, in the GDR he together with his colleagues became almost a cult figure. Among his TV roles must be mentioned his elegant and humorous ex-burglar Larsen in the series Huset på Christianshavn (“The House at Christianshavn” - the first Danish sitcom) and his role as the wise and courageous doctor Louis Hansen in the epic, historical drama-series Matador, both also shown outside Denmark. He was an able singer especially in shows or revues and his interpretation of Tim Spencer’s Cigarettes, whiskey and wild wild women (in Danish re-creation: Fandens Oldemor – “The Devil’s Great-Grandmother”) almost became his signature tune. He was an actor who combined great public sympathy with the ability to remain a private person with a modest lifestyle. After his death it was revealed that he had been a passionate art enthusiast and had amassed a valuable collection of modern paintings. Shortly after his death in 2004, Nordisk Film (the company that made the Olsen Gang movies) established a scholarship for actors in his name. The state-owned road to Vridsløselille Statsfængsel (the prison where his Egon Olsen character was a frequent \"guest\"), was renamed by the city of Albertslund to Egon Olsens Vej (Egon Olsen Road). On 24 October 2005, his native city of Odense named a square Ove Sprogøes Plads (Ove Sprogøe Square) in his honour. And the bar 'Cafe Halvvejen', named a shot in his honor.\n\nDescription above from the Wikipedia article Ove Sprogøe, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1919-12-21",
        "deathday": "2004-09-14",
        "gender": 2,
        "homepage": null,
        "id": 47151,
        "imdb_id": "nm0819825",
        "known_for_department": "Acting",
        "name": "Ove Sprogøe",
        "place_of_birth": "Odense, Danmark",
        "popularity": 0.4664,
        "profile_path": "/hR86CiDWg9UpyUNMIS3Ffx4uwg3.jpg"
    }
}