{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xQyGkQ8ICa4lgifGr3oZjkm3AJ2.jpg",
                "genre_ids": [
                    18
                ],
                "id": 804095,
                "original_language": "en",
                "original_title": "The Fabelmans",
                "overview": "Growing up in post-World War II era Arizona, young Sammy Fabelman aspires to become a filmmaker as he reaches adolescence, but soon discovers a shattering family secret and explores how the power of films can help him see the truth.",
                "popularity": 5.3526,
                "poster_path": "/h7llKkqkkJtJrTOaDLuVeUYDQ7I.jpg",
                "release_date": "2022-11-11",
                "title": "The Fabelmans",
                "video": false,
                "vote_average": 7.585,
                "vote_count": 2552,
                "character": "Sammy’s Classmate (uncredited)",
                "credit_id": "664ea47b894d4e07c7064142",
                "order": 64
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Nicole Alicia Xavier is an actor, educator, and child advocate. Her career soared to new heights after she was featured in some of the top films and series of 2022 — Steven Spielberg's critically acclaimed The Fabelmans and Ryan Murphy's record-breaking hit Monster: The Jeffrey Dahmer Story.\n\nIt was Legendary Director Steven Spielberg who said that he loved Nicole's \"eyes and smile\" and to continue to do what she was doing because it's working.  While still early in her career, she's gained experience by working with directors such as Dexter Fletcher, Andrés Baiz, Clement Virgo, Rene Elizondo, Jessy Terrero, and Jonah Hill.\n\nSome of her most recent work includes Paramount’s The Offer, Netflix’s On My Block, and Amazon’s Daisy Jones and The Six.\n\nOccasionally, she will grace us with her presence in music videos. Some of her notable cameos include Maluma's \"Sobrio\", Travis Scott's \"Wake Up,\" and Backstreet Boys' \"Chances.\"\n\nAdditionally, you might have seen Nicole in several nationwide commercials for Toyota Latino, Pepsi, Old Navy, and Universal Studios.  Off-set, Nicole is a passionate educator teaching grades K-12. The courses she teaches include English Language Arts (ELA), Creative Writing, Public Speaking, and Creative Arts. She is credited with reviving the #1 Creative Writing program in the OC/LA area. By unanimous decision, she is recognized as our 2023 Teacher of the Year at [REDACTED].\n\nWhile her artistic talent is emphasized in the performing arts, she is also a natural healer with leadership qualities and the ability to genuinely empathize. Nicole exhibits this through her work as a child advocate with Foster Love - Together We Rise, a non-profit dedicated to changing the way children experience foster care. In the past year, she led her first fundraising campaign for Giving Tuesday and successfully surpassed the goal.  Throughout the years, Nicole's philanthropic efforts continued by supporting veterans, education, arts, and LGBTQIA+ culture. In addition, she graduated from UCLA in Entertainment Business, paving the way for a career path that is both creative and analytical. She embraces collaborating and aligning herself with like-minded individuals throughout the entertainment industry.  Entrepreneurial and progressive, Nicole Alicia Xavier is ever-striving, ambitious, and determined to do all things well. She carries an unyielding dedication to her plan until her goals are achieved, leading the way to encourage others to do the same.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.nicolealiciaxavier.com",
        "id": 4730393,
        "imdb_id": "nm11028104",
        "known_for_department": "Acting",
        "name": "Nicole Alicia Xavier",
        "place_of_birth": null,
        "popularity": 0.0071,
        "profile_path": "/uPgltKa0BdVyM9uFFPwGno0hs3I.jpg"
    }
}