{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/oog0DJtSuPnWoSTYM7cKmAFbeuU.jpg",
                "genre_ids": [
                    27,
                    9648,
                    18
                ],
                "id": 16372,
                "original_language": "en",
                "original_title": "The Innocents",
                "overview": "A young governess for two children becomes convinced that the house and grounds are haunted by ghosts and that the children are being possessed.",
                "popularity": 3.0858,
                "poster_path": "/idqvLBmlEHUITMnQ0EJ6Yb5TpVw.jpg",
                "release_date": "1961-11-24",
                "title": "The Innocents",
                "video": false,
                "vote_average": 7.466,
                "vote_count": 627,
                "character": "Mrs. Grose",
                "credit_id": "52fe46cc9251416c75083e67",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Мегс Дженкинс",
            "Muguette Mary \"Megs\" Jenkins",
            "Muguette Mary Jenkins"
        ],
        "biography": "An engineer's daughter, she had first planned on becoming a ballerina, using her original Christian name Muguette, but abandoned those plans by the age of 17 when she realized that her physique was more in keeping with her other first name, Megs. She trained in Liverpool at the School of Dancing and Dramatic Art and then joined the Liverpool Repertory Company in 1933 before moving to London to appear at the Player's Theatre four years later.\n\nDuring the 1950's, Megs was busy acting on stage and had considerable critical success in two plays by Emlyn Williams, 'Light of Heart' (1940) and 'The Wind of Heaven' (1945). Against character, she also played the vicious, unstable Alma Winemiller in 'Summer and Smoke' (1951) by Tennessee Williams. In 1956, she was awarded the Clarence Derwent Award as Best Supporting Actress for her role as the stoic wife of a longshoreman harbouring incestuous feelings for his niece in 'A View from the Bridge' by Arthur Miller. The previous year, she had made her Broadway debut in Chekhov's 'A Day by the Sea' as a supportive governess to an alcoholic physician.",
        "birthday": "1917-04-21",
        "deathday": "1998-10-05",
        "gender": 1,
        "homepage": null,
        "id": 47398,
        "imdb_id": "nm0420923",
        "known_for_department": "Acting",
        "name": "Megs Jenkins",
        "place_of_birth": "Birkenhead, Cheshire, England, UK",
        "popularity": 0.2078,
        "profile_path": null
    }
}