{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4ycpMe25LYpzGW42U9amyW9gM53.jpg",
                "genre_ids": [
                    53,
                    80,
                    18,
                    9648
                ],
                "id": 322,
                "original_language": "en",
                "original_title": "Mystic River",
                "overview": "The lives of three men who were childhood friends are shattered when one of them suffers a family tragedy.",
                "popularity": 7.4564,
                "poster_path": "/hCHVDbo6XJGj3r2i4hVjKhE0GKF.jpg",
                "release_date": "2003-10-08",
                "title": "Mystic River",
                "video": false,
                "vote_average": 7.742,
                "vote_count": 7056,
                "character": "Michael Boyle",
                "credit_id": "52fe4238c3a36847f800d0a9",
                "order": 20
            },
            {
                "adult": false,
                "backdrop_path": "/cGnaZm6EQOJESde3Vv4v53Zk4gN.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 626735,
                "original_language": "en",
                "original_title": "Dog",
                "overview": "An army ranger and his dog embark on a road trip along the Pacific Coast Highway to attend a friend's funeral.",
                "popularity": 3.9073,
                "poster_path": "/zHQy4h36WwuCetKS7C3wcT1hkgA.jpg",
                "release_date": "2022-02-17",
                "title": "Dog",
                "video": false,
                "vote_average": 7.309,
                "vote_count": 1670,
                "character": "Corporal Levitz",
                "credit_id": "606a798acdf2e60029693a3a",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Boyd was born in Bedford, Texas. He currently lives in Los Angeles, California with his parents and actress sister, Jenna Boyd. Cayden plays the violin and cello, is on a football team, and is also a proud Christian. Cayden is more experienced in the acting world than most children his age. Growing up in Texas with his parents and sister Jenna Boyd he has been able to stay grounded and says, \"My parents are a big help, and they're always making sure I have a normal life and my life isn't all just about acting and stuff.\"\n\nCayden landed his first roles, small television roles and commercials, as young as 6 and 7. He was cast alongside Sean Penn and Tim Robbins in film \"Mystic River\". In 2004, Cayden won the lead role in children's film \"The Adventures of Sharkboy and Lavagirl\". Cayden has also appeared in a number of TV dramas, including \"Crossing Jordan\", \"Cold Case\" and \"Close to Home\". He also had a small but crucial role in the film \"X-Men: The Last Stand\". In 2008, Cayden starred alongside Julia Roberts and Willem Dafoe in \"Fireflies in the Garden\", with a strong performance as young Michael.\n\nIn 2010 Cayden took the leading role in the pilot episode of a new TV show \"Past Life\" giving a very strong performance, and is in possible talks to be returning to the show at a later date.\n\nBoyd has had bit parts in several feature films, including Freaky Friday and Dodgeball: A True Underdog Story. He also played Tim Robbins's son in Mystic River and appeared on the sitcom Scrubs. Boyd's biggest role to date may have been as Max in The Adventures of Shark Boy and Lava Girl. Most recently, he played young Warren Worthington III in X-Men: The Last Stand, and he also had a starring role in the 2007 film Have Dreams, Will Travel.\n\nDescription above from the Wikipedia article Cayden Boyd, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1994-05-24",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 4741,
        "imdb_id": "nm1064823",
        "known_for_department": "Acting",
        "name": "Cayden Boyd",
        "place_of_birth": "Bedford, Texas, USA",
        "popularity": 0.2867,
        "profile_path": "/5PyOB5F8mSp0n0ZNS6iX6rpXOTv.jpg"
    }
}