{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1oRug23GWxgyQmqQGbX7ke974lp.jpg",
                "genre_ids": [
                    18,
                    36,
                    10752
                ],
                "id": 5902,
                "original_language": "en",
                "original_title": "A Bridge Too Far",
                "overview": "The story of Operation Market Garden—a failed attempt by the allies in the latter stages of WWII to end the war quickly by securing three bridges in Holland allowing access over the Rhine into Germany. A combination of poor allied intelligence and the presence of two crack German panzer divisions meant that the final part of this operation (the bridge in Arnhem over the Rhine) was doomed to failure.",
                "popularity": 8.5375,
                "poster_path": "/lszOk3Xmh7qpLaM9J4K9E6ADLk1.jpg",
                "release_date": "1977-06-15",
                "title": "A Bridge Too Far",
                "video": false,
                "vote_average": 7.222,
                "vote_count": 871,
                "character": "American Sergeant (uncredited)",
                "credit_id": "665a2f15fe28460966509982",
                "order": 138
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "RBC"
        ],
        "biography": "Robin Blair-Crawford, is a Canadian/American actor, author, artist, and honorably served military veteran. He is best known for his work in war and action-adventure films, such as A Bridge Too Far (1977), The Wild Geese (1978), and Hamburger Hill (1987), and also contributed as a technical advisor or production staff on major films like Full Metal Jacket, Platoon, Apocalypse Now, and The Deer Hunter.\n\nIn addition to a career in film, Blair-Crawford has served in government service (retired), is a member of the Military Writers Society of America, and writes extensively on military topics, including instructional guides and books on small craft seamanship and amateur sailboat racing. His experience as a veteran is evident in his military-themed writing and lectures.\n\nAs an author, he wrote the “Southlands Snuffys” series, which explores experiences and military operations in the South Vietnam War between 1966 and 1968. These books provide firsthand accounts of riverine and special forces operations, tactics, intelligence, and the challenges faced during the conflict. He has also published military articles, lecture papers, and practical guides.books.\n\nHe has lived in both Canada (West Vancouver, British Columbia), and the USA (Pawleys Island, South Carolina) and ( Cedar Bluff, Virginia).",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 4747395,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Robin Blair-Crawford",
        "place_of_birth": "Montreal, Quebec, Canada",
        "popularity": 0.0143,
        "profile_path": null
    }
}