{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tbF57JNof8j3X14GhZtqafkrziU.jpg",
                "genre_ids": [
                    878,
                    12
                ],
                "id": 313106,
                "original_language": "en",
                "original_title": "Doctor Who: The Day of the Doctor",
                "overview": "In 2013, something terrible is awakening in London's National Gallery; in 1562, a murderous plot is afoot in Elizabethan England; and somewhere in space an ancient battle reaches its devastating conclusion. All of reality is at stake as the Doctor's own dangerous past comes back to haunt him.",
                "popularity": 1.2786,
                "poster_path": "/6c0CjymaupC5xerJCemuaSV4CLj.jpg",
                "release_date": "2013-11-23",
                "title": "Doctor Who: The Day of the Doctor",
                "video": false,
                "vote_average": 8.2,
                "vote_count": 761,
                "character": "The Doctor (5) (archive footage)",
                "credit_id": "549858cfc3a368054b001c2f",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Peter Malcolm Gordon Moffett",
            "پیتر دیویسون"
        ],
        "biography": "Peter Davison (born Peter Malcolm Gordon Moffett) is an English actor with many credits in television dramas and sitcoms. He became famous as Tristan Farnon in the BBC's television adaptation of James Herriot's All Creatures Great and Small stories. His subsequent starring roles included the sitcoms Holding the Fort and Sink or Swim, the fifth incarnation of the Doctor in Doctor Who, Dr. Stephen Daker in A Very Peculiar Practice, and Albert Campion in Campion. He also played David Braithwaite in At Home with the Braithwaites, \"Dangerous\" Davies in The Last Detective, and Henry Sharpe in Law & Order: UK.\n\nDescription above from the Wikipedia article Peter Davison, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1951-04-13",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 47513,
        "imdb_id": "nm0205749",
        "known_for_department": "Acting",
        "name": "Peter Davison",
        "place_of_birth": "Streatham, London, England, UK",
        "popularity": 0.5355,
        "profile_path": "/v6VPbMj7iTrhE5sBo3g7hoRSofA.jpg"
    }
}