{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/r9oTasGQofvkQY5vlUXglneF64Z.jpg",
                "genre_ids": [
                    28,
                    35,
                    10751
                ],
                "id": 1029575,
                "original_language": "en",
                "original_title": "The Family Plan",
                "overview": "Dan Morgan is many things: a devoted husband, a loving father, a celebrated car salesman. He's also a former assassin. And when his past catches up to his present, he's forced to take his unsuspecting family on a road trip unlike any other.",
                "popularity": 24.0511,
                "poster_path": "/jLLtx3nTRSLGPAKl4RoIv1FbEBr.jpg",
                "release_date": "2023-12-14",
                "title": "The Family Plan",
                "video": false,
                "vote_average": 7.256,
                "vote_count": 1605,
                "character": "iiTzTimmy",
                "credit_id": "66625ae46d0bf5307a7e07b3",
                "order": 58
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "iiTzTimmy"
        ],
        "biography": "Video Games have always played a pivotal role in Timothy “iiTzTimmy” An’s life. iiTzTimmy’s initial love for gaming began at a very young age playing MapleStory with his brother, before shifting his focus to League of Legends and Soldier Front 2, where he would spend numerous hours grinding both games. It wasn’t long before that natural love for gaming turned into aspirations to make it his full-time career right around the start of Apex Legends. Since then, iiTzTimmy has become one of the most popular streamers on Twitch, amassing over 1 million Twitch followers within two months of streaming and hitting 163K concurrent viewers during his historic ‘Solo Bronze to Predator’ marathon stream.\n\nA naturally charismatic and entertaining personality, iiTzTimmy has built a nest of devout followers who love tuning into his regularly scheduled streams. Yet, what sets iiTzTimmy apart from other entertainers stems from his other passion for competition.",
        "birthday": "2000-04-19",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 4760187,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Timothy An",
        "place_of_birth": "California, USA",
        "popularity": 0.0214,
        "profile_path": "/6tZg7QOvljGoS8wl7xtR12vWPUS.jpg"
    }
}