{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kGzFbGhp99zva6oZODW5atUtnqi.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 240,
                "original_language": "en",
                "original_title": "The Godfather Part II",
                "overview": "In the continuing saga of the Corleone crime family, a young Vito Corleone grows up in Sicily and in 1910s New York. In the 1950s, Michael Corleone attempts to expand the family business into Las Vegas, Hollywood and Cuba.",
                "popularity": 16.2247,
                "poster_path": "/hek3koDUyRQk7FIhPXsa6mT2Zc3.jpg",
                "release_date": "1974-12-20",
                "title": "The Godfather Part II",
                "video": false,
                "vote_average": 8.6,
                "vote_count": 13187,
                "character": "Senator with Mustache (uncredited)",
                "credit_id": "55f218199251410d6d001698",
                "order": 75
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Archible Ernest \"Buck\" Houghton Jr."
        ],
        "biography": "Archible Ernest \"Buck\" Houghton Jr. is chiefly remembered as producer of The Twilight Zone (1959) during its first three seasons (more than a hundred episodes in total), his influence palpable in all facets of production, from script selection to renting production facilities, to casting, scoring and editing. Houghton had graduated from UCLA with majors in English and economics. He was at that time known as 'Arch'. The origin of his nickname 'Buck' may have been the result of buck teeth as a child. His career began in Hollywood as back stage help on films by Cecil B. DeMille, then as reader for Val Lewton and story editor to David O. Selznick. Via subsequent stints at Paramount's casting and budget departments, the Office of War Information (where he worked on short propaganda films) and four years as executive assistant at RKO, Houghton worked his way up to television producer by the early 1950's. He served as associate producer on an excellent early action series, Yancy Derringer (1958), which is, sadly, almost forgotten today. William Self, who preferred to remain in his executive position with CBS, offered Houghton the job of producing \"The Twilight Zone\" and Houghton enthusiastically accepted, having perused the first two scripts. He became popular with many of the directors, for example Douglas Heyes (usually put in charge of more character-driven assignments like \"The Invaders\"), who regarded him as the best producer he ever worked with. Most importantly, Houghton complemented the creative genius of Rod Serling by his expertise in all minutiae of production.\n\nHoughton left \"Twilight Zone\" at the end of season three, having raised objections about extending the show to the -- as it turned out, much less suitable -- one-hour format. Few of his subsequent appointments proved entirely satisfactory: Houghton more often found his style cramped, clashing with stars he regarded as 'autocratic' (The Richard Boone Show (1963), Hawaii Five-O (1968)) or executive producers he disliked (Lost in Space (1965)). There were several more production credits to his name in the 80's -- mostly B-grade made-for-TV films -- before his retirement in 1994.",
        "birthday": "1915-05-04",
        "deathday": "1999-05-14",
        "gender": 2,
        "homepage": null,
        "id": 47756,
        "imdb_id": "nm0396443",
        "known_for_department": "Production",
        "name": "Buck Houghton",
        "place_of_birth": "Denver, Colorado, USA",
        "popularity": 0.0327,
        "profile_path": "/awYLIMQA0KiIfMsFvmipseorWZv.jpg"
    }
}