{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/38yjZWYBI0xxNqoBKiGyA4UZjk.jpg",
                "genre_ids": [
                    80,
                    18,
                    53
                ],
                "id": 6075,
                "original_language": "en",
                "original_title": "Carlito's Way",
                "overview": "Free after years in prison, Carlito Brigante intends to give up his criminal ways, but it's not long before the ex-con is sucked back into the New York City underworld. Reconnecting with his dancer girlfriend, Carlito gets entangled in the shady dealings of his friend Dave Kleinfeld, who also serves as his lawyer. An encounter with shifty gangster Benny Blanco sets the duo on a dangerous path.",
                "popularity": 6.055,
                "poster_path": "/g6D7mjQtndu768cusGmoEQY9fTB.jpg",
                "release_date": "1993-11-10",
                "title": "Carlito's Way",
                "video": false,
                "vote_average": 7.83,
                "vote_count": 3307,
                "character": "Saso",
                "credit_id": "52fe443bc3a36847f8089f07",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Porcel worked in 49 movies, starting with 1962's Disloque en Mar del Plata, and ending with Carlito's Way (1993). Many of these 49 movies were collaborations with Olmedo. Among the movies they did together was 1986's Rambito y Rambón: Primera Misión. (Little Rambo and Big Rambo: First Mission)\n\nMany of Porcel and Olmedo's movies in the 1970s and 1980s were adult-oriented comedies. Conservative Argentine authorities rated these movies as PM-18 (age 18 and above), except for some movies planned for family audiences, which had \"tamer\" content. These movies are considered to be the pinnacle of Argentina's sexy comedy movie genre. Most of these movies were directed by Gerardo Sofovich or his brother Hugo. Porcel virtually stopped appearing in these movies after the accidental death of Olmedo, which left him clinically depressed.",
        "birthday": "1936-09-07",
        "deathday": "2006-05-16",
        "gender": 2,
        "homepage": null,
        "id": 47772,
        "imdb_id": "nm0691672",
        "known_for_department": "Acting",
        "name": "Jorge Porcel",
        "place_of_birth": "Buenos Aires, Argentina",
        "popularity": 0.0434,
        "profile_path": "/yr5Bo1b0bgxDq9nuqMVSNCHJ5kv.jpg"
    }
}