{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jOncZUo1ce3cOgBWPvnmpilzFUu.jpg",
                "genre_ids": [
                    35
                ],
                "id": 37653,
                "original_language": "fr",
                "original_title": "Les Trois Frères",
                "overview": "Three half-brothers are reunited at their mother's funeral. After being told of their inheritance they quickly spend the money, only to find out that they will not receive it after all. The men grow closer while deciding how to proceed.",
                "popularity": 2.0171,
                "poster_path": "/nPrUw2hLIt9uWrGwfKjr0AbGWgd.jpg",
                "release_date": "1995-12-13",
                "title": "The Three Brothers",
                "video": false,
                "vote_average": 6.945,
                "vote_count": 772,
                "character": "Brice, le bras droit de Steven",
                "credit_id": "52fe46609251416c910525f3",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/8pwIhymsxfAVjrAE7syDjQULn37.jpg",
                "genre_ids": [
                    16,
                    35,
                    10751,
                    12
                ],
                "id": 425,
                "original_language": "en",
                "original_title": "Ice Age",
                "overview": "With the impending ice age almost upon them, a mismatched trio of prehistoric critters – Manny the woolly mammoth, Diego the saber-toothed tiger and Sid the giant sloth – find an orphaned infant and decide to return it to its human parents. Along the way, the unlikely allies become friends but, when enemies attack, their quest takes on far nobler aims.",
                "popularity": 14.2035,
                "poster_path": "/gLhHHZUzeseRXShoDyC4VqLgsNv.jpg",
                "release_date": "2002-03-14",
                "title": "Ice Age",
                "video": false,
                "vote_average": 7.365,
                "vote_count": 13807,
                "character": "(voice) (uncredited)",
                "credit_id": "68c6fda1b9e1ed31b570d49f",
                "order": 24
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Élie Sémoun",
            "Élie Semhoun",
            "Elie Semhoun",
            "Elie Semoun"
        ],
        "biography": "Élie Semoun (born Élie Semhoun on 16 October 1963) is a French comedian, actor, director, writer and singer.\n\nÉlie Semoun was born in France, to a Sephardic Jewish family of Moroccan-Jewish and Algerian-Jewish descent. In 1980 at the age of 17, Semoun wrote two collections of poems and two plays. Beginning in 1988, he had regular appearances on the television series Vivement lundi! on TF1, where he played a horse mounted on rollers.\n\nHis comedy career began in 1990 with his partner Dieudonné M'bala M'bala, with whom he wrote and performed daring, skits with scathing takes generally taboo subjects such as racism and poverty, often playing up contrasts between himself and his partner in terms of origin, color, and religion.\n\nTheir first show was held at Café de la Gare in 1991. The duo acquired a certain notoriety in 1992 after several appearances on their fellow comedian Arthur's show Emission Impossible, where they were noticed for their particularly corrosive sketches. They followed this up with one success after another at Le Splendid Theater, Paris's Palais des glaces, and at Casino de Paris. Élie and Dieudonné formed one of the most popular comic duos of the 1990s.\n\nIn 1997 the duo split due to artistic and financial differences. Élie resented how Dieudonné handled their relations with the media and admitted that he was unhappy that his friend had turned towards film (and that he left to appear in the United States) and antisemitism. Dieudonné managed the financial aspects of their career, and Semoun felt their money was not divided equitably.\n\nBreaking out on his own, Semoun continued his success with Petites Annonces d'Élie (which had been at first intended to be a show with Dieudonné) alongside his friend the actor Franck Dubosc. Once again his performance was promoted by his friend on the show Les Enfants de la télé (France) Inspired by actual classified ads recorded by them in a van, the \"Petites Annonces d'Élie\" (Élie's Classified Ads) are seen through the character of Cyprian, a repulsive looking man searching for a \"busty blond\".\n\nSemoun went back on stage with a one-man show, Élie and Semoun. He supported Bertrand Delanoë during Paris's municipal elections of 2001 and Lionel Jospin during the presidential election of 2002. In 2003, he released an album of French songs called simply \"Chansons\". In early 2005, he performed in a show (co-authored with Franck Dubosc and Muriel Robin entitled Élie Semoun se prend pour qui?\n\nÉlie Semoun maintained in the years following his separation with Dieudonné a complex and strained relationship with his former partner. First strained, then reconciled, they have again grown apart during the public controversy aroused by the political stances of Dieudonné. \"Some have speculated on the reunion of our duo, but I must tell you that this is clearly out of the question! It's over.\" In 2012, he declared that \"the Dieudonné he knew and the Dieudonné of today appear to him like two completely different people, and he is unable to reconcile them in his mind\". ...\n\nSource: Article \"Élie Semoun\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1963-10-16",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 47829,
        "imdb_id": "nm0783879",
        "known_for_department": "Acting",
        "name": "Élie Semoun",
        "place_of_birth": "Paris, France",
        "popularity": 0.177,
        "profile_path": "/gjJpIq92ubeKgAAvK6yexZycIlv.jpg"
    }
}