{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/7gfDVfaw0VaIkUGiEH13o3TIC7A.jpg",
                "genre_ids": [
                    18,
                    9648,
                    37
                ],
                "id": 273248,
                "original_language": "en",
                "original_title": "The Hateful Eight",
                "overview": "Bounty hunters seek shelter from a raging blizzard and get caught up in a plot of betrayal and deception.",
                "popularity": 8.3615,
                "poster_path": "/jIywvdPjia2t3eKYbjVTcwBQlG8.jpg",
                "release_date": "2015-12-25",
                "title": "The Hateful Eight",
                "video": false,
                "vote_average": 7.755,
                "vote_count": 14709,
                "character": "Ed",
                "credit_id": "559d60359251412518000133",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/n2eUT4zQA2yYcKOgAFidgOyiFoH.jpg",
                "genre_ids": [
                    18,
                    37
                ],
                "id": 68718,
                "original_language": "en",
                "original_title": "Django Unchained",
                "overview": "With the help of a German bounty hunter, a freed slave sets out to rescue his wife from a brutal Mississippi plantation owner.",
                "popularity": 12.4836,
                "poster_path": "/7oWY8VDWW7thTzWh3OKYRkWUlD5.jpg",
                "release_date": "2012-12-25",
                "title": "Django Unchained",
                "video": false,
                "vote_average": 8.184,
                "vote_count": 27058,
                "character": "Sheriff Gus (Snowy Snow)",
                "credit_id": "56770b3e92514179e1006618",
                "order": 29
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ли Хорсли"
        ],
        "biography": "Lee Arthur Horsley is an American film, television, and theater actor known for starring roles in the television series Nero Wolfe, Matt Houston, and Paradise. He starred in the 1982 film The Sword and the Sorcerer and recorded the audiobook edition of Lonesome Dove.\n\nHorsley began his acting career touring in stage productions of West Side Story, Damn Yankees, and Oklahoma!. In 1981, he portrayed TV detective Archie Goodwin in the short-lived NBC drama series Nero Wolfe. He played the title character in the detective series Matt Houston, as well as Ethan Allen Cord in the Western Heritage Award-winning series Paradise. This was followed by a lead role on Bodies of Evidence.\n\nHe appeared in the feature-length cult film The Sword and the Sorcerer in 1982, and appeared in its sequel Tales of an Ancient Empire in 2010. He recorded the audiobook edition of Larry McMurtry's Lonesome Dove. In 2006, Horsley and Marshall R. Teague traveled the world in search of exotic game on the Outdoor Life Network for the reality show, Benelli's Dream Hunts. In 2012. he appeared in the Quentin Tarantino film Django Unchained, as Sheriff Gus, and also has a role as a stagecoach driver in Tarantino's 2015 western The Hateful Eight.",
        "birthday": "1955-05-15",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 47859,
        "imdb_id": "nm0395448",
        "known_for_department": "Acting",
        "name": "Lee Horsley",
        "place_of_birth": "Muleshoe, Texas, USA",
        "popularity": 0.4102,
        "profile_path": "/u2qrM9SVwrHFrIOl6a5dv5C9zMw.jpg"
    }
}