{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zNnjHLDtV8Ti3aworltaeaLMov4.jpg",
                "genre_ids": [
                    80,
                    18,
                    53
                ],
                "id": 242,
                "original_language": "en",
                "original_title": "The Godfather Part III",
                "overview": "In the midst of trying to legitimize his business dealings in 1979 New York and Italy, aging mafia don, Michael Corleone seeks forgiveness for his sins while taking a young protege under his wing.",
                "popularity": 10.2501,
                "poster_path": "/lm3pQ2QoQ16pextRsmnUbG2onES.jpg",
                "release_date": "1990-12-25",
                "title": "The Godfather Part III",
                "video": false,
                "vote_average": 7.417,
                "vote_count": 6512,
                "character": "Father Andrew Hagen",
                "credit_id": "52fe422cc3a36847f80097e7",
                "order": 15
            },
            {
                "adult": false,
                "backdrop_path": "/e7cTxDnHGQIozy0Os5r6HauL1Gz.jpg",
                "genre_ids": [
                    10402,
                    18,
                    35
                ],
                "id": 10654,
                "original_language": "en",
                "original_title": "Hair",
                "overview": "Upon receiving his draft notice and leaving his family ranch in Oklahoma, Claude heads to New York and befriends a tribe of long-haired hippies on his way to boot camp.",
                "popularity": 2.7009,
                "poster_path": "/z0ctToyPWCB2RgIkMpD6RhRKAeH.jpg",
                "release_date": "1979-03-15",
                "title": "Hair",
                "video": false,
                "vote_average": 7.28,
                "vote_count": 696,
                "character": "Claude Hooper Bukowski",
                "credit_id": "52fe439c9251416c75017343",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/ojG57hVx69vhk5DDGPIcfyRR55I.jpg",
                "genre_ids": [
                    18,
                    10752
                ],
                "id": 11778,
                "original_language": "en",
                "original_title": "The Deer Hunter",
                "overview": "A group of working-class friends decide to enlist in the Army during the Vietnam War and finds it to be hellish chaos -- not the noble venture they imagined. Before they left, Steven married his pregnant girlfriend -- and Michael and Nick were in love with the same woman. But all three are different men upon their return.",
                "popularity": 6.6847,
                "poster_path": "/bbGtogDZOg09bm42KIpCXUXICkh.jpg",
                "release_date": "1978-12-08",
                "title": "The Deer Hunter",
                "video": false,
                "vote_average": 8.0,
                "vote_count": 4017,
                "character": "Steven Pushkov",
                "credit_id": "52fe44849251416c750378cf",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/hsDyfAk2ml82IrpPC4AHvxvuTsn.jpg",
                "genre_ids": [
                    18,
                    36,
                    10752
                ],
                "id": 8741,
                "original_language": "en",
                "original_title": "The Thin Red Line",
                "overview": "The story of a group of men, an Army Rifle company called C-for-Charlie, who change, suffer, and ultimately make essential discoveries about themselves during the fierce World War II battle of Guadalcanal. It follows their journey, from the surprise of an unopposed landing, through the bloody and exhausting battles that follow, to the ultimate departure of those who survived.",
                "popularity": 5.6938,
                "poster_path": "/seMydAaoxQP6F0xbE1jOcTmn5Jr.jpg",
                "release_date": "1998-12-23",
                "title": "The Thin Red Line",
                "video": false,
                "vote_average": 7.447,
                "vote_count": 3133,
                "character": "Sgt. Jack McCron",
                "credit_id": "52fe44b6c3a36847f80a5ec1",
                "order": 19
            },
            {
                "adult": false,
                "backdrop_path": "/8uQRpN3JkD24yL1NjUP2YdSsgNf.jpg",
                "genre_ids": [
                    18
                ],
                "id": 925,
                "original_language": "en",
                "original_title": "Do the Right Thing",
                "overview": "Salvatore \"Sal\" Fragione is the Italian owner of a pizzeria in Brooklyn. A neighborhood local, Buggin' Out, becomes upset when he sees that the pizzeria's Wall of Fame exhibits only Italian actors. Buggin' Out believes a pizzeria in a black neighborhood should showcase black actors, but Sal disagrees. The wall becomes a symbol of racism and hate to Buggin' Out and to other people in the neighborhood, and tensions rise.",
                "popularity": 4.773,
                "poster_path": "/63rmSDPahrH7C1gEFYzRuIBAN9W.jpg",
                "release_date": "1989-06-14",
                "title": "Do the Right Thing",
                "video": false,
                "vote_average": 7.768,
                "vote_count": 1883,
                "character": "Clifton",
                "credit_id": "58668f3c9251412b8d02e913",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "John Smeallie Youngs",
            "جان سوج"
        ],
        "biography": "John Savage (born John Youngs; August 25, 1949) is an American film actor, producer, production manager, and composer.\n\nSavage has appeared in more than 200 feature films, short films, recurring roles in television series and guest appearances in episodes of television series. One of Savage's first notable roles is as Claude Bukowski in the 1979 film Hair. His first major film role was as Steven Pushkov in the multiple Oscar-winning 1978 film The Deer Hunter. He also had a lead role in the 1979 film The Onion Field. In the late 1970s, he performed in the Broadway production of David Mamet's play American Buffalo.\n\nIn 1991, he starred in Italian director Lucio Fulci's final film Door to Silence. He then had a brief role in the 1998 war film The Thin Red Line, portrayed Captain Ransom in the two part episode Equinox of the television series Star Trek: Voyager in 1999, and appeared in the recurring role of Donald Lydecker in the first and second seasons of the 2000 television series Dark Angel.\n\nSavage starred in the 2015 horror film Tales of Halloween, the 2017 film In Dubious Battle, and on the 2017 continuation of the television show Twin Peaks. In 2018, he appeared on the television show Goliath.\n\nIn 2018, Savage lent his voice to a monologue on the title track of the album This Town by Steve Smith of Dirty Vegas. In 2019, Savage played the role of The Narrator in upcoming fantasy crime drama Karma from award-winning filmmaker Bizhan Tong, having collaborated with him earlier that year.",
        "birthday": "1949-08-25",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 47879,
        "imdb_id": "nm0001698",
        "known_for_department": "Acting",
        "name": "John Savage",
        "place_of_birth": "Old Bethpage, New York, USA",
        "popularity": 0.8492,
        "profile_path": "/exzL5D7RSnIepF9FsFlzCs248he.jpg"
    }
}