{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mTsbahr4SLqgVZkKRN0O8t5iA9y.jpg",
                "genre_ids": [
                    18,
                    35,
                    10402
                ],
                "id": 71,
                "original_language": "en",
                "original_title": "Billy Elliot",
                "overview": "County Durham, England, 1984. The miners' strike has started and the police have started coming up from Bethnal Green, starting a class war with the lower classes suffering. Caught in the middle of the conflict is 11-year old Billy Elliot, who, after leaving his boxing club for the day, stumbles upon a ballet class and finds out that he's naturally talented. He practices with his teacher Mrs. Wilkinson for an upcoming audition in Newcastle-upon Tyne for the royal Ballet school in London.",
                "popularity": 5.0851,
                "poster_path": "/nOr5diUZxphmAD3li9aiILyI28F.jpg",
                "release_date": "2000-09-28",
                "title": "Billy Elliot",
                "video": false,
                "vote_average": 7.597,
                "vote_count": 3953,
                "character": "Tony Elliot",
                "credit_id": "52fe4213c3a36847f8002121",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nJamie Draven (born Jamie Donnelly on 14 May 1979) is an English actor whose career in films and television began in 1998. One of his early notable parts was as Billy's elder brother, Tony, in the hit 2000 film Billy Elliot and as Jamie Dow in Ultimate Force.\n\nA native of the southern Manchester district of Wythenshawe, he is the youngest of three brothers (his mother is Kath and her other sons are John and Jason). Early in life he thought of becoming a footballer but turned his attention to acting at 16. He later moved to London to fulfill his acting ambitions, although he had no theatrical training and no CV. Changing his name to Jamie Draven, he was 19 with just a few small parts to his credit, when he won a major role in the 1999 Granada Television drama Butterfly Collectors.\n\nHe has worked with actress Alex Reid on several occasions, including Series 1 and 2 of Ultimate Force, Episode 2 of Mobile and in Jetsam.\n\nDescription above from the Wikipedia article Jamie Draven, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1979-05-14",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 479,
        "imdb_id": "nm0237237",
        "known_for_department": "Acting",
        "name": "Jamie Draven",
        "place_of_birth": "Wythenshawe, Manchester, Lancashire, England",
        "popularity": 1.5769,
        "profile_path": "/1pVeYgyW7QiI5QuDBip9RlAZ3mz.jpg"
    }
}