{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4i3Amppd6eW5Qkhjv4gdHk3CCoE.jpg",
                "genre_ids": [
                    36,
                    10402,
                    18
                ],
                "id": 279,
                "original_language": "en",
                "original_title": "Amadeus",
                "overview": "Disciplined Italian composer Antonio Salieri becomes consumed by jealousy and resentment towards the hedonistic and remarkably talented young Salzburger composer Wolfgang Amadeus Mozart.",
                "popularity": 5.9174,
                "poster_path": "/1n5VUlCqgmVax1adxGZm8oCFaKc.jpg",
                "release_date": "1984-09-19",
                "title": "Amadeus",
                "video": false,
                "vote_average": 8.0,
                "vote_count": 4488,
                "character": "Papageno in 'The Magic Flute' (singing voice)",
                "credit_id": "6679768a7e57ec07ee565e56",
                "order": 60
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Brian Christopher Kay (born 12 May 1944) is an English radio presenter, conductor and singer. He is well-known as the bass in the King's Singers during the group's formative years from 1968 to 1982, and as such is to be heard on many of their 1970s recordings. He was also the voice of Papageno in the film Amadeus and the lowest frog in the Paul McCartney song \"We All Stand Together\" (\"The Frog's Chorus\"). He is noted as a choral conductor, being the former conductor (and now president) of the Leith Hill Musical Festival and former director of the Huddersfield Choral Society. He is principal conductor of the Really Big Chorus. On radio, he has been a presenter of Friday Night is Music Night on BBC Radio 2 and until 2006 presented 3 for All and Brian Kay's Light Programme, a weekly programme about light music on BBC Radio 3. In 1996 he won the Sony Radio Award as Music Presenter of the Year. He is a patron of Bampton Classical Opera and president of The English Arts Chorale, the Harrogate Choral Society and the Bristol Bach Choir.\n\nKay is the vice president of the Royal School of Church Music and of the Association of British Choral Directors",
        "birthday": "1944-05-12",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.berkshirechoral.org/about-us/people/brian-kay",
        "id": 4792104,
        "imdb_id": "nm3113470",
        "known_for_department": "Acting",
        "name": "Brian Kay",
        "place_of_birth": "Oxfordshire, England, UK",
        "popularity": 0.0071,
        "profile_path": null
    }
}