{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4i3Amppd6eW5Qkhjv4gdHk3CCoE.jpg",
                "genre_ids": [
                    36,
                    10402,
                    18
                ],
                "id": 279,
                "original_language": "en",
                "original_title": "Amadeus",
                "overview": "Disciplined Italian composer Antonio Salieri becomes consumed by jealousy and resentment towards the hedonistic and remarkably talented young Salzburger composer Wolfgang Amadeus Mozart.",
                "popularity": 5.9174,
                "poster_path": "/1n5VUlCqgmVax1adxGZm8oCFaKc.jpg",
                "release_date": "1984-09-19",
                "title": "Amadeus",
                "video": false,
                "vote_average": 8.0,
                "vote_count": 4488,
                "character": "Papagena in 'The Magic Flute' (singing voice)",
                "credit_id": "667976a7baba664776d97875",
                "order": 62
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "The English soprano, Gillian Fisher, studied with John Carol Case at the Royal College of Music in London and with Jessica Cash.  Gillian Fisher began then a concert career, which has brought her big successes all over the world. For example, in London she appeared at the Albert Hall and at the Barbican Hall, she sang in Amsterdam together with the Concertgebouw Orchestra, in New York at the Lincoln Center and in Tokyo at the Suntori Hall. She participated in the Handel Festivals in London and in Maryland, USA and sang in 1985 at the 300-anniversary of this composer in Theodora and other works of the great master. In 1987 she sang in a Japan with Amsterdam Baroque Orchestra under Ton Koopman the soprano solo in Messiah. In Italy she appeared with the vocal group The Sixteen, and in 1992 made a world tour with them, also singing Messiah.\n\nGillian Fisher has appeard frequently in broadcasts; for example she featured in Central TV series Man and his Music. She has participated in numerous recordings, partially together with vocal and instrumental ensembles, which specialising in the Baroque repertoire. These recordings appeared on various labels, including King Arthur by Purcell with John Eliot Gardiner & Monteverdi Choir (Erato); The Triumph of Time and Truth by Georg Frideric Handel with Denys Barlow and the London Handel Orchestra; Great Baroque Arias and Giovanni Battista Pergolesi's Stabat Mater with The King’s Consort and Michael Chance; Purcell's The Fairy Queen and Bach Cantatas with Harry Christophers & The Sixteen (Collins); G.F. Handel duets with The King’s Consort and James Bowman.",
        "birthday": "1958-06-01",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.hyperion-records.co.uk/a.asp?a=A297",
        "id": 4792106,
        "imdb_id": "nm5831539",
        "known_for_department": "Acting",
        "name": "Gillian Fisher",
        "place_of_birth": "Walsall, West Midlands, England, UK",
        "popularity": 0.0143,
        "profile_path": null
    }
}