{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uBLmfG7MyNXPXI50eMs1ZjxpbnV.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 338,
                "original_language": "de",
                "original_title": "Good Bye, Lenin!",
                "overview": "Alex Kerner's mother was in a coma while the Berlin wall fell. When she wakes up he must try to keep her from learning what happened (as she was an avid communist supporter) to avoid shocking her which could lead to another heart attack.",
                "popularity": 3.1316,
                "poster_path": "/uHk1oGEbnvQGLnyiiYxTslZLoog.jpg",
                "release_date": "2003-02-13",
                "title": "Good Bye, Lenin!",
                "video": false,
                "vote_average": 7.541,
                "vote_count": 2501,
                "character": "Ariane",
                "credit_id": "52fe4239c3a36847f800d97d",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/zxY1yP9FjJpV7T3hxqBBI5WNydx.jpg",
                "genre_ids": [
                    36,
                    18,
                    10752
                ],
                "id": 403300,
                "original_language": "en",
                "original_title": "A Hidden Life",
                "overview": "Austrian farmer Franz Jägerstätter faces the threat of execution for refusing to fight for the Nazis during World War II.",
                "popularity": 3.2933,
                "poster_path": "/rdG4jfH0rxkB2FgkYmjj9V4Q31M.jpg",
                "release_date": "2019-08-27",
                "title": "A Hidden Life",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 735,
                "character": "Resie",
                "credit_id": "586ae8d8925141213100411c",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Maria Simon (born February 6, 1976) is a German actress.\n\nSimon's German father originally hailed from Leipzig and studied mathematics in Leningrad. There he met Simon's Russian-Jewish mother, Olga, who studied electronics and originally hailed from Kazakhstan. The couple married while studying.\n\nMaria Simon is the younger sister of actress Susanna Simon, who was born on 23 July 1968, in Almaty, Kazakhstan. Maria was born and brought up in the former East Germany, but moved to New York City in 1990 to live with her father, a computer expert with the United Nations, and her sister Dalena Simon. She also has a sister named Alyssa. Simon has four children, the first from a former relationship with the actor Devid Striesow, and three with her ex-husband, the actor Bernd Michael Lade.\n\nAfter finishing school she moved back to the newly reunited Germany to study acting at the Academy of Performing Arts Ernst Busch in Berlin where she received her diploma in 1999.\n\nShe won the award for Best Actress for her role in the film Zornige Küsse at the 22nd Moscow International Film Festival in 2000. Simon was nominated as the best supporting actress in the 2003 German Film Awards, and was named European Shooting Star (i.e., best newcomer) at the 2004 Berlinale. In the same year she played Polly in Bertolt Brechts Dreigroschenoper at the Maxim Gorki Theater in Berlin. Her TV movie Kleine Schwester was nominated for the Adolf Grimme Awards in 2005.",
        "birthday": "1976-02-06",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 4794,
        "imdb_id": "nm0800314",
        "known_for_department": "Acting",
        "name": "Maria Simon",
        "place_of_birth": "Leipzig, Germany",
        "popularity": 0.1816,
        "profile_path": "/1coRNrHqfnpWk5eClxgIpYyrQe0.jpg"
    }
}