{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/nrm4FH3Dl9D62B1Lj7dsQgkwXRa.jpg",
                "genre_ids": [
                    10402,
                    18
                ],
                "id": 12104,
                "original_language": "en",
                "original_title": "Pink Floyd: The Wall",
                "overview": "A troubled rock star descends into madness in the midst of his physical and social isolation from everyone.",
                "popularity": 3.2729,
                "poster_path": "/aElHyIdF5jmctFGhlhhaPFsbBJC.jpg",
                "release_date": "1982-07-14",
                "title": "Pink Floyd: The Wall",
                "video": false,
                "vote_average": 7.945,
                "vote_count": 1563,
                "character": "Pink",
                "credit_id": "52fe44b59251416c7503e48d",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "The Boomtown Rats",
            "Robert Frederick Zenon Geldof",
            "Sir Bob Geldof"
        ],
        "biography": "Robert Frederick Zenon Geldof KBE (born 5 October 1951) is an Irish singer-songwriter and political activist. He rose to prominence in the late 1970s as lead singer of the Irish rock band the Boomtown Rats, who achieved popularity as part of the punk rock movement. The band had UK number one hits with his co-compositions \"Rat Trap\" and \"I Don't Like Mondays\". Geldof starred as Pink in Pink Floyd's 1982 film Pink Floyd – The Wall. As a fundraiser, Geldof organised the charity supergroup Band Aid and the concerts Live Aid and Live 8, and co-wrote \"Do They Know It's Christmas?\", one of the best-selling singles to date.\n\nGeldof is widely recognised for his activism, especially his anti-poverty efforts concerning Africa. In 1984, he and Midge Ure founded the charity supergroup Band Aid to raise money for famine relief in Ethiopia. They went on to organise the charity super-concert Live Aid the following year and the Live 8 concerts in 2005. Geldof currently serves as an adviser to the ONE Campaign, co-founded by fellow Irish rock singer and activist Bono, and is a member of the Africa Progress Panel (APP), a group of ten distinguished individuals who advocate at the highest levels for equitable and sustainable development in Africa. A single father, Geldof has also been outspoken for the fathers' rights movement.\n\nGeldof was granted an honorary knighthood (KBE) by Elizabeth II in 1986 for his charity work in Africa: it is an honorary award as Geldof is an Irish citizen, but he is often referred to as 'Sir Bob'. He is a recipient of the Man of Peace title which recognises individuals who have made \"an outstanding contribution to international social justice and peace\", among numerous other awards and nominations. In 2005, he received the Brit Award for Outstanding Contribution to Music.\n\nDescription above from the Wikipedia article Bob Geldof, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1951-10-05",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 47991,
        "imdb_id": "nm0002097",
        "known_for_department": "Acting",
        "name": "Bob Geldof",
        "place_of_birth": "Dún Laoghaire, County Dublin, Ireland",
        "popularity": 0.3052,
        "profile_path": "/9fDWH8hQifcpzWHcTjBQLngsvJT.jpg"
    }
}