{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3nx1jkMcWlcjmlDgEDFzW1Tykv0.jpg",
                "genre_ids": [
                    18,
                    10752
                ],
                "id": 2604,
                "original_language": "en",
                "original_title": "Born on the Fourth of July",
                "overview": "Paralyzed in the Vietnam war, Ron Kovic becomes an anti-war and pro-human rights political activist after feeling betrayed by the country he fought for.",
                "popularity": 8.4394,
                "poster_path": "/c5gSie6ZA90iBs62yNM5MV4y9R7.jpg",
                "release_date": "1989-12-20",
                "title": "Born on the Fourth of July",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 1790,
                "character": "Martinez - Vietnam",
                "credit_id": "55e879c2c3a3682c67002d7f",
                "order": 37
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jason Michael Gedroic",
            "جیسون گدریک"
        ],
        "biography": "An American actor best known for his work on the television series Murder One and Boomtown, as well as the motion picture Iron Eagle. Gedrick began his career as an extra in films such as Bad Boys (1983) and Risky Business (1983). After roles in The Heavenly Kid (1985), Iron Eagle (1986), Promised Land (1987) with director Michael Hoffman, Iron Eagle II (1988 in an uncredited role for the first few minutes of the movie), Born on the Fourth of July (1989), Backdraft (1991), and Crossing the Bridge (1992), Gedrick appeared in television series such as Class of '96 (1993) and Sweet Justice (1994). In 1994, Gedrick starred in the film The Force with Yasmine Bleeth and Kim Delaney. Gedrick's big break was in Steven Bochco's innovative 1995 series Murder One. The series followed the trial of Gedrick's character, bad-boy actor Neil Avedon, alleged to have murdered a 15-year-old girl. The series, which also starred talent such as Daniel Benzali, Patricia Clarkson, Mary McCormack, Dylan Baker and Stanley Tucci was a runaway success. Due to this, a second season was commissioned. Due to network concerns, the new season featured several small cases rather than one big one. Anthony LaPaglia stepped in to replace the cast such as Benzali, Tucci and Gedrick, who had left, and the series was canceled midway through its second season. Gedrick's next major project was the three-hour TV movie The Third Twin, a 1997 thriller based on the best-selling 1996 novel by British writer Ken Follett. Gedrick plays a university employee accused of rape, whose friend later discovers he has a twin--and actually several more twins cloned by an evil millionaire university donor and biomedical technology CEO (played to the hilt by Larry Hagman, a.k.a. Dallas's J. R. Ewing). Gedrick next took roles in television series such as EZ Streets (1996), Falcone (2000) and The Beast (2001). None of which were major successes. In 1999, he guest starred on Ally McBeal as the \"hot car wash guy\". Also appearing in Mario Puzo's 1997 mini-series, The Last Don and in its sequel, The Last Don II. Gedrick returned to television screens as Tom Turcotte in 2002's Boomtown. The series, which also starred Donnie Wahlberg and Neal McDonough was a moderate success, but ratings plummeted - particularly after the second season suffered a format change, and Boomtown was cancelled. In 2003, Gedrick played Andrew Luster, the infamous rapist in a Lifetime movie based on his trial, A Date with Darkness. Gedrick is part of the cast of the 2006 NBC television series Windfall also starring Luke Perry and Gedrick's former Boomtown alumni, Lana Parrilla. In 2007 Gedrick again starred alongside Donnie Wahlberg in the A&E original movie Kings of South Beach. He is also the new love interest at Scavo's Pizzeria in Desperate Housewives Season 3 and 4 on ABC.\n\nDescription above from the Wikipedia article Jason Gedrick, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1965-02-07",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 48012,
        "imdb_id": "nm0001263",
        "known_for_department": "Acting",
        "name": "Jason Gedrick",
        "place_of_birth": "Chicago, Illinois, USA",
        "popularity": 1.3035,
        "profile_path": "/45Dea89CukCmdk88F7RQMgpAeYC.jpg"
    }
}