{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fMQGVBk0ZyzxMQOBGkUazCkvMMR.jpg",
                "genre_ids": [
                    35,
                    10749,
                    18
                ],
                "id": 38408,
                "original_language": "en",
                "original_title": "Life As We Know It",
                "overview": "After a disastrous first date for caterer Holly and network sports director Messer, all they have in common is a dislike for each other and their love for their goddaughter Sophie. But when they suddenly become all Sophie has in this world, Holly and Messer must set their differences aside. Juggling careers and social calendars, they'll have to find common ground while living under the same roof.",
                "popularity": 2.8541,
                "poster_path": "/zLzS2aOqKsS0QvEaY6SfBw4VBqh.jpg",
                "release_date": "2010-10-02",
                "title": "Life As We Know It",
                "video": false,
                "vote_average": 6.905,
                "vote_count": 3195,
                "character": "Pregnant Woman with DeeDee",
                "credit_id": "668989e1c0862abeead50ce1",
                "order": 42
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Shayne Ann Kohout, 33, Atlanta area actor, died suddenly Thursday, May 13.\n\nBorn in Midland, Texas on June 9, 1976, Shayne grew up in Lubbock where she graduated from Texas Tech University with degrees in music education and English.\n\nShayne traveled to Japan to teach her native language from 1999-2000. In 2001, she moved to Atlanta where she found a home in theatre. Over the next decade she had lead, principal and supporting roles in numerous film, television and stage productions.\n\nShayne was a member of the Screen Actors Guild, and had recently completed filming the second \"Mandie\" movie, Mandie and the Cherokee Treasure, where she reprised her comedic role of Mrs. Snow. Her passions were music and acting, and she loved her many friends in the theatre, at Temple Emanu-El where she worked to supplement her income, and throughout Atlanta and Texas.\n\nShayne is survived by her mother Sharon Leach Kohout of Washington, DC; her father Wayne Joseph Kohout of Lubbock, Texas; sister Paige Marie Kohout of Lubbock; brother Britt Joseph Kohout of Round Rock, Texas; stepmother Lequice Kohout; stepfather Joe Froelich; and numerous aunts, uncles and cousins throughout Texas and Illinois.",
        "birthday": "1976-06-09",
        "deathday": "2010-05-14",
        "gender": 1,
        "homepage": null,
        "id": 4814360,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Shayne Kohout",
        "place_of_birth": "Midland, Texas, USA",
        "popularity": 0.0071,
        "profile_path": "/mbUrpu9VSMjCIBAl0gxMZ0KNqY0.jpg"
    }
}