{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yTgqGrzDtJPAYpWN2QrL5TTtWrr.jpg",
                "genre_ids": [
                    10751,
                    35,
                    12,
                    16
                ],
                "id": 11836,
                "original_language": "en",
                "original_title": "The SpongeBob SquarePants Movie",
                "overview": "There's trouble brewing in Bikini Bottom. Someone has stolen King Neptune's crown, and it looks like Mr. Krab, SpongeBob's boss, is the culprit. Though he's just been passed over for the promotion of his dreams, SpongeBob stands by his boss, and along with his best pal Patrick, sets out on a treacherous mission to Shell City to reclaim the crown and save Mr. Krab's life.",
                "popularity": 7.8389,
                "poster_path": "/1rvzKV1d18EbDVaEd4VDzK3cgnY.jpg",
                "release_date": "2004-11-19",
                "title": "The SpongeBob SquarePants Movie",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 3048,
                "character": "Reporter / Driver / Ice Cream Lady (voice)",
                "credit_id": "6467687533a3760158d910e3",
                "order": 36
            },
            {
                "adult": false,
                "backdrop_path": "/ltlPFTMRsohmi2QbbSZUkAVg7Nc.jpg",
                "genre_ids": [
                    878,
                    28,
                    16,
                    12
                ],
                "id": 297556,
                "original_language": "en",
                "original_title": "Justice League: Throne of Atlantis",
                "overview": "After the events of Justice League: War, Ocean Master and Black Manta have declared a war against the surface in retaliation of the aftermath of Apokoliptian-tyrant Darkseid's planetary invasion. Queen Atlanna seeks out her other son, Ocean Master’s half-brother Arthur Curry, a half-human with aquatic powers with no knowledge of his Atlantean heritage, to restore balance.  Living with powers he doesn’t understand and seeing the danger around him, Curry takes steps to embrace his destiny, joining the Justice League, and with his new teammates he battles to save Earth from total destruction.",
                "popularity": 3.6201,
                "poster_path": "/iaYZA8teYeIxmR8wRrEED5wwR0u.jpg",
                "release_date": "2015-01-13",
                "title": "Justice League: Throne of Atlantis",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 957,
                "character": "Queen Atlanna (voice)",
                "credit_id": "543e4dcf0e0a266f84001f20",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Sirena Jessica Irwin",
            "Sirena J. Irwin",
            "Sirena Ruth Irwin",
            "Sirena R. Irwin",
            "Sirena Kay Irwin",
            "Sirena K. Irwin"
        ],
        "biography": "Sirena grew up around the U.S. and abroad her mother, Margaret Irwin-Brandon, is a harpsichordist and conductor of a Baroque Orchestra, and her father, John Irwin, was a physicist (with a significant stint as a dropped out hippie)-landed ultimately at Sanford University. After time spent at Northfield Mt. Hermon boarding school where she fell in love with theater, she attended San Francisco State University and graduated with degrees in Theater and International Relations. After a successful stint in a popular San Francisco sketch comedy group, she landed in Los Angeles where her knack for voices and accents were quickly put to use in the world of animation. This ultimately brought her to her successful career as a voice director in animation (thanks to her mentor Andrea Romano!) garnering her an Emmy nomination in 2021.",
        "birthday": "1977-09-26",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 48163,
        "imdb_id": "nm0410451",
        "known_for_department": "Acting",
        "name": "Sirena Irwin",
        "place_of_birth": "Gresham, Oregon, USA",
        "popularity": 0.2,
        "profile_path": "/pK2OgTLhjCMJdTySlztR8ojxbtq.jpg"
    }
}