{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5fxTB08O7CW1hAcN2MWOKodp1h1.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 615777,
                "original_language": "en",
                "original_title": "Babylon",
                "overview": "A tale of outsized ambition and outrageous excess, tracing the rise and fall of multiple characters in an era of unbridled decadence and depravity during Hollywood's transition from silent films to sound films in the late 1920s.",
                "popularity": 10.7094,
                "poster_path": "/wjOHjWCUE0YzDiEzKv8AfqHj3ir.jpg",
                "release_date": "2022-12-22",
                "title": "Babylon",
                "video": false,
                "vote_average": 7.38,
                "vote_count": 3486,
                "character": "Beauty (uncredited)",
                "credit_id": "66c24275a77c37b428d548f1",
                "order": 238
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Anastasia Gordeyko",
            "Anastasiya Gordeyko-Atanesan",
            "Anastasia Gordeyko-Atanessian"
        ],
        "biography": "Anastasia was born is a family of a military officer and spent her early years on the road and changing a lot of cities and counties. The constant change made Ana adapt to any situation, environment and friends and quickly became an actress by instinct. Her dad was very big on sport, and he instilled this in Ana. She was a very active kid growing up and tried every sport possible - from cross country and water skiing to badminton and paddle boarding. Dance also has always been a huge part of her life. Ana has been trained in classic ballet as a child, then did theatre dance and jazz, and now is dedicated to heels dance. Ana went to a school with an artistic emphasis where she studied piano and got into theatre. Her first role was Mercutio in \"Romeo and Juliet\" musical. The company traveled with this piece all over Europe, participated and won many youth international festivals. At the age of 16 Ana started to model and made a dizzying international career working all over the world from Paris and London to Beijing and Cape Town and gracing all biggest fashion magazines' covers. After traveling around the globe moved to Los Angeles to pursue acting career. Graduated from Baron Brown studio, Ana studied under Howard Fine, Larry Moss and Aaron Speiser. Thanks to her iron discipline, incredible work ethic and dedication Ana booked roles in Disney tv series Just Roll with It, big studio projects Babylon, Beverly Hills Cop: Axel F and numerous independent movies. Her athlete's mentality and ability to transform like a chameleon makes her one of the most promising actress of her generation.\n\n- IMDb Mini Biography By: Pierre Partick",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 4892698,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Ana Bergman",
        "place_of_birth": null,
        "popularity": 0.0143,
        "profile_path": "/cx3UVK2xpqk5voCsHzBpR6qk2Iz.jpg"
    }
}