{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gh9YcpJ01IsrwGkB3IK8K3LWQ25.jpg",
                "genre_ids": [
                    18,
                    28,
                    10752
                ],
                "id": 517093,
                "original_language": "ru",
                "original_title": "Балканский рубеж",
                "overview": "After the NATO bombing of Yugoslavia in 1999, the Yugoslav army pulls out of Kosovo region, leaving Serbian people at the mercy of the Albanian UCK. A small band of soldiers must take over the Slatina airport, and hold it until the Russian peacekeepers arrive.",
                "popularity": 6.7478,
                "poster_path": "/okiB4NUriKKbGjAtVSzveicPTtu.jpg",
                "release_date": "2019-03-21",
                "title": "Balkan Line",
                "video": false,
                "vote_average": 7.459,
                "vote_count": 558,
                "character": "Vera",
                "credit_id": "5c417eab9251416b02b1e6cc",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Равшана Бахрамовна Куркова",
            "Ravshana Bahromovna Kurkova",
            "Ravšana Kurkova",
            "ラヴシャナ・クルコワ"
        ],
        "biography": "Ravshana Bahramovna Kurkova (Uzbek: Ravshana Bahromovna Kurkova, Russian: Равшана Бахрамовна Куркова; born August 22, 1980) is an Uzbek-Russian actress of theater, film and dubbing, and producer. She appeared in more than thirty films since 2003.\n\nRavshana Matchanova was born in Tashkent in an Uzbek acting family. She starred in the arthausal philosophical drama of Rashid Malikov \"Kirk Kulok Siri\", filmed at the film studio \"Uzbekfilm\" in 1992.\n\nIn the eighth grade, her parents transferred her to another Tashkent lyceum, a branch of the University of London, where all subjects were taught in English. In the late 1990s, Ravshana moved to Moscow, where she entered the philological faculty of the Moscow State Pedagogical University.\n\nAfter receiving the diploma of higher education she worked on television as an editor of the talk show, an assistant to the director. She listened to the course of lectures in the framework of High Courses for Scriptwriters and Film Directors and studied acting skills under the guidance of Tatyana Pyshnova, of the teacher of the Mikhail Shchepkin Higher Theatre School.\n\nRavshana Kurkova is also known as a theatrical actress. She was busy in the play - plastic drama \"Ungiers\" by Oleg Glushkov, premiered in 2010. Performed the main roles in theatrical productions of Ivan Vyrypaev \"Unbearably long embrace\" and \"Illusion\" in the Moscow theater \"Practice\".\n\nFrom 2014 to 2016, Ravshana cooperated with the well-known brands Intimissimi and Calzedonia. As the official envoy of Calzedonia, Ravshana Kurkova annually represented Russia at the Calzedonia Summer Show in Verona.\n\nIn the 12-episode series And we have in the yard ... directed by Olga Muzaleva (Channel One Russia), Ravshana performed the role of Mavlyuda, a doctor, a resident of Samarkand, the mother of three children who came to Moscow to look for the missing husband and forced to work as a janitor. According to journalist Andrei Arkhangelsky, \"For the first time on the screen was created the image of a migrant - not a hero sketch, not a comic ornament, but a full-fledged hero.\"\n\nIn 2016, the premiere of the immersion thriller Maxim Didenko \"Black Russian\" took place on the motives of the novel \"Dubrovsky\" by Alexander Pushkin, where Ravshana played the main female role - Masha Troyekurova. The role of Dubrovsky was performed by the former husband of actors Artyom Tkachenko.\n\nRavshana Matchanova, the first spouse of the actor was photographer Semyon Kurkov, after the divorce, Ravshana Kurkova kept his surname. She was in her second marriage to Russian actor Artyom Tkachenko from 2004 to 2008.",
        "birthday": "1980-08-22",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 490022,
        "imdb_id": "nm2045831",
        "known_for_department": "Acting",
        "name": "Ravshana Kurkova",
        "place_of_birth": "Tashkent, Uzbek SSR, USSR [now Uzbekistan]",
        "popularity": 1.2845,
        "profile_path": "/lI65Veszy2xFT2511HRSYlTr4Q1.jpg"
    }
}