{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5BFpmELJKE5cZxtOpGJYAdIRybF.jpg",
                "genre_ids": [
                    18,
                    36,
                    10749
                ],
                "id": 921452,
                "original_language": "fr",
                "original_title": "Jeanne du Barry",
                "overview": "The life of Jeanne Bécu, who was born as the illegitimate daughter of an impoverished seamstress in 1743 and went on to rise through the Court of Louis XV to become his last official mistress.",
                "popularity": 2.3456,
                "poster_path": "/rSTtGXebezwZ6GVTeZVaeJ9ZQF1.jpg",
                "release_date": "2023-05-16",
                "title": "Jeanne du Barry",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 609,
                "character": "La Comtesse de Noailles",
                "credit_id": "62700b01c56d2d6f76900e2a",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Noémie Lvovsky (born 14 December 1964) is a French film director, screenwriter, and actress.\n\nLvovsky was born in Paris in 1964, the daughter of Jewish parents who emigrated from Ukraine to flee pogroms. She studied cinema at La Fémis in Paris, notably a contemporary of Arnaud Desplechin, with whom she often collaborates. Her first two films cast Emmanuelle Devos, who was then at the beginning of her career.\n\nShe is the actress with most nominations for the César Award for Best Supporting Actress, with six nominations: in 2002 for My Wife Is an Actress, in 2006 for Backstage, in 2008 for Actrices, in 2010 for The French Kissers, in 2012 for House of Pleasures and in 2016 for Summertime. Her film Sentiments was nominated for the César Award for Best Film in 2004.\n\nHer film Camille redouble was selected to be screened in the Directors' Fortnight section at the 2012 Cannes Film Festival where it won the Prix SACD.\n\nShe was named as one of the jury members for the Cinéfondation and short film sections of the 2014 Cannes Film Festival.\n\nSource: Article \"Noémie Lvovsky\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1964-12-14",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 49168,
        "imdb_id": "nm0527852",
        "known_for_department": "Acting",
        "name": "Noémie Lvovsky",
        "place_of_birth": "Paris, France",
        "popularity": 0.2903,
        "profile_path": "/rCAE48eQMBRxLGksTdbjTjeiPbP.jpg"
    }
}