{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/nP3y0TkR6XniFs9J53qQkg4Bnnk.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 10625,
                "original_language": "en",
                "original_title": "Mean Girls",
                "overview": "Cady Heron is a hit with The Plastics, the A-list girl clique at her new school, until she makes the mistake of falling for Aaron Samuels, the ex-boyfriend of alpha Plastic Regina George.",
                "popularity": 11.4389,
                "poster_path": "/2ZkuQXvVhh45uSvkBej4S7Ix1NJ.jpg",
                "release_date": "2004-04-30",
                "title": "Mean Girls",
                "video": false,
                "vote_average": 7.221,
                "vote_count": 9136,
                "character": "Cady Heron",
                "credit_id": "52fe43979251416c7501664b",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/y3zUOMWRoI2vC4ck2GBJyFWhzyA.jpg",
                "genre_ids": [
                    35,
                    10751,
                    10749
                ],
                "id": 9820,
                "original_language": "en",
                "original_title": "The Parent Trap",
                "overview": "Hallie Parker and Annie James are identical twins who were separated at a young age due to their parents' divorce. Unbeknownst to their parents, the girls are sent to the same summer camp, where they meet, discover the truth about their relationship, and come up with a plan to switch places in an effort to reunite their mother and father.",
                "popularity": 12.468,
                "poster_path": "/p4dGmi8u9W0HHyVXcgWPoiFfKTF.jpg",
                "release_date": "1998-07-28",
                "title": "The Parent Trap",
                "video": false,
                "vote_average": 7.219,
                "vote_count": 4351,
                "character": "Hallie Parker / Annie James",
                "credit_id": "52fe4534c3a36847f80c1e97",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/9Ebn8atCcGk5OZrx4xmoTobAxoh.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 1581,
                "original_language": "en",
                "original_title": "The Holiday",
                "overview": "Two women, one American and one British, swap homes at Christmastime following bad breakups. Each woman finds romance with a local man but realizes that the imminent return home may end the relationship.",
                "popularity": 7.4162,
                "poster_path": "/h1ITOpvJN3Tw4Sy60w2QTfYMvdd.jpg",
                "release_date": "2006-12-05",
                "title": "The Holiday",
                "video": false,
                "vote_average": 7.091,
                "vote_count": 5346,
                "character": "Lindsay Lohan",
                "credit_id": "5907a29c9251416492001d76",
                "order": 41
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Λίντσεϊ Ντι Λόχαν ",
            "ლინდსი ლოჰანი",
            "琳賽·蘿涵",
            "Ліндсі Лохан",
            "لیندزی لوهان",
            "لیندسی لوهان"
        ],
        "biography": "Lindsay Dee Lohan (born July 2, 1986) is an American actress and singer. Born in New York City and raised on Long Island, Lohan was signed to Ford Models at the age of three. Having appeared as a regular on the television soap opera Another World at age 10, her breakthrough came in the Walt Disney Pictures film The Parent Trap (1998). The film's success led to appearances in the television films Life-Size (2000) and Get a Clue (2002), and the big-screen productions Freaky Friday (2003) and Confessions of a Teenage Drama Queen (2004). Lohan's early work won her childhood stardom, while the teen comedy sleeper hit Mean Girls (2004) affirmed her status as a teen idol and established her as a Hollywood leading actress.\n\nLohan became known as a triple threat after signing with Casablanca Records and releasing two studio albums, the platinum-certified Speak (2004) and gold-certified A Little More Personal (Raw) (2005). She also starred in the comedies Herbie: Fully Loaded (2005) and Just My Luck (2006). In order to showcase her range, Lohan began choosing roles in independent films such as A Prairie Home Companion and Bobby (both 2006) and Chapter 27 (2007).\n\nIn 2013, under the guidance of Oprah Winfrey, Lohan filmed the docu-series Lindsay (2014), which depicted her returning to work. She subsequently made her stage debut in the London West End production of Speed-the-Plow (2014), starred in the second season of the comedy series Sick Note (2018), and served as a panelist in the first season of Masked Singer Australia (2019). Between 2016 and 2018, she opened three beach clubs in Greece, which were the focus of the MTV reality television series Lindsay Lohan's Beach Club (2019). After signing a multi-picture deal with Netflix, Lohan starred in the romantic comedy Falling for Christmas (2022).",
        "birthday": "1986-07-02",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.lindsaylohanofficial.com/",
        "id": 49265,
        "imdb_id": "nm0517820",
        "known_for_department": "Acting",
        "name": "Lindsay Lohan",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 1.8438,
        "profile_path": "/8TdcVkiHgPp2gIKBPQ42OVa6l0B.jpg"
    }
}