{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qxTw8OKJLRX1Xb5nR5CcIDnLKoq.jpg",
                "genre_ids": [
                    18,
                    53,
                    27
                ],
                "id": 44214,
                "original_language": "en",
                "original_title": "Black Swan",
                "overview": "The story of Nina, a ballerina in a New York City ballet company whose life, like all those in her profession, is completely consumed with dance. She lives with her retired ballerina mother Erica who zealously supports her daughter's professional ambition. When artistic director Thomas Leroy decides to replace prima ballerina Beth MacIntyre for the opening production of their new season, Swan Lake, Nina is his first choice.",
                "popularity": 7.3213,
                "poster_path": "/viWheBd44bouiLCHgNMvahLThqx.jpg",
                "release_date": "2010-12-03",
                "title": "Black Swan",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 15010,
                "character": "Corps De Ballet",
                "credit_id": "66de30c9e8403f84127881de",
                "order": 36
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Laura Bowman Goldstein"
        ],
        "biography": "Laura Bowman Goldstein joined Philadelphia Ballet (formerly Pennsylvania Ballet) under the artistic direction of Roy Kaiser, in August of 2001. Prior to retiring from the stage in 2016, her fifteen-season tenure afforded her the opportunity to work with the current Ruth & A. Morris Williams, Jr. Artistic Director Angel Corella. Ms. Bowman’s versatility afforded her opportunities to perform featured roles in both classical and contemporary works; including those by notable choreographers Angel Corella, George Balanchine, William Forsythe, Jerome Robbins, Jiri Kylian, Christopher Wheeldon, Paul Taylor, and Matthew Neenan. In addition to her work with Philadelphia Ballet, Ms. Bowman performed with Carolina Ballet and BalletX, and in 2010, was cast in the Academy Award-nominated film Black Swan. She has performed in the International Ballet Festival of Miami, the Edinburgh Festival, Jacob’s Pillow Dance Festival, and the Vail International Dance Festival.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "https://philadelphiaballet.org/faculty/laura-bowman-goldstein/",
        "id": 4931738,
        "imdb_id": "nm4188931",
        "known_for_department": "Acting",
        "name": "Laura Bowman",
        "place_of_birth": "Raleigh, North Carolina, USA",
        "popularity": 0.0143,
        "profile_path": "/fSrcEOLa4bfeS1FADYEjVbOGOzx.jpg"
    }
}