{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/reqscfk2KrWSDPKLMY303nwNgTw.jpg",
                "genre_ids": [
                    28,
                    80,
                    53
                ],
                "id": 5916,
                "original_language": "en",
                "original_title": "The Getaway",
                "overview": "A recently released ex-convict and his loyal wife go on the run after a heist goes wrong.",
                "popularity": 3.4173,
                "poster_path": "/8SvnGUJsr16zUJ2CN7ONX1ZWtZ8.jpg",
                "release_date": "1972-12-13",
                "title": "The Getaway",
                "video": false,
                "vote_average": 7.12,
                "vote_count": 606,
                "character": "Fran Clinton",
                "credit_id": "52fe442dc3a36847f8086d0f",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/y7pnEmBotaowRY0o8V33r4JuRNS.jpg",
                "genre_ids": [
                    18
                ],
                "id": 26617,
                "original_language": "en",
                "original_title": "Five Easy Pieces",
                "overview": "A drop-out from upper-class America picks up work along the way on oil-rigs when his life isn't spent in a squalid succession of bars, motels, and other points of interest.",
                "popularity": 2.0137,
                "poster_path": "/xGLkuMWigSPLBvWiENSMlVq56iE.jpg",
                "release_date": "1970-09-12",
                "title": "Five Easy Pieces",
                "video": false,
                "vote_average": 7.123,
                "vote_count": 551,
                "character": "Betty",
                "credit_id": "52fe450ec3a368484e046063",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Sally Ann Struthers",
            "Sally Anne Struthers",
            "سالی استروتهرس"
        ],
        "biography": "Cute as a button and with a petite, porcelain prettiness and vulnerability that endeared her to the American public, Sally Struthers nabbed a series role in the early 1970s and became a solid part of TV history as a member of a dysfunctional family quartet in the milestone sitcom, \"All in the Family\" (1971). She was born Sally Ann Struthers on July 28, 1948, in Portland, Oregon and raised there, pursuing an acting career following high school. Relocating to Los Angeles, she trained at the Pasadena Playhouse College of Theatre Arts and earned a scholarship as its \"most promising student\". She performed briefly in regional stock plays until finding her break as both a commercial actress and dancer on TV. She appeared as a regular on such variety shows as \"The Smothers Brothers Comedy Hour\" (1967) and \"The Tim Conway Comedy Hour\" (1970) and showed starlet promise in films, as well as offering ditsy support in the Jack Nicholson starrer, Five Easy Pieces (1970), and the chase film, The Getaway (1972), top-lining Steve McQueen and Ali MacGraw. And, then came \"All in the Family\" (1971). Also starring Carroll O'Connor, Jean Stapleton and Rob Reiner, Struthers went on to win two supporting Emmy Awards as Kewpie-doll \"Gloria Bunker Stivic\". She and Rob Reiner left the show after seven seasons, both eager to grow. While Rob Reiner became a noted director, Sally made her Broadway debut in \"Wally's Cafe\" in 1981, and returned, four years later, with a gender-bending version of \"The Odd Couple\" as neat-freak \"Florence\" opposite Rita Moreno's slovenly \"Olive\". In addition, she found work in topical mini-series drama with Aloha Means Goodbye (1974) (TV), Hey, I'm Alive (1975) (TV), My Husband Is Missing (1978) (TV), ...And Your Name Is Jonah (1979) (TV), A Gun in the House (1981) (TV), to name a few. But without a hit show as collateral, offers started drying up. Sally returned to the TV series fold in the early 1980s spinning off her \"Gloria\" character with the self-titled sitcom, \"Gloria\" (1982), but the ensemble formula that worked so well for her before was missing here and the show died in its freshman year. To compensate, however, Sally's baby-doll voice worked extremely well for her in cartoons. She remained active off-camera, providing little girl voices for Saturday morning entertainment, notably her teenage \"Pebbles Flintstone\" character. Other voice-over work included \"TaleSpin\" (1990), as \"Rebecca 'Becky' Cunningham\", and puppeteer Jim Henson's creative prehistoric sitcom, \"Dinosaurs\" (1991), playing dino-daughter \"Charlene Sinclair\". IMDb Mini Biography By: Gary Brumburgh / gr-home@pacbell.net",
        "birthday": "1947-07-28",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 49352,
        "imdb_id": "nm0001783",
        "known_for_department": "Acting",
        "name": "Sally Struthers",
        "place_of_birth": "Portland, Oregon, USA",
        "popularity": 1.088,
        "profile_path": "/9EeuFTEUG1mfPiZwNw38U3ovUa.jpg"
    }
}