{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lAaAtQ5b8iX9JeG6QUq4RM1paKD.jpg",
                "genre_ids": [
                    18
                ],
                "id": 10435,
                "original_language": "en",
                "original_title": "Chaplin",
                "overview": "An aged Charlie Chaplin narrates his life to his autobiography's editor, including his rise to wealth and comedic fame from poverty, his turbulent personal life and his run-ins with the FBI.",
                "popularity": 2.9824,
                "poster_path": "/Aeltt5tl02zrEj4GoMynHc94lWG.jpg",
                "release_date": "1992-12-17",
                "title": "Chaplin",
                "video": false,
                "vote_average": 7.438,
                "vote_count": 1131,
                "character": "Charles Chaplin Jr",
                "credit_id": "642d50a454a8ac0b348484c8",
                "order": 127
            },
            {
                "adult": false,
                "backdrop_path": "/5m5VhSN1lTk3egtrNzqNv5nwMuG.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 451,
                "original_language": "en",
                "original_title": "Leaving Las Vegas",
                "overview": "Ben Sanderson, an alcoholic Hollywood screenwriter who lost everything because of his drinking, arrives in Las Vegas to drink himself to death. There, he meets and forms an uneasy friendship and non-interference pact with prostitute Sera.",
                "popularity": 6.0241,
                "poster_path": "/wTrFpGe3U65kXTldIUxuM2hmOAK.jpg",
                "release_date": "1995-10-27",
                "title": "Leaving Las Vegas",
                "video": false,
                "vote_average": 7.25,
                "vote_count": 1534,
                "character": "College Boy 1",
                "credit_id": "5b6ce1830e0a267eeb14e134",
                "order": 36
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Michael Gourjian",
            "Michael Andranik Goorjian",
            "Michael Goorjian"
        ],
        "biography": "Michael A. Goorjian (born February 4, 1971; San Francisco) is an American filmmaker, writer and actor. Goorjian won an Emmy Award for Outstanding Supporting Actor in a Miniseries or Special for his role as David Goodson in the television film David's Mother (1994). He is also known for his role as Justin, Neve Campbell’s love interest on the series Party of Five (1994–2000), as well as Heroin Bob in the film SLC Punk! (1998) and its sequel, Punk's Dead (2016). As a director, Goorjian achieved recognition for his first major independent film, Illusion (2004), which he wrote, directed and starred in alongside Hollywood legend Kirk Douglas.\n\nGoorjian was born and raised in the San Francisco Bay Area. His father, Peter, is Armenian, with his paternal grandparents being survivors of the Armenian genocide; his mother, Sarah, is of Scottish-American descent. Goorjian grew up in Oakland, California, and attended Bishop O'Dowd High School, which had a strong drama program. At the age of 14, he decided to audition for a local theatre company, thinking it was a ‘cool way’ to skip class; after successfully landing the lead role in a 'not-so-cool' play called Computer Crazy, Goorjian soon found out that the rest of the cast were all senior citizens and that he would have to perform the play at his own junior high school. Despite this seemingly rather humiliating experience, Goorjian stuck with acting, eventually training at UCLA’s School of Theatre, Film and Television. Goorjian’s first big Hollywood break came as a dancer when, in 1992, he was cast as ‘Skittery’ in the Disney film Newsies (starring Christian Bale and Robert Duvall). What followed were roles in numerous subsequent films, including Chaplin (with Robert Downey Jr.), Forever Young (with Mel Gibson), the Oscar-nominated Leaving Las Vegas, Hard Rain (with Morgan Freeman and Christian Slater), SLC Punk! (with Devon Sawa), The Invisibles (with Portia de Rossi), Broken (with Heather Graham) and Conversations with God.\n\nGoorjian made his first real foray into directing with the mock-documentary Oakland Underground, a comedy about an underground occult music scene in Oakland, CA. From there, Goorjian made Illusion with Kirk Douglas, which was released theatrically in 2006 after racking up over a dozen festival awards, including Best Screenplay at The Hampton’s International Film Festival, Best Feature at the Lake Tahoe International Film Festival and The Audience Award at the Sonoma International Film Festival. With Illusion Goorjian was critically lauded for his ability to blend great filmmaking with philosophical depth. Soon after Illusion, Goorjian began collaborating with the publishing company Hay House to produce and direct a number of films including the documentary You Can Heal Your Life (2007), starring metaphysical author and teacher, Louise L. Hay and The Shift, starring author Dr. Wayne Dyer, along with Michael DeLuise and Portia de Rossi. His most recent work with Hay House is an original film anthology called Tales of Everyday Magic, which explores meaningful philosophical ideas through intimate character-driven stories.",
        "birthday": "1971-02-04",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 49424,
        "imdb_id": "nm0329640",
        "known_for_department": "Directing",
        "name": "Michael A. Goorjian",
        "place_of_birth": "San Francisco, California, USA",
        "popularity": 0.2048,
        "profile_path": "/3ReUquoMVEf01eu3xLWVSxhHHvr.jpg"
    }
}