{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/y2FNZLHynsevBnVTocGW6c3pQpr.jpg",
                "genre_ids": [
                    18
                ],
                "id": 422,
                "original_language": "it",
                "original_title": "8½",
                "overview": "Guido Anselmi, a film director, finds himself creatively barren at the peak of his career. Urged by his doctors to rest, Anselmi heads for a luxurious resort, but a sorry group gathers—his producer, staff, actors, wife, mistress, and relatives—each one begging him to get on with the show. In retreat from their dependency, he fantasizes about past women and dreams of his childhood.",
                "popularity": 4.83,
                "poster_path": "/t8pFvll3cFrn5NmqZz2FawqIwPe.jpg",
                "release_date": "1963-02-14",
                "title": "8½",
                "video": false,
                "vote_average": 8.1,
                "vote_count": 2411,
                "character": "Claudia",
                "credit_id": "52fe4241c3a36847f80100fb",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/myikoqu8Z2gtE7TaBgk9r6fB9MF.jpg",
                "genre_ids": [
                    18
                ],
                "id": 1040,
                "original_language": "it",
                "original_title": "Il gattopardo",
                "overview": "As Garibaldi's troops begin the unification of Italy in the 1860s, an aristocratic Sicilian family grudgingly adapts to the sweeping social changes undermining their way of life. Proud but pragmatic Prince Don Fabrizio Salina allows his war hero nephew, Tancredi, to marry Angelica, the beautiful daughter of gauche, bourgeois Don Calogero, in order to maintain the family's accustomed level of comfort and political clout.",
                "popularity": 3.1711,
                "poster_path": "/riSUxwoK3xjkOgy6YJSvPhi7cO6.jpg",
                "release_date": "1963-03-27",
                "title": "The Leopard",
                "video": false,
                "vote_average": 7.751,
                "vote_count": 886,
                "character": "Angelica Sedara / Bastiana",
                "credit_id": "52fe42e5c3a36847f802b1bb",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/sU6ENo313Dh36Q7UK2vw72WBKJ1.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 8422,
                "original_language": "it",
                "original_title": "Rocco e i suoi fratelli",
                "overview": "When a impoverished widow’s family moves to the big city, two of her five sons become romantic rivals with deadly results.",
                "popularity": 1.9765,
                "poster_path": "/pngL8AraChIDOiWnKF2o3S9kJzJ.jpg",
                "release_date": "1960-10-07",
                "title": "Rocco and His Brothers",
                "video": false,
                "vote_average": 8.014,
                "vote_count": 627,
                "character": "Ginetta",
                "credit_id": "52fe44a7c3a36847f80a2625",
                "order": 18
            },
            {
                "adult": false,
                "backdrop_path": "/ryoWP1kvNcwPif6uNbuZwQfrJPy.jpg",
                "genre_ids": [
                    35,
                    80
                ],
                "id": 24382,
                "original_language": "it",
                "original_title": "I soliti ignoti",
                "overview": "Best friends Peppe and Mario are thieves, but they're not very good at it. Still, Peppe thinks that he's finally devised a master heist that will make them rich. With the help of some fellow criminals, he plans to dig a tunnel from a rented apartment to the pawnshop next door, where they can rob the safe. But his plan is far from foolproof, and the fact that no one in the group has any experience digging tunnels proves to be the least of their problems.",
                "popularity": 1.6895,
                "poster_path": "/f5OxD8Nl0pR3DcYHtYhHRfpsmjl.jpg",
                "release_date": "1958-07-26",
                "title": "Big Deal on Madonna Street",
                "video": false,
                "vote_average": 8.099,
                "vote_count": 740,
                "character": "Carmelina",
                "credit_id": "52fe4493c3a368484e02a8dd",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/46iMqI1qzAtnXJxGRNCFwYNYqOo.jpg",
                "genre_ids": [
                    18,
                    12
                ],
                "id": 9343,
                "original_language": "de",
                "original_title": "Fitzcarraldo",
                "overview": "Fitzcarraldo is a dreamer who plans to build an opera house in Iquitos, in the Peruvian Amazon, so, in order to finance his project, he embarks on an epic adventure to collect rubber, a very profitable product, in a remote and unexplored region of the rainforest.",
                "popularity": 3.319,
                "poster_path": "/oBCnYEKcg1rMhr5JjDnrRpilvDd.jpg",
                "release_date": "1982-03-02",
                "title": "Fitzcarraldo",
                "video": false,
                "vote_average": 7.624,
                "vote_count": 820,
                "character": "Molly",
                "credit_id": "52fe44eac3a36847f80b1a21",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/p1OFxsff2t8bxQC45TPfyo0ZBfU.jpg",
                "genre_ids": [
                    18,
                    37
                ],
                "id": 335,
                "original_language": "it",
                "original_title": "C'era una volta il West",
                "overview": "As the railroad builders advance unstoppably through the Arizona desert on their way to the sea, Jill arrives in the small town of Flagstone with the intention of starting a new life.",
                "popularity": 8.2505,
                "poster_path": "/qbYgqOczabWNn2XKwgMtVrntD6P.jpg",
                "release_date": "1968-12-21",
                "title": "Once Upon a Time in the West",
                "video": false,
                "vote_average": 8.283,
                "vote_count": 4620,
                "character": "Jill",
                "credit_id": "5eebc1c6c5ada50032d53b1b",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "클라우디아 카르디날레",
            "Клаудия Кардинале",
            "كلوديا كاردينالي",
            "کلودیا کاردیناله"
        ],
        "biography": "Claude Joséphine Rose \"Claudia\" Cardinale (born 15 April 1938) is an Italian actress. She has starred in European films in the 1960s and 1970s, acting in Italian, French, and English.\n\nBorn and raised in La Goulette, a neighbourhood of Tunis, Cardinale won the \"Most Beautiful Italian Girl in Tunisia\" competition in 1957, the prize being a trip to Italy, which quickly led to film contracts, due above all to the involvement of Franco Cristaldi, who acted as her mentor for a number of years and later married her. After making her debut in a minor role with the egyptian star Omar Sharif in Goha (1958), Cardinale became one of the best-known actresses in Italy with roles in films such as Rocco and His Brothers (1960), Girl with a Suitcase (1961), Cartouche (1962), The Leopard (1963), and Fellini's 8½ (1963).\n\nFrom 1963, Cardinale appeared in The Pink Panther opposite David Niven. She went on to appear in the Hollywood films Blindfold (1965), Lost Command (1966), The Professionals (1966), Don't Make Waves (1967) with Tony Curtis, The Hell with Heroes (1968), and the Sergio Leone Western Once Upon a Time in the West (1968), a joint US-Italian production, in which she was praised for her role as a former prostitute opposite Jason Robards, Charles Bronson, and Henry Fonda.\n\nJaded with the Hollywood film industry and not wanting to become a cliché, Cardinale returned to Italian and French cinema, and garnered the David di Donatello for Best Actress award for her roles in Il giorno della civetta (1968) and as a prostitute alongside Alberto Sordi in A Girl in Australia (1971). In 1974, Cardinale met director Pasquale Squitieri, who would become her partner, and she frequently featured in his films, including I guappi (1974), Corleone (1978) and Claretta (1984), the last of which won her the Nastro d'Argento Award for Best Actress. In 1982, she starred in Werner Herzog's Fitzcarraldo as the love interest of Klaus Kinski, who raises the funds to buy a steamship in Peru. In 2010, Cardinale received the Best Actress Award at the 47th Antalya \"Golden Orange\" International Film Festival for her performance as an elderly Italian woman who takes in a young Turkish exchange student in Signora Enrica.\n\nOutspoken on women's rights causes over the years, Cardinale has been a UNESCO goodwill ambassador for the Defense of Women's Rights since March 2000. In February 2011, the Los Angeles Times Magazine named Cardinale among the 50 most beautiful women in film history.\n\nDescription above from the Wikipedia article Claudia Cardinale, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1938-04-15",
        "deathday": null,
        "gender": 1,
        "homepage": "http://official-claudiacardinale.com/index.php",
        "id": 4959,
        "imdb_id": "nm0001012",
        "known_for_department": "Acting",
        "name": "Claudia Cardinale",
        "place_of_birth": "Tunis, Tunisia",
        "popularity": 1.138,
        "profile_path": "/m7iyqSEMHI1qmKx7ml4HmVyG0BC.jpg"
    }
}