{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uVlUu174iiKhsUGqnOSy46eIIMU.jpg",
                "genre_ids": [
                    18,
                    10749,
                    14
                ],
                "id": 402431,
                "original_language": "en",
                "original_title": "Wicked",
                "overview": "In the land of Oz, ostracized and misunderstood green-skinned Elphaba is forced to share a room with the popular aristocrat Glinda at Shiz University, and the two's unlikely friendship is tested as they begin to fulfill their respective destinies as Glinda the Good and the Wicked Witch of the West.",
                "popularity": 16.5388,
                "poster_path": "/2E1x1qcHqGZcYuYi4PzVZjzg8IV.jpg",
                "release_date": "2024-11-20",
                "title": "Wicked",
                "video": false,
                "vote_average": 6.932,
                "vote_count": 2408,
                "character": "Dancer",
                "credit_id": "6775b3eedd179c5b359274ff",
                "order": 239
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Lukas McFarlane is a Creative/Choreographer from Canada. His career was skyrocketed when he was crowned the UK and Ireland’s best dance act, winning Sky1’s hit TV show, Got to Dance at just 19 years old. Even prior to this he had worked with such artists such as Carly Rae Jepson, Taylor Swift and Celine Dion early on in his career. Lukas’s passion however, always lied in creation and he is now a well-known and widely respected Creative/Choreographer. He works consistently in tv and film on projects like The X Factor, ITV’s The Voice and Netflix’s new show Dance Monsters, and most recently worked closely with actress Julia Garner on the new Paramount film Apartment 7A  Lukas has also choreographed for Strictly Come Dancing, being the first to introduce Contemporary on the show in 16 seasons. He has worked with global brands such as GAP, LYNK&CO and UNIQLO and for international artists such as James Arthur, Pink, Vance Joy and Rita Ora. He worked on So You Think You Can Dance in 4 countries including the USA and is also well versed in creating live shows to audiences of more than 60 thousand at events like British Summer Time Hyde Park, Eurovision Song Contest, and The Queens Platinum Jubilee Celebration.\n\nLukas has also created for The West End as associate choreographer on the Sadler’s Wells and Universal Group production Message In A Bottle which he also currently stars in. He regularly shares his passion for teaching all over the world having taught in 5 of the 6 continents and is Founder and Creative Director of London based dance company UnTitled Dance Company who have performed their work to sold out audiences internationally. You can see Lukas onstage at New York City Centre from April 30th – May 20th in Message In A Bottle which is currently on a world tour.",
        "birthday": "1993-05-28",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.lukasmcfarlane.co.uk/",
        "id": 4959071,
        "imdb_id": null,
        "known_for_department": "Crew",
        "name": "Lukas McFarlane",
        "place_of_birth": "Calgary, Alberta, Canada",
        "popularity": 0.0214,
        "profile_path": "/nY61W9rxN3QK80W41ixgEgA8HKP.jpg"
    }
}