{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qg0OLFasb1kNrAhKjqh4zTW37pS.jpg",
                "genre_ids": [
                    18,
                    878,
                    53
                ],
                "id": 6479,
                "original_language": "en",
                "original_title": "I Am Legend",
                "overview": "Robert Neville is a scientist who was unable to stop the spread of the terrible virus that was incurable and man-made. Immune, Neville is now the last human survivor in what is left of New York City and perhaps the world. For three years, Neville has faithfully sent out daily radio messages, desperate to find any other survivors who might be out there. But he is not alone.",
                "popularity": 10.4486,
                "poster_path": "/iPDkaSdKk2jRLTM65UOEoKtsIZ8.jpg",
                "release_date": "2007-12-12",
                "title": "I Am Legend",
                "video": false,
                "vote_average": 7.212,
                "vote_count": 16268,
                "character": "Marley Neville",
                "credit_id": "52fe4455c3a36847f808fc25",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Camille Reign Smith",
            "WILLOW",
            "ویلو اسمیت"
        ],
        "biography": "Willow Camille Reign Smith (born October 31, 2000) is an American child actress and singer who is the daughter of Will Smith and Jada Pinkett Smith, and the younger sister of Jaden Smith. She made her acting debut in 2007 in the film I Am Legend and later appeared in Kit Kittredge: An American Girl alongside Abigail Breslin. She received a Young Artist Award for her performance.\n\nApart from her acting she launched a music career in the fall of 2010 with the release of her single \"Whip My Hair\" and signing to Jay-Z's record label Roc Nation. The single peaked at #11 on the Billboard Hot 100.\n\nDescription above from the Wikipedia article Willow Smith, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "2000-10-31",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 49920,
        "imdb_id": "nm2405238",
        "known_for_department": "Acting",
        "name": "Willow Smith",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.5139,
        "profile_path": "/gXZnwJlPJet90CtW9BbI3JkXpRn.jpg"
    }
}