{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xmtmZc5aylqDMRKYlU8pmsgG0HF.jpg",
                "genre_ids": [
                    27,
                    18
                ],
                "id": 11075,
                "original_language": "ja",
                "original_title": "オーディション",
                "overview": "Seven years after the death of his wife, widower Shigeharu seeks advice on how to find a new wife from a colleague. Taking advantage of their position as a film company, they stage an audition. Interviewing a series of women, Shigeharu is enchanted by the quiet Asami. But soon things take a twisted turn as Asami isn’t what she seems to be.",
                "popularity": 4.4433,
                "poster_path": "/zwGaUMm0wAqi0wkO7LJDlwoA5LP.jpg",
                "release_date": "2000-03-03",
                "title": "Audition",
                "video": false,
                "vote_average": 7.124,
                "vote_count": 1649,
                "character": "Shigeharu Aoyama",
                "credit_id": "52fe43f29251416c75023d6f",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Hideki Ishibashi",
            "Ryou Ishabashi",
            "Ryo Ishabashi",
            "Ryô Ishibashi",
            "石橋凌",
            "石桥凌"
        ],
        "biography": "​From Wikipedia, the free encyclopedia.  \n\nRyo Ishibashi (born July 20, 1956) is a Japanese actor and international celebrity. He is known around the world for his roles in the classic Japanese Horror films Suicide Club and Audition. He is also recognized in America for his role as Nakagawa in The Grudge and The Grudge 2.\n\nIshibashi was born in Kurume, Fukuoka, Kyūshū, Japan. He started his career by starting his own band called the ARB (Alexander Ragtime Band) in 1977. The band made their debut in 1978, and made over a dozen albums until they broke up in 1990. Recently, Ishibashi has resumed his musical activity and re-formed ARB with an album, Real Life in 1998. In 1986, Ishibashi made his movie debut in the film A-Hômansu in which ARB's 13th single \"After 45\" was used as its theme song. Ryo Ishibashi has been concentrating on his acting career, and has appeared in several movies outside his native country Japan, and became an internationally recognized celebrity.\n\nHe won the award for Best Actor at the 11th Yokohama Film Festival for A Sign Days.\n\nIshibashi has been married to Mieko Harada since 1987 and has three children.\n\nDescription above from the Wikipedia article Ryo Ishibashi, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1956-07-20",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 4994,
        "imdb_id": "nm0410903",
        "known_for_department": "Acting",
        "name": "Ryo Ishibashi",
        "place_of_birth": "Kurume, Fukuoka, Kyushu, Japan",
        "popularity": 1.0263,
        "profile_path": "/1q8noUaI5E0ykjLdXRZcn7U79LN.jpg"
    }
}