{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gs9Z5cPauxH9Gml2kO6oUYwkTgK.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 2013,
                "original_language": "fr",
                "original_title": "Le Scaphandre et le Papillon",
                "overview": "The true story of Elle France editor Jean-Dominique Bauby, who, in 1995 at the age of 43, suffered a stroke that paralyzed his entire body, except his left eye. Using that eye to blink out his memoir, Bauby eloquently described the aspects of his interior world, from the psychological torment of being trapped inside his body to his imagined stories from lands he'd only visited in his mind.",
                "popularity": 2.5882,
                "poster_path": "/3MJUo4bCPai5r9zrw7nTS8sVzQ7.jpg",
                "release_date": "2007-05-23",
                "title": "The Diving Bell and the Butterfly",
                "video": false,
                "vote_average": 7.575,
                "vote_count": 1213,
                "character": "Doctor Cocheton",
                "credit_id": "52fe432cc3a36847f803fdf5",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/d9ISNkCasZmkvL7YFw2J4ddQv3j.jpg",
                "genre_ids": [
                    28,
                    53
                ],
                "id": 8681,
                "original_language": "en",
                "original_title": "Taken",
                "overview": "Bryan Mills, a former government operative, is trying to reconnect with his teenage daughter Kim. After reluctantly agreeing with his ex-wife to let Kim go to Paris on vacation with a friend, his worst nightmare comes true. While on the phone with his daughter shortly after she arrives in Paris, she and her friend are abducted by a gang of human traffickers. Working against the clock, Bryan relies on his extensive training and skills to track down the ruthless gang that abducted her and launch a one-man war to rescue his daughter.",
                "popularity": 14.1291,
                "poster_path": "/y5Va1WXDX6nZElVirPrGxf6w99B.jpg",
                "release_date": "2008-02-18",
                "title": "Taken",
                "video": false,
                "vote_average": 7.398,
                "vote_count": 11655,
                "character": "Patrice Saint-Clair",
                "credit_id": "52fe44b4c3a36847f80a54d3",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/pkDBwOWUjIE1hycR4epPGgfIX4.jpg",
                "genre_ids": [
                    18,
                    35,
                    10749
                ],
                "id": 8424,
                "original_language": "fr",
                "original_title": "Jeux d'enfants",
                "overview": "As adults, best friends Julien and Sophie continue the odd game they started as children -- a fearless competition to outdo one another with daring and outrageous stunts. While they often act out to relieve one another's pain, their game might be a way to avoid the fact that they are truly meant for one another.",
                "popularity": 1.6924,
                "poster_path": "/vvjC5LSMANKvGGDHjIWj1YomPdN.jpg",
                "release_date": "2003-09-17",
                "title": "Love Me If You Dare",
                "video": false,
                "vote_average": 7.233,
                "vote_count": 1826,
                "character": "Julien's Father",
                "credit_id": "54a42ac3c3a368764f00efe0",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Gerard Watkins",
            "Gerald Watkins"
        ],
        "biography": "Gérard Watkins is an English-French actor, playwright, director, and songwriter. As a stage actor he has performed in over forty productions in Paris with such directors as Véronique Bellegarde, Julie Beres, Jean-Claude Buchard, Elizabeth Chailloux, Michel Didym, André Engel, Frederic Fisbach, Marc François, Daniel Jeanneteau, Philipe Lanton, Jean-Louis Martinelli, Lars Noren, Claude Régy, Yann Ritsema, Bernard Sobel, Viviane Theophilides, and Jean-Pierre Vincent. Among his critically acclaimed performances are Ian in Sarah Kane's Blasted, Edmond in King Lear, and Rosalind in As you Like it. In the Cinema he is perhaps best known for his role in the 2009 film Taken as Patrice Saint Clair, the sex trafficking kingpin that runs the operation that kidnapped the protagonist's 17-year old daughter, but he has also performed with directors as Julie Lopez Curval, Jérome Salle, Yann Samuel, Julian Schnabel, Hugo Santiago, and Peter Watkins. Since 1994 he has directed his own theatre company, the Perdita Ensemble, where he has staged all of his plays, the Secret Capital, Follow Me, The Tower, In the Faraway Forest, Icone, Identity, Lost, and I Don't Remember Very Well.",
        "birthday": "1965-07-04",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.aartis.fr/artiste.cfm/26039_115_2-G%C3%A9rard_Watkins.html",
        "id": 49947,
        "imdb_id": "nm0914313",
        "known_for_department": "Acting",
        "name": "Gérard Watkins",
        "place_of_birth": "London, England, UK",
        "popularity": 0.1225,
        "profile_path": "/dGesmXnqoYn2yaCr5acMA2Ec9z.jpg"
    }
}