{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bWN6ZBr6nJNEuHigL9fQWhZ78hd.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 9918,
                "original_language": "en",
                "original_title": "Glory Road",
                "overview": "In 1966, Texas Western coach Don Haskins led the first all-black starting line-up for a college basketball team to the NCAA national championship.",
                "popularity": 5.3918,
                "poster_path": "/bGRSV5tStxDNPRLCewnOeeiZzrY.jpg",
                "release_date": "2006-01-13",
                "title": "Glory Road",
                "video": false,
                "vote_average": 7.428,
                "vote_count": 753,
                "character": "Tina",
                "credit_id": "5f920c53b0cd20003680521b",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Tatyana M. Ali",
            "Tatyana Marisol Ali"
        ],
        "biography": "Tatyana Marisol Ali (born January 24, 1979) is an American actress and singer. She's best known for her role as Ashley Banks on the sitcom The Fresh Prince of Bel Air.\n\nAt the age of four she started singing and got a taste of fame when she begged her mother to take her to an audition for Sesame Street. In 1985, as a 6-year-old, she began her acting career as a regular performer on the PBS children's educational program Sesame Street.\n\nShe went on to perform in many productions in her native city, New York, including the Broadway show Fences--with James Earl Jones and, later, Billy Dee Williams--and the off-Broadway show Orfeo del Campo. When she was seven, she appeared on Star Search and won twice, receiving a four-star rating when she appeared for a second time.\n\nAt age 11, she moved from New York to Los Angeles to establish her career and not long afterwords landed her breakthrough role as Ashley Banks, Will Smith's character's cousin, on the sitcom The Fresh Prince of Bel-Air (1990-1996).\n\nWhile filming The Fresh Prince, she also had side projects, including guest roles in television shows such as The Cosby Show (1984), The All New Mickey Mouse Club (1989) (aka The Mickey Mouse Club), Kyno's Storytime (1992), Are You Afraid of the Dark? (1990), and Foster's Field Trip (1994).\n\nHer vocal talent was featured on several episodes of Fresh Prince in later seasons, prompting the show's star Will Smith to ask her if she would seriously consider pursuing a musical career. She ultimately decided, for the time being, to continue to concentrate on her acting career. In the series' final season, however, she performed several songs, and she began to be cleaned for her musical debut, the culmination of which was her debut album Kiss The Sky in 1998. It was certified gold in early 1999, only months after its release. \"Boy You Knock Me Out\" featuring Will Smith—which peaked at No. 3 and is her biggest hit to date.\n\nShe made an appearance on Smith's album Willennium on the track \"Who Am I\" with MC Lyte. In early 2008, she performed on the song \"Yes We Can\", a will.i.am project supporting Barack Obama's presidential campaign. She also appeared in the subsequent music video, which garnered coverage on the \"What the Buzz\" segment of ABC's World News Now. In January 2014, she released an EP titled Hello.\n\nApart from her musical career, she continued to land roles in films such as The Brothers, Glory Road, and Nora's Hair Salon (and its sequel), among others. From 2009 to 2010 she produced and starred in the BET web series Buppies.\n\nShe was on recurring status on the CBS soap opera The Young and the Restless as Roxanne from 2007 to 2013. She starred in the TV One original series Love That Girl! as Tyana (whose name was derived from Ali's given name). In 2013, she co-starred as Maya in the BET comedy Second Generation Wayans, alongside Craig Wayans and Damien Dante Wayans.\n\nIn 2011, she received the Living Legacy Award from the Caribbean Heritage Organization in Los Angeles.",
        "birthday": "1979-01-24",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 4996,
        "imdb_id": "nm0004700",
        "known_for_department": "Acting",
        "name": "Tatyana Ali",
        "place_of_birth": "Long Island, New York, USA",
        "popularity": 0.8578,
        "profile_path": "/wlCYid92sB1dffkxW271NEqrYOB.jpg"
    }
}