{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bodTQ7K68AopK2uQumsrSVT9g4A.jpg",
                "genre_ids": [
                    35,
                    10752
                ],
                "id": 8290,
                "original_language": "fr",
                "original_title": "La Grande Vadrouille",
                "overview": "During World War II, two French civilians and a downed British Bomber Crew set out from Paris to cross the demarcation line between Nazi-occupied Northern France and the South. From there they will be able to escape to England. First, they must avoid German troops – and the consequences of their own blunders.",
                "popularity": 2.3452,
                "poster_path": "/91l4Sf3WJwrb0tSVPsOqnBXG8E6.jpg",
                "release_date": "1966-12-08",
                "title": "Don't Look Now... We're Being Shot At!",
                "video": false,
                "vote_average": 7.934,
                "vote_count": 1402,
                "character": "Major Achbach",
                "credit_id": "52fe449dc3a36847f80a02b7",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Benno Sterzenbach (born 3 March 1916 Osnabrück - died 13 September 1985 Feldafing) was a German cinema and theatre actor and director.\n\nHis first major role on stage was Götz von Berlichingen at which he played next to Ellen Schwiers as Adelheid at the Jagsthausen festival. On television, he is mostly known for his roles in filmed theatrical adaptations: Der Richter und sein Henker (1957) by Friedrich Dürrenmatt, Der Schlaf der Gerechten (1962) by Albrecht Goes and Mirandolina (1963) by Carlo Goldoni.\n\nSuspected of espionage due to his editorial relations, he was arrested by the Gestapo in 1941, and imprisoned for a month, during which time he protested his innocence. He was eventually freed after his case was expedited. This episode was repeated in a number of his plays.\n\nWith Paths in Twilight in 1948, he made his cinematic debut under the direction of Gustav Fröhlich. In 1960, he was in one of the first films by Edgar Wallace after the war: Der Rächer. In the same year, he was in Es ist soweit. In 1966, he acted alongside Heinz Reincke in one of the first German colour television series, Adrian der Tulpendieb.\n\nAfter acting in 1962 in Max the Pickpocket with Heinz Rühmann, in 1964 he played the role of a doctor in Flug in Gefahr, a film which started a long series of films based on plane crashes.\n\nBenno Sterzenbach found most success in the role of General Winston Woodrov Wamsler in Raumpatrouille – Die phantastischen Abenteuer des Raumschiffes Orion. After this, he was invited to series such as Die fünfte Kolonne, Derrick and The Old Fox.\n\nIn France, he is best known for his role as Major Achbach in La Grande Vadrouille with Louis de Funès and Bourvil.\n\nBenno Sterzenbach has also written a number of books.\n\nSource: Article \"Benno Sterzenbach\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1916-03-03",
        "deathday": "1985-09-13",
        "gender": 2,
        "homepage": null,
        "id": 50089,
        "imdb_id": "nm0828044",
        "known_for_department": "Acting",
        "name": "Benno Sterzenbach",
        "place_of_birth": "Osnabrück, Germany",
        "popularity": 0.2199,
        "profile_path": "/26kO0pflfWcDC77FVwdtW4HmYn3.jpg"
    }
}