{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2cBCFvMDLZowXKvMaCGot5dmHUz.jpg",
                "genre_ids": [
                    99,
                    80,
                    36
                ],
                "id": 22074,
                "original_language": "en",
                "original_title": "Capitalism: A Love Story",
                "overview": "Michael Moore comes home to the issue he's been examining throughout his career: the disastrous impact of corporate dominance on the everyday lives of Americans (and by default, the rest of the world).",
                "popularity": 2.9629,
                "poster_path": "/zJBkIPakBXdu3cEgGqKCPHUNXVE.jpg",
                "release_date": "2009-09-06",
                "title": "Capitalism: A Love Story",
                "video": false,
                "vote_average": 7.091,
                "vote_count": 545,
                "character": "Self",
                "credit_id": "52fe4432c3a368484e015299",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Elizabeth Ann Warren",
            "엘리자베스 워런",
            "Elizabeth Ann Herring"
        ],
        "biography": "Elizabeth Ann Warren (née Herring; born June 22, 1949) is an American politician and former law professor who is the senior United States senator from the state of Massachusetts, serving since 2013. A member of the Democratic Party and regarded as a progressive,[2] Warren has focused on consumer protection, equitable economic opportunity, and the social safety net while in the Senate. Warren was a candidate in the 2020 Democratic Party presidential primaries, ultimately finishing third after Joe Biden and Bernie Sanders.\n\nBorn and raised in Oklahoma, Warren is a graduate of the University of Houston and Rutgers Law School at Rutgers University–Newark and has taught law at several universities, including the University of Houston, the University of Texas at Austin, the University of Pennsylvania, and Harvard University. Warren has written 12 books and more than 100 articles.  Warren's first foray into public policy began in 1995, when she worked to oppose what eventually became a 2005 act restricting bankruptcy access for individuals. During the late 2000s, her national profile grew after her forceful public stances in favor of more stringent banking regulations after the 2008 financial crisis. She served as chair of the Congressional Oversight Panel of the Troubled Asset Relief Program, and proposed and established the Consumer Financial Protection Bureau, for which she served as the first special advisor under President Barack Obama.\n\nIn 2012, Warren defeated incumbent Republican Scott Brown and became the first female U.S. senator from Massachusetts. She was reelected by a wide margin in 2018, defeating Republican nominee Geoff Diehl. On February 9, 2019, Warren announced her candidacy in the 2020 United States presidential election. She was briefly considered the front-runner for the Democratic nomination in late 2019, but support for her campaign dwindled. She withdrew from the race on March 5, 2020, after Super Tuesday. She was reelected to a third Senate term in 2024 against Republican nominee John Deaton.\n\nDescription above from the Wikipedia article Elizabeth Warren, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1949-06-22",
        "deathday": null,
        "gender": 1,
        "homepage": "https://elizabethwarren.com",
        "id": 501362,
        "imdb_id": "nm2143891",
        "known_for_department": "Acting",
        "name": "Elizabeth Warren",
        "place_of_birth": "Oklahoma City, Oklahoma, USA",
        "popularity": 0.151,
        "profile_path": "/cyurT5D8YrO3D50kJKNBl6XBTV8.jpg"
    }
}