{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mshaKLtPUxcDBhzau6qiObEblhL.jpg",
                "genre_ids": [
                    12,
                    14,
                    28
                ],
                "id": 121,
                "original_language": "en",
                "original_title": "The Lord of the Rings: The Two Towers",
                "overview": "Frodo Baggins and the other members of the Fellowship continue on their sacred quest to destroy the One Ring--but on separate paths. Their destinies lie at two towers--Orthanc Tower in Isengard, where the corrupt wizard Saruman awaits, and Sauron's fortress at Barad-dur, deep within the dark lands of Mordor. Frodo and Sam are trekking to Mordor to destroy the One Ring of Power while Gimli, Legolas and Aragorn search for the orc-captured Merry and Pippin. All along, nefarious wizard Saruman awaits the Fellowship members at the Orthanc Tower in Isengard.",
                "popularity": 17.4636,
                "poster_path": "/5VTN0pR8gcqV3EPUHHfMGnJYN9L.jpg",
                "release_date": "2002-12-18",
                "title": "The Lord of the Rings: The Two Towers",
                "video": false,
                "vote_average": 8.409,
                "vote_count": 22912,
                "character": "Éowyn",
                "credit_id": "52fe421ac3a36847f80045c5",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/2u7zbn8EudG6kLlBzUYqP8RyFU4.jpg",
                "genre_ids": [
                    12,
                    14,
                    28
                ],
                "id": 122,
                "original_language": "en",
                "original_title": "The Lord of the Rings: The Return of the King",
                "overview": "As armies mass for a final battle that will decide the fate of the world--and powerful, ancient forces of Light and Dark compete to determine the outcome--one member of the Fellowship of the Ring is revealed as the noble heir to the throne of the Kings of Men. Yet, the sole hope for triumph over evil lies with a brave hobbit, Frodo, who, accompanied by his loyal friend Sam and the hideous, wretched Gollum, ventures deep into the very dark heart of Mordor on his seemingly impossible quest to destroy the Ring of Power.​",
                "popularity": 23.019,
                "poster_path": "/rCzpDGLbOoPwLjy3OAm5NUPOTrC.jpg",
                "release_date": "2003-12-17",
                "title": "The Lord of the Rings: The Return of the King",
                "video": false,
                "vote_average": 8.489,
                "vote_count": 25451,
                "character": "Éowyn",
                "credit_id": "52fe421bc3a36847f8004727",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/hsDyfAk2ml82IrpPC4AHvxvuTsn.jpg",
                "genre_ids": [
                    18,
                    36,
                    10752
                ],
                "id": 8741,
                "original_language": "en",
                "original_title": "The Thin Red Line",
                "overview": "The story of a group of men, an Army Rifle company called C-for-Charlie, who change, suffer, and ultimately make essential discoveries about themselves during the fierce World War II battle of Guadalcanal. It follows their journey, from the surprise of an unopposed landing, through the bloody and exhausting battles that follow, to the ultimate departure of those who survived.",
                "popularity": 5.6938,
                "poster_path": "/seMydAaoxQP6F0xbE1jOcTmn5Jr.jpg",
                "release_date": "1998-12-23",
                "title": "The Thin Red Line",
                "video": false,
                "vote_average": 7.447,
                "vote_count": 3133,
                "character": "Marty Bell",
                "credit_id": "52fe44b6c3a36847f80a5ec9",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/46Os8U0DEPmI0OnvKDxucl6SLVZ.jpg",
                "genre_ids": [
                    27
                ],
                "id": 1008042,
                "original_language": "en",
                "original_title": "Talk to Me",
                "overview": "When a group of friends discover how to conjure spirits using an embalmed hand, they become hooked on the new thrill, until one of them goes too far and unleashes terrifying supernatural forces.",
                "popularity": 12.0001,
                "poster_path": "/kdPMUMJzyYAc4roD52qavX0nLIC.jpg",
                "release_date": "2023-07-26",
                "title": "Talk to Me",
                "video": false,
                "vote_average": 7.151,
                "vote_count": 3391,
                "character": "Sue",
                "credit_id": "62ea88031e64890060651138",
                "order": 4
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/46Os8U0DEPmI0OnvKDxucl6SLVZ.jpg",
                "genre_ids": [
                    27
                ],
                "id": 1008042,
                "original_language": "en",
                "original_title": "Talk to Me",
                "overview": "When a group of friends discover how to conjure spirits using an embalmed hand, they become hooked on the new thrill, until one of them goes too far and unleashes terrifying supernatural forces.",
                "popularity": 12.0001,
                "poster_path": "/kdPMUMJzyYAc4roD52qavX0nLIC.jpg",
                "release_date": "2023-07-26",
                "title": "Talk to Me",
                "video": false,
                "vote_average": 7.151,
                "vote_count": 3391,
                "credit_id": "64d34b29db4ed600ad2392ed",
                "department": "Production",
                "job": "Executive Producer"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Μιράντα Ότο",
            "\tMiranda Lin Otto"
        ],
        "biography": "Miranda Otto (born December 16, 1967) is an Australian actress. The daughter of actors Lindsay and Barry Otto and the sister of actress Gracie Otto, she began acting at age eighteen, and has performed in a variety of independent and major studio films.\n\nHer first major film appearance was in the 1986 film Emma's War, in which she played a teenager who moves to Australia's bush country during World War II. In 1996, director Shirley Barrett cast Otto as a shy waitress in the film Love Serenade. She starred in the 1997 films Doing Time for Patsy Cline and The Well, for which earned her third Australian Film Institute nomination.  Her next project was the romantic comedy Dead Letter Office (1998). The film was Otto's first with her father, Barry, who makes a brief appearance. Later that year, she starred in the film In the Winter Dark, directed by James Bogle, for which she was nominated for her fourth Australian Film Institute Award.\n\nAfter a decade of critically acclaimed roles in Australian films, she gained Hollywood's attention after appearing in supporting roles in The Thin Red Line (1998) and What Lies Beneath (2000). In 2001, she was cast as a naturalist in the comedy Human Nature and appeared in the BBC adaptation of Anthony Trollope's The Way We Live Now, as a strong-willed American Southerner.  Her breakthrough role came in 2002, when she portrayed Éowyn in The Lord of the Rings trilogy. Her character was introduced in the trilogy's second film The Lord of the Rings: The Two Towers in 2002 and appeared in the third film, The Lord of the Rings: The Return of the King, the following year. Her performance earned her an Academy of Science Fiction, Fantasy & Horror Films nomination for Best Supporting Actress.\n\nDirector Steven Spielberg, impressed by Otto's performance in The Lord of the Rings, called her to ask if she would play opposite Tom Cruise in the big-budget science fiction film War of the Worlds (2005). Otto, pregnant at the time, believed she would have to turn down the role, but the script was reworked to accommodate her.\n\nHer next project was playing the lead in the Australian film Danny Deckchair (2003). She then took on the Australian television miniseries Through My Eyes: The Lindy Chamberlain Story (2004). At the 2005 Logie Awards, Otto won Most Outstanding Actress in a Drama Series for her role.\n\nIn 2007, Otto starred as Cricket Stewart, the wife of a successful director, in the television miniseries The Starter Wife. She had a starring role in the 2008 American television series Cashmere Mafia, and Australian films such as In Her Skin and Blessed (2009). She starred opposite Stephanie Sigman and Anthony LaPaglia in the horror prequel Annabelle: Creation. She portrayed Zelda Spellman in Netflix's Chilling Adventures of Sabrina (2018-2020).\n\nShe made her theatrical debut in the 1986 production of The Bitter Tears of Petra Von Kant for the Sydney Theatre Company.[28] Three more theatrical productions for the Sydney Theatre Company followed in the late 1980s and early 1990s. In 2002, she returned to the stage playing Nora Helmer in A Doll's House opposite her future husband Peter O'Brien. Otto's performance earned her a 2003 Helpmann Award nomination and the MO Award for \"Best Female Actor in a Play\". Her next stage role was in the psychological thriller Boy Gets Girl (2005).",
        "birthday": "1967-12-16",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 502,
        "imdb_id": "nm0001584",
        "known_for_department": "Acting",
        "name": "Miranda Otto",
        "place_of_birth": "Brisbane, Queensland, Australia",
        "popularity": 1.1717,
        "profile_path": "/lVkzCNNGwesZjOmwrDjro6ZPar.jpg"
    }
}