{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/OfH6y4NfYpzHcA67nwT5TjhSzJ.jpg",
                "genre_ids": [
                    18,
                    10749,
                    9648
                ],
                "id": 17057,
                "original_language": "en",
                "original_title": "In a Lonely Place",
                "overview": "A violent screenwriter and a female neighbor fall in love after she clears him of murder, but she begins to have second thoughts.",
                "popularity": 2.1395,
                "poster_path": "/vbdgtwzLOpE6MppZlyYChMagvQq.jpg",
                "release_date": "1950-05-17",
                "title": "In a Lonely Place",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 619,
                "character": "Young Detective (uncredited)",
                "credit_id": "60c40a5f5cc11d002a7829a4",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "James King Aurness",
            "Джеймс Арнесс",
            "جیمز آرنس"
        ],
        "biography": "The star of one of the longest-running shows in U.S. television history, Gunsmoke  (1955). Born of Norwegian heritage (the family name, Aurness (formerly  had been Aursness) in Minneapolis, Minnesota to Rolf and Ruth  Duesler Aurness. His father was a traveling salesman of medical supplies  and his mother later became a newspaper columnist. James attended West  High School in Minneapolis. Although he appeared in school plays, he had  no interest in performing, and dreamed instead of going to sea. After  high school, he attended one semester at Beloit College before receiving  his draft notice in 1943. He entered the army and trained at Camp  Wheeler, Georgia, before shipping out for North Africa. After landing at  Casablanca, Arness joined the 3rd Infantry Division in time for the  invasion of Anzio. Ten days after the invasion, Arness was severely  wounded in the leg and foot by German machine-gun fire. His wounds,  which plagued him the rest of his life, resulted in his medical  discharge from the army. While recuperating in a Clinton, Iowa hospital,  he was visited by his younger brother Peter (later to gain fame as  actor Peter Graves),  who suggested he take a radio course at the University of Minnesota.  James did so, and a teacher recommended him for a job as an announcer at  a Minneapolis radio station. Though seemingly headed for success in  radio, he followed a boyhood friend's suggestion and went with the  friend to Hollywood in hopes of getting work as film extras. He studied  at the Bliss-Hayden Theatre School under actor Harry Hayden, and while appearing in a play there was spotted by agent Leon Lance. Lance got the actor a role as Loretta Young's brother in The Farmer's Daughter (1947). The director of that film, H.C. Potter,  recommended that he drop the \"u\" from his last name and soon thereafter  the actor was officially known as James Arness. Little work followed  this break,  He appeared in a production of  \"Candida\", and married his leading  lady, Virginia Chapman.  He began to get small roles with frequency, often, due to his size,  villainous characters. Most notable among these was that of the space  alien in The Thing from Another World (1951). While playing a Greek warrior in a play, Arness was spotted by agent Charles K. Feldman, who represented John Wayne.  Feldman introduced Arness to Wayne, who put the self-described 6' 6\"  actor under personal contract. Arness played several roles over the next  few years for and with Wayne, whom he considered a mentor. In 1955,  Wayne recommended Arness for the lead role of Matt Dillon in the TV  series Gunsmoke  (1955). (Contrary to urban legend, Wayne himself was never offered the  role.) Arness at first declined, thinking a TV series could derail his  growing film career, but Wayne argued for the show, and Arness accepted. After the cancellation of  \"Gunsmoke\" in 1975, Arness took on another successful Western project, \"How The West Was Won.\" A  brief modern police drama, McClain's Law (1981), followed, and Arness played his mentor John Wayne's role in Red River  (1988), a remake of the Wayne classic.",
        "birthday": "1923-05-26",
        "deathday": "2011-06-03",
        "gender": 2,
        "homepage": null,
        "id": 50304,
        "imdb_id": "nm0000790",
        "known_for_department": "Acting",
        "name": "James Arness",
        "place_of_birth": "Minneapolis, Minnesota, USA",
        "popularity": 1.3566,
        "profile_path": "/73DVZqb8yST1ViSwhoUgZAFQC2D.jpg"
    }
}