{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zzzoRNVSaUv6e1hpADjUDeM3EvY.jpg",
                "genre_ids": [
                    878,
                    28,
                    12
                ],
                "id": 13475,
                "original_language": "en",
                "original_title": "Star Trek",
                "overview": "The fate of the galaxy rests in the hands of bitter rivals. One, James Kirk, is a delinquent, thrill-seeking Iowa farm boy. The other, Spock, a Vulcan, was raised in a logic-based society that rejects all emotion. As fiery instinct clashes with calm reason, their unlikely but powerful partnership is the only thing capable of leading their crew through unimaginable danger, boldly going where no one has gone before. The human adventure has begun again.",
                "popularity": 9.3534,
                "poster_path": "/lV5OpzAss1z06YNagOVap1I35mH.jpg",
                "release_date": "2009-05-06",
                "title": "Star Trek",
                "video": false,
                "vote_average": 7.426,
                "vote_count": 10141,
                "character": "Galia",
                "credit_id": "52fe456d9251416c750561b1",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "レイチェル・ニコルズ",
            "ریچل نیکولز"
        ],
        "biography": "Rachel Emily Nichols (born January 8, 1980 height 5' 10\" (1,78 m) ) is an American actress and model. Nichols began modeling while attending Columbia University in New York City in the late 1990s. She transitioned into television and film acting in the early 2000s; she had a bit part in the romantic drama film Autumn in New York (2000) and a one-episode role in the fourth season of the hit show Sex and the City (2002). Her first major role was in the comedy film Dumb and Dumberer: When Harry Met Lloyd (2003). She had the main role in the crime drama television series The Inside (2005), though it was cancelled after one season. Nichols gained recognition playing Rachel Gibson in the final season of the serial action television series Alias (2005–2006) and for her role in the horror film The Amityville Horror (2005). Nichols' first starring film role was in the horror–thriller P2 (2007). She had a supporting role in the coming-of-age film The Sisterhood of the Traveling Pants 2 (2008) and appeared in Star Trek (2009). She starred in the action film G.I. Joe: The Rise of Cobra (2009) and in the sword and sorcery film Conan the Barbarian (2011).\n\nDescription above from the Wikipedia article Rachel Nichols (actress), licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": "1980-01-08",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 50347,
        "imdb_id": "nm0629697",
        "known_for_department": "Acting",
        "name": "Rachel Nichols",
        "place_of_birth": "Augusta, Maine, USA",
        "popularity": 1.7009,
        "profile_path": "/bMv117SLOJoseim6qvuHFc1gntZ.jpg"
    }
}