{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/40Rl5nZRxXQ4kHV4Lhghj5iQZZN.jpg",
                "genre_ids": [
                    53,
                    10749,
                    9648
                ],
                "id": 303,
                "original_language": "en",
                "original_title": "Notorious",
                "overview": "In order to help bring Nazis to justice, U.S. government agent T.R. Devlin recruits Alicia Huberman, the American daughter of a convicted German war criminal, as a spy. As they begin to fall for one another, Alicia is instructed to win the affections of Alexander Sebastian, a Nazi hiding out in Brazil. When Sebastian becomes serious about his relationship with Alicia, the stakes get higher, and Devlin must watch her slip further undercover.",
                "popularity": 3.9227,
                "poster_path": "/4RERYb1NIQrJHYY5e8nUlYM7t2z.jpg",
                "release_date": "1946-08-21",
                "title": "Notorious",
                "video": false,
                "vote_average": 7.742,
                "vote_count": 1664,
                "character": "Joseph",
                "credit_id": "52fe4235c3a36847f800c285",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Αλέξης Μινωτής",
            "Αλεξης Μινωτης",
            "Alexis Minotis",
            "Alexandros Minotakis"
        ],
        "biography": "Alexis Minotis (Greek: Αλέξης Μινωτής; born Alexandros Minotakis (Greek: Αλέξανδρος Μινωτάκης)(8 August 1900 – 11 November 1990) was a Greek actor and director.\n\nHe first appeared on stage in his native Crete as Chorus Leader and later as Messenger in Sophocles' Oedipus Tyrannus. From 1925 until 1930, he worked in close collaboration with the famous Greek actress Marika Kotopouli in her own theatre. During this period, he appeared in the great Shakespearan roles in The Merchant of Venice, King Lear, Macbeth and played the title role in Hamlet, the first time the play had been staged in Greece. Other roles in the classical repertoire were Henrik Ibsen's Ghosts and Peer Gynt. He expanded his talents by directing ancient Greek tragedies such as Hecuba, Antigone, The Phoenissae, Prometheus Bound, Oedipus at Colonus, as well as Seán O'Casey's Juno and the Paycock, August Strindberg's The Father and Brecht's Mother Courage.\n\nIn 1940, he married the actress Katina Paxinou, and together they appeared in many productions at the National Theatre of Greece in Athens, which was founded in 1930 by Minister of Education Georgios Papandreou.\n\nIn 1946, he went to Hollywood to appear in Alfred Hitchcock's Notorious with Cary Grant, Ingrid Bergman and Claude Rains. In the same year, he also appeared with Robert Cummings and Michèle Morgan in The Chase. His other films include Siren of Atlantis (1949) with Maria Montez, Boy on a Dolphin (1957) with Sophia Loren, and Land of the Pharaohs (1955) with Joan Collins.\n\nIn 1955, he directed Katina Paxinou in Euripides' Hecuba for the National Theatre of Greece at The Ancient Theatre of Epidaurus and starred in Oedipus Rex as well as directing. In 1956, he made his first appearance in Oedipus at Colonus. The production received great acclaim, and Minotis went on a long international tour with the company.\n\nHe appeared on Broadway in Electra with the Marika Kotopouli company in 1930-31 and in Oedipus Tyrannus with the National Theatre of Greece in 1952.\n\nIn 1958, Minotis directed Maria Callas in a production of Medea presented in Dallas. The production was then seen at Covent Garden, Teatro alla Scala and Epidaurus. He also directed the Greek National Opera production of Norma with Callas in Epidaurus in 1960.",
        "birthday": "1900-08-08",
        "deathday": "1990-11-11",
        "gender": 2,
        "homepage": null,
        "id": 5042,
        "imdb_id": "nm0591615",
        "known_for_department": "Acting",
        "name": "Alex Minotis",
        "place_of_birth": "Chania, Crete, Greece",
        "popularity": 0.1278,
        "profile_path": "/udsUFQ2sg9ABpoZTcz0bUgL7oZJ.jpg"
    }
}