{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/k2ZdjMXmqnw4RJeh8cwxCvcznJZ.jpg",
                "genre_ids": [
                    18
                ],
                "id": 50014,
                "original_language": "en",
                "original_title": "The Help",
                "overview": "Aibileen Clark is a middle-aged African-American maid who has spent her life raising white children and has recently lost her only son; Minny Jackson is an African-American maid who has often offended her employers despite her family's struggles with money and her desperate need for jobs; and Eugenia \"Skeeter\" Phelan is a young white woman who has recently moved back home after graduating college to find out her childhood maid has mysteriously disappeared. These three stories intertwine to explain how life in Jackson, Mississippi revolves around \"the help\"; yet they are always kept at a certain distance because of racial lines.",
                "popularity": 11.3368,
                "poster_path": "/3kmfoWWEc9Vtyuaf9v5VipRgdjx.jpg",
                "release_date": "2011-08-09",
                "title": "The Help",
                "video": false,
                "vote_average": 8.204,
                "vote_count": 8680,
                "character": "Robert Phelan",
                "credit_id": "5790181ac3a36865eb0040c7",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Brain Kerwin",
            "Брайан Кервин"
        ],
        "biography": "Brian Kerwin (born October 25, 1949) is an American actor.\n\nBorn in Chicago, Illinois, Kerwin won the Theatre World Award in 1988 for the off-Broadway play Emily. His Broadway theatre credits include the 1997 revival of The Little Foxes and the Elaine May comedy After the Night and the Music in 2005. That same year he starred in Edward Albee's The Goat or Who is Sylvia? at the Mark Taper Forum and played Nick in a highly praised revival of Albee's Who's Afraid of Virginia Woolf? with Glenda Jackson and John Lithgow. He also played opposite Kathy Baker in the South Coast Repertory production of The Man from Nebraska in 2006. His most recent stage appearance was in the Broadway production August: Osage County.\n\nKerwin's feature films include Murphy's Romance, Hard Promises, 27 Dresses (as Katherine Heigl's character's father), Torch Song Trilogy, Love Field, Jack, King Kong Lives, The Myth of Fingerprints, and Debating Robert Lee. Kerwin has enjoyed an extensive career in television, beginning with the daytime serial The Young and the Restless in 1976. In addition to many television movies, his credits include a regular role on the Showtime series Beggars and Choosers, recurring roles on The Misadventures of Sheriff Lobo, The Chisholms (four 1979 episodes as Gideon Chisholm), Roseanne, The West Wing, Nip/Tuck and Big Love and guest appearances in The Love Boat, Simon &amp; Simon, Highway to Heaven, Murder, She Wrote, St. Elsewhere, Frasier, Law &amp; Order, Law &amp; Order: Special Victims Unit, Boston Legal, Medium, Without a Trace, and Desperate Housewives. In 2007, he joined the cast of the soap opera One Life to Live. Brian was also in a television movie with Michelle Pfeiffer called Tales from the Hollywood Hills: Natica Jackson. He played her married lover. His name was spelled Brain Kerwin in the credits.\n\nKerwin has been married to Jeanne Marie Troy since September 2, 1990. They have three children, Finn, Matilda, and Brennan. The family lives in New York City.\n\nDescription above from the Wikipedia article Brian Kerwin, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1949-10-25",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 50464,
        "imdb_id": "nm0450116",
        "known_for_department": "Acting",
        "name": "Brian Kerwin",
        "place_of_birth": "Chicago, Illinois, USA",
        "popularity": 0.3958,
        "profile_path": "/4OSrhPMEkRHcDXEkXba0FxF0WQD.jpg"
    }
}