{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ycNyvi9gk4ZI2NLk4KBbseNZbfN.jpg",
                "genre_ids": [
                    99
                ],
                "id": 58496,
                "original_language": "en",
                "original_title": "Senna",
                "overview": "The remarkable story of Brazilian racing driver Ayrton Senna, charting his physical and spiritual achievements on the track and off, his quest for perfection, and the mythical status he has since attained, is the subject of Senna, a documentary feature that spans the racing legend's years as an F1 driver, from his opening season in 1984 to his untimely death a decade later.",
                "popularity": 2.9837,
                "poster_path": "/nZbLCbRoP6iJq5sr8daHQzjnzFh.jpg",
                "release_date": "2010-10-07",
                "title": "Senna",
                "video": false,
                "vote_average": 8.112,
                "vote_count": 1116,
                "character": "Self (archive footage)",
                "credit_id": "672ed93ec68585631b852444",
                "order": 30
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Adrian Newey, born on December 26, 1958, in Stratford-upon-Avon, England, is one of the most successful and influential Formula 1 designers and engineers in the sport’s history. Known for his innovative approach and mastery of aerodynamics, Newey has been instrumental in securing multiple Constructors’ and Drivers’ Championships across several teams, including Williams, McLaren, and Red Bull Racing.\n\nNewey began his career in IndyCar racing before moving to Formula 1 in the late 1980s with March, eventually joining Williams, where he designed championship-winning cars that led drivers like Nigel Mansell and Alain Prost to titles. At McLaren, he continued his success, contributing to championships with Mika Häkkinen. His most enduring impact came with Red Bull Racing, where his designs helped the team and Sebastian Vettel dominate from 2010 to 2013. His cars also powered Max Verstappen to world titles in 2021 and 2022.\n\nKnown for pushing the limits of engineering and aerodynamics, Newey is celebrated as a creative genius in F1 car design, with a legacy of groundbreaking innovations that have shaped modern motorsport.",
        "birthday": "1958-12-26",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 5048534,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Adrian Newey",
        "place_of_birth": "Stratford-Upon-Avon, Warwickshire, England, UK",
        "popularity": 0.0,
        "profile_path": "/wvyq6h76VqQySu8gEJ2EjPUy3xB.jpg"
    }
}