{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ycNyvi9gk4ZI2NLk4KBbseNZbfN.jpg",
                "genre_ids": [
                    99
                ],
                "id": 58496,
                "original_language": "en",
                "original_title": "Senna",
                "overview": "The remarkable story of Brazilian racing driver Ayrton Senna, charting his physical and spiritual achievements on the track and off, his quest for perfection, and the mythical status he has since attained, is the subject of Senna, a documentary feature that spans the racing legend's years as an F1 driver, from his opening season in 1984 to his untimely death a decade later.",
                "popularity": 2.9837,
                "poster_path": "/nZbLCbRoP6iJq5sr8daHQzjnzFh.jpg",
                "release_date": "2010-10-07",
                "title": "Senna",
                "video": false,
                "vote_average": 8.112,
                "vote_count": 1116,
                "character": "Self (archive footage)",
                "credit_id": "672ed7023a8e43a6b7ba92a4",
                "order": 24
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Terry Fullerton, born on January 4, 1953, in London, England, is a retired British racing driver renowned for his achievements in karting. He began his karting career in the 1960s, securing the British Junior Karting Championship titles in 1966, 1967, and 1968. In 1973, Fullerton became the first Briton to win the Karting World Championship, marking a significant milestone in his career.\n\nFrom 1978 to 1980, Fullerton raced for the Italian DAP factory team, where he was teammates with Ayrton Senna. Their time together is notable, as Senna later cited Fullerton as one of the drivers he most enjoyed competing against, highlighting the pure and competitive nature of their racing.\n\nAfter retiring from competitive racing in 1984, Fullerton transitioned to coaching and team management. He has been instrumental in developing the careers of several prominent drivers, including Anthony Davidson, Allan McNish, and Dan Wheldon. Fullerton's extensive experience and dedication have made him a respected figure in the karting community, contributing significantly to the sport's growth and the nurturing of new talent.",
        "birthday": "1953-01-04",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 5048059,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Terry Fullerton",
        "place_of_birth": " London, England",
        "popularity": 0.0071,
        "profile_path": "/6oXA62i9XnaPRcrwnlWHoGM4dVW.jpg"
    }
}