{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/AmR3JG1VQVxU8TfAvljUhfSFUOx.jpg",
                "genre_ids": [
                    27,
                    878
                ],
                "id": 348,
                "original_language": "en",
                "original_title": "Alien",
                "overview": "During its return to the earth, commercial spaceship Nostromo intercepts a distress signal from a distant planet. When a three-member team of the crew discovers a chamber containing thousands of eggs on the planet, a creature inside one of the eggs attacks an explorer. The entire crew is unaware of the impending nightmare set to descend upon them when the alien parasite planted inside its unfortunate host is birthed.",
                "popularity": 16.2857,
                "poster_path": "/vfrQk5IPloGg1v9Rzbh2Eg3VGyM.jpg",
                "release_date": "1979-05-25",
                "title": "Alien",
                "video": false,
                "vote_average": 8.165,
                "vote_count": 15589,
                "character": "Alien",
                "credit_id": "66185d9fb9a0bd017c109f87",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Bolaji Badejo was a Nigerian design student who portrayed the eponymous Alien in the 1979 film Alien. Alien was Badejo's only acting appearance.\n\nAs a child, Badejo had been diagnosed with sickle cell anaemia. Several months after his 39th birthday, Bolaji fell ill and was taken to St. Stephen Hospital in Ebute Metta, Lagos, where he died on December 22, 1992 of complications from the disease.\n\nWhile at a bar in early 1977, Bolaji Badejo was approached by Alien casting director Peter Archer, who was scouting for someone suitably tall and thin to play the eponymous Alien. Ivor Powell, the film's associate producer, explained that \"The person that put the suit on had to be impossibly tall. \n\nWe wanted them to be incredibly long-limbed, especially from the waist to the knee.\" However, the production had reached an impasse casting their Alien. They tried various female models, a family of contortionists and even Chewbacca actor Peter Mayhew.",
        "birthday": "1953-08-23",
        "deathday": "1992-12-22",
        "gender": 2,
        "homepage": null,
        "id": 5051,
        "imdb_id": "nm0045993",
        "known_for_department": "Acting",
        "name": "Bolaji Badejo",
        "place_of_birth": "Nigeria",
        "popularity": 0.3236,
        "profile_path": "/7ddxWlDIOVKBK6TjP66vb9Qp3MW.jpg"
    }
}