{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ZtcGMc204JsNqfjS9lU6udRgpo.jpg",
                "genre_ids": [
                    28,
                    18
                ],
                "id": 911430,
                "original_language": "en",
                "original_title": "F1",
                "overview": "Racing legend Sonny Hayes is coaxed out of retirement to lead a struggling Formula 1 team—and mentor a young hotshot driver—while chasing one more chance at glory.",
                "popularity": 171.1139,
                "poster_path": "/9PXZIUsSDh4alB80jheWX4fhZmy.jpg",
                "release_date": "2025-06-25",
                "title": "F1",
                "video": false,
                "vote_average": 7.828,
                "vote_count": 2105,
                "character": "Zak Brown",
                "credit_id": "685a50ce44403c2581796bc0",
                "order": 71
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Zak Brown, born on November 7, 1971, in Los Angeles, California, is an American businessman and former racing driver, currently serving as the CEO of McLaren Racing. His journey in motorsport began as a driver, competing in various series, including Formula Ford and Formula 3, before transitioning to the business side of the sport.\n\nIn 1995, Brown founded Just Marketing International (JMI), which became the world's largest motorsport marketing agency, facilitating significant sponsorship deals across various racing disciplines. His success with JMI established him as a prominent figure in motorsport marketing.\n\nBrown joined McLaren in 2016 as Executive Director and was appointed CEO in 2018. Under his leadership, McLaren has experienced a resurgence in performance and commercial success. He has overseen the team's return to competitiveness in Formula 1, with notable achievements including multiple podium finishes and race victories. Brown has also expanded McLaren's presence in other racing series, such as IndyCar and Extreme E, reflecting his vision for a diversified motorsport portfolio. His leadership is characterized by a focus on performance, innovation, and a strong commercial strategy, positioning McLaren as a formidable competitor in global motorsport.",
        "birthday": "1971-11-07",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 5051431,
        "imdb_id": "nm9537655",
        "known_for_department": "Acting",
        "name": "Zak Brown",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.0256,
        "profile_path": "/gKsEA7WGWW1o9yQdsGQPnP4NDjb.jpg"
    }
}