{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3e3dVaVrla2GH6CWKbNRjTvk3s8.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 6844,
                "original_language": "en",
                "original_title": "The Ten Commandments",
                "overview": "Escaping death, a Hebrew infant is raised in a royal household to become a prince. Upon discovery of his true heritage, Moses embarks on a personal quest to reclaim his destiny as the leader and liberator of the Hebrew people.",
                "popularity": 10.66,
                "poster_path": "/3Ei59AR64x6dMZfWobPCkZjbqTL.jpg",
                "release_date": "1956-10-05",
                "title": "The Ten Commandments",
                "video": false,
                "vote_average": 7.769,
                "vote_count": 1743,
                "character": "Abiram",
                "credit_id": "52fe4466c3a36847f8093b09",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Frank DeKova"
        ],
        "biography": "Frank DeKova parlayed a sinister scowl, piercing eyes and an all-around menacing attitude into a long career of playing cold-blooded trigger-men, rampaging Indian chiefs, brutal Mexican army officers and the like. So it would probably come as a shock to those who know his work to discover that, before he became an actor, he was--of all things--a schoolteacher.\n\nBorn in New York in 1910, DeKova gave up teaching for the stage, and played in many Shakespearean productions before getting work on Broadway. One of his first starring roles was in the classic detective play \"Detective Story\", which got him noticed and brought to Hollywood. He debuted in Viva Zapata! (1952) as the devious Mexican colonel who sets up Zapata's assassination. For the next several years he played an assortment of gangsters, killers, gunfighters and Indians--with time out to play a prehistoric patriarch in Roger Corman's campy Teenage Cave Man (1958)--and did much television work, including a standout job as a Mafia hit-man assigned to kill Elliot Ness in Westinghouse Desilu Playhouse: The Untouchables: Part 1 (1959). The role for which he will be most remembered, however, is probably the one that was his most atypical: the scheming, somewhat untrustworthy but very funny Hekawi Chief Wild Eagle, the partner to Forrest Tucker's Sgt. O'Rourke in O'Rourke's various schemes to make money, in the western comedy series F Troop (1965). He showed a previously unknown talent for comedy and managed to steal most of the scenes he was in from such veterans as Tucker and Larry Storch. He died in his sleep in 1981.",
        "birthday": "1910-03-17",
        "deathday": "1981-10-15",
        "gender": 2,
        "homepage": null,
        "id": 50574,
        "imdb_id": "nm0215308",
        "known_for_department": "Acting",
        "name": "Frank De Kova",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.3737,
        "profile_path": "/lVlseygvknUVOgCVOPVDzURKOst.jpg"
    }
}