{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qyePa65qZVnuYWivTBXkHV9aI3A.jpg",
                "genre_ids": [
                    27,
                    53,
                    9648,
                    18,
                    14
                ],
                "id": 1730,
                "original_language": "en",
                "original_title": "Inland Empire",
                "overview": "An actress’s perception of reality becomes increasingly distorted as she finds herself falling for her co-star in a remake of an unfinished Polish production that was supposedly cursed.",
                "popularity": 4.3514,
                "poster_path": "/1ypMcAcqTZrcxFJvERemKc6t9sX.jpg",
                "release_date": "2006-12-06",
                "title": "Inland Empire",
                "video": false,
                "vote_average": 6.992,
                "vote_count": 1179,
                "character": "Koz Kakawski",
                "credit_id": "602ae65590dde0003fd16b04",
                "order": 46
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jonathan Brooks",
            "Stanley Camel",
            "Stanely Kamel"
        ],
        "biography": "Stanley Kamel (January 1, 1943 – April 8, 2008) was an American actor, best known for his role as Dr. Charles Kroger on the American television series Monk. Kamel was born to a Jewish family and raised in South River, New Jersey, and attended Rutgers Preparatory School. He started his acting career off-Broadway and broke into television with a role in Days of Our Lives as Eric Peters. Kamel had a recurring role on Melrose Place in 1994 as Bruce Teller, the chief executive officer of D&D Advertising, where Amanda (Heather Locklear) and Allison (Courtney Thorne-Smith) were employed. During the first part of the sixth season of Beverly Hills, 90210, Kamel appeared on several episodes as Anthony Marchette, an organized crime figure. Kamel was most known for his role as Dr. Charles Kroger in the USA Network television series Monk, playing the infinitely patient and ever-supportive psychiatrist to the main character, Adrian Monk (Tony Shalhoub). Though his last appearance was in the sixth season of Monk, clips of his character were seen later in the series finale.",
        "birthday": "1943-01-01",
        "deathday": "2008-04-08",
        "gender": 2,
        "homepage": null,
        "id": 50708,
        "imdb_id": "nm0112070",
        "known_for_department": "Acting",
        "name": "Stanley Kamel",
        "place_of_birth": "South River, New Jersey, USA",
        "popularity": 0.5567,
        "profile_path": "/pmfN39Ib3V8Y12tZCFybiLvIMJ6.jpg"
    }
}