{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jMT2nS6ou3xwzp1XX40v8rJKl7U.jpg",
                "genre_ids": [
                    35
                ],
                "id": 15097,
                "original_language": "fr",
                "original_title": "La Cité de la peur",
                "overview": "A second-class horror movie has to be shown at Cannes Film Festival, but, before each screening, the projectionist is killed by a mysterious fellow, with hammer and sickle, just as it happens in the film to be shown.",
                "popularity": 3.4282,
                "poster_path": "/xaTVWUrPbGM4SgrLOaaWLeUEafI.jpg",
                "release_date": "1994-03-09",
                "title": "Fear City: A Family-Style Comedy",
                "video": false,
                "vote_average": 7.468,
                "vote_count": 1304,
                "character": "Pierre Lescure",
                "credit_id": "52fe46399251416c750714df",
                "order": 38
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/izUQSU7tCcx0k4xU3VARcKqy3pn.jpg",
                "genre_ids": [
                    35
                ],
                "id": 22826,
                "original_language": "it",
                "original_title": "Il mostro",
                "overview": "A vicious serial sex killer is on the loose, and landscape gardener and shop-window outfitter Loris is the prime suspect, thanks to his unfortunate habit of getting caught in compromising situations (for which there is always a totally innocent explanation that the police fail to spot). Undercover policewoman Jessica is assigned by eccentric police psychologist Taccone to follow Loris.",
                "popularity": 1.3509,
                "poster_path": "/6h6ahipPd84QcyFbnsEikLt7w3Z.jpg",
                "release_date": "1994-10-22",
                "title": "The Monster",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 621,
                "credit_id": "66a7686395c4e44749414415",
                "department": "Production",
                "job": "Producer"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Pierre Lescure (born July 2, 1945), is a French journalist and television executive. He is known for having founded the French TV music show Les Enfants du rock broadcast on public television from 1981 to 1988 and for having led the French Canal+ channel from its creation in 1984 to 2002. Since 2015 he has been the president of the Cannes Film Festival.\n\nHe is the son of François Lescure, French Resistance member and journalist for the French communist daily newspaper L'Humanité, and the grandson of Pierre de Lescure, founder of the publishing house Les Éditions de Minuit. He grew up in Choisy-le-Roi. He studied journalism at the Centre de formation des journalistes de Paris.\n\nHe started his career at the radio station RTL, where he was reporter and news anchor from 1965 to 1968, and moved to RMC from 1968 to 1972.\n\nHe started working in television as a news anchor of the evening news program of the French public network Antenne 2. In 1981, he created the TV music show Les Enfants du rock.\n\nHe supported the candidacy of François Hollande during the 2012 French presidential election, and has led a mission about Culture and Media in his government.\n\nHe became president of the Cannes Film Festival in 2014.",
        "birthday": "1945-07-02",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 507238,
        "imdb_id": "nm0503928",
        "known_for_department": "Acting",
        "name": "Pierre Lescure",
        "place_of_birth": "Paris, France",
        "popularity": 0.3274,
        "profile_path": "/j2OXL3qIV1OG5Yzh7rG5W4pTxJq.jpg"
    }
}