{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rE6W3KHdIuTdgRDLOOOMR3gfGgc.jpg",
                "genre_ids": [
                    18,
                    36,
                    10752
                ],
                "id": 289222,
                "original_language": "en",
                "original_title": "The Zookeeper's Wife",
                "overview": "The account of keepers of the Warsaw Zoo, Jan and Antonina Zabinski, who helped save hundreds of people and animals during the Nazi invasion.",
                "popularity": 2.8741,
                "poster_path": "/50KGpMiIvSkF4WHOgp0gM6r6sMU.jpg",
                "release_date": "2017-03-24",
                "title": "The Zookeeper's Wife",
                "video": false,
                "vote_average": 7.331,
                "vote_count": 1524,
                "character": "Magda Gross",
                "credit_id": "58e7cafa9251412810053ceb",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Efrat Dor is an actress, born in Beersheba, Israel on January 6, 1983, she has 3 brothers, stands 5'4½\" (1.64 m) tall. She is known for The Zookeeper's Wife (2017), Mayans M.C. (2018) and Holy Lands. In 2001 she attended the Lee Strasberg School of Acting in New York and in 2003 began her studies at the Beit Zvi School of Performing Arts. Between the years 2006-2009, Dor participated in several television series in secondary roles: \"Maybe This Time\" and \"Ha-Chaim Ze Lo Hacol (Hebrew: החיים זה לא הכל) (Translated: Life is Not Everything).\" In 2007 she played in the fringe show \"Tavo Nahra\" at the Acre Festival of the Year. Dor also played \"Jessica\" in the 2009 film \"Phobidilia\" (directed by Doron Paz and Yoav Paz) that was released early in the year of 2010, Dor made a break thru when she played \"Shir\" in the lead role in the daily drama series \"Asfur\". Also in 2010, Dor served as a designer for fashion designer Ronen Chen for two seasons. She also joined the regular cast in the second season of the series \"Tamarot Ashan\". In 2011 Dor played alongside Amos Tamam in the police series \"Downtown Precinct\" in the role of policewoman Alexandra Yudaiov. The series premiered on Channel 10 in October 2011. In 2013, She landed the lead role in the film, Cupcakes directed by Eytan Fox. Dor is married to Moshik Maimon. And they have a daughter. (This was translated, then rewritten using known facts).",
        "birthday": "1983-01-06",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 507837,
        "imdb_id": "nm3575889",
        "known_for_department": "Acting",
        "name": "Efrat Dor",
        "place_of_birth": "Beersheba, Israel",
        "popularity": 0.9663,
        "profile_path": "/zFm6FZ7cKq9hODKqfvNc4d4zuRi.jpg"
    }
}