{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5fxTB08O7CW1hAcN2MWOKodp1h1.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 615777,
                "original_language": "en",
                "original_title": "Babylon",
                "overview": "A tale of outsized ambition and outrageous excess, tracing the rise and fall of multiple characters in an era of unbridled decadence and depravity during Hollywood's transition from silent films to sound films in the late 1920s.",
                "popularity": 10.7094,
                "poster_path": "/wjOHjWCUE0YzDiEzKv8AfqHj3ir.jpg",
                "release_date": "2022-12-22",
                "title": "Babylon",
                "video": false,
                "vote_average": 7.38,
                "vote_count": 3486,
                "character": "Orchestra Cello Player / MGM Crew (uncredited)",
                "credit_id": "67452052dcbb15c89a8b42aa",
                "order": 240
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Kevin Kaouthomn (Kevin Dunning) is an actor with an opulent tenor and nuanced character voice with training in both the European and Asian baroque vocal styles, and has studied and taught sacred sound & vocal meditation on yoga retreats and in private classes under the tutelage of Grammy-nominated New Age recording artist Silvia Nakkach. During his years in international sacred voice studies, Kevin studied music in world cultures from India, Bhutan, Tibet, the Amazon and others, affording him a subtle voice with a deft emotional and intellectual timbre.\n\nKevin was the only person to produce a daily gamut of nearly 80 Shakespearean Sonnets in tandem with Sir Patrick Stewart's daily #asonnetaday Shakespeare masterclass for his 80th birthday during the 2020 COVID pandemic. Kevin's effort honors the mastery of this great actor, and the Shakespeare lineage, and is in its pith a love letter to Kevin's daughter.\n\nKevin also has a background in multiple producing Broadway companies to pair with a career caring for the needs of confidential clientele in several esteemed international executive recruiting firms.",
        "birthday": null,
        "deathday": null,
        "gender": 0,
        "homepage": "http://www.kevinkaouthomn.com",
        "id": 5082349,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Kevin Kaouthomn",
        "place_of_birth": null,
        "popularity": 0.2153,
        "profile_path": null
    }
}