{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ftNimlo6fP4WKRMWnF1ghX4fPUy.jpg",
                "genre_ids": [
                    35,
                    10749,
                    18
                ],
                "id": 6620,
                "original_language": "en",
                "original_title": "Sabrina",
                "overview": "Linus and David Larrabee are the two sons of a very wealthy family. Linus is all work – busily running the family corporate empire, he has no time for a wife and family. David is all play – technically he is employed by the family business, but never shows up for work, spends all his time entertaining, and has been married and divorced three times. Meanwhile, Sabrina Fairchild is the young, shy, and awkward daughter of the household chauffeur, who goes away to Paris for two years, and returns to capture David's attention, while falling in love with Linus.",
                "popularity": 3.8978,
                "poster_path": "/86ix9wBxiMAaISt4HpmXQm6Mlym.jpg",
                "release_date": "1954-09-01",
                "title": "Sabrina",
                "video": false,
                "vote_average": 7.505,
                "vote_count": 1294,
                "character": "Maude Larrabee",
                "credit_id": "52fe445fc3a36847f8091fe9",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nNella Walker (March 6, 1886 – March 22, 1971) was born and raised in Chicago, Illinois, and in her teens became half of the husband and wife vaudeville team \"Mack and Walker\", with her husband Wilbur Mack. By 1929 she had launched a film acting career, her first film role being in Tanned Legs alongside Sally Blane, Dorothy Revier, June Clyde, and Arthur Lake. She appeared in three films in 1929, and easily transitioned to \"talking films\", appearing in another four films in 1930, possibly making the smooth transition because she was never an established silent film actress.\n\nIn 1931 her film career took off, with her appearing in ten films that year, five of which were uncredited. Her marriage ended not long after her film career was on the rise, and from 1932-33 she appeared in fifteen films, only five of which were uncredited. In 1935, her career improved, and between that year and 1938 she had 23 film appearances. Her biggest film appearance during that period was in Young Dr. Kildare alongside Lionel Barrymore and Lew Ayres. Throughout the 1930s her career was strong, and, despite her never being a premier \"star\", she repeatedly had solid acting roles. She finished that decade strong in 1939 with nine film roles, only three of which were uncredited.\n\nThe 1940s mirrored her success of the previous decade in many ways, with her appearing in 37 films from 1940 to 1947. Now later in her career, and over 60 years of age, she slowed her career for a time, not having another role until 1950 when she appeared in Nancy Goes to Rio alongside Ann Sothern and Carmen Miranda. She appeared in another two films in 1952, then had her last film acting role in 1954, in the film Sabrina alongside Humphrey Bogart and Audrey Hepburn.",
        "birthday": "1886-03-04",
        "deathday": "1971-03-22",
        "gender": 1,
        "homepage": null,
        "id": 50836,
        "imdb_id": "nm0908063",
        "known_for_department": "Acting",
        "name": "Nella Walker",
        "place_of_birth": "Chicago, Illinois, USA",
        "popularity": 0.472,
        "profile_path": "/3ETSoodq1ooscaeO6Dkq4CgXo4Q.jpg"
    }
}