{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zAL3LOswagN9onjN8DPcNFTqKuD.jpg",
                "genre_ids": [
                    18
                ],
                "id": 705,
                "original_language": "en",
                "original_title": "All About Eve",
                "overview": "From the moment she glimpses her idol at the stage door, Eve Harrington is determined to take the reins of power away from the great actress Margo Channing. Eve maneuvers her way into Margo's Broadway role, becomes a sensation and even causes turmoil in the lives of Margo's director boyfriend, her playwright and his wife. Only the cynical drama critic sees through Eve, admiring her audacity and perfect pattern of deceit.",
                "popularity": 2.0482,
                "poster_path": "/blBzZaatPWVuWpXEnPscMA4Xp6m.jpg",
                "release_date": "1950-11-09",
                "title": "All About Eve",
                "video": false,
                "vote_average": 8.076,
                "vote_count": 1604,
                "character": "Aged Actor",
                "credit_id": "52fe426dc3a36847f801dd67",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/ftNimlo6fP4WKRMWnF1ghX4fPUy.jpg",
                "genre_ids": [
                    35,
                    10749,
                    18
                ],
                "id": 6620,
                "original_language": "en",
                "original_title": "Sabrina",
                "overview": "Linus and David Larrabee are the two sons of a very wealthy family. Linus is all work – busily running the family corporate empire, he has no time for a wife and family. David is all play – technically he is employed by the family business, but never shows up for work, spends all his time entertaining, and has been married and divorced three times. Meanwhile, Sabrina Fairchild is the young, shy, and awkward daughter of the household chauffeur, who goes away to Paris for two years, and returns to capture David's attention, while falling in love with Linus.",
                "popularity": 4.2015,
                "poster_path": "/86ix9wBxiMAaISt4HpmXQm6Mlym.jpg",
                "release_date": "1954-09-01",
                "title": "Sabrina",
                "video": false,
                "vote_average": 7.505,
                "vote_count": 1294,
                "character": "Oliver Larrabee",
                "credit_id": "52fe445fc3a36847f8091fd5",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Walter Hampden Dougherty"
        ],
        "biography": "From Wikipedia, the free encyclopedia. Walter Hampden is the artist name of Walter Hampden Dougherty (June 30, 1879 in Brooklyn – June 11, 1955 in Los Angeles) was a U.S. actor and theatre manager. He was the younger brother of the American painter Paul Dougherty (1877-1947).\n\nHe went to England for apprenticeship for six years. Later, he played Hamlet, Henry V and Cyrano de Bergerac on Broadway. In 1925, he became manager of the Colonial Theatre on Broadway. He became noted for his Shakespearean roles as well as for Cyrano, which he played in several productions between 1923 and 1936. Hampden's last stage role was as Danforth in the original Broadway production of Arthur Miller's The Crucible.\n\nHampden appeared in a few silent films, but did not really begin his film career in earnest until 1939, when he played the good Archbishop of Paris[1] (Frollo's brother) in The Hunchback of Notre Dame, starring Charles Laughton as Quasimodo. This was Hampden's first sound film ; he was sixty at the time he made it. Several other roles followed—Jarvis Langdon in the 1944 film The Adventures of Mark Twain among them, but all were supporting character roles, not the lead roles that Hampden played onstage. He had a small, but notable role as the long-winded dinner speaker in the first scene of All About Eve (1950), and played the father of Humphrey Bogart and William Holden in Billy Wilder's 1954 comedy Sabrina. These last two films are arguably the ones that Hampden is most well known to modern audiences for. He also played long-bearded patriarchs in biblical epics like The Silver Chalice (1954) and The Prodigal (1955). (In The Silver Chalice, he was Joseph of Arimathea.)\n\nHampden reprised his legendary portrayal of Hercule Savinien Cyrano de Bergerac in the first episode of the radio program Great Scenes from Great Plays, which Hampden hosted from 1948-1949. In addition to his radio roles (The Adventures of Leonidas Witherall), Hampden also appeared in several dramas during the early days of television. He made his TV debut in 1949, playing Macbeth for the last time at the age of 69.\n\nHis last role was the non-singing one of King Louis XI of France, considered by some to be one of his best performances, in the otherwise unremarkable 1956 Technicolor remake of Rudolf Friml's 1925 operetta The Vagabond King. It was released posthumously, more than a year after Hampden's death.\n\nFor 27 years, Walter Hampden was president of the Players' Club. The club's library is named for him.\n\nDescription above from the Wikipedia article Walter Hampden, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1879-06-28",
        "deathday": "1955-06-11",
        "gender": 2,
        "homepage": null,
        "id": 50833,
        "imdb_id": "nm0358899",
        "known_for_department": "Acting",
        "name": "Walter Hampden",
        "place_of_birth": "Brooklyn, New York, USA",
        "popularity": 0.1204,
        "profile_path": "/wgkxdLPLCcqfSvjGCaFTqVeE7c4.jpg"
    }
}