{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ftNimlo6fP4WKRMWnF1ghX4fPUy.jpg",
                "genre_ids": [
                    35,
                    10749,
                    18
                ],
                "id": 6620,
                "original_language": "en",
                "original_title": "Sabrina",
                "overview": "Linus and David Larrabee are the two sons of a very wealthy family. Linus is all work – busily running the family corporate empire, he has no time for a wife and family. David is all play – technically he is employed by the family business, but never shows up for work, spends all his time entertaining, and has been married and divorced three times. Meanwhile, Sabrina Fairchild is the young, shy, and awkward daughter of the household chauffeur, who goes away to Paris for two years, and returns to capture David's attention, while falling in love with Linus.",
                "popularity": 3.8978,
                "poster_path": "/86ix9wBxiMAaISt4HpmXQm6Mlym.jpg",
                "release_date": "1954-09-01",
                "title": "Sabrina",
                "video": false,
                "vote_average": 7.505,
                "vote_count": 1294,
                "character": "Mr. Tyson",
                "credit_id": "52fe445fc3a36847f8091fed",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Francis Xavier Bushman",
            "King of the Movies"
        ],
        "biography": "Francis Xavier Bushman (January 10, 1883 – August 23, 1966) was an American actor, film director, and screenwriter. His matinee idol career started in 1911 in the silent film His Friend's Wife, but it did not survive the silent screen era. Bushman, like many of his contemporaries, broke into the film business via the stage. He was performing at Broncho Billy Anderson's Essanay Studios in Chicago, Illinois, where he was first noticed for his muscular, sculpted frame. He appeared in nearly 200 feature film roles—more than 175 films before 1920, and 17 in his screen debut year of 1911 alone. He also worked for the Vitagraph studio before signing with Metro in 1915.\n\nDescription above from the Wikipedia article Francis Xavier Bushman, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1883-01-09",
        "deathday": "1966-08-23",
        "gender": 2,
        "homepage": null,
        "id": 50837,
        "imdb_id": "nm0124279",
        "known_for_department": "Acting",
        "name": "Francis X. Bushman",
        "place_of_birth": "Baltimore, Maryland, USA",
        "popularity": 0.1994,
        "profile_path": "/odBlJ8CeRHqSd3qvhJXN2asevm0.jpg"
    }
}