{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tyWnJeMatQGLsiLfLsxBV0pp9nk.jpg",
                "genre_ids": [
                    18
                ],
                "id": 6619,
                "original_language": "it",
                "original_title": "Morte a Venezia",
                "overview": "Composer Gustav von Aschenbach travels to Venice for health reasons. There, he becomes obsessed with the stunning beauty of an adolescent Polish boy named Tadzio who is staying with his family at the same Grand Hôtel des Bains on the Lido as Aschenbach.",
                "popularity": 1.5969,
                "poster_path": "/s81SuFBSqY8T5Lrn5R8ucX8LKxi.jpg",
                "release_date": "1971-03-05",
                "title": "Death in Venice",
                "video": false,
                "vote_average": 7.279,
                "vote_count": 509,
                "character": "Tadzio",
                "credit_id": "52fe445ec3a36847f8091f47",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/aAM3cQmYGjjLQ24m0F0RWfjKQ57.jpg",
                "genre_ids": [
                    27,
                    18,
                    9648
                ],
                "id": 530385,
                "original_language": "en",
                "original_title": "Midsommar",
                "overview": "Several friends travel to Sweden to study as anthropologists a summer festival that is held every ninety years in the remote hometown of one of them. What begins as a dream vacation in a place where the sun never sets, gradually turns into a dark nightmare as the mysterious inhabitants invite them to participate in their disturbing festive activities.",
                "popularity": 8.6517,
                "poster_path": "/7LEI8ulZzO5gy9Ww2NVCrKmHeDZ.jpg",
                "release_date": "2019-07-03",
                "title": "Midsommar",
                "video": false,
                "vote_average": 7.156,
                "vote_count": 7612,
                "character": "Dan",
                "credit_id": "5c462c049251410e0a4f13b3",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Björn Johan Andrésen",
            "Björn Andresen",
            "Бьорн Йохан Андресен",
            "Бьорн Андресен"
        ],
        "biography": "Björn Johan Andrésen (born 26 January 1955, in Stockholm, Sweden) is a Swedish actor and musician. He is best known for playing the fourteen-year-old Tadzio in Luchino Visconti's 1971 film adaptation of the Thomas Mann novella Death in Venice.\n\nAndrésen had only appeared in one film, En kärlekshistoria (1970) at the time he was cast in Death in Venice, which gained him international recognition. While the film performed relatively poorly at the box office, Andrésen was noted for his performance as Tadzio, the beautiful young Polish boy with whom the film's older protagonist Gustav von Aschenbach becomes obsessed. Film historian Lawrence J. Quirk commented in his study The Great Romantic Films (1974) that some shots of Andrésen \"could be extracted from the frame and hung on the walls of the Louvre or the Vatican\".\n\nRumors circulated in America at the time of the film's release as to whether or not Andrésen was homosexual (as the role demanded that he appear to exchange romantic glances with the protagonist, and on another occasion, be kissed and caressed by another teenage boy). Andrésen emphatically denied these, and later recounted his discomfort at being forced by director Luchino Visconti during filming to visit a gay bar, where he attracted the attention of a number of older men.  Eager to dispel the rumors regarding his sexuality and to shed his \"pretty boy\" image, Andrésen thereafter avoided homosexual roles and parts which he felt would play off of his good looks, and was angry when feminist writer Germaine Greer used a photograph of him on the cover of her book The Beautiful Boy (2003) without first obtaining his personal permission. Although Greer did consult photographer David Bailey (who owned the copyright for the image) before publishing the book, Andrésen maintained that it is common practice when a party uses an image of a person which has been copyrighted by a different individual to inform the individual and that he would not have given his consent for Greer to use his picture if she had informed him of her plans.\n\nAndrésen has also appeared in several other films.These include Pelikaanimies (2004),  Kojan (1992) and Smugglarkungen (1985).",
        "birthday": "1955-01-26",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 50935,
        "imdb_id": "nm0001909",
        "known_for_department": "Acting",
        "name": "Björn Andrésen",
        "place_of_birth": "Stockholm, Sweden",
        "popularity": 1.6818,
        "profile_path": "/x3uO4FVbpLLjyyEf7xErhYo5FU.jpg"
    }
}