{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/i7n9u1SppzXcSO2EVgwEehzABzm.jpg",
                "genre_ids": [
                    37
                ],
                "id": 17529,
                "original_language": "en",
                "original_title": "True Grit",
                "overview": "The murder of her father sends a teenage tomboy on a mission of 'justice', which involves avenging her father's death. She recruits a tough old marshal, 'Rooster' Cogburn because he has 'true grit', and a reputation of getting the job done.",
                "popularity": 3.5697,
                "poster_path": "/9TjGjAD2deCtIG4ebi8LhIyFK6j.jpg",
                "release_date": "1969-06-11",
                "title": "True Grit",
                "video": false,
                "vote_average": 7.331,
                "vote_count": 818,
                "character": "\"Dirty Bob\"",
                "credit_id": "5ce9505ac3a3684f611eee58",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Oscar Weber (birth name)",
            "Oscar von Weber",
            "Karl Weber"
        ],
        "biography": "Carlos Rivas (born Oscar Weber) was a Hispanic/Latin American actor, best remembered as Lun Tha in The King and I (1956), Dirty Bob in True Grit (1969), and Hernandez in Topaz (1969).  Carlos Rivas was discovered in a bar in Mexico. He began his career in Latin American westerns, though his Argentinian films were actually filmed in Mexico.\n\nHis American debut was in The King and I (1956) opposite Rita Moreno. After this career highlight, he was quickly reduced to supporting roles. That same year of 1956 he appeared as Johnny Bravo in the TV western Cheyenne in the episode titled \"Johnny Bravo.\" Rivas had co-starring roles in two science fiction films, The Beast of Hollow Mountain (1956) and The Black Scorpion (1957). Rivas played Chingachgook in The Deerslayer (1957) with Lex Barker, Forrest Tucker, and Rita Moreno.\n\nIn 1970, Rivas joined Ricardo Montalban, Henry Darrow, and other Hispanic/Latin American actors in co-founding the Nosotros (\"We\") Foundation, a Los Angeles based organization devoted to improving the way Hispanic/Latin Americans are depicted in entertainment and advocating for Hispanic/Latin Americans in the movie and television industry.",
        "birthday": "1925-02-16",
        "deathday": "2003-06-16",
        "gender": 2,
        "homepage": null,
        "id": 50968,
        "imdb_id": "nm0729032",
        "known_for_department": "Acting",
        "name": "Carlos Rivas",
        "place_of_birth": "El Paso, Texas, USA",
        "popularity": 0.2132,
        "profile_path": "/mOelplJg663OVlxWvMX98FMy806.jpg"
    }
}