{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rhwGCD3AosYcPK7rTFHmL4NdrP1.jpg",
                "genre_ids": [
                    37
                ],
                "id": 6644,
                "original_language": "en",
                "original_title": "El Dorado",
                "overview": "Cole Thornton, a gunfighter for hire, joins forces with an old friend, Sheriff J.P. Harrah. Together with a fighter and a gambler, they help a rancher and his family fight a rival rancher that is trying to steal their water.",
                "popularity": 6.444,
                "poster_path": "/poJxkMtTA3E95lJ6RnBgNxF0Vmx.jpg",
                "release_date": "1966-12-17",
                "title": "El Dorado",
                "video": false,
                "vote_average": 7.352,
                "vote_count": 555,
                "character": "Luke MacDonald",
                "credit_id": "52fe4461c3a36847f8092935",
                "order": 19
            },
            {
                "adult": false,
                "backdrop_path": "/nJ0jz1J3zNja31UEMeklhgFeMw5.jpg",
                "genre_ids": [
                    53,
                    878,
                    9648
                ],
                "id": 1090,
                "original_language": "en",
                "original_title": "The Thirteenth Floor",
                "overview": "In Los Angeles, a wealthy man, known as Mr. Fuller, discovers a shocking secret about the world he lives in. Fearing for his life, he leaves a desperate message for a friend of his in the most unexpected place.",
                "popularity": 3.1108,
                "poster_path": "/7oaie3ZBc9UuWZLF24crro1pone.jpg",
                "release_date": "1999-04-16",
                "title": "The Thirteenth Floor",
                "video": false,
                "vote_average": 7.07,
                "vote_count": 1409,
                "character": "Singer",
                "credit_id": "5726648f9251415443000a60",
                "order": 32
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "John E. Crawford",
            "John Ernest Crawford",
            "Johnnie Crawford",
            "John Crawford",
            "Johnny"
        ],
        "biography": "John Ernest Crawford was an American actor, singer, and musician. He first performed before a national audience as a Mouseketeer. At age 12, Crawford rose to prominence playing Mark McCain in the ABC Western series, The Rifleman. Crawford was nominated for an Emmy Award for Best Supporting Actor at age 13 for his work on The Rifleman, which aired from 1958 to 1963.\n\nDisney started out with 24 original Mouseketeers. However, at the end of the first season, the studio reduced the number to 12, and Crawford was released from his contract. His first important break as an actor followed with the title role in a Lux Video Theatre production of \"Little Boy Lost\", a live NBC broadcast on March 15, 1956. He also appeared in the popular Western series The Lone Ranger, in 1956, in one of the few color episodes of that series. Following that performance, the young actor worked steadily with many seasoned actors and directors. Freelancing for two and one-half years, he accumulated almost 60 television credits, including featured roles in three episodes of NBC's The Loretta Young Show and an appearance as Manuel in, \"I Am an American\", an episode of the syndicated crime drama Sheriff of Cochise. He starred as Bobby Adams in the 1958 drama \"Courage of Black Beauty\". By the spring of 1958, he had also performed 14 demanding roles in live teleplays for NBC's Matinee Theatre, appeared on CBS's sitcom, Mr. Adams and Eve, in the Wagon Train episode \"The Sally Potter Story\" (in which Martin Milner also appeared) and on the syndicated series, Crossroads, Sheriff of Cochise, and Whirlybirds, and made three pilots of TV series. The third pilot, which was made as an episode of Dick Powell's Zane Grey Theater, was picked up by ABC and the first season of The Rifleman began filming in July 1958.\n\nCrawford had a brief career as a recording artist in the 1950s and 1960s. He continued to act on television and in film as an adult. Beginning in 1992, Crawford led the California-based Johnny Crawford Orchestra, a vintage dance orchestra that performed at special events.",
        "birthday": "1946-03-26",
        "deathday": "2021-04-29",
        "gender": 2,
        "homepage": "https://johnnycrawfordlegacy.com",
        "id": 50975,
        "imdb_id": "nm0186844",
        "known_for_department": "Acting",
        "name": "Johnny Crawford",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.5256,
        "profile_path": "/osonXywvOUJjGh8ykF9dOD2eR72.jpg"
    }
}