{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kIBBeb94FbNfLSljeFUxUoszflb.jpg",
                "genre_ids": [
                    18,
                    10752,
                    36
                ],
                "id": 17295,
                "original_language": "it",
                "original_title": "La battaglia di Algeri",
                "overview": "Paratrooper commander Colonel Mathieu, a former French Resistance fighter during World War II, is sent to Algeria to reinforce efforts to squelch the uprisings of the Algerian War. There he faces Ali la Pointe, a former petty criminal who, as the leader of the Algerian Front de Liberation Nationale, directs terror strategies against the colonial French government occupation. As each side resorts to ever-increasing brutality, no violent act is too unthinkable.",
                "popularity": 2.1462,
                "poster_path": "/2p3AFtOHFvP6OeVMqlnL1zLKOqL.jpg",
                "release_date": "1966-09-08",
                "title": "The Battle of Algiers",
                "video": false,
                "vote_average": 7.872,
                "vote_count": 826,
                "character": "Larbi Ben M'hidi",
                "credit_id": "6755fdad764fd94e422f5a53",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Mohamed Baghdadi",
            "سي محمد بغدادي"
        ],
        "biography": "Si Mohamed Baghdadi (in Arabic: سي محمد بغدادي), born on June 26, 1937 in Souk Ahras in Algeria, joined the historic Wilaya III in 1961 during the Algerian war of national liberation. After Algerian independence, he had a career as a high-level athlete, winning the title of Algerian champion in the 800 m and 4x400 m, before occupying the position of president of the Algerian Athletics Federation from 1967 to 1969.\n\nA distinguished professor of literature, a renowned writer, then censor at the El-Mokrani High School in Ben Aknoun, he had the respect of his colleagues and his students, the latter testify. The late Baghdadi subsequently joined the Ministry of Youth and Sports, where he was director of the education and sports department and then secretary general. He retired in 1986, before being elected to the position of President of the Algerian Olympic Committee (March 1988 – November 1989).\n\nA human rights activist, Si Mohamed Baghdadi was a member of the Citizens' Committee for the Defense of the Republic (CCDR). Participating in the animation of an associative movement, he created the National Association for the Defense of Children's Rights (ANADDE). A sportsman, he was President of the Algerian Olympic Committee (COA). An anti-globalization activist, he contributed to the creation of the Algerian Social Forum (FSA). Finally, a storyteller and poet, he created the Atelier des Femmes Conteuses.\n\nAlso an actor, he played the role of Larbi Ben M'hidi in the film The Battle of Algiers (1966) by Gillo Pontecorvo.\n\nAfter a rich life dedicated to education, sport and youth, Si Mohamed Baghdadi died on September 2, 2023.",
        "birthday": "1937-06-26",
        "deathday": "2023-09-02",
        "gender": 2,
        "homepage": "http://forumdesdemocrates.over-blog.com/article-mains-libres-le-documentaire-disparu-103647664.html",
        "id": 5107215,
        "imdb_id": "nm16812346",
        "known_for_department": "Acting",
        "name": "Si Mohamed Baghdadi",
        "place_of_birth": "Souk Ahras, Algeria",
        "popularity": 0.0214,
        "profile_path": "/rjInfnTbj5FaXzFvA1JaorAmpHm.jpg"
    }
}