{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bk2fTuIhQIvdAA3RbnrnvLvuaTc.jpg",
                "genre_ids": [
                    10402,
                    35,
                    28,
                    80
                ],
                "id": 525,
                "original_language": "en",
                "original_title": "The Blues Brothers",
                "overview": "Jake Blues, just released from prison, puts his old band back together to save the Catholic home where he and his brother Elwood were raised.",
                "popularity": 6.5189,
                "poster_path": "/rhYJKOt6UrQq7JQgLyQcSWW5R86.jpg",
                "release_date": "1980-06-16",
                "title": "The Blues Brothers",
                "video": false,
                "vote_average": 7.727,
                "vote_count": 4373,
                "character": "Waiter",
                "credit_id": "52fe424dc3a36847f8013b85",
                "order": 35
            },
            {
                "adult": false,
                "backdrop_path": "/mT2sN8L8DNjzb0wISls8XHnyjgs.jpg",
                "genre_ids": [
                    10751,
                    878,
                    12
                ],
                "id": 10122,
                "original_language": "en",
                "original_title": "Flight of the Navigator",
                "overview": "12-year-old David is accidentally knocked out in the forest near his home, but when he awakens eight years have passed. His family is overjoyed to have him back, but is just as perplexed as he is that he hasn't aged. When a NASA scientist discovers a UFO nearby, David gets the chance to unravel the mystery and recover the life he lost.",
                "popularity": 3.5906,
                "poster_path": "/tdRgQWMximj0tL6OWu9kRTtePmI.jpg",
                "release_date": "1986-07-30",
                "title": "Flight of the Navigator",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 886,
                "character": "Max (voice)",
                "credit_id": "52fe432d9251416c7500673d",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/v3ClsT59peXyGJ4XuDvIQAPwcZy.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 4133,
                "original_language": "en",
                "original_title": "Blow",
                "overview": "A boy named George Jung grows up in a struggling family in the 1950's. His mother nags at her husband as he is trying to make a living for the family. It is finally revealed that George's father cannot make a living and the family goes bankrupt. George does not want the same thing to happen to him, and his friend Tuna, in the 1960's, suggests that he deal marijuana. He is a big hit in California in the 1960's, yet he goes to jail, where he finds out about the wonders of cocaine. As a result, when released, he gets rich by bringing cocaine to America. However, he soon pays the price.",
                "popularity": 6.9266,
                "poster_path": "/yYZFVfk8aeMP4GxBSU9MTvqs9mJ.jpg",
                "release_date": "2001-04-04",
                "title": "Blow",
                "video": false,
                "vote_average": 7.358,
                "vote_count": 4437,
                "character": "Derek Foreal",
                "credit_id": "52fe43aec3a36847f8067537",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/iXlHfi9hq7nfSv31pBab8fpMfZh.jpg",
                "genre_ids": [
                    35,
                    10751,
                    14
                ],
                "id": 10830,
                "original_language": "en",
                "original_title": "Matilda",
                "overview": "Matilda Wormwood is an exquisite and intelligent little girl. Unfortunately, her parents, Harry and Zinnia misunderstand her because they think she is so different. As time passes, she finally starts school and has a kind teacher, loyal friends, and a sadistic headmistress. As she gets fed up with the constant cruelty, she begins to realize that she has a gift of telekinetic powers. After some days of practice, she suddenly turns the tables to stand up to Harry and Zinnia and outwit the headmistress.",
                "popularity": 6.6204,
                "poster_path": "/wYoDpWInsBEVSmWStnRH06ddoyk.jpg",
                "release_date": "1996-08-02",
                "title": "Matilda",
                "video": false,
                "vote_average": 7.165,
                "vote_count": 4617,
                "character": "FBI Agent",
                "credit_id": "52fe43be9251416c7501c68b",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/xWT5F1DNxciNLEMXRl49iq8zvN7.jpg",
                "genre_ids": [
                    14,
                    16,
                    10751
                ],
                "id": 9479,
                "original_language": "en",
                "original_title": "The Nightmare Before Christmas",
                "overview": "Tired of scaring humans every October 31 with the same old bag of tricks, Jack Skellington, the spindly king of Halloween Town, kidnaps Santa Claus and plans to deliver shrunken heads and other ghoulish gifts to children on Christmas morning. But as Christmas approaches, Jack's rag-doll girlfriend, Sally, tries to foil his misguided plans.",
                "popularity": 13.022,
                "poster_path": "/oQffRNjK8e19rF7xVYEN8ew0j7b.jpg",
                "release_date": "1993-10-09",
                "title": "The Nightmare Before Christmas",
                "video": false,
                "vote_average": 7.834,
                "vote_count": 9891,
                "character": "Lock (voice)",
                "credit_id": "52fe44fdc3a36847f80b60c3",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/ihIVjdiuvtVuFUaCqfNJwajIs3i.jpg",
                "genre_ids": [
                    14,
                    10402
                ],
                "id": 13192,
                "original_language": "en",
                "original_title": "Moonwalker",
                "overview": "Moonwalker is a 1988 American experimental anthology musical film starring Michael Jackson. Rather than featuring one continuous narrative, the film expresses the influence of fandom and innocence through a collection of short films about Jackson, some of which are long-form music videos from Jackson's 1987 album Bad. The film is named after his famous dance, \"the moonwalk\", which he originally learned as \"the backslide\" but perfected the dance into something no one had seen before. The movie's introduction is a type of music video for Jackson's \"Man in the Mirror\" but is not the official video for the song. The film then expresses a montage of Michael's career, which leads into a parody of his Bad video titled \"Badder\", followed by sections \"Speed Demon\" and \"Leave Me Alone\". What follows is the biggest section where Michael plays a hero with magical powers and saves three children from Mr. Big. This section is \"Smooth Criminal\" which leads into a performance of \"Come Together\".",
                "popularity": 3.8317,
                "poster_path": "/3GwTPQkAcgDeAirRpEuJG8HDdRz.jpg",
                "release_date": "1988-10-29",
                "title": "Moonwalker",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 586,
                "character": "Pee-wee Herman (voice) (uncredited)",
                "credit_id": "656c0ab256846301516386be",
                "order": 37
            },
            {
                "adult": false,
                "backdrop_path": "/moYfd709S8xnb8Od2yeG5VBt9Bp.jpg",
                "genre_ids": [
                    28,
                    14
                ],
                "id": 364,
                "original_language": "en",
                "original_title": "Batman Returns",
                "overview": "The monstrous Penguin, who dwells in the sewers beneath Gotham, joins up with corrupt mayoral candidate Max Shreck to topple the Batman once and for all. But when Shreck's timid assistant Selina Kyle finds out, and Shreck tries to kill her, she's transformed into the sexy Catwoman. She teams up with the Penguin and Shreck to destroy Batman, but sparks fly unexpectedly when she confronts the caped crusader.",
                "popularity": 7.1529,
                "poster_path": "/jKBjeXM7iBBV9UkUcOXx3m7FSHY.jpg",
                "release_date": "1992-06-19",
                "title": "Batman Returns",
                "video": false,
                "vote_average": 6.943,
                "vote_count": 6793,
                "character": "Penguin's Father",
                "credit_id": "5a5f962bc3a36877d10058d2",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Paul Rubenfeld",
            "Pee-wee Herman",
            "Pee Wee Herman",
            "Pee-wee",
            "Pee Wee",
            "Paul Mall",
            "폴 루번스"
        ],
        "biography": "Paul Reubens (August 27, 1952 – July 30, 2023) was an American actor, writer, film producer, game show host, and comedian, best known for his character Pee-wee Herman. Reubens joined the Los Angeles troupe The Groundlings in the 1970s and started his career as an improvisational comedian and stage actor. In 1982 he began appearing in a show about a character he had been developing for years. The show, called The Pee-wee Herman Show, ran for five sold-out months, and HBO produced a successful special about it.\n\nPee-wee became an instant cult figure and, for the next decade, Reubens was completely committed to his character, doing all of his public appearances and interviews as Pee-wee. His feature film Pee-wee's Big Adventure (1985), directed by the then-unknown Tim Burton, was a financial and critical success and soon developed into a cult film. Its sequel, Big Top Pee-wee (1988), was less successful. Between 1986 and 1990, Reubens starred as Pee-wee in the CBS Saturday-morning children's program Pee-wee's Playhouse.",
        "birthday": "1952-08-27",
        "deathday": "2023-07-30",
        "gender": 2,
        "homepage": "https://peewee.com",
        "id": 5129,
        "imdb_id": "nm0000607",
        "known_for_department": "Acting",
        "name": "Paul Reubens",
        "place_of_birth": "Peekskill, New York, USA",
        "popularity": 0.713,
        "profile_path": "/ybp9v90mrHtYVQkgHcf5lSAkt76.jpg"
    }
}