{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/p47ihFj4A7EpBjmPHdTj4ipyq1S.jpg",
                "genre_ids": [
                    18
                ],
                "id": 599,
                "original_language": "en",
                "original_title": "Sunset Boulevard",
                "overview": "A hack screenwriter writes a screenplay for a former silent film star who has faded into Hollywood obscurity.",
                "popularity": 5.7842,
                "poster_path": "/sC4Dpmn87oz9AuxZ15Lmip0Ftgr.jpg",
                "release_date": "1950-08-10",
                "title": "Sunset Boulevard",
                "video": false,
                "vote_average": 8.293,
                "vote_count": 2743,
                "character": "Editor (uncredited)",
                "credit_id": "5b698c3692514168b606d661",
                "order": 20
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/3e3dVaVrla2GH6CWKbNRjTvk3s8.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 6844,
                "original_language": "en",
                "original_title": "The Ten Commandments",
                "overview": "Escaping death, a Hebrew infant is raised in a royal household to become a prince. Upon discovery of his true heritage, Moses embarks on a personal quest to reclaim his destiny as the leader and liberator of the Hebrew people.",
                "popularity": 10.0884,
                "poster_path": "/3Ei59AR64x6dMZfWobPCkZjbqTL.jpg",
                "release_date": "1956-10-05",
                "title": "The Ten Commandments",
                "video": false,
                "vote_average": 7.769,
                "vote_count": 1743,
                "credit_id": "52fe4466c3a36847f8093b25",
                "department": "Editing",
                "job": "Editor"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia\n\nAnne Bauchens (February 2, 1882 – May 7, 1967) was an American film editor who is particularly noted for her collaboration over 40 years with the director Cecil B. DeMille. When the Academy Award for Film Editing was created in 1934, Bauchens received one of the three nominations for her editing of Cleopatra. She later won the Academy Award for North West Mounted Police (1940).\n\nBauchens was trained as an editor by DeMille, and shared her first credit with him on the film Carmen. Prior to 1918, DeMille had edited, as well as directed, his films. After Carmen and We Can't Have Everything (1918), Bauchens no longer shared the editing credits with DeMille. She edited DeMille's films for the rest of their long careers, through the 1956 film The Ten Commandments. She was nominated for the Academy Award for Film editing again twice, for The Greatest Show on Earth in 1952 and for The Ten Commandments in 1956. In total, Bauchens' editing is credited on 41 films directed by DeMille, and on 20 films with other directors.\n\nDespite her long career and her series of awards, the characterizations of Bauchens as an editor are not invariably flattering. Margaret Booth, another distinguished film editor, has been quoted as saying in 1965 that, \"Anne Bauchens is the oldest editor in the business. She was editing for years before I came into the business. DeMille was a bad editor, I thought, and made her look like a bad editor. I think Anne really would have been a good editor, but she had to put up with him––which was something.\"",
        "birthday": "1882-02-02",
        "deathday": "1967-05-07",
        "gender": 1,
        "homepage": null,
        "id": 51311,
        "imdb_id": "nm0061640",
        "known_for_department": "Editing",
        "name": "Anne Bauchens",
        "place_of_birth": "St. Louis, Missouri, USA",
        "popularity": 0.0835,
        "profile_path": "/dPQBDmk1HAjNmfY74pmO5Y3UYs8.jpg"
    }
}