{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qK7Ssnrfvrt65F66A1thvehfQg2.jpg",
                "genre_ids": [
                    16,
                    10751,
                    35,
                    12,
                    9648
                ],
                "id": 420821,
                "original_language": "en",
                "original_title": "Chip 'n Dale: Rescue Rangers",
                "overview": "Decades since their successful television series was canceled, Chip has succumbed to a life of suburban domesticity as an insurance salesman. Dale, meanwhile, has had CGI surgery and works the nostalgia convention circuit, desperate to relive his glory days. When a former cast mate mysteriously disappears, Chip and Dale must repair their broken friendship and take on their Rescue Rangers detective personas once again to save their friend’s life.",
                "popularity": 3.4456,
                "poster_path": "/7UGmn8TyWPPzkjhLUW58cOUHjPS.jpg",
                "release_date": "2022-05-20",
                "title": "Chip 'n Dale: Rescue Rangers",
                "video": false,
                "vote_average": 6.998,
                "vote_count": 1300,
                "character": "Dave Bollinari (voice)",
                "credit_id": "620bc5a2c3514c00432e8167",
                "order": 20
            },
            {
                "adult": false,
                "backdrop_path": "/5rARlA8beRAVXPYzSaF2NoS8Ry5.jpg",
                "genre_ids": [
                    16,
                    35,
                    10751,
                    14
                ],
                "id": 76492,
                "original_language": "en",
                "original_title": "Hotel Transylvania",
                "overview": "Welcome to Hotel Transylvania, Dracula's lavish five-stake resort, where monsters and their families can live it up and no humans are allowed. One special weekend, Dracula has invited all his best friends to celebrate his beloved daughter Mavis's 118th birthday. For Dracula catering to all of these legendary monsters is no problem but the party really starts when one ordinary guy stumbles into the hotel and changes everything!",
                "popularity": 9.9987,
                "poster_path": "/eJGvzGrsfe2sqTUPv5IwLWXjVuR.jpg",
                "release_date": "2012-09-20",
                "title": "Hotel Transylvania",
                "video": false,
                "vote_average": 6.963,
                "vote_count": 8887,
                "character": "Mr. Fly (voice)",
                "credit_id": "5635361fc3a3681b54018cbb",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/lxCUDgZ54myV7goBrkpFoHRt9Ms.jpg",
                "genre_ids": [
                    28,
                    35,
                    80
                ],
                "id": 64688,
                "original_language": "en",
                "original_title": "21 Jump Street",
                "overview": "When cops Schmidt and Jenko join the secret Jump Street unit, they use their youthful appearances to go undercover as high school students. They trade in their guns and badges for backpacks, and set out to shut down a dangerous drug ring. But, as time goes on, Schmidt and Jenko discover that high school is nothing like it was just a few years earlier -- and, what's more, they must again confront the teenage terror and anxiety they thought they had left behind.",
                "popularity": 6.2334,
                "poster_path": "/8v3Sqv9UcIUC4ebmpKWROqPBINZ.jpg",
                "release_date": "2012-03-14",
                "title": "21 Jump Street",
                "video": false,
                "vote_average": 6.883,
                "vote_count": 10614,
                "character": "Mr. Gordon",
                "credit_id": "5ae9d75b9251412479009274",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "크리스 파넬",
            "Thomas Christopher Parnell",
            "کریس پارنل"
        ],
        "biography": "​Thomas Christopher \"Chris\" Parnell (born February 5, 1967) is an American comic actor best known as a cast member on Saturday Night Live from 1998–2006 and currently for his recurring role as Dr. Leo Spaceman on NBC's Emmy Award-winning comedy series 30 Rock. Parnell is currently one of the lead voices on the FX animated comedy Archer. In 2010, Parnell starred alongside his former SNL castmate Horatio Sanz in the Comedy Central series Big Lake.\n\nAfter performing as a company player with The Groundlings for a number of years, Parnell was hired to join the cast of Saturday Night Live as a featured player on September 26, 1998, and was promoted to repertory player the following season. In the summer of 2001, budget cuts and hiring four new cast members required Lorne Michaels to dismiss two cast members; he chose to lay off Parnell and Jerry Minor over Horatio Sanz, Rachel Dratch, and Maya Rudolph.\n\nWhile on SNL, Parnell appeared in numerous sketches, and commercial parodies, and performed memorable impressions of various celebrities. One of his most popular sketches is Lazy Sunday, a rap video he shot with Andy Samberg about buying cupcakes and going to see The Chronicles of Narnia. He has also performed raps about hosts Jennifer Garner, Britney Spears, Kirsten Dunst and Ashton Kutcher.\n\nIn the summer of 2006, Lorne Michaels announced that four cast members would be fired due to budget cuts, but he did not say who. On September 22, 2006 it was announced that three cast members had been fired: Parnell, Horatio Sanz, and Finesse Mitchell. This effectively made him the only SNL performer to have been fired twice by Lorne Michaels, though Parnell did say in a 2008 interview with The Sound of Young America podcast that he was okay with being let go this time, because he was considering leaving after that season anyway, but added that he probably would have stayed one last season if he was asked back. He had been with SNL for eight seasons; at the time only four people (Darrell Hammond, Tim Meadows, Kevin Nealon, and Al Franken) have been cast members longer. He has since made uncredited cameo appearances on the show, most recently in 2008 parodying newscasters Tom Brokaw, Jim Lehrer, and Bob Schieffer.\n\nParnell and his former SNL castmate Horatio Sanz recently starred together in Big Lake, a 2010 sitcom on Comedy Central from executive producers Will Ferrell and Adam McKay.\n\nHe also recently appeared as Dr. Drummer/Santa in the SyFy Holiday Special episode from the television show Eureka, which aired on December 7, 2010 (Season 4 Episode 10).",
        "birthday": "1967-02-05",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 51382,
        "imdb_id": "nm0663177",
        "known_for_department": "Acting",
        "name": "Chris Parnell",
        "place_of_birth": "Memphis, Tennessee, USA",
        "popularity": 1.3558,
        "profile_path": "/9Ga03Y9TVIqTZJ4I9rfL740ibgJ.jpg"
    }
}