{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sw7mordbZxgITU877yTpZCud90M.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 769,
                "original_language": "en",
                "original_title": "GoodFellas",
                "overview": "The true story of Henry Hill, a half-Irish, half-Sicilian Brooklyn kid who is adopted by neighbourhood gangsters at an early age and climbs the ranks of a Mafia family under the guidance of Jimmy Conway.",
                "popularity": 15.4085,
                "poster_path": "/aKuFiU82s5ISJpGZp7YkIr3kCUd.jpg",
                "release_date": "1990-09-12",
                "title": "GoodFellas",
                "video": false,
                "vote_average": 8.5,
                "vote_count": 13626,
                "character": "Henry Greeter #1",
                "credit_id": "56048e1ac3a3685c56000153",
                "order": 84
            },
            {
                "adult": false,
                "backdrop_path": "/7JqWWLCajnt6XWCrRlgvtsYP0u6.jpg",
                "genre_ids": [
                    28,
                    18
                ],
                "id": 678512,
                "original_language": "en",
                "original_title": "Sound of Freedom",
                "overview": "The story of Tim Ballard, a former US government agent, who quits his job in order to devote his life to rescuing children from global sex traffickers.",
                "popularity": 5.8337,
                "poster_path": "/qA5kPYZA7FkVvqcEfJRoOy4kpHg.jpg",
                "release_date": "2023-07-03",
                "title": "Sound of Freedom",
                "video": false,
                "vote_average": 7.99,
                "vote_count": 2596,
                "character": "Border Patrol Captain",
                "credit_id": "5f2b2ad179a1c300363192f1",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/7WJjFviFBffEJvkAms4uWwbcVUk.jpg",
                "genre_ids": [
                    14,
                    12
                ],
                "id": 451048,
                "original_language": "en",
                "original_title": "Jungle Cruise",
                "overview": "Dr. Lily Houghton enlists the aid of wisecracking skipper Frank Wolff to take her down the Amazon in his dilapidated boat. Together, they search for an ancient tree that holds the power to heal – a discovery that will change the future of medicine.",
                "popularity": 7.6663,
                "poster_path": "/3UPz63cGsAQlYQnkOHfAbUhl1O3.jpg",
                "release_date": "2021-07-28",
                "title": "Jungle Cruise",
                "video": false,
                "vote_average": 7.329,
                "vote_count": 5905,
                "character": "Italian Tourist",
                "credit_id": "60afa764dff66e00403fe643",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "James Quarter",
            "James Quatrochi"
        ],
        "biography": "James Quattrochi arrived in Los Angeles in 1991 - a young actor wanting to expand his involvement in the film industry. Having acted in many interesting projects his dream was to take his talents behind the camera. In 1995 James produced and stared in, In the Kingdom of the Blind, with William Petersen, Paul Winfield and Michael Biehn. The film was an official selection of the Palm Springs Film Festival and The Santa Barbara Film Festival. \"Kingdom\" went on to receive worldwide distribution, allowing James to follow up this project by directing the critically acclaimed film \"True Friends\". This film won the Charleston International Film Festival and James was voted \"Best Up And Coming Director\" by the Laifa Film Awards, with James receiving a letter of endorsement from director Martin Scorcese. The film was also honored with the Imagen Award, having been chosen over \"The Mask of Zorro\".\n\nJames followed \"True Friends\" by directing \"Jesus, Mary and Joey, starring Olympia Dukakis, Charles Durning, Stacy Keach, Jennifer Esposito, Marley Shelton, Leo Rossi, Jason Gedrick and Mellisa Joan Hart. James then took on the immense challenges of producing Choker, a film that was conceived, written, cast and shot in the span of only nine weeks.\n\nLast year James was hired to produce \"All In\" A father and daughter who get caught up in the world of championship poker, the film stars Dominique Swain, Michael Madsen, Academy Award Winner Louis Gossett, Jr., and James Russo. This film now has world wide distribution through Fox.\n\nHis recent project \"The Prince and The Pauper\" James produced and directed this feature film starring The Sprouse Twins. Sony Pictures has signed on to distribute the film.",
        "birthday": "1961-06-19",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 51656,
        "imdb_id": "nm0006786",
        "known_for_department": "Acting",
        "name": "James Quattrochi",
        "place_of_birth": "Bronx, New York, USA",
        "popularity": 0.1915,
        "profile_path": "/fy7pSTUy6JfZRdaYhsTWNZ84IHw.jpg"
    }
}