{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yY76zq9XSuJ4nWyPDuwkdV7Wt0c.jpg",
                "genre_ids": [
                    28,
                    53,
                    878
                ],
                "id": 577922,
                "original_language": "en",
                "original_title": "Tenet",
                "overview": "Armed with only one word - Tenet - and fighting for the survival of the entire world, the Protagonist journeys through a twilight world of international espionage on a mission that will unfold in something beyond real time.",
                "popularity": 9.5361,
                "poster_path": "/aCIFMriQh8rvhxpN1IWGgvH0Tlg.jpg",
                "release_date": "2020-08-22",
                "title": "Tenet",
                "video": false,
                "vote_average": 7.175,
                "vote_count": 10477,
                "character": "SWAT 3",
                "credit_id": "64ba671dab6849011c076cab",
                "order": 20
            },
            {
                "adult": false,
                "backdrop_path": "/qVgLMRVNB5bHU0inmRa0ueShacN.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 131634,
                "original_language": "en",
                "original_title": "The Hunger Games: Mockingjay - Part 2",
                "overview": "As the war between the Capitol and the districts reaches its peak, Katniss Everdeen embarks on a perilous mission to liberate Panem and confront President Snow. Joined by a team of trusted allies, she navigates deadly traps, shifting loyalties, and the heavy cost of rebellion, determined to bring freedom to her people and end the Hunger Games once and for all.",
                "popularity": 8.763,
                "poster_path": "/lImKHDfExAulp16grYm8zD5eONE.jpg",
                "release_date": "2015-11-18",
                "title": "The Hunger Games: Mockingjay - Part 2",
                "video": false,
                "vote_average": 6.897,
                "vote_count": 12930,
                "character": "Castor",
                "credit_id": "52fe4b7bc3a368484e18b0fd",
                "order": 15
            },
            {
                "adult": false,
                "backdrop_path": "/k2ZdjMXmqnw4RJeh8cwxCvcznJZ.jpg",
                "genre_ids": [
                    18
                ],
                "id": 50014,
                "original_language": "en",
                "original_title": "The Help",
                "overview": "Aibileen Clark is a middle-aged African-American maid who has spent her life raising white children and has recently lost her only son; Minny Jackson is an African-American maid who has often offended her employers despite her family's struggles with money and her desperate need for jobs; and Eugenia \"Skeeter\" Phelan is a young white woman who has recently moved back home after graduating college to find out her childhood maid has mysteriously disappeared. These three stories intertwine to explain how life in Jackson, Mississippi revolves around \"the help\"; yet they are always kept at a certain distance because of racial lines.",
                "popularity": 11.3368,
                "poster_path": "/3kmfoWWEc9Vtyuaf9v5VipRgdjx.jpg",
                "release_date": "2011-08-09",
                "title": "The Help",
                "video": false,
                "vote_average": 8.204,
                "vote_count": 8680,
                "character": "Carlton Phelan",
                "credit_id": "5790183b925141277b00635a",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "John Wesley Chatham ",
            "Уэс Чэтэм"
        ],
        "biography": "Wes Chatham (born 11 October 1978) is an American actor best known for his roles as Amos Burton in the science fiction series The Expanse (2015–2022) and Castor in The Hunger Games film series (2014-2015).\n\nChatham was born in Atlanta and grew up in North Georgia. Wes's parents divorced when he was two and he spent most of his childhood with his mother, sister, and brother. On a whim, Wes's mother took his sister to a audition for a Tide commercial in Savannah, Georgia and brought him along. While waiting for his sister in the lobby, the casting director discovered Wes and, at the age of seven, he received his first acting job for Tide.\n\nAt the age of thirteen, Chatham moved in with his father and, without a lot of supervision and as a restless and rebellious teen, he was kicked out of high school and sent to a second chance school in Lawrenceville to finish his education. While attending classes, a professional theater company out of Atlanta started a mentoring program with the school and Chatham was chosen to write a play that was later performed by his classmates. From this experience, Chatham found his passion for the arts.\n\nAfter graduating high school, Chatham joined the military as an aviation firefighter on the flight deck of the USS Essex, working in crash and salvage for four years. Chatham's break into acting came just three months before his tour was finished when Denzel Washington chose his ship to shoot the movie Antwone Fisher. While searching for some authentic military personnel for the film, Chatham was discovered by casting director Robi Reed and given his first movie-making experience; that's when he decided he wanted to pursue his lifelong dream of acting. Following Antwone Fisher, Reed convinced Chatham to make the move to Hollywood and shortly thereafter cast him in his first series regular role on Showtime's Barbershop.\n\nChatham gained further attention acting alongside Tommy Lee Jones as Corporal Steve Penning in Paul Haggis's In the Valley of Elah (2007) and as Frank Benedict, George W. Bush's fraternity brother, in Oliver Stone's biopic W. (2008). The following year, Chatham landed another series regular role on CBS' hit TV show The Unit as Staff Sergeant Sam McBride, working with showrunners David Mamet and Shawn Ryan. Chatham also starred as Brian in the supernatural horror film Husk (2011).\n\nIn 2011, Chatham was a part of the ensemble cast of The Help, portraying Carleton Phelan, the brother of Emma Stone's character. In 2012, the film won Outstanding Ensemble at the Screen Actors Guild Awards, and went on to receive four Academy Award nominations including Best Picture. In 2012, he landed his first title role in Joel Silver's The Philly Kid; as a fan of mixed martial arts, Chatham dived into the character of Dillion McGwire, performing all of his own stunts. Chatham gained wider recognition for playing Castor in The Hunger Games: Mockingjay - Part 1 (2014) and Part 2 (2015), an adaptation of Suzanne Collins' best-selling young adult dystopian novel, before landing a starring role as Amos Burton in the SyFy series The Expanse (2015-2022).",
        "birthday": "1978-10-11",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 51682,
        "imdb_id": "nm1434871",
        "known_for_department": "Acting",
        "name": "Wes Chatham",
        "place_of_birth": "Atlanta, Georgia, USA",
        "popularity": 0.4191,
        "profile_path": "/lFoUyX8FZs3XvUWWItCm2ezvAEs.jpg"
    }
}