{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2oQ9hnAYsoZH61PnjSkuX4Uvd2d.jpg",
                "genre_ids": [
                    10749,
                    18,
                    53
                ],
                "id": 3767,
                "original_language": "en",
                "original_title": "Gilda",
                "overview": "A gambler discovers an old flame while in Argentina, but she's married to his new boss.",
                "popularity": 3.3808,
                "poster_path": "/46eKPjoWEyNBAQKDoXEcDFBcaUw.jpg",
                "release_date": "1946-04-25",
                "title": "Gilda",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 609,
                "character": "Capt. Delgado",
                "credit_id": "52fe43a4c3a36847f80641d5",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Gerald Mohr was an American radio, film and television character actor who appeared in more than 500 radio plays, 73 films and over 100 television shows.  Born in New York City, he was educated in Dwight Preparatory School in New York City, where he learned to speak fluent French and German. At Columbia University, where he was on a course to become a doctor, before being discovered as promising voice talent by a radio producer. Mohr was hired by the radio station and became a junior reporter. In the mid-1930s, Orson Welles invited him to join his formative Mercury Theatre and appeared on Broadway.    Mohr began appearing in films in the late 1930s, playing his first villain role in the 15-part cliffhanger serial Jungle Girl (1941). After three years' service in the US Army Air Forces during World War II, he returned to Hollywood, starring and appearing in numerous movies until 1949 when he joined Fred Foy has co-announcer for the first series of The Lone Ranger.    From the 1950s on, he appeared as a guest star in more than one hundred television series, mostly westerns, though several comedy, variety, crime, and early science fiction serials.  Mohr is remembered for his performance as \"Ricky's friend\" psychiatrist 'Dr. Henry Molin' (real life name of the assistant film editor on the show) in the classic February 1953 I Love Lucy episode, \"The Inferiority Complex\". Mohr's repeated line was, \"Treatment, Ricky. Treatment\".  ",
        "birthday": "1914-06-11",
        "deathday": "1968-11-09",
        "gender": 2,
        "homepage": null,
        "id": 51717,
        "imdb_id": "nm0596056",
        "known_for_department": "Acting",
        "name": "Gerald Mohr",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.346,
        "profile_path": "/jJx5f6K7OkDD2LcHZTPtYYd4T97.jpg"
    }
}