{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dAE4x4BgauvsRkErmLg1L05LNAV.jpg",
                "genre_ids": [
                    9648,
                    27,
                    10749
                ],
                "id": 25508,
                "original_language": "en",
                "original_title": "Cat People",
                "overview": "A Serbian émigré in Manhattan believes that, because of an ancient curse, any physical intimacy with the man she loves will turn her into a feline predator.",
                "popularity": 1.4683,
                "poster_path": "/zSNTDd5Q6No5BmY39Zp5BVgl8XE.jpg",
                "release_date": "1942-12-05",
                "title": "Cat People",
                "video": false,
                "vote_average": 6.921,
                "vote_count": 624,
                "character": "Oliver Reed",
                "credit_id": "52fe44ccc3a368484e03782b",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Kenneth Smith",
            "Frank Kent Smith"
        ],
        "biography": "Kent Smith (born Frank Kent Smith) was an American stage, screen, and television actor.\n\nSmith's early acting experience started in 1925 when he was one of the founders of the famed Harvard \"University Players\", which later included Henry Fonda, James Stewart, Joshua Logan and Margaret Sullavan in Falmouth, Massachusetts. Smith's stock experience also included productions with the Maryland Theatre in Baltimore. His professional acting debut was in 1929 in Blind Window in Baltimore, Mayland. He made his Broadway acting debut in 1932 in Men Must Fight. He also appeared on Broadway in Measure for Measure, Sweet Love Remembered, The Best Man, Ah, Wilderness!, Dodsworth, Saint Joan,, Old Acquaintance, Antony and Cleopatra and Bus Stop.\n\nSmith moved to Hollywood, California, where he made his film debut in The Garden Murder Case.\n\nHe appeared in such films as Cat People, Hitler's Children, This Land Is Mine, Three Russian Girls, Youth Runs Wild, The Curse of the Cat People, The Spiral Staircase, Nora Prentiss, Magic Town, My Foolish Heart, The Fountainhead, and The Damned Don't Cry. He continued acting in films such as Comanche, Sayonara, Party Girl, The Mugger, Imitation General, The Badlanders, This Earth Is Mine, Strangers When We Meet, Susan Slade, The Balcony, A Distant Trumpet, Youngblood Hawke, and The Young Lovers.\n\nSmith had roles in television films such as How Awful About Allan, The Night Stalker, The Judge and Jake Wyler, The Cat Creature, The Affair and The Disappearance of Flight 412. His numerous television credits included a continuing role in the soap opera Peyton Place as Dr. Robert Morton; Smith's wife, actress Edith Atwater, played his character's wife on the series. He began guest-starring in television series in 1949 in The Philco Television Playhouse, and also appeared in Robert Montgomery Presents, Wagon Train, General Electric Theater, Alfred Hitchcock Presents, Naked City, Have Gun Will Travel, Perry Mason, Gunsmoke, The Beverly Hillbillies, Rawhide, The Americans, Barnaby Jones, The Outer Limits, Night Gallery, and the 1976 miniseries Once an Eagle. His last appearance was in a 1977 episode of Wonder Woman.",
        "birthday": "1907-03-19",
        "deathday": "1985-04-23",
        "gender": 2,
        "homepage": null,
        "id": 51764,
        "imdb_id": "nm0808949",
        "known_for_department": "Acting",
        "name": "Kent Smith",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.4412,
        "profile_path": "/2GHATvR422EaWU7BkSoj9kbgzt0.jpg"
    }
}