{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/oSFshBf9Wrv5UcmZYAmy28BwSSh.jpg",
                "genre_ids": [
                    35,
                    80
                ],
                "id": 378,
                "original_language": "en",
                "original_title": "Raising Arizona",
                "overview": "When a childless couple--an ex-con and an ex-cop--decide to help themselves to one of another family's quintuplets, their lives become more complicated than they anticipated.",
                "popularity": 4.5305,
                "poster_path": "/niKyjOqiB4XVl0BqgKTHIlHOCeF.jpg",
                "release_date": "1987-03-13",
                "title": "Raising Arizona",
                "video": false,
                "vote_average": 7.064,
                "vote_count": 2208,
                "character": "Leonard Smalls",
                "credit_id": "52fe423cc3a36847f800e6dd",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Randall Craig Cobb",
            "Randall Cobb",
            "Tex Cobb",
            "رندال تکس کوب"
        ],
        "biography": "Randall Craig \"Tex\" Cobb is an American former professional boxer who competed in the heavyweight division. Widely considered to possess one of the greatest chins of all time, Cobb was a brawler who also packed considerable punching power. He began his fighting career in full contact kickboxing in 1975 before making the jump to professional boxing two years later. He challenged Larry Holmes for the WBC heavyweight title in November 1982, losing a one-sided unanimous decision. Cobb took wins over notable heavyweights of his era such as Bernardo Mercado, Earnie Shavers, and Leon Spinks. He was ranked in the global top 10 heavyweight boxers by the Ring (in 1981 and 1982) and BoxRec (in 1982).\n\nIn addition to his fighting career, he has also acted in numerous films and television series, usually appearing as a villain or henchman. Examples include roles in the Coen brothers film Raising Arizona and the popular programs Miami Vice and Walker, Texas Ranger.",
        "birthday": "1950-05-07",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 5177,
        "imdb_id": "nm0002012",
        "known_for_department": "Acting",
        "name": "Randall \"Tex\" Cobb",
        "place_of_birth": "Bridge City, Texas, USA",
        "popularity": 0.4547,
        "profile_path": "/xBUdVeioNCwWBTzO618GSAtnWJg.jpg"
    }
}