{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/c2wkRgqYlWdT3yejyO8kdwgepSd.jpg",
                "genre_ids": [
                    16,
                    10751,
                    12,
                    14
                ],
                "id": 13285,
                "original_language": "en",
                "original_title": "Barbie Fairytopia: Mermaidia",
                "overview": "In this animated follow-up to Fairytopia, Elina enlists the help of a mermaid, Nori, to save her friend Nalu, a merman prince who has been captured by the wicked Laverna.",
                "popularity": 4.1229,
                "poster_path": "/uBCvRThFwjvwNQeS3Vy7xMPc0Rh.jpg",
                "release_date": "2006-03-14",
                "title": "Barbie Fairytopia: Mermaidia",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 719,
                "character": "Pink Merfairy (voice)",
                "credit_id": "52fe45569251416c750530d3",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Teryl Roghery",
            "تریل راثری"
        ],
        "biography": "Teryl Rothery (born November 9, 1962) is a Canadian actress and voice actress. She is best known for her roles as Dr. Janet Fraiser on Stargate SG-1, Muriel on Virgin River, Dr. Jen 'JL' Lancaster on The Good Doctor, and Grace Sherman on Cedar Cove,.\n\nShe began her career as a dancer at age thirteen when she performed in her first musical, \"Bye Bye Birdie\". Her role in \"Annie Get Your Gun\" earned her a Most Outstanding Performer award with her theater company.\n\nOver the years, she has guest starred on TV series including The Outer Limits, The X Files, First Wave, The Dead Zone, Eureka, Smallville, Fairly Legal, Psych, The Killing, Rush, Supernatural, iZombie, Good Witch, Impostors, Bates Motel, and multiple mini-series. She has appeared in movies such as Masterminds (1997) with Patrick Stewart, and Mr. Rice's Secret (2000) with David Bowie. She has also appeared in numerous Hallmark and TV movies,  as well as voiced for anime and animated TV series and movies.\n\nShe's had major and co-starring roles as Muriel on Virgin River, Dr. Jen 'JL' Lancaster on The Good Doctor, Grace Sherman on Cedar Cove, and Celia Hudson on Nancy Drew.\n\nShe's had other recurring roles as Dawn Kannerman on Upload, Patricia Holden on Travelers, Robin O'Brien on Chesapeake Shores, Henrietta on Wayward Pines, Helen Bouchard on When Calls the Heart, Cathy McDonald on Cult, Jean Loring on Arrow, Layne Monroe on Hellcats, Evelyn on Caprica, Gwen on The Guard, Carol Bloom on Kyle XY, Linda the Realtor on Dead Like Me, and Mary (Jeremiah's mother) on Jeremiah.",
        "birthday": "1962-11-09",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.terylrothery.com",
        "id": 51800,
        "imdb_id": "nm0745186",
        "known_for_department": "Acting",
        "name": "Teryl Rothery",
        "place_of_birth": "Vancouver, British Columbia, Canada",
        "popularity": 1.0902,
        "profile_path": "/16rUSnTH56cKatjd6kjEYEfU4cA.jpg"
    }
}