{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mpfRchw4jh2cEBajB9EJltTnDH2.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 1429,
                "original_language": "en",
                "original_title": "25th Hour",
                "overview": "In New York City in the days following the events of 9/11, Monty Brogan is a convicted drug dealer about to start a seven-year prison sentence, and his final hours of freedom are devoted to hanging out with his closest buddies and trying to prepare his girlfriend for his extended absence.",
                "popularity": 4.4731,
                "poster_path": "/uW7tTRElr2tRhmAVESzvHy4ByXg.jpg",
                "release_date": "2002-12-19",
                "title": "25th Hour",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 2441,
                "character": "Agent Cunningham",
                "credit_id": "53efe09ac3a3685add0017dd",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Michael Genet (born August 25, 1958) is an American actor and screenwriter. He has guest starred in a number of television series based in the New York City area, they include The Equalizer, New York Undercover, Law & Order, Law & Order: Criminal Intent, Law & Order: Special Victims Unit, Ugly Betty and the soap operas As the World Turns, One Life to Live.\n\nAs a screenwriter, Genet wrote the film She Hate Me (2004), directed by Spike Lee, co-writing the film with Lee. Genet also appeared in the film playing the older brother of the film's protagonist, played by Anthony Mackie. Prior to this, he appeared in Lee's 2002 film 25th Hour. The next film he wrote Talk to Me (2007), was directed by Kasi Lemmons, co-writing the film with Rick Famuyiwa.\n\nGenet has also appeared in a number of Broadway stage productions.\n\nDescription above from the Wikipedia article Michael Genet, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1958-08-25",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 51865,
        "imdb_id": "nm0312796",
        "known_for_department": "Acting",
        "name": "Michael Genet",
        "place_of_birth": "Washington, USA",
        "popularity": 0.1728,
        "profile_path": "/bATKiWGbnwyghwHrS6NALcOAYCq.jpg"
    }
}