{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/g6pNnKmvTkNlEvn0ScwstYvhFE.jpg",
                "genre_ids": [
                    27,
                    18,
                    53
                ],
                "id": 6537,
                "original_language": "es",
                "original_title": "El orfanato",
                "overview": "A woman brings her family back to her childhood home, which used to be an orphanage, intent on reopening it. Before long, her son starts to communicate with a new invisible friend.",
                "popularity": 4.1646,
                "poster_path": "/vIpi1KtHLXUOfSVC2m6MqpjSPgL.jpg",
                "release_date": "2007-05-20",
                "title": "The Orphanage",
                "video": false,
                "vote_average": 7.233,
                "vote_count": 2984,
                "character": "Balaban",
                "credit_id": "52fe4459c3a36847f8090cd9",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Édgar Vivar Villanueva",
            "Édgar Vivar"
        ],
        "biography": "Édgar Vivar is a Mexican actor and comedian, born on December 28, 1948, in Mexico City. Although his grandfather had encouraged his artistic side, in which he was very interested, Edgar ended up choosing medicine as an area of ​​study, preparing at the National Autonomous University of Mexico (UNAM). But given that his career required completing credits in the artistic area, Vivar found that the only option with space was theater and remembering his interest in it, generated by his grandfather, he decided that it could be an interesting experience. The taste for theater did not end and, although he finished his medical degree, he entered the University Theater Center, which concluded in 1964. He practiced as a doctor for a year, but left the profession when he received a call from Roberto Gómez Bolaños, to join the television show \"El Chavo del 8\", where he plays \"El Señor Barriga\", 'Ñoño\" and \"Caquito Botija\", characters for which Édgar is known and admired worldwide.",
        "birthday": "1948-12-28",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 51906,
        "imdb_id": "nm0900232",
        "known_for_department": "Acting",
        "name": "Edgar Vivar",
        "place_of_birth": "Mexico City, Mexico",
        "popularity": 1.3674,
        "profile_path": "/frijAScYO4vIbFAMzPDJrEiklNb.jpg"
    }
}