{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rspbS1E9wJtslrb8amfJgtMBUVh.jpg",
                "genre_ids": [
                    27,
                    28
                ],
                "id": 924,
                "original_language": "en",
                "original_title": "Dawn of the Dead",
                "overview": "A group of survivors take refuge in a shopping mall after the world is taken over by aggressive, flesh-eating zombies.",
                "popularity": 6.5221,
                "poster_path": "/ttquyxStEEctzghtA2f4PUGprDr.jpg",
                "release_date": "2004-03-19",
                "title": "Dawn of the Dead",
                "video": false,
                "vote_average": 7.056,
                "vote_count": 4233,
                "character": "Nicole",
                "credit_id": "52fe428ec3a36847f8027cc9",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Lindsay Booth"
        ],
        "biography": "Lindy Booth (born April 2, 1979) is a Canadian actress who currently resides in Los Angeles, California. She's best known for playing Riley Grant on the Disney Channel series The Famous Jett Jackson (and Agent Hawk in the show-within-a-show Silverstone) and Claudia on Relic Hunter. She also portrayed A.J. Butterfield on the NBC series The Philanthropist.\n\nOther credits include guest starring as different characters in two 2002 episodes of the A&E Network series A Nero Wolfe Mystery (\"Before I Die\" and Poison a la Carte\"), and a recurring role in season two of the USA Network series The 4400. She also starred as Dodger Allen in the 2005 movie Cry Wolf, as Nicole in the 2004 remake of Dawn of the Dead, and had a small part in Wrong Turn with Eliza Dushku. She appears in Dark Honeymoon. In addition, she has guest starred in TV shows such as CSI: NY and Ghost Whisperer. She also played Stephanie Goodison on Syfy's Warehouse 13 and portrayed Lana Turner in 2001's Life with Judy Garland: Me and My Shadows.\n\nBooth was born in Oakville, Ontario and attended T. A. Blakelock High School, graduating in 1998 prior to beginning her film career.\n\nDescription above from the Wikipedia article Lindy Booth, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1979-04-02",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 51936,
        "imdb_id": "nm0095751",
        "known_for_department": "Acting",
        "name": "Lindy Booth",
        "place_of_birth": "Oakville, Ontario, Canada",
        "popularity": 0.9718,
        "profile_path": "/5vT2mIIGTM7XQx4utAyRjW1aRPW.jpg"
    }
}