{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/vAsFwNkxV0cHJWRJXkshg76rJRQ.jpg",
                "genre_ids": [
                    10751,
                    18
                ],
                "id": 43959,
                "original_language": "en",
                "original_title": "Soul Surfer",
                "overview": "The true story of teen surfer Bethany Hamilton, who lost her arm in a shark attack and courageously overcame all odds to become a champion again, through her sheer determination and unwavering faith.",
                "popularity": 3.4831,
                "poster_path": "/cvgRxrEupUFeJ0xzUExJo4dMXbL.jpg",
                "release_date": "2011-04-08",
                "title": "Soul Surfer",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 1196,
                "character": "Holt Blanchard",
                "credit_id": "52fe466dc3a36847f80fe92d",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Kevin David Sorbo",
            "Кевін Сорбо",
            "Кевин Сорбо",
            "Κέβιν Σόρμπο",
            "Κέβιν Ντέιβιντ Σόρμπο",
            "کوین سوربو"
        ],
        "biography": "Kevin Sorbo is an American actor, producer, and director. He was born on September 24, 1958, in Mound, Minnesota. Sorbo gained international recognition for his portrayal of the titular character in the television series \"Hercules: The Legendary Journeys\" (1995-1999). The show, a fantasy adventure series based on Greek mythology, propelled Sorbo to stardom and earned him a dedicated fan base.\n\nFollowing the success of \"Hercules,\" Sorbo continued to work in the entertainment industry, taking on various roles in both film and television. Some of his notable appearances include the lead role in the science fiction series \"Andromeda\" (2000-2005) and guest roles in shows like \"The O.C.\" and \"Two and a Half Men.\"\n\nIn addition to his acting work, Sorbo has also ventured into producing and directing. He has produced and starred in several films, including \"Let There Be Light\" (2017) and \"Miracle in East Texas\" (2019).\n\nSorbo has remained active in the entertainment industry and continues to work on a variety of projects. He is known for his charismatic presence on screen and his dedication to his craft.",
        "birthday": "1958-09-24",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.kevinsorbo.net/",
        "id": 51965,
        "imdb_id": "nm0001757",
        "known_for_department": "Acting",
        "name": "Kevin Sorbo",
        "place_of_birth": "Mound, Minnesota, USA",
        "popularity": 1.1177,
        "profile_path": "/a6rDi3tkNJwaVoP7VGbdGelwtYw.jpg"
    }
}