{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zzzoRNVSaUv6e1hpADjUDeM3EvY.jpg",
                "genre_ids": [
                    878,
                    28,
                    12
                ],
                "id": 13475,
                "original_language": "en",
                "original_title": "Star Trek",
                "overview": "The fate of the galaxy rests in the hands of bitter rivals. One, James Kirk, is a delinquent, thrill-seeking Iowa farm boy. The other, Spock, a Vulcan, was raised in a logic-based society that rejects all emotion. As fiery instinct clashes with calm reason, their unlikely but powerful partnership is the only thing capable of leading their crew through unimaginable danger, boldly going where no one has gone before. The human adventure has begun again.",
                "popularity": 9.3534,
                "poster_path": "/lV5OpzAss1z06YNagOVap1I35mH.jpg",
                "release_date": "2009-05-06",
                "title": "Star Trek",
                "video": false,
                "vote_average": 7.426,
                "vote_count": 10141,
                "character": "Medical Technician",
                "credit_id": "52fe456d9251416c75056227",
                "order": 25
            },
            {
                "adult": false,
                "backdrop_path": "/8rBBojmT5vwkuVh2hFWBkbWtlBX.jpg",
                "genre_ids": [
                    36,
                    18
                ],
                "id": 10139,
                "original_language": "en",
                "original_title": "Milk",
                "overview": "The true story of Harvey Milk, the first openly gay man ever elected to public office. In San Francisco in the late 1970s, Harvey Milk becomes an activist for gay rights and inspires others to join him in his fight for equal rights that should be available to all Americans.",
                "popularity": 3.9175,
                "poster_path": "/ot4ImF4b7QbS6XsTdMH3pWxNmX2.jpg",
                "release_date": "2008-11-05",
                "title": "Milk",
                "video": false,
                "vote_average": 7.239,
                "vote_count": 2294,
                "character": "Michael Wong",
                "credit_id": "5b3bd6fac3a3685960001e4f",
                "order": 18
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "游朝敏"
        ],
        "biography": "Kelvin Yu (born 1979) is an American actor and writer.  Yu's first film was the 2003 comedy The Utopian Society. He later made an uncredited appearance in the 2005 film Elizabethtown. The following year, Yu had a supporting role in the comedy Grandma's Boy. Yu played a role in the Ghost Whisperer episode \"Double Exposure\" (3x6) as Joseph. Yu had a supporting role in the 2008 Academy Award-winning biographical political drama Milk.\n\nYu has starred in several short films, including 2006's My Prince, My Angel. Yu later appeared with Linda Park on the ABC series Women's Murder Club, and a lead role in the 2007 short film Fortune Hunters. In 2020, he played a role in Wonder Woman 1984.\n\nYu had a recurring role in the Netflix original series Master of None as the character of Brian Chang, the on-screen analogue of the show's creator Alan Yang, described as a \"hottie\" by Vulture magazine. He provides the voice of a minor character on The Great North. In 2022 Yu appeared in the Apple TV+ series The Afterparty.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 51997,
        "imdb_id": "nm0950515",
        "known_for_department": "Acting",
        "name": "Kelvin Yu",
        "place_of_birth": "Santa Ana, California, USA ",
        "popularity": 0.3339,
        "profile_path": "/47m8mUsuNIEyLb3KeDpryyvK0LI.jpg"
    }
}