{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6RcBQkC2PZJwwbFugqzgvN3moYL.jpg",
                "genre_ids": [
                    53,
                    28
                ],
                "id": 1005331,
                "original_language": "en",
                "original_title": "Carry-On",
                "overview": "An airport security officer races to outsmart a mysterious traveler forcing him to let a dangerous item slip onto a Christmas Eve flight.",
                "popularity": 9.0822,
                "poster_path": "/sjMN7DRi4sGiledsmllEw5HJjPy.jpg",
                "release_date": "2024-12-05",
                "title": "Carry-On",
                "video": false,
                "vote_average": 6.894,
                "vote_count": 2413,
                "character": "Watcher",
                "credit_id": "633d09278f26bc0082ebd713",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "John Theodore \"Theo\" Rossi",
            "Θίο Ρόσι",
            "تئو روسی",
            "تِئو روسی"
        ],
        "biography": "Theo Rossi (born John Theodore Rossi on June 4, 1975 in Staten Island, New York) is an American actor, best known for his role on the FX series Sons of Anarchy as Juan Carlos \"Juice\" Ortiz.\n\nRossi attended SUNY Albany from 1994–1998, and afterwards started appearing in commercials for McDonald's, Nissan, and Bud Light.\n\nSince 2001, Rossi has guest starred in multiple television shows such as Veronica Mars, Bones, Boston Public, American Dreams, Heist, Las Vegas and Grey's Anatomy. In 2008, he was cast as the recurring role of \"Juice\" Ortiz in the series Sons of Anarchy, his best known role to date. Due to popular response, Rossi was upgraded to regular castmember in the second season.\n\nAs a film actor he starred in the movie The Challenge with Mary-Kate and Ashley Olsen, Code Breakers, and had a small part in Cloverfield. He will appear in the upcoming films Kill Theory, The Informers and Fencewalker.\n\nDescription above from the Wikipedia article Theo Rossi, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1975-06-04",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 51995,
        "imdb_id": "nm0744331",
        "known_for_department": "Acting",
        "name": "Theo Rossi",
        "place_of_birth": "Staten Island, New York City, New York, USA",
        "popularity": 1.8433,
        "profile_path": "/344QE41Jileu4OE41cmYgBxc5BF.jpg"
    }
}