{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8aTHhowlxO3nBQjianlIyns1ZIt.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 156700,
                "original_language": "en",
                "original_title": "The Kings of Summer",
                "overview": "Joe Toy, on the verge of adolescence, finds himself increasingly frustrated by his single father, Frank's attempts to manage his life. Declaring his freedom once and for all, he escapes to a clearing in the woods with his best friend, Patrick, and a strange kid named Biaggio. He announces that they are going to build a house there, free from responsibility and parents. Once their makeshift abode is finished, the three young men find themselves masters of their own destiny, alone in the woods.",
                "popularity": 2.486,
                "poster_path": "/6dcIbwJuxlEnzLe0EaGFvsh4ZdS.jpg",
                "release_date": "2013-01-19",
                "title": "The Kings of Summer",
                "video": false,
                "vote_average": 6.982,
                "vote_count": 1177,
                "character": "Mrs. Keenan",
                "credit_id": "52fe4baa9251416c910e1de9",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/1hdorswm5HPxb81xq84H9gqveUq.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 371638,
                "original_language": "en",
                "original_title": "The Disaster Artist",
                "overview": "An aspiring actor in Hollywood meets an enigmatic stranger by the name of Tommy Wiseau, the meeting leads the actor down a path nobody could have predicted; creating the worst movie ever made.",
                "popularity": 2.3925,
                "poster_path": "/2HuLGiyH0TPYxnCvYHAxc8K738o.jpg",
                "release_date": "2017-03-12",
                "title": "The Disaster Artist",
                "video": false,
                "vote_average": 7.107,
                "vote_count": 3619,
                "character": "Mrs. Sestero",
                "credit_id": "589b54fd9251410c980001e6",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Megan Mullally (born November 12, 1958) is an American actress and singer. After working in the theatre in Chicago, Mullally moved to Los Angeles in 1985 and began to appear in supporting roles in film and television productions. She made her Broadway debut in Grease in 1994 and she has since appeared in several Broadway musicals. From 1998 until 2006, she played Karen Walker on the TV sitcom Will & Grace, most arguably her best known role to date. From 2006 until early 2007, Mullally hosted the talk show The Megan Mullally Show.\n\nShe has since appeared in guest-starring roles in television programs such as Parks and Recreation, 30 Rock, Boston Legal and a Glaad Award-winning episode of The New Adventures of Old Christine. In 2010, Mullally starred as Lydia in the critically acclaimed second season of Party Down. She's currently starring as Chief on Adult Swim's cult hit Childrens Hospital.\n\nShe received seven consecutive Emmy Award nominations for \"Outstanding Supporting Actress in a Comedy Series\" for her role on Will & Grace, winning twice in 2000 and 2006. She has also received four Screen Actors Guild Awards for her performance, and was nominated for four Golden Globe awards.\n\n2000, Mullally met actor Nick Offerman while doing a play together in Los Angeles. The two married in 2003. Offerman guest-starred on Will & Grace during its fourth season; in return, Mullally has guest-starred on Parks and Recreation, on which Offerman plays a lead role. Mullally plays Tammy, the conniving ex-wife of Offerman's character Ron Swanson, appearing in eight episodes.",
        "birthday": "1958-11-12",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.meganmullally.net",
        "id": 52119,
        "imdb_id": "nm0005259",
        "known_for_department": "Acting",
        "name": "Megan Mullally",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 1.1996,
        "profile_path": "/ypdczVeLt9B2zSOeY7e6RO2XWJQ.jpg"
    }
}