{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8G6HCS82vNxgg5wp7oBDSk32XpF.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 558,
                "original_language": "en",
                "original_title": "Spider-Man 2",
                "overview": "Peter Parker is going through a major identity crisis. Burned out from being Spider-Man, he decides to shelve his superhero alter ego, which leaves the city suffering in the wake of carnage left by the evil Doc Ock. In the meantime, Parker still can't act on his feelings for Mary Jane Watson, a girl he's loved since childhood. A certain anger begins to brew in his best friend Harry Osborn as well...",
                "popularity": 8.9995,
                "poster_path": "/aGuvNAaaZuWXYQQ6N2v7DeuP6mB.jpg",
                "release_date": "2004-06-25",
                "title": "Spider-Man 2",
                "video": false,
                "vote_average": 7.295,
                "vote_count": 15734,
                "character": "Train Passenger",
                "credit_id": "55ddf70fc3a3686580002f35",
                "order": 62
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Brianna Lynn Brown "
        ],
        "biography": "Brianna Lynn Brown is an American actress and producer, known for her television roles as Lisa Niles in the ABC daytime soap opera General Hospital, and as Taylor Stappord in the Lifetime primetime soap opera Devious Maids.  Brown was born in Saint Paul, Minnesota and attended St. Olaf College. After starting out as a singer, she made her first on-screen appearance in 1999 in the episode of NBC series Freaks and Geeks.  Brown won several leading and supporting roles in horror and comedy movies during the late 2000s before returning to television for guest spots and as a regular cast member in the ABC drama pilot The Whispers opposite Lily Rabe and Milo Ventimiglia.  ",
        "birthday": "1979-10-02",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.briannabrownkeen.com/",
        "id": 52271,
        "imdb_id": "nm0113158",
        "known_for_department": "Acting",
        "name": "Brianna Brown",
        "place_of_birth": "Saint Paul, Minnesota, USA",
        "popularity": 1.3114,
        "profile_path": "/eDvUSmOXm6Bz5QIjZkzKJTRvP5x.jpg"
    }
}