{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tqnXgk4DCX7fWU0AugkCJHQ4Ybq.jpg",
                "genre_ids": [
                    878,
                    16,
                    28,
                    14
                ],
                "id": 30675,
                "original_language": "en",
                "original_title": "Planet Hulk",
                "overview": "When the Hulk's presence on Earth becomes too great a risk, the Illuminati trick him to board a shuttle destined for a planet where he will be able to live in peace, and launch it into space. The Hulk's struggle to escape causes the shuttle to malfunction and crash land on the planet Sakaar, however, where he is sold into slavery and trained as a gladiator.",
                "popularity": 2.9867,
                "poster_path": "/5wCzY3sAs6zHIzzHIcTKN2g0pu8.jpg",
                "release_date": "2010-02-02",
                "title": "Planet Hulk",
                "video": false,
                "vote_average": 7.105,
                "vote_count": 523,
                "character": "Beta Ray Bill (voice)",
                "credit_id": "61b463679d8939001c174978",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Paul Dobson is an English-Canadian voice actor who works for Ocean Studios and various other studios in Vancouver, British Columbia, Canada.\n\nHe performed Naraku and Myoga from InuYasha, Doctor Doom from Fantastic Four: World's Greatest Heroes, Juggernaut from X-Men: Evolution, Happosai from Ranma ½, Enzo Matrix from ReBoot, Folken Fanel from the Ocean dub of Escaflowne, Zarbon from the Ocean dub of Dragon Ball Z, Graveheart from Shadow Raiders, various characters from several Transformers series (Beast Machines, Armada, Energon and Cybertron), Moo from Monster Rancher, Graham Aker from Mobile Suit Gundam 00 series, Sensei Wu from Lego Ninjago: Masters of Spinjitzu and various voices in Warhammer 40,000: Dawn of War video game series.",
        "birthday": "1963-12-07",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 52283,
        "imdb_id": "nm0229928",
        "known_for_department": "Acting",
        "name": "Paul Dobson",
        "place_of_birth": "London, England, UK",
        "popularity": 0.2039,
        "profile_path": "/huQqiIHgnswYR9x5V1e46FTYfSI.jpg"
    }
}