{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/pxkQAIhC7LXN5s5B23lnvCMgva5.jpg",
                "genre_ids": [
                    80,
                    18,
                    10749
                ],
                "id": 654,
                "original_language": "en",
                "original_title": "On the Waterfront",
                "overview": "A prizefighter-turned-longshoreman with a conscience goes up against labor leaders to expose corruption, extortion, and murder among the union ranks.",
                "popularity": 5.1767,
                "poster_path": "/fKjLZy9W8VxMOp5OoyWojmLVCQw.jpg",
                "release_date": "1954-06-22",
                "title": "On the Waterfront",
                "video": false,
                "vote_average": 7.882,
                "vote_count": 1669,
                "character": "Johnny Friendly",
                "credit_id": "52fe4265c3a36847f801b1e3",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/xcjJ5khg2yzOa282mza39Lbrm7j.jpg",
                "genre_ids": [
                    27
                ],
                "id": 9552,
                "original_language": "en",
                "original_title": "The Exorcist",
                "overview": "When a charming 12-year-old girl takes on the characteristics and voices of others, doctors say there is nothing they can do. As people begin to die, the girl's mother realizes her daughter has been possessed by the Devil. Her daughter's only possible hope lies with two priests and the ancient rite of demonic exorcism.",
                "popularity": 9.8796,
                "poster_path": "/5x0CeVHJI8tcDx8tUUwYHQSNILq.jpg",
                "release_date": "1973-12-26",
                "title": "The Exorcist",
                "video": false,
                "vote_average": 7.736,
                "vote_count": 8283,
                "character": "Lt. Bill Kinderman",
                "credit_id": "52fe4508c3a36847f80b8653",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/bxgTSUenZDHNFerQ1whRKplrMKF.jpg",
                "genre_ids": [
                    18
                ],
                "id": 389,
                "original_language": "en",
                "original_title": "12 Angry Men",
                "overview": "The defense and the prosecution have rested and the jury is filing into the jury room to decide if a young Spanish-American is guilty or innocent of murdering his father. What begins as an open and shut case soon becomes a mini-drama of each of the jurors' prejudices and preconceptions about the trial, the accused, and each other.",
                "popularity": 15.2994,
                "poster_path": "/ow3wq89wM8qd5X7hWKxiRfsFf9C.jpg",
                "release_date": "1957-04-10",
                "title": "12 Angry Men",
                "video": false,
                "vote_average": 8.549,
                "vote_count": 9398,
                "character": "Juror 3",
                "credit_id": "5e93b0a584448e0014910883",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Lee Colt",
            "Leo Jacoby",
            "Cpl. Lee Cobb",
            "Lee Cobb",
            "Ли Дж. Кобб",
            "لی جی. کاب"
        ],
        "biography": "Lee J. Cobb was an American actor. He was best known for his performances in On the Waterfront (1954), for which he was nominated for an Academy Award, 12 Angry Men (1957), and The Exorcist (1973). He also played the role of Willy Loman in the original Broadway production of Arthur Miller's 1949 play Death of a Salesman under the direction of Elia Kazan.  On television, Cobb costarred in the first four seasons of the popular, long-running western series The Virginian. He typically played arrogant, intimidating, and abrasive characters, but often had roles as respectable figures such as judges.  Born Leo Jacob in New York City, he grew up in The Bronx,  before studying at New York University and making his film debut in The Vanishing Shadow (1934).  Cobb performed in numerous theater productions and companies, including Group Theatre (New York) before serving in the First Motion Picture Unit of the Army Air Force during World War II.  \n\nFollowing the war, Cobb returned to film, television and theater before being accused of being a Communist in 1951 testimony before the House Un-American Activities Committee by Larry Parks, himself a former Communist Party member. Cobb was called to testify before HUAC but refused to do so for two years until, with his career threatened by the blacklist, he relented in 1953 and gave testimony in which he named 20 people as former members of the Communist Party USA. Following the hearing he resumed his career and worked with Elia Kazan and Budd Schulberg, two other HUAC \"friendly witnesses\", on the 1954 film On the Waterfront, which is widely seen as an allegory and apologia for testifying.  His 1968 performance as King Lear achieved the longest run (72 performances) for the play in Broadway history.  One of his final film roles was that of police detective Lt. Kinderman in the 1973 horror film The Exorcist.\n\nCobb died of a heart attack in February 1976 in Woodland Hills, California, and was buried in Mount Sinai Memorial Park Cemetery in Los Angeles. He was survived by his second wife, Mary Hirsch, and daughter, also an accomplished actress, Julie Cobb.",
        "birthday": "1911-12-08",
        "deathday": "1976-02-11",
        "gender": 2,
        "homepage": null,
        "id": 5248,
        "imdb_id": "nm0002011",
        "known_for_department": "Acting",
        "name": "Lee J. Cobb",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.7843,
        "profile_path": "/yxMxBvM0PZwu7YXQamG0kFwt9DZ.jpg"
    }
}