{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2hABgVIhalvUB30Z2kIPVv8YX9n.jpg",
                "genre_ids": [
                    28,
                    12,
                    10752
                ],
                "id": 1654,
                "original_language": "en",
                "original_title": "The Dirty Dozen",
                "overview": "12 American military prisoners in World War II are ordered to infiltrate a well-guarded enemy château and kill the Nazi officers vacationing there. The soldiers, most of whom are facing death sentences for a variety of violent crimes, agree to the mission and the possible commuting of their sentences.",
                "popularity": 5.6514,
                "poster_path": "/tFWWsuhp22zJ6OG6QepJIiPUfeF.jpg",
                "release_date": "1967-06-15",
                "title": "The Dirty Dozen",
                "video": false,
                "vote_average": 7.596,
                "vote_count": 1257,
                "character": "General Denton",
                "credit_id": "52fe4309c3a36847f8035a17",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/bxgTSUenZDHNFerQ1whRKplrMKF.jpg",
                "genre_ids": [
                    18
                ],
                "id": 389,
                "original_language": "en",
                "original_title": "12 Angry Men",
                "overview": "The defense and the prosecution have rested and the jury is filing into the jury room to decide if a young Spanish-American is guilty or innocent of murdering his father. What begins as an open and shut case soon becomes a mini-drama of each of the jurors' prejudices and preconceptions about the trial, the accused, and each other.",
                "popularity": 15.2994,
                "poster_path": "/ow3wq89wM8qd5X7hWKxiRfsFf9C.jpg",
                "release_date": "1957-04-10",
                "title": "12 Angry Men",
                "video": false,
                "vote_average": 8.549,
                "vote_count": 9398,
                "character": "Juror 12",
                "credit_id": "5e93b11184448e001a90eb37",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Over his 40-year career as one of Hollywood's veteran character actors, Robert Webber always marked his spot by playing all types of roles and was not stereotyped into playing just one kind of character. Sometimes he even got to play a leading role (see Hysteria (1965)). Webber first started out in small stage shows and a few Broadway plays and served a stint in the army before he landed the role of Juror 12 in 12 Angry Men (1957). He was also known for numerous war films, playing Lee Marvin's general in The Dirty Dozen (1967) or as real-life Admiral Frank J. Fletcher in Midway (1976). Webber's other best known movies include The Great White Hope (1970), Revenge of the Pink Panther (1978), 10 (1979) (as composer Dudley Moore's lyricist partner), Private Benjamin (1980), Wild Geese II (1985) and co-starring with Richard Dreyfuss and Barbra Streisand as prosecutor Francis McMillian in Nuts (1987). In 1989 he died of Lou Gehrig's disease (amyotrophic lateral sclerosis) in Malibu, California, shortly after completing the 1988 TV production Something Is Out There (1988) (TV). He bore a resemblance to character actor Kevin McCarthy.",
        "birthday": "1924-10-14",
        "deathday": "1989-05-19",
        "gender": 2,
        "homepage": null,
        "id": 5255,
        "imdb_id": "nm0916434",
        "known_for_department": "Acting",
        "name": "Robert Webber",
        "place_of_birth": "Santa Ana, California, USA ",
        "popularity": 0.6534,
        "profile_path": "/1RlhCcfCkaSz0cWRSowsj5FiKXg.jpg"
    }
}