{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bxgTSUenZDHNFerQ1whRKplrMKF.jpg",
                "genre_ids": [
                    18
                ],
                "id": 389,
                "original_language": "en",
                "original_title": "12 Angry Men",
                "overview": "The defense and the prosecution have rested and the jury is filing into the jury room to decide if a young Spanish-American is guilty or innocent of murdering his father. What begins as an open and shut case soon becomes a mini-drama of each of the jurors' prejudices and preconceptions about the trial, the accused, and each other.",
                "popularity": 15.2994,
                "poster_path": "/ow3wq89wM8qd5X7hWKxiRfsFf9C.jpg",
                "release_date": "1957-04-10",
                "title": "12 Angry Men",
                "video": false,
                "vote_average": 8.549,
                "vote_count": 9398,
                "character": "The Accused (uncredited)",
                "credit_id": "5e93b18b7a97ab00170e0666",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Although the premise of 12 Angry Men (1957) revolves around the 12 characters from the jury who deliberate whether the accused is guilty or not guilty in the murder case that surrounds the story, the actor playing the accused should be considered the main figure or at least the one we are concerned the most.\n\nIn his silent and brief moment where the camera shows him from a slight distance, John Savoca convinces audiences with his helpless expression while being accused of murder in what would become an important trial where his fate will be decided by 12 unknown. But his expression can also make viewers think he's hiding something, maybe he's distant and somewhat cold. With that brief moment, it's up to viewers (just as the jurors) to decide with that little exposition of the man to determine if he's the killer or not. Obvious that as the movie progresses facts and more facts are thrown about the case, and our memory has to go back in imagine the possibilities when it comes to the fate of the accused.\n\nSadly, Savoca never returned to the screen and nothing is known about him or his whereabouts after his appearance in the classic film.",
        "birthday": "1940-02-29",
        "deathday": "2005-06-29",
        "gender": 2,
        "homepage": null,
        "id": 5258,
        "imdb_id": "nm0767847",
        "known_for_department": "Acting",
        "name": "John Savoca",
        "place_of_birth": "New York, New York",
        "popularity": 0.0888,
        "profile_path": null
    }
}