{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1pOp56fSV4XySjaGrhb6NPD2n4r.jpg",
                "genre_ids": [
                    18,
                    36,
                    28
                ],
                "id": 10423,
                "original_language": "en",
                "original_title": "Dragon: The Bruce Lee Story",
                "overview": "This film is a glimpse into the life, love and the unconquerable spirit of the legendary Bruce Lee. From a childhood of rigorous martial arts training, Lee realizes his dream of opening his own kung-fu school in America. Before long, he is discovered by a Hollywood producer and begins a meteoric rise to fame and an all too short reign as one the most charismatic action heroes in cinema history.",
                "popularity": 2.8652,
                "poster_path": "/lxhsdC8wuGgQf0gKCt8wyHHxGcQ.jpg",
                "release_date": "1993-05-07",
                "title": "Dragon: The Bruce Lee Story",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 768,
                "character": "Doctor",
                "credit_id": "5968bef1c3a36879cb01d1e8",
                "order": 37
            },
            {
                "adult": false,
                "backdrop_path": "/AfGp6Ev3BVdEd7L99kGQzOzsqRb.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 568,
                "original_language": "en",
                "original_title": "Apollo 13",
                "overview": "The true story of technical troubles that scuttle the Apollo 13 lunar mission in 1970, risking the lives of astronaut Jim Lovell and his crew, with the failed journey turning into a thrilling saga of heroism. Drifting more than 200,000 miles from Earth, the astronauts work furiously with the ground crew to avert tragedy.",
                "popularity": 8.8273,
                "poster_path": "/tVeKscCm2fY1xDXZk8PgnZ87h9S.jpg",
                "release_date": "1995-06-30",
                "title": "Apollo 13",
                "video": false,
                "vote_average": 7.452,
                "vote_count": 5608,
                "character": "Reporter",
                "credit_id": "5bc37e0892514179bc04526a",
                "order": 79
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Paul Marianetti"
        ],
        "biography": "Mantee was born Paul Marianetti in San Francisco, California. A journalism major at San Mateo Junior College, Mantee enlisted in the U.S. Navy for four years during the Korean War that made him decide on acting as a career. He graduated from the University of California, Berkeley.\n\nHis stage name was changed from an Italian-sounding name to the name of Humphrey Bogart's character in The Petrified Forest. He made a great number of guest appearances in well-known television shows and starred in a handful of films, including a cult classic, Robinson Crusoe on Mars. A restored version of the film was released in 2007 by The Criterion Collection. Mantee authored two novels, In Search of the Perfect Ravioli (Ballantine Books, 1991) and a semi-autobiographical Bruno of Hollywood (Ballantine Books, 1994).\n\nMantee, a longtime Malibu resident, died November 7, 2013 at a rehabilitation center in Canoga Park, California. He was survived by his wife, Suzy Davis Mantee.",
        "birthday": "1931-01-09",
        "deathday": "2013-11-07",
        "gender": 2,
        "homepage": null,
        "id": 52590,
        "imdb_id": "nm0544045",
        "known_for_department": "Acting",
        "name": "Paul Mantee",
        "place_of_birth": "San Francisco, California, USA",
        "popularity": 0.2186,
        "profile_path": "/sYq9DQqwvjkY1ntcBZgrGyouamR.jpg"
    }
}