{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bwyLycDaQdS3rS4crpbYssYLJRy.jpg",
                "genre_ids": [
                    878,
                    28
                ],
                "id": 8337,
                "original_language": "en",
                "original_title": "They Live",
                "overview": "A lone drifter stumbles upon a unique pair of sunglasses that reveal aliens are systematically gaining control of the Earth by masquerading as humans and lulling the public into submission.",
                "popularity": 6.5976,
                "poster_path": "/ngnybFTuopfbfmmEeX9jjBQQmF6.jpg",
                "release_date": "1988-11-04",
                "title": "They Live",
                "video": false,
                "vote_average": 7.299,
                "vote_count": 3235,
                "character": "Well Dressed Customer",
                "credit_id": "559e012ec3a368080e000c09",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": true,
        "also_known_as": [
            "John Goff",
            "Jake Barnes",
            "Heffey von Hampton",
            "John Grant",
            "Evan Renshaw",
            "Fred Hampton",
            "Noel Lyons",
            "Tom Reece",
            "Jack Barnes"
        ],
        "biography": "John F. Goff rates highly as an extremely prolific, versatile and shamefully underrated jack of all trades in the delightfully down'n'dirty annals of 70s Grade B exploitation cinema. He was born on May 24 and was raised on the Gulf Coast of Mississippi in the small town of Kreole. Moreover, John attended Mississippi Southern College on a scholarship.  Big and burly, with gray hair, a gentle twangy voice, and an engagingly low-key manner, Goff bears a striking resemblance to a beefy Hal Holbrook. John decided to forsake a promising athletic career to pursue acting instead while attending college. He started acting in summer stock stage theater productions and wrote movie reviews for both \"Variety\" and \"The Hollywood Reporter\" prior to becoming involved with the film business. Among Goff's most memorable roles are one of Ralph Meeker's vicious flunkies in the brutal revenge potboiler \"Johnny Firecloud,\" Millie Perkin's vile abusive and alcoholic sea captain father in the deeply disturbing \"The Witch Who Came from the Sea,\" an excitable railroad worker in the nifty sci-fi item \"The Alpha Incident,\" a helpful psychiatrist in Al Adamson's \"Nurse Sherri,\" the Nashville music producer who gets punched in the mouth by Gary Busey in \"The Buddy Holly Story,\" a redneck hunter in \"The Capture of Bigfoot,\" a doomed fisherman in John Carpenter's splendidly spooky \"The Fog,\" a sleazy lawyer in \"Maniac Cop,\" a sarcastic police psychiatrist in \"Relentless\" (Goff reprised this part in the first sequel), the arrogant alien at the newsstand who's rude to Roddy Piper in \"They Live,\" and Tracy Griffith's weary rancher dad in \"Skeeter.\" Goff has sizable supporting roles in the first two notoriously nasty \"Ilsa\" pictures: he's the Nazi prison camp guard who gets his throat cut wide open in the original and an oil sheik in the second one. Goff has done guest spots on the TV shows \"L.A. Law,\" \"The Dukes of Hazzard,\" and \"The Big Valley.\" Moreover, Goff and his longtime best buddy George \"Buck\" Flower appeared in dozens of enjoyably trashy movies together; they even play brothers in both \"Berserker\" and \"The Devil and Leroy Bassett.\" The dynamic drive-in flick duo of Goff and Flower collaborated on the scripts for \"Death Falls,\" \"In Search of A Golden Sky,\" \"Joyride to Nowhere,\" \"Drive-In Massacre,\" and \"Teenage Seductress.\" Goff has co-written screenplays for the Matt Cimber features \"Fake-Out,\" \"Butterfly,\" \"A Time to Die,\" \"Hundra,\" and the recent \"Miriam.\" Goff often has small roles in Cimber's movies as well. Goff also co-wrote the script for William Lustig's entertaining action romp \"Hit List\" and pops up in a small part as a prosecuting attorney. In addition to his substantial acting and writing credits, John F. Goff has worked as a grip on two Cimber films and handled second unit director chores on both \"My Boys Are Good Boys\" and \"Bad Georgia Road.\"  - IMDb Mini Biography By: woodyanders",
        "birthday": "1939-05-24",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 52622,
        "imdb_id": "nm0055634",
        "known_for_department": "Acting",
        "name": "John F. Goff",
        "place_of_birth": null,
        "popularity": 5.989,
        "profile_path": "/sTZfE8gExmH2InGsSPI0a4n8mV9.jpg"
    }
}