{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wWWXd27yF8sK9bLgAD4zxiGcYJW.jpg",
                "genre_ids": [
                    10751,
                    16
                ],
                "id": 44874,
                "original_language": "en",
                "original_title": "Barbie: A Fashion Fairytale",
                "overview": "Join Barbie in a colourful, modern-day fairytale filled with fashion, friends and fun! Barbie and her dog Sequin jet off to visit her Aunt's amazing fashion house in Paris, and much to her surprise it's about to be shut down forever. After she discovers three enchanting Flairies with sparkle-magic powers, Barbie comes up with a brilliant idea to save the business. She even inspires Alice, a shy fashion designer, and together they create a dazzling runway fashion show. Barbie shows that magic happens when you believe in yourself.",
                "popularity": 2.4678,
                "poster_path": "/bFnf8f8DXdCANQ7Y62djgubhh4P.jpg",
                "release_date": "2010-09-14",
                "title": "Barbie: A Fashion Fairytale",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 772,
                "character": "Barbie Roberts (voice)",
                "credit_id": "52fe46a1c3a36847f8109641",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/wnKwGjUfxIs7fasocw7JwZ3gfQD.jpg",
                "genre_ids": [
                    10751,
                    16,
                    14
                ],
                "id": 73456,
                "original_language": "en",
                "original_title": "Barbie: Princess Charm School",
                "overview": "Barbie stars as Blair Willows, a kind-hearted girl who is chosen to attend Princess Charm School: a magical, modern place that teaches dancing, how to have tea parties, and proper princess manners. Blair loves her classes -- as well as the helpful magical sprites and her new friends, Princesses Hadley and Isla. But when royal teacher Dame Devin discovers that Blair looks a lot like the kingdom’s missing princess, she turns Blair’s world upside down to stop her from claiming the throne. Now Blair, Hadley and Delancy must find an enchanted crown to prove Blair’s true identity in this charming and magical princess story!",
                "popularity": 7.8064,
                "poster_path": "/lI2jPbssax6XX5vDqB9mTJHGzfH.jpg",
                "release_date": "2011-08-11",
                "title": "Barbie: Princess Charm School",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 839,
                "character": "Blair (voice)",
                "credit_id": "52fe489bc3a368484e101b03",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/4yN3l7ZQgGDZOewvoiWKcLt7EVb.jpg",
                "genre_ids": [
                    16,
                    10751,
                    14
                ],
                "id": 57737,
                "original_language": "en",
                "original_title": "Barbie: A Fairy Secret",
                "overview": "Get ready for Barbie: A Fairy Secret, an amazing adventure with Barbie where she discovers there are fairies living secretly all around us! When Ken is suddenly whisked away by a group of fairies, Barbie's two fashion stylist friends reveal they are actually fairies and that Ken has been taken to a magical secret fairy world not far away! Barbie and her rival Raquelle take off with the fairy friends on an action-packed journey to bring him back. Along the way they must stick together and learn that the real magic lies not just in the fairy world itself, but in the power of friendship.",
                "popularity": 9.91,
                "poster_path": "/wn2aoYKOonwMNKkzfgO5y4ji8pB.jpg",
                "release_date": "2011-03-01",
                "title": "Barbie: A Fairy Secret",
                "video": false,
                "vote_average": 6.873,
                "vote_count": 523,
                "character": "Barbie (voice)",
                "credit_id": "58cd32649251415a7d00b39c",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Diane Kaarina McGowan"
        ],
        "biography": "Diana Kaarina (born March 17, 1975) is a Canadian voice actress, stage performer, singer-songwriter, dancer and teacher based in Vancouver, BC.\n\nKaarina was born in Vancouver, British Columbia and raised in Richmond, British Columbia. She got her start with Theatre Under the Stars in Stanley Park and has performed in Canadian and Broadway productions of numerous musicals, including Anne of Green Gables – The Musical, The Phantom of the Opera, Les Misérables, and Rent.\n\nFrom Wikipedia, the free encyclopedia",
        "birthday": "1975-03-17",
        "deathday": null,
        "gender": 1,
        "homepage": "http://dianakaarina.com/",
        "id": 526306,
        "imdb_id": "nm4082359",
        "known_for_department": "Acting",
        "name": "Diana Kaarina",
        "place_of_birth": "Vancouver, British Columbia, Canada",
        "popularity": 0.8076,
        "profile_path": "/xXSKWcM0uztY2iwUz5U31Wn6etR.jpg"
    }
}