{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/umtxTkop7Ec9UFynjB7Z53lmkX1.jpg",
                "genre_ids": [
                    18,
                    10402
                ],
                "id": 1677,
                "original_language": "en",
                "original_title": "Ray",
                "overview": "Born on a sharecropping plantation in Northern Florida, Ray Charles went blind at seven. Inspired by a fiercely independent mom who insisted he make his own way, He found his calling and his gift behind a piano keyboard. Touring across the Southern musical circuit, the soulful singer gained a reputation and then exploded with worldwide fame when he pioneered coupling gospel and country together.",
                "popularity": 3.6721,
                "poster_path": "/tSPC7sO2XYNL9QcMmK88tuUALL5.jpg",
                "release_date": "2004-10-29",
                "title": "Ray",
                "video": false,
                "vote_average": 7.45,
                "vote_count": 2088,
                "character": "Dr. Hacker",
                "credit_id": "53091f75925141785e000701",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Patrick Nicolas Jean Sixte Ghislain Bauchau ",
            "Πάτρικ Μπαουχάου",
            "پاتریک بوچو"
        ],
        "biography": "Patrick Nicolas Jean Sixte Ghislain Bauchau (born 6 December 1938) is a Belgian actor best known for his roles in the films A View to a Kill, The Rapture and Panic Room, as well as the TV shows The Pretender and House.\n\nPatrick Bauchau was born in Brussels, Belgium on 6 December 1938, the son of Mary (née Kozyrev), a Russian-born school administrator and publisher, and Henry Bauchau, a school administrator, lawyer, publisher, writer, and psychoanalyst who served as an officer in the Belgian Underground during World War II. He was raised in Belgium, Switzerland and England.\n\nHe attended Oxford University on an academic scholarship and speaks German, French, English, Spanish, Italian, and a little Russian, Portuguese and Dutch.\n\nHe is married to the French actress and writer Mijanou Bardot, and lives in Los Angeles.",
        "birthday": "1938-12-06",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.aartis.fr/artiste.cfm/75075_115_2-Patrick_Bauchau.html",
        "id": 5274,
        "imdb_id": "nm0000872",
        "known_for_department": "Acting",
        "name": "Patrick Bauchau",
        "place_of_birth": "Brussels, Belgium",
        "popularity": 0.4451,
        "profile_path": "/kdrFAJJFdfQaYUETTHQw77gim9O.jpg"
    }
}