{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/egKntJKzEL6HgalIyQ0Q5cMmDOA.jpg",
                "genre_ids": [
                    53,
                    80,
                    9648
                ],
                "id": 65754,
                "original_language": "en",
                "original_title": "The Girl with the Dragon Tattoo",
                "overview": "Disgraced journalist Mikael Blomkvist investigates the disappearance of a weary patriarch's niece from 40 years ago. He is aided by the pierced, tattooed, punk computer hacker named Lisbeth Salander. As they work together in the investigation, Blomkvist and Salander uncover immense corruption beyond anything they have ever imagined.",
                "popularity": 5.7283,
                "poster_path": "/8bokS83zGdhaXgN9tjidUKmAftW.jpg",
                "release_date": "2011-12-14",
                "title": "The Girl with the Dragon Tattoo",
                "video": false,
                "vote_average": 7.376,
                "vote_count": 7280,
                "character": "Detective Isaksson",
                "credit_id": "52fe4718c3a368484e0b4c9d",
                "order": 41
            },
            {
                "adult": false,
                "backdrop_path": "/1RWLMyC9KcFfcaoViMiJGSSZzzr.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 100402,
                "original_language": "en",
                "original_title": "Captain America: The Winter Soldier",
                "overview": "After the cataclysmic events in New York with The Avengers, Steve Rogers, aka Captain America is living quietly in Washington, D.C. and trying to adjust to the modern world. But when a S.H.I.E.L.D. colleague comes under attack, Steve becomes embroiled in a web of intrigue that threatens to put the world at risk. Joining forces with the Black Widow, Captain America struggles to expose the ever-widening conspiracy while fighting off professional assassins sent to silence him at every turn. When the full scope of the villainous plot is revealed, Captain America and the Black Widow enlist the help of a new ally, the Falcon. However, they soon find themselves up against an unexpected and formidable enemy—the Winter Soldier.",
                "popularity": 8.6751,
                "poster_path": "/tVFRpFw3xTedgPGqxW0AOI8Qhh0.jpg",
                "release_date": "2014-03-20",
                "title": "Captain America: The Winter Soldier",
                "video": false,
                "vote_average": 7.655,
                "vote_count": 19406,
                "character": "Councilman Rockwell",
                "credit_id": "52fe49d8c3a36847f81a95d5",
                "order": 16
            },
            {
                "adult": false,
                "backdrop_path": "/6qvKbLYkfXXKM82M38UmDz3IfBk.jpg",
                "genre_ids": [
                    16,
                    35,
                    28,
                    10751
                ],
                "id": 82881,
                "original_language": "en",
                "original_title": "Tangled Ever After",
                "overview": "The kingdom is in a festive mood as everyone gathers for the royal wedding of Rapunzel and Flynn. However, when Pascal and Maximus, as flower chameleon and ring bearer, respectively, lose the gold bands, a frenzied search and recovery mission gets underway. As the desperate duo tries to find the rings before anyone discovers that they’re missing, they leave behind a trail of comical chaos that includes flying lanterns, a flock of doves, a wine barrel barricade and a very sticky finale. Will Maximus and Pascal save the day and make it to the church in time? And will they ever get Flynn’s nose right?",
                "popularity": 4.9006,
                "poster_path": "/ak5SCuJbdf8G4NbQ1KIUHjplrF1.jpg",
                "release_date": "2012-01-13",
                "title": "Tangled Ever After",
                "video": false,
                "vote_average": 7.131,
                "vote_count": 1083,
                "character": "Priest (voice)",
                "credit_id": "550d8004925141469c005ad7",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Alan Hugh Dale",
            "Άλαν Ντέιλ",
            "آلن دیل"
        ],
        "biography": "Alan Hugh Dale is a New Zealand actor. As a child, Dale developed a love of theatre and also became a rugby player. After retiring from the sport he took on a number of professions to support his family, before deciding to become a professional actor at the age of 27. With work limited in New Zealand, Dale moved to Australia, where he played Dr. John Forrest in The Young Doctors from 1979 to 1982. He later appeared as Jim Robinson in Neighbours, a part he played for eight years. The character is the role Dale is most associated with in Australia and the United Kingdom. He left the series when he fell out with the producers over the pay he and the rest of the cast received.\n\nAfter leaving Neighbours, Dale became typecast as Robinson in Australia and struggled to find work. His career was revitalised after he relocated to the United States in 2000. Since then he has had roles in many American series including prominent parts in The O.C. (as Caleb Nichol) and Ugly Betty (as Bradford Meade), as well as recurring and guest roles in Lost, 24, NCIS, ER, The West Wing, The X-Files and The Lone Gunmen. Dale has also appeared in minor roles in films such as Star Trek Nemesis, Hollywood Homicide and Indiana Jones and the Kingdom of the Crystal Skull as well as the London West End production of Spamalot. Dale has been married to former Miss Australia Tracey Pearson since 1990 and has four children.",
        "birthday": "1947-05-06",
        "deathday": null,
        "gender": 2,
        "homepage": "https://lmcm.com.au/actors/#/actors/24068",
        "id": 52760,
        "imdb_id": "nm0197638",
        "known_for_department": "Acting",
        "name": "Alan Dale",
        "place_of_birth": "Dunedin, Otago, New Zealand",
        "popularity": 0.6796,
        "profile_path": "/3BcpSoKBOwHX0wxaPZpOJ5buO89.jpg"
    }
}