{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/pxL08w7Eq0vKrQ3mJzYp0VHGaKG.jpg",
                "genre_ids": [
                    28,
                    53,
                    878
                ],
                "id": 49530,
                "original_language": "en",
                "original_title": "In Time",
                "overview": "In the not-too-distant future, the aging gene has been switched off. To avoid overpopulation, time has become the currency and the way people pay for luxuries and necessities. The rich can live forever, while the rest struggle to negotiate for their immortality. A poor young man who suddenly comes into a fortune of time finds himself on the run from a corrupt police force known as the \"time keepers\".",
                "popularity": 9.8493,
                "poster_path": "/3Mwj2sIONQckOZP3YwsUXF7U5I4.jpg",
                "release_date": "2011-10-27",
                "title": "In Time",
                "video": false,
                "vote_average": 6.971,
                "vote_count": 11771,
                "character": "Victa",
                "credit_id": "56b2561d92514103450008b9",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Raymond Santiago (born June 15, 1984 in South Bronx, New York) is an American actor of Puerto Rican descent. Santiago graduated in 2002 from Fiorello H. LaGuardia High School for the Arts in New York City.\n\nHe played Jorge Villalobos in the film Meet the Fockers, and had minor roles in 2005's Dirty Deeds and 2006's Accepted. He also starred as Michelle Rodriguez's brother, Tiny Guzman in the 2000 film Girlfight, as Lardo in 2009's Endless Bummer and as Alberto in Suburban Gothic.\n\nHe also played in the 2006 film The Sasquatch Dumpling Gang (also known as The Sasquatch Gang), alongside Justin Long, and in American Son along Nick Cannon. He also appeared in the 2011 film In Time. Santiago appeared in episodes of the television series My Name is Earl, Crossing Jordan, Law & Order: LA and Dexter. In the Ash vs. Evil Dead television series from 2015–2018, he portrayed Pablo Simon Bolivar, an immigrant co-worker who becomes Ash's sidekick.",
        "birthday": "1984-06-15",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 52957,
        "imdb_id": "nm0763631",
        "known_for_department": "Acting",
        "name": "Ray Santiago",
        "place_of_birth": "The Bronx, New York, U.S.",
        "popularity": 0.4613,
        "profile_path": "/hmRNXZ0A2MEswe0BUgXBATk6OSO.jpg"
    }
}