{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tOkSenL74N23O4S7wjJSUHz7Aeh.jpg",
                "genre_ids": [
                    80,
                    18,
                    53
                ],
                "id": 388,
                "original_language": "en",
                "original_title": "Inside Man",
                "overview": "When an armed, masked gang enter a Manhattan bank, lock the doors and take hostages, the detective assigned to effect their release enters negotiations preoccupied with corruption charges he is facing.",
                "popularity": 8.6347,
                "poster_path": "/ffMUgkDZICNiyaws1Jkv8qG8uFW.jpg",
                "release_date": "2006-03-17",
                "title": "Inside Man",
                "video": false,
                "vote_average": 7.398,
                "vote_count": 6057,
                "character": "Steve",
                "credit_id": "52fe423dc3a36847f800ebd5",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Carlos Andrés Gómez is an award-winning poet, actor, speaker, and writer from New York City. He is the author of the coming-of-age memoir Man Up: Reimagining Modern Manhood, released by Gotham Books, an imprint of Penguin.  Nominated for the Pushcart Prize and named Artist of the Year at the 2009 Promoting Outstanding Writers Awards, he costarred in Spike Lee’s #1 movie Inside Man with Denzel Washington, Jodie Foster, and Clive Owen.  He appeared in the sixth season of HBO’s Russell Simmons Presents Def Poetry and, most recently, in the third season of TV One’s Verses and Flow.  He has headlined festivals all over the world, including Indonesia, South Africa, Australia, Ireland, Spain, Canada, the U.K., and as Guest of Honor at the Berlin International Literature Festival in Germany.  Carlos has been featured on NPR, TEDx, Upworthy, MSNBC’s “Melissa Harris-Perry,” the United Nations Commission on the Status of Women, Central Park SummerStage, Macy’s Passport Show, the Clinton Global Initiative Annual Meeting, the Omega Institute’s Women & Power Conference, and on Broadway with Savion Glover.  A former social worker and inner-city public school teacher, he grew up the child of a United Nations’ diplomat and indigenous rights’ activist – moving twelve times before graduating high school while living in four countries. He has lectured and performed at more than 300 colleges and universities, facilitated countless workshops, and delivered numerous keynotes and commencement addresses. He continues to tour the globe.",
        "birthday": "1981-12-23",
        "deathday": null,
        "gender": 2,
        "homepage": "http://carloslive.com/",
        "id": 5295,
        "imdb_id": "nm2147283",
        "known_for_department": "Acting",
        "name": "Carlos Andrés Gómez",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.055,
        "profile_path": "/9fmpgP5iaKb2pdZuXLh4kRktRHv.jpg"
    }
}