{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tOkSenL74N23O4S7wjJSUHz7Aeh.jpg",
                "genre_ids": [
                    80,
                    18,
                    53
                ],
                "id": 388,
                "original_language": "en",
                "original_title": "Inside Man",
                "overview": "When an armed, masked gang enter a Manhattan bank, lock the doors and take hostages, the detective assigned to effect their release enters negotiations preoccupied with corruption charges he is facing.",
                "popularity": 9.2897,
                "poster_path": "/ffMUgkDZICNiyaws1Jkv8qG8uFW.jpg",
                "release_date": "2006-03-17",
                "title": "Inside Man",
                "video": false,
                "vote_average": 7.398,
                "vote_count": 6057,
                "character": "Herman Gluck",
                "credit_id": "52fe423dc3a36847f800ebf9",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "GERRY  VICHI  began his acting career while teaching English and Drama at Holliston High back home in Holliston, Mass.  He began doing doing summer stock and local dinner theatre shows all over New England and met Jack Hallett at the Town and Country Playhouse in Salem, New Hampshire in 1971.  He eventually earned his Actor’s Equity card at the American Stage Festival in Milford, New Hampshire. After much talk of becoming an actor full time, Jack Hallett called him in 1973 from the Village Dinner Theatre in Raleigh, NC and offered him the lead in “Tunnel of Love” opposite film actress Margaret O’Brien.  Gerry resigned from his teaching job of 15 years, flew the next morning to North Carolina, and never looked back.  He stayed on in Raleigh to play opposite Dan Dailey in “The Odd Couple” and headed straight to New York City after. He was immediately hired for his first Broadway show,  Kander and Ebb’s “Woman of the Year” starring Lauren Bacall and Harry Guardino.  It was deliriously fun for two years in the 1970’s to be in a hit Broadway show.  Other Broadway shows followed and he played “Moonface Martin” in “Anything Goes” at Lincoln Center starring Patti LuPone,  the short lived, “Ain’t Broadway Grand”, the Wizard in “The Wizard of Oz”, Fezziwig in the musical version of “A Christmas Carol”,  and  “How to Succeed in Business Without Really Trying” with Matthew Broderick.  He appeared in a string of shows of the popular Encore series such as “Do Re Mi”, ”Follies”, and “70, Girls, 70”, another Kander and Ebb gem.  He returned to Broadway in “The Drowsy Chaperone” and when that closed, he began rehearsals the next morning for yet another Kander and Ebb hit, “Curtains” starring David Hyde Pierce. Gerry also worked Off-Broadway with Al Pacino in Brecht’s, “In the Jungle of the Cities” and Bill Irwin in “Scapin”.  His film credits include, “Coma”, “King of the Gypsies”, “Vibes”, “City Hall”(again with Al Pacino), “Find Me Guilty”, “Just My Luck”(w/Lindsay Lohan), and the role of Herman Gluck in Spike Lee’s wonderful drama, “Inside Man” starring Denzel Washington and Clive Owen, to date, his most gratifying cinematic experience.  After “Curtains” closes, Gerry is scheduled to star in a new musical, “Minsky’s”,\n\nbased on the grand old days of burlesque.  ““Minsky’s” was written by Bob Martin(“Drowsy Chaperone”) and Charles Strouse(“Annie”, “Bye Bye Birdie”)\n\nand  Casey Nicolaw will direct. The phone call from Jack Hallett in 1973 changed his life so he’s had a lifetime habit of returning all Jack’s calls immediately!!  He looks forward to working at the brand new Bayberry Dinner Playhouse.  Gerry Vichi is an Actor known for Find Me Guilty (2006), Sex and the City 2 (2010) and Man on a Ledge (2012).",
        "birthday": "1937-08-15",
        "deathday": null,
        "gender": 2,
        "homepage": "https://oc.mymovies.dk/Person/fff5479f-51d3-4abb-a6e0-f6fb20d6a440",
        "id": 5302,
        "imdb_id": "nm0895942",
        "known_for_department": "Acting",
        "name": "Gerry Vichi",
        "place_of_birth": "Holliston, Massachusetts, USA",
        "popularity": 0.3763,
        "profile_path": null
    }
}