{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5rARlA8beRAVXPYzSaF2NoS8Ry5.jpg",
                "genre_ids": [
                    16,
                    35,
                    10751,
                    14
                ],
                "id": 76492,
                "original_language": "en",
                "original_title": "Hotel Transylvania",
                "overview": "Welcome to Hotel Transylvania, Dracula's lavish five-stake resort, where monsters and their families can live it up and no humans are allowed. One special weekend, Dracula has invited all his best friends to celebrate his beloved daughter Mavis's 118th birthday. For Dracula catering to all of these legendary monsters is no problem but the party really starts when one ordinary guy stumbles into the hotel and changes everything!",
                "popularity": 11.5046,
                "poster_path": "/eJGvzGrsfe2sqTUPv5IwLWXjVuR.jpg",
                "release_date": "2012-09-20",
                "title": "Hotel Transylvania",
                "video": false,
                "vote_average": 6.963,
                "vote_count": 8886,
                "character": "Eunice (voice)",
                "credit_id": "52fe493ec3a368484e1216c9",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/5OFg2grrAMPo8OOKHQMCeuKU3js.jpg",
                "genre_ids": [
                    35,
                    10402
                ],
                "id": 11031,
                "original_language": "en",
                "original_title": "This Is Spinal Tap",
                "overview": "\"This Is Spinal Tap\" shines a light on the self-contained universe of a metal band struggling to get back on the charts, including everything from its complicated history of ups and downs, gold albums, name changes and undersold concert dates, along with the full host of requisite groupies, promoters, hangers-on and historians, sessions, release events and those special behind-the-scenes moments that keep it all real.",
                "popularity": 4.1471,
                "poster_path": "/z2LA8eBTSuuPC4NBhIZRNIwpimH.jpg",
                "release_date": "1984-03-02",
                "title": "This Is Spinal Tap",
                "video": false,
                "vote_average": 7.415,
                "vote_count": 1516,
                "character": "Bobbi Flekman",
                "credit_id": "58134d6d925141571e024454",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/qBLEWvJNVsehJkEJqIigPsWyBse.jpg",
                "genre_ids": [
                    16,
                    35,
                    10751,
                    12,
                    14
                ],
                "id": 585083,
                "original_language": "en",
                "original_title": "Hotel Transylvania: Transformania",
                "overview": "When Van Helsing's mysterious invention, the \"Monsterfication Ray,\" goes haywire, Drac and his monster pals are all transformed into humans, and Johnny becomes a monster. In their new mismatched bodies, Drac and Johnny must team up and race across the globe to find a cure before it's too late, and before they drive each other crazy.",
                "popularity": 13.0392,
                "poster_path": "/teCy1egGQa0y8ULJvlrDHQKnxBL.jpg",
                "release_date": "2022-01-31",
                "title": "Hotel Transylvania: Transformania",
                "video": false,
                "vote_average": 7.053,
                "vote_count": 2906,
                "character": "Eunice (voice)",
                "credit_id": "60a3961b7314a100582a678a",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Φραν Ντρέσερ"
        ],
        "biography": "Francine Joy Drescher (born September 30, 1957) is an American actress, comedian, writer, activist, and trade union leader. Drescher is known for her role as Fran Fine in the television sitcom The Nanny (1993–1999).\n\nDrescher made her screen debut with a small role in the 1977 film Saturday Night Fever, and later appeared in American Hot Wax (1978) and Wes Craven's horror tale Stranger in Our House (1978). In the 1980s, she gained recognition as a comedic actress in the films Gorp (1980), The Hollywood Knights (1980), Doctor Detroit (1983), This Is Spinal Tap (1984), and UHF (1989) while establishing a television career with guest appearances on several series. In 1993, she achieved wider fame as Fran Fine in her own sitcom vehicle The Nanny, for which she was nominated for two Emmy Awards and two Golden Globe Awards for Best Actress in a Comedy Television Series during the show's run. In the 2000s, Drescher reinforced her position as a leading sitcom star with Living with Fran and Happily Divorced. Since 2012, she has starred in the animated Hotel Transylvania film series.\n\nDescription above from the Wikipedia article Fran Drescher, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1957-09-30",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 53122,
        "imdb_id": "nm0000376",
        "known_for_department": "Acting",
        "name": "Fran Drescher",
        "place_of_birth": "Flushing, Queens, New York City, New York, USA",
        "popularity": 1.0181,
        "profile_path": "/kQzvZ4ksLunfs3QZQtzRhzLJPBY.jpg"
    }
}