{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/12xU204ABgr31iCTM57JT6wGFMg.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 55787,
                "original_language": "en",
                "original_title": "Water for Elephants",
                "overview": "In this captivating Depression-era melodrama, impetuous veterinary student Jacob Jankowski joins a celebrated circus as an animal caretaker but faces a wrenching dilemma when he's transfixed by angelic married performer Marlena.",
                "popularity": 2.6745,
                "poster_path": "/8T7Hvb9trKvCAmbSI8cEIU0Sl2T.jpg",
                "release_date": "2011-04-15",
                "title": "Water for Elephants",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 2562,
                "character": "Foxtrot Dancer (uncredited)",
                "credit_id": "63b275a8c56d2d00f30fda1a",
                "order": 53
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Melissa Johnston is a Canadian-born, American actress. She was raised in the Detroit suburbs by her mother, a Canadian business owner, and her father, an American steel worker. Melissa has one sister, her twin, with whom she remains close.\n\nImmediately after secondary school, Melissa moved to Los Angeles to pursue her acting career. That summer, she attended the American Academy of Dramatic Arts, and then transferred to the American Musical and Dramatic Academy where she completed her conservatory studies in 2009.\n\nShe quickly began performing in regional theater productions and independent short films. In the summer of 2009 she became a spokes model for Neutrogena's skiniD campaign, which gained her national recognition as a model. Capitalizing on her success in the commercial world, she began landing small roles on network television and in theatrical film releases, including ABC Family's Greek and Twentieth Century Fox's Water for Elephants.\n\nThe following year, she earned her first lead role in a feature, as Sue in the Asylum's Barely Legal. The low-budget, raunchy, teen comedy enjoyed unexpected success. Melissa received nods for the 'outstanding performance' even though she admitted (in an interview with Matchflick.com) that she had no time to prep the role; literally being handed the script the first day on set. The film earned Melissa international recognition in the genre, and opened many doors for her in acting and modeling.",
        "birthday": "1989-04-05",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 531566,
        "imdb_id": "nm4437375",
        "known_for_department": "Acting",
        "name": "Melissa Johnston",
        "place_of_birth": "Windsor, Ontario, Canada",
        "popularity": 0.2413,
        "profile_path": "/5osSoVY91clvcsZqEOt12Qg0m42.jpg"
    }
}