{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/63ItW5WInTWZkRdyTfCZIn6ZvbH.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749
                ],
                "id": 392,
                "original_language": "en",
                "original_title": "Chocolat",
                "overview": "A mother and daughter move to a small French town where they open a chocolate shop. The town, religious and morally strict, is against them, as they represent free-thinking and indulgence. When a group of gypsies arrive by riverboat, the Mayor's prejudices lead to a crisis.",
                "popularity": 2.7024,
                "poster_path": "/7sUfspdrvxLMgGkrOq46lPh0Scj.jpg",
                "release_date": "2000-12-22",
                "title": "Chocolat",
                "video": false,
                "vote_average": 6.972,
                "vote_count": 3382,
                "character": "Mrs. Audel",
                "credit_id": "52fe423dc3a36847f800eea7",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/hVvW015x8cD2X0KthGovw27EpF2.jpg",
                "genre_ids": [
                    10402,
                    10749,
                    35
                ],
                "id": 2769,
                "original_language": "en",
                "original_title": "An American in Paris",
                "overview": "Jerry Mulligan is an exuberant American expatriate in Paris trying to make a reputation as a painter. His friend Adam is a struggling concert pianist who's a long time associate of a famous French singer, Henri Baurel. A lonely society woman, Milo Roberts, takes Jerry under her wing and supports him, but is interested in more than his art.",
                "popularity": 3.9087,
                "poster_path": "/lyDXkvG53ldz6Cf7dbjJl7TaoP5.jpg",
                "release_date": "1951-09-26",
                "title": "An American in Paris",
                "video": false,
                "vote_average": 7.026,
                "vote_count": 606,
                "character": "Lise Bouvier",
                "credit_id": "52fe436cc3a36847f8052ff7",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Лесли Карон",
            "Leslie Claire Margaret Caron"
        ],
        "biography": "Leslie Claire Margaret Caron (born 1 July 1931) is a French-American actress, dancer and writer. She is the recipient of various accolades, including a Golden Globe Award, two BAFTA Awards, and a Primetime Emmy Award, in addition to nominations for two Academy Awards.\n\nCaron started her career as a ballerina. She made her film debut in the musical An American in Paris (1951), followed by roles in The Man with a Cloak (1951), Glory Alley (1952) and The Story of Three Loves (1953), before receving critical acclaim for her role as an orphan in Lili (also 1953), which earned her the BAFTA Award for Best Foreign Actress and garnered nominations for an Academy Award and a Golden Globe Award.\n\nAs a leading lady, Caron went on to star in films such as The Glass Slipper, Daddy Long Legs (both 1955), Gigi (1958), Fanny (1961), both of which earned her Golden Globe nominations, Guns of Darkness (1962), The L-Shaped Room (both 1962), Father Goose (1964) and A Very Special Favor (1965). For her role of a single pregnant woman in The L-Shaped Room, Caron, in addition to receiving a second Academy Award nomination, won the Golden Globe Award for Best Actress in a Motion Picture – Drama and a second BAFTA Award.\n\nCaron's other roles include Is Paris Burning? (1966), That's Entertainment! (1974), The Man Who Loved Women, Valentino (both 1977), Damage (1992), Funny Bones (1995), Chocolat (2000) and Le Divorce (2003). In 2007, she won the Primetime Emmy Award for Outstanding Guest Actress in a Drama Series for her performance of a child molestation victim in Law & Order: Special Victims Unit.\n\nDescription above from the Wikipedia article Leslie Caron, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1931-07-01",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 5320,
        "imdb_id": "nm0001989",
        "known_for_department": "Acting",
        "name": "Leslie Caron",
        "place_of_birth": "Boulogne-Billancourt, Seine [now Hauts-de-Seine], France",
        "popularity": 0.7132,
        "profile_path": "/8KaogFPimucFHFyUkdA0c0Bym5C.jpg"
    }
}