{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/30UGnraRdbZl4a8vcfYJPIzvzjM.jpg",
                "genre_ids": [
                    99,
                    10402,
                    10770
                ],
                "id": 319075,
                "original_language": "en",
                "original_title": "Cobain: Montage of Heck",
                "overview": "Hailed as one of the most innovative and intimate documentaries of all time, experience Kurt Cobain like never before in the only ever fully authorized portrait of the famed music icon. Academy Award nominated filmmaker Brett Morgen expertly blends Cobain's personal archive of art, music, never seen before movies, animation and revelatory interviews from his family and closest friends.",
                "popularity": 1.404,
                "poster_path": "/d0DgEvMNrGGlUXqyQ7HJbgnIxO7.jpg",
                "release_date": "2015-03-23",
                "title": "Cobain: Montage of Heck",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 717,
                "character": "Self (archive footage)",
                "credit_id": "54c41718c3a3687929006b17",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "David Grohl",
            "Foo Fighters",
            "Nirvana",
            "Them Crooked Vultures"
        ],
        "biography": "David Eric \"Dave\" Grohl (born January 14, 1969) is an American rock musician, multi-instrumentalist, and singer-songwriter who is the lead vocalist, guitarist, and primary songwriter for the Foo Fighters; the former drummer for Nirvana and Scream; the drummer for Them Crooked Vultures; and wrote all the music for his short-lived side projects Late! and Probot. He has also been involved with Queens of the Stone Age, and has performed session work for a variety of musicians, including Killing Joke, Tenacious D, Nine Inch Nails, The Prodigy, Slash and Juliette Lewis. Dave Grohl has performed in over 30 bands since becoming a musician.\n\nDescription above from the Wikipedia article Dave Grohl, licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": "1969-01-14",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 533061,
        "imdb_id": "nm0342970",
        "known_for_department": "Acting",
        "name": "Dave Grohl",
        "place_of_birth": "Warren, Ohio, USA",
        "popularity": 0.2119,
        "profile_path": "/hDfFm3lLPcdupe3PDucZdidKFBI.jpg"
    }
}