{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yYUGy4MDM6jbJoamlfo3HT6Guhy.jpg",
                "genre_ids": [
                    80,
                    53,
                    18
                ],
                "id": 11826,
                "original_language": "en",
                "original_title": "Sexy Beast",
                "overview": "Ex-safecracker Gal Dove has served his time behind bars and is blissfully retired to a Spanish villa paradise with a wife he adores. The idyll is shattered by the arrival of his nemesis Don Logan, intent on persuading Gal to return to London for one last big job.",
                "popularity": 1.6418,
                "poster_path": "/xTfCZTzhgHNAR1pf5D49WH4buI5.jpg",
                "release_date": "2000-09-13",
                "title": "Sexy Beast",
                "video": false,
                "vote_average": 7.005,
                "vote_count": 831,
                "character": "Bruno",
                "credit_id": "59da19d592514124cd040988",
                "order": 23
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Eddie O'Connell (b 1960) is an English actor best known for playing the lead in the 1986 film Absolute Beginners.\n\nO'Connell had studied acting but was very inexperienced when cast in the lead, atlhough he had done some stage work. He worked as a gas fitter before becoming an actor. His Absolute Beginners co star Patsy Kensit later wrote \"there was no chemistry between Eddie and me... which didn’t help matters, though there was nothing either of us could do about it. I’m sure Stephen Woolley and Julien thought I hated Eddie, but I didn’t. We simply didn’t gel on screen or off, which must have been a huge disappointment. O'Connell worked steadily in television after Absolute Beginners. His other movie credits include Sexy Beast and his television credits include Civvies. He later acted under the name \"Edward O'Connell\"",
        "birthday": "1960-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 533540,
        "imdb_id": "nm0640064",
        "known_for_department": "Acting",
        "name": "Eddie O'Connell",
        "place_of_birth": null,
        "popularity": 0.2093,
        "profile_path": "/r0WZlcF5wlobqOHpNpacT3SbuaZ.jpg"
    }
}