{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zGCnIADWwpjGllYv8DgT8HIuIQl.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 26022,
                "original_language": "hi",
                "original_title": "My Name Is Khan",
                "overview": "Rizwan Khan, a Muslim from the Borivali section of Mumbai, has Asperger's syndrome. He marries a Hindu single mother, Mandira, in San Francisco. After 9/11, Rizwan is detained by authorities at LAX who treat him as a terrorist because of his condition and his race.",
                "popularity": 3.5475,
                "poster_path": "/5Y36lCiNyyV71mjq6LavgiggbhT.jpg",
                "release_date": "2010-02-10",
                "title": "My Name Is Khan",
                "video": false,
                "vote_average": 8.0,
                "vote_count": 1368,
                "character": "Faisal Rahman",
                "credit_id": "52fe44ebc3a368484e03e41b",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Arif Zakaria (born 11 November 1966) is an Indian actor. He has had roles in many films, beginning with his debut film Darmiyaan (1997), 1947 Earth (1998), Dance like a man (2004), and biographical projects such as Mardana and the controversial Nanak Shah Fakir.\n\nArif Zakaria's uncle Rafiq Zakaria was a veteran politician from the Indian National Congress. His brother Asif Zakaria is also an INC politician and cousin Fareed Zakaria is an American journalist. Zakaria completed his graduation from Sydenham College of Commerce and Economics.\n\nZakaria married Namrata Sharma, a Fashion Writer, in 2002. The couple divorced in 2010.\n\nZakaria began acting in theatre while in college and later moved on to work in television and films. He acted in numerous television serials like Chunauti, Karambhoomi, Mrityudand, Dhund, Aarzoo, Campus, Kaali - Ek Agnipariksha, etc. Arif acted in diverse roles in films like Darmiyaan, Hero, Asambhav and Dance Like a Man (English). Zakaria travelled the globe since 2005 with the Australian musical show Merchants of Bollywood, performing major roles in the production across Europe, China, France, Poland, Hong Kong, Singapore and Australia (the last season in Sydney in 2010).\n\nThe actor portrayed Rustom Sethna in Deepa Mehta's Earth/1947 and Major Dhillon in Shyam Benegal's Netaji Subhas Chandra Bose: The Forgotten Hero. He also appeared in Home Delivery: Aapko... Ghar Tak, Hazaaron Khwaishein Aisi, Deewaar and the Shah Rukh Khan film My Name is Khan.\n\nIn 2011, Arif played the ghost that haunts the female protagonist in Vikram Bhatt's Haunted and was appreciated for the ghastly portrayal of a piano teacher falling in love with his young student who gets murdered while making advances towards her and rapes her as a ghost, which forces her to commit suicide in the movie. He played the role of a police officer in Jism 2, starring Sunny Leone, appeared in Lootera and in Krrish 3 as Dr. Varun Shetty.\n\nOther releases of the actor are Dee Saturday Night, Darr At The Mall, Blue Mountain (all 2014) and Nanak Shah Fakir and Ishq Forever (both 2015). He is also acting in the play Gardish Mein Taare, directed by Saif Hyder Hasan, which is based on the life of Guru Dutt. In 2015, Zakaria produced a children's film \"Pinti Ka Sabun\" for the Children's Film Society of India; (CFSI) this film is directed by Pramod Pathak.\n\nIn 2017, Arif was seen in Vikram Bhatt's web series Spotlight - Web series as famous actor/director/producer Dev Bannerjee. Featured in the short film Aamad - written and directed by Neeraj Udhwani for the Terribly Tiny Tales web portal.\n\nArif Zakaria also worked in Raazi, directed by Meghna Gulzar, along with Alia Bhatt and Vicky Kaushal and the film Ahaan, directed by first-time director Nikhil Pherwani; a tender story of a young man suffering from down syndrome. He is slated to shoot for an English film Swords and Sceptres, a re-telling of the story of the Rani of Jhansi. Plays the role of Gaus Khan. Shooting commenced from October 2017 in Jaipur. At present the actor is playing the role of Gen. Bakhtiyar in a romance-thriller series Qubool Hai 2.0 that will be streamed on all ZEE5 platform.\n\nSource: Article \"Arif Zakaria\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1966-11-11",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 53375,
        "imdb_id": "nm0952232",
        "known_for_department": "Acting",
        "name": "Arif Zakaria",
        "place_of_birth": "Bombay, Maharashtra, India",
        "popularity": 0.1651,
        "profile_path": "/fQx14DwQV2Z2p25t4bogVn9A2c.jpg"
    }
}