{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/56H7AtJ5GK4UxFoHuw9QDwI7wzD.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 42297,
                "original_language": "en",
                "original_title": "Burlesque",
                "overview": "Ali leaves behind a troubled life and follows her dreams to Los Angeles, where she lands a job as a cocktail waitress at the Burlesque Lounge, a once-majestic theater that houses an inspired musical revue. Vowing to perform there, she makes the leap from bar to stage, helping restore the club's former glory.",
                "popularity": 5.4175,
                "poster_path": "/3U9zBIibERQZqYKM3N1a4MYgBsN.jpg",
                "release_date": "2010-11-23",
                "title": "Burlesque",
                "video": false,
                "vote_average": 7.207,
                "vote_count": 2306,
                "character": "Alice \"Ali\" Rose",
                "credit_id": "52fe45fac3a36847f80e571b",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/yGtoR1fi3e2xU7N91cb2DKJjtyL.jpg",
                "genre_ids": [
                    99
                ],
                "id": 39452,
                "original_language": "en",
                "original_title": "Exit Through the Gift Shop",
                "overview": "Banksy is a graffiti artist with a global reputation whose work can be seen on walls from post-hurricane New Orleans to the separation barrier on the Palestinian West Bank. Fiercely guarding his anonymity to avoid prosecution, Banksy has so far resisted all attempts to be captured on film. Exit Through the Gift Shop tells the incredible true story of how an eccentric French shop keeper turned documentary maker attempted to locate and befriend Banksy, only to have the artist turn the camera back on its owner.",
                "popularity": 0.8431,
                "poster_path": "/ruM5ehUQlHC1Kx3SF18d6klfrAx.jpg",
                "release_date": "2010-03-05",
                "title": "Exit Through the Gift Shop",
                "video": false,
                "vote_average": 7.543,
                "vote_count": 910,
                "character": "Self (uncredited)",
                "credit_id": "6791e3d38d1ddd930ab571fe",
                "order": 24
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "크리스티나 아길레라",
            "クリスティーナ・マリア・アギレラ",
            "クリスティーナ・アギレラ",
            "Xtina"
        ],
        "biography": "Christina María Aguilera, born on 18th December 1980, is an American pop singer and songwriter. Aguilera first appeared on national television in 1990 as a contestant on the Star Search program, and went on to star in Disney Channel's television series The Mickey Mouse Club from 1993–1994. Aguilera signed to RCA Records after recording \"Reflection\" for the film Mulan. In 1999, Aguilera came to prominence following her debut album Christina Aguilera, which was a commercial success spawning three number one singles on the Billboard Hot 100 \"Genie in a Bottle\", \"What a Girl Wants\" and \"Come On Over Baby (All I Want Is You)\". A Latin pop album, Mi Reflejo (2001), and several collaborations followed which garnered Aguilera worldwide success, though she was displeased with her lack of input in her music and image. After parting from her management, Aguilera took creative control over her second studio album, Stripped (2002, The album's second single, \"Beautiful\", was a commercial success and helped the album's commercial performance. Aguilera's third studio album, Back to Basics (2006), included elements of soul, jazz, and blues music, and was released to positive critical reception.  Aguilera's fourth studio album Bionic was released in June 2010. Aside from being known for her vocal ability, music videos and image, musically, she includes themes of dealing with public scrutiny, her childhood, and female empowerment in her music. Apart from her work in music, she has also dedicated much of her time as a philanthropist for charities, human rights and world issues. Aguilera's work has earned her numerous awards, including four Grammy Awards and a Latin Grammy Award, amongst fifteen and three nominations respectively. Rolling Stone ranked her number fifty-three on their list of the 100 Greatest Singers of All Time, ranking as the youngest and only artist on the list under the age of thirty. She has become one of the most successful recording artists of the decade, selling more than 42 million albums worldwide.",
        "birthday": "1980-12-18",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.christinaaguilera.com",
        "id": 53397,
        "imdb_id": "nm0004694",
        "known_for_department": "Acting",
        "name": "Christina Aguilera",
        "place_of_birth": "Staten Island, New York, USA",
        "popularity": 0.4097,
        "profile_path": "/87up4ujHKk2nx6PAqUV85WXHwac.jpg"
    }
}