{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/CAC2F6C6R8hZ3AoByDX6Jj2VOw.jpg",
                "genre_ids": [
                    18
                ],
                "id": 7979,
                "original_language": "en",
                "original_title": "The Kite Runner",
                "overview": "After spending years in California, Amir returns to his homeland in Afghanistan to help his old friend Hassan, whose son is in trouble.",
                "popularity": 2.2142,
                "poster_path": "/dom2esWWW8C9jS2v7dOhW48LwHh.jpg",
                "release_date": "2007-12-14",
                "title": "The Kite Runner",
                "video": false,
                "vote_average": 7.326,
                "vote_count": 1198,
                "character": "Soraya",
                "credit_id": "52fe448bc3a36847f809bde9",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia.\n\nAtossa Leoni is an actress who has been working internationally in film, television and theater since childhood.\n\nOf Iranian descent, Atossa was born in Berlin, Germany, raised in various countries throughout Europe and schooled in the United States. She is fluent in five languages and currently resides in Los Angeles.[1]\n\nAtossa made her American screen debut starring as Soraya, the female lead in the film adaptation of The Kite Runner. The film is based on Khaled Hosseini's best-selling novel, which remained on The New York Times best-seller list for over 124 weeks. Directed by acclaimed filmmaker Marc Forster, the film has already received praise from critics and fans alike and is proving to be a major awards contender.\n\nAtossa was seen in the critically praised America So Beautiful. The film, which also starred Academy Award nominee Shohreh Aghdashloo, followed a group of immigrants in Los Angeles during the unfolding of the 1979 Iran hostage crises. America So Beautiful was recognized at the Marrakech International Film Festival in 2002 and was in competition in the Panorama Section of the 2002 Berlin Film Festival.\n\nShe lent her voice to narrate the audiobook version of Khaled Hosseinis A Thousand Splendid Suns and Greg Mortenson's Three Cups of Tea, which are both best-selling books around the world.\n\nDescription above from the Wikipedia article Atossa Leoni, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 53481,
        "imdb_id": "nm0503033",
        "known_for_department": "Acting",
        "name": "Atossa Leoni",
        "place_of_birth": "Berlin, Germany",
        "popularity": 0.1035,
        "profile_path": "/jM6zviUAKx1Bk2Y88l6NFZ4C6B7.jpg"
    }
}