{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/CAC2F6C6R8hZ3AoByDX6Jj2VOw.jpg",
                "genre_ids": [
                    18
                ],
                "id": 7979,
                "original_language": "en",
                "original_title": "The Kite Runner",
                "overview": "After spending years in California, Amir returns to his homeland in Afghanistan to help his old friend Hassan, whose son is in trouble.",
                "popularity": 2.2142,
                "poster_path": "/dom2esWWW8C9jS2v7dOhW48LwHh.jpg",
                "release_date": "2007-12-14",
                "title": "The Kite Runner",
                "video": false,
                "vote_average": 7.326,
                "vote_count": 1198,
                "character": "Amir",
                "credit_id": "52fe448bc3a36847f809bde5",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/pbm04tWNa8MkbPqJ33yrGVXTWAl.jpg",
                "genre_ids": [
                    18,
                    36,
                    80,
                    53,
                    28
                ],
                "id": 9829,
                "original_language": "en",
                "original_title": "United 93",
                "overview": "A real-time account of the events on United Flight 93, one of the planes hijacked on 9/11 that crashed near Shanksville, Pennsylvania when passengers foiled the terrorist plot.",
                "popularity": 4.4218,
                "poster_path": "/r3mdSgsnpoi4UiUufdybhjha68t.jpg",
                "release_date": "2006-04-28",
                "title": "United 93",
                "video": false,
                "vote_average": 7.102,
                "vote_count": 1560,
                "character": "Ziad Jarrah",
                "credit_id": "52fe4536c3a36847f80c255b",
                "order": 40
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Khalid Abdalla (born 1980) is a British-Egyptian actor. He came to international prominence after starring in the 2006 Academy Award-nominated and BAFTA-winning film, United 93. Written and directed by Paul Greengrass, it chronicles events aboard United Airlines Flight 93, which was hijacked as part of the September 11 attacks. Abdalla played Ziad Jarrah, the pilot and leader of the four hijackers on board the flight. He starred as Amir in the film of The Kite Runner and acted with Matt Damon in Green Zone, his second film with director Paul Greengrass\n\nAbdalla is on the board of the National Student Drama Festival. In 2011, he became one of the founding members of the Mosireen (\"We Insist\") Collective in Cairo: a group of revolutionary filmmakers and activists dedicated to supporting citizen media across Egypt in the wake of Hosni Mubarak's fall.  Three months after it began, Mosireen became the most watched non-profit YouTube channel in Egypt of all time, and in the whole world in January 2012.  Abdalla was educated at King's College School, an independent school for boys in Wimbledon in south-west London and his classmates included actor Ben Barnes and comedian Tom Basden. He became interested in acting after becoming involved in his school's thriving drama scene. In 1998, he directed a production of Someone Who'll Watch Over Me by Frank McGuinness, which ended up having a successful run at the Edinburgh Festival and earned five stars in The Scotsman newspaper, making him the youngest director to receive this accolade.",
        "birthday": "1981-10-26",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.visible-justice.org/biographies",
        "id": 53480,
        "imdb_id": "nm2043234",
        "known_for_department": "Acting",
        "name": "Khalid Abdalla",
        "place_of_birth": "Glasgow, Scotland, UK",
        "popularity": 0.3327,
        "profile_path": "/iYRhheaol1T19Qy8a8pTIPk9COK.jpg"
    }
}