{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1GZVHgJUcVyytQRJ533GpMavAcL.jpg",
                "genre_ids": [
                    18
                ],
                "id": 7984,
                "original_language": "en",
                "original_title": "In the Name of the Father",
                "overview": "A small-time Belfast thief, Gerry Conlon, is wrongly convicted of an IRA bombing in London, along with his father and friends, and spends 15 years in prison fighting to prove his innocence.",
                "popularity": 2.6913,
                "poster_path": "/3NcIkKxaO2SmRVsG1v50XhtmL0f.jpg",
                "release_date": "1993-12-12",
                "title": "In the Name of the Father",
                "video": false,
                "vote_average": 7.896,
                "vote_count": 1845,
                "character": "Carole Richardson",
                "credit_id": "52fe448bc3a36847f809c0c5",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/2EfbAWLq8s2f1LxTAIuLGYpKETV.jpg",
                "genre_ids": [
                    12,
                    28,
                    14
                ],
                "id": 8009,
                "original_language": "en",
                "original_title": "Highlander",
                "overview": "He fought his first battle on the Scottish Highlands in 1536. He will fight his greatest battle on the streets of New York City in 1986. His name is Connor MacLeod. He is immortal.",
                "popularity": 6.6347,
                "poster_path": "/8Z8dptJEypuLoOQro1WugD855YE.jpg",
                "release_date": "1986-03-07",
                "title": "Highlander",
                "video": false,
                "vote_average": 6.873,
                "vote_count": 2743,
                "character": "Heather MacLeod",
                "credit_id": "52fe448dc3a36847f809c59f",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Beatrice Edney",
            "Beattie Edney"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nBeatrice \"Beatie\" Edney (born 23 October 1962) is an English television actress.\n\nBorn in London, she is the daughter of actress Sylvia Syms, and sister of Benjamin Edney and a cousin of musician Nick Webb. Edney first came to audiences' attention as Heather MacLeod in the 1986 film Highlander, the first film in the Highlander series. She returned to the role again in the 2000 film Highlander: Endgame. In 1987 Edney performed the title role in the TV production of 'The Dark Angel' with Peter O'Toole. In 1990, she appeared in the Bruce Beresford directed film Mister Johnson alongside Pierce Brosnan and Edward Woodward.\n\nHer many television appearances include a leading role in the TV series Lost Empires, based on the novel by J.B. Priestley, with Colin Firth in 1986. She has also appeared in episodes of Rosemary & Thyme, A Touch of Frost, Prime Suspect, Inspector Morse, Lewis (TV series), Agatha Christie's Poirot adaptation of The Mysterious Affair at Styles and Wallander (2009). In 1994, she played the role of Louisa Gradgrind in the television adaptation of Charles Dickens' novel Hard Times. In 1995, she had a starring role in the Channel 4 sitcom Dressing For Breakfast. In 2012 she played Queen Charlotte in The Madness of King George III, in a revival at the Apollo Theatre.",
        "birthday": "1962-10-23",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 53515,
        "imdb_id": "nm0249622",
        "known_for_department": "Acting",
        "name": "Beatie Edney",
        "place_of_birth": "London, England, UK",
        "popularity": 0.426,
        "profile_path": "/9J6ZfBnUPcP0msnyiNc14SKOhrt.jpg"
    }
}