{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xQRh7hSPdtEE0aUmuY8EdifrXPK.jpg",
                "genre_ids": [
                    10402,
                    18
                ],
                "id": 12545,
                "original_language": "en",
                "original_title": "Jesus Christ Superstar",
                "overview": "As played out by a theatre troupe, the last days of Jesus Christ are depicted from the perspective of Judas Iscariot, his betrayer. As Jesus' following increases, Judas begins to worry that Jesus is falling for his own hype, forgetting the principles of his teachings and growing too close to the prostitute Mary Magdalene.",
                "popularity": 3.2474,
                "poster_path": "/p5LGgKCVGGVZKTkwKzpBDIesydj.jpg",
                "release_date": "1973-08-15",
                "title": "Jesus Christ Superstar",
                "video": false,
                "vote_average": 7.091,
                "vote_count": 580,
                "character": "Peter",
                "credit_id": "52fe44f89251416c75047437",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": true,
        "also_known_as": [
            "Philip Charles Toubus",
            "Judy Blue",
            "Cloe Edwards",
            "Phillips Tobis",
            "Paul Tonas",
            "Grady Sutton",
            "Phil Toubes",
            "Phil Tobus",
            "Paul Tanner",
            "Paul Thobias",
            "Roger Michaels",
            "Cleo Edwards",
            "Bo Edwards",
            "Richard Robinson",
            "Phil Toubus",
            "Russell Ellison",
            "Phil Tobias",
            "Phil Thomas",
            "Philip Toubus",
            "Philip Tobias",
            "Nancy Blue",
            "Chuck Lords"
        ],
        "biography": "Philip Toubus (born April 17, 1947 - June 9, 2025), better known as Paul Thomas, was an American pornographic actor and director.\n\nPhilip Toubus was born in Winnetka, Illinois, to a wealthy family. He was the nephew of Sara Lee Lubin, of the \"Sara Lee\" foods company. He attended the University of Wisconsin–Madison but turned to acting. He acted in Broadway theatre, playing a starring role in Hair. He also played Peter in the 1973 film version of Jesus Christ Superstar. Toubus signed with the William Morris Agency and went to Hollywood, where he appeared in several in television shows.\n\nToubus started working in pornography in 1974. He met the porn producers the Mitchell Brothers while playing in a musical in San Francisco. He performed in several porn \"loops\" for them and, in 1976, appeared in his first porn feature, The Autobiography of a Flea. Toubus performed mostly using the stage name Paul Thomas, but he has also appeared under several other names.\n\nIn 1982 Toubus was arrested for smuggling cocaine into the United States from South America. He served one year in jail. Following his release from prison, Toubus resumed his career and, in 1983, won the Adult Film Association of America Award for Best Actor in Virginia. He also played a starring role in the 1985 film series 'Taboo American Style'. Toubus started directing porn films in 1985, and has directed for Vivid Entertainment since 1986. He married porn actress and director Anita Rinaldi in 2001, after he divorced his longtime second wife.\n\nAs of 2007 Toubus - as Paul Thomas - has acted in over 500 films and directed nearly 300 films, winning seven Adult Video News Awards and two X-Rated Critics Organization Awards for best director. He was inducted into the X-Rated Critics Organization Hall of Fame in 1986. In 2006 he was inducted into the Legends of Erotica Hall of Fame. He was also a member of the Adult Video News Hall of Fame.",
        "birthday": "1947-04-17",
        "deathday": "2025-06-09",
        "gender": 2,
        "homepage": null,
        "id": 53568,
        "imdb_id": "nm0249892",
        "known_for_department": "Acting",
        "name": "Paul Thomas",
        "place_of_birth": "Winnetka, Illinois, USA",
        "popularity": 3.226,
        "profile_path": "/1GrKUcorxN0NAONsFMCznEhc9um.jpg"
    }
}