{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2EfbAWLq8s2f1LxTAIuLGYpKETV.jpg",
                "genre_ids": [
                    12,
                    28,
                    14
                ],
                "id": 8009,
                "original_language": "en",
                "original_title": "Highlander",
                "overview": "He fought his first battle on the Scottish Highlands in 1536. He will fight his greatest battle on the streets of New York City in 1986. His name is Connor MacLeod. He is immortal.",
                "popularity": 6.3538,
                "poster_path": "/8Z8dptJEypuLoOQro1WugD855YE.jpg",
                "release_date": "1986-03-07",
                "title": "Highlander",
                "video": false,
                "vote_average": 6.872,
                "vote_count": 2745,
                "character": "Rachel Ellenstein",
                "credit_id": "52fe448dc3a36847f809c5ab",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Sheila Anne Syme Gash"
        ],
        "biography": "Sheila Gish (23 April 1942 – 9 March 2005) was a British stage and television actress. She was born Sheila Anne Gash in Lincoln, studied at the Royal Academy of Dramatic Art, and made her stage debut with a repertory company. Her first starring role in the West End was as Bella in Robert and Elizabeth. She continued to be best known for her stage work, but she also appeared in many television dramas, from The First Churchills (in which she played Mary of Modena) to the successful adaptation of Love in a Cold Climate (2001) in which she played the eccentric and outrageous Lady Montdore. She had two daughters: the actresses Kay Curram and Lou Gish (1967–2006) by her first husband, the actor Roland Curram. While filming That Uncertain Feeling for BBC2 in 1985, she met actor Denis Lawson, who was to become her second husband. She rarely appeared on film, her most notable performances being as Anna in the Merchant-Ivory film Quartet (1981) and as Mrs Norris in Jane Austen's Mansfield Park (1999). She is also known for her appearance in the 1986 film Highlander as Rachel Ellenstein. She took the part of the alcoholic Joanne in Stephen Sondheim's musical Company, directed by Sam Mendes at the Donmar Warehouse and in the West End, in 1995. The following year, she won the Olivier Award for Best Performance in a Supporting Role in a Musical. In 1999 she played Miss Venable in Tennessee Williams's Suddenly Last Summer, directed by Sean Mathias with Rachel Weisz at the Comedy Theatre, London. One of her last stage roles was as Arkadina in the Chichester Festival Theatre's production of The Seagull in 2003. By this time she had been diagnosed with cancer and had lost an eye as a result of surgery. She died in Camden, London. Her final performance was for BBC Radio. She is Ewan McGregor's mother's sister-in-law. Her daughter, Lou, also died of cancer less than a year after her mother.",
        "birthday": "1942-04-23",
        "deathday": "2005-03-09",
        "gender": 1,
        "homepage": null,
        "id": 53585,
        "imdb_id": "nm0321096",
        "known_for_department": "Acting",
        "name": "Sheila Gish",
        "place_of_birth": "Lincoln, England, United Kingdom",
        "popularity": 0.3557,
        "profile_path": "/Wgmks9bPcPEwZfZ8PgOdb7VGFQ.jpg"
    }
}