{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fuKt9vmyN8cpZvPflfW9YGrFTuQ.jpg",
                "genre_ids": [
                    27,
                    35
                ],
                "id": 10776,
                "original_language": "en",
                "original_title": "Little Shop of Horrors",
                "overview": "Seymour Krelborn is a nerdy orphan working at Mushnik's; a flower shop in urban Skid Row. He harbors a crush on fellow co-worker, Audrey Fulquard, and is berated by Mr. Mushnik daily. One day, Seymour finds a very mysterious unidentified plant which he calls Audrey II. The plant seems to have a craving for blood and soon begins to sing for his supper.",
                "popularity": 2.2423,
                "poster_path": "/iKkbN17OmFosaW6asCNZTTsyvpu.jpg",
                "release_date": "1986-12-19",
                "title": "Little Shop of Horrors",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 1526,
                "character": "Network Exec #1",
                "credit_id": "662563d12588230164910099",
                "order": 39
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Bob Arden",
            "Rob Arden"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nRobert Arden (11 December 1922 – 25 March 2004) was an American film, television and radio actor born in London who worked and lived mostly in the United Kingdom.\n\nArden was born from an American father and an English mother. His father had a successful career as a professional boxer after World War I. He attended \"a combination of English and American schools.\"\n\nArden's most famous film appearance was as lead character Guy Van Stratten in Mr. Arkadin (1955), written and directed by Orson Welles. Welles had worked with Arden on the Harry Lime radio series, produced in London, and later cast the little-known actor in Mr. Arkadin, in the central role of the investigator who uncovers Arkadin's past. Reportedly, Arden was shocked that Welles might consider him for the part and initially thought that the director's phone inquiry was a crank call.\n\nArden's performance in Mr. Arkadin was panned by some critics : The New York Times called it \"hopelessly inadequate\". Film historian Jonathan Rosenbaum has defended Arden's performance, locating the problem not in the actor's work but in \"the unsavoriness and obnoxiousness of the character\", who was intended by Welles to be unattractive even though he occupied in the film \"the space normally reserved for charismatic heroes\".\n\nThe credits of one the film's Spanish versions misspelled Arden's name as \"Bob Harden\". Another Spanish print actually credited him as \"Mark Sharpe\".\n\nMr. Arkadin did poorly at the box-office. Afterwards, Arden played a few other lead roles, in films such as The Depraved (1957) or The Child and the Killer (1959), but he worked mostly as a character actor, appearing in film, television and stage productions. he worked mostly as a character actor, appearing in film, television and stage productions.",
        "birthday": "1922-12-11",
        "deathday": "2004-03-25",
        "gender": 2,
        "homepage": null,
        "id": 535977,
        "imdb_id": "nm0034013",
        "known_for_department": "Acting",
        "name": "Robert Arden",
        "place_of_birth": "London, England, UK",
        "popularity": 0.8459,
        "profile_path": "/vkiaBZKO6Bnvr6wHC1U55ox0Hi4.jpg"
    }
}