{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/nDEO6ZlXYvBZpX7Wxq1eIJz5ri4.jpg",
                "genre_ids": [
                    35,
                    18,
                    36
                ],
                "id": 522,
                "original_language": "en",
                "original_title": "Ed Wood",
                "overview": "The mostly true story of the legendary \"worst director of all time\", who, with the help of his strange friends, filmed countless B-movies without ever becoming famous or successful.",
                "popularity": 4.0805,
                "poster_path": "/2jjFN4BtTSz01J3ZD4iYjf26pWX.jpg",
                "release_date": "1994-09-28",
                "title": "Ed Wood",
                "video": false,
                "vote_average": 7.49,
                "vote_count": 2409,
                "character": "TV Show Host",
                "credit_id": "5616fb539251412ae900067e",
                "order": 35
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Robert Michael Slayton is an American actor and stand-up comedian. He is probably best known for a supporting role in the 2001 film Bandits, and as a frequent guest on The Adam Carolla Show.\n\nSlayton, often referred to as “The Pitbull of Comedy,” has been performing his own intense style of comedy for well over 30 years, becoming one of the best known, respected, and energetic comics working today.\n\nHe had scene-stealing roles in the movies Get Shorty, Ed Wood, Dreamgirls, and Bandits. He’s been seen on dozens of television shows, including The Tonight Show, Politically Incorrect, Home Improvement, and in Woody Allen's Amazon TV project, Crisis in Six Scenes.\n\nHis many appearances on HBO have included “Comic Relief” and his own Showtime special, \"Born to be Bobby\". He was a series regular on the HBO series Mind of a Married Man, and played Joey Bishop opposite Ray Liotta and Joe Mantegna in the critically acclaimed film “The Rat Pack”\n\nHis distinctive gravelly voice has often been heard on animated shows, including Dr. Katz and Family Guy, as well as many popular radio shows across the country including Howard Stern and regular appearances on SiriusXM.",
        "birthday": "1955-05-25",
        "deathday": null,
        "gender": 2,
        "homepage": "https://bobbyslayton.com/",
        "id": 53601,
        "imdb_id": "nm0805653",
        "known_for_department": "Acting",
        "name": "Bobby Slayton",
        "place_of_birth": "Scarsdale, New York, USA",
        "popularity": 0.0668,
        "profile_path": "/crfs2HQBAteBC4xUSY6NrlMCx7.jpg"
    }
}