{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/aDi4GqSYi4pcTvS7A9AuXLuhUVQ.jpg",
                "genre_ids": [
                    35,
                    80
                ],
                "id": 25866,
                "original_language": "fr",
                "original_title": "Le Corniaud",
                "overview": "In this Franco-Italian gangster parody, a shopkeeper on his way to an Italian holiday suffers a crash that totals his car. The culprit can only compensate his ruined trip by driving an American friend's car from Naples to Bordeaux, but as it happens to be filled with such contraband as stolen money, jewelry and drugs, the involuntary and unwitting companions in crime soon attract all but recreational attention from the \"milieu\".",
                "popularity": 2.5445,
                "poster_path": "/kGFE3U01sMApp5Q7h0akEvdTwPK.jpg",
                "release_date": "1965-03-24",
                "title": "The Sucker",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 674,
                "character": "Lino, barber",
                "credit_id": "52fe44e0c3a368484e03c0c7",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/sU3gFo7Gn67zjtKXIvzJ4omcUbH.jpg",
                "genre_ids": [
                    36,
                    18,
                    12
                ],
                "id": 665,
                "original_language": "en",
                "original_title": "Ben-Hur",
                "overview": "In 25 AD, Judah Ben-Hur, a Jew in ancient Judea, opposes the occupying Roman empire.  Falsely accused by a Roman childhood friend-turned-overlord of trying to kill the Roman governor, he is put into slavery and his mother and sister are taken away as prisoners.",
                "popularity": 5.7433,
                "poster_path": "/m4WQ1dBIrEIHZNCoAjdpxwSKWyH.jpg",
                "release_date": "1959-11-18",
                "title": "Ben-Hur",
                "video": false,
                "vote_average": 7.886,
                "vote_count": 2943,
                "character": "Jewish Slave in the Desert (uncredited)",
                "credit_id": "5605e4fb9251413060000308",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Gerlando Buzzanca"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nGerlando Buzzanca (born August 24, 1935 in Palermo) is an Italian comedy actor.\n\nHe left high school in Palermo when he was 16 years old, and moved to Rome to pursue his dream of becoming an actor. In order to survive, he took many jobs: waiter, furniture mover, and a brief appearance as a slave in the film Ben-Hur.\n\nIn his long career he often interpreted the role of the average Italian immigrant from southern Italy, who slowly began to enjoy moderate success during the years of the Italian economic miracle. His films showcased all the freshness of the 1960s, the 1970s and the heavier transition to the 1980s, focusing on the common life in several Italian cities such as Rome, Verona or Milan, balanced between personal happiness and professional achievement.\n\nBuzzanca often interpreted roles of a subordinate white collar worker, with a heavy vein of machismo, as a frustrated employee who tries to redeem his dull existence with his virility. He became famous for his role in the film Il merlo maschio, (The Male Blackbird), where in a provincial environment of cultural importance, the philharmonic orchestra of the Arena di Verona, he vents out his own frustrations, indulging into candaulism when he induces his bride to expose her naked body in the middle of a bridge in Verona.\n\nSome critics, in a lighter vein, have defined Buzzanca as a \"Homo eroticus\": a human being halfway between Homo erectus and Homo sapiens, who risked extinction in the 1970s because of the harsh struggle with feminism activists. Today, even though much less so, this male type is still found among Italian males.\n\nBuzzanca's fame is greater in foreign countries than in his native land, and in countries as France, Japan, Greece, Israel, Spain and Switzerland he is a renowned international stereotype of the Italian provincialotto, elegant, naif, always causing mischief, and not obtaining anything from it.\n\nDescription above from the Wikipedia article Lando Buzzanca, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1935-08-24",
        "deathday": "2022-12-18",
        "gender": 2,
        "homepage": null,
        "id": 53660,
        "imdb_id": "nm0125627",
        "known_for_department": "Acting",
        "name": "Lando Buzzanca",
        "place_of_birth": "Palermo, Sicily, Italy",
        "popularity": 1.1627,
        "profile_path": "/pVfDFDQGYtlFNifGEMW16pQktFu.jpg"
    }
}