{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/96WHK0TiIslmM8rGVIejMtMtaPG.jpg",
                "genre_ids": [
                    12,
                    28,
                    53,
                    878
                ],
                "id": 604,
                "original_language": "en",
                "original_title": "The Matrix Reloaded",
                "overview": "The Resistance builds in numbers as humans are freed from the Matrix and brought to the city of Zion. Neo discovers his superpowers, including the ability to see the code inside the Matrix. With machine sentinels digging to Zion in 72 hours, Neo, Morpheus and Trinity must find the Keymaker to ultimately reach the Source.",
                "popularity": 9.6725,
                "poster_path": "/9TGHDvWrqKBzwDxDodHYXEmOE6J.jpg",
                "release_date": "2003-05-15",
                "title": "The Matrix Reloaded",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 11450,
                "character": "Councillor West",
                "credit_id": "52fe425cc3a36847f80183b3",
                "order": 60
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Cornel Ronald West is an American philosopher, author, critic, actor, civil rights activist and prominent member of the Democratic Socialists of America. West is the Class of 1943 University Professor at Princeton University, where he teaches in the Center for African American Studies and in the Department of Religion. West is known for his combination of political and moral insight and criticism and his contribution to the post-1960s civil rights movement. The bulk of his work focuses on the role of race, gender, and class in American society and the means by which people act and react to their \"radical conditionedness\". West draws intellectual contributions from such diverse traditions as the African American Baptist Church, pragmatism and transcendentalism.",
        "birthday": "1953-06-02",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.cornelwest.com/",
        "id": 537506,
        "imdb_id": "nm0922002",
        "known_for_department": "Acting",
        "name": "Cornel West",
        "place_of_birth": "Tulsa, Oklahoma, USA",
        "popularity": 0.1722,
        "profile_path": "/eyLtTHcC3InxVPTyRus1pNfa0pK.jpg"
    }
}