{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ugDZGeweSN9EH8XrLaBHLm5AxuA.jpg",
                "genre_ids": [
                    18,
                    27
                ],
                "id": 6404,
                "original_language": "de",
                "original_title": "Nosferatu - Phantom der Nacht",
                "overview": "A real estate agent leaves behind his beautiful wife to go to Transylvania to visit the mysterious Count Dracula and formalize the purchase of a property in Wismar.",
                "popularity": 3.3834,
                "poster_path": "/jHKzGYwf7P34vz8MhJBTN6cnaYD.jpg",
                "release_date": "1979-01-17",
                "title": "Nosferatu the Vampyre",
                "video": false,
                "vote_average": 7.281,
                "vote_count": 1015,
                "character": "Captain",
                "credit_id": "52fe4450c3a36847f808ec43",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Dufilho"
        ],
        "biography": "Jacques Dufilho is a French comedian, born February 19, 1914 in Bègles (Gironde, France) and died August 28, 2005 in Ponsampère (Gers, France).\n\nOriginally from the south-west of France, Jacques Jacques-Gabriel Dufilho studied agriculture then went to Paris to live his passion for painting and sculpture. It was there that he met Charles Dullin, a great man from the theater world who passed on his passion for the stage to him and made his cabaret-theatre debut in 1951 with Agnès Capri. Jacques Dufilho then begins by playing sketches before turning to the big screen. In 1939, he participated in Marc Allégret's project in the film \"Le Corsaire\" but the film remained unfinished. Jacques Dufilho is not worried about it as two years later, he plays the role of a lumberjack in André Zwobada's feature film \"Croisières Sidérales\".\n\nSubsequently, the actor chained the roles in the cinema but it was in 1949 that he was noticed by the general public in \"La Ferme des Sept Péchés\" by Jean-Devaivre. Jacques Dufilho also went to the theater and went on stage for the first time in Dostoyevsky's play, \"The Brothers Karamazov\" directed by André Barsacq. When the Second World War broke out, Jacques Dufilho was part of the 2nd Hussard Regiment, particularly in the 29th infantry division reconnaissance group as he received the Legion of Honor in 1998. In 1953, he played in the play by Molière \"The Doctor Despite Him\" under the direction of Jean-Pierre Darras. The following year, he returned with André Barsacq to the Théâtre de l'Atelier in \"Colombe\" by Jean Anouilh. He still plays in the cinema as in \"Marie-Antoinette, Reine De France\" by Jean Delannoy in 1956. Same year, same director, he plays in \"Notre-Dame De Paris\".\n\nIn 1961 and 1962, Jacques Dufilho returned to the stage with André Barsacq in \"Les Maxibules\" by Marcel Aymé and \"L'Avare\" by Molière. The actor made an impression in \"The Guardian\", adapted from the English play \"The Caretaker\" by Harold Pinter. The year 1978 marks a new turning point in the career of Jacques Dufilho, with the film \"Le Crabe-Tambour\" by Pierre Schoendoerffer, thanks to his interpretation of the role of the chief mechanic in the film, he will be rewarded with a César in the Best Supporting Actor category. In 1980, he played Adrien Dussart in \"A bad son\" by Claude Sautet, which earned him a second César award, still in the same category. At the theater, in 1988 the actor was awarded the Molière du Comédien for his role in Herb Gardner's play \"Je Ne Suis Pas Rappaport\" directed by Georges Wilson. Over the years, Jacques Dufilho will play under the direction of Louis Malle, Claude Chabrol, André Hunebelle, Yves Robert and many others. In 1999, he played in \"C'est Quoi La Vie?\" by François Dupeyron, which earned him a new nomination for the Césars. On television, he received the Seven d'Or for best actor after his role in the film \"Une Femme Innocente\". In 2003 he released his autobiography \"Les Sirènes Du Bateau-Loup\" published by Fayard.\n\nThe actor died on August 28, 2005 in Ponsampère at the age of 91 after playing his last role in \"Up There, A King Above The Clouds\" by Pierre Schoendoerffer.",
        "birthday": "1914-02-19",
        "deathday": "2005-08-28",
        "gender": 2,
        "homepage": "https://mubi.com/fr/cast/jacques-dufilho",
        "id": 538228,
        "imdb_id": "nm0240638",
        "known_for_department": "Acting",
        "name": "Jacques Dufilho",
        "place_of_birth": "Bègles, Gironde, France",
        "popularity": 0.2347,
        "profile_path": "/7CK8OE5ww4AOdH61M1jVMZeimjE.jpg"
    }
}