{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/85k0kaoRgGmF6ACq0M61AFxhjLN.jpg",
                "genre_ids": [
                    35,
                    80
                ],
                "id": 12153,
                "original_language": "en",
                "original_title": "White Chicks",
                "overview": "Two FBI agent brothers, Marcus and Kevin Copeland, accidentally foil a drug bust. To avoid being fired they accept a mission escorting a pair of socialites to the Hamptons--but when the girls are disfigured in a car accident, they refuse to go. Left without options, Marcus and Kevin decide to pose as the sisters, transforming themselves from black men into rich white women.",
                "popularity": 12.9649,
                "poster_path": "/aHTUpo45qy9QYIOnVITGGqLoVcA.jpg",
                "release_date": "2004-06-23",
                "title": "White Chicks",
                "video": false,
                "vote_average": 6.933,
                "vote_count": 4254,
                "character": "Lisa",
                "credit_id": "52fe44c09251416c7503fa59",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/ct2r3CqnA0KtMfib4AvfBU1W9M2.jpg",
                "genre_ids": [
                    28,
                    80,
                    53
                ],
                "id": 398175,
                "original_language": "en",
                "original_title": "Brawl in Cell Block 99",
                "overview": "After working as a drug courier and getting into a brutal shootout with police, a former boxer finds himself at the mercy of his enemies as they force him to instigate violent acts that turn the prison he resides in into a battleground.",
                "popularity": 2.839,
                "poster_path": "/bfB1J6jsjdGWKjXxKQ5hNd1OyAs.jpg",
                "release_date": "2017-09-23",
                "title": "Brawl in Cell Block 99",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 1487,
                "character": "Lauren Thomas",
                "credit_id": "57e2c87bc3a3685e0c000c1b",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/vw3zNfzvnVNF7nIjpiEgcdznfeC.jpg",
                "genre_ids": [
                    16,
                    28,
                    14
                ],
                "id": 664767,
                "original_language": "en",
                "original_title": "Mortal Kombat Legends: Scorpion's Revenge",
                "overview": "After the vicious slaughter of his family by stone-cold mercenary Sub-Zero, Hanzo Hasashi is exiled to the torturous Netherrealm. There, in exchange for his servitude to the sinister Quan Chi, he’s given a chance to avenge his family – and is resurrected as Scorpion, a lost soul bent on revenge. Back on Earthrealm, Lord Raiden gathers a team of elite warriors – Shaolin monk Liu Kang, Special Forces officer Sonya Blade and action star Johnny Cage – an unlikely band of heroes with one chance to save humanity. To do this, they must defeat Shang Tsung’s horde of Outworld gladiators and reign over the Mortal Kombat tournament.",
                "popularity": 3.951,
                "poster_path": "/iBvo3qOPcmhlqAaJcXcQHtx2qLk.jpg",
                "release_date": "2020-04-12",
                "title": "Mortal Kombat Legends: Scorpion's Revenge",
                "video": false,
                "vote_average": 8.1,
                "vote_count": 1419,
                "character": "Sonya Blade (voice)",
                "credit_id": "5e2283081bf2660012f75e82",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            " Jennifer Leann Carpenter ",
            "Τζένιφερ Κάρπεντερ",
            "珍妮佛·卡本特",
            "جنیفر کارپنتر",
            "جنیفر کارپینتر",
            "Jolanta Samochóddługopister"
        ],
        "biography": "Jennifer Carpenter (born December 7, 1979) is an American actress. She garnered wide attention for her role as the titular character in the supernatural horror film The Exorcism of Emily Rose (2005), which established her as a scream queen. She rose to prominence for playing Debra Morgan in the crime drama series Dexter (2006–2013), which she reprised in the miniseries Dexter: New Blood (2021–2022). Her accolades include a MTV Movie Award and a Saturn Award, in addition to nominations for a Critics' Choice Television Award and four Screen Actors Guild Awards.\n\nCarpenter's television roles beyond Dexter include Rebecca Harris in the comedy drama series Limitless (2015–2016) and Erica Shephard in the drama series The Enemy Within (2019). Her film roles include Angela Vidal in the found footage horror film Quarantine (2008) and Sonya Blade in the direct-to-video Mortal Kombat films Scorpion's Revenge (2020) and Battle of the Realms (2021).\n\nCarpenter was born in Louisville, Kentucky, the daughter of Catherine (née Mitchell) and Robert Carpenter. She attended St. Raphael the Archangel and then Sacred Heart Academy. She trained at the Walden Theatre Conservatory program, and later at New York City's Juilliard School (Drama Division Group 31: 1998–2002).\n\nBefore graduation, she was cast in the 2002 Broadway revival of Arthur Miller's The Crucible starring Liam Neeson and Laura Linney.",
        "birthday": "1979-12-07",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 53828,
        "imdb_id": "nm1358539",
        "known_for_department": "Acting",
        "name": "Jennifer Carpenter",
        "place_of_birth": "Louisville, Kentucky, USA",
        "popularity": 3.0013,
        "profile_path": "/haxhKRJoWl71dAUWMLlDIaSd5bN.jpg"
    }
}