{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tVoWbAAfTDIhTeo78SbA2V6mv8E.jpg",
                "genre_ids": [
                    35,
                    10751
                ],
                "id": 14306,
                "original_language": "en",
                "original_title": "Marley & Me",
                "overview": "A newly married couple, in the process of starting a family, learn many of life's important lessons from their trouble-loving retriever, Marley. Packed with plenty of laughs to lighten the load, the film explores the highs and lows of marriage, maturity and confronting one's own mortality, as seen through the lens of family life with a dog.",
                "popularity": 5.1733,
                "poster_path": "/pnB6hjTKylb0Ve2nUWt16gzkErr.jpg",
                "release_date": "2008-12-25",
                "title": "Marley & Me",
                "video": false,
                "vote_average": 7.192,
                "vote_count": 4670,
                "character": "Lori",
                "credit_id": "52fe45e59251416c75066159",
                "order": 19
            },
            {
                "adult": false,
                "backdrop_path": "/oQHF0Y4gCw6VdPmapjsbZoxY2ht.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 359940,
                "original_language": "en",
                "original_title": "Three Billboards Outside Ebbing, Missouri",
                "overview": "After seven months have passed without a culprit in her daughter's murder case, Mildred Hayes makes a bold move, painting three signs leading into her town with a controversial message directed at Bill Willoughby, the town's revered chief of police. When his second-in-command Officer Jason Dixon, an immature mother's boy with a penchant for violence, gets involved, the battle between Mildred and Ebbing's law enforcement is only exacerbated.",
                "popularity": 4.7557,
                "poster_path": "/uGMM9ZObmPUFrGqcbFMVyv8L1lU.jpg",
                "release_date": "2017-12-01",
                "title": "Three Billboards Outside Ebbing, Missouri",
                "video": false,
                "vote_average": 8.063,
                "vote_count": 10473,
                "character": "Mrs. Dixon",
                "credit_id": "581e50ce9251410a1600f419",
                "order": 15
            },
            {
                "adult": false,
                "backdrop_path": "/kJQS6jxxtNTaWI8jw7ynck97rgl.jpg",
                "genre_ids": [
                    28,
                    53
                ],
                "id": 1637,
                "original_language": "en",
                "original_title": "Speed",
                "overview": "Jack Traven, an LAPD cop on SWAT detail, and veteran SWAT officer Harry Temple thwart an extortionist-bomber's scheme for a $3 million ransom. As they corner the bomber, he flees and detonates a bomb vest, seemingly killing himself. Weeks later, Jack witnesses a mass transit city bus explode and nearby a pay phone rings. On the phone is that same bomber looking for vengeance and the money he's owed. He gives a personal challenge to Jack: a bomb is rigged on another city bus - if it slows down below 50 mph, it will explode - bad enough any day, but a nightmare in LA traffic. And that's just the beginning...",
                "popularity": 8.2683,
                "poster_path": "/o1Zs7VaS9y2GYH9CLeWxaVLWd3x.jpg",
                "release_date": "1994-06-09",
                "title": "Speed",
                "video": false,
                "vote_average": 7.144,
                "vote_count": 6487,
                "character": "Bartender",
                "credit_id": "59989a94c3a3680ce10164d9",
                "order": 39
            },
            {
                "adult": false,
                "backdrop_path": "/620hnMVLu6RSZW6a5rwO8gqpt0t.jpg",
                "genre_ids": [
                    16,
                    35,
                    14,
                    12,
                    10751
                ],
                "id": 508943,
                "original_language": "en",
                "original_title": "Luca",
                "overview": "Luca and his best friend Alberto experience an unforgettable summer on the Italian Riviera. But all the fun is threatened by a deeply-held secret: they are sea monsters from another world just below the water’s surface.",
                "popularity": 9.2167,
                "poster_path": "/9x4i9uKGXt8IiiIF5Ey0DIoY738.jpg",
                "release_date": "2021-06-17",
                "title": "Luca",
                "video": false,
                "vote_average": 7.795,
                "vote_count": 8666,
                "character": "Grandma Paguro (voice)",
                "credit_id": "60b800f6c8a5ac0059e93b32",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "샌디 마틴"
        ],
        "biography": "Sandy Martin began her acting career at the age of 15 touring the country with Martha Raye in Good-bye Charley. After several East Coast touring productions she settled in New York City. Martin began working in many of New York City's esteemed theatres: Lincoln Center, La Mama, Ensemble Studio Theatre, Playwrights Horizon, The American Place Theatre acting in over 70 stage productions.\n\nAfter their enormous hit with the stage play, Hothouse by Megan Terry, Sandy wrote the screen adaptation which she packaged with her good friends, Amy Madigan and Ed Harris, both whom she acted with in the award winning world premiere of, Prairie Avenue by Edward Allen Baker, both in New York City. (at Est.) & Los Angeles's Callboard Theatre.\n\nEsparza/Katz Prod. quickly acquired Hothouse, and thus began a long working relationship with Moctesume Esparza and Robert Katz that lasted over ten years. Starting as a Development Executive, Sandy worked her way up to being the Associate Producer of the company, working on the critically acclaimed feature films: Milagro Bean Field Wars and Selena. She was also Associate Producer of Gettysburg for Turner and Bowl Of Beings starring the famed comedy troupe, Culture Clash for Great Performances on PBS.\n\nDuring her tenure with Esparza/Katz Prod., Martin wrote several treatments and screenplays; Underdogs, which was optioned by Avnet/Kerner (Risky Business, Fried Green Tomatoes), Thirteenth Duke, commissioned by Marchelo Danon (Producer of the original, La Cage aux Folles), The James Dean Story (Mini-series - Marvin Worth Prod.), she also co-wrote a musical revival of Reefer Madness with Dan Gerrity - directed by the late, great Ron Link. Martin penned Ms. Prez a screenplay that she co-authored with Patrick O'Neal about the first African American Woman President.\n\nMartin produced and directed two documentaries. The Great Meddler about the founding of the American Society for the Protection Of Cruelty To Animals) and The United Farm Workers - A Tribute to Caesar Chavez. The short, Lovely Rita, stars her friend, Cch Pounder - (The Shield) Martin was also President of Edward James Olmos's production company, Olmos Prod. at ABC for four years in early 2000.\n\nThrilled to go back to acting, Martin was very happy to score a recurring role on HBO's drama, Big Love as the creepy he/she Selma Green, as well as the comedy, It's Always Sunny in Philadelphia, as Mac's Mom. Sandy has guest starred on numerous hit shows: CSI, Nip Tuck, Shameless, Saving Grace, Weeds, Cold Case, 2 Broke Girls, Parenthood, The Closer, Rizzoli & Isles etc. She looks forward to continuing her role as Grandma from Napoleon Dynamite for Fox's animated version of the 2004 mega indie hit.\n\nShe played the lead in Tennessee William's last full-length play; A House Not Meant To Stand in it's critically acclaimed West Coast Premiere at the Fountain Theatre in 2011. Her performance was nominated for an Ovation Award - Best Female Lead in 2011.",
        "birthday": "1949-03-03",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 53931,
        "imdb_id": "nm0553036",
        "known_for_department": "Acting",
        "name": "Sandy Martin",
        "place_of_birth": "Philadelphia, Pennsylvania, USA",
        "popularity": 0.2658,
        "profile_path": "/eX337npL58ObgIQZkIRehLdlvsi.jpg"
    }
}