{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5Pl47mB0Jnrg4oHoO0sVdJ6WMRL.jpg",
                "genre_ids": [
                    18
                ],
                "id": 405,
                "original_language": "it",
                "original_title": "La strada",
                "overview": "When Gelsomina, a naïve young woman, is purchased from her impoverished mother by brutish circus strongman Zampanò to be his wife and partner, she loyally endures her husband's coldness and abuse as they travel the Italian countryside performing together. Soon Zampanò must deal with his jealousy and conflicted feelings about Gelsomina when she finds a kindred spirit in Il Matto, the carefree circus fool, and contemplates leaving Zampanò.",
                "popularity": 2.933,
                "poster_path": "/rwjbT0zlsUDMztaCcWjlWuxaEL1.jpg",
                "release_date": "1954-09-23",
                "title": "La Strada",
                "video": false,
                "vote_average": 7.914,
                "vote_count": 1112,
                "character": "Il 'Matto'",
                "credit_id": "52fe423fc3a36847f800f829",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/gkyYZSevVI6zbGrLDmSo9Im88Qv.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 10322,
                "original_language": "en",
                "original_title": "Being There",
                "overview": "A simple-minded gardener named Chance has spent all his life in the Washington D.C. house of an old man. When the man dies, Chance is put out on the street with no knowledge of the world except what he has learned from television.",
                "popularity": 2.7233,
                "poster_path": "/3RO3jbCKEey2T9bYFkYt9xpwen9.jpg",
                "release_date": "1979-12-19",
                "title": "Being There",
                "video": false,
                "vote_average": 7.613,
                "vote_count": 1046,
                "character": "Vladimir Skrapinov",
                "credit_id": "52fe43599251416c7500ceb7",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ричард Бейсхарт",
            "Ричард Бэйзхарт",
            "John Richard Basehart"
        ],
        "biography": "John Richard Basehart was an American actor. He starred in the 1960s television science fiction drama Voyage to the Bottom of the Sea, in the role of Admiral Harriman Nelson.\n\nOne of his most notable film roles was the acrobat known as \"the Fool\" in the acclaimed Italian film La strada directed by Federico Fellini. He also appeared as the killer in the film noir classic He Walked by Night (1948), as a psychotic member of the Hatfield clan in Roseanna McCoy (1949), as Ishmael in Moby Dick (1956), and in the drama Decision Before Dawn (1951). He was married to Italian Academy Award-nominated actress Valentina Cortese, with whom he had one son before their divorce in 1960. Cortese and Basehart also costarred in Robert Wise's The House on Telegraph Hill (1951).\n\nBasehart was also noted for his deep, distinctive voice and was prolific as a narrator of many television and movie projects ranging from features to documentaries. In 1980, Basehart narrated the mini-series written by Peter Arnett called Vietnam: The Ten Thousand Day War that covered Vietnam and its battles from the Japanese surrender on September 2, 1945 to the final American embassy evacuation on April 30, 1975. He appeared in the pilot episode of the television series Knight Rider as billionaire Wilton Knight. He is the narrator at the beginning of the show's credits.\n\nIn 1971, Basehart played \"Captain Sligo\", a comical Irishman with a pet buffalo who negotiates a flawed but legal cattle purchase and unconventionally courts a widow with two children, played by Salome Jens, in CBS's western series, Gunsmoke, with James Arness. Basehart appeared in an episode of The Twilight Zone, Hawaii Five-O, and as Hannibal Applewood, an abusive schoolteacher in Little House on the Prairie in 1976.\n\nIn 1972, he appeared in the Columbo episode Dagger of the Mind in which he and Honor Blackman played a husband-and-wife theatrical team who were loose parodies of Laurence Olivier and Vivien Leigh. In the feature realm, he played a supporting role as a doctor in Rage (1972), a theatrical feature starring and directed by George C. Scott. He made a few TV movies including Sole Survivor (1970) and The Birdmen (1971). Both were based on true stories during World War II.\n\nHe died at age 70 following a series of strokes. One month before his death, Basehart was an announcer for the closing ceremonies of the 1984 Summer Olympics in Los Angeles.",
        "birthday": "1914-08-13",
        "deathday": "1984-09-17",
        "gender": 2,
        "homepage": null,
        "id": 5403,
        "imdb_id": "nm0000865",
        "known_for_department": "Acting",
        "name": "Richard Basehart",
        "place_of_birth": "Zanesville, Ohio, USA",
        "popularity": 0.5374,
        "profile_path": "/4q9KoGOolSOzHNekVm3JhZFuCmJ.jpg"
    }
}