{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/leF9AKe937UhQsfWGtXfG7tBRvU.jpg",
                "genre_ids": [
                    18,
                    36,
                    10749
                ],
                "id": 11659,
                "original_language": "it",
                "original_title": "La meglio gioventù",
                "overview": "After a fateful encounter in the summer of 1966, the lifepaths of two brothers from a middle-class Roman family diverge, intersecting with some of the most significant events of postwar Italian history in the following decades.",
                "popularity": 1.9243,
                "poster_path": "/jKFeWrVshmFj8uG056O4tT5ZNTE.jpg",
                "release_date": "2003-06-22",
                "title": "The Best of Youth",
                "video": false,
                "vote_average": 8.1,
                "vote_count": 568,
                "character": "Mirella Utano",
                "credit_id": "52fe44739251416c75035253",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Maya Sansa (born 25 September 1975) is an Italian actress.\n\nMaya Sansa was born in Rome the daughter of an Iranian father and an Italian mother. When she was 14, she started to study acting at her high school in Rome the \"Virgilio\". She then moved to London to study at the Guildhall School of Music and Drama. There she graduated in acting and was soon picked by Marco Bellocchio to take part in his new film: La balia. Maya later worked with Bellocchio for a second time, starring in the film Goodmorning, Night. Sansa has also worked with Marco Tullio Giordana in the film The Best of Youth.\n\nOn 2 May 2004 The New York Times published an article which named her as the new image of Italian cinema.\n\nOn 14 June 2013, she won the David di Donatello for Best Supporting Actress for her role in Dormant Beauty.\n\nShe has a daughter, Talitha, with her partner Fabrice Scott with whom she lives in Paris.\n\nSource: Article \"Maya Sansa\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1975-09-25",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 54230,
        "imdb_id": "nm0763022",
        "known_for_department": "Acting",
        "name": "Maya Sansa",
        "place_of_birth": "Rome, Italy",
        "popularity": 0.3222,
        "profile_path": "/aSCX5kskBVe5yCqKzeA9yFv1CWO.jpg"
    }
}