{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/aDKuDfEAYa2VENKd155D4ZoAl7c.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 48034,
                "original_language": "fr",
                "original_title": "Les Petits Mouchoirs",
                "overview": "Despite a traumatic event, a group of friends decide to go ahead with their annual beach vacation. Their relationships, convictions, sense of guilt and friendship are sorely tested. They are finally forced to own up to the little white lies they've been telling each other.",
                "popularity": 1.7512,
                "poster_path": "/djypJtQfUxeEMh6kc0aRzIoN9UR.jpg",
                "release_date": "2010-10-20",
                "title": "Little White Lies",
                "video": false,
                "vote_average": 7.109,
                "vote_count": 1588,
                "character": "Véronique Cantara",
                "credit_id": "52fe4753c3a36847f812f851",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Валері Боннетон"
        ],
        "biography": "Valérie Bonneton (born 5 April 1970) is a French stage, film and television actress.\n\nValérie Bonneton was born in Somain, Nord department. Her father was an insurance salesman and her mother a housewife. She grew up in neighbouring Aniche and fell in love with acting in her cinquième (~Year 7) French class. Considering an acting career too difficult, she entered the science stream for her baccalauréat, intending to become a veterinarian. But playing the role of Ismène in Anouilh’s Antigone changed her mind. After her baccalauréat she left for Paris where she enrolled at Cours Florent, supporting herself with part-time jobs (fruit seller, baby-sitter, sculptor’s model). In 1991 she was accepted into the National Academy of Dramatic Arts where she studied until the age of 26.\n\nShe took noteworthy supporting roles in films, until the success of the television series Fais pas ci, fais pas ça in 2007, which made her popular. In 2010, she appeared in Guillaume Canet’s Little White Lies which earnt her a César Awards nomination as Best Supporting Actress. In 2013, she appeared in Eyjafjallajökull with Dany Boon. In 2017, she acted in Garde alternée with Didier Bourdon and Isabelle Carré.\n\nSource: Article \"Valérie Bonneton\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1970-04-05",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 54324,
        "imdb_id": "nm0094993",
        "known_for_department": "Acting",
        "name": "Valérie Bonneton",
        "place_of_birth": "Somain, Nord, France",
        "popularity": 0.6881,
        "profile_path": "/tHGojn1vMzGriINazQhMBBcG9u9.jpg"
    }
}