{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mpfRchw4jh2cEBajB9EJltTnDH2.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 1429,
                "original_language": "en",
                "original_title": "25th Hour",
                "overview": "In New York City in the days following the events of 9/11, Monty Brogan is a convicted drug dealer about to start a seven-year prison sentence, and his final hours of freedom are devoted to hanging out with his closest buddies and trying to prepare his girlfriend for his extended absence.",
                "popularity": 4.4731,
                "poster_path": "/uW7tTRElr2tRhmAVESzvHy4ByXg.jpg",
                "release_date": "2002-12-19",
                "title": "25th Hour",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 2441,
                "character": "Khari",
                "credit_id": "53efe1000e0a2675af001f64",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Comedian Patrice O'Neal was born in New York, but moved to Boston when he was just one year old. He was educated at West Roxbury High School and went on to attend Northeastern University, both in Boston. After this, various jobs followed including a sausage cart vendor at a train station, flower seller and popcorn seller at the Boston Garden Arena.  In October 1992, O'Neal attended an open mic comedy night. He heckled one of the comedians, who challenged O'Neal to perform himself at the next open mic night. He did just that and so began his comedy career. Over the next 6 years, O'Neal became a fixture on the Boston comedy circuit. He then relocated to New York, becoming a regular at Manhattan's Comedy Cellar. After this, O'Neal moved to Los Angeles and radio, television and film projects followed.\n\nO'Neal appeared in various shows, both in acting roles and as himself. In 2005, he taped his own episode of \"One Night Stand\" (2005) and in 2011 he had his own Comedy Central special, 'Patrice O'Neal: Elephant in the Room'. As well as on-screen projects, O'Neal worked on radio and continued as a stand-up in clubs and theaters.  O'Neal's final screen appearance was in September 2011 when he took part in the Comedy Central Roast of Charlie Sheen (2011) (TV). On November 29th 2011, Patrice O'Neal, who suffered from diabetes, passed away following complications from a stroke. He was 41.",
        "birthday": "1969-12-07",
        "deathday": "2011-11-29",
        "gender": 2,
        "homepage": null,
        "id": 543256,
        "imdb_id": "nm1169306",
        "known_for_department": "Acting",
        "name": "Patrice O'Neal",
        "place_of_birth": "Roxbury, Massachusetts, USA",
        "popularity": 0.1395,
        "profile_path": "/1y2LWXkM6b3YzUjfHLTta6UKTDv.jpg"
    }
}