{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lNUP9ymEHolzjLIHyoAkpHRQZxq.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 110160,
                "original_language": "fr",
                "original_title": "Laurence Anyways",
                "overview": "The story of an impossible love between a woman named Fred and a transgender woman named Laurence who reveals her inner desire to become her true self.",
                "popularity": 2.3226,
                "poster_path": "/d8BpJ9qOQE7VFFqaV1XDdGfMsP7.jpg",
                "release_date": "2012-05-18",
                "title": "Laurence Anyways",
                "video": false,
                "vote_average": 7.65,
                "vote_count": 876,
                "character": "Restaurant Manager",
                "credit_id": "57edd241c3a3684d9a000f80",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Denise Filiatrault (born May 16, 1931) is a Canadian actress and director.\n\nShe attained star status on TV in the 1960s, co-starring with Dominique Michel in the Radio-Canada television series Moi et l'autre (1967–71) and in many editions of Radio-Canada's annual New Year's special, Bye Bye. She had further success in Chez Denise (1978–1982), Le 101, avenue des Pins (1984–85) and Denise... aujourd'hui (1990–91).\n\nIn addition to her television career, Filiatrault also performed in films and on stage, notably in works by Michel Tremblay. She was known to perform both comic and dramatic roles, such as Gilles Carle's The Death of a Lumberjack (La Mort d'un bûcheron) in 1973, André Brassard's film version of Tremblay's Once Upon a Time in the East (Il était une fois dans l'Est) in 1974, Denys Arcand's Gina in 1975, Claude Fournier's Far from You Sweetheart (Je suis loin de toi mignonne) in 1976, Fantastica in 1980 and Carle's The Plouffe Family (Les Plouffe) in 1981, playing the tormented Cécile.\n\nFollowing Les Plouffe, Filiatrault took a break from film, concentrating more in writing and directing for theatre and summer comedy. Filiatrault then decided to take the leap to directing cinema by adapting Tremblay's novel C't'à ton tour, Laura Cadieux into the 1998 film It's Your Turn, Laura Cadieux, presenting the world of overweight women yearning for love and affection. Filiatrault opted for a simple yet effective style that showcased the talents of the film's strong female leads. This dramatic comedy scored such success that Filiatrault wrote and directed the 1999 sequel Laura Cadieux II (Laura Cadieux... la suite), in which she further developed the characters and their world.\n\nIn 2002, she produced a new comedy fantasy, Alice's Odyssey (L'Odyssée d'Alice Tremblay), which received a lukewarm response from critics and moviegoers. In 2003, taking advantage of the success of her motion picture characters, Filiatrault produced a television miniseries for TVA, Le Petit monde de Laura Cadieux (2003), before tackling a new film Bittersweet Memories (Ma vie en cinémascope) (2004), a dramatic biography of 1930s-1950s singer Alys Robi (played by Pascale Bussières).\n\nAs artistic director of the Théâtre du Rideau Vert, she and the theatre were criticized in January 2015 by a coalition of Montreal arts groups for a year-end production in which a Caucasian actor portrayed hockey player P.K. Subban in blackface. Filiatrault responded that she was \"shocked, outraged, and humiliated\" by the reaction, saying that she had been in show business for 60 years and was the first person to hire a black Quebecer on television.",
        "birthday": "1931-05-16",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 543211,
        "imdb_id": "nm0276946",
        "known_for_department": "Acting",
        "name": "Denise Filiatrault",
        "place_of_birth": "Montréal, Québec, Canada",
        "popularity": 0.0496,
        "profile_path": "/vLfskr7UtufrVM2fNrxz4LjsTp0.jpg"
    }
}