{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wRMUb4hrgD868hNiRjCkbPXqRv0.jpg",
                "genre_ids": [
                    80,
                    18,
                    53
                ],
                "id": 10363,
                "original_language": "fr",
                "original_title": "Plein soleil",
                "overview": "Tom Ripley is a talented mimic, moocher, forger and all-around criminal improviser; but there's more to Tom Ripley than even he can guess.",
                "popularity": 2.3457,
                "poster_path": "/xGVRU34izQwG8YQNfVOSfKPhD3S.jpg",
                "release_date": "1960-03-10",
                "title": "Purple Noon",
                "video": false,
                "vote_average": 7.58,
                "vote_count": 564,
                "character": "Mrs. Popova",
                "credit_id": "56c7bb1092514117330008f1",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Elvire Popesco"
        ],
        "biography": "Elvira Popescu (10 May 1894 – 11 December 1993) was a Romanian-French stage and film actress and theatre director. During the 1930s and 1940s, she starred in a number of French comedy films.\n\nBorn in Bucharest, Popescu studied drama at the Music and Drama Conservatory in her native city, under the guidance of Constantin Nottara and Aristizza Romanescu. In 1911 Grigore Brezeanu was making the first Romanian films to deal with fiction. He employed Popesco as well as other leading actors like Nottara and Romanescu. The first two films were called \"Fatal Love\" and \"Spin a Yarn\". No copies are known of these films. Popesco made her debut at the National Theatre Bucharest at age 16. In 1912, she played herself in the movie Independența României, directed by Aristide Demetriade.\n\nIn 1919 she became artistic director of the Excelsior Theatre. In 1921, Popescu started Teatrul Mic, which she managed in parallel with the Excelsior. In 1923, she starred in the movie Ţigăncuşa de la iatac, directed by Alfred Halm.\n\nAt the urging of Louis Verneuil, the French playwright, Popescu moved in 1924 to Paris. Under Verneuil's direction, she played the leading role in Ma Cousine de Varsovie, at the Théâtre Michel (1923). She also played in Tovaritch (1933), La Machine infernale (1954), Nina (1949), and La Mamma (1957). Later on, she was director of Théâtre de Paris (1956–1965), and Théâtre Marigny (1965–1978).[5] At age 84, she played again in La Mamma.\n\nElvira Popescu also played in movies, such as La Présidente (Fernand Rivers, 1938), Tricoche et Cacolet (Pierre Colombier, 1938), Ils étaient neuf célibataires (Sacha Guitry, 1939), Paradis perdu (Abel Gance, 1940), Austerlitz (Abel Gance, 1960),[6] and Purple Noon (René Clément, 1960).\n\nShortly after her debut in 1910, Popescu married comedian Aurel Athanasescu and they had a daughter named Tatiana. After a few years, she divorced, and married Ion Manolescu-Strunga, Minister of Industry and Commerce (who was to die in Sighet prison in the 1950s). Her third husband was Count Maximilien Sébastien Foy (born in Paris on 17 April 1900, died in Neuilly-sur-Seine on 11 November 1967).\n\nShe died in Paris at age 99, and was interred at Père Lachaise Cemetery.\n\nSource: Article \"Elvira Popescu\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1894-05-10",
        "deathday": "1993-12-11",
        "gender": 1,
        "homepage": null,
        "id": 543816,
        "imdb_id": "nm0691214",
        "known_for_department": "Acting",
        "name": "Elvira Popescu",
        "place_of_birth": "Bucarest, Romania",
        "popularity": 0.1162,
        "profile_path": "/797mN0xnRLduGxnZC3AFBJUTM82.jpg"
    }
}