{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/pP1UeRZ7shy1llOUTnpXWISOokK.jpg",
                "genre_ids": [
                    36,
                    18,
                    53
                ],
                "id": 399121,
                "original_language": "fr",
                "original_title": "J'accuse",
                "overview": "In 1894, French Captain Alfred Dreyfus is wrongfully convicted of treason and sentenced to life imprisonment at the Devil’s Island penal colony.",
                "popularity": 2.3685,
                "poster_path": "/kqlzmKVBpGz7OMWfOXlK4y1m9Uz.jpg",
                "release_date": "2019-09-30",
                "title": "An Officer and a Spy",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 1547,
                "character": "Bachir",
                "credit_id": "63e21a91528b2e00b5c40cdf",
                "order": 23
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Mohammed Lakhdar Hamina"
        ],
        "biography": "Mohammed Lakhdar-Hamina (born in M'sila in 1934) is an Algerian film director and screenwriter. He is best known for his 1975 film Chronicle of the Years of Fire. He is one of the most prominent figures in contemporary Arabic cinema.\n\nBorn in 1934 at M'Sila, Algeria, Lakhdar began his studies in his native country. He first became interested in the world of cinema at the Lycée Carnot in Cannes, France. After beginning studies of agriculture and law at French universities, he deserted the French Army in 1958 and joined the anti-French Algerian Resistance in Tunisia, where he worked for the provisional Algerian government in exile. His film career began as he joined the Algerian Maquis (guerrillas).\n\nIn 1959, the Algerian National Liberation Front (FLN) sent him to Prague, where he pursued his cinematography studies at the cinema school, Film and TV School of the Academy of Performing Arts in Prague, the Czech academy for cinema and television. However, he quit his studies in order to work for the Barrandov Studios. In 1960 he joined the Service Cinema, created by the Algerian government in exile. In 1959, the Algerian ministry of information in exile commissioned Lakhdar-Hamina, together with Djamel Chanderli and Pierre Chaulet, to produce a movie about Algeria's predicament under French colonialism. The documentary film, titled Djazzaïrouna (Our Algeria), aimed at portraying the goals pursued by the Algerian nationalist guerrilla movement, the Maquis.\n\nIn 1961, Lakhdar-Hamina collaborated with Chanderli in the movie Yasmina, which tells the story of a refugee girl who must flee her village following its destruction. Lakhdar-Hamina collaborated again with Chanderli in the 1962 The people's voice and 1961 The guns of freedom. Upon Algerian independence in 1962, he returned to his homeland where, together with his colleagues from Tunisian exile, he founded the Office des actualités algériennes, of which he was director from 1963 until its dissolution in 1974.\n\nFrom 1981 until 1984 he acted as director of the Office National pour le Commerce et l'Industrie Cinématographique, the most important institution for furtherance of the French film industry. One of his most recent films, The last image, was part of the Official Selection at Cannes Film Festival in 1986 and was nominated for the Golden Palm.\n\nLakhdar-Hamina's son, Malik Lakhdar-Hamina, became well known after the release of his first long film, Autumn: October in Algiers (1992), a film that explores the riots of October 1988 through the microcosm of an Algerian family split by a Westernized versus Islamicized view of contemporary Algeria. His other son, Tariq Lakhdar-Hamina, is a film producer.\n\nFrom its inception, Algerian cinema was intertwined with the ideological and existential debates that surrounded the Algerian war of independence and the postcolonial nation-building stage.\n\nIn this context, Lakhdar-Hamina's cinematographic career has significantly contributed to the development of a new filmic language characteristic of contemporary Maghrebi cinema in general and Algerian in particular, notably distinct from the filmic experiences of other Arab countries and most particularly of the Egyptian cinematic industry. ...\n\nSource: Article \"Mohammed Lakhdar-Hamina\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1934-02-26",
        "deathday": "2025-05-23",
        "gender": 2,
        "homepage": null,
        "id": 544569,
        "imdb_id": "nm0482228",
        "known_for_department": "Directing",
        "name": "Mohammed Lakhdar-Hamina",
        "place_of_birth": "M'sila, Algeria",
        "popularity": 0.1907,
        "profile_path": "/4bfSE7eEoLYocMIgVCLrTeOLg6d.jpg"
    }
}