{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ks3WTeuEaenmMiizxXba65Rxpu1.jpg",
                "genre_ids": [
                    80,
                    18,
                    53
                ],
                "id": 823951,
                "original_language": "fr",
                "original_title": "Novembre",
                "overview": "In November 2015, a series of unprecedented and deadly attacks hits Paris. The anti-terrorist police led by Heloise and her chief commander Fred - face an unprecedented level of pressure: in a race against the clock, they must find the perpetrators of the attacks as quickly as possible before they can strike again, travelling across Europe and beyond in one of the biggest manhunts in history.",
                "popularity": 3.0414,
                "poster_path": "/A5wae5M81jLTuv3WbCJfORxapRA.jpg",
                "release_date": "2022-10-05",
                "title": "November",
                "video": false,
                "vote_average": 7.071,
                "vote_count": 823,
                "character": "Kader",
                "credit_id": "6120d2a7b7abb50075311bc5",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Sami Outalbali (born 19 March 1999) is a French actor. He rose to prominence for portraying Ilyes on the OCS drama series Grown Ups (2016–2019) and gained international recognition for his role as Rahim in the Netflix comedy-drama series Sex Education (2020–2021). He is also known for his roles in the supernatural series Mortel (2019–2021) and the drama film A Tale of Love and Desire (2021).\n\nSami Outalbali was born in Poissy, Yvelines, on 19 March 1999. He has Moroccan and Guadeloupean ancestry. At the age of 3, he appeared in a Disney advertisement.\n\nOutalbali first appeared on screen in the France 3 television film Il faut sauver Saïd in 2006. In 2011, he played a minor role in the comedy film Les Tuche.\n\nHe had his breakout role in the OCS teen drama series Grown Ups (French: Les Grands; 2016–2019), created by Vianney Lebasque, in which he portrays Ilyes, a gay high school student coming to terms with his sexuality. In 2018, he appeared in the first part of the Arte miniseries Proud (French: Fiertés), created by Philippe Faucon. In 2019, he starred in Laurent Micheli's Lola and Benjamin Parent's Un vrai bonhomme. That same year, he also appeared in the Netflix supernatural series Mortel as a missing teenager called Reda, the older brother of Sofiane (Carl Malapa).\n\nIn 2019, he joined the cast of the second series of the Netflix comedy-drama Sex Education in a recurring role. On the show, which marks his English-speaking debut, he portrays Rahim Harrack, a French exchange student who becomes a love interest of Eric Effiong (Ncuti Gatwa). He also returned for the show's third series. In August 2020, he starred in the music video for the single \"Coup de Blues/Soleil\" by Bigflo & Oli.\n\nIn 2019, he was cast in Leyla Bouzid's romantic drama film A Tale of Love and Desire as Ahmad Ouannas, a young French man of Algerian origin, who experiences a sexual awakening after meeting a Tunisian woman (Zbeida Belhajamor). The film premiered in the Critics' Week section of the 2021 Cannes Film Festival. For this role, Outalbali was nominated for Best Male Revelation at the 27th Lumières Awards and Most Promising Actor at the 47th César Awards.\n\nIn April 2022, he served as a member of the jury at the 5th Canneseries festival in Cannes. He appeared in Cédric Jimenez's 2022 film Novembre.\n\nSource: Article \"Sami Outalbali\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1999-03-19",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 544687,
        "imdb_id": "nm4218746",
        "known_for_department": "Acting",
        "name": "Sami Outalbali",
        "place_of_birth": "Poissy, Yvelines, France",
        "popularity": 0.6868,
        "profile_path": "/2ekj2Fc6sK039NKNaCQ8fIhjXq.jpg"
    }
}