{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/538U9snNc2fpnOmYXAPUh3zn31H.jpg",
                "genre_ids": [
                    28,
                    12,
                    53
                ],
                "id": 575265,
                "original_language": "en",
                "original_title": "Mission: Impossible - The Final Reckoning",
                "overview": "Ethan Hunt and team continue their search for the terrifying AI known as the Entity — which has infiltrated intelligence networks all over the globe — with the world's governments and a mysterious ghost from Hunt's past on their trail. Joined by new allies and armed with the means to shut the Entity down for good, Hunt is in a race against time to prevent the world as we know it from changing forever.",
                "popularity": 174.6469,
                "poster_path": "/z53D72EAOxGRqdr7KXXWp9dJiDe.jpg",
                "release_date": "2025-05-17",
                "title": "Mission: Impossible - The Final Reckoning",
                "video": false,
                "vote_average": 7.287,
                "vote_count": 1766,
                "character": "SSGN Ohio - Crew",
                "credit_id": "682b41a21454889f4b8c0802",
                "order": 74
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "René is a London-based American actor and voiceover artist, originally from Miami, Florida.\n\nHis passion for performing sparked at just four years old, at the Alliance Theatre, in Atlanta, Georgia, where he discovered a love for theatre, film, and voice acting.\n\nHe honed his craft at New World School of the Arts, further refining his skills at The New York Conservatory for Dramatic Arts, with a focus on film, TV and voice acting. René then expanded his expertise at UCLA, immersing himself in theatre, film and TV studies.\n\nRené is known for his talent in bringing characters to life, both on screen and in the recording booth. His goal is always the same: to deliver performances that resonate long after the final cut.",
        "birthday": "1998-09-06",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.skttalent.com/rene-valius",
        "id": 5448553,
        "imdb_id": "nm3292315",
        "known_for_department": "Acting",
        "name": "René Valius",
        "place_of_birth": "Miami, Florida, US",
        "popularity": 0.0214,
        "profile_path": "/nKUUqySXHYzV0soev8LvnCh0QbV.jpg"
    }
}