{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2pnfUSFqUPn9F4mzl1MLKrlnNbU.jpg",
                "genre_ids": [
                    35,
                    80
                ],
                "id": 25253,
                "original_language": "fr",
                "original_title": "Les Tontons flingueurs",
                "overview": "An aging gangster, Fernand Naudin is hoping for a quiet retirement when he suddenly inherits a fortune from an old friend, a former gangster supremo known as the Mexican. If he is ambivalent about his new found wealth, Fernand is positively nonplussed to discover that he has also inherited his benefactor’s daughter, Patricia. Unfortunately, not only does Fernand have to put up with the thoroughly modern Patricia and her nauseating boyfriend, but he also had to contend with the Mexican’s trigger-happy former employees, who are determined to make a claim.",
                "popularity": 1.7675,
                "poster_path": "/1uYCIsMpX7FtWu2xO1YMIAQYvLR.jpg",
                "release_date": "1963-11-27",
                "title": "Crooks in Clover",
                "video": false,
                "vote_average": 7.747,
                "vote_count": 526,
                "character": "Louis « le Mexicain »",
                "credit_id": "52fe44c0c3a368484e034adf",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Жак Дюмениль"
        ],
        "biography": "Jacques Dumesnil (born Marie Émile Eugène André Joly ; 9 November 1903 – 8 May 1998) was a French film and television actor. Jacques Dumesnil was born as Marie Émile Eugène André Joly on November 9, 1903, in Paris, France. Before becoming an actor, he received training as a mechanical engineer. After starting as a secretary at the aviation school, he became an industrial designer, a profession he left to devote himself to the theater.\n\nHe adopted the pseudonym Dumesnil because of the admiration he had to French actor Camille Dumény.  He started out as a fanciful singer in a café located in Paris Place de l'Hôtel de Ville , he was paid in sandwiches and glasses of beer.\n\nDumesnil started on stage in 1927 and divided his career between theater and cinema. Having spent two years at the Comédie-Française , he played among other things in Les Tontons flingueurs and provided the French voice of Charlie Chaplin in Monsieur Verdoux (1947) and A King in New York (1957).\n\nHis role as Duke of Plessis-Vaudreuil in the television series Au Plaisir de Dieu , earned him a resurgence of popularity and the 7 d'Or for best actor.\n\nJacques Dumesnil had a son, Pierre Joly dit Dumesnil , who was a French swimming champion and participated in the 1952 Summer Olympics in Helsinki , Finland.",
        "birthday": "1903-11-09",
        "deathday": "1998-05-08",
        "gender": 2,
        "homepage": null,
        "id": 544936,
        "imdb_id": "nm0241545",
        "known_for_department": "Acting",
        "name": "Jacques Dumesnil",
        "place_of_birth": "Paris, France",
        "popularity": 0.6204,
        "profile_path": "/h2eCCHZ5hzed4V9tPIelfSJutLD.jpg"
    }
}