{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/npLwIeUobjVCM4fLfdeLqQhAoey.jpg",
                "genre_ids": [
                    28
                ],
                "id": 9461,
                "original_language": "en",
                "original_title": "Enter the Dragon",
                "overview": "A martial artist agrees to spy on a reclusive crime lord using his invitation to a tournament there as cover.",
                "popularity": 6.8884,
                "poster_path": "/fyrh2ULEcmLpGTVLPQqFW45hqr5.jpg",
                "release_date": "1973-08-17",
                "title": "Enter the Dragon",
                "video": false,
                "vote_average": 7.419,
                "vote_count": 1987,
                "character": "Braithwaite",
                "credit_id": "52fe44fac3a36847f80b5721",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Geoffrey Weeks (1922-1974) was a Hong Kong based radio host with Hong Kong's Television and Radio's Radio 3 station. He is best known for his small but memorable role as the ill-fated Brad in the 1973 martial arts classic Enter the Dragon, starring Bruce Lee.\n\nWeeks was born in Hong Kong in 1922. He was a gifted student and excelled in academics, but his true passion was radio broadcasting. In the early 1950s, he joined Radio 3 and quickly became one of the station's most popular hosts. He was known for his wit, charm, and encyclopedic knowledge of music and popular culture.\n\nIn 1973, Weeks was approached by Bruce Lee to play a small role in his upcoming film, Enter the Dragon. Weeks was initially hesitant to take the role, as he had no prior acting experience. However, he was eventually persuaded by Lee's vision for the film and his own enthusiasm for the project.\n\nWeeks' role as Brad is relatively small, but it is one of the most memorable in the film. Brad is a British drug smuggler who is killed by Lee's character, Lee. Weeks' performance is both understated and menacing, and he perfectly captures the character's arrogance and disdain for Lee.\n\nSadly, Weeks passed away just a few weeks after filming of Enter the Dragon was completed. He was 52 years old. His death was a shock to his colleagues and fans, and he is still remembered as one of Hong Kong's most beloved radio personalities.",
        "birthday": null,
        "deathday": null,
        "gender": 0,
        "homepage": null,
        "id": 544964,
        "imdb_id": "nm0917315",
        "known_for_department": "Acting",
        "name": "Geoffrey Weeks",
        "place_of_birth": "Hong Kong",
        "popularity": 0.1756,
        "profile_path": "/eyNyiGKb3tiNUfwLEprYvZko5Ce.jpg"
    }
}