{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/538U9snNc2fpnOmYXAPUh3zn31H.jpg",
                "genre_ids": [
                    28,
                    12,
                    53
                ],
                "id": 575265,
                "original_language": "en",
                "original_title": "Mission: Impossible - The Final Reckoning",
                "overview": "Ethan Hunt and team continue their search for the terrifying AI known as the Entity — which has infiltrated intelligence networks all over the globe — with the world's governments and a mysterious ghost from Hunt's past on their trail. Joined by new allies and armed with the means to shut the Entity down for good, Hunt is in a race against time to prevent the world as we know it from changing forever.",
                "popularity": 174.6469,
                "poster_path": "/z53D72EAOxGRqdr7KXXWp9dJiDe.jpg",
                "release_date": "2025-05-17",
                "title": "Mission: Impossible - The Final Reckoning",
                "video": false,
                "vote_average": 7.287,
                "vote_count": 1766,
                "character": "Nurse",
                "credit_id": "682e1f08425c06076e2f1703",
                "order": 33
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Izyan Hay is a British-Malaysian actress and digital creator recognized for her roles in the short films In the Dark and The Unwinding (2023), as well as her part in the feature film Mission: Impossible - The Final Reckoning (2025). She resides in South London and has trained with the New Earth Theatre's Performer's Academy at the Royal Central School of Speech and Drama, honing her craft in acting. Her work spans independent short films and major productions, marking her as a rising talent in the entertainment industry.\n\nBorn to a multicultural background, Izyan combines her British and Malaysian heritage, which informs her diverse artistic perspective. Before fully immersing herself in acting, she pursued academic excellence, earning a First Class Honours degree in International Relations from King's College London and later an MPhil in Development Studies from the University of Cambridge. Her academic background reflects a strong commitment to understanding global issues, which complements her creative endeavors.\n\nIzyan's career began with roles in short films that showcased her ability to portray complex characters, leading to opportunities in larger projects. Her involvement in Mission: Impossible - The Final Reckoning brought her wider recognition, demonstrating her versatility and appeal in mainstream cinema. Beyond acting, she engages in digital content creation and entertainment, contributing to a growing presence in the creative digital space.\n\nHer interests extend to human rights and development, evidenced by her previous work with international organizations and advocacy groups. This blend of artistic and intellectual pursuits positions Izyan Hay as an emerging figure whose contributions span both cultural and social spheres, influencing contemporary pop culture and the entertainment field with a unique, globally informed voice.",
        "birthday": "1997-08-31",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.backstage.com/u/izyanhay/",
        "id": 5453387,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Izyan Hay",
        "place_of_birth": "Richmond, Surrey, England",
        "popularity": 0.0393,
        "profile_path": "/wjJe29I4nMzfRbtd75KY21pYjN8.jpg"
    }
}