{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/538U9snNc2fpnOmYXAPUh3zn31H.jpg",
                "genre_ids": [
                    28,
                    12,
                    53
                ],
                "id": 575265,
                "original_language": "en",
                "original_title": "Mission: Impossible - The Final Reckoning",
                "overview": "Ethan Hunt and team continue their search for the terrifying AI known as the Entity — which has infiltrated intelligence networks all over the globe — with the world's governments and a mysterious ghost from Hunt's past on their trail. Joined by new allies and armed with the means to shut the Entity down for good, Hunt is in a race against time to prevent the world as we know it from changing forever.",
                "popularity": 174.6469,
                "poster_path": "/z53D72EAOxGRqdr7KXXWp9dJiDe.jpg",
                "release_date": "2025-05-17",
                "title": "Mission: Impossible - The Final Reckoning",
                "video": false,
                "vote_average": 7.287,
                "vote_count": 1766,
                "character": "Mount Weather - Operator",
                "credit_id": "682e201e2d841d6a612f8026",
                "order": 44
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/bz7pwNGCbV576COsDcYN9MbEACC.jpg",
                "genre_ids": [
                    28,
                    53,
                    12
                ],
                "id": 370172,
                "original_language": "en",
                "original_title": "No Time to Die",
                "overview": "Bond has left active service and is enjoying a tranquil life in Jamaica. His peace is short-lived when his old friend Felix Leiter from the CIA turns up asking for help. The mission to rescue a kidnapped scientist turns out to be far more treacherous than expected, leading Bond onto the trail of a mysterious villain armed with dangerous new technology.",
                "popularity": 9.304,
                "poster_path": "/iUgygt3fscRoKWCV1d0C7FbM9TP.jpg",
                "release_date": "2021-09-29",
                "title": "No Time to Die",
                "video": false,
                "vote_average": 7.355,
                "vote_count": 6670,
                "credit_id": "68ab3c50b795627c92781f7a",
                "department": "Crew",
                "job": "Stand In"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            " Stefanie Nieuwenhuijse"
        ],
        "biography": "Stefanie Nieuwenhuyse is a Dutch actress, model, and multidisciplinary digital creator known for her contributions to both the entertainment and fashion industries. She gained recognition for her involvement in major film productions such as No Time to Die (2021), where she worked as a stand-in for Léa Seydoux, and Mission: Impossible - The Final Reckoning (2025), in which she appeared as a Mount Weather operator under the name Stefanie Nieuwenhuijse.  Nieuwenhuyse's early background is rooted in fashion design, having completed her Bachelor's degree at the Amsterdam Fashion Institute in 2010 and later pursuing a part-time Master's degree. Her fashion work is notable for its innovative use of sustainable materials, exemplified by her eco-fashion collection that creatively re-purposed plywood cutouts to mimic snakeskin textures, showcased at London Fashion Week in collaboration with a bio-waste company. This project highlighted her commitment to environmentally conscious design and her ability to merge artistry with sustainability.\n\nHer multidisciplinary talents extend beyond acting and modeling into digital creation and illustration, with a strong presence on platforms such as Behance and Instagram, where she shares her fashion design and artistic projects. Nieuwenhuyse's work reflects a blend of creative disciplines, contributing to contemporary pop culture through her innovative designs and supporting roles in globally recognized films.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "https://stefanienieuw.wixsite.com/mysite/about",
        "id": 5453392,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Stefanie Nieuwenhuyse",
        "place_of_birth": "Frederiksberg, Denmark",
        "popularity": 0.0143,
        "profile_path": "/3OV9gpXEhbdX0Lolxk8rautfFzT.jpg"
    }
}