{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/538U9snNc2fpnOmYXAPUh3zn31H.jpg",
                "genre_ids": [
                    28,
                    12,
                    53
                ],
                "id": 575265,
                "original_language": "en",
                "original_title": "Mission: Impossible - The Final Reckoning",
                "overview": "Ethan Hunt and team continue their search for the terrifying AI known as the Entity — which has infiltrated intelligence networks all over the globe — with the world's governments and a mysterious ghost from Hunt's past on their trail. Joined by new allies and armed with the means to shut the Entity down for good, Hunt is in a race against time to prevent the world as we know it from changing forever.",
                "popularity": 174.6469,
                "poster_path": "/z53D72EAOxGRqdr7KXXWp9dJiDe.jpg",
                "release_date": "2025-05-17",
                "title": "Mission: Impossible - The Final Reckoning",
                "video": false,
                "vote_average": 7.287,
                "vote_count": 1766,
                "character": "Mount Weather - Marine Sergeant",
                "credit_id": "682e1f3ff0c5ed6dbd9e42b2",
                "order": 36
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jessica Lee",
            "Jessica Lee Morocco"
        ],
        "biography": "Jess Khan-Lee, also credited as Jessica Lee, is a Canadian actress known for her diverse roles in film, television, and video games. Originally from Winnipeg, Manitoba, she has built a versatile career with credits spanning from early 2000s television series to major motion pictures and interactive media. Khan-Lee trained in acting across North America and Asia, including at The Neighborhood Playhouse School of the Theater in New York City, where she honed her skills in the Meisner technique.\n\nHer career began with television appearances in series such as The Dead Zone (2002), where she played Lenora Towers, and Blade: The Series (2006), credited as Jessica Lee. She also appeared in Terminal City and Da Vinci's Inquest, showcasing her range in Canadian television. Transitioning to more prominent roles, she featured as a Marine Sergeant in Mission: Impossible - The Final Reckoning (2025), marking a significant milestone in her film career. Additionally, she has contributed voice work to video games like Fort Solis (2023) and Directive 8020 (upcoming).\n\nBased in London, UK, Khan-Lee's talents extend beyond acting into dance, stunts, and creative pursuits. She has worked on choreography for television, including assisting on Strictly Come Dancing (2024). Her multicultural background and training across continents have informed her dynamic presence in the entertainment industry. Outside of acting, she engages in martial arts, climbing, and diving, reflecting a commitment to physical disciplines that complement her on-screen performances. Khan-Lee continues to expand her impact in both screen and stage, contributing to contemporary pop culture through varied and compelling roles.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "https://thrive-talent.co.uk/portfolio_page/jess-khan-lee/",
        "id": 5453388,
        "imdb_id": null,
        "known_for_department": "Acting",
        "name": "Jess Khan-Lee",
        "place_of_birth": "Hong Kong, China",
        "popularity": 0.0533,
        "profile_path": "/911BqEMIlQ1tXd5vZSFGEy1k2g0.jpg"
    }
}