{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rbmJvTsPzVDszka97NguVUALUoh.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 423646,
                "original_language": "de",
                "original_title": "Aus dem Nichts",
                "overview": "Katja's life collapses after the deaths of her husband and son in a bomb attack. After a time of mourning and injustice, Katja seeks revenge.",
                "popularity": 1.5679,
                "poster_path": "/AdH8xoP2wAFZDMWiSoCGoLa0DUr.jpg",
                "release_date": "2017-11-23",
                "title": "In the Fade",
                "video": false,
                "vote_average": 6.906,
                "vote_count": 845,
                "character": "",
                "credit_id": "630fce2ced2ac200827ebfb1",
                "order": 23
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Yiannis Oikonomidis"
        ],
        "biography": "Yannis Economides was born in 1967 in Limassol, Cyprus. In 1987 he moved to Athens to study filmmaking. After several short films and documentaries, in 2003 he wrote and directed his first feature film, MATCHBOX. His second feature SOUL KICKING premiered in The International Critics' Week at Cannes Film Festival in 2006 and his third, KNIFER (2010) won seven awards from the Greek Film Academy, including Best Film, Best Director and Best Screenplay. His fourth feature, STRATOS, premiered in the Competition Programme of the 64th Berlin International Film Festival in 2014. For each one of his four feature films, Economides has been honored with the Greek Film Critics Association Award for Best Greek Feature Film of the Year. In October 2016, his first theatrical production premiered at the New Stage of the National Theatre in Athens, with Economides directing his own play SLEEP, STELLA, SLEEP. He has also performed as a supporting actor in several greek films. In 2017 he had a small but crucial part in Fatih Akin's latest film, \"In the Fade\".",
        "birthday": "1967-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 547052,
        "imdb_id": "nm1029210",
        "known_for_department": "Directing",
        "name": "Yannis Economides",
        "place_of_birth": "Limassol, Cyprus",
        "popularity": 1.4247,
        "profile_path": "/4JbzO867DuHnWr48vyzD8iAp5O2.jpg"
    }
}