{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mFt3dvxKugYPgUQgV16M6K2nEtc.jpg",
                "genre_ids": [
                    35
                ],
                "id": 8363,
                "original_language": "en",
                "original_title": "Superbad",
                "overview": "Two co-dependent high school seniors are forced to deal with separation anxiety after their plan to stage a booze-soaked party goes awry.",
                "popularity": 9.79,
                "poster_path": "/ek8e8txUyUwd2BNqj6lFEerJfbq.jpg",
                "release_date": "2007-08-17",
                "title": "Superbad",
                "video": false,
                "vote_average": 7.258,
                "vote_count": 7673,
                "character": "Quince Danbury",
                "credit_id": "52fe44a2c3a36847f80a16cb",
                "order": 25
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ben T. Best"
        ],
        "biography": "Ben Best was an American actor, writer, musician, and producer.\n\nBest attended the University of North Carolina School of the Arts in Winston-Salem, North Carolina with frequent collaborators Danny McBride, Jody Hill, and David Gordon Green. It was with McBride and Hill that Best co-created the comedy series Eastbound & Down, which ran on HBO for four seasons from 2009 to 2013. Best appeared in eight episodes of the series as Clegg, a local bartender and Kenny's longtime friend.\n\nBest also co-wrote and co-starred with McBride and Hill in the cult indie movie The Foot Fist Way, directed by Hill. He also co-wrote the 2011 period fantasy comedy Your Highness, which starred McBride, James Franco and Natalie Portman, and was directed by Green. it was also Best's last collaboration with McBride. Best’s actor credits also include Superbad, What Happens in Vegas, Observe and Report, and Land of the Lost.\n\nDescription above from the Wikipedia article Ben Best, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1974-09-11",
        "deathday": "2021-09-10",
        "gender": 2,
        "homepage": null,
        "id": 54709,
        "imdb_id": "nm0078897",
        "known_for_department": "Acting",
        "name": "Ben Best",
        "place_of_birth": null,
        "popularity": 0.2056,
        "profile_path": "/xbniXg4bS1xijHTJ3b9jSP90YuU.jpg"
    }
}