{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yYe63HwFBNFDcnWtBm8KR6NSAeg.jpg",
                "genre_ids": [
                    18,
                    10749,
                    10752
                ],
                "id": 409,
                "original_language": "en",
                "original_title": "The English Patient",
                "overview": "In the 1930s, Count Almásy is a Hungarian map maker employed by the Royal Geographical Society to chart the vast expanses of the Sahara Desert along with several other prominent explorers. As World War II unfolds, Almásy enters into a world of love, betrayal, and politics.",
                "popularity": 5.7646,
                "poster_path": "/8eHHqMg8qEYtVw8LQLygsHXSR2q.jpg",
                "release_date": "1996-11-14",
                "title": "The English Patient",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 2287,
                "character": "Katharine Clifton",
                "credit_id": "52fe4240c3a36847f800fb27",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/sra8XnL96OyLHENcglmZJg6HA8z.jpg",
                "genre_ids": [
                    12,
                    28,
                    53
                ],
                "id": 954,
                "original_language": "en",
                "original_title": "Mission: Impossible",
                "overview": "When Ethan Hunt, the leader of a crack espionage team whose perilous operation has gone awry with no explanation, discovers that a mole has penetrated the CIA, he's surprised to learn that he's the prime suspect. To clear his name, Hunt now must ferret out the real double agent and, in the process, even the score.",
                "popularity": 13.5362,
                "poster_path": "/l5uxY5m5OInWpcExIpKG6AR3rgL.jpg",
                "release_date": "1996-05-22",
                "title": "Mission: Impossible",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 9536,
                "character": "Sarah Davies",
                "credit_id": "52fe4293c3a36847f8029521",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/ww9pokP6M6gp2Iu0o3sT5B7eN66.jpg",
                "genre_ids": [
                    12,
                    18,
                    10749
                ],
                "id": 547,
                "original_language": "en",
                "original_title": "The Horse Whisperer",
                "overview": "The mother of a severely traumatized daughter enlists the aid of a unique horse trainer to help the girl's equally injured horse.",
                "popularity": 8.7647,
                "poster_path": "/ptkDeHY2mRJVyNRyxb9TgyAjTYs.jpg",
                "release_date": "1998-02-01",
                "title": "The Horse Whisperer",
                "video": false,
                "vote_average": 6.897,
                "vote_count": 1144,
                "character": "Annie MacLean",
                "credit_id": "52fe4250c3a36847f8014761",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/9NwkPVcLBKMrPKU79XinX73HZNa.jpg",
                "genre_ids": [
                    53,
                    18,
                    10749
                ],
                "id": 10497,
                "original_language": "en",
                "original_title": "Bitter Moon",
                "overview": "A passenger on a cruise ship develops an irresistible infatuation with an eccentric paraplegic's wife.",
                "popularity": 2.9168,
                "poster_path": "/qU9hqUSGyQfbkEdqluX21nWVcp9.jpg",
                "release_date": "1992-09-02",
                "title": "Bitter Moon",
                "video": false,
                "vote_average": 7.108,
                "vote_count": 803,
                "character": "Fiona",
                "credit_id": "52fe437b9251416c75012161",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/7hcoMi2AMRvPC7YnGm41k3Wcgvy.jpg",
                "genre_ids": [
                    18,
                    53,
                    80,
                    9648
                ],
                "id": 10795,
                "original_language": "fr",
                "original_title": "Ne le dis à personne",
                "overview": "A man receives a mysterious email appearing to be from his wife, who was murdered years earlier. As he frantically tries to find out whether she's alive, he finds himself being implicated in her death.",
                "popularity": 4.9671,
                "poster_path": "/fr2wEeO1H8dzx6EDfzYTRBIvZaE.jpg",
                "release_date": "2006-11-01",
                "title": "Tell No One",
                "video": false,
                "vote_average": 7.229,
                "vote_count": 1450,
                "character": "Hélène Perkins, Anne's companion",
                "credit_id": "52fe43b89251416c7501b855",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/ouMbyjN1WJKyRqgvwovGl58e4eR.jpg",
                "genre_ids": [
                    18
                ],
                "id": 33511,
                "original_language": "en",
                "original_title": "Nowhere Boy",
                "overview": "A rebellious teenager, future Beatle John Lennon lives with his Aunt Mimi in working-class mid-1950s Liverpool, England. Mimi's husband suddenly dies, and John spies his mother Julia at the funeral. Despite Mimi's misgivings, John intends to have a real relationship with his mother. Julia introduces him to popular music and the banjo and, though a family conflict looms, young John is inspired to form his own band.",
                "popularity": 3.8807,
                "poster_path": "/1rFcosLtBnGL2ru0IPtwx3QSeKK.jpg",
                "release_date": "2009-12-25",
                "title": "Nowhere Boy",
                "video": false,
                "vote_average": 7.175,
                "vote_count": 834,
                "character": "Mimi Smith",
                "credit_id": "52fe451f9251416c9102838b",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/okAHapFqs7Gx9wI8avrMVXVRUzU.jpg",
                "genre_ids": [
                    18,
                    10752
                ],
                "id": 53457,
                "original_language": "fr",
                "original_title": "Elle s'appelait Sarah",
                "overview": "On the night of 16 July 1942, ten year old Sarah and her parents are being arrested and transported to the Velodrome d'Hiver in Paris where thousands of other jews are being sent to get deported. Sarah however managed to lock her little brother in a closet just before the police entered their apartment. Sixty years later, Julia Jarmond, an American journalist in Paris, gets the assignment to write an article about this raid, a black page in the history of France. She starts digging archives and through Sarah's file discovers a well kept secret about her own in-laws.",
                "popularity": 1.108,
                "poster_path": "/peGUaf6HrX7jSi1HifX64QJb7pm.jpg",
                "release_date": "2010-09-16",
                "title": "Sarah's Key",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 696,
                "character": "Julia Jarmond",
                "credit_id": "52fe4867c3a36847f816582f",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/44e7qs704rSWWGFMhGtPhAvyT8O.jpg",
                "genre_ids": [
                    35,
                    18,
                    9648,
                    53
                ],
                "id": 121875,
                "original_language": "fr",
                "original_title": "Dans la maison",
                "overview": "A sixteen-year-old boy insinuates himself into the house of a fellow student from his literature class and writes about it in essays for his French teacher. Faced with this gifted and unusual pupil, the teacher rediscovers his enthusiasm for his work, but the boy’s intrusion will unleash a series of uncontrollable events.",
                "popularity": 2.7088,
                "poster_path": "/6NCBSCCcyef9aNcABsVGZwuehSC.jpg",
                "release_date": "2012-09-26",
                "title": "In the House",
                "video": false,
                "vote_average": 7.246,
                "vote_count": 877,
                "character": "Jeanne",
                "credit_id": "52fe4a70c3a368484e153319",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/j82SfPOqas5rvHbAHAPq7OgaSir.jpg",
                "genre_ids": [
                    18,
                    10749,
                    10752
                ],
                "id": 271674,
                "original_language": "en",
                "original_title": "Suite Française",
                "overview": "France, 1940. In the first days of occupation, beautiful Lucile Angellier is trapped in a stifled existence with her controlling mother-in-law as they both await news of her husband: a prisoner of war. Parisian refugees start to pour into their small town, soon followed by a regiment of German soldiers who take up residence in the villagers' own homes. Lucile initially tries to ignore Bruno von Falk, the handsome and refined German officer staying with them. But soon, a powerful love draws them together and leads them into the tragedy of war.",
                "popularity": 5.0991,
                "poster_path": "/mPgijY9f79FfD7K8MmzsynXpq0R.jpg",
                "release_date": "2015-03-12",
                "title": "Suite Française",
                "video": false,
                "vote_average": 7.258,
                "vote_count": 1123,
                "character": "Madame Angellier",
                "credit_id": "53801fadc3a368059b0045f1",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/6prkTmEEsB3f9hhKBzUePLe27b2.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 399404,
                "original_language": "en",
                "original_title": "Darkest Hour",
                "overview": "In May 1940, the fate of World War II hangs on Winston Churchill, who must decide whether to negotiate with Adolf Hitler or fight on knowing that it could mean the end of the British Empire.",
                "popularity": 5.4046,
                "poster_path": "/xa6G3aKlysQeVg9wOb0dRcIGlWu.jpg",
                "release_date": "2017-11-22",
                "title": "Darkest Hour",
                "video": false,
                "vote_average": 7.351,
                "vote_count": 5299,
                "character": "Clemmie",
                "credit_id": "57d2ed26c3a36842910015ee",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "크리스틴 스콧 토머스",
            "Кристин Скотт Томас",
            "Kristin Ann Scott Thomas",
            "克莉絲汀·史考特·湯瑪斯",
            "کریستین اسکات توماس",
            "کریستین اسکات تامس",
            "Kristen Scott Thomas",
            "Kristin Scott-Thomas",
            "Dame Kristin Thomas"
        ],
        "biography": "Dame Kristin Ann Scott Thomas (born 24 May 1960) is a British actress. A five-time BAFTA Award and Olivier Award nominee, she won the BAFTA Award for Best Actress in a Supporting Role for Four Weddings and a Funeral (1994) and the Olivier Award for Best Actress in 2008 for the Royal Court revival of The Seagull. She was nominated for the Academy Award for Best Actress in The English Patient (1996).\n\nScott Thomas made her film debut in Under the Cherry Moon (1986), and won the Evening Standard Film Award for Most Promising Newcomer for A Handful of Dust (1988). Her work includes Bitter Moon (1992), Mission: Impossible (1996), The Horse Whisperer (1998), Gosford Park (2001), The Valet (2006), and Tell No One (2007). She won the European Film Award for Best Actress for Philippe Claudel's I've Loved You So Long (2008). Her other films include Leaving (2009), Love Crime (2010), Sarah's Key (2010), Nowhere Boy (2010), The Woman in the Fifth (2011), Only God Forgives (2013), Darkest Hour (2017), and Tomb Raider (2018). On television, she was nominated for a Primetime Emmy Award for her guest appearance in the second season of the comedy series Fleabag (2019), and has starred in the Apple TV+ spy series Slow Horses since 2022.\n\nShe was appointed Officer of the Order of the British Empire (OBE) in the 2003 Birthday Honours and Dame Commander of the Order of the British Empire (DBE) in the 2015 New Year Honours for services to drama. She was named a Chevalier of the Légion d'honneur by the French government in 2005.\n\nScott Thomas was born in Redruth, Cornwall. Her mother, Deborah (née Hurlbatt), was brought up in Hong Kong and Africa, and studied drama before marrying Kristin's father, Lieutenant Commander Simon Scott Thomas, a pilot in the Royal Navy's Fleet Air Arm 893 Squadron, who died in a flying accident on a de Havilland Sea Vixen when Kristin was aged five. She has three siblings, including Serena Scott Thomas. She is the niece of Admiral Sir Richard Thomas (a former Black Rod), the granddaughter of William Scott Thomas (who commanded HMS Impulsive during World War II) and the great-great-niece of the polar explorer Captain Robert Falcon Scott.\n\nThe childhood home of Scott Thomas was in Trent, near Sherborne, Dorset, England. Her mother remarried another Royal Navy pilot, Lieutenant Commander Simon Idiens (of Simon's Sircus aerobatic team flying Sea Vixens), who also died in a flying accident whilst flying a Phantom FG1 from RNAS Yeovilton off the North coast of Cornwall in January 1972. Scott Thomas was educated at Cheltenham Ladies' College and St Antony's Leweston in Sherborne, Dorset.\n\nOn leaving school in 1978, she moved to Hampstead, London, and worked in a department store. She began training to become a drama teacher at the Central School of Speech and Drama, enrolling on a BEd in Speech and Drama. During her time at the school, she requested to switch degree courses to acting but was refused. After a year at Central, speaking French fluently, she decided to move to Paris to work as an au pair,[2] and studied acting at the École Nationale supérieure des arts et techniques du théâtre (ENSATT). When she was 25, she was cast as Mary Sharon in the film Under the Cherry Moon (1986). ...\n\nSource: Article \"Kristin Scott Thomas\" from Wikipedia in English, licensed under CC-BY-SA.",
        "birthday": "1960-05-24",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 5470,
        "imdb_id": "nm0000218",
        "known_for_department": "Acting",
        "name": "Kristin Scott Thomas",
        "place_of_birth": "Redruth, Cornwall, England, UK",
        "popularity": 2.2658,
        "profile_path": "/axksw0vAjBPSW02ZqpcC0V8rPD7.jpg"
    }
}