{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mFt3dvxKugYPgUQgV16M6K2nEtc.jpg",
                "genre_ids": [
                    35
                ],
                "id": 8363,
                "original_language": "en",
                "original_title": "Superbad",
                "overview": "Two co-dependent high school seniors are forced to deal with separation anxiety after their plan to stage a booze-soaked party goes awry.",
                "popularity": 9.79,
                "poster_path": "/ek8e8txUyUwd2BNqj6lFEerJfbq.jpg",
                "release_date": "2007-08-17",
                "title": "Superbad",
                "video": false,
                "vote_average": 7.258,
                "vote_count": 7673,
                "character": "Muffin Selby",
                "credit_id": "52fe44a2c3a36847f80a16f7",
                "order": 36
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "A native of Los Angeles, Rakefet Abergel is an award-winning American/Israeli actor, writer, director, and producer. She appeared in the movie Superbad with Jonah Hill, and as Adam Sandler's sister in Just Go with It . She can also be seen in the films My Best Friend's Girl opposite Dane Cook, with Halle Berry in The Call, and alongside Eddie Murphy & Kerry Washington in the film, A Thousand Words. Rakefet also regularly guest stars on TV shows including Showtime's Shameless, New Girl, My Name is Earl, Bella and the Bulldogs, and iCarly.  Her newest film, Boo, which she wrote, produced, and starred in, is her film directorial debut. Previously she also directed various episodes of a web series called \"Girls on Girls\". The short screenplay for Boo was a finalist in the Best Short Screenplay category at Nightmares Film Festival in Columbus, Ohio and won Best Short Script at Vancouver Bad Ass Film Festival in Canada. It also won an Honorable Mention at Women in Horror Film Festival in Atlanta and was an official selection at over 15 festivals worldwide.  The first film Rakefet wrote was the award-winning horror/thriller short film called Jax in Love, which she co-produced with executive producer & casting director Jory Weitz (Napoleon Dynamite). The film, directed by Oscar-nominated director Colin Campbell made the festival rounds and garnered Abergel ten Best Actress awards from a variety of film festivals including Nightmares Film Festival, Hollywood Horrorfest, GenreBlast Film Festival, and Oregon Scream Week. The film also won Best Horror Short at Hollywood Reel Independent Film Festival and Best Original Screenplay, as well as over 30 awards for various aspects of the film.  She also teaches Hebrew to sixth and seventh graders in Los Angeles and works as an acting coach and mentor for kids and adults at Kid (F)Actor, a company she founded in 2010. Boo is the second production from Cyclamen Films, Rakefet's production company that produced Jax in Love. She is represented across the board at Bohemia Group in LA and New York.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 54717,
        "imdb_id": "nm1679525",
        "known_for_department": "Acting",
        "name": "Rakefet Abergel",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.3308,
        "profile_path": "/lAFQrs1SMhRtBlOiQ2rCV19lVL9.jpg"
    }
}