{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mFt3dvxKugYPgUQgV16M6K2nEtc.jpg",
                "genre_ids": [
                    35
                ],
                "id": 8363,
                "original_language": "en",
                "original_title": "Superbad",
                "overview": "Two co-dependent high school seniors are forced to deal with separation anxiety after their plan to stage a booze-soaked party goes awry.",
                "popularity": 9.79,
                "poster_path": "/ek8e8txUyUwd2BNqj6lFEerJfbq.jpg",
                "release_date": "2007-08-17",
                "title": "Superbad",
                "video": false,
                "vote_average": 7.258,
                "vote_count": 7673,
                "character": "Vagtastic Voyage Girl",
                "credit_id": "52fe44a3c3a36847f80a1713",
                "order": 43
            }
        ],
        "crew": []
    },
    "details": {
        "adult": true,
        "also_known_as": [],
        "biography": "Snow was born and raised in Santa Maria, California, but also spent time in Albuquerque, New Mexico. She started acting at the age of 12, performing in local community and regional theater. Snow entered college at the University of California, Irvine. After her first year of college, she answered an employment advertisement for nude modeling. From there she moved on to pornography. She continued her education but changed her major to business.\n\nDespite her choice of career, she was initially very inexperienced sexually. She had performed in several smaller gonzo porn scenes and pro-am films featured online when she first started, but eventually focused more on traditional, plot-based feature films. Her stage name derives from her two favorite childhood fairy tale characters, Princess Aurora and Snow White. Snow was a contract performer and director for Sin City between May 2003 and May 2005. She made her directorial debut for the company with the film Assploitations.\n\nDespite not using condoms during most of her scenes, Snow came out as one of the few performers in favor of the 2012 Measure B vote in Los Angeles, mandating the use of condoms for all adult movie scenes.\n\nSnow had a relationship with fellow pornographic actor Jay Ashley. In June 2008, she was reported to be seeing writer Richard Abowitz. On April 13, 2012, Snow announced on her official website that she was engaged to an unnamed man who is not former boyfriend Richard Abowitz.\n\nOn September 30, 2013, Snow posted an article on The Daily Beast titled \"A Porn Star’s Letter to Her Unborn Son\" in which she announced she was pregnant with her first child and stated how she would explain her choice to work in the adult film industry to her son once he is older. The letter quickly went viral on the internet. She gave birth to her son, Quentin, on December 10, 2013. Snow announced her marriage on February 15, 2015.",
        "birthday": "1981-11-26",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.aurorasnow.com",
        "id": 54724,
        "imdb_id": "nm0811239",
        "known_for_department": "Acting",
        "name": "Aurora Snow",
        "place_of_birth": "Santa Maria, California, USA",
        "popularity": 1.4,
        "profile_path": "/fLirMzx6OtrdGc4J3mUne6O0edw.jpg"
    }
}