{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mFt3dvxKugYPgUQgV16M6K2nEtc.jpg",
                "genre_ids": [
                    35
                ],
                "id": 8363,
                "original_language": "en",
                "original_title": "Superbad",
                "overview": "Two co-dependent high school seniors are forced to deal with separation anxiety after their plan to stage a booze-soaked party goes awry.",
                "popularity": 9.79,
                "poster_path": "/ek8e8txUyUwd2BNqj6lFEerJfbq.jpg",
                "release_date": "2007-08-17",
                "title": "Superbad",
                "video": false,
                "vote_average": 7.258,
                "vote_count": 7673,
                "character": "Vagtastic Voyage Girl",
                "credit_id": "52fe44a3c3a36847f80a1717",
                "order": 44
            }
        ],
        "crew": []
    },
    "details": {
        "adult": true,
        "also_known_as": [
            "Jenna Haze",
            "Jenna Hayes",
            "詹娜·海兹"
        ],
        "biography": "Jenna Haze is a former porn actor, born in California in February 1982. She began her career in stripping shortly after turning 18. It was through her strip club experiences that she was introduced to Peter North and Craven Moorehead. She decided to appear in Moorehead's movie The Oral Adventures Of Craven Moorehead 8, but Jenna's first porn flick was actually shot the day before, when Joey Silvera shot her for the release of Service Animals 4.\n\nFrom 2002 until 2005, she worked under contract with Jill Kelly Productions and only did girl-on-girl for three years. In 2006, she left JKP and went to work with Jules Jordan Video and also began writing a sex advice column for Fox Magazine. In 2009, she started Jennaration X studios, her production company distributed through Jules Jordan Video.\n\nHaze has won many awards in her career, beginning with AVN's Best New Starlet and Best Solo Sex Scene in 2003. In 2009, She won Female Performer of the Year from AVN, XBIZ, and XRCO. She also won the F.A.M.E. award for Dirtiest Girl in Porn and Favorite oral Starlet. Overall, she has received more than 30 awards in her career and in 2012 was inducted into The Hall Of Fame at both AVN and XBIZ. She appeared in over 570 porn films.",
        "birthday": "1982-02-22",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 54725,
        "imdb_id": "nm1040252",
        "known_for_department": "Acting",
        "name": "Jenna Haze",
        "place_of_birth": "Fullerton, California, USA",
        "popularity": 40.34,
        "profile_path": "/xAF3Yjqp4nA8SJU1PzDc2DTsbRE.jpg"
    }
}