{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9DNDELpVxuLJWMoomgULhhZFoHR.jpg",
                "genre_ids": [
                    28,
                    53,
                    80
                ],
                "id": 8374,
                "original_language": "en",
                "original_title": "The Boondock Saints",
                "overview": "Tired of the crime overrunning the streets of Boston, Irish Catholic twin brothers Conner and Murphy are inspired by their faith to cleanse their hometown of evil with their own brand of zealous vigilante justice. As they hunt down and kill one notorious gangster after another, they become controversial folk heroes in the community. But Paul Smecker, an eccentric FBI agent, is fast closing in on their blood-soaked trail.",
                "popularity": 4.2971,
                "poster_path": "/wtLUmkWg41xFLpvmUWAN1mm65f6.jpg",
                "release_date": "1999-01-22",
                "title": "The Boondock Saints",
                "video": false,
                "vote_average": 7.25,
                "vote_count": 2547,
                "character": "Rocco",
                "credit_id": "52fe44a3c3a36847f80a1a77",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nDavid Della Rocco (Born May 4, 1952) is an Italian-American comedian and actor best known for his supporting role in the 1999 cult film The Boondock Saints, in which he played a character also named David Della Rocco (though usually just called \"Rocco\" and \"Roc\")\n\nDella Rocco brought many of his real-life mannerisms and flair to the character, making an impression on fans and living up to the character's nickname, \"The Funny Man\".\n\nDella Rocco is a friend of The Boondock Saints writer and director Troy Duffy and his role in that movie was written specifically for him. He played the part of a low-life in the mob who helps his two friends, the MacManus brothers, in ridding Boston, MA of criminals and evil.\n\nDavid Della Rocco returns as \"Rocco\" in the sequel The Boondock Saints II: All Saints Day in a dream sequence guiding the MacManus brothers on their mission.\n\nHe is a native of Norwich, Connecticut, and studied acting with the late Susan Peretz in Los Angeles and is also a member of The Actor's Studio.\n\nDescription above from the Wikipedia article David Della Rocco, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1952-05-04",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 54790,
        "imdb_id": "nm0217386",
        "known_for_department": "Acting",
        "name": "David Della Rocco",
        "place_of_birth": "Norwich, Connecticut, USA",
        "popularity": 0.3833,
        "profile_path": "/5ctSDninCKr81JHuokbRn95sjUU.jpg"
    }
}