{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yRKyJJYIzfeiVDHBe4LXguPQCvD.jpg",
                "genre_ids": [
                    14,
                    35
                ],
                "id": 4011,
                "original_language": "en",
                "original_title": "Beetlejuice",
                "overview": "A newly dead New England couple seeks help from a deranged demon exorcist to scare an affluent New York family out of their home.",
                "popularity": 7.6333,
                "poster_path": "/nnl6OWkyPpuMm595hmAxNW3rZFn.jpg",
                "release_date": "1988-03-30",
                "title": "Beetlejuice",
                "video": false,
                "vote_average": 7.371,
                "vote_count": 8053,
                "character": "Receptionist",
                "credit_id": "52fe43abc3a36847f806675b",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            " Patricia Martínez",
            "Patrice Camhi"
        ],
        "biography": "Patrice Martinez (June 12, 1963 - December 25, 2018) was not only a rare beauty, she was a bona fide actress with a strong background in theatre. However, her talents were not only limited to the stage. Her resume manifests a \"well-rounded\" acting career that is complemented by her film and television credits.  Patrice began her career in her early teens, when she was working as an extra in Convoy (1978) starring Kris Kristofferson and directed by Sam Peckinpah. After catching the director's eye, Peckinpah offered her a speaking role.  Still a teenager, Patrice became the lead stage actress for \"La Compania\", a bilingual theatrical repertory company founded by her mother, Margarita Martinez, and her mentor, Jose Rodriguez. Graduating early from high school, this diligent actress followed the footsteps of some very distinguished actors when she decided to seek formal training at the Royal Academy of Dramatic Art in London, one of the world's most prestigious and respected drama schools. Among the 3000 aspiring actors from around the world vying for the only 23 coveted entries that were offered, Patrice was not only chosen but was awarded the sole scholarship of her term. While she studied there some of the alumni included such future stars as Ralph Fiennes, Kenneth Branagh and Mark Addy. Upon her graduation from RADA, she was honored with five of the most prominent awards the academy has to commend.  IMDb Mini Biography By: Select Artists (qv's & corrections by A. Nonymous)",
        "birthday": "1963-06-12",
        "deathday": "2018-12-24",
        "gender": 1,
        "homepage": null,
        "id": 54813,
        "imdb_id": "nm0131773",
        "known_for_department": "Acting",
        "name": "Patrice Martinez",
        "place_of_birth": "Albuquerque, New Mexico, USA",
        "popularity": 0.3456,
        "profile_path": "/FhZmy7Nz2Bz43pJZidl8klK6Gm.jpg"
    }
}