{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yKEe2nFu4fRYcmVdeAwZxTZvP3g.jpg",
                "genre_ids": [
                    99
                ],
                "id": 14048,
                "original_language": "en",
                "original_title": "Man on Wire",
                "overview": "On August 7th 1974, French tightrope walker Philippe Petit stepped out on a high wire, illegally rigged between New York's World Trade Center twin towers, then the world's tallest buildings. After nearly an hour of performing on the wire, 1,350 feet above the sidewalks of Manhattan, he was arrested. This fun and spellbinding documentary chronicles Philippe Petit's \"highest\" achievement.",
                "popularity": 2.7277,
                "poster_path": "/1mS4rhIgHZcHIvf1beP9Av0Ui33.jpg",
                "release_date": "2008-08-01",
                "title": "Man on Wire",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 915,
                "character": "Himself",
                "credit_id": "658f7867efcea97feef9fb06",
                "order": 8
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/lmMVUuu2hHX6qrpcusiuSGU8HaC.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 9587,
                "original_language": "en",
                "original_title": "Little Women",
                "overview": "With their father away as a chaplain in the Civil War, Jo, Meg, Beth and Amy grow up with their mother in somewhat reduced circumstances. They are a close family who inevitably have their squabbles and tragedies. But the bond holds even when, later, male friends start to become a part of the household.",
                "popularity": 3.6035,
                "poster_path": "/1ZzH1XMcKAe5NdrKL5MfcqZHHsZ.jpg",
                "release_date": "1994-12-21",
                "title": "Little Women",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1275,
                "credit_id": "67c61842fded3b516f9219dd",
                "department": "Directing",
                "job": "Second Unit Director"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Mark Lewis is an Australian documentary film and television producer, director and writer. He is famous for his film Cane Toads: An Unnatural History and for his body of work on animals. Unlike many other producers of nature films, his films do not attempt to document the animals in question or their behaviors but rather the complex relationships between people and society and the animals they interact with.\n\nHis films have earned him many awards, including a British Academy Award nomination, a nomination from the Directors Guild of America, two Emmy's for Outstanding Direction in documentary film, and an Emmy Award for Outstanding Science Program on American Television.\n\nAs a student, Lewis helped planning Philippe Petit's famous 1974 high-wire walk between the Twin Towers of the World Trade Center. He talks about his involvement in the acclaimed documentary Man on Wire (2008).  Description above from the Wikipedia article Mark Lewis (filmmaker), licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 548480,
        "imdb_id": "nm0507503",
        "known_for_department": "Directing",
        "name": "Mark Lewis",
        "place_of_birth": "Australia",
        "popularity": 1.4571,
        "profile_path": "/8TWe0m49h32aYk5symCm7mOQ2tw.jpg"
    }
}