{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rahJyvdMruvqUmSLWRQKYS57mx8.jpg",
                "genre_ids": [
                    28,
                    53
                ],
                "id": 562,
                "original_language": "en",
                "original_title": "Die Hard",
                "overview": "NYPD cop John McClane's plan to reconcile with his estranged wife is thrown for a serious loop when, minutes after he arrives at her offices Christmas Party, the entire building is overtaken by a group of terrorists. With little help from the LAPD, wisecracking McClane sets out to single-handedly rescue the hostages and bring the bad guys down.",
                "popularity": 10.081,
                "poster_path": "/aJCpHDC6RoGz7d1Fzayl019xnxX.jpg",
                "release_date": "1988-07-15",
                "title": "Die Hard",
                "video": false,
                "vote_average": 7.801,
                "vote_count": 11674,
                "character": "Hostage",
                "credit_id": "55e08f359251416f960001ef",
                "order": 40
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "کیم مالین"
        ],
        "biography": "Kym Malin (born July 31, 1962) is a former American actress and model. Kym is known for playing Lola in the lowbrow comedy \"Joysticks.\" She had small roles in \"Mike's Murder,\" \"Weird Science,\" \"Die Hard,\" and \"Road House.\" She also acted in four low-budget action flicks for director Andy Sidaris: \"Picasso Trigger,\" \"Guns,\" \"Enemy Gold,\" and \"The Dallas Connection.\"\n\nMalin was born in Dallas, Texas. She was on the diving team in grade school and won the title \"The Most Perfect Body in Texas\" in a local beauty pageant. She was the Playmate of the Month in the May, 1982 issue of \"Playboy.\" Following her \"Playboy\" stint, she acted in a small number of movies. Malin eventually returned to her native Texas and attended community college. She now lives in upstate New York and manages a pediatrician's office.",
        "birthday": "1962-07-31",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 548663,
        "imdb_id": "nm0539639",
        "known_for_department": "Acting",
        "name": "Kym Malin",
        "place_of_birth": "Dallas, Texas, USA",
        "popularity": 1.5584,
        "profile_path": "/t0ONLUlmn4TzfFC8heZiz7dG73M.jpg"
    }
}