{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dwBdfo10gulOpTpmlJMczr5GhZ6.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 374475,
                "original_language": "de",
                "original_title": "Toni Erdmann",
                "overview": "Convinced that his daughter has forgotten how to laugh, a father shows up unannounced while she's living abroad and bombards her with outrageous jokes.",
                "popularity": 2.0717,
                "poster_path": "/v3gf7T8hb8aYv05X2jHmxJQWPZr.jpg",
                "release_date": "2016-07-14",
                "title": "Toni Erdmann",
                "video": false,
                "vote_average": 6.964,
                "vote_count": 1029,
                "character": "Vorarbeiter Ölfeld",
                "credit_id": "5cd083980e0a264a95ff0714",
                "order": 42
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Romanian puppeteer and mime artist. Ioan Brancu graduated in 1994 from the Academia de Teatru și Film, Catedra de teatru de papuși (Academy of Theatre and Film, Department of Puppetry), attended courses organized by Ildikó Kovács and Liviu Matei, and then worked as a puppeteer at the Timișoara Theatre where he played major roles. In 1990, he was taken on by Țăndărică Puppet Theatre (Teatrului Țăndărică, today, Teatrul de animaţie Ţăndărică) in Bucharest, where he performed in Harap Alb (White Harap, 1992), Adunarea păsărilor (The Conference of the Birds, 1993), Sânziana și Pepelea (Sânziana and Pepelea, 1995), Micul Prinț (The Little Prince, 1995), Bastien și Bastienne (Bastien and Bastienne, 1998), Bărbierul din Sevilia (The Barber of Seville, 1998), Ali Baba și cei patruzeci de hoți (Ali Baba and the Forty Thieves, 2001). He also directed several productions among which are Visul (The Dream, 1997), Croitorașul cel isteț (The Clever Little Tailor, 1999), Păcală, Uriașul cel bun și prietenos (The BFG), and Dănilă Prepeleac.\n\nIoan Brancu received the Best Actor Award in Constanța in 1992, and in 1998 in Botoșani he was awarded for his solo performance in Povestea unui ceas cu cuc (The Story of a Cuckoo Clock). He won The Best Original Performance Award for Faust in Prague in 2006 and received the UNITER (Uniunea Teatrală din România Theatre Union of Romania) Special Award for Puppetry in 2008. He teaches puppetry at Universitatea Națională de Artă Teatrală și Cinematografică (UNATC, National University of Theatre Arts and Cinematography) in Bucharest where he has served as Chair of the Puppet Theatre Department since 2009.",
        "birthday": "1950-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 550399,
        "imdb_id": "nm0104426",
        "known_for_department": "Acting",
        "name": "Ioan Brancu",
        "place_of_birth": "Timisoara, Romania",
        "popularity": 0.0286,
        "profile_path": null
    }
}