{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3DOOgeZfoYUKXAyYrpRObv2PNDd.jpg",
                "genre_ids": [
                    18
                ],
                "id": 12761,
                "original_language": "sv",
                "original_title": "Höstsonaten",
                "overview": "After a seven-year absence, Charlotte Andergast travels to Sweden to reunite with her daughter Eva. The pair have a troubled relationship: Charlotte sacrificed the responsibilities of motherhood for a career as a classical pianist. Over an emotional night, the pair reopen the wounds of the past. Charlotte gets another shock when she finds out that her mentally impaired daughter, Helena, is out of the asylum and living with Eva.",
                "popularity": 3.4035,
                "poster_path": "/6beNbtCXv3GkzHkxkGYf38ib7v8.jpg",
                "release_date": "1978-10-08",
                "title": "Autumn Sonata",
                "video": false,
                "vote_average": 7.973,
                "vote_count": 648,
                "character": "Piano Instructor",
                "credit_id": "5f00e80915959f003957865a",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Maria Helena \"Mimi\" Pollak was a Swedish stage and screen actress and director. She attended the Royal Dramatic Theatre school in Stockholm, Sweden, with fellow actress Greta Garbo from 1922 to 1924. It was Mimi that came up with the name Garbo. They became friends for life. Pollak became in 1948 the first contracted female director at the Dramaten with the production of Jean Genet's Jungfruleken (Les Bonnes/The Maids), with Anita Björk and Maj-Britt Nilsson.  Mimi Pollak appeared since her 1922 debut in the film \"Amatörfilmen\" in about 30 feature films and TV productions. She directed and handfull during the 1950's.",
        "birthday": "1903-04-09",
        "deathday": "1999-08-11",
        "gender": 1,
        "homepage": null,
        "id": 550539,
        "imdb_id": "nm0689433",
        "known_for_department": "Acting",
        "name": "Mimi Pollak",
        "place_of_birth": "Karlstad, Värmlands län, Sweden",
        "popularity": 0.194,
        "profile_path": "/bcLWIebH3c2mTxDYVIh7TVcgE94.jpg"
    }
}