{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sPMBiyjTco4JdKojlfGIz5Wd0jC.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 10757,
                "original_language": "hi",
                "original_title": "कभी ख़ुशी कभी ग़म",
                "overview": "Years after his father disowns his adopted brother for marrying a woman of lower social standing, a young man goes on a mission to reunite his family.",
                "popularity": 4.441,
                "poster_path": "/12BvYKueY0eruZuTYIextEZaCC.jpg",
                "release_date": "2001-12-14",
                "title": "Kabhi Khushi Kabhie Gham",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 572,
                "character": "Anjali Sharma Raichand",
                "credit_id": "52fe43b09251416c7501a389",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/zGCnIADWwpjGllYv8DgT8HIuIQl.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 26022,
                "original_language": "hi",
                "original_title": "My Name Is Khan",
                "overview": "Rizwan Khan, a Muslim from the Borivali section of Mumbai, has Asperger's syndrome. He marries a Hindu single mother, Mandira, in San Francisco. After 9/11, Rizwan is detained by authorities at LAX who treat him as a terrorist because of his condition and his race.",
                "popularity": 3.5475,
                "poster_path": "/5Y36lCiNyyV71mjq6LavgiggbhT.jpg",
                "release_date": "2010-02-10",
                "title": "My Name Is Khan",
                "video": false,
                "vote_average": 8.0,
                "vote_count": 1368,
                "character": "Mandira Rathod Khan",
                "credit_id": "52fe44ebc3a368484e03e407",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/rRs4eLjEuUHEVZl0BW4qRckbB4X.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749
                ],
                "id": 19404,
                "original_language": "hi",
                "original_title": "दिलवाले दुल्हनिया ले जायेंगे",
                "overview": "Raj is a rich, carefree, happy-go-lucky second generation NRI. Simran is the daughter of Chaudhary Baldev Singh, who in spite of being an NRI is very strict about adherence to Indian values. Simran has left for India to be married to her childhood fiancé. Raj leaves for India with a mission at his hands, to claim his lady love under the noses of her whole family. Thus begins a saga.",
                "popularity": 9.057,
                "poster_path": "/2CAL2433ZeIihfX1Hb2139CX0pW.jpg",
                "release_date": "1995-10-20",
                "title": "Dilwale Dulhania Le Jayenge",
                "video": false,
                "vote_average": 8.515,
                "vote_count": 4506,
                "character": "Simran Singh",
                "credit_id": "52fe47d69251416c750a71a5",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Kajol Mukherjee",
            "Kajol Devgan",
            "काजोल देवगन",
            "काजोल",
            "काजोल मुखर्जी",
            "카졸",
            "کاجول",
            "کاجُل"
        ],
        "biography": "Kajol (born Kajol Mukherjee, 5 August 1974), also known by her married name Kajol Devgan, is an Indian film actress, who predominantly works in Hindi cinema. Born in Mumbai to the Mukherjee-Samarth family, she is the daughter of actress Tanuja Samarth and late filmmaker Shomu Mukherjee. Regarded as one of India's most successful and highest-paid actresses, Kajol is the recipient of numerous accolades, including six Filmfare Awards, among twelve nominations. Along with her late aunt Nutan, she holds the record for most Best Actress wins at Filmfare, with five. In 2011, the Government of India awarded her with the Padma Shri, the fourth highest civilian honour of the country.\n\nAfter making her acting debut in the 1992 romance Bekhudi, with her mother Kajol had her first commercial success with the 1993 thriller Baazigar. She rose to prominence by featuring as the female lead in five of India's annually top-grossing romances—Yeh Dillagi (1994), Ishq (1997), Pyaar Kiya To Darna Kya (1998), Pyaar To Hona Hi Tha (1998) and Hum Aapke Dil Mein Rehte Hain (1999)—and received wide critical recognition for playing against type in the 1997 mystery film Gupt: The Hidden Truth, that earned her a Filmfare Award for Best Villain, and the 1998 psychological thriller Dushman. Her acclaimed portrayal of a conservative NRI in the blockbuster romance Dilwale Dulhania Le Jayenge (1995), a tomboy in the blockbuster romance Kuch Kuch Hota Hai (1998), a lower middle class Punjabi woman in the blockbuster melodrama Kabhi Khushi Kabhie Gham... (2001), a blind Kashmiri woman in the romantic thriller Fanaa (2006) and a divorced, single mother in the drama My Name Is Khan (2010) garnered her five Filmfare Awards for Best Actress. Following a five-year sabbatical from full-time acting in 2001, Kajol received praise for portraying the lead female roles in the dramas U Me Aur Hum (2008) and We Are Family (2010), and the comedy Dilwale (2015).\n\nIn addition to acting in films, Kajol is a social activist and is noted for her work with widows and children, for which she received the Karmaveer Puraskaar in 2008. She has featured as a talent judge for Zee TV's reality show Rock-N-Roll Family and holds a managerial position at Devgn Entertainment and Software Ltd. Kajol has been married to actor Ajay Devgn since 1999, with whom she has two children.",
        "birthday": "1974-08-05",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 55061,
        "imdb_id": "nm0004418",
        "known_for_department": "Acting",
        "name": "Kajol",
        "place_of_birth": "Mumbai, Maharashtra, India",
        "popularity": 1.8292,
        "profile_path": "/h4m0TkDuEMCUNaPrQxMRyFb2AQ7.jpg"
    }
}