{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zeHB7aP46Xs3u4aFLuAq2GFeUGb.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 455207,
                "original_language": "en",
                "original_title": "Crazy Rich Asians",
                "overview": "An American-born Chinese economics professor accompanies her boyfriend to Singapore for his best friend's wedding, only to get thrust into the lives of Asia's rich and famous.",
                "popularity": 4.7521,
                "poster_path": "/1XxL4LJ5WHdrcYcihEZUCgNCpAW.jpg",
                "release_date": "2018-08-15",
                "title": "Crazy Rich Asians",
                "video": false,
                "vote_average": 7.063,
                "vote_count": 3804,
                "character": "Michael Teo",
                "credit_id": "59396ea2c3a36878ae01092a",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "方展發"
        ],
        "biography": "Pierre Theodore Png Tiang Huat, is a Singaporean actor of Peranakan descent. He is known for starring in multiple Singaporean MediaCorp's Channel 5 and Channel 8's dramas, with recent works include The Gentlemen and When Duty Calls.\n\nEarly in his career, he was known for playing the comedic role of Phua Chu Beng in the long-running sitcom Phua Chu Kang Pte Ltd. He is also known for his role as a troubled and unhappy husband in the 2008 year-end blockbuster period drama The Little Nyonya, and as a villain in 2013 drama The Journey: A Voyage. He co-starred in Hollywood film Crazy Rich Asians (2018).\n\nPng was born on 29 October 1973 in Singapore, and was educated at St Gabriel's Primary School and Holy Innocents' High School.\n\nPng first encountered acting shortly after National Service in his role in the 1998 film Forever Fever. The role piqued his interest in acting, and he enrolled in an acting course. The same year, Png won the Channel 5 talent competition The Fame Awards. Png made his television debut on Phua Chu Kang Pte Ltd, and starred in several other Channel 5 productions. He later began acting in Chinese language dramas on Channel 8 and was nominated for the Most Popular Newcomer Award at the 2001 Star Awards. In 2006 he received his first Best Actor award nomination at the Star Awards 2006 for his role in The Shining Star. Png won the coveted award on his fourth nomination in 2014 for his vicious role Hei Long in MediaCorp's year-end mega-blockbuster The Journey: A Voyage. In 2014, he snared a leading role in the Channel 5 blockbuster drama Zero Calling and clinched the \"Best Actor\" award at the 19th Asian Television Awards (ATA). He co-starred in the Warner Bros. film Crazy Rich Asians, with Constance Wu and Henry Golding. The film marked his Hollywood feature film debut.\n\nPng has gotten 3 out of 10 Top 10 Most Popular Male Artistes from 2012, 2018-2019 respectively.",
        "birthday": "1973-10-29",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 551618,
        "imdb_id": "nm0687771",
        "known_for_department": "Acting",
        "name": "Pierre Png",
        "place_of_birth": "Singapore",
        "popularity": 0.1433,
        "profile_path": "/bOuCGjhZMbWHlvM6grenqOD7dcu.jpg"
    }
}