{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2fmLLKSEzdfk41Iz76ewoKhyWgb.jpg",
                "genre_ids": [
                    35
                ],
                "id": 8469,
                "original_language": "en",
                "original_title": "Animal House",
                "overview": "At a 1962 College, Dean Vernon Wormer is determined to expel the entire Delta Tau Chi Fraternity, but those troublemakers have other plans for him.",
                "popularity": 2.6329,
                "poster_path": "/fWooBbipMRIKeSRhEzmeaDV0T8H.jpg",
                "release_date": "1978-07-28",
                "title": "Animal House",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 1593,
                "character": "Barbara Sue 'Babs' Jansen",
                "credit_id": "52fe44acc3a36847f80a3909",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Out of her hundreds of TV appearances, Martha Smith is perhaps best known as \"Francine Desmond\", intelligence agent (and nemesis of star Kate Jackson) on the CBS series \"Scarecrow and Mrs. King\" (1983). Raised in Farmington, MI, Martha--an honor student with a mention in \"Who's Who of American Students\"--enrolled in Michigan State University at 17 to study psychology. She soon became an in-demand model and spokeswoman, whose travel demands uprooted her from her studies. She was \"discovered\" by a scout for \"Playboy\" magazine, selected as a centerfold (Miss July 1973) and promptly sent back on the road on press junkets. That road led to California. With the support of Universal Studios Contract Department, Martha honed her thespian skills in workshops while appearing in featured TV roles (\"How the West Was Won\" (1978), \"Quincy M.E.\" (1976), \"Charlie's Angels\" (1976), etc.). Her first major film role was in the comedy blockbuster Animal House (1978), where her \"Barbara 'Babs' Jansen\" character, a devious cheerleader, was arch-rival to John Belushi's \"Bluto\". Shortly after, she shared star billing with Debbie Allen in the CBS pilot Ebony, Ivory and Jade (1979) (TV), which marked her professional singing/dancing debut.",
        "birthday": "1952-10-16",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 55197,
        "imdb_id": "nm0006700",
        "known_for_department": "Acting",
        "name": "Martha Smith",
        "place_of_birth": "Cleveland, Ohio, USA",
        "popularity": 0.2493,
        "profile_path": "/AcKcOupv603NFmJYdv14i7w3IMx.jpg"
    }
}