{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2fmLLKSEzdfk41Iz76ewoKhyWgb.jpg",
                "genre_ids": [
                    35
                ],
                "id": 8469,
                "original_language": "en",
                "original_title": "Animal House",
                "overview": "At a 1962 College, Dean Vernon Wormer is determined to expel the entire Delta Tau Chi Fraternity, but those troublemakers have other plans for him.",
                "popularity": 2.6329,
                "poster_path": "/fWooBbipMRIKeSRhEzmeaDV0T8H.jpg",
                "release_date": "1978-07-28",
                "title": "Animal House",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 1593,
                "character": "Stork",
                "credit_id": "52fe44acc3a36847f80a3911",
                "order": 20
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/2fmLLKSEzdfk41Iz76ewoKhyWgb.jpg",
                "genre_ids": [
                    35
                ],
                "id": 8469,
                "original_language": "en",
                "original_title": "Animal House",
                "overview": "At a 1962 College, Dean Vernon Wormer is determined to expel the entire Delta Tau Chi Fraternity, but those troublemakers have other plans for him.",
                "popularity": 2.6329,
                "poster_path": "/fWooBbipMRIKeSRhEzmeaDV0T8H.jpg",
                "release_date": "1978-07-28",
                "title": "Animal House",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 1593,
                "credit_id": "52fe44acc3a36847f80a3a45",
                "department": "Writing",
                "job": "Writer"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Douglas C. Kenney"
        ],
        "biography": "Though almost completely unknown, this man was one of the originators of a highly popular and groundbreaking new form of comedy and satire.  After working on the Harvard Lampoon as an undergraduate, Douglas C. Kenney co-founded the National Lampoon magazine and the National Lampoon Radio Hour.  Kenney had originally collaborated at Harvard with friend, Henry Beard, and founded the National Lampoon, where the two pooled their talents and created a radical new humor magazine. Humor that was sophomoric, rebellious, off-color, vulgar and just plain laceratingly funny.  The Lampoon's humor was considered radical. Not only was the magazine an all-time best seller - particularly the infamous cover of the gun pointed at the family pet: \"If you don't buy this magazine, we'll kill this dog\". Kenney had broadened his comic touch all over. He and other members of the Lampoon had written books - the most popular being the \"1964 High School Yearbook Parody\" in 1974 (co-edited by P.J. O'Rourke). Written like a real yearbook and spoofing all the things that make them almost embarrassing and funny in their own right, Kenney and his cohorts had certainly written a little masterpiece.  Another best-selling classic of his was the cult favorite \"Bored of the Rings\", a humorous little take on Mr. J.R.R. Tolkien's legendary best-seller. The book was a best-seller and thanks to the release of Peter Jackson's Oscar-winning live-action adaptation of the novel trilogy, the book got another printing. Kenney's legacy was living on.  Another piece of his was \"Mrs. Agnew's Diary\", that roasted the Nixon administration.  IMDb Mini Biography By: dane youssef",
        "birthday": "1947-12-10",
        "deathday": "1980-08-27",
        "gender": 2,
        "homepage": null,
        "id": 55199,
        "imdb_id": "nm0448469",
        "known_for_department": "Acting",
        "name": "Douglas Kenney",
        "place_of_birth": "West Palm Beach, Florida, USA",
        "popularity": 0.4936,
        "profile_path": "/dvJgd6LNkT2HGTvoVMUqvkbH7fe.jpg"
    }
}