{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2fmLLKSEzdfk41Iz76ewoKhyWgb.jpg",
                "genre_ids": [
                    35
                ],
                "id": 8469,
                "original_language": "en",
                "original_title": "Animal House",
                "overview": "At a 1962 College, Dean Vernon Wormer is determined to expel the entire Delta Tau Chi Fraternity, but those troublemakers have other plans for him.",
                "popularity": 3.4229,
                "poster_path": "/fWooBbipMRIKeSRhEzmeaDV0T8H.jpg",
                "release_date": "1978-07-28",
                "title": "Animal House",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 1593,
                "character": "Mandy Pepperidge",
                "credit_id": "52fe44acc3a36847f80a3905",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/zvNMZl0l2qYq0x0ntq8sILiIpLw.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 9040,
                "original_language": "en",
                "original_title": "Serpico",
                "overview": "New York cop Frank Serpico blows the whistle on the rampant corruption in the force only to have his comrades turn against him.",
                "popularity": 4.2719,
                "poster_path": "/pRagfd10PPWryFRSzLPIivfAXHJ.jpg",
                "release_date": "1973-12-18",
                "title": "Serpico",
                "video": false,
                "vote_average": 7.534,
                "vote_count": 2057,
                "character": "Sally - Girl at Party (uncredited)",
                "credit_id": "58b46d3dc3a368529701920c",
                "order": 63
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Mary-Louise Weller"
        ],
        "biography": "Lovely, shapely and appealing blonde actress Mary Louise Weller was born on September 1, 1946 and raised in Los Angeles. The onetime top New York model made her film debut with an uncredited tiny role in the superbly gritty cop drama Serpico (1973). Weller was especially memorable as a beautiful marine biologist in the made-for-TV picture Hunters of the Reef (1978) (TV) and, likewise, solid as professor Andrew Prine's college student lover in the superior haunted house horror winner The Evil (1978). Mary achieved her greatest enduring cult movie popularity with her excellent and inspired performance as snooty and uptight sorority snob \"Mandy Pepperidge\" in the uproariously raunchy'n'raucous hit comedy Animal House (1978). After \"Animal House\", Weller went on to play the sole non-suicidal character in The Bell Jar (1979), Martin Kove's fetching wife in the cruddy \"Jaws\" rip-off Blood Tide (1982), Chuck Norris' girlfriend in the exciting martial arts action opus Forced Vengeance (1982) and a funny small part in Larry Cohen's terrific tongue-in-cheek monster-on-the-loose treat Q (1982). Mary had guest spots on the TV shows \"Quincy M.E.\" (1976), \"Fantasy Island\" (1977), \"Supertrain\" (1979), \"CHiPs\" (1977), \"Vega$\" (1978), \"The Hardy Boys/Nancy Drew Mysteries\" (1977), \"B.J. and the Bear\" (1978), \"Kojak\" (1973), \"Starsky and Hutch\" (1975) and \"Baretta\" (1975). Weller voluntarily quit acting in film and television programs in the early 80s. She acted in a bunch of plays in New York and wrote the play \"Four Alone\", which was performed at the Greenhouse Theater in Pasadena. Moreover, Mary trained with the U.S. Equestrian Team as a teenager and has participated in horse-riding competitions. Weller tried to get a movie based on her own original script made about jockey \"Mary Bacon\", but, alas, it never came to be. She's a first cousin to writer Sheila Weller. In 1986, Mary Louise Weller purchased a large three-acre ranch in Malibu, California so she could raise horses.  IMDb Mini Biography By: woodyanders",
        "birthday": "1946-09-01",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 55196,
        "imdb_id": "nm0919875",
        "known_for_department": "Acting",
        "name": "Mary Louise Weller",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.1695,
        "profile_path": "/5SYmsari6g7xNnohwuTJWDLNf8f.jpg"
    }
}