{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kxTWssqcwsHqH6Sj2ivu0FHP5QK.jpg",
                "genre_ids": [
                    28,
                    53,
                    80
                ],
                "id": 11782,
                "original_language": "cn",
                "original_title": "辣手神探",
                "overview": "A cop who loses his partner in a shoot-out with gun smugglers goes on a mission to catch them. In order to get closer to the leaders of the ring he joins forces with an undercover cop who's working as a gangster hitman. They use all means of excessive force to find them.",
                "popularity": 4.5298,
                "poster_path": "/r6lY3VlMAtYyJ4nEsXM1BWdwafs.jpg",
                "release_date": "1992-04-16",
                "title": "Hard Boiled",
                "video": false,
                "vote_average": 7.534,
                "vote_count": 858,
                "character": "Lung",
                "credit_id": "52fe44859251416c75037ad1",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "林保怡",
            "Lâm Bảo Di",
            "Bowie Lam Bo-Yee",
            "Bowie Lam",
            "Lam Bo-Yee",
            "Lin Baoyi",
            "Lin Bao Yi"
        ],
        "biography": "Bowie Lam Bo-Yee (Chinese: 林保怡, born 4 September 1965) is an Hong Kong actor with the TVB network. He has starred in several popular dramas including File of Justice and Healing Hands.\n\nBefore working in entertainment, Lam held other occupations, including serving in the Hong Kong Police Force for a short time. He made his acting debut in 1986 in Kiss Me Goodbye and his singing debut in 1989.\n\nLam's acting career took off after joining the major television network TVB in 1991. His first project was a supporting role in the 1992 drama The Greed of Man, which starred Sean Lau, Vivian Chow, Adam Cheng, and Amy Kwok. The Greed of Man as of 2011 remained one of TVB's highest-rated dramas. After The Greed of Man, Lam was featured in TVB dramas File of Justice (1994–1997), Untraceable Evidence (1997 and 1999), and Healing Hands (1998, 2000, and 2005). His major break-out role is considered the 2004 War and Beauty, which was a huge success in Hong Kong and China.",
        "birthday": "1965-09-04",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.bowielam.com/",
        "id": 552084,
        "imdb_id": "nm0482572",
        "known_for_department": "Acting",
        "name": "Bowie Lam",
        "place_of_birth": "Hong Kong, China",
        "popularity": 1.2302,
        "profile_path": "/7scIX24RyIlibdyeXljnEPjXeKO.jpg"
    }
}