{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6P6YdvJsAZlUZKipA86rbfjfKzD.jpg",
                "genre_ids": [
                    18,
                    10749,
                    35
                ],
                "id": 113947,
                "original_language": "en",
                "original_title": "The Sessions",
                "overview": "Though a childhood bout with polio left him dependent on an iron lung, Mark O'Brien maintains a career as a journalist and poet. A writing assignment dealing with sex and the disabled piques Mark's curiosity, and he decides to investigate the possibility of experiencing sex himself. When his overtures toward a caregiver scare her away, he books an appointment with sex surrogate Cheryl Cohen-Greene to lose his virginity.",
                "popularity": 2.2461,
                "poster_path": "/57o1DBc5DfJXVc8wArAblSbZ8sD.jpg",
                "release_date": "2012-05-02",
                "title": "The Sessions",
                "video": false,
                "vote_average": 6.894,
                "vote_count": 575,
                "character": "Josh",
                "credit_id": "52fe4b42c3a36847f81fa8cf",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "آدام آرکین"
        ],
        "biography": "Adam Arkin (born August 19, 1956) is an American actor and director. His father was the Oscar-winning actor Alan Arkin and his brother is the actor Matthew Arkin. Adam Arkin is known for playing the role of Aaron Shutt on Chicago Hope. He has been nominated for numerous awards, including a Tony (Best Actor, 1991, I Hate Hamlet) as well as three primetime Emmys, four SAG Awards (Ensemble, Chicago Hope), and a DGA Award (My Louisiana Sky). Beginning in 1990, he had a recurring guest role on Northern Exposure playing the angry, paranoid Adam, for which he received an Emmy nomination. In 2002, Arkin won a Daytime Emmy for Outstanding Directing in a Children's Special for My Louisiana Sky. Between 2007 and 2009, he co-starred in the drama series Life. In 2009, he portrayed villain Ethan Zobelle, a white separatist gang leader, in Sons of Anarchy, and Principal Ed Gibb in 8 Simple Rules (2003–2005).",
        "birthday": "1956-08-19",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 55257,
        "imdb_id": "nm0035060",
        "known_for_department": "Acting",
        "name": "Adam Arkin",
        "place_of_birth": "Brooklyn, New York City, New York, USA",
        "popularity": 1.0743,
        "profile_path": "/66CugPTyelfdtYe0IV0U0LQP1sA.jpg"
    }
}