{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dxXhdYuQyuMPX0lCEo6LhCv69Xq.jpg",
                "genre_ids": [
                    18
                ],
                "id": 13416,
                "original_language": "en",
                "original_title": "Friday Night Lights",
                "overview": "A small, turbulent town in Texas obsesses over their high school football team to an unhealthy degree. When the star tailback, Boobie Miles, is seriously injured during the first game of the season, all hope is lost, and the town's dormant social problems begin to flare up. It is left to the inspiring abilities of new coach Gary Gaines to instill in the other team members -- and, by proxy, the town itself -- a sense of self-respect and honor.",
                "popularity": 3.1459,
                "poster_path": "/8HIqpOgqShRc3TAleabnYispDl1.jpg",
                "release_date": "2004-10-08",
                "title": "Friday Night Lights",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 594,
                "character": "Booster",
                "credit_id": "62ebd9c6f1b5710059583e59",
                "order": 26
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Eloise Schmitt",
            "Eloise Lucille Broady",
            "Eloise Broady",
            "Elois Dejoria"
        ],
        "biography": "Texas native Eloise DeJoria made her film debut in Songwriter, starring Willie Nelson. Other feature credits include Weekend at Bernie's, Grand Champion, Don't Mess with the Zohan, Wall Street (Money Never Sleeps), and Wild Hearts. Her latest picture, When Angels Sing, based on Turk Pipkin's classic Christmas story, stars Texas greats Willie Nelson, Lyle Lovett, Marcia Ball, Kris Kristofferson, and Harry Connick, Jr. (from next-door Louisiana). The movie was directed by Tim McCanlies, and was produced by Austinites Elizabeth Avelan, Shannon Macintosh and Fred Miller.\n\nEloise's lifestyle has been featured on 20/20 with Barbara Walters, \"E\" Entertainment, and in many national and international publications. She is widely recognized as the spokes model for Paul Mitchell Hair care products in television and print ads. Her number one priority and joy is raising John Anthony, her 14 year-old son with John Paul De Joria, and being mother and grandmother to their large combined family. She enjoys the outdoors, staying fit, and eating healthy.\n\nEloise is proud of her work at The Arbor Recovery Center in Georgetown, Texas, where she partners with her son Justin and recovery expert Jim Walker. She loves her time spent with eldest son Michael, who lives nearby with his family and works in the family business, John Paul Pet.\n\nShe is also known for her contributions and charitable work with local groups including Help Clifford Help Kids, The Palmer Drug Abuse Program, The Austin Recovery Center, The Austin Children's Shelter, Helping Hands, as well as Club 100, Long Center for the Performing Arts, The Paramount Theater, and The Austin Film Society.\n\n- IMDb Mini Biography",
        "birthday": "1957-05-13",
        "deathday": null,
        "gender": 1,
        "homepage": "http://eloisedejoria.com/Eloise_DeJoria.html",
        "id": 55269,
        "imdb_id": "nm0110433",
        "known_for_department": "Acting",
        "name": "Eloise DeJoria",
        "place_of_birth": "Houston, Texas, USA",
        "popularity": 1.1098,
        "profile_path": "/mre6wCVreehNG2Zzh8qwGkOuR4x.jpg"
    }
}