{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/AuV99eQivVWuk2AOSM6hYh9QRPQ.jpg",
                "genre_ids": [
                    12,
                    10751,
                    14
                ],
                "id": 411,
                "original_language": "en",
                "original_title": "The Chronicles of Narnia: The Lion, the Witch and the Wardrobe",
                "overview": "Siblings Lucy, Edmund, Susan and Peter step through a magical wardrobe and find the land of Narnia. There, they discover a charming, once peaceful kingdom that has been plunged into eternal winter by the evil White Witch, Jadis. Aided by the wise and magnificent lion, Aslan, the children lead Narnia into a spectacular, climactic battle to be free of the Witch's glacial powers forever.",
                "popularity": 29.0165,
                "poster_path": "/iREd0rNCjYdf5Ar0vfaW32yrkm.jpg",
                "release_date": "2005-12-07",
                "title": "The Chronicles of Narnia: The Lion, the Witch and the Wardrobe",
                "video": false,
                "vote_average": 7.133,
                "vote_count": 11077,
                "character": "Edmund Pevensie",
                "credit_id": "52fe4240c3a36847f800fccd",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Скандар Кейнс",
            "Alexander Keynes",
            "اسکندر کینز",
            "Alexander Amin Casper Keynes"
        ],
        "biography": "Alexander Amin Caspar \"Skandar\" Keynes (born 5 September 1991) is an English political advisor and former actor. He is best known for starring as Edmund Pevensie in The Chronicles of Narnia (2005 - 2010) film series. Keynes is the son of British author, Randal Keynes, and the great-great-great-grandson of revolutionary biologist, Charles Darwin.\n\nIn January 2015, Keynes completed a three-month internship at the United Nations High Commissioner for Refugees. In January 2016, Keynes announced his retirement from acting. Keynes then worked at the House of Commons of the Parliament of the United Kingdom as a parliamentary adviser to Crispin Blunt, a British Conservative MP and former Chair of the Foreign Affairs Select Committee (2015-2017), until January 2018. Since then, Keynes has been working as a political adviser.",
        "birthday": "1991-09-05",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 5527,
        "imdb_id": "nm1342727",
        "known_for_department": "Acting",
        "name": "Skandar Keynes",
        "place_of_birth": "Camden, London, England, UK",
        "popularity": 1.3665,
        "profile_path": "/pIdgY16c6AzmCD31pXlCR9SjLlM.jpg"
    }
}