{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5PfHGXosySGs0l1JfeREspy3v6G.jpg",
                "genre_ids": [
                    878,
                    28,
                    12
                ],
                "id": 1924,
                "original_language": "en",
                "original_title": "Superman",
                "overview": "Mild-mannered Clark Kent works as a reporter at the Daily Planet alongside his crush, Lois Lane. Clark must summon his superhero alter-ego when the nefarious Lex Luthor launches a plan to take over the world.",
                "popularity": 9.8184,
                "poster_path": "/d7px1FQxW4tngdACVRsCSaZq0Xl.jpg",
                "release_date": "1978-12-14",
                "title": "Superman",
                "video": false,
                "vote_average": 7.155,
                "vote_count": 4067,
                "character": "Perry White",
                "credit_id": "52fe4322c3a36847f803ce25",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "John Cooper Jr.",
            "Джеки Купер",
            "Джекки Купер"
        ],
        "biography": "Jackie Cooper (September 15, 1922 –May 3, 2011) was an American actor. He is best known for his role of Perry White in the Christopher Reeves Superman films (1978–1987).\n\nHe with the Navy in the South Pacific toward the end of World War  II and then, quietly and without publicity or fanfare, compiled one of the most distinguished peacetime military careers of anyone in his  profession. In 1961, as his weekly TV series Hennesey  (1959) was enhancing naval recruiting efforts, accepted a commission as  a line officer in the Naval Reserve with duties in recruitment,  training films, and public relations.  Holder of a multi-engine pilot  license, he later co-piloted jet planes for the Navy, which made him an  Honorary Aviator authorized to wear wings of gold-at the time only the  third so honored in naval aviation history. By 1976 he had attained the  rank of captain, and was in uniform aboard the carrier USS Constellation for the Bicentennial celebration on July 4. In 1980, the Navy proposed a  period of active duty at the Pentagon that would have resulted in a  promotion to rear admiral, bringing him even with Air Force Reserve  Brigadier General James Stewart.  Fresh on the heels of a second directing Emmy, he felt his absence  would impact achieving a long-held goal of directing motion pictures,  and reluctantly declined. (The opportunity in films never materialized.)  Holds Letters of Commendation from six secretaries of the Navy. Was  honorary chairman of the U.S. Navy Memorial Foundation and a charter  member of VIVA, the effort to return POW-MIAs from Vietnam. Upon  retirement in 1982, he was decorated with the Legion of Merit by Navy  Secretary John F. Lehman Jr.. Other than Stewart, no performer in his industry has achieved a higher uniformed rank in the U.S. military. (Glenn Ford was also a Naval Reserve captain, and director and Captain John Ford was awarded honorary flag rank upon his 1951 retirement from the Naval Reserve).",
        "birthday": "1922-09-15",
        "deathday": "2011-05-03",
        "gender": 2,
        "homepage": null,
        "id": 55278,
        "imdb_id": "nm0178114",
        "known_for_department": "Acting",
        "name": "Jackie Cooper",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 1.1096,
        "profile_path": "/fl5lxpTZZGnMmZZj8F68BtLY5Ii.jpg"
    }
}