{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tUVVEGe16K5hfN7jH5MhJYjbCt2.jpg",
                "genre_ids": [
                    10751,
                    36,
                    18
                ],
                "id": 418680,
                "original_language": "en",
                "original_title": "Goodbye Christopher Robin",
                "overview": "The behind the scenes story of the life of A.A. Milne and the creation of the Winnie the Pooh stories inspired by his son Christopher Robin.",
                "popularity": 4.7515,
                "poster_path": "/a6IK3hMlUHzXZZVLBTh0WZ5KoAb.jpg",
                "release_date": "2017-09-29",
                "title": "Goodbye Christopher Robin",
                "video": false,
                "vote_average": 7.038,
                "vote_count": 861,
                "character": "Military Medic",
                "credit_id": "59f7ef6cc3a3686058006dda",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Jim Cartwright was born in Farnworth, Lancashire in 1958 and educated at Harper Green Secondary Modern School, Farnworth.\n\nHis plays are consistently performed around the world, where they have won numerous awards, and been translated into 30 languages. His first play, Road (1986), opened at the Royal Court in 1986, and was subsequently revived that same year and again in 1987, before being taken on a nationwide tour. Road won the Samuel Beckett Award, Drama Magazine’s Best New Play Award, and was joint winner of the Plays And Players Award and The George Devine Award.  \n\nJim made his directorial debut with Road at The Royal Exchange Theatre in 1995.  He also wrote and directed I Licked a Slag’s Deodorant (1996), for the Royal Court at The Ambassador’s Theatre in London’s West End in 1996; Prize Night  for the Royal Exchange Theatre (1999), and Hard Fruit (2000) for the Royal Court Theatre in 2000. Jim’s radio work includes: Baths (BBC, 1987).  His television work includes: Road (BBC, 1987, winner of The Golden Nymph Award for best film); Vroom (Channel 4, 1988, selected as centrepiece at The London Film Festival); Wedded (BBC, 1990), and June (BBC, 1990).  Jim produced and wrote Village (Channel 4, 1996); two films, Strumpet and Vacuuming Completely Nude In Paradise (BBC, 2001); and wrote and directed Johnny Shakespeare (BBC, 2007).",
        "birthday": "1958-06-27",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 55301,
        "imdb_id": "nm0142179",
        "known_for_department": "Writing",
        "name": "Jim Cartwright",
        "place_of_birth": "Farnworth, Lancashire, UK",
        "popularity": 0.0614,
        "profile_path": null
    }
}