{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fCf8WfsRJEDFf1N6gA6o4ICRYp.jpg",
                "genre_ids": [
                    16,
                    12,
                    35,
                    80
                ],
                "id": 15371,
                "original_language": "ja",
                "original_title": "ルパン三世 カリオストロの城",
                "overview": "After a successful robbery leaves famed thief Lupin the Third and his partner Jigen with nothing but a large amount of expertly crafted counterfeit bills, he decides to track down the forgers responsible—and steal any other treasures he may find in the Castle of Cagliostro, including the 'damsel in distress' he finds imprisoned there.",
                "popularity": 5.3386,
                "poster_path": "/hSFdyWptoDHuXlFZGzIrfVell4Q.jpg",
                "release_date": "1979-07-06",
                "title": "Lupin the Third: The Castle of Cagliostro",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 1077,
                "character": "Japanese Delegate (voice)",
                "credit_id": "52fe46529251416c75074a11",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "野島 昭生",
            "Нодзима, Акио",
            "Акіо Ноджіма",
            "Ноджіма, Акіо",
            "のじま あきお",
            "Nojima, Akio"
        ],
        "biography": "Akio Nojima (野島 昭生, Nojima Akio, born April 6, 1945) is a Japanese actor, voice actor and narrator from Nishitōkyō, Tokyo. His sons, Hirofumi Nojima and Kenji Nojima, are voice actors and his other son Satoshi is a nature writer. His grandson (Kenji's eldest son) is the actor Toya Nojima. He is affiliated with Sigma Seven.\n\nAkio was born in Fushun, Manchuria, Republic of China. His father was drafted into the army and killed in action 40 days after his birth, just a month before the end of World War II. After the end of the war, his mother and his older sister were brought back to Japan, where they lived in an apartment in the Suginami Ward, Nishitōkyō, Tokyo.",
        "birthday": "1945-04-06",
        "deathday": null,
        "gender": 2,
        "homepage": "https://sigma7.co.jp/actors/nojima_akio/",
        "id": 553097,
        "imdb_id": "nm0634177",
        "known_for_department": "Acting",
        "name": "Akio Nojima",
        "place_of_birth": "Fushun, Manchuria",
        "popularity": 0.2768,
        "profile_path": "/wnn1WSwcZARCKlM54FLwbhkSs8W.jpg"
    }
}