{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hjWxngV6tidwDkfJDEgMjHD2KEz.jpg",
                "genre_ids": [
                    18
                ],
                "id": 976893,
                "original_language": "ja",
                "original_title": "PERFECT DAYS",
                "overview": "Hirayama is content with his life as a toilet cleaner in Tokyo. Outside of his structured routine, he cherishes music on cassette tapes, books, and taking photos of trees. Through unexpected encounters, he reflects on finding beauty in the world.",
                "popularity": 6.6191,
                "poster_path": "/mjEk5Wwx6TYVqw29zSaUHclMIgp.jpg",
                "release_date": "2023-11-10",
                "title": "Perfect Days",
                "video": false,
                "vote_average": 7.767,
                "vote_count": 1590,
                "character": "Sato",
                "credit_id": "65742ee6a84a4700fe0ddcfe",
                "order": 41
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            " 安藤玉恵",
            "Tamae Andou",
            "안도 타마에",
            "安藤 玉恵",
            "Tamae Andoh",
            "Tamae Andō",
            "Tamae Andô"
        ],
        "biography": "Tamae Ando is an actress born on August 8, 1976, in Arakawa, Tokyo. She is married to Kuro Tanino, a theater playwright and director associated with the theater group \"Niwa Gekidan Penino\". The couple has one child. She's been active as an actress since 2001. She is part of the talent agency MASH.\n\nShe was born as the daughter of a tonkatsu restaurant called \"Donpei\" which has appeared in the drama \"Kodoku no Gurume\". She graduated from Ogu Miyamae Elementary School, Ogu Hachiman Junior High School, and The Second Nihon University High School. Aspiring to become a diplomat, she entered Sophia University's department of Foreign Languages but dropped out. She went on to graduate from Waseda Universities department of Literature.\n\nFollowing her graduation, she joined the theater company \"Pots Doll\" and began working as an actress. She caught the eye of director Hiroki Ryuichi and was cast in her first film, 2003's \"Vibrator\". Following her 2003 movie debut, 2004 saw her appearing in her first drama. She left \"Pots Doll\" in 2007 but still appears in stage productions with her most recent appearance occurring in 2015.",
        "birthday": "1976-08-08",
        "deathday": null,
        "gender": 1,
        "homepage": "https://mash-info.com/profile/t_ando.html",
        "id": 553809,
        "imdb_id": "nm2429393",
        "known_for_department": "Acting",
        "name": "Tamae Ando",
        "place_of_birth": "Nishiogu, Tokyo, Japan",
        "popularity": 0.8411,
        "profile_path": "/q5orVhvKOFZbr6JkqKt07rJdY2U.jpg"
    }
}