{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/l53K8Fp1WcOMRL33CMsnnMUPiWg.jpg",
                "genre_ids": [
                    80,
                    18,
                    53
                ],
                "id": 77016,
                "original_language": "en",
                "original_title": "End of Watch",
                "overview": "Two young officers are marked for death after confiscating a small cache of money and firearms from the members of a notorious cartel during a routine traffic stop.",
                "popularity": 6.1774,
                "poster_path": "/pDeVKQICkcdwwjHxGj0MeS14YJ6.jpg",
                "release_date": "2012-09-20",
                "title": "End of Watch",
                "video": false,
                "vote_average": 7.352,
                "vote_count": 3429,
                "character": "Mr. Tre",
                "credit_id": "52fe4957c3a368484e12695d",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/n2wlMpTuiovYCZHpwKtbSTY8Wor.jpg",
                "genre_ids": [
                    10752,
                    28,
                    18
                ],
                "id": 9567,
                "original_language": "en",
                "original_title": "Tears of the Sun",
                "overview": "Navy SEAL Lieutenant A.K. Waters and his elite squadron of tactical specialists are forced to choose between their duty and their humanity, between following orders by ignoring the conflict that surrounds them, or finding the courage to follow their conscience and protect a group of innocent refugees. When the democratic government of Nigeria collapses and the country is taken over by a ruthless military dictator, Waters, a fiercely loyal and hardened veteran is dispatched on a routine mission to retrieve a Doctors Without Borders physician.",
                "popularity": 5.5527,
                "poster_path": "/fszAQ7bEuO3cLTXZUSXCas28MgE.jpg",
                "release_date": "2003-03-07",
                "title": "Tears of the Sun",
                "video": false,
                "vote_average": 6.889,
                "vote_count": 2468,
                "character": "Mission Rebel",
                "credit_id": "57a18e7ac3a36847a5005d3b",
                "order": 25
            },
            {
                "adult": false,
                "backdrop_path": "/nuO8o9ltxhI7AZQxePavEZ4TyHa.jpg",
                "genre_ids": [
                    28,
                    80,
                    18
                ],
                "id": 2034,
                "original_language": "en",
                "original_title": "Training Day",
                "overview": "On his first day on the job as a narcotics officer, a rookie cop works with a rogue detective who isn't what he appears.",
                "popularity": 7.3082,
                "poster_path": "/bUeiwBQdupBLQthMCHKV7zv56uv.jpg",
                "release_date": "2001-10-05",
                "title": "Training Day",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 6242,
                "character": "Bone",
                "credit_id": "6069ca47d48cee0078ac6fe4",
                "order": 32
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Cle 'Bone' Sloan",
            "Cle 'Shiheed' Sloan",
            "Shiheed 'Bone' Sloan",
            "Cle Shaheed Sloan"
        ],
        "biography": "Cle Shaheed Sloan (born May 22, 1969), aka \"Bone\", is an American director, actor  and activist from Los Angeles, California, USA. While still a member of Athens Park Bloods, a Los Angeles street gang, Sloan worked to reform gang culture to put an end to gang violence from the inside.  Sloan was introduced to the film industry by football legend Jim Brown, who helped him secure a job as an assistant when he was released from prison. The job allowed Sloan to meet director Antoine Fuqua and sparked his interest in becoming a cinematographer. Sloan has since worked on two of Fuqua's hit movies Training Day and Tears of the Sun. During the production of Training Day, Sloan worked as a gang adviser and helped persuade actual gang members to lend their credibility to the project on-screen.\n\nHe has also directed and appears in the 2006 documentary film Bastards of the Party which appeared at the 2005 Tribeca Film Festival and at the 2006 Hollywood Black Film Festival. Bastards of the Party aired on HBO on February 6, 2007.\n\nHe was featured on Bill O'Reilly's The O'Reilly Factor and Anderson Cooper 360º speaking out against gang violence on behalf of his non profit organization AKTIVE which is helping to \"Change the gangs from the inside\" by working with active gang members in communities nationwide. Recently, he starred in the 2008 film Street Kings (originally titled The Night Watchman) which also features Forrest Whitaker, Common, and Keanu Reeves.  Description above from the Wikipedia article Cle Shaheed Sloan, licensed under CC-BY-SA,full list of contributors on Wikipedia.   ",
        "birthday": "1969-05-22",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 55394,
        "imdb_id": "nm0805944",
        "known_for_department": "Acting",
        "name": "Cle Sloan",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.5329,
        "profile_path": null
    }
}