{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/59vDC1BuEQvti24OMr0ZvtAK6R1.jpg",
                "genre_ids": [
                    14,
                    12,
                    16,
                    10751
                ],
                "id": 10191,
                "original_language": "en",
                "original_title": "How to Train Your Dragon",
                "overview": "As the son of a Viking leader on the cusp of manhood, shy Hiccup Horrendous Haddock III faces a rite of passage: he must kill a dragon to prove his warrior mettle. But after downing a feared dragon, he realizes that he no longer wants to destroy it, and instead befriends the beast – which he names Toothless – much to the chagrin of his warrior father.",
                "popularity": 14.8861,
                "poster_path": "/ygGmAO60t8GyqUo9xYeYxSZAR3b.jpg",
                "release_date": "2010-03-18",
                "title": "How to Train Your Dragon",
                "video": false,
                "vote_average": 7.852,
                "vote_count": 13770,
                "character": "Phlegma the Fierce (Voice)",
                "credit_id": "52fe433e9251416c7500908d",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/2wiMb1RBskEW9Uml5bGDEUHFbv8.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749
                ],
                "id": 254320,
                "original_language": "en",
                "original_title": "The Lobster",
                "overview": "In a dystopian near future, single people, according to the laws of The City, are taken to The Hotel, where they are obliged to find a romantic partner in forty-five days or are transformed into animals and sent off into The Woods.",
                "popularity": 5.0449,
                "poster_path": "/7Y9ILV1unpW9mLpGcqyGQU72LUy.jpg",
                "release_date": "2015-10-15",
                "title": "The Lobster",
                "video": false,
                "vote_average": 7.043,
                "vote_count": 6544,
                "character": "Biscuit Woman",
                "credit_id": "5548dd309251415602002359",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/nHNNKoqQOIWODk5mMyW8CvDisem.jpg",
                "genre_ids": [
                    10751,
                    10749,
                    35
                ],
                "id": 512895,
                "original_language": "en",
                "original_title": "Lady and the Tramp",
                "overview": "The love story between a pampered Cocker Spaniel named Lady and a streetwise mongrel named Tramp. Lady finds herself out on the street after her owners have a baby and is saved from a pack by Tramp, who tries to show her to live her life footloose and collar-free.",
                "popularity": 3.6637,
                "poster_path": "/8wBEye516IKul9sW7JKGcFXVGfV.jpg",
                "release_date": "2019-11-12",
                "title": "Lady and the Tramp",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 1603,
                "character": "Jock (voice)",
                "credit_id": "5b5a310c9251411a6800327d",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/h3KN24PrOheHVYs9ypuOIdFBEpX.jpg",
                "genre_ids": [
                    16,
                    10751,
                    12
                ],
                "id": 166428,
                "original_language": "en",
                "original_title": "How to Train Your Dragon: The Hidden World",
                "overview": "As Hiccup fulfills his dream of creating a peaceful dragon utopia, Toothless’ discovery of an untamed, elusive mate draws the Night Fury away. When danger mounts at home and Hiccup’s reign as village chief is tested, both dragon and rider must make impossible decisions to save their kind.",
                "popularity": 13.5628,
                "poster_path": "/xvx4Yhf0DVH8G4LzNISpMfFBDy2.jpg",
                "release_date": "2019-01-03",
                "title": "How to Train Your Dragon: The Hidden World",
                "video": false,
                "vote_average": 7.75,
                "vote_count": 6803,
                "character": "Phlegma (voice)",
                "credit_id": "5c6d150f925141250a0f1fd0",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ashley Jenson",
            "阿什利·詹森"
        ],
        "biography": "Ashley Jensen (born August 11, 1969) is a Scottish actress. She is best known for her roles as Maggie Jacobs in Extras (2005–2007, for which she was nominated for an Emmy Award), Christina McKinney in Ugly Betty (2006–2010), Agatha Raisin in Agatha Raisin (2014–present), and DI Ruth Calder in Shetland (2023–present). Jensen trained in Drama at Edinburgh’s Queen Margaret University.\n\nHer first significant television role was as Clare Donnelly, daughter of Glasgow criminal Jo-Jo Donnelly (played by Billy Connolly) in the 1993 BBC drama Down Among the Big Boys. In 1994, she played eccentric secretary Rosie McConnichy in the final series of BBC comedy May to December, as a replacement for the character of secretary Hilary (Rebecca Lacey), and Heather in Roughnecks, a BBC television series about workers on a North Sea oil platform. Jensen had a small role in a Dangerfield episode \"Contact\" as the mother of a young girl with meningitis. She then appeared as Fiona Morris in EastEnders. She also appeared in the 2003 BBC drama Two Thousand Acres of Sky.\n\nJensen co-starred alongside Ricky Gervais in the BBC Two/HBO television programme Extras as the socially inept Maggie Jacobs. For her work on the first series, she received best television comedy actress and newcomer awards at the 2005 British Comedy Awards. In 2006, Jensen received two British Comedy Awards and a BAFTA nomination for her role in Extras. Her role in the 2007 Christmas Special earned her an Emmy Award nomination. In January 2006 she starred in the short-lived drama series Eleventh Hour on ITV. Later that year she played Steve Coogan's agent in A Cock and Bull Story. In 2007, she provided the narration for the film Taking Liberties.\n\nIn 2014, she played the eponymous lead character in the television film adaptation of the M. C. Beaton novel Agatha Raisin and the Quiche of Death for Sky1. She also starred in the eight-part series that first aired on Sky1 on 7 June 2016.\n\nIn 2017, she starred in a six-part TV series for BBC TV, Love, Lies & Records, depicting the gritty life and entwined storylines working in Leeds Registry Office. In March 2019, Jensen reunited with Gervais in the Netflix black comedy series After Life, a role she continued for all three series. In April 2019 she played Debbie Dorell in the second series of BBC TV drama Trust Me. When an injured soldier discovers patients in his hospital ward dying, he attempts to investigate the suspicious deaths. Also in 2019, she played the voice of Jacqueline in Lady and the Tramp.",
        "birthday": "1969-08-11",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.independenttalent.com/actors/ashley-jensen/",
        "id": 55398,
        "imdb_id": "nm0421332",
        "known_for_department": "Acting",
        "name": "Ashley Jensen",
        "place_of_birth": "Annan, Dumfries and Galloway, Scotland, UK",
        "popularity": 0.752,
        "profile_path": "/iDewhUriZzdJ2vbehTQD5cxi1yv.jpg"
    }
}