{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9TDi0FPOSAePfVLZXAUgFZhiMLf.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 903,
                "original_language": "en",
                "original_title": "Cool Hand Luke",
                "overview": "When petty criminal Luke Jackson is sentenced to two years in a Florida prison farm, he doesn't play by the rules of either the sadistic warden or the yard's resident heavy, Dragline, who ends up admiring the new guy's unbreakable will. Luke's bravado, even in the face of repeated stints in the prison's dreaded solitary confinement cell, \"the box,\" make him a rebel hero to his fellow convicts and a thorn in the side of the prison officers.",
                "popularity": 2.5158,
                "poster_path": "/4ykzTiHKLamh3eZJ8orVICtU2Jp.jpg",
                "release_date": "1967-11-01",
                "title": "Cool Hand Luke",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 1506,
                "character": "Gambler",
                "credit_id": "57c7083592514138af002da1",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Уэйн Роджерс"
        ],
        "biography": "William Wayne McMillan Rogers III (April 7, 1933 — December 31, 2015) was an American film and television actor, best known for playing the role of 'Trapper John' McIntyre in the U.S. television series, MASH. He succeeded Elliott Gould, who had played the character in the Robert Altman movie MASH, and was himself succeeded by Pernell Roberts on the MASH spin-off Trapper John, M.D. He was a regular panel member on the FOX News stock investment television program Cashin' In, as a result of having built a highly successful and lucrative second career as an investor, investment strategist and advisor, and money manager.\n\nDescription above from the Wikipedia article Wayne Rogers, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1933-04-07",
        "deathday": "2015-12-31",
        "gender": 2,
        "homepage": null,
        "id": 55423,
        "imdb_id": "nm0737257",
        "known_for_department": "Acting",
        "name": "Wayne Rogers",
        "place_of_birth": "Birmingham, Alabama, USA",
        "popularity": 0.281,
        "profile_path": "/z72kXlcjSQKOqrFJbfNjxWicHwr.jpg"
    }
}