{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zTxHf9iIOCqRbxvl8W5QYKrsMLq.jpg",
                "genre_ids": [
                    12,
                    35,
                    14
                ],
                "id": 512200,
                "original_language": "en",
                "original_title": "Jumanji: The Next Level",
                "overview": "As the gang return to Jumanji to rescue one of their own, they discover that nothing is as they expect. The players will have to brave parts unknown and unexplored in order to escape the world’s most dangerous game.",
                "popularity": 10.2184,
                "poster_path": "/4kh9dxAiClS2GMUpkRyzGwpNWWX.jpg",
                "release_date": "2019-12-04",
                "title": "Jumanji: The Next Level",
                "video": false,
                "vote_average": 6.888,
                "vote_count": 9017,
                "character": "Cavendish",
                "credit_id": "5ded2f7285da120017491fe7",
                "order": 29
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "John Ross Bowie (born May 30, 1971) is an American actor and comedian best known for playing Barry Kripke in The Big Bang Theory, and modeling as the benefits spokesperson for Target Corporation \"Ben E. Fitz\". He has also appeared in commercials for Progressive and appeared in the film What The Bleep Do We Know? opposite Marlee Matlin. He has also made guest appearances on shows such as Reno 911 and Glee. In March 2011 he began a run in a series of commercials for the Ford Motor Company.\n\nBowie is a regular sketch comedy performer at the Upright Citizens Brigade Theater (UCBT) in New York and Los Angeles. At UCBT he was a member of the sketch groupe \"The Naked Babies\" with comedians Rob Corddry, Seth Morris and Brian Huskey. He has a recurring role in Corddry's Adult Swim series Childrens Hospital.\n\nBowie is a former member of New York pop punk band EGGHEAD.",
        "birthday": "1971-05-30",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 55425,
        "imdb_id": "nm0101152",
        "known_for_department": "Acting",
        "name": "John Ross Bowie",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.6196,
        "profile_path": "/XAv1RilHZu7qiGGIOgikrLgHeD.jpg"
    }
}