{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mo2O5ESdB7PWnY3OBS9jjvjeskB.jpg",
                "genre_ids": [
                    18,
                    36,
                    10752
                ],
                "id": 11101,
                "original_language": "de",
                "original_title": "Stalingrad",
                "overview": "A German Platoon is explored through the brutal fighting of the Battle of Stalingrad. After half of their number is wiped out and they're placed under the command of a sadistic captain, the platoon lieutenant leads his men to desert. The platoon members attempt escape from the city, now surrounded by the Soviet Army.",
                "popularity": 3.3965,
                "poster_path": "/rB78VDAOK94KJWp9ofgE3GSQEor.jpg",
                "release_date": "1993-01-20",
                "title": "Stalingrad",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 588,
                "character": "Edgar Emigholz",
                "credit_id": "52fe43f79251416c75024845",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Born in 1948 near Bremen in Germany, Heinz Emigholz trained first as a draftsman before studying philosophy and literature in Hamburg. He began filmmaking in 1968 and has worked since 1973 as a filmmaker, artist, writer and producer in Germany and the USA. In 1974 he started his encyclopaedic drawing series The Basis of Make-Up . He looks back on numerous exhibitions, retrospectives, lectures and publications. In 1984 he started his film series Photography and beyond. He has held a professorship in Experimental Filmmaking at the Universität der Künste Berlin from 1993 to 2013, and co-founded the Institute for Time-based Media and the program Art and Media, there. Since 2012 member of the Academy of Arts in Berlin. In 2003 Filmgalerie 451 started an edition of all his films on DVD. Publications a.o.: Krieg der Augen, Kreuz der Sinne (War of Eyes, Cross of Senses), Seit Freud gesagt hat, der Künstler heile seine Neurose selbst, heilen die Künstler ihre Neurosen selbst (Since Freud Said That the Artist Heals His Neuroses Himself, Artists Have Been Healing Their Neuroses Themselves), Normalsatz – Siebzehn Filme (Ordinary Sentence – Seventeen Films) and Das schwarze Schamquadrat (The Black Sqare of Shame) (all four books at Verlag Martin Schmitz); Die Basis des Make-Up (I) and (II), Der Begnadete Meier (Grace Jones), Kleine Enzyklopädie der Photographie (Little Encyclopaedia of Photography) and Die Basis des Make-Up (III) (in Die Republik No. 68-71, 76-78, 89-91, 94-97 and 123-125); Sense of Architecture with more than 600 photographs.",
        "birthday": "1948-01-22",
        "deathday": null,
        "gender": 2,
        "homepage": "http://pym.de/",
        "id": 554449,
        "imdb_id": "nm0256384",
        "known_for_department": "Directing",
        "name": "Heinz Emigholz",
        "place_of_birth": "Achim, Germany",
        "popularity": 0.1153,
        "profile_path": "/lHMPlkrIiRGV5j1uQyTEON0lhVl.jpg"
    }
}