{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9UAcMhSCDJ2OCo5QdPpSERjhMA1.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 1396,
                "original_language": "ru",
                "original_title": "Зеркало",
                "overview": "A dying man in his forties recalls his childhood, his mother, the war and personal moments that tell of and juxtapose pivotal moments in Soviet history with daily life.",
                "popularity": 3.6613,
                "poster_path": "/AttDP5OEsMxtHPPN7Z92p2Ntnmd.jpg",
                "release_date": "1975-03-07",
                "title": "Mirror",
                "video": false,
                "vote_average": 7.963,
                "vote_count": 1016,
                "character": "Natalya / Maroussia - the Mother",
                "credit_id": "52fe42f3c3a36847f802f0d1",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Margarita Borisovna Terekhov",
            "Маргари́та Бори́совна Те́рехова",
            "Margareta Terechova",
            "Маргарита Терехова"
        ],
        "biography": "Margarita Borisovna Terekhova (Russian: Маргари́та Бори́совна Те́рехова; born August 25, 1942 in Turinsk, Sverdlovsk Oblast, Russian SFSR) is a Soviet and Russian film and theatre actress. She was awarded the title People's Artist of Russia in 1996.\n\nFrom 1959 she studied at the physics and mathematics faculty at the Tashkent State University from 1959 until 1961. After that she went to Moscow and tried to get into VGIK but her application was declined. After that she enrolled to study at the school-studio of Yuri Zavadsky at the Mossovet Theatre.\n\nAfter her graduation in 1964 she worked for many years as an actress of the Mossovet Theatre. From 1983 to 1987 she acted in the theatre group \"The Puppet Show\" organized by her and Igor Talkov.\n\nTerekhova's acting debut was in 1965 in the film Hello, That's Me!. Margarita became particularly popular in the late 1970s, after the release of a costumed musical TV films The Dog in the Manger and D'Artagnan and Three Musketeers. At first she played the capricious Countess Diana de Belflor, in the second - the treacherous Milady. Leading roles followed in films made by directors including Andrei Smirnov and Ilya Averbakh (Monologue, 1972) as well as the dual-role in Andrei Tarkovsky's acclaimed Mirror (1975). And more international co-productions came after, including George Cukor's The Blue Bird (1976) and Konrad Wolf's Mama, I'm Alive (1977). Terekhova's subsequent work in film proved her high level of acting expertise but did not attain the success as her earlier work.\n\nMargarita Terekhova worked and was friends with Igor Talkov. They had a close relationship and worked for some time together at the musical theatre collective \"Balaganchik\".\n\nIn 2005 she made her debut as a director, shooting the film The Seagull based on the work of Anton Chekhov. Since then, Terekhova has retired from acting and almost never gives interviews due to her struggle with Alzheimer's disease. She rarely appears in public and hardly ever attends public events",
        "birthday": "1942-08-25",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 55512,
        "imdb_id": "nm0855486",
        "known_for_department": "Acting",
        "name": "Margarita Terekhova",
        "place_of_birth": "Turinsk, Sverdlovsk Oblast, Russian SFSR, USSR [now Russia]",
        "popularity": 0.9653,
        "profile_path": "/G9FgIWxn0BNwUXeyBguCagzwQG.jpg"
    }
}