{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/aTJJ38M7zLAmJZ7vl0vyKn69zzw.jpg",
                "genre_ids": [
                    18,
                    80,
                    9648,
                    53
                ],
                "id": 1632,
                "original_language": "en",
                "original_title": "Mississippi Burning",
                "overview": "Two FBI agents investigating the murder of civil rights workers during the 60s seek to breach the conspiracy of silence in a small Southern town where segregation divides black and white. The younger agent trained in FBI school runs up against the small town ways of his partner, a former sheriff.",
                "popularity": 5.4799,
                "poster_path": "/hTv8Bkq3W1vwKi1IWCLWQW9PNU4.jpg",
                "release_date": "1988-12-08",
                "title": "Mississippi Burning",
                "video": false,
                "vote_average": 7.678,
                "vote_count": 1810,
                "character": "Local #1 (uncredited)",
                "credit_id": "57d2e730c3a3684281001355",
                "order": 55
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "The Guise"
        ],
        "biography": "Known for his tall, rotund stature, and prolific sense of humor, Paul Henderson is a multi-talented actor, writer, comic, and musician. He began making Super 8mm films at the age of 12, and later performed in Southeastern regional theater and music on the Gulf Coast before being discovered by director Alan Parker, and being cast in the Academy Award-winning Mississippi Burning (1988)\n\nHenderson moved to Los Angeles in 1988, where he began performing stand-up comedy and quickly became a regular performer and doorman at the \"World Famous\" Comedy Store, on the Sunset Strip. There he met and became friends with comic legends including Sam Kinison, with whom he would go on to work as an opening act in Kinison's \"Outlaws of Comedy.\" It was at the Comedy Store where Henderson began a career as a comedy writer, creating often uncredited material for many well-known comics, and as an occasional contributing joke writer to The Tonight Show with Jay Leno (1992).\n\nIn 1991, Henderson became associated with comic actor Andy Dick and has since written, performed, and collaborated with Dick on many projects, including The Andy Dick Show (2001), Division III: Football's Finest (2011), and countless podcasts and live musical comedy performances at clubs and colleges across America.\n\nAs a performer, Paul Henderson specializes in dialects, impressions, and twisted characterizations. He is also an accomplished singer and writer of songs in a wide variety of musical genres, usually choosing to showcase these talents under his pseudonym The Guise. As of (2022) Paul Henderson lives in Los Angeles and is writing and developing several upcoming film and television projects.",
        "birthday": "1967-09-10",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 555690,
        "imdb_id": "nm1114194",
        "known_for_department": "Acting",
        "name": "Paul Henderson",
        "place_of_birth": "Augusta - Georgia - USA",
        "popularity": 0.0404,
        "profile_path": "/fJqYQSxHJf544cg1Hm6C7tdKtZs.jpg"
    }
}