{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kP8rK9dGS1pr0HrnmXfIi2heWjo.jpg",
                "genre_ids": [
                    18,
                    28,
                    12,
                    36,
                    10752
                ],
                "id": 1495,
                "original_language": "en",
                "original_title": "Kingdom of Heaven",
                "overview": "After his wife dies, a blacksmith named Balian is thrust into royalty, political intrigue and bloody holy wars during the Crusades.",
                "popularity": 11.8859,
                "poster_path": "/rNaBe4TwbMef71sgscqabpGKsxh.jpg",
                "release_date": "2005-05-03",
                "title": "Kingdom of Heaven",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 4605,
                "character": "Squire",
                "credit_id": "5a486037c3a36818fb00ae88",
                "order": 25
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Philip Haywood Glenister"
        ],
        "biography": "Philip Haywood Glenister is an English actor, known for his role as DCI Gene Hunt in British television series Life On Mars and its sequel Ashes To Ashes.  He also played DCI William Bell in State of Play (2003) and Reverend Anderson in Outcast (2016–2018).\n\nGlenister was born on 10 February 1963 in Harrow, Middlesex, and grew up in Hatch End. He is the son of director John Glenister and Joan Fry Lewis, and the younger brother of fellow actor Robert Glenister.\n\nHe attended Hatch End High School.\n\nIn his early career, he worked as a runner for the Robert Stigwood Organisation. Following this, he worked until the age of 23 as a film publicist, but developed an interest in acting after watching his brother perform in a student play about the Sex Pistols. With the encouragement of his then-sister-in-law, Amanda Redman, he pursued acting and attended the Central School of Speech and Drama.\n\nIn the early 1990s, Glenister appeared in various TV series including Minder, The Ruth Rendell Mysteries, Heartbeat, The Chief, Dressing for Breakfast and Silent Witness. In 1997, he appeared in Sharpe's Justice as Richard Sharpe's half-brother Matt Truman. He played William Dobbin in the 1998 mini-series Vanity Fair.\n\nFrom 1998 to 1999, Glenister co-starred as a mini-cab driver who aspires to be a rock star in the series Roger Roger. He also played factory boss Mack Mackintosh in the first three series of Clocking Off from 2000 to 2002. In 2001, he appeared in two of the Hornblower TV films as Horatio's antagonist Gunner Hobbs.\n\nGlenister played the photographer who took nude photos for a Women's Institute fundraising calendar in the 2003 feature film Calendar Girls. Also in 2003, he appeared in the mini-series State of Play. Glenister played the German commandant, Baron Heinrich von Rheingarten, in the 2004 mini-series Island at War about the Occupation of the Channel Islands during World War II.\n\nIn April 2006, Glenister read the Bedtime Story for the BBC's children's channel, CBeebies. He returned to the slot in February/March 2007.\n\nGlenister played social reformer and estate manager Mr Carter in the 2007 BBC costume drama Cranford, as part of a cast including Judi Dench and Francesca Annis.\n\nGlenister is probably best known for his role as DCI Gene Hunt in Life on Mars (2006–07), co-starring with John Simm as Sam Tyler, and its sequel Ashes to Ashes (2008–10), with Keeley Hawes as Alex Drake. Glenister also worked with Simm on State of Play and Clocking Off and the 2008 crime film Tuesday. Upon announcement of the film, Glenister joked that he and Simm were contractually obliged to work with each other once a year.\n\nGlenister starred as demon hunter Rupert Galvin in the 2009 ITV drama Demons. He used an American accent for the role, which received some criticism from reviewers. After the series was cancelled, he said he had problems with the role and felt that he may have been miscast.\n\nIn 2010, Glenister had a small role (credited as 'Poker Friend') in Woody Allen's You Will Meet a Tall Dark Stranger, and he played Charles Forestier in a 2011 feature film of Guy de Maupassant's Bel Ami. He starred in the 2011 conspiracy thriller Hidden on BBC One.",
        "birthday": "1963-02-10",
        "deathday": null,
        "gender": 2,
        "homepage": "https://theartistspartnership.co.uk/artist/philip-glenister/",
        "id": 55689,
        "imdb_id": "nm0322562",
        "known_for_department": "Acting",
        "name": "Philip Glenister",
        "place_of_birth": "Harrow, Middlesex, England, UK",
        "popularity": 0.389,
        "profile_path": "/6JCHlKKJnKyBjJxvITnBOSTKSSq.jpg"
    }
}