{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/D3eDUNEzJPBDG3TCJcR7RyRgTA.jpg",
                "genre_ids": [
                    18,
                    28
                ],
                "id": 96721,
                "original_language": "en",
                "original_title": "Rush",
                "overview": "In the 1970s, a rivalry propels race car drivers Niki Lauda and James Hunt to fame and glory — until a horrible accident threatens to end it all.",
                "popularity": 9.7222,
                "poster_path": "/cyfncP1YKDNcGb0agE7RQr6UOYr.jpg",
                "release_date": "2013-09-02",
                "title": "Rush",
                "video": false,
                "vote_average": 7.727,
                "vote_count": 7473,
                "character": "Self (archive footage) (uncredited)",
                "credit_id": "5ce4562ac3a36863a81f64c0",
                "order": 75
            },
            {
                "adult": false,
                "backdrop_path": "/ycNyvi9gk4ZI2NLk4KBbseNZbfN.jpg",
                "genre_ids": [
                    99
                ],
                "id": 58496,
                "original_language": "en",
                "original_title": "Senna",
                "overview": "The remarkable story of Brazilian racing driver Ayrton Senna, charting his physical and spiritual achievements on the track and off, his quest for perfection, and the mythical status he has since attained, is the subject of Senna, a documentary feature that spans the racing legend's years as an F1 driver, from his opening season in 1984 to his untimely death a decade later.",
                "popularity": 2.9837,
                "poster_path": "/nZbLCbRoP6iJq5sr8daHQzjnzFh.jpg",
                "release_date": "2010-10-07",
                "title": "Senna",
                "video": false,
                "vote_average": 8.112,
                "vote_count": 1116,
                "character": "Self (archive footage)",
                "credit_id": "672edd036fe71f0ee62dc013",
                "order": 23
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Andreas Nikolaus Lauda",
            "Andreas Nikolaus \"Niki\" Lauda",
            "Niki Nationale"
        ],
        "biography": "Andreas Nikolaus \"Niki\" Lauda (22 February 1949 – 20 May 2019) was an Austrian former Formula One racing driver who was the F1 World Champion three times in 1975, 1977 and 1984. Lauda was seriously injured in a crash at the 1976 German Grand Prix at the Nürburgring, during which his Ferrari  burst into flames and he came close to death after inhaling hot toxic fumes and suffering severe burns. However he recovered and returned to race again just six weeks later at the Italian Grand Prix. Scars from the injuries he suffered left him permanently disfigured. The ever-present red cap he wore from 1976 to hide the severe burns he sustained in his accident became his trademark. Lauda is widely considered to be one of the greatest Formula One drivers of all time.\n\nLauda was an aviation entrepreneur who founded and ran three airlines: Lauda Air, Niki and Lauda. He was also a consultant for Scuderia Ferrari and team manager of Jaguar Racing for two years. Afterwards, Lauda served as non-executive chairman of Mercedes-AMG Petronas Motorsport, of which he owned 10%. He took part in negotiations to sign Lewis Hamilton to a three-year deal with Mercedes in 2013. The time with Mercedes ultimately made Lewis Hamilton the most successful Formula One driver of all time.\n\nHe passed away peacefully on the 20th May 2019 after complications relating to kidney dialysis and a lung transplant.",
        "birthday": "1949-02-22",
        "deathday": "2019-05-20",
        "gender": 2,
        "homepage": null,
        "id": 557259,
        "imdb_id": "nm0484399",
        "known_for_department": "Acting",
        "name": "Niki Lauda",
        "place_of_birth": "Vienna, Austria",
        "popularity": 0.3365,
        "profile_path": "/tGYoMEe3v9EE0DzlTVaXTOzLSmy.jpg"
    }
}