{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/c9RwZm40IizTKwWPO933SyDufHS.jpg",
                "genre_ids": [
                    18,
                    80,
                    53
                ],
                "id": 11975,
                "original_language": "en",
                "original_title": "The Rainmaker",
                "overview": "When Rudy Baylor, a young attorney with no clients, goes to work for a seedy ambulance chaser, he wants to help the parents of a terminally ill boy in their suit against an insurance company. But to take on corporate America, Rudy and a scrappy paralegal must open their own law firm.",
                "popularity": 6.681,
                "poster_path": "/twLGHXPjQtS8UyVGp5GXmhJiTM7.jpg",
                "release_date": "1997-11-18",
                "title": "The Rainmaker",
                "video": false,
                "vote_average": 7.026,
                "vote_count": 1380,
                "character": "Billy Porter",
                "credit_id": "53da89190e0a265a560001c8",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia.  Randy Bruce Traywick (born May 4, 1959), better known as Randy Travis, is an American country singer and actor. Active since 1985, he has recorded more than a dozen studio albums to date, in addition to charting more than thirty singles on the Billboard Hot Country Songs charts, of which sixteen have reached Number One.\n\nConsidered a pivotal figure in the history of country music, Travis broke through in the mid-1980s with the release of his album Storms of Life on Warner Bros. Records; the album sold more than three million copies. It also established him as a neotraditionalist country act, and was followed by a string of several more platinum and multi-platinum albums throughout his career. Starting in the mid-1990s, however, Travis saw decline in his chart success. He left Warner Bros. in 1997 for DreamWorks Records; there, he would eventually switch his focus to gospel music, a switch which, despite earning him only one more country hit in the Number One \"Three Wooden Crosses,\" earned him several Dove Awards.\n\nTravis, in addition to singing, holds several acting credits, starting with his television special Wind in the Wire in 1992. Since then, he has appeared in several movie and television roles, occasionally as himself.\n\nDescription above from the Wikipedia article Randy Travis, licensed under CC-BY-SA, full list of contributors on Wikipedia.   ",
        "birthday": "1959-05-04",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.randytravis.com/",
        "id": 55725,
        "imdb_id": "nm0871430",
        "known_for_department": "Acting",
        "name": "Randy Travis",
        "place_of_birth": "Marshville, North Carolina, USA",
        "popularity": 0.2977,
        "profile_path": "/bsMAHWzgDwTg1s3VUZZcPyGM8ub.jpg"
    }
}