{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/c8P7vv4m4sFi5ul6Zppu9irnUVF.jpg",
                "genre_ids": [
                    28,
                    12,
                    35
                ],
                "id": 11006,
                "original_language": "en",
                "original_title": "Smokey and the Bandit",
                "overview": "A race car driver tries to transport an illegal beer shipment from Texas to Atlanta in under 28 hours, picking up a reluctant bride-to-be on the way.",
                "popularity": 3.6459,
                "poster_path": "/w4RqNZtVHB5Uzlnl6zQlMHft7QI.jpg",
                "release_date": "1977-05-27",
                "title": "Smokey and the Bandit",
                "video": false,
                "vote_average": 6.983,
                "vote_count": 757,
                "character": "Cowboy Extra in Crowd Scene (uncredited)",
                "credit_id": "5f5a25f6d8cc4a0039e2ec84",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "John R. Schneider",
            "Jonathan Richards",
            "John Richard Schneider III",
            "جان اشنایدر"
        ],
        "biography": "John Schneider (born April 8, 1960) is an American actor, producer, director, and singer. He is best known for his roles as Bo Duke on the 1980s series The Dukes of Hazzard along with the spinoff series The Dukes and subsequent TV movie, Doug Monroe in the series Heaven Help Us, Professor Collins in Exit to Eden, Larry Lamont on the series Loving, Paul White in the movie Sydney White, Marshall Bowman on Freeform's The Secret Life of the American Teenager, Jack Kincaid on the series Twentsixmiles, William Beck on the series 10,000 Days, Jonathan Kent on Smallville (2001 television adaptation of Superman), and Jim Cryer on Tyler Perry's The Haves and Have Nots.\n\nHe's had a number of recurring roles on TV series including Mistresses, Hot in Cleveland, Desperate Housewives, 90210, Nip/Tuck, Dirty Sexy Money, Touched by an Angel, Diagnosis Murder, and Dr. Quinn, Medicine Woman.\n\nAlongside his acting career, he performed as a country music singer in the 1980s, releasing nine studio albums and a greatest hits package, as well as eighteen singles. This total includes \"I've Been Around Enough to Know\", \"Country Girls\", \"What's a Memory Like You (Doing in a Love Like This)\" and \"You're the Last Thing I Needed Tonight\", all of which reached the top of the Billboard country singles charts.\n\nDescription above from the Wikipedia article John Schneider (television actor), licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1960-04-08",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.johnschneideronline.com/",
        "id": 55779,
        "imdb_id": "nm0773884",
        "known_for_department": "Acting",
        "name": "John Schneider",
        "place_of_birth": "Mount Kisco, New York, USA",
        "popularity": 1.5142,
        "profile_path": "/c3cM4MuGSfDFQScZsYyWzVkD0pp.jpg"
    }
}