{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kIBBeb94FbNfLSljeFUxUoszflb.jpg",
                "genre_ids": [
                    18,
                    10752,
                    36
                ],
                "id": 17295,
                "original_language": "it",
                "original_title": "La battaglia di Algeri",
                "overview": "Paratrooper commander Colonel Mathieu, a former French Resistance fighter during World War II, is sent to Algeria to reinforce efforts to squelch the uprisings of the Algerian War. There he faces Ali la Pointe, a former petty criminal who, as the leader of the Algerian Front de Liberation Nationale, directs terror strategies against the colonial French government occupation. As each side resorts to ever-increasing brutality, no violent act is too unthinkable.",
                "popularity": 2.1462,
                "poster_path": "/2p3AFtOHFvP6OeVMqlnL1zLKOqL.jpg",
                "release_date": "1966-09-08",
                "title": "The Battle of Algiers",
                "video": false,
                "vote_average": 7.872,
                "vote_count": 826,
                "character": "El-Hadi Jaffar",
                "credit_id": "52fe47169251416c7508d55b",
                "order": 2
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/kIBBeb94FbNfLSljeFUxUoszflb.jpg",
                "genre_ids": [
                    18,
                    10752,
                    36
                ],
                "id": 17295,
                "original_language": "it",
                "original_title": "La battaglia di Algeri",
                "overview": "Paratrooper commander Colonel Mathieu, a former French Resistance fighter during World War II, is sent to Algeria to reinforce efforts to squelch the uprisings of the Algerian War. There he faces Ali la Pointe, a former petty criminal who, as the leader of the Algerian Front de Liberation Nationale, directs terror strategies against the colonial French government occupation. As each side resorts to ever-increasing brutality, no violent act is too unthinkable.",
                "popularity": 2.1462,
                "poster_path": "/2p3AFtOHFvP6OeVMqlnL1zLKOqL.jpg",
                "release_date": "1966-09-08",
                "title": "The Battle of Algiers",
                "video": false,
                "vote_average": 7.872,
                "vote_count": 826,
                "credit_id": "52fe47169251416c7508d57b",
                "department": "Production",
                "job": "Producer"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Saadi Yacef",
            "ياسف سعدي"
        ],
        "biography": "Yacef Saâdi (20 January 1928 – 10 September 2021) was an Algerian independence fighter, serving as a leader of the National Liberation Front during his country's war of independence. After the Algerian War, Yacef helped produce Italian filmmaker Gillo Pontecorvo's film The Battle of Algiers (1966), based on Souvenirs de la Bataille d'Alger. Yacef played a character modeled on his own experiences (named as Djafar) in the battle.\n\nHe began his professional life as a baker's apprentice. In 1945 he joined the Algerian People's Party (PPA) which was succeeded by the Movement for the Triumph of Democratic Liberties (MTLD) where he was active in the armed wing, the Special Organization between 1947 and 1949. He went to France after the dismantling of the OS and only returned to Algeria in 1952 where he resumed his work as a baker in the Casbah. In 1955, he joined the ranks of the FLN at the start of the war of independence then left for Switzerland for a liaison mission with Ben Bella. The Swiss authorities expelled him and he was arrested by the French police in Orly who transferred him to Algiers and imprisoned him. He was released in September 1955 on the condition that he inform the DST about the activities of the FLN in Algiers. He went underground and became the right-hand man of the leader of the FLN for the military zone of Algiers, Larbi Ben Mhidi. He became the FLN military leader of the autonomous zone of Algiers in May 1956 and replaced him in March 1957 after the death of Ben Mhidi, assassinated by General Aussaresses. On September 24, 1957, he was captured by French paratroopers and sentenced to death but finally released after the Evian Accords of March 18, 1962. Saâdi was pardoned by General de Gaulle, along with all those condemned to death in Algeria, in January 1959. He then benefited from amnesty in 1962.\n\nClose to Ben Bella, he founded a film production company, Casbah Films, which he financed with Algerian and Yugoslav capital. In 1962, he published Memories of the Battle of Algiers, his memoirs of the battle which he wrote during his incarceration. In July 1963, Yacef Saâdi was appointed by Ahmed Ben Bella president of the National Center for Friendship with Peoples (CNAP), intended to publicize abroad the achievements of Algerian socialism. In 1966, he co-produced with the Italian director Gillo Pontecorvo the famous film “The Battle of Algiers” in which he played himself. He was appointed president of the Algerian club USM Alger for three years, 1972-1975. On January 6, 2001, Saâdi was appointed senator by President Bouteflika out of the contingent of 29 appointments reserved for him. His mandate was not renewed by the President of the Republic in January 2016. According to the Algerian daily L'Expression, Yacef Saâdi was approached, in 2003, by the FBI and the CIA with the aim of drawing inspiration from his guerrilla warfare. urban from the time of the prestigious battle of Algiers to fight the Iraqi resistance. He refuses to collaborate.",
        "birthday": "1928-01-20",
        "deathday": "2021-09-10",
        "gender": 2,
        "homepage": "https://www.spla.pro/fr/fiche.personnes.spla.56360.html",
        "id": 557864,
        "imdb_id": "nm0754272",
        "known_for_department": "Acting",
        "name": "Yacef Saâdi",
        "place_of_birth": "Algiers, Algeria",
        "popularity": 0.2569,
        "profile_path": "/7zRZq2sS1XFQa4JgKZVtauWKAv3.jpg"
    }
}