{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yV1s91RyHJIMIJ7KeyHsWJ0ayUv.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 226,
                "original_language": "en",
                "original_title": "Boys Don't Cry",
                "overview": "A young transgender man explores his gender identity and searches for love in rural Nebraska.",
                "popularity": 4.2908,
                "poster_path": "/eB505ycEhFVfMwGglIzXNUyKAIs.jpg",
                "release_date": "1999-09-02",
                "title": "Boys Don't Cry",
                "video": false,
                "vote_average": 7.406,
                "vote_count": 1385,
                "character": "Lester (uncredited)",
                "credit_id": "62b446c2595a560053f3df35",
                "order": 28
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Gabriel Horn began working in the entertainment industry as a child acting in every grade school and community theater production as possible. By age seven, he was featured in a series of regional Dallas, Texas commercials advertising the neighborhood church he and his parents attended. It wasn't too many stage plays and commercials later before young Horn dreamed of making films of his own. Gathering every cent he was able to earn, by age ten, Gabriel purchased his first video camera and began spending countless evenings and weekends wrangling his family and friends together to be a part of his latest masterpiece.\n\nGabriel was acting in his first major motion picture by age 13, and was fortunate enough to meet his favorite actor, Steve Martin, on the set of Paramount Pictures Leap of Faith.\n\nBy fifteen, Gabriel co-wrote, starred in, and directed (along with his father Terry Horn), twenty episodes of Uncle Sam and The Capital Kids Club, which aired every week on Washington D.C. Public Cable Access. This gained the attention of D.C. talent manager Linda Townsend, who immediately signed Horn and began sending him out for larger film roles and national commercials.\n\nThroughout high school, Gabriel continued to act and began to write screenplays as well. Gabriel graduated from Cleburne High School in 1996, and entered Dallas' KD Studio Actors Conservatory, where he landed commercials for Omni Hotels, Dr. Pepper, and Southwest Airlines as well as bit parts on Walker: Texas Ranger, The West Wing, Disney's Tuck Everlasting, and the Academy Award winner, Boy's Don't Cry.\n\nHorn recently finished producing two films - back to back, his feature documentary Lovenutz which examines Loveland, Colorado, is about a quirky; beautiful town that seems to be passionate about Valentines Day all year long, followed by the direct to DVD vampire comedy, Night Crawlers, which stars Joey Greco, from TV's Cheaters.\n\nGabriel has been producing and directing for The New Palace Theater since 2003, which produced live theater and later, switched to film production with New Palace Films, LLC. Hamilton Pool is based on the screenplay, The Red Ribbon Key, that Gabriel originally wrote for stage, but with the help of Xander Berkeley, was converted for film this past year. Gabriel is involved with local film organizations in Austin, Texas including Austin Film Society and Reel Women.",
        "birthday": "1978-03-15",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 558298,
        "imdb_id": "nm0394834",
        "known_for_department": "Acting",
        "name": "Gabriel Horn",
        "place_of_birth": "Fort Worth, Texas, USA",
        "popularity": 0.0741,
        "profile_path": "/5q2RiZClcGGCLAUd2mSmBbtQvRH.jpg"
    }
}