{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/vzavBt9c6v4zBaGiwQDO21aNQG9.jpg",
                "genre_ids": [
                    28,
                    12,
                    10752
                ],
                "id": 11046,
                "original_language": "en",
                "original_title": "Where Eagles Dare",
                "overview": "World War II is raging, and an American general has been captured and is being held hostage in the Schloss Adler, a Bavarian castle that's nearly impossible to breach. It's up to a group of skilled Allied soldiers to liberate the general before it's too late.",
                "popularity": 6.8612,
                "poster_path": "/dnyiVS4Ad4w4rfS4Bm1YalEdonx.jpg",
                "release_date": "1968-12-04",
                "title": "Where Eagles Dare",
                "video": false,
                "vote_average": 7.514,
                "vote_count": 928,
                "character": "German Officer #2 (uncredited)",
                "credit_id": "5f3f7762028f140034551c1b",
                "order": 22
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Ivor Donald Dean (21 December 1917 – 10 August 1974) was a British stage, film and television actor.  With his lugubrious demeanour he was often cast as world-weary police officers or butlers, and it is for the role of Chief Inspector Claud Eustace Teal in the 1960s series The Saint, opposite Roger Moore, that he is best known.Dean played Teal for almost the entire run of the series, except three instances in early episodes where other actors were used. It was on the third occasion, in an episode called Starring The Saint which featured Dean in another role, that the producers saw the ideal actor for the part.\n\nDean proved the ideal foil for Moore's Simon Templar, invariably one step behind and allegedly hoping for the day when he could pin something on Templar. Dean's character however seemed to have a respect for his adversary nonetheless. Dean reprised the role in all but name in Randall and Hopkirk (Deceased) (1968–69) in which he played Inspector Large, who had an even more adversarial relationship with (the much less suave) Jeff Randall.\n\nDean also appeared in one-off roles in several other ITC series, including Jason King and The Persuaders!, he appeared as a butler in 3 episodes of the long-running LWT sitcom Doctor at Large and featured in three episodes of The Avengers.  In 1964 he played estate agent Alfred Wormold in the long-running soap opera Coronation Street, selling No. 13 Coronation Street to Stan Ogden and his wife Hilda.\n\nDean also portrayed Long John Silver in a Franco-German television adaptation of Treasure Island, entitled Die Schatzinsel / L' île au Tresor (1966). He contributed to a follow-up script with Saint producer Robert S. Baker, but it never materialised before his death. Baker continued to develop the project and it was finally made as the 10 part serial Return to Treasure Island in 1986. It was scripted by John Goldsmith and the part of Long John Silver was played by Brian Blessed.\n\nHis other film appearances include Theatre of Death and the 'Pride' segment of The Magnificent Seven Deadly Sins.\n\nIn 1949, Dean married British actress Patricia Hamilton, with whom he had three daughters. He died of heart failure, aged 56, in Truro, Cornwall in August 1974.",
        "birthday": "1917-12-21",
        "deathday": "1974-08-10",
        "gender": 2,
        "homepage": null,
        "id": 558447,
        "imdb_id": "nm0212796",
        "known_for_department": "Acting",
        "name": "Ivor Dean",
        "place_of_birth": "Hampstead London, England, UK",
        "popularity": 0.3191,
        "profile_path": null
    }
}