{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ueDw7djPgKPZfph0vC43aD2EMyF.jpg",
                "genre_ids": [
                    12,
                    28
                ],
                "id": 85,
                "original_language": "en",
                "original_title": "Raiders of the Lost Ark",
                "overview": "When Dr. Indiana Jones – the tweed-suited professor who just happens to be a celebrated archaeologist – is hired by the government to locate the legendary Ark of the Covenant, he finds himself up against the entire Nazi regime.",
                "popularity": 10.9389,
                "poster_path": "/ceG9VzoRAVGwivFU403Wc3AHRys.jpg",
                "release_date": "1981-06-12",
                "title": "Raiders of the Lost Ark",
                "video": false,
                "vote_average": 7.925,
                "vote_count": 13066,
                "character": "Messenger Pirate",
                "credit_id": "52fe4215c3a36847f8002a95",
                "order": 15
            },
            {
                "adult": false,
                "backdrop_path": "/yI0xd7X8UktQ6cb8TdWKNTOWxhm.jpg",
                "genre_ids": [
                    35
                ],
                "id": 8764,
                "original_language": "en",
                "original_title": "Top Secret!",
                "overview": "Popular and dashing American singer Nick Rivers travels to East Germany to perform in a music festival. When he loses his heart to the gorgeous Hillary Flammond, he finds himself caught up in an underground resistance movement. Rivers joins forces with Agent Cedric and Flammond to attempt the rescue of her father, Dr. Paul, from the Germans, who have captured the scientist in hopes of coercing him into building a new naval mine.",
                "popularity": 3.5953,
                "poster_path": "/hRTbfR27xghnVMs3ZJ3EhK3zzud.jpg",
                "release_date": "1984-06-08",
                "title": "Top Secret!",
                "video": false,
                "vote_average": 7.095,
                "vote_count": 1290,
                "character": "Chocolate Mousse",
                "credit_id": "52fe44b7c3a36847f80a61d7",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/bOgKCymrdPHPHozhRBNr9XhVD87.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 13446,
                "original_language": "en",
                "original_title": "Withnail & I",
                "overview": "Two out-of-work actors -- the anxious, luckless Marwood and his acerbic, alcoholic friend, Withnail -- spend their days drifting between their squalid flat, the unemployment office and the pub. When they take a holiday \"by mistake\" at the country house of Withnail's flamboyantly gay uncle, Monty, they encounter the unpleasant side of the English countryside: tedium, terrifying locals and torrential rain.",
                "popularity": 1.826,
                "poster_path": "/i18cIp8A10A2JgByrfA9oIC9299.jpg",
                "release_date": "1987-06-19",
                "title": "Withnail & I",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 587,
                "character": "Presuming Ed",
                "credit_id": "52fe45699251416c7505585f",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/nrm4FH3Dl9D62B1Lj7dsQgkwXRa.jpg",
                "genre_ids": [
                    10402,
                    18
                ],
                "id": 12104,
                "original_language": "en",
                "original_title": "Pink Floyd: The Wall",
                "overview": "A troubled rock star descends into madness in the midst of his physical and social isolation from everyone.",
                "popularity": 3.2729,
                "poster_path": "/aElHyIdF5jmctFGhlhhaPFsbBJC.jpg",
                "release_date": "1982-07-14",
                "title": "Pink Floyd: The Wall",
                "video": false,
                "vote_average": 7.945,
                "vote_count": 1563,
                "character": "Minder",
                "credit_id": "5df6db2126dac1001252f870",
                "order": 25
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Eddie Tagoe is a Ghanaian actor best known in the U.K. for playing \"Presuming Ed\" in the 1986 film production of Withnail and I, a role which he resumed in 2000 in a stage production of the same work. Internationally, he may be better recognized for his brief appearance in the movie, Raiders of the Lost Ark. Billed only as the \"Messenger Pirate\", his character was sent to find Indiana Jones in advance of Nazis boarding the ship on which Jones was travelling. Initially unable to find Jones, he was instructed by the captain to look again, and immediately replied, \"I found him!\", pointing to Jones swimming to the Nazi submarine. Tagoe had a significantly larger part as \"Chocolate Mousse\" in the 1984 farce, Top Secret!, and appeared in various other roles such as Sgt. Gwambe in Baby: Secret of the Lost Legend, as well as in The Dogs of War and Pink Floyd The Wall. The son of a Ghanaian chief, Tagoe travelled to London to study reflexology prior to pursuing acting. In 1995, however, he returned to his reflexology career when he was recruited to serve as team reflexologist for Newcastle United F.C.",
        "birthday": null,
        "deathday": null,
        "gender": 0,
        "homepage": null,
        "id": 55909,
        "imdb_id": "nm0846607",
        "known_for_department": "Acting",
        "name": "Eddie Tagoe",
        "place_of_birth": null,
        "popularity": 0.073,
        "profile_path": null
    }
}