{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/u218sykbUQIh6EWtTdJzguU5LcG.jpg",
                "genre_ids": [
                    18
                ],
                "id": 16858,
                "original_language": "en",
                "original_title": "All That Jazz",
                "overview": "Joe Gideon is at the top of the heap, one of the most successful directors and choreographers in musical theater. But he can feel his world slowly collapsing around him - his obsession with work has almost destroyed his personal life, and only his bottles of pills keep him going.",
                "popularity": 3.0101,
                "poster_path": "/culCEdj4srLljefgn4XKd6k3C5t.jpg",
                "release_date": "1979-12-16",
                "title": "All That Jazz",
                "video": false,
                "vote_average": 7.505,
                "vote_count": 544,
                "character": "Stripper",
                "credit_id": "61f1c9326e938a0045f3f39a",
                "order": 60
            },
            {
                "adult": false,
                "backdrop_path": "/tvNuhRlpRozDgsX1zR9gQ2aHv1X.jpg",
                "genre_ids": [
                    18
                ],
                "id": 1578,
                "original_language": "en",
                "original_title": "Raging Bull",
                "overview": "The life of boxer Jake LaMotta, whose violence and temper that led him to the top in the ring destroyed his life outside of it.",
                "popularity": 8.4623,
                "poster_path": "/1WV7WlTS8LI1L5NkCgjWT9GSW3O.jpg",
                "release_date": "1980-11-14",
                "title": "Raging Bull",
                "video": false,
                "vote_average": 7.923,
                "vote_count": 4523,
                "character": "Emma - Miss 48's",
                "credit_id": "65aacd2b0c4c1600c57ba313",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Joanna Cunningham",
            "Rita A. Bennett",
            "Sarah Davenport",
            "Elizabeth Sunburst"
        ],
        "biography": "Lovely, shapely, and captivating brunette Rita Bennett was born on January 26, 1941 in Glen Cove, New York. An only child, Rita grew up in a dysfunctional household in Long Island. Unhappy with her turbulent home life, Bennett focused primarily on her burgeoning comely looks as a teenager. Rita left home at age sixteen and moved into a room in a Manhattan apartment with five girls who she barely knew. Bennett soon started modeling and was featured in ads in both newspapers and magazines as well as on billboards (she even was the face of an ad campaign for a Manhattan department store). Rita appeared in her first soft-core film in 1961. Among the notable East Coast soft-core cinema directors that Bennett appeared in films for are Joseph W. Sarno, Barry Mahon, William Rose, and John Amero and Lem Amero. Outside of acting, Rita also worked as a stripper in the tri-state area on the East Coast and managed to land the occasional small role in a major mainstream movie in which she was cast to type as a stripper. Bennett quit acting and stripping in the mid-1980's and went on to focus on fashion and animal welfare instead. Alas, Rita had serious problems with alcoholism throughout her life. Bennett died in 2017. Her body was unclaimed and ultimately wound up buried in a potter's field.",
        "birthday": "1941-01-26",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 559279,
        "imdb_id": "nm1631599",
        "known_for_department": "Acting",
        "name": "Rita Bennett",
        "place_of_birth": "Glen Cove, Long Island, New York, USA",
        "popularity": 0.2116,
        "profile_path": null
    }
}