{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/gOK4jq0xG464aBMaPeWaTISnTZK.jpg",
                "genre_ids": [
                    18,
                    53,
                    9648
                ],
                "id": 54186,
                "original_language": "ja",
                "original_title": "告白",
                "overview": "Devastated at the death of her four-year-old daughter, a grieving middle school teacher is horrified to discover that her students aren't as innocent as she thinks.",
                "popularity": 2.8552,
                "poster_path": "/xQcnx6jMuPRCeidotgVy6YIls6p.jpg",
                "release_date": "2010-06-04",
                "title": "Confessions",
                "video": false,
                "vote_average": 7.581,
                "vote_count": 923,
                "character": "Mizuki Kitahara",
                "credit_id": "52fe4890c3a36847f816e24f",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "はしもと あい"
        ],
        "biography": "Kumamoto-native Ai Hashimoto debuted in 2008 via an audition at Sony's Newcome that her mother pushed her to attend. Her mother loves celebrities. She has two sisters with her being the middle one. Her mother believed she is the one daughter who could make it in the audition. Immediately after the audition Ai disbelieved she would win. She began modelling in Seventeen magazine in 2010 and also made her acting debut in that year in Give And Go where she was the main character. She continued with roles in Confessions and Sadako 3D. Ai was awarded the prize as Rookie of The Year at the 36th Japan Academy Program in 2013. She ceased modelling in 2014. Hashimoto likes manga, karaoke and bicycling. She states that while she memorizes her scripts she avoids trying to understand the character from the lines and instead understand the spirit and motivation. Hashimoto is obsessed with eating tomatoes and cites the number three as her favourite.",
        "birthday": "1996-01-12",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 559413,
        "imdb_id": "nm1169797",
        "known_for_department": "Acting",
        "name": "Ai Hashimoto",
        "place_of_birth": "Kumamoto, Japan",
        "popularity": 1.1313,
        "profile_path": "/2sTNnkzF5e6dogfHEsnD1aU36J4.jpg"
    }
}