{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tAbDYp1b7zK2oOhJKcza63dUtOl.jpg",
                "genre_ids": [
                    35,
                    12
                ],
                "id": 636565,
                "original_language": "it",
                "original_title": "L'incredibile storia dell'Isola delle Rose",
                "overview": "In 1968, engineer Giorgio Rosa established the independent state called \"The Isle of Roses\" off the coast of Rimini, built on a platform outside the territorial waters, with Esperanto as the official language. The Italian authorities did not take it well because the micronation was seen as an expedient to not pay taxes on the revenues obtained thanks to the arrival of numerous tourists and curious people.",
                "popularity": 2.4279,
                "poster_path": "/fbmYUDOo6tNq3A1VWhhxE6pjNEB.jpg",
                "release_date": "2020-12-09",
                "title": "Rose Island",
                "video": false,
                "vote_average": 7.036,
                "vote_count": 1361,
                "character": "",
                "credit_id": "5fc6d9a82f8d09003f0fc3d0",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Frank Garrish"
        ],
        "biography": "Frank has appeared in over 180 feature films, documentaries, television series and made-for-TV movies; in over 1000 commercials, voice-overs, industrials and print; and in over 90 stage productions. Frank was a resident member of Utah's Pioneer Theatre Company (LORT) for 12 seasons and performed with Pennsylvania Centre Stage, Utah Shakespeare Festival, Sundance Summer Theatre, Salt Lake Acting Company,and as a vocal soloist for the Utah Symphony's Children's Concert series. Frank holds a Master of Fine Arts Degree in Theatre from Penn State University and a Bachelor of Fine Arts in Theatre from the University of Rhode Island.",
        "birthday": "1963-03-14",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 559660,
        "imdb_id": "nm0314754",
        "known_for_department": "Acting",
        "name": "Frank Gerrish",
        "place_of_birth": "Cranston, Rhode Island, USA",
        "popularity": 0.3299,
        "profile_path": "/ysDvZs98wjiVUZh9rnyvasz0ukH.jpg"
    }
}