{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mQC9OxFBGKJmk4tgzpmKO1nIZx5.jpg",
                "genre_ids": [
                    18,
                    10752
                ],
                "id": 1786,
                "original_language": "fr",
                "original_title": "Au revoir les enfants",
                "overview": "Au revoir les enfants tells a heartbreaking story of friendship and devastating loss concerning two boys living in Nazi-occupied France. At a provincial Catholic boarding school, the precocious youths enjoy true camaraderie—until a secret is revealed. Based on events from writer-director Malle’s own childhood, the film is a subtle, precisely observed tale of courage, cowardice, and tragic awakening.",
                "popularity": 3.3695,
                "poster_path": "/lXP90Vx7OcviBfbbokcaG6zVnPG.jpg",
                "release_date": "1987-10-07",
                "title": "Au Revoir les Enfants",
                "video": false,
                "vote_average": 7.524,
                "vote_count": 685,
                "character": "",
                "credit_id": "578d6fa192514154570048a7",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Thomas Peter Friedel",
            "Thomas Friedl"
        ],
        "biography": "Thomas Peter Friedl (born January 3, 1967 in Munich) is a German media entrepreneur and film producer.\n\nHe started his career in the film industry in 1989 at Germany’s media house Constantin Film. Until 2008, Friedl was member of the board and served as President, Distribution & Marketing and COO of Constantin Film AG, a company he left at the beginning of 2008 after 18 years.\n\nFriedl distributed the two most successful German films: Michael Bully Herbig's Der Schuh des Manitu and (T)Raumschiff Surprise.\n\nAs an international distributor, Friedl was in charge of productions such as the first three Resident Evil films, House of the Spirits or Perfume: The Story of a Murderer. Friedl also led various campaigns for the Academy Awards, including Nowhere in Africa (Academy Award for Best Foreign Film 2001) and Downfall (nominated for Best Foreign Film 2005).\n\nIn 2008, Friedl joined UFA Cinema and took over responsibility as producer and CEO of UFA Cinema’s operations.\n\nFriedl’s producer credits include – among others – the movie adaptation of the children’s and young-adult bestsellers Devil's Kickers and The Twins at St. Clare's, plus the comedy The Theory of Relativity in Love, Sabine Kuegler’s autobiographical bestseller, Jungle Child, Other titles include the thrillers The Fourth State directed by Dennis Gansel and The Coming Days, the romantic comedy Jesus Loves Me and The Weekend, which was adapted from the eponymous bestseller by Bernhard Schlink.\n\nFriedl left UFA Cinema end of 2012 to join forces with leading German producer and CEO of X-Filme Creative Pool, Stefan Arndt. Friedl and Arndt’s new production entity The Amazing Film Company (TAF) which focuses on high commercial English speaking feature movies for worldwide exploitation.\n\nCurrently Friedl is preparing the international productions A Year in the Merde, Honky Tonk Pirates, Prototype, Cathy's Book and Fatherland - Fatherland is based on Robert Harris best-selling novels.\n\nFriedl is a member of the European and German Film Academy, where he served many years as creative director and producer of the German Film Awards. He is also Chairman of the Supervisory Board of the Children Charity Organisation \"Artists for Kids\", which he founded in 1999 together with his friend and partner, Bernd Eichinger.\n\nSource: Article \"Thomas Peter Friedl\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1967-01-03",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 560221,
        "imdb_id": "nm0295073",
        "known_for_department": "Production",
        "name": "Thomas Peter Friedl",
        "place_of_birth": "Munich, Germany",
        "popularity": 0.0441,
        "profile_path": "/bdsmV1UNJ88buTYy0P1cGDPvwYL.jpg"
    }
}