{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/veiWT3UYVvEOGCfGZLGDJtjJvdV.jpg",
                "genre_ids": [
                    18
                ],
                "id": 404,
                "original_language": "en",
                "original_title": "The Straight Story",
                "overview": "A retired farmer and widower in his 70s, Alvin Straight learns one day that his distant brother Lyle has suffered a stroke and may not recover. Alvin is determined to make things right with Lyle while he still can, but his brother lives in Wisconsin, while Alvin is stuck in Iowa with no car and no driver's license. Then he hits on the idea of making the trip on his old lawnmower, thus beginning a picturesque and at times deeply spiritual odyssey.",
                "popularity": 5.7034,
                "poster_path": "/tT9cMiVDdtlcdZxOoFy3VRmEoKk.jpg",
                "release_date": "1999-10-15",
                "title": "The Straight Story",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 1674,
                "character": "Tom the John Deere Dealer",
                "credit_id": "52fe423fc3a36847f800f739",
                "order": 12
            },
            {
                "adult": false,
                "backdrop_path": "/ydF3hT1fjrM71AbNAYBZKnq6rtL.jpg",
                "genre_ids": [
                    10752,
                    18
                ],
                "id": 10015,
                "original_language": "en",
                "original_title": "Heartbreak Ridge",
                "overview": "A hard-nosed, hard-living Marine gunnery sergeant clashes with his superiors and his ex-wife as he takes command of a spoiled recon platoon with a bad attitude.",
                "popularity": 5.5789,
                "poster_path": "/aMr99UigkMCTSPnLTpkzJeLmpyc.jpg",
                "release_date": "1986-12-05",
                "title": "Heartbreak Ridge",
                "video": false,
                "vote_average": 6.887,
                "vote_count": 1057,
                "character": "Major Malcolm A. Powers",
                "credit_id": "52fe43089251416c75000c7d",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/5l3Xb2WQR0nXiVhbj5rAv0z4xsZ.jpg",
                "genre_ids": [
                    12,
                    18
                ],
                "id": 62204,
                "original_language": "fr",
                "original_title": "La Guerre du feu",
                "overview": "In the prehistoric world, a Cro-Magnon tribe depends on an ever-burning source of fire, which eventually extinguishes. Lacking the knowledge to start a new fire, the tribe sends three warriors on a quest for more. With the tribe's future at stake, the warriors make their way across a treacherous landscape full of hostile tribes and monstrous beasts. On their journey, they encounter Ika, a woman who has the knowledge they seek.",
                "popularity": 2.6316,
                "poster_path": "/tyzW1M00xfHKNtmTlT6wJ3F4pNr.jpg",
                "release_date": "1981-12-16",
                "title": "Quest for Fire",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 539,
                "character": "Naoh",
                "credit_id": "52fe4675c3a368484e091d0d",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Эверет МакГилл",
            "Everett Charles McGill III"
        ],
        "biography": "Everett McGill is an American actor who was born in Miami Beach, Florida, on October 21, 1945. He is best known for his roles in the films Quest for Fire (1981), Dune (1984), Silver Bullet (1985), Heartbreak Ridge (1986), Licence to Kill (1989), The People Under the Stairs (1991), and Under Siege 2: Dark Territory (1995). He also had a recurring role as \"Big\" Ed Hurley on the television series Twin Peaks (1990–1991).\n\nMcGill began his acting career on Broadway, appearing in the award-winning plays Equus, A Texas Trilogy, and Whose Life Is It, Anyway? He made his film debut in 1975 with a small role in the film The Day of the Locust. He went on to have a number of supporting roles in films throughout the 1970s and early 1980s.\n\nIn 1981, McGill starred in the film Quest for Fire, which was a critical and commercial success. He followed this up with a starring role in the film Dune, which was also a success. McGill continued to have a successful career in the 1980s, appearing in a number of films, including Silver Bullet, Heartbreak Ridge, Licence to Kill, and The People Under the Stairs.\n\nIn the 1990s, McGill's career slowed down, but he still appeared in a number of films, including Under Siege 2: Dark Territory, The Quick and the Dead, and The Faculty. He also had a recurring role on the television series Twin Peaks.\n\nMcGill retired from acting in 1999, but he returned for the revival of Twin Peaks in 2017. He has since retired from acting again.",
        "birthday": "1945-10-21",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 5616,
        "imdb_id": "nm0569239",
        "known_for_department": "Acting",
        "name": "Everett McGill",
        "place_of_birth": "Miami Beach, Florida, USA",
        "popularity": 1.0328,
        "profile_path": "/nc3IMwRItjFzScYdJWR7MT9p5cW.jpg"
    }
}