{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/sJjuXNHNT7PfzcgkqM3oSIkVOXB.jpg",
                "genre_ids": [
                    16,
                    35,
                    10751,
                    9648
                ],
                "id": 385103,
                "original_language": "en",
                "original_title": "Scoob!",
                "overview": "In Scooby-Doo’s greatest adventure yet, see the never-before told story of how lifelong friends Scooby and Shaggy first met and how they joined forces with young detectives Fred, Velma, and Daphne to form the famous Mystery Inc. Now, with hundreds of cases solved, Scooby and the gang face their biggest, toughest mystery ever: an evil plot to unleash the ghost dog Cerberus upon the world. As they race to stop this global “dogpocalypse,” the gang discovers that Scooby has a secret legacy and an epic destiny greater than anyone ever imagined.",
                "popularity": 5.077,
                "poster_path": "/jHo2M1OiH9Re33jYtUQdfzPeUkx.jpg",
                "release_date": "2020-07-08",
                "title": "Scoob!",
                "video": false,
                "vote_average": 7.009,
                "vote_count": 1754,
                "character": "Bike Cop Gary (voice)",
                "credit_id": "5ebecbeebc8abc0022c49d46",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nKevin Heffernan (born May 25, 1968) is an American actor, writer, producer, and director, and member of the Broken Lizard comedy group.\n\nHeffernan was born West Haven, Connecticut. He is a graduate of Fairfield College Preparatory School and later Colgate University, the latter where he was a part of comedy group Charred Goosebeak with the other Lizards, and a member of the Beta Theta Pi fraternity. Heffernan is a graduate of Brooklyn Law School. J.D. Heffernan is best known for his role of Vermont State Trooper Rod Farva in Super Troopers, as Landfill and Gil in Beerfest, and co-starring in the Dukes of Hazzard movie as \"Sheev\".\n\nHe has also appeared on How I Met Your Mother (ep. \"I'm Not That Guy\"), Curb Your Enthusiasm, and Arrested Development.\n\nDescription above from the Wikipedia article Kevin Heffernan (actor), licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1968-05-25",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 56251,
        "imdb_id": "nm0373571",
        "known_for_department": "Acting",
        "name": "Kevin Heffernan",
        "place_of_birth": "West Haven, Connecticut, U.S.",
        "popularity": 0.468,
        "profile_path": "/2FgG3oPF1A7d6W4KaNNZV7kJ83g.jpg"
    }
}