{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bYimqNnizPUCnL5HOdoCW02IGmH.jpg",
                "genre_ids": [
                    18,
                    35,
                    10749
                ],
                "id": 74643,
                "original_language": "fr",
                "original_title": "The Artist",
                "overview": "Hollywood, 1927: As silent movie star George Valentin wonders if the arrival of talking pictures will cause him to fade into oblivion, he sparks with Peppy Miller, a young dancer set for a big break.",
                "popularity": 3.1239,
                "poster_path": "/z68py0ZqPgeacGPG54AGVRbNBS7.jpg",
                "release_date": "2011-10-12",
                "title": "The Artist",
                "video": false,
                "vote_average": 7.451,
                "vote_count": 3367,
                "character": "Tennis Player",
                "credit_id": "566daae09251415ec500bd8f",
                "order": 35
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Matthew was born in Houston, Tx. but grew up in the small town of Fredericksburg staying actively involved in theater and sports during middle and high school. He was known as the \"thespian jock.\" Matt continued on pace in college majoring in acting for theater at Texas State University where he was actively involved in many of the theater department's productions but also took strongly to the Greek life on campus. His fellow thespians in school would call him \"Frat Matt\" when he came around. In 2006, Matthew moved to Los Angeles to pursue acting while at the same time found work for a few indie production companies and stumbled upon producing before starting his own company with fellow producers Christian Sosa and Tyler Glodt in 2008. Since then, Matthew has starred in several indie features, shorts, commercials, and his company has produce one feature, \"The Eves,\" as well as many other shorts. Matthew co-owns a production company called Conation Films where they primarily shoot all their films in the state of Texas where Matthew is a native.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 562583,
        "imdb_id": "nm1625215",
        "known_for_department": "Acting",
        "name": "Matthew Albrecht",
        "place_of_birth": "Houston, Texas, USA",
        "popularity": 0.719,
        "profile_path": "/3FUWd7aZeQPxf6bP88IiOh1CH6F.jpg"
    }
}