{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xleIwr1wUlWqvFHaU1PItf0YLrZ.jpg",
                "genre_ids": [
                    18,
                    10402
                ],
                "id": 786,
                "original_language": "en",
                "original_title": "Almost Famous",
                "overview": "In 1973, 15-year-old William Miller's unabashed love of music and aspiration to become a rock journalist lands him an assignment from Rolling Stone magazine to interview and tour with the up-and-coming band, Stillwater.",
                "popularity": 5.756,
                "poster_path": "/3rrkyLYbgLj84AYvjhdcJot4JPx.jpg",
                "release_date": "2000-09-15",
                "title": "Almost Famous",
                "video": false,
                "vote_average": 7.501,
                "vote_count": 2921,
                "character": "Reg",
                "credit_id": "569a98479251410cca000840",
                "order": 30
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Peter Kenneth Frampton (born 22 April 1950) is an English-American guitarist, singer and songwriter who rose to prominence as a member of the rock bands the Herd and Humble Pie. Later in his career Frampton found success as a solo artist. He has released several albums, including his breakthrough album, the live release Frampton Comes Alive! (1976), which spawned several hit singles and has earned 8× Platinum by the RIAA in the United States. He has also worked with acts such as Ringo Starr, the Who's John Entwistle, David Bowie, and both Matt Cameron and Mike McCready of Pearl Jam.\n\nFrampton is best known for such hits as \"Show Me the Way\", \"Baby, I Love Your Way\", \"Do You Feel Like We Do\", and \"I'm in You\", which remain staples of classic rock radio. He has also appeared as himself in television shows such as The Simpsons, Family Guy, and Madam Secretary.\n\nPeter Kenneth Frampton was born to Owen Frampton and Peggy (née ffitch) Frampton in Beckenham, Kent. He attended Bromley Technical High School, at which his father was a teacher and the head of the Art department. He first became interested in music when he was seven years old. Having discovered his grandmother's banjolele in the attic, he taught himself to play it, going on to later teach himself how to play guitar and piano as well. At the age of eight, he began taking classical music lessons.\n\nHis early influences came from Cliff Richard & the Shadows, Buddy Holly, Eddie Cochran and later the Ventures, Jimi Hendrix and the Beatles. His father introduced him to the recordings of Belgian gypsy jazz guitarist Django Reinhardt.\n\nBy the age of 12, Frampton played in a band called the Little Ravens. Both he and David Bowie, who was three years older, were pupils at Bromley Technical School where Frampton's father was Bowie's art teacher. The Little Ravens played on the same bill at school as Bowie's band, George and the Dragons. Peter and David would spend lunch breaks together, playing Buddy Holly songs.\n\nAt the age of 14, Peter was playing with a band called the Trubeats followed by a band called the Preachers, who later became Moon's Train, produced and managed by Bill Wyman of the Rolling Stones.\n\nHe became a successful child singer, and in 1966 he became a member of the Herd. He was the lead guitarist and singer, scoring several British pop hits. Frampton was named \"The Face of 1968\" by teen magazine Rave.\n\nIn 1969, when Frampton was 18 years old, he joined Steve Marriott of the Small Faces to form Humble Pie.\n\nWhile playing with Humble Pie, Frampton also did session recording with other artists, including: Harry Nilsson, Jerry Lee Lewis, and John Entwistle's Whistle Rymes, in 1972. Pete Drake introduced him to the \"talk box\" that was to become one of his trademark guitar effects.\n\nAfter four studio albums and one live album with Humble Pie, Frampton left the band and went solo in 1971, just in time to see Rockin' the Fillmore rise up the US charts. He remained with Dee Anthony (1926-2009), the same personal manager that Humble Pie had used. ...\n\nSource: Article \"Peter Frampton\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1950-04-22",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.peterframpton.com/",
        "id": 562708,
        "imdb_id": "nm0289759",
        "known_for_department": "Acting",
        "name": "Peter Frampton",
        "place_of_birth": "Beckenham, London, England, United Kingdom",
        "popularity": 0.2019,
        "profile_path": "/aGuoeLzZAMSe3PvtXB6dipJCGLW.jpg"
    }
}