{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/isRzCN0ATsZ4CdBf6CSGA2ruclW.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 8923,
                "original_language": "en",
                "original_title": "Green Street Hooligans",
                "overview": "After being wrongfully expelled from Harvard University, American Matt Buckner flees to his sister's home in England. Once there, he is befriended by her charming and dangerous brother-in-law, Pete Dunham, and introduced to the underworld of British football hooliganism. Matt learns to stand his ground through a friendship that develops against the backdrop of this secret and often violent world. 'Green Street Hooligans' is a story of loyalty, trust and the sometimes brutal consequences of living close to the edge.",
                "popularity": 4.8125,
                "poster_path": "/oTxHFRSbFcCWdfJB4ozA41Yq57c.jpg",
                "release_date": "2005-09-09",
                "title": "Green Street Hooligans",
                "video": false,
                "vote_average": 7.271,
                "vote_count": 2455,
                "character": "Dave Bjorno",
                "credit_id": "52fe44c8c3a36847f80a9d15",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/538U9snNc2fpnOmYXAPUh3zn31H.jpg",
                "genre_ids": [
                    28,
                    12,
                    53
                ],
                "id": 575265,
                "original_language": "en",
                "original_title": "Mission: Impossible - The Final Reckoning",
                "overview": "Ethan Hunt and team continue their search for the terrifying AI known as the Entity — which has infiltrated intelligence networks all over the globe — with the world's governments and a mysterious ghost from Hunt's past on their trail. Joined by new allies and armed with the means to shut the Entity down for good, Hunt is in a race against time to prevent the world as we know it from changing forever.",
                "popularity": 174.6469,
                "poster_path": "/z53D72EAOxGRqdr7KXXWp9dJiDe.jpg",
                "release_date": "2025-05-17",
                "title": "Mission: Impossible - The Final Reckoning",
                "video": false,
                "vote_average": 7.284,
                "vote_count": 1766,
                "character": "Agent Boulding",
                "credit_id": "682b400e296100ffde648dea",
                "order": 34
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Ross McCall  (b. 13 January 1976, Port Glasgow, Scotland) is a Scottish actor notable for his role as Cpl. Joseph Liebgott in the 2001 HBO miniseries Band of Brothers. His first notable screen role was at the age of 13 when he appeared as Freddie Mercury in the 1989 promotional video for the Queen song \"The Miracle\", the role for which he was picked out of a large number of applicants. In 1993, McCall was featured in BBC children's TV series The Return of the Borrowers. In 2005 Ross co-starred in the independent drama film Green Street. He played Kenny Battaglia in the television series, Crash, on the Starz network. He reprised his role as Dave in the 2009 straight-to-video sequel Green Street 2: Stand Your Ground. In 2008, he co-starred in an After Dark Horrorfest film, Autopsy. McCall was raised Roman Catholic. He was engaged to actress Jennifer Love Hewitt, with whom he Guest starred in an episode of Ghost Whisperer. On 5 January 2009, People Magazine reported that Hewitt called off their engagement in late 2008. He is a supporter of Celtic F.C., and trained at Redroofs Theatre School in Maidenhead. On 23 February 2010, he appeared as a guest star on White Collar on the episode \"Bottlenecked\". Ross was portrayed as Matthew Keller. He reprised the role in episode 14 of White Collar season 2. On 6 March 2010, in an interview with The Mail on Sunday, Sheridan Smith revealed that she and McCall had begun dating after a 10 year friendship. On 1 June 2010, he appeared as a guest star on Luther. He starts production on the feature film 'The Guest Room', shooting at the Sunset Gower studios in LA in July 2010.\n\nDescription above from the Wikipedia article Ross McCall, licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": "1976-01-13",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 56366,
        "imdb_id": "nm0564680",
        "known_for_department": "Acting",
        "name": "Ross McCall",
        "place_of_birth": "Port Glasgow, Scotland, UK",
        "popularity": 1.0068,
        "profile_path": "/qs2hQeIZonf0L45NhTvIGVhRTfZ.jpg"
    }
}