{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rGPoNNk4fvgG2mvkNAxJJPlszOu.jpg",
                "genre_ids": [
                    80,
                    18,
                    53
                ],
                "id": 11368,
                "original_language": "en",
                "original_title": "Blood Simple",
                "overview": "The owner of a seedy small-town Texas bar discovers that one of his employees is having an affair with his wife. A chaotic chain of misunderstandings, lies and mischief ensues after he devises a plot to have them murdered.",
                "popularity": 6.1374,
                "poster_path": "/svU6pu4lfHn0T5BVZchVxL58HB5.jpg",
                "release_date": "1984-03-26",
                "title": "Blood Simple",
                "video": false,
                "vote_average": 7.242,
                "vote_count": 1517,
                "character": "Strip Bar Exhorter",
                "credit_id": "52fe44329251416c7502c245",
                "order": 10
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/rGPoNNk4fvgG2mvkNAxJJPlszOu.jpg",
                "genre_ids": [
                    80,
                    18,
                    53
                ],
                "id": 11368,
                "original_language": "en",
                "original_title": "Blood Simple",
                "overview": "The owner of a seedy small-town Texas bar discovers that one of his employees is having an affair with his wife. A chaotic chain of misunderstandings, lies and mischief ensues after he devises a plot to have them murdered.",
                "popularity": 6.1374,
                "poster_path": "/svU6pu4lfHn0T5BVZchVxL58HB5.jpg",
                "release_date": "1984-03-26",
                "title": "Blood Simple",
                "video": false,
                "vote_average": 7.242,
                "vote_count": 1517,
                "credit_id": "6390daf3d34eb300ef9139ab",
                "department": "Crew",
                "job": "Special Effects Coordinator"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Loren Bivens (born 18 August 1942; age 82), is an Emmy Award-nominated computer effects animator and visual effects supervisor. He was an animator on Star Trek: The Original Series - Remastered as part of CBS Digital. Bivens and other members of the CBS Digital team earned an Emmy Award nomination for their visual effects work on the 2004 TV movie The Winning Season, for which Bivens was Lead CGI Animator. His other work with CBS Digital includes the films Blast (featuring Tommy \"Tiny\" Lister, Jr.), Riding the Bullet (featuring Matt Frewer), and The Last Sin Eater (starring Louise Fletcher), and TV movies such as Category 6: Day of Destruction, Category 7: The End of the World, and Desperation (the latter starring Matt Frewer, Ron Perlman, and Steven Weber). Before he started his animation and visual effects career, Bivens held many other occupations in the entertainment industry. He was the special coordinator for the Coen brothers' first film, 1984's Blood Simple. He later co-wrote, co-directed (with Adam Roarke), and produced the 1986 film Trespasses. Bivens was also a camera operator on this film and also secured locations for shooting. In addition, Bivens was the sound designer and post-production coordinator on the 1986 independent film Shadows of the Wolf. He then served as Director of Photography on the 1988 independent thriller Slipping Into Darkness. In 1994 he was a camera operator and production supervisor on horror film The Return of the Texas Chainsaw Massacre. Bivens has even worked as an actor or a voice actor; he can be seen in Blood Red as well as a number of other independent and short film projects.",
        "birthday": "1942-08-18",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 565192,
        "imdb_id": "nm0084624",
        "known_for_department": "Visual Effects",
        "name": "Loren Bivens",
        "place_of_birth": null,
        "popularity": 0.0327,
        "profile_path": null
    }
}