{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/j4irvwRLITgGr6vcP8NIKCUA67y.jpg",
                "genre_ids": [
                    27,
                    53,
                    14
                ],
                "id": 9003,
                "original_language": "en",
                "original_title": "Hellraiser",
                "overview": "Hedonist Frank Cotton finds a mysterious puzzle box that summons the Cenobites, who open the doors to a dominion where pain and pleasure are indivisible.",
                "popularity": 3.6149,
                "poster_path": "/3Z0oPHyLnk3Vx6ZMC1MiVwIrKhO.jpg",
                "release_date": "1987-09-11",
                "title": "Hellraiser",
                "video": false,
                "vote_average": 6.878,
                "vote_count": 2705,
                "character": "'Butterball' Cenobite",
                "credit_id": "52fe44d0c3a36847f80ab91d",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Simon Bamford  Simon is best known for playing the ‘Butterball Cenobite’ in the original 'Hellraiser' and its first sequel 'Hellbound', as well as ‘Ohnaka’ in Clive Barker's 'Nightbreed'. However it was The Who’s 'Quadrophenia' which gave Simon his first film experience at the age of 16.\n\nDiscovered playing 'The Fool' in a London production of King Lear by film director Clive Barker, he was invited to join 'The Dog Company' where he worked with Doug Bradley (Pinhead) and Oliver Parker (Film director of 'Johnny English Reborn', 'St Trinians', 'Dad's Army', 'Dorian Gray' & Swimming with Men’). 'Hellraiser' and 'Nightbreed' followed shortly afterwards.\n\nSimon was reunited with Clive whilst playing Derek in 'The Book of Blood' for Matador films. He was reunited with Candyman Tony Todd whilst playing ‘Gary’ in 'Dead of the Nite', and can be heard as the voice of ‘Commander Elgin’ in the animation 'The 11th Hour - Jericho'.\n\nIn 2015 he completed four shoots: 'Arcade', 'Roots', 'The Pub Launch' and the auto-cannibalism horror short 'Hunger'. More recently he played the ‘Witchfinder General’ in ‘The Haunting of Margam Castle’ shot in Wales, and in LA, played art gallery owner ‘Mr Peindre’ in ‘14 Ghosts’.\n\nOutside of the horror genre, Simon played the senior consultant in the feature film 'Starfish' starring Tom Riley from 'Da Vinci's Demons' and Golden Globe winner Joanne Froggatt from 'Downton Abbey'. In 2021 he completed production on the award winning feature film ‘You are my Sunshine’ a LGBTQ love story set across several decades.\n\nHe has worked in theatre worldwide from Kuala Lumpur to Stockholm, Ohio to Karachi. and has become a much sought after horror convention guest with USA shows in Atlantic City, Florida, Boston, Las Vegas, Philadelphia, Atlanta, Indianapolis and LA as well as European shows in Germany, The Netherlands, Belgium and the UK.  Simon was invited to play horror legend ‘Peter Vincent’ in the ‘Fright Night’ documentary 'You're so cool Brewster' which won ‘Best Documentary’ at the Top Indie film awards in 2017\n\nHe won ‘Best Actor’ for his portrayal of ‘Pip’ in a stage production of ‘Great Expectations’.  For the 2022 Sci-Fi movie, ‘Project Skyquake’, he won Best Ensemble at the Las Vegas Movie Awards, and was nominated for Best Supporting actor at the Tietê International Film Awards.\n\nHe was awarded the ‘Lifetime of Torment Award’ at Texas Frightmare in 2018\n\nand Lifetime Achievement Award in 2020 at the ‘Russian International Horror Film Festival.\n\nIn 2017 Simon shot the first episode of the ‘Dark Ditties’ series ‘The Offer’, bringing to life the role of smarmy investment banker, ‘Jonathon Brook Davies’.\n\nTo date he has appeared in five of the ‘Dark Ditties Presents’ series.\n\nAll episodes are available now on Amazon & Amazon Prime in both the UK and USA.\n\nIn 2024, the long awaited Horror anthology ‘Mosaic’ is due for release. Simon plays ‘Elliot Foley’, a Detective Inspector, trying to make sense of an increasingly brutal series of bizarre murders. The Hungarian movie ‘Aftermath’ is also due for release this year. Simon plays the voice of ‘Alpha’, a squad leader, in a strange, mysterious world.\n\nHe is currently in pre-production for two new films shooting in 2024.",
        "birthday": "1961-05-22",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 56560,
        "imdb_id": "nm0051472",
        "known_for_department": "Acting",
        "name": "Simon Bamford",
        "place_of_birth": null,
        "popularity": 0.0503,
        "profile_path": "/gyZwaJKan7TuvKl1dh9MwyDdnhB.jpg"
    }
}