{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tsSWHgaFlzzkp3o976juBZbmcs2.jpg",
                "genre_ids": [
                    28,
                    80,
                    878
                ],
                "id": 754,
                "original_language": "en",
                "original_title": "Face/Off",
                "overview": "In order to foil a terrorist plot, an FBI agent undergoes facial transplant surgery and assumes the identity of a criminal mastermind. The plan turns sour when the criminal wakes up prematurely and seeks revenge.",
                "popularity": 7.0107,
                "poster_path": "/69Xzn8UdPbVnmqSChKz2RTpoNfB.jpg",
                "release_date": "1997-06-27",
                "title": "Face/Off",
                "video": false,
                "vote_average": 7.047,
                "vote_count": 5603,
                "character": "Interrogating Agent",
                "credit_id": "632ed11b7719d7007ac438a1",
                "order": 33
            },
            {
                "adult": false,
                "backdrop_path": "/zYM9IbF08gB1Ip3Qee19HPvNY8T.jpg",
                "genre_ids": [
                    28,
                    18,
                    53,
                    80,
                    9648
                ],
                "id": 9386,
                "original_language": "en",
                "original_title": "In the Line of Fire",
                "overview": "Veteran Secret Service agent Frank Horrigan is a man haunted by his failure to save President Kennedy while serving protection detail in Dallas. Thirty years later, a man calling himself \"Booth\" threatens the life of the current President, forcing Horrigan to come back to protection detail to confront the ghosts from his past.",
                "popularity": 4.0366,
                "poster_path": "/3NvOFpmyECI3DNExYMtFIRcGMsu.jpg",
                "release_date": "1993-07-08",
                "title": "In the Line of Fire",
                "video": false,
                "vote_average": 6.965,
                "vote_count": 1685,
                "character": "Tony Carducci",
                "credit_id": "55e643cac3a3685f98000bd3",
                "order": 11
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia.\n\nStephen Arthur \"Steve\" Hytner (born September 28, 1959) is an American actor. He is perhaps best known for his role as Kenny Bania in Seinfeld. He attended Valley Stream Central High School (along with fellow future actors Patricia Charbonneau and Steve Buscemi) in Valley Stream, New York.\n\nHytner appeared as a regular in The Jeff Foxworthy Show, The 100 Lives of Black Jack Savage, and Working, in several episodes of Roswell, and CSI: Crime Scene Investigation, Friends, King of Queens, Dharma and Greg, The X-Files, Lois &amp; Clark: The New Adventures of Superman, Thats So Raven, George Lopez and The Bill Engvall Show.\n\nHe has also appeared in the Disney Channel Original Series, The Suite Life of Zack &amp; Cody as Herman Spatz. He most recently appeared in Good Luck Charlie as \"Marvin\" the bellman and in Sonny with a Chance as \"Murphy\" the troublesome security guard. He is currently in the cast of the HBO series \"Hung\", on which he plays a motivational workshop instructor.\n\nHe has also appeared in the 2006 comedy film Bachelor Party Vegas.\n\nIn 2009, Hytner reprised his role as Kenny Bania on the fictional Seinfeld reunion table read in Curb Your Enthusiasm.\n\nDescription above from the Wikipedia article Steve Hytner, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1959-09-28",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 56576,
        "imdb_id": "nm0405337",
        "known_for_department": "Acting",
        "name": "Steve Hytner",
        "place_of_birth": "USA",
        "popularity": 0.2423,
        "profile_path": "/uTwpVU0GpXiTG9RCLsqKR0A9ekL.jpg"
    }
}