{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/okAHapFqs7Gx9wI8avrMVXVRUzU.jpg",
                "genre_ids": [
                    18,
                    10752
                ],
                "id": 53457,
                "original_language": "fr",
                "original_title": "Elle s'appelait Sarah",
                "overview": "On the night of 16 July 1942, ten year old Sarah and her parents are being arrested and transported to the Velodrome d'Hiver in Paris where thousands of other jews are being sent to get deported. Sarah however managed to lock her little brother in a closet just before the police entered their apartment. Sixty years later, Julia Jarmond, an American journalist in Paris, gets the assignment to write an article about this raid, a black page in the history of France. She starts digging archives and through Sarah's file discovers a well kept secret about her own in-laws.",
                "popularity": 1.108,
                "poster_path": "/peGUaf6HrX7jSi1HifX64QJb7pm.jpg",
                "release_date": "2010-09-16",
                "title": "Sarah's Key",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 696,
                "character": "Client in restaurant (uncredited)",
                "credit_id": "5eb2b0accdbaff001ab57194",
                "order": 60
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/okAHapFqs7Gx9wI8avrMVXVRUzU.jpg",
                "genre_ids": [
                    18,
                    10752
                ],
                "id": 53457,
                "original_language": "fr",
                "original_title": "Elle s'appelait Sarah",
                "overview": "On the night of 16 July 1942, ten year old Sarah and her parents are being arrested and transported to the Velodrome d'Hiver in Paris where thousands of other jews are being sent to get deported. Sarah however managed to lock her little brother in a closet just before the police entered their apartment. Sixty years later, Julia Jarmond, an American journalist in Paris, gets the assignment to write an article about this raid, a black page in the history of France. She starts digging archives and through Sarah's file discovers a well kept secret about her own in-laws.",
                "popularity": 1.108,
                "poster_path": "/peGUaf6HrX7jSi1HifX64QJb7pm.jpg",
                "release_date": "2010-09-16",
                "title": "Sarah's Key",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 696,
                "credit_id": "52fe4867c3a36847f816585d",
                "department": "Writing",
                "job": "Novel"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Tatiana de Rosnay (born 28 September 1961) is a Franco-British writer.\n\nTatiana de Rosnay was born on 28 September 1961 in the suburbs of Paris. She is of English, French and Russian descent. Her father is French scientist Joël de Rosnay, her grandfather was painter Gaëtan de Rosnay and they were born in Mauritius. Tatiana's paternal great-grandmother was Russian actress Natalia Rachewskïa, director of the Leningrad Pushkin Theatre from 1925 to 1949.\n\nTatiana's mother is English, Stella Jebb, daughter of diplomat and former Secretary-General of the United Nations, Gladwyn Jebb, and great-great-granddaughter of Isambard Kingdom Brunel, the British engineer. Tatiana is also the niece of historian Hugh Thomas. Tatiana was raised in Paris and then in Boston, when her father taught at MIT in the 1970s. She moved to England in the early 1980s and obtained a bachelor's degree in English literature at the University of East Anglia, in Norwich. On her return to Paris in 1984, she was a press officer, then became a journalist and literary critic for Psychologies Magazine.\n\nSince 1992, de Rosnay has published twelve novels in French and six in English. She has also worked on the series Family Affairs for which she has written two episodes with the screenwriter Pierre-Yves Lebert. This series was broadcast on TF1 during the summer of 2000.\n\nIn 2007, de Rosnay published her most popular novel, Sarah's Key. The book has sold over three million copies in French and almost two million in English. In 2009 the book was adapted into the French film Sarah's Key by Serge Joncour, with Kristin Scott Thomas as Julia.\n\nIn January 2010, several French magazines issued a ranking of the top French novelists, placing de Rosnay at number eight. In January 2011, Le Figaro magazine published a ranking of the top ten most read French authors. This collation positioned de Rosnay at fifth.\n\nSource: Article \"Tatiana de Rosnay\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1961-09-28",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.tatianaderosnay.com",
        "id": 566309,
        "imdb_id": "nm4058200",
        "known_for_department": "Writing",
        "name": "Tatiana De Rosnay",
        "place_of_birth": "Neuilly-sur-Seine, Hauts-de-Seine, France",
        "popularity": 0.1133,
        "profile_path": "/oIxFHM4oYaxd3bedNHXioj9Rtyu.jpg"
    }
}