{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fBvSfLetWlAMevQVHa0nBDV1Fon.jpg",
                "genre_ids": [
                    28,
                    53
                ],
                "id": 1572,
                "original_language": "en",
                "original_title": "Die Hard: With a Vengeance",
                "overview": "New York detective John McClane is back and kicking bad-guy butt in the third installment of this action-packed series, which finds him teaming with civilian Zeus Carver to prevent the loss of innocent lives. McClane thought he'd seen it all, until a genius named Simon engages McClane, his new \"partner\" -- and his beloved city -- in a deadly game that demands their concentration.",
                "popularity": 7.0984,
                "poster_path": "/buqmCdFQEWwEpL3agGgg2GVjN2d.jpg",
                "release_date": "1995-05-19",
                "title": "Die Hard: With a Vengeance",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 6368,
                "character": "Dexter's Friend",
                "credit_id": "5f31b70d7739410037e9c029",
                "order": 15
            },
            {
                "adult": false,
                "backdrop_path": "/yizL4cEKsVvl17Wc1mGEIrQtM2F.jpg",
                "genre_ids": [
                    28,
                    878,
                    12
                ],
                "id": 588228,
                "original_language": "en",
                "original_title": "The Tomorrow War",
                "overview": "The world is stunned when a group of time travelers arrive from the year 2051 to deliver an urgent message: Thirty years in the future, mankind is losing a global war against a deadly alien species. The only hope for survival is for soldiers and civilians from the present to be transported to the future and join the fight. Among those recruited is high school teacher and family man Dan Forester. Determined to save the world for his young daughter, Dan teams up with a brilliant scientist and his estranged father in a desperate quest to rewrite the fate of the planet.",
                "popularity": 14.8499,
                "poster_path": "/34nDCQZwaEvsy4CFO5hkGRFDCVU.jpg",
                "release_date": "2021-09-03",
                "title": "The Tomorrow War",
                "video": false,
                "vote_average": 7.493,
                "vote_count": 3819,
                "character": "Dorian",
                "credit_id": "608aa61d66469a002b1a9da0",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/4gWUlxECoziJ9TrGNfymNYxZf6Z.jpg",
                "genre_ids": [
                    16,
                    878,
                    14,
                    28
                ],
                "id": 831405,
                "original_language": "en",
                "original_title": "Injustice",
                "overview": "When Lois Lane is killed, an unhinged Superman decides to take control of the Earth. Determined to stop him, Batman creates a team of freedom-fighting heroes. But when superheroes go to war, can the world survive?",
                "popularity": 4.3308,
                "poster_path": "/rzrSeqqpm1BwJ3tcTznztBtLLSD.jpg",
                "release_date": "2021-10-09",
                "title": "Injustice",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 812,
                "character": "Michael Holt / Mr. Terrific / Waylon Jones / Killer Croc (voice)",
                "credit_id": "60f8ac9a11386c007d5957ac",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Eddie",
            "Edwin Martel Basil Hodge",
            "ادوین هاج"
        ],
        "biography": "Edwin Martel Basil Hodge (born January 26, 1985) is an American actor and the older brother of actor Aldis Hodge. He is known for portraying Dante Bishop in The Purge film series, and is the only actor to appear in all of the first three films. \n\nHe played the role of \"the Bloody Stranger\" in the horror film The Purge (2013) and its sequels The Purge: Anarchy (2014) and The Purge: Election Year (2016); \"the Bloody Stranger\" was revealed to be named Dante Bishop in the third film. He also appeared in the horror film As Above, So Below (2014).\n\nHe's appeared in other films including Die Hard with a Vengeance, The Long Kiss Goodnight, Big Momma's House, Take Me Home Tonight, Red Dawn (2012), Bumblebee, and The Tomorrow War.\n\nOn TV, he guest starred on an episode of the TNT series Leverage, which stars his younger brother Aldis Hodge. His other guest roles include 7th Heaven, Angel, Boston Public, Touched by an Angel, Cold Case, Grey's Anatomy, Ghost Whisperer, Heroes, Bones, One Tree Hill, CSI: Miami, NCIS, Private Practice, NCIS: LA, Rosewood, and All Rise.\n\nHis major TV recurring roles were as Jamaal Crenshaw on Boston Public, Brett on Invasion, Malcolm Darius Washington on Mental, Wade on Cougar Town, firefighter Rick Newhouse on Chicago Fire, Dr. Greg Young on Secrets & Lies, Benjamin Banneker on Sleepy Hollow, and Clayton Poole on For All Mankind.\n\nHe's starred as Marcus Ride on Jack & Bobby, Robert Chase on SIX, and Dr. Malcolm Kingsley on Good Sam. He stars as Ray Cannon on FBI: Most Wanted, starting in Season 4, fall of 2022.",
        "birthday": "1985-01-26",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 56679,
        "imdb_id": "nm0388064",
        "known_for_department": "Acting",
        "name": "Edwin Hodge",
        "place_of_birth": "Jacksonville, North Carolina, USA",
        "popularity": 0.4779,
        "profile_path": "/lkouUtGzfgUPUj1LP8cEk8yvKXo.jpg"
    }
}