{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rn3E4Kd7EUOGOF95Hsd0aOhQqZg.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 30890,
                "original_language": "en",
                "original_title": "Radio Days",
                "overview": "The Narrator tells us how the radio influenced his childhood in the days before TV. In the New York City of the late 1930s to the New Year's Eve 1944, this coming-of-age tale mixes the narrator's experiences with contemporary anecdotes and urban legends of the radio stars.",
                "popularity": 4.1435,
                "poster_path": "/ljZ3yyYznAiq1vF6nHITdJn6qXB.jpg",
                "release_date": "1987-01-30",
                "title": "Radio Days",
                "video": false,
                "vote_average": 7.047,
                "vote_count": 603,
                "character": "Father",
                "credit_id": "52fe44489251416c9100b375",
                "order": 13
            },
            {
                "adult": false,
                "backdrop_path": "/3wwMtp2F7CgmOl2EX9q1r2yjOEk.jpg",
                "genre_ids": [
                    14,
                    35,
                    10749
                ],
                "id": 10849,
                "original_language": "en",
                "original_title": "The Purple Rose of Cairo",
                "overview": "Cecilia is a waitress in New Jersey, living a dreary life during the Great Depression. Her only escape from her mundane reality is the movie theatre. After losing her job, Cecilia goes to see 'The Purple Rose of Cairo' in hopes of raising her spirits, where she watches dashing archaeologist Tom Baxter time and again.",
                "popularity": 4.4532,
                "poster_path": "/ccsint43E44B7NGceEhVimD93Yt.jpg",
                "release_date": "1985-03-01",
                "title": "The Purple Rose of Cairo",
                "video": false,
                "vote_average": 7.399,
                "vote_count": 1084,
                "character": "Gil's Agent",
                "credit_id": "61aaf049bf09d100195adec1",
                "order": 59
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "​From Wikipedia, the free encyclopedia.\n\nMichael Tucker  (born February 6, 1945) is an American actor and author, most widely known for his role in L.A. Law, a portrayal for which he received Emmy nominations three years in a row.\n\nTucker was born in Baltimore, Maryland and is a graduate of the Baltimore City College high school and Carnegie-Mellon University in Pittsburgh, Pennsylvania, where he was close to the American T.V. writer and producer, Steven Bochco, later to create L.A. Law. His acting experience includes early appearances with Joseph Papp and a major stint at the Arena Theatre, in Washington, D.C. He also has worked with Lina Wertmuller, Woody Allen, and Barry Levinson (also from Baltimore).\n\nTucker played Stuart Markowitz in L.A. Law, where he co-starred with his wife Jill Eikenberry.\n\nBoth he and Eikenberry are active in fund-raising for breast cancer research and treatment. He has written three books, including Living in a Foreign Language: A Memoir of Food, Wine, and Love in Italy, which describes his buying a house in a small Italian village and mastering the fine art of Italian cooking. He is the author of \"Notes From The Culinary Wasteland\" a blog about food, travel and the good life.\n\nAfter meeting artist Emile Norman, Eikenberry and Tucker purchased land from him to become his neighbors in Big Sur, California. In 2008 they produced a PBS documentary, Emile Norman: By His Own Design\n\nDescription above from the Wikipedia article Michael Tucker, licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": "1945-02-06",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 56695,
        "imdb_id": "nm0875951",
        "known_for_department": "Acting",
        "name": "Michael Tucker",
        "place_of_birth": "Baltimore, Maryland, USA",
        "popularity": 0.2999,
        "profile_path": "/ewcHHv9SKFcE8GBcs6kqiZIDHjw.jpg"
    }
}