{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/t9kQnqiaxQ8TLB25rTzDKLd0fdM.jpg",
                "genre_ids": [
                    80,
                    28
                ],
                "id": 187,
                "original_language": "en",
                "original_title": "Sin City",
                "overview": "Welcome to Sin City. This town beckons to the tough, the corrupt, the brokenhearted. Some call it dark… Hard-boiled. Then there are those who call it home — Crooked cops, sexy dames, desperate vigilantes. Some are seeking revenge, others lust after redemption, and then there are those hoping for a little of both. A universe of unlikely and reluctant heroes still trying to do the right thing in a city that refuses to care.",
                "popularity": 9.0969,
                "poster_path": "/i66G50wATMmPrvpP95f0XP6ZdVS.jpg",
                "release_date": "2005-04-01",
                "title": "Sin City",
                "video": false,
                "vote_average": 7.465,
                "vote_count": 8446,
                "character": "Nancy",
                "credit_id": "52fe4224c3a36847f800738b",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jessica Marie Alba",
            "Τζέσικα Μαρί Άλμπα",
            "ジェシカ・アルバ",
            "ジェシカ・マリー・アルバ",
            "جسیکا آلبا"
        ],
        "biography": "Jessica Marie Alba (/ˈælbə/ AL-bə; born April 28, 1981) is an American actress, businesswoman, and entrepreneur. She began her acting career at age 13 in Camp Nowhere (1994), followed up by The Secret World of Alex Mack (1994), and rose to prominence at age 19 as the lead actress of the television series Dark Angel (2000–2002), for which she received a Golden Globe nomination.\n\nHer big screen breakthrough came in Honey (2003). She soon established herself as a Hollywood actress and has starred in numerous box office hits throughout her career, including Fantastic Four (2005), Fantastic Four: Rise of the Silver Surfer (2007), Good Luck Chuck (2007), The Eye (2008), Valentine's Day (2010), Little Fockers (2010), and Mechanic: Resurrection (2016). She is a frequent collaborator with director Robert Rodriguez, having starred in Sin City (2005), Machete (2010), Spy Kids: All the Time in the World (2011), Machete Kills (2013), and Sin City: A Dame to Kill For (2014). From 2019 to 2020, Alba starred in the Spectrum action crime series L.A.'s Finest.\n\nIn 2011, Alba co-founded The Honest Company, a consumer goods company that sells baby, personal, and household products. A number of magazines, including Men's Health, Vanity Fair, and FHM, have included Alba on their lists of the world's most beautiful women.\n\nDescription above from the Wikipedia article Jessica Alba, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1981-04-28",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 56731,
        "imdb_id": "nm0004695",
        "known_for_department": "Acting",
        "name": "Jessica Alba",
        "place_of_birth": "Pomona, California, USA",
        "popularity": 2.5894,
        "profile_path": "/jCImuXo4TqdWeIs4Hc2tO0U28LV.jpg"
    }
}