{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/a8IFeO1BMn4QEfLsf41Ml7LodyC.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 72570,
                "original_language": "en",
                "original_title": "The Vow",
                "overview": "Happy young married couple Paige and Leo are, well, happy. Then a car accident puts Paige into a life-threatening coma. Upon awakening she has lost the previous five years of memories, including those of her beloved Leo, her wedding, a confusing relationship with her parents, or the ending of her relationship with her ex-fiance. Despite these complications, Leo endeavors to win her heart again and rebuild their marriage.",
                "popularity": 7.0617,
                "poster_path": "/y5GUXzTvt7kSQbdQrSvbYNoa8HB.jpg",
                "release_date": "2012-02-05",
                "title": "The Vow",
                "video": false,
                "vote_average": 7.236,
                "vote_count": 4143,
                "character": "Diane",
                "credit_id": "6009016c0752880041757c2d",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Sarah Sanguin Carter"
        ],
        "biography": "Known primarily for her acting career 'In Her Name' is Sarah Carter's debut as a feature director and filmmaker, which premiered at Tribeca Film Festival 2022. Canadian-born, Sarah trained classically in theater, dance, and fine arts at Ryerson University Toronto. When she arrived in Los Angeles, her acting career took off quickly with string of long running series regular roles. She became well known for her role as \"Madeleine Poe\" opposite James Woods, on CBS' Shark directed by Spike Lee and most recently she took the lead as \"Harper Deakins\" opposite, Cole Hauser and Richard Shiff on her series Rogue.\n\nWorking and traveling alone as an actor for over a decade, she values her ability to bond and communicate beyond language and culture. As a practicing Buddhist and yogini, with professional training in core energetics, and having acquired teaching status for her studies with Dr. Clarissa Pinkola Estes on story analysis and channeling archetypes, Sarah applies her experience as a mystic to all facets of her life's work.\n\nAlong with being a professional actor, director, writer, producer, and devoted mother, Sarah is as a singer/songwriter in her band, \"SanguinDrake.\"",
        "birthday": "1980-10-30",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 56825,
        "imdb_id": "nm0141931",
        "known_for_department": "Acting",
        "name": "Sarah Carter",
        "place_of_birth": "Toronto, Ontario, Canada",
        "popularity": 1.1654,
        "profile_path": "/hjH8vNv9LSZPmo56ikNbIX5UAKu.jpg"
    }
}