{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/y2FNZLHynsevBnVTocGW6c3pQpr.jpg",
                "genre_ids": [
                    18
                ],
                "id": 422,
                "original_language": "it",
                "original_title": "8½",
                "overview": "Guido Anselmi, a film director, finds himself creatively barren at the peak of his career. Urged by his doctors to rest, Anselmi heads for a luxurious resort, but a sorry group gathers—his producer, staff, actors, wife, mistress, and relatives—each one begging him to get on with the show. In retreat from their dependency, he fantasizes about past women and dreams of his childhood.",
                "popularity": 4.83,
                "poster_path": "/t8pFvll3cFrn5NmqZz2FawqIwPe.jpg",
                "release_date": "1963-02-14",
                "title": "8½",
                "video": false,
                "vote_average": 8.1,
                "vote_count": 2411,
                "character": "Carla",
                "credit_id": "52fe4241c3a36847f801013f",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Salvatrice Elena Greco"
        ],
        "biography": "Sandra Milo (born Salvatrice Elena Greco; 11 March 1933, Tunisi - 29 January 2024, Rome) was an Italian actress, television personality, author, and musician. She won a Silver Ribbon best supporting actress award for each of her roles in Federico Fellini's 8½ and Juliet of the Spirits.\n\nShe made her film debut in 1955 alongside Alberto Sordi in The Bachelor. Her first major role came in 1959 thanks to the producer Moris Ergas, in General della Rovere, directed by Roberto Rossellini. She also appeared in his film, Vanina Vanini, but Rossellini's career was cut short after the film received harsh criticism at the Venice Festival.\n\nAfter she got married, she retired from her acting career.\n\nUntil discovered by Fellini, Milo had mostly performed in comedies and melodramas. Although she was reluctant to make a comeback, Fellini convinced her to take on the role of the sexy, lightheaded mistress opposite Marcello Mastroianni in 8½. The movie, which won universal acclaim, failed to change the public perception of her and although she was cast in Juliet of the Spirits, most of her following endeavors were second-rate films.\n\nIn the mid-1960s, Milo was hostess of a television program in Rome.\n\nShe retired again from acting in 1968, only to make a second comeback in 1979. Her roles have shifted from that of the temptress to more stern middle-aged women.\n\nIn 2006-07 she toured Italy with the theatrical adaptation of 8 Women.\n\nShe married Moris Ergas with whom she had a daughter Deborah, and later married Ottavio De Lollis with whom she had two children, Ciro and Azzurra.\n\nSandra Milo was Roman Catholic.\n\nSource: Article \"Sandra Milo\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1933-03-11",
        "deathday": "2024-01-29",
        "gender": 1,
        "homepage": null,
        "id": 5683,
        "imdb_id": "nm0590452",
        "known_for_department": "Acting",
        "name": "Sandra Milo",
        "place_of_birth": " Tunis, French Protectorate Tunisia [now Tunisia]",
        "popularity": 0.368,
        "profile_path": "/uBuFRl43GcQN4qAbeWA9rvkY2Yf.jpg"
    }
}