{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/n5A7brJCjejceZmHyujwUTVgQNC.jpg",
                "genre_ids": [
                    14,
                    12
                ],
                "id": 12445,
                "original_language": "en",
                "original_title": "Harry Potter and the Deathly Hallows: Part 2",
                "overview": "Harry, Ron and Hermione continue their quest to vanquish the evil Voldemort once and for all. Just as things begin to look hopeless for the young wizards, Harry discovers a trio of magical objects that endow him with powers to rival Voldemort's formidable skills.",
                "popularity": 18.4924,
                "poster_path": "/c54HpQmuwXjHq2C9wmoACjxoom3.jpg",
                "release_date": "2011-07-12",
                "title": "Harry Potter and the Deathly Hallows: Part 2",
                "video": false,
                "vote_average": 8.084,
                "vote_count": 21282,
                "character": "Scorpius Malfoy (19 Years Later)",
                "credit_id": "52fe44e39251416c75044703",
                "order": 88
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Bertie Gilbert is a director and writer, based in London. He serves as a pioneer for a new wave of young filmmakers, and was recently classified as one of the 'Five New Wes Andersons' by Dazed. In 2016 he was also part of the Dazed 100, a 'definitive list of creatives shaping youth culture'. His bleakly whimsical independent films are watched by a global online community of hundreds of thousands of loyal viewers.\n\nHis notable successes include short film Blue Sushi, which was funded by Google. The film earned significant praise both in the digital and linear world. In 2016 he created 'Let it Be', a short film amassing almost one million views on YouTube. In 2017 he created 'Playground' a film funded by Ron Howard's Newform Digital. In 2018 he completed his most recent short 'Stomping Grounds' starring Bill Milner which has garnered significant festival attention. He is currently working on a number of feature projects.\n\nBio from IMDb",
        "birthday": "1997-05-01",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.youtube.com/user/BertiebertG",
        "id": 568402,
        "imdb_id": "nm3633758",
        "known_for_department": "Acting",
        "name": "Bertie Gilbert",
        "place_of_birth": null,
        "popularity": 0.1151,
        "profile_path": "/8xSy8wglNVMWAipaLiNTRv8lb3n.jpg"
    }
}