{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/y2FNZLHynsevBnVTocGW6c3pQpr.jpg",
                "genre_ids": [
                    18
                ],
                "id": 422,
                "original_language": "it",
                "original_title": "8½",
                "overview": "Guido Anselmi, a film director, finds himself creatively barren at the peak of his career. Urged by his doctors to rest, Anselmi heads for a luxurious resort, but a sorry group gathers—his producer, staff, actors, wife, mistress, and relatives—each one begging him to get on with the show. In retreat from their dependency, he fantasizes about past women and dreams of his childhood.",
                "popularity": 4.83,
                "poster_path": "/t8pFvll3cFrn5NmqZz2FawqIwPe.jpg",
                "release_date": "1963-02-14",
                "title": "8½",
                "video": false,
                "vote_average": 8.13,
                "vote_count": 2411,
                "character": "Mysterious Lady",
                "credit_id": "52fe4241c3a36847f801014f",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Caterino Boratto",
            "Катерина Боратто"
        ],
        "biography": "Caterina Boratto (15 March 1915 – 14 September 2010) was an Italian film actress. She appeared in 50 films between 1936 and 1993.\n\nBorn in Turin, Boratto studied at the Musical Lyceum in her hometown with the purpose of becoming a singer; noted by Guido Brignone, she made her debut in To Live, alongside Tito Schipa. Thanks to the film's success, she immediately became a star in the Telefoni Bianchi genre, and also got a seven-year contract with Metro-Goldwyn-Mayer which eventually dissolved because of World War II.\n\nIn 1943, Boratto lost two brothers, the partisan Renato and the soldier Filiberto, killed in the massacre of the Acqui Division. In 1944, she married a doctor, Armando Ceratto, with whom she had two children. Except for a film in 1951, she basically retired from show business for twenty years before accepting to play two key roles in 8½ and Juliet of the Spirits by Federico Fellini, who had known her in the set of The Peddler and the Lady, where he had served as screenwriter. Starting from the second half of the 1960s, Boratto resumed appearing in films with some regularity, and from the late 1970s, she also became very active on television, being cast in dozens of TV series.",
        "birthday": "1915-03-14",
        "deathday": "2010-09-14",
        "gender": 1,
        "homepage": null,
        "id": 5686,
        "imdb_id": "nm0095950",
        "known_for_department": "Acting",
        "name": "Caterina Boratto",
        "place_of_birth": "Rome - Lazio - Italy",
        "popularity": 0.2163,
        "profile_path": "/bG0jlOnMdhgvrqKaIHrQwLcmToI.jpg"
    }
}