{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rLm66DbLwxHeRB34oJ1mhsu0urc.jpg",
                "genre_ids": [
                    27,
                    53,
                    18
                ],
                "id": 11167,
                "original_language": "en",
                "original_title": "Peeping Tom",
                "overview": "Loner Mark Lewis works at a film studio during the day and, at night, takes racy photographs of women. Also he's making a documentary on fear, which involves recording the reactions of victims as he murders them. He befriends Helen, the daughter of the family living in the apartment below his, and he tells her vaguely about the movie he is making.",
                "popularity": 2.2628,
                "poster_path": "/kM4AfLIlbcuRZ621vYjyeBFkuba.jpg",
                "release_date": "1960-05-16",
                "title": "Peeping Tom",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 846,
                "character": "Arthur Baden",
                "credit_id": "52fe44069251416c750265c3",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/xLJCny81gf2E4Q6VhtuNhgKHbUi.jpg",
                "genre_ids": [
                    18
                ],
                "id": 16391,
                "original_language": "en",
                "original_title": "Black Narcissus",
                "overview": "A group of Anglican nuns, led by Sister Clodagh, are sent to a mountain in the Himalayas. The climate in the region is hostile and the nuns are housed in an odd old palace. They work to establish a school and a hospital, but slowly their focus shifts. Sister Ruth falls for a government worker, Mr. Dean, and begins to question her vow of celibacy. As Sister Ruth obsesses over Mr. Dean, Sister Clodagh becomes immersed in her own memories of love.",
                "popularity": 2.4187,
                "poster_path": "/jSbFWWbkUq5N5ikewJHNATcWnxS.jpg",
                "release_date": "1947-05-26",
                "title": "Black Narcissus",
                "video": false,
                "vote_average": 7.522,
                "vote_count": 513,
                "character": "The Old General",
                "credit_id": "52fe46cf9251416c75084491",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/cSbBSHHiy849SUhyTW6FX4Dbj43.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 19542,
                "original_language": "en",
                "original_title": "The Red Shoes",
                "overview": "In this classic drama, Vicky Page is an aspiring ballerina torn between her dedication to dance and her desire to love. While her imperious instructor, Boris Lermontov, urges to her to forget anything but ballet, Vicky begins to fall for the charming young composer Julian Craster. Eventually Vicky, under great emotional stress, must choose to pursue either her art or her romance, a decision that carries serious consequences.",
                "popularity": 1.2873,
                "poster_path": "/b7x6Wq9Mss2hOgf0fnVX7gBagJw.jpg",
                "release_date": "1948-09-06",
                "title": "The Red Shoes",
                "video": false,
                "vote_average": 7.971,
                "vote_count": 700,
                "character": "Livy",
                "credit_id": "52fe47dd9251416c750a816f",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Esmond Penington Knight",
            "Эсмонд Найт"
        ],
        "biography": "Esmond Penington Knight (4 May 1906 – 23 February 1987) was an English actor.\n\nHe was an accomplished actor with a career spanning over half a century. For much of his career Esmond Knight was virtually blind. He had been badly injured in 1941 whilst on active service on board HMS Prince of Wales when she fought the Bismarck at the Battle of the Denmark Strait, and remained totally blind for two years, though he later regained some sight in his right eye.\n\nDuring this period, Esmond dictated an early autobiography to his secretary, Annabella Cloudsley, Seeking The Bubble (Hutchinson &amp; Co. 1943). He played the captain of the HMS Prince of Wales in the 1960 movie Sink the Bismarck!\n\nHe starred as Professor Ernest Reinhart in the 1961 British science fiction television series, A for Andromeda, alongside Patricia Kneale and Peter Halliday.\n\nHis daughter is the actress Rosalind Knight. Knight died of a heart attack. He was cremated.\n\nDescription above from the Wikipedia article Esmond Knight, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1906-05-04",
        "deathday": "1987-02-23",
        "gender": 2,
        "homepage": null,
        "id": 56875,
        "imdb_id": "nm0460874",
        "known_for_department": "Acting",
        "name": "Esmond Knight",
        "place_of_birth": "East Sheen, Surrey, England",
        "popularity": 0.2166,
        "profile_path": "/czwSqQgBDb8WpCpppeFrOn0JD8r.jpg"
    }
}