{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hPsCR1ny6GnctJkWqeJwihTDD7T.jpg",
                "genre_ids": [
                    53,
                    878,
                    9648,
                    10749
                ],
                "id": 782,
                "original_language": "en",
                "original_title": "Gattaca",
                "overview": "Vincent is an all-too-human man who dares to defy a system obsessed with genetic perfection. He is an \"In-Valid\" who assumes the identity of a member of the genetic elite to pursue his goal of traveling into space with the Gattaca Aerospace Corporation.",
                "popularity": 6.9278,
                "poster_path": "/eSKr5Fl1MEC7zpAXaLWBWSBjgJq.jpg",
                "release_date": "1997-09-07",
                "title": "Gattaca",
                "video": false,
                "vote_average": 7.564,
                "vote_count": 6609,
                "character": "Geneticist",
                "credit_id": "5bb5f20ec3a368150c00dd4d",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Блер Андервуд",
            "بلیر آندروود"
        ],
        "biography": "Blair Underwood (born August 25, 1964) is an American television and film actor. He is perhaps best known as headstrong attorney Jonathan Rollins from the NBC legal drama L.A. Law, a role he portrayed for seven years. He has gained critical acclaim throughout his career, receiving numerous Golden Globe Award nominations, three NAACP Image Awards and 1 Grammy Award.\n\nHis feature film debut was the 1985 movie Krush Groove. His 1985 appearance on The Cosby Show landed him a short stint on the ABC soap opera One Life to Live, which eventually led to his performance on the TV series L.A. Law, where he appeared from 1987 to 1994.\n\nUnderwood broke into film with roles in Just Cause (1995), Set It Off (1996) and Deep Impact (1998). He also had a supporting role as a geneticist in the film Gattaca. In 2000, he played the lead role in the short-lived television series City of Angels. In 2003, he guest starred in four episodes on the HBO series Sex and the City playing Cynthia Nixon's love interest. In 2004, he played the role of Roger De Souza opposite Heather Locklear in NBC's LAX.\n\nHe gained acclaim as the sexy grade school teacher in the CBS sitcom The New Adventures of Old Christine opposite Julia Louis-Dreyfus for two years. In 2007, he guest starred in an episode of the NBC series Law & Order: Special Victims Unit. His also had a role as recurring character Alex in the HBO series In Treatment. Also in 2007, Underwood co-authored the novel Casanegra: A Tennyson Hardwick Novel with husband-and-wife team Steven Barnes and Tananarive Due.\n\nHe's also had recurring roles on Dirty Sexy Money, NBC's The Event, Ironside, Marvel's Agents of S.H.I.E.L.D., and Quantico.\n\nHe has received three NAACP Image Awards, for his film work in Rules of Engagement, and his television work in L.A. Law, City of Angels, Murder in Mississippi and Mama Flora's Family. He was voted one of People's \"50 Most Beautiful People\" in 2000, and one of TV Guide's \"Most Influential Faces of the 90s\".",
        "birthday": "1964-08-25",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 56871,
        "imdb_id": "nm0005516",
        "known_for_department": "Acting",
        "name": "Blair Underwood",
        "place_of_birth": "Tacoma, Washington, USA",
        "popularity": 0.5416,
        "profile_path": "/q3K7VBkatkns31cCP7PMmdasHUm.jpg"
    }
}