{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fHDvGGPFry65ou79WLi6JsjCZrM.jpg",
                "genre_ids": [
                    35
                ],
                "id": 632856,
                "original_language": "en",
                "original_title": "Spirited",
                "overview": "Each Christmas Eve, the Ghost of Christmas Present selects one dark soul to be reformed by a visit from three spirits. But this season, he picked the wrong Scrooge. Clint Briggs turns the tables on his ghostly host until Present finds himself reexamining his own past, present and future.",
                "popularity": 2.9497,
                "poster_path": "/h3zAzTMs5EP3cKusOxFNGSFE1WI.jpg",
                "release_date": "2022-11-10",
                "title": "Spirited",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 676,
                "character": "Yet-To-Come (voice)",
                "credit_id": "636ea1b7d7fbda007bef2ea8",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/sJjuXNHNT7PfzcgkqM3oSIkVOXB.jpg",
                "genre_ids": [
                    16,
                    35,
                    10751,
                    9648
                ],
                "id": 385103,
                "original_language": "en",
                "original_title": "Scoob!",
                "overview": "In Scooby-Doo’s greatest adventure yet, see the never-before told story of how lifelong friends Scooby and Shaggy first met and how they joined forces with young detectives Fred, Velma, and Daphne to form the famous Mystery Inc. Now, with hundreds of cases solved, Scooby and the gang face their biggest, toughest mystery ever: an evil plot to unleash the ghost dog Cerberus upon the world. As they race to stop this global “dogpocalypse,” the gang discovers that Scooby has a secret legacy and an epic destiny greater than anyone ever imagined.",
                "popularity": 5.077,
                "poster_path": "/jHo2M1OiH9Re33jYtUQdfzPeUkx.jpg",
                "release_date": "2020-07-08",
                "title": "Scoob!",
                "video": false,
                "vote_average": 7.009,
                "vote_count": 1754,
                "character": "Captain Caveman (voice)",
                "credit_id": "5c7c5488925141737f46726f",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Tracy Jamal Morgan",
            "تریسی مورگان"
        ],
        "biography": "​American actor, comedian and author Tracy Jamal Morgan is best known for his eight seasons as a cast member on Saturday Night Live and currently known for playing the role of Tracy Jordan on the NBC series 30 Rock.\n\nMorgan began his career on Martin, where he played Hustle Man. In the 2003 Chris Rock film Head of State, Morgan appeared as a man watching television, often questioning why they are not watching Martin. Morgan was also a regular cast member on \"Uptown Comedy Club which aired for two seasons between 1992 and 1994. He was also on the HBO show Snaps. Morgan joined the cast of comedy show Saturday Night Live in 1996, where he performed as a regular until 2003.\n\nMorgan married his high school sweetheart Sabina in 1985. They have three sons together. Morgan filed for divorce at Bronx Supreme Court on August 7, 2009 after 23 years of marriage, although he and his wife had been already separated for eight years.",
        "birthday": "1968-11-10",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 56903,
        "imdb_id": "nm0605079",
        "known_for_department": "Acting",
        "name": "Tracy Morgan",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.9806,
        "profile_path": "/ec0OJVbs6NZKMbS1yiCAJKjeoJf.jpg"
    }
}