{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/56MLZww2dMVAaTt5LDKCBu1do2X.jpg",
                "genre_ids": [
                    16,
                    18,
                    14
                ],
                "id": 9081,
                "original_language": "en",
                "original_title": "Waking Life",
                "overview": "Waking Life is about a young man in a persistent lucid dream-like state. The film follows its protagonist as he initially observes and later participates in philosophical discussions that weave together issues like reality, free will, our relationships with others, and the meaning of life.",
                "popularity": 3.1675,
                "poster_path": "/2MRM4PL6H7yraAkwyUEe2EqoQH3.jpg",
                "release_date": "2001-10-19",
                "title": "Waking Life",
                "video": false,
                "vote_average": 7.471,
                "vote_count": 906,
                "character": "Bartender",
                "credit_id": "5ebb60151dbc88001ada2fd7",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nKen Webster (born July 29, 1957 in Port Arthur, Texas) is the artistic director of Hyde Park Theatre in Austin, Texas. He has been nominated for 47 B. Iden Payne Awards and 20 Critics' Table Awards for acting, directing, and producing. He has received fourteen B. Iden Payne Awards, including a 2008 award for directing \"Dog Sees God\" and a 2007 award for directing \"The Pillowman\", a 2004 award for directing The Drawer Boy and a 2003 award for directing Quake at HPT. He also won the 2007 Critics Table Award for Outstanding Lead Acting for \"St. Nicholas\" and \"Thom Pain (based on nothing)\", and a 2003 Austin Critics’ Table award for directing Something Someone Someplace Else and Marion Bridge for HPT, and was awarded the 1999 Critics’ Table John Bustin Award for \"conspicuous achievement.\" His directing credits for HPT include \"The Pillowman\", \"Thom Pain (based on nothing)\", \"My Child, My Child, My Alien Child\", You're No One's Nothing Special, Lonely, The Evidence of Silence Broken, Chopper, The Glory of Living, Radio :30, Ham, Blue Surge, Perdita, Blur, and the world premiere of Art Stripped Naked. His acting credits include \"Blackbird\", \"The Pillowman\", The Water Principle, Vigil, and House for HPT. His recent film and television acting credits include Waking Life , A Scanner Darkly, and Friday Night Lights. Webster is the only director to have received the B. Iden Payne Award for directing in each of the last three decades. He was inducted into the Austin Arts Hall of Fame in June 2006. Webster is married to Austin actress Katherine Catmull.\n\nHe recently did a voiceover in Metroid Prime 3: Corruption.\n\nDescription above from the Wikipedia article Ken Webster, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1957-07-29",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 56935,
        "imdb_id": "nm0916939",
        "known_for_department": "Acting",
        "name": "Ken Webster",
        "place_of_birth": "Port Arthur, Texas, USA",
        "popularity": 0.0311,
        "profile_path": "/mXOFNEItJOcLecm3tf36RRJ9BYZ.jpg"
    }
}