{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4XC0HwRNOvub6xksENsOl68zHOn.jpg",
                "genre_ids": [
                    18
                ],
                "id": 403,
                "original_language": "en",
                "original_title": "Driving Miss Daisy",
                "overview": "The story of an old Jewish widow named Daisy Werthan and her relationship with her black chauffeur, Hoke. From an initial mere work relationship grew in 25 years a strong friendship between the two very different characters, in a time when those types of relationships were shunned.",
                "popularity": 2.9516,
                "poster_path": "/iaCzvcY42HihFxQBTZCTKMpsI0P.jpg",
                "release_date": "1989-12-13",
                "title": "Driving Miss Daisy",
                "video": false,
                "vote_average": 7.235,
                "vote_count": 1664,
                "character": "Daisy Werthan",
                "credit_id": "52fe423fc3a36847f800f63f",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/il5zDHC5sGe3ZHLhVi3tNFZ9Tt5.jpg",
                "genre_ids": [
                    27,
                    53
                ],
                "id": 571,
                "original_language": "en",
                "original_title": "The Birds",
                "overview": "Thousands of birds flock into a seaside town and terrorize the residents in a series of deadly attacks.",
                "popularity": 4.7519,
                "poster_path": "/eClg8QPg8mwB6INIC4pyR5pAbDr.jpg",
                "release_date": "1963-03-28",
                "title": "The Birds",
                "video": false,
                "vote_average": 7.52,
                "vote_count": 4269,
                "character": "Lydia Brenner",
                "credit_id": "52fe4254c3a36847f8015abd",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/ApnB7gY4MrWoPqIw17lEMp1mXJD.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 1633,
                "original_language": "en",
                "original_title": "Fried Green Tomatoes",
                "overview": "Amidst her own personality crisis, a southern housewife meets an outgoing old woman who tells her the story of Idgie Threadgoode and Ruth Jamison, two young women who experienced hardships and love in 1920s Whistle Stop, Alabama.",
                "popularity": 3.6107,
                "poster_path": "/g71l1vbJwyAAYk8zKCkIQQ58qcb.jpg",
                "release_date": "1991-12-27",
                "title": "Fried Green Tomatoes",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 1403,
                "character": "Ninny Threadgoode",
                "credit_id": "52fe4306c3a36847f8034ca7",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jessica Alice Tandy",
            "جسیکا تندی"
        ],
        "biography": "Jessie Alice \"Jessica\" Tandy (June 7, 1909 – September 11, 1994) was an English-American stage and film actress.\n\nShe first appeared on the London stage in 1926 at the age of 16, playing, among others, Katherine opposite Laurence Olivier's Henry V, and Cordelia opposite John Gielgud's King Lear. She also worked in British films. Following the end of her marriage to Jack Hawkins, she moved to New York, where she met Canadian actor Hume Cronyn. He became her second husband and frequent partner on stage and screen.\n\nShe won the Tony Award for her performance as Blanche Dubois in the original Broadway production of A Streetcar Named Desire in 1948, sharing the prize with Katherine Cornell (who won for Antony and Cleopatra) and Judith Anderson (for the latter's portrayal of Medea). Over the following three decades, her career continued sporadically and included a substantial role in Alfred Hitchcock's film, The Birds (1963), and a Tony Award-winning performance in The Gin Game (playing in the two-character play opposite her husband, Cronyn) in 1977. She, along with Cronyn was a member of the original acting company of The Guthrie Theater.\n\nIn the mid 1980s she enjoyed a career revival. She appeared opposite Hume Cronyn in the Broadway production of Foxfire in 1983 and its television adaptation four years later, winning both a Tony Award and an Emmy Award for her portrayal of Annie Nations. During these years, she appeared in films such as Cocoon (1985), also with Cronyn.\n\nShe became the oldest actress to receive the Academy Award for Best Actress for her role in Driving Miss Daisy (1989), for which she also won a BAFTA and a Golden Globe, and was nominated for an Academy Award for Best Supporting Actress for Fried Green Tomatoes (1991). At the height of her success, she was named as one of People's \"50 Most Beautiful People\". She was diagnosed with ovarian cancer in 1990, and continued working until shortly before her death.",
        "birthday": "1909-06-07",
        "deathday": "1994-09-11",
        "gender": 1,
        "homepage": null,
        "id": 5698,
        "imdb_id": "nm0001788",
        "known_for_department": "Acting",
        "name": "Jessica Tandy",
        "place_of_birth": "London, England",
        "popularity": 0.8033,
        "profile_path": "/4qgLUP4sFC3xnzzcpyQcv8UKZAv.jpg"
    }
}