{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qA2TyqPldTtoTVY3LKrNIG5g6bH.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 76,
                "original_language": "en",
                "original_title": "Before Sunrise",
                "overview": "An unexpected meeting on a train leads two travelers to spend an evening wandering through Vienna. As the night unfolds, they share stories and conversations about life and love, exploring new ideas while a quiet intimacy grows between them, knowing it may be their only night together.",
                "popularity": 7.7657,
                "poster_path": "/kf1Jb1c2JAOqjuzA3H4oDM263uB.jpg",
                "release_date": "1995-01-27",
                "title": "Before Sunrise",
                "video": false,
                "vote_average": 7.964,
                "vote_count": 4405,
                "character": "Wife on Train",
                "credit_id": "52fe4214c3a36847f80023e9",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia. Andrea Eckert (born 17 September 1958) is an Austrian stage and film actress, singer and documentary filmmaker.\n\nBorn in Vienna, Eckert first studied literature in Paris, France, then decided on a stage career and trained with Dorothea Neff. Her roles have included the eponymous heroines in Hebbel's Judith, Schiller's Maria Stuart, Jelinek's Clara S., Sophocles's Elektra, Kleist's Penthesilea, and Maria Callas in Terrence McNally's Meisterklasse (Master Class).\n\nEckert has frequently appeared on television (for example in guest roles on Kommissar Rex) and in the cinema. She also made documentaries about Lucia Westerguard, Turhan Bey, and Leopold and Josefine Hawelka.\n\nShe lives in Vienna.\n\nDescription above from the Wikipedia article Andrea Eckert, licensed under CC-BY-SA, full list of contributors on Wikipedia.    ",
        "birthday": "1958-09-17",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.andrea-eckert.com/",
        "id": 571,
        "imdb_id": "nm0248600",
        "known_for_department": "Acting",
        "name": "Andrea Eckert",
        "place_of_birth": "Vienna, Austria",
        "popularity": 0.1653,
        "profile_path": "/4O1mg7OTD2P7oVKIqfJeiLmJq6B.jpg"
    }
}