{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/wUwizGzbTk5CTiKBnE4Pq1MONwD.jpg",
                "genre_ids": [
                    16,
                    12,
                    28,
                    10751,
                    14
                ],
                "id": 560057,
                "original_language": "en",
                "original_title": "The Sea Beast",
                "overview": "When a young girl stows away on the ship of a legendary sea monster hunter, they launch an epic journey into uncharted waters — and make history to boot.",
                "popularity": 7.161,
                "poster_path": "/9Zfv4Ap1e8eKOYnZPtYaWhLkk0d.jpg",
                "release_date": "2022-06-24",
                "title": "The Sea Beast",
                "video": false,
                "vote_average": 7.32,
                "vote_count": 1590,
                "character": "Lea the Lookout (voice)",
                "credit_id": "62c9d21ee8131d068b115348",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            " Xana Tang",
            "曾晓童"
        ],
        "biography": "Xana Tang is a Chinese-Vietnamese actor who was born in New Zealand. She studied at the Auckland University of Technology and holds Bachelor degree in Communication Studies.\n\nXana Tang made her screen breakthrough at sixteen years old as 'Spit' in director Michael Bennett's award-winning feature film Matariki. Following this, she was cast as a lead in Thedownlowconcept's Greyhound racing television comedy Hounds. The show went on to win Best Television Comedy Series at the 2012 New Zealand Film and Television Awards.\n\nHer notable screen roles since include; The Almighty Johnsons, Power Rangers, and Cherry, a major supporting role, in both seasons of the television drama Filthy Rich.\n\nIn 2017, Xana made her Australian screen debut when she was cast in the highly anticipated Australian comedy series - The Letdown.\n\nXana speaks fluent English and Cantonese and studied Mandarin for five years.",
        "birthday": "1993-10-30",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 571567,
        "imdb_id": "nm3487897",
        "known_for_department": "Acting",
        "name": "Xana Tang",
        "place_of_birth": "South Auckland, New Zealand",
        "popularity": 0.7051,
        "profile_path": "/1z2Nn5KSAq82yfsd7IXYxBMI3T2.jpg"
    }
}