{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2L8U8rUyWeFTb6n1egTNeJsEsvj.jpg",
                "genre_ids": [
                    35,
                    18,
                    10749
                ],
                "id": 284,
                "original_language": "en",
                "original_title": "The Apartment",
                "overview": "Bud Baxter is a minor clerk in a huge New York insurance company, until he discovers a quick way to climb the corporate ladder. He lends out his apartment to the executives as a place to take their mistresses. Although he often has to deal with the aftermath of their visits, one night he's left with a major problem to solve.",
                "popularity": 4.4619,
                "poster_path": "/2nt8Z54Bce74ycithkzlSNkgXJB.jpg",
                "release_date": "1960-06-21",
                "title": "The Apartment",
                "video": false,
                "vote_average": 8.2,
                "vote_count": 2472,
                "character": "Al Kirkeby",
                "credit_id": "52fe4232c3a36847f800b4a5",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "David Paul Lewis"
        ],
        "biography": "David Lewis (October 19, 1916 – December 11, 2000) was an American actor, born in Pittsburgh, Pennsylvania. He was best known for being the original actor to portray Edward Quartermaine from 1978 to 1993 on the American soap opera General Hospital.\n\nLewis was a pioneering actor in television, his first televised role occurring in 1949 on the show Captain Video and His Video Rangers. His credits include appearing in seven episodes of Perry Mason and in the recurring role of Warden Crichton in Batman. Lewis appeared on daytime T.V., making his soap debut on Love of Life as a murderer and later playing patriarch Henry Pierce on Bright Promise. Brief guest stints on The Young and the Restless and Days of Our Lives followed.\n\nIn 1978, he joined the cast of General Hospital in the role of Edward Quartermaine, for which he won a Daytime Emmy Award for Outstanding Supporting Actor in a Daytime Drama in 1982. Lewis took time off between 1987 and 1988 for medical recovery and departed in 1989 during which time Edward was believed to be dead. Lewis continued to come to the studio, however, to tape his voice so wife Lila could have conversations with him. Lewis made his comeback in November 1991 when Edward came back from the dead and in the summer of 1993, Lewis announced he was retiring permanently.",
        "birthday": "1916-10-19",
        "deathday": "2000-12-11",
        "gender": 2,
        "homepage": null,
        "id": 571911,
        "imdb_id": "nm0507081",
        "known_for_department": "Acting",
        "name": "David Lewis",
        "place_of_birth": "Pittsburgh, Pennsylvania, USA",
        "popularity": 0.2447,
        "profile_path": "/nwEuF8nyeN7tlHL7GsJuVCOsmI7.jpg"
    }
}