{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/y2DB71C4nyIdMrANijz8mzvQtk6.jpg",
                "genre_ids": [
                    28,
                    80,
                    18,
                    53
                ],
                "id": 49026,
                "original_language": "en",
                "original_title": "The Dark Knight Rises",
                "overview": "Following the death of District Attorney Harvey Dent, Batman assumes responsibility for Dent's crimes to protect the late attorney's reputation and is subsequently hunted by the Gotham City Police Department. Eight years later, Batman encounters the mysterious Selina Kyle and the villainous Bane, a new terrorist leader who overwhelms Gotham's finest. The Dark Knight resurfaces to protect a city that has branded him an enemy.",
                "popularity": 17.5242,
                "poster_path": "/hr0L2aueqlP2BYUblTTjmtn0hw4.jpg",
                "release_date": "2012-07-17",
                "title": "The Dark Knight Rises",
                "video": false,
                "vote_average": 7.8,
                "vote_count": 23539,
                "character": "Gotham City Police Officer (uncredited)",
                "credit_id": "56252cb2c3a3680e1d013497",
                "order": 102
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Charlie Alejandro was born as Shirley Jaudicia Cordero in San Jose Costa Rica. Her birth mother abandoned her at the age of 2 years old and she was taken in by her Godmother's family and raised as their own. Her adoptive mother Maria Otilia Mainieri-Guerrero came to the United States in 1969 and brought then 7 year old Charlie with her. After years of enduring her birth name being mispronounced as \"Charlie\" by the predominantly Latino community she grew up around, she change the spelling of her name to reflect the way it was being pronounced. Charlie had always been drawn to the acting and the stage. She was cast as Lucy in \"Your a good man, Charlie brown\" shortly after arriving in the United States. her English skills were so new that the nuns taught her to memorize her lines phonetically. She received huge praise for her role and as a result was invited to audition for the WBGH Local kids show \"Zoom\". Her mother refused to take her to her audition and she was taken to the studio by her brother in law with her mother knowledge. When she received a call back it ended her dream of acting as her mother refused to take her or sign the consent forms and discouraged from pursing this as a career. She grew up in a very low income, dysfunctional home and as a result left when she was 17 years old after the birth of her first son Derek. Her and her first husband had four sons together Derek, Eric, J. Alexander and Christopher. Charlie earned her GED after birth of her first son, received her medical assisting certificate after the birth of her second son, and became a Metropolitan Police officer (Boston, Massachusetts) after the birth of her third son. While on the Metropolitan Police department, she became the first female in the state of Massachusetts at the time and one of only a handful of women on a tactical Unit (SOU). She would remain an entry team member, trainer, search and rescue, and intel officer on the SOU until the Metropolitan Police was merged with the State Police, Capitol Police and Registry police in 1992 as part of then Governor Wells cost cutting measures. After the merger she was an alternate on the STOP team and assigned to the State Police's Weed and Seed program in Chelsea MA., which was in state receivership at the time and under investigation for police corruption. Charlie was divorced from her first husband in 1994 and got remarried to Mel Alejandro in 1996. Her second husband brought four children of his own into the relationship, two boys two girls, and they were later joined by a foster son to round their brood of nine. She took an early retirement from the state police to raise their blended family. During the interim she worked as a Community organizer for the City of Lowell MA, Criminal Justice instructor, security adviser and motivational speaker. During this time she was cast as a lead in several independent movies, but the funding fell through and these projects were never completed. She did voice-over work and instructional videos both in English and in Spanish.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 572221,
        "imdb_id": "nm3077057",
        "known_for_department": "Acting",
        "name": "Charlie Alejandro",
        "place_of_birth": "San Jose",
        "popularity": 0.1163,
        "profile_path": "/dj7P5oGRxVjhmQc3mSb8lSHzwaa.jpg"
    }
}