{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jMT2nS6ou3xwzp1XX40v8rJKl7U.jpg",
                "genre_ids": [
                    35
                ],
                "id": 15097,
                "original_language": "fr",
                "original_title": "La Cité de la peur",
                "overview": "A second-class horror movie has to be shown at Cannes Film Festival, but, before each screening, the projectionist is killed by a mysterious fellow, with hammer and sickle, just as it happens in the film to be shown.",
                "popularity": 3.4282,
                "poster_path": "/xaTVWUrPbGM4SgrLOaaWLeUEafI.jpg",
                "release_date": "1994-03-09",
                "title": "Fear City: A Family-Style Comedy",
                "video": false,
                "vote_average": 7.468,
                "vote_count": 1304,
                "character": "Dave",
                "credit_id": "52fe46399251416c750714f3",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Wouter Otto Levenbach"
        ],
        "biography": "Wouter Otto Levenbach (born 4 May 1944), known as Dave, is a Dutch Francophone singer who had a string of number one hits in France in the 1970s. A native of Amsterdam, he resides in Paris.\n\nDave was born in Amsterdam. His father was Jewish and an English teacher by trade; his mother was a classical dancer. He has two brothers, Marteen and Lucas, and a sister, Elsbeth. He learned to play the guitar at age 14. He became a very spiritual person who prayed frequently and even planned to study theology; however, he eventually chose to study law.\n\nAmong other things, he was inspired by Jack Kerouac's On the Road , a revolutionary novel which encouraged young people to leave home and learn life \"on the road\", and to communicate with others. Passionate about the sea and rivers (a love which he owes to his grandfather), he left the Netherlands by boat with 1,000 guilders in his pocket (about two months' living expenses).\n\nHe met Eddie Barclay, the executive for Barclay Records, in Saint-Tropez in 1968; Barclay was responsible for launching Dave's career in show business.\n\nOn 26 February 1969, he participated in the Nationaal Songfestival, the Dutch pre-selection contest for that year's Eurovision Song Contest with a song called \"Niets gaat zo snel\", but did not win. In Summer 1969 he reached the Dutch Top 40 charts for the first time with \"Nathalie\", peaking at No. 28.\n\nFrom 1971 to 1974, he was one of the actors in the musical Godspell, making friends with actor Daniel Auteuil, who would become his best friend.\n\nIn 1974, he released his first hit \"Trop Beau\", a French adaptation of The Rubettes' hit \"Sugar Baby Love\"; later, he released \"Vanina\", his first number one single in France, an adaptation of Del Shannon's \"Runaway\", adapted into French by Patrick Loiseau. These were followed in 1975 by the three hits \"Mon cœur est malade\", \"Dansez maintenant\" and \"Du côté de chez Swann\".\n\nHis self-titled first album was released at the end of 1975. By that time, he did not only have great success in France and Belgium, but also in his country of origin the Netherlands, where \"Dansez maintenant\" was a number 1 hit in the top 40 and \"Du côté de chez Swann\" made the top 10 too.\n\nHis later hits included \"Lettre à Hélène\" (1978), \"Comment ne pas être amoureux de vous\" (1978) and \"Allo Elisa\" (1979).\n\nIn the 1980s, his popularity waned following the advent of FM radio in France. He still had an audience due to live performances and his classic hits. However, he himself likened the ebb to a \"crossing of a very pretty desert\". In 1993, he released a new album, then in 1994, he made a comeback following the release of a greatest hits album, which sold more than 200,000 copies. He later recorded a new album entitled Toujours le même bleu, which included a title single from which enables him to hit the charts once again. It is also around this time that he came out as homosexual. ...\n\nSource: Article \"Dave (singer)\" from Wikipedia in English, licensed under CC-BY-SA.",
        "birthday": "1944-05-04",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 572506,
        "imdb_id": "nm0202528",
        "known_for_department": "Acting",
        "name": "Dave",
        "place_of_birth": "Amsterdam, Noord-Holland, Netherlands",
        "popularity": 0.2863,
        "profile_path": "/cFDv9F6jJgMuQGev3kVKZyBJJQK.jpg"
    }
}