{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jMT2nS6ou3xwzp1XX40v8rJKl7U.jpg",
                "genre_ids": [
                    35
                ],
                "id": 15097,
                "original_language": "fr",
                "original_title": "La Cité de la peur",
                "overview": "A second-class horror movie has to be shown at Cannes Film Festival, but, before each screening, the projectionist is killed by a mysterious fellow, with hammer and sickle, just as it happens in the film to be shown.",
                "popularity": 3.4282,
                "poster_path": "/xaTVWUrPbGM4SgrLOaaWLeUEafI.jpg",
                "release_date": "1994-03-09",
                "title": "Fear City: A Family-Style Comedy",
                "video": false,
                "vote_average": 7.468,
                "vote_count": 1304,
                "character": "Narrator of the tissu documentary (voice)",
                "credit_id": "52fe46399251416c7507153b",
                "order": 57
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Henri de Turennes"
        ],
        "biography": "Henri de Turenne (19 November 1921 – 23 August 2016) is a French journalist and screenwriter. He was born in Tours. The son of Armand de Turenne, a World War I flying ace, he was raised in Germany and French Algeria, both countries becoming central creative themes in his adult work. After the Second World War, de Turenne worked as a journalist for Agence France-Presse, Le Figaro, France Soir, and ORTF, reporting from Allied-occupied Germany, covering the Korean War and the Algerian War, and, in 1952, winning the Prix Albert Londres. Since the mid-1960s, he worked primarily in television, notably on the French Grandes Batailles series for Pathé, making over a hundred documentaries. He won an Emmy in 1982 for a documentary on the Vietnam War. His fictional works include Les Alsaciens ou les deux Mathilde (1996), made for Arte, for which he shared a 7 d'Or with Michel Deutsch.\n\nSource: Article \"Henri de Turenne (writer)\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1921-11-19",
        "deathday": "2016-08-23",
        "gender": 2,
        "homepage": null,
        "id": 572511,
        "imdb_id": "nm0877024",
        "known_for_department": "Writing",
        "name": "Henri de Turenne",
        "place_of_birth": "Tours, Indre-et-Loire, France",
        "popularity": 0.0193,
        "profile_path": "/zqpVqqCARfdrJhEOzwKYyluOubW.jpg"
    }
}