{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8pwIhymsxfAVjrAE7syDjQULn37.jpg",
                "genre_ids": [
                    16,
                    35,
                    10751,
                    12
                ],
                "id": 425,
                "original_language": "en",
                "original_title": "Ice Age",
                "overview": "With the impending ice age almost upon them, a mismatched trio of prehistoric critters – Manny the woolly mammoth, Diego the saber-toothed tiger and Sid the giant sloth – find an orphaned infant and decide to return it to its human parents. Along the way, the unlikely allies become friends but, when enemies attack, their quest takes on far nobler aims.",
                "popularity": 14.8538,
                "poster_path": "/gLhHHZUzeseRXShoDyC4VqLgsNv.jpg",
                "release_date": "2002-03-14",
                "title": "Ice Age",
                "video": false,
                "vote_average": 7.365,
                "vote_count": 13805,
                "character": "Soto (voice)",
                "credit_id": "52fe4242c3a36847f801037b",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/egKntJKzEL6HgalIyQ0Q5cMmDOA.jpg",
                "genre_ids": [
                    53,
                    80,
                    9648
                ],
                "id": 65754,
                "original_language": "en",
                "original_title": "The Girl with the Dragon Tattoo",
                "overview": "Disgraced journalist Mikael Blomkvist investigates the disappearance of a weary patriarch's niece from 40 years ago. He is aided by the pierced, tattooed, punk computer hacker named Lisbeth Salander. As they work together in the investigation, Blomkvist and Salander uncover immense corruption beyond anything they have ever imagined.",
                "popularity": 5.8166,
                "poster_path": "/8bokS83zGdhaXgN9tjidUKmAftW.jpg",
                "release_date": "2011-12-14",
                "title": "The Girl with the Dragon Tattoo",
                "video": false,
                "vote_average": 7.377,
                "vote_count": 7286,
                "character": "Dragan Armansky",
                "credit_id": "52fe4718c3a368484e0b4c79",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/tgRQsrjBKdic7llxhI7pqLJb8kS.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 10220,
                "original_language": "en",
                "original_title": "Rounders",
                "overview": "A young reformed gambler must return to playing big stakes poker to help a friend pay off loan sharks.",
                "popularity": 5.1383,
                "poster_path": "/mqbMwYGwIChnaCO55h7v8DG8Wwy.jpg",
                "release_date": "1998-09-11",
                "title": "Rounders",
                "video": false,
                "vote_average": 7.008,
                "vote_count": 1807,
                "character": "Maurice",
                "credit_id": "547da6f09251412d70005b12",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Goran Visnjic",
            "گوران ویسنیچ"
        ],
        "biography": "Goran Višnjić (born September 9, 1972) is a Croatian-born American actor who has appeared in American and British films and TV. He is best known for his role as Dr. Luka Kovač on the hit television series ER. He's also known for his roles as Erik the Red on the Netflix series Vikings: Valhalla, Garcia Flynn on NBC's Timeless, John Woods on CBS's Extant, Marco Costanteon NBC's Crossing Lines, Nicholae Schiller on ABC's Red Widow, Dragan Armansky in The Girl with the Dragon Tattoo (2011), voice of Soto in Ice Age, Jimmy Angelo in Practical Magic, and Bazta Sergeant in The Peacemaker.\n\nHe grew up in Sibenik, Croatia (then Yugoslavia), a port town on the Adriatic Sea, where he decided at an early age that he wanted to be an actor. He first performed in local theater groups and then entered the Academy of Dramatic Arts in Zagreb. Goran gained popularity in Croatia when, at the age of 21, he was cast as Hamlet in the prestigious Dubrovnik Summer Festival’s staging of Shakespeare’s play. His performance earned him three national Best Actor awards, including an Orlando (the Croatian equivalent of a Tony). He made his American motion-picture debut in the \"Welcome to Sarajevo,\" drama, directed by Michael Winterbottom.\n\nIn his leisure time, he enjoys fencing, swimming and diving. He lives in Los Angeles with his wife, Eva, and their three children.",
        "birthday": "1972-09-09",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 5725,
        "imdb_id": "nm0899681",
        "known_for_department": "Acting",
        "name": "Goran Višnjić",
        "place_of_birth": "Sibenik, Yugoslavia [now Croatia]",
        "popularity": 0.7687,
        "profile_path": "/2jFpq46QPjCbRmmGYdW9WSVC47W.jpg"
    }
}