{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/j1xaeJZOEOiVBD1rk3dg4YaAk23.jpg",
                "genre_ids": [
                    28,
                    12,
                    18,
                    10751
                ],
                "id": 1885,
                "original_language": "en",
                "original_title": "The Karate Kid",
                "overview": "New Jersey teen Daniel LaRusso moves to Los Angeles with his mother, and soon strikes up a relationship with Ali. He quickly finds himself the target of bullying by a group of thugs, led by Ali's ex-boyfriend Johnny, who study karate at the Cobra Kai dojo under ruthless sensei John Kreese. Fortunately, Daniel befriends Mr. Miyagi, an unassuming repairman who just happens to be a martial arts master himself. Miyagi takes Daniel under his wing, training him in a more compassionate form of karate for self-defense and, later, preparing him to compete against the brutal Cobra Kai.",
                "popularity": 6.137,
                "poster_path": "/1mp4ViklKvA0WXXsNvNx0RBuiit.jpg",
                "release_date": "1984-06-22",
                "title": "The Karate Kid",
                "video": false,
                "vote_average": 7.209,
                "vote_count": 4470,
                "character": "Tournament Guest (uncredited)",
                "credit_id": "5cfd649fc3a3687f18221394",
                "order": 47
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nChris Casamassa (born January 17, 1965) is an American martial artist, actor and stuntman who is best known for his role as Scorpion in the movie Mortal Kombat and the related TV show, Mortal Kombat: Conquest. He is the son of martial arts guru and Red Dragon Karate founder Louis D. Casamassa. (Chris co-starred on the TV series WMAC Masters under the call-sign \"Red Dragon\".)\n\nDescription above from the Wikipedia article Chris Casamassa, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1963-01-17",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 57253,
        "imdb_id": "nm0142876",
        "known_for_department": "Acting",
        "name": "Chris Casamassa",
        "place_of_birth": "Bethlehem, Pennsylvania, USA",
        "popularity": 0.2354,
        "profile_path": "/4isia13goX4Op437JJUMCv3GlXO.jpg"
    }
}