{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/77aHwg1SCy89rfvQtiruPU58qEV.jpg",
                "genre_ids": [
                    9648,
                    10749,
                    53
                ],
                "id": 426,
                "original_language": "en",
                "original_title": "Vertigo",
                "overview": "A retired San Francisco detective suffering from acrophobia investigates the strange activities of an old friend's wife, all the while becoming dangerously obsessed with her.",
                "popularity": 5.1811,
                "poster_path": "/15uOEfqBNTVtDUT7hGBVCka0rZz.jpg",
                "release_date": "1958-05-28",
                "title": "Vertigo",
                "video": false,
                "vote_average": 8.16,
                "vote_count": 6023,
                "character": "Madeleine Elster / Judy Barton",
                "credit_id": "52fe4242c3a36847f8010407",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/2Kkqmy3EpXqBDqv1vvsNXX3pwww.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 42269,
                "original_language": "it",
                "original_title": "C'eravamo tanto amati",
                "overview": "Three partisans bound by a strong friendship return home after the war, but the clash with everyday reality puts a strain on their bond.",
                "popularity": 1.7523,
                "poster_path": "/zGGWYpiKNwjpKxelPxOMqJnUgDs.jpg",
                "release_date": "1974-12-21",
                "title": "We All Loved Each Other So Much",
                "video": false,
                "vote_average": 8.3,
                "vote_count": 619,
                "character": "Mildred Rogers in 'Of Human Bondage' (archive footage) (uncredited)",
                "credit_id": "679980300400ec6f45c0c345",
                "order": 34
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "The Lavender Girl",
            "Marilyn Pauline Novak",
            "کیم نواک"
        ],
        "biography": "Marilyn Pauline Novak (born February 13, 1933), known professionally as Kim Novak, is an American retired film and television actress.\n\nShe began her career in 1954 after signing with Columbia Pictures. There, she became a successful actress, starring in a string of movies, among them the critically acclaimed Picnic (1955). She later starred in such popular successes as The Man with the Golden Arm (1955) and Pal Joey (1957). However, she is perhaps best known today for her \"dual role\" as both Judy Barton and Madeleine Elster in Alfred Hitchcock's classic thriller Vertigo (1958). Novak was popular in box office popularity polls, and she starred opposite several top leading men of the era, including James Stewart, William Holden, Frank Sinatra, Tyrone Power, and Kirk Douglas.\n\nAlthough still young, her career declined in the early 1960s, and after several years in a series of lackluster films, she withdrew from acting in 1966. She has only sporadically returned since. She later returned to the screen in The Mirror Crack'd (1980), and had a regular role on the prime time series Falcon Crest (1986–87). After a disappointing experience during the filming of Liebestraum (1991), she has permanently retired from acting, stating she has no desire to return.\n\nDescription above from the Wikipedia article Kim Novak, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1933-02-13",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 5729,
        "imdb_id": "nm0001571",
        "known_for_department": "Acting",
        "name": "Kim Novak",
        "place_of_birth": "Chicago, Illinois, USA",
        "popularity": 0.5963,
        "profile_path": "/xvIOwqOD1BXkpFZEwzkb6aamaEL.jpg"
    }
}