{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/m1TOfgljbT3jOez3b4l1I1tm82W.jpg",
                "genre_ids": [
                    16,
                    10751,
                    14
                ],
                "id": 9078,
                "original_language": "en",
                "original_title": "The Sword in the Stone",
                "overview": "Wart is a young boy who aspires to be a knight's squire. On a hunting trip he falls in on Merlin, a powerful but amnesiac wizard who has plans for him beyond mere squiredom. He starts by trying to give him an education, believing that once one has an education, one can go anywhere. Needless to say, it doesn't quite work out that way.",
                "popularity": 7.2175,
                "poster_path": "/7lyeeuhGAJSNXYEW34S8mJ1bwI8.jpg",
                "release_date": "1963-12-25",
                "title": "The Sword in the Stone",
                "video": false,
                "vote_average": 7.228,
                "vote_count": 3963,
                "character": "Archimedes the Owl (voice)",
                "credit_id": "52fe44d9c3a36847f80adaf5",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/19lyrve8NcorainRPLXELTDVnA2.jpg",
                "genre_ids": [
                    16,
                    10751,
                    12
                ],
                "id": 250480,
                "original_language": "en",
                "original_title": "The Many Adventures of Winnie the Pooh",
                "overview": "Whether we’re young or forever young at heart, the Hundred Acre Wood calls to that place in each of us that still believes in magic. Join pals Pooh, Piglet, Kanga, Roo, Owl, Rabbit, Tigger and Christopher Robin as they enjoy their days together and sing their way through adventures.",
                "popularity": 3.214,
                "poster_path": "/2xwaFVLv5geVrFd81eUttv7OutF.jpg",
                "release_date": "1977-03-11",
                "title": "The Many Adventures of Winnie the Pooh",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 1103,
                "character": "Rabbit (voice)",
                "credit_id": "52fe4df49251416c911219f9",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Junius Conyers Matthews",
            "Junius Mathews",
            "Junius C. Matthews"
        ],
        "biography": "Junius Conyers Matthews was an American actor. He was the voice of Archimedes the Owl in Disney's The Sword in the Stone in 1963. He was also the original voice of Rabbit in the Winnie the Pooh franchise from 1966 to 1977. He was a private in World War I before becoming an actor, and determined to become a popular radio and television actor, his career began on stage where he got his first role in a silent film called The Silent Witness (1917). He later played the role of the Tin Woodsman on a radio version of The Wizard of Oz. His distinctive voice can be frequently heard in supporting roles in radio, particularly westerns where he was often cast as an old codger, miner, or master of the cook wagon. Matthews appeared on the short-lived series Luke Slaughter of Tombstone as Slaughter's sidekick, Wichita, and played Ling Wee, a Chinese waiter, in Gasoline Alley. He also made guest appearances on several television series in the 1950s and '60s.\n\nIt was not until the last ten years of his life that Matthews became widely known for his role as Rabbit in the Winnie the Pooh movies produced by the Disney studio from 1966 to 1977, including the featurettes Winnie the Pooh and the Honey Tree (1966), Winnie the Pooh and the Blustery Day (1968), and Winnie the Pooh and Tigger Too! (1974) as well as the feature-length compilation film The Many Adventures of Winnie the Pooh (1977). He played other roles for Disney, most notably the owl, Archimedes, in Disney's The Sword in the Stone (1963).\n\nMatthews died on January 18, 1978 at age 87 and was buried in Forest Lawn - Hollywood Hills Cemetery",
        "birthday": "1890-06-12",
        "deathday": "1978-01-18",
        "gender": 2,
        "homepage": null,
        "id": 57313,
        "imdb_id": "nm0560076",
        "known_for_department": "Acting",
        "name": "Junius Matthews",
        "place_of_birth": "Chicago, Illinois, USA",
        "popularity": 0.1177,
        "profile_path": "/wfMbR7I6xjzO8n1y0wv0rRop4Fc.jpg"
    }
}