{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/77aHwg1SCy89rfvQtiruPU58qEV.jpg",
                "genre_ids": [
                    9648,
                    10749,
                    53
                ],
                "id": 426,
                "original_language": "en",
                "original_title": "Vertigo",
                "overview": "A retired San Francisco detective suffering from acrophobia investigates the strange activities of an old friend's wife, all the while becoming dangerously obsessed with her.",
                "popularity": 5.1811,
                "poster_path": "/15uOEfqBNTVtDUT7hGBVCka0rZz.jpg",
                "release_date": "1958-05-28",
                "title": "Vertigo",
                "video": false,
                "vote_average": 8.16,
                "vote_count": 6023,
                "character": "Coroner",
                "credit_id": "52fe4242c3a36847f8010413",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/C6jcUqld8M6hZQmzBxgwHuQ4qT.jpg",
                "genre_ids": [
                    12,
                    37,
                    80,
                    18,
                    36
                ],
                "id": 642,
                "original_language": "en",
                "original_title": "Butch Cassidy and the Sundance Kid",
                "overview": "As the west rapidly becomes civilized, a pair of outlaws in 1890s Wyoming find themselves pursued by a posse and decide to flee to South America in hopes of evading the law.",
                "popularity": 18.3576,
                "poster_path": "/gFmmykF1Ym3OGzENo50nZQaD1dx.jpg",
                "release_date": "1969-09-23",
                "title": "Butch Cassidy and the Sundance Kid",
                "video": false,
                "vote_average": 7.6,
                "vote_count": 2314,
                "character": "Bike Salesman",
                "credit_id": "52fe4263c3a36847f801a863",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/k7135cfORy0T7evjsH8F1Koaxg5.jpg",
                "genre_ids": [
                    35
                ],
                "id": 19494,
                "original_language": "en",
                "original_title": "Nine to Five",
                "overview": "Three female employees of a sexist, egotistical, lying, hypocritical bigot find a way to turn the tables on him.",
                "popularity": 3.7341,
                "poster_path": "/3nm6kWMFzxGtJb4UEuDB0lDWpcD.jpg",
                "release_date": "1980-12-18",
                "title": "Nine to Five",
                "video": false,
                "vote_average": 6.93,
                "vote_count": 524,
                "character": "Mr. Hinkle",
                "credit_id": "55ed3d0bc3a368090c003bbd",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Henry Burk Jones",
            "Генри Джонс"
        ],
        "biography": "Henry Burk Jones (August 1, 1912 – May 17, 1999) was an American actor of stage, film and television.\n\nJones was born in Philadelphia, Pennsylvania, the son of Helen (née Burk) and John Francis Xavier Jones. He was the grandson of Pennsylvania Representative Henry Burk. He attended the Jesuit-run Saint Joseph's Preparatory School.\n\nJones is remembered for his role as handyman Leroy Jessup in the movie The Bad Seed (1956), a role he originated on Broadway. Other theatre credits included My Sister Eileen, Hamlet, The Time of Your Life, They Knew What They Wanted, The Solid Gold Cadillac, and Sunrise at Campobello, for which he won the Tony Award for Best Performance by a Featured Actor in a Play, and the Outer Critics Circle Award for Performance in a Drama.\n\nJones appeared in more than 180 movies and television shows. His screen credits included The Girl Can't Help It, 3:10 to Yuma, Will Success Spoil Rock Hunter?, Vertigo, Cash McCall, The Bramble Bush, Butch Cassidy and the Sundance Kid, Dirty Dingus Magee, Support Your Local Gunfighter, and Arachnophobia.\n\nOn television, Jones appeared in Appointment with Adventure, Alfred Hitchcock Presents, The Eleventh Hour, Channing, Phyllis, Night Gallery, Emergency!, Gunsmoke, The Twilight Zone, and The George Burns and Gracie Allen Show. He played Dr. Smith's cousin in a 1966 episode of Lost In Space, \"Curse Of Cousin Smith,\" great acting by Henry, and R.J. Hoferkamp in the 1968 made-for-television western movie Something for a Lonely Man.\n\nJones died in Los Angeles, California, at age 86, from complications from injuries suffered in a fall.\n\nDescription above from the Wikipedia article Henry Jones (actor), licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1912-08-01",
        "deathday": "1999-05-17",
        "gender": 2,
        "homepage": null,
        "id": 5732,
        "imdb_id": "nm0428216",
        "known_for_department": "Acting",
        "name": "Henry Jones",
        "place_of_birth": "Atlantic City, New Jersey, USA",
        "popularity": 0.7989,
        "profile_path": "/shJyQYEvp9P66ikDgzyGph7YguL.jpg"
    }
}