{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zj8XS0l1cWStpKnuD1LFMB3VoV1.jpg",
                "genre_ids": [
                    10751,
                    16,
                    12
                ],
                "id": 9325,
                "original_language": "en",
                "original_title": "The Jungle Book",
                "overview": "The boy Mowgli makes his way to the man-village with Bagheera, the wise panther. Along the way he meets jazzy King Louie, the hypnotic snake Kaa and the lovable, happy-go-lucky bear Baloo, who teaches Mowgli \"The Bare Necessities\" of life and the true meaning of friendship.",
                "popularity": 7.8611,
                "poster_path": "/9BgcTVV43dZ8A1TpuXWkuNTXtfI.jpg",
                "release_date": "1967-10-18",
                "title": "The Jungle Book",
                "video": false,
                "vote_average": 7.277,
                "vote_count": 6452,
                "character": "King Louie of the Apes (voice)",
                "credit_id": "52fe44e8c3a36847f80b108f",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Louis Leo Prima was an American trumpeter, singer, entertainer, and bandleader. While rooted in New Orleans jazz, swing music, and jump blues, Prima touched on various genres throughout his career: he formed a seven-piece New Orleans–style jazz band in the late 1920s, fronted a swing combo in the 1930s and a big band group in the 1940s, helped to popularize jump blues in the late 1940s and early to mid 1950s, and performed frequently as a Vegas lounge act beginning in the 1950s.\n\nFrom the 1940s through the 1960s, his music further encompassed early R&B and rock 'n' roll, boogie-woogie, and Italian folk music, such as the tarantella. Prima made prominent use of Italian music and language in his songs, blending elements of his Italian and Sicilian identity with jazz and swing music. At a time when ethnic musicians were discouraged from openly stressing their ethnicity, Prima's conspicuous embrace of his Sicilian ethnicity opened the doors for other Italian-American and ethnic American musicians to display their ethnic roots.\n\nPrima is also known for providing the voice for the orangutan King Louie in the 1967 Disney film The Jungle Book.  Description above from the Wikipedia article Louis Prima, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1910-12-07",
        "deathday": "1978-08-24",
        "gender": 2,
        "homepage": null,
        "id": 57330,
        "imdb_id": "nm0697515",
        "known_for_department": "Acting",
        "name": "Louis Prima",
        "place_of_birth": "New Orleans, Louisiana, USA",
        "popularity": 0.2265,
        "profile_path": "/eDxVmeGzUhzLCAEP3MjztlUVMGe.jpg"
    }
}