{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uUJp5I4IbzuhdUiEx4R9OAoFpbz.jpg",
                "genre_ids": [
                    27,
                    9648
                ],
                "id": 951491,
                "original_language": "en",
                "original_title": "Saw X",
                "overview": "Between the events of 'Saw' and 'Saw II', a sick and desperate John Kramer travels to Mexico for a risky and experimental medical procedure in hopes of a miracle cure for his cancer, only to discover the entire operation is a scam to defraud the most vulnerable. Armed with a newfound purpose, the infamous serial killer returns to his work, turning the tables on the con artists in his signature visceral way through devious, deranged, and ingenious traps.",
                "popularity": 5.3106,
                "poster_path": "/u7Lp1Hi8aBS73jv4KRMIv5aK4ax.jpg",
                "release_date": "2023-09-27",
                "title": "Saw X",
                "video": false,
                "vote_average": 7.206,
                "vote_count": 2188,
                "character": "Parker Sears",
                "credit_id": "639a4f8efb3f6100b0bb4118",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "史蒂芬·布蘭德",
            "Stephen Brand"
        ],
        "biography": "​From Wikipedia, the free encyclopedia.\n\nSteven Brand (born 26 June 1969) is a Scottish actor.  He made his American screen debut in Universal's The Scorpion King as Memnon, evil warlord and arch nemesis of Mathayus, played by The Rock. Following the success of his debut movie in the US, Brand’s work has included the HBO series The Mind of the Married Man, Stephen King’s The Diary of Ellen Rimbauer, CSI, Human Target and more recently starring in the movies Treasure Raiders with David Carradine, Say It in Russian with Faye Dunaway, and XII. Anime fans also know him as the voice of Alexander Anderson from the anime and OVA of Hellsing, as well as the voice of Richard Hellsing in the OVA.",
        "birthday": "1969-06-26",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 57340,
        "imdb_id": "nm0104526",
        "known_for_department": "Acting",
        "name": "Steven Brand",
        "place_of_birth": "Dundee, Scotland, UK",
        "popularity": 0.6197,
        "profile_path": "/oWkitw5jzILwb775CVGjsqMSrqz.jpg"
    }
}