{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3NyCi98Y2lqLawrV41kNCcyo6Ab.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 177,
                "original_language": "en",
                "original_title": "The Fisher King",
                "overview": "Two troubled men face their terrible destinies and events of their past as they join together on a mission to find the Holy Grail and thus to save themselves.",
                "popularity": 3.9549,
                "poster_path": "/hwIYw22HmAUMobV4zsX69MgfVUz.jpg",
                "release_date": "1991-09-20",
                "title": "The Fisher King",
                "video": false,
                "vote_average": 7.293,
                "vote_count": 1391,
                "character": "Limo Bum",
                "credit_id": "52fe4223c3a36847f8006d7b",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nTed Ross (June 30, 1934 – September 3, 2002) was an American actor who was probably best known for his role as the Lion in The Wiz, an all-African American reinterpretation of The Wizard of Oz. He won a Tony Award for the original 1975 Broadway production, and went on to recreate the role in the 1978 film version which also starred Diana Ross and Michael Jackson. Ross went on to appear in the films Arthur and Police Academy, and on the television sitcoms The Jeffersons, Benson, The Cosby Show, and its spin-off A Different World. His final role was in the 1991 film The Fisher King.\n\nRoss was born Theodore Ross Roberts in Zanesville, Ohio, but he moved with his family to Dayton at age seven. He died from complications of a stroke he suffered in 1998. He was cremated and his ashes were scattered.\n\nDescription above from the Wikipedia article Ted Ross, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1934-06-30",
        "deathday": "2002-09-03",
        "gender": 2,
        "homepage": null,
        "id": 57357,
        "imdb_id": "nm0743874",
        "known_for_department": "Acting",
        "name": "Ted Ross",
        "place_of_birth": "Zanesville, Ohio, USA",
        "popularity": 1.8233,
        "profile_path": "/70Hao5vB24h9u6UBUftySe2krr3.jpg"
    }
}