{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5qsyqA7FeYRymBmNbPBqBgqWPO4.jpg",
                "genre_ids": [
                    12,
                    35,
                    10751
                ],
                "id": 9340,
                "original_language": "en",
                "original_title": "The Goonies",
                "overview": "Young teen Mikey Walsh and his friends set off on a quest to find Pirate One-Eyed Willie's treasure in hopes of saving their homes from demolition.",
                "popularity": 8.0645,
                "poster_path": "/eBU7gCjTCj9n2LTxvCSIXXOvHkD.jpg",
                "release_date": "1985-06-07",
                "title": "The Goonies",
                "video": false,
                "vote_average": 7.514,
                "vote_count": 5945,
                "character": "Andy",
                "credit_id": "52fe44eac3a36847f80b17ab",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Kerri Lee Green"
        ],
        "biography": "Auburn haired Kerri Green was born in Fort Lee, New Jersey, USA on 14 January 1967. In 1984, Kerri decided to skip summer camp and attend some movie auditions in New York City instead. This led her to the attention of none other than Steven Spielberg, who cast her as Andy in Richard Donner's adventure movie The Goonies (1985), which was one of the biggest hits of 1985. Also that year, she played one of John Candy's three children in the movie Summer Rental (1985). However, she gave her most accomplished performance in David Seltzer's Lucas (1986) - Corey Haim was the title character, a bespectacled, intelligent and unpopular 14-year-old misfit, who befriends 16-year-old Maggie, played brilliantly by Kerri, who Lucas soon falls in love with. However, Maggie has fallen for handsome football hero Cappie (Charlie Sheen), which breaks Lucas' heart. A heartwarming, realistic and enjoyable teen movie, Lucas also featured Ally McBeal star Courtney Thorne-Smith and, making her film debut, Winona Ryder. Kerri was reunited with Charlie Sheen for 1987's road movie Three for the Road (1987), in which she played Robin, the rebellious daughter of a ruthless senator. Following the release of that movie, Kerri decided to quit acting and studied art at Vassar College. Audiences didn't see her again until the TV movie Blue Flame (1993). She received critical acclaim for her direction of the film Bellyfruit (1999). Her marriage in the 90s has led to her now being credited as \"Kerri Lee Green\" and she now only pops up now and then on television - most notably in an episode of \"ER\" as a mother of several children, who tearfully wants to terminate her latest pregnancy.",
        "birthday": "1967-01-14",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 57372,
        "imdb_id": "nm0338061",
        "known_for_department": "Acting",
        "name": "Kerri Green",
        "place_of_birth": "Fort Lee, New Jersey, USA",
        "popularity": 0.4697,
        "profile_path": "/3K7a4glNXx4znqn0GnsB580HM6Q.jpg"
    }
}