{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/77aHwg1SCy89rfvQtiruPU58qEV.jpg",
                "genre_ids": [
                    9648,
                    10749,
                    53
                ],
                "id": 426,
                "original_language": "en",
                "original_title": "Vertigo",
                "overview": "A retired San Francisco detective suffering from acrophobia investigates the strange activities of an old friend's wife, all the while becoming dangerously obsessed with her.",
                "popularity": 5.1811,
                "poster_path": "/15uOEfqBNTVtDUT7hGBVCka0rZz.jpg",
                "release_date": "1958-05-28",
                "title": "Vertigo",
                "video": false,
                "vote_average": 8.16,
                "vote_count": 6023,
                "character": "Car Owner Mistaken for Madeleine",
                "credit_id": "52fe4242c3a36847f801043b",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/9xzVKUGbVKrrgwlmshJ8SxI5mL7.jpg",
                "genre_ids": [
                    9648,
                    80,
                    53
                ],
                "id": 963,
                "original_language": "en",
                "original_title": "The Maltese Falcon",
                "overview": "A private detective takes on a case that involves him with three eccentric criminals, a beautiful liar, and their quest for a priceless statuette.",
                "popularity": 5.3716,
                "poster_path": "/bf4o6Uzw5wqLjdKwRuiDrN1xyvl.jpg",
                "release_date": "1941-10-18",
                "title": "The Maltese Falcon",
                "video": false,
                "vote_average": 7.712,
                "vote_count": 1775,
                "character": "Effie Perine",
                "credit_id": "52fe4294c3a36847f8029a3b",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Lee Salome Patrick"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nLee Patrick (November 22, 1901 – November 21, 1982) was an American actress whose career began in 1922 on the New York stage with her role in The Bunch and Judy which headlined Adele Astaire and featured Adele's brother Fred Astaire. Patrick continued to perform in dozens of roles on the stage for the next decade, frequently in musicals and comedies, but also in dramatic parts like her 1931 performance as Meg in Little Women. She began to branch out into films in 1929.\n\nFor half a century she created a credible body of cinematic work, her most memorable being in 1941 as Sam Spade's assistant Effie in The Maltese Falcon, and her reprise of the role in the George Segal 1975 comedy sequel The Black Bird. Her talents were showcased in comedies such as the 1942 Jack Benny film George Washington Slept Here and in 1958 as one of the foils of Rosalind Russell in Auntie Mame. Dramatic parts such as an asylum inmate in the 1948 The Snake Pit and as Pamela Tiffin's mother in the 1961 Summer and Smoke were another facet of her repertoire.\n\nShe made numerous guest roles in American television, but became a staple for that medium during the two-year run of Topper. As Henrietta Topper, her comedic timing played well against Leo G. Carroll as her husband, and against that of the two ghosts played by Robert Sterling and Anne Jeffreys. Patrick lent her voice to various animated characters of The Alvin Show in the early 1960s.\n\nDescription above from the Wikipedia article Lee Patrick (actress), licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1901-11-22",
        "deathday": "1982-11-21",
        "gender": 1,
        "homepage": null,
        "id": 5740,
        "imdb_id": "nm0665886",
        "known_for_department": "Acting",
        "name": "Lee Patrick",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.2947,
        "profile_path": "/zlLezqw2Klyw1qt0uxePQtC9NZ6.jpg"
    }
}