{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9DNDELpVxuLJWMoomgULhhZFoHR.jpg",
                "genre_ids": [
                    28,
                    53,
                    80
                ],
                "id": 8374,
                "original_language": "en",
                "original_title": "The Boondock Saints",
                "overview": "Tired of the crime overrunning the streets of Boston, Irish Catholic twin brothers Conner and Murphy are inspired by their faith to cleanse their hometown of evil with their own brand of zealous vigilante justice. As they hunt down and kill one notorious gangster after another, they become controversial folk heroes in the community. But Paul Smecker, an eccentric FBI agent, is fast closing in on their blood-soaked trail.",
                "popularity": 4.2971,
                "poster_path": "/wtLUmkWg41xFLpvmUWAN1mm65f6.jpg",
                "release_date": "1999-01-22",
                "title": "The Boondock Saints",
                "video": false,
                "vote_average": 7.251,
                "vote_count": 2548,
                "character": "Dancer",
                "credit_id": "5ca4b51c0e0a260164a8b710",
                "order": 35
            }
        ],
        "crew": []
    },
    "details": {
        "adult": true,
        "also_known_as": [
            "Angel Payson",
            "Jeana Fine",
            "Gina Fine",
            "Virginia Paymore",
            "Angel Rush",
            "Devon Delight",
            "Geanna Fine",
            "Jenna Fine",
            "Angelique Gauthier",
            "Vanna Paymore",
            "Virigina Payson",
            "Jeanne Fine"
        ],
        "biography": "Jeanna Fine (born in New York City) is a pornographic actress and erotic dancer.  Career  Adult film actress Siobhan Hunter encouraged Fine to go into adult films. Adult film actress Barbara Dare remarked how \"fine\" Jeanna was, which prompted Jeanna to adopt that as her surname. She was romantically involved with fellow pornographic actress Savannah.  Fine began in the adult movie industry as a blonde-haired punk-girl when she was 21 in 1986. She made 50 movies between 1986 and 1989. She re-emerged as a brunette in 1990. According to Fine's official adult film bio, Fine's sex film career was noted to have several large gaps between performing such as during the pregnancy and birth of her son.  Fine has retired from the adult film business with her last noted film \"Deep Inside Sunset Thomas\" released in 2003. She has appeared in no new films since, although several compilations of unreleased content featuring Fine have been released since 2003.  Fine was inducted in the Adult Video News Hall of Fame in 1998. She is also in the X-Rated Critic's Association's and Legends of Erotica Halls of Fame.  Fine appeared briefly in the film The Boondock Saints, as a dancer working the adult parlor where an attack was made on a mafia character played by fellow adult star Ron Jeremy. She also appears alongside Jeremy in Trey Parker's Orgazmo, although the scene was deleted from the theatrical release.",
        "birthday": "1964-09-29",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 574170,
        "imdb_id": "nm0277618",
        "known_for_department": "Acting",
        "name": "Jeanna Fine",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 8.315,
        "profile_path": "/iVk3X8zGnX0ukPzDumFmU6WMh3v.jpg"
    }
}