{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/x2FqFdUxRekbNdow3vZdtDqL96z.jpg",
                "genre_ids": [
                    35,
                    18,
                    36
                ],
                "id": 402897,
                "original_language": "en",
                "original_title": "The Death of Stalin",
                "overview": "When dictator Joseph Stalin dies, his parasitic cronies square off in a frantic power struggle to become the next Soviet leader. As they bumble, brawl and back-stab their way to the top, the question remains — just who is running the government?",
                "popularity": 3.2284,
                "poster_path": "/AqH7q89NxGRDAyRWKqsL3OBtYfV.jpg",
                "release_date": "2017-10-20",
                "title": "The Death of Stalin",
                "video": false,
                "vote_average": 7.012,
                "vote_count": 2009,
                "character": "Lavrenti Beria",
                "credit_id": "5767dc4a92514176d4000064",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/jjXnYpRQMqzylAmYqKL7VFa3l9w.jpg",
                "genre_ids": [
                    80,
                    18,
                    53,
                    9648
                ],
                "id": 799876,
                "original_language": "en",
                "original_title": "The Outfit",
                "overview": "Leonard is an English tailor who used to craft suits on London’s world-famous Savile Row. After a personal tragedy, he’s ended up in Chicago, operating a small tailor shop in a rough part of town where he makes beautiful clothes for the only people around who can afford them: a family of vicious gangsters.",
                "popularity": 5.1231,
                "poster_path": "/lZa5EB6PVJBT5mxhgZS5ftqdAm6.jpg",
                "release_date": "2022-02-25",
                "title": "The Outfit",
                "video": false,
                "vote_average": 7.085,
                "vote_count": 1234,
                "character": "Roy Boyle",
                "credit_id": "60703975befd91006eebbdf3",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "사이몬 러셀 빌",
            "Simon Russell-Beale",
            " Simon Russell Beale CBE"
        ],
        "biography": "Sir Simon Russell Beale CBE (born January 12, 1961) is an English actor. He is known for his appearances in film, television and theatre, and work on radio, on audiobooks and as a narrator. For his services to drama, he was knighted by Queen Elizabeth II at Buckingham Palace in 2019.\n\nHe has spent much of his theatre career working in productions for both the Royal Shakespeare Company and National Theatre. He has received ten Laurence Olivier Award nominations, winning three awards for his performances in Volpone (1996), Candide (2000), and Uncle Vanya (2003). For his work on the Broadway stage he has received a Tony Award for Best Actor in a Play nomination for his performance as George in the Tom Stoppard play Jumpers in 2004. For his role as Henry Lehman in The Lehman Trilogy, he won the Tony Award for Best Actor in a Play and was nominated for an Olivier Award. Beale has been described by The Independent as \"the greatest stage actor of his generation\".\n\nBeale made his film debut in Sally Potter's period drama Orlando (1992). He continued acting in films such as Persuasion (1995), Hamlet (1996), My Week with Marilyn (2011), The Deep Blue Sea (2011), Into the Woods (2014), and Mary Queen of Scots (2018). In 2017, he starred in Armando Iannucci's dark comedy The Death of Stalin playing Lavrentiy Beria for which he received the British Independent Film Award for Best Supporting Actor. He has also appeared in the television projects The Young Visiters (2003), Dunkirk (2004), and as Falstaff in the BBC made-for-television films Henry IV, Part I and Part II (2012). He was part of the main cast of Showtime's Penny Dreadful.",
        "birthday": "1961-01-12",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 57461,
        "imdb_id": "nm0750971",
        "known_for_department": "Acting",
        "name": "Simon Russell Beale",
        "place_of_birth": "Penang, Malaysia",
        "popularity": 0.3963,
        "profile_path": "/uw0ngaqgT8qXwJqVr353cx1mEdB.jpg"
    }
}