{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uRoA67sM5vvCI4cplxhl67BTPly.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 457799,
                "original_language": "en",
                "original_title": "Extremely Wicked, Shockingly Evil and Vile",
                "overview": "A chronicle of the crimes of Ted Bundy, from the perspective of his longtime girlfriend, Elizabeth Kloepfer, who refused to believe the truth about him for years.",
                "popularity": 2.6087,
                "poster_path": "/a7dVwEBU3vupg3hZQMeyL6ksz0F.jpg",
                "release_date": "2019-05-02",
                "title": "Extremely Wicked, Shockingly Evil and Vile",
                "video": false,
                "vote_average": 7.003,
                "vote_count": 3433,
                "character": "Officer Bob Hayward",
                "credit_id": "5ae914e2c3a3683bb5001567",
                "order": 9
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/2q3B90h2hZ6xJTvna9CIFDNaIr4.jpg",
                "genre_ids": [
                    16,
                    35
                ],
                "id": 9473,
                "original_language": "en",
                "original_title": "South Park: Bigger, Longer & Uncut",
                "overview": "In this feature film based on the hit animated series, the third graders of South Park sneak into an R-rated film by ultra-vulgar Canadian television personalities Terrance and Phillip, and emerge with expanded vocabularies that leave their parents and teachers scandalized. When outraged Americans try to censor the film, the controversy spirals into a call to wage war on Canada and Terrance and Phillip end up on death row, with the kids their only hope of rescue.",
                "popularity": 6.6126,
                "poster_path": "/tS0PedvA2mFO9VCHYwQpaU1K36U.jpg",
                "release_date": "1999-06-24",
                "title": "South Park: Bigger, Longer & Uncut",
                "video": false,
                "vote_average": 7.278,
                "vote_count": 2809,
                "credit_id": "52fe44fcc3a36847f80b5d59",
                "department": "Sound",
                "job": "Music"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "James Alan Hetfield",
            "Metallica"
        ],
        "biography": "James Alan Hetfield is an American musician and songwriter best known for being the co-founder, lead vocalist/rhythm guitarist and main songwriter for the American heavy metal band Metallica. Hetfield is mainly known for his intricate rhythm playing, but occasionally performs lead guitar duties and solos, both live and in the studio. Hetfield co-founded Metallica in October 1981 after answering an advertisement by drummer Lars Ulrich in the Los Angeles newspaper The Recycler. Metallica has won nine Grammy Awards and released ten studio albums, three live albums, four extended plays and 24 singles.\n\nIn 2009, Hetfield was ranked at no. 8 in Joel McIver's book The 100 Greatest Metal Guitarists and no. 24 by Hit Parader on their list of the 100 Greatest Metal Vocalists of All Time. In Guitar World's poll, Hetfield was placed as the 19th greatest guitarist of all time, as well as being placed second (along with Metallica lead guitarist Kirk Hammett) in The 100 Greatest Metal Guitarists poll of the same magazine. Rolling Stone placed Hetfield as the 87th greatest guitarist of all time.\n\nThis page is based on a Wikipedia article written by contributors. Text is available under the CC BY-SA 4.0 license; additional terms may apply.",
        "birthday": "1963-08-03",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.metallica.com",
        "id": 57637,
        "imdb_id": "nm0381723",
        "known_for_department": "Acting",
        "name": "James Hetfield",
        "place_of_birth": "Downey, California, USA",
        "popularity": 0.2983,
        "profile_path": "/1DBDpjWorXCwvMQLZeDIGfDQ5sJ.jpg"
    }
}