{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qK7Ssnrfvrt65F66A1thvehfQg2.jpg",
                "genre_ids": [
                    16,
                    10751,
                    35,
                    12,
                    9648
                ],
                "id": 420821,
                "original_language": "en",
                "original_title": "Chip 'n Dale: Rescue Rangers",
                "overview": "Decades since their successful television series was canceled, Chip has succumbed to a life of suburban domesticity as an insurance salesman. Dale, meanwhile, has had CGI surgery and works the nostalgia convention circuit, desperate to relive his glory days. When a former cast mate mysteriously disappears, Chip and Dale must repair their broken friendship and take on their Rescue Rangers detective personas once again to save their friend’s life.",
                "popularity": 3.9082,
                "poster_path": "/7UGmn8TyWPPzkjhLUW58cOUHjPS.jpg",
                "release_date": "2022-05-20",
                "title": "Chip 'n Dale: Rescue Rangers",
                "video": false,
                "vote_average": 6.998,
                "vote_count": 1300,
                "character": "Voltron Vendor",
                "credit_id": "6287bfae1a32481bd52d1766",
                "order": 55
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Rawson Thurber",
            "로슨 마샬 터버"
        ],
        "biography": "Rawson Marshall Thurber (born February 9, 1975) is an American filmmaker and actor. Thurber was born in San Francisco, California. He is the son of attorney Marshall Thurber.\n\nHe is a 1997 graduate of Union College (Schenectady, New York), where he was a member of the Delta Upsilon fraternity and played wide receiver on the football team for two years. He is also a graduate of the Peter Stark Producing Program at USC.\n\nThurber worked as an assistant to screenwriter John August, beginning with the 2000 August-created television show D.C. In 2002, he wrote and directed the original Terry Tate: Office Linebacker commercials for Reebok.\n\nIn 2004, he wrote and directed the hit comedy film, DodgeBall: A True Underdog Story. He wrote and directed the film adaptation of Michael Chabon's novel The Mysteries of Pittsburgh, released in 2008. He wrote and directed 2016's action-comedy Central Intelligence with Dwayne Johnson and Kevin Hart.\n\nHe directed the 2013 hit We're the Millers, starring Jason Sudeikis and Jennifer Aniston. In June 2014, he was rumored to replace Edgar Wright to direct Marvel's Ant-Man, but later turned the job down.\n\nThurber wrote and directed the 2018 action film Skyscraper from Legendary Pictures, reteaming with Dwayne Johnson and released by Universal. He next wrote and directed Legendary's $150 million budget action comedy Red Notice (2021), starring Ryan Reynolds, Gal Gadot, and Johnson. It is the third time he has collaborated with the latter. The project was released by Netflix.\n\nIn 2021, Ubisoft announced Thurber would direct the film adaptation of its game series, The Division, starring Jake Gyllenhaal and Jessica Chastain. The film will be released on Netflix.\n\nIn 2022, entertainment company eOne announced that Thurber will be writing and producing the pilot for upcoming TV series Dungeons & Dragons. He also signed on to direct a live-action film based on the Voltron franchise.\n\nDescription above from the Wikipedia article Rawson Marshall Thurber, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1975-02-09",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 57633,
        "imdb_id": "nm1098493",
        "known_for_department": "Directing",
        "name": "Rawson Marshall Thurber",
        "place_of_birth": "San Francisco, California, USA",
        "popularity": 0.2123,
        "profile_path": "/bFtVBwPGiQfhSbZbZdGFuP1acw1.jpg"
    }
}