{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fEaZwgkX2k91LJZ5APkaK0aDwg1.jpg",
                "genre_ids": [
                    18
                ],
                "id": 321741,
                "original_language": "en",
                "original_title": "Concussion",
                "overview": "A dramatic thriller based on the incredible true David vs. Goliath story of American immigrant Dr. Bennet Omalu, the brilliant forensic neuropathologist who made the first discovery of CTE, a football-related brain trauma, in a pro player and fought for the truth to be known. Omalu's emotional quest puts him at dangerous odds with one of the most powerful institutions in the world.",
                "popularity": 2.0031,
                "poster_path": "/uuRFr7Jhsq7bITDyyvxZrQMAr9e.jpg",
                "release_date": "2015-11-12",
                "title": "Concussion",
                "video": false,
                "vote_average": 7.082,
                "vote_count": 2627,
                "character": "Christopher Jones",
                "credit_id": "54c88530c3a36870ba00141a",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/3CFuFIwtSSQU4Fyd5NnmHnNZq9w.jpg",
                "genre_ids": [
                    10749,
                    18
                ],
                "id": 508791,
                "original_language": "en",
                "original_title": "The Sun Is Also a Star",
                "overview": "Two young New Yorkers begin to fall in love over the course of a single day, as a series of potentially life-altering meetings loom over their heads - hers concerning her family’s deportation to Jamaica, and his concerning an education at Dartmouth.",
                "popularity": 1.9124,
                "poster_path": "/dGl7ZnnL3WoiCKQAQdgkEF0EAbj.jpg",
                "release_date": "2019-05-16",
                "title": "The Sun Is Also a Star",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 610,
                "character": "Lester Barnes",
                "credit_id": "5e7ccdbb109dec1ebb0233b0",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Frank Harper",
            "F. Hill Harper",
            "Francis Harper",
            "Χιλ Χάρπερ",
            "هیل هارپر"
        ],
        "biography": "Frank Eugene \"Hill\" Harper is an American actor and political candidate. He is known for his roles as Dr. Sheldon Hawkes in CSI: NY, Agent Spelman Boyle in Limitless, and Dr. Marcus Andrews in The Good Doctor.  He is the son of two medical doctors, Harry D. Harper, a psychiatrist, and Marilyn Harper (née Hill), who was one of the first black practicing anesthesiologists in the United States and co-authored a book called Wearing Purple. Born Frank Eugene Harper, he adopted the name \"Hill\" as a tribute to both his maternal and paternal ancestors.\n\nHarper graduated magna cum laude from Brown University in 1988, with a BA degree in economics and sociology and was valedictorian of his department. In 1992, he graduated with a JD, cum laude, from Harvard Law School. He received an MPA degree with honors from John F. Kennedy School at Harvard University. During his years at Harvard, he was a full-time member of Boston's Black Folks Theater Company, one of the oldest and most acclaimed black theater troupes in the country.\n\nWhile a student at Harvard, Harper befriended Barack Obama, with whom he played basketball. In 2012, Harper was appointed to The President's Cancer Panel, a three-member body assigned to work with the National Institutes of Health (NIH) and make recommendations to the White House around cancer policy.\n\nHe subsequently moved to Los Angeles to pursue acting. He has received eight honorary degrees, including honorary doctorates from both Westfield State College and Howard University.",
        "birthday": "1966-05-17",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 57686,
        "imdb_id": "nm0004991",
        "known_for_department": "Acting",
        "name": "Hill Harper",
        "place_of_birth": "Iowa City, Iowa, USA",
        "popularity": 0.5728,
        "profile_path": "/cgaRPrgB4DBxogIgiLwuABVmJVw.jpg"
    }
}