{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/3yYNJeR6JynSE3Y1AfVIJQ6g3UX.jpg",
                "genre_ids": [
                    35
                ],
                "id": 427,
                "original_language": "fr",
                "original_title": "Mon oncle",
                "overview": "Genial, bumbling Monsieur Hulot loves his top-floor apartment in a grimy corner of the city, and cannot fathom why his sister's family has moved to the suburbs. Their house is an ultra-modern nightmare, which Hulot only visits for the sake of stealing away his rambunctious young nephew. Hulot's sister, however, wants to win him over to her new way of life, and conspires to set him up with a wife and job.",
                "popularity": 2.2745,
                "poster_path": "/wH6RyPiXFy8INLbViVkchLVOmBc.jpg",
                "release_date": "1958-05-10",
                "title": "Mon Oncle",
                "video": false,
                "vote_average": 7.419,
                "vote_count": 580,
                "character": "Georgette, the Housekeeper",
                "credit_id": "52fe4242c3a36847f801049d",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Germaine Yvonne Arnaud"
        ],
        "biography": "Germaine Yvonne Arnaud was a French-born pianist, singer and actress, who was well known for her career in Britain, as well as her native land. After beginning a career as a concert pianist as a child, Arnaud acted in musical comedies. She switched to non-musical comedy and drama around 1920 and was one of the players in the second of the Aldwych farces, A Cuckoo in the Nest, a hit in 1925. She also had dramatic roles and made films in the 1930s and 1940s, and continued to act into the 1950s. She occasionally performed as a pianist later in her career. The Yvonne Arnaud Theatre was named in her memory in Guildford, Surrey.",
        "birthday": "1890-12-19",
        "deathday": "1958-09-20",
        "gender": 1,
        "homepage": null,
        "id": 5770,
        "imdb_id": "nm0036084",
        "known_for_department": "Acting",
        "name": "Yvonne Arnaud",
        "place_of_birth": "Bordeaux, Gironde, France",
        "popularity": 0.0551,
        "profile_path": "/vKGuCZGktxIfRN2edBqxpMy8xSw.jpg"
    }
}