{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cLqvQbP2utIKHRonwXnDjY3l1kk.jpg",
                "genre_ids": [
                    14,
                    28,
                    53
                ],
                "id": 9495,
                "original_language": "en",
                "original_title": "The Crow",
                "overview": "Exactly one year after young rock guitarist Eric Draven and his fiancée are brutally killed by a ruthless gang of criminals, Draven, watched over by a hypnotic crow, returns from the grave to exact revenge.",
                "popularity": 7.3363,
                "poster_path": "/rMMB3v6jYHjsvXRNJYESacoTD7j.jpg",
                "release_date": "1994-05-11",
                "title": "The Crow",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 4303,
                "character": "Eric",
                "credit_id": "52fe44ffc3a36847f80b69b7",
                "order": 0
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/cLqvQbP2utIKHRonwXnDjY3l1kk.jpg",
                "genre_ids": [
                    14,
                    28,
                    53
                ],
                "id": 9495,
                "original_language": "en",
                "original_title": "The Crow",
                "overview": "Exactly one year after young rock guitarist Eric Draven and his fiancée are brutally killed by a ruthless gang of criminals, Draven, watched over by a hypnotic crow, returns from the grave to exact revenge.",
                "popularity": 7.3363,
                "poster_path": "/rMMB3v6jYHjsvXRNJYESacoTD7j.jpg",
                "release_date": "1994-05-11",
                "title": "The Crow",
                "video": false,
                "vote_average": 7.5,
                "vote_count": 4303,
                "credit_id": "5b5e4cfb9251415227032953",
                "department": "Crew",
                "job": "Fight Choreographer"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "이국호",
            "브랜든 리"
        ],
        "biography": "Brandon Bruce Lee, born February 1, 1965, in Oakland, California, was an American actor and martial artist who tragically died young during his ascent to stardom. Son of the legendary martial artist and actor Bruce Lee, Brandon inherited his father's athletic prowess and later followed him into the world of entertainment.\n\nLee's early life was split between California and Hong Kong. After his father's sudden death in 1973 when Brandon was just eight, he moved to Seattle with his mother and sister. Despite initial challenges as a teenager, Lee's interest in acting grew. He honed his craft at prestigious institutions like Emerson College and the Lee Strasberg Theatre and Film Institute.\n\nLee's film career began in the late 1980s. He opted to start in Hong Kong action films, capitalizing on his martial arts background and name recognition. His debut in \"Legacy of Rage\" (1986) garnered him a Hong Kong Film Award nomination for Best New Performer. Lee followed this with roles in films like \"Laser Mission\" (1989) and \"Showdown in Little Tokyo\" (1991), showcasing his charisma and action hero potential.\n\nIn 1992, Lee landed the lead role in \"The Crow,\" a dark fantasy film based on a popular comic book. The character, Eric Draven, a murdered musician seeking revenge, resonated with Lee. However, during filming in 1993, a tragic on-set accident involving a prop gun led to Brandon Lee's accidental shooting and death at the young age of 28.\n\nDespite the devastating circumstances, \"The Crow\" was completed using special effects and released in 1994. The film became a cult classic, forever linked to Lee's memory and unfulfilled potential. Brandon Lee's legacy remains one of immense talent and a promising career cut tragically short.",
        "birthday": "1965-02-01",
        "deathday": "1993-03-31",
        "gender": 2,
        "homepage": null,
        "id": 57700,
        "imdb_id": "nm0000488",
        "known_for_department": "Acting",
        "name": "Brandon Lee",
        "place_of_birth": "Oakland, California, USA",
        "popularity": 0.4684,
        "profile_path": "/1PV3h6KP0AzeqFCZjb3qxkpfoGE.jpg"
    }
}