{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/364B8ohneoQSgIuYNRYZhjOCcEL.jpg",
                "genre_ids": [
                    16,
                    10751,
                    35,
                    28,
                    12
                ],
                "id": 9502,
                "original_language": "en",
                "original_title": "Kung Fu Panda",
                "overview": "When the Valley of Peace is threatened, lazy Po the panda discovers his destiny as the \"chosen one\" and trains to become a kung fu hero, but transforming the unsleek slacker into a brave warrior won't be easy. It's up to Master Shifu and the Furious Five -- Tigress, Crane, Mantis, Viper and Monkey -- to give it a try.",
                "popularity": 14.4846,
                "poster_path": "/wWt4JYXTg5Wr3xBW2phBrMKgp3x.jpg",
                "release_date": "2008-06-04",
                "title": "Kung Fu Panda",
                "video": false,
                "vote_average": 7.306,
                "vote_count": 12112,
                "character": "Rhino Guard (voice)",
                "credit_id": "551e1494c3a3683a14001f5e",
                "order": 19
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/364B8ohneoQSgIuYNRYZhjOCcEL.jpg",
                "genre_ids": [
                    16,
                    10751,
                    35,
                    28,
                    12
                ],
                "id": 9502,
                "original_language": "en",
                "original_title": "Kung Fu Panda",
                "overview": "When the Valley of Peace is threatened, lazy Po the panda discovers his destiny as the \"chosen one\" and trains to become a kung fu hero, but transforming the unsleek slacker into a brave warrior won't be easy. It's up to Master Shifu and the Furious Five -- Tigress, Crane, Mantis, Viper and Monkey -- to give it a try.",
                "popularity": 14.4846,
                "poster_path": "/wWt4JYXTg5Wr3xBW2phBrMKgp3x.jpg",
                "release_date": "2008-06-04",
                "title": "Kung Fu Panda",
                "video": false,
                "vote_average": 7.306,
                "vote_count": 12112,
                "credit_id": "52fe4500c3a36847f80b6c9f",
                "department": "Directing",
                "job": "Director"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "John Stevenson (born 1958) is a British filmmaker and puppeteer. Stevenson has over 40 years of experience with animation.\n\nStevenson worked as a story artist on the feature films The Great Muppet Caper, The Dark Crystal, Labyrinth and Little Shop of Horrors and as a character designer and story artist on shows and films like The Dreamstone, Count Duckula, Back to the Future: The Animated Series, The Twisted Tales of Felix the Cat, two of the Fox Tales specials and FernGully 2: The Magical Rescue. He also worked as an art director on Back to the Future: The Animated Series and a puppeteer on James & the Giant Peach and Motion Capture Performer on The Moxy Pirate Show. In 1991, Stevenson moved to the United States, and in 1998 he was hired as a head of story at DreamWorks Animation. There he worked for many years in the art department on many films such as Shrek, Shrek 2, Madagascar and Sinbad: Legend of the Seven Seas, in addition to helming a number of episodes of their animated primetime show Father of the Pride. He worked for four years bringing Kung Fu Panda to the screen.\n\nIn 2009, Stevenson was nominated for an Academy Award with Mark Osborne for Best Animated Feature for Kung Fu Panda and won the Annie Award with Osborne for Directing in a Feature Production.\n\nIn 2011-12 Stevenson directed a six-minute animated short film for The Coca-Cola Company produced by Ridley and Tony Scott called The Polar Bears.\n\nSince 2012, Stevenson has been directing for Rocket Pictures the sequel of Gnomeo & Juliet, titled Sherlock Gnomes, The film was released on 23 March 2018 to negative reception.\n\nStevenson was originally set to work as director for an upcoming film based on the character created by Mattel, He-Man and the Masters of the Universe. He was also attached to various projects like The Minotaur Takes a Cigarette Break, We3, Alien Rock Band and Rotten Island. In August 2014, it was announced that Stevenson will direct for Unified Pictures a CG-animated feature film The Ark and the Aardvark inspired by Noah's Ark.\n\nDescription above from the Wikipedia article John Stevenson, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 57742,
        "imdb_id": "nm0828970",
        "known_for_department": "Directing",
        "name": "John Stevenson",
        "place_of_birth": "London, England, UK",
        "popularity": 0.2044,
        "profile_path": "/b2aresqm1BcUuCuJN0PZfWbrwmi.jpg"
    }
}