{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/v4yVTbbl8dE1UP2dWu5CLyaXOku.jpg",
                "genre_ids": [
                    12,
                    14,
                    10749,
                    10751
                ],
                "id": 420817,
                "original_language": "en",
                "original_title": "Aladdin",
                "overview": "A kindhearted street urchin named Aladdin embarks on a magical adventure after finding a lamp that releases a wisecracking genie while a power-hungry Grand Vizier vies for the same lamp that has the power to make their deepest wishes come true.",
                "popularity": 9.4595,
                "poster_path": "/ykUEbfpkf8d0w49pHh0AD2KrT52.jpg",
                "release_date": "2019-05-22",
                "title": "Aladdin",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 10349,
                "character": "Razoul Chief City Guard (uncredited)",
                "credit_id": "5c2b793e92514122a96c9d1a",
                "order": 36
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Robby Haynes is a multi-talented self styled actor, script writer & director starring in Fighting Talk , Space Bandits: Fight for Extant and appearing in Disney blockbuster live action remakes Will Smith Aladdin (2019) (2019) and Artemis Fowl (2020).\n\nThe fact is, Robby was born and grew up in North London, UK in the mid-70s. It was difficult enough without being black, one of four siblings in a single parent (Catherine Sargeant) household struggling to make ends meet. The only escape from his impoverished existence was discovering at eleven years old, the joys of the theatre attached to his brand new secondary school. Robby finally found creative, expressive freedom there where he could hone and develop his chosen craft. He met some good, fun-loving friends, the teachers gravitated towards him, nurtured and encouraged him to explore his musical (piano, trumpet, drums, guitar) technical (lighting, effects, sound) writing, directing and acting abilities, appearing in every theatre production throughout his education.\n\nCompletely immersed in the entertainment industry, Robby is now directing his debut films 'Fighting Talk' and 'Space Bandits: Fight For Extant'. He is an accomplished writer, actor, award-winning producer and casting agent, often spotted lurking on film and TV locations searching for emerging talents. He is firmly established in the film and music industry and is also known for music artists tour management, video producing and directing.\n\nRobby is kind but driven and passionate about his way of life. He can be tough and straight-talking on set but, when asked, he is honest in his opinions. His wish is to impart his industry knowledge to those that show similar traits, as his mentors did for him whilst growing up.\n\nRobby lives & works in London and Hertfordshire.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 578697,
        "imdb_id": "nm3346556",
        "known_for_department": "Acting",
        "name": "Robby Haynes",
        "place_of_birth": null,
        "popularity": 0.0621,
        "profile_path": "/ftxMe3ABHVt092rbZCd1mZI2P1u.jpg"
    }
}