{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uov0QRXGEaIsVGis2ttJ1ax32Kc.jpg",
                "genre_ids": [
                    18,
                    10749,
                    14
                ],
                "id": 4688,
                "original_language": "en",
                "original_title": "Across the Universe",
                "overview": "When young dockworker Jude leaves Liverpool to find his estranged father in the United States, he is swept up by the waves of change that are re-shaping the nation. Jude falls in love with Lucy, who joins the growing anti-war movement. As the body count in Vietnam rises, political tensions at home spiral out of control and the star-crossed lovers find themselves in a psychedelic world gone mad.",
                "popularity": 2.069,
                "poster_path": "/447c8Te3DXC46rQvDEixKGO4dS6.jpg",
                "release_date": "2007-09-14",
                "title": "Across the Universe",
                "video": false,
                "vote_average": 7.139,
                "vote_count": 1387,
                "character": "Bum/Pimp/Mad Hippie",
                "credit_id": "5a63cdd80e0a2619f2017863",
                "order": 25
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "John Robert Cocker",
            "Vance Arnold",
            "The Sheffield Soul Shouter",
            "Joe Cocker and The Grease Band",
            "Joe's Grease Band",
            "The Grease Band"
        ],
        "biography": "John Robert Cocker (20 May 1944 – 22 December 2014), better known as Joe Cocker, was an English singer. He was known for his gritty voice, spasmodic body movement in performance, and distinctive versions of popular songs of varying genres.\n\nCocker's recording of the Beatles' \"With a Little Help from My Friends\" reached number one in the UK in 1968. He performed the song live at Woodstock in 1969 and performed the same year at the Isle of Wight Festival, and at the Party at the Palace concert in 2002 for the Golden Jubilee of Queen Elizabeth II. His version also became the theme song for the TV series The Wonder Years. His 1974 cover of \"You Are So Beautiful\" reached number five in the US.\n\nCocker was the recipient of several awards, including a 1983 Grammy Award for his US number one \"Up Where We Belong\", a duet with Jennifer Warnes. In 2008 he received an OBE at Buckingham Palace for services to music. Cocker was ranked number 97 on Rolling Stone's 100 greatest singers list.\n\nFrom Wikipedia, the free encyclopedia",
        "birthday": "1944-05-20",
        "deathday": "2014-12-22",
        "gender": 2,
        "homepage": "http://cocker.com",
        "id": 57891,
        "imdb_id": "nm0168312",
        "known_for_department": "Acting",
        "name": "Joe Cocker",
        "place_of_birth": "Sheffield, South Yorkshire, England, UK",
        "popularity": 0.1072,
        "profile_path": "/eIzpWl68deI2nrFVxvW99YrbRTt.jpg"
    }
}