{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jDJCWtxwHRhFhhlm2vIV8ktOtJM.jpg",
                "genre_ids": [
                    18
                ],
                "id": 160588,
                "original_language": "en",
                "original_title": "Blue Jasmine",
                "overview": "After experiencing a traumatic misfortune, Jasmine French, a wealthy woman from New York, moves to San Francisco to live with her foster sister Ginger and the firm purpose of getting a new life, but she will be haunted by anxiety and memories of the past.",
                "popularity": 2.7057,
                "poster_path": "/nsj0RLRI10351uYMoAKPur6Derd.jpg",
                "release_date": "2013-08-01",
                "title": "Blue Jasmine",
                "video": false,
                "vote_average": 6.986,
                "vote_count": 3521,
                "character": "Augie",
                "credit_id": "52fe4c33c3a36847f82229eb",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/dDYpjrwh1wNVQk0rEpc9P81wQt4.jpg",
                "genre_ids": [
                    10402,
                    18,
                    10749
                ],
                "id": 332562,
                "original_language": "en",
                "original_title": "A Star Is Born",
                "overview": "Seasoned musician Jackson Maine discovers — and falls in love with — struggling artist Ally. She has just about given up on her dream to make it big as a singer — until Jack coaxes her into the spotlight. But even as Ally's career takes off, the personal side of their relationship is breaking down, as Jack fights an ongoing battle with his own internal demons.",
                "popularity": 5.4739,
                "poster_path": "/wrFpXMNBRj2PBiN4Z5kix51XaIZ.jpg",
                "release_date": "2018-10-03",
                "title": "A Star Is Born",
                "video": false,
                "vote_average": 7.498,
                "vote_count": 11944,
                "character": "Lorenzo Campana",
                "credit_id": "59218bfac3a3687a8e055c47",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Andrew Clay Silverstein "
        ],
        "biography": "Andrew Dice Clay is an American stand-up comedian and actor. He rose to prominence in the late 1980s with a brash, deliberately offensive persona known as \"The Diceman\". In 1990, he became the first stand-up comedian to sell out Madison Square Garden for two consecutive nights. That same year, he played the lead role in the comedy-mystery film The Adventures of Ford Fairlane.\n\nClay has appeared in several films and television shows, including critically acclaimed supporting roles in Blue Jasmine and A Star Is Born, the latter of which earned him a Screen Actors Guild Award nomination. He continues his acting career while also touring and performing stand-up. The television show Dice aired on Showtime for two seasons. He also launched a podcast, I'm Ova Hea' Now, in September 2018.\n\nDescription above from the Wikipedia article Andrew Dice Clay, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1957-09-29",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 57906,
        "imdb_id": "nm0001048",
        "known_for_department": "Acting",
        "name": "Andrew Dice Clay",
        "place_of_birth": "Brooklyn, New York, USA",
        "popularity": 0.5587,
        "profile_path": "/xwNn8mJrhww89P2pIVkWnaTlqHw.jpg"
    }
}