{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dLL90vskYFn1S89RZp5TUguK9wl.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 4982,
                "original_language": "en",
                "original_title": "American Gangster",
                "overview": "Loosely based on the criminal career of Frank Lucas, a gangster from La Grange, North Carolina, who smuggled heroin into the United States on American service planes returning from the Vietnam War, before being detained by a task force led by Newark Detective Richie Roberts.",
                "popularity": 7.5255,
                "poster_path": "/8sV6nWuKczuXRt0C6EWoXqJAj6G.jpg",
                "release_date": "2007-11-02",
                "title": "American Gangster",
                "video": false,
                "vote_average": 7.591,
                "vote_count": 5725,
                "character": "Jimmy Zee",
                "credit_id": "52fe43ebc3a36847f8078403",
                "order": 21
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Malcolm J Goodwin",
            "말콤 굿윈",
            "مالکوم گودوین"
        ],
        "biography": "Malcolm Goodwin (born November 28, 1982) is an American actor.  He has appeared in American Gangster, Breakout Kings, Detroit 1-8-7, Leatherheads, The Longshots and Crazy on the Outside. Malcolm Goodwin is an actor who had been featured in the magazines Interview, LA Confidential, King, Vibe, and Venice. He has starred in numerous feature films including American Gangster, The Lazarus Project, Brief Interview with Hideous Men, Leatherheads, Mississippi Damned, Crazy on the Outside, and The Longshots. His TV credits include “Raising the Bar,” “Hack,” “Law & Order,” “L&O Criminal Intent,” “K*Ville,” “Detroit 187” and he’s a series regular on A&E crime drama “Breakout Kings.” His love for acting began at Julia Richman Talent Unlimited Program in New York City and he later on trained at SUNY Purchase College Acting Conservatory, where he received a Bachelors Degree in Theatre Arts and Film. Goodwin has directed and produced independent commercials, sketches, short films, music videos and public service announcements. He recently appeared in the music video for the song \"Party Rock Anthem\" by LMFAO.",
        "birthday": "1982-11-28",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 57997,
        "imdb_id": "nm0329511",
        "known_for_department": "Acting",
        "name": "Malcolm Goodwin",
        "place_of_birth": "Brooklyn, New York City, New York, USA",
        "popularity": 0.7622,
        "profile_path": "/h2AVP07OdXOsX3ERNwpsQuvrUEB.jpg"
    }
}