{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/oQ024BtJgArg8WI4zfuc2vkCJno.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 363676,
                "original_language": "en",
                "original_title": "Sully",
                "overview": "On 15 January 2009, the world witnessed the 'Miracle on the Hudson' when Captain 'Sully' Sullenberger glided his disabled plane onto the Hudson River, saving the lives of all 155 souls aboard. However, even as Sully was being heralded by the public and the media for his unprecedented feat of aviation skill, an investigation was unfolding that threatened to destroy his reputation and career.",
                "popularity": 6.3982,
                "poster_path": "/4vs83YcJ8TsabADDtaeCJ6ZTjYY.jpg",
                "release_date": "2016-09-07",
                "title": "Sully",
                "video": false,
                "vote_average": 7.197,
                "vote_count": 7438,
                "character": "Doreen Welsh",
                "credit_id": "57dc7d53c3a368639c001b70",
                "order": 20
            },
            {
                "adult": false,
                "backdrop_path": "/7Gzsn4yiwMSXvYcbWXsoDhq8QO2.jpg",
                "genre_ids": [
                    10749,
                    18
                ],
                "id": 632322,
                "original_language": "en",
                "original_title": "All My Life",
                "overview": "It was a chance meeting started by one of Sol’s friends trying to chat up Jennifer. However, in the end, it was those two who hit it off. Sol enjoyed Jen’s smile, her effort, and how silly she could be. Jen enjoyed Sol’s cooking, his athleticism, and that he would join her in fun moments. As you can imagine, love bloomed, and things got serious. Jen’s investment in Sol led to her pushing him to follow his dreams and even move in to save money. Sol’s investment in Jen well, it led to him proposing. But what started as a liver tumor grew into full-on cancer, so with a diagnosis of 6 months to live, Sol and Jennifer try to make the best of it.",
                "popularity": 3.3821,
                "poster_path": "/xoKZ4ZkVApcTaTYlGoZ3J8xcIzG.jpg",
                "release_date": "2020-10-23",
                "title": "All My Life",
                "video": false,
                "vote_average": 7.8,
                "vote_count": 500,
                "character": "Hope Marie Carter",
                "credit_id": "687dc4881db2322db038d937",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Molly Hagen",
            "مولی هیگن"
        ],
        "biography": "Molly Hagan is an American actress born on August 3, 1961, in Minneapolis, Minnesota, and raised in Fort Wayne, Indiana. She developed an early passion for acting and performed in school plays, including a notable role as Glinda the Good Witch in a school production of \"The Wizard of Oz.\" Hagan attended Northwestern University where she earned a Bachelor of Science degree in speech in 1983. After college, she appeared in regional theater productions in Los Angeles, San Diego, and Chicago before moving into film and television work.\n\nHer acting career began in the mid-1980s with roles in films such as \"Code of Silence\" (1985) and \"Some Kind of Wonderful\" (1987). She gained further experience through various television roles, including parts in \"The Golden Girls,\" \"Herman's Head\" (where she played the character Angel from 1991 to 1994), and the TV movie \"Dallas: The Early Years,\" where she portrayed a young Miss Ellie Ewing. Hagan has also had guest roles on numerous popular shows including \"Seinfeld,\" \"Friends,\" \"Charmed,\" \"Grey's Anatomy,\" and more.\n\nHagan’s film credits include roles in \"Election\" (1999), \"The Dentist\" (1996), and \"Sully\" (2016). She continued to secure roles well into the 2010s and 2020s with appearances on series like \"Unfabulous,\" \"iZombie,\" \"Jane the Virgin,\" \"Walker,\" and others. Beyond acting, she has worked as a writer, producer, and casting director. Molly Hagan remains active in the industry, recognized for her versatility and enduring presence on both television and film",
        "birthday": "1961-08-03",
        "deathday": null,
        "gender": 1,
        "homepage": "https://mollyhagan.com",
        "id": 58045,
        "imdb_id": "nm0353243",
        "known_for_department": "Acting",
        "name": "Molly Hagan",
        "place_of_birth": "Minneapolis, Minnesota, USA",
        "popularity": 0.8312,
        "profile_path": "/m5pL170dlh7ex4lTESAK5kKARde.jpg"
    }
}