{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uIh3mW3AuSM7ww7NYtvSWDQ1zc7.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 21450,
                "original_language": "en",
                "original_title": "Naked",
                "overview": "An unemployed Brit vents his rage on unsuspecting strangers as he embarks on a nocturnal London odyssey.",
                "popularity": 1.8642,
                "poster_path": "/xMYP4uaNeyPmX4FQ2xxWk2eIN6K.jpg",
                "release_date": "1993-08-06",
                "title": "Naked",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 612,
                "character": "Jeremy",
                "credit_id": "52fe4419c3a368484e00f639",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nGreg Cruttwell (born in 1962 in London) is an English actor, screenwriter, director and film producer. He is the son of actress Geraldine McEwan and Hugh Cruttwell, former principal of the Royal Academy of Dramatic Art.\n\nCruttwell attended the London Academy of Music and Dramatic Art. Before branching out as director and producer, Cruttwell had performed in over 20 theatre productions throughout Great Britain. In 1990, he wrote and starred in the play Waiting for Sir Larry, which won the Fringe First Award at the Edinburgh Festival.\n\nHe made his film debut in Mike Leigh's Naked (1993) and had a leading role in John Herzfeld's 2 Days in the Valley (1996), starring alongside Danny Aiello, James Spader and Jeff Daniels. His last acting role to date is in the box office smash George of the Jungle (1997).\n\nCruttwell has been seen in numerous British television productions, Murder Most Horrid, French & Saunders, and Birds of a Feather. In the United States, he guest starred in episodes of Murder, She Wrote and The Marshal.\n\nIn 2002, together with producer Phil Hunt, he has formed a production company, Head Gear Films. His first feature film, Chunky Monkey, starring David Threlfall and Alison Steadman, is being shown in the UK. Cruttwell is currently producing Rabbit On The Moon, for Head Gear Films, a political thriller set in Mexico and the UK.\n\nDescription above from the Wikipedia article Jeff Daniels, licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": "1962-01-01",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 58090,
        "imdb_id": "nm0190208",
        "known_for_department": "Acting",
        "name": "Greg Cruttwell",
        "place_of_birth": "London, England, UK",
        "popularity": 1.4997,
        "profile_path": "/qgoBvIrI0QdUa8fmC1LPNHUBkSh.jpg"
    }
}