{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yjlg8Gq3TAWlFSUxh7Icey8uM4P.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 10653,
                "original_language": "en",
                "original_title": "The Seven Year Itch",
                "overview": "With his family away for their annual summer holiday, a publishing executive decides to live a bachelor's life. The beautiful but ditzy blonde from the apartment above catches his eye and they soon start spending time together—maybe a little too much time!",
                "popularity": 1.7389,
                "poster_path": "/4oLqx0QbjWFzWtkxRmDLGH47CUJ.jpg",
                "release_date": "1955-06-03",
                "title": "The Seven Year Itch",
                "video": false,
                "vote_average": 7.063,
                "vote_count": 934,
                "character": "Elaine",
                "credit_id": "52fe439c9251416c75017315",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Roxanne "
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nRoxanne (born Dolores Rosedale, March 20, 1928) is an American former model and actress. She was born in Minneapolis, Minnesota. She was the blonde assistant on the Bud Collyer-hosted original version of the Goodson-Todman Productions game show Beat the Clock. Roxanne was replaced by Beverly Bentley in August 1955. She gave birth to her daughter Ann in December 1955. Roxanne did not use a surname in her professional work.\n\nRoxanne had a doll fashioned after her which was called, naturally, The Roxanne Doll. It was a hard plastic doll which stood 18 inches (46 cm) tall. It had movable legs which allowed the doll to \"walk\". They were manufactured circa 1953 by the Valentine Company. The blue-eyed doll had a Beat the Clock tag on the doll's wrist and came with a miniature red camera. Roxanne would give these dolls to the contestants' daughters on Beat the Clock.\n\nRoxanne also appeared in a small role in Billy Wilder's The Seven Year Itch (1954). As of February 2015, Roxanne was living in Minneapolis, Minnesota.",
        "birthday": "1928-03-20",
        "deathday": "2024-05-02",
        "gender": 1,
        "homepage": null,
        "id": 581460,
        "imdb_id": "nm2174856",
        "known_for_department": "Acting",
        "name": "Dolores Rosedale",
        "place_of_birth": "Minneapolis, Minnesota, USA",
        "popularity": 0.0496,
        "profile_path": "/3fFGuGQFqqbXnLJvIZ3jP6kvYhU.jpg"
    }
}