{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/65d0MccsiRSPTVicregKQL8owoo.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 9603,
                "original_language": "en",
                "original_title": "Clueless",
                "overview": "Shallow, rich and socially successful Cher is at the top of her Beverly Hills high school's pecking scale. Seeing herself as a matchmaker, Cher first coaxes two teachers into dating each other. Emboldened by her success, she decides to give hopelessly klutzy new student Tai a makeover. When Tai becomes more popular than she is, Cher realizes that her disapproving ex-stepbrother was right about how misguided she was -- and falls for him.",
                "popularity": 6.2422,
                "poster_path": "/8AwVTcgpTnmeOs4TdTWqcFDXEsA.jpg",
                "release_date": "1995-07-19",
                "title": "Clueless",
                "video": false,
                "vote_average": 7.268,
                "vote_count": 4614,
                "character": "Dionne",
                "credit_id": "52fe4510c3a36847f80ba287",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Stacey L. Dash",
            "Stacy Dash"
        ],
        "biography": "Stacey Dash was born in the Bronx, New York. Stacy knew that she wanted to act, and from an early age began to act professionally. She made regular appearances on The Cosby Show (1984), The Fresh Prince of Bel-Air (1990), and also St. Elsewhere (1982). At 21 she made her feature film debut in Enemy Territory (1987), which was quickly followed by Moving (1988), in which she played Richard Pryor's teenage daughter. Four years later she was in Mo' Money (1992), with Damon Wayans. In 1994 she starred with Mark Wahlberg in Renaissance Man (1994). In 1995 she did the provocative erotic thriller Illegal in Blue (1995) and later that year got her big break when was cast as Dionne in the hit comedy Clueless (1995). She went on to star in the UPN sitcom Clueless (1996) that was based on the movie, and which lasted for two years. During that time she completed Oliver Stone's Cold Around the Heart (1997) and also the independent film Personals (1999). After leaving \"Clueless\" in 1999, Stacey seems to be moving along nicely. She has recently appeared in The Painting (2001) and Paper Soldiers (2002).",
        "birthday": "1967-01-20",
        "deathday": null,
        "gender": 1,
        "homepage": "http://officialstaceydash.com",
        "id": 58150,
        "imdb_id": "nm0001107",
        "known_for_department": "Acting",
        "name": "Stacey Dash",
        "place_of_birth": "Bronx, New York, USA",
        "popularity": 0.3831,
        "profile_path": "/cSzVCx2LJkXZoUGA4z4i8cm9wMD.jpg"
    }
}