{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/kT8orKwz2bmRdHBLnG44yucYtFy.jpg",
                "genre_ids": [
                    28,
                    53
                ],
                "id": 204082,
                "original_language": "en",
                "original_title": "Homefront",
                "overview": "Phil Broker is a former DEA agent who has gone through a crisis after his action against a biker gang went horribly wrong and it cost the life of his boss' son. He is recently widowed and is left with a 9-years-old daughter, Maddy. He decides to quit the turbulent and demanding life of thrill for Maddy's sake and retires to a small town. His daughter fights off a boy who was bullying her at school and this sets in motion a round of events that end in his direct confrontation with the local Meth drug lord. His past history with the biker gang also enters the arena, making matters more complex. But he has a mission in his mind to protect his daughter and he is ready to pay any cost that it demands.",
                "popularity": 10.4802,
                "poster_path": "/6pF8D9bDIAmuHgCqGKEfuNWRQam.jpg",
                "release_date": "2013-11-12",
                "title": "Homefront",
                "video": false,
                "vote_average": 6.943,
                "vote_count": 3647,
                "character": "Susan Hetch",
                "credit_id": "52fe4cecc3a368484e1cd1ab",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Rachelle Lefèvre",
            "Rachelle Marie Lefevre",
            "Rachelle Lefebvre",
            "Rachelle Marie Lefèvre",
            "راشل لفور"
        ],
        "biography": "From Wikipedia, the free encyclopedia.  \n\nRachelle Marie Lefevre (born February 1, 1979) is a Canadian actress. She has starred in the television series Big Wolf on Campus and had recurring roles in What About Brian, Boston Legal, and Swingtown. She is also known for playing Victoria in the Twilight saga film series, based on the novels of the same names by Stephenie Meyer. Lefevre stars in the ABC medical drama Off the Map, which premiered in January 2011.",
        "birthday": "1979-02-01",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 58168,
        "imdb_id": "nm0498956",
        "known_for_department": "Acting",
        "name": "Rachelle Lefevre",
        "place_of_birth": "Montreal, Québec, Canada",
        "popularity": 1.1518,
        "profile_path": "/5ETzDBwbCZ9xYLMmD5c39snVsoQ.jpg"
    }
}