{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/czfbhgM0cjFqPt4ARofDKgRHCyj.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 5967,
                "original_language": "fr",
                "original_title": "Les Parapluies de Cherbourg",
                "overview": "This simple romantic tragedy begins in 1957. Guy Foucher, a 20-year-old French auto mechanic, has fallen in love with 17-year-old Geneviève Emery, an employee in her widowed mother's chic but financially embattled umbrella shop. On the evening before Guy is to leave for a two-year tour of combat in Algeria, he and Geneviève make love. She becomes pregnant and must choose between waiting for Guy's return or accepting an offer of marriage from a wealthy diamond merchant.",
                "popularity": 2.7837,
                "poster_path": "/tAgTf64XKK5ir7w5C7dnB53jWWG.jpg",
                "release_date": "1964-02-19",
                "title": "The Umbrellas of Cherbourg",
                "video": false,
                "vote_average": 7.406,
                "vote_count": 836,
                "character": "Monsieur Dubourg",
                "credit_id": "5e0d5e91fd4f8000155dfb1e",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Harald Otto Walther Wolff (11 January 1909 – June 1977) was a German stage, film and television actor.\n\nHarald Wolff, born in Barmen in 1909, first completed an apprenticeship as a businessman after graduating from high school before switching to acting. Wolff played his first film role in 1939 in Helmut Käutner 's comedy Kitty and the World Conference.\n\nAfter World War II, in addition to appearances in German films, he also took part in various international film productions, including the 1951 American war drama Decision Before Dawn by director Anatole Litvak; 1956 in the French comedy film Two Men, a Pig, and the Night of Paris by Claude Autant-Lara; 1957 in Maurice Labro s literary adaptation Spione alongside Henri Vidal, Barbara Laage or Lino Ventura and in 1964 in Jacques Demy's musical The Umbrellas of Cherbourg. In 1972, he acted in Costa-Gavras political thriller The Invisible Uprising.\n\nIn addition, Wolff, as a voice actor, has lent his voice to many internationally known fellow actors over the decades. In the 1960s, he dubbed Desmond Llewelyn as Q in the James Bond films Goldfinger and Thunderball. He also dubbed Charles Boyer in the 1967 Bond parody Casino Royale. Vincent Price in Cry of the Banshee and Claude Rains in The Adventures of Robin Hood were dubbed by Wolff.\n\nSource: Article \"Harald Wolff\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1909-01-11",
        "deathday": "1977-06-01",
        "gender": 2,
        "homepage": null,
        "id": 582145,
        "imdb_id": "nm0938245",
        "known_for_department": "Acting",
        "name": "Harald Wolff",
        "place_of_birth": "Barmen [now Wuppertal], Germany",
        "popularity": 1.7297,
        "profile_path": "/sHW9umdXfMxhCu91Xqbbgb8vwKt.jpg"
    }
}