{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/t07Pdtl3rTbE5mBdV8hAggHcGVN.jpg",
                "genre_ids": [
                    35,
                    10751,
                    14
                ],
                "id": 433,
                "original_language": "en",
                "original_title": "Mary Poppins",
                "overview": "Mr Banks is looking for a nanny for his two mischievous children and comes across Mary Poppins, an angelic nanny. She not only brings a change in their lives but also spreads happiness.",
                "popularity": 5.3935,
                "poster_path": "/ei8hhYCMfURfPOXKBnyl61be2iV.jpg",
                "release_date": "1964-12-17",
                "title": "Mary Poppins",
                "video": false,
                "vote_average": 7.56,
                "vote_count": 4833,
                "character": "Michael Banks",
                "credit_id": "52fe4243c3a36847f801082b",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Matthew Adam Garber"
        ],
        "biography": "Matthew Adam Garber was a British child actor born March 25, 1956 in Stepney, London, England, UK. Both of his parents were theatrical actors, but neither was particularly famous.\n\nIn 1963, Garbet came to the attention of actor Roy Dotrice (father of Karen Dotrice) who was seeking potential child actors. Roy recommended Garber to the casting department of the Disney company, where young Garber's \"artful dodges, like squinting, screwing up his nose, and brushing his hair back with one hand\" were thought likely to make him stand out. He was cast in the film \"The Three Lives of Thomasina\" (1963), as the character Geordie McNab, a playmate to the Scottish girl Mary MacDhui (played by Karen Dotrice).\n\nGarber next received a bigger role as the character Michael Banks in \"Mary Poppins\" (1964), one of the two charges of the protagonist nanny. Jane Banks, Michael's sister, was played by Karen Dotrice. The film was the greatest hit of Garber's career, and is the role for which he is most remembered.\n\nIn 1967, Garber had his third and last film role, as the character Rodney Winthrop in \"The Gnome-Mobile\". In the film, Rodney and his sister Elizabeth Winthrop (played by Karen Dotrice) are trying to prolong the life of a 943-year-old gnome, who has lost the will to survive.\n\nFollowing his brief film career, Garber returned to his school studies. He attended first St Paul's Primary School in Winchmore Hill, and then Highgate School in Highgate, North London. He graduated in 1972.\n\nIn 1976-1977, Garber was in India and contacted hepatitis. He returned to London in June, 1977, seeking better medical treatment. It was too late as the disease had infected his pancreas. He died soon after, June 13, 1977 in Hampstead, London, England, UK, the official cause being hemorrhagic necrotizing pancreatitis. He was only 21-years-old. He was single, and had no known children.\n\nGarber's remains were cremated at St. Marylebone Crematorium, in East Finchley, London. Both of his parents died within a decade following his death. Fergus Garber, a surviving younger brother of Matthew, was never informed whether there was any memorial erected for his brother. Garber was posthumously named a Disney Legend in 2004.",
        "birthday": "1956-03-25",
        "deathday": "1977-06-13",
        "gender": 2,
        "homepage": null,
        "id": 5830,
        "imdb_id": "nm0304955",
        "known_for_department": "Acting",
        "name": "Matthew Garber",
        "place_of_birth": "Stepney, London, England, UK",
        "popularity": 0.5031,
        "profile_path": "/x78xIImLQWfPFbDnhWTmRhe8vg2.jpg"
    }
}