{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/eY6bnNP10bWljC19v8UXAScHyuP.jpg",
                "genre_ids": [
                    18,
                    80,
                    53
                ],
                "id": 1538,
                "original_language": "en",
                "original_title": "Collateral",
                "overview": "Cab driver Max picks up a man who offers him $600 to drive him around. But the promise of easy money sours when Max realizes his fare is an assassin.",
                "popularity": 7.0771,
                "poster_path": "/nV5316WUsVij8sVXLCF1g7TFitg.jpg",
                "release_date": "2004-08-04",
                "title": "Collateral",
                "video": false,
                "vote_average": 7.233,
                "vote_count": 5924,
                "character": "Peter Lim's Bodyguard (uncredited)",
                "credit_id": "5ee68e023ff2df0022686b1a",
                "order": 89
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "D-Teflon is an award-winning Actor Writer television producer and film executive & musician, known for Waco (2018) Rookie Blue,(2011) Jason's Revenge(2016) First Kill (2017) FX The Series (1996-98) as the witty & charming ladies man as Prosecutor Chris Darden alongside Carrie Ann Moss\n\nOver a decade now he has been an entertainment industry professional. D-Teflon produced for 2 seasons the Hit Reality TV Series Guarding the Stars on the Star TV E-Network & starred in and produced the award-winning short film Blood Bath Jason Vs Micheal (2013)\n\nD-Teflon known for either playing the Bad Guy or the Police Officer or Federal Agent roles stepped into a new element for the first time in 2013 into Horror and on his first film won for best new Actor starring as Jason Voorhees in Blood Bath a short film in the Terror Film Festival which also won best Horror at the Sarasota Film Scream Fest Festival. He has appeared on networks such with diverse abilities has acted and produced roles in everything to appearances on BET & FX network since 1996 with over a dozen film & producer credits that include motion pictures, television, and commercials since engaging into the Hollywood Film Industry.\n\nD-Teflon's career in the film industry ranged from being as a production assistant in the mail room of a major talent agency to working as a associate producer under the direction of his mentors Producers Sydney Pollack Randall Emmett,Avi Lerner & working as a Personal Bodyguard in WWE for various superstars as well music stars such as 50 Cent, Ja Rule , Justin Timberlake Morgan Freeman & John Travolta,Kiefer Sutherland Nicholas Cage just to name a few.\n\nThis gave him extensive exposure in Hollywood, allowing him to form key relationships with industry professionals.\n\nD-Teflon is a Partner at the Alliance Entertainment Group and Vision Films Studios and is the Security Director for Randall Emmett at Emmett Furla Oasis Films.\n\nD-Teflon is a professionally trained Actor He trained at one of the most prestigious acting academy's, The Hollywood Film & Acting Academy of Dramatic Arts, Hollywood. There he studied & learned from the best industry professionals, personal coaches & acting teachers.\n\nNever afraid to get his hands dirty D-Teflon does most of his own Stunts, and has a background in Martial Arts, & has traveled all around the world & is extremely well versed & knowledgeable about worldly events.\n\nD-Teflon resides in Sarasota Florida but splits his time living in Hollywood & Toronto pt for filming and is continuing to work hard to escalate his career to stardom as an Actor & Film TV Producer. He is very blessed to be working among other talented Actors, Writers, Directors, & Producers. This is a name you will see in the near future on a Gold Star in Hollywood. Stay tuned for more of D-Teflon.\n\nwww.allianceentertainment.org/d-teflon  www.dteflon.com/actor/\n\nwww.dteflon.com",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 583278,
        "imdb_id": "nm2640881",
        "known_for_department": "Acting",
        "name": "D-Teflon",
        "place_of_birth": null,
        "popularity": 0.0311,
        "profile_path": null
    }
}