{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/t07Pdtl3rTbE5mBdV8hAggHcGVN.jpg",
                "genre_ids": [
                    35,
                    10751,
                    14
                ],
                "id": 433,
                "original_language": "en",
                "original_title": "Mary Poppins",
                "overview": "Mr Banks is looking for a nanny for his two mischievous children and comes across Mary Poppins, an angelic nanny. She not only brings a change in their lives but also spreads happiness.",
                "popularity": 5.3935,
                "poster_path": "/ei8hhYCMfURfPOXKBnyl61be2iV.jpg",
                "release_date": "1964-12-17",
                "title": "Mary Poppins",
                "video": false,
                "vote_average": 7.56,
                "vote_count": 4833,
                "character": "Admiral Boom",
                "credit_id": "52fe4243c3a36847f8010837",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/jQAGYwpp00D9PN7qKIPb4HqNzoq.jpg",
                "genre_ids": [
                    12,
                    14,
                    35,
                    10751,
                    10402,
                    16
                ],
                "id": 12335,
                "original_language": "en",
                "original_title": "Bedknobs and Broomsticks",
                "overview": "Three children evacuated from London during World War II are forced to stay with an eccentric spinster. The children's initial fears disappear when they find out she is in fact a trainee witch.",
                "popularity": 4.0307,
                "poster_path": "/1BBzsThIZ06UmjZ3rChYGZhJtFQ.jpg",
                "release_date": "1971-10-07",
                "title": "Bedknobs and Broomsticks",
                "video": false,
                "vote_average": 7.033,
                "vote_count": 991,
                "character": "Gen. Teagler",
                "credit_id": "52fe44dc9251416c750436c7",
                "order": 12
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "John Reginald Owen",
            "Джон Реджинальд Оуэн",
            "Реджинальд Оуэн"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nJohn Reginald Owen (5 August 1887 – 5 November 1972) was an English character actor. He was known for his many roles in British and American films and later in television programmes.  The son of Joseph and Frances Owen, Reginald Owen studied at Sir Herbert Tree's Royal Academy of Dramatic Art and made his professional debut in 1905. In 1911, he starred in the original production of Where the Rainbow Ends as Saint George which opened to very good reviews on 21 December 1911. Reginald Owen had a few years earlier met the author Mrs. Clifford Mills as a young actor, and it was he who on hearing her idea of a Rainbow Story persuaded her to turn it into a play, and thus \"Where the Rainbow Ends\" was born.\n\nHe went to the United States in 1920 and worked originally on Broadway in New York, but later moved to Hollywood, where he began a lengthy film career. He was always a familiar face in many Metro-Goldwyn-Mayer productions.\n\nOwen is perhaps best known today for his performance as Ebenezer Scrooge in the 1938 film version of Charles Dickens' A Christmas Carol, a role he inherited from Lionel Barrymore, who had played the part of Scrooge on the radio every Christmas for years until Barrymore broke his hip in an accident.\n\nOwen was one of only five actors to play both Sherlock Holmes and his companion Dr Watson (Jeremy Brett played Watson on stage in the United States prior to adopting the mantle of Holmes on British television, Carleton Hobbs played both roles in British radio adaptations while Patrick Macnee played both roles in US television films). Howard Marion-Crawford played Holmes in a radio adaptation of \"The Speckled Band\" and later played Watson to Ronald Howard’s Holmes in the 1954-55 television series.\n\nOwen first played Watson in the film Sherlock Holmes (1932), and then Holmes himself in A Study in Scarlet (1933). Having played Ebenezer Scrooge, Sherlock Holmes and Dr. Watson, Owen has the odd distinction of playing three classic characters of Victorian fiction only to live to see those characters be taken over and personified by other actors, namely Alastair Sim as Scrooge, Basil Rathbone as Holmes and Nigel Bruce as Watson.\n\nLater in his career, Owen appeared opposite James Garner in the television series Maverick in the episodes \"The Belcastle Brand\" (1957) and \"Gun-Shy\" (1958) and also guest starred in episodes of the series One Step Beyond and Bewitched. He was featured in the Walt Disney films Mary Poppins (1964) and Bedknobs and Broomsticks (1971). He had a small role in the 1962 Irwin Allen production of the Jules Verne novel Five Weeks in a Balloon. In August 1964, his Bel-Air mansion was rented out to the Beatles, who were performing at the Hollywood Bowl, when no hotel would book them.",
        "birthday": "1887-08-04",
        "deathday": "1972-11-05",
        "gender": 2,
        "homepage": null,
        "id": 5832,
        "imdb_id": "nm0654239",
        "known_for_department": "Acting",
        "name": "Reginald Owen",
        "place_of_birth": "Wheathampstead, Hertfordshire, England, UK",
        "popularity": 1.5804,
        "profile_path": "/a7PEC3JPysPo4OoOqOIagDFZmNB.jpg"
    }
}