{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/t07Pdtl3rTbE5mBdV8hAggHcGVN.jpg",
                "genre_ids": [
                    35,
                    10751,
                    14
                ],
                "id": 433,
                "original_language": "en",
                "original_title": "Mary Poppins",
                "overview": "Mr Banks is looking for a nanny for his two mischievous children and comes across Mary Poppins, an angelic nanny. She not only brings a change in their lives but also spreads happiness.",
                "popularity": 5.3935,
                "poster_path": "/ei8hhYCMfURfPOXKBnyl61be2iV.jpg",
                "release_date": "1964-12-17",
                "title": "Mary Poppins",
                "video": false,
                "vote_average": 7.56,
                "vote_count": 4833,
                "character": "Uncle Albert",
                "credit_id": "52fe4243c3a36847f801083b",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/tyj0QztA0PkYo6XauifWjkx7UVi.jpg",
                "genre_ids": [
                    16,
                    10751,
                    14,
                    12
                ],
                "id": 12092,
                "original_language": "en",
                "original_title": "Alice in Wonderland",
                "overview": "On a golden afternoon, wildly curious young Alice tumbles into the burrow and enters the merry, madcap world of Wonderland full of whimsical escapades.",
                "popularity": 7.5417,
                "poster_path": "/20cvfwfaFqNbe9Fc3VEHJuPRxmn.jpg",
                "release_date": "1951-07-28",
                "title": "Alice in Wonderland",
                "video": false,
                "vote_average": 7.188,
                "vote_count": 6057,
                "character": "Mad Hatter (voice)",
                "credit_id": "52fe44b29251416c7503de0d",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Isaiah Edwin «Ed» Wynn",
            "Isaiah Edwin Wynn",
            "Isaiah Edwin Leopold",
            "Isaiah Edwin \"Ed\" Wynn"
        ],
        "biography": "Isaiah Edwin Leopold (November 9, 1886 – June 19, 1966), better known as Ed Wynn, was an American actor and comedian noted for his Perfect Fool comedy character, his pioneering radio show of the 1930s, and his later career as a dramatic actor.\n\nEd Wynn first appeared on television on July 7, 1936 in a brief, ad-libbed spot with Graham McNamee during an NBC experimental television broadcast. In the 1949–50 season, Ed Wynn hosted one of the first network, comedy-variety television shows, on CBS, and won both a Peabody Award and an Emmy Award in 1949. Buster Keaton, Lucille Ball, and The Three Stooges all made guest appearances with Wynn. This was the first CBS variety television show to originate from Los Angeles, which was seen live on the west coast, but filmed via kinescope for distribution in the Midwest and East, as the national coaxial cable had yet to be completed. Wynn was also a rotating host of NBC's Four Star Revue from 1950 through 1952.\n\nAfter the end of Wynn's third television series, The Ed Wynn Show (a short-lived situation comedy on NBC's 1958–59 schedule), his son, actor Keenan Wynn, encouraged him to make a career change rather than retire. The comedian reluctantly began a career as a dramatic actor in television and movies. Father and son appeared in three productions, the first of which was the 1956 Playhouse 90 broadcast of Rod Serling's play Requiem for a Heavyweight. Ed was terrified of straight acting and kept goofing his lines in rehearsal. When the producers wanted to fire him, star Jack Palance said he would quit if they fired Ed. (However, unbeknownst to Wynn, supporting player Ned Glass was his secret understudy in case something did happen before air time.) On live broadcast night, Wynn surprised everyone with his pitch-perfect performance, and his quick ad libs to cover his mistakes. A dramatization of what happened during the production was later staged as an April 1960 Westinghouse Desilu Playhouse episode, \"The Man in the Funny Suit\", starring both senior and junior Wynns, with key figures involved in the original production also portraying themselves. Ed and his son also worked together in the Jose Ferrer film The Great Man, with Ed again proving his unexpected skills in drama.\n\nRequiem established Wynn as a serious dramatic actor who could easily hold his own with the best. His role in The Diary of Anne Frank (1959) won him an Academy Award nomination for Best Supporting Actor.\n\nAlso in 1959, Wynn appeared on Serling's TV series The Twilight Zone in \"One for the Angels\". Serling, a longtime admirer, had written that episode especially for him, and Wynn later in 1963 starred in the episode \"Ninety Years Without Slumbering\". For the rest of his life, Wynn skillfully moved between comic and dramatic roles. He appeared in feature films and anthology television, endearing himself to new generations of fans.",
        "birthday": "1886-11-09",
        "deathday": "1966-06-19",
        "gender": 2,
        "homepage": null,
        "id": 5833,
        "imdb_id": "nm0943956",
        "known_for_department": "Acting",
        "name": "Ed Wynn",
        "place_of_birth": "Philadelphia, Pennsylvania, USA",
        "popularity": 0.661,
        "profile_path": "/ephGLfQWundnRnvMR0JdK2NhJBQ.jpg"
    }
}