{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/weZ0PuPkvEFc8uuqt5TL8EXz0cs.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 760336,
                "original_language": "en",
                "original_title": "Munich – The Edge of War",
                "overview": "At the tense 1938 Munich Conference, former friends who now work for opposing governments become reluctant spies racing to expose a Nazi secret.",
                "popularity": 3.9304,
                "poster_path": "/1SOiUTDnwW9gU4GzSIsOCQUlHJF.jpg",
                "release_date": "2021-12-31",
                "title": "Munich – The Edge of War",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 613,
                "character": "Lena",
                "credit_id": "5fa14d8c41a5610036edfc29",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "麗芙·麗莎·弗里斯"
        ],
        "biography": "Liv Lisa Fries is a German actress. In 2017, she gained an international following as the female lead Charlotte Ritter in the German TV series Babylon Berlin.\n\nShe was raised in the Berlin borough of Pankow. Fries studied abroad as an exchange student in Beijing. After receiving her Abitur in 2010, she enrolled in university to study philosophy and literary science, but dropped out as her career as an actress progressed.\n\nFries wanted to become an actress when she was fourteen years old after watching Léon: The Professional because she was impressed by Natalie Portman's performance. Her first film role was in Atomised (2005) (German: Elementarteilchen); however, her role was cut from the film. Her debut occurred in 2006 with an episode of Schimanski, in which she played the female lead role.\n\nShe performed in the German made-for-television film Sie hat es verdient (2010) as an aggressive, frustrated teenager named Linda who tortures one of her peers. Fries said that during filming, she started feeling lonely and isolated, just like her character.\n\nIn 2013, she starred in the German tragicomedy Zurich (original title Und morgen Mittag bin ich tot). She received wide critical acclaim for her performance as Lea, a young woman with cystic fibrosis. According to Fries, she prepared for the role by meeting with a patient with the disease, in addition to running up stairs while breathing through a straw. For her role, she was awarded the Bavarian Film Prize 2013, the Max Ophüls Prize, a German Film Critics Award, and the German Director’s Prize.\n\nFries received her most prominent role to date when she was cast in 2016 as Charlotte Ritter in the German prestige television show Babylon Berlin. In Babylon Berlin, Fries stars as a police stenographer from a poor background who uses her resourcefulness and connections to investigate a series of crimes in Weimar Republic-era Berlin. The first two series of the show were filmed over eight months beginning in May of 2016 and released consecutively in Fall 2017. Babylon Berlin has been very popular in Germany as well as with international audiences and has elevated Fries to international prominence; Fries is considered one of Germany's upcoming stars and has been featured in many magazines. For her portrayal, Fries shares an Adolf Grimme Award with the Babylon Berlin team.\n\nThe show went on a yearlong production hiatus during which Fries filmed two projects; she played a recurring role in both seasons of the 2017 American TV series Counterpart, and also co-starred in the film Prélude with Louis Hofmann. In late 2018, Fries began the six-month shoot for the third season of Babylon Berlin which will premiere in Germany in 2020.\n\nIn addition to her native tongue German, she speaks English, French and Mandarin. As of 2020, Fries lives in a village in Brandenburg.",
        "birthday": "1990-10-31",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 583333,
        "imdb_id": "nm2939186",
        "known_for_department": "Acting",
        "name": "Liv Lisa Fries",
        "place_of_birth": "Berlin, Germany",
        "popularity": 0.4503,
        "profile_path": "/u3nvY4YE2JayVgJi7lwqweDqG94.jpg"
    }
}