{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2tsmTWJsR81cwwZHLE85vPxSCoR.jpg",
                "genre_ids": [
                    53,
                    80,
                    18
                ],
                "id": 320,
                "original_language": "en",
                "original_title": "Insomnia",
                "overview": "Two Los Angeles homicide detectives are dispatched to a northern town where the sun doesn't set to investigate the methodical murder of a local teen.",
                "popularity": 4.422,
                "poster_path": "/riVXh3EimGO0y5dgQxEWPRy5Itg.jpg",
                "release_date": "2002-05-24",
                "title": "Insomnia",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 4959,
                "character": "Kay Connell",
                "credit_id": "52fe4237c3a36847f800cf11",
                "order": 12
            },
            {
                "adult": false,
                "backdrop_path": "/ce6HzPfxRRcLk5QRLcdExeVpsA1.jpg",
                "genre_ids": [
                    10751,
                    18
                ],
                "id": 406997,
                "original_language": "en",
                "original_title": "Wonder",
                "overview": "The story of August Pullman – a boy with facial differences – who enters fifth grade, attending a mainstream elementary school for the first time.",
                "popularity": 5.5825,
                "poster_path": "/sONh3LYGFcVDTy8pm1tbSOB13Li.jpg",
                "release_date": "2017-11-13",
                "title": "Wonder",
                "video": false,
                "vote_average": 8.114,
                "vote_count": 8069,
                "character": "Julian's Mom",
                "credit_id": "5a07b650c3a36833ac00b42e",
                "order": 41
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Chrystal Lowe",
            "Yan-Kay Crystal Lowe",
            "Crystal Lo",
            "Crystal Lowe",
            "ین-کی کریستال لو"
        ],
        "biography": "Yan-Kay Crystal Lowe is a Canadian actress. She is known for her scream queen roles in horror films such as Children of the Corn: Revelation (2001), Final Destination 3 (2006), Black Christmas (2006), and Wrong Turn 2: Dead End (2007). She played Rita Haywith in Hallmark Channel's television and television film series Signed, Sealed, Delivered (2013–present).\n\nLowe was born Yan-Kay Lo in Vancouver, British Columbia to a Scottish mother and Chinese father from Hong Kong. When she was young her father moved back to Hong Kong with his family, where they lived for several years. In an interview in 2016, Lowe said that she had wanted to be an actress since the age of five.\n\nLowe started her career as a model. Her first acting role was at age 15 as Nya on an episode of Stargate SG-1. Lowe went on to guest star in several popular television shows like Masters of Horror, Psych, Supernatural, Stargate: Atlantis, The L Word, plus many more.\n\nLowe's first film role came in 2000 when she was cast in the film Get Carter. Soon after she was cast as Tiffany in the horror film Children of the Corn: Revelation. In 2006, Lowe was cast as Ashlyn Halperin in Final Destination 3. Her next role was as Lauren in the remake of Black Christmas. Lowe later went on to star as Elena in Wrong Turn 2: Dead End.\n\nLowe went on to do cameo roles in the films Fantastic Four: Rise of the Silver Surfer and Good Luck Chuck. In 2008 she was reunited with her Final Destination 3 co-stars Sam Easton and Amanda Crew in the film That One Night. Also in 2008, Lowe was cast in supporting roles for the films Yeti: Curse of the Snow Demon, Poison Ivy: The Secret Society and Center Stage: Turn It Up.\n\nIn 2010, Lowe appeared as Zoe in the film Hot Tub Time Machine, as Vala in the ninth season of the CW show Smallville and as Nina in Sheldon Wilson's horror/thriller film Killer Mountain. In mid-2011, Lowe was cast as Tina in A Little Bit Zombie and as Piper/Peaches in the TV movie To the Mat. In early 2012, she was cast as Toby Nance, one of the lead characters in the new series Primeval: New World.\n\nIn 2014, Lowe was cast as Rita Haywith in the Hallmark series Signed, Sealed, Delivered, which aired for one season in 2014 before becoming successive television films. In 2015, she took a role behind the camera, directing the locally produced short film Becoming Sophie which was featured at Cannes Short Film Library and L.A. Women's Film Festival.\n\nIn 2017, Lowe played Sarah Albans, the mother of Julian, the main antagonist in the film version of Wonder, based on the 2012 novel.",
        "birthday": "1981-01-20",
        "deathday": null,
        "gender": 1,
        "homepage": "https://experiencehallmarkchristmas.com/talent/yan-kay-crystal-lowe/",
        "id": 58393,
        "imdb_id": "nm0522909",
        "known_for_department": "Acting",
        "name": "Yan-Kay Crystal Lowe",
        "place_of_birth": "Vancouver, British Columbia, Canada",
        "popularity": 0.5438,
        "profile_path": "/9M9FbnKMTTqgJmWrsKqviewLrmj.jpg"
    }
}