{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/MMSI9WzRmOdqXarevQ3Kqnytrx.jpg",
                "genre_ids": [
                    12,
                    28,
                    53,
                    878
                ],
                "id": 8810,
                "original_language": "en",
                "original_title": "Mad Max 2",
                "overview": "Max Rockatansky returns as the heroic loner who drives the dusty roads of a postapocalyptic Australian Outback in an unending search for gasoline. Arrayed against him and the other scraggly defendants of a fuel-depot encampment are the bizarre warriors commanded by the charismatic Lord Humungus, a violent leader whose scruples are as barren as the surrounding landscape.",
                "popularity": 6.5059,
                "poster_path": "/l1KVEhkGDpWRzQ0VqIhZqDDuOim.jpg",
                "release_date": "1981-12-24",
                "title": "Mad Max 2",
                "video": false,
                "vote_average": 7.387,
                "vote_count": 3964,
                "character": "Jessie Rockatansky (archive footage) (uncredited)",
                "credit_id": "645024228813e40123c58935",
                "order": 26
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia. Joanne Samuel (born 1957 in Camperdown, Sydney, Australia) is an actress who remains best known for her role as the screen wife of Mel Gibson in the 1979 film Mad Max.\n\nPrior to her appearance in the film, Samuel had made guest appearances in police procedurals Matlock Police and Homicide. She was then a regular cast member in television soap operas Class of '74, The Sullivans and The Young Doctors. She left The Young Doctors very suddenly – the producers kindly wrote her out of the show quickly as she was offered the Mad Max role after a fellow Young Doctors actress who had been due to take the role fell ill. Samuel later returned to television in the regular role of Kelly Morgan-Young in Skyways (TV series).\n\nSamuel later guest starred in Hey Dad! as Jeanette Taylor and All Saints,  and played the school principal in The Wiggles in their film The Wiggles Movie.\n\nSamuel is married to Tony Ahern. They have several children. They live in the Blue Mountains suburb of Blackheath and Samuel has retired from acting. Samuel is active in the local Baptist church. Description above from the Wikipedia article Joanne Samuel, licensed under CC-BY-SA,full list of contributors on Wikipedia. ​",
        "birthday": "1957-08-05",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 58401,
        "imdb_id": "nm0760394",
        "known_for_department": "Acting",
        "name": "Joanne Samuel",
        "place_of_birth": "Camperdown, Sydney, New South Wales, Australia",
        "popularity": 0.4958,
        "profile_path": "/cmll6mR4FYp6WwD4c5F8rdbBV9Q.jpg"
    }
}