{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/s1A9CKeoKglWDdQFRl9aC8wa3Zj.jpg",
                "genre_ids": [
                    16,
                    35,
                    18,
                    10751
                ],
                "id": 9662,
                "original_language": "fr",
                "original_title": "Les Triplettes de Belleville",
                "overview": "When her grandson is kidnapped during the Tour de France, Madame Souza and her beloved pooch Bruno team up with the Belleville Sisters—an aged song-and-dance team from the days of Fred Astaire—to rescue him.",
                "popularity": 1.486,
                "poster_path": "/enw6C4fDw88g0nOQgIJXjgH3NHi.jpg",
                "release_date": "2003-06-11",
                "title": "The Triplets of Belleville",
                "video": false,
                "vote_average": 7.398,
                "vote_count": 992,
                "character": "Triplet (voice)",
                "credit_id": "52fe4518c3a36847f80bc17d",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Béatrice Bonifassi"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nBéatrice \"Betty\" Bonifassi (born c. 1971) is a French-born vocalist based out of Montreal, Quebec, Canada. She has a deep, contralto singing voice, sometimes referred to as \"masculine\", which has been compared to that of Shirley Bassey. Bonifassi has performed music of many styles in both English and French—from jazz, to traditional music, to blues, to electronica. In 2003 she gained international exposure when she provided the singing voices for the title characters of the animated film Les Triplettes de Belleville. She has collaborated with composer and saxophonist, François D'Amours and has performed and toured with musician Maxime Morin (also known as DJ Champion). Bonifassi appeared as a guest vocalist on Deweare's album High Class Trauma (2006), and she is currently one half of the electronic music duo Beast.\n\nDescription above from the Wikipedia article Eileen Walsh, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": "http://bettybonifassi.com",
        "id": 58416,
        "imdb_id": "nm1569242",
        "known_for_department": "Acting",
        "name": "Betty Bonifassi",
        "place_of_birth": null,
        "popularity": 0.0664,
        "profile_path": "/gV2YmG3gEM9WFGl0M2sw5blwDc0.jpg"
    }
}