{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qr7dUqleMRd0VgollazbmyP9XjI.jpg",
                "genre_ids": [
                    878,
                    18,
                    53
                ],
                "id": 78,
                "original_language": "en",
                "original_title": "Blade Runner",
                "overview": "In the smog-choked dystopian Los Angeles of 2019, blade runner Rick Deckard is called out of retirement to terminate a quartet of replicants who have escaped to Earth seeking their creator for a way to extend their short life spans.",
                "popularity": 12.7734,
                "poster_path": "/63N9uy8nd9j7Eog2axPQ8lbr3Wj.jpg",
                "release_date": "1982-06-25",
                "title": "Blade Runner",
                "video": false,
                "vote_average": 7.941,
                "vote_count": 14371,
                "character": "Batty",
                "credit_id": "52fe4214c3a36847f80025a3",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/yXnlw2SB0QhYUC4QDyuRZh3CQlU.jpg",
                "genre_ids": [
                    35,
                    80
                ],
                "id": 158,
                "original_language": "de",
                "original_title": "Knockin' on Heaven's Door",
                "overview": "Two young men, Martin and Rudi, both suffering from terminal cancer, get to know each other in a hospital room. They drown their desperation in tequila and decide to take one last trip to the sea. Drunk and still in pajamas they steal the first fancy car they find, a 60's Mercedes convertible. The car happens to belong to a bunch of gangsters, which immediately start to chase it, since it contains more than the pistol Martin finds in the glove box.",
                "popularity": 3.9782,
                "poster_path": "/dsY09zCxKDFjfV1oqXFJJpVrHdP.jpg",
                "release_date": "1997-02-20",
                "title": "Knockin' on Heaven's Door",
                "video": false,
                "vote_average": 7.7,
                "vote_count": 548,
                "character": "Curtiz",
                "credit_id": "52fe4220c3a36847f8005f93",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/t9kQnqiaxQ8TLB25rTzDKLd0fdM.jpg",
                "genre_ids": [
                    80,
                    28
                ],
                "id": 187,
                "original_language": "en",
                "original_title": "Sin City",
                "overview": "Welcome to Sin City. This town beckons to the tough, the corrupt, the brokenhearted. Some call it dark… Hard-boiled. Then there are those who call it home — Crooked cops, sexy dames, desperate vigilantes. Some are seeking revenge, others lust after redemption, and then there are those hoping for a little of both. A universe of unlikely and reluctant heroes still trying to do the right thing in a city that refuses to care.",
                "popularity": 8.5603,
                "poster_path": "/i66G50wATMmPrvpP95f0XP6ZdVS.jpg",
                "release_date": "2005-04-01",
                "title": "Sin City",
                "video": false,
                "vote_average": 7.465,
                "vote_count": 8443,
                "character": "Cardinal Roark",
                "credit_id": "52fe4224c3a36847f80073cb",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/ew5FcYiRhTYNJAkxoVPMNlCOdVn.jpg",
                "genre_ids": [
                    18,
                    80,
                    28
                ],
                "id": 272,
                "original_language": "en",
                "original_title": "Batman Begins",
                "overview": "Driven by tragedy, billionaire Bruce Wayne dedicates his life to uncovering and defeating the corruption that plagues his home, Gotham City.  Unable to work within the system, he instead creates a new identity, a symbol of fear for the criminal underworld - The Batman.",
                "popularity": 20.6664,
                "poster_path": "/sPX89Td70IDDjVr85jdSBb4rWGr.jpg",
                "release_date": "2005-06-10",
                "title": "Batman Begins",
                "video": false,
                "vote_average": 7.717,
                "vote_count": 21790,
                "character": "Earle",
                "credit_id": "52fe4230c3a36847f800ac79",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/DNb1rBm6R75IJ88PKOd0wfCHm6.jpg",
                "genre_ids": [
                    12,
                    35,
                    14
                ],
                "id": 526,
                "original_language": "en",
                "original_title": "Ladyhawke",
                "overview": "Captain Etienne Navarre is a man on whose shoulders lies a cruel curse. Punished for loving each other, Navarre must become a wolf by night whilst his lover, Lady Isabeau, takes the form of a hawk by day. Together, with the thief Philippe Gaston, they must try to overthrow the corrupt Bishop and in doing so break the spell.",
                "popularity": 4.3188,
                "poster_path": "/vJA2Fhw2uBMiVFdBde2kH7kZ2gw.jpg",
                "release_date": "1985-03-27",
                "title": "Ladyhawke",
                "video": false,
                "vote_average": 7.006,
                "vote_count": 1192,
                "character": "Captain Etienne Navarre",
                "credit_id": "52fe424dc3a36847f8013c73",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/qLhoEKvkG3SgjyBrgn6wMxaTHr4.jpg",
                "genre_ids": [
                    27,
                    28,
                    53
                ],
                "id": 9542,
                "original_language": "en",
                "original_title": "The Hitcher",
                "overview": "On a stormy night, young Jim, who transports a luxury car from Chicago to California to deliver it to its owner, feeling tired and sleepy, picks up a mysterious hitchhiker, who has appeared out of nowhere, thinking that a good conversation will help him not to fall asleep. He will have enough time to deeply regret such an unmeditated decision.",
                "popularity": 2.3767,
                "poster_path": "/89giuiFssSVCUxkCP386v66cry8.jpg",
                "release_date": "1986-01-17",
                "title": "The Hitcher",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 992,
                "character": "John Ryder",
                "credit_id": "52fe4507c3a36847f80b804f",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "راتخر هاور",
            "رودگر هاور"
        ],
        "biography": "Rutger Oelsen Hauer was a Dutch film actor. He was well known for his roles in Flesh + Blood, Blind Fury, Blade Runner, The Hitcher, Nighthawks, Sin City, Ladyhawke, The Blood of Heroes and Batman Begins.\n\nHauer was born in Breukelen, Netherlands, to drama teachers Arend and Teunke, and grew up in Amsterdam. Since his parents were very occupied with their careers, he and his three sisters (one older, two younger) were raised mostly by nannies. At the age of 15, Hauer ran off to sea and spent a year scrubbing decks aboard a freighter. Returning home, he worked as an electrician and a carpenter for three years while attending acting classes at night school. He went on to join an experimental troupe, with which he remained for five years before he was cast in the lead role in the very successful 1969 television series Floris, a Dutch Ivanhoe-like medieval action drama. The role made him famous in his native country.\n\nHauer's career changed course when director Paul Verhoeven cast him as the lead in Turkish Delight (1973) (based on the Jan Wolkers book of the same name). The movie found box-office favour abroad as well as at home, and within two years, its star was invited to make his English-language debut in the British film The Wilby Conspiracy (1975). Set in South Africa and starring Michael Caine and Sidney Poitier, the film was an action melodrama with a focus on apartheid. Hauer's supporting role, however, was barely noticed in Hollywood, and he returned to Dutch films for several years. Hauer made his American debut in the Sylvester Stallone vehicle Nighthawks (1981), cast as a psychopathic and cold-blooded terrorist named \"Wolfgar\" (after a character in the Old English poem Beowulf). The following year, he appeared in arguably his most famous and acclaimed role as the eccentric, violent, yet sympathetic replicant Roy Batty in Ridley Scott's 1982 sci-fi thriller, Blade Runner.\n\nHauer was a dedicated environmentalist. He fought for the release of Greenpeace's co-founder, Paul Watson, who was convicted in 1994 for sinking a Norwegian whaling vessel. Hauer has also established an AIDS awareness foundation called the Rutger Hauer Starfish Foundation. He married his second wife, Ineke, in 1985 (they had been together since 1968); and he has one child, actress Aysha Hauer, who was born in 1966 and who made him a grandfather in 1988. In April 2007, he published his autobiography All Those Moments: Stories of Heroes, Villains, Replicants, and Blade Runners (co-written with Patrick Quinlan) where he discussed many of his movie roles. Proceeds of the book go to Hauer's Starfish Foundation.",
        "birthday": "1944-01-23",
        "deathday": "2019-07-19",
        "gender": 2,
        "homepage": "http://www.rutgerhauer.com/",
        "id": 585,
        "imdb_id": "nm0000442",
        "known_for_department": "Acting",
        "name": "Rutger Hauer",
        "place_of_birth": "Breukelen, Utrecht, Netherlands",
        "popularity": 1.1237,
        "profile_path": "/3Lly7qwOrESdFcwyaiEOfPlB76l.jpg"
    }
}