{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rniS6AOKTOr5PV7Xok6m7QSzlXg.jpg",
                "genre_ids": [
                    12,
                    18
                ],
                "id": 937746,
                "original_language": "it",
                "original_title": "Io capitano",
                "overview": "Longing for a brighter future, two Senegalese teenagers embark on a journey from West Africa to Italy. However, between their dreams and reality lies a labyrinth of checkpoints, the Sahara Desert, and the vast waters of the Mediterranean.",
                "popularity": 2.8833,
                "poster_path": "/kGlZFwUQI5gAUdySNFfqGIkAF9n.jpg",
                "release_date": "2023-09-07",
                "title": "Io Capitano",
                "video": false,
                "vote_average": 7.801,
                "vote_count": 767,
                "character": "Woman Caring for Pregnant Woman",
                "credit_id": "65827260858678185cf64995",
                "order": 23
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Érika Dobong'na"
        ],
        "biography": "Princess Erika (born Erika Dobong'na; 5 April 1964, Paris) is a French singer and actress with Cameroonian origins. She is particularly known for her reggae songs \"Trop de bla-bla\" ou \"Faut qu'j'travaille\".\n\nIn 1982, Erika formed with her sisters a band named Blackheart Daughters founded by her elder sister Princess Mataji Maa Tejomayee Devi (born Esther Dobong’Na Essiene) also known as Estha Divine, then joined the band Princess and the Royal Sound, with whom she made several tours, opening for Jamaican singer Dennis Brown. In 1988, she recorded \"Trop de bla-bla\" in London and achieved a minor success in France (#39 on the Top 50, but later, the song became famous for being used for a TV advert for MMA). She released the single \"Tendresse\" and her first album in 1992. She opened the concerts for Les Négresses Vertes. In 1995, she released her second studio album, D'origine, and the lead single, \"Faut qu'j'travaille\", hit No. 15 in France. Two years later, she recorded a duet with Marc Lavoine, \"Les Hommes sont des Femmes comme les autres\". She participated in Les Enfoirés and wrote several songs for various artists such as \"Embrasse-moi\" for the Nubians.\n\nIn 2004, she also participated in the compilation Agir Réagir intended to raise funds to help the Moroccans who survived an earthquake on 24 February 2002. In 2005, she was a contestant on La Ferme Célébrités. She organized the four editions of the concerts Les Voix de l'espoir, performed with many other artists in a charity fundraiser. She covered the songs \"La Vie en rose\" and \"J'ai encore rêvé d'elle\" with Pierpoljak on the cover album Il est 5 heures Kingston s'éveille. She was an occasional actress in films and theatre, and appeared in Le Petit Trésor.\n\nFamily: Father: Julien Édouard Dobong’Na Essiene (died in 2022); Mother: Marie-Claire Ngo Matip spouse Dobong’Na Essiene; Erika has two children: Julien (born in 1982) and Oudima (2003); Elder sister: Princess Mataji Maa Tejomayee Devi ( born Esther Dobong’Na Essiene) also known as Estha Divine; Younger sister: Eva Dobong’Na Essiene aka sister Hewan (died in 2011); Younger sister: Elga Dobong’Na Essiene.\n\nSource: Article \"Princess Erika\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1964-04-05",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 585134,
        "imdb_id": "nm0259228",
        "known_for_department": "Acting",
        "name": "Princess Erika",
        "place_of_birth": "Paris, Ile-de-France, France",
        "popularity": 0.0676,
        "profile_path": "/e7m9eyakUnpjCcgusjm57a4XDKu.jpg"
    }
}