{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/czM0QJEioKMn4higWG1z1YdCiMQ.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 36940,
                "original_language": "it",
                "original_title": "La prima cosa bella",
                "overview": "The film tells the story of the Michelucci family, from the nineteen-seventies to the present day: the central character is the stunningly beautiful Anna, the lively, frivolous and sometimes embarrassing mother of Bruno and Valeria. Everything begins in the Summer of 1971, at the annual Summer beauty pageant held at Livorno’s most popular bathing establishment. Anna is unexpectedly crowned “Most Beautiful Mother”, unwittingly stirring the violent jealousy of her husband. From then on, chaos strikes the family and for Anna, Bruno and his sister Valeria, it is the start of an adventure that will only end thirty years later.",
                "popularity": 1.9517,
                "poster_path": "/7h4BbIGigxaECJFQWEaQ9ih3INp.jpg",
                "release_date": "2010-01-15",
                "title": "The First Beautiful Thing",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 511,
                "character": "Giuliana Cenerini 1971-1981",
                "credit_id": "65efadb31f748b018450e670",
                "order": 29
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Isabella Adriani",
            "Federica Federici",
            "이사벨 아드리아니"
        ],
        "biography": "Isabelle Adriani is an Italian actress, singer, dancer, fairy tale author and journalist. Isabelle also has a unique talent for whistling in an operatic style. She has a Phd in History and speaks English, French, German, Spanish and Italian fluently. She has starred in more than 35 movies in Italy in the last 4 years. She published 10 books of fairy tales and 2 historical novels ('The Garden of Power' and 'The True Story of Cinderella'). Isabelle was born in Perugia, Italy, to 2 neurologists known for research in brain disease. Isabelle Adriani has a sister named Alexandra. Her parents sent her abroad to study in several countries such as : England, Germany,France, America and Argentina, so she's fluent in English, French,German and Spanish. Isabelle showed a deep passion for fairy tales and for acting at a very young age and began to write fables and to star in many plays at school. She began her acting career at 7 dreaming of Broadway. After studying classical ballet for seven years at Royal ballet of Dancing and attending acting schools in her home town, she went to Rome to study opera singing with Edda Dell'Orso (Oscar prize Ennio Morricone's chorister). At 19 she published her first book of Fairy Tales 'The Blue Butterfly' and met Susan Strasberg who believed in her and in her passion for acting and advised her to move to the United States. She took her PHD in History at the University of Perugia at 22 and wrote her final works on the DNA of Fairy Tales. In the meantime she won a scholarship and attended C.U.T. Theatre Drama University School in Perugia.\n\nShe earned a Master in journalism and worked for the major TV channels in Italy such as Rai and Mediaset and also for Newspaper magazines such as 'Il Messaggero' and 'La Nazione'.\n\nIn the last 4 years she played in some of the most successful movies in Italy such as 'What a beautiful Day' (52 millions of euros, very unusual for the Italian market), 'Men against Women'(15 millions euros) and 'The First Beautiful Thing'also presented in the US. She also appears briefly in 'The American' with George Clooney and in 'Twice Born' with Penelope Cruz. She presented the daily Tv Show 'Moviestar' for Canale 5, Mediaset, (2010-2013)\n\nShe did the voice over for 'Alvin and the Chipmunks' and sang the Rihanna song: 'Help' in the Italian version of the cartoon and did the voice of the lead, \"Peaches\" in Ice Age 4 for XX Century Fox\n\nIn 2011 she performed for Al Pacino and for Woody Allen at New Year's Eve. She also whistled for the soundtrack of 'Baharia', directed by Giuseppe Tornatore. From that moment she began her transition in the US. She got her green card as 'Talent' . She just came back from Puerto Rico where she played Esmeralda in 'Reclaim' directed by Alan White with John Cusack and Jacki Weaver. The multi-talented actress now lives between Rome and Los Angeles.  IMDb Mini Biography",
        "birthday": "1972-06-22",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.isabelleadriani.com/",
        "id": 585365,
        "imdb_id": "nm3641960",
        "known_for_department": "Acting",
        "name": "Isabelle Adriani",
        "place_of_birth": "Umbertide - Umbria - Italy",
        "popularity": 0.7327,
        "profile_path": "/ij0duJyvUSOEaAEwWkBLjcC2zPX.jpg"
    }
}