{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ti6kJ80ZB8RZTiDIzPkhaCJMoqq.jpg",
                "genre_ids": [
                    35,
                    80
                ],
                "id": 115,
                "original_language": "en",
                "original_title": "The Big Lebowski",
                "overview": "Jeffrey 'The Dude' Lebowski, a Los Angeles slacker who only wants to bowl and drink White Russians, is mistaken for another Jeffrey Lebowski, a wheelchair-bound millionaire, and finds himself dragged into a strange series of events involving nihilists, adult film producers, ferrets, errant toes, and large sums of money.",
                "popularity": 8.7952,
                "poster_path": "/9mprbw31MGdd66LR0AQKoDMoFRv.jpg",
                "release_date": "1998-03-06",
                "title": "The Big Lebowski",
                "video": false,
                "vote_average": 7.84,
                "vote_count": 11679,
                "character": "Maude's Thug",
                "credit_id": "568ef9eac3a36858f0003ba9",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Carlos León"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nCarlos Manuel Leon (born July 10, 1966) is a personal trainer and actor. He was born in Cuba and left during the Mariel boat lift in 1980. Carlos Leon is most famous for his former relationship with singer Madonna, who gave birth to their daughter, Lourdes Maria Ciccone Leon, on October 14, 1996.\n\nLeon is known for his acting work in the television show Oz, three episodes of Law &amp; Order, and as the struggling addict in Anne B. Real. Leon made his Broadway debut playing the role of Charles Filch in Wallace Shawn's adaptation of Brecht &amp; Weill's The Threepenny Opera, with Alan Cumming, Cyndi Lauper, and Ana Gasteyer.\n\nLeon met Madonna in New York City in 1994 but split in 1997. Leon is affiliated with the Kabbalah Centre.\n\nDescription above from the Wikipedia article Carlos Leon, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1966-07-10",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 58565,
        "imdb_id": "nm0502458",
        "known_for_department": "Acting",
        "name": "Carlos Leon",
        "place_of_birth": "Cuba",
        "popularity": 1.3304,
        "profile_path": "/efKbL5ExxrfCcHHzyT8lIsBiFSQ.jpg"
    }
}