{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/22yIGscWOOLRvwQb44ZboZmstIH.jpg",
                "genre_ids": [
                    18,
                    28,
                    53,
                    878
                ],
                "id": 9693,
                "original_language": "en",
                "original_title": "Children of Men",
                "overview": "In 2027, in a chaotic world in which humans can no longer procreate, a former activist agrees to help transport a miraculously pregnant woman to a sanctuary at sea, where her child's birth may help scientists save the future of humankind.",
                "popularity": 9.0933,
                "poster_path": "/8Xgvmx7WWc7Z9Ws9RAYk7uya2kh.jpg",
                "release_date": "2006-09-22",
                "title": "Children of Men",
                "video": false,
                "vote_average": 7.611,
                "vote_count": 7443,
                "character": "Newsreader",
                "credit_id": "52fe451dc3a36847f80bd355",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "​From Wikipedia, the free encyclopedia\n\nRob Curling born (8 December 1958) from (Cranleigh, Surrey) is a British television presenter and journalist. He is most notable as the host of Turnabout, a game show that aired on BBC1 for eight series in the 1990s. Currently, Curling presents the sports news for Sky News. He also fronts the tennis coverage for British Eurosport. He anchors BBC Sport’s interactive television coverage of: Olympic Games, Commonwealth Games, Wimbledon, Open Golf, Six Nations Rugby, World Athletics Championships, etc. He recently presented the Halford Tour Series cycling for ITV4, and commentated on table tennis at the 2010 Commonwealth Games in Delhi.\n\nHe has hosted podcasts for The Guardian, including the 2007 Cricket World Cup.\n\nCurling appeared on cult show Banzai and TV's 100 Funniest Moments for Channel 4, Sky One's Brainiac, The Basil Brush Show (BBC1), and Through the Keyhole (BBC1 &amp; Sky). He also starred in the last ever series of Beadle's About, where he took part in the infamous Alien Prank.\n\nHe also appears in the highly acclaimed cinema release Children of Men (Universal Pictures), starring Clive Owen and Michael Caine.\n\nDescription above from the Wikipedia Rob Curling, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1958-12-08",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 58577,
        "imdb_id": "nm1035253",
        "known_for_department": "Acting",
        "name": "Rob Curling",
        "place_of_birth": "Cranleigh, Surrey",
        "popularity": 0.0634,
        "profile_path": "/ir5SJncmOBMY3H4Yslmv110xvnA.jpg"
    }
}