{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/aw0EeseSr10dVUuY6Aiv6HhP8UW.jpg",
                "genre_ids": [
                    28,
                    80,
                    27
                ],
                "id": 9696,
                "original_language": "ja",
                "original_title": "殺し屋1",
                "overview": "As sadomasochistic yakuza enforcer Kakihara searches for his missing boss he comes across Ichi, a repressed and psychotic killer who may be able to inflict levels of pain that Kakihara has only dreamed of.",
                "popularity": 3.5539,
                "poster_path": "/k8j4YLZlda98dqp9ErymKzjYowG.jpg",
                "release_date": "2001-12-22",
                "title": "Ichi the Killer",
                "video": false,
                "vote_average": 7.01,
                "vote_count": 1034,
                "character": "Kaneko",
                "credit_id": "52fe451dc3a36847f80bd519",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/2tE0A6WjLowwQOUY8se1Xlf3O6U.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 68730,
                "original_language": "en",
                "original_title": "Silence",
                "overview": "In the 17th century, two Portuguese Jesuit priests travel to Japan in an attempt to locate their mentor, who is rumored to have committed apostasy, and to propagate Catholicism.",
                "popularity": 4.6372,
                "poster_path": "/wO8XKAt3JUpdij27gIq6Maq4JMp.jpg",
                "release_date": "2016-12-23",
                "title": "Silence",
                "video": false,
                "vote_average": 7.127,
                "vote_count": 3157,
                "character": "Samurai #1",
                "credit_id": "58a620f09251413457000800",
                "order": 49
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Hiroki Tanaka",
            "田中博行",
            "サブ",
            "Hiroyuki Tanaka",
            "田中博樹"
        ],
        "biography": "Sabu (サブ, Sabu, born November 18, 1964) is the pseudonym of Japanese actor and director Hiroyuki Tanaka.\n\nBorn in Wakayama Prefecture, Sabu studied at an Osaka fashion school before deciding to go to Tokyo to become a professional musician. It was suggested he try acting and in 1986 he made his film debut in Sorobanzuku. He earned his first starring role in the 1991 World Apartment Horror, a live-action film directed by Katsuhiro Ōtomo of Akira fame. Working from a script he wrote himself, he made his directorial debut with the 1996 Dangan Runner, a film that set his early style of \"quirky action-comedies propelled by characters who hurtle headlong though squirming narratives steered more by the forces of incidence and coincidence than the actions of the protagonists themselves.\" Shin'ichi Tsutsumi played the lead in Sabu's first five films. Blessing Bell, starring Susumu Terajima (who has played minor roles in nearly all of Sabu's films), was a turn away from his kinetic, parodic, and black comedy narratives, and earned the NETPAC Award at the 2003 Berlin Film Festival. Later films featured the J-pop band V6. In 2009, he directed The Crab Cannery Ship, a modern adaptation of a classic of Japanese proletarian literature written by Takiji Kobayashi.\n\nHe has continued to work as an actor, such as in Takashi Miike's Ichi the Killer (2001).\n\nHis film Chasuke's Journey was selected to be screened in the main competition section of the 65th Berlin International Film Festival.",
        "birthday": "1964-11-18",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 58614,
        "imdb_id": "nm0848992",
        "known_for_department": "Directing",
        "name": "SABU",
        "place_of_birth": "Wakayama, Japan",
        "popularity": 0.2489,
        "profile_path": "/qNjgqL33xBtkEJfW51G2Cc08pu6.jpg"
    }
}