{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8JaU1ez5TSrRSmncB0Xh2YQavXP.jpg",
                "genre_ids": [
                    18,
                    53,
                    12
                ],
                "id": 204,
                "original_language": "fr",
                "original_title": "Le Salaire de la peur",
                "overview": "In a run-down South American town, four men are paid to drive trucks loaded with nitroglycerin into the jungle through to the oil field. Friendships are tested and rivalries develop as they embark upon the perilous journey.",
                "popularity": 3.0486,
                "poster_path": "/dZyZSosIlWcpQkV0f7pXcrV2TQV.jpg",
                "release_date": "1953-04-22",
                "title": "The Wages of Fear",
                "video": false,
                "vote_average": 8.019,
                "vote_count": 1010,
                "character": "Rosa",
                "credit_id": "564d1fed925141594d00339f",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/hExTiLbfB93HwEwkeQxb3q4nHtQ.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 1643,
                "original_language": "it",
                "original_title": "Ultimo tango a Parigi",
                "overview": "A recently widowed American begins an anonymous sexual relationship with a young Parisian woman.",
                "popularity": 4.1786,
                "poster_path": "/dNgdUdNOWfHsZI3lDu6Epig7H2P.jpg",
                "release_date": "1972-12-15",
                "title": "Last Tango in Paris",
                "video": false,
                "vote_average": 6.933,
                "vote_count": 1283,
                "character": "Concierge",
                "credit_id": "6757dd7f637463229eafbc46",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Miss Darling",
            "Darling-Légitimus",
            "Mathilde Paruta",
            "Marie Berthilde Paruta"
        ],
        "biography": "Mathilda Marie Berthilde Paruta (21 November 1907 – 7 December 1999), better known as Darling Légitimus, was a French actress. In 1983, she received the Volpi Cup for Best Actress for her performance in the film Sugar Cane Alley.\n\nBorn on 21 November 1907 at Le Carbet in Martinique, she spent her early years in Caracas, Venezuela. Mathilda Paruta arrived in Paris, France, at age of 16, wanting to become a dancer. She met Victor-Etienne Légitimus, son of the government deputy, Hegesippe Jean Légitimus, and went on to become his lifelong companion and bear him five children.\n\nKnown for a long time as Miss Darling, she later chose to go by the name of Darling Legitimus. She performed as a dancer in La Revue Nègre (1925) with Josephine Baker, and posed for Picasso as well as for sculptor Paul Belmondo, father of Jean-Paul Belmondo, the actor.\n\nDuring the 1930s, Darling wrote, composed and sang numerous Caribbean songs such as Biguine and Mazurka. She often performed alongside known musicians of the era, including \"Pe En Kin Sosso\" and his band.\n\nShe also performed in plays by Jean Genet (Les Nègres) and Aimé Césaire. She was directed on the big screen by Raymond Rouleau in Les Sorcieres de Salem (The Crucible) alongside Simone Signoret and Yves Montand, and Le Salaire de la Peur (Wages of Fear) by Henri Georges Clouzot, with Sacha Guitry, Jean-Claude Brialy and Bernardo Bertolucci.\n\nIn 1983, at the age of 76, she won the Volpi Cup for the best female interpretation of \"The Mostra of Venise\", also for her role in La Rue Cases-Nègres (Sugar Cane Alley), directed by her compatriot Euzhan Palcy. During her long life, she was acquainted with a great number of famous actors, among them Arletty, Fernandel, Marlon Brando and Pierre Brasseur. She also took part in numerous ORTF (Office de Radio-diffusion de la Television Française) productions, of which a telefilm by Jean-Christophe Averty, Les verts Paturages (The Green Pastures, written by Marc Connelly), was produced.\n\nShe died on 7 December 1999 at Kremlin-Bicetre in the Val de Marne near Paris, in France, without any more acting roles after Sugar Cane Alley in spite of hopes of her nomination and rewards.\n\nThe writer, Calixthe Beyala and Caribbean actor Luc Saint-Eloy, representatives of \"Liberté\" collective came up on stage at the César ceremony in 2000, to claim one of the largest presence on French television screens and to pay her a public tribute, since the organizers had \"forgotten\" to name Darling as one of the previous year's great losses.\n\nSource: Article \"Darling Légitimus\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1907-11-21",
        "deathday": "1999-12-07",
        "gender": 1,
        "homepage": null,
        "id": 586308,
        "imdb_id": "nm0529587",
        "known_for_department": "Acting",
        "name": "Darling Légitimus",
        "place_of_birth": "Le Carbet, Martinique",
        "popularity": 0.0476,
        "profile_path": "/cAeHPF5ck0ci3P2MBOJHTGgF8Rp.jpg"
    }
}