{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6rgiRuLHn65d3qalkc7YjrtmDQW.jpg",
                "genre_ids": [
                    18
                ],
                "id": 9701,
                "original_language": "en",
                "original_title": "North Country",
                "overview": "A fictionalized account of the first major successful sexual harassment case in the United States — Jenson vs. Eveleth Mines, where a woman who endured a range of abuse while working as a miner filed and won the landmark 1984 lawsuit.",
                "popularity": 2.8644,
                "poster_path": "/upxUN4zmX79o49mBW9htKZDeNq7.jpg",
                "release_date": "2005-02-12",
                "title": "North Country",
                "video": false,
                "vote_average": 7.259,
                "vote_count": 692,
                "character": "Karen Aimes",
                "credit_id": "67c17485c5de842b4ba266b1",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Discovered by the late casting director Mali Finn, (Titanic/The Matrix),  who found Anna Paquin and Keisha Castle-Hughes, Elle Peterson starred  in the acclaimed Warner Bros. drama \" North Country\", alongside Academy  Award winners Charlize Theron, Frances McDormand, Sissy Spacek, Woody  Harrelson, Academy Award nominee Richard Jenkins and Sean Bean, directed  by Niki Caro (Whale Rider).\n\nElle played Charlize's young  daughter, Karen Aimes. Ms. Theron and Ms. McDormand received Academy  Award nominations for their roles in the movie.\n\nElle was also  cast as \"Young Hildy\" in one of the popular Hallmark Channel \"Jane Doe\"  movies of the week - \"Eye of The Beholder\", starring and directed by Lea  Thompson, (Back to the Future).\n\nAs well as auditioning for  future movie, television, voice-over and theatrical roles, Elle enjoys  ballet, tap, &amp; jazz dance, horse jumping and playing the piano and  clarinet.",
        "birthday": "1999-04-07",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.ellepeterson.com/",
        "id": 58640,
        "imdb_id": "nm2008890",
        "known_for_department": "Acting",
        "name": "Elle Peterson",
        "place_of_birth": null,
        "popularity": 0.0557,
        "profile_path": "/9cFBChMOv0IkpjDrEb0gSq2rlFx.jpg"
    }
}