{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2tcTm5oRlRN5fKFvY4Gbrwp8h38.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 363088,
                "original_language": "en",
                "original_title": "Ant-Man and the Wasp",
                "overview": "Just when his time under house arrest is about to end, Scott Lang once again puts his freedom at risk to help Hope van Dyne and Dr. Hank Pym dive into the quantum realm and try to accomplish, against time and any chance of success, a very dangerous rescue mission.",
                "popularity": 11.0667,
                "poster_path": "/cFQEO687n1K6umXbInzocxcnAQz.jpg",
                "release_date": "2018-07-04",
                "title": "Ant-Man and the Wasp",
                "video": false,
                "vote_average": 6.913,
                "vote_count": 13746,
                "character": "Catherine Starr",
                "credit_id": "5b3e85c80e0a2626ea001811",
                "order": 20
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Riann Steele is an English actress.\n\nAfter studying at Arts Educational Schools, London, she appeared in various Royal Shakespeare Company productions, including A Midsummer Night's Dream, Love's Labours Lost and Hamlet (including its subsequent BBC television film adaptation in 2009) alongside David Tennant. From 2009 to 2010, she played Nurse Lauren Minster in Holby City. Her first feature film role was opposite Aidan Gillen in 2010's Treacle Jr.. In 2012, she starred in the film Sket as Shaks, the girlfriend of a violent gang leader portrayed by Ashley Walters, and in Doctor Who (series 7) as Queen Nefertiti. She has also appeared as Cleo, a therapist, in the Channel 4/Netflix comedy series Lovesick and also appeared as Sydney Halliday in four episodes of NCIS: New Orleans Season 4.\n\nIn 2021, Steele played the role of Finola Jones in the NBC drama Debris, whose pilot was written by J. H. Wyman.\n\nFrom Wikipedia, the free encyclopedia",
        "birthday": "1987-05-23",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 587115,
        "imdb_id": "nm3474956",
        "known_for_department": "Acting",
        "name": "Riann Steele",
        "place_of_birth": "London, United Kingdom",
        "popularity": 0.1912,
        "profile_path": "/px4glR9GEEI5pnKvXbpDrg1YY7C.jpg"
    }
}