{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jOulpNwtoJP5fF1LJX1ojw6BxBq.jpg",
                "genre_ids": [
                    18,
                    10752
                ],
                "id": 31442,
                "original_language": "ru",
                "original_title": "Иваново детство",
                "overview": "In WW2, twelve year old Soviet orphan Ivan Bondarev works for the Soviet army as a scout behind the German lines and strikes a friendship with three sympathetic Soviet officers.",
                "popularity": 2.8297,
                "poster_path": "/vmRWSLP1DE9WTta0hfzIafJ0dID.jpg",
                "release_date": "1962-05-09",
                "title": "Ivan's Childhood",
                "video": false,
                "vote_average": 7.825,
                "vote_count": 781,
                "character": "Soldier with Glasses",
                "credit_id": "5d852c5522f5d70028a703bd",
                "order": 8
            }
        ],
        "crew": [
            {
                "adult": false,
                "backdrop_path": "/jqha8JCXm0aJ5SJ03Jd0JmGgWRs.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 895,
                "original_language": "ru",
                "original_title": "Андрей Рублёв",
                "overview": "An expansive Russian drama, this film focuses on the life of revered religious icon painter Andrei Rublev. Drifting from place to place in a tumultuous era, the peace-seeking monk eventually gains a reputation for his art. But after Rublev witnesses a brutal battle and unintentionally becomes involved, he takes a vow of silence and spends time away from his work. As he begins to ease his troubled soul, he takes steps towards becoming a painter once again.",
                "popularity": 4.9931,
                "poster_path": "/910xRIUmNJrWH2hkQifBJtoPp5R.jpg",
                "release_date": "1966-12-16",
                "title": "Andrei Rublev",
                "video": false,
                "vote_average": 7.976,
                "vote_count": 885,
                "credit_id": "52fe4289c3a36847f802688b",
                "department": "Writing",
                "job": "Writer"
            },
            {
                "adult": false,
                "backdrop_path": "/9GHsA3bt6MYW7Cpur91GeVBQKIC.jpg",
                "genre_ids": [
                    28,
                    53,
                    18,
                    12
                ],
                "id": 11893,
                "original_language": "en",
                "original_title": "Runaway Train",
                "overview": "A hardened convict and a younger prisoner escape from a brutal prison in the middle of winter only to find themselves on an out-of-control train with a female railway worker while being pursued by the vengeful head of security.",
                "popularity": 2.8234,
                "poster_path": "/A9pf9KjhqCGthu6PKAKE5E1qRNn.jpg",
                "release_date": "1985-11-15",
                "title": "Runaway Train",
                "video": false,
                "vote_average": 6.965,
                "vote_count": 612,
                "credit_id": "52fe449b9251416c7503ac41",
                "department": "Directing",
                "job": "Director"
            },
            {
                "adult": false,
                "backdrop_path": "/jOulpNwtoJP5fF1LJX1ojw6BxBq.jpg",
                "genre_ids": [
                    18,
                    10752
                ],
                "id": 31442,
                "original_language": "ru",
                "original_title": "Иваново детство",
                "overview": "In WW2, twelve year old Soviet orphan Ivan Bondarev works for the Soviet army as a scout behind the German lines and strikes a friendship with three sympathetic Soviet officers.",
                "popularity": 2.8297,
                "poster_path": "/vmRWSLP1DE9WTta0hfzIafJ0dID.jpg",
                "release_date": "1962-05-09",
                "title": "Ivan's Childhood",
                "video": false,
                "vote_average": 7.825,
                "vote_count": 781,
                "credit_id": "671d10996e4210780f7928c4",
                "department": "Writing",
                "job": "Screenplay"
            }
        ]
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Андрей Михалков-Кончаловский",
            "Андрон Кончаловский",
            "Andrej Kontschalowski",
            "Andrey Konchalovskiy",
            "Andrey Mikhalkov-Konchalovskiy",
            "Andreï Kontchalovski",
            "안드레이 콘찰로프스키",
            "アンドレイ・コンチャロフスキー",
            "أندريه كونشالوفسكي",
            "安德烈·康查洛夫斯基",
            "ანდრია კონჩალოვსკი",
            "Андрі́й Кончало́вський",
            "Андрі́й Сергі́йович Кончало́вський",
            "Անդրեյ Կոնչալովսկի",
            "Αντρέι Κοντσαλόφσκι",
            "Andrei Mikhalkov-Kontxalovski"
        ],
        "biography": "Andrei Sergeyevich Mikhalkov-Konchalovsky (Russian: Андре́й Серге́евич Михалко́в-Кончало́вский; born 20 August 1937, Moscow) is a Russian filmmaker, screenwriter, actor, producer and theater, TV director, who works in Russia and USA. His father was the writer Sergey Mikhalkov (1913) and the brother of Nikita Mikhalkov (1945), who is also a well known Russian filmmaker. Andrei Konchalovsky was a frequent collaborator of Andrei Tarkovsky (1932) earlier in his career. His work has won numerous accolades, including the \"Cannes Grand Prix Spécial du Jury\", a \"FIPRESCI Award\", two \"Silver Lions\", three \"Golden Eagle Awards\", and a \"Primetime Emmy Award\".\n\nHe studied for ten years at the Moscow Conservatory, preparing for a pianist's career. In 1960, however, he met Andrei Tarkovsky and co-scripted his movie Andrei Rublev (1966). His first full-length feature, The First Teacher (1964), was favourably received in the Soviet Union and screened by numerous film festivals abroad. His second film, Asya Klyachina's Story (1967), was suppressed by Soviet authorities. When issued twenty years later, it was acclaimed as his masterpiece. Thereupon, Konchalovsky filmed adaptations of Ivan Turgenev's A Nest of Gentle Folk (1969) and Chekhov's Uncle Vanya (1970), with Innokenty Smoktunovsky in the title role. His epic Siberiade upon its 1979 release was favourably received at Cannes and made possible his move to the United States in 1980.\n\nHis most popular Hollywood releases are Maria's Lovers (1984), Runaway Train (1985), based on a script by Japanese director Akira Kurosawa, and Tango & Cash (1989), starring Sylvester Stallone and Kurt Russell. In the 1990s, Konchalovsky returned to Russia, although he occasionally produced historical films for U.S. television, such as his adaption of The Odyssey (1997) and the award-winning remake, The Lion in Winter (2003).\n\nKonchalovsky's full-length feature, House of Fools (2003), with a cameo role by Bryan Adams as himself, set in a Chechen psychiatric asylum during the war, won him a Silver Lion at the Venice Film Festival. In 2010, Konchalovsky released a longtime passion project of his, The Nutcracker in 3D, a musical adaptation of Peter Ilyich Tchaikovsky's ballet. A musical film, it mixed live action and 3D animation, and starred Elle Fanning, John Turturro, Nathan Lane, and Richard E. Grant. The film was scored with music from the ballet, with additional lyrics by Tim Rice. In 2012, Konchalovsky wrote, directed and produced \"The Battle for Ukraine\", which provided an in depth analysis of how Ukraine to this day struggles to escape from the close embrace of its former big brother. His film \"The Postman's White Nights\" won the Silver Lion at the 71st Venice International Film Festival. The script is centred around the true story of Aleksey Tryaptisyn, a real life postman based in a remote Russian village surrounding the Kenozero lake. In 2016 \"Paradise\" directed by him won the Silver Lion at the 73rd Venice International Film Festival. It was selected as the Russian entry for the Best Foreign Language Film at the 89th Academy Awards. In 2020 at the 77th Venice film festival, his film \"Dear Comrades\" won a special jury prize.",
        "birthday": "1937-08-20",
        "deathday": null,
        "gender": 2,
        "homepage": "http://pc.konchalovsky.ru/",
        "id": 58728,
        "imdb_id": "nm0464846",
        "known_for_department": "Directing",
        "name": "Andrei Konchalovsky",
        "place_of_birth": "Moscow, USSR [now Russia]",
        "popularity": 0.3532,
        "profile_path": "/wPQmCJ6tirAkfPMg7vNAQUeK0yw.jpg"
    }
}