{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/8AGLGUYg9UqcDWXtAH0t7InsBd.jpg",
                "genre_ids": [
                    16,
                    18,
                    878
                ],
                "id": 12140,
                "original_language": "ja",
                "original_title": "イノセンス",
                "overview": "Cyborg detective Batou is assigned to investigate a series of murders committed by gynoids—doll-like cyborgs, which all malfunctioned, killed, then self-destructed afterwards. The brains of the gynoids initialize in order to protect their manufacturer's software, but in one gynoid, which Batou himself neutralized, one file remains: a voice speaking the phrase \"Help me.\"",
                "popularity": 3.8062,
                "poster_path": "/1ZJRbLDVr90KLtKdmTT4WZhT26E.jpg",
                "release_date": "2004-03-06",
                "title": "Ghost in the Shell 2: Innocence",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 919,
                "character": "(voice)",
                "credit_id": "5e0f70299f37b00011577c68",
                "order": 27
            },
            {
                "adult": false,
                "backdrop_path": "/xTWHFJgP5anqRipDig4LSa4DLqj.jpg",
                "genre_ids": [
                    16,
                    12,
                    35,
                    14
                ],
                "id": 532067,
                "original_language": "ja",
                "original_title": "映画 この素晴らしい世界に祝福を！紅伝説",
                "overview": "It is not strange that the Demon Lord's forces fear the Crimson Demons, the clan from which Megumin and Yunyun originate. Even if the Demon Lord's generals attack their village, the Crimson Demons can just easily brush them off with their supreme mastery of advanced and overpowered magic.  When Yunyun receives a seemingly serious letter regarding a potential disaster coming to her hometown, she immediately informs Kazuma Satou and the rest of his party. After a series of wacky misunderstandings, it turns out to be a mere prank by her fellow demon who wants to be an author. Even so, Megumin becomes worried about her family and sets out toward the Crimson Demons' village with the gang.  There, Kazuma and the others decide to sightsee the wonders of Megumin's birthplace. However, they soon come to realize that the nonsense threat they received might have been more than just a joke.",
                "popularity": 3.8637,
                "poster_path": "/fv5BgcfkpWh3V6Pb1qVlXESBOdl.jpg",
                "release_date": "2019-08-30",
                "title": "KONOSUBA – God's blessing on this wonderful world! Legend of Crimson",
                "video": false,
                "vote_average": 8.1,
                "vote_count": 579,
                "character": "Sylvia (voice)",
                "credit_id": "5e52bfcfb87aec0018a9a666",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/9guoVF7zayiiUq5ulKQpt375VIy.jpg",
                "genre_ids": [
                    16,
                    28,
                    14,
                    12
                ],
                "id": 592350,
                "original_language": "ja",
                "original_title": "僕のヒーローアカデミア THE MOVIE ヒーローズ：ライジング",
                "overview": "Class 1-A visits Nabu Island where they finally get to do some real hero work. The place is so peaceful that it's more like a vacation... until they're attacked by a villain with an unfathomable Quirk! His power is eerily familiar, and it looks like Shigaraki had a hand in the plan. But with All Might retired and citizens' lives on the line, there's no time for questions. Deku and his friends are the next generation of heroes, and they're the island's only hope.",
                "popularity": 4.0235,
                "poster_path": "/kpWsIkfXrnQ1pmR79qAHHq7DPxc.jpg",
                "release_date": "2019-12-20",
                "title": "My Hero Academia: Heroes Rising",
                "video": false,
                "vote_average": 8.2,
                "vote_count": 1226,
                "character": "Young Izuku (voice)",
                "credit_id": "5fd4182a0c1255003ee3a770",
                "order": 42
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "渡辺 明乃",
            "渡边明乃",
            "Akino Watanabe",
            "آکِنو واتانابه"
        ],
        "biography": "Akeno Watanabe is a Japanese voice actress and narrator affiliated with Office Osawa. Some of her notable voice roles include Robin Sena in Witch Hunter Robin, Chachamaru Karakuri in Negima! Magister Negi Magi, Halle Lidner in Death Note, Rito Yuki in To Love Ru, Liz Thompson in Soul Eater, Hitch Dreyse in Attack on Titan, and Hamsuke in Overlord.",
        "birthday": "1982-11-18",
        "deathday": null,
        "gender": 1,
        "homepage": "https://osawa-inc.co.jp/women/watanabeakeno/",
        "id": 587350,
        "imdb_id": "nm1337113",
        "known_for_department": "Acting",
        "name": "Akeno Watanabe",
        "place_of_birth": "Funabashi, Chiba, Japan",
        "popularity": 0.5885,
        "profile_path": "/4E05IJxvTGNHb2GSaiyxbCZ5nd8.jpg"
    }
}