{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/o8Z7sdmZXAGYkLXoIn4tfTSu3Qw.jpg",
                "genre_ids": [
                    35
                ],
                "id": 381356,
                "original_language": "fr",
                "original_title": "Five",
                "overview": "A young man paying the rent for himself and his lifelong friends ends up flat-broke and resorts to selling marijuana to pay the bills – only to get caught up in the dangerous world of drugs.",
                "popularity": 1.7738,
                "poster_path": "/qs4tQK0gLpwNmz2gmCYZQ3RQSpr.jpg",
                "release_date": "2016-03-30",
                "title": "Five",
                "video": false,
                "vote_average": 6.986,
                "vote_count": 1312,
                "character": "Une amante de Nestor",
                "credit_id": "65b7f8111089ba00e8f75b2a",
                "order": 33
            }
        ],
        "crew": []
    },
    "details": {
        "adult": true,
        "also_known_as": [
            "Oksana D'Hartcourt",
            "Oksana D'Harcourt",
            "Oksana d'Harcourt",
            "Aurore",
            "Oksana",
            "Stéphanie Vinchon"
        ],
        "biography": "Oksana is a graduate of bac S and a DEUG MIAS. She is also a black belt in judo.\n\nShe is spotted by Fred Coppula and will make her debut in Salopes 3, where she appears alone on the jacket. From this first appearance, she was a great success with the public. She then appeared in the biggest European productions such as Private, Blue One and Marc Dorcel.\n\nShe then joined Marc Dorcel productions to sign her first professional contract and then became the face of this production with the title of ambassador for Marc Dorcel productions. His films are distributed in 47 countries, which allows him to gain notoriety abroad.\n\nShe appeared in the media in 2005, even in generalist media such as the morning of Fun Radio or on TF1 in La Méthode Cauet. She was also invited to Les Grosses Têtes by Philippe Bouvard. After calling herself 'Oksana d'Harcourt' at the start of her career, she abandoned the use of this pseudonym following the request of the Harcourt family, with whom she has no family ties. .\n\nIn June 2006, she announced the end of her exclusive contract with VMD and signed with VCOM. Oksana has shot, to date, in about twenty pornographic films.\n\nIn 2007, she took part in the clip Sois hardcore by Stomy Bugsy and presented Les Nuz on comedy co-presented with Laurent Weil. She participated in the erotic fantasy series from that same year.\n\nShe was the godmother of several salons of eroticism in the French province, notably in the North of France, salons of eroticism in Belgium in particular in Brussels or Mons (Erotix Mons).\n\nOksana played a sex scene with Philippe Caubère in Frédéric Schoendoerffer's film, Truands (2007).\n\nIn 2008-2009, she was a columnist and editor in Les filles de Penthouse, French version.\n\nIn 2009, she tried her hand at writing by co-authoring with Gil Prou ​​a science fiction novel, Cathedrals of mist, published by Rivière Blanche, then Katharsis in 2010 and Zalmoxis in 2016.\n\nAt the same time, in November 2009, Oksana launched her production company called 'OksanaTV', the purpose of which is to make X movies with real scenarios.",
        "birthday": "1982-02-01",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.oksana.fr",
        "id": 587311,
        "imdb_id": "nm2339963",
        "known_for_department": "Acting",
        "name": "Oksana",
        "place_of_birth": "Maubeuge, Nord, France",
        "popularity": 3.716,
        "profile_path": "/iLOq7Y6xRD99Laxeu0Pcs4wpIeo.jpg"
    }
}