{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yq9g4RGM1mEMBoSL5HKVBy9MOPM.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 40807,
                "original_language": "en",
                "original_title": "50/50",
                "overview": "Inspired by a true story, a comedy centered on a 27-year-old guy who learns of his cancer diagnosis and his subsequent struggle to beat the disease.",
                "popularity": 3.0171,
                "poster_path": "/8f9tM9JVB4ETBhxlQcXIjLckArl.jpg",
                "release_date": "2011-09-30",
                "title": "50/50",
                "video": false,
                "vote_average": 7.174,
                "vote_count": 3897,
                "character": "Self (archive footage) (uncredited)",
                "credit_id": "64df1fd8d100b614b15aa9da",
                "order": 39
            },
            {
                "adult": false,
                "backdrop_path": "/hwPnxzIgQFfXl5zP0Yh8bViCMzf.jpg",
                "genre_ids": [
                    14,
                    12,
                    28
                ],
                "id": 57158,
                "original_language": "en",
                "original_title": "The Hobbit: The Desolation of Smaug",
                "overview": "The Dwarves, Bilbo and Gandalf have successfully escaped the Misty Mountains, and Bilbo has gained the One Ring. They all continue their journey to get their gold back from the Dragon, Smaug.",
                "popularity": 12.9588,
                "poster_path": "/xQYiXsheRCDBA39DOrmaw1aSpbk.jpg",
                "release_date": "2013-12-11",
                "title": "The Hobbit: The Desolation of Smaug",
                "video": false,
                "vote_average": 7.573,
                "vote_count": 13643,
                "character": "Laketown Spy",
                "credit_id": "532bf221c3a3684bab000fe8",
                "order": 50
            },
            {
                "adult": false,
                "backdrop_path": "/twsxsfao6ZOVvT8LfudH603MMi6.jpg",
                "genre_ids": [
                    10751,
                    35,
                    16,
                    878
                ],
                "id": 519182,
                "original_language": "en",
                "original_title": "Despicable Me 4",
                "overview": "Gru and Lucy and their girls—Margo, Edith and Agnes—welcome a new member to the Gru family, Gru Jr., who is intent on tormenting his dad. Gru also faces a new nemesis in Maxime Le Mal and his femme fatale girlfriend Valentina, forcing the family to go on the run.",
                "popularity": 29.7746,
                "poster_path": "/wWba3TaojhK7NdycRhoQpsG0FaH.jpg",
                "release_date": "2024-06-20",
                "title": "Despicable Me 4",
                "video": false,
                "vote_average": 7.013,
                "vote_count": 2921,
                "character": "Perry Prescott (voice)",
                "credit_id": "65b6c7029ba86a0162f87033",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Stephen T. Colbert",
            "ستيفن كولبير",
            "استیون کلبر",
            "Стивън Колбер",
            "סטיבן קולבר",
            "スティーヴン・コルベア",
            "스티븐 콜베어",
            "സ്റ്റീഫൻ കോൾബർട്ട്",
            "Кольбер, Стивен",
            "סטיווען קאלבערט",
            "斯蒂芬·科拜尔",
            "Stephen Tyrone Colbert "
        ],
        "biography": "Stephen Tyrone Colbert (born May 13, 1964) is an American political satirist, writer, comedian, television host, and actor. He is the host of Comedy Central's The Colbert Report, a satirical news show in which Colbert portrays a caricatured version of conservative political pundits.\n\nColbert originally studied to be an actor, but became interested in improvisational theatre when he met famed Second City director Del Close while attending Northwestern University. He first performed professionally as an understudy for Steve Carell at Second City Chicago; among his troupe mates were comedians Paul Dinello and Amy Sedaris, with whom he developed the critically acclaimed sketch comedy series Exit 57.\n\nColbert also wrote and performed on the short-lived Dana Carvey Show before collaborating with Sedaris and Dinello again on the cult television series Strangers with Candy. He gained considerable attention for his role on the latter as closeted gay history teacher Chuck Noblet. It was his work as a correspondent on Comedy Central's news-parody series The Daily Show, however, that first introduced him to a wide audience.\n\nIn 2005, he left The Daily Show with Jon Stewart to host a spin-off series, The Colbert Report. Following The Daily Show's news-parody concept, The Colbert Report is a parody of personality-driven political opinion shows such as The O'Reilly Factor. Since its debut, the series has established itself as one of Comedy Central's highest-rated series, earning Colbert three Emmy Award nominations and an invitation to perform as featured entertainer at the White House Correspondents' Association Dinner in 2006. Colbert was named one of Time's 100 most influential people in 2006. His book I Am America (And So Can You!) was No. 1 on The New York Times Best Seller list.\n\nDescription above from the Wikipedia article Stephen Colbert, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1964-05-13",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 58769,
        "imdb_id": "nm0170306",
        "known_for_department": "Acting",
        "name": "Stephen Colbert",
        "place_of_birth": "Washington, District of Columbia, USA",
        "popularity": 0.4925,
        "profile_path": "/zQ6pvfqIqYiV4TB7lDoaJL52H93.jpg"
    }
}