{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dENLz9Np9EV5Ro8UIBhbKC8BmSS.jpg",
                "genre_ids": [
                    53,
                    28,
                    18,
                    878
                ],
                "id": 61791,
                "original_language": "en",
                "original_title": "Rise of the Planet of the Apes",
                "overview": "A highly intelligent chimpanzee named Caesar has been living a peaceful suburban life ever since he was born. But when he gets taken to a cruel primate facility, Caesar decides to revolt against those who have harmed him.",
                "popularity": 8.3976,
                "poster_path": "/cjLsuP75UDlRdJVMXzXg3TJ4umX.jpg",
                "release_date": "2011-08-03",
                "title": "Rise of the Planet of the Apes",
                "video": false,
                "vote_average": 7.337,
                "vote_count": 12321,
                "character": "Mother on Sidewalk (uncredited)",
                "credit_id": "6451e2fad8f44e0db19ec39d",
                "order": 63
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Sonja Bennett (born August 24, 1980) is a Canadian actress and screenwriter. Her film debut was in the Canadian feature film Punch (2002), for which she won the Vancouver Film Critics Circle Award for Best Actress in a Canadian Film. She has since starred in the films Donovan's Echo, Cole, Control Alt Delete, Young People Fucking, and Fido as well as the television series Godiva's and Cold Squad. In 2014, Bennett made her screenwriting debut with Preggoland in which she also starred.\n\nBorn in Vancouver, British Columbia, Bennett is the daughter of director and writer Guy Bennett and Anna Hart. She was raised mainly by her mother, living in several locations. She is a graduate of Garibaldi Secondary School in Maple Ridge, British Columbia. She attended the University of British Columbia for two years on an academic scholarship. Following that, she attended Langara College in Vancouver, and enrolled in the Studio 58 program.",
        "birthday": "1980-08-24",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.sonjabennett.ca",
        "id": 58800,
        "imdb_id": "nm1060641",
        "known_for_department": "Acting",
        "name": "Sonja Bennett",
        "place_of_birth": "Vancouver, British Columbia, Canada",
        "popularity": 0.4747,
        "profile_path": "/iiMEEWt10g9w9pWOEFG8M0GxDSn.jpg"
    }
}