{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/vyOFlV1afDHb9MMwJVyON4qXbvC.jpg",
                "genre_ids": [
                    10751,
                    12,
                    16,
                    28
                ],
                "id": 9732,
                "original_language": "en",
                "original_title": "The Lion King II: Simba's Pride",
                "overview": "The circle of life continues for Simba, now fully grown and in his rightful place as the king of Pride Rock. Simba and Nala have given birth to a daughter, Kiara who's as rebellious as her father was. But Kiara drives her parents to distraction when she catches the eye of Kovu, the son of the evil lioness, Zira. Will Kovu steal Kiara's heart?",
                "popularity": 8.536,
                "poster_path": "/sWR1x6UCMCGN9xEf8RGhPS934X0.jpg",
                "release_date": "1998-10-24",
                "title": "The Lion King II: Simba's Pride",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 4543,
                "character": "Adult Kiara (singing voice) (uncredited)",
                "credit_id": "52fe4524c3a36847f80beab7",
                "order": 17
            },
            {
                "adult": false,
                "backdrop_path": "/jsgRkhPxYtzAhDFCUyNbvlX63tY.jpg",
                "genre_ids": [
                    10749,
                    10751,
                    16,
                    14
                ],
                "id": 10020,
                "original_language": "en",
                "original_title": "Beauty and the Beast",
                "overview": "Follow the adventures of Belle, a bright young woman who finds herself in the castle of a prince who's been turned into a mysterious beast. With the help of the castle's enchanted staff, Belle soon learns the most important lesson of all -- that true beauty comes from within.",
                "popularity": 11.4334,
                "poster_path": "/hUJ0UvQ5tgE2Z9WpfuduVSdiCiU.jpg",
                "release_date": "1991-10-22",
                "title": "Beauty and the Beast",
                "video": false,
                "vote_average": 7.731,
                "vote_count": 10301,
                "character": "Additional Voices (voice)",
                "credit_id": "5ab831f8c3a368179d001254",
                "order": 27
            },
            {
                "adult": false,
                "backdrop_path": "/h6VshReCGaGQoaGZwT2wqiqrcZW.jpg",
                "genre_ids": [
                    16,
                    10751,
                    14,
                    12
                ],
                "id": 9444,
                "original_language": "en",
                "original_title": "Anastasia",
                "overview": "Ten years after she was separated from her family, an eighteen-year-old orphan with vague memories of the past sets out to Paris in hopes of reuniting with her grandmother. She is accompanied by two con men, who intend to pass her off as the Grand Duchess Anastasia to the Dowager Empress for a reward.",
                "popularity": 5.1878,
                "poster_path": "/bppGWGA8zq1sRvTdDJnUzVW9GcH.jpg",
                "release_date": "1997-11-20",
                "title": "Anastasia",
                "video": false,
                "vote_average": 7.605,
                "vote_count": 5439,
                "character": "Anastasia (singing voice)",
                "credit_id": "5cf120bec3a368735b2043ce",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Liz Callaway is a Tony nominee and Emmy Award-winning actress, singer and recording artist. She made her Broadway debut in Stephen Sondheim’s Merrily We Roll Along, received a Tony Award nomination for her performance in Baby, and for five years won acclaim as Grizabella in Cats. She has also starred in the original Broadway casts of Miss Saigon, The Three Musketeers, and The Look of Love.\n\nLiz sang the Academy Award-nominated song “Journey to the Past” in the animated feature Anastasia and is also the singing voice of Princess Jasmine in Disney’s Aladdin and the King of Thieves and The Return of Jafar. Other film work includes the singing voice of the title character in The Swan Princess, Lion King 2: Simba’s Pride, Beauty and the Beast, The Brave Little Toaster Goes to Mars and The Rewrite with Hugh Grant.\n\nShe received an Emmy Award for hosting Ready to Go, a daily, live children’s program on CBS in Boston.  Other TV credits include In Performance at the White House, Inside the Actor’s Studio: Stephen Sondheim, In Performance at the White House, Christmas with the Boston Pops, The David Letterman Show, and Senior Trip (CBS Movie of the Week).\n\nLiz has released eight solo albums: Anywhere I Wander: Liz Callaway Sings Frank Loesser, The Story Goes On: Liz Callaway On and Off-Broadway, The Beat Goes On, Passage of Time, Merry and Bright, The Essential Liz Callaway, Comfort and Joy: An Acoustic Christmas, and her latest, To Steve with Love: Liz Callaway Celebrates Sondheim. Her numerous other recordings include Sibling Revelry, Boom! Live at Birdland, The Maury Yeston Songbook, Dreaming Wide Awake: The Music of Scott Alan, Hair in Concert, and the complete recording of Allegro produced by the Rodgers and Hammerstein Organization.",
        "birthday": "1961-04-13",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.lizcallaway.com",
        "id": 58828,
        "imdb_id": "nm0130356",
        "known_for_department": "Acting",
        "name": "Liz Callaway",
        "place_of_birth": "Chicago, Illinois, USA",
        "popularity": 0.0475,
        "profile_path": "/zCPIvHAFAMSEHQxfbl6taChMsVu.jpg"
    }
}