{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/djPXXv9pPyTLGl9kMPCTyiBmIA5.jpg",
                "genre_ids": [
                    37,
                    28
                ],
                "id": 11969,
                "original_language": "en",
                "original_title": "Tombstone",
                "overview": "Legendary marshal Wyatt Earp, now a weary gunfighter, joins his brothers Morgan and Virgil to pursue their collective fortune in the thriving mining town of Tombstone. But Earp is forced to don a badge again and get help from his notorious pal Doc Holliday when a gang of renegade brigands and rustlers begins terrorizing the town.",
                "popularity": 5.9186,
                "poster_path": "/wGFCvylul8iEQhJOKfwZGGvXMzA.jpg",
                "release_date": "1993-12-25",
                "title": "Tombstone",
                "video": false,
                "vote_average": 7.589,
                "vote_count": 2284,
                "character": "Mattie Earp",
                "credit_id": "52fe44ac9251416c7503cfdf",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia.\n\nDana Wheeler-Nicholson (born New York City, New York, October 9, 1960) is an American actress.\n\nSometimes credited as Dana Wheeler Nicholson, she has appeared in numerous movies, but is probably best known for her role in Fletch as Gail Stanwyk (wife of the villain and love interest of the title character played by Chevy Chase) and in Tombstone (1993) as Mattie Blaylock (Wyatt Earp's common law wife). Her most recent movie role was in Fast Food Nation (2006). She has also appeared in several TV series including Seinfeld, Law &amp; Order, Law &amp; Order: Criminal Intent, Sex and the City, Boston Public, Boston Legal, Friday Night Lights, and most recently The Good Guys.\n\nShe is the granddaughter of pioneering American comic book publisher Malcolm Wheeler-Nicholson.\n\nDescription above from the Wikipedia article Dana Wheeler-Nicholson, licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": "1960-10-09",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 58866,
        "imdb_id": "nm0923984",
        "known_for_department": "Acting",
        "name": "Dana Wheeler-Nicholson",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.6952,
        "profile_path": "/XQ3K2pidzBq1mZ729l0UTIYSC3.jpg"
    }
}