{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yCnJT53HMXAK87xzPAdjdYhZ3JE.jpg",
                "genre_ids": [
                    18,
                    9648,
                    878
                ],
                "id": 1124,
                "original_language": "en",
                "original_title": "The Prestige",
                "overview": "A mysterious story of two magicians whose intense rivalry leads them on a life-long battle for supremacy -- full of obsession, deceit and jealousy with dangerous and deadly consequences.",
                "popularity": 11.832,
                "poster_path": "/2ZOzyhoW08neG27DVySMCcq2emd.jpg",
                "release_date": "2006-10-17",
                "title": "The Prestige",
                "video": false,
                "vote_average": 8.204,
                "vote_count": 16794,
                "character": "Defender",
                "credit_id": "56d9c378c3a3682cef012047",
                "order": 11
            },
            {
                "adult": false,
                "backdrop_path": "/l36ekUEEDLMAuL0YAU2Qxfq1i6X.jpg",
                "genre_ids": [
                    10751,
                    16,
                    35,
                    12
                ],
                "id": 458253,
                "original_language": "en",
                "original_title": "Missing Link",
                "overview": "The charismatic Sir Lionel Frost considers himself to be the world's foremost investigator of myths and monsters. Trouble is, none of his small-minded, high-society peers seems to recognize this. Hoping to finally gain acceptance from these fellow adventurers, Sir Lionel travels to the Pacific Northwest to prove the existence of a legendary creature known as the missing link.",
                "popularity": 3.1796,
                "poster_path": "/bqQ38oKuROlAgyZcRII9tqtoPNi.jpg",
                "release_date": "2019-04-04",
                "title": "Missing Link",
                "video": false,
                "vote_average": 6.933,
                "vote_count": 891,
                "character": "Old Worlder (voice)",
                "credit_id": "5f653110dd926a0039465fbc",
                "order": 25
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "​From Wikipedia, the free encyclopedia\n\nChristopher Neame (born 12 September 1947, London) is an English actor. His film credits include appearances in the Hammer Horror film Dracula AD 1972 (1972), the James Bond film Licence to Kill (1989), Ghostbusters II (also 1989), Hellbound (1994) and The Prestige (2006). He is known to television viewers in the UK for his roles in two BBC dramas dealing with the Second World War - Lieutenant Dick Player in Colditz (1972–74) and Flight Lieutenant John Curtis in the first series of Secret Army (1977). He also made a guest appearance in another BBC period drama When the Boat Comes In, in 1981 portraying Robin Cunningham. He played a psycho killer in an episode of MacGyver in 1985. He is also known to have played the Dark Jedi Jerec in the Star Wars Jedi Knight: Dark Forces II computer game. Neame played the villain Skagra in the unfinished Doctor Who serial Shada in 1979. Neame now resides in the United States, where he has made frequent appearances in American television including a two-part story of Star Trek: Enterprise in 2004. In 1994 he portrayed \"Knight Two\" in the Babylon 5 episode \"And the Sky Full of Stars\". Neame is one of the few actors to have appeared in Doctor Who, Star Trek and Babylon 5.\n\nDescription above from the Wikipedia article Christopher Neame, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1947-09-12",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 58860,
        "imdb_id": "nm0623762",
        "known_for_department": "Acting",
        "name": "Christopher Neame",
        "place_of_birth": "London, England",
        "popularity": 0.3959,
        "profile_path": "/rbZmUXeo3jfUDO2o1P3HB2Grq8x.jpg"
    }
}