{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ort14Ott2BvpfmTuhsMUVnSEsWd.jpg",
                "genre_ids": [
                    10751,
                    16,
                    12,
                    35
                ],
                "id": 9929,
                "original_language": "fr",
                "original_title": "Astérix et Cléopâtre",
                "overview": "Popular animated hero Asterix and his faithful sidekick Obelix travel to ancient Egypt to help Cleopatra build a new summer home. Cleopatra and Julius Caesar have made a bet, with Caesar wagering the project cannot be completed in a few weeks time. With the help of a magic potion, Asterix comes to the rescue of the Queen of the Nile as Caesar and an angry architect plot against them.",
                "popularity": 1.2987,
                "poster_path": "/gNpKAmWFsCiWKKx39Ap8pF7EWQg.jpg",
                "release_date": "1968-12-19",
                "title": "Asterix and Cleopatra",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 995,
                "character": "(voice)",
                "credit_id": "52fe454bc3a36847f80c63e7",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/lyQSifurKvWmqWzouVe50JFoI35.jpg",
                "genre_ids": [
                    10751,
                    16,
                    35,
                    12
                ],
                "id": 9385,
                "original_language": "fr",
                "original_title": "Les 12 travaux d'Astérix",
                "overview": "Asterix and Obelix depart on an adventure to complete twelve impossible tasks to prove to Caesar that they are as strong as the Gods. You'll roar with laughter as they outwit, outrun, and generally outrage the very people who are trying to prove them \"only human\".",
                "popularity": 3.2232,
                "poster_path": "/7cZQZOYZFJcLjZnxWjO5PcUtmDZ.jpg",
                "release_date": "1976-06-26",
                "title": "The Twelve Tasks of Asterix",
                "video": false,
                "vote_average": 7.334,
                "vote_count": 1295,
                "character": "Abraracourcix / Assurancetourix (voice)",
                "credit_id": "52fe44f0c3a36847f80b30db",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Pierre Tournadre"
        ],
        "biography": "Pierre Tornade (21 January 1930 – 7 March 2012) was a French actor. He appeared in more than 120 films and television shows between 1956 and 1998.\n\nHe was born Pierre Tournadre on 21 January 1930 in Bort-les-Orgues in the department of Corrèze. He began his theatrical career at 25 in Elle est folle, Carole at the théâtre du Palais-Royal. In 1956, he played in the musical comedy Irma la douce by Alexandre Breffort and Marguerite Monnot and then made his film debut in Les Truands, where he adopted his stage name, Tornade. The next year, he played a theater role in Pericles, Prince of Tyre before joining the Branquignols troupe of Robert Dhéry, which also included Jean Lefebvre, Michel Serrault and Micheline Dax.\n\nHe then became very demanded on television and appeared in several sitcoms such as Thierry la Fronde (1963), Le Chevalier d'Harmental (1966), Les Sept de l'escalier quinze B (1967) and Les Dossiers de l'agence O (1968). Because of his tall and imposing stature, he often appeared as a policeman or a soldier. His most famous roles were the father's victim in The Common Man (1975), Captain Dumont in the series Now Where Did the 7th Company Get to? (1973) and commissioner Florimond Faroux in the series Nestor Burma.\n\nA famous voice actor, he moonlighted as village chief Vitalstatistix in animated films Asterix le Gaul (1967), Asterix and Cleopatra (1968) and The Twelve Tasks of Asterix (1976). He later voiced Averell Dalton in Lucky Luke animated films Daisy Town (1971) and La Ballade des Dalton (1978) and Lucky Luke the Lucky Cowboy (1983). He also voiced Obelix in four other animated films of Asterix, these include Asterix Versus Caesar (1985), Asterix in Britain (1986), Asterix and the Big Fight (1989) and Asterix Conquers America (1994).\n\nHe was named Chevalier (Knight) of the National Order of Merit in 1996. Tornade died on 7 March 2012 in Rambouillet hospital after several days in a coma. He had fallen accidentally in the stairway of his Yvelines residence the previous week and had been comatose since then.\n\nSource: Article \"Pierre Tornade\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1930-01-21",
        "deathday": "2012-03-07",
        "gender": 2,
        "homepage": null,
        "id": 589521,
        "imdb_id": "nm0868139",
        "known_for_department": "Acting",
        "name": "Pierre Tornade",
        "place_of_birth": "Bort-les-Orgues, Corrèze, France",
        "popularity": 0.2264,
        "profile_path": "/jtxGufvDwQSpwyuJKitxSMTEAfd.jpg"
    }
}