{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/pxkQAIhC7LXN5s5B23lnvCMgva5.jpg",
                "genre_ids": [
                    80,
                    18,
                    10749
                ],
                "id": 654,
                "original_language": "en",
                "original_title": "On the Waterfront",
                "overview": "A prizefighter-turned-longshoreman with a conscience goes up against labor leaders to expose corruption, extortion, and murder among the union ranks.",
                "popularity": 5.1767,
                "poster_path": "/fKjLZy9W8VxMOp5OoyWojmLVCQw.jpg",
                "release_date": "1954-06-22",
                "title": "On the Waterfront",
                "video": false,
                "vote_average": 7.882,
                "vote_count": 1669,
                "character": "Truck",
                "credit_id": "52fe4265c3a36847f801b211",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Dominick Anthony \"Tony\" Galento",
            "Dominick Anthony Galento",
            "Two Ton Tony",
            "Jersey Nightstick",
            "TNT Kid",
            "One-Man Riot",
            "Orange Orangutan",
            "beer barrel that walks like a man"
        ],
        "biography": "\"Two Ton\" Tony Galento, a stogie-smoking pugilist and bar-owner who claimed he trained on beer, hamburgers, and spaghetti, was one of the most colorful characters to ever contend for the heavyweight title.\n\nBorn Dominic Anthony Galento on March 12, 1910 in Orange, New Jersey, he earned his nickname after driving his ice truck to an arena, arriving just before the start of one of his fights. Spotting him in the parking lot, his manager asked him where he'd been.\n\n\"I had two tons of ice to deliver on my way here,\" Galento said. The greatest clown in boxing history had arrived.\n\nGalento, a dirty fighter who would deliberately head-butt, gouge, low-blow, and elbow his opponents, was one of the toughest men ever to box professionally. Defeating Lou Nova, Al Ettore, and Nathan Mann on his way to a shot at the heavyweight title, he was the most famous member of \"The Brown Bomber\" Joe Louis' \"Bum of the Month Club.\" The underdog Galento earned fistic immortality when he sent Louis to the canvas in the second round of their title bout. Louis admitted that he might have been the toughest man he ever met in the ring.",
        "birthday": "1910-03-12",
        "deathday": "1979-07-22",
        "gender": 2,
        "homepage": null,
        "id": 589670,
        "imdb_id": "nm0301977",
        "known_for_department": "Acting",
        "name": "Tony Galento",
        "place_of_birth": "Orange, New Jersey, USA",
        "popularity": 0.1236,
        "profile_path": "/83OGOWAHSVwi4iixWztZUIbJ0GI.jpg"
    }
}