{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ryoWP1kvNcwPif6uNbuZwQfrJPy.jpg",
                "genre_ids": [
                    35,
                    80
                ],
                "id": 24382,
                "original_language": "it",
                "original_title": "I soliti ignoti",
                "overview": "Best friends Peppe and Mario are thieves, but they're not very good at it. Still, Peppe thinks that he's finally devised a master heist that will make them rich. With the help of some fellow criminals, he plans to dig a tunnel from a rented apartment to the pawnshop next door, where they can rob the safe. But his plan is far from foolproof, and the fact that no one in the group has any experience digging tunnels proves to be the least of their problems.",
                "popularity": 1.6895,
                "poster_path": "/f5OxD8Nl0pR3DcYHtYhHRfpsmjl.jpg",
                "release_date": "1958-07-26",
                "title": "Big Deal on Madonna Street",
                "video": false,
                "vote_average": 8.099,
                "vote_count": 740,
                "character": "il commissario di polizia",
                "credit_id": "5a008af5c3a368689306badc",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Mario Feliciani (12 March 1918 – 11 August 2008) was an Italian actor and voice actor.\n\nBorn in Milan, after completing his classical education Feliciani attended the Accademia dei filodrammatici obtaining the diploma. He made his stage debut in 1941, with the theatrical company \"Palcoscenico\". Later he was part of various companies, obtaining his first personal successes in 1946, with the drama La luna è tramontata.\n\nFrom 1947 to 1952 he was a member of the Piccolo Teatro's stage company directed by Giorgio Strehler. He had also a very long and important collaboration on stage with Vittorio Gassman, also performing tours abroad with him. In the 1970s he came back to Piccolo Teatro for two important works, Santa Giovanna dei macelli (1970–71) and Le case del vedovo (1975-76).\n\nFeliciani was also very active in films, on television and as a voice actor, on the radio and in the dubbing.\n\nMarried to the actress Giuliana Pogliani, after obtaining the annulment Feliciani was married to actress Vittoria Martello.\n\nSource: Article \"Mario Feliciani\" from Wikipedia in English, licensed under CC-BY-SA 3.0.",
        "birthday": "1918-03-12",
        "deathday": "2008-08-11",
        "gender": 2,
        "homepage": null,
        "id": 589787,
        "imdb_id": "nm0271229",
        "known_for_department": "Acting",
        "name": "Mario Feliciani",
        "place_of_birth": " Milan, Italy",
        "popularity": 0.0673,
        "profile_path": "/dmVT2hOlxDRAvh4yOPFsLp6Zt11.jpg"
    }
}