{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/AaABt75ZzfMGrscUR2seabz4PEX.jpg",
                "genre_ids": [
                    28,
                    12,
                    14
                ],
                "id": 297762,
                "original_language": "en",
                "original_title": "Wonder Woman",
                "overview": "An Amazon princess comes to the world of Man in the grips of the First World War to confront the forces of evil and bring an end to human conflict.",
                "popularity": 15.9217,
                "poster_path": "/v4ncgZjG2Zu8ZW5al1vIZTsSjqX.jpg",
                "release_date": "2017-05-30",
                "title": "Wonder Woman",
                "video": false,
                "vote_average": 7.214,
                "vote_count": 20445,
                "character": "Scottish Regiment Soldier (uncredited)",
                "credit_id": "63838799bf09d100937b7c6b",
                "order": 76
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Lee has been passionate about the entertainment industry since childhood, aiming to inspire others through his work. He has trained and worked professionally in Los Angeles, Florida, Paris, and London, performing as an actor, singer, and dancer in film, television, stage, and commercials. Additionally, he writes, directs, models, and coaches acting.\n\nIn 2024, Lee participated in a London Test Video Shoot. In 2022, Lee appeared in I Used to Be Famous (2022). Notable career highlights include a small role alongside Gal Gadot in Wonder Woman (2017), as well as writing, directing and acting in two of his own short plays and films, such as Not the Way It Feels (2010), Time Stops Moving (2010), This Dark Place (2010), Sing Me to Sleep (2010), Time Always Moving (2011), Three Times Moving: The Kiss Through Time (2014), Three Times Moving: A Time to Lie (2014) and Three Times Moving: Time Forgotten (2014).\n\nIn LA, Lee trained with Elisa Eliot and Art Wolff, and in the UK, he has been coached by Mel Churcher, and studied at the Actors Temple, RADA, Pinewood Film Studios, Lyric Theatre Hammersmith and the Theatre Royal Haymarket. He has learned from practitioners including Patrick Stewart, James McAvoy, Ewan McGregor, Jeremy Irons, Imelda Staunton, and Jane Krakowski.\n\nLee supports various children's charities, including Give Kids the World in Florida and the Duke of Edinburgh's Award in the UK.",
        "birthday": "1978-01-22",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.imdb.me/leeneville",
        "id": 590410,
        "imdb_id": "nm2357750",
        "known_for_department": "Acting",
        "name": "Lee Neville",
        "place_of_birth": "London, England, UK",
        "popularity": 0.0943,
        "profile_path": "/orjQvuEETp2497jNUqWf2gRTRjo.jpg"
    }
}