{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/DztBnZaqmla2sGUW9s8AyOmskT.jpg",
                "genre_ids": [
                    18
                ],
                "id": 14,
                "original_language": "en",
                "original_title": "American Beauty",
                "overview": "Lester Burnham, a depressed suburban father in a mid-life crisis, decides to turn his hectic life around after developing an infatuation with his daughter's attractive friend.",
                "popularity": 9.2546,
                "poster_path": "/wby9315QzVKdW9BonAefg8jGTTb.jpg",
                "release_date": "1999-09-15",
                "title": "American Beauty",
                "video": false,
                "vote_average": 8.005,
                "vote_count": 12548,
                "character": "Student (uncredited)",
                "credit_id": "653b5c58519bbb00e18b91e5",
                "order": 38
            },
            {
                "adult": false,
                "backdrop_path": "/aH5QhlVu7uMnLO9P432IcP8FyCI.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 1850,
                "original_language": "en",
                "original_title": "Man on the Moon",
                "overview": "The story of the life and career of eccentric avant-garde comedian, Andy Kaufman.",
                "popularity": 4.1341,
                "poster_path": "/msOZS07xRIFnapwp3fprGbKEAfT.jpg",
                "release_date": "1999-12-22",
                "title": "Man on the Moon",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 1868,
                "character": "Wrestling Fan (uncredited)",
                "credit_id": "6390495df36a3200f043a1f5",
                "order": 199
            },
            {
                "adult": false,
                "backdrop_path": "/kVsFGeyGwK7gCY72sFjczY4dmDs.jpg",
                "genre_ids": [
                    18
                ],
                "id": 809140,
                "original_language": "en",
                "original_title": "Father Stu",
                "overview": "The true-life story of boxer-turned-priest. When an injury ends his amateur boxing career, Stuart Long moves to Los Angeles to find money and fame. While scraping by as a supermarket clerk, he meets Carmen, a Sunday school teacher who seems immune to his bad-boy charm. Determined to win her over, the longtime agnostic starts going to church to impress her. However, a motorcycle accident leaves him wondering if he can use his second chance to help others, leading to the surprising realization that he's meant to be a Catholic priest.",
                "popularity": 3.1297,
                "poster_path": "/pLAeWgqXbTeJ2gQtNvRmdIncYsk.jpg",
                "release_date": "2022-04-13",
                "title": "Father Stu",
                "video": false,
                "vote_average": 7.158,
                "vote_count": 665,
                "character": "Church Parishioner (uncredited)",
                "credit_id": "68a4dd061a7c0d71dd25ece1",
                "order": 49
            },
            {
                "adult": false,
                "backdrop_path": "/lPLTLCBn39Wiy1RPQLB9xOKyF2v.jpg",
                "genre_ids": [
                    28,
                    18,
                    53
                ],
                "id": 9798,
                "original_language": "en",
                "original_title": "Enemy of the State",
                "overview": "The life of labor lawyer and dedicated family man Robert 'Bobby' Dean is turned upside down after a chance meeting with a college buddy while holiday shopping. Unbeknownst to Dean, he's just been burdened with a videotape of a congressman's assassination. Hot on the trail of this tape is a ruthless group of National Security Agents commanded by a belligerently ambitious NSA official named Reynolds. Using satellite surveillance, bugs, and other sophisticated snooping devices, the NSA infiltrates every facet of Dean's existence, tracing each physical and digital footprint he leaves while also framing him for murder. With the help of the mysterious Brill, he attempts to throw the NSA off his trail and prove his innocence.",
                "popularity": 5.9231,
                "poster_path": "/x9pXrMKLsBGGOFyyZ0Gwt9YpVub.jpg",
                "release_date": "1998-11-20",
                "title": "Enemy of the State",
                "video": false,
                "vote_average": 7.056,
                "vote_count": 4033,
                "character": "Computer Programmer (uncredited)",
                "credit_id": "68a4debaab5b487289bcb10a",
                "order": 99
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Jamie Hunter"
        ],
        "biography": "James Hunter began making movies at an extremely young age. At age 13 in 1990 he made a \"Star Wars\" movie using action figures with blue screen and special effects after renting out a local TV station. At age 14 he wrote \"Robin Hood: Prince of Sherwood\" and with the help of his father and friends, pulled together his first feature film, shot on 16mm. The film took three years to make and premiered in January 1994 at the local town theater. Tickets were sold at $5 and around 3,000 people saw the movie over 2 days. James self taught himself how to load and shoot with a 16mm film camera and also taught himself to edit on film. That same year, Hunter began his second feature film attempt at age 17, this time playing the lead role as well as directing. Also shot and edited on 16mm, \"The River Bridge\" was completed in 1996. This film starred Charles Napier, a veteran character actor of the 80s and 90s.\n\nIn 1997, Hunter married and moved to Los Angeles where he studied film, theater, and philosophy at Los Angeles City College. He worked at the Virgin Mega Store in Hollywood, as a waiter at Hamburger Hamlet, and as an extra to make ends.\n\nDue to the Digital Revolution and Hollywood's reluctance to take such a young director seriously, Hunter put directing aside and got involved in acting at age 20 and in 2004 he became a member of the Screen Actors Guild. His teenage films remained on a shelf until 2008 when Hunter distributed the movies with the help of Ryan Sims, and the films were finally released through Indieflix and Amazon.com. In April of 2013, Hunter uploaded to films to YouTube.\n\nIn 1999, Hunter went into production on his 3rd film, \"Vagabond Lover 1999\". Production shut down after one investor pulled the plug. Twenty years later, Hunter began pre-production again and reentered the project, writing new scenes and new characters. In 2020, the Covid pandemic shut down the production a second time. Production is scheduled to begin again in 2023.\n\nAs of 2023, James has written several new projects including two horror films, a sequel to his original Robin Hood film, and a movie based on the true story of his late aunt, Mary Faye Hunter, who was murdered in 1967.",
        "birthday": "1977-06-12",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 590804,
        "imdb_id": "nm0402862",
        "known_for_department": "Acting",
        "name": "James Hunter",
        "place_of_birth": "Decatur, Alabama, USA",
        "popularity": 0.0698,
        "profile_path": "/3MjWHo2W561N7iRu7O9qrmNhh8y.jpg"
    }
}