{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5HjzYTihkH7EvOWSE7KcsF6pBMM.jpg",
                "genre_ids": [
                    10751,
                    35,
                    12,
                    16
                ],
                "id": 522478,
                "original_language": "en",
                "original_title": "Peter Rabbit 2: The Runaway",
                "overview": "Peter Rabbit runs away from his human family when he learns they are going to portray him in a bad light in their book. Soon, he crosses paths with an older rabbit who ropes him into a heist.",
                "popularity": 6.1345,
                "poster_path": "/cycDz68DtTjJrDJ1fV8EBq2Xdpb.jpg",
                "release_date": "2021-03-25",
                "title": "Peter Rabbit 2: The Runaway",
                "video": false,
                "vote_average": 7.066,
                "vote_count": 852,
                "character": "Pigling Bland (voice)",
                "credit_id": "660674342faf4d0131c62102",
                "order": 14
            },
            {
                "adult": false,
                "backdrop_path": "/kPKwqHl2rYsi9rFWJWA6afKdmlT.jpg",
                "genre_ids": [
                    18,
                    53,
                    37
                ],
                "id": 400090,
                "original_language": "en",
                "original_title": "The Nightingale",
                "overview": "In 1825, Clare, a 21-year-old Irish convict, chases a British soldier through the rugged Tasmanian wilderness, bent on revenge for a terrible act of violence he committed against her family. She enlists the services of an Aboriginal tracker who is also marked by trauma from his own violence-filled past.",
                "popularity": 2.9665,
                "poster_path": "/9nRpZmvdEgq8hMu1rNyc90XQtH6.jpg",
                "release_date": "2018-09-23",
                "title": "The Nightingale",
                "video": false,
                "vote_average": 7.059,
                "vote_count": 616,
                "character": "Goodwin",
                "credit_id": "58c89147c3a3682d22001026",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Born in Fremantle, Western Australia, he started appearing in various TV shows from the age of 12. He received a scholarship to study acting at John Curtin College of the Arts and was accepted into the Western Australian Academy of Performing Arts straight out of high school.\n\nHe was nominated for an Australian Film Institute Award for his lead performance in Jewboy, a film that screened in Un Certain Regard at the Cannes Film Festival and the Discovery Section at the Sundance Film Festival.\n\nIn 2007 he was invited to join the Sydney Theatre Company Actor's Company where he played Prince Hal in War of the Roses opposite Cate Blanchett. He received a Helpmann Award and a Sydney Theatre Award for this performance. His other STC credits include Riflemind which was directed by Philip Seymour Hoffman, and Josef K in an adaption of The Trial.\n\nIn 2010 he played Richard III for the Melbourne Theatre Company. He received his second Helpmann Award and a Green Room Award for this performance. In 2011 he played Hamlet in a sellout season for the Melbourne Theatre Company.\n\n- IMDb Mini Biography By: SM",
        "birthday": "1980-07-27",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 59119,
        "imdb_id": "nm1191900",
        "known_for_department": "Acting",
        "name": "Ewen Leslie",
        "place_of_birth": "Fremantle, Western Australia",
        "popularity": 0.1804,
        "profile_path": "/mANm2VxOszTc4bkzBsxZpAB056c.jpg"
    }
}