{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ytclDXEffquvzjwNXbiYEU1b6F2.jpg",
                "genre_ids": [
                    28,
                    18
                ],
                "id": 4643,
                "original_language": "en",
                "original_title": "The Guardian",
                "overview": "A high school swim champion with a troubled past enrolls in the U.S. Coast Guard's 'A' School, where legendary rescue swimmer Ben Randall teaches him some hard lessons about loss, love, and self-sacrifice.",
                "popularity": 4.6544,
                "poster_path": "/zFhFjrckfmdb33VDeRykumMmebU.jpg",
                "release_date": "2006-09-28",
                "title": "The Guardian",
                "video": false,
                "vote_average": 7.136,
                "vote_count": 1579,
                "character": "Nick Zingaro",
                "credit_id": "5f4a665d04b5960035b60614",
                "order": 40
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Michael Rady (born August 20, 1981) is an American actor. He was born in Philadelphia and attended St. Joseph's Preparatory School, a Jesuit prep school in Philadelphia well-known for its excellent theatre program.\n\nRady made his acting debut in the feature film The Sisterhood of the Traveling Pants playing Kostas Dounas. He has appeared in other feature films with small parts including The Guardian. Rady also starred in the independent film InSearchOf.\n\nRady had a recurring role in the CBS summer series, Swingtown, playing philosophy teacher Doug Stephens. He appeared in the second season of Showtime's TV drama Sleeper Cell. Rady appeared as a guest star in two seasons of the ABC Family series Greek playing the Honors Polymer Science major and Honors Engineering Floor Resident Advisor Max Tyler. In 2009, he was cast in The CW series Melrose Place as Jonah Miller, an aspiring filmmaker.",
        "birthday": "1981-08-20",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 59177,
        "imdb_id": "nm1640279",
        "known_for_department": "Acting",
        "name": "Michael Rady",
        "place_of_birth": "Philadelphia, Pennsylvania, USA",
        "popularity": 0.7167,
        "profile_path": "/a702olRCFvJNVdrQkBKbeNkaAey.jpg"
    }
}