{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rl95VDEP3nsUQmGzE0S1S7y6T0N.jpg",
                "genre_ids": [
                    10752,
                    28
                ],
                "id": 190859,
                "original_language": "en",
                "original_title": "American Sniper",
                "overview": "U.S. Navy SEAL Chris Kyle takes his sole mission—protect his comrades—to heart and becomes one of the most lethal snipers in American history. His pinpoint accuracy not only saves countless lives but also makes him a prime target of insurgents. Despite grave danger and his struggle to be a good husband and father to his family back in the States, Kyle serves four tours of duty in Iraq. However, when he finally returns home, he finds that he cannot leave the war behind.",
                "popularity": 8.8358,
                "poster_path": "/i1U46OwMc6vlm7OoSUKfqUH615e.jpg",
                "release_date": "2014-12-25",
                "title": "American Sniper",
                "video": false,
                "vote_average": 7.418,
                "vote_count": 13265,
                "character": "Goat-Winston",
                "credit_id": "5430150cc3a36831ac000939",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/2ANHqBhbAhyIBRTLSVfENskpxon.jpg",
                "genre_ids": [
                    80,
                    27,
                    53
                ],
                "id": 1029281,
                "original_language": "en",
                "original_title": "Strange Darling",
                "overview": "Nothing is what it seems when a twisted one-night stand spirals into a serial killer’s vicious murder spree.",
                "popularity": 11.5644,
                "poster_path": "/kWNCRgt3ocv19bYO0sk7TRuZuFY.jpg",
                "release_date": "2024-08-14",
                "title": "Strange Darling",
                "video": false,
                "vote_average": 6.951,
                "vote_count": 702,
                "character": "The Demon",
                "credit_id": "63334c44d465370082a9c4e5",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "کایل گالنر"
        ],
        "biography": "Kyle Gallner (born October 22, 1986) is an American actor. He is best known for his work in the horror genre, starring in films such as Jennifer’s Body (2009), Smile (2022). Scream (also 2022), and Strange Darling (2024).  Originally from Philadelphia, Gallner made his first screen appearance on an episode of Third Watch (1999). After making his feature debut with a small role in Michael Showalter's bizarre comedy Wet Hot American Summer (2001), he returned to television with episodes of Law & Order: Special Victims Unit and Touched by an Angel. He next appeared in the series finale of The District (2000) before playing his first recognizable role - that of Bart Allen (a.k.a. \"The Flash\") on Smallville (2001) during the 2004-05 season.\n\nIn 2005, Gallner joined the cast of Veronica Mars (2004) for the last three episodes of the first season, giving him the opportunity to carry over his role of Beaver into the next season. During his run on \"Veronica Mars,\" Gallner continued making guest spots, appearing in episodes of Jack & Bobby (2004), Cold Case (2003), CSI: NY (2004) and Bones (2005). Gallner began a recurring role as a devout Mormon in the controversial HBO series Big Love (2006). Meanwhile, Gallner revived his \"Smallville\" role in early 2007, returning as Impulse rather than The Flash - due to a feature film with the same character being developed by Warner Bros. He Made his acting debut in an episode of NBC's Third Watch (1999). Made his film debut in the comedy cult film Wet Hot American Summer (2001). Had a recurring role as superhero Bart Allen in Smallville (2001) (The WB, 2001-2006; The CW, 2006-2009). Appeared in two episodes of The WB's Jack & Bobby (2004). Joined the cast of UPN s Veronica Mars as Cassidy Casablancas; became a regular during the show s second season. Had a recurring role as Reed Garrett, the son of Detective Taylor's (Gary Sinise) late wife on CSI: NY (CBS) and Played Jason Embry, best friend of Ben Henrickson, on the critically-acclaimed HBO drama Big Love.\n\nFeatured in the independent film Sublime. Appeared in three episodes of The Shield (FX). Had a supporting role in the Diablo Cody penned dark comedy Jennifer's Body. Played the lead role in the horror film The Haunting in Connecticut. Cast as the lead male, Quentin, in the remake of A Nightmare on Elm Street. Gallner has in his filmography acclaimed Independents films as Gardens of the Night (2008), Beautiful Boy (2010), Red State (2011), Little Birds (2011), Magic Valley (2011) and Smashed (2011). In 2013, Gallner appeared in the film Beautiful Creatures (2013), directed by Richard LaGravenese.",
        "birthday": "1986-10-22",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 59219,
        "imdb_id": "nm0973177",
        "known_for_department": "Acting",
        "name": "Kyle Gallner",
        "place_of_birth": "West Chester, Pennsylvania, USA",
        "popularity": 1.4291,
        "profile_path": "/wfdywrw6K3ti1uW1IYDWbUtU8se.jpg"
    }
}