{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/j9QaQVuyQIEwckUbjHpAgA7E4jJ.jpg",
                "genre_ids": [
                    80,
                    18,
                    53
                ],
                "id": 50348,
                "original_language": "en",
                "original_title": "The Lincoln Lawyer",
                "overview": "Mick Haller is a charismatic defense attorney who does business out of his Lincoln Continental sedan. Mick spends most of his time defending petty crooks and other bottom-feeders, so it comes as quite a surprise when he lands the case of a lifetime: defending a Beverly Hills playboy who is accused of attempted murder. However, what Mick initially thinks is an open-and-shut case with a big monetary reward develops into something more sinister.",
                "popularity": 4.9158,
                "poster_path": "/gOn8Ve9Yi8fxjRkmLr5BZoOc7KV.jpg",
                "release_date": "2011-03-17",
                "title": "The Lincoln Lawyer",
                "video": false,
                "vote_average": 7.196,
                "vote_count": 3436,
                "character": "Regina 'Reggie' Campo",
                "credit_id": "52fe47c4c3a36847f8147171",
                "order": 14
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "マルガリータ・レヴィエヴァ",
            "مارگاریتا لویوا"
        ],
        "biography": "Margarita Vladimirovna Levieva (born February 9, 1980) is an American actress.\n\nLevieva was born in Leningrad, Soviet Union (now Saint Petersburg, Russia), into a family of Russian Jewish descent. Both of her grandmothers, as children, survived the siege of Leningrad during World War II. From the age of three, she began to engage in rhythmic gymnastics.\n\nLevieva immigrated to the United States at age 11 with her mother and twin brother, Michael, and settled in Sheepshead Bay, Brooklyn. Though she was accepted into Laguardia High School to study dance, she instead attended public high school in Secaucus, New Jersey. In addition to working full-time as a fashion buyer, Levieva graduated a year early from New York University with a double major in economics and psychology and minors in philosophy, sociology, and Russian history. Levieva went on to complete the Meisner Acting Program at the William Esper Studio in New York.\n\nIn 2005, Levieva made a guest appearance on Law & Order: Trial by Jury, and in the following two years starred in the Fox series Vanished and feature films The Invisible, Billy's Choice, and Noise.\n\nLevieva starred in the 2019 independent film Inherit the Viper. Her other film credits include It Happened in L.A. (2017), The Diary of a Teenage Girl (2015), Sleeping with Other People (2015), James White (2015), For Ellen (2012), The Lincoln Lawyer (2011), Adventureland (2009), and Spread (2009).\n\nIn 2009, Levieva made an appearance in the NBC drama Kings (in the episode \"First Night\"), starred in the play The Retributionists, and made her Broadway debut in Impressionism. She also starred in the HBO comedy-drama series How to Make It in America.\n\nLevieva's television appearances include her series regular roles in the ABC drama series Revenge (2011–2015) and in the HBO series The Deuce (2016–2019). In The Deuce, Levieva played Abby Parker, an adventurous college student.\n\nLevieva stars as Jenny Franklin in the 2022 Netflix series In From the Cold. Jenny is a single mother from Cherry Hill, New Jersey, who, during a European vacation with her daughter, finds her life turned upside down when the CIA forces her to confront her long-buried past as a Russian spy, the product of a secret KGB experiment that endowed her with \"special abilities.\"\n\nShe was cast in the Star Wars spinoff series The Acolyte and is also set to star in the Marvel Cinematic Universe series Daredevil: Born Again as Heather Glenn, the love interest of Matt Murdock/Daredevil.\n\nLevieva announced that she was expecting a baby on Mother's Day in 2022. She revealed her baby is a boy on the next Mother's Day in 2023.\n\nDescription above from the Wikipedia article Margarita Levieva, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1980-02-09",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 59237,
        "imdb_id": "nm1760272",
        "known_for_department": "Acting",
        "name": "Margarita Levieva",
        "place_of_birth": "Leningrad, Russian SFSR, USSR [now St. Petersburg, Russia]",
        "popularity": 0.9067,
        "profile_path": "/7rSf7C5oKuvjgEBfe2GVv064Le.jpg"
    }
}