{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4zzWj2pVmkjN9yjsQesEEnNtlZ4.jpg",
                "genre_ids": [
                    28,
                    53,
                    80
                ],
                "id": 94329,
                "original_language": "id",
                "original_title": "Serbuan Maut",
                "overview": "Deep in the heart of Jakarta's slums lies an impenetrable safe house for the world's most dangerous killers and gangsters. Until now, the run-down apartment block has been considered untouchable to even the bravest of police. Cloaked under the cover of pre-dawn darkness and silence, an elite swat team is tasked with raiding the safe house in order to take down the notorious drug lord that runs it.  But when a chance encounter with a spotter blows their cover and news of their assault reaches the drug lord, the building's lights are cut and all the exits blocked. Stranded on the sixth floor with no way out, the unit must fight their way through the city's worst to survive their mission. Starring Indonesian martial arts sensation Iko Uwais.",
                "popularity": 3.9181,
                "poster_path": "/Abnm1Ws3JH0ReCfEhLMPwPcMcGO.jpg",
                "release_date": "2012-03-22",
                "title": "The Raid",
                "video": false,
                "vote_average": 7.405,
                "vote_count": 3642,
                "character": "Tama",
                "credit_id": "52fe49529251416c750c446b",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/wdwcOBMkt3zmPQuEMxB3FUtMio2.jpg",
                "genre_ids": [
                    12,
                    28,
                    878
                ],
                "id": 271110,
                "original_language": "en",
                "original_title": "Captain America: Civil War",
                "overview": "Following the events of Age of Ultron, the collective governments of the world pass an act designed to regulate all superhuman activity. This polarizes opinion amongst the Avengers, causing two factions to side with Iron Man or Captain America, which causes an epic battle between former allies.",
                "popularity": 12.4919,
                "poster_path": "/rAGiXaUfPzY7CDEyNKUofk3Kw2e.jpg",
                "release_date": "2016-04-27",
                "title": "Captain America: Civil War",
                "video": false,
                "vote_average": 7.448,
                "vote_count": 23406,
                "character": "Auctioneer (uncredited)",
                "credit_id": "554be7cec3a3685e58002f3e",
                "order": 99
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ferenc Raymond Sahetapy"
        ],
        "biography": "Ray Sahetapy (born on January 1, 1957 - April 1, 2025), was an Indonesian actor. A veteran actor in Indonesian cinema, Ray Sahetapy started his acting career in a movie called 'Gadis' (1980). Since then he has played in more than 50 films. During the heyday of Indonesian cinema in 1980s and early 1990s, Sahetapy was one of the most popular actors for his good looks and dramatic performance. Nominated seven times as best actor in Piala Citra, Indonesian equivalent of Oscar. He won the best actor in 1988 for his performance in Noesa Penida.",
        "birthday": "1957-01-01",
        "deathday": "2025-04-01",
        "gender": 2,
        "homepage": null,
        "id": 592495,
        "imdb_id": "nm1228805",
        "known_for_department": "Acting",
        "name": "Ray Sahetapy",
        "place_of_birth": "Donggala - Indonesia",
        "popularity": 0.233,
        "profile_path": "/gdUidZ0pNdk1WERTDKOGn9UWXPT.jpg"
    }
}