{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4zzWj2pVmkjN9yjsQesEEnNtlZ4.jpg",
                "genre_ids": [
                    28,
                    53,
                    80
                ],
                "id": 94329,
                "original_language": "id",
                "original_title": "Serbuan Maut",
                "overview": "Deep in the heart of Jakarta's slums lies an impenetrable safe house for the world's most dangerous killers and gangsters. Until now, the run-down apartment block has been considered untouchable to even the bravest of police. Cloaked under the cover of pre-dawn darkness and silence, an elite swat team is tasked with raiding the safe house in order to take down the notorious drug lord that runs it.  But when a chance encounter with a spotter blows their cover and news of their assault reaches the drug lord, the building's lights are cut and all the exits blocked. Stranded on the sixth floor with no way out, the unit must fight their way through the city's worst to survive their mission. Starring Indonesian martial arts sensation Iko Uwais.",
                "popularity": 3.9181,
                "poster_path": "/Abnm1Ws3JH0ReCfEhLMPwPcMcGO.jpg",
                "release_date": "2012-03-22",
                "title": "The Raid",
                "video": false,
                "vote_average": 7.405,
                "vote_count": 3643,
                "character": "Jaka",
                "credit_id": "52fe49529251416c750c4477",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/9uoZrTXUiByDECmWopkIJhZxSzw.jpg",
                "genre_ids": [
                    28,
                    80,
                    53
                ],
                "id": 449992,
                "original_language": "id",
                "original_title": "The Night Comes for Us",
                "overview": "After sparing a girl's life during a massacre, an elite Triad assassin is targeted by an onslaught of murderous gangsters.",
                "popularity": 5.3255,
                "poster_path": "/8lI1p5cPqgXN2qrKZrmI3mhKBfs.jpg",
                "release_date": "2018-10-05",
                "title": "The Night Comes for Us",
                "video": false,
                "vote_average": 6.886,
                "vote_count": 745,
                "character": "Ito",
                "credit_id": "58deb92d92514176b00029d2",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/6ELCZlTA5lGUops70hKdB83WJxH.jpg",
                "genre_ids": [
                    28,
                    14,
                    12
                ],
                "id": 460465,
                "original_language": "en",
                "original_title": "Mortal Kombat",
                "overview": "Washed-up MMA fighter Cole Young, unaware of his heritage, and hunted by Emperor Shang Tsung's best warrior, Sub-Zero, seeks out and trains with Earth's greatest champions as he prepares to stand against the enemies of Outworld in a high stakes battle for the universe.",
                "popularity": 7.9875,
                "poster_path": "/ybrX94xQm8lXYpZAPRmwD9iIbWP.jpg",
                "release_date": "2021-04-07",
                "title": "Mortal Kombat",
                "video": false,
                "vote_average": 7.011,
                "vote_count": 6064,
                "character": "Bi-Han / Sub-Zero",
                "credit_id": "5d25655714956500115ab63a",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Johannes Taslim",
            "조 타슬림",
            "جو تسلیم"
        ],
        "biography": "Johannes \"Joe\" Taslim (born on June 23, 1981, in Palembang, South Sumatra), is an Indonesian actor and martial artist of Chinese descent. A member of the Indonesia Judo national team from 1997 to 2009, Taslim is best known for his breakthrough role as \"Jaka\" in the critically acclaimed The Raid (2011). Later going on to play \"Jah\" in Fast & Furious 6 (2013), which marked his first role in a film outside Indonesia.\n\nFrom a young age, he studied various martial arts such as wushu, taekwondo, pencak silat, and judo, eventually choosing to focus on judo. Taslim was a member of Indonesia's national judo team from 1997 to 2009, achieving numerous accolades, including a gold medal at the 2008 National Sports Week and a silver medal at the 2007 SEA Games.\n\nAfter retiring from judo, Taslim transitioned to acting and gained international recognition through his role as Sergeant Jaka in the film The Raid (2011). This success led to roles in Hollywood films such as Fast & Furious 6 (2013) as Jah, Star Trek Beyond (2016) as Manas, and Mortal Kombat (2021) as Sub-Zero. He also starred in the television series Warrior as Li Yong.\n\nWith his strong martial arts background and impressive acting skills, Joe Taslim has become one of the few Indonesian actors to successfully break into the international film industry.",
        "birthday": "1981-06-23",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 592496,
        "imdb_id": "nm3029144",
        "known_for_department": "Acting",
        "name": "Joe Taslim",
        "place_of_birth": "Palembang, South Sumatra, Indonesia",
        "popularity": 0.5633,
        "profile_path": "/6S60RmKqa4p1HN0n4uaohNqjaU8.jpg"
    }
}