{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/k28lTv01nuncbs9Y2WZh6FQunqv.jpg",
                "genre_ids": [
                    18
                ],
                "id": 9909,
                "original_language": "en",
                "original_title": "Dangerous Minds",
                "overview": "Former Marine Louanne Johnson lands a gig teaching in a pilot program for bright but underachieving teens at a notorious inner-city high school. After having a terrible first day, she decides she must throw decorum to the wind. When Johnson returns to the classroom, she does so armed with a no-nonsense attitude informed by her military training and a fearless determination to better the lives of her students -- no matter what the cost.",
                "popularity": 3.4194,
                "poster_path": "/yWHWC8fJRp2kLgiFrEa8o3krOH9.jpg",
                "release_date": "1995-08-11",
                "title": "Dangerous Minds",
                "video": false,
                "vote_average": 6.979,
                "vote_count": 1201,
                "character": "Cornelius Bates",
                "credit_id": "63f4f800a24c501339e3409e",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/qKWQ9IEDkMawD7sgKnIGCdFAhct.jpg",
                "genre_ids": [
                    53,
                    28,
                    18,
                    10752
                ],
                "id": 8963,
                "original_language": "en",
                "original_title": "Crimson Tide",
                "overview": "After the Cold War, a breakaway Russian republic with nuclear warheads becomes a possible worldwide threat. U.S. submarine Capt. Frank Ramsey signs on a relatively green but highly recommended Lt. Cmdr. Ron Hunter to the USS Alabama, which may be the only ship able to stop a possible Armageddon. When Ramsey insists that the Alabama must act aggressively, Hunter, fearing they will start rather than stop a disaster, leads a potential mutiny to stop him.",
                "popularity": 4.8617,
                "poster_path": "/21nqRJ6ofEgVvEl68J4O9V26Xzy.jpg",
                "release_date": "1995-05-12",
                "title": "Crimson Tide",
                "video": false,
                "vote_average": 7.181,
                "vote_count": 1871,
                "character": "Lawson",
                "credit_id": "52fe44ccc3a36847f80aa841",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia.\n\nMarcello Thedford is an American film and television actor. His most noteworthy roles have been as Kelvin \"Buffalo\" James on the ESPN dramatic series Playmakers, Semi in Employee of the Month, and in eight episodes of ER as Leon, Dr. Greg Pratt's mentally challenged brother.\n\nThedford's acting career began in improvisational theater in New York City. He studied there at the Third World Theater at Black Drama Productions. His first significant role came in the film Dangerous Minds. He appeared in the television version of the film as well. Thedford has also appeared in NYPD Blue, The District, Veronica Mars, and Monk among others.\n\nThedford is a certified power lifter, holding a California state record. He grew up in the Bronx and currently resides in Los Angeles.\n\nKicking off his career in 2009, Thedford made a guest appearance on CW's The Game. In the guest starring role of Clay Smith, Thedford plays a professional football player who misreads the cordial signals of a fellow teammate and ultimately outs himself as being homosexual.\n\nDescription above from the Wikipedia article Marcello Thedford, licensed under CC-BY-SA, full list of contributors on Wikipedia",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 59300,
        "imdb_id": "nm0857304",
        "known_for_department": "Acting",
        "name": "Marcello Thedford",
        "place_of_birth": null,
        "popularity": 0.1629,
        "profile_path": "/1HBS0MlQgWvnAFBFthnUz5QfEft.jpg"
    }
}