{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/pR3v192B20nFtsHY1jZQS4AkN0a.jpg",
                "genre_ids": [
                    36,
                    53
                ],
                "id": 11973,
                "original_language": "en",
                "original_title": "Thirteen Days",
                "overview": "The story of the Cuban Missile Crisis in 1962—the nuclear standoff with the USSR sparked by the discovery by the Americans of missile bases established on the Soviet-allied island of Cuba.",
                "popularity": 4.8813,
                "poster_path": "/aLx9UXH9fK2v6NDMvMyW4X88K3u.jpg",
                "release_date": "2000-12-25",
                "title": "Thirteen Days",
                "video": false,
                "vote_average": 7.002,
                "vote_count": 787,
                "character": "Chilean Delegate",
                "credit_id": "5f4bd61c22f5d7003366f608",
                "order": 57
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Zitto Kaplanski"
        ],
        "biography": "Zitto Kazann was born in Buenos Aires, Argentina, where he studied at the Otto Krause University.\n\nFrom adolescence on he played professional basketball in the national league while at the same time performing in theatrical productions in Buenos Aires.\n\nThe theater soon became his paramount muse and he relocated to New York to pursue his promise.\n\nAfter studying on scholarship with Sanford Meisner at the Neighborhood Playhouse in addition to Uta Hagan and Stella Adler, Zitto found his home was the theater. He is presently attending the Master class with Milton Katselas in Los Angeles.\n\nZitto's credits include Broadway with Ingrid Bergman until film and TV lured him to Los Angeles where he appeared as a regular in two series. He never lost the love of theater, however, and appeared in numerous productions where he received two drama-logue awards, a Los Angeles Critics Award and a resounding review in the L.A. Times.",
        "birthday": "1944-09-01",
        "deathday": "2021-02-05",
        "gender": 2,
        "homepage": null,
        "id": 59352,
        "imdb_id": "nm0443601",
        "known_for_department": "Acting",
        "name": "Zitto Kazann",
        "place_of_birth": "Buenos Aires, Argentina",
        "popularity": 0.1266,
        "profile_path": null
    }
}