{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/hnWBg0qgYa7LxVnTdVYUbAPLctc.jpg",
                "genre_ids": [
                    18,
                    80,
                    53
                ],
                "id": 376290,
                "original_language": "en",
                "original_title": "Miss Sloane",
                "overview": "An ambitious lobbyist faces off against the powerful gun lobby in an attempt to pass gun control legislation.",
                "popularity": 4.1171,
                "poster_path": "/ptfvQlqe2xJiMSewSj52qAVq5z0.jpg",
                "release_date": "2016-11-25",
                "title": "Miss Sloane",
                "video": false,
                "vote_average": 7.422,
                "vote_count": 1895,
                "character": "Lauren",
                "credit_id": "584f7c05c3a3682e4300396a",
                "order": 16
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Grace Kung"
        ],
        "biography": "Grace Lynn Kung (born March 25, 1987) is a Canadian actress. She received a Canadian Screen Award nomination for the spy series InSecurity as Jojo Kwan.\n\nKung holds two certificates of distinction from Trinity College London in the United Kingdom, where she also studied naturopathic medicine. She has appeared in Fahrenheit 451, Star Trek: Discovery, Miss Sloane, and Designated Survivor.\n\nScreen credits include The Expanse, The Strain, Being Erica, Away From Her, Slings & Arrows, Odd Squad, House Party, and Cube 2: Hypercube. On stage, she has performed The Vagina Monologues in Oranjestad, Aruba, as Janet in the award-winning play Kim's Convenience, Izzy in Seminar by Theresa Rebeck, Zoe/The Girl in La Ronde, Yuko in Yukonstyle at Canadian Stage Company, collaborating with Judith Thompson on her new works and playing writer-historian Iris Chang in the international debut of A Nanking Winter by Marjorie Chan at Nightwood Theatre, a theatre specialising in forging creative alliances among female artists.",
        "birthday": "1987-03-25",
        "deathday": null,
        "gender": 1,
        "homepage": "http://ggagency.ca/kung",
        "id": 5939,
        "imdb_id": "nm0475129",
        "known_for_department": "Acting",
        "name": "Grace Lynn Kung",
        "place_of_birth": "Ottawa, Ontario, Canada",
        "popularity": 0.8115,
        "profile_path": "/4iJEk5nwNOQGLOmLOHizvw5rorM.jpg"
    }
}