{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bu0LiPEWKHWViRoaFwlTAzZ8wyS.jpg",
                "genre_ids": [
                    35,
                    28,
                    12
                ],
                "id": 203801,
                "original_language": "en",
                "original_title": "The Man from U.N.C.L.E.",
                "overview": "At the height of the Cold War, a mysterious criminal organization plans to use nuclear weapons and technology to upset the fragile balance of power between the United States and Soviet Union. CIA agent Napoleon Solo and KGB agent Illya Kuryakin are forced to put aside their hostilities and work together to stop the evildoers in their tracks. The duo's only lead is the daughter of a missing German scientist, whom they must find soon to prevent a global catastrophe.",
                "popularity": 6.0136,
                "poster_path": "/y5yZaForGSJbPD66Cvq9AT5WMAD.jpg",
                "release_date": "2015-08-13",
                "title": "The Man from U.N.C.L.E.",
                "video": false,
                "vote_average": 7.084,
                "vote_count": 6558,
                "character": "Projectionist",
                "credit_id": "5633f655c3a3681b61016693",
                "order": 22
            },
            {
                "adult": false,
                "backdrop_path": "/qPlAgjG4xy7utjf5L14FZ8kaiWl.jpg",
                "genre_ids": [
                    99
                ],
                "id": 691179,
                "original_language": "en",
                "original_title": "Friends: The Reunion",
                "overview": "The cast of Friends reunites for a once-in-a-lifetime celebration of the hit series, an unforgettable evening filled with iconic memories, uncontrollable laughter, happy tears, and special guests.",
                "popularity": 2.7715,
                "poster_path": "/bT3c4TSOP8vBmMoXZRDPTII6eDa.jpg",
                "release_date": "2021-05-27",
                "title": "Friends: The Reunion",
                "video": false,
                "vote_average": 7.9,
                "vote_count": 1262,
                "character": "Self",
                "credit_id": "609d66932222f6006fe8ab30",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "David Robert Joseph Beckham",
            "دیوید بکام"
        ],
        "biography": "David Robert Joseph Beckham (born 2 May 1975) is an English former professional footballer. He played for Manchester United, Preston North End (on loan), Real Madrid, AC Milan (on loan), LA Galaxy, Paris Saint-Germain and the England national team, for which he held the appearance record for an outfield player until 2016. He is the first English player to win league titles in four countries: England, Spain, the United States and France. He retired in May 2013 after a 20-year career, during which he won 19 major trophies.\n\nBeckham's professional club career began with Manchester United, where he made his first-team debut in 1992 at age 17. With United, he won the Premier League title six times, the FA Cup twice, and the UEFA Champions League in 1999. He then played four seasons with Real Madrid, winning the La Liga championship in his final season with the club. In July 2007, Beckham signed a five-year contract with Major League Soccer club LA Galaxy. While a Galaxy player, he spent two loan spells in Italy with Milan in 2009 and 2010. He was the first British footballer to play 100 UEFA Champions League games. In international football, Beckham made his England debut on 1 September 1996 at the age of 21. He was captain for six years, earning 58 caps during his tenure. He made 115 career appearances in total, appearing at three FIFA World Cup tournaments, in 1998, 2002 and 2006, and two UEFA European Championship tournaments, in 2000 and 2004.\n\nKnown for his range of passing, crossing ability and bending free-kicks as a right winger, Beckham has been hailed as one of the greatest and most recognisable midfielders of his generation, as well as one of the best set-piece specialists of all time. He was runner-up in the Ballon d'Or in 1999, twice runner-up for FIFA World Player of the Year (1999 and 2001) and in 2004 was named by Pelé in the FIFA 100 list of the world's greatest living players. He was inducted into the English Football Hall of Fame in 2008 and the Premier League Hall of Fame in 2021. A global ambassador of the sport, Beckham is regarded as a British cultural icon.\n\nBeckham has consistently ranked among the highest earners in football, and in 2013 was listed as the highest-paid player in the world, having earned over $50 million in the previous 12 months. He has been married to Victoria Beckham since 1999 and they have four children. He has been a UNICEF UK ambassador since 2005, and in 2015 he launched 7: The David Beckham UNICEF Fund. In 2014, MLS announced that Beckham and a group of investors would own Inter Miami CF, which began play in 2020.\n\nFrom Wikipedia, the free encyclopedia.",
        "birthday": "1975-05-02",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.davidbeckham.com/",
        "id": 59538,
        "imdb_id": "nm0065743",
        "known_for_department": "Acting",
        "name": "David Beckham",
        "place_of_birth": "Leytonstone, London, England, UK",
        "popularity": 1.2778,
        "profile_path": "/9MOY95jds58WtvEwUTYZgXlTVr0.jpg"
    }
}