{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/11V6JMreBokxvTZTsxmSQsibaRb.jpg",
                "genre_ids": [
                    28,
                    80,
                    53
                ],
                "id": 13809,
                "original_language": "en",
                "original_title": "RocknRolla",
                "overview": "When a Russian mobster sets up a real estate scam that generates millions of pounds, various members of London's criminal underworld pursue their share of the fortune. Various shady characters, including Mr One-Two, Stella the accountant, and Johnny Quid, a druggie rock-star, try to claim their slice.",
                "popularity": 2.6066,
                "poster_path": "/i7eyngqjdvKB7NvrWtCjjTNNq8N.jpg",
                "release_date": "2008-09-04",
                "title": "RocknRolla",
                "video": false,
                "vote_average": 6.95,
                "vote_count": 3095,
                "character": "June",
                "credit_id": "52fe45a49251416c7505d643",
                "order": 16
            },
            {
                "adult": false,
                "backdrop_path": "/vZS0CQBaxj1CPFWTICXLXMJbb3o.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 18947,
                "original_language": "en",
                "original_title": "The Boat That Rocked",
                "overview": "When a group of rebellious deejays decides to defy the ban on government-censored music, they take to the seas to broadcast music and mayhem to millions of adoring fans.",
                "popularity": 4.2744,
                "poster_path": "/l7CBRLAXUnHi0kp2krhLtlJvtWI.jpg",
                "release_date": "2009-04-01",
                "title": "The Boat That Rocked",
                "video": false,
                "vote_average": 7.226,
                "vote_count": 2195,
                "character": "Desiree",
                "credit_id": "52fe47ad9251416c750a1d43",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Gemma Christina Arterton",
            "젬마 아터튼",
            "جما آرترتون"
        ],
        "biography": "Gemma Christina Arterton (born 2 February 1986) is an English actress and producer. After her stage debut in Shakespeare's Love's Labour's Lost at the Globe Theatre (2007), Arterton made her feature film debut in the comedy St Trinian's (2007). She portrayed Bond Girl Strawberry Fields in the James Bond film Quantum of Solace (2008), a performance which won her an Empire Award for Best Newcomer.\n\nArterton has since appeared in a number of films, including The Disappearance of Alice Creed (2009), Tamara Drewe (2010), Clash of the Titans (2010), Prince of Persia: The Sands of Time (2010), Hansel & Gretel: Witch Hunters (2013), Their Finest (2016), The Escape (2017), and Vita and Virginia (2018). She received the Harper's Bazaar Woman of the Year Award for acting in and producing The Escape. Her theatrical highlights have included starring in The Duchess of Malfi (2014), Made in Dagenham (2014), Nell Gwynn (2016) and Saint Joan (2017). Arterton was nominated for Olivier Awards for her work on both Nell Gwynn and Made in Dagenham, and she won the Evening Standard Theatre Award for the latter.\n\nSince 2016, Arterton has run her own production company, Rebel Park Productions, which focuses on creating female-led content in front of and behind the camera. She has executive-produced four feature films and two short films. She is also on record as being a supporter of the Time's Up, ERA 50:50 and MeToo movements. Arterton played an integral role in persuading actresses to wear black at the 2018 BAFTAs in support of Time'sUp, and has been involved with ERA 50:50, an equal pay campaign in the UK, since its inception.",
        "birthday": "1986-02-02",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 59620,
        "imdb_id": "nm2605345",
        "known_for_department": "Acting",
        "name": "Gemma Arterton",
        "place_of_birth": "Gravesend, Kent, England, UK",
        "popularity": 1.9261,
        "profile_path": "/Alfm28oyHNiYweNCUaMmrVjVMAT.jpg"
    }
}