{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/myikoqu8Z2gtE7TaBgk9r6fB9MF.jpg",
                "genre_ids": [
                    18
                ],
                "id": 1040,
                "original_language": "it",
                "original_title": "Il gattopardo",
                "overview": "As Garibaldi's troops begin the unification of Italy in the 1860s, an aristocratic Sicilian family grudgingly adapts to the sweeping social changes undermining their way of life. Proud but pragmatic Prince Don Fabrizio Salina allows his war hero nephew, Tancredi, to marry Angelica, the beautiful daughter of gauche, bourgeois Don Calogero, in order to maintain the family's accustomed level of comfort and political clout.",
                "popularity": 3.1711,
                "poster_path": "/riSUxwoK3xjkOgy6YJSvPhi7cO6.jpg",
                "release_date": "1963-03-27",
                "title": "The Leopard",
                "video": false,
                "vote_average": 7.751,
                "vote_count": 886,
                "character": "Carolina",
                "credit_id": "5a43ca37c3a3685916054f35",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/uaEfEkb2tjl4hN1oaSyzcxt4cEg.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 439,
                "original_language": "it",
                "original_title": "La dolce vita",
                "overview": "Episodic journey of journalist Marcello who struggles to find his place in the world, torn between the allure of Rome's elite social scene and the stifling domesticity offered by his girlfriend, all the while searching for a way to become a serious writer.",
                "popularity": 4.2869,
                "poster_path": "/2KU52apQyvyZuPsqEGMcWb4BKu2.jpg",
                "release_date": "1960-02-05",
                "title": "La Dolce Vita",
                "video": false,
                "vote_average": 8.066,
                "vote_count": 1955,
                "character": "Debutante of the year",
                "credit_id": "5e9932270582240013af9472",
                "order": 10
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Evelyn Stewart",
            " Ariana Galli",
            "Arianna Heston",
            "Isli Oberon",
            "Priscila Steele ",
            "Eveline Stewart",
            "Ewelyn Stewart",
            "Eveline Sthewart",
            "Arianna Galli"
        ],
        "biography": "Ida Galli, also known by the pseudonym Evelyn Stewart (Sestola, October 8, 1939), is an Italian actress, active between 1959 and 1990.\n\nShe also used the pseudonyms Arianna Galli (in her debut film Nel blu dipinto di blu) and Isli Oberon (in La frusta e il corpo).\n\nShe moved while still young to Rome where she earned her master's degree, intending to pursue a teaching career, not at all interested in film. Her debut came thanks to a chance meeting with French actor Gérard Landry, who in 1959 enabled her to get a small part in the musicarello film Nel blu dipinto di blu.\n\nLater, in the 1960s and 1970s, she was employed as a character actress in numerous films, ranging from art-house to genre cinema, including Federico Fellini's La dolce vita, Luchino Visconti's Il Gattopardo, and Antonio Pietrangeli's Fantasmi a Roma, followed by spaghetti westerns, peplums, horror films, poliziotteschi and Italian-style erotic comedies.\n\nIn 1965, in the film Un dollaro bucato, she was first credited with the pseudonym Evelyn Stewart, later used in two of her best-known appearances, Il medico della mutua and its sequel, alongside Alberto Sordi. She appeared in more than sixty films until 1990, when she ended her film experience",
        "birthday": "1939-03-09",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 5969,
        "imdb_id": "nm0302837",
        "known_for_department": "Acting",
        "name": "Ida Galli",
        "place_of_birth": "Sestola, Emilia-Romagna, Italy",
        "popularity": 0.6178,
        "profile_path": "/9iUgC8Z10IIxGUd1ozoNcy7zYvp.jpg"
    }
}