{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fGBJEfGjHmhg7nLAT0Jkcv9qV5e.jpg",
                "genre_ids": [
                    18,
                    35,
                    10749
                ],
                "id": 43347,
                "original_language": "en",
                "original_title": "Love & Other Drugs",
                "overview": "Maggie is an alluring free spirit who won't let anyone – or anything – tie her down. But she meets her match in Jamie, whose relentless and nearly infallible charm serves him well with the ladies and the cutthroat world of pharmaceutical sales. Maggie and Jamie's evolving relationship takes them both by surprise, as they find themselves under the influence of the ultimate drug: love.",
                "popularity": 9.7053,
                "poster_path": "/wZLM2uKJRYNchLmiCIjosX0rXy8.jpg",
                "release_date": "2010-11-04",
                "title": "Love & Other Drugs",
                "video": false,
                "vote_average": 7.043,
                "vote_count": 5367,
                "character": "Christy",
                "credit_id": "52fe4640c3a36847f80f4abf",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia.\n\nAshlee Nicole \"Nikki\" DeLoach (born September 9, 1979) is an American actress and singer.  DeLoach was born in Waycross, Georgia. She is the eldest of three children of Terri, Pierce County School superintendent and David DeLoach, an owner of a wood products company. Her sister LeAnne is a Valdosta State University graduate in education and her brother Brett is a baseball player for the University of Georgia. They grew up on a farm. As a child, she was heavily involved in the pageant world, winning numerous state and national titles. DeLoach secured an agent for modeling at a young age and landed several jobs for print ad modeling. She and her mother spent one summer in New York City to pursue modeling jobs. DeLoach was a member of the Georgia 4-H Performing Arts group Clovers & Company from 1991 to 1994.\n\nDescription above from the Wikipedia article Nikki DeLoach, licensed under CC-BY-SA, full list of contributors on Wikipedia​",
        "birthday": "1979-09-09",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 59750,
        "imdb_id": "nm0217645",
        "known_for_department": "Acting",
        "name": "Nikki DeLoach",
        "place_of_birth": "Waycross, Georgia, U.S.",
        "popularity": 0.5731,
        "profile_path": "/dGL9llK6Q0rBrMJecmP36bZjdDp.jpg"
    }
}