{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/4JuoO0XywrCDeHLy4kTB9FU5U2C.jpg",
                "genre_ids": [
                    18
                ],
                "id": 265169,
                "original_language": "tr",
                "original_title": "Kış Uykusu",
                "overview": "Aydın is a hotel owner and a retired actor in rural Turkey. As winter emerges he begins navigating the conflicts within the relationships with his wife, sister and existence.",
                "popularity": 1.1256,
                "poster_path": "/95j83qOqH3Ivz4RYkaSjGT0VSNr.jpg",
                "release_date": "2014-06-13",
                "title": "Winter Sleep",
                "video": false,
                "vote_average": 7.537,
                "vote_count": 585,
                "character": "Necla",
                "credit_id": "534fc6380e0a267ea8000d7d",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Demet İybar",
            "Demet Akbağ",
            "Demet Akbag"
        ],
        "biography": "Demet Akbağ (born 23 December 1959) is a Turkish theatre and film actress.\n\nDemet Akbağ was born in Denizli as the third child of Benan and Oktay İybar. Her maternal family is of Turkmen descent. Her paternal family is of Kurdish descent. Her father's religion is Alevism. His family was in Denizli at the time because of the duty of his grandfather as the head of justice department in the city. Her father was a journalist and photographer. She has two elder siblings, Sedef and Kemal. As her parents separated when she was 13, she and her mother and grandmother moved to Istanbul in 1972.\n\nShe later enrolled in the Istanbul Girls High School, and as her parents got separated she started attending the Erenköy Girls High School and finished her education there. After finishing high school in 1982, she entered Istanbul Municipal Conservatory and completed school in four years. Her first marriage, when she was 21, lasted four years. She started her professional career first in theatre in the early 1980s and then in television from 1987 onwards. That same year, she was chosen as the TV Star of The Year by Turkey's Association of Magazine Reporters.\n\nAkbağ has been awarded with numerous prizes, including the Golden and Sadri Alisik Best Character Actor for her role in Vizontele, the Afife Jale Best Female Actor for Sen Hiç Ateşböceği Gördün mü?, the Golden Butterfly for Tersine Dünya in 1993, the Ismail Dumbullu (the first actress to get this prize after Suna Pekuysal) in 1995, the Golden Butterfly – Best Comedy Star of The Year in 1996, 1997 and 1998, and the MGD-Comedy Artist Award in both 1996 and 1997. She has also worked with the BKM Actors since their career starts and performed various leading roles in television including Bir Demet Tiyatro and Ölümsüz Aşk, in theatrical plays including Otogargara, Sen Hiç Ateşböceği Gördün mü?, and Bana Bir Şeyler Oluyor, as well as in movies including Where's Firuze?, Eyyvah Eyvah, Eyyvah Eyvah 2, and Eyyvah Eyvah 3. She played in \"Kış Uykusu\" which won Cannes Award, with Haluk Bilginer for many times.",
        "birthday": "1959-12-23",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 59754,
        "imdb_id": "nm0015130",
        "known_for_department": "Acting",
        "name": "Demet Akbağ",
        "place_of_birth": "Denizli, Turkey",
        "popularity": 0.8409,
        "profile_path": "/eGuozRn0wfZlzxVBlLigT0yI8Zh.jpg"
    }
}