{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/1hdorswm5HPxb81xq84H9gqveUq.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 371638,
                "original_language": "en",
                "original_title": "The Disaster Artist",
                "overview": "An aspiring actor in Hollywood meets an enigmatic stranger by the name of Tommy Wiseau, the meeting leads the actor down a path nobody could have predicted; creating the worst movie ever made.",
                "popularity": 2.3925,
                "poster_path": "/2HuLGiyH0TPYxnCvYHAxc8K738o.jpg",
                "release_date": "2017-03-12",
                "title": "The Disaster Artist",
                "video": false,
                "vote_average": 7.107,
                "vote_count": 3619,
                "character": "Raphael",
                "credit_id": "589b54e9c3a3680c6b0001ac",
                "order": 6
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Paul Christian Scheer"
        ],
        "biography": "Paul Christian Scheer was born in Huntington, New York, on January 31, 1976. He attended St. Anthony's High School in Huntington, and then went on to study communication and education at New York University.\n\nAfter graduating from NYU, Scheer began his comedy career with the Upright Citizens Brigade, a sketch comedy troupe based in New York City. He also began appearing in television and film roles, including a recurring role on the MTV sketch comedy series Human Giant.\n\nIn 2009, Scheer co-created and starred in the Adult Swim comedy series NTSF:SD:SUV::. The show ran for three seasons and was a critical and commercial success. Scheer also co-created and starred in the FX/FXX comedy series The League, which ran for seven seasons.\n\nIn addition to his television work, Scheer has also had a successful film career. He has appeared in films such as The Hangover, The Disaster Artist, and The Lego Movie 2. He is also a co-host of the popular podcast How Did This Get Made?, which discusses bad movies.\n\nScheer is married to actress June Diane Raphael, and they have two sons. He is a frequent collaborator with his wife and longtime friend Jason Mantzoukas.\n\nScheer is 5 feet 10 inches (1.78 meters) tall.",
        "birthday": "1976-01-31",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.paulscheer.com/",
        "id": 59843,
        "imdb_id": "nm1179677",
        "known_for_department": "Acting",
        "name": "Paul Scheer",
        "place_of_birth": "Huntington, New York, USA",
        "popularity": 0.3975,
        "profile_path": "/76c6ieidSECRslxVX4ZA5WBdz40.jpg"
    }
}