{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/nvxrQQspxmSblCYDtvDAbVFX8Jt.jpg",
                "genre_ids": [
                    35,
                    878
                ],
                "id": 646380,
                "original_language": "en",
                "original_title": "Don't Look Up",
                "overview": "Two astronomers go on a media tour to warn humankind of a planet-killing comet hurtling toward Earth. The response from a distracted world: Meh.",
                "popularity": 8.3244,
                "poster_path": "/th4E1yqsE8DGpAseLiUrI60Hf8V.jpg",
                "release_date": "2021-12-08",
                "title": "Don't Look Up",
                "video": false,
                "vote_average": 7.068,
                "vote_count": 8788,
                "character": "Meow Man",
                "credit_id": "61c9e92bb6c26400610c36b2",
                "order": 59
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "​From Wikipedia, the free encyclopedia.\n\nJonathan Daniel \"Jon\" Glaser (born June 20, 1968) is an American actor, comedian and television writer based out of New York City. He is best known for his work as a writer and sketch performer for many years on Late Night with Conan O'Brien, as well as for creating and starring in the Adult Swim series Delocated. He currently appears with the recurring role as Leslie Knope's rival, Councilman Jamm on the NBC series Parks and Recreation.\n\nLife and career\n\nGlaser was born in Chicago, Illinois on June 20, 1968, but was raised in Southfield, Michigan. Glaser is a graduate of the University of Michigan, where he performed in the sketch comedy troupes Comedy Company and Just Kidding with Jon Hein, he is a five-time Emmy nominee with the writing staff of Late Night with Conan O'Brien. He has appeared in the movies Pootie Tang, School for Scoundrels, and Be Kind Rewind, and he has guest-starred on comedy programs such as Curb Your Enthusiasm, Wonder Showzen, Bob's Burgers and Aqua Teen Hunger Force. He was also a lead voice actor in several animated comedy programs such as Stroker and Hoop, Freak Show, and Lucy the Daughter of The Devil. In 2012, he began a recurring role as Leslie Knope's rival, Councilman Jeremy Jamm in the fifth and sixth seasons of the NBC sitcom Parks and Recreation.\n\nGlaser is the creator and star of the live-action Adult Swim series Delocated, about \"Jon\", a man in the witness protection program with his own reality show. The show aired its final episode on March 7, 2013. Glaser's Delocated character, \"Jon\" was also featured as a DJ on an Adult Swim-themed radio station in the video game Saints Row: The Third.[1] In February 2012, Glaser appeared as the spokesman in a series of Subway commercials playing his Delocated character.\n\nGlaser was a member of the mainstage cast of The Second City during the mid-1990s, performing alongside future Saturday Night Live head writer Adam McKay and cast member Rachel Dratch, as well as future Mr. Show and 30 Rock cast member Scott Adsit. In Second City's award-winning revue Pinata Full of Bees, which was directed by Tom Gianas, Glaser sang about the importance of not betraying a friendship by pretending not to have legs in order to play in a wheelchair basketball league. He also provided musical accompaniment for the show's climax by drumming in a demonic pig mask, and appeared onstage throughout the show to pass judgement on audience members for laughing at jokes he considered socially irresponsible.\n\nGlaser's first published book My Dead Dad Was in ZZ Top, was released on February 8, 2011.",
        "birthday": "1968-06-20",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 59842,
        "imdb_id": "nm0321835",
        "known_for_department": "Acting",
        "name": "Jon Glaser",
        "place_of_birth": "Chicago, Illinois, USA",
        "popularity": 0.3498,
        "profile_path": "/wJW4JrjHUo8SAptqlsfK3yZkBrx.jpg"
    }
}