{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6zfPDvqeZUleXjNaU5iWQwHUtCN.jpg",
                "genre_ids": [
                    35,
                    80
                ],
                "id": 11382,
                "original_language": "en",
                "original_title": "Bullets Over Broadway",
                "overview": "After young playwright, David Shayne obtains funding for his play from gangster Nick Valenti, Nick's girlfriend Olive miraculously lands the role of a psychiatrist—but not only is she a bimbo who could never pass for a psychiatrist—she's a dreadful actress. David puts up with the leading man who is a compulsive eater, the grand dame who wants her part jazzed up, and Olive's interfering hitman/bodyguard—but, eventually he must decide whether art or life is more important.",
                "popularity": 4.0417,
                "poster_path": "/mY9D1oCLeDKNMdUO8EV7MoCZ3up.jpg",
                "release_date": "1994-10-14",
                "title": "Bullets Over Broadway",
                "video": false,
                "vote_average": 7.088,
                "vote_count": 640,
                "character": "Nick Valenti",
                "credit_id": "52fe44359251416c7502c90f",
                "order": 7
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Joseph \"Joe\" Viterelli (March 10, 1937 – January 28, 2004) was an Italian American actor known for his mafioso-orientated character roles.\n\nJoe Viterelli was born to Italian immigrants in Bronx, New York. Before Viterelli became an actor, he was a successful businessman in New York City. He had befriended director Leo Penn (actor Sean Penn's father), who initially tried but failed to persuade Viterelli to pursue acting because of his unique and typically Italian looks. Some years later, Sean Penn approached Viterelli and asked him to try out for a part as a favor: Viterelli did and went on to appear in State of Grace and then in over 40 movies. Joe Viterelli became an icon of Mafia-Movies.\n\nViterelli died on January 28, 2004 in Las Vegas, Nevada due to a severe stomach hemorrhage, a complication of just-completed heart surgery. He was 66 years old. His last role was as a mobster in a 2004 Super Bowl ad for Staples, Inc. and his last movie role was as Jelly in Harold Ramis’ Analyze That.",
        "birthday": "1937-03-10",
        "deathday": "2004-01-28",
        "gender": 2,
        "homepage": null,
        "id": 60023,
        "imdb_id": "nm0899995",
        "known_for_department": "Acting",
        "name": "Joe Viterelli",
        "place_of_birth": "New York, USA",
        "popularity": 2.061,
        "profile_path": "/bWltEIjQhNxdjMEa4nglDLKCk8G.jpg"
    }
}