{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/aHcNu3tYihvkL45CrXTFY4YfrfF.jpg",
                "genre_ids": [
                    18,
                    35
                ],
                "id": 429197,
                "original_language": "en",
                "original_title": "Vice",
                "overview": "George W. Bush picks Dick Cheney, the CEO of Halliburton Co., to be his Republican running mate in the 2000 presidential election. No stranger to politics, Cheney's impressive résumé includes stints as White House chief of staff, House Minority Whip and Defense Secretary. When Bush wins by a narrow margin, Cheney begins to use his newfound power to help reshape the country and the world.",
                "popularity": 3.519,
                "poster_path": "/1gCab6rNv1r6V64cwsU4oEr649Y.jpg",
                "release_date": "2018-12-25",
                "title": "Vice",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 3454,
                "character": "Jay Bybee",
                "credit_id": "62e6811d813cb6005a32014f",
                "order": 67
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Growing up in Canada, Brandon showed an early interest in the constant rejection, unpredictable income, and general anxiety disorder that only the acting profession could provide. Resilience, hard work, and sheer narcissism landed him roles on Canadian sitcoms Billable Hours, Little Mosque on the Prairie, and other shows that have gone on to relative obscurity and irrelevance. Upon moving from Toronto to Los Angeles, Brandon was cast as Jonathan Sidwell in Suits - which conveniently shot in Toronto. When not on set, Brandon spends his free time thinking about why he's not on set more, and contemplates what he can do to his physical appearance to get back on set. During these periods of intense self-loathing, he writes and performs comedy with his brother. Together, the brothers wrote and directed the award-winning satirical musicals SARSical and An Inconvenient Musical. Brandon is a graduate of the London Academy of Music and Dramatic Art.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 60096,
        "imdb_id": "nm1410886",
        "known_for_department": "Acting",
        "name": "Brandon Firla",
        "place_of_birth": "Calgary, Alberta, Canada",
        "popularity": 0.2472,
        "profile_path": "/5GdvNqFcDb6qgKwqhWrnp4NFht7.jpg"
    }
}