{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/9BBTo63ANSmhC4e6r62OJFuK2GL.jpg",
                "genre_ids": [
                    878,
                    28,
                    12
                ],
                "id": 24428,
                "original_language": "en",
                "original_title": "The Avengers",
                "overview": "When an unexpected enemy emerges and threatens global safety and security, Nick Fury, director of the international peacekeeping agency known as S.H.I.E.L.D., finds himself in need of a team to pull the world back from the brink of disaster. Spanning the globe, a daring recruitment effort begins!",
                "popularity": 42.9973,
                "poster_path": "/RYMX2wcKCBAr24UyPD7xwmjaTn.jpg",
                "release_date": "2012-04-25",
                "title": "The Avengers",
                "video": false,
                "vote_average": 7.805,
                "vote_count": 33057,
                "character": "NASA Scientist",
                "credit_id": "55872353c3a36827460064e8",
                "order": 14
            },
            {
                "adult": false,
                "backdrop_path": "/lrNKm3HNvGdZoAfiBKu7b04FLHN.jpg",
                "genre_ids": [
                    18
                ],
                "id": 316029,
                "original_language": "en",
                "original_title": "The Greatest Showman",
                "overview": "The story of American showman P.T. Barnum, founder of the circus that became the famous traveling Ringling Bros. and Barnum & Bailey Circus.",
                "popularity": 8.3227,
                "poster_path": "/b9CeobiihCx1uG1tpw8hXmpi7nm.jpg",
                "release_date": "2017-12-20",
                "title": "The Greatest Showman",
                "video": false,
                "vote_average": 7.872,
                "vote_count": 9739,
                "character": "Mrs. Winthrop",
                "credit_id": "5ac706be0e0a26497a01ff10",
                "order": 24
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "A highly regarded performer on the New York and national stages, Tina Benko also enjoyed regular work in films and on television, most notably in a starring role on \"Flesh and Bone\" (Starz, 2015).The Pittsburgh, PA native received her training at Carnegie Mellon and made her screen debut in Stephen Gyllenhaal's drama \"Waterland\" in 1992. Benko logged minor roles in features and on television throughout the 1990s while also appearing regularly on stage, both as an understudy in Broadway productions like \"The Real Thing\" (2000) and \"A Day in the Death of Joe Egg\" (2003) and in more substantive roles Off Broadway and at the Williamstown Theatre Festival. In 2006, she enjoyed a recurring role as Kath Parry, a former flame of Irish gangster Michael Caffee (Jason Isaacs) on \"Brotherhood\" (Showtime, 2006-2008), which led to supporting and guest appearances on episodic dramas like \"Law & Order\" (NBC, 1990-2010) and roles in major features like \"The Avengers\" (2012). Her stage roles, too, grew in stature, and by 2011, she was starring in an international touring production of Toni Morrison's \"Desdemona\" (2011) directed by Peter Sellars and earning critical praise as Titania in Julie Taylor's 2013 production of \"A Midsummer Night's Dream,\" which was filmed for a 2014 theatrical release. In 2013, Benko also earned a Lucille Lortel Award nomination for playing Jacqueline Kennedy Onassis in Elfriede Jellinek's solo play \"Jackie,\" and by the following year, had transitioned into a busy character actress, with two or three film or television credits to her name each year. Chief among these was a minor role in Woody Allen's \"Irrational Man\" (2015) and a turn as a series regular on \"Flesh and Bone,\" Starz's drama set in the ballet world. Benko played Jessica, a former dancer who returns to her former ballet company to serve as its manager.",
        "birthday": "1972-09-01",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.hbstudio.org/instructors/benko-tina/",
        "id": 60120,
        "imdb_id": "nm0071416",
        "known_for_department": "Acting",
        "name": "Tina Benko",
        "place_of_birth": "Pittsburgh, Pennsylvania, USA",
        "popularity": 0.2294,
        "profile_path": "/oThs7WpSLtjrlDis1nu93CWp2PR.jpg"
    }
}