{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/mOYIUiSdoLWynoZIGDZSAAUZ3ss.jpg",
                "genre_ids": [
                    9648,
                    18,
                    53
                ],
                "id": 445,
                "original_language": "fr",
                "original_title": "Caché",
                "overview": "George, host of a television show focusing on literature, receives videos shot on the sly that feature his family, along with disturbing drawings that are difficult to interpret. He has no idea who has made and sent him the videos. Progressively, the contents of the videos become more personal, indicating that the sender has known George for a long time.",
                "popularity": 2.4331,
                "poster_path": "/RJQEPEj4CMMga7euR2EkmdAIog.jpg",
                "release_date": "2005-10-05",
                "title": "Caché",
                "video": false,
                "vote_average": 7.054,
                "vote_count": 1173,
                "character": "Majid's Son",
                "credit_id": "52fe4244c3a36847f801100f",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/w7Z4BVMin49voNN61IUWyN9DopV.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 86837,
                "original_language": "fr",
                "original_title": "Amour",
                "overview": "Georges and Anne are in their eighties. They are cultivated, retired music teachers. Their daughter, who is also a musician, lives abroad with her family. One day, Anne has a stroke, and the couple's bond of love is severely tested.",
                "popularity": 3.2873,
                "poster_path": "/19hyCudualHxCD0GrEngqsi0wBF.jpg",
                "release_date": "2012-09-20",
                "title": "Amour",
                "video": false,
                "vote_average": 7.756,
                "vote_count": 1690,
                "character": "Paramedic #2",
                "credit_id": "52fe49a49251416c910b3d99",
                "order": 13
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Walide Afkir",
            "Belkacem Walid Afkir"
        ],
        "biography": "Walid Afkir born September 2, 1982 in Montreuil, Seine-Saint-Denis is a Franco-Moroccan actor and screenwriter.\n\nHis father, Brahim Foudili, arrived in France in the 1960s. Very involved in the FLN, he owned and managed a hotel in Montreuil where he welcomed the newly arrived Algerian diaspora. His mother, Fattouma Afkir, meanwhile, from a family from the city of Ouarzazate was born in Mohammedia in Morocco, she arrived in France in August 1963 at the age of 17. She does odd jobs as a nanny, a cleaning lady or even an usher at the Kinopanorama cinema in the 15th arrondissement of Paris. His talents as a cook allow him to work with great celebrities of French fashion and cinema such as designer Hilton McConnico, decorator Carlos Conti or even the director of Pédale Douce Gabriel Aghion. She ended her career as sous-chef at the Concorde Lafayette Hotel where she retired in 2006.\n\nWalid Afkir is the youngest of a family made up of two brothers and a sister. He grew up in the Boissière district of Montreuil where he spent his childhood there. At the age of 15, after the death of his father, he decides to stop his schooling and enters the world of work by becoming a pizza delivery boy.\n\nAt 17, he was spotted during a wild casting by Elsa Pharaon for a feature film project. Very quickly his profile seduces other professionals like Kris de Bellair, casting director who will offer him his first role in \"Unknown Code\" by Michael Haneke. Film in which Walid performs a scene alongside Juliette Binoche. This sequence shot even becomes the trailer for the film presented in the Official Selection of the 2000 Cannes Film Festival; this is moreover what reveals it to the general public.\n\nHe will be nominated for the César in 2006 in the Best Male Newcomer category, for the film \"Hidden\" by Michael Haneke.",
        "birthday": "1982-09-02",
        "deathday": null,
        "gender": 2,
        "homepage": "https://time-art.com/talent/walid-afkir.htm",
        "id": 6016,
        "imdb_id": "nm0012715",
        "known_for_department": "Acting",
        "name": "Walid Afkir",
        "place_of_birth": "Montreuil, Seine-Saint-Denis, France",
        "popularity": 0.1629,
        "profile_path": "/4s7KGPZJRLT5NB38581sh6s6lOo.jpg"
    }
}