{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/xga9dXEIJHAjNLGMjw4VDPH7LJB.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 9090,
                "original_language": "en",
                "original_title": "To Wong Foo, Thanks for Everything! Julie Newmar",
                "overview": "Manhattan drag queens Vida Boheme and Noxeema Jackson impress regional judges in competition, securing berths in the Nationals in Los Angeles. When the two meet pathetic drag novice Chi-Chi Rodriguez — one of the losers that evening — the charmed Vida and Noxeema agree to take the hopeless youngster under their joined wing. Soon the three set off on a madcap road trip across America and struggle to make it to Los Angeles in time.",
                "popularity": 3.149,
                "poster_path": "/xlRhO3TzTxCFn2s9LEcVi7s582t.jpg",
                "release_date": "1995-09-08",
                "title": "To Wong Foo, Thanks for Everything! Julie Newmar",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 708,
                "character": "Miss Coco Peru",
                "credit_id": "5e0f3835663b8700137eef0a",
                "order": 40
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Clinton Leupp"
        ],
        "biography": "Miss Coco Peru, aka Clinton Leupp, is a gay male American actor and drag performer, perhaps best known for his role in the 1999 independent film Trick. Peru also starred in Richard Day's Girls Will Be Girls (2003), was one of six performers featured in the Logo original stand-up comedy series Wisecrack (2005), and had a cameo appearance in the 1995 comedy film To Wong Foo, Thanks for Everything! Julie Newmar. He has appeared in a number of other supporting and guest-starring roles in film and television, including Will & Grace, the Bravo reality series Boy Meets Boy, and the comedy Straight-Jacket (as the secretly lesbian wife of S.R.O. studio's head).\n\nLeupp has almost always been credited as either \"Coco Peru\" or \"Miss Coco Peru\" rather than under his given name. In 2006, he received his first credit as a voice actor playing \"Mama Hippo\" in the animated feature The Wild.",
        "birthday": "1965-08-27",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.misscocoperu.com",
        "id": 60235,
        "imdb_id": "nm0505029",
        "known_for_department": "Acting",
        "name": "Miss Coco Peru",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.2352,
        "profile_path": "/sDhG3dJ1IKF3jzOv3tsSBqY8QzB.jpg"
    }
}