{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/x7y8ezKtU1vRInk0dmbvDoKgJ8u.jpg",
                "genre_ids": [
                    18,
                    35,
                    10749
                ],
                "id": 2898,
                "original_language": "en",
                "original_title": "As Good as It Gets",
                "overview": "Melvin Udall, a cranky, bigoted, obsessive-compulsive writer of romantic fiction, is rude to everyone he meets, including his gay neighbor, Simon. After Simon is brutally attacked and hospitalized, Melvin finds his life turned upside down when he has to look after Simon's dog. In addition, Carol, the only waitress at the local diner who will tolerate him, leaves work to care for her chronically ill son, making it impossible for Melvin to eat breakfast.",
                "popularity": 5.5237,
                "poster_path": "/xXxuJPNUDZ0vjsAXca0O5p3leVB.jpg",
                "release_date": "1997-12-19",
                "title": "As Good as It Gets",
                "video": false,
                "vote_average": 7.397,
                "vote_count": 3930,
                "character": "Bar Waiter",
                "credit_id": "55c8db9e92514177c4000004",
                "order": 53
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Aaron Albertus",
            "Paul A. Greenberg",
            "Paul Ari Greenberg",
            "Pierre Holloway"
        ],
        "biography": "Paul Greenberg is an Emmy winning writer and performer who emerged on the comedy scene in the mid-90's as a member of the Canadian comedy troupe, The Vacant Lot. After years of playing the famed Rivoli Club in Toronto, the troupe made the transition to TV with the Lorne Michaels produced sketch series, The Vacant Lot, for Comedy Central. This prompted Paul's move from Toronto to Los Angeles where he continued performing as a cast member of the cult favorite sketch shows, The Jenny McCarthy Show for MTV and the music based sketch show, Random Play for VH1. Other appearances include Shempy the Vampire on Buffy the Vampire Slayer, the waiter who follows Helen Hunt across the dance floor in As Good As It Gets and with his wife Jackie Harris Greenberg, the Porno Gil episode Curb Your Enthusiasm. Paul has continued creating and starring in projects including the comedy series, International Ghost Investigators: Hollywood Division for DirecTV and co-created with Joey McIntyre, the sitcom Return of the Mac for PopTV . Paul's work as host writer for Neil Patrick Harris has earned him Emmy and Writer's Guild Awards. Paul has also done extensive voice work for some of televisions most popular animated shows, such as Jimmy Neutron, Invader Zim and most recently, the Japanese animated series, Yo Kai Watch, where he played over 15 characters. Paul lives in Los Angeles with his wife, comedic actress, Jackie Harris Greenberg, and their son Donovan. Paul's podcast with his longtime friend, Dave Foley of The Kids in the Hall, Don't Say...with Paul and Dave, premiered February 5, 2019 on iTunes.",
        "birthday": "1965-01-13",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 60259,
        "imdb_id": "nm0338569",
        "known_for_department": "Acting",
        "name": "Paul Greenberg",
        "place_of_birth": " Toronto, Ontario, Canada",
        "popularity": 0.2992,
        "profile_path": "/1SCUG4B1rPryc6oRlwkHJUEtzI9.jpg"
    }
}