{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/bWN6ZBr6nJNEuHigL9fQWhZ78hd.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 9918,
                "original_language": "en",
                "original_title": "Glory Road",
                "overview": "In 1966, Texas Western coach Don Haskins led the first all-black starting line-up for a college basketball team to the NCAA national championship.",
                "popularity": 5.3918,
                "poster_path": "/bGRSV5tStxDNPRLCewnOeeiZzrY.jpg",
                "release_date": "2006-01-13",
                "title": "Glory Road",
                "video": false,
                "vote_average": 7.428,
                "vote_count": 753,
                "character": "Dick Myers",
                "credit_id": "52fe4548c3a36847f80c594b",
                "order": 15
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Mitch Eakins was born and raised in Wilmington, North Carolina. He studied acting with legendary teacher Lucile McIntyre, who encouraged him to devote his life to the performing arts. Eakins graduated at the top of his class with a Film Studies degree at the University of North Carolina Wilmington. He went on to study at Stella Adler in Manhattan and in 2017 became a member of the BGB studio in Los Angeles, California. Mitch is an original cast member in L.A's longest running play Point Break Live and went on to play Goose in the Top Gun Parody Tom Gun Live. He recurred for two seasons on the AMC series Turn: Washington's Spies as the duplicitous and dashing Major William Bradford. In April 2020 he can be seen in at least 8 episodes playing Detective Tommy Roberts in Antonie Fuqua's New Orleans based thriller #freerayshawn. Mitch is an avid surfer, a dedicated father and husband, and a passionate advocate for ocean conservation. Mitch is married to actress Melanie Minichino. They met doing a touring comedy show.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 60510,
        "imdb_id": "nm0247153",
        "known_for_department": "Acting",
        "name": "Mitch Eakins",
        "place_of_birth": "Wilmington, North Carolina, USA",
        "popularity": 0.0658,
        "profile_path": "/i26gl3mGyGQhEjNf24KdrjxBLPJ.jpg"
    }
}