{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/81ME78JndOYu7IluTi1rxh0cLY2.jpg",
                "genre_ids": [
                    18
                ],
                "id": 25793,
                "original_language": "en",
                "original_title": "Precious",
                "overview": "Set in Harlem in 1987, Claireece \"Precious\" Jones is a 16-year-old African American girl born into a life no one would want. She's pregnant for the second time by her absent father; at home, she must wait hand and foot on her mother, an angry woman who abuses her emotionally and physically. School is chaotic and Precious has reached the ninth grade with good marks and a secret; She can't read.",
                "popularity": 4.0416,
                "poster_path": "/d4ltLIDbvZskSwbzXqi0Hfv5ma4.jpg",
                "release_date": "2009-11-06",
                "title": "Precious",
                "video": false,
                "vote_average": 7.322,
                "vote_count": 1691,
                "character": "Mary Lee Johnston",
                "credit_id": "52fe44dec3a368484e03b7b9",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Monica Imes",
            "モニーク ",
            "モニーク・アイメス"
        ],
        "biography": "From Wikipedia, the free encyclopedia.\n\nMonica Imes (born December 11, 1967) known professionally as Mo'Nique, is an American comedienne and actress. Mo'Nique rose to fame in the UPN series The Parkers while making a name as a stand-up comedian hosting a variety of venues, including Showtime at the Apollo. Mo'Nique transitioned to film with roles in such films as Phat Girlz, and Welcome Home Roscoe Jenkins.\n\nIn 2009, she received critical praise for her villainous role in the film Precious: Based on the Novel \"Push\" by Sapphire. For this performance, she has won numerous awards including an Academy Award for Best Supporting Actress, a Screen Actors Guild Award, a Golden Globe Award, and a BAFTA Award. She is the sixteenth African American actress to receive a nomination for the Academy Award for Best Supporting Actress, and the fourth to win. Overall, Mo'Nique is the twelfth individual African-American to win an Oscar for acting; and the seventh winner during the decade of the 2000s. She hosts The Mo'Nique Show, a late-night talk show that premiered in 2009 on BET.\n\nDescription above from the Wikipedia article Mo'Nique, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1967-12-11",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.moniqueworldwide.com/",
        "id": 60561,
        "imdb_id": "nm0594898",
        "known_for_department": "Acting",
        "name": "Mo'Nique",
        "place_of_birth": "Woodlawn, Maryland, USA",
        "popularity": 0.363,
        "profile_path": "/bzSVVBKTyMi4K6MZvFCzBJs91F5.jpg"
    }
}