{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tLI7N5679ugChOW00i3Y3Xfc4PY.jpg",
                "genre_ids": [
                    35
                ],
                "id": 9942,
                "original_language": "en",
                "original_title": "Major League",
                "overview": "When Rachel Phelps inherits the Cleveland Indians from her deceased husband, she's determined to move the team to a warmer climate—but only a losing season will make that possible, which should be easy given the misfits she's hired. Rachel is sure her dream will come true, but she underestimates their will to succeed.",
                "popularity": 2.8771,
                "poster_path": "/ypUedY9zX4nGGf1lQv1UGc8PhPA.jpg",
                "release_date": "1989-02-16",
                "title": "Major League",
                "video": false,
                "vote_average": 6.9,
                "vote_count": 831,
                "character": "Rachel Phelps",
                "credit_id": "52fe454cc3a36847f80c67ad",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "From Wikipedia, the free encyclopedia\n\nMargaret Whitton (November 30, 1950 - December 4, 2016) was an American stage, film, and television actress, originally from Philadelphia, Pennsylvania. Whitton did her primary film work between 1986 and 1993. Her most visible roles were that of baseball team owner Rachel Phelps in Major League (1989) and its sequel Major League II, and as Michael J. Fox's vibrant, sexy and underappreciated aunt-by-marriage in The Secret of My Success (1987). She also appeared in the Robin Williams-Kurt Russell vehicle The Best of Times (1986) and in Mel Gibson's The Man Without a Face (1993).\n\nShe first noticeably appeared on the stage in 1973, billed as Peggy Whitton. In the early 1980s, she began to be billed as Margaret Whitton and made her Broadway debut in 1982's Steaming. After her seven year experiment with film, she returned to the stage, appearing on Broadway in And the Apple Doesn't Fall... (1995) and in the original, award-winning musical Marlene (1999), starring Siân Phillips as Marlene Dietrich.\n\nToday she is the president of independent film producer Tashtego Films (www.tashtegofilms.com).\n\nDescription above from the Wikipedia article Margaret Whitton, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1950-11-30",
        "deathday": "2016-12-04",
        "gender": 1,
        "homepage": null,
        "id": 60700,
        "imdb_id": "nm0926592",
        "known_for_department": "Acting",
        "name": "Margaret Whitton",
        "place_of_birth": "Philadelphia, Pennsylvania, USA",
        "popularity": 0.432,
        "profile_path": "/AaeGGScxFyAHQuKzYrNbSxw05iR.jpg"
    }
}