{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/fOfcbdBQBCO4Y2hy6DfLbb30klU.jpg",
                "genre_ids": [
                    18,
                    37,
                    10749,
                    10752,
                    28
                ],
                "id": 4476,
                "original_language": "en",
                "original_title": "Legends of the Fall",
                "overview": "In early 20th-century Montana, Col. William Ludlow lives on a ranch in the wilderness with his sons, Alfred, Tristan, and Samuel. Eventually, the unconventional but close-knit family are bound by loyalty, tested by war, and torn apart by love, as told over the course of several decades in this epic saga.",
                "popularity": 6.9321,
                "poster_path": "/t1KPGlW0UGd0m515LPQmk2F4nu1.jpg",
                "release_date": "1994-12-23",
                "title": "Legends of the Fall",
                "video": false,
                "vote_average": 7.393,
                "vote_count": 2716,
                "character": "Sheriff Tynert",
                "credit_id": "52fe43c4c3a36847f806e241",
                "order": 12
            },
            {
                "adult": false,
                "backdrop_path": "/wCcz89uLIjZ7PKwGvrsQTz0vqe2.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 14292,
                "original_language": "en",
                "original_title": "Miracle",
                "overview": "When college coach Herb Brooks is hired to helm the 1980 U.S. men's Olympic hockey team, he brings a unique and brash style to the ice. After assembling a team of hot-headed college all-stars, who are humiliated in an early match, Brooks unites his squad against a common foe: the heavily-favored Soviet team.",
                "popularity": 2.2876,
                "poster_path": "/mxtej2th8t8x0ufVBTyhsO6Htxj.jpg",
                "release_date": "2004-02-06",
                "title": "Miracle",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 630,
                "character": "Doc Nagobads",
                "credit_id": "52fe45e39251416c75065e6d",
                "order": 5
            },
            {
                "adult": false,
                "backdrop_path": "/vVk0HV9HAqvvSfWiNGjpsOekLBS.jpg",
                "genre_ids": [
                    18
                ],
                "id": 2567,
                "original_language": "en",
                "original_title": "The Aviator",
                "overview": "A biopic depicting the life of filmmaker and aviation pioneer Howard Hughes from 1927 to 1947, during which time he became a successful film producer and an aviation magnate, while simultaneously growing more unstable due to severe obsessive-compulsive disorder.",
                "popularity": 6.7841,
                "poster_path": "/lx4kWcZc3o9PaNxlQpEJZM17XUI.jpg",
                "release_date": "2004-12-17",
                "title": "The Aviator",
                "video": false,
                "vote_average": 7.22,
                "vote_count": 5558,
                "character": "Dr. Hepburn",
                "credit_id": "57ca14a99251412784000b8b",
                "order": 18
            },
            {
                "adult": false,
                "backdrop_path": "/rn3E4Kd7EUOGOF95Hsd0aOhQqZg.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 30890,
                "original_language": "en",
                "original_title": "Radio Days",
                "overview": "The Narrator tells us how the radio influenced his childhood in the days before TV. In the New York City of the late 1930s to the New Year's Eve 1944, this coming-of-age tale mixes the narrator's experiences with contemporary anecdotes and urban legends of the radio stars.",
                "popularity": 4.1435,
                "poster_path": "/ljZ3yyYznAiq1vF6nHITdJn6qXB.jpg",
                "release_date": "1987-01-30",
                "title": "Radio Days",
                "video": false,
                "vote_average": 7.047,
                "vote_count": 603,
                "character": "Radio Voice (voice)",
                "credit_id": "5ea0f3e10b5fd6001a80df14",
                "order": 96
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Ken Welsh ",
            "Ken Walsh",
            "Kenneth Walsh"
        ],
        "biography": "Kenneth Welsh, CM (March 30, 1942 – May 5, 2022) was a Canadian film and television actor (sometimes credited as Ken Welsh). He was known to Twin Peaks fans as the multi-faceted villain Windom Earle, and had more recently played the father of Katharine Hepburn (Cate Blanchett) in Martin Scorsese's The Aviator.\n\nIn 1984 he was nominated for a Genie Award as Best Actor for his portrayal of Reno Colt in the film \"Reno and the Doc\", written and directed by Charles Dennis. In 1997 Welsh directed Dennis in the latter's play \"SoHo Duo\" at the West Bank Theatre in New York City.\n\nWelsh was born in Edmonton, Alberta to a father who worked for the Canadian National Railway. He grew up in Alberta and studied drama at school. He later moved to Montreal and attended the National Theatre School. Following graduation, he auditioned for the Stratford Festival in Ontario and then spent the first seven years of his career on stage.\n\nWelsh has portrayed historical figures including Thomas E. Dewey, Colin Thatcher, Harry S. Truman (twice), Thomas Edison, James \"Scotty\" Reston, General Harry Crerar and James Baker.\n\nHe has made guest appearances on the acclaimed TV series Due South and Slings and Arrows.\n\nIn 2003, he was made a Member of the Order of Canada.\n\nHis role as the Vice-President of the United States in the 2004 environmental disaster film The Day After Tomorrow sparked some controversy due to his physical resemblance to Dick Cheney, who at the time was the real Vice President. Director Roland Emmerich later confirmed that he deliberately chose Welsh for that very reason. Emmerich stated that the character of the Vice-President in the film was intended to be a not-so-subtle criticism of the environmental policies of the Presidency of George W. Bush.\n\nDescription above from the Wikipedia article Kenneth Welsh, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1942-03-30",
        "deathday": "2022-05-05",
        "gender": 2,
        "homepage": "http://ggagency.ca/welsh/",
        "id": 6074,
        "imdb_id": "nm0920564",
        "known_for_department": "Acting",
        "name": "Kenneth Welsh",
        "place_of_birth": "Edmonton, Alberta, Canada",
        "popularity": 0.6182,
        "profile_path": "/hsmY2HaIdOEoTBtwFPxQLyLymYw.jpg"
    }
}