{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/tVoWbAAfTDIhTeo78SbA2V6mv8E.jpg",
                "genre_ids": [
                    35,
                    10751
                ],
                "id": 14306,
                "original_language": "en",
                "original_title": "Marley & Me",
                "overview": "A newly married couple, in the process of starting a family, learn many of life's important lessons from their trouble-loving retriever, Marley. Packed with plenty of laughs to lighten the load, the film explores the highs and lows of marriage, maturity and confronting one's own mortality, as seen through the lens of family life with a dog.",
                "popularity": 5.1733,
                "poster_path": "/pnB6hjTKylb0Ve2nUWt16gzkErr.jpg",
                "release_date": "2008-12-25",
                "title": "Marley & Me",
                "video": false,
                "vote_average": 7.192,
                "vote_count": 4670,
                "character": "Editor",
                "credit_id": "52fe45e49251416c75066131",
                "order": 9
            },
            {
                "adult": false,
                "backdrop_path": "/7dzngS8pLkGJpyeskCFcjPO9qLF.jpg",
                "genre_ids": [
                    28,
                    53
                ],
                "id": 245891,
                "original_language": "en",
                "original_title": "John Wick",
                "overview": "Ex-hitman John Wick comes out of retirement to track down the gangsters that took everything from him.",
                "popularity": 9.1709,
                "poster_path": "/fZPSd91yGE9fCcCe6OoQr6E3Bev.jpg",
                "release_date": "2014-10-22",
                "title": "John Wick",
                "video": false,
                "vote_average": 7.453,
                "vote_count": 20039,
                "character": "Harry",
                "credit_id": "54519830c3a3680239004fbd",
                "order": 21
            },
            {
                "adult": false,
                "backdrop_path": "/ydRoUWyhAMv1FstnWlo5EiZWEbc.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 239571,
                "original_language": "en",
                "original_title": "The Best of Me",
                "overview": "A pair of former high school sweethearts reunite after many years when they return to visit their small hometown.",
                "popularity": 4.1463,
                "poster_path": "/twv17hergmeqXR2jVpKdv0JRPir.jpg",
                "release_date": "2014-10-15",
                "title": "The Best of Me",
                "video": false,
                "vote_average": 7.47,
                "vote_count": 2629,
                "character": "Morgan Dupree",
                "credit_id": "548068139251416e74002a01",
                "order": 6
            },
            {
                "adult": false,
                "backdrop_path": "/egyi9TQjLhNEQuEsK1dXovdHOHL.jpg",
                "genre_ids": [
                    10749,
                    35
                ],
                "id": 509,
                "original_language": "en",
                "original_title": "Notting Hill",
                "overview": "London bookstore owner William Thacker's quiet life turns upside down when a chance encounter with famous actress Anna Scott sparks an unlikely romance challenged by their vastly different worlds.",
                "popularity": 9.0224,
                "poster_path": "/hHRIf2XHeQMbyRb3HUx19SF5Ujw.jpg",
                "release_date": "1999-05-21",
                "title": "Notting Hill",
                "video": false,
                "vote_average": 7.265,
                "vote_count": 6422,
                "character": "'Helix' Lead Actor",
                "credit_id": "5808d9d3c3a368672f008a7d",
                "order": 21
            },
            {
                "adult": false,
                "backdrop_path": "/oQHF0Y4gCw6VdPmapjsbZoxY2ht.jpg",
                "genre_ids": [
                    80,
                    18
                ],
                "id": 359940,
                "original_language": "en",
                "original_title": "Three Billboards Outside Ebbing, Missouri",
                "overview": "After seven months have passed without a culprit in her daughter's murder case, Mildred Hayes makes a bold move, painting three signs leading into her town with a controversial message directed at Bill Willoughby, the town's revered chief of police. When his second-in-command Officer Jason Dixon, an immature mother's boy with a penchant for violence, gets involved, the battle between Mildred and Ebbing's law enforcement is only exacerbated.",
                "popularity": 4.7557,
                "poster_path": "/uGMM9ZObmPUFrGqcbFMVyv8L1lU.jpg",
                "release_date": "2017-12-01",
                "title": "Three Billboards Outside Ebbing, Missouri",
                "video": false,
                "vote_average": 8.063,
                "vote_count": 10473,
                "character": "Abercrombie",
                "credit_id": "581e50aac3a36806f300fb39",
                "order": 10
            },
            {
                "adult": false,
                "backdrop_path": "/rStbi6Sm1JWk4S3pCqULUY7GMDB.jpg",
                "genre_ids": [
                    18,
                    36
                ],
                "id": 506528,
                "original_language": "en",
                "original_title": "Harriet",
                "overview": "The extraordinary tale of Harriet Tubman's escape from slavery and transformation into one of America's greatest heroes. Her courage, ingenuity and tenacity freed hundreds of slaves and changed the course of history.",
                "popularity": 4.4888,
                "poster_path": "/rsUs58bDqpJJxZSOebZOMN9gzw2.jpg",
                "release_date": "2019-11-01",
                "title": "Harriet",
                "video": false,
                "vote_average": 7.305,
                "vote_count": 861,
                "character": "Ben Ross",
                "credit_id": "5d50aec39c05503b6144f3e5",
                "order": 3
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Peter Clarke",
            "클라크 피터스"
        ],
        "biography": "Peter Clarke (born April 7, 1952), known professionally as Clarke Peters, is an American actor, writer, and director, who has spent much of his adult life in the United Kingdom. He is best known for his roles as Lester Freamon in the television series The Wire (2002–2008) and Albert Lambreaux in the television series Treme (2010–2013). He also wrote the book for the musical revue Five Guys Named Moe (1990).\n\nPeters is also known for his roles in the films Silver Dream Racer (1980), Endgame (2009), John Wick (2014), Three Billboards Outside Ebbing, Missouri (2017), Harriet (2019), and Da 5 Bloods (2020), the lattermost of which earned him a nomination for the BAFTA Award for Best Actor in a Supporting Role.\n\nPeters was born Peter Clarke, the second of four sons, in New York City, and grew up in Englewood, New Jersey. At the age of 12, he had his first theater experience, in a school production of My Fair Lady. He began to have serious ambitions to work in the theater at the age of 14. He graduated from Dwight Morrow High School in 1970.\n\nIn 1971, Peters' older brother enabled him to work as a costume designer for a production of the musical Hair in Paris, in which Peters later starred. In 1973, Peters moved to London and changed his name to Clarke Peters, because Equity already had a few namesake members. While in London, he formed a soul band, The Majestics, and worked as a backup singer on such hits as \"Love and Affection\" by Joan Armatrading, \"Boogie Nights\" by Heatwave, and some David Essex songs. However, music was not Peters' main ambition, and he preferred to work in the theater.\n\nHis first West End theatre musical roles, which he received with assistance from his friend Ned Sherrin, were I Gotta Shoe (1976) and Bubbling Brown Sugar (1977). Other West End credits include Blues in the Night, Porgy and Bess, The Witches of Eastwick, Guys and Dolls, Chicago, and Chess. Peters starred in the Sean Connery space Western Outland (1981) as the treacherous Sgt. Ballard, and he played an almost wordless role as Anderson, a vicious pimp in Neil Jordan's Mona Lisa (1986).\n\nPeters is familiar to television viewers as Detective Lester Freamon in the HBO series The Wire. Peters also starred in the HBO mini-series The Corner, portraying a drug addict named Fat Curt, as well as the FX series Damages, as Dave Pell. Both The Wire and The Corner were created by writer and former The Baltimore Sun journalist David Simon. Peters also stars in Simon's HBO series Treme, in the role of Mardi Gras Indian chief Albert Lambreaux. Peters appeared in two episodes of the American time-travel/detective TV series Life on Mars (2008) as NYPD Captain Fletcher Bellow.\n\nHe also appeared in the British show Holby City, as Derek Newman, the father of nurse Donna Jackson. He voiced a part in the Doctor Who animated episode Dreamland, and in the In Plain Sight episode \"Duplicate Bridge\" as a man in Witness Protection named Norman Baker/Norman Danzer. In 2010, Peters read Rita Hayworth and Shawshank Redemption for BBC 7. In that year, he also had a guest appearance as Professor Mark Ramsay in the pilot episode of the USA Network TV series Covert Affairs. From 2012 to 2013, Peters had a recurring role as Alonzo D. Quinn in the CBS TV series Person of Interest.",
        "birthday": "1952-04-07",
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.clarkepeters.com/",
        "id": 61011,
        "imdb_id": "nm0676370",
        "known_for_department": "Acting",
        "name": "Clarke Peters",
        "place_of_birth": "New York City, New York, USA",
        "popularity": 0.8528,
        "profile_path": "/ouDHDpocxXgXrosF3vShAEkOjHL.jpg"
    }
}