{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uaEfEkb2tjl4hN1oaSyzcxt4cEg.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 439,
                "original_language": "it",
                "original_title": "La dolce vita",
                "overview": "Episodic journey of journalist Marcello who struggles to find his place in the world, torn between the allure of Rome's elite social scene and the stifling domesticity offered by his girlfriend, all the while searching for a way to become a serious writer.",
                "popularity": 4.2869,
                "poster_path": "/2KU52apQyvyZuPsqEGMcWb4BKu2.jpg",
                "release_date": "1960-02-05",
                "title": "La Dolce Vita",
                "video": false,
                "vote_average": 8.066,
                "vote_count": 1955,
                "character": "Nadia",
                "credit_id": "5e99352b0582240013af9852",
                "order": 28
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Надя Грей",
            "Nadine Gray",
            "Nadia Kujnir"
        ],
        "biography": "Nadia Gray (born Nadia Kujnir; 23 November 1923 – 13 June 1994) was a Romanian film actress.\n\nGray was born into a Jewish family in Bucharest. Her father moved to Romania from Russia, and her mother was from Akkerman (Bessarabia). She left Romania for Paris in the late 1940s to escape the Communist takeover after World War II. Her film debut was in L'Inconnu d'un soir in 1949. Perhaps her best-known role was in the Federico Fellini film La Dolce Vita (1960).\n\nShe played a guest role in an episode of the television series The Prisoner (\"The Chimes of Big Ben\", 1967).\n\nShe was first married to N. Goldenberg (later Herescu), a wealthy businessman from Chișinău, then to Constantin Cantacuzino, a Romanian aristocrat who was one of Romania's top fighter aces of the war. They were married from 1946 to his death in 1958. Her third husband was Manhattan attorney Herbert Silverman (1912-2003). They were married from 1967 to her death in 1994. She died in New York City from a stroke.\n\nSource: Article \"Nadia Gray\" from Wikipedia in English, licensed under CC-BY-SA 3.0",
        "birthday": "1923-11-27",
        "deathday": "1994-06-13",
        "gender": 1,
        "homepage": null,
        "id": 6103,
        "imdb_id": "nm0336842",
        "known_for_department": "Acting",
        "name": "Nadia Gray",
        "place_of_birth": "Bucarest, Romania",
        "popularity": 0.3209,
        "profile_path": "/zY6Zy7rgunfj8BLYXn2dA8NlBnr.jpg"
    }
}