{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/5m5VhSN1lTk3egtrNzqNv5nwMuG.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 451,
                "original_language": "en",
                "original_title": "Leaving Las Vegas",
                "overview": "Ben Sanderson, an alcoholic Hollywood screenwriter who lost everything because of his drinking, arrives in Las Vegas to drink himself to death. There, he meets and forms an uneasy friendship and non-interference pact with prostitute Sera.",
                "popularity": 6.3459,
                "poster_path": "/wTrFpGe3U65kXTldIUxuM2hmOAK.jpg",
                "release_date": "1995-10-27",
                "title": "Leaving Las Vegas",
                "video": false,
                "vote_average": 7.25,
                "vote_count": 1534,
                "character": "Marc Nussbaum",
                "credit_id": "52fe4245c3a36847f801118b",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Steven R. Weber"
        ],
        "biography": "Steven Robert Weber is an American actor and comedian. He is best known for his role as Brian Hackett on the television series Wings, voicing Charlie B. Barkin in All Dogs Go to Heaven: The Series, and portraying Jack Torrance in the TV miniseries adaptation of Stephen King's The Shining.\n\nWeber was born on March 4, 1961, in Briarwood, Queens, New York. He is the son of Fran (Frankel), a nightclub singer, and Stuart Weber, a nightclub performer, and Borscht Belt comic and manager. He began his acting career in high school, appearing in several productions. After graduating from high school, he attended the High School of the Performing Arts in New York City and graduated from New York State University at Purchase.\n\nWeber's first major acting role was in the 1987 film Hamburger Hill. He then went on to appear in a number of other films, including The Flamingo Kid (1984), The Kennedys of Massachusetts (1990), and The Shining (1997).\n\nIn 1990, Weber began starring as Brian Hackett on the television series Wings. The show ran for eight seasons and was a critical and commercial success. Weber's performance on the show earned him a Golden Globe nomination for Best Actor – Television Series Musical or Comedy.\n\nIn 1994, Weber began voicing Charlie B. Barkin in the animated series All Dogs Go to Heaven: The Series. He continued to voice the character until the show ended in 1996.\n\nIn 1997, Weber starred in the TV miniseries adaptation of Stephen King's The Shining. He played Jack Torrance, the role made famous by Jack Nicholson in the 1980 film. Weber's performance was praised by critics, and he was nominated for a Golden Globe Award for Best Actor – Miniseries or Television Film.\n\nWeber has continued to work in film and television since then. He has appeared in a number of films, including The Santa Clause 2 (2002), The Santa Clause 3: The Escape Clause (2006), and The Christmas Chronicles (2018). He has also appeared in a number of television shows, including iZombie, NCIS: New Orleans, and Chicago Med.",
        "birthday": "1961-03-04",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 6106,
        "imdb_id": "nm0001836",
        "known_for_department": "Acting",
        "name": "Steven Weber",
        "place_of_birth": "Briarwood, Queens, New York, USA",
        "popularity": 0.8924,
        "profile_path": "/8FtkapenCOpe39eE1sQus5WLWAq.jpg"
    }
}