{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/jpFcZH2eyh6gcoxCa637TrGe4bT.jpg",
                "genre_ids": [
                    28,
                    878
                ],
                "id": 2048,
                "original_language": "en",
                "original_title": "I, Robot",
                "overview": "In 2035, where robots are commonplace and abide by the three laws of robotics, a technophobic cop investigates an apparent suicide. Suspecting that a robot may be responsible for the death, his investigation leads him to believe that humanity may be in danger.",
                "popularity": 7.5884,
                "poster_path": "/efwv6F2lGaghjPpBRSINHtoEiZB.jpg",
                "release_date": "2004-07-15",
                "title": "I, Robot",
                "video": false,
                "vote_average": 6.957,
                "vote_count": 12211,
                "character": "Detective",
                "credit_id": "52fe4330c3a36847f804108f",
                "order": 7
            },
            {
                "adult": false,
                "backdrop_path": "/kbOB9DGl8qwhDRcXOmXfmcmadeD.jpg",
                "genre_ids": [
                    18,
                    80
                ],
                "id": 645886,
                "original_language": "en",
                "original_title": "The Unforgivable",
                "overview": "A woman is released from prison after serving a sentence for a violent crime and re-enters a society that refuses to forgive her past.",
                "popularity": 6.4782,
                "poster_path": "/1b3dNFDuE7i05TJlXrIC571yR01.jpg",
                "release_date": "2021-11-24",
                "title": "The Unforgivable",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 1910,
                "character": "Foreman",
                "credit_id": "61b46b371f3319001c3e2c10",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Craig approaches the craft with great respect and a sense of play that focuses on bringing the most truthful story forward from those that he works with. With a BA from Brock University concentrating on Theatre and Drama in Education, and over twenty years of on-set experience equating to well over a hundred roles, Craig has extensive experience to offer.\n\nProud Coaching highlights include; The inaugural Showcase Program at SchoolCreative, Producing and Directing a 2nd Year Main Stage production at New Image College, Co-Teaching the Theatre component at Ailanthus, and serving as a Volunteer Mentor for the Fulfilling Young Artist’s Program.\n\nFavourite credits include; Recurring roles for the Aurora Teagarden Movie Mystery Series for Hallmark and DirectTV’s, Rogue, appearances in Project Blue Book, Arrow, The X-Files, and in the feature films, Noelle, I-Robot, Along Came a Spider, and the indie-gems, The Hollow Child, Sunflower Hour, and The Rhino Brothers. Lead roles for stage include the highly acclaimed productions of A Streetcar Named Desire, at The Chemainus Theatre Festival, Homechild at The Belfry Theatre, as well as the Jessie nominated productions of Julius Caesar for Mad Duck Collective and Omniscience, for Western Theatre Conspiracy.\n\nHis directorial debut, The Beast of Bottomless Lake was honoured as Best Feature at MIFF, People’s Choice at OIFF, received a theatrical run and was broadcast on SuperChannel.",
        "birthday": null,
        "deathday": null,
        "gender": 2,
        "homepage": "https://www.craigmarch.com",
        "id": 61164,
        "imdb_id": "nm0545285",
        "known_for_department": "Acting",
        "name": "Craig March",
        "place_of_birth": "Canada ",
        "popularity": 0.1329,
        "profile_path": "/m6TgOvDikmW09GYJu9t5nkoq0wT.jpg"
    }
}