{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/cq9N64ucEtfIc3eMxNr1VzY9LH9.jpg",
                "genre_ids": [
                    18
                ],
                "id": 37799,
                "original_language": "en",
                "original_title": "The Social Network",
                "overview": "In 2003, Harvard undergrad and computer programmer Mark Zuckerberg begins work on a new concept that eventually turns into the global social network known as Facebook. Six years later, Mark is one of the youngest billionaires ever, but his unprecedented success leads to both personal and legal complications when he ends up on the receiving end of two lawsuits, one involving his former friend.",
                "popularity": 8.1277,
                "poster_path": "/n0ybibhJtQ5icDqTp8eRytcIHJx.jpg",
                "release_date": "2010-10-01",
                "title": "The Social Network",
                "video": false,
                "vote_average": 7.37,
                "vote_count": 12636,
                "character": "B.U. Guy in Bra",
                "credit_id": "52fe466f9251416c910546e7",
                "order": 25
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Trevor Christopher Wright (born August 23, 1982) was an American actor, now working in real estate. Wright was born in La Jolla, California. His breakthrough acting role was in the 2007 film Shelter. Wright's recurring role as Zack Powers on George Lopez and guest starring in television series such as NYPD Blue, Scrubs and Boston Public led to his being named in 2003 by Teen Vogue as a \"young and upcoming star that's here to stay.\" His very first break came through his involvement in music videos when, in 1989, Wright, along with fellow actor Elijah Wood, appeared in the video for Paula Abdul's single \"Forever Your Girl,\" directed by David Fincher. He subsequently starred opposite singer and cousin Stacie Orrico in the videos for her singles \"Stuck\" (2003), and \"I Could Be the One\" (2004). His first feature-film role was in 1993's Memories by Joe Frank, but it was his role of \"Zach\" in the 2007 independent film Shelter, co-starring Brad Rowe and Ross Thomas, that brought Wright much acclaim and attention. Wright's more recent film roles include Vicious Circle, in which he appeared in the role of the character \"Fin.\" He was also the lead actor in Vacancy 2: The First Cut, the prequel to the 2007 film Vacancy, which had a straight to DVD release on January 20, 2009. His 2010 films include The Social Network and 2001 Maniacs: Field of Screams. Wright is a diehard athlete who enjoys skateboarding, snowboarding, surfing and other extreme type activities. He currently resides in Los Angeles, California. He was previously engaged to actress Odette Yustman before their breakup in 2008.",
        "birthday": "1982-08-23",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 61256,
        "imdb_id": "nm0942901",
        "known_for_department": "Acting",
        "name": "Trevor Wright",
        "place_of_birth": "La Jolla, California, USA",
        "popularity": 0.2223,
        "profile_path": "/2xsRqIdfjwEsquJdoOAIjpx0OyY.jpg"
    }
}