{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/t07Pdtl3rTbE5mBdV8hAggHcGVN.jpg",
                "genre_ids": [
                    35,
                    10751,
                    14
                ],
                "id": 433,
                "original_language": "en",
                "original_title": "Mary Poppins",
                "overview": "Mr Banks is looking for a nanny for his two mischievous children and comes across Mary Poppins, an angelic nanny. She not only brings a change in their lives but also spreads happiness.",
                "popularity": 5.3935,
                "poster_path": "/ei8hhYCMfURfPOXKBnyl61be2iV.jpg",
                "release_date": "1964-12-17",
                "title": "Mary Poppins",
                "video": false,
                "vote_average": 7.56,
                "vote_count": 4833,
                "character": "Bert / Mr. Dawes Sr.",
                "credit_id": "52fe4243c3a36847f8010813",
                "order": 1
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Richard Wayne Van Dyke",
            "Richard Wayne \"Dick\" Van Dyke",
            "ディック・バン・ダイク",
            "دیک ون دایک"
        ],
        "biography": "Richard Wayne Van Dyke (born December 13, 1925) is an American actor, entertainer, and comedian. His award-winning career has spanned seven decades in film, television, and stage. Van Dyke is the recipient of multiple awards, including a Golden Globe, Tony, Grammy, a Daytime Emmy, and four Primetime Emmys. He was inducted into the Television Hall of Fame in 1995 and the Hollywood Walk of Fame in 2012. He was honored with the Screen Actors Guild Life Achievement Award in 2013, the Kennedy Center Honors in 2021 and was recognized as a Disney Legend.\n\nVan Dyke began his career as an entertainer on radio and television, in nightclubs, and on the Broadway stage. In 1961, he starred in the original production of Bye Bye Birdie, a role which earned him the Tony Award for Best Featured Actor in a Musical. Carl Reiner then cast him as Rob Petrie on the CBS television sitcom The Dick Van Dyke Show from 1961 to 1966, which made him a household name. He went on to star in the movie musicals Bye Bye Birdie (1963), Mary Poppins (1964), and Chitty Chitty Bang Bang (1968), and in the comedy-drama The Comic (1969).\n\nVan Dyke also made guest appearances on television programs Columbo (1974) and The Carol Burnett Show (1977), and starred in The New Dick Van Dyke Show (1971–74), Diagnosis: Murder (1993–2001), and Murder 101 (2006–08). Van Dyke has also made appearances in the films Dick Tracy (1990), Curious George (2006), Night at the Museum (2006), Night at the Museum: Secret of the Tomb (2014), and Mary Poppins Returns (2018).",
        "birthday": "1925-12-13",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 61303,
        "imdb_id": "nm0001813",
        "known_for_department": "Acting",
        "name": "Dick Van Dyke",
        "place_of_birth": "West Plains, Missouri, USA",
        "popularity": 1.4017,
        "profile_path": "/jXAeNx7mYdirzMHcqPyj5VXxcXi.jpg"
    }
}