{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ftNimlo6fP4WKRMWnF1ghX4fPUy.jpg",
                "genre_ids": [
                    35,
                    10749,
                    18
                ],
                "id": 6620,
                "original_language": "en",
                "original_title": "Sabrina",
                "overview": "Linus and David Larrabee are the two sons of a very wealthy family. Linus is all work – busily running the family corporate empire, he has no time for a wife and family. David is all play – technically he is employed by the family business, but never shows up for work, spends all his time entertaining, and has been married and divorced three times. Meanwhile, Sabrina Fairchild is the young, shy, and awkward daughter of the household chauffeur, who goes away to Paris for two years, and returns to capture David's attention, while falling in love with Linus.",
                "popularity": 3.8978,
                "poster_path": "/86ix9wBxiMAaISt4HpmXQm6Mlym.jpg",
                "release_date": "1954-09-01",
                "title": "Sabrina",
                "video": false,
                "vote_average": 7.505,
                "vote_count": 1294,
                "character": "Ernest - Houseman (uncredited)",
                "credit_id": "561154c192514147d80090f7",
                "order": 26
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Kay Kuter",
            "Jay E. Kuter",
            "Kay Edwin Emmert Kuter"
        ],
        "biography": "Kay E. Kuter was an American actor best known for his character roles in film and television. He was born on April 25, 1925, in Los Angeles, California. Kuter had a career that spanned several decades, and he appeared in numerous popular movies and TV shows.\n\nKuter's acting career began in the 1950s, and he made his film debut in the 1952 movie \"Thunderbirds.\" Over the years, he appeared in various genres, including dramas, comedies, and westerns. Some of his notable film credits include \"The Last Starfighter\" (1984), \"Warlock\" (1989), \"Six Days, Seven Nights\" (1998), and \"The Princess Diaries\" (2001).\n\nIn addition to his work in films, Kuter was also a familiar face on television. He appeared in numerous TV shows throughout his career, often portraying supporting or character roles. Some of the notable TV series he appeared in include \"Gunsmoke,\" \"The Twilight Zone,\" \"The Mary Tyler Moore Show,\" \"MAS*H,\" and \"Star Trek: The Next Generation.\" He also lent his voice to animated shows such as \"TaleSpin\" and \"Justice League Unlimited.\"\n\nOne of Kuter's most memorable roles was that of the character \"Reverend Buckshot\" in the TV series \"Green Acres\" (1965-1971). His portrayal of the bumbling, absent-minded preacher became a fan favorite and remains one of his most iconic performances.\n\nSadly, Kay E. Kuter passed away on November 12, 2003, at the age of 78, in Burbank, California. Despite his departure, his contributions to the entertainment industry and his memorable performances continue to be appreciated by fans of film and television.",
        "birthday": "1925-04-25",
        "deathday": "2003-11-12",
        "gender": 2,
        "homepage": null,
        "id": 61702,
        "imdb_id": "nm0476484",
        "known_for_department": "Acting",
        "name": "Kay E. Kuter",
        "place_of_birth": "Los Angeles, California, USA",
        "popularity": 0.2675,
        "profile_path": null
    }
}