{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6fRVz7ZIZIGFEOq4THY2pdBBhfS.jpg",
                "genre_ids": [
                    35,
                    10749
                ],
                "id": 934761,
                "original_language": "en",
                "original_title": "A Perfect Pairing",
                "overview": "To land a major client, an LA wine exec travels to an Australian sheep station, where she signs on as a ranch hand and hits it off with a rugged local.",
                "popularity": 4.5866,
                "poster_path": "/rYUsZd0V3I7ub21vf0f4DRzP1n0.jpg",
                "release_date": "2022-05-19",
                "title": "A Perfect Pairing",
                "video": false,
                "vote_average": 6.853,
                "vote_count": 573,
                "character": "Calder",
                "credit_id": "625cdeba42f19f009e558b62",
                "order": 4
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "크레이그 호너"
        ],
        "biography": "From Wikipedia, the free encyclopedia\n\nCraig Horner (born 24 January 1983) is an Australian actor and musician who first appeared in the Australian television program Cybergirl. He is best known for his role as Richard Cypher on the television series Legend of the Seeker.\n\nHorner discovered a love for acting after appearing in school productions of A Midsummer Night's Dream and The Maids. In addition to performing, Horner has been active as a musician, playing the guitar and writing music. He was a member of the band \"Earth For Now\" (called \"Unstable Conditions\" in 2011) who played their first show in Hollywood, California, starting the set with \"Howl at the Moon\". Horner and bandmate Steve Matsumura announced their departure from the band on 2 February 2012. He published two songs on iTunes, \"Avoid\" and \"Say What You Mean\" under the name \"Ithaca\". Horner enjoys playing soccer, volleyball, tennis, swimming, skiing, snowboarding, and kayaking. Craig went to St Peters Lutheran College in Indooroopilly, Brisbane, Australia. After graduating, he pursued acting.\n\nHorner has appeared in various TV programs since 2001: as Jackson in \"Cybergirl\"; as Jesse Spencer's brother in \"Swimming Upstream;\" as a reporter on \"Totally Wild,\" and starred as Caleb in the U.S.'s \"Monarch Cove\". In 2008, Horner joined the cast of the Australian children's drama television series Blue Water High, portraying surfer Garry Miller and then Ash Dove in the series H2O: Just Add Water. He starred as Richard Cypher in Legend of the Seeker, the syndicated television adaptation of Terry Goodkind's Sword of Truth book series.\n\nHe also starred alongside Michael J. Pagan in Gregory Dark's film, See No Evil.",
        "birthday": "1983-01-24",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 61910,
        "imdb_id": "nm0395097",
        "known_for_department": "Acting",
        "name": "Craig Horner",
        "place_of_birth": "Brisbane, Queensland, Australia",
        "popularity": 0.3218,
        "profile_path": "/yxNVRTpwck599ok2GWalIrlmwLz.jpg"
    }
}