{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/vcLpxfpfKCKGiTlUx83CzKxRDT2.jpg",
                "genre_ids": [
                    16,
                    10751
                ],
                "id": 175112,
                "original_language": "en",
                "original_title": "Tinker Bell and the Pirate Fairy",
                "overview": "Zarina, a smart and ambitious dust-keeper fairy who’s captivated by Blue Pixie Dust and its endless possibilities, flees Pixie Hollow and joins forces with the scheming pirates of Skull Rock, who make her captain of their ship. Tinker Bell and her friends must embark on an epic adventure to find Zarina, and together they go sword-to-sword with the band of pirates led by a cabin boy named James, who’ll soon be known as Captain Hook himself.",
                "popularity": 8.2509,
                "poster_path": "/81oxrsugqqs8sAVNX9fdlz57cVU.jpg",
                "release_date": "2014-02-13",
                "title": "Tinker Bell and the Pirate Fairy",
                "video": false,
                "vote_average": 7.0,
                "vote_count": 1038,
                "character": "Bonito (voice)",
                "credit_id": "5430f68ec3a368114300124b",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Карлос Понсе"
        ],
        "biography": "Carlos Ponce is a Puerto Rican actor, singer, composer and television personality.\n\nPonce was born in Santurce, Puerto Rico. His parents, Carlos Ponce, Sr. and Esther Freyre, emigrated from Cuba after the Cuban Revolution led by Fidel Castro. After his birth, the family moved to Humacao where Ponce was raised. As a child, he would actively participate in his school's plays and at home he would often put on a show for the family where he would sing the latest tunes. \"Carlitos\", as he is known in Puerto Rico, started to appear in television commercials at the age of six. He attended high school in Humacao and was a member of the school's drama club. In 1986, the Ponce family moved to Miami, Florida and Ponce continued to participate in his school's productions. He was named the best student actor of the southern region of the United States.  In 1990, Ponce participated in the Southeastern Theatre Conference and competed for the chance to win a scholarship. He won and enrolled in the New World School of the Arts conservatory. However, the Spanish-language television station Univision offered Ponce the opportunity to host a show called Hablando (Talking). This was his first serious television debut and after his debut he gave up his university studies.",
        "birthday": "1972-09-04",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 62067,
        "imdb_id": "nm0005317",
        "known_for_department": "Acting",
        "name": "Carlos Ponce",
        "place_of_birth": "Santurce, Puerto Rico",
        "popularity": 0.8734,
        "profile_path": "/elNTDau1yinXHgWht9EInLDftxH.jpg"
    }
}