{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2D08E4pqE95FM8yOJ3gOy5zWaW0.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 10634,
                "original_language": "en",
                "original_title": "Friday",
                "overview": "Craig and Smokey are two guys in Los Angeles hanging out on their porch on a Friday afternoon, smoking and drinking, looking for something to do.",
                "popularity": 6.6843,
                "poster_path": "/g57KcE8tbpp3RK3DlIhPkfA6DE2.jpg",
                "release_date": "1995-04-26",
                "title": "Friday",
                "video": false,
                "vote_average": 7.1,
                "vote_count": 1909,
                "character": "Big Worm",
                "credit_id": "52fe43999251416c75016b01",
                "order": 8
            },
            {
                "adult": false,
                "backdrop_path": "/dfkE2LppPbJ1qUzi3tdND5iuMFp.jpg",
                "genre_ids": [
                    35,
                    80
                ],
                "id": 10607,
                "original_language": "en",
                "original_title": "Don't Be a Menace to South Central While Drinking Your Juice in the Hood",
                "overview": "When Ashtray moves to South Central L.A. to live with his father (who appears to be the same age he is) and grandmother (who likes to talk tough and smoke reefer), he falls in with his gang-banging cousin Loc Dog, who along with the requisite pistols and Uzi carries a thermo-nuclear warhead for self-defense. Will Ashtray be able to keep living the straight life?",
                "popularity": 6.7019,
                "poster_path": "/HZQBF7JDd2e9p4rPSbSHuWHaCC.jpg",
                "release_date": "1996-01-12",
                "title": "Don't Be a Menace to South Central While Drinking Your Juice in the Hood",
                "video": false,
                "vote_average": 7.03,
                "vote_count": 1402,
                "character": "Rufus",
                "credit_id": "54b8370f9251411d77002a1b",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Langston Faizon Santisima",
            "Faison Love",
            "فیژن لاو"
        ],
        "biography": "Faizon Andre Love (born Langston Faizon Santisima; June 14, 1968) is an American actor and comedian. He is best known for his roles in the comedy films The Meteor Man, Don't Be a Menace, Friday, B*A*P*S, Elf, The Replacements, Made, Mr Bones, and Couples Retreat, as well as the voice of Sean \"Sweet\" Johnson in the video game Grand Theft Auto: San Andreas and his role as Wendell Wilcox on The Parent 'Hood.\n\nHe got his start as a stand-up comedian and made his acting debut Off-Broadway at the age of nineteen. His motion picture debut, Bebe's Kids had him providing the voice of late comedian Robin Harris. He then had a role in The Meteor Man starring Robert Townsend. Townsend then cast Love in a co-starring role on his sitcom The Parent 'Hood. He followed up this role with a breakout performance as the drug dealer Big Worm in the 1995 film Friday.\n\nFollow-up films have included Elf, Don't Be a Menace to South Central While Drinking Your Juice in the Hood, Money Talks, Wonderland, The Fighting Temptations, and Idlewild. Love gained wider appeal when he co-starred in the 2009 film, Couples Retreat, a comedy chronicling four couples who partake in therapy sessions at a tropical island resort. His most recent role is that of Kurtis Kool in 2011’s Big Mommas: Like Father, Like Son. Many gamers may also know him for his role as Sean \"Sweet\" Johnson, simply known as Sweet, in the Rockstar North game Grand Theft Auto: San Andreas.",
        "birthday": "1968-06-14",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 62066,
        "imdb_id": "nm0522324",
        "known_for_department": "Acting",
        "name": "Faizon Love",
        "place_of_birth": "Santiago de Cuba, Cuba",
        "popularity": 0.52,
        "profile_path": "/dK3hUGpG3SzmqTCy6rQzyK6YaCy.jpg"
    }
}