{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/lWcNlDMmZ6xJVoCZjhFxqVl0TIa.jpg",
                "genre_ids": [
                    28,
                    80,
                    18,
                    36,
                    53
                ],
                "id": 388399,
                "original_language": "en",
                "original_title": "Patriots Day",
                "overview": "In the aftermath of an unspeakable act of terror, Police Sergeant Tommy Saunders joins courageous survivors, first responders and investigators in a race against the clock to hunt down the Boston Marathon bombers before they strike again.",
                "popularity": 4.733,
                "poster_path": "/mIDxsJTrOC7NhgOo3GziiHyKfsQ.jpg",
                "release_date": "2016-12-12",
                "title": "Patriots Day",
                "video": false,
                "vote_average": 7.057,
                "vote_count": 2728,
                "character": "Tamerlan's Surgeon",
                "credit_id": "6799bacf0400ec6f45c0c7ae",
                "order": 51
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Linda Klein, R.N.",
            "Linda Klein, RN"
        ],
        "biography": "Linda Klein is an American registered nurse, actress and television producer. After becoming an R.N. she pursued a career as a surgical nurse She was a cast member on the 90s network medical drama Chicago Hope while also serving as an associate producer and technical advisor for the series. Later, Klein portrayed Nurse Linda in all six seasons of the acclaimed FX drama Nip/Tuck, where she also acted as a medical consultant for the first three seasons and a producer for the fifth and sixth. She also has a recurring role as a nurse on the television show Grey's Anatomy.\n\nHer other appearances in television nursing roles include those in 24, Boston Public, J.A.G, Monk, Doogie Howser, M.D. and Six Feet Under. She has occasionally appeared in feature films, typically in medical roles, including Hard to Kill (1990) and an appearance as a doctor in Very Bad Things (1998). When not in front of or behind the camera, Linda is an avid golfer.",
        "birthday": null,
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 62156,
        "imdb_id": "nm0458868",
        "known_for_department": "Acting",
        "name": "Linda Klein",
        "place_of_birth": null,
        "popularity": 0.2117,
        "profile_path": "/zvIQYPvKysDMZMq5iP789i0ugDH.jpg"
    }
}