{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ulVUa2MvnJAjAeRt7h23FFJVRKH.jpg",
                "genre_ids": [
                    12,
                    16,
                    14
                ],
                "id": 81,
                "original_language": "ja",
                "original_title": "風の谷のナウシカ",
                "overview": "After a global war, the seaside kingdom known as the Valley of the Wind remains one of the last strongholds on Earth untouched by a poisonous jungle and the powerful insects that guard it. Led by the courageous Princess Nausicaä, the people of the Valley engage in an epic struggle to restore the bond between humanity and Earth.",
                "popularity": 8.0634,
                "poster_path": "/tcrkfB8SRPQCgwI88hQScua6nxh.jpg",
                "release_date": "1984-03-11",
                "title": "Nausicaä of the Valley of the Wind",
                "video": false,
                "vote_average": 8.0,
                "vote_count": 3818,
                "character": "Asbel (voice)",
                "credit_id": "52fe4215c3a36847f8002843",
                "order": 3
            },
            {
                "adult": false,
                "backdrop_path": "/gl0jzn4BupSbL2qMVeqrjKkF9Js.jpg",
                "genre_ids": [
                    12,
                    14,
                    16
                ],
                "id": 128,
                "original_language": "ja",
                "original_title": "もののけ姫",
                "overview": "Ashitaka, a prince of the disappearing Emishi people, is cursed by a demonized boar god and must journey to the west to find a cure. Along the way, he encounters San, a young human woman fighting to protect the forest, and Lady Eboshi, who is trying to destroy it. Ashitaka must find a way to bring balance to this conflict.",
                "popularity": 14.4236,
                "poster_path": "/cMYCDADoLKLbB83g4WnJegaZimC.jpg",
                "release_date": "1997-07-12",
                "title": "Princess Mononoke",
                "video": false,
                "vote_average": 8.327,
                "vote_count": 8526,
                "character": "Ashitaka (voice)",
                "credit_id": "52fe421bc3a36847f800499d",
                "order": 0
            },
            {
                "adult": false,
                "backdrop_path": "/3c59KMNs2MYqXUb2GZe8Yfwn4kb.jpg",
                "genre_ids": [
                    14,
                    16,
                    18,
                    878
                ],
                "id": 14069,
                "original_language": "ja",
                "original_title": "時をかける少女",
                "overview": "When 17-year-old Makoto Konno gains the ability to 'leap' backwards through time, she immediately sets about improving her grades and preventing personal mishaps. However, she soon realises that changing the past isn't as simple as it seems, and eventually, will have to rely on her new powers to shape the future of herself and her friends.",
                "popularity": 4.6549,
                "poster_path": "/xHnlWM8BmqY419YUccYy2KC5Jqo.jpg",
                "release_date": "2006-07-15",
                "title": "The Girl Who Leapt Through Time",
                "video": false,
                "vote_average": 7.8,
                "vote_count": 2120,
                "character": "Sojiro Takase (voice)",
                "credit_id": "5f348c36f6fd18003628bad1",
                "order": 26
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Yôji Matsuda",
            "یوجی ماتسودا",
            "Youji Matsuda",
            "Yōji Matsuda",
            "Yohji Matsuda",
            "松田 洋治"
        ],
        "biography": "Yoji Matsuda (松田 洋治, Matsuda Yōji, born October 19, 1967) is a Japanese actor and voice actor from Tokyo, Japan.\n\nHe was born in Setagaya, Tokyo. His older brother is Naoyuki Matsuda, a musical translator and professor at Komazawa University. After studying at Aoyama Gakuin High School, he dropped out of Aoyama Gakuin University's Faculty of Letters and Department of Education. Among his classmates is a member of the Diet and the House of Councilors Renhō (his classmate from high school to university). He joined the Himawari Theatre Group at age five and made his child debut in the TV drama Mother's Suzu in 1974.\n\nHe gained attention as an actor in the 1983 TBS television drama Family Game (as Shigeyuki Numata). He appeared in Nausicaä of the Valley of the Wind in 1984, and, in 1987, portrayed the main character Shuna in Shuna's Journey. In 1997, he voiced Ashitaka in the anime movie Princess Mononoke, and voiced Leonardo DiCaprio's role Jack Dawson in the American film Titanic to raise his profile. In 2006, he taught acting as a lecturer at Tokyo Animation College. He became active around the stage, working with directors such as Yukio Ninagawa and Yoji Aoi. He appeared in the drama From the North Country.",
        "birthday": "1967-10-19",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.actrain-club.com/talents/?id=1467554245-084448",
        "id": 622,
        "imdb_id": "nm0559444",
        "known_for_department": "Acting",
        "name": "Yoji Matsuda",
        "place_of_birth": "Tokyo, Tokyo Prefecture, Japan",
        "popularity": 1.3525,
        "profile_path": "/42WeHwCymsgJh3mLAyknCdRcef8.jpg"
    }
}