{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/vJbEUMeI2AxBUZKjP6ZVeVNNTLh.jpg",
                "genre_ids": [
                    28,
                    53,
                    35
                ],
                "id": 749170,
                "original_language": "en",
                "original_title": "Heads of State",
                "overview": "The UK Prime Minister and US President have a public rivalry that risks their countries' alliance. But when they become targets of a powerful enemy, they're forced to rely on each other as they go on a wild, multinational run. Allied with Noel, a brilliant MI6 agent, they must find a way to thwart a conspiracy that threatens the free world.",
                "popularity": 29.7976,
                "poster_path": "/lVgE5oLzf7ABmzyASEVcjYyHI41.jpg",
                "release_date": "2025-06-24",
                "title": "Heads of State",
                "video": false,
                "vote_average": 6.915,
                "vote_count": 737,
                "character": "AF1 Pilot",
                "credit_id": "68657e39420e789dc78e631a",
                "order": 32
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Matthew Guy Charles Chambers (born 20 August 1968) is an English actor, known for portraying the role of Daniel Granger in the BBC soap opera Doctors. Matthew Guy Charles Chambers was born in London on 20 August 1968, and has one brother. Chambers and wife, Aisha, have two daughters.\n\nChambers began his television career in 2003 with a main role in the Sky One series Mile High. Later that year, he appeared in the television film Final Demand and an episode of the BBC medical drama Holby City. He then made appearances in television series such as As If, Family Affairs, and Doctor Who, in the episode \"42\". He then had a role in an adaptation of Lady Godiva, which was released in 2008. On 9 July 2007, Chambers made his debut appearance in the role of Daniel Granger in the BBC daytime soap opera Doctors. After 16 years in the role, he made his final appearance in 2023.  During his time on the soap, Chambers directed 18 episodes.",
        "birthday": "1968-08-20",
        "deathday": null,
        "gender": 2,
        "homepage": "https://markjerminmanagement.co.uk/actor/matthew-chambers/",
        "id": 62499,
        "imdb_id": "nm1328619",
        "known_for_department": "Acting",
        "name": "Matthew Chambers",
        "place_of_birth": "Lewisham, London, England, UK",
        "popularity": 0.085,
        "profile_path": "/xOuM7SIaw9D5Ao35AH6Zx2B6D40.jpg"
    }
}