{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/rLm66DbLwxHeRB34oJ1mhsu0urc.jpg",
                "genre_ids": [
                    27,
                    53,
                    18
                ],
                "id": 11167,
                "original_language": "en",
                "original_title": "Peeping Tom",
                "overview": "Loner Mark Lewis works at a film studio during the day and, at night, takes racy photographs of women. Also he's making a documentary on fear, which involves recording the reactions of victims as he murders them. He befriends Helen, the daughter of the family living in the apartment below his, and he tells her vaguely about the movie he is making.",
                "popularity": 2.1133,
                "poster_path": "/kM4AfLIlbcuRZ621vYjyeBFkuba.jpg",
                "release_date": "1960-05-16",
                "title": "Peeping Tom",
                "video": false,
                "vote_average": 7.447,
                "vote_count": 847,
                "character": "Mark Lewis",
                "credit_id": "52fe44069251416c75026581",
                "order": 0
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Karl-Heinz Böhm",
            "Karlheinz Böhm",
            "Karl Böhm",
            "Carl Böhm",
            "Karlheinz Boehm",
            "Karl-Heinz Boehm",
            "Carl Boehm"
        ],
        "biography": "Karlheinz Böhm was an Austrian actor. The son of conductor Karl Böhm, he is best known internationally for his role as Mark, the psychopathic protagonist of Peeping Tom, directed by Michael Powell. Before that, he had played the young Emperor Franz Joseph I of Austria in the three Sissi movies. He made three notable U.S. films in 1962. He played Jakob Grimm in the 1962 MGM-Cinerama spectacular The Wonderful World of the Brothers Grimm and Ludwig van Beethoven in the Walt Disney film The Magnificent Rebel. (The latter film was made especially for the Disney anthology television series, but was released theatrically in Europe.) He appeared in a villainous role as the Nazi-sympathizing son of Paul Lukas in the MGM film Four Horsemen of the Apocalypse, a Technicolor, widescreen remake of the 1921 silent Rudolph Valentino film. Between 1974 and 1975, Böhm appeared prominently in four consecutive films from prolific New German Cinema director Rainer Werner Fassbinder: Martha, Effi Briest, Faustrecht der Freiheit (aka Fistfight of Freedom or Fox and His Friends), and Mutter Küsters' Fahrt zum Himmel (Mother Küsters' Trip to Heaven). In 2009 he provided the German voice for Charles Muntz, villain in Pixar's tenth animated feature Up. Since 1981, when he founded Menschen für Menschen (\"Humans for Humans\"), Böhm had been actively involved in charitable work in Ethiopia, for which in 2007 he was awarded the Balzan Prize for Humanity, Peace and Brotherhood among Peoples. Karlheinz Böhm has been married to Almaz Böhm, a native of Ethiopia, since 1991. They had two children, Nicolas (born 1990) and Aida (born 1993). Böhm had five more children from previous marriages, among them, the actress Katharina Böhm (born 1964). In 2011 Almaz and Karlheinz Böhm were awarded the Essl Social Prize for the project Menschen für Menschen. He died in 2014, aged 86.",
        "birthday": "1928-03-16",
        "deathday": "2014-05-29",
        "gender": 2,
        "homepage": null,
        "id": 6251,
        "imdb_id": "nm0003337",
        "known_for_department": "Acting",
        "name": "Karlheinz Böhm",
        "place_of_birth": "Darmstadt, Germany",
        "popularity": 0.2336,
        "profile_path": "/zQ9xw9dcXFSoaD3rncUg1XDLokt.jpg"
    }
}