{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/uxjPyKutAtw7lHZ3mHg0MzQvAK9.jpg",
                "genre_ids": [
                    9648,
                    18,
                    53
                ],
                "id": 10403,
                "original_language": "en",
                "original_title": "The Player",
                "overview": "A Hollywood studio executive is being sent death threats by a writer whose script he rejected - but which one?",
                "popularity": 3.4749,
                "poster_path": "/tZ3kDut2dhFVGkWNEn9xoCHCNAx.jpg",
                "release_date": "1992-05-08",
                "title": "The Player",
                "video": false,
                "vote_average": 7.2,
                "vote_count": 878,
                "character": "Jack Riley",
                "credit_id": "6356ce8543250f007d0524b0",
                "order": 80
            },
            {
                "adult": false,
                "backdrop_path": "/bQEIYntlPba76NN41uWxIzUmzBb.jpg",
                "genre_ids": [
                    18
                ],
                "id": 4995,
                "original_language": "en",
                "original_title": "Boogie Nights",
                "overview": "Set in 1977, back when sex was safe, pleasure was a business and business was booming, idealistic porn producer Jack Horner aspires to elevate his craft to an art form. Horner discovers Eddie Adams, a hot young talent working as a busboy in a nightclub, and welcomes him into the extended family of movie-makers, misfits and hangers-on that are always around. Adams' rise from nobody to a celebrity adult entertainer is meteoric, and soon the whole world seems to know his porn alter ego, \"Dirk Diggler\". Now, when disco and drugs are in vogue, fashion is in flux and the party never seems to stop, Adams' dreams of turning sex into stardom are about to collide with cold, hard reality.",
                "popularity": 11.9692,
                "poster_path": "/wnE24UPCPQsQnbBOu4zVE2qaDNm.jpg",
                "release_date": "1997-10-10",
                "title": "Boogie Nights",
                "video": false,
                "vote_average": 7.634,
                "vote_count": 3315,
                "character": "Lawyer",
                "credit_id": "5890e5a092514103e4009ca6",
                "order": 59
            },
            {
                "adult": false,
                "backdrop_path": "/g3KOnOycUThwV4PRjtiAK0CuzID.jpg",
                "genre_ids": [
                    9648,
                    18,
                    80
                ],
                "id": 1847,
                "original_language": "en",
                "original_title": "The Long Goodbye",
                "overview": "In 1970s Hollywood, Detective Philip Marlowe tries to help a friend who is accused of murdering his wife.",
                "popularity": 2.9866,
                "poster_path": "/oBhUK54yBJ0aH6u9zCzSV5iV7OP.jpg",
                "release_date": "1973-03-08",
                "title": "The Long Goodbye",
                "video": false,
                "vote_average": 7.4,
                "vote_count": 703,
                "character": "Riley",
                "credit_id": "5cd18f459251410b62264b5f",
                "order": 17
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "John Albert Riley Jr."
        ],
        "biography": "John Albert Riley Jr. (December 30, 1935 – August 19, 2016) was an American actor, comedian and writer. He was known for playing Elliot Carlin, a chronic psychology client of the main character on The Bob Newhart Show, and for voicing Stu Pickles, one of the parents in the animated Rugrats franchise.\n\nRiley was born in Cleveland, Ohio, the son of Agnes C. Riley (née Corrigan) and John Albert Riley. After attending Saint Ignatius High School and John Carroll University, he served in the U.S. Army.\n\nAfter being discharged, Riley became a popular radio personality in Cleveland, along with his radio partner and \"straight man\" Jeff Baxter; The Baxter & Riley Show on WERE (1300 AM) featured not only music but comedy sketches and a slew of offbeat characters that Riley and Baxter voiced. Riley gave up the radio show in the mid-1960s and moved to Los Angeles, where his Cleveland friend Tim Conway helped him obtain work writing comedy sketches, which later led to acting opportunities.\n\nFirst a semi-regular in the cast of the 1960s sitcom Occasional Wife, a short-lived show on NBC in which he played Wally Frick, Riley was perhaps most famous for playing Elliot Carlin, the neurotic, sour, and selfish patient on The Bob Newhart Show 1972–1978. In 1973, he was cast as Gomez Addams in The Addams Family Fun-House, then in 1979, he starred in ABC's holiday telefilm The Halloween That Almost Wasn't (a.k.a. The Night Dracula Saved The World) as Warren the Werewolf (Wolf Man) of Budapest. Riley then, in 1980, appeared in a comedy special for HBO called The Wild Wacky Wonderful World of Winter. He was a regular cast member in The Tim Conway Show, a comedy-variety show that aired on CBS from March 1980 through late summer 1981, acting in sketch comedy in each episode. In 1985, he reprised his Bob Newhart Show role of Elliot Carlin on St. Elsewhere, and did so again in a 1987 episode of ALF.\n\nAmong his other TV credits are multiple appearances on such shows as Rowan & Martin's Laugh-In (parodying Lyndon Johnson), M*A*S*H, Barney Miller, Hogan's Heroes, The Mary Tyler Moore Show, One Day at a Time, Gomer Pyle, Diff'rent Strokes, and Night Court. He was also a favorite of Mel Brooks, appearing in several of his films: High Anxiety (1977), History of the World: Part I (1981), To Be or Not to Be (1983), and (cameo only) Spaceballs (1987).\n\nRiley often provided voiceovers for television and radio commercials, most notably in spots for Country Crock margarine. He also voiced the character \"P.C. Modem, the computer genius\" in radio commercials for CompUSA that aired in the 1990s. In the 1990s and early 2000s, Riley was known for voicing Stu Pickles (father of the main protagonist Tommy) in the animated series Rugrats. The franchise consisted of the TV series, the spin-off All Grown Up! and the film trilogy.\n\nHe continued to make guest appearances during the 1990s in popular sitcoms, showing up in episodes of Seinfeld, Son of the Beach, Friends, Coach, The Drew Carey Show, That '70s Show, and, in a gag appearance, as an unnamed but obvious Mr. Carlin in a 1988 episode of Newhart. He made a cameo appearance on the November 23, 2013, episode of Saturday Night Live, as a subway passenger during the sketch \"Matchbox 3\". That episode would be his final acting role.",
        "birthday": "1935-12-30",
        "deathday": "2016-08-19",
        "gender": 2,
        "homepage": null,
        "id": 62590,
        "imdb_id": "nm0727051",
        "known_for_department": "Acting",
        "name": "Jack Riley",
        "place_of_birth": "Cleveland, Ohio, USA",
        "popularity": 0.3955,
        "profile_path": "/wxkTQp3bl50tRTD3KGDL3dqH3Y3.jpg"
    }
}