{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/zJeYB7rX1kg5kVmzB0kxbvxmYOl.jpg",
                "genre_ids": [
                    18
                ],
                "id": 87093,
                "original_language": "en",
                "original_title": "Big Eyes",
                "overview": "In the late 1950s and early '60s, artist Walter Keane achieves unbelievable fame and success with portraits of saucer-eyed waifs. However, no one realizes that his wife, Margaret, is the real painter behind the brush. Although Margaret is horrified to learn that Walter is passing off her work as his own, she is too meek to protest too loudly. It isn't until the Keanes' marriage comes to an end and a lawsuit follows that the truth finally comes to light.",
                "popularity": 3.7129,
                "poster_path": "/203HAjJcLMl7xThcTqZx4zmEGcV.jpg",
                "release_date": "2014-12-24",
                "title": "Big Eyes",
                "video": false,
                "vote_average": 6.979,
                "vote_count": 3541,
                "character": "Hipster Lady",
                "credit_id": "56479d22c3a36826010047c4",
                "order": 64
            },
            {
                "adult": false,
                "backdrop_path": "/4yN3l7ZQgGDZOewvoiWKcLt7EVb.jpg",
                "genre_ids": [
                    16,
                    10751,
                    14
                ],
                "id": 57737,
                "original_language": "en",
                "original_title": "Barbie: A Fairy Secret",
                "overview": "Get ready for Barbie: A Fairy Secret, an amazing adventure with Barbie where she discovers there are fairies living secretly all around us! When Ken is suddenly whisked away by a group of fairies, Barbie's two fashion stylist friends reveal they are actually fairies and that Ken has been taken to a magical secret fairy world not far away! Barbie and her rival Raquelle take off with the fairy friends on an action-packed journey to bring him back. Along the way they must stick together and learn that the real magic lies not just in the fairy world itself, but in the power of friendship.",
                "popularity": 10.4687,
                "poster_path": "/wn2aoYKOonwMNKkzfgO5y4ji8pB.jpg",
                "release_date": "2011-03-01",
                "title": "Barbie: A Fairy Secret",
                "video": false,
                "vote_average": 6.873,
                "vote_count": 523,
                "character": "Raquelle (voice)",
                "credit_id": "58cd3af29251415a6100cfb8",
                "order": 2
            },
            {
                "adult": false,
                "backdrop_path": "/wWWXd27yF8sK9bLgAD4zxiGcYJW.jpg",
                "genre_ids": [
                    10751,
                    16
                ],
                "id": 44874,
                "original_language": "en",
                "original_title": "Barbie: A Fashion Fairytale",
                "overview": "Join Barbie in a colourful, modern-day fairytale filled with fashion, friends and fun! Barbie and her dog Sequin jet off to visit her Aunt's amazing fashion house in Paris, and much to her surprise it's about to be shut down forever. After she discovers three enchanting Flairies with sparkle-magic powers, Barbie comes up with a brilliant idea to save the business. She even inspires Alice, a shy fashion designer, and together they create a dazzling runway fashion show. Barbie shows that magic happens when you believe in yourself.",
                "popularity": 2.5553,
                "poster_path": "/bFnf8f8DXdCANQ7Y62djgubhh4P.jpg",
                "release_date": "2010-09-14",
                "title": "Barbie: A Fashion Fairytale",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 772,
                "character": "Raquelle (voice)",
                "credit_id": "5cfbbab10e0a263807cacd59",
                "order": 8
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Brit Irvin",
            "Brittney Irvine",
            "Britt Irvine",
            "Brittney Elizabeth Irvin",
            "Brittney Irvin"
        ],
        "biography": "Brittney \"Britt\" Irvin was born on November 10th, 1984 in Vancouver, B.C., Canada. She began dancing ballet when she was 6-years-old and, shortly after, started taking music more seriously and began singing in festivals. She decided she wanted to start acting, too. When she turned ten, she claimed roles in two musicals, \"Show Boat\" and \"A Christmas Carol\". Shortly thereafter, she did voice work in the television series, Nilus the Sandman (1996). She also did several commercials in-between.\n\nNot too long after these accomplishments, Brittney starred in two TV movies in 1996, Panic in the Skies! (1996) and The Angel of Pennsylvania Avenue (1996). Before landing her two-year role on the 1998-99 series, Little Men (1998), Brittney did guest roles on shows such as Sleepwalkers (1997), NightMan (1997) and The Outer Limits (1995). After a guest role on Stargate SG-1 (1997), Brittney made the TV movie, The Wonderful World of Disney: Angels in the Infield (2000).\n\nAfter this, Brittney's career has taken off, her having done many other TV movies and guest appearances since then, including So Weird (1999), where she met her good friend, Alexz Johnson. Brittney's most recent roles include the MTV movie, Wasted (2002), and guest roles on Mary-Kate and Ashley in Action! (2001), Beyond Belief: Fact or Fiction (1997) and The Outer Limits (1995) (again). Brittney is also an accomplished singer and voice-over artist (she's done countless voice-overs for many TV series, including Sabrina, the Animated Series (1999) and Madeline: My Fair Madeline (2002).",
        "birthday": "1984-11-10",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 62866,
        "imdb_id": "nm0410127",
        "known_for_department": "Acting",
        "name": "Britt Irvin",
        "place_of_birth": "Vancouver, British Columbia, Canada",
        "popularity": 0.574,
        "profile_path": "/kBur7ANcUpwqm3ZWrRZhJ5kB7MZ.jpg"
    }
}