{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/yFuKvT4Vm3sKHdFY4eG6I4ldAnn.jpg",
                "genre_ids": [
                    28,
                    12,
                    878
                ],
                "id": 1771,
                "original_language": "en",
                "original_title": "Captain America: The First Avenger",
                "overview": "During World War II, Steve Rogers is a sickly man from Brooklyn who's transformed into super-soldier Captain America to aid in the war effort. Rogers must stop the Red Skull – Adolf Hitler's ruthless head of weaponry, and the leader of an organization that intends to use a mysterious device of untold powers for world domination.",
                "popularity": 9.4605,
                "poster_path": "/vSNxAJTlD0r02V9sPYpOjqDZXUK.jpg",
                "release_date": "2011-07-22",
                "title": "Captain America: The First Avenger",
                "video": false,
                "vote_average": 7.005,
                "vote_count": 22138,
                "character": "Roeder",
                "credit_id": "5776f373c3a368472c00089d",
                "order": 43
            },
            {
                "adult": false,
                "backdrop_path": "/d9ISNkCasZmkvL7YFw2J4ddQv3j.jpg",
                "genre_ids": [
                    28,
                    53
                ],
                "id": 8681,
                "original_language": "en",
                "original_title": "Taken",
                "overview": "Bryan Mills, a former government operative, is trying to reconnect with his teenage daughter Kim. After reluctantly agreeing with his ex-wife to let Kim go to Paris on vacation with a friend, his worst nightmare comes true. While on the phone with his daughter shortly after she arrives in Paris, she and her friend are abducted by a gang of human traffickers. Working against the clock, Bryan relies on his extensive training and skills to track down the ruthless gang that abducted her and launch a one-man war to rescue his daughter.",
                "popularity": 13.7067,
                "poster_path": "/y5Va1WXDX6nZElVirPrGxf6w99B.jpg",
                "release_date": "2008-02-18",
                "title": "Taken",
                "video": false,
                "vote_average": 7.398,
                "vote_count": 11656,
                "character": "Dardan",
                "credit_id": "59850dc7c3a3687573011b93",
                "order": 27
            },
            {
                "adult": false,
                "backdrop_path": "/huZZBPyYUnMPCnrAFyJhnwYsQx9.jpg",
                "genre_ids": [
                    28,
                    878,
                    53
                ],
                "id": 7299,
                "original_language": "en",
                "original_title": "Equilibrium",
                "overview": "In a dystopian future, a totalitarian regime maintains peace by subduing the populace with a drug, and displays of emotion are punishable by death. A man in charge of enforcing the law rises to overthrow the system.",
                "popularity": 7.2429,
                "poster_path": "/eW3YrxOh3rd6PnRgMSftYoflvfe.jpg",
                "release_date": "2002-12-06",
                "title": "Equilibrium",
                "video": false,
                "vote_average": 7.044,
                "vote_count": 4745,
                "character": "Crematory Technician",
                "credit_id": "59a5edcdc3a36840560146ce",
                "order": 19
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Anatol Taubman"
        ],
        "biography": "Anatole Taubman was born in Zurich, Switzerland and is of Russian-Polish-Slovakian-Austrian-and-former-East-Prussian blood. In 1991 he made his baccalauréat at the renowned Gymnasium of the Benedictine boarding school of the monastery Einsiedeln and in 1994 he graduated from the reputable drama-school 'Circle in the Square' in NYC. He's fluent in five languages (English, French, Swiss-German, German and Italian) and is also truly cosmopolitan in his work. Taubman has starred and co-starred in over 50 feature films and TV productions. Since 1998, he has been busy working and with international success in the UK, France, Germany, Switzerland and for the USA throughout Europe and beyond. Among other credits Anatole Taubman is best known for his impressive English-language TV work in Band of Brothers (HBO), Servants (BBC), POW (ITV), Spooks VI (BBC), Waking The Dead VII - Pièta (BBC) or The Tudors II (Showtime) and established himself as a fine character actor in feature films like Mein Name is Bach (CH/D), Luther (D), Marmorera (CH), Fay Grim (USA), Snipers Valley (D), Secret Défense (F), Taken / 96 Hours (F / USA) and in 2009 Pope Joan (D), Same Same But Different (D) or in Chanel & Stravinsky (F).",
        "birthday": "1971-12-23",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 62892,
        "imdb_id": "nm0851458",
        "known_for_department": "Acting",
        "name": "Anatole Taubman",
        "place_of_birth": "Zurich, Switzerland",
        "popularity": 0.2432,
        "profile_path": "/A7B7POXpFyNg7C36fGxVc4EiR2W.jpg"
    }
}