{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/ra9surFrWYvIL0pWcm3MrxmPhTg.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 90369,
                "original_language": "en",
                "original_title": "Now Is Good",
                "overview": "A girl dying of leukemia compiles a list of things she'd like to do before passing away. Topping the list is her desire to lose her virginity.",
                "popularity": 1.849,
                "poster_path": "/oOBHF6qWtMkzwpnrLDTKJPAb3zH.jpg",
                "release_date": "2012-09-19",
                "title": "Now Is Good",
                "video": false,
                "vote_average": 7.3,
                "vote_count": 1089,
                "character": "Caroline",
                "credit_id": "5847b1aac3a3681411005a58",
                "order": 15
            },
            {
                "adult": false,
                "backdrop_path": "/8jN59DDt6ZgYn6g4QSao2Erpolm.jpg",
                "genre_ids": [
                    10749,
                    35
                ],
                "id": 25195,
                "original_language": "en",
                "original_title": "Leap Year",
                "overview": "When yet another anniversary passes without a marriage proposal from her boyfriend, Anna decides to take action. Aware of a Celtic tradition that allows women to pop the question on Feb. 29, she plans to follow her lover to Dublin and ask him to marry her. Fate has other plans, however, and Anna winds up on the other side of the Emerald Isle with handsome, but surly, Declan -- an Irishman who may just lead Anna down the road to true love.",
                "popularity": 5.1592,
                "poster_path": "/i86hMi5iEF3WnYLCaGHdT5FPdYg.jpg",
                "release_date": "2010-01-08",
                "title": "Leap Year",
                "video": false,
                "vote_average": 6.899,
                "vote_count": 2086,
                "character": "Gaelic Air Rep 2",
                "credit_id": "5b7739dc0e0a2647310000a2",
                "order": 24
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Sarah Hadland is an English actress. She is best known for her role as Stevie Sutton in BBC One's BAFTA-nominated comedy television series Miranda (2009–2015) and Trish in The Job Lot (2013–2015).\n\nHadland appeared as the Ocean Sky receptionist in the 2008 James Bond film Quantum of Solace. Her other movie roles include Magicians (2007), Leap Year (2010) and Learners (2007). Hadland appeared in the comedy-drama television series Moving Wallpaper (2008–2009) as script writer Gillian McGovern, and had roles in the British comedy TV shows That Mitchell and Webb Look (2008–2010), Horrible Histories (2009, 2012–2013, 2015), The Job Lot (2013–2015) and Brotherhood (2015). She appeared in the BBC miniseries The Moonstone (2016).\n\nHadland was born in St Albans, Hertfordshire, England, on 15 May 1971. During her schooling at Wilmslow High School in Cheshire, she became involved in amateur dramatics with the Tempo youth group in Wilmslow. She later trained at Laine Theatre Arts. Hadland has one child, a daughter.\n\nFollowing her training, Hadland began her theatre career at the age of 19, appearing in musicals such as Cats and Grease in London's West End.\n\nAfter six years, she transferred to touring theatre, including performances in Who's Afraid of Virginia Woolf?. During this period, she began to develop her talents as a voiceover artist, with credits including the white kitten in the Catsan commercial and the America surfer girl in a VO5 shampoo advert. She provided additional voice work for the PlayStation 2 video game Dragon Quest VIII.\n\nHadland's television career began with supporting roles in Bad Girls and The Bill, before she moved on to larger roles in the comedies Green Wing and Broken News. In addition, she appeared in the films Confetti and Magicians alongside comedians David Mitchell and Robert Webb, and BBC One's Learners. Hadland also played characters for their comedy sketch show That Mitchell and Webb Look. In November 2009, Hadland joined Miranda Hart in the BBC comedy series Miranda, based upon the BBC Radio 2 series Miranda Hart's Joke Shop and featuring the same principal actors.\n\nFrom 2007 to 2012, she had a recurring role in the BBC Radio 4 comedy series Bleak Expectations, a parody of Charles Dickens' novels, and of Victoriana in general. Hadland provided the voice of Lily (née Bin) Sourquill, the daughter of Sir Philip ('Pip') Bin over the four series to date. She also voiced the characters Ripely Fecund (Pip's third wife, in series 2) and Miss Christmasham (a parody of Great Expectations' Miss Havisham, in series 3).\n\nIn 2011, Hadland was cast as the new English teacher, Linda Radleigh, in the BBC drama Waterloo Road. She also appeared in Horrible Histories on the CBBC channel between 2009 and 2015. From 2013 to 2015, Hadland appeared as Trish in the ITV sitcom The Job Lot, set in a busy Jobcentre in the West Midlands.\n\nIn August 2024, Hadland was announced as a contestant for the twenty-second series of Strictly Come Dancing, partnering with Vito Coppola. The pair ultimately reached the final, finishing as runners-up behind Chris McCausland and his partner Dianne Buswell.",
        "birthday": "1971-05-15",
        "deathday": null,
        "gender": 1,
        "homepage": "https://www.unitedagents.co.uk/sarah-hadland-3",
        "id": 62961,
        "imdb_id": "nm0352864",
        "known_for_department": "Acting",
        "name": "Sarah Hadland",
        "place_of_birth": "St. Albans, Hertfordshire, England, UK ",
        "popularity": 0.3073,
        "profile_path": "/aVEhNxCplkThxE2flILB3YOoVPp.jpg"
    }
}