{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/dwN0kPGrLbFRxyL3F3J3t4ShQx.jpg",
                "genre_ids": [
                    878,
                    28,
                    12
                ],
                "id": 18,
                "original_language": "fr",
                "original_title": "Le Cinquième Élément",
                "overview": "In 2257, a taxi driver is unintentionally given the task of saving a young girl who is part of the key that will ensure the survival of humanity.",
                "popularity": 13.1619,
                "poster_path": "/fPtlCO1yQtnoLHOwKtWz7db6RGU.jpg",
                "release_date": "1997-05-02",
                "title": "The Fifth Element",
                "video": false,
                "vote_average": 7.558,
                "vote_count": 11203,
                "character": "Leeloo",
                "credit_id": "52fe420fc3a36847f8000b57",
                "order": 1
            },
            {
                "adult": false,
                "backdrop_path": "/lAaAtQ5b8iX9JeG6QUq4RM1paKD.jpg",
                "genre_ids": [
                    18
                ],
                "id": 10435,
                "original_language": "en",
                "original_title": "Chaplin",
                "overview": "An aged Charlie Chaplin narrates his life to his autobiography's editor, including his rise to wealth and comedic fame from poverty, his turbulent personal life and his run-ins with the FBI.",
                "popularity": 2.9824,
                "poster_path": "/Aeltt5tl02zrEj4GoMynHc94lWG.jpg",
                "release_date": "1992-12-17",
                "title": "Chaplin",
                "video": false,
                "vote_average": 7.438,
                "vote_count": 1131,
                "character": "Mildred Harris",
                "credit_id": "52fe43709251416c7501060b",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/jBz16NsAeKjpHNznl1EHlcr704P.jpg",
                "genre_ids": [
                    35,
                    18
                ],
                "id": 9571,
                "original_language": "en",
                "original_title": "Dazed and Confused",
                "overview": "The adventures of a group of Texas teens on their last day of school in 1976, centering on student Randall Floyd, who moves easily among stoners, jocks and geeks. Floyd is a star athlete, but he also likes smoking weed, which presents a conundrum when his football coach demands he sign a \"no drugs\" pledge.",
                "popularity": 2.9806,
                "poster_path": "/msG9awbLhVZwv1Eh9Ge7SofMexW.jpg",
                "release_date": "1993-09-24",
                "title": "Dazed and Confused",
                "video": false,
                "vote_average": 7.319,
                "vote_count": 2143,
                "character": "Michelle",
                "credit_id": "52fe450bc3a36847f80b925d",
                "order": 9
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Милиця Богданівна Йовович",
            "Milica Natasha Jovovich",
            "Milla Yovovich",
            "Milica Bogdanovna \"Milla\" Jovovich",
            "Milica Bogdanovna Jovovich",
            "Μίλιτσα Μπογκντάνοβνα Γιόβοβιτς",
            "Μίλιτσα Γιόβοβιτς",
            "Міла Йовович",
            "ミラ・ヨヴォヴィッチ"
        ],
        "biography": "Milla Jovovich (born December 17, 1975) is an American actress, supermodel, musician, and fashion designer of Ukrainian descent. She was born in Kiev, Ukrainian SSR, USSR. In essence, she began in a number of science fiction and action films, for which the music channel VH1 called her \"the reigning royal of strikes.\"\n\nShe has appeared on the cover of more than a hundred magazines, and has also starred in films such as The Fifth Element (1997), Ultraviolet (2006), and the 'Resident Evil' franchise. Jovovich began modeling at eleven, when Richard Avedon featured her in Revlon's \"Most Unforgettable Women in the World\" advertisements, and she continued her career with other campaigns for L'Oréal cosmetics, Banana Republic, Christian Dior, Donna Karan, and Versace.\n\nIn 1988, she had her first professional acting role in the television film The Night Train to Kathmandu, and later that year she appeared in her first feature film, Two Moon Junction. Following more small television appearances such as the \"Fair Exchange\" (1989) and a 1989 role as a French girl (she was 14 at the time then) on a Married with Children episode and film roles, she gained notoriety with the romance film Return to the Blue Lagoon (1991). She appeared in 1993's Dazed and Confused alongside Ben Affleck and Matthew McConaughey. Jovovich then acted alongside Bruce Willis in the science fiction film The Fifth Element (1997), and later played the title role in The Messenger: The Story of Joan of Arc (1999). In 2002, she starred in the video game adaptation Resident Evil, which spawned five sequels: Resident Evil: Apocalypse (2004), Resident Evil: Extinction (2007), Resident Evil: Afterlife (2010), Resident Evil: Retribution (2012) and Resident Evil: The Final Chapter (2016).\n\nIn addition to her modelling and acting career, Jovovich released a music album, The Divine Comedy in 1994. She continues to release demos for other songs on her official website and contributes to film soundtracks as well; Jovovich has yet to release another album. In 2003, she and model Carmen Hawk created the clothing line Jovovich-Hawk, which ceased operations in early 2008. In its third season prior to its demise, the pieces could be found at Fred Segal in Los Angeles, Harvey Nichols, and over 50 stores around the world.",
        "birthday": "1975-12-17",
        "deathday": null,
        "gender": 1,
        "homepage": "http://www.millaj.com",
        "id": 63,
        "imdb_id": "nm0000170",
        "known_for_department": "Acting",
        "name": "Milla Jovovich",
        "place_of_birth": "Kyiv, Ukrainian SSR, USSR [now Ukraine]",
        "popularity": 2.7207,
        "profile_path": "/iZB7lLIhXMLnEjVwC7ZGp9PFfrR.jpg"
    }
}