{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/6P6YdvJsAZlUZKipA86rbfjfKzD.jpg",
                "genre_ids": [
                    18,
                    10749,
                    35
                ],
                "id": 113947,
                "original_language": "en",
                "original_title": "The Sessions",
                "overview": "Though a childhood bout with polio left him dependent on an iron lung, Mark O'Brien maintains a career as a journalist and poet. A writing assignment dealing with sex and the disabled piques Mark's curiosity, and he decides to investigate the possibility of experiencing sex himself. When his overtures toward a caregiver scare her away, he books an appointment with sex surrogate Cheryl Cohen-Greene to lose his virginity.",
                "popularity": 2.2461,
                "poster_path": "/57o1DBc5DfJXVc8wArAblSbZ8sD.jpg",
                "release_date": "2012-05-02",
                "title": "The Sessions",
                "video": false,
                "vote_average": 6.894,
                "vote_count": 575,
                "character": "Pill Nurse",
                "credit_id": "6721ac22180b0a5ab90c1196",
                "order": 23
            }
        ],
        "crew": []
    },
    "details": {
        "adult": true,
        "also_known_as": [
            "Gina-Raye Swensson",
            "Ray Vaness\t",
            "Britney Noel\t",
            "Karen Swaim\t",
            "Raveness\t",
            "Ray Veness\t",
            "Rayveness\t",
            "RayVeness",
            "吉娜·雷·卡特",
            "雷文尼斯",
            "Britni Noel",
            "Mrs Rayvaness",
            "Raveness",
            "Ray Veness",
            "Brittney Noel"
        ],
        "biography": "Gina-Raye Carter is an American actress, singer, songwriter and dancer born and raised in High Point, North Carolina. She started out in the adult film  industry by making a homemade sex tape at eighteen. She moved to Los Angeles, California in 1997 to pursue a career in music and acting. Her first break in the industry came in 2001 when she was given spoken lines while working as an extra on a episode of NYPD Blue directed Robert J. Doherty. Soon after, she was cast as  Lynda Bird Johnson in HBO's political film, Path to War. She returned to the adult film industry in 2003. In 2004, she completed a Songwriting Certificate from UCLA Extension, and started releasing her own singles.",
        "birthday": "1972-06-13",
        "deathday": null,
        "gender": 1,
        "homepage": null,
        "id": 63213,
        "imdb_id": "nm0713557",
        "known_for_department": "Acting",
        "name": "Gina-Raye Carter",
        "place_of_birth": "High Point, North Carolina, USA",
        "popularity": 0.983,
        "profile_path": "/Lx0apMbmZwpYKg2rEKhqKdF6eC.jpg"
    }
}