{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/pdSSDEVXjE5DZxFdX3kpjZywNrv.jpg",
                "genre_ids": [
                    18,
                    35,
                    10749
                ],
                "id": 12225,
                "original_language": "en",
                "original_title": "Cashback",
                "overview": "After a painful breakup, Ben develops insomnia. To kill time, he starts working the late night shift at the local supermarket, where his artistic imagination runs wild.",
                "popularity": 3.3185,
                "poster_path": "/9KlMglIBYxreQTEXxHJWiSrYPD2.jpg",
                "release_date": "2007-01-17",
                "title": "Cashback",
                "video": false,
                "vote_average": 6.961,
                "vote_count": 1313,
                "character": "Sean Higgins",
                "credit_id": "52fe44cd9251416c750417d7",
                "order": 2
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "​From Wikipedia, the free encyclopedia.  \n\nShaun Evans (born 6 March 1980 in Liverpool) is an English actor.\n\nEvans completed a course with the National Youth Theatre before relocating to London at the age of eighteen  to study at the Guildhall School of Music and Drama. His first major role was that of gay French teacher John Paul Keating in the Channel 4 comedy-drama Teachers during its second series in 2002. The following year he made his feature film debut in The Boys from County Clare, starring alongside Bernard Hill, Colm Meaney and Andrea Corr. Additional screen credits include Being Julia, The Situation, Cashback, Gone, Boy A (film), Telstar, Princess Ka'iulani and Clive Barker's horror, Dread.\n\nOn television, Evans was featured in the 2002 docudrama The Project and was seen as the Earl of Southampton in the miniseries The Virgin Queen, which premiered in November 2005 on Masterpiece Theatre on PBS in the US before airing on the BBC in January 2006. His stage work includes a UK tour of the award-winning play Blue/Orange by Joe Penhall. Recent television appearances include, Murder City, BBC's Ashes to Ashes, Gentley's Last Stand and four-part drama The Take from the novel by Martina Cole on Sky1. Evans also starred in Sparkle alongside Bob Hoskins and Stockard Channing (2007).\n\nEvans has just finished appearing in the new Roy Smiles play Kurt and Sid, at the Trafalgar Studios, London playing Nirvana singer Kurt Cobain, opposite Danny Dyer who was playing Sex Pistols bassist Sid Vicious.\n\nDescription above from the Wikipedia article Shaun Evans licensed under CC-BY-SA, full list of contributors on Wikipedia.",
        "birthday": "1980-03-06",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 63311,
        "imdb_id": "nm1140345",
        "known_for_department": "Acting",
        "name": "Shaun Evans",
        "place_of_birth": " Liverpool, Merseyside, England, UK",
        "popularity": 0.4545,
        "profile_path": "/fqEw8H5VRN2SyV8QMT9toHEYDpl.jpg"
    }
}