{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/2wS8pMZgvzq7kaZb5LHX54poQnA.jpg",
                "genre_ids": [
                    18,
                    27
                ],
                "id": 381283,
                "original_language": "en",
                "original_title": "mother!",
                "overview": "A couple's relationship is tested when uninvited guests arrive at their home, disrupting their tranquil existence.",
                "popularity": 5.2547,
                "poster_path": "/fjny9chXPx69ln1LMJxbwi5yHMt.jpg",
                "release_date": "2017-09-13",
                "title": "mother!",
                "video": false,
                "vote_average": 6.967,
                "vote_count": 6867,
                "character": "Younger Brother",
                "credit_id": "58e5111292514179de021e98",
                "order": 4
            },
            {
                "adult": false,
                "backdrop_path": "/vpRMzPqHC03I7hPPET4Av2OT8dI.jpg",
                "genre_ids": [
                    18,
                    10749
                ],
                "id": 400617,
                "original_language": "en",
                "original_title": "Phantom Thread",
                "overview": "In 1950s London, a renowned dressmaker's meticulous lifestyle begins drastically changing as his relationship with his young muse intensifies.",
                "popularity": 5.3289,
                "poster_path": "/hgoWjp9Sh0MI97eAMZCnIoVfgvq.jpg",
                "release_date": "2017-12-25",
                "title": "Phantom Thread",
                "video": false,
                "vote_average": 7.311,
                "vote_count": 3604,
                "character": "Dr. Robert Hardy",
                "credit_id": "5a1ee0a20e0a264cbc07fced",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [],
        "biography": "Brian Gleeson is an Irish actor. Gleeson was born in Dublin, the son of actor Brendan Gleeson and his wife Mary (Weldon). He is the brother of actor Domhnall Gleeson and writer Rúairí Gleeson. He grew up in Malahide, Dublin. As a child, he appeared in school plays, before joining the Gaiety's Youth Theatre Company.  Gleeson started acting in 2006, first appearing alongside his father in The Tiger's Tail directed by John Boorman, which was filmed the year he completed the Leaving Certificate. In 2010, Gleeson appeared as Hughie in the first season of Love/Hate, and earned a nomination for an Irish Film and Television Award for Best Actor in a Supporting Role (Television) for the role. He also appeared in the Hollywood film The Eagle. He appeared in the 2012 Academy Award nominated film Snow White and the Huntsman. Gleeson portrayed the lead role in Standby opposite Jessica Paré in 2014. The same year, he filmed Tiger Raid, an Iraq War drama; it was released in 2016. Along with his father Brendan and brother Domhnall, Gleeson appeared in the Enda Walsh play The Walworth Farce in early 2015. He starred as Jimmy in the 2016 Irish drama series Rebellion, based on the 1916 Easter Rising.",
        "birthday": "1987-11-14",
        "deathday": null,
        "gender": 2,
        "homepage": null,
        "id": 63364,
        "imdb_id": "nm2244852",
        "known_for_department": "Acting",
        "name": "Brian Gleeson",
        "place_of_birth": "Dublin, Ireland",
        "popularity": 0.1856,
        "profile_path": "/x9uykZetcMYmB6UpQY29ApPedth.jpg"
    }
}