{
    "movies": {
        "cast": [
            {
                "adult": false,
                "backdrop_path": "/qDcLJIeg2z1oMtAWs9qFLeJVJ6E.jpg",
                "genre_ids": [
                    28,
                    53,
                    80,
                    18
                ],
                "id": 11636,
                "original_language": "cn",
                "original_title": "新警察故事",
                "overview": "Sent into a drunken tailspin when his entire unit is killed by a gang of thrill-seeking punks, disgraced Hong Kong police inspector Wing needs help from his new rookie partner, with a troubled past of his own, to climb out of the bottle and track down the gang and its ruthless leader.",
                "popularity": 5.5704,
                "poster_path": "/kWUTyIao0b8DxVrO6L0LnpJVYWV.jpg",
                "release_date": "2004-09-23",
                "title": "New Police Story",
                "video": false,
                "vote_average": 7.162,
                "vote_count": 766,
                "character": "Tin Tin Law",
                "credit_id": "52fe446d9251416c75034651",
                "order": 5
            }
        ],
        "crew": []
    },
    "details": {
        "adult": false,
        "also_known_as": [
            "Andy On Chi-Kit",
            "安志杰",
            "The Onimal",
            "안지걸",
            "An Chí Kiệt",
            "Andy On",
            " On Chi-Kit",
            "Andy Tien",
            "اندی آن چی-کیت"
        ],
        "biography": "Andy On Chi-Kit (Cantonese: 安志傑) (born 11 May 1977 in Providence, Rhode Island, United States) is a Chinese American actor and martial artist.\n\nHe was born Andy Tien and as a child, he idolized Jackie Chan and would perform back flips and attempt to do martial arts in his backyard. While working as a bartender, someone suggested he go to Hong Kong to pursue a film career. Tien would leave and was discovered by Charles Heung and Tsui Hark, who cast Tien and gave him the new name \"On Chi-Kit\". Andy scored the titular role in Black Mask 2: City of Masks. To prepare for the role, On went to Shaolin Temple to train in wushu for a month.  Andy is a practitioner of kickboxing and Wing Chun Kung Fu under friend and fellow actor Philip Ng. He is married to Jessica Cambensy, whom he met on the set of Zombie Fight Club. The couple have two children, daughter Tessa and son Elvis.  Description above from the Wikipedia article Andy On, licensed under CC-BY-SA,full list of contributors on Wikipedia.",
        "birthday": "1977-05-11",
        "deathday": null,
        "gender": 2,
        "homepage": "http://www.alivenotdead.com/andyon",
        "id": 63585,
        "imdb_id": "nm0648499",
        "known_for_department": "Acting",
        "name": "Andy On",
        "place_of_birth": "Providence, Rhode Island, USA",
        "popularity": 1.6014,
        "profile_path": "/zbH0l4V3QJdvkLKPhBr5EB5JWnB.jpg"
    }
}